{
    "Symbol": "20MICRONS",
    "ISIN": "INE144J01027",
    "News": [
        {
            "Title": "20 Microns Plans ₹1 Billion Expansion Drive",
            "Summary": "20 Microns announces ambitious ₹1 billion expansion plan targeting over 20% market share by 2030, signaling significant growth strategy for the specialty chemicals company.",
            "Sentiment": "positive",
            "PublishDate": 1770294736198,
            "Source": "stocks"
        },
        {
            "Title": "20 Microns postal ballot notice dispatched for special business",
            "Summary": "20 Microns Limited dispatched postal ballot notice on February 3, 2026, seeking member approval for advancing loans up to ₹50 crores to entities with director interest and appointing Ms. Vedika Parikh as Strategy & Transformation Associate with annual remuneration up to ₹50 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1770105210691,
            "Source": "stocks"
        },
        {
            "Title": "20 Microns Q3FY26 Results: Profit Rises 36.6% YoY",
            "Summary": "20 Microns Limited reported standalone net profit of ₹1,374.96 lakhs for Q3FY26, up 36.6% YoY. Revenue from operations grew marginally to ₹18,667.55 lakhs. Board approved loan guarantees up to ₹50 crores.",
            "Sentiment": "positive",
            "PublishDate": 1769253427399,
            "Source": "co_actions_results"
        },
        {
            "Title": "20 Microns Reports Q2 FY26 Results with 5.5% PAT Growth Despite Revenue Decline",
            "Summary": "20 Microns Limited reported quarterly results for the period ended September 30, 2025. The company posted consolidated revenue of ₹2,307.8 million, down 3.9% year-on-year, impacted by headwinds from the paint industry due to extended monsoons and delayed festive season. However, profit after tax (PAT) grew 5.5% to ₹173.5 million, while EBITDA margins improved to 13.8% from 12.8% in the previous quarter, driven by cost efficiencies. Earnings per share increased to ₹4.92 from ₹4.65 in the same quarter last year. The paints segment contributed 48% of revenue, followed by plastics at 25% and rubber at 9%. Management expects demand recovery in the second half of FY26 driven by festive and wedding seasons. The company participated in international exhibitions including K Fair 2025 in Düsseldorf to strengthen global presence and has upcoming participation in domestic trade shows including Plastindia 2026, Paintindia 2026, and India Rubber Expo 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1762827985705,
            "Source": "earnings"
        },
        {
            "Title": "20 Microns Limited Reports Quarterly Results and Approves Malaysian Subsidiary Acquisition",
            "Summary": "20 Microns Limited's Board approved unaudited financial results for the quarter and half-year ended September 30, 2025. The company also approved the acquisition of 14 equity shares of its Malaysian subsidiary, 20 Microns (Malaysia) Sdn. Bhd., from minority shareholder Mr. Krishnaji Rao for MYR 14. This acquisition will increase the company's shareholding from 99.9987% to 100%, making it a wholly-owned subsidiary. The transaction aims to enable complete ownership, effective control, faster decision-making, and strategic operational synergies. One equity share will continue to be held by Mr. Rao as a nominee to comply with Malaysian statutory requirements. The Malaysian subsidiary is engaged in extraction and processing of high-purity minerals, including acquisition, exploration, development, and operation of quarries and metalliferous lands.",
            "Sentiment": "positive",
            "PublishDate": 1762519344109,
            "Source": "earnings"
        },
        {
            "Title": "20 Microns Reports Mixed Q2 Results with Profit Growth Despite Revenue Decline",
            "Summary": "20 Microns reported quarterly consolidated net profit of 174 million rupees compared to 164 million rupees in the same period last year. Revenue declined to 2.31 billion rupees from 2.4 billion rupees year-over-year. EBITDA increased to 322 million rupees from 308 million rupees, while EBITDA margin improved to 13.96% from 12.82% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762517954984,
            "Source": "earnings"
        },
        {
            "Title": "20 Microns Reports 9.1% QoQ Revenue Growth in Q1 FY26 with Strong Performance Across Segments",
            "Summary": "20 Microns Limited reported total income of ₹2,482.6 million for Q1 FY26, representing 9.1% quarter-on-quarter growth and 6.8% year-on-year growth. The company's profit after tax increased 10.8% QoQ to ₹168.6 million, while earnings per share rose to ₹4.7 from ₹4.3 in the previous quarter. EBITDA reached ₹317.5 million with a margin of 12.8%. The paints segment contributed 48% of total revenue, while plastics and rubber segments accounted for 25% and recorded double-digit growth respectively. The company operationalized its Malaysian mining asset during the quarter and continued export growth in Southeast Asia and Latin America. Management expressed confidence in achieving 13-15% revenue growth guidance for FY26 despite freight cost pressures from volatile global markets and geopolitical tensions.",
            "Sentiment": "positive",
            "PublishDate": 1754052701200,
            "Source": "earnings"
        },
        {
            "Title": "20 Microns Reports Q1 EBITDA Growth to 328M Rupees Despite Margin Decline",
            "Summary": "20 Microns reported Q1 EBITDA of 328 million rupees compared to 318 million rupees in the same period last year, representing year-over-year growth. However, the company's EBITDA margin decreased to 12.85% from 13.01% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1753698545620,
            "Source": "earnings"
        },
        {
            "Title": "20 Microns Reports Mixed Q1 Results with Revenue Growth but Lower Profit",
            "Summary": "20 Microns reported quarterly consolidated net profit of 169 million rupees compared to 179 million rupees in the same period last year, representing a decline. However, the company's revenue increased to 2.47 billion rupees from 2.31 billion rupees year-over-year, showing growth in the top line despite the profit decline.",
            "Sentiment": "neutral",
            "PublishDate": 1753698207643,
            "Source": "earnings"
        },
        {
            "Title": "20 Microns Limited Schedules Board Meeting for July 28 to Approve Quarterly Financial Results",
            "Summary": "20 Microns Limited has scheduled a Board of Directors meeting for July 28, 2025 to consider and approve unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company has implemented a trading window closure for designated persons from July 1, 2025, which will reopen 48 hours after the results become publicly available. The meeting notice was communicated to BSE and NSE on July 21, 2025 by Company Secretary Komal Pandey.",
            "Sentiment": "neutral",
            "PublishDate": 1753102473622,
            "Source": "corporate_action"
        },
        {
            "Title": "Dolly Khanna Increases Stake in 20 Microns",
            "Summary": "Investor Dolly Khanna has increased her stake in 20 Microns by 0.28% during the first quarter. No specific fiscal year or additional details were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752582487000,
            "Source": "default"
        },
        {
            "Title": "20 Microns Reports Q4 Results and Recommends Final Dividend",
            "Summary": "20 Microns has announced its Q4 financial results and dividend recommendation. The company's Q4 consolidated net profit increased to 152.2 million rupees from 136.4 million rupees year-over-year. Revenue rose to 2.27 billion rupees from 2.12 billion rupees in the same period last year. EBITDA grew to 289.8 million rupees, up from 265.4 million rupees, with the EBITDA margin improving slightly to 12.74% from 12.5%. The company has recommended a final dividend of 1.25 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747999471000,
            "Source": "result"
        },
        {
            "Title": "20 Microns' Subsidiary Receives DSIR Recognition for R&D Unit",
            "Summary": "A subsidiary of 20 Microns has received recognition from the Department of Scientific and Industrial Research (DSIR) for its Research and Development unit. No further details about the subsidiary or the specific nature of the R&D unit were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747396497000,
            "Source": "default"
        },
        {
            "Title": "20 Microns: Q3 Profit Rises 12.28% YoY, Revenue Up 22.73%",
            "Summary": "20 Microns reported Q3 FY25 results with profit at ₹12.89 crore, up 12.28% YoY. Revenue increased 22.73% YoY to ₹214.65 crore. However, QoQ performance declined with revenue down 10.63% and profit falling 21.45%. EPS stood at ₹3.85, up 18.46% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1737695902000,
            "Source": "earnings"
        },
        {
            "Title": "20 Microns Reports Increased Q3 Profit and Revenue",
            "Summary": "20 Microns, a company specializing in industrial minerals and specialty chemicals, has reported its Q3 financial results. The consolidated net profit increased to 129 million rupees from 115 million rupees in the same quarter last year. Revenue also saw growth, rising to 2.15 billion rupees from 1.75 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1737591224000,
            "Source": "earnings"
        },
        {
            "Title": "20 Microns Reports Q3 EBITDA Growth",
            "Summary": "20 Microns, a company in the industrial minerals sector, has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 262 million rupees, up from 222 million rupees in the same quarter of the previous year. However, the EBITDA margin slightly decreased to 12.22% from 12.72% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1737543573000,
            "Source": "earnings"
        },
        {
            "Title": "20 Microns Reports Increased Q3 Profit and Revenue",
            "Summary": "20 Microns, a company specializing in industrial minerals and specialty chemicals, has announced its financial results for the third quarter. The company reported a consolidated net profit of 129 million rupees, up from 115 million rupees in the same period last year. Revenue also saw growth, reaching 2.15 billion rupees compared to 1.75 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737543567000,
            "Source": "earnings"
        },
        {
            "Title": "20 Microns Updates Acquisition Plans for Malaysian Companies",
            "Summary": "20 Microns has announced changes to its acquisition plans for two Malaysian companies. 20 Microns SDN BHD will now acquire a 90% stake in Goh Teik Lim Quarry SDN BHD, and 86.68% shares of IQ Marbles SDN BHD. This represents an update to previously announced acquisition plans.",
            "Sentiment": "neutral",
            "PublishDate": 1732278072000,
            "Source": "corporate_action"
        },
        {
            "Title": "20 Microns Reports Q2 Financial Results",
            "Summary": "20 Microns, a company in the micronized minerals and speciality chemicals sector, has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 is 308 million rupees, compared to 305 million rupees in the same quarter last year, showing a slight increase. However, the EBITDA margin has decreased from 15.29% to 12.83% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1729859003000,
            "Source": "result"
        },
        {
            "Title": "20 Microns Reports Q2 Revenue Growth",
            "Summary": "20 Microns, a company specializing in industrial minerals and specialty chemicals, has reported its second quarter revenue for the current fiscal year. The company's revenue increased to 2.4 billion rupees, up from 1.99 billion rupees in the same quarter of the previous year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1729858994000,
            "Source": "result"
        },
        {
            "Title": "20 Microns Reports Q2 Consolidated Net Profit",
            "Summary": "20 Microns, a company, has reported its second quarter consolidated net profit. The profit stands at 164 million rupees, compared to 160 million rupees year-over-year (YOY) and 178.5 million rupees quarter-over-quarter (QOQ).",
            "Sentiment": "neutral",
            "PublishDate": 1729858984000,
            "Source": "result"
        },
        {
            "Title": "Dolly Khanna Acquires 1.29% Stake in 20 Microns",
            "Summary": "<p>Investor <span class='neutral'>Dolly Khanna</span> has appeared in the <span class='neutral'>shareholding pattern</span> of <b>20 Microns</b>, holding a <span class='positive'>1.29% stake</span> in the company as of <span class='neutral'>Q2</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728998163000,
            "Source": "normal_news"
        },
        {
            "Title": "20 Microns Acquires Shares in Malaysian Subsidiary",
            "Summary": "<p>20 Microns has <span class='positive'>acquired</span> shares in its <span class='neutral'>subsidiary</span>, 20 Microns SDN BHD, located in <b>Malaysia</b>. The <span class='neutral'>cost</span> of this acquisition is approximately <span class='neutral'>RM 12 million</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727964484000,
            "Source": "corporate_action"
        }
    ]
}