{
    "Symbol": "21STCENMGM",
    "ISIN": "INE253B01015",
    "News": [
        {
            "Title": "Twentyfirst Century Management Q3 FY26 Results",
            "Summary": "Twentyfirst Century Management Services reports Q3 FY26 results with standalone net loss of Rs 518.27 lacs and consolidated net loss of Rs 560.61 lacs for quarter ended December 31, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1770455900536,
            "Source": "co_actions_results"
        },
        {
            "Title": "21st Century Management Board Meet on Feb 5, 2026",
            "Summary": "Twentyfirst Century Management Services Limited has scheduled a board meeting for February 5, 2026, to consider Q3FY26 unaudited financial results. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769588814045,
            "Source": "co_actions_results"
        },
        {
            "Title": "Twentyfirst Century Management Services Reports Quarterly Results with Mixed Performance",
            "Summary": "Twentyfirst Century Management Services Limited announced its quarterly results for the quarter ended June 30, 2025. On a standalone basis, the company reported income from operations of Rs 286.86 lakhs compared to a loss of Rs 802.74 lakhs in the previous quarter and Rs 1,442.97 lakhs in the same quarter last year. The company posted a profit of Rs 238.47 lakhs for the quarter, a significant improvement from the loss of Rs 1,074.53 lakhs in the previous quarter. However, other comprehensive income was negative at Rs 701.60 lakhs, resulting in total comprehensive loss of Rs 463.13 lakhs. On a consolidated basis, including subsidiary Twentyfirst Century Shares & Securities Limited, income from operations was Rs 332.86 lakhs with profit of Rs 231.48 lakhs. The company operates solely in capital market operations, focusing on trading and investments in equity shares. Basic and diluted earnings per share stood at Rs 2.27 for standalone results and Rs 2.20 for consolidated results.",
            "Sentiment": "neutral",
            "PublishDate": 1753789665610,
            "Source": "earnings"
        }
    ]
}