{
    "Symbol": "360ONE",
    "ISIN": "INE466L01038",
    "News": [
        {
            "Title": "360 ONE WAM Block Trade Worth Rs. 30.66 Crores",
            "Summary": "360 ONE WAM Ltd. witnessed a significant block trade on NSE worth Rs. 30.66 crores involving approximately 270,674 shares at Rs. 1132.90 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769576639284,
            "Source": "co_actions_results"
        },
        {
            "Title": "360 ONE WAM Ltd. Records Rs. 44.49 Cr Block Trade",
            "Summary": "360 ONE WAM Ltd. witnessed a significant block trade on NSE worth Rs. 44.49 crores involving approximately 400,391 shares at Rs. 1111.10 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769488282131,
            "Source": "co_actions_results"
        },
        {
            "Title": "360 ONE WAM Allots 2.61 Lakh Shares Under ESOP",
            "Summary": "360 ONE WAM Limited allotted 2,61,596 equity shares to employees under ESOP scheme, increasing paid-up capital from ₹40.53 crores to ₹40.55 crores on January 23, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769154818358,
            "Source": "co_actions_results"
        },
        {
            "Title": "360 ONE WAM clarifies media report on defence fund",
            "Summary": "360 ONE WAM Limited clarifies that it did not issue any press release regarding a ₹1,000 crore defence and spacetech fund, stating the fund is part of routine AIF business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1769001429010,
            "Source": "stocks"
        },
        {
            "Title": "360 ONE WAM Schedules Six Investor Conferences",
            "Summary": "360 ONE WAM Limited announces participation in six major investor conferences from January 22 to February 25, 2026, including Goldman Sachs Asia Financials Day and ICICI Securities Annual Conference.",
            "Sentiment": "neutral",
            "PublishDate": 1768576105200,
            "Source": "stocks"
        },
        {
            "Title": "360 ONE WAM Targets 45-46% Cost-to-Income Ratio",
            "Summary": "360 ONE WAM aims to reduce its cost-to-income ratio to 45-46% next year from current 48.2-48.3%, driven by ET Money and HNI business nearing breakeven plus core business productivity gains.",
            "Sentiment": "positive",
            "PublishDate": 1768534278699,
            "Source": "stocks"
        },
        {
            "Title": "360 ONE WAM Sets Ambitious Growth Targets for FY25",
            "Summary": "360 ONE WAM targets 22-24% annual AUM growth with net flows of 10-12% of closing AUM. Company aims for 16-18% revenue growth and 22-24% profit growth, projecting PAT of ₹1,800-2,100 crores by April 2025.",
            "Sentiment": "positive",
            "PublishDate": 1768534246576,
            "Source": "stocks"
        },
        {
            "Title": "360 ONE WAM submits Q3FY26 monitoring agency reports",
            "Summary": "360 ONE WAM Limited filed monitoring agency reports for Q3FY26 covering two preferential issues worth ₹391.59 crores and ₹2,111.80 crores. No funds were utilized during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1768487613364,
            "Source": "stocks"
        },
        {
            "Title": "360 ONE WAM Q3 Net Profit Jumps 20.3% to ₹331 Cr",
            "Summary": "360 ONE WAM reports Q3 net profit of ₹331 crore, up 20.3% YoY, with revenue rising 21.8% to ₹826 crore driven by strong ARR AUM growth across wealth and asset management segments.",
            "Sentiment": "positive",
            "PublishDate": 1768479417453,
            "Source": "co_actions_results"
        },
        {
            "Title": "360 ONE WAM Block Trade Worth ₹18.05 Crores on NSE",
            "Summary": "360 ONE WAM Ltd. witnessed a significant block trade on NSE involving 153,080 shares valued at ₹18.05 crores, executed at ₹1,179.20 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767776129467,
            "Source": "co_actions_results"
        },
        {
            "Title": "360 ONE WAM Q3FY26 results show strong growth momentum",
            "Summary": "360 ONE WAM Limited reports 33.2% YoY revenue growth to ₹806 crores in Q3FY26, with PAT rising 20.3% to ₹331 crores. ARR AUM expanded 28.2% YoY to ₹3.18 lakh crores.",
            "Sentiment": "positive",
            "PublishDate": 1767618860738,
            "Source": "co_actions_results"
        },
        {
            "Title": "360 ONE WAM Grants 35.28 Lakh ESOPs to Employees",
            "Summary": "360 ONE WAM Limited's board committee approved grant of 35,27,736 employee stock options under two series with Re. 1 exercise price and performance-based vesting criteria spanning 2-6 years.",
            "Sentiment": "positive",
            "PublishDate": 1766579243409,
            "Source": "co_actions_results"
        },
        {
            "Title": "360 ONE WAM Sets Up New Subsidiary in GIFT City",
            "Summary": "360 ONE WAM Limited has established a new wholly owned subsidiary, '360 ONE Global Asset Management (IFSC) Limited', in GIFT City to expand its asset management operations.",
            "Sentiment": "positive",
            "PublishDate": 1766578606748,
            "Source": "stocks"
        },
        {
            "Title": "360 ONE WAM Sees Rs. 125.85 Crore Block Trade on NSE",
            "Summary": "360 ONE WAM Ltd. witnessed a significant block trade worth Rs. 125.85 crores involving approximately 1,120,099 shares executed at Rs. 1,123.60 per share on NSE. The large-volume transaction indicates substantial institutional or bulk investor activity in the wealth management company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1765268623460,
            "Source": "order&deals"
        },
        {
            "Title": "360 ONE WAM Limited Shareholders Approve Three Employee Stock Option Schemes Through Postal Ballot",
            "Summary": "360 ONE WAM Limited shareholders approved three Employee Stock Option Schemes 2025 (Series 1 and Series 2) for company and subsidiary employees through postal ballot voting that concluded on November 29, 2025. All three resolutions passed with requisite majority, with voting results showing approval rates ranging from 89.31% to 89.77% across the different schemes.",
            "Sentiment": "positive",
            "PublishDate": 1764574179164,
            "Source": "corporate_action"
        },
        {
            "Title": "360 ONE WAM Limited Allots 87,391 Equity Shares Under ESOP Exercise",
            "Summary": "360 ONE WAM Limited's Nomination and Remuneration Committee allotted 87,391 equity shares of face value Re. 1 each to employees upon exercise of stock options under the company's Employee Stock Options Scheme. The allotment increased the company's paid-up share capital from Rs. 40,49,70,337 to Rs. 40,50,57,728, comprising 40,50,57,728 equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763990730823,
            "Source": "corporate_action"
        },
        {
            "Title": "360 One WAM Unit Approves New Subsidiary for Gift City Fund Management",
            "Summary": "360 One WAM's unit board has approved the incorporation of a wholly-owned subsidiary dedicated to fund management operations in Gift City. This strategic move positions the company to expand its asset management capabilities in India's international financial services center.",
            "Sentiment": "positive",
            "PublishDate": 1763679202795,
            "Source": "corporate_action"
        },
        {
            "Title": "360 ONE WAM Partners With UBS AG For Client Referrals And Wealth Management Cooperation",
            "Summary": "360 ONE WAM has entered into a partnership with UBS AG focused on client referrals and wealth management cooperation. The collaboration aims to enhance wealth management services through the combined expertise of both financial institutions.",
            "Sentiment": "positive",
            "PublishDate": 1762265458058,
            "Source": "order&deals"
        },
        {
            "Title": "360 ONE WAM Reports Record Quarterly Profit of ₹316 Crores, Declares ₹6 Interim Dividend",
            "Summary": "360 ONE WAM achieved its highest quarterly profit at ₹316 crores, up 28% year-on-year. Total ARR AUM increased 22% to ₹2,95,000 crores with Wealth ARR AUM crossing ₹2 lakh crores. The company recorded strong net flows of ₹32,132 crores in H1 FY26, with Q2 flows at ₹8,734 crores excluding UBS. ARR revenue grew 39.4% to ₹554 crores, while total revenue increased 32% to ₹813 crores. The Board approved a second interim dividend of ₹6 per share. UBS business transfer brought over ₹5,200 crores of AUM from 80+ UHNI families. The HNI business expansion added 50+ RMs and 380+ clients across 10 locations. B&K acquisition integration is progressing well with synergies being realized. The company also allotted 2,09,895 equity shares under ESOP schemes, increasing paid-up capital to ₹40,49,70,337.",
            "Sentiment": "positive",
            "PublishDate": 1761309034927,
            "Source": "earnings"
        },
        {
            "Title": "360 ONE WAM Acquires Over INR 5,200 Crores AUM from UBS India Business",
            "Summary": "360 ONE WAM acquired over INR 5,200 crores in assets under management from UBS India's business through 80+ ultra high net worth families. The company reports steady gross flows in equities and alternatives with strong new products expected in coming quarters. 360 ONE WAM projects its cost-to-income ratio will rise to 47-48% by Q3/Q4 FY25 and 46-47% in the following year. The company expects quarterly net flows between INR 8,000-10,000 crores, with 75% from wealth management and 25% from asset management. Annual transaction income growth is predicted at 10-15%, targeting INR 900-1200 crores. Net flows are expected to be 10-12% of initial AUM.",
            "Sentiment": "positive",
            "PublishDate": 1760930958768,
            "Source": "order&deals"
        },
        {
            "Title": "360 ONE Targets AUM Growth Beyond ₹5 Lakh Crore Through Multi-Asset Platforms and AI Advisory",
            "Summary": "360 ONE has set a target to grow its assets under management (AUM) beyond ₹5 lakh crore. The company plans to achieve this growth through scalable multi-asset platforms, AI-driven advisory services, and maintaining strong margin retention in its ultra-wealth and alternatives business segments.",
            "Sentiment": "positive",
            "PublishDate": 1760718063576,
            "Source": "stock"
        },
        {
            "Title": "360 ONE WAM Reports 27.7% Jump in Q2 Profit, Declares Rs 6 Interim Dividend",
            "Summary": "360 ONE WAM Limited reported strong quarterly results with profit after tax rising 27.7% year-on-year to Rs 316 crore for Q2 FY2025-26. Total revenue increased 31.5% to Rs 813 crore, driven by growth in annual recurring revenue which jumped 39.4% to Rs 554 crore. The company's overall assets under management reached Rs 6,71,625 crore as of September 2025, with ARR AUM growing 21.7% to Rs 2,95,324 crore. The board approved a second interim dividend of Rs 6 per share with record date set for October 27, 2025. The company completed its strategic collaboration with UBS AG on September 29, 2025, with UBS subscribing to convertible warrants representing a 4.95% stake. MD & CEO Karan Bhagat noted positive business momentum across all segments despite challenging market conditions, with the UBS integration outlook remaining encouraging.",
            "Sentiment": "positive",
            "PublishDate": 1760695512581,
            "Source": "corporate_action"
        },
        {
            "Title": "360 ONE WAM Completes Business Deals With Credit Suisse And UBS",
            "Summary": "360 ONE WAM has completed business deals with Credit Suisse and UBS after receiving necessary approvals. The transactions have been finalized between the wealth management company and the two global financial institutions.",
            "Sentiment": "positive",
            "PublishDate": 1759153408319,
            "Source": "order&deals"
        },
        {
            "Title": "NCLT Approves Merger of 360 ONE WAM's Two Wholly-Owned Subsidiaries",
            "Summary": "The National Company Law Tribunal (NCLT) Mumbai Bench approved the amalgamation scheme between MAVM Angels Network Private Limited and 360 ONE Distribution Services Limited, both wholly-owned subsidiaries of 360 ONE WAM LIMITED. The approval order was dated September 9, 2025, with certified copies received on September 23, 2025. The merger will become effective once filed with the Registrar of Companies, Mumbai. Under the scheme, MAVM will be amalgamated into 360 ONE Distribution Services Limited, and DSL will issue one equity share with face value of Rs. 100 each to 360 ONE WAM for every MAVM share with face value of Rs. 10 held by the parent company.",
            "Sentiment": "neutral",
            "PublishDate": 1758636856940,
            "Source": "corporate_action"
        },
        {
            "Title": "360 ONE WAM Limited Completes Transfer and Assignment Agreement with UBS Entities",
            "Summary": "360 ONE WAM Limited has completed the consummation of a Transfer and Assignment Agreement with UBS Finance India Private Limited, 360 ONE Prime Limited, and UBS AG. The agreement was originally executed on April 22, 2025, with amendments made on August 13, 2025, and was finalized on August 18, 2025. The completion followed receipt of necessary regulatory approvals and fulfillment of conditions outlined in the agreement. 360 ONE Prime Limited is identified as a wholly owned subsidiary of 360 ONE WAM Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1755536796169,
            "Source": "order&deals"
        },
        {
            "Title": "360 ONE Asset Management Receives SEBI Approval to Launch Specialized Investment Fund",
            "Summary": "360 ONE Asset Management Limited, a wholly owned subsidiary of 360 ONE WAM LIMITED, has received approval from SEBI to establish a Specialized Investment Fund (SIF) under SEBI (Mutual Funds) Regulations, 1996. The approval was granted through a letter dated August 13, 2025. Under this SIF framework, 360 ONE AMC will launch a Specialized Investment Platform called DynaSIF and offer SIF products to investors.",
            "Sentiment": "positive",
            "PublishDate": 1755162536205,
            "Source": "stock"
        },
        {
            "Title": "360 ONE WAM Revises Business Transfer Agreements with UBS and Credit Suisse",
            "Summary": "360 ONE WAM has revised its business transfer agreements with UBS and Credit Suisse to accelerate key milestones. The company stated that these revisions will have no material impact on the transactions or the company's financials.",
            "Sentiment": "neutral",
            "PublishDate": 1755097885237,
            "Source": "order&deals"
        },
        {
            "Title": "BC Asia Investments Sells 15 Million Shares in 360 One WAM, Stake Drops to 18.21%",
            "Summary": "BC Asia Investments X Limited sold 15 million equity shares of 360 One WAM Limited through open market transactions on July 22, 2025. The sale reduced BC Asia Investments' shareholding from 88.62 million shares (21.92%) to 73.62 million shares (18.21%) of 360 One WAM's total share capital. The transaction represents 3.71% of the company's total share capital. 360 One WAM has an equity share capital of Rs. 404.24 crore comprising 404.24 million equity shares of Re 1 each. BC Asia Investments is not part of the promoter or promoter group of 360 One WAM.",
            "Sentiment": "neutral",
            "PublishDate": 1753330541607,
            "Source": "stock"
        },
        {
            "Title": "360 ONE WAM Reports 30% YoY Growth in ARR AUM to Rs 2.87 Lakh Crores, PAT Rises 18%",
            "Summary": "360 ONE WAM Limited reported strong quarterly results with total ARR AUM increasing 30% year-over-year to Rs 2,87,317 crores, supported by net flows of Rs 20,950 crores including Rs 18,266 crores from the B&K Securities acquisition. ARR Revenue grew 35.9% YoY to Rs 511 crores, representing 77% of total revenues. The company achieved its highest quarterly PAT of Rs 287 crores, up 18% YoY. Total revenue stood at Rs 725 crores while costs increased 32.7% to Rs 351 crores, resulting in a cost-to-income ratio of 48.4%. The company completed the B&K Securities acquisition in May 2025 and received regulatory approvals for its UBS collaboration. Management expects net flows of 12-15% of opening ARR AUM for the full year and anticipates gradual yield compression of 2-3 basis points due to business mix changes. The company experienced some team departures affecting flows but has hired new teams to offset the impact.",
            "Sentiment": "positive",
            "PublishDate": 1753263514415,
            "Source": "earnings"
        },
        {
            "Title": "360 ONE WAM Limited Receives ESG Rating of 'ESG 65' for FY2024",
            "Summary": "360 ONE WAM Limited has been assigned an ESG rating of 'ESG 65' by NSE Sustainability Ratings and Analytics Limited for the financial year ended March 31, 2024. The rating was provided by NSE Sustainability Ratings and Analytics Limited, which is registered with SEBI as a 'Category I' ESG Rating Provider. The company communicated this development to stock exchanges BSE and NSE.",
            "Sentiment": "positive",
            "PublishDate": 1753187875216,
            "Source": "stock"
        },
        {
            "Title": "360 ONE WAM Shares Fall 6% Following ₹2,273 Crore Block Deal",
            "Summary": "360 ONE WAM shares declined over 6% after a block deal involving 1.9 crore shares worth ₹2,273 crore at ₹1,160 per share on Tuesday, July 22. Bain Capital-led BC Asia Investments X Ltd. is likely the seller in this transaction representing 4% of the company's equity. BC Asia Investments held a 21.9% stake at the end of the June quarter and will be subject to a 120-day lock-up period following the transaction. JPMorgan is arranging the deal. The stock traded at ₹1,146.3, down 6.13% and has declined 10.2% year-to-date. BC Asia Investments acquired up to 24.98% stake in 360 ONE WAM from General Atlantic Singapore Fund in 2022.",
            "Sentiment": "negative",
            "PublishDate": 1753159007616,
            "Source": "order&deals"
        },
        {
            "Title": "360 ONE WAM Sees Large Block Trade Worth Rs 1,937 Crore",
            "Summary": "360 ONE WAM executed a significant block trade on NSE/BSE involving approximately 16.65 million shares at a price of Rs 1,163.5 per share. The total transaction value reached Rs 1,937.23 crore, representing a substantial trading activity in the company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1753156886671,
            "Source": "order&deals"
        },
        {
            "Title": "BC Asia Investments To Sell 3.7% Stake In 360 One WAM For Rs 1,741 Crore",
            "Summary": "BC Asia Investments X plans to sell 1.5 crore shares representing a 3.7% stake in 360 One WAM Ltd. through a block deal. The floor price is set at Rs 1,160 per share, offering a 5% discount to the last closing price of Rs 1,221.20, with the total offer size valued at Rs 1,741 crore. IIFL Capital Services and JPMorgan India will serve as book runners for the transaction. The seller will be subject to a 120-day lock-up period following the sale. 360 One WAM shares closed 1.65% higher and have gained 26.41% year-to-date, despite a 2.68% decline over the past 12 months. Among analysts covering the stock, nine maintain buy ratings while three recommend hold, with the average price target suggesting a potential 5.5% downside.",
            "Sentiment": "neutral",
            "PublishDate": 1753112557304,
            "Source": "order&deals"
        },
        {
            "Title": "360 ONE WAM Raises ₹528 Crore from UBS AG Through Warrant Allotment",
            "Summary": "360 ONE WAM has raised ₹528 crore from UBS AG through a preferential allotment of over 2 crore warrants priced at ₹1,030 each. The funds are intended to support the company's equity growth and future expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1753109697887,
            "Source": "corporate_action"
        },
        {
            "Title": "360 One Wam Reports Increased Q1 Profits and Revenue",
            "Summary": "360 One Wam has reported its quarterly financial results. The company's consolidated net profit for Q1 increased to 2.85 billion rupees, up from 2.45 billion rupees in the same period last year. Revenue also saw growth, rising to 9.11 billion rupees from 8.5 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1752801187000,
            "Source": "default"
        },
        {
            "Title": "360 ONE WAM Reports 29.8% Annual Growth in Recurring Revenue AUM",
            "Summary": "360 ONE WAM has reported its Annual Recurring Revenue Assets Under Management (AUM) at ₹2,87,317 crore, representing a significant increase of 29.8% compared to the previous year. This growth indicates a strong performance in the company's asset management business.",
            "Sentiment": "positive",
            "PublishDate": 1752763462000,
            "Source": "default"
        },
        {
            "Title": "360 ONE WAM Reports Q1 Financial Results",
            "Summary": "360 ONE WAM has announced its Q1 financial results. The company's consolidated net profit increased to 2.85 billion rupees from 2.45 billion rupees in the same quarter last year. Revenue also saw growth, rising to 9.11 billion rupees from 8.5 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1752750197000,
            "Source": "result"
        },
        {
            "Title": "360 ONE: CCI Approves Acquisition of UBS AG Businesses in India",
            "Summary": "The Competition Commission of India (CCI) has approved 360 ONE group's acquisition of certain UBS AG businesses in India, including portfolio management services, stock broking, and financial product distribution services from Credit Suisse Securities (India). The deal also includes UBS AG subscribing to warrants representing 4.95% of 360 ONE WAM's paid-up share capital.",
            "Sentiment": "positive",
            "PublishDate": 1751991065000,
            "Source": "corporate_action"
        },
        {
            "Title": "360 One WAM: Shares Slide Despite SEBI Approval for Credit Suisse India PMS Acquisition",
            "Summary": "360 One WAM shares fell 5.32% to Rs 1,174 despite SEBI approval for its subsidiary to acquire Credit Suisse India's PMS business. The acquisition, announced in April 2025, awaits final regulatory clearances. Despite the drop, analysts maintain a 'Buy' recommendation with projected revenue growth of 17.2% for FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1751963239000,
            "Source": "corporate_action"
        },
        {
            "Title": "360 One WAM: Capital Group Increases Stake to 12%",
            "Summary": "Capital Group, through affiliate New World Fund Inc., acquired a 0.52% stake in 360 One WAM Ltd. for Rs 245 crore, increasing its total holding to 12.11%. Separately, 360 One WAM's subsidiary faces a Rs 25 lakh penalty from MCXCCL for alleged false reporting of excess collateral.",
            "Sentiment": "neutral",
            "PublishDate": 1750959890000,
            "Source": "block_deals"
        },
        {
            "Title": "360 ONE WAM Receives Key Approval for B&K Securities Acquisition",
            "Summary": "360 ONE WAM has announced that B&K Securities has received the necessary prior approval for their acquisition deal. This approval marks a significant step forward in the acquisition process, potentially allowing 360 ONE WAM to proceed with the purchase of B&K Securities.",
            "Sentiment": "positive",
            "PublishDate": 1747149147000,
            "Source": "default"
        },
        {
            "Title": "360 One Wam Reports Q4 Results and Announces Corporate Actions",
            "Summary": "360 One Wam reported Q4 consolidated net profit of 2.5 billion rupees, up from 2.43 billion rupees year-over-year. Q4 revenue increased to 8.2 billion rupees from 7.92 billion rupees year-over-year. The company approved a first interim dividend of 6 rupees per equity share for FY 2025-26 and plans to raise up to 2.50 billion rupees through NCDs.",
            "Sentiment": "positive",
            "PublishDate": 1745453512000,
            "Source": "default"
        },
        {
            "Title": "360 ONE WAM: Q4 Profit Rises 3.6%, Announces UBS Collaboration",
            "Summary": "360 ONE WAM reported a 3.6% YoY increase in Q4 FY25 profit to ₹250 crore. Full-year profit jumped 26.6% to ₹1,015 crore. The company announced an exclusive collaboration with UBS AG, including acquisition of UBS's India onshore wealth management business. Annual recurring revenue AUM grew 23.2% YoY to ₹2,46,828 crore.",
            "Sentiment": "positive",
            "PublishDate": 1745412224000,
            "Source": "earnings"
        },
        {
            "Title": "360 ONE WAM: Q4 Profit Up 3.6%, Declares Dividend, Partners with UBS",
            "Summary": "360 ONE WAM reported Q4 FY25 net profit of ₹250 crore, up 3.6% YoY. Total revenue rose 5.7% to ₹658 crore. Declared first interim dividend of ₹6 per share for FY26. Entered exclusive collaboration with UBS AG, acquiring UBS's India onshore wealth management business. UBS to take 4.95% stake in 360 ONE WAM via convertible warrants.",
            "Sentiment": "positive",
            "PublishDate": 1745407304000,
            "Source": "result"
        },
        {
            "Title": "360 ONE WAM: Acquires UBS's India Wealth Business for Rs 307 Crore",
            "Summary": "360 ONE WAM is acquiring UBS AG's onshore India wealth business for Rs 307 crore. The deal includes UBS's stock broking, distribution, and portfolio management services. 360 ONE and UBS will form a strategic collaboration to enhance wealth management services in India and internationally. UBS will also acquire a 4.95% stake in 360 ONE through warrants.",
            "Sentiment": "positive",
            "PublishDate": 1745299921000,
            "Source": "corporate_action"
        },
        {
            "Title": "UBS to Acquire Stake in 360 ONE WAM",
            "Summary": "UBS is set to purchase warrants amounting to a 4.95% stake in 360 ONE WAM, demonstrating UBS's commitment to the ultra and high-net-worth Indian market. A joint committee led by senior leadership from both companies will be established to explore growth opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1745291295000,
            "Source": "default"
        },
        {
            "Title": "360 ONE WAM Acquires UBS's Onshore Wealth Management Business in India",
            "Summary": "360 ONE WAM has announced the acquisition of UBS's onshore wealth management business in India through its units. The company's active assets under management stood at Rs 26,000 crore as of December 2024. The net consideration for the transaction is Rs 307 crore. Additionally, 360 ONE WAM will issue 20.5 million warrants on a preferential basis to UBS AG at a price of Rs 1,030 per warrant.",
            "Sentiment": "positive",
            "PublishDate": 1745291124000,
            "Source": "default"
        },
        {
            "Title": "360 ONE WAM Enters Strategic Collaboration with UBS for Wealth Management",
            "Summary": "360 ONE WAM has entered into an exclusive strategic collaboration with UBS for wealth management services in India and international markets. This partnership aims to combine 360 ONE WAM's local expertise with UBS's global reach and capabilities in wealth management.",
            "Sentiment": "positive",
            "PublishDate": 1745290570000,
            "Source": "default"
        },
        {
            "Title": "360 ONE WAM Receives SEBI Approval for B&K Securities Acquisition",
            "Summary": "360 ONE WAM has obtained the necessary prior approval from SEBI (Securities and Exchange Board of India) under the SEBI (Merchant Bankers) regulations for the acquisition and proposed change of control of B&K Securities.",
            "Sentiment": "positive",
            "PublishDate": 1745288328000,
            "Source": "default"
        },
        {
            "Title": "360 ONE WAM Ltd: Q4 Results Date, Dividend Consideration, and Earnings Call Scheduled",
            "Summary": "360 ONE WAM Ltd. will announce Q4 and FY25 results on April 23, 2025. The board will consider declaring the first interim dividend for FY 2025-26 and may approve fundraising of up to Rs 250 crore. An earnings call is scheduled for 5:30 p.m. on the same day.",
            "Sentiment": "neutral",
            "PublishDate": 1745230783000,
            "Source": "corporate_action"
        }
    ]
}