{
    "Symbol": "3IINFOLTD",
    "ISIN": "INE748C01038",
    "News": [
        {
            "Title": "3i Infotech Files Police Complaint Over ₹128 Cr Fraud",
            "Summary": "3i Infotech Limited filed complaint with Economic Offence Wing regarding corporate financial fraud exceeding ₹128 crores involving fraudulent disinvestment of subsidiary and wrongful preference share redemption.",
            "Sentiment": "negative",
            "PublishDate": 1770176156121,
            "Source": "stocks"
        },
        {
            "Title": "3i Infotech Board Meeting Set for February 13, 2026",
            "Summary": "3i Infotech Limited announces board meeting on February 13, 2026, to consider Q3FY26 unaudited financial results. Trading window closed until February 15, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770046095766,
            "Source": "co_actions_results"
        },
        {
            "Title": "3i Infotech Gets Relief in Income Tax Penalty Case",
            "Summary": "Income Tax Appellate Tribunal deletes ₹14.14 crore penalty levied under section 271G for Assessment Year 2013-14, reducing outstanding demand to nil for the IT services company.",
            "Sentiment": "positive",
            "PublishDate": 1766170461264,
            "Source": "stocks"
        },
        {
            "Title": "3iInfotech Subsidiary Receives Revised Tax Settlement Certificate, Expected Cash Inflow Reduced",
            "Summary": "3iInfotech Digital BPS Limited received a revised Certificate in Form 2 from CIT TDS2 Delhi under the Direct Tax Vivad Se Vishwas Scheme 2024 for financial year 2013-14. The company now expects a net cash inflow of ₹28.24 lakhs instead of the earlier reported ₹74.79 lakhs towards balance refund, with no material impact on operations.",
            "Sentiment": "neutral",
            "PublishDate": 1764241138765,
            "Source": "stock"
        },
        {
            "Title": "3i Infotech Receives Contract Termination Notice from RailTel for WiFi Monetisation Project",
            "Summary": "3i Infotech received termination notice from RailTel Corporation of India Limited for the WiFi Monetisation Project on November 14, 2025, with immediate effect. The company disputes the termination and is evaluating legal remedies in response to the contract cancellation.",
            "Sentiment": "negative",
            "PublishDate": 1763210918793,
            "Source": "stock"
        },
        {
            "Title": "3iInfotech Allots 1,360 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "3iInfotech allotted 1,360 equity shares of face value Rs. 10 each to eligible employees under its Employee Stock Option Scheme 2018 on November 14, 2025. The company's paid-up equity share capital increased to Rs. 2,073,962,670, representing 20,73,96,267 fully paid-up equity shares of Rs. 10 face value each.",
            "Sentiment": "neutral",
            "PublishDate": 1763174132734,
            "Source": "corporate_action"
        },
        {
            "Title": "3iInfotech Reports Strong Q2FY26 Results with 74% QoQ Growth in Operating EBITDA",
            "Summary": "3iInfotech Limited announced its Q2FY26 consolidated financial results showing revenue of ₹174.9 crore with 2.5% quarter-on-quarter growth. The company reported operating EBITDA of ₹31.4 crore, marking a significant 74% QoQ increase with an 18% margin. Profit after tax reached ₹18.9 crore, up 151% QoQ. The board approved several key decisions including re-designation of Mr. Raj Ahuja from Acting CEO to Group CEO, appointment of Mr. Kalpesh Shah as Chief Financial Officer, and grant of stock options under ESOP schemes. The company completed a rights issue allotting 3.77 crore shares, increasing paid-up share capital to ₹207.39 crore from ₹169.69 crore. Geographically, the US and India contributed 46% and 43% respectively to total revenue, while the AAA vertical remained the primary growth driver with ₹123 crore in revenue.",
            "Sentiment": "positive",
            "PublishDate": 1762996798215,
            "Source": "earnings"
        },
        {
            "Title": "3i Infotech Gets Relief as Service Tax Demand Reduced to ₹5.59 Crores from ₹86.42 Crores",
            "Summary": "3i Infotech received a partially favorable order from the Principal Commissioner, CGST CX, Belapur, reducing its net service tax demand to ₹5.59 crores along with applicable interest and penalties. This follows the Supreme Court's August 2023 order that set aside ₹51.24 crores of the original ₹86.42 crores demand and remanded the remaining matter for reconsideration. The tax litigation pertains to service tax matters for financial years 2004-05 to 2011-12. The company received the order on November 11, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762946537298,
            "Source": "stock"
        },
        {
            "Title": "3I Infotech Raises 641 Million Rupees Through Rights Issue",
            "Summary": "3I Infotech has successfully raised 641 million rupees through a rights issue. The company completed this fundraising exercise to secure additional capital.",
            "Sentiment": "positive",
            "PublishDate": 1761838474387,
            "Source": "corporate_action"
        },
        {
            "Title": "3i Infotech Removes Wholly-Owned Subsidiary from Singapore Registry",
            "Summary": "3i Infotech announced the removal of its wholly-owned subsidiary, Nure Infotech Solutions Pte. Ltd., from the Singapore registry. The company has completed the process of deregistering this subsidiary entity.",
            "Sentiment": "neutral",
            "PublishDate": 1759926141920,
            "Source": "corporate_action"
        },
        {
            "Title": "3i Infotech Extends Rights Issue Timeline by One Day",
            "Summary": "3i Infotech Limited has extended its rights issue dates by one working day based on advice from stock exchanges. The issue opening date has been revised from October 06, 2025 to October 07, 2025, and the closing date from October 24, 2025 to October 27, 2025. The extension provides an additional window for eligible equity shareholders to apply. The company is issuing up to 3.77 crore fully paid-up equity shares of face value ₹10 each at ₹17 per share, aggregating up to ₹64.10 crores. The rights issue is offered in the ratio of 2 rights equity shares for every 9 fully paid-up equity shares held on the record date of September 26, 2025. No changes have been made to the terms and conditions of the Letter of Offer or Application Form other than the date revision.",
            "Sentiment": "neutral",
            "PublishDate": 1759511346478,
            "Source": "corporate_action"
        },
        {
            "Title": "3i Infotech Approves Rights Issue of 3.77 Crore Shares at Rs 17 Each to Raise Rs 64.10 Crores",
            "Summary": "3i Infotech's Rights Issue Committee approved the terms for a rights issue offering 3,77,08,165 fully paid-up equity shares at Rs 17 per share, including a premium of Rs 7 per share. The issue aims to raise Rs 64,10,38,805. Shareholders will receive 2 new shares for every 9 shares held as on the record date of September 26, 2025. The rights issue will open on October 6, 2025, and close on October 24, 2025. The company has arranged with NSDL and CDSL for dematerialized credit of rights entitlements with ISIN INE748C20012.",
            "Sentiment": "neutral",
            "PublishDate": 1758101943766,
            "Source": "corporate_action"
        },
        {
            "Title": "3i Infotech Schedules Rights Issue Committee Meeting for September 17 to Finalize ₹100 Crore Rights Issue Details",
            "Summary": "3i Infotech has scheduled a Rights Issue Committee meeting for September 17, 2025, to determine key details of its proposed rights issue including issue size, price, entitlement ratio, and record date. The company has received in-principle approvals from both NSE and BSE for the rights issue of equity shares with face value of ₹10 each, aggregating up to ₹100 crore. NSE provided approval on September 5, 2025, while BSE approved on September 10, 2025. The Rights Issue Committee had previously approved the Draft Letter of Offer during its July 18, 2025 meeting.",
            "Sentiment": "positive",
            "PublishDate": 1757605590380,
            "Source": "corporate_action"
        },
        {
            "Title": "3i Infotech Initiates Bankruptcy Proceedings for Saudi Arabian Subsidiary Due to Tax Liabilities",
            "Summary": "3i Infotech Limited has approved bankruptcy proceedings for its Saudi Arabian subsidiary, 3i Infotech Saudi Arabia LLC, after voluntary liquidation became impractical under local laws. The subsidiary owes SAR 11,416,736 (Rs. 257,321,812) in withholding tax and income tax to the Zakat, Tax and Customs Authority for financial years 2008, 2009, 2010, and 2019. The subsidiary could only pay two installments out of 12 approved under an Amnesty Scheme due to cash flow issues. The Saudi subsidiary contributed 4.14% of turnover (Rs. 30.08 crores) in FY 2024-25 and has a negative net worth of Rs. 96.26 crores. The bankruptcy proceedings are expected to complete by March 31, 2026, and the subsidiary is not considered material to the company.",
            "Sentiment": "negative",
            "PublishDate": 1755097276764,
            "Source": "stock"
        },
        {
            "Title": "3i Infotech US Branch Receives $2.26 Million Employee Retention Tax Credit Grant",
            "Summary": "3i Infotech's US branch has received an additional $2.26 million through the Employee Retention Tax Credit Grant program. This grant represents additional funding for the company's US operations.",
            "Sentiment": "positive",
            "PublishDate": 1754414554430,
            "Source": "stock"
        },
        {
            "Title": "3i Infotech Reports Q1FY26 Revenue of ₹170.5 Crore with 43.3% QoQ EBITDA Growth",
            "Summary": "3i Infotech announced consolidated financial results for Q1FY26 ended June 30, 2025. The company reported operating revenue of ₹170.5 crore, declining 8.8% quarter-on-quarter. Operating EBITDA reached ₹22.9 crore with a 13.4% margin, growing 43.3% QoQ. PAT stood at ₹7.5 crore, marking the third consecutive quarter of positive results. India and the U.S. each contributed 45.1% to total revenue. The Application-Automation-Analytics segment generated ₹117.2 crore in revenue, followed by Infrastructure Services at ₹35.5 crore and Digital BPS at ₹17.5 crore. The IT sector contributed 44.7% of revenue, while BFSI contributed 38.3%. The company added 16 new clients and ended the quarter with over 4,300 employees and a 17.2% attrition rate. 3i Infotech achieved ISO 27001:2022 certification and formed a strategic alliance with Aquila Clouds for FinOps and BillOps solutions.",
            "Sentiment": "positive",
            "PublishDate": 1754063358414,
            "Source": "earnings"
        },
        {
            "Title": "3i Infotech Board Approves ICICI Strategic Investment Fund's Reclassification from Promoter to Public Category",
            "Summary": "3i Infotech Limited's Board of Directors approved an application from ICICI Strategic Investment Fund to reclassify their status from Promoter category to Public category. The Board meeting was held on July 31, 2025, and determined the application complies with Regulation 31A of the SEBI Listing Regulations. The company will submit applications to BSE Limited and National Stock Exchange of India Limited by August 5, 2025, seeking approval for the reclassification, subject to requisite permissions and approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1753977918009,
            "Source": "corporate_action"
        },
        {
            "Title": "3i Infotech Board Approves Q2 2025 Results and ₹9.5 Crore Capital Infusion into Subsidiary",
            "Summary": "3i Infotech's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025. The company will convert an outstanding loan of ₹8.17 crores (including interest) granted to its wholly owned subsidiary NuRe FutureTech Private Limited into redeemable preference shares, along with fresh fund infusion of ₹1.33 crores, totaling ₹9.50 crores. The Board also approved re-appointment of M/s. CKSP & Co. LLP as statutory auditors for five years from the 32nd AGM to the 37th AGM, subject to shareholder approval. Additionally, Harish Shenoy ceased to be Senior Management Personnel and Key Managerial Personnel due to his permanent movement to the US subsidiary, though he remains part of the leadership team.",
            "Sentiment": "neutral",
            "PublishDate": 1753975920890,
            "Source": "corporate_action"
        },
        {
            "Title": "3i Infotech Board Approves Q2 2025 Results and ₹9.5 Crore Investment in Subsidiary",
            "Summary": "3i Infotech's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025. The company will convert an outstanding loan of ₹8.17 crores (including interest) to its wholly owned subsidiary NuRe FutureTech Private Limited into redeemable preference shares, plus infuse fresh funds of ₹1.33 crores, totaling ₹9.5 crores. The investment aims to enable NuRe FutureTech to pursue new business opportunities in IT, IT-enabled services, and artificial intelligence. The Board also approved the re-appointment of CKSP & Co. LLP as statutory auditors for five years, from the 32nd AGM until the 37th AGM in 2030, subject to shareholder approval. Additionally, Harish Shenoy ceased to be Senior Management Personnel and Key Managerial Personnel due to his permanent relocation to the US subsidiary, though he remains part of the leadership team.",
            "Sentiment": "neutral",
            "PublishDate": 1753971622357,
            "Source": "earnings"
        },
        {
            "Title": "3I Infotech's US Branch Receives $2.14 Million Employee Retention Credit",
            "Summary": "3I Infotech's United States branch has been granted a $2.14 Million Employee Retention Credit from the Internal Revenue Service (IRS).",
            "Sentiment": "positive",
            "PublishDate": 1752596372000,
            "Source": "default"
        },
        {
            "Title": "3i Infotech Reports Q4 Profit, Revenue Decline",
            "Summary": "3i Infotech has reported a consolidated net profit of 269 million rupees in Q4, compared to a loss of 999 million rupees in the same quarter last year. The profit increased from 172.6 million rupees in the previous quarter. However, Q4 revenue declined to 1.87 billion rupees from 2 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747267584000,
            "Source": "default"
        },
        {
            "Title": "3i Infotech Reports Q4 Profit Turnaround",
            "Summary": "3i Infotech has reported a significant turnaround in its financial performance for Q4. The company posted a consolidated net profit of 269 million rupees, compared to a loss of 999 million rupees in the same quarter last year. This also represents an improvement from the previous quarter's profit of 172.6 million rupees. However, the company's revenue decreased to 1.87 billion rupees from 2 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747241542000,
            "Source": "result"
        },
        {
            "Title": "3i Infotech to Consider Rights Issue",
            "Summary": "3i Infotech has scheduled a board meeting on May 14 to discuss and potentially approve raising funds through a rights issue of equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1746710122000,
            "Source": "default"
        },
        {
            "Title": "3i Infotech Reports Q3 Financial Results and Stake Dilution",
            "Summary": "3i Infotech announced its Q3 consolidated financial results, reporting a net profit of 406 million rupees compared to a loss of 294 million rupees year-over-year. Revenue decreased to 1.8 billion rupees from 2.12 billion rupees in the same period last year. The company benefited from a foreign exchange gain of 389 million rupees. Profit before forex gain and tax was 30 million rupees, an improvement from a loss of 174 million rupees in the previous year. Additionally, 3i Infotech disclosed a stake dilution in Nure Mediatech for a total consideration of 175 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738197192000,
            "Source": "earnings"
        },
        {
            "Title": "3i Infotech Reports Q2 Financial Results",
            "Summary": "3i Infotech, an IT company, has reported its Q2 consolidated financial results. The company posted a net loss of 43 million rupees, which is an improvement from the 1.54 billion rupee loss in the same quarter last year. However, it represents a decline from the previous quarter's loss of 85 million rupees. Revenue for Q2 stood at 1.77 billion rupees, down from 2.1 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730334758000,
            "Source": "result"
        }
    ]
}