{
    "Symbol": "3MINDIA",
    "ISIN": "INE470A01017",
    "News": [
        {
            "Title": "3M India Q3 FY26: Revenue up 12.7% YoY, posts loss",
            "Summary": "3M India reported 12.7% YoY revenue growth to Rs 1,228 crores in Q3 FY26, but posted Rs 62 crore loss due to exceptional items including labour code impact of Rs 74.57 crores and APA-related tax expenses.",
            "Sentiment": "neutral",
            "PublishDate": 1770887638355,
            "Source": "co_actions_results"
        },
        {
            "Title": "M3M invests ₹3,500 cr in ELIE SAAB housing projects",
            "Summary": "M3M India partners with luxury fashion brand ELIE SAAB to develop two ultra-luxury housing projects in Delhi-NCR with total investment of ₹3,500 crore, including 300 apartments in Gurugram and 650 units in Noida.",
            "Sentiment": "positive",
            "PublishDate": 1768303390894,
            "Source": "stocks"
        },
        {
            "Title": "3M India Board Addresses Exchange Fine for Disclosure Delay",
            "Summary": "3M India's Board reviewed ₹5,000 fines from BSE and NSE for one-day delay in related party transaction disclosure, attributing it to technical glitches in new XBRL filing system.",
            "Sentiment": "neutral",
            "PublishDate": 1766481116326,
            "Source": "stocks"
        },
        {
            "Title": "3M India Receives Tax Settlement Order Under Direct Tax Vivad Se Vishwas Scheme",
            "Summary": "3M India Limited has received a final settlement order in Form 4 for Financial Year 2008-09 from the Principal Commissioner of Income Tax, Bengaluru-2, under the Direct Tax Vivad Se Vishwas Scheme, 2024. The scheme was introduced by the Finance (No.2) Act, 2024 to settle tax disputes. The company had applied under this scheme to settle open tax litigations for the period FY 2004-05 to FY 2013-14. As per the settlement terms, the company is entitled to receive a refund of Rs 2.28 crores for FY 2008-09. The company stated that this settlement has no material impact on its operations or activities.",
            "Sentiment": "positive",
            "PublishDate": 1762274119505,
            "Source": "stock"
        },
        {
            "Title": "3M India Reports 14% Sales Growth in Q2, Appoints New Independent Director and Auditors",
            "Summary": "3M India Limited reported 14.0% sales growth for the quarter ended September 30, 2025, with revenue reaching Rs. 278.81 crores compared to the previous year. The company achieved broad-based growth across all four business segments: Healthcare (14.9%), Consumer (14.6%), Transportation Electronics (12.9%), and Safety Industrial (12.3%). EBITDA registered 33.1% growth year-on-year. Net profit after tax increased 43.0% to Rs. 191 crores. The Board appointed Mr. Dwarakanath Ranganath Mavinakere as Additional Independent Director effective February 2, 2026, for a five-year term, subject to shareholder approval. The company also approved the appointment of PriceWaterhouseCoopers Chartered Accountants LLP as statutory auditors for five years, replacing BSR Co. LLP whose term concludes at the 39th AGM. Additionally, 3M Company USA entered an agreement to sell its Precision Grinding & Finishing business to Nimbus, a Europe-based private equity firm, with the transaction expected to close in the first half of 2026. This business contributed less than 1% of 3M India's revenue in FY2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1762176533737,
            "Source": "earnings"
        },
        {
            "Title": "3M India Evaluates Impact of Parent Company's PG&F Business Transaction",
            "Summary": "3M India is assessing the potential impact of a business transaction involving its parent company's PG&F (Personal Care and Consumer) business segment. The company is reviewing how this transaction may affect its operations.",
            "Sentiment": "neutral",
            "PublishDate": 1762176096722,
            "Source": "stock"
        },
        {
            "Title": "3M India Reports Strong Q2 Performance with 42% Jump in EBITDA",
            "Summary": "3M India delivered robust quarterly results with EBITDA rising to 2.6 billion rupees from 1.83 billion rupees year-over-year. The company's EBITDA margin expanded to 20.20% compared to 16.5% in the same period last year. Net profit increased to 1.9 billion rupees from 1.3 billion rupees year-over-year, while revenue grew to 12.7 billion rupees from 11.1 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762175697652,
            "Source": "earnings"
        },
        {
            "Title": "M3M India Completes Rs 800 Crore High-Street Retail Project in Gurugram",
            "Summary": "M3M India has completed its high-street retail project 'M3M Route 65' in Gurugram with an investment of Rs 800 crore. The project spans 4 acres and features 5.64 lakh sq ft of commercial space. Handover of retail spaces will begin this month, with full operations expected by March next year. This marks the company's 10th retail project.",
            "Sentiment": "positive",
            "PublishDate": 1759976630059,
            "Source": "stock"
        },
        {
            "Title": "3M India Receives Final Settlement Order for Tax Disputes Under Vivad Se Vishwas Scheme",
            "Summary": "3M India has received a final settlement order for its FY12 tax disputes under the Vivad Se Vishwas Scheme. This settlement resolves the company's tax-related matters from that fiscal year through the government's dispute resolution mechanism.",
            "Sentiment": "positive",
            "PublishDate": 1756290424053,
            "Source": "stock"
        },
        {
            "Title": "3M India Appoints Aseem Joshi as President and Managing Director (Designate)",
            "Summary": "3M India Limited has appointed Aseem Joshi as President and Managing Director (Designate) effective October 13, 2025. The appointment was approved by the Board of Directors based on recommendations from the Nomination and Remuneration Committee. Joshi will lead the development and execution of 3M India's growth strategy, focusing on commercial excellence, new products, and operational excellence. He will work closely with Ramesh Ramadurai as part of the transition plan and will be designated as Managing Director at a future date, subject to Board and shareholder approvals. Joshi brings approximately 25 years of experience across engineering, consulting, business development and leadership roles at IBM, McKinsey, Eaton, Honeywell, and most recently served as CEO of India Business at GMM Pfaudler from 2021-2025. He holds a mechanical engineering degree from University of Pune, MS in Industrial and Systems Engineering from Virginia Tech, and MBA from INSEAD. Joshi holds no shareholding in the company.",
            "Sentiment": "positive",
            "PublishDate": 1756124249689,
            "Source": "corporate_governance"
        },
        {
            "Title": "3M India Reports 14.3% Revenue Growth in First Quarter Results",
            "Summary": "3M India Limited announced its first quarter results ended June 30, 2025, showing revenue growth of 14.3% year-over-year to Rs. 1,196 crores. The company's profit after tax increased 13.1% to Rs. 178 crores compared to the same period last year. EBITDA grew 13.0% on a yearly basis and 6.9% quarter-over-quarter to Rs. 257 crores. All four business segments registered revenue growth year-over-year, with Healthcare and Consumer segments each growing 20%, Safety & Industrial growing 11.9%, and Transportation & Electronics growing 11.2%. Managing Director Ramesh Ramadurai attributed the growth to sales and marketing investments made since the middle of the previous financial year to improve market penetration and commercial excellence. The Board of Directors approved these unaudited financial results at a meeting held on August 7, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754553836745,
            "Source": "earnings"
        },
        {
            "Title": "3M India Reports Strong Q1 Performance with 13% Revenue Growth",
            "Summary": "3M India delivered robust quarterly results with net profit rising to 1.78 billion rupees from 1.57 billion rupees year-over-year. Revenue increased to 11.96 billion rupees compared to 10.5 billion rupees in the same period last year. The company's EBITDA grew to 2.6 billion rupees from 2.4 billion rupees, while EBITDA margin expanded to 21.5% from 20% year-over-year, indicating improved operational efficiency alongside top-line growth.",
            "Sentiment": "positive",
            "PublishDate": 1754553244244,
            "Source": "earnings"
        },
        {
            "Title": "3M India Settles Tax Disputes Worth 19.4 Million Rupees for FY 2004-05 to FY 2013-14",
            "Summary": "3M India has opted for a resolution plan to settle tax disputes spanning from FY 2004-05 to FY 2013-14. The tax amount has been fixed at 19.4 million rupees as part of this settlement arrangement.",
            "Sentiment": "neutral",
            "PublishDate": 1753365962636,
            "Source": "stock"
        },
        {
            "Title": "3M India: Steady Margin Growth Expected in Medium Term",
            "Summary": "ICICI Securities maintains a 'Buy' rating on 3M India, citing multiple growth drivers. The company's Ebitda margin has been stable at 14-18% recently, despite challenges from commodity inflation and currency depreciation. Analysts project a gradual increase in Ebitda margin for FY26-27E.",
            "Sentiment": "positive",
            "PublishDate": 1749453965000,
            "Source": "normal_news"
        },
        {
            "Title": "3M India: Announces Massive Rs 695 Per Share Dividend",
            "Summary": "3M India Ltd. declared a total dividend of Rs 695 per equity share for Q4 FY2024-25, comprising a final dividend of Rs 160 and a special dividend of Rs 535. The company plans to distribute Rs 782 crore to shareholders in this quarter.",
            "Sentiment": "positive",
            "PublishDate": 1748422396000,
            "Source": "corporate_action"
        },
        {
            "Title": "3M India Reports Q4 Results and Declares Dividend",
            "Summary": "3M India has released its Q4 financial results. The company's EBITDA was 2.40 billion rupees, down from 2.45 billion rupees year-over-year. EBITDA margin decreased to 20.05% from 22.34%. Revenue increased to 12 billion rupees from 10.33 billion rupees. Net profit declined to 714 million rupees from 1.7 billion rupees. The company has declared a dividend of 695 rupees per share, which includes a special dividend of 535 rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1748421630000,
            "Source": "result"
        },
        {
            "Title": "3M India: New CFO and Board Chairperson Appointed",
            "Summary": "3M India announced key leadership changes. Nikhil Arora appointed as CFO effective May 5. Radhika Rajan named Chairperson of the Board from March 26. Jayanand Kaginalkar appointed as Whole-time Director for two years from April 1. Jung Hyun Kim to join as Non-Executive Director from April 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1741869217000,
            "Source": "corporate_governance"
        },
        {
            "Title": "3M India Reports Q3 Revenue Growth",
            "Summary": "3M India has announced its third-quarter revenue results. The company reported revenue of 10.9 billion rupees, compared to 9.4 billion rupees in the same quarter of the previous year, indicating year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738917075000,
            "Source": "earnings"
        },
        {
            "Title": "3M India Reports Decline in Q3 EBITDA and Margin",
            "Summary": "3M India has reported its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 1.54 billion rupees from 1.7 billion rupees in the same quarter last year. Additionally, the EBITDA margin dropped to 14.14% from 17.70% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738916998000,
            "Source": "earnings"
        },
        {
            "Title": "3M India Reports Q3 Financial Results",
            "Summary": "3M India has announced its financial results for the third quarter. The company's net profit decreased to 1.14 billion rupees from 1.3 billion rupees in the same period last year. However, revenue increased to 10.9 billion rupees from 10 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738916960000,
            "Source": "earnings"
        },
        {
            "Title": "3M India Reports Q2 Financial Results and Approves Land Sale in Pune",
            "Summary": "3M India has released its Q2 financial results, showing a net profit of 1.3 billion rupees, down from 1.46 billion rupees year-over-year and 1.57 billion rupees quarter-over-quarter. However, revenue increased to 11.1 billion rupees from 10.4 billion rupees year-over-year. Additionally, the company has approved the sale of land and building structures in Pune.",
            "Sentiment": "neutral",
            "PublishDate": 1731456009000,
            "Source": "result"
        }
    ]
}