{
    "Symbol": "3PLAND",
    "ISIN": "INE105C01023",
    "News": [
        {
            "Title": "3P Land Holdings Reports Q3FY26 Financial Results",
            "Summary": "3P Land Holdings Limited announced Q3FY26 results with total revenue of ₹97 lakhs and net profit of ₹40 lakhs. Nine-month revenue reached ₹366 lakhs with profit of ₹176 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1769861612109,
            "Source": "co_actions_results"
        },
        {
            "Title": "3P Land Holdings Passes Postal Ballot Resolution",
            "Summary": "3P Land Holdings Limited successfully passes ordinary resolution for material related party transaction involving lease renewal of 4.63 acres land with Pudumjee Paper Products Limited through postal ballot.",
            "Sentiment": "positive",
            "PublishDate": 1769784409368,
            "Source": "co_actions_results"
        },
        {
            "Title": "3P Land Holdings Issues Postal Ballot Corrigendum",
            "Summary": "3P Land Holdings Limited issued a corrigendum to its postal ballot notice dated October 25, 2025, providing additional disclosures for material related party transaction with Pudumjee Paper Products Limited as per SEBI requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1768891796331,
            "Source": "stocks"
        },
        {
            "Title": "3P Land Holdings Reports Quarterly Results for Period Ended September 30, 2025",
            "Summary": "3P Land Holdings Limited's Board of Directors approved the standalone and consolidated unaudited financial results for the quarter and six months ended September 30, 2025. The board meeting was held on October 25, 2025, commencing at 11:30 a.m. and concluding at 12:15 p.m. The consolidated results include financial data from associate company Biodegradable Products India Limited. The financial results were prepared in accordance with Indian Accounting Standards and reviewed by statutory auditor J M Agrawal & Co. The company noted that financial results of Prime Mall Developers, an associate firm of Biodegradable Products India Limited, were not available at the time of signing, though management estimates no material impact on consolidated results.",
            "Sentiment": "neutral",
            "PublishDate": 1761376046443,
            "Source": "earnings"
        },
        {
            "Title": "3P Land Holdings Shareholders Approve Re-appointment of Independent Director for Second Term",
            "Summary": "3P Land Holdings Ltd. shareholders approved the re-appointment of Mr. Romie Shivhari Halan as Non-Executive Independent Director for a second term of five years at their 60th Annual General Meeting held on August 2, 2025. The appointment is effective from September 1, 2025, and will run until August 31, 2030. Mr. Halan, who has experience in finance, marketing, and business administration, is not debarred from holding directorship by any regulatory authority. The company has provided the required disclosures to BSE and NSE regarding this board change.",
            "Sentiment": "neutral",
            "PublishDate": 1754142396214,
            "Source": "corporate_governance"
        },
        {
            "Title": "3P Land Holdings Reports Quarterly Financial Results for June 2025",
            "Summary": "3P Land Holdings Ltd announced its standalone and consolidated unaudited financial results for the quarter ended June 30, 2025. The Board of Directors approved these results at a meeting held on July 26, 2025. The company operates in three segments: leasing, investments, and services. The consolidated financial results include an associate company, Biodegradable Products India Limited. The company's paid-up equity capital stands at Rs 360 lakhs with a face value of Rs 2 per share. The earnings per share was Rs 0.21 for the quarter. The results were reviewed by the Audit Committee and underwent limited review by statutory auditors J M Agrawal & Co.",
            "Sentiment": "neutral",
            "PublishDate": 1753513368851,
            "Source": "earnings"
        }
    ]
}