{
    "Symbol": "5PAISA",
    "ISIN": "INE618L01018",
    "News": [
        {
            "Title": "5paisa Capital allots 12,500 equity shares via ESOPs",
            "Summary": "5paisa Capital Limited allotted 12,500 equity shares to employees through exercise of stock options under ESOP scheme, increasing total equity shares to 3,12,54,838.",
            "Sentiment": "positive",
            "PublishDate": 1770198233362,
            "Source": "co_actions_results"
        },
        {
            "Title": "5Paisa Capital Plans Fundraising Exploration",
            "Summary": "5Paisa Capital announces plans to explore fundraising options on January 21, marking a significant corporate development for the stock and commodity brokerage firm.",
            "Sentiment": "neutral",
            "PublishDate": 1768567841941,
            "Source": "stocks"
        },
        {
            "Title": "5paisa Capital Board Meet on Jan 21 for Fund Raising",
            "Summary": "5paisa Capital Limited has scheduled a board meeting on January 21, 2026, to consider and approve a comprehensive fund raising proposal through various modes including equity shares and convertible securities.",
            "Sentiment": "neutral",
            "PublishDate": 1768562405214,
            "Source": "co_actions_results"
        },
        {
            "Title": "5paisa Capital Makes Q3 FY26 Earnings Call Available",
            "Summary": "5paisa Capital Limited has made the audio recording of its Q3 FY26 earnings call available on its website, discussing unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768397174254,
            "Source": "co_actions_results"
        },
        {
            "Title": "5paisa Capital Reports Q3 FY26 Financial Results",
            "Summary": "5paisa Capital Limited published unaudited financial results for Q3 FY26 ended December 31, 2025, showing consolidated revenue of ₹79.34 crores and net profit of ₹12.30 crores for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1768373894316,
            "Source": "co_actions_results"
        },
        {
            "Title": "5paisa Capital Q3 Net Profit Drops 24% YoY to ₹123m",
            "Summary": "5paisa Capital reports Q3 net profit of ₹123 million, down 24% YoY. Revenue declined 7% to ₹793 million while EBITDA margin compressed to 33.85%.",
            "Sentiment": "negative",
            "PublishDate": 1768349897137,
            "Source": "co_actions_results"
        },
        {
            "Title": "5paisa Capital appoints three senior managers",
            "Summary": "5paisa Capital Limited announces appointment of three Senior Managerial Personnel effective January 14, 2026, including heads of HR, investing product, and design functions.",
            "Sentiment": "positive",
            "PublishDate": 1768310937600,
            "Source": "stocks"
        },
        {
            "Title": "5paisa Capital Q3FY26: PAT up 30% QoQ to ₹12.3 cr",
            "Summary": "5paisa Capital reported Q3FY26 consolidated income of ₹79.30 crores, up 3% QoQ. Profit after tax surged 30% QoQ to ₹12.30 crores with improved margins at 15%.",
            "Sentiment": "positive",
            "PublishDate": 1768310583116,
            "Source": "co_actions_results"
        },
        {
            "Title": "5paisa Capital Q3FY26 Results Show Strong Recovery",
            "Summary": "5paisa Capital reported robust Q3FY26 performance with PAT rising 30% QoQ to ₹123 million and EBITDA growing 23% QoQ to ₹187 million, driven by improved trading volumes and enhanced product offerings.",
            "Sentiment": "positive",
            "PublishDate": 1768310371619,
            "Source": "co_actions_results"
        },
        {
            "Title": "5paisa Capital Q3FY26 Results: Profit Drops 24% YoY",
            "Summary": "5paisa Capital reported Q3FY26 net profit of ₹1,229.96 lakhs, down 24% YoY from ₹1,617.74 lakhs. Revenue declined 7% to ₹7,927.50 lakhs amid regulatory challenges.",
            "Sentiment": "negative",
            "PublishDate": 1768309121766,
            "Source": "co_actions_results"
        },
        {
            "Title": "5paisa Capital Q3 EBITDA Drops to ₹268M",
            "Summary": "5paisa Capital reports Q3 EBITDA of ₹268 million compared to ₹300 million year-over-year, with EBITDA margin declining to 33.85% from 35.21% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1768308828337,
            "Source": "co_actions_results"
        },
        {
            "Title": "5paisa Capital Q3 Results: Profit Falls 24% YoY",
            "Summary": "5paisa Capital reports Q3 net profit of ₹123 million, down 24% from ₹161 million last year. Revenue also declined 7% to ₹793 million compared to ₹853 million in the same quarter previous year.",
            "Sentiment": "negative",
            "PublishDate": 1768308806721,
            "Source": "co_actions_results"
        },
        {
            "Title": "5paisa Capital Q3FY26 Results: Profit Drops 24% YoY",
            "Summary": "5paisa Capital reported Q3FY26 net profit of ₹1,229.96 lakhs, down 24% from ₹1,617.74 lakhs in Q3FY25. Revenue declined 7% to ₹7,927.50 lakhs amid regulatory challenges including IT searches.",
            "Sentiment": "negative",
            "PublishDate": 1768308489034,
            "Source": "co_actions_results"
        },
        {
            "Title": "5paisa Capital schedules Q3FY26 earnings call",
            "Summary": "5paisa Capital Limited has scheduled an earnings conference call for January 14, 2026, to discuss Q3FY26 financial results following the announcement on January 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767940687500,
            "Source": "co_actions_results"
        },
        {
            "Title": "5paisa Capital Board Meet on Jan 13 for Q3FY26 Results",
            "Summary": "5paisa Capital Limited has scheduled a board meeting on January 13, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767703561355,
            "Source": "co_actions_results"
        },
        {
            "Title": "5paisa Capital clarifies volume surge as market-driven",
            "Summary": "5paisa Capital Limited issued clarification to stock exchanges regarding significant trading volume increase, attributing movement to market conditions beyond company control.",
            "Sentiment": "neutral",
            "PublishDate": 1766765057535,
            "Source": "stocks"
        },
        {
            "Title": "5paisa Capital receives GST demand order of ₹52.10 lakh",
            "Summary": "5paisa Capital Limited received a GST order dated December 16, 2025, with a demand of ₹52.10 lakh for alleged excess Input Tax Credit claims during April 2018 to March 2019.",
            "Sentiment": "negative",
            "PublishDate": 1765970765101,
            "Source": "stocks"
        },
        {
            "Title": "WF Asian Reconnaissance Fund and Asian Smaller Companies Fund Reduce Stake in Paisa Capital",
            "Summary": "WF Asian Reconnaissance Fund Limited and its concert party Asian Smaller Companies Fund Limited reported an 88% decline in their shareholding in Paisa Capital Ltd through secondary market sales on November 20, 2025. The funds disclosed their reduced position from a previously reported 7.88% holding in compliance with SEBI substantial acquisition regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763704162549,
            "Source": "corporate_action"
        },
        {
            "Title": "Shubhi Consultancy Services Acquires 7.46% Stake in 5Paisa Capital",
            "Summary": "Shubhi Consultancy Services LLP acquired 23,31,000 equity shares (7.46% of paid-up capital) in 5Paisa Capital Ltd through open market purchases from November 17-19, 2025. The acquisition increased their total holding along with persons acting in concert to 8.00% of the company's voting rights.",
            "Sentiment": "neutral",
            "PublishDate": 1763608245208,
            "Source": "corporate_action"
        },
        {
            "Title": "5paisa Capital Seeks Shareholder Approval for Appointment of Zor Gorelov as Independent Director",
            "Summary": "5paisa Capital Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. Zor Gorelov (DIN: 11329941) as a Non-Executive Independent Director. The Board appointed Gorelov as an Additional Non-Executive Independent Director on October 9, 2025, for a first term of 5 consecutive years ending October 8, 2030. Gorelov brings over 25 years of technology and software industry experience, having founded companies like Kasisto and SpeechCycle. He currently serves as Senior Advisor at Klaros, focusing on AI strategy in banking and fintech. The remote e-voting period runs from November 14, 2025 (9:00 AM IST) to December 13, 2025 (5:00 PM IST), with results to be declared by December 16, 2025. The cut-off date for voting eligibility is November 7, 2025. CS Swapneel Vinod Patel has been appointed as scrutinizer for the e-voting process.",
            "Sentiment": "neutral",
            "PublishDate": 1762943669251,
            "Source": "corporate_action"
        },
        {
            "Title": "WF Asian Reconnaissance Fund Reduces Stake in Seipsa Capital to 17.88%",
            "Summary": "WF Asian Reconnaissance Fund Limited has reduced its shareholding in Seipsa Capital Ltd through a sale in the secondary market. The fund's holding decreased by 2.03% to 17.88% from a previously reported 19.91%. The fund sold 37,404 shares carrying voting rights. After the transaction, WF Asian Reconnaissance Fund holds 24,61,046 shares out of Seipsa Capital's total paid-up equity capital of 3,12,42,338 shares. The disclosure was made under SEBI's Substantial Acquisition of Shares and Takeover Regulations, 2011.",
            "Sentiment": "neutral",
            "PublishDate": 1762580531128,
            "Source": "corporate_action"
        },
        {
            "Title": "5paisa Capital Reconstitutes Board Committees with New Independent Director",
            "Summary": "5paisa Capital Limited has reconstituted its Information Technology Committee and Independent Directors Committee by adding Zor Gorelov as a member. Gorelov, who serves as Additional Non-Executive Independent Director, will join both committees effective November 10, 2025. The IT Committee now comprises seven members including the Chief Technology Officer, Managing Director & CEO, and other independent directors. The Independent Directors Committee consists of five non-executive independent directors with Dr. Sarat Kumar Malik serving as Chairman.",
            "Sentiment": "neutral",
            "PublishDate": 1762512127377,
            "Source": "corporate_governance"
        },
        {
            "Title": "5paisa Capital Advised to Surrender Research Analyst Registration Certificate",
            "Summary": "5paisa Capital has been advised by SEBI to surrender its Research Analyst Registration Certificate due to non-renewal. The company states this development will have no material impact on its operations or financials.",
            "Sentiment": "neutral",
            "PublishDate": 1761739200477,
            "Source": "stock"
        },
        {
            "Title": "5paisa Capital Reports Steady Q2 FY26 Results Amid Market Volatility, Customer Base Crosses 5 Million",
            "Summary": "5paisa Capital Limited held an earnings conference call discussing quarterly results ended September 30, 2025. The company reported total income of INR 77.3 crores, remaining steady compared to the previous quarter despite market headwinds. PAT stood at INR 9.48 crores, down 18% quarter-on-quarter. The company's customer base crossed 5 million with new customer acquisition increasing 20% to over 95,000 customers. Customer acquisition costs reduced by 15% while first year revenue improved by 25%. Average daily turnover rose 18% to INR 2.6 trillion. MTF income grew 22% with client funding book expanding 17% to INR 364 crores. Mutual fund AUM increased to INR 1,647 crores, up 4.7% sequentially. The company enhanced its platform with new features including real-time bank verification, ETF dashboard, and Scalper platform for traders. Management noted that equity markets remained volatile due to FII outflows exceeding $10 billion while DII inflows crossed $20 billion. Industry cash market ADTO declined 16.7% and F&O ADTO fell 13.6% during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1760703042544,
            "Source": "earnings"
        },
        {
            "Title": "5paisa Capital Receives ₹3 Lakh SEBI Penalty for Online Bond Platform Non-Compliance",
            "Summary": "5paisa Capital Limited received an adjudication order from SEBI imposing a joint penalty of ₹3,00,000 on the company and its 2 executive directors for non-compliance with SEBI NCS Master Circular provisions. The penalty stems from SEBI's inspection of the company's Online Bond Platform Provider operations from June 14, 2023, to March 31, 2024. One of the penalized executive directors is no longer associated with the company. The company stated that apart from the penalty, there has been no significant impact on its financial, operational or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1760443250487,
            "Source": "corporate_governance"
        },
        {
            "Title": "5paisa Capital Focuses on AI-Led Trading and Growth in Retail Volumes",
            "Summary": "5paisa Capital is positioning itself for fintech expansion through an AI-led trading ecosystem. The company is experiencing growth in retail trading volumes and margin-funding business momentum.",
            "Sentiment": "positive",
            "PublishDate": 1760027831519,
            "Source": "stock"
        },
        {
            "Title": "5Paisa Capital Reports Mixed Performance: ADTO Declines While MTF Book Crosses ₹1 Lakh Crore",
            "Summary": "5Paisa Capital experienced a decline in Average Daily Turnover (ADTO) across both cash and futures & options (F&O) segments. However, the company's Margin Trading Facility (MTF) book showed strong growth, surging past ₹1 lakh crore.",
            "Sentiment": "neutral",
            "PublishDate": 1760020806068,
            "Source": "stock"
        },
        {
            "Title": "5Paisa Capital Reports 40% Decline in Q2 EBITDA to 230M Rupees",
            "Summary": "5Paisa Capital reported Q2 EBITDA of 230 million rupees, down from 385 million rupees in the same quarter last year, representing a 40% year-over-year decline. The company's EBITDA margin also compressed to 29.77% from 38.17% in the previous year's corresponding quarter, indicating reduced profitability.",
            "Sentiment": "negative",
            "PublishDate": 1760017386221,
            "Source": "earnings"
        },
        {
            "Title": "5Paisa Capital Reports 57% Decline in Net Profit and 24% Drop in Revenue",
            "Summary": "5Paisa Capital reported a net profit of 95 million rupees compared to 219 million rupees in the same quarter last year, representing a significant decline. The company's revenue also decreased to 772 million rupees from 1.01 billion rupees year-over-year. Both key financial metrics showed substantial declines in the quarterly performance.",
            "Sentiment": "negative",
            "PublishDate": 1760017046786,
            "Source": "earnings"
        },
        {
            "Title": "5paisa Capital Receives SEBI Show Cause Notice Over Expired Research Analyst Registration",
            "Summary": "5paisa Capital Limited received a Show Cause Notice from SEBI on September 10, 2025, regarding the potential cancellation of its Research Analyst certificate of registration. The notice was issued under Section 12(3) of the SEBI Act, 1992 and relates to the company's failure to pay prescribed renewal fees within the required timeframe. Under SEBI regulations, research analysts must pay fees every five years, within 3 months before expiry, to maintain their registration. The company's certificate has already expired due to non-payment of these fees. 5paisa Capital stated it will respond to the notice and inform stock exchanges of any material developments. The financial impact cannot be quantified at this time and will depend on the outcome of the proceedings.",
            "Sentiment": "negative",
            "PublishDate": 1757592497921,
            "Source": "corporate_governance"
        },
        {
            "Title": "5paisa Capital Appoints Ravindra Kalvankar as Interim Compliance Officer",
            "Summary": "5paisa Capital Limited appointed Mr. Ravindra Kalvankar as interim Compliance Officer effective July 23, 2025. The appointment was approved by the Board of Directors based on the Nomination and Remuneration Committee's recommendation through a circular resolution. Kalvankar holds a bachelor's degree in commerce from Mumbai University, is a qualified Law Graduate and Company Secretary, and has cleared NISM-Series-III A certification. He brings over 12 years of experience in the broking industry and has been with 5paisa for more than a year. Previously, he worked with stock exchanges and various brokerage firms, with expertise in regulatory compliance, inspections, audits, and liaising with regulatory authorities including SEBI, stock exchanges, and depositories.",
            "Sentiment": "neutral",
            "PublishDate": 1753270994693,
            "Source": "corporate_governance"
        },
        {
            "Title": "5paisa Capital Reports Q1 Net Profit of 115m Rupees, Down from Previous Year",
            "Summary": "5paisa Capital has reported its financial results for the first quarter. The company's net profit stood at 115 million rupees, which is lower compared to 201 million rupees in the same quarter of the previous year (YoY) and 100 million rupees in the previous quarter (QoQ). The company's revenue for Q1 was 777 million rupees, down from 1 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1752019620000,
            "Source": "default"
        },
        {
            "Title": "5paisa Capital Reports Q1 Net Profit of 115M Rupees, Down Year-over-Year",
            "Summary": "5paisa Capital has reported its financial results for the first quarter. The company's net profit stood at 115 million rupees, which is lower compared to 201 million rupees in the same quarter last year and 100 million rupees in the previous quarter. The revenue for Q1 was 777 million rupees, down from 1 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1751977498000,
            "Source": "default"
        },
        {
            "Title": "5Paisa Capital Issues ₹25 Crore in Commercial Papers",
            "Summary": "5Paisa Capital has issued commercial papers worth ₹25 crore. Commercial papers are short-term, unsecured debt instruments typically used by corporations for financing short-term liabilities.",
            "Sentiment": "neutral",
            "PublishDate": 1751550749000,
            "Source": "default"
        },
        {
            "Title": "5paisa Capital Reports Q4 Results and NCD Issuance",
            "Summary": "5paisa Capital announced its Q4 financial results, with a net profit of 100.4 million rupees, up from 31.4 million rupees year-over-year. However, revenue decreased to 712.7 million rupees from 1.13 billion rupees in the same period last year. The company also plans to issue Non-Convertible Debentures (NCDs) via private placement for up to 2.5 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1746144659000,
            "Source": "default"
        },
        {
            "Title": "5Paisa Capital Reports Q4 Results and NCD Issuance",
            "Summary": "5Paisa Capital announced its Q4 financial results, showing a significant increase in net profit to 100.4 million rupees, up from 31.4 million rupees year-over-year. However, revenue decreased to 712.7 million rupees from 1.13 billion rupees in the same period last year. The company also plans to issue Non-Convertible Debentures (NCDs) via private placement for up to 2.5 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1746107301000,
            "Source": "default"
        },
        {
            "Title": "Income Tax Department Concludes Search at 5paisa Capital Premises",
            "Summary": "5paisa Capital has announced that the Income Tax Department has concluded their search operation at the company's premises. The company has stated that it will promptly inform the stock exchanges of any further material developments related to this matter.",
            "Sentiment": "neutral",
            "PublishDate": 1738679088000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Income Tax Department Initiates Search at 5paisa Capital Premises",
            "Summary": "The Income Tax Department has commenced a search operation at the premises of 5paisa Capital. Despite this development, the company has stated that its business operations are continuing normally. This suggests that while the company is cooperating with the tax authorities, it is maintaining its regular business activities.",
            "Sentiment": "neutral",
            "PublishDate": 1738197162000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Income Tax Department Initiates Search at 5paisa Capital Premises",
            "Summary": "The Income Tax Department has initiated a search operation at the premises of 5paisa Capital. Despite this development, the company has stated that its business operations continue to function normally.",
            "Sentiment": "neutral",
            "PublishDate": 1738152608000,
            "Source": "corporate_governance"
        },
        {
            "Title": "5paisa Capital Reports Q3 Financial Results",
            "Summary": "5paisa Capital has announced its financial results for the third quarter. The company reported a net profit of 161 million rupees, showing an increase from 151 million rupees year-over-year. However, there was a decrease from 219 million rupees quarter-over-quarter. Revenue for Q3 stood at 853 million rupees, down from 1 billion rupees both year-over-year and quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737333556000,
            "Source": "earnings"
        },
        {
            "Title": "5paisa Capital Reports Q3 Financial Results",
            "Summary": "5paisa Capital has announced its financial results for the third quarter. The company reported a net profit of 161 million rupees, showing a year-over-year increase from 151 million rupees. However, there was a quarter-over-quarter decrease from 219 million rupees. The revenue for Q3 stood at 853 million rupees, down from 1 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1737118590000,
            "Source": "earnings"
        },
        {
            "Title": "5paisa Appoints Gaurav Seth as New CEO",
            "Summary": "5paisa has appointed Gaurav Seth as their new Chief Executive Officer. Seth brings 25 years of industry experience to the role, having previously worked with notable companies such as Paytm Money and Morgan Stanley.",
            "Sentiment": "positive",
            "PublishDate": 1736837497000,
            "Source": "corporate_governance"
        },
        {
            "Title": "5paisa Capital Reports Improved Q2 EBITDA and Margin",
            "Summary": "5paisa Capital has announced its Q2 financial results, showing an increase in EBITDA to 384.8 million rupees, up from 335 million rupees in the same quarter last year. The company's EBITDA margin also improved, rising to 38.17% from 34.61% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729166333000,
            "Source": "result"
        },
        {
            "Title": "5paisa Capital Reports Q2 Revenue Growth",
            "Summary": "5paisa Capital has announced its Q2 financial results. The company reported revenue of 1.01 billion rupees, showing an increase from 969 million rupees year-over-year and 1.02 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1729166323000,
            "Source": "result"
        },
        {
            "Title": "5paisa Capital Reports Q2 Profit Increase",
            "Summary": "5paisa Capital has announced its Q2 consolidated net profit of 219 million rupees, showing an increase from 190 million rupees year-over-year and 201 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1729166312000,
            "Source": "result"
        },
        {
            "Title": "5paisa Capital Schedules Q2 Results Board Meeting",
            "Summary": "<p><span class='neutral'>5paisa Capital</span> has announced a <b>board meeting</b> scheduled for <span class='neutral'>October 17</span> to <span class='neutral'>consider and approve</span> the company's <b>financial results</b> for the <span class='neutral'>second quarter</span> of the current fiscal year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728382940000,
            "Source": "corporate_action"
        }
    ]
}