{
    "Symbol": "63MOONS",
    "ISIN": "INE111B01023",
    "News": [
        {
            "Title": "63 moons responds to BSE surveillance query",
            "Summary": "63 moons technologies clarifies recent volume movement to BSE, stating all regulatory disclosures are up-to-date and price increase appears market-driven with no pending material information.",
            "Sentiment": "neutral",
            "PublishDate": 1770728334024,
            "Source": "stocks"
        },
        {
            "Title": "63 moons Board Meet on Feb 10 for Q3FY26 Results",
            "Summary": "63 moons technologies has scheduled a board meeting on February 10, 2026, to consider and approve unaudited financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770119874980,
            "Source": "co_actions_results"
        },
        {
            "Title": "63 moons clarifies MSE system upgrade partnership",
            "Summary": "63 moons technologies provides clarification on its technology services partnership with Metropolitan Stock Exchange, implementing system upgrades effective January 27, 2026, similar to its MCX model since 2003.",
            "Sentiment": "neutral",
            "PublishDate": 1770098789167,
            "Source": "stocks"
        },
        {
            "Title": "63 Moons Technologies Receives 60 Crore Equity Shares",
            "Summary": "63 Moons Technologies receives 60 crore equity shares from 63 SATS Cybertech upon conversion of Zero Coupon Fully Convertible Debentures, increasing its shareholding to 65.27%.",
            "Sentiment": "positive",
            "PublishDate": 1765796689800,
            "Source": "co_actions_results"
        },
        {
            "Title": "63 moons tech subsidiary faces NCLT remand order",
            "Summary": "NCLT Hyderabad remands Baron Infotech insolvency process back to new Resolution Professional due to procedural issues, affecting 63 moons technologies' subsidiary Ticker Limited.",
            "Sentiment": "negative",
            "PublishDate": 1765446777021,
            "Source": "stocks"
        },
        {
            "Title": "NCLT Approves NSEL's Rs. 1,950 Crore One-Time Settlement Scheme with 5,682 Traders",
            "Summary": "The National Company Law Tribunal Mumbai approved a settlement scheme between National Spot Exchange Limited and its traders, with 92.81% of traders by number and 91.35% by value voting in favor. The scheme involves payment of Rs. 1,950 crores to 5,682 traders in proportion to their outstanding amounts as of July 31, 2024, providing relief for funds stuck since the July 2013 payment crisis.",
            "Sentiment": "positive",
            "PublishDate": 1764316150891,
            "Source": "stock"
        },
        {
            "Title": "63 Moons Tech Reports Wider Q2 Losses Despite Revenue Growth",
            "Summary": "63 Moons Tech reported a consolidated net loss of 282 million rupees in Q2, compared to a loss of 225 million rupees in the same period last year. The company's revenue increased to 204 million rupees from 98 million rupees year-over-year. However, EBITDA loss widened significantly to 868 million rupees versus a loss of 597 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1761748532724,
            "Source": "earnings"
        },
        {
            "Title": "63SATS Cybertech Raises ₹65.05 Crores Through Equity Share Sale",
            "Summary": "63SATS Cybertech, associated with 63 Moons Technologies, raised ₹65.05 crores by selling 6.5 crore equity shares. The shares were sold at ₹1 face value with a premium of ₹9 per share, resulting in a total price of ₹10 per share.",
            "Sentiment": "positive",
            "PublishDate": 1760353585451,
            "Source": "stock"
        },
        {
            "Title": "63 moons technologies sets September 17, 2025 as record date for dividend",
            "Summary": "63 moons technologies limited has established September 17, 2025 as the record date for dividend distribution for financial year 2024-25. The dividend payment remains subject to member approval at the upcoming Annual General Meeting and appropriate judicial orders. The company communicated this information to BSE Limited through its Senior VP & Company Secretary Hariraj Chouhan.",
            "Sentiment": "neutral",
            "PublishDate": 1757938620166,
            "Source": "corporate_action"
        },
        {
            "Title": "63SATS Cybertech Raises ₹180 Crore Through Private Placement",
            "Summary": "63SATS Cybertech, a subsidiary of 63 moons, has raised ₹180 crore through a private placement of equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1757503539939,
            "Source": "stock"
        },
        {
            "Title": "63 moons technologies completes sale of STP-Gate Business to Synapsewave Innovations",
            "Summary": "63 moons technologies limited has completed the sale of its STP-Gate Business Undertaking to Synapsewave Innovations Private Limited on a slump sale basis. The STP-Gate Business involves a Straight Through Processing Messaging Solution that enables brokers and fund houses for post-trade settlement of obligations. All conditions precedent required for closing the transaction have been fulfilled. The company informed stock exchanges NSE and BSE about the completion of this business divestiture.",
            "Sentiment": "neutral",
            "PublishDate": 1757422757061,
            "Source": "order&deals"
        },
        {
            "Title": "Supreme Court Dismisses NIAG's Contempt Petition Against 63 Moons",
            "Summary": "The Supreme Court dismissed a contempt petition filed by NIAG against 63 Moons. The petition alleged fund misuse by 63 Moons, but the court rejected these claims.",
            "Sentiment": "positive",
            "PublishDate": 1757405297123,
            "Source": "stock"
        },
        {
            "Title": "63 moons Technologies Gets NCLT Approval to Invest Rs 7.50 Crores in Subsidiary NSEL Rights Issue",
            "Summary": "63 moons technologies limited received approval from the National Company Law Tribunal (NCLT) Committee to subscribe to a Rights Issue offered by its non-material subsidiary, National Spot Exchange Limited (NSEL). The company will make an initial investment of Rs 7.50 crores, representing 25% of the issue price, with subsequent investments to be made based on calls received from NSEL. The approval follows shareholder consent obtained through Postal Ballot on July 24, 2025, and is in accordance with an undertaking submitted to the Supreme Court on April 11, 2019.",
            "Sentiment": "neutral",
            "PublishDate": 1755092363467,
            "Source": "corporate_action"
        },
        {
            "Title": "63 moons Technologies Reports Strong Q1 FY2026 Results with ₹1,731 Crore Net Profit",
            "Summary": "63 moons technologies limited reported quarterly results for the period ended June 30, 2025, showing net profit of ₹1,731.01 crore compared to a loss of ₹1,210.99 crore in the same quarter last year. Total income increased to ₹6,785.64 crore from ₹4,438.35 crore year-over-year. The company's Board approved unaudited financial results and scheduled the 37th Annual General Meeting for September 24, 2025 via video conferencing. During the quarter, the company made additional investments of ₹750 crore in subsidiary National Spot Exchange Ltd, which was subsequently written off. The Board has proposed a final dividend of ₹1.20 per share for the year ended March 31, 2025, subject to shareholder approval and court orders. The company continues to face ongoing legal proceedings related to National Spot Exchange Limited matters, with auditors issuing qualified conclusions due to uncertain outcomes of various investigations and litigations.",
            "Sentiment": "positive",
            "PublishDate": 1755009200074,
            "Source": "earnings"
        },
        {
            "Title": "63 Moons Tech Reports Q4 Financial Results and Dividend",
            "Summary": "63 Moons Tech announced its Q4 financial results. Net profit decreased to 156.8 million rupees from 295.8 million rupees year-over-year. Revenue increased to 559.4 million rupees from 418 million rupees. The company reported an exceptional item of 85 million rupees compared to a loss of 75 million rupees in the previous year. Profit before tax (PBT) improved to 107.1 million rupees from a loss of 46.9 million rupees. The company recommended a final dividend of 1.20 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1747786904000,
            "Source": "default"
        },
        {
            "Title": "63 Moons Tech Reports Q4 Results and Recommends Dividend",
            "Summary": "63 Moons Tech has announced its Q4 financial results. The company reported a net profit of 156.8 million rupees, down from 295.8 million rupees in the same quarter last year. Revenue increased to 559.4 million rupees from 418 million rupees year-over-year. The company's profit before tax (PBT) was 107.1 million rupees, compared to a loss of 46.9 million rupees in the previous year. An exceptional item of 85 million rupees was reported, versus a loss of 75 million rupees last year. The company has recommended a final dividend of 1.20 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1747756571000,
            "Source": "result"
        },
        {
            "Title": "63 Moons Tech: NSEL Scheme of Arrangement Approved by Creditors",
            "Summary": "63 Moons Technologies has announced that the Scheme of Arrangement between National Spot Exchange Limited (NSEL) and its specified creditors has been approved. Over 91% of creditors in value and 92% in number have given their approval. The scheme will now proceed according to the directives of the National Company Law Tribunal (NCLT).",
            "Sentiment": "positive",
            "PublishDate": 1747730656000,
            "Source": "result"
        },
        {
            "Title": "63 Moons Technologies to Consider Q4 Results on May 20",
            "Summary": "63 Moons Technologies has announced that it will consider its fourth quarter financial results on May 20. This indicates that the company is preparing to release its earnings report for the latest fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747136975000,
            "Source": "default"
        },
        {
            "Title": "63 Moons Technologies Subsidiary Raises 106.2 Million Rupees",
            "Summary": "A subsidiary of 63 Moons Technologies has successfully raised 106.2 million rupees through a private placement of securities.",
            "Sentiment": "positive",
            "PublishDate": 1746541733000,
            "Source": "default"
        },
        {
            "Title": "63 Moons Technologies and NSEL Investor Forum: Rs 1,950-Crore Settlement Monitoring Authority Planned",
            "Summary": "63 Moons Technologies and NSEL Investor Forum are setting up an Escrow Agent and Monitoring Authority to oversee the Rs 1,950-crore settlement for NSEL crisis investors. This move aims to protect investor interests and ensure proper fund disbursement. The settlement offers relief to thousands of investors waiting for dues since 2013, with larger investors receiving a full and final payout in exchange for assigning their claims against defaulters to 63 Moons.",
            "Sentiment": "positive",
            "PublishDate": 1741263924000,
            "Source": "corporate_action"
        },
        {
            "Title": "63 Moons Technologies: Board Approves NSEL Settlement Scheme",
            "Summary": "63 Moons Technologies' board has approved participation in a settlement scheme for the NSEL collapse. The scheme involves closing legal proceedings against 63 Moons and assigning claims from NSEL traders to the company. The settlement allocates ₹1,950 crore, about 42% of the ₹4,650 crore owed to investors. Approval from NCLT and consent from 75% of investors by value are required. Some investor groups have conflicting stances on the settlement.",
            "Sentiment": "neutral",
            "PublishDate": 1739977556000,
            "Source": "corporate_action"
        },
        {
            "Title": "63 Moons Approves Support for NSEL-Traders Scheme of Arrangement",
            "Summary": "63 Moons Technologies has approved its participation and support for a scheme of arrangement between the National Spot Exchange Limited (NSEL) and its traders. This decision indicates the company's involvement in resolving ongoing issues related to NSEL's operations and its traders.",
            "Sentiment": "neutral",
            "PublishDate": 1739934103000,
            "Source": "corporate_governance"
        },
        {
            "Title": "63 Moons Technologies Reports Q3 FY24 Financial Results",
            "Summary": "63 Moons Technologies has reported a consolidated net loss of 263 million rupees for the third quarter, compared to a profit of 890 million rupees in the same period last year. The company's revenue significantly decreased to 117 million rupees from 1.3 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739405840000,
            "Source": "earnings"
        },
        {
            "Title": "63 Moons Technologies Reports Q3 Financial Results",
            "Summary": "63 Moons Technologies has reported a significant decline in its financial performance for the third quarter. The company recorded a consolidated net loss of 263 million rupees, compared to a profit of 890 million rupees in the same period last year. Revenue also saw a substantial decrease, falling to 117 million rupees from 1.3 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739368359000,
            "Source": "earnings"
        },
        {
            "Title": "63 Moons Approves One-Time Settlement of ₹1,950 Crore for NSEL Investors",
            "Summary": "63 Moons Technologies has approved a one-time settlement of ₹1,950 crore as proposed by the NSEL Investors Forum (NIF). This decision relates to the long-standing issue of payments to investors affected by the National Spot Exchange Limited (NSEL) crisis.",
            "Sentiment": "positive",
            "PublishDate": 1734318857000,
            "Source": "corporate_governance"
        },
        {
            "Title": "63 Moons Technologies: Approves ₹1,950 Crore Settlement for NSEL Investors",
            "Summary": "63 Moons Technologies has approved a ₹1,950 crore One-Time Settlement proposed by the NSEL Investors Forum. The settlement aims to resolve claims from the NSEL crisis, assigning rights to 63 Moons to pursue recoveries from defaulters. Implementation timeline set for early 2025, subject to legal clearances.",
            "Sentiment": "positive",
            "PublishDate": 1734249937000,
            "Source": "corporate_action"
        },
        {
            "Title": "63 moons technologies' Subsidiary Raises Funds Through Private Share Placement",
            "Summary": "A subsidiary of 63 moons technologies has successfully raised funds by privately placing 73 million shares at a price of 20 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1732753089000,
            "Source": "corporate_action"
        },
        {
            "Title": "63 Moons Technologies Subsidiary Raises Funds Through Private Placement",
            "Summary": "A subsidiary of 63 Moons Technologies has successfully raised funds by privately placing 73 million shares at a price of 20 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1732705441000,
            "Source": "corporate_action"
        },
        {
            "Title": "63 Moons Technologies: Supreme Court Issues Final Warning for Investor Settlement",
            "Summary": "The Supreme Court has given 63 Moons Technologies a four-week deadline to settle with remaining investors from a Rs 5,600-crore scam in 2013. The company claims to have settled with 7,500 out of 13,000 investors and promises to pay all investors. The court warned of contempt proceedings if progress isn't made.",
            "Sentiment": "negative",
            "PublishDate": 1731921822000,
            "Source": "normal_news"
        },
        {
            "Title": "63 Moons Technologies Settles with Majority of Duped Investors",
            "Summary": "63 Moons Technologies has informed the court that it has reached settlements with 7,500 out of 13,000 investors who were allegedly duped. This represents a significant step in addressing the company's legal and financial obligations to affected investors.",
            "Sentiment": "neutral",
            "PublishDate": 1731920306000,
            "Source": "corporate_action"
        },
        {
            "Title": "Supreme Court Gives 63 Moons Technologies Final 4 Weeks to Settle NSEL Scam Case",
            "Summary": "The Supreme Court has granted 63 Moons Technologies a final four-week period to reach a settlement with investors in the National Spot Exchange Limited (NSEL) scam case. This decision marks a crucial development in the long-running financial scandal, putting pressure on the company to resolve outstanding issues with affected investors.",
            "Sentiment": "neutral",
            "PublishDate": 1731920155000,
            "Source": "corporate_action"
        }
    ]
}