{
    "Symbol": "A2ZINFRA",
    "ISIN": "INE619I01012",
    "News": [
        {
            "Title": "A2Z Infra Board Meet Set for Feb 11 to Review Q3 Results",
            "Summary": "A2Z Infra Engineering has scheduled its board meeting for February 11, 2026, to consider Q3FY26 unaudited financial results. Trading window remains closed for designated persons until 48 hours post-announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1770122227980,
            "Source": "co_actions_results"
        },
        {
            "Title": "A2Z Infra Engineering Receives ₹7.26 Cr GST Demand",
            "Summary": "A2Z Infra Engineering Limited disclosed receiving a GST demand notice of ₹7.26 crores from tax authorities for FY2018-19 to FY2022-23, including penalties for alleged short payment of taxes.",
            "Sentiment": "negative",
            "PublishDate": 1765551154506,
            "Source": "stocks"
        },
        {
            "Title": "A2Z Infra Engineering Reports Q2 Loss Amid Going Concern Doubts and NPA Classification",
            "Summary": "A2Z Infra Engineering Limited reported a net loss of Rs. 39.31 lakhs for Q2 and six months ended September 30, 2025, with accumulated losses reaching Rs. 1,07,453.18 lakhs and current liabilities exceeding assets by Rs. 6,687.91 lakhs. The company faces acute liquidity problems with borrowings classified as non-performing assets by lenders and auditors issuing a disclaimer of conclusion citing significant doubts about the company's ability to continue as a going concern.",
            "Sentiment": "negative",
            "PublishDate": 1763116574324,
            "Source": "earnings"
        },
        {
            "Title": "A2Z Infra Engineering Receives GST Demand Order Worth Over INR 72 Crore for FY 2019-20",
            "Summary": "A2Z Infra Engineering Limited received a demand order from the Goods and Services Tax Department for Financial Year 2019-20. The order imposes total penalties and tax recoveries of INR 72.46 crore, comprising: penalty of INR 61.40 crore under Section 122(1) of CGST Act 2017, tax demand of INR 5.53 crore under Section 74(1) with applicable interest, additional penalty of INR 5.53 crore under sections 74(1) and 122(2), and penalty of INR 1 lakh under Section 125. The company has already paid INR 20 crore through electronic cash ledger, though this amount was not appropriated in the demand order. A2Z Infra plans to challenge the order at appropriate forums and expects a favorable outcome based on recent court judgments, stating there will be no material impact on the company's financial operations or activities.",
            "Sentiment": "negative",
            "PublishDate": 1757669728444,
            "Source": "stock"
        },
        {
            "Title": "A2Z Infra Engineering Reports Rs 75.35 Lakhs Net Loss for Q1 FY2026 Amid Going Concern Issues",
            "Summary": "A2Z Infra Engineering Ltd announced its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported a net loss after tax of Rs 75.35 lakhs for the quarter, with accumulated losses reaching Rs 1,07,561.98 lakhs. The company faces significant financial challenges with current liabilities exceeding current assets by Rs 7,271.35 lakhs and acute liquidity issues due to delayed trade receivables realization. Several lenders have filed applications with the Debt Recovery Tribunal for recovery of dues, and the company's borrowings have been classified as non-performing assets by certain banks. The auditors issued a disclaimer of conclusion citing substantial doubt about the company's ability to continue as a going concern. The company has recorded an impairment of Rs 35,665.04 lakhs in three cogeneration power plants due to ongoing litigation with sugar mills. Management is in discussions with lenders for debt settlement and believes the company will be able to settle remaining debts.",
            "Sentiment": "negative",
            "PublishDate": 1755012568782,
            "Source": "earnings"
        }
    ]
}