{
    "Symbol": "AAATECH",
    "ISIN": "INE0D0U01013",
    "News": [
        {
            "Title": "AAA Technologies Seeks Shareholder Approval for 3 Directors",
            "Summary": "AAA Technologies Limited issues postal ballot notice for appointment of three independent directors with e-voting from January 29 to March 2, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769517750301,
            "Source": "stocks"
        },
        {
            "Title": "AAA Technologies Board Accepts Leadership Resignations",
            "Summary": "AAA Technologies Board formally accepts resignations of Chairman Anjay Agarwal and Director Ruchi Agarwal, reconstitutes Audit Committee with Venugopal Dhoot as new member effective December 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765466897081,
            "Source": "stocks"
        },
        {
            "Title": "AAA Technologies Limited Announces Board Changes with Director Resignation and New Appointment",
            "Summary": "AAA Technologies Limited's Board approved the resignation of Non-Executive Independent Director Mr. Naveen G Srivastava due to professional commitments and appointed Mr. Kamal Kishor Sharma as Additional Director in the same category for a five-year term. The company reconstituted its board committees including Audit, Nomination Remuneration, Stakeholders Relationship, and Corporate Social Responsibility committees to accommodate the directorial changes.",
            "Sentiment": "neutral",
            "PublishDate": 1765365835055,
            "Source": "corporate_governance"
        },
        {
            "Title": "AAA Technologies Limited Reshuffles Board with Two Director Resignations and New Appointments",
            "Summary": "AAA Technologies Limited accepted resignations of two independent directors, Nabankur Sen and Rajesh Chandra Verma, on December 06, 2025, citing professional commitments and time constraints. The company simultaneously appointed Prateek Bhansali and Jyoti Torani as new independent directors for five-year terms and reconstituted its board committees, with appointments subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1765019574096,
            "Source": "corporate_governance"
        },
        {
            "Title": "AAA Technologies Promoter Anjay Agarwal Sells 9.54 Lakh Equity Shares",
            "Summary": "Anjay Agarwal, Promoter, Chairman and Managing Director of AAA Technologies Limited, sold 9,54,679 equity shares (7.44% stake) through open market transactions from November 24-25, 2025. The disclosure was made under SEBI regulations for substantial acquisition of shares and takeovers, affecting the promoter's shareholding in the IT security company.",
            "Sentiment": "neutral",
            "PublishDate": 1764307952860,
            "Source": "corporate_action"
        },
        {
            "Title": "AAA Technologies Promoter Anjay Agarwal Sells 9.54 Lakh Equity Shares",
            "Summary": "Anjay Agarwal, Promoter, Chairman and Managing Director of AAA Technologies Limited, sold 9,54,679 equity shares (7.44% stake) through open market transactions on November 24-25, 2025. The sale reduces his shareholding from 17.44% to 10% in the BSE and NSE-listed technology company, representing a significant stake reduction by the key promoter.",
            "Sentiment": "neutral",
            "PublishDate": 1764155872178,
            "Source": "corporate_action"
        },
        {
            "Title": "Magnifica Global Opportunities Fund Acquires 6.899% Stake in AAA Technologies Limited",
            "Summary": "Magnifica Global Opportunities VCC-MGO High Conviction Fund acquired 885,000 shares representing 6.899% stake in AAA Technologies Limited through open market transactions. The acquisition was completed on November 24, 2025, with AAA Technologies having a total equity share capital of 1,28,26,800 shares of Rs. 10 face value each.",
            "Sentiment": "neutral",
            "PublishDate": 1764062534179,
            "Source": "corporate_action"
        },
        {
            "Title": "Nautilus Private Capital Acquires 6.37% Stake in AAA Technologies",
            "Summary": "Nautilus Private Capital Ltd, a Mauritius-based entity, acquired 820,000 equity shares of AAA Technologies Limited through open market transactions. The acquisition represents 6.372% of AAA Technologies' total share capital. The transaction was completed on November 10, 2025. AAA Technologies has an equity share capital of 12,82,68,000 shares with a face value of Rs. 10 each. The company's shares are listed on both BSE and NSE. Prior to this acquisition, Nautilus Private Capital held no shares in AAA Technologies.",
            "Sentiment": "neutral",
            "PublishDate": 1762984613375,
            "Source": "corporate_action"
        },
        {
            "Title": "AAA Technologies Promoter Sanjay Agarwal Sells 7.2 Lakh Shares Through Open Market",
            "Summary": "Sanjay Agarwal, Promoter, Chairman and Managing Director of AAA Technologies Limited, sold 7,20,000 equity shares of the company through open market transactions between November 7-10, 2025. The shares were sold at face value of Rs. 10 each. Following the sale, Agarwal's shareholding in the company decreased from 16,74,679 shares (13.06%) to 9,54,679 shares (7.44%). The company has a total equity share capital of Rs. 12,82,68,000 comprising 1,28,26,800 equity shares of Rs. 10 each. The disclosure was made under SEBI regulations for substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1762908784081,
            "Source": "corporate_action"
        },
        {
            "Title": "M7 Global Fund Increases Stake in AAA Technologies to 7.12%",
            "Summary": "M7 Global Fund PCC-Celldew Cap Fund acquired 6,40,000 shares representing 4.99% of AAA Technologies Limited through open market transactions between October 27-29, 2025. The acquisition increased the fund's total holding from 2,73,000 shares (2.13%) to 9,13,000 shares (7.12%) of the company's total share capital of 1,28,26,800 shares. AAA Technologies is listed on NSE and BSE Limited. The fund is based in Mauritius and is not part of the promoter group.",
            "Sentiment": "neutral",
            "PublishDate": 1762527633694,
            "Source": "corporate_action"
        },
        {
            "Title": "AAA Technologies Promoter Archana Agarwal Sells 1.57 Lakh Shares",
            "Summary": "Archana Agarwal, a promoter of AAA Technologies Limited, sold 1,57,500 equity shares of the company through open market transactions. The shares, with a face value of Rs. 10 each, represented 1.23% of the company's total share capital. Following the sale, Agarwal's shareholding in AAA Technologies has been reduced to zero. The company has a total equity share capital of Rs. 12.83 crore comprising 1.28 crore equity shares. AAA Technologies is listed on the National Stock Exchange under the symbol AAATECH.",
            "Sentiment": "neutral",
            "PublishDate": 1762295841478,
            "Source": "corporate_action"
        },
        {
            "Title": "AAA Technologies Promoter Kanak Agarwal Sells 1.23% Stake Through Open Market",
            "Summary": "Kanak Agarwal, a promoter of AAA Technologies Limited, sold 1,57,500 equity shares representing 1.23% of the company's total share capital through open market transactions. The sale was completed on October 31, 2025, with each share having a face value of Rs. 10. Following this transaction, Agarwal's shareholding in the company has been reduced to zero. The company has disclosed this material event under SEBI regulations for substantial acquisition of shares and takeovers. AAA Technologies has a total equity share capital of Rs. 12,82,68,000 comprising 1,28,26,800 equity shares and is listed on the National Stock Exchange with the symbol AAATECH.",
            "Sentiment": "neutral",
            "PublishDate": 1762294486104,
            "Source": "corporate_action"
        },
        {
            "Title": "AAA Technologies Promoter Anjay Agarwal Sells 2.8 Lakh Shares",
            "Summary": "Anjay Agarwal, Promoter, Chairman and Managing Director of AAA Technologies Limited, sold 2,80,292 equity shares of face value Rs. 10 each through open market transactions between October 31, 2025 and November 4, 2025. Following the sale, his shareholding decreased from 19,54,971 shares (15.24%) to 16,74,679 shares (13.06%) in the company. The company has a total equity share capital of Rs. 12.83 crore comprising 1.28 crore equity shares of Rs. 10 each. The shares are listed on NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1762265875915,
            "Source": "corporate_action"
        },
        {
            "Title": "AAA Technologies Reports 197.25 Lakh Net Profit for Half-Year Ended September 2025",
            "Summary": "AAA Technologies Limited approved its unaudited financial results for the half-year ended September 30, 2025. The company reported revenue from operations of 1,221.57 lakh rupees and net profit of 197.25 lakh rupees for the six-month period. Total income reached 1,304.32 lakh rupees including other income of 82.75 lakh rupees. The company's total assets stood at 3,431.19 lakh rupees as of September 30, 2025, compared to 3,255.43 lakh rupees as of March 31, 2025. Basic earnings per share was 1.54 rupees for the half-year period. The board also noted insider trading disclosures and compliance reports. The company operates in a single business segment and has no subsidiaries, associates, or joint ventures.",
            "Sentiment": "positive",
            "PublishDate": 1760102771667,
            "Source": "earnings"
        },
        {
            "Title": "AAA Technologies Promoter Anjay Agarwal Sells 4.47% Stake Through Open Market",
            "Summary": "Anjay Agarwal, Promoter, Chairman and Managing Director of AAA Technologies Limited, sold 5,72,829 equity shares representing 4.47% of the company's total shareholding through open market transactions between September 24-26, 2025. The sale was executed in two tranches: 1,97,829 shares on September 24 and 3,75,000 shares on September 26. Following the transaction, Agarwal's shareholding in the company decreased from 19.71% to 15.24%. The company has 1,28,26,800 total equity shares of Rs. 10 face value each, with total equity share capital of Rs. 12,82,68,000. AAA Technologies is listed on both NSE (symbol: AAATECH) and BSE (scrip code: 543671).",
            "Sentiment": "neutral",
            "PublishDate": 1758900602107,
            "Source": "corporate_action"
        },
        {
            "Title": "AAA Technologies Secures IT Security Audit Contract Worth Rs 79 Lakhs",
            "Summary": "AAA Technologies Limited has received an order to conduct a security audit of IT infrastructure at a State Level Pollution Control Board, valued at approximately Rs 79 lakhs. The company, which is listed on NSE and BSE with scrip code 543671 and symbol AAATECH, is empanelled by CERT-In for IT Security Auditing Services. The company disclosed this material event under SEBI listing regulations.",
            "Sentiment": "positive",
            "PublishDate": 1758519268960,
            "Source": "order&deals"
        },
        {
            "Title": "AAA Technologies Reports Q1 FY2026 Results, Sets Dividend Record Date, Addresses BSE Compliance Fine",
            "Summary": "AAA Technologies Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing revenue from operations of Rs 424.43 lakhs compared to Rs 357.18 lakhs in the same quarter last year. Net profit increased to Rs 81.49 lakhs from Rs 80.93 lakhs year-over-year. Basic and diluted earnings per share stood at Rs 0.64. The Board set a record date for dividend distribution and closing of books prior to the AGM. The company addressed a BSE fine for non-compliance with secretarial reporting requirements, specifically for not submitting the secretarial compliance report in PDF format as of March 31, 2025, though it was submitted in XBRL format before the due date. The Board expressed displeasure over the lapse and directed the compliance team to implement corrective measures including detailed checklists and maker-checker processes to prevent future occurrences.",
            "Sentiment": "neutral",
            "PublishDate": 1755184299534,
            "Source": "corporate_action"
        },
        {
            "Title": "AAA Technologies Wins Three-Year Vulnerability Assessment Contract with IDBI Bank",
            "Summary": "AAA Technologies Limited has been appointed to conduct vulnerability assessment activity for IDBI Bank for a three-year period. The company disclosed this appointment as a material event to stock exchanges BSE and NSE, where it trades under scrip code 543671 and symbol AAATECH respectively. AAA Technologies is an ISO 9001:2015 and ISO 27001:2013 certified company that is empanelled by CERT-In for IT Security Auditing Services.",
            "Sentiment": "positive",
            "PublishDate": 1753704456764,
            "Source": "order&deals"
        }
    ]
}