{
    "Symbol": "AADHARHFC",
    "ISIN": "INE883F01010",
    "News": [
        {
            "Title": "Aadhar Housing Finance Makes Timely NCD Payments",
            "Summary": "Aadhar Housing Finance Limited successfully completed quarterly interest payment of Rs. 1.18 crore and partial principal redemption of Rs. 23.00 crore on NCDs worth Rs. 115.00 crore as per regulatory requirements.",
            "Sentiment": "positive",
            "PublishDate": 1770133010251,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aadhar Housing Finance Cuts Lending Rate by 15 bps",
            "Summary": "Aadhar Housing Finance Limited announces 15 basis points reduction in Retail Prime Lending Rate effective February 10, 2026, following Board approval based on ALCO recommendation.",
            "Sentiment": "positive",
            "PublishDate": 1769772810407,
            "Source": "stocks"
        },
        {
            "Title": "Aadhar Housing Finance Q3FY26 PAT Jumps 17.5% to ₹281 Cr",
            "Summary": "Aadhar Housing Finance reported strong Q3FY26 results with PAT rising 17.5% YoY to ₹281.19 crore. Revenue grew 18.2% to ₹942.65 crore, while AUM expanded to ₹2,878.99 crore.",
            "Sentiment": "positive",
            "PublishDate": 1769770708744,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aadhar Housing Finance Completes NCD Redemption",
            "Summary": "Aadhar Housing Finance Limited successfully completed full redemption of Rs. 12 crore Non-Convertible Debentures on maturity date with timely interest payment of Rs. 1.12 crore.",
            "Sentiment": "positive",
            "PublishDate": 1769682242705,
            "Source": "co_actions_results"
        },
        {
            "Title": "BCP Asia Launches Open Offer for Aadhar Housing",
            "Summary": "BCP Asia II Holdco VII announces open offer to acquire up to 11.35 crore shares of Aadhar Housing Finance at ₹469.97 per share, representing 25.82% voting stake.",
            "Sentiment": "neutral",
            "PublishDate": 1769484465628,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aadhar Housing Finance Completes NCD Redemption",
            "Summary": "Aadhar Housing Finance Limited successfully redeemed ₹200 crore Non-Convertible Debentures on maturity, making timely interest and principal payments ahead of due date.",
            "Sentiment": "positive",
            "PublishDate": 1769166099960,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aadhar Housing Finance Gets RBI Nod for Acquisition",
            "Summary": "Aadhar Housing Finance Limited receives Reserve Bank of India approval for acquisition transactions involving BCP Asia II Holdco VII Pte. Ltd. and related entities, completing regulatory clearances.",
            "Sentiment": "positive",
            "PublishDate": 1768467215131,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aadhar Housing Finance Q3FY26 CP Compliance Update",
            "Summary": "Aadhar Housing Finance confirms no Commercial Paper issuance during Q3FY26 and adherence to SEBI listing conditions for outstanding CPs as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1767695614210,
            "Source": "stocks"
        },
        {
            "Title": "Aadhar Housing Finance Redeems ₹300 Cr NCDs",
            "Summary": "Aadhar Housing Finance Limited successfully completed timely payment of ₹28.80 crores interest and full redemption of ₹300 crores Non-Convertible Debentures on maturity date January 6, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767695150282,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aadhar Housing Finance Announces Senior Management Changes",
            "Summary": "Aadhar Housing Finance Limited announces changes in senior management personnel due to internal restructuring. Two executives cease to be SMPs while continuing employment.",
            "Sentiment": "neutral",
            "PublishDate": 1767267575361,
            "Source": "stocks"
        },
        {
            "Title": "Aadhar Housing Finance Pays ₹6.99 Lakh NCD Interest",
            "Summary": "Aadhar Housing Finance Limited made timely interest payment of ₹6.99 lakhs on January 1, 2026, for its Non-Convertible Debentures worth ₹9.55 crores, maintaining regulatory compliance under SEBI guidelines.",
            "Sentiment": "positive",
            "PublishDate": 1767006500524,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aadhar Housing Finance Allots 2.44 Lakh Equity Shares Under Employee Stock Option Plan",
            "Summary": "Aadhar Housing Finance Limited allotted 2,44,888 equity shares of Rs. 10 each to eligible employees who exercised stock options under the Employee Stock Option Plan 2020. The allotment increased the company's paid-up equity share capital to Rs. 4,33,78,71,190 comprising 43,37,87,119 fully paid-up equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764847668844,
            "Source": "corporate_action"
        },
        {
            "Title": "Aadhar Housing Finance Allots 4.49 Lakh Equity Shares Under Employee Stock Option Plan",
            "Summary": "Aadhar Housing Finance Limited allotted 4,49,499 equity shares of Rs. 10 each to eligible employees who exercised stock options under the Employee Stock Option Plan 2020. The allotment increased the company's paid-up equity share capital to Rs. 4,33,54,22,310 comprising 43,35,42,231 fully paid-up equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763716262436,
            "Source": "corporate_action"
        },
        {
            "Title": "Aadhar Housing Finance Shareholders Approve Employee Stock Option Plan 2025 Through Postal Ballot",
            "Summary": "Aadhar Housing Finance Limited shareholders approved the introduction of Employee Stock Option Plan 2025 with 97.39% votes in favor and its extension to group company employees with 94.07% approval. The postal ballot process concluded on November 17, 2025, with both special resolutions passing the requisite majority through remote e-voting conducted by NSDL.",
            "Sentiment": "positive",
            "PublishDate": 1763383086758,
            "Source": "corporate_action"
        },
        {
            "Title": "Aadhar Housing Finance Reports 21% AUM Growth, Strong Asset Quality in Q2 FY26",
            "Summary": "Aadhar Housing Finance Limited reported Assets Under Management (AUM) of Rs. 27,554 crores as of September 30, 2025, marking 21% year-on-year growth. Disbursements stood at Rs. 4,089 crores for the first half, representing 16% growth. The company maintained strong asset quality with gross NPAs at 1.42% and collection efficiency above 99%. Stage-II assets improved by approximately 20 basis points year-on-year. The company delivered profit after tax of Rs. 504 crores for H1 FY26 compared to Rs. 428 crores in H1 FY25, showing 18% growth. Portfolio yield exit stood at 13.8% with exit spread at 5.9%. The company expanded its network by adding 20 new branches during the quarter, reaching 611 branches across 22 states. Home loans comprise 73% of AUM while loan against property accounts for 27%. Balance transfer out improved to 5.4% from previous year. Management expressed confidence in meeting growth guidance for the financial year, citing favorable policy reforms and GST 2.0 framework benefits for affordable housing segment.",
            "Sentiment": "positive",
            "PublishDate": 1762916505437,
            "Source": "earnings"
        },
        {
            "Title": "Aadhar Housing Finance Faces Rs 14.79 Lakh Penalty from Provident Fund Authority",
            "Summary": "Aadhar Housing Finance Limited has been levied damages of Rs 14,78,996 by the Regional Provident Fund Commissioner for non-compliance with section 14B of the Employees Provident Fund and Miscellaneous Provisions Act, 1952. The penalty was imposed due to delays in payment of Provident Fund contributions caused by technical issues related to incomplete Aadhar seeding by employees. The delay occurred because of non-seeding and mismatch of employees' Aadhaar details with their Universal Account Numbers (UANs) in the EPFO portal, which prevented timely deposit of contributions. The company learned about the damages on November 10, 2025, during a meeting with Provident Fund authority officials. The company has since completed the Aadhaar verification and deposited the pending contributions. The company states there is no material impact on its financials, operations, or other activities beyond the penalty amount.",
            "Sentiment": "negative",
            "PublishDate": 1762903409467,
            "Source": "stock"
        },
        {
            "Title": "Aadhar Housing Finance Withdraws Credit Rating After Full Redemption of Non-Convertible Debentures",
            "Summary": "Brickwork Ratings India Private Limited has withdrawn the credit rating for Aadhar Housing Finance Limited's secured Non-Convertible Debentures worth Rs. 50 crores following their complete redemption. The debentures, which carried an 8.10% coupon rate and were allotted on October 19, 2020, for a 5-year tenure, matured and were fully redeemed on October 19, 2025. The company requested the rating withdrawal after redemption, and debenture trustees confirmed the full settlement. Aadhar Housing Finance currently has no instruments rated by Brickworks. The company operates as one of India's largest affordable housing finance companies, serving low-income segments with 602 branches across 22 states and union territories, maintaining approximately 306,000 live accounts as of June 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762810060955,
            "Source": "corporate_action"
        },
        {
            "Title": "Aadhar Housing Finance Reports No Deviation in IPO Proceeds Utilization for Q2 FY2026",
            "Summary": "Aadhar Housing Finance Limited submitted its monitoring agency report for the quarter ended September 30, 2025, confirming no deviation in the utilization of proceeds from its Initial Public Offering. ICRA Limited, the monitoring agency, reported that the company's use of IPO funds remained aligned with stated objectives. The company raised INR 1,000 crore through its IPO (excluding OFS portion) with net proceeds of INR 952.33 crore. Out of the total amount, INR 994.343 crore has been utilized as planned - INR 750 crore for meeting future capital requirements towards onward lending, INR 202.33 crore for general corporate purposes (specifically repayment of indebtedness), and INR 42.013 crore for issue-related expenses. The remaining unutilized amount of INR 5.657 crore consists of issue-related expenses, with INR 17.066 crore lying in the public offer account. The IPO was conducted from May 8-10, 2024, and all objects are reported to be on schedule for completion by FY25.",
            "Sentiment": "positive",
            "PublishDate": 1762535233171,
            "Source": "stock"
        },
        {
            "Title": "Aadhar Housing Finance Reports 18% Growth in H1FY26 Profit and AUM",
            "Summary": "Aadhar Housing Finance Limited announced its quarterly results for the quarter ended September 30, 2025. The company reported profit after tax of INR 5,038 million for H1FY26, representing 18% growth compared to H1FY25. Assets under management (AUM) reached INR 276 billion with 21% growth in H1FY26. The company maintains a 100% secured retail book focused on low-income housing segments with average ticket size of INR 1.1 million. Gross non-performing assets stood at 1.4% as of September 2025. The company operates 611 branches across 22 states and union territories, serving over 315,000 live accounts. Return on assets was 4.2% and return on equity was 15.1% for H1FY26. Disbursements grew 16% to INR 41 billion in H1FY26. The company received rating upgrades from CARE to AA+/Stable. Portfolio yield remained stable at 13.8% with spread of 5.9%. Cost to income ratio improved by 30 basis points to 36.1% in H1FY26.",
            "Sentiment": "positive",
            "PublishDate": 1762534095048,
            "Source": "earnings"
        },
        {
            "Title": "Aadhar Housing Finance Targets ₹23,000 Crore AUM with 20% Loan Book Growth",
            "Summary": "Aadhar Housing Finance has outlined its growth strategy targeting sustained Assets Under Management (AUM) growth above ₹23,000 crore with 20% year-on-year loan book expansion. The company plans to deepen its presence in Tier 3-5 towns and focus on affordable housing segments. Key initiatives include strengthening digital onboarding processes and expanding co-lending partnerships. The company aims to maintain Net Interest Margins (NIMs) at 3.5% and Return on Assets (ROA) at 2.7% while working to reduce its cost-to-income ratio through operating leverage and improved branch productivity.",
            "Sentiment": "positive",
            "PublishDate": 1762526269700,
            "Source": "stock"
        },
        {
            "Title": "CCI Approves Blackstone's 80.15% Stake Acquisition in Aadhar Housing Finance",
            "Summary": "The Competition Commission of India has approved Blackstone's acquisition of an 80.15% stake in Aadhar Housing Finance. This regulatory clearance allows the private equity firm to proceed with taking majority control of the housing finance company.",
            "Sentiment": "positive",
            "PublishDate": 1762518927855,
            "Source": "order&deals"
        },
        {
            "Title": "Aadhar Housing Finance Reports 17% Growth in Quarterly Net Profit",
            "Summary": "Aadhar Housing Finance reported consolidated net profit of 2.66 billion rupees for the quarter, representing a year-over-year increase from 2.27 billion rupees. The company's quarterly revenue grew to 8.97 billion rupees compared to 7.64 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1762515873560,
            "Source": "earnings"
        },
        {
            "Title": "Aadhar Housing Finance Seeks Shareholder Approval for Employee Stock Option Plan 2025",
            "Summary": "Aadhar Housing Finance Limited has issued a postal ballot notice seeking shareholder approval for the introduction of an Employee Stock Option Plan 2025 and its extension to subsidiary company employees. The plan proposes to grant a maximum of 3.11 crore employee stock options corresponding to equity shares with a face value of Rs. 10 each. The ESOP pool comprises 1.34 crore new options, 71.76 lakh ungranted options from the previous 2020 plan, and 1.05 crore unvested options from the earlier scheme. Electronic voting will be conducted from October 18 to November 16, 2025, with the cut-off date set as October 10, 2025. The exercise price for grants made within 30 days of in-principle approval will be Rs. 425 per option, while subsequent grants will be priced at up to 20% discount to market price. The plan includes different vesting schedules for Category A and Category B employees, with a minimum cliff period of one year and maximum vesting period of six years.",
            "Sentiment": "positive",
            "PublishDate": 1760686493165,
            "Source": "corporate_action"
        },
        {
            "Title": "BCP Asia II Holdco VII Announces Open Offer to Acquire 25.82% Stake in Aadhar Housing Finance at ₹469.97 Per Share",
            "Summary": "BCP Asia II Holdco VII Pte. Ltd., along with two Blackstone entities, has announced an open offer to acquire up to 11,35,25,761 equity shares (25.82% of expanded voting share capital) of Aadhar Housing Finance Limited from public shareholders at ₹469.97 per share. The offer follows a share purchase agreement where the acquirer will buy up to 64.14% stake from existing promoter BCP Topco VII Pte. Ltd. at ₹425 per share. The transaction requires regulatory approvals including from Competition Commission of India and Reserve Bank of India. The offer is valued at approximately ₹5,335 crores assuming full acceptance and is scheduled to open on September 19, 2025, closing on October 3, 2025. The acquirer has arranged bank guarantees of ₹615 crores and deposited ₹55 crores in escrow to fund the transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1754705948775,
            "Source": "order&deals"
        },
        {
            "Title": "Blackstone Entities Launch Open Offer to Acquire 25.82% Stake in Aadhar Housing Finance at ₹469.97 Per Share",
            "Summary": "BCP Asia II Holdco VII Pte. Ltd., along with Blackstone Capital Partners entities, announced an open offer to acquire up to 11,35,25,761 equity shares representing 25.82% of Aadhar Housing Finance Limited's expanded voting share capital from public shareholders at ₹469.97 per share. The total consideration amounts to ₹53,35,37,01,898 assuming full acceptance. The offer is mandatory under SEBI regulations following a share purchase agreement where the acquirer agreed to purchase up to 64.14% stake from the existing promoter BCP Topco VII Pte. Ltd. at ₹425 per share. The tendering period runs from September 19 to October 3, 2025. The transaction requires regulatory approvals including from Competition Commission of India and Reserve Bank of India. Upon completion, the acquirer will become the new promoter of the housing finance company, while the existing promoter group will be reclassified as public shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1754042722641,
            "Source": "order&deals"
        },
        {
            "Title": "Aadhar Housing Finance Reports 22% AUM Growth to Rs 26,524 Crores in Q1 FY26",
            "Summary": "Aadhar Housing Finance achieved Assets Under Management (AUM) of Rs 26,524 crores in Q1 FY26, marking 22% year-on-year growth. The company reported disbursements of Rs 1,979 crores, up 32% YoY. Profit After Tax increased 19% to Rs 237 crores compared to Rs 200 crores in Q1 FY25. The company maintained healthy asset quality with gross NPA stable at 1.34% and collection efficiency above 98%. Portfolio remains well-secured with average loan-to-value ratio of 59%. Salaried segment represents 56% of portfolio with average ticket size of Rs 10 lakhs. Home loans constitute 73% of AUM while micro-loan against property accounts for 27%. The company operates 591 branches across 22 states serving over 3 lakh customers. CARE rating upgraded the company to AA+ from AA. Cost of funds stood at 8% with exit portfolio yield at 13.8% and spread at 5.8%. The company maintains growth guidance of 20-22% for AUM and 18-20% for disbursements. Management highlighted expansion into emerging markets through urban-emerging strategy, with emerging locations expected to drive higher growth.",
            "Sentiment": "positive",
            "PublishDate": 1753945370319,
            "Source": "earnings"
        },
        {
            "Title": "Aadhar Housing Finance Promoter Sells 44.1 Million Shares to AXDI LDII for Rs 425 Per Share",
            "Summary": "BCP Topco VII Pte. Ltd., the promoter of Aadhar Housing Finance Limited, entered into a share purchase agreement on July 29, 2025, to sell 44,139,236 equity shares to AXDI LDII SPV 1 LTD at Rs 425 per share. The transaction is subject to several regulatory approvals including Reserve Bank of India, Competition Commission of India, National Housing Bank, and Indian Bank approvals. AXDI LDII SPV 1 LTD will become a public shareholder upon completion and is investing as a financial investor with no existing relationship to the company. The agreement is governed by English law and will automatically terminate if closing does not occur within 15 months. The transaction has no impact on the management or control of Aadhar Housing Finance Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1753850121583,
            "Source": "order&deals"
        },
        {
            "Title": "Aadhar Housing Finance Shares Jump 7% on Potential Abu Dhabi Investment Deal",
            "Summary": "Aadhar Housing Finance shares surged 7.33% to Rs 533 following reports of advanced talks with an Abu Dhabi-backed investment vehicle for a minority stake acquisition. The potential investment, estimated at $200-225 million, would secure a 10-12% stake through secondary share sale. The investment vehicle is backed by Abu Dhabi's ADQ and Sheikh Tahnoon bin Zayed al-Nahyan. A formal announcement is expected in the coming weeks. The Blackstone-backed company, which debuted in 2024, touched a 52-week high of Rs 538 during trading. This development follows a larger $2 billion capital commitment by Blackstone through transfer of its three-fourths shareholding into a continuation vehicle. The stock is trading above all key moving averages with RSI at 60.5, indicating neutral to bullish momentum.",
            "Sentiment": "positive",
            "PublishDate": 1753679241797,
            "Source": "stock"
        },
        {
            "Title": "ADQ-Sheikh Tahnoon Vehicle in Advanced Talks for $200-225 Million Stake in Aadhar Housing Finance",
            "Summary": "An investment vehicle backed by Abu Dhabi sovereign investor ADQ and partly owned by Sheikh Tahnoon bin Zayed al-Nahyan is in advanced discussions to acquire a 10-12% minority stake in Blackstone-backed Aadhar Housing Finance for $200-225 million through secondary share sale. This follows Blackstone's larger $2 billion capital commitment through a continuation vehicle structure, where the firm is transferring most of its three-fourths shareholding to new funds while making an open offer to buy 25.82% stake from public shareholders at Rs 469.97 per share. Aadhar Housing Finance, which went public in 2024, reported 19% increase in net profit to Rs 237 crore in the first quarter and has seen its stock appreciate 12.11% in the past month. Under Blackstone's six-year ownership since 2019, Aadhar's assets under management have grown to $3 billion, making it India's largest affordable housing finance company. The affordable housing finance industry is expected to see 17-18% CAGR over five years.",
            "Sentiment": "positive",
            "PublishDate": 1753670998498,
            "Source": "order&deals"
        },
        {
            "Title": "Blackstone Entities Launch Open Offer for Aadhar Housing Finance at ₹469.97 Per Share",
            "Summary": "BCP Asia II Holdco VII Pte. Ltd., along with Blackstone Capital Partners entities, announced an open offer to acquire up to 11,35,25,761 equity shares of Aadhar Housing Finance Limited, representing 25.82% of the expanded voting share capital at ₹469.97 per share. The total consideration amounts to ₹53,35,37,01,898 assuming full acceptance. This mandatory open offer follows a share purchase agreement where the acquirer agreed to purchase up to 28,20,52,121 shares (64.14% stake) from existing promoter BCP Topco VII Pte. Ltd. at a maximum price of ₹425 per share. The transaction will result in a change of control, with the acquirer becoming the new promoter while the existing promoter group will be reclassified as public shareholders. The offer is subject to regulatory approvals including Competition Commission of India and Reserve Bank of India approvals. The acquirer has no intention to delist the company and the offer is not conditional on minimum acceptance levels.",
            "Sentiment": "neutral",
            "PublishDate": 1753467459698,
            "Source": "order&deals"
        },
        {
            "Title": "Aadhar Housing Reports 22% AUM Growth, Eyes Rural Expansion in Affordable Housing Market",
            "Summary": "Aadhar Housing reported a 22% increase in Assets Under Management (AUM) as part of its long-term growth strategy. The company is expanding operations in rural areas and targeting opportunities in the affordable housing finance sector, which represents a ₹45 trillion market opportunity. The growth strategy is supported by technology adoption and favorable policy environment.",
            "Sentiment": "positive",
            "PublishDate": 1753449847409,
            "Source": "stock"
        },
        {
            "Title": "Aadhar Housing Finance Reports No Deviation in Public Issue Proceeds Utilization",
            "Summary": "Aadhar Housing Finance Limited submitted a monitoring agency report for the quarter ended June 30, 2025, confirming no deviation in the utilization of proceeds from their public issue of equity shares. The report was issued by ICRA Limited, the appointed monitoring agency, and submitted to BSE and NSE exchanges. Company Secretary Harshada Pathak signed the regulatory filing on July 25, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753445713590,
            "Source": "stock"
        },
        {
            "Title": "Aadhar Housing Finance Reports 19% PAT Growth in Q1 FY26 with Strong AUM Expansion",
            "Summary": "Aadhar Housing Finance Limited reported quarterly results showing profit after tax of ₹2,373 million, marking 19% year-on-year growth. The company's assets under management grew 22% to ₹265,241 million, while disbursements increased 32% to ₹19,786 million. Return on assets stood at 4.0% with a slight decline of 6 basis points. Gross non-performing assets increased marginally to 1.34%, up 3 basis points from the previous year. Net interest margin decreased by 10 basis points to 8.8%. The housing finance company maintains focus on the low-income housing segment with 100% secured retail book and operates through 591 branches across 22 states. The company scheduled a conference call to discuss these results with investors.",
            "Sentiment": "positive",
            "PublishDate": 1753445112225,
            "Source": "earnings"
        },
        {
            "Title": "Aadhar Housing Finance Announces Senior Management Changes and Stock Option Grants",
            "Summary": "Aadhar Housing Finance Limited announced several senior management changes approved by its Board of Directors. Sreekanth V.N. will retire as Chief Compliance Officer effective August 14, 2025. Pratik Jariwala, who has been Head of Internal Audit since April 2020, will be appointed as the new Chief Compliance Officer for a three-year term starting August 15, 2025. Pulkit Maheshwari has been appointed as Head of Internal Audit effective July 26, 2025. The Board also approved the grant of 90,000 employee stock options under the existing Employee Stock Option Plan 2020, priced at Rs. 511.70 per option based on the closing price on July 24, 2025. The options have a minimum vesting period of one year and can be exercised within two years of vesting.",
            "Sentiment": "neutral",
            "PublishDate": 1753444685108,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aadhar Housing Finance Reports 18.5% Growth in Quarterly Net Profit",
            "Summary": "Aadhar Housing Finance reported consolidated net profit of 2.37 billion rupees for the quarter, representing an increase from 2 billion rupees in the same period last year. The company's revenue grew to 8.48 billion rupees compared to 7.1 billion rupees year-over-year, marking a 19.4% increase in revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1753441809871,
            "Source": "earnings"
        },
        {
            "Title": "Aadhar Housing Finance: Launches First All-Women Branch in Indore",
            "Summary": "Aadhar Housing Finance has opened its first all-women-operated branch in Indore, with nine female staff members. The company plans to open 12 more such branches across India this financial year. In Madhya Pradesh, Aadhar Housing Finance has 46 branches with assets under management of Rs 2,750 crore, expected to reach Rs 3,200 crore by year-end.",
            "Sentiment": "positive",
            "PublishDate": 1751645228000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aadhar Housing Finance Secures ₹200 Crore Through NCDs",
            "Summary": "Aadhar Housing Finance has successfully secured an allotment of 20,000 Non-Convertible Debentures (NCDs) worth ₹200 crore. This financial move indicates the company's efforts to raise capital, potentially for business expansion or refinancing purposes.",
            "Sentiment": "positive",
            "PublishDate": 1749109386000,
            "Source": "default"
        },
        {
            "Title": "Aadhar Housing Finance: Q4 Results Show Sustained Growth, Analysts Maintain 'Buy'",
            "Summary": "Aadhar Housing Finance reported Q4 FY25 PAT of Rs 2.45 billion, up 22% YoY and 3% QoQ. RoA remained above 4% for the fifth consecutive quarter at 4.4%. NIM compressed by ~10bps QoQ, while opex ratio increased by 20bps QoQ. This was offset by a ~25bps QoQ improvement in credit cost.",
            "Sentiment": "positive",
            "PublishDate": 1746624916000,
            "Source": "earnings"
        },
        {
            "Title": "Aadhar Housing Finance Reports Q4 Profit and Revenue Growth",
            "Summary": "Aadhar Housing Finance announced its Q4 financial results. The company's consolidated net profit increased to 2.45 billion rupees, up from 2.02 billion rupees year-over-year and 2.39 billion rupees quarter-over-quarter. Revenue also saw growth, reaching 8.33 billion rupees compared to 6.92 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1746576783000,
            "Source": "default"
        },
        {
            "Title": "Aadhar Housing Finance Reports Strong Q4 Financial Results",
            "Summary": "Aadhar Housing Finance has announced its Q4 financial results, showing significant year-over-year growth. The company's revenue increased to 8.33 billion rupees from 6.92 billion rupees in the previous year. Additionally, consolidated net profit rose to 2.45 billion rupees, up from 2.02 billion rupees year-over-year and 2.39 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1746550122000,
            "Source": "result"
        },
        {
            "Title": "Aadhar Housing Finance: Q4 Profit Surges 21%, Disbursements Rise",
            "Summary": "Aadhar Housing Finance reported a 21% YoY increase in Q4 net profit to Rs 245 crore. Total income rose 21% to Rs 3223 crore. Loan disbursements grew 16% YoY to Rs 8,192 crore. Assets under management expanded 21% to Rs 25,531 crore. The company's board approved a higher borrowing plan of up to Rs 30,000 crore for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1746536833000,
            "Source": "earnings"
        },
        {
            "Title": "Aadhar Housing Finance to Consider Q4 Results on May 6",
            "Summary": "Aadhar Housing Finance has announced that it will consider its fourth quarter (Q4) financial results on May 6. This indicates that the company is preparing to release its earnings report for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1743172673000,
            "Source": "result"
        },
        {
            "Title": "Aadhar Housing Finance: Plans 75 New Branches Annually for Expansion",
            "Summary": "Aadhar Housing Finance Ltd. aims to add up to 75 branches annually to its network for the next two to three years, continuing its market penetration strategy. The company has already added about 60 branches this financial year.",
            "Sentiment": "positive",
            "PublishDate": 1739851870000,
            "Source": "normal_news"
        },
        {
            "Title": "Aadhar Housing Finance: Analysts Remain Bullish Post Q3 Results",
            "Summary": "Brokerages maintain positive outlook on Aadhar Housing Finance after Q3FY25 results, with some raising target prices. The company reported 18% YoY PAT growth to ₹2.4 billion, driven by strong NII growth. Analysts expect 21% EPS CAGR during FY25-27F, with average RoA/RoE of 4.5%/17%. The company is on track to meet its FY25E disbursement and AUM growth guidance of 18-20% and 20-22% respectively.",
            "Sentiment": "positive",
            "PublishDate": 1739189023000,
            "Source": "earnings"
        },
        {
            "Title": "Aadhar Housing Finance: Q3 Profit Rises 17% on Steady Growth",
            "Summary": "Aadhar Housing Finance reported a 17% year-on-year increase in Q3 net profit to ₹239 crore. Total income rose 19% to ₹785 crore, while assets under management grew 21% to ₹23,976 crore. The company expects further growth due to recent budget announcements on income tax exemptions.",
            "Sentiment": "positive",
            "PublishDate": 1738887747000,
            "Source": "earnings"
        },
        {
            "Title": "Aadhar Housing Finance Reports Q3 Profit and Revenue Growth",
            "Summary": "Aadhar Housing Finance has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 2.4 billion rupees from 2 billion rupees in the same quarter last year. Revenue also saw a notable rise, reaching 7.98 billion rupees compared to 6.73 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1738846911000,
            "Source": "earnings"
        },
        {
            "Title": "Aadhar Housing Finance Board to Consider NCD Issuance Limit Revalidation",
            "Summary": "Aadhar Housing Finance has announced a board meeting scheduled for February 6. The primary agenda is to consider revalidating the 20 billion rupees limit for Non-Convertible Debenture (NCD) issuance. This meeting suggests the company is evaluating its debt financing strategies and potentially preparing for future capital raising activities.",
            "Sentiment": "neutral",
            "PublishDate": 1737333462000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aadhar Housing Finance to Consider Revalidation of NCD Issuance Limit",
            "Summary": "Aadhar Housing Finance has announced a board meeting scheduled for February 6 to consider revalidating the 20 billion rupees limit for Non-Convertible Debenture (NCD) issuance. This decision indicates the company's potential plans to raise funds through debt instruments.",
            "Sentiment": "neutral",
            "PublishDate": 1737125108000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aadhar Housing Finance to Consider Q3 Results",
            "Summary": "Aadhar Housing Finance has announced that it will consider its financial results for the third quarter on February 6. This indicates the company is preparing to disclose its performance for the most recent fiscal period to shareholders and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1737122768000,
            "Source": "result"
        },
        {
            "Title": "Aadhar Housing Finance: Citi Initiates Coverage with 42% Upside Potential",
            "Summary": "Citi Research initiated coverage on Aadhar Housing Finance with a 'Buy' rating and a target price of ₹565, indicating a 42.85% upside. The company's shares surged 5.8% intraday. Citi projects 22% PAT growth for FY24-27, based on 21% CAGR in AUM, 7-7.1% NIMs, and 0.3-0.4% credit costs. The company's focus on affordable housing, regional strength, and tech-driven efficiency were highlighted as key factors.",
            "Sentiment": "positive",
            "PublishDate": 1737104156000,
            "Source": "normal_news"
        }
    ]
}