{
    "Symbol": "AAREYDRUGS",
    "ISIN": "INE198H01019",
    "News": [
        {
            "Title": "Aarey Drugs Q3FY26 Revenue Drops 28% to ₹9,642.63 Lakhs",
            "Summary": "Aarey Drugs & Pharmaceuticals reported Q3FY26 revenue of ₹9,642.63 lakhs, down from ₹13,378.86 lakhs in Q3FY25. Net profit declined to ₹56.95 lakhs from ₹71.80 lakhs year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1770818091263,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aarey Drugs Reports Q2 FY2026 Financial Results with Fixed Asset Purchases",
            "Summary": "Aarey Drugs and Pharmaceuticals Limited approved its unaudited financial results for the quarter and half year ended September 30, 2025, along with statements of assets, liabilities, and cash flow. The company purchased certain fixed assets during the reporting period that are not yet ready for intended use, with depreciation to commence once assets are fully installed and commissioned.",
            "Sentiment": "neutral",
            "PublishDate": 1763054294246,
            "Source": "earnings"
        },
        {
            "Title": "Aarey Drugs & Pharmaceuticals Reports Quarterly Financial Results for June 2025",
            "Summary": "Aarey Drugs & Pharmaceuticals Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025. The company reported total income of Rs. 1,037.60 lakhs compared to Rs. 1,288.71 lakhs in the same quarter last year. Profit for the period was Rs. 13.73 lakhs versus Rs. 12.39 lakhs in the corresponding quarter of the previous year. Basic earnings per share stood at Rs. 0.48 compared to Rs. 0.44 in the year-ago period. The company operates in a single segment of manufacturing and trading of drugs and pharmaceuticals. The results were reviewed by auditors Motilal & Associates LLP and certified by Managing Director Mihir R. Ghatalia and Chief Financial Officer Mira M. Ghatalia.",
            "Sentiment": "neutral",
            "PublishDate": 1755092046362,
            "Source": "earnings"
        },
        {
            "Title": "Aarey Drugs & Pharmaceuticals Submits Revised Annual Financial Results to Correct Share Capital Error",
            "Summary": "Aarey Drugs & Pharmaceuticals Limited submitted revised audited financial results for the year ended March 31, 2025, to correct a clerical error in the paid-up share capital disclosure. The company confirmed that no other changes were made to the originally submitted results. The auditors issued an unmodified opinion on the financial results, though they noted that some plant and machinery added to fixed assets is not yet ready for use, so depreciation has not been charged. The auditors also highlighted that some debtor and creditor balances are subject to confirmation as confirmations were not available from all parties.",
            "Sentiment": "neutral",
            "PublishDate": 1753883725073,
            "Source": "earnings"
        }
    ]
}