{
    "Symbol": "AARTISURF",
    "ISIN": "INE09EO01013",
    "News": [
        {
            "Title": "Aarti Surfactants Q3 Net Profit Surges 306% YoY",
            "Summary": "Aarti Surfactants reports strong Q3 performance with net profit jumping to ₹37.00 million from ₹9.10 million year-on-year, while revenue grows 31% to ₹2.10 billion.",
            "Sentiment": "positive",
            "PublishDate": 1768831561894,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aarti Surfactants Board Meet on Jan 19 for Q3 Results",
            "Summary": "Aarti Surfactants Limited has scheduled its board meeting for January 19, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window remains closed until 48 hours post-declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1768216350423,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aarti Surfactants Credit Rating Downgraded by CARE",
            "Summary": "CARE Ratings downgrades Aarti Surfactants' credit rating from CARE A- to CARE BBB+ for bank facilities worth ₹208.87 crores, citing subdued margins in H1 FY26.",
            "Sentiment": "negative",
            "PublishDate": 1766150278297,
            "Source": "stocks"
        },
        {
            "Title": "Aarti Surfactants Reports Mixed Q2 Results with EBITDA Surge but Lower Net Profit",
            "Summary": "Aarti Surfactants delivered mixed quarterly results with EBITDA rising significantly to 94 million rupees from 37 million rupees year-over-year, while EBITDA margin expanded to 5.22% from 2.46%. Revenue grew to 1.79 billion rupees compared to 1.5 billion rupees in the same period last year. However, net profit declined to 16 million rupees from 19 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1762785567573,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Surfactants Appoints Two New Directors and Secretarial Auditors at 7th AGM",
            "Summary": "Aarti Surfactants Limited shareholders approved key appointments at their 7th Annual General Meeting held on September 23, 2025. Mr. Parimal H. Desai was appointed as Non-Executive Director, effective October 1, 2025. Desai holds a bachelor's degree in chemical engineering from UDCT Mumbai and has nearly five decades of experience in the chemical industry. He is the father of the company's CEO & Managing Director, Mr. Nikhil P. Desai, and is also a company promoter. Mrs. Nisha B. Shah was appointed as Independent Director for three years, effective October 1, 2025. Shah is a Chartered Accountant and CFA Level II professional with over 22 years of experience in investment strategies, private equity, and family office advisory. She is a Partner at AUM Ventures and meets independence criteria under Companies Act 2013 and SEBI regulations. Additionally, M/s. Parikh & Associates was appointed as Secretarial Auditors for five consecutive years, effective April 1, 2025. The firm, established in 1987, provides corporate law and regulatory compliance services to several large companies including top 100 listed entities in India.",
            "Sentiment": "positive",
            "PublishDate": 1758730386055,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aarti Surfactants Reports Quarterly Results, Appoints New Directors and Secretarial Auditors",
            "Summary": "Aarti Surfactants Limited announced its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. On standalone basis, revenue from operations increased to Rs 21,589.92 lakhs compared to Rs 14,340.90 lakhs in the same quarter last year. Net profit stood at Rs 305.79 lakhs versus Rs 233.14 lakhs in the previous year quarter. The Board approved the appointment of Mr. Parimal H. Desai as Non-Executive Director and Mrs. Nisha B. Shah as Independent Director for three years, both effective October 1, 2025, subject to shareholder approval. Mr. Desai is the father of the company's CEO & Managing Director and a promoter of the company. Mrs. Shah is a Chartered Accountant with over 22 years of experience in investment strategies and private equity. The Board also appointed M/s. Parikh & Associates as Secretarial Auditors for five consecutive years from FY 2025-2026 to FY 2029-2030.",
            "Sentiment": "positive",
            "PublishDate": 1754408839559,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Surfactants Reports Q4 Profit Growth and Dividend Announcement",
            "Summary": "Aarti Surfactants has reported a significant increase in net profit for Q4, rising to 98.4 million rupees from 55.9 million rupees year-over-year. The company's revenue also grew to 2.02 billion rupees from 1.59 billion rupees in the same period last year. Additionally, Aarti Surfactants has recommended a dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747095759000,
            "Source": "default"
        },
        {
            "Title": "Aarti Surfactants Reports Strong Q4 Results and Declares Dividend",
            "Summary": "Aarti Surfactants announced its Q4 financial results, showing significant year-over-year growth. The company's revenue increased to 2.02 billion rupees from 1.59 billion rupees in the previous year. EBITDA rose to 197.5 million rupees, up from 152 million rupees, with the EBITDA margin slightly improving to 9.77%. Net profit saw a substantial increase to 98.4 million rupees, compared to 55.9 million rupees in the same quarter last year. Additionally, the company has recommended a dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747068729000,
            "Source": "result"
        },
        {
            "Title": "Aarti Surfactants Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Aarti Surfactants has reported a significant decrease in its Q3 EBITDA, which fell to 89 million rupees from 167 million rupees in the same quarter last year. The company's EBITDA margin also declined, dropping to 5.49% from 12.06% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739015674000,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Surfactants Reports Decline in Q3 Net Profit",
            "Summary": "Aarti Surfactants has reported a significant decrease in net profit for the third quarter, dropping to 9.1 million rupees from 67 million rupees in the same period last year. Despite the profit decline, the company's revenue increased to 1.63 billion rupees from 1.4 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739015668000,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Surfactants Reports Loss in Q2 FY25",
            "Summary": "Aarti Surfactants has reported a loss before tax (LBT) of 12 million in Q2 FY25, compared to a profit of 88 million in the same quarter last year. The company also recorded an exceptional item of 42 million in this quarter.",
            "Sentiment": "negative",
            "PublishDate": 1731332041000,
            "Source": "result"
        },
        {
            "Title": "AARTI SURFACTANTS Reports Significant Drop in Q2 EBITDA",
            "Summary": "AARTI SURFACTANTS has reported a substantial decrease in its Q2 EBITDA, which fell to 37 million rupees from 163 million rupees year-over-year. The company's EBITDA margin also declined sharply, dropping to 2.46% from 11.30% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731331976000,
            "Source": "result"
        },
        {
            "Title": "Aarti Surfactants Reports Q2 Financial Results",
            "Summary": "Aarti Surfactants has announced its Q2 financial results. The company's net profit for the quarter stands at 18 million rupees, showing a decrease from 47.5 million rupees year-over-year and 22 million rupees quarter-over-quarter. However, the company's revenue has increased to 1.5 billion rupees from 1.4 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731331916000,
            "Source": "result"
        }
    ]
}