{
    "Symbol": "AARTIDRUGS",
    "ISIN": "INE767A01016",
    "News": [
        {
            "Title": "Aarti Drugs Declares ₹2 Interim Dividend Per Share",
            "Summary": "Aarti Drugs announces interim dividend of ₹2 per share for shareholders, demonstrating the company's commitment to returning value to investors through regular dividend distributions.",
            "Sentiment": "positive",
            "PublishDate": 1770125990544,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aarti Drugs Q3 Net Profit Rises 9.7% to ₹406M",
            "Summary": "Aarti Drugs reports consolidated net profit of ₹406 million in Q3, up from ₹370 million year-on-year. Revenue increased to ₹6 billion from ₹5.57 billion in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1770125942925,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aarti Drugs Gets CRISIL Rating Reaffirmation",
            "Summary": "CRISIL Limited reaffirmed Aarti Drugs' credit ratings with AA-/Stable for long-term and A1+ for short-term facilities totaling Rs. 1,768 crores across multiple banking partners.",
            "Sentiment": "positive",
            "PublishDate": 1769700885201,
            "Source": "stocks"
        },
        {
            "Title": "Aarti Drugs Board Meet Set for Feb 3 on Q3 Results",
            "Summary": "Aarti Drugs Limited has scheduled its board meeting for February 3, 2026, to consider Q3FY26 audited financial results and potential interim dividend declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1769517531173,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aarti Drugs Reports 9% Revenue Growth to ₹653Cr with Improved Margins in Q2FY26",
            "Summary": "Aarti Drugs reported quarterly revenue of ₹653 crores, representing 9% year-over-year growth. EBITDA increased 23% to ₹84 crores with margins improving to 12.9%. The company commissioned its Sayakha Amines plant to enhance self-sufficiency for Metformin production. The Tarapur Salicylic Acid production line is expected to reach 500 tonnes monthly capacity by Q4FY26. The company targets sustained double-digit growth through backward integration and export expansion, with plans to strengthen U.S. and EU regulatory approvals to drive high-value API exports and margin expansion over FY27-FY29.",
            "Sentiment": "positive",
            "PublishDate": 1762529710245,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Drugs Reports Strong Q2 Performance with 58% Profit Growth",
            "Summary": "Aarti Drugs Limited announced its audited financial results for the quarter and half-year ended September 30, 2025. The company reported standalone net profit of Rs 48.64 crores for Q2, compared to Rs 30.39 crores in the previous quarter, representing significant growth. For the half-year period, standalone profit reached Rs 90.42 crores versus Rs 57.30 crores in the prior year. Total income for Q2 stood at Rs 520.52 crores. The company's new manufacturing plant at Sayakha, Gujarat commenced commercial operations from September 4, 2025. An HCl gas leakage incident occurred at the T-160 unit on September 8, 2025, leading to voluntary suspension of that process as a precautionary measure, though it had no material financial impact. The company completed a buyback of 6.65 lakh equity shares at Rs 900 per share in September 2024, reducing paid-up share capital to Rs 91.27 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762516940083,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Drugs Reports Strong Q2 Performance with Net Profit Surge to 420M Rupees",
            "Summary": "Aarti Drugs delivered strong quarterly results with net profit jumping to 420 million rupees compared to 30 million rupees in the same period last year. The company's EBITDA increased to 752 million rupees from 595 million rupees year-over-year. EBITDA margin improved to 13% from 11% in the corresponding quarter of the previous year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1762507298590,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Drugs Re-appoints Joint Managing Director and Names New Secretarial Auditor",
            "Summary": "Aarti Drugs Limited shareholders approved key appointments at their 40th Annual General Meeting held on September 24, 2025. The company re-appointed Shri Harshit Manilal Savla as Joint Managing Director, who was liable to retire by rotation and offered himself for re-appointment. Savla, a Commerce Graduate with over 38 years of experience in Finance, Exports and Administration, has been associated with the company since 1987 and played a crucial role in expanding the API and Formulation business. Additionally, shareholders approved the appointment of M/s. Mehta & Mehta, Practicing Company Secretaries, as Secretarial Auditors for a five-year term from Financial Year 2025-26 to 2029-30. The secretarial audit firm has over 25 years of experience in legal and secretarial consultancy and serves diversified industries.",
            "Sentiment": "neutral",
            "PublishDate": 1758727255862,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aarti Drugs Halts Chlorosulfonation Process at Tarapur Unit Following HCl Gas Leak",
            "Summary": "Aarti Drugs Limited received a Voluntary Closure Direction from Maharashtra Pollution Control Board to shut down the chlorosulfonation process at its PTSCL section in the T-150 unit at Tarapur, Maharashtra. The directive follows an HCl gas leakage incident that occurred on September 8, 2025, through the manhole of a scrubbing tank during operations. No injuries or casualties were reported. The company will cease the chlorosulfonation process after completing in-process batches as a precautionary safety measure. Aarti Drugs stated there will be no financial or material impact as it maintains sufficient inventory and can source from alternative suppliers if needed. Manufacturing of other products at the T-150 unit will continue operating. The company plans to conduct a safety audit and obtain required approvals from MPCB and Directorate of Industrial Safety and Health before resuming operations.",
            "Sentiment": "negative",
            "PublishDate": 1757495580802,
            "Source": "stock"
        },
        {
            "Title": "Aarti Drugs Launches New Manufacturing Facility in Sayakha",
            "Summary": "Aarti Drugs has announced the commercial launch of its manufacturing facility in Sayakha. The facility is now operational for commercial production.",
            "Sentiment": "positive",
            "PublishDate": 1756993754445,
            "Source": "stock"
        },
        {
            "Title": "Aarti Drugs Reports 6% Revenue Growth to INR591 Crores in Q1 FY26 with Improved Margins",
            "Summary": "Aarti Drugs Limited reported quarterly revenue growth of 6% year-on-year to INR591 crores, driven by a 5% growth in API business volumes. The company achieved gross profit margin improvement of 130 basis points to 36.8% and EBITDA growth of 12% to INR74 crores with margins at 12.6%. The improvement was attributed to normalization of input costs. The company's greenfield project at Sayakha Gujarat has started trial production for anti-diabetic products backward integration. The Tarapur facility for salicylic acid production faced initial startup issues but is expected to contribute from Q3 FY26, with current output below 200 tonnes per month targeting 800 tonnes soon. Formulation business grew 14% to INR80 crores with 57% from exports. The company received USFDA approval for its oncology facility and UK MHRA approval for oral solid dosage facility. Management expects capex of INR150-200 crores for FY26 and targets 15% CAGR volume growth over FY26-27. Net debt stands at INR597 crores with debt-to-equity ratio of 0.42-0.43.",
            "Sentiment": "positive",
            "PublishDate": 1753465871853,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Drugs Reports Strong Q1 Performance with 62% Jump in Net Profit",
            "Summary": "Aarti Drugs delivered robust quarterly results with consolidated net profit rising to 539 million rupees from 332 million rupees year-over-year, marking a significant 62% increase. Revenue grew to 5.9 billion rupees compared to 5.6 billion rupees in the same period last year. The company's EBITDA improved to 741 million rupees from 650 million rupees, while EBITDA margin expanded to 12.55% from 11.70% year-over-year, indicating improved operational efficiency and profitability across all key financial metrics.",
            "Sentiment": "positive",
            "PublishDate": 1753057591794,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Drugs Expands Operations with New Facilities and Production Targets",
            "Summary": "Aarti Drugs is positioned to benefit from U.S. tariffs on Chinese pharmaceutical imports. The company's salicylic acid plant is set to begin operations soon, with financial gains expected from the third quarter. The company plans to increase production to 800 tonnes monthly and expand capacity to approximately 1,600 tonnes monthly by the end of FY26. Additionally, Aarti Drugs has started trial production at its Sayakha facility for backward integration, targeting improved profit margins and reduced input cost fluctuations.",
            "Sentiment": "positive",
            "PublishDate": 1752907983140,
            "Source": "stock"
        },
        {
            "Title": "Aarti Drugs Spends Rs. 48.5 Crores on Capex in Q1 FY26, Projects Rs. 150-200 Crores for Full Year",
            "Summary": "Aarti Drugs reported capital expenditure of approximately Rs. 48.5 crores during Q1 FY26, allocated toward capacity expansion and research & development activities. The company anticipates total capital expenditure for FY26 to range between Rs. 150-200 crores.",
            "Sentiment": "positive",
            "PublishDate": 1752907666375,
            "Source": "stock"
        },
        {
            "Title": "Aarti Drugs Reports Q1 EBITDA and Margin Increase",
            "Summary": "Aarti Drugs has reported its Q1 financial results. The company's EBITDA increased to 741 million rupees from 650 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 12.55% from 11.70% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1752839868000,
            "Source": "result"
        },
        {
            "Title": "Aarti Drugs Reports Increased Q1 Profit and Revenue",
            "Summary": "Aarti Drugs has announced its Q1 consolidated financial results. The company's net profit increased to 539 million rupees from 332 million rupees in the same quarter last year. Revenue also saw growth, rising to 5.9 billion rupees from 5.6 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1752839797000,
            "Source": "result"
        },
        {
            "Title": "Aarti Drugs: Q1 Profit Surges 63%, Margins Improve",
            "Summary": "Aarti Drugs reported a 62.7% YoY increase in net profit to ₹54 crore for Q1 FY26. Revenue grew 6.3% to ₹590 crore, while EBITDA rose 14% to ₹74 crore. Operating margins expanded to 12.6% from 11.7% in Q1 FY25.",
            "Sentiment": "positive",
            "PublishDate": 1752839529000,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Drugs Reports Increased Q4 Profit and Revenue",
            "Summary": "Aarti Drugs has reported a consolidated net profit of 628.6 million rupees for Q4, up from 474 million rupees year-over-year and 370.5 million rupees quarter-over-quarter. The company's revenue also increased to 6.77 billion rupees, compared to 6.2 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1746576845000,
            "Source": "default"
        },
        {
            "Title": "Aarti Drugs Plans Significant Production Expansion by FY26",
            "Summary": "Aarti Drugs has announced a strategic plan to gradually increase its production capacity. The company aims to achieve a production scale of over 700 tonnes per month by June 2025, with a further target of reaching a cumulative capacity of approximately 1,600 tonnes per month by the end of the fiscal year 2026.",
            "Sentiment": "positive",
            "PublishDate": 1746543731000,
            "Source": "default"
        },
        {
            "Title": "Aarti Drugs Reports Q4 FY2023 Financial Results",
            "Summary": "Aarti Drugs announced its Q4 FY2023 financial results. The company's EBITDA increased to 933.2 million rupees from 858 million rupees year-over-year. Revenue grew to 6.77 billion rupees from 6.2 billion rupees. Consolidated net profit rose to 628.6 million rupees, up from 474 million rupees in the same quarter last year and 370.5 million rupees in the previous quarter. The EBITDA margin slightly decreased to 13.79% from 13.84% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1746531254000,
            "Source": "result"
        },
        {
            "Title": "Aarti Drugs: Q4 Profit Surges 33%, Revenue Up 9%",
            "Summary": "Aarti Drugs reported Q4 FY25 net profit of ₹62.9 crore, up 32.7% YoY. Revenue increased 9.2% to ₹677 crore. EBITDA rose 8.9% to ₹93.4 crore, while margins remained flat at 13.8%.",
            "Sentiment": "positive",
            "PublishDate": 1746530516000,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Drugs to Consider Q4 Results on May 6",
            "Summary": "Aarti Drugs Limited has announced that it will consider its fourth quarter (Q4) financial results on May 6. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1745936511000,
            "Source": "default"
        },
        {
            "Title": "SEBI Issues Administrative Warning Letter to Aarti Drugs",
            "Summary": "Aarti Drugs has received an administrative warning letter from the Securities and Exchange Board of India (SEBI). The details of the warning or the specific reasons for it are not provided in the given news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1741331889000,
            "Source": "corporate_governance"
        },
        {
            "Title": "SEBI Issues Administrative Warning to Aarti Drugs' Compliance Officer and Company Secretary",
            "Summary": "The Securities and Exchange Board of India (SEBI) has issued an administrative warning to Aarti Drugs Limited's Compliance Officer and Company Secretary. The company has stated that this warning will not impact its financial, operational, or other activities.",
            "Sentiment": "neutral",
            "PublishDate": 1741275604000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aarti Drugs Gains Approval for US Drug Exports",
            "Summary": "Aarti Drugs has received authorization to export several pharmaceutical products to the United States market. This development opens up new opportunities for the company to expand its international presence and potentially increase its revenue from the US pharmaceutical sector.",
            "Sentiment": "positive",
            "PublishDate": 1739526192000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aarti Drugs Gains Approval for API Exports to US Market",
            "Summary": "Aarti Drugs has received approval to export several Active Pharmaceutical Ingredients (APIs) to the United States market. The approved products include Ciprofloxacin HCL, Zolpidem Tartrate, Raloxifene HCL, Celecoxib, and Niacin APIs. This development opens up significant opportunities for the company in the US pharmaceutical market.",
            "Sentiment": "positive",
            "PublishDate": 1739526184000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aarti Drugs Removed from FDA Import Alert List",
            "Summary": "Aarti Drugs has received a letter from the US FDA informing that the company is no longer subject to refusal of admission and has been removed from Import Alert 66-40. This development suggests an improvement in the company's regulatory compliance and may positively impact its ability to export to the US market.",
            "Sentiment": "positive",
            "PublishDate": 1739526117000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aarti Drugs to Acquire 26.25% Stake in Pro-Zeal Green Power Nine",
            "Summary": "Aarti Drugs has announced its decision to acquire a 26.25% equity stake in Pro-Zeal Green Power Nine. The total cost of this acquisition is reported to be 80.5 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1738580480000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aarti Drugs Projects Healthy Volume Growth and Mid-Teens Revenue Growth for FY26",
            "Summary": "Aarti Drugs has announced positive projections for its fiscal year 2026. The company expects to achieve healthy volume growth and is targeting mid-teens revenue growth for FY26. This forecast suggests a strong outlook for the pharmaceutical company's future performance.",
            "Sentiment": "positive",
            "PublishDate": 1738220446000,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Drugs Forecasts Potential Revenue Decline and Stable Margins for FY25",
            "Summary": "Aarti Drugs, a pharmaceutical company, has projected that its revenue for the fiscal year 2025 may be slightly lower compared to fiscal year 2024. However, the company expects its profit margins to remain stable, ranging between 13-14% going forward.",
            "Sentiment": "neutral",
            "PublishDate": 1738220345000,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Drugs Reports Q3 Financial Results and Corporate Actions",
            "Summary": "Aarti Drugs announced its Q3 consolidated net profit of 370.5 million rupees, slightly up from 367 million rupees year-over-year. However, revenue decreased to 5.57 billion rupees from 6 billion rupees in the same period last year. The company declared an interim dividend of 1 rupee per equity share and approved a 250 million rupees investment in a subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1738197245000,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Drugs Approves 250 Million Rupee Investment in Subsidiary",
            "Summary": "Aarti Drugs has approved an investment of 250 million rupees (approximately $3 million USD) in one of its subsidiary companies. This decision reflects a significant corporate action that could potentially strengthen the company's position in the pharmaceutical sector.",
            "Sentiment": "positive",
            "PublishDate": 1738164427000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aarti Drugs Declares Interim Dividend",
            "Summary": "Aarti Drugs has announced an interim dividend of 1 rupee per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1738153760000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aarti Drugs Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Aarti Drugs has reported its Q3 financial results. The company's EBITDA decreased to 617.3 million rupees from 701.4 million rupees in the same quarter last year. The EBITDA margin also saw a decline, dropping to 11.09% from 11.58% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738153733000,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Drugs Reports Q3 Revenue Decline",
            "Summary": "Aarti Drugs, a pharmaceutical company, has reported its third-quarter revenue. The company's revenue for Q3 stood at 5.57 billion rupees, showing a decrease from 6 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1738153724000,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Drugs Reports Q3 Consolidated Net Profit",
            "Summary": "Aarti Drugs announced its Q3 consolidated net profit of 370.5 million rupees, showing a slight increase from 367 million rupees year-over-year. The company also reported a quarter-over-quarter increase from 350.1 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1738153716000,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Drugs Schedules Q3 Results Announcement",
            "Summary": "Aarti Drugs Limited has announced that it will consider and approve its financial results for the third quarter on January 29.",
            "Sentiment": "neutral",
            "PublishDate": 1737548504000,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Drugs: CFO Announces Export Plans for Tarapur Plant",
            "Summary": "Aarti Drugs' CFO states that exports from the company's Tarapur plant will commence within 18 months.",
            "Sentiment": "positive",
            "PublishDate": 1736161985000,
            "Source": "normal_news"
        },
        {
            "Title": "Aarti Drugs Targets ₹4000 Crore Revenue by FY27",
            "Summary": "Aarti Drugs has announced its goal to achieve a revenue of ₹4000 crore by the fiscal year 2027. This target is based on current API (Active Pharmaceutical Ingredient) prices. The company's ambitious revenue projection suggests a strategic growth plan in the pharmaceutical sector.",
            "Sentiment": "positive",
            "PublishDate": 1736147337000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aarti Drugs: FDA Clears Tarapur API Facility, Shares Surge 11%",
            "Summary": "Aarti Drugs received an Establishment Inspection Report (EIR) from the US FDA for its API manufacturing facility in Tarapur, Maharashtra. The inspection was classified as 'voluntary action indicated' (VAI), indicating minimal compliance issues. No violations were found, and the facility is cleared to continue exporting specific APIs to the U.S. market.",
            "Sentiment": "positive",
            "PublishDate": 1735034214000,
            "Source": "normal_news"
        },
        {
            "Title": "Aarti Drugs Gains Approval for API Exports to US Market",
            "Summary": "Aarti Drugs has received approval to export several Active Pharmaceutical Ingredients (APIs) to the United States market. The approved products include Ciprofloxacin HCL, Zolpidem Tartrate, Raloxifene HCL, Celecoxib, and Niacin APIs.",
            "Sentiment": "positive",
            "PublishDate": 1735033664000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aarti Drugs Receives FDA EIR for Manufacturing Facility",
            "Summary": "Aarti Drugs has announced the receipt of an Establishment Inspection Report (EIR) from the U.S. Food and Drug Administration (FDA) for one of its manufacturing facilities. This indicates that the FDA has completed its inspection of the facility and has closed out the inspection process.",
            "Sentiment": "positive",
            "PublishDate": 1735033113000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aarti Drugs Announces Expansion Plans and Revenue Projections",
            "Summary": "Aarti Drugs has revealed plans for a significant capacity expansion through a Rs. 600 crore capital expenditure. The company projects that this expansion, along with full ramp-up of existing capacity, will result in a revenue potential of Rs. 4,200 - 4,500 crores with improved profit margins over the next 5-6 years. This information was shared in an investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1729826631000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aarti Drugs Ramps Up Salicylic Acid Production",
            "Summary": "Aarti Drugs has begun production of salicylic acid, currently at 100 tonnes per month. The company plans to increase production to over 300 tonnes by October 2024, with a sequential capacity ramp-up to 1,800 tonnes throughout fiscal years 2025 and 2026.",
            "Sentiment": "positive",
            "PublishDate": 1729821820000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aarti Drugs Reports Q2 Financial Results",
            "Summary": "Aarti Drugs has reported its Q2 financial results. The company's EBITDA for the quarter was 670.5 million rupees, compared to 765 million rupees in the same quarter last year. The EBITDA margin for Q2 was 11.21%, down from 11.92% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1729785858000,
            "Source": "result"
        },
        {
            "Title": "Aarti Drugs Reports Q2 Revenue Decline",
            "Summary": "Aarti Drugs, a pharmaceutical company, has reported its second-quarter revenue for the current fiscal year. The company's revenue stood at 5.98 billion rupees, showing a decrease from 6.4 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1729785841000,
            "Source": "result"
        },
        {
            "Title": "Aarti Drugs Reports Q2 Financial Results",
            "Summary": "Aarti Drugs announced its Q2 consolidated net profit of 350.1 million rupees, compared to 369 million rupees year-over-year and 332.4 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1729785834000,
            "Source": "result"
        },
        {
            "Title": "Aarti Drugs: UK MHRA Grants GMP Compliance to Subsidiary",
            "Summary": "<p><span class=\"positive\">Aarti Drugs'</span> subsidiary, <span class=\"positive\">Pinnacle Life Science</span>, received a <b>GMP Compliance Certificate</b> from <span class=\"neutral\">UK MHRA</span> for its <span class=\"neutral\">Himachal Pradesh</span> facility. This enables Pinnacle to <span class=\"positive\">export formulations</span> to the UK market. The company reported <span class=\"neutral\">no immediate financial impact</span> or operational violations.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728020340000,
            "Source": "normal_news"
        },
        {
            "Title": "Aarti Drugs Receives GMP Certificate from UK-MHRA",
            "Summary": "<p>Aarti Drugs has announced that it has received a <span class='positive'>Good Manufacturing Practice (GMP) certificate</span> from the <b>UK Medicines and Healthcare products Regulatory Agency (MHRA)</b> for one of its <span class='positive'>manufacturing facilities</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727972326000,
            "Source": "corporate_action"
        }
    ]
}