{
    "Symbol": "AARTECH",
    "ISIN": "INE01C001026",
    "News": [
        {
            "Title": "Aartech Solonics Board Meet on Feb 12 for Q3FY26",
            "Summary": "Aartech Solonics Limited has scheduled its board meeting for February 12, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770289972857,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aartech Solonics Reports Strong Q3 Growth",
            "Summary": "Aartech Solonics secured major orders from IOCL, PSPCL, and expanded internationally to Oman, Qatar, and Africa. BestCase division ranked among top 25 global manufacturers.",
            "Sentiment": "positive",
            "PublishDate": 1767591113607,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aartech Solonics Promoter Amit Anil Raje Acquires Additional 10,145 Equity Shares",
            "Summary": "Amit Anil Raje, a promoter of Aartech Solonics Limited, acquired 10,145 equity shares (0.03%) through open market transactions on November 24, 2025. Following this acquisition, Raje now holds 47,13,645 equity shares in the engineering company, with the disclosure made under SEBI regulations for substantial acquisitions and insider trading.",
            "Sentiment": "neutral",
            "PublishDate": 1764069122038,
            "Source": "corporate_action"
        },
        {
            "Title": "Aartech Solonics Reports Strong Q2 Performance with 361% Profit Growth",
            "Summary": "Aartech Solonics Limited reported quarterly results for the quarter ended September 30, 2025, with standalone profit surging to ₹361.37 lakhs compared to ₹150.25 lakhs in the previous quarter, driven by revenue growth to ₹3,131 lakhs. The company's board approved both standalone and consolidated unaudited financial results, with consolidated profit reaching ₹260.56 lakhs for the quarter, reflecting strong operational performance across its electrical manufacturing business.",
            "Sentiment": "positive",
            "PublishDate": 1763136654415,
            "Source": "earnings"
        },
        {
            "Title": "Aartech Solonics Reports Fire Incident at Madhya Pradesh Manufacturing Unit",
            "Summary": "Aartech Solonics Limited experienced a fire incident at its Mandideep factory in Madhya Pradesh on October 16, 2025, around 8:30 P.M. The fire caused damage to inventories, plant machinery, buildings, and furniture, leading to temporary disruption of operations at the facility. The fire was controlled within approximately four hours through efforts by the fire-fighting team and company employees. No casualties or injuries occurred during the incident. The company has adequate insurance coverage and has notified the insurance company about the incident. An insurance survey is expected to be conducted to assess the extent of loss and damage. The company is taking steps to restore normal operations at the plant. The cause of the fire has not yet been determined.",
            "Sentiment": "negative",
            "PublishDate": 1760703609524,
            "Source": "stock"
        },
        {
            "Title": "Aartech Solonics Reports Mixed Quarterly Results with Revenue Decline",
            "Summary": "Aartech Solonics Limited announced unaudited financial results for the quarter ended June 30, 2025. Standalone revenue from operations decreased to ₹433.18 lakhs from ₹660.93 lakhs in the same quarter last year. Net profit declined to ₹73.13 lakhs compared to ₹111.93 lakhs in the previous year quarter. Basic earnings per share dropped to ₹0.23 from ₹0.35. On a consolidated basis, the company reported net profit of ₹63.31 lakhs versus ₹104.24 lakhs in the prior year quarter. The company manufactures electrical items including control panels, bus transfer systems, and ultracapacitors, with operations confined to India. The company is involved in an ongoing dispute with associate entity Enerqual Technology Private Limited regarding share ownership, though management expects no material impact on financial results.",
            "Sentiment": "negative",
            "PublishDate": 1755177813604,
            "Source": "earnings"
        },
        {
            "Title": "Aartech Solonics Subsidiary Lays Foundation Stone for Energy Storage Manufacturing Facility in Madhya Pradesh",
            "Summary": "Aartech Solonics Limited announced that its wholly owned subsidiary, Faradigm Ultracapacitors Pvt Ltd, has laid the foundation stone for a new manufacturing facility in Mohasa-Babai, Madhya Pradesh. The facility will produce energy storage systems for renewable energy, defense, and transportation sectors, with operations expected to begin by the end of 2026. The land was allotted on a 99-year lease basis in 2024. Faradigm, established in 2017, specializes in research, design, development and manufacturing of energy storage devices including ultracapacitors and energy storage applications. The development aligns with national initiatives such as Make in India and Atmanirbhar Bharat. Aartech Solonics, founded in 1982 and headquartered in Bhopal, is an R&D-driven technology company working in power, energy, and specialized systems.",
            "Sentiment": "positive",
            "PublishDate": 1753529860893,
            "Source": "stock"
        },
        {
            "Title": "Aartech Solonics: Develops Power Module for Military Vehicles with Army, IIT",
            "Summary": "Aartech Solonics Limited has developed an Adaptive Alternate Power Module (AAPM) for armored fighting vehicles in collaboration with the Indian Army and IIT Mumbai. The module provides regulated DC power without running the main engine, potentially extending engine life by 20% and reducing fuel consumption. It operates in temperatures from +60°C to -30°C, suitable for various terrains.",
            "Sentiment": "positive",
            "PublishDate": 1732261743000,
            "Source": "normal_news"
        }
    ]
}