{
    "Symbol": "AARTIIND",
    "ISIN": "INE769A01020",
    "News": [
        {
            "Title": "Aarti Industries Q3FY26 Earnings Call Recording Live",
            "Summary": "Aarti Industries has made available the audio recording of its Q3FY26 quarterly earnings conference call on company website for investor access.",
            "Sentiment": "neutral",
            "PublishDate": 1770132742536,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aarti Industries Q3FY26 Earnings Call on Feb 3",
            "Summary": "Aarti Industries Limited has scheduled its quarterly earnings conference call for February 3, 2026 at 12:00 pm IST to discuss Q3FY26 financial results with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1769512326153,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aarti Industries Secures Long-Term Feedstock Deals",
            "Summary": "Aarti Industries finalizes strategic long-term supply agreements for methanol and toluene feedstock, strengthening its raw material procurement strategy for sustained operations.",
            "Sentiment": "positive",
            "PublishDate": 1766111715810,
            "Source": "stocks"
        },
        {
            "Title": "Aarti Industries Faces Rs 3.8 Million Tax Penalty",
            "Summary": "Aarti Industries has been imposed a penalty of Rs 3.8 million by tax authorities. The penalty affects the company's financial obligations and regulatory compliance status.",
            "Sentiment": "negative",
            "PublishDate": 1764949981116,
            "Source": "stock"
        },
        {
            "Title": "Aarti Industries Reports Strong Q2FY26 Results with 21% Revenue Growth Despite US Tariff Challenges",
            "Summary": "Aarti Industries delivered robust quarterly results with revenue rising 21% quarter-on-quarter to Rs. 2,250 crore and EBITDA surging 36% to Rs. 292 crore, driven by improved volumes and capacity utilization. The specialty chemicals company successfully diversified markets toward Europe, Middle East and Africa to offset US tariff impacts while maintaining growth momentum through operational leverage and cost optimization initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1763127721897,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Industries Reports 26% Revenue Growth in Q2 FY26, Driven by MMA Capacity Expansion",
            "Summary": "Aarti Industries reported revenue growth of 26% year-over-year and 21% quarter-over-quarter in Q2 FY26, reaching Rs. 2,250 crore. The growth was primarily driven by increased volumes in MMA (Methyl Methacrylate) products and benefits from deferred bulk shipments from Q1. MMA achieved highest quarterly production with 98% capacity utilization at 260 KT capacity. The company secured a long-term chlorine supply agreement with DCM Shriram, increasing supply from 150 TPD to 350 TPD to support future downstream growth. However, margins remained under pressure across most product portfolios, and US tariffs impacted volumes for key end-use applications including dyes and polymers. The company is fast-tracking execution of capacity expansions, including MMA debottleneckingto 300 KT and PEDA capacity of 4000 MT, both expected to commission in Q4 FY26. Finance costs included forex mark-to-market loss of Rs. 34 crore on ECB borrowings. The company received favorable income tax appellate orders resulting in exceptional income of Rs. 29 crore, while exceptional expenses included Rs. 7 crore provision for doubtful land advance.",
            "Sentiment": "neutral",
            "PublishDate": 1762476688199,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Industries Reports 130% Jump in Quarterly Net Profit to Rs 101 Crores",
            "Summary": "Aarti Industries reported a net profit of Rs 101 crores for the quarter ended September 30, 2025, compared to Rs 44 crores in the previous quarter, marking a significant increase. Revenue from operations rose to Rs 2,085 crores from Rs 1,636 crores quarter-on-quarter. The company recorded exceptional income of Rs 22 crores, primarily from Rs 29 crores interest income received on historic income tax appeals for assessment years 2010-11 to 2019-20. However, the company took a Rs 7 crores provision for an advance payment made to an NBFC for land purchase, which is now under dispute. For the half-year period, net profit increased to Rs 144 crores from Rs 193 crores in the previous year. The company operates in specialty chemicals segment and maintains AA/Stable credit ratings from CRISIL and India Ratings. Commercial papers outstanding as of September 30, 2025 stood at Rs 400 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762429460033,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Industries Schedules Q2FY26 Earnings Conference Call for November 7, 2025",
            "Summary": "Aarti Industries Limited has scheduled a quarterly earnings conference call for investors and analysts on Friday, November 7, 2025 at 12:30 p.m. IST to discuss the company's Q2FY26 results. The results will be declared on Thursday, November 6, 2025. The conference call will begin with a management discussion followed by a Q&A session. The management team will be represented by Mr. Suyog Kotecha (ED CEO) and Mr. Chetan Gandhi (CFO). Participants can join via multiple international dial-in numbers and are encouraged to pre-register for the call. Aarti Industries is described as one of the world's leading specialty chemicals companies, ranking 1st-4th globally for 75% of its portfolio.",
            "Sentiment": "neutral",
            "PublishDate": 1761832921348,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Industries Stock Down 50% Despite Improved Analyst Sentiment",
            "Summary": "Aarti Industries ranks among a dozen Nifty500 stocks posting negative returns over five years. The stock has declined nearly 50% in the last 12 months despite improved analyst sentiment. Analyst recommendations shifted from solely 'Buy' ratings to 60% 'Sell' calls in November 2024. Currently, half of the 24 Bloomberg-tracked analysts recommend buying the stock, though investor enthusiasm remains subdued.",
            "Sentiment": "negative",
            "PublishDate": 1755093340069,
            "Source": "stock"
        },
        {
            "Title": "Aarti Industries Reports Strong Chemical Export Growth",
            "Summary": "Aarti Industries reported significant growth in chemical exports with a 45% increase year-over-year and 169% growth quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754976092063,
            "Source": "stock"
        },
        {
            "Title": "Aarti Industries Q1 FY26 Revenue Falls 16% to Rs 1,867 Crore Amid Raw Material Price Volatility and Geopolitical Disruptions",
            "Summary": "Aarti Industries reported quarterly revenue of Rs 1,867 crore, declining 16% quarter-on-quarter, with EBITDA at Rs 215 crore (down 19% QoQ) and profit after tax of Rs 43 crore. The company faced multiple headwinds including 15-20% decline in key input prices (benzene and aniline), inventory valuation losses of Rs 30 crore, and operational disruptions from India-Pakistan tensions affecting their Kutch facility. Export shipments worth Rs 15-20 crore EBITDA were deferred due to Israel-Iran conflict and Kandla Port shutdowns. The company expanded MMA capacity from 200 KTPA to 260 KTPA and scaled up Nitrotoluene capacity from 30 to 45 KTPA. US tariff announcements created uncertainty as the US market represents 15-20% of revenues. Zone IV projects are progressing with phased commissioning expected from H2 FY26. Management maintains three-year EBITDA guidance of Rs 1,800 crore despite current challenges. Capex for FY26 is expected below Rs 1,000 crore. The company exported approximately 20,000-22,000 tons of MMA in July, recovering from June deferrals.",
            "Sentiment": "negative",
            "PublishDate": 1754628625184,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Industries Sets Record Date for 20% Dividend Payment",
            "Summary": "Aarti Industries Limited has set August 18, 2025 as the record date for a proposed 20% dividend of Re.1 per equity share of Rs. 5 each. The dividend recommendation was made during a Board Meeting held on May 8, 2025. The dividend payment is subject to shareholder approval at the Annual General Meeting scheduled for August 25, 2025. If approved, the dividend will be paid on or before September 24, 2025. Shareholders registered in the Register of Members as of the record date will be eligible for the dividend payment.",
            "Sentiment": "positive",
            "PublishDate": 1754048046497,
            "Source": "corporate_action"
        },
        {
            "Title": "Aarti Industries Reports Resilient Performance Despite Challenging Quarter",
            "Summary": "Aarti Industries demonstrated strength during a difficult quarterly period. The company has expansion plans in place and maintains a diversified product portfolio as it positions itself for recovery.",
            "Sentiment": "positive",
            "PublishDate": 1753977020982,
            "Source": "stock"
        },
        {
            "Title": "Aarti Industries Reports Mixed Q1 Results with Standalone Net Profit Down 68% YoY",
            "Summary": "Aarti Industries released its quarterly results for the period ended June 30, 2025. On a standalone basis, the company reported net revenue of Rs 1,845 crores compared to Rs 1,991 crores in the same quarter last year. Net profit declined significantly to Rs 44 crores from Rs 138 crores year-over-year, representing a 68% drop. Earnings per share fell to Rs 1.20 from Rs 3.80 in the previous year quarter. On a consolidated basis, net revenue was Rs 1,676 crores versus Rs 1,851 crores last year, with net profit at Rs 43 crores compared to Rs 137 crores in the prior year quarter. The company maintained its credit ratings of AA/Stable from CRISIL and India Ratings. Commercial papers outstanding stood at Rs 400 crores as of June 30, 2025. The company issued 33,408 equity shares under its employee stock option plan during the quarter. Operating margins compressed to 11.6% from 15.3% year-over-year on a standalone basis.",
            "Sentiment": "negative",
            "PublishDate": 1753966988343,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Industries Reports Decline in Q1 Financial Performance",
            "Summary": "Aarti Industries reported weaker quarterly results with consolidated net profit falling to 430 million rupees compared to 1.4 billion rupees in the same period last year. Revenue decreased to 16.8 billion rupees from 18.6 billion rupees year-over-year. EBITDA dropped to 2.12 billion rupees from 3.05 billion rupees, while EBITDA margin compressed to 12.65% from 16.44% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1753965056809,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Industries Schedules Q1 FY26 Earnings Conference Call for August 1, 2025",
            "Summary": "Aarti Industries Limited has scheduled a quarterly earnings conference call for investors and analysts on August 1, 2025, at 11:00 AM IST to discuss Q1 FY26 results. The call will begin with management discussion on the quarterly results to be declared on July 31, 2025, followed by a Q&A session. The management team will be represented by ED & CEO Suyog Kotecha and CFO Chetan Gandhi. The company describes itself as a leading global specialty chemicals company that ranks globally 1st-4th position for 75% of its portfolio.",
            "Sentiment": "neutral",
            "PublishDate": 1753360715202,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Industries: Strategic Expansion and Cost Optimization Drive Share Surge",
            "Summary": "Aarti Industries shares have gained 20% in three months due to capacity ramp-up, planned ₹1,000 crore capex in FY26, and cost optimization efforts. The company aims to increase utilization of key units to 85% and targets Ebitda of ₹1,800-₹2,200 crore over the next three years.",
            "Sentiment": "positive",
            "PublishDate": 1751588846000,
            "Source": "normal_news"
        },
        {
            "Title": "Anti-Dumping Inquiry Initiated for Para Nitrotoluene Imports from EU",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has initiated an anti-dumping investigation into Para Nitrotoluene imports from the European Union. This inquiry affects Aarti Industries, a company likely involved in the production or trade of Para Nitrotoluene.",
            "Sentiment": "neutral",
            "PublishDate": 1750303915000,
            "Source": "default"
        },
        {
            "Title": "Aarti Industries: Demand Recovery Visible, Margin Improvement Uncertain",
            "Summary": "Aarti Industries reports broad-based demand recovery across end markets. Q4 FY25 profit doubled sequentially to ₹96 crore. FY25 EBITDA at ₹1,016 crore. Company targets ₹1,800-2,200 crore EBITDA by FY28, driven by cost optimization, operating leverage, and new capex. Expects strong double-digit volume growth to continue. FY25 capex planned at ₹1,000 crore, mostly for greenfield site. Current debt at ₹3,500 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1747045370000,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Industries: Q4 Results Beat Estimates Amid Pricing Pressures",
            "Summary": "Aarti Industries' Q4 FY25 Ebitda surpassed estimates, driven by 17% YoY volume growth across key verticals. The company faced ongoing pricing pressures in key value chains. Management provided positive commentary on volume trajectory for both energy and non-energy end-user segments.",
            "Sentiment": "positive",
            "PublishDate": 1746796144000,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Industries: Q4 Profit Doubles, Revenue Up 13% YoY",
            "Summary": "Aarti Industries reported Q4 FY25 consolidated net profit of ₹96 crore, doubling from Q3. Revenue rose 13% YoY to ₹2,214 crore. FY25 saw 13% revenue growth with EBITDA at ₹1,016 crore. The company plans to commission Zone IV projects in FY26 and aims for 75% green energy usage by FY27. A final dividend of ₹1 per share was recommended.",
            "Sentiment": "positive",
            "PublishDate": 1746711609000,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Industries Q4 Results and Dividend Announcement",
            "Summary": "Aarti Industries has announced its Q4 results and dividend recommendation. The company's EBITDA for Q4 was 2.7 billion rupees, down from 2.83 billion rupees year-over-year. The EBITDA margin decreased to 13.75% from 15.96% in the same period last year. Additionally, the company has recommended a dividend of 1 rupee per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1746707757000,
            "Source": "result"
        },
        {
            "Title": "Aarti Industries Reports Q4 FY23 Financial Results",
            "Summary": "Aarti Industries announced its Q4 FY23 consolidated financial results. The company reported a net profit of 960 million rupees, down from 1.32 billion rupees year-over-year and up from 460 million rupees quarter-over-quarter. Revenue for Q4 stood at 19.5 billion rupees, an increase from 17.73 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1746707635000,
            "Source": "result"
        },
        {
            "Title": "Aarti Industries to Consider Q4 Results on May 8",
            "Summary": "Aarti Industries has announced that it will consider its fourth quarter (Q4) financial results on May 8. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746019724000,
            "Source": "default"
        },
        {
            "Title": "Aarti Industries Invests 167.1 Million Rupees in Clean Max Indus",
            "Summary": "Aarti Industries has announced that it has entered into an agreement to infuse capital of 167.1 million rupees into Clean Max Indus. This investment represents a significant corporate action by Aarti Industries, potentially aimed at expanding its portfolio or strengthening its position in the clean energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1741179027000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aarti Industries' Subsidiary Acquires Stake in Re Aarti Private",
            "Summary": "Aarti Circularity, a subsidiary of Aarti Industries, has acquired a 49% equity stake in Re Aarti Private. This acquisition represents a significant corporate action that could potentially impact Aarti Industries' business operations and strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1740702214000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aarti Industries' Subsidiary Acquires Stake in Re Aarti Private",
            "Summary": "Aarti Circularity, a subsidiary of Aarti Industries, has acquired a 49% equity stake in Re Aarti Private. This acquisition represents a significant corporate action that could potentially impact the company's operations and market position.",
            "Sentiment": "neutral",
            "PublishDate": 1740661980000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aarti Industries: 10% Volume Growth Expected in FY25-26",
            "Summary": "Aarti Industries anticipates 9-10% volume growth in FY25 and FY26, driven by capacity expansions. Two new capacities and a greenfield site will boost volumes over the next eight quarters. The company expects to surpass its margin guidance earlier than anticipated, currently set at 15% Ebitda margin.",
            "Sentiment": "positive",
            "PublishDate": 1738723389000,
            "Source": "normal_news"
        },
        {
            "Title": "Aarti Industries Reports Q3 Financial Results",
            "Summary": "Aarti Industries Limited has announced its Q3 consolidated financial results. The company reported a net profit of 460 million Rupees, which is lower compared to 1.24 billion Rupees in the same quarter last year (YoY) and 520 million Rupees in the previous quarter (QoQ). However, the company's revenue increased to 20.35 billion Rupees, up from 18.89 billion Rupees YoY and 17.86 billion Rupees QoQ.",
            "Sentiment": "neutral",
            "PublishDate": 1738542315000,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Industries: Q3 Profit Plunges 63% Despite Revenue Growth",
            "Summary": "Aarti Industries reported a 63% YoY decline in Q3 net profit to ₹46 crore, while revenue increased 6% to ₹1,840 crore. EBITDA fell 11.2% to ₹231 crore with margins contracting to 12.6%. The company cites market challenges and pricing pressures but remains focused on cost efficiencies and expansion.",
            "Sentiment": "negative",
            "PublishDate": 1738412477000,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Industries Acquires 26.25% Stake in Pro-Zeal Green Power Seven",
            "Summary": "Aarti Industries has acquired a 26.25% equity stake in Pro-Zeal Green Power Seven. This acquisition likely represents a strategic move by Aarti Industries to expand its presence in the green energy sector or to secure a more sustainable power source for its operations.",
            "Sentiment": "positive",
            "PublishDate": 1738077986000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aarti Industries to Consider Q3 Results on February 1",
            "Summary": "Aarti Industries Limited has announced that it will consider and approve its financial results for the third quarter on February 1. This indicates the company is preparing to disclose its performance for the latest financial period to shareholders and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1737725676000,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Industries Completes Ethylation Unit Capacity Enhancement",
            "Summary": "Aarti Industries has successfully completed a capacity enhancement project for its ethylation unit at the Dahej SEZ facility. The company has increased the production capacity from approximately 8-10 KTPA (Kilo Tonnes Per Annum) to about 25-30 KTPA, representing a significant expansion in manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1737678157000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aarti Industries Completes Ethylation Unit Capacity Enhancement",
            "Summary": "Aarti Industries has successfully completed a significant capacity enhancement of its ethylation unit at the Dahej SEZ unit. The company has increased the capacity for ethylation from approximately 8-10 KTPA (Kilo Tonnes Per Annum) to about 25-30 KTPA, marking a substantial expansion in production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1737642786000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aarti Industries: Stock Plunges on Lowered EBITDA Guidance",
            "Summary": "Aarti Industries' stock hit a 52-week low, falling 17% in three sessions. The company lowered its FY24 EBITDA guidance to ₹1,050 crore from ₹1,400 crore. Q2 results showed 12% revenue growth but 16% EBITDA decline and 43% drop in net profit. Margins were impacted by lower Mono Methyl Aniline utilization and new capacities in China.",
            "Sentiment": "negative",
            "PublishDate": 1731298764000,
            "Source": "result"
        },
        {
            "Title": "Aarti Industries Sets 3-Year Growth Targets",
            "Summary": "Aarti Industries has announced its growth outlook for the next 3 years. The company aims to achieve an EBITDA range of Rs 1800-2200 crore, maintain a debt to EBITDA ratio of less than 2.5x, and attain a Return on Capital Employed (ROCE) of over 15%.",
            "Sentiment": "positive",
            "PublishDate": 1731294585000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aarti Industries Revises Capex Estimates for FY25 and FY26",
            "Summary": "Aarti Industries has adjusted its capital expenditure (capex) estimates for the upcoming fiscal years. For FY25, the company has lowered its capex projection to Rs 1300-1500 crore from the earlier estimate of Rs 1500-1800 crore. Additionally, the company has provided a new capex estimate of around Rs 1000 crore for FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1731294577000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aarti Industries: Q2 Profit Plunges 43% Amid Margin Squeeze",
            "Summary": "Aarti Industries reported a 43% YoY decline in Q2 standalone net profit to ₹52 crore. Revenue grew 12% to ₹1,628 crore, but EBITDA fell 15.5% to ₹197 crore. EBITDA margin contracted to 12.1% from 16% YoY. The company's shares closed down 7.82% at ₹474.75 on the BSE.",
            "Sentiment": "negative",
            "PublishDate": 1731066265000,
            "Source": "result"
        }
    ]
}