{
    "Symbol": "AARTIPHARM",
    "ISIN": "INE0LRU01027",
    "News": [
        {
            "Title": "Aarti Pharmalabs Corrects Dividend Record Date Notice",
            "Summary": "Aarti Pharmalabs Limited issues corrigendum to fix typographical error in dividend record date intimation, correcting financial year reference from FY25 to FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1770796392977,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aarti Pharmalabs Q3FY26 Results Show Mixed Performance",
            "Summary": "Aarti Pharmalabs reported Q3FY26 operational revenue of INR 4,253 Mn with EBITDA of INR 1,030 Mn. Company faces operational challenges at Atali facility while expanding Xanthine capacity to 9,000+ MTPA.",
            "Sentiment": "neutral",
            "PublishDate": 1770709169115,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aarti Pharmalabs Allots 10,457 Equity Shares Under PSOP",
            "Summary": "Aarti Pharmalabs Limited allotted 10,457 equity shares to employees under its Performance Stock Option Plan 2023, increasing paid-up capital to Rs. 45,32,88,755 representing 9,06,57,751 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1770649847387,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aarti Pharmalabs faces Rs 2.60 lakh CGST penalty",
            "Summary": "Aarti Pharmalabs Limited receives penalty from CGST and Central Excise authority over alleged excess Input Tax Credit availment and incorrect tax liability declaration for FY2022-23 and FY2023-24.",
            "Sentiment": "negative",
            "PublishDate": 1770376348324,
            "Source": "stocks"
        },
        {
            "Title": "Aarti Pharmalabs Q3FY26 Earnings Call on Feb 10",
            "Summary": "Aarti Pharmalabs Limited has scheduled its Q3FY26 earnings conference call for February 10, 2026 at 4:00 PM IST to discuss quarterly financial results with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1770024811795,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aarti Pharmalabs appoints Dr. Rakeshwar Bandichhor as CSO",
            "Summary": "Aarti Pharmalabs Limited announces the appointment of Dr. Rakeshwar Bandichhor as Chief Scientific Officer - R&D effective January 01, 2026. The appointee brings 25 years of experience in API-R&D and Process Chemistry.",
            "Sentiment": "positive",
            "PublishDate": 1767267830949,
            "Source": "stocks"
        },
        {
            "Title": "Aarti Pharmalabs Reports 11% Revenue Growth to INR 417 Crores in Q2FY26, Revises EBITDA Growth Guidance to 8-12%",
            "Summary": "Aarti Pharmalabs achieved standalone revenue of INR 417 crores in Q2FY26 versus INR 377 crores year-on-year, though EBITDA declined to INR 75 crores from INR 85 crores due to margin pressures in API business and forex losses of INR 7.4 crores. The company inaugurated its Atali plant in September and revised full-year EBITDA growth guidance to 8-12%, with CDMO business expected to exceed earlier projected 30-40% growth driven by 39 commercial projects across 21 customers.",
            "Sentiment": "neutral",
            "PublishDate": 1763381284014,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Pharmalabs Reports Q2 FY26 Results with Revenue Growth but Margin Pressure",
            "Summary": "Aarti Pharmalabs Limited reported quarterly results showing operational revenue of INR 4,183 million in Q2 FY26, up 8.3% quarter-on-quarter but down 8.7% year-on-year. EBITDA margin declined to 17.86% from 24.68% in the previous quarter and 20.46% in the same quarter last year. PAT dropped to INR 279 million from INR 495 million in Q2 FY25, with PAT margin falling to 6.67%. The company was negatively impacted by a forex loss of INR 7.4 crores in Q2 FY26. For the half-year period, operational revenue was INR 8,045 million with EBITDA margin of 21.14% and PAT of INR 775 million. The Xanthine derivatives segment operated at incremental capacity with better margins from beverage customers, while the API business witnessed margin pressure due to sales mix skewed toward lower margin products. The company operationalized its Atali Greenfield site in Q2 FY26 and expects CDMO business to meet growth expectations for FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1762829581212,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Pharmalabs Reports Strong Growth in Quarterly Results with Revenue Rising to Rs 417.29 Crores",
            "Summary": "Aarti Pharmalabs Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The pharmaceutical company reported standalone revenue from operations of Rs 417.29 crores for the quarter, compared to Rs 375.31 crores in the previous quarter. Net profit for the quarter stood at Rs 30.85 crores versus Rs 21.23 crores in the prior quarter. For the half-year period, revenue reached Rs 792.60 crores against Rs 770.78 crores previously, with net profit of Rs 52.08 crores compared to Rs 47.82 crores. The company operates solely in the pharmaceuticals segment and has subsidiaries including Aarti USA Inc and Aarti Pharmachem Ltd, along with a joint venture with Ganesh Polychem Limited effective from April 1, 2025. The Board of Directors approved these results in their meeting held on November 9, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762682913870,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Pharma Labs Appoints Two Senior Management Personnel",
            "Summary": "Aarti Pharma Labs Limited announced the appointment of two senior management personnel effective November 10, 2025. Mr. Hemant Gundare has been appointed as Head Corporate - EHS (Environment, Health Safety), bringing expertise in environmental health and safety management with a Doctorate in Green Chemistry. Mr. Shrihari S. Mane has been appointed as Chief Technology Officer (API), contributing 32 years of experience in API manufacturing, Flow Chemistry, PAT tool application, large scale operations and strategic leadership in peptides and Oncology areas. Both appointments were approved by the Board of Directors based on recommendations from the Nomination and Remuneration Committee during their meeting on November 9, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762677515851,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aarti Pharmalabs Schedules Earnings Conference Call for Q2-FY26 Results",
            "Summary": "Aarti Pharmalabs Limited has scheduled an earnings conference call for investors and analysts on Tuesday, November 11, 2025, at 4:00 PM IST to discuss the company's Q2-FY26 financial results. The call will feature Chairman Rashesh Gogri, Vice Chairperson and Managing Director Hetal Gogri Gala, and Chief Financial Officer Piyush Lakhani. The company has provided multiple dial-in numbers for domestic and international participants across various countries. The conference call is being organized by Emkay Global Financial Services Ltd.",
            "Sentiment": "neutral",
            "PublishDate": 1762291446344,
            "Source": "earnings"
        },
        {
            "Title": "Delhi High Court Issues Injunction Against Aarti Pharma Labs Over Ruxolitinib Patent Dispute",
            "Summary": "The Delhi High Court has issued an ex-parte ad-interim injunction against Aarti Pharma Labs Ltd, stopping the company from manufacturing and supplying Ruxolitinib products due to a patent infringement claim. The company states that this injunction will not impact its overall operations.",
            "Sentiment": "negative",
            "PublishDate": 1759901545087,
            "Source": "stock"
        },
        {
            "Title": "Aarti Pharmalabs Sets Record Date for ₹2.5 Final Dividend Payment",
            "Summary": "Aarti Pharmalabs Limited has established September 15, 2025 as the record date for final dividend payment of ₹2.5 per equity share for financial year 2024-25. The dividend represents 50% of the face value of ₹5 per share and requires shareholder approval at the Annual General Meeting scheduled for September 22, 2025. Payment will be made to shareholders whose names appear in the company's register on the record date, with distribution expected on or before October 20, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755599297172,
            "Source": "corporate_action"
        },
        {
            "Title": "Aarti Pharmalabs Reports Q1 FY2026 Results, Appoints New Auditors and Re-appoints Independent Director",
            "Summary": "Aarti Pharmalabs Limited announced its unaudited financial results for Q1 FY2026 ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs. 37,531.06 lakhs and net profit of Rs. 5,122.08 lakhs, with basic earnings per share of Rs. 5.65. On a consolidated basis, revenue from operations was Rs. 38,619.09 lakhs with net profit of Rs. 4,950.12 lakhs and basic EPS of Rs. 5.46. The board also approved the appointment of M/s Mehta & Mehta as secretarial auditors for five consecutive years starting FY 2025-26, subject to AGM approval. Additionally, the board approved the re-appointment of Ms. Rupal Vora as Non-executive Independent Director for a second term of three years from October 17, 2025 to October 16, 2028, pending shareholder approval. The company also approved extending its stock option scheme to eligible directors and employees of subsidiary companies.",
            "Sentiment": "positive",
            "PublishDate": 1755012379206,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Pharmalabs Reports Strong Q3 Results and Declares Dividend",
            "Summary": "Aarti Pharmalabs announced its Q3 consolidated net profit of 740 million rupees, showing significant growth compared to 528 million rupees year-over-year and 546 million rupees quarter-over-quarter. The company's Q3 revenue increased to 5.4 billion rupees from 4.48 billion rupees in the previous year. Additionally, Aarti Pharmalabs declared a dividend of 2.5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1738801244000,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Pharmalabs Declares Dividend of 2.5 Rupees Per Share",
            "Summary": "Aarti Pharmalabs has announced a dividend of 2.5 rupees per equity share. This corporate action represents a distribution of the company's profits to its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1738764187000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aarti Pharmalabs Reports Strong Q3 EBITDA Growth",
            "Summary": "Aarti Pharmalabs has announced its Q3 financial results, showing significant year-over-year improvement. The company's EBITDA increased to 1.29 billion rupees from 957 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 23.91% from 21.32% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738764139000,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Pharmalabs Reports Strong Q3 Financial Results",
            "Summary": "Aarti Pharmalabs has announced its Q3 consolidated financial results. The company's net profit increased to 740 million rupees, up from 528 million rupees year-over-year and 546 million rupees quarter-over-quarter. Revenue for Q3 rose to 5.4 billion rupees, compared to 4.48 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738764054000,
            "Source": "earnings"
        },
        {
            "Title": "Aarti Pharmalabs Acquires Stake in Pro-Zeal Green Power",
            "Summary": "Aarti Pharmalabs has entered into a share subscription agreement with Pro-Zeal Green Power. As part of this agreement, Aarti Pharmalabs will acquire a 26.25% equity stake in Pro-Zeal Green Power.",
            "Sentiment": "positive",
            "PublishDate": 1736468296000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aarti Pharmalabs Acquires Stake in Pro-Zeal Green Power",
            "Summary": "Aarti Pharmalabs has entered into a share subscription agreement with Pro-Zeal Green Power. As part of this agreement, Aarti Pharmalabs will acquire a 26.25% equity stake in Pro-Zeal Green Power.",
            "Sentiment": "positive",
            "PublishDate": 1736423146000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Pollution Control Board Orders Closure of Aarti Pharmalabs' Vapi Plant",
            "Summary": "Aarti Pharmalabs has received a directive from the Gujarat Pollution Control Board to cease manufacturing activities at its plant located in Vapi. This closure order is likely due to environmental compliance issues, though specific reasons are not provided in the given news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1735890621000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Abakkus Asset Manager Acquires 10.7 Lakh Shares of Aarti Pharmalabs",
            "Summary": "Abakkus Asset Manager, led by Sunil Singhania, has purchased 10.7 lakh shares of Aarti Pharmalabs through open market transactions. This significant acquisition suggests a potential increase in investor interest in the pharmaceutical company.",
            "Sentiment": "positive",
            "PublishDate": 1735259028000,
            "Source": "block_deals"
        },
        {
            "Title": "Aarti Pharmalabs: Promoters Sell 1.09% Stake for Rs 61.52 Crore",
            "Summary": "Promoters of Aarti Pharmalabs Ltd. sold a 1.09% stake for Rs 61.52 crore through open market transactions. The Orchid Family Trust and Tulip Family Trust each sold approximately 0.55% of their holdings at Rs 575 per share. Abakkus Asset Manager acquired 1.17% stake in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1735226835000,
            "Source": "block_deals"
        },
        {
            "Title": "Aarti Pharmalabs Ltd: Large Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) for Aarti Pharmalabs Ltd. The trade involved approximately 1,006,257 shares at a price of Rs. 575.00 per share, totaling Rs. 57.86 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1735195366000,
            "Source": "block_deals"
        },
        {
            "Title": "Aarti Pharmalabs Ltd: Block Trade of 513,000 Shares",
            "Summary": "A block trade of approximately 513,000 shares of Aarti Pharmalabs Ltd occurred on the Bombay Stock Exchange (BSE) during pre-open trading. The total value of the trade was Rs. 28.98 crores, with shares trading at Rs. 564.91 each.",
            "Sentiment": "neutral",
            "PublishDate": 1734578533000,
            "Source": "block_deals"
        },
        {
            "Title": "Aarti Pharmalabs Reports Improved Q2 EBITDA and Margin",
            "Summary": "Aarti Pharmalabs has announced its Q2 financial results. The company's EBITDA increased to 937 million rupees, up from 880 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 20.45% from 20.01% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730115013000,
            "Source": "result"
        },
        {
            "Title": "Aarti Pharmalabs Reports Q2 Revenue Growth",
            "Summary": "Aarti Pharmalabs has announced its second quarter revenue, which stands at 4.6 billion rupees. This represents a year-over-year increase from 4.4 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1730114996000,
            "Source": "result"
        },
        {
            "Title": "Aarti Pharmalabs Reports Q2 Profit Increase",
            "Summary": "Aarti Pharmalabs has reported a consolidated net profit of 546 million rupees for the second quarter, showing an increase from 518 million rupees year-over-year and 554 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730114984000,
            "Source": "result"
        }
    ]
}