{
    "Symbol": "AARVI",
    "ISIN": "INE754X01016",
    "News": [
        {
            "Title": "AARVI ENCON Secures ₹108 Crore Order",
            "Summary": "AARVI ENCON Limited has announced securing a significant order worth ₹108 crores, marking a major business development for the company.",
            "Sentiment": "positive",
            "PublishDate": 1767778741667,
            "Source": "co_actions_results"
        },
        {
            "Title": "AARVI ENCON Wins ₹66.22 Cr BPCL Contract",
            "Summary": "AARVI ENCON secures significant 5-year contract from Bharat Petroleum for management and maintenance services at Bina Dispatch Terminal, valued at ₹66.22 crores starting January 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767771575506,
            "Source": "co_actions_results"
        },
        {
            "Title": "AARVI ENCON Reports 62% Jump in Q1 Net Profit to 42 Million Rupees",
            "Summary": "AARVI ENCON reported consolidated net profit of 42 million rupees in Q1, up from 26 million rupees in the same period last year. Revenue increased to 1.5 billion rupees from 1.1 billion rupees year-over-year. EBITDA rose to 49 million rupees compared to 33 million rupees previously, while EBITDA margin improved to 3.27% from 2.92% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1755013733064,
            "Source": "earnings"
        },
        {
            "Title": "Aarvi Encon Secures 38 Crore Rupee Order",
            "Summary": "Aarvi Encon, a company with a market capitalization of 192 crore rupees, has won a new order worth 38 crore rupees. This order represents a significant business opportunity for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1738401732000,
            "Source": "order&deals"
        },
        {
            "Title": "Aarvi Encon Announces Increase in Order Value and Extension of Validity",
            "Summary": "Aarvi Encon has reported an increase in the value of an existing order from Rs. 112 crore to Rs. 186.04 crore. Additionally, the validity of this order has been extended from January 27, 2025, to December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1738056905000,
            "Source": "order&deals"
        },
        {
            "Title": "AARVI ENCON Receives Revised Work Order Worth 1.86 Billion Rupees",
            "Summary": "AARVI ENCON has announced receiving a revised work order with an increased value of 1.86 billion rupees. The company's current market capitalization stands at 174 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738056805000,
            "Source": "order&deals"
        },
        {
            "Title": "Aarvi Encon Secures Major Contract",
            "Summary": "<p>Aarvi Encon has been awarded a <span class=\"positive\">significant</span> order valued at <b>1.73 billion rupees</b>. This contract represents a <span class=\"positive\">substantial</span> business opportunity for the company.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728385813000,
            "Source": "corporate_action"
        }
    ]
}