{
    "Symbol": "AAVAS",
    "ISIN": "INE216P01012",
    "News": [
        {
            "Title": "Aavas Financiers Q3FY26 Results: Strong Performance",
            "Summary": "Aavas Financiers reports robust Q3FY26 performance with 16% YoY net profit growth to Rs 1.70 bn, AUM reaching Rs 222 bn, and improved asset quality metrics.",
            "Sentiment": "positive",
            "PublishDate": 1770897502116,
            "Source": "co_actions_results"
        },
        {
            "Title": "AAVAS Financiers Reports Strong Q3 Growth",
            "Summary": "AAVAS Financiers delivered robust Q3 performance with net profit rising 16.44% to ₹1.70 billion and revenue growing 12.11% to ₹5.74 billion compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1770289456417,
            "Source": "co_actions_results"
        },
        {
            "Title": "AAVAS Achieves 500 EDGE Certified Green Homes Milestone",
            "Summary": "AAVAS Financiers reaches significant sustainability milestone with 500 self-built homes receiving EDGE green certification under IFC-supported Green Housing Programme, advancing affordable housing sustainability.",
            "Sentiment": "positive",
            "PublishDate": 1770208012611,
            "Source": "stocks"
        },
        {
            "Title": "Aavas Financiers Allots 12,365 Shares via ESOP Exercise",
            "Summary": "Aavas Financiers allotted 12,365 equity shares through employee stock option exercises under ESOP 2016-I and PSOP-2023 schemes, increasing paid-up capital to Rs. 79,19,18,760.",
            "Sentiment": "positive",
            "PublishDate": 1769847377021,
            "Source": "co_actions_results"
        },
        {
            "Title": "AAVAS Financiers Q3FY26 Earnings Call on Feb 5",
            "Summary": "AAVAS Financiers has scheduled its Q3FY26 earnings conference call for February 05, 2026, at 5:30 PM IST to discuss financial and operational performance for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768922351201,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aavas Financiers Auditor Firm Converts to LLP",
            "Summary": "Aavas Financiers announces statutory auditor M S K A & Associates has converted to LLP structure effective January 13, 2026, with no change to existing audit engagement or responsibilities.",
            "Sentiment": "neutral",
            "PublishDate": 1768470094767,
            "Source": "stocks"
        },
        {
            "Title": "Aavas Financiers Block Trade Worth ₹29.87 Crores",
            "Summary": "Aavas Financiers executed a significant NSE block trade involving 205,880 shares at ₹1,450.90 per share, totaling ₹29.87 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1768365496019,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aavas Financiers Block Trade Worth ₹284.37 Crores",
            "Summary": "Aavas Financiers executed a significant NSE block trade involving 1,964,150 shares at ₹1,447.80 per share, totaling ₹284.37 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1768364927023,
            "Source": "co_actions_results"
        },
        {
            "Title": "AAVAS Financiers Appoints Rohit Ranjan as Director",
            "Summary": "AAVAS Financiers shareholders approve appointment of Rohit Ranjan as Non-Executive Non-Independent Director through postal ballot with 98.26% votes in favor. Resolution passed on January 06, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767777596716,
            "Source": "stocks"
        },
        {
            "Title": "Aavas Financiers Executive Committee Approves ₹975 Cr NCD",
            "Summary": "Aavas Financiers' Executive Committee approved issuance of ₹975 crore unlisted secured non-convertible debentures in 2 tranches with 3 series to multilateral institution on December 23, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766472908801,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aavas Financiers Seeks Shareholder Approval for Rohit Ranjan's Board Appointment",
            "Summary": "Aavas Financiers has issued a postal ballot notice seeking shareholder approval for appointing Rohit Ranjan (DIN: 00003480) as Non-Executive Non-Independent Director for a 5-year term, replacing Elcid Vergara who resigned. The e-voting process runs from December 8, 2025, to January 6, 2026, with Ranjan being nominated by promoter Aquilo House Pte. Ltd. and bringing over four decades of banking experience from Citibank India and Axis Bank.",
            "Sentiment": "neutral",
            "PublishDate": 1764835062857,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aavas Financiers Allots 12,699 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Aavas Financiers Limited allotted 12,699 equity shares of Rs. 10 each following the exercise of stock options under its Performance Stock Option Plan-2023. The allotment increased the company's paid-up share capital from Rs. 79,16,68,120 to Rs. 79,17,95,110, with the new shares ranking equally with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763988674163,
            "Source": "corporate_action"
        },
        {
            "Title": "Aavas Financiers Reports 11% YoY Net Profit Growth in Q2FY26 with Improved Asset Quality",
            "Summary": "Aavas Financiers delivered net profit of Rs 1.64 billion for Q2FY26, up 11% year-on-year, driven by 18% growth in net interest income and NIM expansion to 8.04%. The company achieved 36% sequential and 21% year-on-year disbursement growth while maintaining strong asset quality with 1DPD at 3.99% and GNPA stable at 1.24%.",
            "Sentiment": "positive",
            "PublishDate": 1763355154302,
            "Source": "earnings"
        },
        {
            "Title": "Aavas Financiers Reports 19% AUM Growth, Targets 20-22% CAGR with Tier-3 & Tier-4 Focus",
            "Summary": "Aavas Financiers reported Assets Under Management (AUM) of ₹17,887 crores in Q2FY26, marking a 19% year-over-year growth. The company posted a Profit After Tax (PAT) of ₹347 crores, representing a 14% increase compared to the previous year. The housing finance company is targeting a 20-22% AUM compound annual growth rate with continued focus on affordable housing in Tier-3 and Tier-4 cities. Aavas maintained strong asset quality metrics with Gross Non-Performing Assets below 1% and Net Non-Performing Assets below 0.6%. The company plans to expand its branch network to over 470 branches by FY27 while strengthening digital lending capabilities, co-lending partnerships, and AI-based underwriting systems. Management emphasized focus on cost efficiency and margin preservation amid the high interest rate environment.",
            "Sentiment": "positive",
            "PublishDate": 1762874106066,
            "Source": "earnings"
        },
        {
            "Title": "Aavas Financiers Grants 17.33 Lakh Stock Options Under Three ESOP Schemes",
            "Summary": "Aavas Financiers Limited's Nomination and Remuneration Committee approved the grant of stock options under three employee stock option plans. The company granted 3,01,230 options under ESOP-2022, 10,000 options under PSOP-2024, and 14,22,470 options under ESOP-2025, totaling 17,33,700 stock options to eligible employees. The options have varying vesting schedules ranging from 2-5 years with exercise periods of 4-5 years from vesting dates. The grants are in compliance with SEBI regulations for share-based employee benefits.",
            "Sentiment": "neutral",
            "PublishDate": 1762864023810,
            "Source": "corporate_action"
        },
        {
            "Title": "AAVAS Financiers Reports 10.8% Growth in Quarterly Net Profit to 1.64 Billion Rupees",
            "Summary": "AAVAS Financiers reported a net profit of 1.64 billion rupees for the second quarter, representing an increase from 1.48 billion rupees in the same period last year. The company's quarterly revenue grew to 6.67 billion rupees compared to 5.79 billion rupees year-over-year, marking a 15.2% increase in revenue performance.",
            "Sentiment": "positive",
            "PublishDate": 1762861908552,
            "Source": "earnings"
        },
        {
            "Title": "Aavas Financiers Shareholders Approve ₹8,500 Crore NCD Fundraising Plan",
            "Summary": "Aavas Financiers shareholders approved raising up to ₹8,500 crore through non-convertible debentures on a private placement basis over the next year. The housing finance company also appointed five non-executive nominee directors for five-year terms, revised CEO remuneration, appointed new secretarial auditors, and cleared a new ESOP-2025 plan covering up to 23.7 lakh equity shares. The Jaipur-based company focuses on home loans and MSME financing for rural and semi-urban customers. Shares closed at ₹1,649.40, down 11.3% over six months.",
            "Sentiment": "neutral",
            "PublishDate": 1758124497052,
            "Source": "corporate_action"
        },
        {
            "Title": "Aavas Financiers Stock Gains 7% on Recovery Expectations Despite Subdued Quarterly Results",
            "Summary": "Aavas Financiers stock has gained 7% in the past 10 trading sessions, reducing its decline to 5% since August 12 when it reported subdued quarterly numbers. The affordable housing finance company's performance was impacted by a change in disbursement recognition policy and lower asset quality. Reported disbursements fell 5% year-on-year to ₹1,145 crore due to the new recognition method, which would have shown double-digit growth under the previous policy. Assets under management grew 16% to ₹20,739.7 crore, down from 22% growth in the previous year. The company reduced its AUM growth guidance to 18-20% for FY26 from earlier expectations of 20-25%. Gross nonperforming asset ratio increased by 20 basis points to 1.2%, while spread improved by 10 basis points year-on-year to 5.1%. Net interest income rose 17.8% to ₹322.8 crore and net profit grew 10.4% to ₹139.2 crore. The company operates 397 branches across 14 states, with 80% in tier three regions. IDBI Capital upgraded the rating to 'buy' from 'hold' while reducing the target price to ₹2,250 from ₹2,340. The stock traded at ₹1,633.2 on Wednesday.",
            "Sentiment": "neutral",
            "PublishDate": 1757896615707,
            "Source": "stock"
        },
        {
            "Title": "Aavas Financiers Sees Block Trade Worth Rs. 132.88 Crores on NSE",
            "Summary": "Aavas Financiers executed a block trade on the National Stock Exchange involving approximately 872,457 shares at a price of Rs. 1,523.10 per share. The total transaction value amounted to Rs. 132.88 crores. Block trades typically involve large institutional transactions executed outside the regular market to minimize price impact.",
            "Sentiment": "neutral",
            "PublishDate": 1756458252875,
            "Source": "order&deals"
        },
        {
            "Title": "Aavas Financiers Reports 16% AUM Growth to Rs 207 Billion in Q1 FY26",
            "Summary": "Aavas Financiers Limited reported Assets Under Management (AUM) growth of 16% year-on-year to Rs 207 billion for Q1 FY26. Net profit increased 10% to Rs 1.4 billion, while Net Interest Income grew 16%. The company's spread improved 22 basis points quarter-on-quarter to 5.11%, and Net Interest Margin expanded 16 basis points to 7.48%. Disbursements for the quarter were Rs 11.5 billion. The company transitioned to a realization-based model for disbursement recognition, which impacted the sanction-to-disbursement conversion ratio, declining by approximately 10% to less than 75%. Asset quality metrics showed GNPA at 1.22% and NNPA at 0.84%, with 1+ DPD at 4.15%. The company experienced some asset quality pressure in Maharashtra, Madhya Pradesh and Karnataka, leading to tightened credit norms in these areas. Aavas is expanding into Tamil Nadu with 10 new branches planned and has partnered with digital platforms including CSC, eMitra and India Post Payment Bank. Management expects FY26 AUM growth in the range of 18-20% and targets 20-25% growth from FY27 onwards.",
            "Sentiment": "positive",
            "PublishDate": 1755596833144,
            "Source": "earnings"
        },
        {
            "Title": "Aavas Financiers Approves ESOP-2025 Plan for Up to 23.74 Lakh Equity Shares",
            "Summary": "Aavas Financiers Limited's Board of Directors approved the ESOP-2025 plan allowing issuance of up to 23,74,191 equity shares with face value of Rs. 10 each for eligible employees. The plan will be granted in one or more tranches and requires shareholder approval under SEBI regulations. Options can be exercised within 5 years from each vesting date. The company scheduled its 15th Annual General Meeting for September 16, 2025, at 3:30 PM through video conferencing. The AGM notice and annual report for FY 2024-25 will be sent electronically to registered shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1755493458524,
            "Source": "corporate_action"
        },
        {
            "Title": "Aavas Financiers Sees Block Trade Worth Rs. 70.49 Crores on NSE",
            "Summary": "Aavas Financiers Ltd. witnessed a block trade on the National Stock Exchange involving approximately 410,354 shares at a price of Rs. 1,717.90 per share. The total transaction value amounted to Rs. 70.49 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1755071229161,
            "Source": "order&deals"
        },
        {
            "Title": "Aavas Financiers Targets 20% Loan Book Growth Through Technology and Rural Expansion",
            "Summary": "Aavas Financiers has outlined its growth strategy focusing on sustainable expansion with a target of 20% loan book growth. The affordable housing finance company plans to achieve this through technology-led efficiency improvements and deeper penetration into rural markets.",
            "Sentiment": "positive",
            "PublishDate": 1755013678090,
            "Source": "stock"
        },
        {
            "Title": "Aavas Financiers Reports 10% YoY Net Profit Growth in Q1FY26, AUM Reaches Rs 207 Billion",
            "Summary": "Aavas Financiers Limited reported quarterly results with net profit growing 10% year-on-year to Rs 1.39 billion. Assets under Management increased 16% to Rs 207.4 billion. The company achieved a spread of 5.11% and Net Interest Margin of 7.48%. Gross Stage 3 assets stood at 1.22% while Net Stage 3 was at 0.84%. The company transitioned to a realization-based disbursement recognition model during the quarter. CVC Capital Partners completed acquisition of 48.96% stake, becoming the new promoter. Disbursements were Rs 11.5 billion, impacted by the transition to the new recognition model. Cost of borrowing declined to 8.02% while AUM yield remained stable at 13.13%. The company operates 397 branches across 14 states and maintains a Capital Risk Adequacy Ratio of 43.2%. ROA stood at 2.94% and ROE at 12.56%.",
            "Sentiment": "positive",
            "PublishDate": 1755000095490,
            "Source": "earnings"
        },
        {
            "Title": "AAVAS Financiers Reports Higher Q1 EBITDA Despite Margin Decline",
            "Summary": "AAVAS Financiers reported Q1 EBITDA of 4.59 billion rupees, up from 4.04 billion rupees in the same period last year. However, the company's EBITDA margin decreased to 73.21% from 74.57% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1754997732683,
            "Source": "earnings"
        },
        {
            "Title": "AAVAS Financiers Reports Higher Quarterly Profit and Revenue",
            "Summary": "AAVAS Financiers reported a net profit of 1.39 billion rupees compared to 1.26 billion rupees in the same quarter last year. The company's revenue increased to 6.28 billion rupees from 5.4 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754996623369,
            "Source": "earnings"
        },
        {
            "Title": "Aavas Financiers Appoints Ashish Gautam as Head of Operations",
            "Summary": "Aavas Financiers Limited appointed Mr. Ashish Gautam as Head of Operations, a Senior Managerial Personnel position, effective August 11, 2025. The appointment was approved by the Board of Directors through a Circular Resolution based on the recommendation of the Nomination and Remuneration Committee. Mr. Gautam brings over 23 years of experience in Operations Management, System Implementation, Digital transformation, Machine learning & Automation, Vendor Management, Business Development, Client Servicing and People Management in the Banking and Financial Services Sector.",
            "Sentiment": "positive",
            "PublishDate": 1754931766521,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aavas Financiers Schedules Earnings Conference Call for Quarter Ended June 30, 2025",
            "Summary": "Aavas Financiers Limited will hold an earnings conference call on August 12, 2025, at 6:00 PM IST to discuss the company's financial and operational performance for the quarter ended June 30, 2025. The call will include discussions with investors and analysts, with pre-registration available through a provided link. Dial-in numbers have been provided for domestic participants, along with international toll-free numbers for Hong Kong, Singapore, UK, and USA. Additional information is accessible on the company's website under investor relations.",
            "Sentiment": "neutral",
            "PublishDate": 1753794585233,
            "Source": "earnings"
        },
        {
            "Title": "Aavas Financiers: Aquilo House Becomes New Promoter with 48.96% Stake",
            "Summary": "Aquilo House Pte. Limited has acquired a 48.96% stake in Aavas Financiers Limited through an open offer and share purchase agreements, becoming the new promoter. The acquisition includes 22.50% from an open offer and additional shares from Lake District Holdings Ltd, Partners Group ESCL Ltd, and Partners Group Private Equity. Outgoing shareholders have requested reclassification to public category.",
            "Sentiment": "neutral",
            "PublishDate": 1751304639000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aavas Financiers Changes Promoter Group Status to Public Shareholders",
            "Summary": "Aavas Financiers has announced a change in the status of its promoter group to public shareholders. This change follows the completion of an open offer. No further details about the open offer or the reasons for the status change were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1751296495000,
            "Source": "default"
        },
        {
            "Title": "Aavas Financiers: Approves ₹200 Crore NCD Private Placement",
            "Summary": "Aavas Financiers' board executive committee approved raising up to ₹200 crore through private placement of NCDs. The company will issue 20,000 senior, secured, rated, listed, redeemable NCDs with a face value of ₹100,000 each. The NCDs will have a 60-month tenor, quarterly interest payments, and principal repayment in 20 equal quarterly instalments.",
            "Sentiment": "neutral",
            "PublishDate": 1750254222000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aavas Financiers Board Approves 2 Billion Rupee NCD Issuance",
            "Summary": "The Board of Directors of Aavas Financiers has approved the issuance of Non-Convertible Debentures (NCDs) worth 2 billion rupees. This decision represents a significant financial move for the company, potentially aimed at raising capital or refinancing existing debt.",
            "Sentiment": "positive",
            "PublishDate": 1750242092000,
            "Source": "default"
        },
        {
            "Title": "Aavas Financiers Reports Q4 Profit Growth and Approves NCD Issuance",
            "Summary": "Aavas Financiers announced its Q4 results, reporting a net profit of 1.54 billion rupees, up from 1.43 billion rupees year-over-year. The company's revenue increased to 6.36 billion rupees from 5.46 billion rupees in the same period last year. Additionally, Aavas Financiers approved the issuance of Non-Convertible Debentures (NCDs) with an overall limit of 85 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1745540119000,
            "Source": "default"
        },
        {
            "Title": "Aavas Financiers: Q4 Profit Rises 8%, Loan Book Exceeds ₹1.6 Lakh Crore",
            "Summary": "Aavas Financiers reported Q4 net profit of ₹153.7 crore, up 8% year-over-year. FY25 profit increased 17% to ₹574.1 crore. Loan book grew to ₹1,62,297 crore. Asset quality remained strong with GNPA at 1.08% and NNPA at 0.73%.",
            "Sentiment": "positive",
            "PublishDate": 1745498811000,
            "Source": "earnings"
        },
        {
            "Title": "AAVAS Financiers Reports Q4 Results and Approves NCD Issuance",
            "Summary": "AAVAS Financiers has announced its Q4 financial results, showing year-over-year growth in revenue and net profit. The company reported Q4 revenue of 6.36 billion rupees, up from 5.46 billion rupees in the previous year. Net profit for Q4 stood at 1.54 billion rupees, compared to 1.43 billion rupees year-over-year and 1.46 billion rupees quarter-over-quarter. Additionally, the company has approved the issuance of Non-Convertible Debentures (NCDs) with an overall limit of 85 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1745494961000,
            "Source": "result"
        },
        {
            "Title": "AAVAS Financiers to Consider Q4 Results on April 24",
            "Summary": "AAVAS Financiers has announced that it will consider its fourth quarter (Q4) financial results on April 24. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1744805686000,
            "Source": "default"
        },
        {
            "Title": "Aavas Financiers Approves Issuance of Non-Convertible Debentures Worth 2 Billion Rupees",
            "Summary": "Aavas Financiers has approved the issuance of Non-Convertible Debentures (NCDs) valued at 2 billion rupees. This decision represents a significant financial move for the company, potentially aimed at raising capital for business operations or expansion.",
            "Sentiment": "positive",
            "PublishDate": 1744779445000,
            "Source": "default"
        },
        {
            "Title": "AAVAS Financiers Reports Strong Growth in AUM and Disbursements",
            "Summary": "AAVAS Financiers has reported significant growth in its Assets Under Management (AUM) and disbursements for the financial year ending March 31, 2025. The company's AUM reached 204.20 billion rupees, marking an 18% year-over-year increase. Additionally, disbursements for Q4FY25 amounted to 20.20 billion rupees, showing a 27% quarter-on-quarter growth and a 7% year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1743755840000,
            "Source": "result"
        },
        {
            "Title": "Aavas Financiers Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 100,600 shares of Aavas Financiers Ltd. was executed on the National Stock Exchange (NSE) at a price of Rs. 1994.00 per share. The total value of the transaction amounted to Rs. 20.06 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1742962005000,
            "Source": "block_deals"
        },
        {
            "Title": "Aavas Financiers: Crosses ₹20,000 Crore AUM Milestone",
            "Summary": "Aavas Financiers Ltd has surpassed ₹20,000 crore in Assets Under Management (AUM). The company has disbursed ₹33,500 crore in loans to over 3.62 lakh customers in the past decade. It operates 373 branches across 14 states, with 80% in Tier 2 to Tier 5 cities. Aavas is expanding its digital reach through partnerships to serve new-to-credit customers in smaller towns.",
            "Sentiment": "positive",
            "PublishDate": 1742547215000,
            "Source": "normal_news"
        },
        {
            "Title": "Aavas Financiers Achieves Milestone of 200 Billion Rupees in Assets Under Management",
            "Summary": "Aavas Financiers has announced that it has surpassed 200 billion rupees in Assets Under Management (AUM). This milestone represents significant growth for the company and indicates strong performance in its financial operations.",
            "Sentiment": "positive",
            "PublishDate": 1742536820000,
            "Source": "corporate_action"
        },
        {
            "Title": "AAVAS Financiers: Share Price Surges Despite SBI Mutual Fund's Major Stake Reduction",
            "Summary": "AAVAS Financiers' share price jumped over 3% to a 52-week high of ₹1,994.00, despite SBI Mutual Fund selling 75,44,011 shares (9.5313% stake) on March 18, 2025. The fund's holding reduced from 9.5870% to 0.0558%. Despite market weakness, AAVAS shares have gained 17% in one month and 18% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1742453513000,
            "Source": "block_deals"
        },
        {
            "Title": "Avendus Upgrades AAVAS Financiers Rating to Buy",
            "Summary": "Avendus has significantly upgraded its rating for AAVAS Financiers from Reduce to Buy, setting a new target price of Rs. 2,139. This double upgrade indicates a substantial shift in the firm's outlook on AAVAS Financiers' stock performance and potential.",
            "Sentiment": "positive",
            "PublishDate": 1741842725000,
            "Source": "normal_news"
        },
        {
            "Title": "Open Offer for 26% Stake Acquisition in Aavas Financiers",
            "Summary": "An open offer has been announced for the acquisition of a 26% stake in Aavas Financiers by Aquilo House, according to a recent filing. This move represents a significant corporate action that could potentially change the ownership structure of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1740355727000,
            "Source": "corporate_action"
        },
        {
            "Title": "Open Offer for 26% Stake Acquisition in Aavas Financiers",
            "Summary": "An open offer has been announced for the acquisition of a 26% stake in Aavas Financiers by Aquilo House, according to a recent filing.",
            "Sentiment": "neutral",
            "PublishDate": 1740147159000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aavas Financiers Reports Strong Q3 Financial Results",
            "Summary": "Aavas Financiers has announced its Q3 financial results, showing significant year-over-year growth. The company's net profit increased to 1.46 billion rupees, up from 1.17 billion rupees in the same quarter last year. This represents a 24.8% year-over-year growth. Sequentially, the net profit also improved from 1.48 billion rupees in the previous quarter. Revenue for Q3 rose to 5.12 billion rupees, compared to 4.37 billion rupees in the same period last year, marking a 17.2% increase.",
            "Sentiment": "positive",
            "PublishDate": 1738284346000,
            "Source": "earnings"
        },
        {
            "Title": "AAVAS Financiers Reports Q3 Revenue Growth",
            "Summary": "AAVAS Financiers has announced its financial results for the third quarter. The company reported revenue of 5.12 billion rupees, showing an increase from 4.37 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738237627000,
            "Source": "earnings"
        },
        {
            "Title": "AAVAS Financiers Reports Q3 Net Profit Increase",
            "Summary": "AAVAS Financiers has reported a net profit of 1.46 billion rupees for the third quarter, showing an increase from 1.17 billion rupees in the same quarter last year. The profit also slightly decreased from 1.48 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738237621000,
            "Source": "earnings"
        },
        {
            "Title": "Aavas Financiers Issues Debentures and NCDs Worth Rs 200 Crore",
            "Summary": "Aavas Financiers has announced the issuance of debentures and non-convertible debentures (NCDs) amounting to Rs 200 crore. This move indicates the company's efforts to raise capital, potentially for business expansion or refinancing existing debt.",
            "Sentiment": "neutral",
            "PublishDate": 1736234475000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aavas Financiers to Consider NCD Issuance on Private Placement Basis",
            "Summary": "Aavas Financiers has announced that it will consider and approve a proposal for issuing Non-Convertible Debentures (NCDs) on a private placement basis. The decision will be made at a meeting scheduled for January 7.",
            "Sentiment": "neutral",
            "PublishDate": 1735869082000,
            "Source": "corporate_action"
        }
    ]
}