{
    "Symbol": "ABAN",
    "ISIN": "INE421A01028",
    "News": [
        {
            "Title": "Aban Offshore Gets CARE D Rating with Non-Cooperation Tag",
            "Summary": "CARE Ratings assigns D rating with 'Issuer Not Cooperating' status to Aban Offshore's ₹387.47 crore bank facilities and ₹281 crore preference shares due to lack of cooperation.",
            "Sentiment": "negative",
            "PublishDate": 1769604922420,
            "Source": "stocks"
        },
        {
            "Title": "Aban Offshore Q3 FY26 Results on Feb 13, 2026",
            "Summary": "Aban Offshore Limited announces that its Resolution Professional will consider and approve unaudited financial results for Q3 FY26 on February 13, 2026. Company remains under CIRP process.",
            "Sentiment": "neutral",
            "PublishDate": 1769580448918,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aban Offshore's ₹281 Cr Preference Shares Unredeemed",
            "Summary": "Aban Offshore Limited discloses that Non-Convertible Redeemable Preference shares worth ₹281 crores remain unredeemed since 2014 and are under suspension, as per regulatory filing.",
            "Sentiment": "negative",
            "PublishDate": 1768910281114,
            "Source": "stocks"
        },
        {
            "Title": "Aban Offshore Appoints Shailesh Desai as Resolution Professional",
            "Summary": "Aban Offshore Limited's Committee of Creditors approved the appointment of Interim Resolution Professional Mr. Shailesh Desai as Resolution Professional through e-voting that concluded on 26 November 2025. The company is undergoing Corporate Insolvency Resolution Process under the Insolvency and Bankruptcy Code, 2016, following an NCLT order dated October 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764236523454,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aban Offshore Limited Submits Creditors List During Insolvency Process",
            "Summary": "Aban Offshore Limited, currently undergoing Corporate Insolvency Resolution Process (CIRP), has submitted its list of creditors as of November 12, 2025, to BSE and NSE. The submission was made by Interim Resolution Professional Shailesh Desai in compliance with insolvency regulations. The creditors list includes multiple banks such as Punjab National Bank (with claims of ₹12,65,39,59,486), Canara Bank (₹2,79,38,33,690), IndusInd Bank Limited (₹47,99,01,146), and several other financial institutions including Bank of Baroda UAE, Indian Overseas Bank, State Bank of India, ICICI Bank, and Axis Bank among others. The total creditor claims amount to substantial figures across domestic and international banking entities.",
            "Sentiment": "negative",
            "PublishDate": 1762952820281,
            "Source": "corporate_action"
        },
        {
            "Title": "Aban Offshore Schedules First Committee of Creditors Meeting Under Insolvency Process",
            "Summary": "Aban Offshore Limited has announced that the first meeting of the Committee of Creditors (CoC) will be held on Thursday, 13th November 2025. The meeting will take place at Raheja Centre, 7th Floor, Nariman Point, Mumbai, and will also be accessible through audio/video conferencing. The company is currently undergoing Corporate Insolvency Resolution Process (CIRP) under the Insolvency and Bankruptcy Code, 2016. Shailesh Desai is serving as the Interim Resolution Professional for the proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1762868214987,
            "Source": "corporate_action"
        },
        {
            "Title": "Aban Offshore Limited Enters Corporate Insolvency Resolution Process",
            "Summary": "Aban Offshore Limited has entered Corporate Insolvency Resolution Process (CIRP) following an order by the National Company Law Tribunal Chennai on September 1, 2025, based on a petition filed by Punjab National Bank. The company appointed Shailesh Bhalchandran Desai as Interim Resolution Professional on October 10, 2025. The company reported quarterly results showing accumulated losses that have eroded net worth, with current liabilities exceeding current assets. The company has defaulted on term loan installments and interest payments. Auditors expressed qualified opinion due to non-receipt of bank balance confirmations for deposits of INR 147.21 million and outstanding bank borrowings of INR 4,148.03 million. The company operates in offshore drilling business segment and has not redeemed its non-convertible redeemable preference shares amounting to INR 2,810 million on due dates.",
            "Sentiment": "negative",
            "PublishDate": 1762803209610,
            "Source": "earnings"
        },
        {
            "Title": "Aban Offshore Enters Corporate Insolvency Resolution Process, IRP Appointed",
            "Summary": "Aban Offshore Limited has entered Corporate Insolvency Resolution Process under the Insolvency and Bankruptcy Code, 2016, following an order by the National Company Law Tribunal, Chennai Bench. Shailesh Desai has been appointed as the Interim Resolution Professional, with the Board of Directors suspended and a moratorium declared. The IRP will assume the roles and responsibilities of the board and various committees during the insolvency resolution process. The company has scheduled the consideration and approval of unaudited financial results for the quarter ended September 30, 2025, on November 10, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1761895715231,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aban Offshore Gets New Interim Resolution Professional After Previous Appointee's Death",
            "Summary": "The National Company Law Tribunal Chennai has appointed Mr. Shailesh Desai as Interim Resolution Professional for Aban Offshore Limited. The appointment follows the death of Mr. Ram Ratan Kanoongo, Managing Director of Headway Resolution & Insolvency Services Pvt. Ltd, which was previously serving as IRP. Kanoongo held 99.90% shares in the company and his shareholding has not been transferred since his death. The Corporate Insolvency Resolution Process (CIRP) against Aban Offshore was initiated following an application by Punjab National Bank under Section 7 of the Insolvency and Bankruptcy Code. The tribunal noted that no Committee of Creditors has been constituted yet and no progress had been made in the CIRP due to the previous IRP's death. Meanwhile, the corporate debtor has appealed the CIRP initiation order, with the National Company Law Appellate Tribunal directing the financial creditor to decide on a one-time settlement proposal within four weeks.",
            "Sentiment": "negative",
            "PublishDate": 1760445871789,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aban Offshore Postpones Annual General Meeting Due to Pending Corporate Insolvency Resolution Process",
            "Summary": "Aban Offshore Limited has postponed its Annual General Meeting originally scheduled for September 24, 2025. The postponement is due to the Interim Resolution Professional appointed by NCLT Chennai not yet taking charge of the company's affairs following the initiation of Corporate Insolvency Resolution Process. The company will announce a revised meeting date in due course. The notification was communicated to both NSE and BSE exchanges.",
            "Sentiment": "negative",
            "PublishDate": 1758542507042,
            "Source": "corporate_action"
        },
        {
            "Title": "Aban Offshore Faces Management Void After Appointed Resolution Professional Dies During Insolvency Process",
            "Summary": "Aban Offshore Limited entered Corporate Insolvency Resolution Process on September 1, 2025, following an order by the National Company Law Tribunal after a petition by Punjab National Bank. The company's Board of Directors powers were suspended and transferred to Interim Resolution Professional Mr. Ram Ratan Kanoongo from Headway Resolution and Insolvency Services. However, the appointed resolution professional has since died, leaving the company without any management since the CIRP admission. The company recently disclosed the delayed resignation of Independent Director Mr. Sumit Kumar Khanna, explaining that the director filed his resignation directly with authorities without informing the company first. The company stated it learned of the resignation on September 18, 2025, and informed stock exchanges within 24 hours. Aban Offshore cited the absence of active management due to the insolvency proceedings and the death of the resolution professional as reasons for operational challenges in compliance monitoring.",
            "Sentiment": "negative",
            "PublishDate": 1758284940897,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aban Offshore Reports Widening Losses and Financial Distress in Q1 Results",
            "Summary": "Aban Offshore Limited reported consolidated revenue of Rs 1,162.35 crore for the quarter ended June 30, 2025, declining 24.2% year-over-year. The company's consolidated net loss widened to Rs 2,528.12 crore compared to Rs 2,376.65 crore in the same quarter last year. Loss per share increased to Rs 43.32 from Rs 40.72. While standalone operations remained profitable with net profit of Rs 40.19 crore, the company faces severe financial challenges with negative consolidated net worth of Rs 2,54,019.96 crore. The company has defaulted on loan repayments and breached debt covenants, raising concerns about its ability to continue operations. Management is in discussions with lenders for debt resolution and believes the going concern assumption remains appropriate. The company rescheduled its 39th Annual General Meeting to September 24, 2025, and has been unable to redeem non-convertible redeemable preference shares worth Rs 2,810 million that were due for redemption.",
            "Sentiment": "negative",
            "PublishDate": 1754893345096,
            "Source": "earnings"
        }
    ]
}