{
    "Symbol": "ABB",
    "ISIN": "INE117A01022",
    "News": [
        {
            "Title": "ABB India Executes Share Transfer Agreement",
            "Summary": "ABB India Limited has executed a share transfer agreement on February 10, 2026, to sell its shareholding in ABB Robotics India Private Limited to ABB Robotics Schweiz AG for Rs. 1,00,000.",
            "Sentiment": "neutral",
            "PublishDate": 1770805948169,
            "Source": "co_actions_results"
        },
        {
            "Title": "ABB India clarifies news on parent company buyback",
            "Summary": "ABB India Limited issued clarification that news about $2 billion share buyback relates to its Swiss parent company ABB Ltd, not the Indian subsidiary, following BSE inquiry on January 29, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769689087349,
            "Source": "stocks"
        },
        {
            "Title": "ABB Improves India Business Guidance on Growth",
            "Summary": "ABB Global reports improved business performance in India and raises guidance for the region, signaling positive momentum in the Indian market operations.",
            "Sentiment": "positive",
            "PublishDate": 1769666029662,
            "Source": "stocks"
        },
        {
            "Title": "ABB India Wins Major Rail Contract from Titagarh",
            "Summary": "ABB India Limited secured a significant order from Titagarh Rail Systems Ltd for supply of 40 six-car trainsets covering Line 5 and Line 6, providing complete traction and control solutions.",
            "Sentiment": "positive",
            "PublishDate": 1769522282104,
            "Source": "co_actions_results"
        },
        {
            "Title": "ABB India Board Approves Robotics Business Sale",
            "Summary": "ABB India's board approved the sale of its robotics business to subsidiary INRBT for Rs. 1568.20 crores, along with share transfer to ABB Robotics Schweiz AG for Rs. 1 lakh.",
            "Sentiment": "neutral",
            "PublishDate": 1769411934582,
            "Source": "co_actions_results"
        },
        {
            "Title": "ABB India Launches ArTu Formula Low Voltage Switchgear",
            "Summary": "ABB India introduces ArTu Formula Low Voltage Switchgear, a cutting-edge solution for power distribution and control, compliant with international standards and supporting Make in India initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1769152000806,
            "Source": "stocks"
        },
        {
            "Title": "ABB CEO: Electrification to drive growth beyond 2050",
            "Summary": "ABB enters 2026 with record order book as CEO Morten Wierod highlights multi-decade electrification opportunities. Company targets moving India from 4th to 3rd largest market before 2030.",
            "Sentiment": "positive",
            "PublishDate": 1768995042726,
            "Source": "global"
        },
        {
            "Title": "ABB India modernizes BPCL's 935 km pipeline system",
            "Summary": "ABB India successfully upgraded automation and monitoring systems for BPCL's Vadinar-Bina Pipeline without operational downtime, enhancing cyber security and supporting India's energy security infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1768902225810,
            "Source": "co_actions_results"
        },
        {
            "Title": "ABB India Dispatches First Wind Power Converter",
            "Summary": "ABB India dispatched its first locally manufactured wind power converter from Nelamangala facility following Gamesa Electric acquisition, strengthening renewable energy capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1768802135412,
            "Source": "stocks"
        },
        {
            "Title": "ABB India Confirms Non-Large Corporate Status",
            "Summary": "ABB India Limited disclosed it does not qualify as Large Corporate under SEBI framework for FY25, with nil outstanding borrowings and CRISIL AAA rating maintained.",
            "Sentiment": "neutral",
            "PublishDate": 1768308222778,
            "Source": "stocks"
        },
        {
            "Title": "ABB India Receives ₹32.07 Lakh Tax Penalty Order",
            "Summary": "ABB India Limited received a penalty order of ₹32.07 lakh from Karnataka's Deputy Commissioner of Commercial Taxes for tax short payment. The company plans to file an appeal and expects no material impact.",
            "Sentiment": "negative",
            "PublishDate": 1767073935386,
            "Source": "stocks"
        },
        {
            "Title": "ABB India Gets ESG Rating of 76 for FY2025",
            "Summary": "ABB India Limited receives ESG rating of 76 from NSE Sustainability Ratings & Analytics for FY2025, categorized as 'Leader' with Environment score of 80, Social score of 73, and Governance score of 75.",
            "Sentiment": "positive",
            "PublishDate": 1765522469694,
            "Source": "stocks"
        },
        {
            "Title": "ABB India Launches ACS380-E Machinery Drive with Enhanced Connectivity and Cybersecurity",
            "Summary": "ABB India launched the ACS380-E drive featuring dual built-in Ethernet ports, integrated cybersecurity, and fast USB-C commissioning for automation-centric machine building applications. The drive supports rotary motor types across 100-600V ranges and is available in India covering ratings up to 22kW, 400V, targeting textile, cable, wire, plastics, and intralogistics industries.",
            "Sentiment": "positive",
            "PublishDate": 1764752576590,
            "Source": "stock"
        },
        {
            "Title": "ABB India Reports 14% Revenue Growth Despite Margin Pressures from QCO Compliance and Market Dynamics",
            "Summary": "ABB India achieved 14% revenue growth and 13% base order growth in Q3 2025, though overall orders declined 3% due to absence of large contracts, while maintaining Rs. 9,895 crores order backlog. The company faces margin pressures from Quality Control Order (QCO) compliance requirements, increased competition, and forex volatility, with profitability declining 7% year-on-year despite 16% quarter-on-quarter improvement.",
            "Sentiment": "neutral",
            "PublishDate": 1763047085526,
            "Source": "earnings"
        },
        {
            "Title": "ABB India Reports 58% Drop in Nine-Month Profit to ₹1,235 Crores Despite Revenue Growth",
            "Summary": "ABB India Limited announced its financial results for the quarter and nine months ended September 30, 2025. For the nine-month period, the company reported revenue from operations of ₹9,645.72 crores compared to ₹8,823.38 crores in the previous year. However, profit for the period declined significantly to ₹1,235.41 crores from ₹1,343.23 crores in the corresponding previous period. For the quarter ended September 30, 2025, revenue stood at ₹3,310.72 crores versus ₹2,912.16 crores in the same quarter last year, while quarterly profit increased to ₹409.04 crores from ₹440.45 crores. The company's earnings per share for the nine-month period was ₹58.31 compared to ₹63.39 in the previous year. ABB India has four main business segments: Robotics & Discrete Automation, Motion, Electrification, and Process Automation. The company incorporated a wholly owned subsidiary, ABB Robotics India Private Limited, on September 22, 2025, following the parent company ABB Limited's decision to spin off its Robotics division as a separate listed entity.",
            "Sentiment": "neutral",
            "PublishDate": 1762428971639,
            "Source": "earnings"
        },
        {
            "Title": "ABB India Expands Local Manufacturing with New Energy-Efficient Drives Production Line",
            "Summary": "ABB India has launched a new production line for energy-efficient drives, increasing its manufacturing capacity by 25%. The expansion supports the 'Atmanirbhar Bharat' initiative and incorporates new automation technology designed to enhance productivity and quality in operations.",
            "Sentiment": "positive",
            "PublishDate": 1761642641297,
            "Source": "stock"
        },
        {
            "Title": "ABB's Global Parent Reports Mid-Single Digit Revenue Growth",
            "Summary": "ABB's global parent company reported mid-single digit revenue growth for the fourth quarter. This development relates to ABB India as part of the broader ABB group performance.",
            "Sentiment": "positive",
            "PublishDate": 1760590128771,
            "Source": "stock"
        },
        {
            "Title": "ABB CEO Says Company Has Greater Deal-Making Leverage After Robotics Sales",
            "Summary": "ABB's CEO stated that the company now has greater leverage for deals following its robotics sales. The company aims to expand and pursue more opportunities, with the CEO mentioning that ABB had studied a potential deal for Legrand last year.",
            "Sentiment": "positive",
            "PublishDate": 1759927171927,
            "Source": "stock"
        },
        {
            "Title": "ABB to Sell Global Robotics Division to SoftBank for $5.375 Billion",
            "Summary": "ABB's parent company has agreed to sell its global robotics division to SoftBank Group for an enterprise value of $5.375 billion. This transaction involves ABB's robotics business unit being acquired by the Japanese conglomerate.",
            "Sentiment": "neutral",
            "PublishDate": 1759901915724,
            "Source": "stock"
        },
        {
            "Title": "ABB India Invests ₹140 Crore in Low Voltage Motors Production, Launches IE5 Ultra-Premium Efficiency Motors",
            "Summary": "ABB India has invested over ₹140 crore to enhance its low voltage motors production capacity. The company has introduced India's first IE5 ultra-premium efficiency motors, which deliver up to 40% energy loss savings compared to IE3 motors. This investment represents ABB India's expansion in the energy-efficient motor segment.",
            "Sentiment": "positive",
            "PublishDate": 1758783289092,
            "Source": "stock"
        },
        {
            "Title": "ABB India Secures ₹174 Crore Order",
            "Summary": "ABB India has secured an order worth ₹174 crores. The company announced this business development, which represents a significant contract win for the industrial technology firm.",
            "Sentiment": "positive",
            "PublishDate": 1756448892239,
            "Source": "order&deals"
        },
        {
            "Title": "ABB India Faces INR 5.70 Crores in Customs Fines and Penalties, Plans Appeal",
            "Summary": "ABB India Limited received a customs order imposing a redemption fine of INR 3 crores and a penalty of INR 2.70 crores from the Office of the Principal Commissioner of Customs, Bengaluru. The penalties were imposed under Sections 125 and 114A of the Customs Act, 1962 for wrong availment of benefits under a customs notification. The company received the order dated August 14, 2025 and plans to file an appeal. ABB India expects a favorable outcome at the appellate level and does not anticipate any material impact on the company from this order.",
            "Sentiment": "negative",
            "PublishDate": 1755509705639,
            "Source": "stock"
        },
        {
            "Title": "ABB India Reports Mixed Q2 2025 Results with Revenue Growth Offset by Margin Pressures",
            "Summary": "ABB India Limited reported quarterly results for April-June 2025, showing revenue growth of 12% to INR 3,175 crores, marking an all-time high for the second quarter in five years. However, EBITDA margins declined to 13% due to several factors including QCO compliance requirements that forced higher import content, foreign exchange volatility impacting costs by INR 56 crores, and one-off costs of INR 39.5 crores in the Electrification segment. Base orders grew 5% despite the absence of large orders that characterized previous quarters. The company's order backlog reached a record high of over INR 10,000 crores. Cash balance stands at INR 5,054 crores after distributing INR 700 crores in dividends. The Board declared an interim dividend of INR 9.77 per equity share. Management noted market softening with delayed decision-making on large projects, though base business remains robust. The company celebrated 30 years of NSE listing, highlighting total shareholder returns of 8,500% during this period. All business segments - Process Automation, Motion, Electrification, and Robotics - reported mixed performance with profitability pressures from import content requirements and competitive pricing in certain segments.",
            "Sentiment": "neutral",
            "PublishDate": 1754656109550,
            "Source": "earnings"
        },
        {
            "Title": "ABB India Reports Record Backlog of Over Rs 10,000 Crores with 18-24 Month Delivery Timeline",
            "Summary": "ABB India achieved its highest ever backlog exceeding Rs 10,000 crores, with deliveries scheduled over the next 18-24 months. The company maintains its policy of not providing specific quantitative guidance while working to sustain its historical margin band of 12-15% amid current challenges. ABB India is experiencing delayed decision-making on large projects but continues advancing software development for robotics, including digital twin technology and AI capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1754364245201,
            "Source": "stock"
        },
        {
            "Title": "ABB India Focuses on Product Localization to Strengthen Channel Partnerships",
            "Summary": "ABB India announced it is working on localizing more products for the Indian market as part of its strategy to strengthen channel partnerships. The company shared this update during a conference call.",
            "Sentiment": "positive",
            "PublishDate": 1754363875574,
            "Source": "stock"
        },
        {
            "Title": "ABB India Celebrates 30 Years on NSE with 6,745% Share Price Growth",
            "Summary": "ABB India Limited celebrated 30 years of listing on the National Stock Exchange with a ceremonial bell-ringing event in Mumbai. The company was among the first to list on NSE at its inception in 1994, with shares listed on February 8, 1995. Over three decades, ABB India delivered significant financial performance with market capitalization and share price surging 68 times. A lot of 100 shares purchased at listing for INR 8,883 is now worth over INR 608,050, reflecting a 6,745% increase excluding dividends. The company reported revenue growth of 20 times and profit after tax growth of 37 times since 1994, while maintaining consistent dividend payouts for 30 years. ABB India has expanded from serving 6 industry segments to 23 segments, with manufacturing footprint growing 3-fold. The company employs over 10,000 people and works with 750+ partners across 150+ cities. Over 90% of India-made products are consumed locally under the 'Local for Local' strategy. The event was attended by Ashishkumar Chauhan, MD & CEO of NSE, and Sanjeev Sharma, Country Head and MD of ABB India.",
            "Sentiment": "positive",
            "PublishDate": 1754287569547,
            "Source": "stock"
        },
        {
            "Title": "ABB India Reports Structural Weakness and Declining Order Activity",
            "Summary": "ABB India revealed structural weakness during its conference call, with the company experiencing a correction in order activity. The company is facing challenges in its order book performance.",
            "Sentiment": "negative",
            "PublishDate": 1754280474149,
            "Source": "stock"
        },
        {
            "Title": "ABB India Board Approves Wholly Owned Subsidiary for Robotics Business Separation",
            "Summary": "ABB India Limited's Board of Directors approved the incorporation of a wholly owned subsidiary to potentially house the company's robotics business as a separate legal entity. This decision aligns with ABB Group's global plan to spin off its robotics division. The board also approved the appointment of registered valuers to assess the company's robotics business value. The proposed subsidiary will have an authorized capital of INR 1 lakh and will operate in the robotics industry. The company clarified that no decision has been made regarding divestment of the robotics business to the parent group or third parties, and any such decision would require corporate and regulatory approvals, independent valuation assessments, and other legal processes. The board meeting was held on August 2, 2025, and the incorporation is subject to Ministry of Corporate Affairs approval.",
            "Sentiment": "neutral",
            "PublishDate": 1754132591749,
            "Source": "corporate_action"
        },
        {
            "Title": "ABB India Reports Decline in Q1 Profitability Metrics",
            "Summary": "ABB India reported Q1 EBITDA of Rs 4.13 billion compared to Rs 5.41 billion in the same period last year. The company's EBITDA margin decreased to 13.04% from 19.14% year-over-year. Net profit for the quarter stood at Rs 3.52 billion, down from Rs 4.42 billion in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754131899343,
            "Source": "earnings"
        },
        {
            "Title": "ABB India Reports Strong Q2 2025 Results with 16.6% Revenue Growth",
            "Summary": "ABB India announced its unaudited financial results for the second quarter ended June 30, 2025. The company reported total revenue from operations of ₹3,175.44 crores for Q2 2025, compared to ₹2,830.86 crores in the corresponding quarter of 2024. Profit from continuing operations after tax reached ₹352.08 crores versus ₹442.63 crores in Q2 2024. For the half-year period, total revenue increased to ₹6,335 crores from ₹5,911.22 crores in the previous year, while profit from continuing operations was ₹826.20 crores compared to ₹902.23 crores. The company's performance was impacted by foreign currency fluctuation losses of ₹56.50 crores due to rupee depreciation against Euro and Swiss Francs. Additionally, the company received a customer claim of ₹39.5 crores related to Electrification business projects, which was adjusted against revenue. The Board declared an interim dividend of ₹9.77 per equity share and approved the appointment of advisors for valuation of the Robotics & Discrete Automation segment, following the parent company's decision to spin off its Robotics division.",
            "Sentiment": "neutral",
            "PublishDate": 1754131879512,
            "Source": "earnings"
        },
        {
            "Title": "ABB India Declares Interim Dividend of Rs 9.77 Per Share for FY2025",
            "Summary": "ABB India's Board of Directors declared an interim dividend of Rs 9.77 per share (488.50%) for financial year 2025. The dividend will be paid on or before August 31, 2025 to shareholders whose names appear on the register as of August 8, 2025. The dividend applies to 21,19,08,375 equity shares with a face value of Rs 2 each. The board meeting was held on August 2, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754131158252,
            "Source": "corporate_action"
        },
        {
            "Title": "ABB India and Think Gas Announce Strategic Partnership",
            "Summary": "ABB India and Think Gas have announced a new strategic partnership. The companies have revealed this collaboration, though specific details about the partnership's scope, objectives, or implementation timeline were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1753857857321,
            "Source": "order&deals"
        },
        {
            "Title": "ABB India Schedules Board Meeting to Approve Q2 2025 Results and Consider Interim Dividend",
            "Summary": "ABB India has scheduled a Board of Directors meeting for August 2, 2025, to approve unaudited financial results for the quarter ended June 30, 2025. The board will also consider declaring an interim dividend on equity shares for financial year 2025 and fixing the record date. The trading window for company securities remains closed for all directors and designated employees until August 4, 2025. This follows an earlier intimation dated June 14, 2025, regarding the meeting schedule.",
            "Sentiment": "neutral",
            "PublishDate": 1753794522329,
            "Source": "corporate_action"
        },
        {
            "Title": "ABB India's Global Parent Forecasts 9% Annual Order Inflow Growth",
            "Summary": "ABB India's global parent company has projected a 9% yearly growth in order inflow, which is significantly higher than the previously estimated 1% growth. This forecast suggests a positive outlook for ABB India's business prospects.",
            "Sentiment": "positive",
            "PublishDate": 1752728397000,
            "Source": "default"
        },
        {
            "Title": "ABB Projects Positive Outlook for 2025 and Stable Performance in Q3",
            "Summary": "ABB anticipates a positive book-to-bill ratio and mid-single digit revenue growth for the full-year 2025, with an expected year-over-year improvement in operational EBITA margin. For Q3, ABB India's parent company expects steady mid-single digit revenue growth and a stable operational EBITDA margin compared to the previous year. The CEO of ABB's parent company reports that the trading situation has largely remained unchanged, with some uncertainty regarding potential effects of trade tariffs.",
            "Sentiment": "positive",
            "PublishDate": 1752727908000,
            "Source": "default"
        },
        {
            "Title": "ABB India: Q1 Profit Rises 3.3%, Misses Estimates",
            "Summary": "ABB India's Q1 CY25 net profit increased 3.3% YoY to Rs 474.6 crore, falling short of analyst estimates. Revenue grew 2.6% to Rs 3,159.6 crore. Total orders reached Rs 3,751 crore, driven by base orders and large contracts. Key orders include railway traction equipment and data center power distribution technology.",
            "Sentiment": "neutral",
            "PublishDate": 1746799254000,
            "Source": "earnings"
        },
        {
            "Title": "ABB India Approves Land Lease for Operational Expansion",
            "Summary": "ABB India has approved a plan to lease 10 acres of land to expand its operations. This decision indicates the company's intent to grow its physical presence and potentially increase its production capacity or operational capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1746795393000,
            "Source": "default"
        },
        {
            "Title": "ABB India Reports Q4 2023 Financial Results",
            "Summary": "ABB India has announced its Q4 2023 financial results. The company reported an EBITDA of 5.83 billion rupees, up from 5.65 billion rupees year-over-year, but below the estimated 6.29 billion rupees. The EBITDA margin stood at 18.45%, slightly higher than the previous year's 18.36%, but below the estimated 18.65%. Net profit for Q4 was 4.7 billion rupees, up from 4.59 billion rupees year-over-year, but lower than the estimated 5.11 billion rupees. Revenue for the quarter was 31.6 billion rupees, an increase from 30.8 billion rupees in the previous year, but below the estimated 33.7 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1746794756000,
            "Source": "result"
        },
        {
            "Title": "ABB India: Q1 2025 Results Announcement Date Set",
            "Summary": "ABB India will announce Q1 2025 results on May 9, 2025. The company has scheduled an earnings call with investors on May 12. Trading window for designated persons is closed from March 15 to May 11.",
            "Sentiment": "neutral",
            "PublishDate": 1746680698000,
            "Source": "corporate_action"
        },
        {
            "Title": "ABB India: EV Adoption for Factory Operations and Deliveries in Bengaluru",
            "Summary": "ABB India has introduced electric vehicles for transporting goods between its factory and distribution center, as well as for last-mile deliveries in Bengaluru. This initiative, launched at the Smart Power factory campus and Hanchipura distribution centre, aims to reduce Scope-3 greenhouse gas emissions.",
            "Sentiment": "positive",
            "PublishDate": 1745493561000,
            "Source": "corporate_action"
        },
        {
            "Title": "ABB to Spin Off Robotics Division as Separate Company",
            "Summary": "ABB India has announced plans to spin off its robotics division into a separately listed company. This strategic move aims to create an independent entity focused on robotics and automation technologies, potentially allowing for more specialized growth and investment in this rapidly evolving sector.",
            "Sentiment": "neutral",
            "PublishDate": 1744907832000,
            "Source": "default"
        },
        {
            "Title": "ABB India Reports 1% Growth Compared to -21% Quarter-over-Quarter",
            "Summary": "ABB India, a major industrial technology company, has reported a growth of 1% in its latest quarterly results. This represents a significant improvement compared to the previous quarter's decline of 21%. The positive growth indicates a potential recovery or stabilization in ABB India's business operations.",
            "Sentiment": "positive",
            "PublishDate": 1744865932000,
            "Source": "default"
        },
        {
            "Title": "ABB India Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 40,586 shares of ABB India Ltd. occurred on the National Stock Exchange (NSE) for Rs. 22.00 Crores. The trade was executed at a price of Rs. 5419.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1744777927000,
            "Source": "block_details"
        },
        {
            "Title": "ABB India Delivers Integrated Automation for IndianOil's Largest Pipeline Network",
            "Summary": "ABB India has successfully provided integrated automation and digital technology solutions for IndianOil's largest pipeline network in India. This implementation showcases ABB's capabilities in delivering advanced technological solutions for critical infrastructure projects in the energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1743578861000,
            "Source": "order&deals"
        },
        {
            "Title": "ABB Motion Invests in AI Start-up UptimeAI for Predictive Maintenance",
            "Summary": "ABB Motion, a division of ABB India, has made an investment in UptimeAI, an artificial intelligence start-up. The investment aims to enhance asset health and performance management using AI and machine learning-driven predictive maintenance technologies. Initially, the focus will be on implementing these solutions in the cement, metals, and water pipes industries in India.",
            "Sentiment": "positive",
            "PublishDate": 1741084092000,
            "Source": "corporate_action"
        },
        {
            "Title": "ABB India Forecasts 10-15% Growth for FY26",
            "Summary": "ABB India anticipates a growth rate of 10-15% for the fiscal year 2026. This projection is based on the company's expectation of easing backlog constraints, which have likely been impacting their operations. The forecast suggests a positive outlook for the company's future performance and potential expansion in the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1740224648000,
            "Source": "corporate_action"
        },
        {
            "Title": "ABB India Launches New Modular 'Liora' Switch Range",
            "Summary": "ABB India has introduced a new modular switch range called 'Liora' at the ELECRAMA 2025 event. This launch represents an expansion of ABB's product offerings in the electrical equipment sector, potentially enhancing their market position in the Indian electrical industry.",
            "Sentiment": "positive",
            "PublishDate": 1740209909000,
            "Source": "corporate_action"
        },
        {
            "Title": "ABB India: Margin Forecast of 12-15% for FY26 as Backlog Impact Eases",
            "Summary": "ABB India expects margins to stabilize at 12-15% in FY26 as the effect of backlog conversion diminishes. The company reported a 56% YoY increase in Q3 net profit to Rs 528.41 crore, with revenues up 22% YoY to Rs 3,364.93 crore. Margins expanded to 19.5% in Q3 from 15% a year ago, driven by efficient backlog execution and market expansion.",
            "Sentiment": "positive",
            "PublishDate": 1740196566000,
            "Source": "earnings"
        },
        {
            "Title": "ABB India: Brokerages Downgrade Stock Amid Order Inflow Concerns",
            "Summary": "Nomura downgrades ABB India to 'reduce' with a 34% cut in target price to ₹4,970. Concerns over slowing orders and margin pressures lead to EPS estimate revisions. Other brokerages also reduce target prices. ABB shares down 26% in 2025, 42% from October 2024 high.",
            "Sentiment": "negative",
            "PublishDate": 1739938266000,
            "Source": "normal_news"
        },
        {
            "Title": "ABB India Reports Moderating Growth and Increased Competition",
            "Summary": "During an analysts' meeting, ABB India disclosed that its growth is slowing down. The company is facing increased competition from Chinese players, which is leading to pricing pressure in the market. This information suggests challenges ahead for ABB India in maintaining its market position and profit margins.",
            "Sentiment": "negative",
            "PublishDate": 1739864034000,
            "Source": "earnings"
        }
    ]
}