{
    "Symbol": "ABBOTINDIA",
    "ISIN": "INE358A01014",
    "News": [
        {
            "Title": "Abbott India Board Meet Set for Feb 12 Q3FY26 Results",
            "Summary": "Abbott India Limited has scheduled its Board of Directors meeting for February 12, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770181560501,
            "Source": "co_actions_results"
        },
        {
            "Title": "ABB India Block Trade Worth Rs. 69.64 Crores",
            "Summary": "ABB India executed a significant block trade on NSE worth Rs. 69.64 crores involving 121,882 shares at Rs. 5713.50 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1770106012517,
            "Source": "co_actions_results"
        },
        {
            "Title": "ABB India Shows Bullish Technical Reversal Pattern",
            "Summary": "ABB India exhibits double bottom pattern breakout above ₹4,750 resistance with technical indicators confirming bullish momentum despite recent declines of 7.90% monthly and 24.02% yearly.",
            "Sentiment": "positive",
            "PublishDate": 1769132297423,
            "Source": "stocks"
        },
        {
            "Title": "Abbott shares drop 8% on Q4 revenue miss, weak Q1 outlook",
            "Summary": "Abbott Laboratories stock fell over 8% after missing Q4 revenue targets at $11.5 billion versus $11.8 billion expected and forecasting Q1 earnings below Wall Street estimates at $1.12-$1.18 per share.",
            "Sentiment": "negative",
            "PublishDate": 1769102499756,
            "Source": "global"
        },
        {
            "Title": "ABB targets higher India revenue share before 2030",
            "Summary": "ABB CEO Morten Wierod announces plans to increase India's contribution to global revenues and elevate it from fourth to third-largest market position before 2030, citing strong order book and energy expansion opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1768985414620,
            "Source": "stocks"
        },
        {
            "Title": "ABB India Upgrades BPCL Pipeline Infrastructure",
            "Summary": "ABB India Limited successfully completes critical pipeline upgrade for BPCL, enhancing national energy security with zero downtime. Project delivers improved cybersecurity and system reliability.",
            "Sentiment": "positive",
            "PublishDate": 1768902258676,
            "Source": "stocks"
        },
        {
            "Title": "ABB India Ships First Local Wind Power Converter",
            "Summary": "ABB India dispatched its first locally manufactured wind power converter from Nelamangala facility following acquisition of Gamesa Electric's power electronics business.",
            "Sentiment": "positive",
            "PublishDate": 1768801984561,
            "Source": "stocks"
        },
        {
            "Title": "Abbott India Faces ₹2.40 Cr GST Penalty Order",
            "Summary": "Abbott India Limited receives GST penalty order of ₹2.40 crores from tax authorities for disallowance of Input Tax Credit across multiple financial years. Company plans to file appeal.",
            "Sentiment": "negative",
            "PublishDate": 1767165034237,
            "Source": "stocks"
        },
        {
            "Title": "Abbott India Announces Board Changes for 2026",
            "Summary": "Abbott India announces resignation of Director Ambati Venu effective December 31, 2025, and appointment of Vivek Mohan as Additional Non-Executive Director from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766592028250,
            "Source": "stocks"
        },
        {
            "Title": "Abbott India Announces Senior Management Changes with New HR Director Appointment",
            "Summary": "Abbott India announced that Mr. Rajan Kalantre, Director of Business Human Resources, will move to another Abbott affiliate effective December 16, 2025, with his role ending December 15, 2025. The company appointed Ms. Vinutha Mufti as the new Director of Business Human Resources effective December 16, 2025, bringing over two decades of HR experience including progressive roles at Abbott since 2015 and previous experience at IBM.",
            "Sentiment": "neutral",
            "PublishDate": 1764075539190,
            "Source": "corporate_governance"
        },
        {
            "Title": "Abbott India Gets Government Approval for New Managing Director Appointment",
            "Summary": "The government has approved Kartik Rajendran's appointment as the new Managing Director of Abbott India. This leadership change affects the pharmaceutical company's management structure and operations going forward.",
            "Sentiment": "positive",
            "PublishDate": 1763973322041,
            "Source": "corporate_governance"
        },
        {
            "Title": "ABB India Q3 Profit Falls 7.3% Despite Revenue Growth of 13.7%",
            "Summary": "ABB India reported mixed quarterly results with net profit declining to ₹409 crore, missing analyst estimates of ₹413.3 crore and falling 7.3% from the previous year's ₹441 crore. Revenue rose 13.7% year-on-year to ₹3,310 crore, exceeding projections of ₹3,175.7 crore, driven by growth in electrification and automation segments. EBITDA decreased 7.4% to ₹500 crore with operating margin at 15.1%, down from 18.5% in the same quarter last year, reflecting cost pressures and unfavorable product mix. New orders in the capital goods sector fell approximately 20% year-on-year, excluding large one-off deals, with analysts citing muted private-sector capital expenditure and increased competition affecting demand for engineering services firms.",
            "Sentiment": "negative",
            "PublishDate": 1762434692535,
            "Source": "earnings"
        },
        {
            "Title": "Abbott India Reports Strong Q2 Performance with 17% Jump in Net Profit",
            "Summary": "Abbott India delivered robust quarterly results with net profit rising to 4.2 billion rupees from 3.6 billion rupees year-over-year. The pharmaceutical company's EBITDA increased to 5 billion rupees compared to 4.38 billion rupees in the same period last year. EBITDA margin improved to 28.58% from 26.85% year-over-year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1762415832647,
            "Source": "earnings"
        },
        {
            "Title": "ABB India Expands Bengaluru Plant, Boosts Local Drive Production by 25%",
            "Summary": "ABB India launched new variable speed drive modules at its Peenya factory in Bengaluru, increasing local production capacity by 25%. The expansion enables the company to cut delivery times by up to 40% and produce customized drives for buildings, data centers, water, cement, and metals industries. The new manufacturing line features integrated robotics for automated production and can handle large batches with speed and precision. ABB India marks two decades of drives production in India with this expansion. The company previously secured a ₹173.55 crore order in August to supply wind turbine converters to Siemens Gamesa Renewable Power.",
            "Sentiment": "positive",
            "PublishDate": 1761654671758,
            "Source": "stock"
        },
        {
            "Title": "Abbott India Shareholders Approve Appointment of Darshan Gada as Director",
            "Summary": "Abbott India Limited completed a postal ballot through e-voting for the appointment of Mr. Darshan Gada as a Director. The e-voting period concluded on October 14, 2025, at 5:00 p.m. The resolution was approved by shareholders on October 14, 2025, as confirmed by the Scrutinizer's Report issued by Mr. Taizoon M. Khumri of Khumri Wagh Fatehi & Associates LLP. Mr. Gada's appointment as Director became effective August 18, 2025. The voting results are available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1760522472229,
            "Source": "corporate_action"
        },
        {
            "Title": "ABB India Shares Drop 35% in 12 Months Amid Operational Challenges and Valuation Correction",
            "Summary": "ABB India shares have declined over 24% year-to-date and more than 35% over 12 months, underperforming peers Siemens and Cummins India. The stock currently trades at 57 times price-to-earnings ratio, representing a 23% discount to its five-year average of 74 times, while competitors trade at premiums to their historical averages. The decline stems from operational uncertainty, with sluggish customer decision-making delaying order conversions and JPMorgan expecting soft large-ticket business in the second half. Analysts believe the company has passed its margin peaks and revenues have been lower than anticipated due to macro factors. However, JPMorgan and Ambit Capital expect faster order conversion and stronger project pipeline ahead, with potential recovery in process industries capital expenditure supporting medium-term growth. Brokerages see 7% upside from current levels with 50% recommending a buy rating, though growth momentum is expected to remain range-bound.",
            "Sentiment": "negative",
            "PublishDate": 1758787172272,
            "Source": "stock"
        },
        {
            "Title": "Abbott India Seeks Shareholder Approval for Darshan Gada's Director Appointment via Postal Ballot",
            "Summary": "Abbott India Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. Darshan Gada as a Non-Executive Director. Gada was initially appointed as an Additional Director on August 18, 2025, based on the Nomination and Remuneration Committee's recommendation. The 43-year-old Chartered Accountant brings over 21 years of finance experience and currently serves as Regional Finance Director at Abbott Healthcare Private Limited. Remote e-voting will be conducted from September 15 to October 14, 2025, with results to be declared by October 16, 2025. The cut-off date for voting eligibility is September 5, 2025. KFin Technologies Limited will provide the e-voting facility, and the appointment requires ordinary resolution approval from shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1757591935196,
            "Source": "corporate_governance"
        },
        {
            "Title": "Abbott India Launches FreeStyle Libre 2 Plus Glucose Monitoring Device",
            "Summary": "Abbott India has launched the FreeStyle Libre 2 Plus, a next-generation glucose monitoring device. The product provides continuous glucose readings every minute and includes optional alarm features for users.",
            "Sentiment": "positive",
            "PublishDate": 1756210631358,
            "Source": "stock"
        },
        {
            "Title": "Abbott India Shareholders Approve All Resolutions at 81st Annual General Meeting",
            "Summary": "Abbott India Limited held its 81st Annual General Meeting on August 13, 2025, through video conferencing. All proposed resolutions were approved by shareholders with the required majority. The approved resolutions included adoption of audited financial statements for the year ended March 2025, declaration of a final dividend per equity share, reappointment of directors Ms. Alison Davies and Mr. Kaiyomarz Marfatia who retired by rotation, appointment of BNP & Associates as secretarial auditors for five consecutive financial years, ratification of cost auditor remuneration, and appointment of Mr. Kartik Rajendran as Director and Managing Director for five years from June 2025 to June 2030. The meeting was conducted with remote e-voting and e-voting facilities provided through National Securities Depository Limited (NSDL). Mr. Husain Wagh of Khumri Wagh Fatehi & Associates LLP served as the scrutinizer for the voting process.",
            "Sentiment": "positive",
            "PublishDate": 1755164101806,
            "Source": "corporate_action"
        },
        {
            "Title": "Abbott India Reports Strong Q1 Results with 11% Revenue Growth",
            "Summary": "Abbott India delivered robust Q1 performance with net profit rising to 3.65 billion rupees from 3.3 billion rupees year-over-year. Revenue increased to 17.4 billion rupees compared to 15.6 billion rupees in the same period last year. EBITDA grew to 4.45 billion rupees from 3.9 billion rupees, while EBITDA margin improved to 25.63% from 25.1% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754984722268,
            "Source": "earnings"
        },
        {
            "Title": "ABB India Targets 12-15% Profit Margin Despite Industrial Project Slowdown",
            "Summary": "ABB India is experiencing a temporary slowdown in its large-scale industrial projects segment but expects to maintain profit margins between 12-15% in 2025. The company reported a record order backlog exceeding Rs 10,000 crore, with 90% of business coming from the domestic market. Managing Director Sanjeev Sharma noted that the systems order segment, which handles heavy industry solutions, is facing cyclical challenges due to customer delays caused by uncertainty around trade tariffs. In the second quarter, net profit declined 20.7% to Rs 351.7 crore while revenue grew 12.2% to Rs 3,175.4 crore. EBITDA dropped 27% to Rs 441 crore with margins falling to 13% from 19.2% year-over-year. The company sees strong demand in tier-1, tier-2, and tier-3 markets, particularly in infrastructure, real estate, and data centers. ABB India shares closed 5.34% lower at Rs 5,100.",
            "Sentiment": "neutral",
            "PublishDate": 1754358950319,
            "Source": "stock"
        },
        {
            "Title": "ABB India Reports Mixed Q2 Results with Revenue Growth Offset by Margin Decline",
            "Summary": "ABB India reported quarterly results showing revenue growth of 12% to ₹3,175 crore, meeting market expectations. However, the company faced significant operational challenges as EBITDA fell 24% to ₹414.9 crore, missing estimates of ₹582 crore. EBITDA margin declined over six percentage points to 13% from 19.2% in the previous year. Cost pressures included a 21% increase in Cost of Goods driven by 26% higher raw material costs, 24% increase in subcontracting charges, and 38% jump in stock-in-trade purchases. Net profit declined 21% year-on-year. Order inflow dropped 12% to ₹3,036 crore and fell 19% sequentially. The order book crossed ₹10,000 crore but grew only 6% annually and 1% from March. The board approved appointing valuers to evaluate the Robotics division for incorporation into a wholly-owned subsidiary, though no divestment decision has been made. Shares closed 2.3% lower at ₹5,384 and have declined 8.1% over the past month.",
            "Sentiment": "negative",
            "PublishDate": 1754263744601,
            "Source": "earnings"
        },
        {
            "Title": "ABB India Reports 21% Profit Decline, Misses Analyst Estimates Despite Revenue Growth",
            "Summary": "ABB India reported a 21% decline in net profit to Rs 352 crore for the second quarter, missing analyst estimates of Rs 463.7 crore. Despite revenue growing 12.2% to Rs 3,175 crore and beating estimates of Rs 3,160 crore, the company's profitability was impacted by margin compression. EBITDA fell 23.7% to Rs 414 crore, significantly below the estimated Rs 572.5 crore, while margins contracted to 13% from 19.2% in the previous year. The company declared an interim dividend of Rs 9.77 per share. ABB India shares have declined 22.06% year-to-date and 30.66% over the past 12 months. Among analysts covering the stock, 18 out of 31 maintain buy ratings, while 8 have hold recommendations and 5 suggest sell.",
            "Sentiment": "negative",
            "PublishDate": 1754133694323,
            "Source": "earnings"
        },
        {
            "Title": "Abbott India Pays Rs. 2 Lakh Penalty to RBI for Exceeding Foreign Investment Limits",
            "Summary": "Abbott India Limited received a Compounding Order from the Reserve Bank of India's Foreign Exchange Department on July 31, 2025, requiring the company to pay Rs. 2,00,000 as penalty. The violation involved foreign investment in the company exceeding 75% due to secondary market transactions on stock exchanges without obtaining prior government approval, contravening foreign exchange laws. The company will deposit the compounding amount as directed. Once the compounding process is closed, Abbott India will be able to receive investment from foreign institutional investors up to the prescribed limit.",
            "Sentiment": "neutral",
            "PublishDate": 1754027398471,
            "Source": "corporate_governance"
        },
        {
            "Title": "Abbott India Ltd: Q4 Profit and Revenue Surge, Stock Climbs",
            "Summary": "Abbott India Ltd reported a 14.7% increase in Q4 net profit to Rs 359 crore, surpassing estimates. Revenue rose 9% to Rs 1,633 crore, while EBITDA grew 15% to Rs 439 crore. The company's stock price gained nearly 4%, reaching Rs 31,500 per share.",
            "Sentiment": "positive",
            "PublishDate": 1747374187000,
            "Source": "earnings"
        },
        {
            "Title": "Abbott India Reports Q4 Results and Recommends Dividend",
            "Summary": "Abbott India has reported its quarterly results. The company's Q4 net profit increased to 3.7 billion rupees, up from 2.87 billion rupees year-over-year and 3.6 billion rupees quarter-over-quarter. Q4 revenue rose to 16 billion rupees from 14.39 billion rupees year-over-year. Additionally, the company has recommended a dividend of 475 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747354130000,
            "Source": "default"
        },
        {
            "Title": "Abbott India: Q4 Profit Soars 28%, ₹475 Dividend Proposed",
            "Summary": "Abbott India reported a 27.9% YoY increase in Q4 net profit to ₹367 crore. Revenue grew 11.5% to ₹1,604.6 crore. EBITDA rose 30% with margin expanding to 26.7%. The board recommended a final dividend of ₹475 per share for FY25, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1747320922000,
            "Source": "earnings"
        },
        {
            "Title": "Abbott India Recommends Dividend of 475 Rupees per Share",
            "Summary": "Abbott India has recommended a dividend of 475 rupees per equity share. No additional details about the timing, record date, or fiscal period were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747316545000,
            "Source": "result"
        },
        {
            "Title": "Abbott India Reports Strong Q4 Financial Results",
            "Summary": "Abbott India has announced its Q4 financial results. The company's EBITDA increased to 4.3 billion rupees from 3.3 billion rupees year-over-year. The EBITDA margin improved to 26.73% from 22.91% in the same period. Net profit rose to 3.7 billion rupees from 2.87 billion rupees year-over-year and 3.6 billion rupees quarter-over-quarter. Revenue for Q4 reached 16 billion rupees, up from 14.39 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747316481000,
            "Source": "result"
        },
        {
            "Title": "Abbott India Reports 16% Increase in Q3 Net Profit",
            "Summary": "Abbott India has announced its financial results for the third quarter, reporting a net profit of 3.6 billion rupees. This represents a significant increase from the 3.1 billion rupees reported in the same quarter of the previous year, indicating a year-over-year growth of approximately 16%.",
            "Sentiment": "positive",
            "PublishDate": 1738741983000,
            "Source": "earnings"
        },
        {
            "Title": "Abbott India Reports Improved Q2 Financial Performance",
            "Summary": "Abbott India has announced its Q2 financial results, showing improved performance compared to the previous year. The company's EBITDA increased to 4.38 billion rupees from 3.9 billion rupees year-over-year. Additionally, the EBITDA margin improved to 26.85% from 25.49% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730966312000,
            "Source": "result"
        },
        {
            "Title": "ABB: Q3 Profit Beats Forecasts, Raises Profitability Outlook",
            "Summary": "ABB reported Q3 operational core profit of $1.55 billion, exceeding expectations. The company slightly raised its full-year profitability outlook, now expecting operational EBITA margin to be 'slightly above 18%'. However, ABB downgraded its full-year revenue growth forecast to 'below 5%'. Q3 revenues increased 2% to $8.15 billion, missing forecasts.",
            "Sentiment": "positive",
            "PublishDate": 1729143004000,
            "Source": "result"
        }
    ]
}