{
    "Symbol": "ABCAPITAL",
    "ISIN": "INE674K01013",
    "News": [
        {
            "Title": "Aditya Birla Capital allots 5.16 lakh shares under ESOP",
            "Summary": "Aditya Birla Capital Limited allotted 5,16,185 equity shares under employee stock option schemes, increasing paid-up capital from ₹26,17,60,43,770 to ₹26,18,12,05,620.",
            "Sentiment": "neutral",
            "PublishDate": 1770782158683,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Birla Capital Grants ESOPs and PSUs to Employees",
            "Summary": "Aditya Birla Capital's Nomination Committee approved grant of 73,598 stock options at ₹333.05 per share and 27,622 PSUs at ₹10 per share to eligible employees under ABCL Scheme 2022.",
            "Sentiment": "positive",
            "PublishDate": 1770124484201,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Birla Capital Q3 Profit Jumps 34% to ₹9.5B",
            "Summary": "Aditya Birla Capital reported strong Q3 performance with consolidated net profit rising 34% YoY to ₹9.5 billion, while revenue grew 27% to ₹119 billion compared to previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770116384156,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Birla Capital Secures ₹2,750 Crore Investment",
            "Summary": "Aditya Birla Capital approves ₹2,750 crore investment from Advent International in its housing finance subsidiary, with Advent set to acquire 14.3% stake pending regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1770090204403,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Birla Capital Allots 1.17 Lakh Equity Shares",
            "Summary": "Aditya Birla Capital allotted 1,16,888 equity shares under ESOP schemes on 29 January 2026, increasing paid-up capital to ₹26,17,60,43,770 from ₹26,17,48,74,890.",
            "Sentiment": "neutral",
            "PublishDate": 1769705209594,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Birla Capital Q3FY26 Earnings Call Feb 3",
            "Summary": "Aditya Birla Capital announces investor conference call on February 3, 2026 at 19:30 IST to discuss Q3FY26 financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769695922877,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Birla Capital Allots Rs 325 Crore NCDs",
            "Summary": "Aditya Birla Capital Limited successfully allotted 32,500 Non-Convertible Debentures worth Rs 325 crore on private placement basis with 8.03% coupon rate and 10-year maturity period.",
            "Sentiment": "positive",
            "PublishDate": 1769518560598,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Birla Capital Gets Credit Rating Reaffirmation",
            "Summary": "Crisil Ratings reaffirmed AAA/Stable ratings for Aditya Birla Capital's debt instruments worth Rs. 1,00,100.00 crore, covering bank facilities, subordinated debt, and non-convertible debentures.",
            "Sentiment": "positive",
            "PublishDate": 1769178937468,
            "Source": "stocks"
        },
        {
            "Title": "Aditya Birla Capital hits fresh highs, experts suggest buy on dips",
            "Summary": "Aditya Birla Capital reached new 52-week highs in January 2026 but couldn't sustain momentum. Technical analysts recommend buying on dips with target of ₹388.00, citing strong base formation around ₹340.00 levels.",
            "Sentiment": "neutral",
            "PublishDate": 1768996556309,
            "Source": "stocks"
        },
        {
            "Title": "Aditya Birla Capital Allots ₹215 Cr NCDs",
            "Summary": "Aditya Birla Capital successfully allotted 215 perpetual non-convertible debentures worth ₹215 crores on private placement basis with 8.37% annual coupon rate.",
            "Sentiment": "positive",
            "PublishDate": 1768828028123,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Birla Capital Plans Debt Securities Issue",
            "Summary": "Aditya Birla Capital is considering raising funds through debt securities issuance scheduled for February 3, as part of its capital mobilization strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1768574578660,
            "Source": "stocks"
        },
        {
            "Title": "Aditya Birla Capital Board Meet on Feb 3 for Q3 Results",
            "Summary": "Aditya Birla Capital has scheduled its board meeting for February 3, 2026, to approve Q3FY26 financial results and consider fund raising through debt securities.",
            "Sentiment": "neutral",
            "PublishDate": 1768574553277,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Birla Capital Allots 85,074 Shares Under ESOP",
            "Summary": "Aditya Birla Capital allotted 85,074 equity shares under ESOP schemes on January 16, 2026, increasing paid-up capital from ₹26,17,40,24,150 to ₹26,17,48,74,890. The allotment includes shares from both 2017 and 2022 schemes.",
            "Sentiment": "neutral",
            "PublishDate": 1768566430629,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Birla Capital Allots ₹254 Cr NCDs",
            "Summary": "Aditya Birla Capital successfully allotted ₹254 crores worth of secured non-convertible debentures through private placement on January 12, 2026, comprising two tranches with different face values and tenors.",
            "Sentiment": "positive",
            "PublishDate": 1768224003896,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Birla Health Insurance Premium Surges 64.58%",
            "Summary": "Aditya Birla Health Insurance reported a significant 64.58% year-on-year growth in premium collections for December, demonstrating strong performance in the health insurance segment.",
            "Sentiment": "positive",
            "PublishDate": 1767777563682,
            "Source": "stocks"
        },
        {
            "Title": "Aditya Birla Capital invests ₹40 cr in digital arm",
            "Summary": "ABCL invested ₹40 crore in wholly-owned subsidiary ABCDL through rights issue to meet growth requirements. Q2 revenue rose 4% YoY to ₹12,481 crore with NBFC AUM growing 22% to ₹1.39 lakh crore.",
            "Sentiment": "positive",
            "PublishDate": 1767010920554,
            "Source": "stocks"
        },
        {
            "Title": "Aditya Birla Capital Raises ₹810 Cr via NCDs",
            "Summary": "Aditya Birla Capital successfully allotted 81,000 non-convertible debentures worth ₹810 crores on private placement basis with 7.38% coupon rate and February 2028 maturity.",
            "Sentiment": "positive",
            "PublishDate": 1766752898278,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Birla Capital Gets RBI NBFC-ICC Registration",
            "Summary": "Aditya Birla Capital Limited receives Certificate of Registration from RBI as NBFC-Investment and Credit Company, completing conversion from NBFC-Core Investment Company status.",
            "Sentiment": "positive",
            "PublishDate": 1765452945796,
            "Source": "stocks"
        },
        {
            "Title": "Aditya Birla Capital Wins Tax Appeal at ITAT",
            "Summary": "ITAT dismisses Income Tax Department's appeal against subsidiary ABSLI, confirming nullification of ₹2,123.62 crore tax demand in favorable ruling for Aditya Birla Capital.",
            "Sentiment": "positive",
            "PublishDate": 1765452654607,
            "Source": "stocks"
        },
        {
            "Title": "Aditya Birla Capital Gets ESG Rating of 68 from NSE",
            "Summary": "Aditya Birla Capital receives an ESG rating of 68 from NSE Sustainability Ratings Analytics Limited, reflecting its performance on Environmental, Social and Governance parameters based on publicly available information.",
            "Sentiment": "positive",
            "PublishDate": 1765384083838,
            "Source": "stocks"
        },
        {
            "Title": "Aditya Birla Capital Receives ESG Rating of 68 from NSE Sustainability",
            "Summary": "Aditya Birla Capital Limited has been assigned an ESG rating of 68 by NSE Sustainability Ratings Analytics Limited, reflecting the company's performance on Environmental, Social and Governance parameters. The rating was independently prepared by NSE Sustainability based on publicly available information without the company's engagement.",
            "Sentiment": "positive",
            "PublishDate": 1765365517539,
            "Source": "stock"
        },
        {
            "Title": "Aditya Birla Capital Allots 4.34 Lakh Equity Shares Under Employee Stock Option Schemes",
            "Summary": "Aditya Birla Capital's Stakeholders Relationship Committee approved allotment of 4,34,391 equity shares of face value ₹10 each under ABCL Scheme 2017 and ABCL Scheme 2022. The allotment increases the company's paid-up equity share capital from ₹26,15,33,49,380 to ₹26,15,76,93,290, with the new shares ranking pari passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1765306628899,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Capital Allots 6.01 Lakh Equity Shares Under Employee Stock Option Schemes",
            "Summary": "Aditya Birla Capital's Stakeholders Relationship Committee approved allotment of 6,01,897 equity shares of face value ₹10 each under ABCL Scheme 2017 and ABCL Scheme 2022 following exercise of stock options by employees. The company's paid-up equity share capital increased from ₹26,14,73,30,410 to ₹26,15,33,49,380 with the new shares ranking pari passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764741389209,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Capital Invests Rs 300 Crore in Housing Finance Subsidiary",
            "Summary": "Aditya Birla Capital Limited invested Rs 300 crore on rights basis in equity shares of its wholly owned subsidiary Aditya Birla Housing Finance Limited. The investment aims to fund ABHFL's growth and improve its leverage ratio, with ABCL maintaining 100% shareholding in the housing finance company.",
            "Sentiment": "positive",
            "PublishDate": 1764589730670,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Capital's Independent Director Vijayalakshmi Iyer Resigns Due to Personal and Professional Commitments",
            "Summary": "Ms. Vijayalakshmi Iyer resigned as Non-Executive Independent Director of Aditya Birla Capital Limited effective November 27, 2025, citing personal and professional commitments after serving on the board since 2018. Her resignation results in cessation from key committee positions including Chairperson of Audit Committee and Stakeholders Relationship Committee, impacting the company's governance structure.",
            "Sentiment": "neutral",
            "PublishDate": 1764264945931,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aditya Birla Capital Invests ₹40 Crores in Aditya Birla Digital",
            "Summary": "Aditya Birla Capital has made an investment of ₹40 crores in Aditya Birla Digital. This investment represents the company's capital allocation towards its digital business segment.",
            "Sentiment": "positive",
            "PublishDate": 1764122866465,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Capital Allots Rs 200 Crore Perpetual Non-Convertible Debentures",
            "Summary": "Aditya Birla Capital Limited has allotted 200 unsecured, rated, listed, taxable, redeemable non-convertible perpetual debentures worth Rs 200 crore on private placement basis to identified investors. The debentures have a face value of Rs 1 crore each and are listed on BSE and NSE, with a call option exercisable after 10 years and 6 months from November 25, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764072828567,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Capital Allots 12.71 Lakh Equity Shares Under Employee Stock Option Schemes",
            "Summary": "Aditya Birla Capital's Stakeholders Relationship Committee approved allotment of 12,71,473 equity shares of face value ₹10 each under ABCL Scheme 2017 and ABCL Scheme 2022. The company's paid-up equity share capital increased from ₹26,13,46,15,680 to ₹26,14,73,30,410, with the new shares ranking pari passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763988702857,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Capital Allots Rs 1,750 Crore Non-Convertible Debentures Through Private Placement",
            "Summary": "Aditya Birla Capital Limited has allotted 17,500 unsecured, rated, listed, taxable, redeemable non-convertible subordinate debentures worth Rs 1,75,00,00,000 with a face value of Rs 1,00,000 each to identified investors on private placement basis. The debentures are listed on BSE Limited and National Stock Exchange of India Limited with a maturity period of 3,454 days and scheduled redemption at Rs 1,00,000 per debenture on the maturity date of May 04, 2035.",
            "Sentiment": "neutral",
            "PublishDate": 1763470607902,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Capital Allots 7.38 Lakh Equity Shares Under Employee Stock Option Schemes",
            "Summary": "Aditya Birla Capital's Stakeholders Relationship Committee approved allotment of 7,38,680 equity shares of face value ₹10 each under ABCL Scheme 2017 and ABCL Scheme 2022 following exercise of stock options by employees. The allotment increases the company's paid-up equity share capital from ₹26,12,72,28,880 to ₹26,13,46,15,680, with the new shares ranking pari passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763376563771,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Capital Board Approves Merger of Two Wholly-Owned Subsidiaries",
            "Summary": "Aditya Birla Capital's Board approved the amalgamation of Aditya Birla Stressed Asset AMC Private Limited with Aditya Birla Financial Shared Services Limited, both wholly-owned subsidiaries with combined turnover of Rs. 10.17 crore for the financial year ended March 31, 2025. The merger aims to rationalize organizational structure, reduce regulatory compliance costs, and optimize resource utilization, with a share exchange ratio of 97:1000 and no impact on the parent company's shareholding pattern.",
            "Sentiment": "positive",
            "PublishDate": 1763175636587,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Capital Allots Rs 670 Crore Non-Convertible Debentures Through Private Placement",
            "Summary": "Aditya Birla Capital Limited has allotted non-convertible debentures worth Rs 670 crore to multiple investors on November 6, 2025. The allotment consists of two tranches: 17,000 debentures aggregating Rs 170 crore with maturity on July 20, 2035, and 50,000 debentures aggregating Rs 500 crore with maturity on September 15, 2028. Both series are secured, rated, and listed on BSE Limited and National Stock Exchange of India Limited. The debentures have a face value of Rs 1 lakh each and are secured by hypothecation through first pari passu charge over the company's receivables, securities, future moveable assets and current assets. The second tranche carries a coupon rate of 7.2959% per annum with annual coupon payments.",
            "Sentiment": "neutral",
            "PublishDate": 1762442018164,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Capital Reports 3% Profit Growth, Lending Portfolio Expands 29%",
            "Summary": "Aditya Birla Capital reported consolidated profit after tax of ₹855 crore, up 3% year-on-year for the quarter ended September 30, 2025, while revenue grew 4% to ₹12,481 crore. The company's total lending portfolio expanded 29% to ₹1,77,855 crore. The NBFC business recorded disbursements of ₹21,990 crore (up 14%) with assets under management growing 22% to ₹1,39,585 crore. The housing finance arm showed strong performance with disbursements rising 44% to ₹5,786 crore and profit before tax nearly doubling to ₹194 crore (87% increase). In asset management, mutual fund quarterly average AUM increased 11% to ₹4,25,171 crore. Life insurance individual first year premium grew 19% to ₹1,880 crore in the first half of FY26, while health insurance gross written premium jumped 31% to ₹2,839 crore. The company's digital platform ABCD acquired 76 lakh customers, while Udyog Plus reached ₹4,397 crore in AUM with 24 lakh registrations. Shares traded at ₹325.50, up 4.73%, hitting a 52-week high of ₹327.95.",
            "Sentiment": "positive",
            "PublishDate": 1761817434889,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Capital Reports 10% Year-Over-Year AUM Growth",
            "Summary": "Aditya Birla Capital reported a 10% year-over-year increase in total Assets Under Management (AUM) as of September 30. The growth reflects the company's expanding asset management business.",
            "Sentiment": "positive",
            "PublishDate": 1761814523718,
            "Source": "stock"
        },
        {
            "Title": "Aditya Birla Capital Reports Mixed Q2 Results with Revenue Growth and Profit Decline",
            "Summary": "Aditya Birla Capital reported quarterly consolidated net profit of 8.5 billion rupees compared to 10 billion rupees in the same period last year, representing a decline. The company's revenue increased to 106 billion rupees from 103 billion rupees year-over-year, showing growth in the top line despite the profit decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1761813829241,
            "Source": "earnings"
        },
        {
            "Title": "Goldman Sachs, Morgan Stanley Lead Rs 819 Crore Block Deal in Aditya Birla Capital",
            "Summary": "Aditya Birla Capital saw a block deal worth Rs 819 crore as Advent International's arm Jomei Investments sold 2.66 crore shares at Rs 308 per share. Major institutional buyers included Goldman Sachs Bank Europe SE (15.7 lakh shares), Morgan Stanley Asia Singapore Pte (39 lakh shares), and Norges Bank (32.6 lakh shares). Other participants were HDFC Life Insurance (25 lakh shares), ICICI Prudential Life Insurance (10.5 lakh shares), SBI Mutual Fund (16.2 lakh shares), ITI Mutual Fund (22.7 lakh shares), and Plutus Wealth Management LLP (65 lakh shares). The transaction represented approximately 1.1% of Aditya Birla Capital's total equity. The deal price aligned with prevailing market levels, and shares ended marginally lower following the transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1761749982690,
            "Source": "order&deals"
        },
        {
            "Title": "Aditya Birla Capital Invests 3.82 Billion Rupees in Aditya Birla Sun Life Insurance",
            "Summary": "Aditya Birla Capital has made an investment of 3.82 billion rupees in Aditya Birla Sun Life Insurance. This represents a significant capital infusion into the insurance subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1761748166911,
            "Source": "stock"
        },
        {
            "Title": "Aditya Birla Capital Positioned for MSCI Index Entry Following Block Deal",
            "Summary": "Nuvama Alternative and Quantitative Research expects Aditya Birla Capital to become a strong candidate for MSCI index inclusion in the February 2026 review. This follows Jomei Investments' sale of its entire 2.04% stake at ₹308 per share through block deals worth ₹1,639 crore, which will increase the stock's free float and improve index eligibility. Nuvama's Abhilash Pagaria estimates potential inflows of around $230 million from MSCI inclusion and sees the stock as a tactical play with room to move towards ₹340. Aditya Birla Capital shares closed 0.6% higher at ₹312.45 and have gained nearly 75% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1761698892076,
            "Source": "stock"
        },
        {
            "Title": "Advent International Arm to Sell 2% Stake in Aditya Birla Capital Worth Rs 1,624 Crore",
            "Summary": "Jomei Investments Ltd., an Advent International affiliate, plans to sell 53.2 million shares (2% stake) in Aditya Birla Capital through a block deal at Rs 304.55 per share, valued at Rs 1,623.75 crore. IIFL Capital will serve as the broker. Jomei Investments held 3.84% stake in the company as of March 2025. This follows a previous sale in June where the Advent affiliate sold 3.6 crore shares (1.4% equity) at Rs 237.81 per share for Rs 856 crore. Advent originally invested Rs 1,000 crore in 2020 through a preferential issue, acquiring 10 crore shares at Rs 100 each. Based on the floor price, Advent is positioned to achieve a 138% return on its investment. Aditya Birla Capital recently raised over Rs 4,500 crore through private placement of non-convertible bonds. The stock reached a life high of Rs 307.8 and the company's market cap touched Rs 80,000 crore. The shares have gained 24% over the last 12 months and 72% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1761582948915,
            "Source": "order&deals"
        },
        {
            "Title": "Aditya Birla Capital Raises Rs 360 Crore Through Debentures and Allots Employee Stock Options",
            "Summary": "Aditya Birla Capital Limited completed two corporate actions on October 24, 2025. The company allotted 36,000 unsecured, rated, listed, taxable, redeemable non-convertible subordinate debentures worth Rs 360 crore through private placement to identified investors. Each debenture has a face value of Rs 1 lakh with an 8.03% annual coupon rate and a 10-year tenor, maturing on May 4, 2035. The debentures are listed on BSE and NSE. Additionally, the company's Stakeholders Relationship Committee approved the allotment of 93,351 equity shares under employee stock option schemes - 8,470 shares under ABCL Scheme 2017 and 84,881 shares under ABCL Scheme 2022. This increased the company's paid-up equity share capital from Rs 2,612.63 crore to Rs 2,612.72 crore, with the total number of equity shares rising to 2,61,27,22,888.",
            "Sentiment": "positive",
            "PublishDate": 1761319873508,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Capital Raises ₹750 Crore Through Debenture Issue",
            "Summary": "Aditya Birla Capital Limited has issued 75,000 secured redeemable non-convertible debentures worth ₹750 crore. The debentures carry an annual coupon rate of 7.2959% and are set to mature on September 15, 2028. This debt instrument provides the company with long-term funding while offering investors a fixed return over the four-year tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1760599852182,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Capital Shareholders Approve Appointment of New Managing Director and NBFC CEO",
            "Summary": "Aditya Birla Capital shareholders approved two key leadership appointments through postal ballot voting. Ms. Vishakha Mulye was appointed as Managing Director and Chief Executive Officer, while Mr. Rakesh Singh was appointed as Executive Director and Chief Executive Officer (NBFC). Both resolutions were ordinary resolutions that received strong shareholder support. The e-voting process ran from September 16 to October 15, 2025, with 84.7% of outstanding shares participating in the voting. For Mulye's appointment, 96.3% of votes cast were in favor, while Singh's appointment received 99.1% approval from voting shareholders. The promoter group, holding approximately 179.5 crore shares, voted entirely in favor of both appointments. The resolutions were deemed passed on October 15, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760543091264,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aditya Birla Capital Accelerates AI-First Strategy with Enterprise-wide Innovations",
            "Summary": "Aditya Birla Capital is accelerating its AI-first strategy through enterprise-wide innovations. The company is implementing artificial intelligence initiatives across its operations.",
            "Sentiment": "positive",
            "PublishDate": 1759921457782,
            "Source": "stock"
        },
        {
            "Title": "Aditya Birla Capital Raises Rs. 1,095 Crores Through Non-Convertible Debentures",
            "Summary": "Aditya Birla Capital Limited allotted Non-Convertible Debentures worth Rs. 1,095 crores through private placement to multiple investors on September 24, 2025. The allotment comprises four series of secured, redeemable, rated, and listed debentures. The first series raised Rs. 300 crores with 30,000 debentures at 6.92% coupon rate, maturing March 24, 2028. The second and third series each raised Rs. 250 crores with 25,000 debentures at 7.3789% and 7.2959% coupon rates respectively, maturing February 14, 2028 and September 15, 2028. The fourth series raised Rs. 295 crores with 29,500 debentures at 7.52% coupon rate, maturing September 24, 2030. All debentures have a face value of Rs. 1 lakh each and are secured by hypothecation of receivables, securities, and current assets. The debentures are listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "positive",
            "PublishDate": 1758729993690,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Capital Seeks Shareholder Approval for New Leadership Appointments",
            "Summary": "Aditya Birla Capital has issued a postal ballot notice seeking shareholder approval for two key appointments. The company proposes to appoint Ms. Vishakha Mulye as Managing Director and CEO for a five-year term from September 1, 2025 to August 31, 2030, with a basic salary of ₹4.07 crore per annum and special allowance of ₹3.15 crore per annum, subject to performance bonuses up to ₹10 crore annually. Additionally, Mr. Rakesh Singh is proposed as Executive Director and CEO (NBFC) from September 1, 2025 to July 22, 2027, with a basic salary of ₹2.38 crore per annum and special allowance of ₹1.18 crore per annum, with performance bonuses up to ₹7 crore annually. Both appointments have received Reserve Bank of India approval. Remote e-voting will be conducted from September 16 to October 15, 2025, with results to be announced by October 17, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1757940610785,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aditya Birla Capital Allots ₹3,400 Crore Secured NCDs Through Private Placement",
            "Summary": "Aditya Birla Capital has allotted ₹3,400 crore worth of partly paid secured non-convertible debentures through private placement. The NCDs represent a debt fundraising initiative by the financial services company.",
            "Sentiment": "neutral",
            "PublishDate": 1757682257800,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Capital Allots ₹100 Crore Secured Listed NCDs Through Private Placement",
            "Summary": "Aditya Birla Capital has allotted ₹100 crore worth of secured listed Non-Convertible Debentures (NCDs) on a private placement basis. The NCDs are secured instruments that will be listed for trading.",
            "Sentiment": "neutral",
            "PublishDate": 1756815673536,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Capital Appoints Vishakha Mulye As MD & CEO For Five Years",
            "Summary": "Aditya Birla Capital's board approved the appointment of Vishakha Mulye as managing director and CEO for five years, effective from September 1, 2025 to August 31, 2030, subject to shareholder approval. The company also appointed Rakesh Singh as MD and CEO of its non-banking financial company segment from September 1 to July 22, 2027. Mulye, who joined as director in 2022, developed the 'One ABC, One P&L' strategy and led the company's expansion across loans, investments, insurance, and payments while raising Rs 4,500 crore in growth capital. She previously held leadership positions at ICICI Group. Singh brings 16 years of experience from Standard Chartered Bank, including roles as head of mortgages business in India and head of SME Banking for India and South Asia. Aditya Birla Capital shares closed 0.68% higher at Rs 280 on BSE.",
            "Sentiment": "positive",
            "PublishDate": 1756740945767,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aditya Birla Capital Invests ₹250 Crore in Housing Finance Subsidiary",
            "Summary": "Aditya Birla Capital has invested ₹250 crore in Aditya Birla Housing Finance. Following this investment, Aditya Birla Housing Finance continues to operate as a 100% subsidiary of Aditya Birla Capital.",
            "Sentiment": "positive",
            "PublishDate": 1756630376732,
            "Source": "stock"
        },
        {
            "Title": "Aditya Birla Capital Subsidiary Receives RBI In-Principle Approval for Payment Aggregator License",
            "Summary": "Aditya Birla Capital Digital Limited, a subsidiary of Aditya Birla Capital, has received in-principle authorization from the Reserve Bank of India to operate as an online payment aggregator under the Payment and Settlement Systems Act, 2007. The RBI approval was granted via letter dated August 20, 2025, and received by the company on August 26, 2025. This authorization allows the company to strengthen its presence in India's digital payments ecosystem and provide payment aggregation services to merchants and consumers. The move is viewed as a significant milestone in Aditya Birla Capital's digital expansion and is expected to enhance its competitive positioning in the financial services sector. Aditya Birla Capital shares closed 1.6% lower at Rs 280.65 on the BSE on Tuesday.",
            "Sentiment": "positive",
            "PublishDate": 1756349827898,
            "Source": "stock"
        }
    ]
}