{
    "Symbol": "ABCOTS",
    "ISIN": "INE08PH01015",
    "News": [
        {
            "Title": "AB Cotspin seeks postal ballot approval for RPT",
            "Summary": "AB Cotspin India Limited announces postal ballot for member approval of material related party transactions worth Rs. 85.00 crore with AB Cotton Textiles Private Limited. E-voting opens January 31, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769779231339,
            "Source": "co_actions_results"
        },
        {
            "Title": "ABCotspin India Secures Rs 13.75 Crore Cotton Yarn Order with 2-Month Delivery Timeline",
            "Summary": "ABCotspin India Limited, a textile manufacturer with over 25 years of industry expertise, announced receiving an order worth approximately Rs 13.75 crore for supply of cotton yarn to be executed within 2 months. The company expects to achieve turnover of around Rs 350 crores and EBITDA of Rs 40-45 crores for FY2025-26, with its equity shares trading on NSE and BSE main boards since September 24, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763469417499,
            "Source": "order&deals"
        },
        {
            "Title": "ABCotspin India Reports 97.37% PAT Growth in H1FY26 Results",
            "Summary": "ABCotspin India Limited, a textile manufacturer with over 25 years of industry expertise, announced its H1FY26 results showing significant financial improvements. Revenue reached ₹117.49 crores, down 24.06% compared to H1FY25. However, EBITDA surged 44.77% to ₹21.30 crores with margins expanding by 862 basis points to 18.13%. Net profit grew 97.37% to ₹7.82 crores, while diluted EPS increased by 2853%. The company has expanded into real estate with a premium residential-commercial project in Ludhiana, Punjab, involving approximately 3 acres of land for ₹18 crores. ABCotspin announced a major capacity expansion up to ₹1500 crores, adding approximately 2,00,000 spindles for an integrated green textile manufacturing facility. The company successfully installed an additional 14,592 spindles, bringing total capacity to 50,832 spindles, and expanded solar power capacity from 2,500 KW to 3,131 KW. The company's shares began trading on the main boards of NSE and BSE from September 24, 2025. Management expects turnover of around ₹350 crores and EBITDA of ₹40-45 crores for FY2025-26.",
            "Sentiment": "positive",
            "PublishDate": 1763014954501,
            "Source": "earnings"
        },
        {
            "Title": "ABCotspin India Reports Quarterly Results and Faces BSE Fine for Annual Report Delay",
            "Summary": "ABCotspin India Limited's Board approved unaudited financial results for the quarter and half year ended September 30, 2025. The company received a fine of INR 1,22,720 from BSE Limited for alleged non-compliance with listing regulations regarding non-submission of the Annual Report for the financial year ended March 31, 2025 within the prescribed timeframe. The company has submitted a reply to BSE requesting reconsideration and waiver of the fine, stating that their equity shares were not yet listed on BSE's Main Board Platform when the Annual Report was submitted to NSE, and BSE Listing Centre access was only made available on September 29, 2025. The financial results show consolidated total assets of INR 30,406.79 lakhs as of September 30, 2025, compared to INR 28,838.99 lakhs as of March 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762951241790,
            "Source": "earnings"
        },
        {
            "Title": "A B Cotspin India Secures ₹5.45 Crore Order for 200 MT Cotton Yarn",
            "Summary": "A B Cotspin India Limited announced receiving an order worth approximately ₹5.45 crore for 200 MT of cotton yarn to be executed within one month. The order comes from two domestic entities - M/s Das Fabrics Ludhiana (100 MT) and M/s C Mohan International Ludhiana (100 MT). The company, a textile manufacturer with over 25 years of industry expertise, expects to achieve turnover of around ₹350 crores and EBITDA of ₹50-55 crores for FY 2025-26. A B Cotspin's equity shares have been trading on the main boards of both NSE and BSE since September 24, 2025. The order reinforces the company's position as a supplier of cotton yarn, knitted fabrics, and eco-friendly products.",
            "Sentiment": "positive",
            "PublishDate": 1760936543776,
            "Source": "order&deals"
        },
        {
            "Title": "AB COTSPIN Projects Strong Financial Growth for FY 2025-26",
            "Summary": "AB COTSPIN's Managing Director has announced projections for the company's financial performance in fiscal year 2025-26. The company expects to achieve a turnover between ₹350 crore and ₹400 crore, an EBITDA of ₹50-55 crore, and a Profit After Tax (PAT) of ₹30-35 crore.",
            "Sentiment": "positive",
            "PublishDate": 1743059122000,
            "Source": "earnings"
        },
        {
            "Title": "AB COTSPIN Secures Major Cotton Yarn Order",
            "Summary": "AB COTSPIN has received a significant order for 500 metric tons of cotton yarn, valued at approximately Rs 14 crore. The company, with a market capitalization of Rs 476 crore, is listed in the SME segment.",
            "Sentiment": "positive",
            "PublishDate": 1743059078000,
            "Source": "order&deals"
        },
        {
            "Title": "AB COTSPIN INDIA Secures Major Cotton Yarn Order",
            "Summary": "AB COTSPIN INDIA has received a significant order for cotton yarn, amounting to 300 MT and valued at Rs. 7.50 crore. This development marks a new milestone for the company, which currently has a market capitalization of Rs. 458 crore.",
            "Sentiment": "positive",
            "PublishDate": 1735793663000,
            "Source": "order&deals"
        }
    ]
}