{
    "Symbol": "ABDL",
    "ISIN": "INE552Z01027",
    "News": [
        {
            "Title": "ABD Maestro Launches Ultra-Premium Single Malt",
            "Summary": "Allied Blenders introduces 'The Collective,' a 34-year-old single malt priced at ₹11 lakhs per bottle, with only 60 units available. The whisky was distilled at Scotland's Macallan Distillery in 1991.",
            "Sentiment": "positive",
            "PublishDate": 1770264484799,
            "Source": "stocks"
        },
        {
            "Title": "ABDL schedules investor conferences for Feb 9-10",
            "Summary": "Allied Blenders and Distillers announces two investor conferences in Mumbai on February 9-10, 2026, to discuss Q3FY26 results with institutional investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1770119634827,
            "Source": "stocks"
        },
        {
            "Title": "Allied Blenders Gets Partial Relief in Tax Appeals",
            "Summary": "Allied Blenders and Distillers receives partial relief from Commissioner of Income Tax (Appeals) in pending appeals for assessment years 2014-15 to 2024-25, with orders dated January 30, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769884199784,
            "Source": "stocks"
        },
        {
            "Title": "Allied Blenders Approves ₹62 Crores Investment",
            "Summary": "Allied Blenders and Distillers board approves ₹62 crores additional investment in subsidiary MAILLP for bottling facility and land procurement, plus ₹225 crores guarantee support.",
            "Sentiment": "positive",
            "PublishDate": 1769700083025,
            "Source": "co_actions_results"
        },
        {
            "Title": "Allied Blenders CFO Leadership Transition Announced",
            "Summary": "Allied Blenders and Distillers announces strategic CFO transition with Jayant Manmadkar moving to Group Finance Director role and Ramakrishnan Ramaswamy returning as CFO effective February 02, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769698747217,
            "Source": "stocks"
        },
        {
            "Title": "Allied Blenders Q3FY26 Net Profit Jumps 33.9% YoY",
            "Summary": "Allied Blenders & Distillers reports Q3FY26 standalone net profit of ₹7,817.14 lakhs, up 33.9% YoY, despite revenue decline of 18.6% to ₹1,90,628.41 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1769695402274,
            "Source": "co_actions_results"
        },
        {
            "Title": "Allied Blenders Grants 3.2M Stock Options to Employees",
            "Summary": "Allied Blenders & Distillers' NRC approved grant of 3,200,000 stock options under Employee Stock Option Scheme at ₹445.50 per option with 4-year vesting schedule starting January 23, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769167283695,
            "Source": "co_actions_results"
        },
        {
            "Title": "Allied Blenders Board Meet Set for Jan 29 Q3 Results",
            "Summary": "Allied Blenders & Distillers has scheduled a board meeting on January 29, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769083845874,
            "Source": "co_actions_results"
        },
        {
            "Title": "Allied Blenders Acquires UP Distillery Assets",
            "Summary": "Allied Blenders and Distillers has acquired distillery assets in Uttar Pradesh for up to ₹1.10 billion, expanding its manufacturing footprint in the alcoholic beverages sector.",
            "Sentiment": "positive",
            "PublishDate": 1768553059222,
            "Source": "co_actions_results"
        },
        {
            "Title": "Allied Blenders Appoints Scotch Whisky Expert Martin Leonard",
            "Summary": "Allied Blenders and Distillers appoints Dr. Martin Leonard, former MD of Inver House Distillers, as consultant for single malt whisky initiative. ₹75 crore distillery expected operational by Q4 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1767852799348,
            "Source": "stocks"
        },
        {
            "Title": "Allied Blenders Launches Aodh Irish Whiskey at ₹3,950",
            "Summary": "ABD Maestro, subsidiary of Allied Blenders & Distillers, launches AODH Irish Whiskey at ₹3,950 in India's fastest growing premium segment with Ranveer Singh as creative partner.",
            "Sentiment": "positive",
            "PublishDate": 1766997828995,
            "Source": "stocks"
        },
        {
            "Title": "Allied Blenders Launches Yello Designer Whisky in Maharashtra at ₹2,700",
            "Summary": "Allied Blenders And Distillers introduced Yello Designer Whisky, a blend of Scotch and Indian malts, targeting modern Indian consumers with distinctive packaging and flavor profile. The premium whisky launched in Maharashtra at ₹2,700 for 750ML, marking the company's entry into the designer whisky segment.",
            "Sentiment": "positive",
            "PublishDate": 1764561715911,
            "Source": "stock"
        },
        {
            "Title": "Allied Blenders And Distillers Expands ABD Maestro Presence at Mumbai Duty Free",
            "Summary": "Allied Blenders And Distillers has partnered with Ospree Duty Free in Mumbai to expand ABD Maestro's reach in the duty-free retail segment. The partnership will offer high-end spirits including Arhaus Whisky and Russian Standard Vodka to travelers at the Mumbai location.",
            "Sentiment": "positive",
            "PublishDate": 1764302563681,
            "Source": "stock"
        },
        {
            "Title": "Supreme Court Directs Allied Blenders and John Distilleries to Mediation in Trademark Dispute",
            "Summary": "The Supreme Court has directed Allied Blenders and Distillers Limited and John Distilleries Private Limited to resolve their trademark dispute over 'Officers Choice' and 'Original Choice' brands through mediation by former Justice L. Nageswara Rao. The case stems from cross petitions seeking cancellation of each other's trademarks, with the Madras High Court previously ruling in favor of Allied Blenders, and the matter is scheduled for review on December 8, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763529268367,
            "Source": "stock"
        },
        {
            "Title": "Allied Blenders Eyes Strong H2 Performance With Premium Portfolio Expansion",
            "Summary": "Allied Blenders and Distillers plans to launch three new luxury brands in H2 and expects 10% volume growth with mid-double digit value growth, driven by premiumisation strategy. The company, which reported 32.2% net profit increase in September quarter, is expanding to 35 countries by fiscal end and building India's first single malt distillery expected to produce by 2029.",
            "Sentiment": "positive",
            "PublishDate": 1763310401136,
            "Source": "stock"
        },
        {
            "Title": "Allied Blenders Expands IconiQ Winter Whisky to UP and Haryana, Achieves No. 2 Position in UP",
            "Summary": "Allied Blenders And Distillers has expanded its IconiQ Winter Whisky brand to Uttar Pradesh and Haryana. The brand achieved the No. 2 position in Uttar Pradesh with over 1 million cases sold in the first five months. The whisky is priced at ₹620 for 750 ML in Uttar Pradesh and ₹570 in Haryana.",
            "Sentiment": "positive",
            "PublishDate": 1763013441655,
            "Source": "stock"
        },
        {
            "Title": "Allied Blenders Reports 14.4% Revenue Growth in Q2 FY26 with Strong Premium Portfolio Performance",
            "Summary": "Allied Blenders and Distillers reported consolidated revenue of Rs. 995 crores in Q2 FY26, marking a 14.4% increase from the previous year. EBITDA grew 23.6% to Rs. 130 crores with improved margins of 13.1%, while PAT increased 32.3% to Rs. 63 crores. The company sold 9 million cases, up 8.4% year-on-year, with a 3.8% rise in realization per case. The Prestige & Above category maintained strong momentum with 28.8% year-on-year volume growth, improving its contribution to 47.1% from 39.7% in Q2 FY25. ICONIQ White continued as a standout performer, doubling its volume organically versus Q2 FY25 and expanding to eight international markets. The Mass Premium category witnessed a 5% decline due to regulatory intervention in southern states and pipeline impact in Telangana, though the company expects normalization in Q3 FY26. Allied Blenders successfully commissioned its PET bottle manufacturing facility in September 2025 with a Rs. 115 crore investment, expected to add Rs. 30 crores to gross margins. The company expanded its international presence from 14 to 30 countries within 18 months and received Rs. 100 crores in overdue payments from Telangana in October 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762885060456,
            "Source": "earnings"
        },
        {
            "Title": "Allied Blenders Launches RANGEELA Vodka with Ranveer Singh as Co-Founder",
            "Summary": "Allied Blenders and Distillers Limited announced the launch of RANGEELA Contemporary Indian Vodka through its subsidiary ABD Maestro Private Limited. Ranveer Singh serves as Co-Founder and Creative Partner for the brand. The vodka is triple distilled and platinum chill-filtered, targeting India's growing premium vodka market driven by young adults and cocktail culture. RANGEELA has launched in Maharashtra at Rs. 2,400 for 750ML, with plans to expand to Goa, West Bengal and North India markets. The brand positions itself as bold, expressive and celebrates Indian cultural flair with vibrant packaging and innovative marketing communication.",
            "Sentiment": "positive",
            "PublishDate": 1762832704217,
            "Source": "stock"
        },
        {
            "Title": "Allied Blenders and Distillers Shareholders Approve Revised Remuneration for Managing Director and Executive Director",
            "Summary": "Allied Blenders and Distillers Limited announced that shareholders have approved special resolutions for revised remuneration packages for two key executives through postal ballot voting. The remote e-voting process concluded on November 9, 2025, with members approving increased compensation for Managing Director Alok Gupta (DIN: 02330045) and Executive Director Arun Barik (DIN: 07130542). For the first resolution regarding Alok Gupta's remuneration, 97.26% of votes were cast in favor with 2.74% against, with an overall voting participation of 87.80% of outstanding shares. The second resolution for Arun Barik's remuneration received 97.00% votes in favor and 3.00% against, also with 87.80% participation. The voting was conducted entirely through electronic means, with promoter and promoter group shareholders showing 100% support for both resolutions, while public institutional and non-institutional shareholders also voted predominantly in favor.",
            "Sentiment": "positive",
            "PublishDate": 1762778933377,
            "Source": "corporate_governance"
        },
        {
            "Title": "Madras High Court Rules in Favor of Allied Blenders in Officer's Choice Trademark Dispute",
            "Summary": "The Madras High Court ruled in favor of Allied Blenders and Distillers Ltd in a trademark dispute with John Distilleries. The court dismissed John Distilleries' petition to cancel ABD's 'Officer's Choice' trademark and allowed ABD's petition to cancel John Distilleries' 'Original Choice' mark. This decision concludes a long-running legal battle between the two liquor companies over alleged similarities in branding and trade dress. ABD shares closed marginally lower at ₹640 on the NSE. The company reported a 35.4% year-on-year rise in net profit to ₹64.3 crore for Q2FY26, with revenue growing 14% to ₹990 crore. The company's premium portfolio showed strong performance with volumes in its Prestige & Above segment rising 8.4% year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1762589768299,
            "Source": "stock"
        },
        {
            "Title": "Allied Blenders & Distillers Targets Double-Digit Sales Growth Through Premiumization Strategy",
            "Summary": "Allied Blenders & Distillers has outlined its growth strategy focused on premiumization and portfolio expansion. The company is launching new brands in semi-premium and craft segments while expanding distribution in South and East India. The company aims to improve margins through product mix shifts and cost optimization. Allied Blenders targets achieving double-digit growth in sales volume over FY26-FY27.",
            "Sentiment": "positive",
            "PublishDate": 1762529721312,
            "Source": "stock"
        },
        {
            "Title": "Allied Blenders & Distillers Outlines Growth Strategy with Increased Marketing Spend and International Expansion",
            "Summary": "Allied Blenders & Distillers announced plans to increase its Advertising & Sales Promotion (ANSP) investment by 75-100 basis points year-on-year for the next 2-3 years. The company aims to reach 50% Prestige & Above (P&A) segment salience by FY28, though may revise this target as they are already at 47%. For international expansion, the company targets reaching 35 countries by Q4 FY26 and achieving 1 million cases in Africa by FY28.",
            "Sentiment": "positive",
            "PublishDate": 1762486890113,
            "Source": "stock"
        },
        {
            "Title": "Allied Blenders Shares Fall 2.5% Despite Strong Q2 Financial Performance",
            "Summary": "Allied Blenders and Distillers Ltd shares declined 2.52% to ₹655.10 on the National Stock Exchange despite reporting strong quarterly results. The company posted a 32.3% year-on-year increase in profit-after-tax to ₹63 crore, with income from operations rising 14.4% to ₹995 crore and EBITDA growing 23.6% to ₹130 crore. EBITDA margin expanded to 13.1%, marking the fifth consecutive quarter of strong performance since listing. The Prestige & Above segment strengthened with volume salience rising to 47.1%. The company commissioned a ₹115-crore PET bottle manufacturing unit in Telangana as part of a ₹525-crore backward integration programme aimed at improving gross margins by 300 basis points by FY28. Managing Director Alok Gupta expressed confidence in maintaining profitable growth momentum through the second half of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1762414606762,
            "Source": "earnings"
        },
        {
            "Title": "Allied Blenders and Distillers Approves Merger of Two Wholly-Owned Subsidiaries",
            "Summary": "Allied Blenders and Distillers Limited's Board of Directors approved a scheme of amalgamation to merge two wholly-owned subsidiaries - Deccan Star Distilleries India Private Limited and Sarthak Blenders Bottlers Private Limited - into the parent company. The appointed date for the scheme is April 1, 2025. All assets and liabilities of the subsidiaries will be transferred at their carrying values. No equity shares will be allotted as consideration since both companies are wholly-owned subsidiaries. The merger aims to reduce the number of entities, simplify group structure, reduce legal and regulatory compliances, and eliminate administrative duplications. Allied Blenders manufactures, purchases and sells alcoholic beverages, while one subsidiary is non-operating and the other handles bottling operations. The transaction is exempt from stock exchange no-objection requirements and will not change the shareholding pattern of the listed entity.",
            "Sentiment": "positive",
            "PublishDate": 1762275830204,
            "Source": "corporate_action"
        },
        {
            "Title": "Allied Blenders Reports 32% Jump in Q2 Profit Driven by Premium Portfolio Growth",
            "Summary": "Allied Blenders and Distillers Limited reported strong quarterly results with profit after tax rising 32.3% to ₹63 crore compared to the same period last year. Income from operations increased 14.4% to ₹995 crore, while EBITDA grew 23.6% to ₹130 crore with margins expanding to 13.1%. The company delivered 9.0 million cases, up 8.4% year-on-year, driven by accelerated premiumization with its Prestige Above segment reaching 47.1% volume salience. The company commissioned a ₹115 crore PET bottle manufacturing unit in September with 600 million bottles annual capacity as part of its ₹525 crore backward integration program aimed at improving gross margins by 300 basis points by FY28. ABD expanded its international presence to 30 countries and received multiple awards including recognition for WOODBURNS Contemporary Indian Malt Whisky winning Grand Gold at the 2025 Spirits Selection by Concours Mondial de Bruxelles.",
            "Sentiment": "positive",
            "PublishDate": 1762275331727,
            "Source": "earnings"
        },
        {
            "Title": "Allied Blenders & Distillers Plans Premium Brand Growth and Margin Expansion",
            "Summary": "Allied Blenders & Distillers is focusing on premiumization-led growth through its brands including Sterling Reserve, Iconiq White, and Officer's Choice. The company is expanding both exports and domestic distribution while targeting EBITDA margin improvement through cost efficiency measures and shifting its product mix toward premium IMFL (Indian Made Foreign Liquor) offerings.",
            "Sentiment": "positive",
            "PublishDate": 1762270487054,
            "Source": "stock"
        },
        {
            "Title": "Allied Blenders and Distillers Reports Mixed Q2 Results with Profit Growth Despite Revenue Decline",
            "Summary": "Allied Blenders and Distillers reported Q2 net profit of 718 million rupees, up from 484.4 million rupees in the same period last year. However, revenue declined to 19.44 billion rupees from 20.29 billion rupees year-over-year. EBITDA increased to 1.32 billion rupees from 1.04 billion rupees, while EBITDA margin improved to 6.8% from 5.11% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762265452662,
            "Source": "earnings"
        },
        {
            "Title": "Allied Blenders and Distillers Schedules Q2FY26 Earnings Conference Call",
            "Summary": "Allied Blenders and Distillers Limited has announced a conference call to discuss its Q2FY26 earnings results scheduled for Thursday, November 6, 2025, at 4:00 PM IST. The call will be attended by key management including Executive Deputy Chairman Shekhar Ramamurthy, Managing Director Alok Gupta, CFO Jayant Manmadkar, and Head of Investor Relations J. Mukund. The session is targeted at analysts, institutional and other investors, with participants able to pre-register through provided dial-in details. The company noted that no unpublished price sensitive information will be shared during the call.",
            "Sentiment": "neutral",
            "PublishDate": 1761858725462,
            "Source": "earnings"
        },
        {
            "Title": "Allied Blenders and Distillers Named Company of the Year at Spiritz Conclave Awards 2025",
            "Summary": "Allied Blenders and Distillers Limited (ABD), India's third largest spirits company, won Company of the Year - Domestic at the Spiritz Conclave Achievers Awards 2025. The company's subsidiary ABD Maestro secured multiple Grand Gold medals for ARTHAUS Blended Malt Scotch Whisky, WOODBURNS Contemporary Indian Malt Whisky, and PUMORI Small Batch Gin. ABD Maestro also received Gold medals for SEGREDO ALDEIA Cafe Rum, RUSSIAN STANDARD Vodka variants, and ZOYA Special batch Gin. ABD's flagship brand ICONiQ WHITE Whisky won Fastest Growing Brand of the Year and Best Promotion Activation awards. Managing Director Alok Gupta highlighted the company's focus on innovation and understanding of Indian consumer tastes. The awards recognize ABD's leadership in driving innovation and premiumisation across India's alcohol beverage landscape.",
            "Sentiment": "positive",
            "PublishDate": 1761850394751,
            "Source": "stock"
        },
        {
            "Title": "Allied Blenders Seeks Shareholder Approval for Executive Remuneration Revisions",
            "Summary": "Allied Blenders and Distillers Limited has issued a postal ballot notice seeking shareholder approval for remuneration revisions for its key executives. The company proposes additional reward payment of ₹26.16 lakh to Managing Director Alok Gupta for Financial Year 2024-25, along with increasing his annual remuneration from ₹11.50 crores to ₹12.54 crores effective September 1, 2025. For Executive Director Arun Barik, the company seeks approval for additional reward of ₹6.22 lakh for FY 2024-25 and revision of his remuneration from ₹2.73 crores to ₹3.50 crores for FY 2025-26. The proposals are based on the company's record financial performance, with highest-ever annual EBITDA of ₹451 crores and PAT of ₹195 crores in FY 2025. E-voting is scheduled from October 11, 2025 to November 9, 2025, with results to be declared by November 11, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760101584981,
            "Source": "corporate_action"
        },
        {
            "Title": "Allied Blenders & Distillers Appoints Jayant Manmadkar as Chief Financial Officer",
            "Summary": "Allied Blenders and Distillers Limited appointed Mr. Jayant Bhalchandra Manmadkar as Chief Financial Officer, Key Managerial Personnel, and Senior Management Personnel effective October 10, 2025. Manmadkar is a qualified Chartered Accountant, Cost and Works Accountant, and Company Secretary with a Master's degree in Commerce and over 32 years of experience across financial services, pharmaceuticals, alcobev, manufacturing, real estate, and retail sectors. He has previously worked with organizations including Seagram India, Brigade Enterprises, Mahindra Lifespace Developers, Sai Life Sciences, Wockhardt, and Reliance Retail. His expertise spans strategic planning, mergers and acquisitions, international operations, treasury, corporate finance, taxation, and investor relations. Managing Director Alok Gupta stated that Manmadkar's cross-sectoral experience and financial management foundation will strengthen the company's financial strategy and support growth initiatives. ABD is India's largest domestic spirits company by volume with brands including Officer's Choice Whisky and Sterling Reserve Premium Whiskies.",
            "Sentiment": "positive",
            "PublishDate": 1760092021988,
            "Source": "corporate_governance"
        },
        {
            "Title": "Allied Blenders and Distillers Wins Gold at Global LACP Vision Awards for Annual Report",
            "Summary": "Allied Blenders and Distillers won Gold at the Global LACP Vision Awards for its annual report. The company was recognized among the top 5 Indian reports and received the Technical Achievement Award for excellence in corporate communications.",
            "Sentiment": "positive",
            "PublishDate": 1759901561804,
            "Source": "stock"
        },
        {
            "Title": "Allied Blenders And Distillers Wins Multiple Awards at International Spirits Competition",
            "Summary": "Allied Blenders And Distillers received several awards at the Spirits Selection by Concours Mondial de Bruxelles 2025. Woodburns Indian Whisky achieved Grand Gold and the Revelation Blended Whisky Award, Pumori Small Batch Gin received Gold, and Arthouse Blended Malt Scotch Whisky earned Silver.",
            "Sentiment": "positive",
            "PublishDate": 1759463994215,
            "Source": "stock"
        },
        {
            "Title": "Allied Blenders & Distillers Opens ₹115 Crore PET Bottling Facility in Telangana",
            "Summary": "Allied Blenders & Distillers has opened a new PET bottling facility in Telangana with an investment of ₹115 crore. The company expects this facility to contribute to an increase in gross margins by approximately 300 basis points by FY28.",
            "Sentiment": "positive",
            "PublishDate": 1759232435479,
            "Source": "stock"
        },
        {
            "Title": "Allied Blenders and Distillers Appoints New CFO Jayantt Manmadkar, Anil Somani to Step Down",
            "Summary": "Allied Blenders and Distillers Limited announced a leadership change in its finance department. Jayantt Bhalchandra Manmadkar will join as Chief Financial Officer effective October 10, 2025, replacing Anil Somani who will step down on October 9, 2025. The board approved this change based on recommendations from the Nomination and Remuneration Committee and Audit Committee. Manmadkar brings over 32 years of experience in finance, strategy, and leadership across sectors including financial services, pharmaceuticals, manufacturing, real estate, and retail. He holds qualifications as a Chartered Accountant, Cost and Works Accountant, and Company Secretary, with previous roles at organizations including Seagram India, Brigade Enterprises, Mahindra Lifespace Developers, and Reliance Retail. Somani will continue serving the company on special projects. Additionally, the company announced a postal ballot for shareholder approval on revised remuneration for Managing Director Alok Gupta and Executive Director Arun Barik.",
            "Sentiment": "neutral",
            "PublishDate": 1758894796164,
            "Source": "corporate_governance"
        },
        {
            "Title": "ABD Maestro Launches Premium Spirits Portfolio at Bengaluru Airport Duty-Free",
            "Summary": "ABD Maestro Private Limited, a subsidiary of Allied Blenders and Distillers Limited, launched its premium spirits portfolio at Kempegowda International Airport Bengaluru's duty-free retail. The company plans nationwide expansion to Delhi and Mumbai airports within a month, followed by global travel retail expansion. The portfolio includes ARTHAUS Blended Malt Scotch Whisky, WOODBURNS Contemporary Indian Malt Whisky, PUMORI Small Batch Gin, ZOYA Special Batch Gin, and RUSSIAN STANDARD Vodka through exclusive distribution partnership. Managing Director Bikram Basu described this as a defining moment for ABD Maestro, targeting international travelers in key global markets. The expansion aims to serve growing demand for premium alcohol beverages among millions of travelers passing through Indian airports annually.",
            "Sentiment": "positive",
            "PublishDate": 1758203587029,
            "Source": "stock"
        },
        {
            "Title": "Allied Blenders Gets Relief from ₹14.98 Crore Tax Demand Following Appellate Order",
            "Summary": "Allied Blenders received a favorable appellate order from the Deputy Commissioner of State Tax, Thane, which extinguished a ₹14.98 crore CST tax demand covering FY21 to FY24. The appellate decision eliminates the company's liability for this tax demand.",
            "Sentiment": "positive",
            "PublishDate": 1758193271403,
            "Source": "stock"
        },
        {
            "Title": "Allied Blenders Supreme Court Case Disposed, Trial Court Given Six-Month Timeline",
            "Summary": "Allied Blenders and Distillers Limited received a Supreme Court order disposing of Special Leave Petitions filed by the company and others. The Supreme Court directed the trial court to conclude the suit and counter-claim within six months from the next hearing date. The court clarified that the High Court's interim order observations will not influence the trial court's decision, which must be based on evidence and merits. The case involves Herman Jansen Beverages Nederland B.V and others versus Tilaknagar Industries Ltd. Applications for rectification by both parties will be considered separately on their own merits.",
            "Sentiment": "neutral",
            "PublishDate": 1758106700488,
            "Source": "stock"
        },
        {
            "Title": "Allied Blenders Reports 82% EBITDA Growth, Targets Mid-Teen Revenue Growth by FY28",
            "Summary": "Allied Blenders and Distillers held an investor presentation outlining its performance and strategic plans. The spirits company reported income from operations of ₹3,541 crore with 6.2% growth, while EBITDA surged 81.7% to ₹451 crore with margins expanding to 12.7%. PAT increased significantly to ₹195 crore from ₹2 crore previously. The company improved its financial position with net debt-to-equity ratio declining to 0.5x from 1.8x. Allied Blenders operates across mass premium to luxury segments with flagship brands including Officer's Choice whisky and Sterling Reserve. The company has distribution reach of 80,000+ retail touchpoints across 30+ states and exports to 27 countries. For FY28, the company targets mid-teen revenue growth, gross margins exceeding 45%, EBITDA margins reaching 17%, and ROCE of 23-25%. The company plans ₹450 crore capex over the next 2-3 years for capacity expansion including ENA distillation, PET bottle manufacturing, and single malt distillery development. Key growth strategies include premiumization of portfolio, export expansion to 35 countries, and backward integration initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1756119762974,
            "Source": "stock"
        },
        {
            "Title": "Allied Blenders Abandons Good Barrel Distillery Acquisition Due to Failed Negotiations",
            "Summary": "Allied Blenders and Distillers Limited has decided not to proceed with the acquisition of up to 51% stake in Good Barrel Distillery Private Limited. The company's Board of Directors had previously approved the acquisition in January 2025, which included an option to acquire the entire paid-up share capital. During the due diligence process, certain commercial considerations emerged that required renegotiation of specific terms. Despite best efforts, both parties could not reach mutually acceptable terms, leading to the withdrawal of the proposed transaction. The company stated that the withdrawal has no material or financial impact as the transaction was at a preliminary stage. Allied Blenders indicated it will continue to explore both organic and inorganic growth opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1755184902657,
            "Source": "order&deals"
        },
        {
            "Title": "Allied Blenders and Distillers to Participate in DAM Capital's Alcoholic Beverages Sector Conference",
            "Summary": "Allied Blenders and Distillers Limited will participate in DAM Capital's Alcoholic Beverages Sector Conference scheduled for August 20, 2025, at 10:00 a.m. IST in Mumbai. The company will present its Q1FY26 Earnings Presentation during the physical conference. The presentation was previously submitted to stock exchanges on July 26, 2025, and is available on the company's website. The company has confirmed that no unpublished price sensitive information will be shared during the conference. The event will include analysts and investors in both one-on-one and group formats.",
            "Sentiment": "neutral",
            "PublishDate": 1755166530702,
            "Source": "stock"
        },
        {
            "Title": "Allied Blenders Reports Strong Q1 FY26 Results with 22.5% Revenue Growth and 5x Jump in Profit",
            "Summary": "Allied Blenders and Distillers delivered consolidated income of Rs. 930 crores in Q1 FY26, marking a 22.5% increase year-on-year. EBITDA grew 56.4% to Rs. 119 crores with margins expanding to 12.8% from 10% in the previous year. Profit after tax surged five times to Rs. 56 crores compared to Rs. 11 crores in Q1 FY25. The company delivered 8.5 million cases, up 17.2% year-on-year, with a 6.2% increase in realization per case. The Premium & Above (P&A) portfolio showed strong growth of 46.9%, increasing P&A salience to 46.2% in volume terms and 55.8% of sales value. ICONiQ White continued its expansion, achieving 2.3 million cases in the quarter. The company launched Golden Mist brandy in Karnataka and Telangana, and expanded into luxury vodka with Russian Standard Vodka. International footprint expanded from 14 to 27 countries. The Rs. 525 crore CAPEX program is progressing with PET manufacturing facility expected to start operations in September 2025. Net debt reduced marginally to Rs. 754 crores from Rs. 766 crores in March 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754397065993,
            "Source": "earnings"
        },
        {
            "Title": "Allied Blenders Reports 405% Profit Jump, Malt Facility on Track for Q4",
            "Summary": "Allied Blenders And Distillers reported strong quarterly results with consolidated net profit surging 405% to Rs 57 crore and revenue growing 21.8% to Rs 922.86 crore. EBITDA increased 51% to Rs 112 crore with margins improving to 12.1% from 9.8%. Managing Director Alok Gupta confirmed the company's malt facility in Telangana remains on schedule for the fourth quarter, describing it as one of India's first single-malt distilleries. The company will also establish a PET bottle manufacturing facility in Telangana next month with 600 bottles annual capacity. Regarding overdue payments, Gupta noted current month supplies are being paid on time but overdue amounts remain unchanged with little movement. He expects the UK free-trade agreement to provide a 200 basis point margin boost once implemented, though the timeline remains uncertain and won't affect the fiscal 2026 capex guidance.",
            "Sentiment": "positive",
            "PublishDate": 1753877663235,
            "Source": "stock"
        },
        {
            "Title": "Allied Blenders & Distillers Targets ₹5,000 Crore Revenue by FY26",
            "Summary": "Allied Blenders & Distillers has set a revenue target of ₹5,000 crore for FY26. The company plans to achieve this through premium products, expanding capacity, and strengthening its presence in Southern India. The company also aims for over 10% EBITDA margin by improving product mix and efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1753804351552,
            "Source": "stock"
        },
        {
            "Title": "Allied Blenders and Distillers Reports Strong Q1 Profit Growth",
            "Summary": "Allied Blenders and Distillers reported Q1 net profit of 609 million rupees compared to 122 million rupees in the same period last year. Revenue remained relatively flat at 17.72 billion rupees versus 17.7 billion rupees year-over-year. EBITDA increased to 1.54 billion rupees from 1.34 billion rupees, while EBITDA margin improved to 8.72% from 7.6% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753793029333,
            "Source": "earnings"
        },
        {
            "Title": "Allied Blenders and Distillers Schedules Q1-FY26 Earnings Conference Call for July 30, 2025",
            "Summary": "Allied Blenders and Distillers Limited has scheduled a conference call to discuss Q1-FY26 earnings on July 30, 2025 at 4:00 PM IST. The call will feature key management representatives including Executive Deputy Chairman Shekhar Ramamurthy, Managing Director Alok Gupta, CFO Anil Somani, and Head of Investor Relations J. Mukund. The conference call is being hosted by Antique Stock Broking Limited and will provide dial-in access numbers for both domestic and international participants. The company has made this disclosure to stock exchanges NSE and BSE as part of regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1753367823572,
            "Source": "earnings"
        },
        {
            "Title": "India Ratings Upgrades Allied Blenders and Distillers Bank Facilities to 'IND A' with Positive Outlook",
            "Summary": "India Ratings upgraded Allied Blenders and Distillers Limited's bank facilities to 'IND A' from 'IND A-' with a Positive outlook. The upgrade reflects sustained improvement in operations, with revenue growing 5.77% to INR35,198.84 million in FY25 driven by increased sales volume of IMFL to 33.07 million cases. EBITDAR margins improved significantly to 12.23% from 7.28%, supported by 512bp improvement in gross margins due to higher contribution from premium brands and operational efficiencies. Net leverage reduced to 1.86x from 3.26x following the IPO proceeds of INR9,759 million in July 2024. The company is expanding backward integration with ongoing projects for ENA production capacity enhancement to 121mlpa by FY27 and PET bottle manufacturing. However, the rating remains constrained by elongated working capital cycle due to overdue receivables from Telangana government and large contingent liabilities of INR8,448.6 million, including a new income tax demand of INR6,181.9 million.",
            "Sentiment": "positive",
            "PublishDate": 1753155478837,
            "Source": "stock"
        },
        {
            "Title": "Allied Blenders and Distillers Ltd: Last Day to Buy Shares for Dividend Eligibility",
            "Summary": "June 27 is the record date for Allied Blenders and Distillers Ltd's final dividend of Rs 3.6 per share for fiscal 2025. Today is the last day to buy shares to qualify for the dividend. The company aims to achieve a 15% Ebitda margin by fiscal 2027 and reported a net profit of Rs 78.6 crore in Q4 FY2025, with 20.8% volume growth.",
            "Sentiment": "positive",
            "PublishDate": 1750907833000,
            "Source": "corporate_action"
        },
        {
            "Title": "Allied Blenders and Distillers: Global Expansion and Premium Portfolio Growth",
            "Summary": "Allied Blenders and Distillers Ltd. is expanding globally and focusing on premium offerings. The company has increased exports to 23 countries, plans to launch Zoya gin in UAE, and aims to enter Canada and EU markets. It's adopting a 'build, buy and partner' strategy to capitalize on premiumization trends. The India-UK FTA is expected to improve margins by reducing Scotch import duties.",
            "Sentiment": "positive",
            "PublishDate": 1750176813000,
            "Source": "corporate_action"
        },
        {
            "Title": "Allied Blenders And Distillers Partners with Russian Standard Vodka for India Market",
            "Summary": "Allied Blenders And Distillers has announced a collaboration to bring Russian Standard Vodka to the Indian market. This partnership aims to introduce the Russian vodka brand to consumers in India.",
            "Sentiment": "positive",
            "PublishDate": 1750141932000,
            "Source": "default"
        }
    ]
}