{
    "Symbol": "ABFRL",
    "ISIN": "INE647O01011",
    "News": [
        {
            "Title": "ABFRL Board Approves Merger of Two Subsidiaries",
            "Summary": "Aditya Birla Fashion & Retail Limited board approved amalgamation scheme for Jaypore E-Commerce and TG Apparel & Decor subsidiaries on February 5, 2026, subject to regulatory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1770300397053,
            "Source": "co_actions_results"
        },
        {
            "Title": "ABFRL Q3FY26 Results: Revenue Flat at ₹1,641.69 Cr",
            "Summary": "Aditya Birla Fashion & Retail reports Q3FY26 revenue of ₹1,641.69 crores, nearly flat YoY. Net loss widens to ₹61.57 crores from ₹33.13 crores in Q3FY25. Labour Code impact creates ₹22.69 crore exceptional charge.",
            "Sentiment": "negative",
            "PublishDate": 1770298031831,
            "Source": "co_actions_results"
        },
        {
            "Title": "ABFRL CEO Anant Daga Resigns, Sooraj Bhat Takes Charge",
            "Summary": "Aditya Birla Fashion & Retail announces CEO Anant Kumar Daga's resignation from TCNS Division effective April 30, 2026. Sooraj Bhat to lead combined Ethnic Business and TCNS operations from May 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769673411263,
            "Source": "stocks"
        },
        {
            "Title": "ABFRL Invests ₹42.38 Cr More in Wrogn Private Limited",
            "Summary": "Aditya Birla Fashion & Retail's subsidiary ABDFVL invests additional ₹42.38 crore in Wrogn through secondary acquisition and primary infusion, expanding digital-first brand portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1769609003707,
            "Source": "co_actions_results"
        },
        {
            "Title": "ABFRL Board Meet on Feb 5 for Q3FY26 Results",
            "Summary": "Aditya Birla Fashion & Retail schedules board meeting on February 5, 2026 to approve Q3FY26 financial results, with earnings call on February 6, 2026 at 16:00 hrs IST.",
            "Sentiment": "neutral",
            "PublishDate": 1769600872466,
            "Source": "co_actions_results"
        },
        {
            "Title": "ABFRL Receives ₹217L Customs Demand Order",
            "Summary": "Aditya Birla Fashion & Retail receives customs demand order worth ₹217 lakhs including tax, interest and penalty related to IGST rate dispute on imports.",
            "Sentiment": "negative",
            "PublishDate": 1768989446156,
            "Source": "stocks"
        },
        {
            "Title": "ABFRL Investor Plans 3% Stake Sale via Block Deal",
            "Summary": "An investor in Aditya Birla Fashion And Retail plans to sell up to 3% stake through a block deal worth $32 million at ₹65.78 per share, representing an 8.5% discount to current market price.",
            "Sentiment": "neutral",
            "PublishDate": 1768841330987,
            "Source": "co_actions_results"
        },
        {
            "Title": "ABFRL Allots 5,500 Shares Under Employee Stock Option",
            "Summary": "Aditya Birla Fashion & Retail allotted 5,500 equity shares under TCNS Division ESOP scheme, increasing paid-up capital from ₹12,20,52,05,520 to ₹12,20,52,60,520.",
            "Sentiment": "neutral",
            "PublishDate": 1768490921784,
            "Source": "co_actions_results"
        },
        {
            "Title": "ABFRL Faces ₹13.29 Cr Tax Demand from Haryana SGST",
            "Summary": "Aditya Birla Fashion and Retail receives revised tax demand order of ₹13.29 crores from Haryana SGST authorities related to audit proceedings covering ITC and supply discrepancies. Company plans to appeal.",
            "Sentiment": "negative",
            "PublishDate": 1767184145934,
            "Source": "stocks"
        },
        {
            "Title": "Piramal Acquires 2% Stake in Aditya Birla Fashion",
            "Summary": "Piramal Investment and Industries Corporation acquired 2.44 crore shares of Aditya Birla Fashion and Retail through open market purchases, increasing its shareholding from 3.67% to 5.67%.",
            "Sentiment": "neutral",
            "PublishDate": 1767165499478,
            "Source": "co_actions_results"
        },
        {
            "Title": "ABLBL: Pilani Investment Acquires 2.44 Cr Shares (2%)",
            "Summary": "Pilani Investment disclosed acquisition of 2.44 crore shares (2.00%) in Aditya Birla Lifestyle Brands through open market purchases from Dec 23-29, increasing total holding to 5.67%.",
            "Sentiment": "positive",
            "PublishDate": 1767165467852,
            "Source": "co_actions_results"
        },
        {
            "Title": "ABFRL Faces ₹58.18L CGST Demand Over Input Tax Credit",
            "Summary": "Aditya Birla Fashion receives CGST demand order worth ₹58.18 lakh from Indore authorities over input tax credit dispute, plans to file appeal against the order.",
            "Sentiment": "negative",
            "PublishDate": 1766402856468,
            "Source": "stocks"
        },
        {
            "Title": "ABFRL Faces ₹13.77 Cr GST Demand from Mumbai Tax Authority",
            "Summary": "Aditya Birla Fashion & Retail receives tax demand order worth ₹13.77 crores from Deputy Commissioner of State Tax, Mumbai, related to input tax credit disputes. Company plans to appeal the order.",
            "Sentiment": "negative",
            "PublishDate": 1766056472583,
            "Source": "stocks"
        },
        {
            "Title": "ABFRL Faces ₹6.90 Cr GST Demand from Tax Authorities",
            "Summary": "Aditya Birla Fashion and Retail receives tax demand order worth ₹6.90 crores from Joint Commissioner, Kanpur II, related to GST compliance issues including input tax credit claims and vendor defaults.",
            "Sentiment": "negative",
            "PublishDate": 1765437403511,
            "Source": "stocks"
        },
        {
            "Title": "Aditya Birla Fashion Faces ₹1.64 Crore GST Demand Over Input Tax Credit Dispute",
            "Summary": "Deputy Commissioner CGST Division-II, Chandigarh issued a demand order of ₹1.64 crore against Aditya Birla Fashion and Retail Limited for alleged excess claim of input tax credit due to vendor default in filing returns. The company states there is no impact on operations and plans to file an appeal against the order, believing the demand is not legally tenable.",
            "Sentiment": "negative",
            "PublishDate": 1765280016129,
            "Source": "stock"
        },
        {
            "Title": "Aditya Birla Fashion Reports 13% Revenue Growth to ₹1,982 Crores in Q2 FY26",
            "Summary": "Aditya Birla Fashion and Retail Limited delivered 13% year-on-year revenue growth to ₹1,982 crores in quarterly results. The company reported EBITDA growth of 7% with margins at 5.9% compared to 6.2% in the same period last year. All key segments recorded healthy like-to-like growth, with Pantaloons at 7% and ethnic business over 20%. The company launched OWNDI, a new Gen Z focused brand, opening its first store in Bengaluru. In partnership with Galeries Lafayette, ABFRL unveiled its first India store in Kala Ghoda, Mumbai, spanning 90,000 square feet. TMRW successfully raised ₹450 crores during the quarter. The ethnic portfolio grew 11% year-on-year with revenue at ₹505 crores, while luxury retail delivered 13% year-on-year growth. OWNDI continued strong traction with 43% year-on-year revenue growth and expanded by adding 10 new stores in the quarter. The company held gross cash of ₹2,150 crores at consolidated level as of September 2025. For the first half, revenue reached ₹3,813 crores, up 11% year-on-year, with EBITDA growing 24% to ₹286 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762902275049,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Fashion Reports No Deviation in Fund Utilization for Rights and Preferential Issues",
            "Summary": "Aditya Birla Fashion and Retail Limited submitted monitoring agency reports for the quarter ended September 30, 2025, showing no deviation from stated objectives for both its Rights Issue and Preferential Issue proceeds. The Rights Issue of Rs. 995.12 crores from July 2020 has been fully utilized - Rs. 745 crores for debt repayment and Rs. 242.51 crores for general corporate purposes, with only Rs. 0.08 crores remaining in the monitoring account. For the Preferential Issue of Rs. 2,378.75 crores, the company has utilized Rs. 1,263.73 crores across three objectives: Rs. 1,015.42 crores for debt repayment, Rs. 22.97 crores for capex/opex investments in high-growth businesses, and Rs. 225.34 crores for general corporate purposes. The remaining Rs. 1,115.02 crores is deployed in various mutual funds and fixed deposits. Both Axis Bank Limited and ICRA Limited, serving as monitoring agencies, confirmed that fund utilization aligns with the disclosed objectives and reported no material deviations.",
            "Sentiment": "positive",
            "PublishDate": 1762297041647,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Fashion and Retail Grants 46.77 Lakh Stock Options to Employees",
            "Summary": "Aditya Birla Fashion and Retail Limited's Nomination and Remuneration Committee approved the grant of 46,77,115 stock options to eligible employees under the ESOP Scheme 2025. The grant comprises 35,67,941 options priced at ₹85.38 per option and 11,09,174 Performance Stock Units (PSUs) at ₹10 per PSU. The options will vest over three years with 33.33% vesting annually starting from the first anniversary of the grant date, while PSUs will vest 100% at the end of three years. Stock options can be exercised within five years from the vesting date.",
            "Sentiment": "positive",
            "PublishDate": 1762292203978,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Fashion & Retail Targets ₹25,000+ Crore Revenue by FY27",
            "Summary": "Aditya Birla Fashion & Retail has set a revenue target of over ₹25,000 crore by FY27. The company plans to achieve this through accelerated growth in ethnic wear, TMRW digital brands, and Pantaloons network expansion. The strategy includes margin improvement via premiumization and cost optimization, with focus on omni-channel operations and sustainability-led fashion expansion.",
            "Sentiment": "positive",
            "PublishDate": 1762269652230,
            "Source": "stock"
        },
        {
            "Title": "Aditya Birla Fashion and Retail Announces Leadership Transition in Company Secretary Role",
            "Summary": "Aditya Birla Fashion and Retail Limited's Board of Directors approved key managerial personnel changes. Anil Malik will retire as Company Secretary and Compliance Officer effective November 30, 2025, after 32 years with the Aditya Birla Group. Rajeev Agrawal will assume the role starting December 1, 2025. Agrawal is a member of the Institute of Company Secretaries of India and law graduate with 21 years of experience, including 14 years with the Aditya Birla Group. He has been managing Corporate Secretarial activities of Fashion Business for 3 years and serves as Company Secretary and Compliance Officer of Aditya Birla Lifestyle Brands Limited. His experience includes corporate governance, restructuring, fund raising, compliance, mergers and acquisitions, with involvement in major transactions including demerger of Madura Fashion Lifestyle Business, merger of Aditya Birla Nuvo Limited with Grasim Industries Limited, and various fund raising initiatives.",
            "Sentiment": "neutral",
            "PublishDate": 1762266331315,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aditya Birla Fashion Q2 Loss Narrows to ₹91 Crore Despite 7.5% Revenue Growth",
            "Summary": "Aditya Birla Fashion and Retail Ltd reported a consolidated net loss of ₹90.9 crore for the quarter ended September 30, 2025, significantly narrowing from ₹195 crore loss in the same quarter last year. Revenue from operations increased 7.5% year-on-year to ₹1,492 crore from ₹1,387 crore. Total expenses rose marginally to ₹1,627 crore with finance costs at ₹216 crore and depreciation expenses at ₹252 crore. For the half-year period, the company's loss reduced to ₹160 crore from ₹347 crore previously, while revenue grew to ₹2,940 crore from ₹2,683 crore. The board reviewed progress on demerging Madura Fashion & Lifestyle business into a separate listed entity to enable independent operations with focused capital allocation. Shares closed 1.7% lower and have declined over 20% year-to-date.",
            "Sentiment": "neutral",
            "PublishDate": 1762264398009,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Fashion Reports Wider Q2 Loss Despite Revenue Growth",
            "Summary": "Aditya Birla Fashion and Retail reported a consolidated net loss of 2.63 billion rupees in Q2, significantly higher than the 1.46 billion rupee loss in the same period last year. The company's revenue increased to 19.82 billion rupees from 17.6 billion rupees year-over-year. However, EBITDA declined to 688.1 million rupees from 803.2 million rupees, with EBITDA margin contracting to 3.47% from 4.56% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762259998562,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Partners with Galeries Lafayette to Launch First Indian Store in Mumbai",
            "Summary": "French luxury department store Galeries Lafayette will open its first Indian flagship store in Mumbai's Kala Ghoda district in November through a partnership with Aditya Birla Fashion and Retail (ABFRL). The five-storey 90,000 sq. ft. store will feature around 270 brands, with nearly 70% making their India debut. Kumar Mangalam Birla highlighted India's luxury market growth potential from $20 billion to nearly $90 billion by 2030. The store will be housed in restored Turner Morrison and Voltas House buildings and designed by London-based Virgile + Partners. Galeries Lafayette joins ABFRL's luxury portfolio alongside The Collective, which operates 30+ stores. A second store is planned for Delhi, expected to open in two to three years.",
            "Sentiment": "positive",
            "PublishDate": 1760603769432,
            "Source": "stock"
        },
        {
            "Title": "ABFRL Raises ₹500 Crores Through Private Placement of Debt Securities",
            "Summary": "ABFRL has issued ₹500 crores worth of debt securities through a private placement. The company has successfully completed this fundraising exercise to raise capital through debt instruments.",
            "Sentiment": "positive",
            "PublishDate": 1760353578546,
            "Source": "corporate_action"
        },
        {
            "Title": "ABFRL Launches Gen Z Brand 'OWND' and Plans StyleUp Store Transformation",
            "Summary": "ABFRL has launched a new Gen Z-focused brand called 'OWND'. The company plans to transform its StyleUp stores and aims to reach 100 outlets by the end of the fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1758041412062,
            "Source": "stock"
        },
        {
            "Title": "Aditya Birla Fashion Reports 6.5% Revenue Growth But Losses Widen Post-Demerger",
            "Summary": "Aditya Birla Fashion and Retail Limited reported revenue of ₹1,831.46 crore for the quarter ended June 30, 2025, marking a 6.5% increase from ₹1,719.48 crore in the same period last year. However, net losses from continuing operations widened to ₹233.73 crore compared to ₹160.92 crore in the previous year. The company completed the demerger of its Madura Fashion & Lifestyle business into Aditya Birla Lifestyle Brands Limited. Key financial metrics show net worth at ₹6,812.17 crore, outstanding debt of ₹1,438.58 crore, and a debt-to-equity ratio of 0.49. The interest service coverage ratio was negative at -3.52. The company also increased its stake in Finesse International Design Private Limited to 65.50% and raised its shareholding in House of Masaba Lifestyle Private Limited to 59.16%.",
            "Sentiment": "negative",
            "PublishDate": 1755268514504,
            "Source": "earnings"
        },
        {
            "Title": "ABFRL Plans Store Expansion and Premium Brand Acquisitions",
            "Summary": "ABFRL has outlined strategic targets including accelerated store expansion and premium brand acquisitions. The company is focusing on omni-channel integration to enhance its retail presence. ABFRL aims to improve margins through scale efficiencies and portfolio premiumization strategies.",
            "Sentiment": "positive",
            "PublishDate": 1755102886356,
            "Source": "stock"
        },
        {
            "Title": "Aditya Birla Fashion Reports Q1 Loss, Secures INR 437 Crore Investment from ServiceNow Ventures",
            "Summary": "Aditya Birla Fashion and Retail Limited reported a net loss of INR 59.93 crore for the quarter ended June 30, 2025, compared to a loss of INR 103.82 crore in the same period last year. Revenue from operations increased to INR 1,392.85 crore from INR 1,193.74 crore in the previous quarter. The company and its subsidiary Aditya Birla Digital Fashion Ventures Limited have executed agreements with ServiceNow Ventures Holdings for an investment of up to INR 437 crore through compulsorily convertible preference shares. The investment is subject to customary closing formalities and regulatory approvals. During the quarter, the company completed the demerger of its Madura Fashion & Lifestyle Business, which became effective from May 1, 2025, with the resulting company's shares listing on June 23, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755097504064,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Fashion Reports Mixed Q1 Results with Revenue Growth but Higher Losses",
            "Summary": "Aditya Birla Fashion and Retail reported Q1 revenue of 18.31 billion rupees, up from 16.74 billion rupees year-over-year. The company's EBITDA increased to 1.11 billion rupees from 895.5 million rupees, with EBITDA margin improving to 6.10% from 5.35%. However, consolidated net loss widened to 2.12 billion rupees compared to a loss of 1.6 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1755093075574,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Fashion & Retail Ltd: Flipkart Plans Exit via Block Deal",
            "Summary": "Flipkart Investments Pvt. is selling its 6% stake (7.3 crore shares) in Aditya Birla Fashion & Retail Ltd. through a block deal. The floor price is set at Rs 79.5 per share, a 7.6% discount to the previous closing price. Goldman Sachs is the bookrunner for the transaction.",
            "Sentiment": "negative",
            "PublishDate": 1749011000000,
            "Source": "block_deals"
        },
        {
            "Title": "ABFRL Block Trade on NSE: 2 Million Shares at Rs 81.7",
            "Summary": "A block trade of approximately 2,003,266 shares of Aditya Birla Fashion and Retail Limited (ABFRL) occurred on the National Stock Exchange (NSE) during pre-open trading. The total value of the trade was Rs 16.37 crore, with shares priced at Rs 81.7 each.",
            "Sentiment": "neutral",
            "PublishDate": 1749008586000,
            "Source": "block_details"
        },
        {
            "Title": "Flipkart Sells Entire 6% Stake in ABFRL",
            "Summary": "Flipkart has sold its entire 6% stake in Aditya Birla Fashion and Retail Limited (ABFRL) through a block deal. The sale was conducted at a floor price of ₹80 per share, resulting in a transaction worth approximately ₹600 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1748957467000,
            "Source": "default"
        },
        {
            "Title": "Aditya Birla Fashion: Rs 500 Crore Capex Set for FY26 to Revamp Loss-Making Brands",
            "Summary": "Aditya Birla Fashion and Retail Ltd. plans Rs 500 crore capex in FY26, focusing on turning around loss-making entities TCNS Clothing, Tasva, and TMRW. The company aims to be Ebitda-positive by FY26 (excluding TMRW) and fully profitable by FY27. ABFRL targets tripling revenue and doubling profitability in five years, despite current subdued consumer demand.",
            "Sentiment": "positive",
            "PublishDate": 1748329372000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Fashion and Retail Ltd: Q4 Net Loss Narrows, Revenue Rises",
            "Summary": "ABFRL reported a narrowed net loss of Rs 23.55 crore in Q4 FY25, compared to Rs 266.36 crore in the year-ago period. Revenue from operations increased to Rs 1,719.48 crore. The company's results are not directly comparable due to the demerger of Madura Fashion & Lifestyle Business.",
            "Sentiment": "neutral",
            "PublishDate": 1748015968000,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Fashion and Retail Reports Q4 Financial Results",
            "Summary": "Aditya Birla Fashion and Retail has released its Q4 financial results. The company reported an EBITDA of 2.05 billion rupees, down from 2.84 billion rupees year-over-year. However, the EBITDA margin improved to 11.92% from 8.33% in the same period last year. The company posted a consolidated net loss of 169 million rupees, which is an improvement from the loss of 2.3 billion rupees in the previous year and 513 million rupees in the previous quarter. Q4 revenue increased to 17.2 billion rupees from 15.75 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1748010823000,
            "Source": "result"
        },
        {
            "Title": "Aditya Birla Fashion And Retail: Shares Adjust Post Demerger With Lifestyle Brands",
            "Summary": "Aditya Birla Fashion and Retail Ltd. shares adjusted as they turned ex-date for demerger of Aditya Birla Lifestyle Brands Ltd. The demerger ratio is 1:1, with record date set as May 22. Aditya Birla Lifestyle Brands will be listed separately on NSE and BSE. Post-demerger, Rs 1,000 crore of debt will transfer to the new entity. The parent company plans to raise Rs 2,500 crore within 12 months after demerger completion.",
            "Sentiment": "neutral",
            "PublishDate": 1747891347000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Fashion And Retail: Last Day to Buy Shares Before Lifestyle Brands Spinoff",
            "Summary": "May 17 is the last day to buy Aditya Birla Fashion and Retail shares under T+1 settlement to qualify for the 1:1 demerger of Madura Fashion and Lifestyle business. New shares in Aditya Birla Lifestyle Brands will be issued on May 22. The demerger involves splitting assets, liabilities, and borrowings between the two entities.",
            "Sentiment": "neutral",
            "PublishDate": 1747796172000,
            "Source": "corporate_action"
        },
        {
            "Title": "ABFRL to Consider Q4 Results on May 23",
            "Summary": "Aditya Birla Fashion and Retail Limited (ABFRL) has announced that it will consider its fourth quarter results on May 23.",
            "Sentiment": "neutral",
            "PublishDate": 1747666016000,
            "Source": "default"
        },
        {
            "Title": "Aditya Birla Fashion and Retail: Key Leadership Appointments for Demerged Entity",
            "Summary": "Ashish Dikshit, current MD of Aditya Birla Fashion and Retail, appointed as MD of demerged Aditya Birla Lifestyle Brands. Vishak Kumar named Deputy MD and CEO. Appointments effective May 1, 2025, pending approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1746119190000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aditya Birla Fashion: Shifts Focus to Profitability and Organic Growth",
            "Summary": "Aditya Birla Fashion and Retail Ltd. announced a five-year plan focusing on profitable organic growth, aiming to double revenues and improve EBITDA margins by 300 basis points. The company plans to become debt-free in 2-3 years and start paying dividends. The demerged entity, Aditya Birla Lifestyle Brands, targets 11% CAGR in revenues from FY24 to FY30, while the remnant ABFRL aims for high-teen revenue growth and 7% EBITDA margin by FY30.",
            "Sentiment": "positive",
            "PublishDate": 1743764854000,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLT Approves Scheme of Arrangement for Aditya Birla Fashion and Retail Ltd",
            "Summary": "The National Company Law Tribunal (NCLT) has approved a scheme of arrangement involving Aditya Birla Fashion and Retail Ltd, Aditya Birla Lifestyle Brands Ltd, and their respective shareholders and creditors. This corporate action suggests a restructuring or reorganization within the Aditya Birla Group's fashion and retail businesses.",
            "Sentiment": "positive",
            "PublishDate": 1743120707000,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLT Approves Scheme of Arrangement for Aditya Birla Fashion and Retail Ltd",
            "Summary": "The National Company Law Tribunal (NCLT) has approved a scheme of arrangement involving Aditya Birla Fashion and Retail Ltd, Aditya Birla Lifestyle Brands Ltd, and their respective shareholders and creditors. This corporate action suggests a restructuring or reorganization within the Aditya Birla group's fashion and retail businesses.",
            "Sentiment": "positive",
            "PublishDate": 1743081997000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Fashion & Retail Receives Weight Upgrade in FTSE All World Index",
            "Summary": "Aditya Birla Fashion & Retail has received a weight upgrade in the FTSE All World Index. This upgrade is expected to result in an inflow of approximately 800 million rupees ($9.5 million) into the company's stock.",
            "Sentiment": "positive",
            "PublishDate": 1742548771000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Fashion and Retail Ltd: Q3 Loss Narrows, Revenue Rises",
            "Summary": "ABFRL reported a narrowed Q3 FY24 net loss of Rs 51.3 crore, down from Rs 77.9 crore year-on-year. Revenue grew 3.3% to Rs 4,304.7 crore. EBITDA increased 14.8% to Rs 635 crore, with margin improving to 14.8%.",
            "Sentiment": "positive",
            "PublishDate": 1739761674000,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Fashion & Retail: Q3 Loss Narrows, Revenue Grows",
            "Summary": "Aditya Birla Fashion & Retail reported Q3 FY25 results with loss decreasing by 34.11% YoY to ₹51.31 crore. Revenue increased by 3.31% YoY to ₹4304.69 crore. Operating income rose by 48.92% YoY. EPS improved to ₹-0.48, up 40.74% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1739598935000,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Fashion and Retail Reports Improved Q3 EBITDA and Margin",
            "Summary": "Aditya Birla Fashion and Retail has announced its Q3 financial results, showing an improvement in both EBITDA and EBITDA margin. The company's EBITDA increased to 6.35 billion rupees from 5.5 billion rupees year-over-year. Additionally, the EBITDA margin expanded to 14.75% from 13.27% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739543867000,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Fashion and Retail Reports Q3 Financial Results",
            "Summary": "Aditya Birla Fashion and Retail has reported its Q3 financial results. The company's consolidated net loss narrowed to 513 million rupees, compared to a loss of 779 million rupees in the same quarter last year. However, the loss increased from 1.85 billion rupees in the previous quarter. Revenue for Q3 increased to 43 billion rupees from 41.67 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739543756000,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Fashion and Retail Ltd: Delhi High Court Declares 'Peter England' a Well-Known Trademark",
            "Summary": "The Delhi High Court has ruled that 'Peter England', owned by Aditya Birla Fashion and Retail Ltd, is a well-known trademark. The court recognized the brand's extensive promotion and numerous stores across India, granting Aditya Birla Fashion and Retail Ltd exclusive rights to the 'Peter England' trademark.",
            "Sentiment": "positive",
            "PublishDate": 1739210884000,
            "Source": "corporate_governance"
        },
        {
            "Title": "ABFRL to Consider Q3 Results on February 14",
            "Summary": "Aditya Birla Fashion and Retail Limited (ABFRL) has announced that it will consider its third quarter (Q3) financial results on February 14. This announcement indicates the company's scheduled board meeting to review and approve the quarterly performance figures.",
            "Sentiment": "neutral",
            "PublishDate": 1738934342000,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Fashion and Retail Enters Share Subscription Agreement",
            "Summary": "Aditya Birla Fashion and Retail has entered into a share subscription agreement for 39.6 million shares. The issue price for these equity shares has been set at 272.98 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1738933410000,
            "Source": "corporate_action"
        }
    ]
}