{
    "Symbol": "ABLBL",
    "ISIN": "INE14LE01019",
    "News": [
        {
            "Title": "Aditya Birla Lifestyle Brands Redeems Commercial Paper",
            "Summary": "Aditya Birla Lifestyle Brands Limited confirms successful redemption of Commercial Paper issued on November 14, 2025, with payment completed on February 12, 2026 as scheduled.",
            "Sentiment": "neutral",
            "PublishDate": 1770899998494,
            "Source": "co_actions_results"
        },
        {
            "Title": "ABLBL Reports Strong Q3 FY26 Growth with Margin Expansion",
            "Summary": "Aditya Birla Lifestyle Brands delivered 10% revenue growth to INR2,343 crores in Q3 FY26, with EBITDA margin expanding 180 bps to 18.4%. Company added 90+ stores during quarter.",
            "Sentiment": "positive",
            "PublishDate": 1770392960261,
            "Source": "co_actions_results"
        },
        {
            "Title": "ABLBL Appoints Ms. Sonia Bhandari as Interim CS & CO",
            "Summary": "Aditya Birla Lifestyle Brands Limited's board approved the appointment of Ms. Sonia Bhandari as Interim Company Secretary and Compliance Officer effective February 16, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770040415851,
            "Source": "stocks"
        },
        {
            "Title": "Aditya Birla Lifestyle Brands Approves Rs. 500 Cr NCDs",
            "Summary": "Aditya Birla Lifestyle Brands board approves issuance of Non-Convertible Debentures up to Rs. 500 crores through private placement, subject to regulatory approvals and market conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1770037597272,
            "Source": "co_actions_results"
        },
        {
            "Title": "ABLBL Board Meet Feb 2, Earnings Call Feb 3, 2026",
            "Summary": "Aditya Birla Lifestyle Brands schedules board meeting on February 2, 2026 to approve Q3FY26 results and consider Rs.500 crores NCD issue, followed by earnings call on February 3, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769602476354,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Birla Lifestyle Brands Senior Management Personnel Puneet Kumar Malik Resigns",
            "Summary": "Puneet Kumar Malik, Senior Management Personnel at Aditya Birla Lifestyle Brands Limited, has resigned from his position effective January 31, 2026. Malik is leaving to pursue other opportunities within the Aditya Birla Group, representing a senior management transition for the lifestyle brands company.",
            "Sentiment": "neutral",
            "PublishDate": 1764743687282,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aditya Birla Lifestyle Brands Reports 4% Revenue Growth to INR 2,038 Crores in Q2",
            "Summary": "Aditya Birla Lifestyle Brands Limited delivered revenue growth of 4% to INR 2,038 crores in quarterly results, driven by strong retail performance. The Lifestyle Brands segment grew 7% while Emerging Businesses declined mainly due to Forever 21 revenue in the base. Consolidated EBITDA registered 12% growth to INR 338 crores compared to INR 301 crores in the same quarter last year. EBITDA margin expanded by 125 basis points to 16.6% from 15.3%. Consolidated PAT stood at INR 23 crores versus a loss of INR 9 crores in the previous quarter. The company added 75-plus new stores during the quarter, expanding its network to around 3,250 stores across 785-plus cities. Retail like-to-like growth was 12% for lifestyle brands, reflecting consistent performance across all months. The early onset of Puja season provided positive demand boost, though GST transition and localized issues in the East moderated overall momentum. Management noted that GST transition impacted wholesale partners' ordering systems, particularly affecting September sales, but expects this segment to report strong growth in coming quarters.",
            "Sentiment": "positive",
            "PublishDate": 1762863948639,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Lifestyle Brands Company Secretary Rajeev Agrawal Resigns",
            "Summary": "Rajeev Agrawal, Company Secretary and Compliance Officer at Aditya Birla Lifestyle Brands Limited, has resigned from his position effective close of business hours on November 30, 2025. Agrawal will pursue other opportunities within the Aditya Birla Group. He will continue to discharge his duties in the current role until November 30, 2025. The company has informed stock exchanges BSE and NSE about this leadership change.",
            "Sentiment": "neutral",
            "PublishDate": 1762270860183,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aditya Birla Lifestyle Brands Plans Retail and Digital Expansion Across Premium Segments",
            "Summary": "Aditya Birla Lifestyle Brands is targeting rapid retail and digital expansion across premium lifestyle and luxury segments. The company is leveraging its house of brands strategy under Tasva, Van Heusen, and Forever 21. The expansion focuses on scaling ethnic wear and innerwear categories while driving margin recovery through efficiency improvements and omni-channel integration.",
            "Sentiment": "positive",
            "PublishDate": 1762269201708,
            "Source": "stock"
        },
        {
            "Title": "Aditya Birla Lifestyle Brands Grants 20.1 Lakh Stock Options to Employees",
            "Summary": "Aditya Birla Lifestyle Brands Limited's Nomination and Remuneration Committee approved the grant of 20,10,084 stock options to eligible employees under the ABLBL ESOP Scheme 2025. The grant comprises 14,32,681 stock options and 5,77,403 Performance Stock Units (PSUs). The exercise price is set at ₹136.20 per option based on market price and ₹10 per PSU. For options, 33.33% will vest each year over 3 years starting from the first anniversary of the grant date, while PSUs will vest 100% at the end of 3 years. Stock options can be exercised within 5 years from the vesting date.",
            "Sentiment": "positive",
            "PublishDate": 1762266338859,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Lifestyle Brands Reports Q2 Net Profit of 226.2M Rupees After Previous Year Loss",
            "Summary": "Aditya Birla Lifestyle Brands posted a net profit of 226.2 million rupees in Q2, compared to a loss of 564.3 million rupees in the same period last year. Revenue increased to 20.37 billion rupees from 19.62 billion rupees year-over-year. EBITDA rose to 3.12 billion rupees from 2.82 billion rupees, while EBITDA margin improved to 15.33% from 14.38% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762264302516,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Lifestyle Brands Shares Jump 10% as Flipkart Exits with Rs 950 Crore Stake Sale",
            "Summary": "Aditya Birla Lifestyle Brands shares surged nearly 10% to reach an intraday high of Rs 150 following Flipkart's complete exit from the company. Flipkart sold its entire 6% stake through a block deal involving 7.3 crore shares at Rs 130 per share, representing a 4.73% discount to the previous closing price. The transaction valued at Rs 950 crore marks one of the largest exits by a private investor from a domestic retail company. The sale is part of Flipkart's realignment strategy as the Walmart-owned e-commerce company calibrates its Indian business operations. Aditya Birla Lifestyle Brands, which demerged from Aditya Birla Fashion earlier this year, houses the Madura fashion and lifestyle business including brands like Van Heusen and Louis Philippe. Analyst consensus shows a target price of Rs 161.44, with four analysts recommending 'buy', five suggesting 'hold', and one advising 'sell'.",
            "Sentiment": "positive",
            "PublishDate": 1759726321332,
            "Source": "stock"
        },
        {
            "Title": "Aditya Birla Lifestyle Brands Reports Growth in Q1 Profit and Revenue",
            "Summary": "Aditya Birla Lifestyle Brands reported consolidated net profit of 240 million rupees in Q1, compared to 230 million rupees in the same period last year. The company's revenue increased to 18.4 billion rupees from 17.8 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1755071903416,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Lifestyle Brands Schedules Board Meeting for Q1 Results and Employee Stock Option Scheme",
            "Summary": "Aditya Birla Lifestyle Brands Limited has scheduled a Board of Directors meeting for August 13, 2025, to consider and approve unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The board will also consider the introduction and adoption of the Aditya Birla Lifestyle Brands Limited Employee Stock Option Scheme 2025, subject to committee recommendation and shareholder approval. The company's trading window will remain closed until 48 hours after the results declaration. An earnings conference call is scheduled for August 14, 2025 at 15:30 hrs (IST) to discuss the quarterly financial and operating performance, followed by a Q&A session.",
            "Sentiment": "neutral",
            "PublishDate": 1754567716187,
            "Source": "earnings"
        }
    ]
}