{
    "Symbol": "ABREL",
    "ISIN": "INE055A01016",
    "News": [
        {
            "Title": "Aditya Birla Real Estate Reports Strong Margins",
            "Summary": "Aditya Birla Real Estate reports margins of 25-30%, with some projects exceeding 40%. Management highlights Birla Arika project as key opportunity for enhanced returns.",
            "Sentiment": "positive",
            "PublishDate": 1769743471843,
            "Source": "stocks"
        },
        {
            "Title": "Aditya Birla Real Estate Maps Revenue Timeline",
            "Summary": "Aditya Birla Real Estate outlines revenue expectations from key projects including INR 650 crores from Birla Tisya in FY'27 and phased Niyaara tower revenues through FY'29.",
            "Sentiment": "positive",
            "PublishDate": 1769743441254,
            "Source": "stocks"
        },
        {
            "Title": "Aditya Birla Real Estate Sets Ambitious Growth Targets",
            "Summary": "Aditya Birla Real Estate targets INR150 billion pre-sales by FY'28 and plans to boost annual rental income from INR144 crores to INR1,000 crores in 4-5 years through commercial portfolio expansion.",
            "Sentiment": "positive",
            "PublishDate": 1769743415124,
            "Source": "stocks"
        },
        {
            "Title": "Aditya Birla Real Estate Eyes ₹15,000 Cr Deals",
            "Summary": "Aditya Birla Real Estate targets business development deals worth ₹10,000-15,000 crores by March 31st, remains optimistic for FY26 pre-sales despite Niyaraa Tower C delays.",
            "Sentiment": "positive",
            "PublishDate": 1769743387991,
            "Source": "stocks"
        },
        {
            "Title": "Aditya Birla Real Estate Appoints Keyur Shah as CFO",
            "Summary": "Aditya Birla Real Estate announces appointment of Keyur Shah as CFO effective March 1, 2026, replacing retiring Snehal Shah. Board approved the transition on January 28, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769590704853,
            "Source": "stocks"
        },
        {
            "Title": "Aditya Birla Real Estate Q3 Loss Widens to ₹730M",
            "Summary": "Aditya Birla Real Estate reported a consolidated net loss of ₹730 million in Q3, significantly higher than the ₹406 million loss recorded in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1769589839695,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Birla Real Estate Q3FY26 Earnings Call Set",
            "Summary": "Aditya Birla Real Estate Limited announces earnings conference call scheduled for January 29, 2026 at 11:00 AM IST to discuss Q3FY26 financial performance with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1769160412497,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Birla stocks fall 8% on block deal plans",
            "Summary": "Aditya Birla Fashion and Retail and Aditya Birla Lifestyle Brands shares dropped over 8% after announcing Rs 682 crore block deal plans, with ABFRL hitting fresh 52-week low.",
            "Sentiment": "negative",
            "PublishDate": 1768902335675,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Birla Real Estate Gets BSE Approval for NCD Amendment",
            "Summary": "Aditya Birla Real Estate Limited received BSE in-principle approval to amend its ₹250 crore debenture trust deed, adding call option clause and removing asset disposal restrictions for its 8.05% NCDs.",
            "Sentiment": "positive",
            "PublishDate": 1768298016505,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Birla Real Estate Plans Gurugram Site Visit",
            "Summary": "Aditya Birla Real Estate Limited has scheduled an investor meet for January 9, 2026, featuring site visits to three key projects in Gurugram including Birla Navya, Birla Pravah, and Birla Arika.",
            "Sentiment": "neutral",
            "PublishDate": 1767618812338,
            "Source": "stocks"
        },
        {
            "Title": "Aditya Birla Real Estate Grants 8,772 Stock Options",
            "Summary": "Aditya Birla Real Estate Limited grants 8,772 stock options to eligible employee under CTIL Employee Stock Option Scheme 2023 with exercise price of ₹758.55 per option and 3-year vesting period.",
            "Sentiment": "neutral",
            "PublishDate": 1766402129923,
            "Source": "co_actions_results"
        },
        {
            "Title": "CCI Approves ITC's Paper & Pulp Business Acquisition",
            "Summary": "Competition Commission of India has granted approval for ITC's acquisition of paper and pulp business operations from Aditya Birla Real Estate through slump sale, marking a significant corporate transaction.",
            "Sentiment": "positive",
            "PublishDate": 1765888604582,
            "Source": "co_actions_results"
        },
        {
            "Title": "Birla Estates Achieves Record INR 1,800 Crore Sales with Complete Sell-Out of Birla Pravaah Project in 24 Hours",
            "Summary": "Birla Estates Private Limited, a wholly owned subsidiary of Aditya Birla Real Estate Limited, sold out its entire 492-unit Birla Pravaah residential project in Sector 71, Gurugram within 24 hours of launch, generating sales exceeding INR 1,800 crore. This milestone strengthens Birla Estates' position in the NCR market, following the success of Birla Arika Phase 1 which recorded approximately INR 3,000 crore in sales across nearly 300 units.",
            "Sentiment": "positive",
            "PublishDate": 1765257347903,
            "Source": "stock"
        },
        {
            "Title": "Aditya Birla Real Estate Gets BSE Approval to Modify Financial Covenants on Rs 500 Crore Debentures",
            "Summary": "Aditya Birla Real Estate Limited received in-principle approval from BSE to modify financial covenants on its Rs 500 crore unsecured non-convertible debentures, relaxing the net debt-to-equity ratio from 1.10x to 1.5x until March 2026 and 1.75x thereafter. The company executed the First Amendment Deed with debenture trustee SBI CAP Trustee Company Limited to formalize these changes to the debenture trust deeds dated August 30, 2024 and October 11, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1764854348851,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Real Estate Reports Strong Q2 Performance with 111% Quarterly Growth in Bookings",
            "Summary": "Aditya Birla Real Estate reported bookings of INR 890 crores in Q2 FY26, representing a 111% increase from the previous quarter. The company's flagship projects Birla Niyaara in Mumbai and Birla Evara in Bengaluru recorded robust sales of INR 320 crores and INR 326 crores respectively. As of September 30, 2025, 80% of the company's launched area across India has been sold. The company received RERA approvals for two projects in Pune - Birla Evam at Manjri and Birla Punya at Wellesley Road. The launch pipeline for the remainder of FY26 remains at an estimated gross development value of INR 13,900 crores, with total GDV standing at INR 70,000 crores. The company expects collections of approximately INR 2,000 crores by December, with INR 600 crores in billing already completed in October. Management expressed confidence in achieving business development deals worth INR 10,000-15,000 crores before the end of the financial year from a pipeline of INR 30,000 crores in advanced due diligence stages.",
            "Sentiment": "positive",
            "PublishDate": 1762287387964,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Real Estate Projects INR 2,000 Crores Cash Flow by December, Targets INR 10,000-15,000 Crores in Business Development Deals",
            "Summary": "Aditya Birla Real Estate expects to generate approximately INR 2,000 crores in cash flow by December, with increased collections compared to the previous year. The company anticipates significant growth in construction volume in the coming years. The real estate firm aims to surpass last year's booking goals and targets INR 10,000-15,000 crores in business development deals by fiscal year-end.",
            "Sentiment": "positive",
            "PublishDate": 1761795554800,
            "Source": "stock"
        },
        {
            "Title": "Aditya Birla Real Estate Reports 111% Jump in Q2 FY26 Booking Value to ₹8,895 Million",
            "Summary": "Aditya Birla Real Estate Limited reported booking value of ₹8,895 million in Q2 FY26, representing a 111% increase from Q1 FY26's ₹4,225 million. The company saw strong sales performance from Birla Niyaara in Mumbai (₹3,200 million) and Birla Evara in Bangalore (₹3,257 million). RERA launch approval was received for two projects in Pune - Birla Evam, Manjri and Birla Punya, Wellesley Road. As of September 30, 2025, 80% of launched area across India has been sold. The company has a strong launch pipeline worth ₹139,323 million for the year. Net total income stood at ₹995 million in Q2 FY26 compared to ₹553 million in Q1 FY26. Collections reached ₹6,439 million in Q2 FY26 versus ₹5,453 million in Q1 FY26. The company secured a perfect GRESB score of 100/100 and was ranked #1 residential developer in Asia. Two projects, Birla Niyaara and Birla Tisya, won the Sword of Honour from the British Safety Council for health and safety excellence.",
            "Sentiment": "positive",
            "PublishDate": 1761640830052,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Real Estate Reports Mixed Q2 Results with Profit from Continuing Operations, Approves Rs 1000 Crore Fundraising",
            "Summary": "Aditya Birla Real Estate Limited reported net profit of Rs 24.03 crores from continuing operations for the second quarter ended September 30, 2025, compared to Rs 16.19 crores in the same period last year. Total income from continuing operations increased to Rs 134.65 crores from Rs 101.75 crores year-on-year. The company's board approved raising funds up to Rs 1000 crores through unsecured non-convertible debentures on private placement basis. Additionally, the board approved amendments to debenture trust deeds for adding early redemption clauses under three different series of existing debentures. The company recorded Rs 55.28 crores profit from discontinued operations, primarily from its pulp and paper business which is being divested to ITC Limited. On a consolidated basis, the company reported a net loss of Rs 17.82 crores for the quarter. Real estate segment sales reached Rs 53.44 crores in the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1761636755361,
            "Source": "earnings"
        },
        {
            "Title": "Birla Estates Achieves Global and Regional Sector Leader Status in GRESB 2025 Real Estate Assessment",
            "Summary": "Birla Estates Private Limited, a wholly owned subsidiary of Aditya Birla Real Estate Limited, has been recognized as a Sector Leader in the 2025 GRESB Real Estate Assessment across multiple categories. The company received four key recognitions: Global Sector Leader for Residential and Non-Listed Residential categories, and Regional Sector Leader for Asia Residential and Non-Listed Asia Residential categories. Birla Estates achieved a 100/100 (5-star rating) in the Development Benchmark and 94/100 (5-star rating) in the Standing Investment Benchmark. The 5-star GRESB rating represents the top 20% of all participants worldwide. The company's sustainability achievements include 100% green building certification for all assets, ISO 14001 certification, 65% waste recycling from operational assets, and 50% water reuse through onsite treatment. GRESB is a leading global ESG benchmark used by more than 150 institutional and financial investors to assess sustainability performance.",
            "Sentiment": "positive",
            "PublishDate": 1761559486654,
            "Source": "stock"
        },
        {
            "Title": "Aditya Birla Real Estate Schedules Board Meeting to Review Q2 Results and Approve Rs 1000 Crore Fundraising Plan",
            "Summary": "Aditya Birla Real Estate Limited has scheduled a Board of Directors meeting for October 28, 2025. The board will consider and approve unaudited standalone and consolidated financial results for the quarter ended September 30, 2025. The meeting will also address amendments to debenture trust deeds for adding early redemption clauses to three series of unsecured non-convertible debentures. Additionally, the board will consider a proposal to raise funds up to Rs 1000 crores through non-convertible debentures on a private placement basis, subject to regulatory approvals and within shareholder-approved borrowing limits. The company's trading window for equity shares and listed securities remains closed from October 1, 2025, until October 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760714422995,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Real Estate's Joint Venture Birla Advanced Knits Sells Assets for Rs. 54.11 Crores, Shuts Operations",
            "Summary": "Birla Advanced Knits Private Limited, a joint venture between Aditya Birla Real Estate Limited and Grasim Industries Ltd., has entered into an agreement with RSWM Limited to sell all its plant and machinery for Rs. 54.11 crores. The sale agreement was executed on October 13, 2025, resulting in the immediate closure of the joint venture's operations. The closure was attributed to the non-viability of the knit fabric business due to economic disadvantages and high operational costs. Aditya Birla Real Estate Limited had an equity investment of Rs. 114 crores in the joint venture during the last financial year 2024-25. The company had previously communicated about the business's non-viability in its yearly results for FY2024-25 and quarterly results for the period ended June 30, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1760362903443,
            "Source": "order&deals"
        },
        {
            "Title": "Aditya Birla Real Estate Schedules Investor Meetings in Hong Kong and Singapore",
            "Summary": "Aditya Birla Real Estate Limited has scheduled investor meetings in Hong Kong on August 7-8, 2025, with global asset management firms including Mirae Global Asset Management, Wellington Management Company, Manulife Asset Management, BlackRock Asset Management, HSBC Global Asset Management, and APG Asset Management. The meetings are part of a Hong Kong Non-Deal Roadshow to discuss business operations and industry trends. Company representatives will also attend Ambit Capital's Singapore Conference from August 11-13, 2025. The company confirmed that no unpublished price sensitive information will be shared during these investor interactions.",
            "Sentiment": "neutral",
            "PublishDate": 1754317145486,
            "Source": "stock"
        },
        {
            "Title": "Aditya Birla Real Estate Reports 61% YoY Growth in Quarterly Bookings, Secures $50M IFC Investment",
            "Summary": "Aditya Birla Real Estate reported booking value of Rs. 423 crores for the quarter, growing 61% year-on-year, with area sold increasing 327% to 0.3 million square feet. Collections grew 12% year-on-year to Rs. 545 crores. The company secured a $50 million investment from International Finance Corporation (IFC) for projects in Manjri, Pune and Thane. The quarter focused on execution and consolidation without new project launches, with management preparing for a robust launch pipeline worth over Rs. 13,900 crores for the remainder of the financial year. The company's total portfolio has a gross development value potential of around Rs. 70,000 crores. Management expressed confidence in the luxury housing market, particularly in Worli, and plans to launch the third phase of Birla Niyaara project in late Q3 or early Q4. The paper business divestment is expected to complete by end of calendar year 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753861959197,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Real Estate Sees Rs. 53.14 Crore Block Trade on NSE",
            "Summary": "Aditya Birla Real Estate Ltd. witnessed a block trade worth Rs. 53.14 crores on the National Stock Exchange. The transaction involved approximately 262,800 shares at a price of Rs. 2,022.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1753419152971,
            "Source": "order&deals"
        },
        {
            "Title": "Aditya Birla Real Estate Shares Audio Recording of Q1-FY26 Earnings Call",
            "Summary": "Aditya Birla Real Estate Limited has made available the audio recording of its earnings conference call with investors held on July 24, 2025, at 11:00 A.M. to discuss Q1-FY26 earnings. The recording can be accessed through a link provided to stock exchanges and is also available on the company's website. The communication was signed by Atul K. Kedia, Joint President (Legal) & Company Secretary.",
            "Sentiment": "neutral",
            "PublishDate": 1753366784947,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Real Estate Reports Sharp Revenue Decline and Losses in Q1, Secures Board Approval for ₹15 Billion Fundraise",
            "Summary": "Aditya Birla Real Estate reported Q1 revenue of ₹1.4 billion, down from ₹3.5 billion in the same period last year. The company posted a consolidated net loss of ₹255 million compared to a profit of ₹78 million in the previous year. EBITDA turned negative with a loss of ₹399 million versus a gain of ₹455 million year-over-year. The company's board has approved raising ₹15 billion in funding.",
            "Sentiment": "negative",
            "PublishDate": 1753256994372,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Real Estate Down 32% from Peak Ahead of Quarterly Results",
            "Summary": "Aditya Birla Real Estate (ABREL) shares have declined 32% from their October 2024 peak as the company prepares to announce quarterly results. The Board will meet to consider unaudited financial results for the quarter ended June 30, 2025, and discuss raising funds through term loans or debt securities to refinance borrowings for its Century Pulp and Paper (CPP) division. This refinancing relates to the proposed Rs 3,498 crore sale of the CPP division to ITC Limited, approved in March. Technical analysts show mixed views - some see bullish reversal patterns with the stock trading above its 100-Day Moving Average, while others point to a Lower High-Lower Low structure indicating bearish control. The company reported a consolidated net loss of Rs 126.99 crore for the March quarter compared to a net profit of Rs 143.67 crore the previous year, with revenue falling 51.5%. Emkay Global initiated coverage with a 'buy' rating and Rs 3,300 price target, citing strong booking momentum and a launch pipeline exceeding Rs 45,000 crore. The stock is down 15.6% year-to-date and currently trades 30% above its February low but remains well below its 52-week high of Rs 3,141.95.",
            "Sentiment": "negative",
            "PublishDate": 1753243273784,
            "Source": "stock"
        },
        {
            "Title": "IFC to Acquire 44% Stake in Aditya Birla Real Estate Project SPVs",
            "Summary": "Aditya Birla Real Estate has announced that the International Finance Corporation (IFC) will acquire a 44% stake in their project Special Purpose Vehicles (SPVs). The company has secured a financial investment of ₹420 crores from IFC to fund two distinct projects.",
            "Sentiment": "positive",
            "PublishDate": 1749458682000,
            "Source": "default"
        },
        {
            "Title": "Aditya Birla Real Estate: Q4 Net Loss of Rs 127 Crore",
            "Summary": "Aditya Birla Real Estate reported a consolidated net loss of Rs 126.99 crore for Q4 FY25, compared to a net profit of Rs 143.67 crore in the year-ago period. Total income declined to Rs 407.78 crore from Rs 823.34 crore. For FY25, the company posted a net loss of Rs 148.74 crore, with total income rising to Rs 1,257.33 crore.",
            "Sentiment": "negative",
            "PublishDate": 1747231849000,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Real Estate Reports Q4 Financial Results",
            "Summary": "Aditya Birla Real Estate announced its Q4 financial results, showing a significant downturn. The company reported an EBITDA loss of 260 million rupees, compared to a gain of 2.04 billion rupees in the same quarter last year. Revenue decreased from 6.83 billion rupees to 3.9 billion rupees year-over-year. The consolidated net loss for Q4 was 1.3 billion rupees, in contrast to a profit of 1.44 billion rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1747210175000,
            "Source": "result"
        },
        {
            "Title": "Aditya Birla Real Estate to Consider Q4 Results on May 8",
            "Summary": "Aditya Birla Real Estate has announced that it will consider its fourth quarter (Q4) financial results on May 8. This meeting is likely to review and potentially approve the company's performance for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1745582096000,
            "Source": "default"
        },
        {
            "Title": "Aditya Birla Real Estate Limited: Subsidiary Achieves Record ₹8,000 Crore Bookings in FY25",
            "Summary": "Birla Estates, a subsidiary of Aditya Birla Real Estate Limited, reported record annual booking value of ₹8,000 crore for FY25, doubling from FY24. The company's Gurugram project, Birla Arika, contributed ₹3,100 crores. Q4 FY25 saw five project launches across NCR, Bengaluru, and Pune. The company plans eight new launches in FY26, focusing on premium and luxury housing.",
            "Sentiment": "positive",
            "PublishDate": 1744791594000,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Real Estate Focuses on Premium and Luxury Housing",
            "Summary": "The CEO of Aditya Birla Real Estate has stated that the company's focus remains on premium and luxury housing segments. This strategic direction indicates the company's commitment to high-end real estate development.",
            "Sentiment": "neutral",
            "PublishDate": 1744710011000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Real Estate Achieves 100% Growth in FY25 Bookings",
            "Summary": "Aditya Birla Real Estate has reported a significant growth in its booking value for the fiscal year 2025. The company has achieved a booking value of INR 8000 crores, which represents over 100% growth compared to the previous fiscal year (FY24).",
            "Sentiment": "positive",
            "PublishDate": 1744709906000,
            "Source": "result"
        },
        {
            "Title": "Aditya Birla Real Estate Achieves Record Sales with Birla Arika Launch in Gurugram",
            "Summary": "Aditya Birla Real Estate has set a new sales benchmark with the launch of its Birla Arika project in Gurugram. The company achieved a record-breaking sales milestone of approximately INR 3000 crore (about 300 units) in the Phase 1 launch of the project.",
            "Sentiment": "positive",
            "PublishDate": 1742973179000,
            "Source": "corporate_action"
        },
        {
            "Title": "Birla Estates: Launches Luxury Residential Project in Pune",
            "Summary": "Birla Estates, a subsidiary of Aditya Birla Real Estate Limited, has launched its first residential project in Pune named Birla Punya. The luxury project has an estimated revenue potential of ₹2700 crores, spanning 5.76 acres with 1.6 million square feet of saleable area. It will include 1000 apartments across four towers, with phase 1 offering 500 units.",
            "Sentiment": "positive",
            "PublishDate": 1742279745000,
            "Source": "normal_news"
        },
        {
            "Title": "Birla Estates Launches Luxury Residential Project in Pune",
            "Summary": "Aditya Birla Real Estate's subsidiary, Birla Estates, has entered the Pune real estate market with a new luxury residential project called 'Birla Punya'. The project has a potential revenue of Rs 2,700 crores, marking a significant expansion for the company in the residential property sector.",
            "Sentiment": "positive",
            "PublishDate": 1742256157000,
            "Source": "corporate_action"
        },
        {
            "Title": "Birla Estates Launches Luxury Residential Project in Pune",
            "Summary": "Aditya Birla Real Estate's subsidiary, Birla Estates, has entered the Pune market with a new luxury residential project called 'Birla Punya'. The project has a potential revenue of Rs 2,700 crores, marking a significant expansion for the company in the real estate sector.",
            "Sentiment": "positive",
            "PublishDate": 1742209115000,
            "Source": "corporate_action"
        },
        {
            "Title": "Vardhita Properties No Longer a Wholly Owned Subsidiary of Birla Estates",
            "Summary": "Aditya Birla Real Estate has announced that Vardhita Properties is no longer a wholly owned subsidiary of Birla Estates. This change in ownership structure suggests a potential shift in the company's real estate portfolio or strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1741098484000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Real Estate Launches Birla Trimaya Phase III in North Bengaluru",
            "Summary": "Aditya Birla Real Estate's unit has launched Phase III of Birla Trimaya project in North Bengaluru. The launch has generated a booking value of 5 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1740961258000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Real Estate Launches Birla Trimaya Phase III in North Bengaluru",
            "Summary": "Aditya Birla Real Estate's subsidiary has launched Phase III of Birla Trimaya in North Bengaluru. The project has recorded a booking value of 5 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1740741663000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Real Estate Forms Joint Venture with Mitsubishi for Bengaluru Project",
            "Summary": "Aditya Birla Real Estate's unit has entered into a joint venture with Mitsubishi for a 5.60 billion rupee investment. The partnership, through a Special Purpose Vehicle (SPV), will develop a 4 million square foot residential project in Bengaluru. BEPL (Aditya Birla unit) and MIPL (Mitsubishi) will share a 51:49 economic interest in the SPV respectively.",
            "Sentiment": "positive",
            "PublishDate": 1737936682000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Real Estate Forms Joint Venture with Mitsubishi for Bengaluru Project",
            "Summary": "Aditya Birla Real Estate's unit has entered into a joint venture with Mitsubishi for a 5.60 billion rupees investment. The joint venture, with BEPL and MIPL sharing a 51:49 economic interest in the Special Purpose Vehicle (SPV), aims to develop a 4 million square feet residential project in Bengaluru.",
            "Sentiment": "positive",
            "PublishDate": 1737726863000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Real Estate: Q3 FY25 Reports ₹40.59Cr Loss, Revenue Down 10.61% YoY",
            "Summary": "Aditya Birla Real Estate announced Q3 FY25 results with a loss of ₹40.59 crore, compared to a profit of ₹83.3 crore in Q3 FY24. Revenue decreased by 10.61% YoY and 15.15% QoQ. Operating income fell by 230.57% QoQ and 129.83% YoY. EPS declined to ₹-3.15, down 132.92% YoY. Despite challenges, analysts maintain a Strong Buy consensus.",
            "Sentiment": "negative",
            "PublishDate": 1737609408000,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Real Estate Plans Major Project Launches",
            "Summary": "Aditya Birla Real Estate is planning a single-phase launch strategy based on market demand and land structure. The company is set to launch new phases of several projects, including Trimaya (Rs 800 crore), Sarjapur (Rs 3,000 crore), Birla Navya (Rs 1,000 crore), and Barmalt in Gurgaon (Rs 3,000 crore). These launches represent significant investments across multiple locations.",
            "Sentiment": "positive",
            "PublishDate": 1737602086000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Real Estate Confident in Meeting Guidance with New Project Launches",
            "Summary": "Aditya Birla Real Estate has expressed confidence in achieving its financial guidance. The company plans to launch new projects worth Rs 8,000 crore in inventory value. For specific projects like Worli, the company expects margins to be around 45%. This information was shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1737601884000,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Real Estate Reports Significant Drop in Q3 EBITDA",
            "Summary": "Aditya Birla Real Estate has reported a substantial decrease in its Q3 EBITDA, which fell to 130 million rupees from 1.97 billion rupees in the same quarter last year. The company's EBITDA margin also declined sharply, dropping to 1.36% from 18.41% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1737445856000,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Real Estate Reports Q3 Revenue Decline",
            "Summary": "Aditya Birla Real Estate has reported a decrease in its third-quarter revenue. The company's Q3 revenue stood at 9.6 billion rupees, down from 10.6 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1737445746000,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Real Estate Reports Q3 Net Loss",
            "Summary": "Aditya Birla Real Estate has reported a consolidated net loss of 406 million rupees for the third quarter, compared to a profit of 833 million rupees in the same period last year. This represents a significant year-over-year decline in the company's financial performance.",
            "Sentiment": "negative",
            "PublishDate": 1737445688000,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Court Overturns High Court Order on Worli Mill Land Allocation to Aditya Birla Real Estate",
            "Summary": "The Supreme Court has set aside a High Court order that directed the Brihanmumbai Municipal Corporation (BMC) to allocate 5 acres of Worli mill land to Aditya Birla Real Estate. This decision reverses the previous ruling and may impact the company's real estate plans in the area.",
            "Sentiment": "negative",
            "PublishDate": 1736307911000,
            "Source": "corporate_governance"
        }
    ]
}