{
    "Symbol": "ABSLAMC",
    "ISIN": "INE404A01024",
    "News": [
        {
            "Title": "Aditya Birla Sun Life AMC Q3FY26 Results Published",
            "Summary": "Aditya Birla Sun Life AMC Limited publishes unaudited financial results for quarter and nine months ended December 31, 2025, in compliance with SEBI regulations through newspaper advertisements.",
            "Sentiment": "neutral",
            "PublishDate": 1769155032030,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Birla Sun Life AMC Plans New Fund Launches",
            "Summary": "Aditya Birla Sun Life Asset Management announces plans to launch a hybrid fund with equity taxation in February and an equity long-term fund pending talent acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1769136922928,
            "Source": "mutualfunds"
        },
        {
            "Title": "ABSL AMC Provides Expense Growth Guidance",
            "Summary": "Aditya Birla Sun Life Asset Management expects normal expense growth aligned with inflation, with additional manpower costs from new ESOP scheme launched in January affecting next few quarters.",
            "Sentiment": "neutral",
            "PublishDate": 1769136899397,
            "Source": "mutualfunds"
        },
        {
            "Title": "ABSL AMC Expects Minimal Impact from Regulatory Changes",
            "Summary": "Aditya Birla Sun Life Asset Management management anticipates very limited impact on yields from recent regulatory circulars, with no significant fee reduction expected through strategic product mix.",
            "Sentiment": "neutral",
            "PublishDate": 1769136869966,
            "Source": "mutualfunds"
        },
        {
            "Title": "Aditya Birla Sun Life AMC Projects 7.4% GDP Growth",
            "Summary": "Asset management company forecasts India's real GDP to expand 7.4% in FY26, with nominal GDP growth projected at 9.75% for FY27, indicating strong economic outlook.",
            "Sentiment": "positive",
            "PublishDate": 1769136826077,
            "Source": "stocks"
        },
        {
            "Title": "Aditya Birla Sun Life AMC Q3 Net Profit Rises 20.5%",
            "Summary": "Aditya Birla Sun Life AMC reported consolidated net profit of ₹2.70 billion for Q3, marking a significant 20.5% year-on-year growth from ₹2.24 billion in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1769071561779,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Birla Sun Life AMC Allots 1,651 ESOP Shares",
            "Summary": "Aditya Birla Sun Life AMC Limited allotted 1,651 equity shares under ESOP Scheme 2021, increasing paid-up capital from ₹1,44,38,87,125 to ₹1,44,38,95,380 on January 21, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769008471246,
            "Source": "co_actions_results"
        },
        {
            "Title": "Large caps offer better risk-reward than small caps",
            "Summary": "Aditya Birla Sun Life AMC's Harish Krishnan says large-cap stocks currently provide superior risk-reward compared to small caps due to sector shifts and overcrowding in smaller companies.",
            "Sentiment": "neutral",
            "PublishDate": 1768210951267,
            "Source": "mutualfunds"
        },
        {
            "Title": "ABSL AMC Resumes Global Fund Investments After Freeze",
            "Summary": "Aditya Birla Sun Life Mutual Fund reopens three international equity schemes after 3-month suspension, accepting fresh investments up to ₹1 crore per PAN daily from January 12, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768125726925,
            "Source": "mutualfunds"
        },
        {
            "Title": "Aditya Birla Sun Life AMC Q3FY26 earnings call Jan 22",
            "Summary": "Aditya Birla Sun Life AMC Limited has scheduled an earnings conference call on January 22, 2026, at 4:00 PM IST to discuss Q3FY26 and 9M FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767879488998,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Birla Sun Life AMC Board Meet on Jan 22",
            "Summary": "Aditya Birla Sun Life AMC Limited has scheduled its board meeting for January 22, 2026, to consider Q3FY26 financial results. Trading window closed till January 24, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767878800699,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Birla Sun Life AMC Gets ESG Rating of 71",
            "Summary": "Aditya Birla Sun Life AMC Limited receives an ESG rating of 71 for FY25 from NSE Sustainability Ratings & Analytics Limited, reflecting strong performance on environmental, social and governance parameters.",
            "Sentiment": "positive",
            "PublishDate": 1767873556524,
            "Source": "stocks"
        },
        {
            "Title": "ABSL AMC Block Trade Worth ₹38.04 Crores on NSE",
            "Summary": "Aditya Birla Sun Life AMC witnessed a significant block trade on NSE involving 499,234 shares valued at ₹38.04 crores, executed at ₹761.90 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1765955822631,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Birla Sun Life AMC Grants Stock Options & PSUs",
            "Summary": "Company grants 9,82,768 stock options at ₹849.95 and 2,24,032 PSUs at ₹5 to eligible employees under ESOP Scheme 2025, with vesting over 3 years starting 2027.",
            "Sentiment": "positive",
            "PublishDate": 1765890426538,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Birla Sun Life AMC Establishes Fully Owned Subsidiary in GIFT City",
            "Summary": "Aditya Birla Sun Life AMC has established a fully owned subsidiary named Aditya Birla Sun Life AMC International (IFSC) Limited in GIFT City. This expansion into the International Financial Services Centre indicates the company's strategic move to tap into international markets and offshore financial services.",
            "Sentiment": "positive",
            "PublishDate": 1764855721859,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Sun Life AMC Seeks Shareholder Approval for Employee Stock Option Scheme 2025",
            "Summary": "Aditya Birla Sun Life AMC Limited has issued a postal ballot notice seeking shareholder approval for adoption of Employee Stock Option and Performance Stock Unit Scheme 2025, covering up to 57,73,438 stock options representing 2% of paid-up equity share capital as of September 30, 2025. The scheme will benefit eligible employees of the company and its subsidiaries, with remote e-voting scheduled from November 20 to December 19, 2025, and results to be announced by December 21, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763537983942,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Sun Life AMC Allots 20,305 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Aditya Birla Sun Life AMC Limited allotted 20,305 equity shares of face value ₹5 each following exercise of stock options under its ESOP Scheme 2021. The allotment increased the company's paid-up equity share capital from ₹1,44,34,43,600 to ₹1,44,35,45,125, with total equity shares rising to 28,87,09,025.",
            "Sentiment": "neutral",
            "PublishDate": 1763470294546,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Sun Life AMC Reports 9% Revenue Growth, Crosses Rs 4.25 Lakh Crore AUM Milestone",
            "Summary": "Aditya Birla Sun Life AMC achieved quarterly average AUM of Rs 4.25 lakh crores, growing 11% year-on-year, with total AUM including alternate assets at Rs 4.61 lakh crores (15% growth). Revenue from operations reached Rs 461 crores (9% increase) while operating profit stood at Rs 270 crores (13% growth). The company's SIP contribution was Rs 1,100 crores with 39 lakh folios. PMS and AIF assets grew significantly from Rs 3,852 crores to Rs 30,250 crores, representing an 8-fold increase. The company was selected by EPFO to manage its debt portfolio over the next five years. Passive AUM reached Rs 36,000 crores with 20% year-on-year growth. The board approved a new ESOP scheme subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1761855846289,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Sun Life Plans to Double Real Estate Portfolio and Launch New AIF Products",
            "Summary": "Aditya Birla Sun Life anticipates doubling its real estate portfolio by fiscal year-end. The company received SEBI approval for its Apex brand and has filed two products for launch. Under the Apex brand, the company plans to launch new AIF products, starting with an Arbitrage Plus Fund, followed by a Long-Short Fund.",
            "Sentiment": "positive",
            "PublishDate": 1761537333493,
            "Source": "mutualfunds"
        },
        {
            "Title": "Aditya Birla Sun Life AMC Reports Quarterly Results and Key Board Decisions",
            "Summary": "Aditya Birla Sun Life AMC Limited's Board approved unaudited financial results for the quarter and half year ended September 30, 2025. The company reported standalone net profit of Rs. 244.70 crore for the quarter and Rs. 521.59 crore for the half year. Consolidated net profit stood at Rs. 241.59 crore for the quarter and Rs. 518.83 crore for the half year. The Board appointed Mr. Prasad Kakkat as Head-HR and Administration effective November 1, 2025, replacing Mr. Hirak Bhattacharjee who transitions to a leadership role within Aditya Birla Capital Group. The company also approved the adoption of Employees Stock Option and Performance Stock Unit Scheme 2025 covering 57,73,438 equity shares, subject to shareholder and regulatory approvals. During the period, the company paid a final dividend of Rs. 24 per equity share and allotted 1,05,335 equity shares under employee stock option schemes.",
            "Sentiment": "positive",
            "PublishDate": 1761302629804,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Sun Life Reports Mixed Q2 Results with Revenue Growth and Slight Profit Decline",
            "Summary": "Aditya Birla Sun Life reported quarterly consolidated net profit of 2.41 billion rupees compared to 2.42 billion rupees in the same period last year, representing a marginal decline. However, the company's revenue increased to 4.61 billion rupees from 4.24 billion rupees year-over-year, showing growth in the top line despite the slight pressure on profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1761297070472,
            "Source": "earnings"
        },
        {
            "Title": "Only 3.2% of Life Insurance Customers Under 25, ABSLI Report Reveals Low Youth Adoption",
            "Summary": "Aditya Birla Sun Life Insurance (ABSLI) reported that only 3.2% of its active customer base is under 25 years old, with the 0-18 age group representing 0.37% and 19-25 age group at 2.83%. In contrast, older demographics show higher adoption rates: 26-35 years (18.02%), 36-45 years (32.36%), and 46-55 years (27.30%). Product adoption among under-25 customers remains minimal across categories - 0.96% for term insurance, 1.99% for ULIPs, and 2.71% for traditional plans. ABSLI attributes this gap to behavioral factors including preference for immediate gratification, risk underestimation, overconfidence in health, and financial decision-making inertia. The company suggests repositioning life insurance as a lifestyle choice through digital-first, simplified, and goal-based offerings. MD & CEO Kamlesh Rao emphasized the need to reframe insurance as a lifestyle enabler rather than just a safety net, with products aligned to youth ambitions and delivered in formats native to them.",
            "Sentiment": "neutral",
            "PublishDate": 1757048947184,
            "Source": "stock"
        },
        {
            "Title": "Aditya Birla Sun Life AMC Reports Strong Q1 FY26 Results with 22% Profit Growth",
            "Summary": "Aditya Birla Sun Life AMC delivered robust quarterly results with profit after tax rising 18% year-on-year to INR 277 crores and profit before tax growing 22% to INR 372 crores. Revenue from operations increased 16% to INR 447 crores. The company achieved a milestone of crossing INR 4 lakh crores in mutual fund AUM, with overall average AUM including alternate assets reaching INR 4.43 lakh crores, up 21% year-on-year. Quarterly net sales exceeded the entire FY25 net sales, driven by improved fund performance across categories. The company's PMS/AIF assets witnessed impressive 8x growth to INR 28,657 crores, largely due to the ESIC mandate. SIP contributions reached INR 1,140 crores in June 2025 with 38 lakh accounts. Management highlighted market share stabilization after previous quarters of decline and outlined expansion plans including regional growth summits and new product launches in the alternate investment space.",
            "Sentiment": "positive",
            "PublishDate": 1753864400006,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Sun Life AMC Reports Strong Q1 Growth with 17% Rise in Net Profit",
            "Summary": "Aditya Birla Sun Life AMC reported consolidated net profit of 2.77 billion rupees for Q1, representing growth from 2.36 billion rupees in the same period last year. The asset management company's revenue increased to 4.47 billion rupees compared to 3.9 billion rupees year-over-year, showing continued business expansion across its operations.",
            "Sentiment": "positive",
            "PublishDate": 1753344733422,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Sun Life AMC: Expects 12-13% Earnings Growth in FY26",
            "Summary": "Aditya Birla Sun Life AMC anticipates 12-13% earnings growth in FY26, driven by positive liquidity and rural economy improvement. The company foresees challenges in Q1 due to global uncertainties. Investment strategy focuses on large-caps, with emerging opportunities in mid and small-caps. Bullish sectors include banking, consumer discretionary, retail, chemicals, and building materials.",
            "Sentiment": "positive",
            "PublishDate": 1748566808000,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Sun Life AMC: Q4 Profit Rises 9% to Rs 228 Crore",
            "Summary": "Aditya Birla Sun Life AMC reported a 9% increase in Q4 net profit to Rs 228.1 crore. Revenue from operations grew 17% to Rs 429 crore. The company recommended a dividend of Rs 24 per equity share for FY 2024-25. Full-year net profit rose 19% to Rs 930.6 crore, with total income up 25% YoY. The company's quarterly average AUM stood at Rs 3.82 lakh crore as of March 2025.",
            "Sentiment": "positive",
            "PublishDate": 1745842091000,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Sun Life AMC Announces Dividend and Q4 Revenue Growth",
            "Summary": "Aditya Birla Sun Life AMC has declared a dividend of 24 rupees per share. Additionally, the company reported Q4 revenue of 4.28 billion rupees, up from 3.66 billion rupees in the same quarter last year, indicating year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1745831661000,
            "Source": "result"
        },
        {
            "Title": "Aditya Birla Sun Life AMC Reports Q4 Profit Increase",
            "Summary": "Aditya Birla Sun Life AMC has reported a consolidated net profit of 2.28 billion rupees for the fourth quarter, compared to 2.08 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1745831611000,
            "Source": "result"
        },
        {
            "Title": "Aditya Birla Sun Life Mutual Fund: Launches 'Choti SIP' with Rs 250 Monthly Investment",
            "Summary": "Aditya Birla Sun Life Mutual Fund introduces 'Choti SIP', allowing investments as low as Rs 250 per month in select mutual fund schemes. The initiative aims to lower entry barriers and encourage more people to invest in mutual funds via SIPs. Available for most schemes except debt, sectoral, thematic, small-cap, and mid-cap plans, it requires a minimum investment period of 60 months.",
            "Sentiment": "positive",
            "PublishDate": 1741852571000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Sun Life Mutual Fund: Launches 'Choti SIP' with ₹250 Minimum Investment",
            "Summary": "Aditya Birla Sun Life Mutual Fund introduces 'Choti SIP', allowing investments starting at ₹250 per month. Available across most schemes except Debt, Sectoral & Thematic, Small, and Midcap Funds. Requires 60 installment commitment, exclusive to Growth option, with NACH or UPI auto pay.",
            "Sentiment": "positive",
            "PublishDate": 1741775058000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Sun Life AMC: Shares Plummet on Q3 Profit Decline",
            "Summary": "Aditya Birla Sun Life AMC's shares fell over 8% after reporting a 7.5% decline in Q3 net profit to Rs 224 crore. Total income dropped 7.2% to Rs 483 crore. Average AUM rose 3.6% to Rs 68,607 crore, but SIP flow and registration counts decreased.",
            "Sentiment": "negative",
            "PublishDate": 1738043270000,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Sun Life Reports Q3 Financial Results",
            "Summary": "Aditya Birla Sun Life announced its Q3 consolidated net profit of 2.24 billion rupees, showing an increase from 2.09 billion rupees year-over-year and a slight decrease from 2.4 billion rupees quarter-over-quarter. The company's Q3 revenue rose to 4.45 billion rupees, up from 3.41 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1737983421000,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Sun Life AMC Reports Strong Q2 Financial Results",
            "Summary": "Aditya Birla Sun Life AMC has announced its Q2 consolidated net profit of 2.4 billion rupees, showing a significant increase from 1.8 billion rupees year-over-year and 2.35 billion rupees quarter-over-quarter. The company's Q2 revenue also rose to 4.24 billion rupees from 3.3 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730126504000,
            "Source": "result"
        },
        {
            "Title": "Aditya Birla Sun Life AMC: Launches $300M Offshore Private Credit Fund",
            "Summary": "<p>Aditya Birla Sun Life AMC is <span class='positive'>launching</span> a <span class='neutral'>$300 million</span> India Yield Advantage fund to <span class='positive'>attract</span> offshore capital from global investors in Singapore and Dubai. The fund <span class='positive'>aims</span> for a <span class='positive'>20% return</span>, mirroring their domestic private credit strategy. Simultaneously, they're <span class='positive'>raising</span> <span class='neutral'>₹2,500 crore</span> for a domestic performing credit fund, with a <span class='neutral'>10% sponsor capital commitment</span> and <span class='neutral'>₹500 crore</span> seed capital.</p>",
            "Sentiment": "positive",
            "PublishDate": 1729040285000,
            "Source": "normal_news"
        }
    ]
}