{
    "Symbol": "ABSMARINE",
    "ISIN": "INE0QRV01016",
    "News": [
        {
            "Title": "ABS Marine Services Reports Strong H1 Performance with 286% Jump in Net Profit",
            "Summary": "ABS Marine Services delivered robust H1 results with consolidated net profit surging to 313 million rupees from 81 million rupees year-over-year. Revenue increased significantly to 1.36 billion rupees compared to 801 million rupees in the previous year. The company's EBITDA rose to 548 million rupees from 171 million rupees, while EBITDA margin expanded substantially to 40.30% from 21.37% year-over-year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1762965623894,
            "Source": "earnings"
        },
        {
            "Title": "ABS Marine Services Secures ₹270 Million Charter Contract from Larsen & Toubro",
            "Summary": "ABS Marine Services has secured a ₹270 million charter deal for an offshore vessel from Larsen & Toubro. The contract involves chartering services for offshore operations.",
            "Sentiment": "positive",
            "PublishDate": 1759843274472,
            "Source": "order&deals"
        },
        {
            "Title": "ABS Marine Services to Acquire DP2 Offshore Supply Vessel",
            "Summary": "ABS Marine Services has announced plans to acquire a DP2 Offshore Supply Vessel. The acquisition is expected to be completed by the first quarter of the financial year 2025-26.",
            "Sentiment": "positive",
            "PublishDate": 1743149463000,
            "Source": "corporate_action"
        },
        {
            "Title": "ABS Marine Services Secures 279.7 Million Rupee Contract with ONGC",
            "Summary": "ABS Marine Services has entered into a contract agreement with Oil and Natural Gas Corporation (ONGC) for a project valued at 279.7 million rupees. The company has officially commenced work on this contract, marking a significant business development for ABS Marine Services.",
            "Sentiment": "positive",
            "PublishDate": 1743120667000,
            "Source": "order&deals"
        },
        {
            "Title": "ABS Marine Services Secures 279.7 Million Rupee Contract with ONGC",
            "Summary": "ABS Marine Services has entered into a contract agreement with Oil and Natural Gas Corporation (ONGC) for a project valued at 279.7 million rupees. The company has officially commenced work on this contract, marking a significant business development for ABS Marine Services.",
            "Sentiment": "positive",
            "PublishDate": 1743084110000,
            "Source": "order&deals"
        },
        {
            "Title": "ABS Marine Services Takes Delivery of Offshore Supply Vessel",
            "Summary": "ABS Marine Services has received delivery of an offshore supply vessel named Ocean Diamond. The vessel has a gross tonnage of 2443 tons. This delivery was contracted in the third quarter of the fiscal year 2024-2025.",
            "Sentiment": "positive",
            "PublishDate": 1736122127000,
            "Source": "corporate_action"
        },
        {
            "Title": "ABS Marine Services Takes Delivery of Offshore Supply Vessel",
            "Summary": "ABS Marine Services has received delivery of an offshore supply vessel named Ocean Diamond. The vessel has a gross tonnage of 2443 tons. This delivery was contracted during the third quarter of the fiscal year 2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1735914383000,
            "Source": "corporate_action"
        },
        {
            "Title": "ABS Marine Services Signs Major Contract with Schlumberger",
            "Summary": "ABS Marine Services has entered into a charter party agreement with Schlumberger Asia Services. The contract is valued at 1.97 billion rupees for the initial three-year period.",
            "Sentiment": "positive",
            "PublishDate": 1730724611000,
            "Source": "corporate_action"
        },
        {
            "Title": "ABS Marine Services Secures Rs 10 Crore Order",
            "Summary": "<p><span class=\"positive\">ABS Marine Services</span> has <span class=\"positive\">won</span> a <b>new order</b> worth <span class=\"positive\">Rs 10 crore</span>, as reported in an <span class=\"neutral\">SME update</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728974533000,
            "Source": "corporate_action"
        }
    ]
}