{
    "Symbol": "ACC",
    "ISIN": "INE012A01025",
    "News": [
        {
            "Title": "ACC Limited schedules UAE investor meet Feb 12-13",
            "Summary": "ACC Limited announces investor/analyst interaction in UAE on February 12-13, 2026, as non-deal roadshow with in-person meetings from 9 AM to 6 PM local time.",
            "Sentiment": "neutral",
            "PublishDate": 1770218170687,
            "Source": "stocks"
        },
        {
            "Title": "ACC Limited schedules investor meetings in February",
            "Summary": "ACC Limited announces investor and analyst interactions scheduled for February 5, 2026 in Mumbai and February 9-10, 2026 in USA under SEBI Regulation 30 compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1769779307739,
            "Source": "stocks"
        },
        {
            "Title": "Regal Entertainment Reports Q3FY26 Financial Results",
            "Summary": "Regal Entertainment and Consultants Limited announced Q3FY26 results with total income of ₹19.10 lakhs and net loss of ₹2.49 lakhs for quarter ended December 31, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1769611414496,
            "Source": "co_actions_results"
        },
        {
            "Title": "ACC Shares Hit 52-Week Low at ₹1,673",
            "Summary": "ACC shares declined 3.19% to touch a 52-week low of ₹1,673 on NSE despite strong quarterly performance with net profit surging to ₹1,118.02 crores in September 2025.",
            "Sentiment": "negative",
            "PublishDate": 1769163385396,
            "Source": "stocks"
        },
        {
            "Title": "Multiple Companies Report Q3 FY26 Financial Results",
            "Summary": "Several companies including Satin Housing Finance, Rossari Biotech, and Satin Finserv released their quarterly financial results for the quarter ended December 31, 2025, showing mixed performance across sectors.",
            "Sentiment": "neutral",
            "PublishDate": 1768831718487,
            "Source": "co_actions_results"
        },
        {
            "Title": "ACC schedules Q3FY26 earnings call for January 30",
            "Summary": "ACC Limited announces post-results conference call on January 30, 2026 at 5:00 PM to discuss Q3FY26 financial results with senior management participation including CEO and CFO.",
            "Sentiment": "neutral",
            "PublishDate": 1768313611733,
            "Source": "co_actions_results"
        },
        {
            "Title": "ACC faces ₹40 crore GST demand from Punjab, Bihar",
            "Summary": "ACC Ltd receives two GST orders totaling ₹40.13 crore including penalties and interest from Punjab and Bihar tax authorities for alleged excess input tax credit violations.",
            "Sentiment": "negative",
            "PublishDate": 1767184174908,
            "Source": "stocks"
        },
        {
            "Title": "CLSA Sets Hold Rating on ACC with ₹2035 Target",
            "Summary": "CLSA maintains Hold rating on ACC Limited with price target of ₹2035.00, reflecting cautious outlook on the cement major's near-term prospects.",
            "Sentiment": "neutral",
            "PublishDate": 1766461636787,
            "Source": "stocks"
        },
        {
            "Title": "ACC Gets ESG Rating of 65 for FY25",
            "Summary": "ACC Limited receives an ESG rating of 65 in the 'Aspiring' category from NSE Sustainability Ratings for Financial Year 2025, demonstrating continued commitment to ESG performance enhancement.",
            "Sentiment": "positive",
            "PublishDate": 1765546780413,
            "Source": "stocks"
        },
        {
            "Title": "ACC Limited's Chief Sales & Marketing Officer Navin Malhotra Resigns",
            "Summary": "Navin Malhotra resigned from his position as Chief Sales & Marketing Officer and Senior Management Personnel at ACC Limited effective December 6, 2025, citing career opportunities outside the organization. The resignation affects the cement company's senior management structure as Malhotra was part of the key leadership team responsible for sales and marketing operations.",
            "Sentiment": "neutral",
            "PublishDate": 1765018122901,
            "Source": "corporate_governance"
        },
        {
            "Title": "ACC Limited's Independent Director Ameera Shah Completes Term",
            "Summary": "Ameera Shah (DIN: 00208095) ceased to be an Independent Director of ACC Limited with effect from close of business hours on December 2, 2025, upon completion of her term. The Board and Management acknowledged her valuable contribution and guidance during her association with the cement company.",
            "Sentiment": "neutral",
            "PublishDate": 1764682673218,
            "Source": "corporate_governance"
        },
        {
            "Title": "ACC Limited Receives GST Demand Order of Rs 5.12 Crore for Excess ITC Claims",
            "Summary": "ACC Limited received a GST demand order from Additional Commissioner CGST Panchkula for Rs 5.12 crore plus penalty of Rs 51.24 lakh for disallowed excess Input Tax Credit claims in GSTR-3B return. The company plans to contest the order through appeal and expects no material impact on its financial or operational activities.",
            "Sentiment": "negative",
            "PublishDate": 1764675895173,
            "Source": "stock"
        },
        {
            "Title": "ACC Limited Appoints Shruti Shah as Independent Director for Three-Year Term",
            "Summary": "ACC Limited appointed Ms. Shruti Shah as Additional Director (Non-Executive and Independent Director) effective December 1, 2025, for a three-year term. Shah is a Chartered Accountant with over 15 years of experience and currently serves as partner at Pravin P. Shah & Company while holding independent director positions at Orient Cement Limited and Sanghi Industries Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1764599284615,
            "Source": "corporate_governance"
        },
        {
            "Title": "LIC Increases Stake in ACC Limited to 10.596% Through Market Purchases",
            "Summary": "Life Insurance Corporation of India acquired 3,782,029 shares (2.014%) of ACC Limited through market purchases between May 20, 2025 and November 25, 2025, increasing its total holding from 8.582% to 10.596%. The acquisition triggers disclosure requirements under SEBI regulations for substantial shareholding in the cement company.",
            "Sentiment": "neutral",
            "PublishDate": 1764308259403,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Cement Partners with Coolbrook for World's First Commercial RotoDynamic Heater Deployment",
            "Summary": "Adani Cement and Coolbrook announced a delivery agreement for the world's first commercial deployment of RotoDynamic Heater (RDH) technology at the Boyareddypalli Integrated Cement Plant in Andhra Pradesh, India. The technology will decarbonize the calcination phase of cement production by providing clean heat to dry and enhance alternative fuels. The deployment is expected to directly reduce 60,000 tonnes of CO2 emissions annually with potential to increase 10x in due course. The RDH system will be powered entirely by Adani Cement's renewable energy portfolio, ensuring emission-free industrial heat generation. This supports Adani Cement's goals to increase alternative fuel usage to 30% and achieve 60% green power share by FY28, while advancing their net-zero targets by 2050. The companies plan to launch at least five additional projects within the next two years. The first generation RDH will deliver hot gases at around 1000°C to facilitate drying of alternate fuels.",
            "Sentiment": "positive",
            "PublishDate": 1762917433343,
            "Source": "stock"
        },
        {
            "Title": "ACC Limited Reports Strong Q2 Performance with 28% Revenue Growth and 67% EBITDA Jump",
            "Summary": "ACC Limited released its Q2 investor Q&A following quarterly results for the period ended September 30, 2025. The company reported significant financial improvements with revenue jumping 28% and EBITDA of Rs. 849 per metric ton, representing a 67% year-over-year increase. Volume growth reached 16% year-over-year. The company operates with a current capacity of 40.4 MTPA and expects capacity to increase to 43.7 MTPA with the commissioning of Salai Banwa and Kalambol plant expansion in Q3. Additional capacity of 5.6 MTPA will be unlocked through plant debottlenecking over 24 months. ACC's power costs decreased 9% from Rs. 6.54 to Rs. 5.95 per kwh due to renewable energy supplies from parent company Ambuja's 1000 MW RE power project. The company maintains healthy treasury funds of Rs. 787 crores as of September 2025, increasing to Rs. 1500 crores after receiving Rs. 750 crores in tax refunds in October 2025. Trade receivables increased by Rs. 2,515 crores, primarily due to Rs. 2,000 crores in running bills for cement supplies to parent company Ambuja under MSA guidelines. ACC plans to expand its RMX operations from 116 plants across 45 cities to 365 plants by 2030 with target capacity of 35 million cubic meters.",
            "Sentiment": "positive",
            "PublishDate": 1761899747730,
            "Source": "earnings"
        },
        {
            "Title": "ACC Reports Record Q2 Volume Growth of 16% and Maintains Annual Growth Forecast",
            "Summary": "ACC achieved record volume of 10.0 million tons in Q2, representing a 16% year-over-year increase. The company maintains its annual growth forecast of 7-8% and expects demand to continue rising. ACC expresses positive outlook for FY'26, driven by anticipated cost reductions, premium product offerings, and digital upgrades.",
            "Sentiment": "positive",
            "PublishDate": 1761898384697,
            "Source": "stock"
        },
        {
            "Title": "ACC Reports Strong Q2 Performance with EBITDA Nearly Doubling Year-over-Year",
            "Summary": "ACC reported Q2 EBITDA of 8.2 billion rupees compared to 4.29 billion rupees in the same quarter last year, representing a significant year-over-year increase. The company's EBITDA margin improved to 14% from 9.31% in the previous year's corresponding quarter, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1761896210051,
            "Source": "earnings"
        },
        {
            "Title": "ACC Limited Reports Strong Q2 Performance with Revenue Growth and Tax Reversals",
            "Summary": "ACC Limited announced its quarterly results for the period ended September 30, 2025. The company reported revenue from operations of ₹5,696.01 crore for the quarter. The company reversed tax provisions of ₹658.42 crore during the quarter based on favorable High Court decisions in similar matters. ACC also received cash refunds of ₹827.96 crore (including interest of ₹205.24 crore) pursuant to various tax orders. The company's subsidiary AMRL completed acquisitions of 15 companies during the previous year for land parcels intended for manufacturing facilities and mining operations. ACC settled an arbitration dispute by paying ₹27 crore and recognized a gain of ₹369.01 crore from land disposal at Thane. The company faces ongoing litigation with the Competition Commission of India involving penalties of ₹1,147.59 crore and ₹35.32 crore, with appeals pending before the Supreme Court and NCLAT respectively.",
            "Sentiment": "positive",
            "PublishDate": 1761896127174,
            "Source": "earnings"
        },
        {
            "Title": "ACC Reports Strong Q2 Performance with Revenue Up 26% and Net Profit Surges 370%",
            "Summary": "ACC reported quarterly revenue of 58 billion rupees compared to 46 billion rupees in the same period last year. The company's net profit increased significantly to 11 billion rupees from 2.34 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1761895730309,
            "Source": "earnings"
        },
        {
            "Title": "Adani Group Chairman Addresses Shareholders Following SEBI Dismissal of Hindenburg Allegations",
            "Summary": "Gautam Adani, Chairman of Adani Group, issued a letter to ACC Limited shareholders addressing the aftermath of Hindenburg's January 24, 2023 report and SEBI's recent dismissal of allegations against the group. Adani described the report as a challenge to Indian enterprises' global ambitions and stated that SEBI delivered an unequivocal verdict dismissing the allegations. During this period, the Adani portfolio showed significant growth with EBITDA rising from ₹57,205 Cr in FY23 to ₹89,806 Cr in FY25, representing 57% absolute growth and 25% two-year CAGR. Gross Block expanded from ₹4,12,318 Cr to ₹6,09,133 Cr, adding nearly ₹2 lakh Cr. The group commissioned India's first container transshipment port at Vizhinjam, added 6 GW of renewable capacity including the world's largest single-location renewable project at Khavda, and commissioned the world's largest copper smelter. Adani promised to strengthen governance standards, accelerate innovation and sustainability, and continue nation-building investments.",
            "Sentiment": "positive",
            "PublishDate": 1758694120751,
            "Source": "stock"
        },
        {
            "Title": "ACC Limited Releases Q1 FY26 Earnings Call Transcript",
            "Summary": "ACC Limited has published the transcript of its earnings conference call for the quarter ended June 30, 2025, on its website. The transcript is now available at www.acclimited.com following the analyst call held on July 31, 2025. The call covered unaudited financial results for both standalone and consolidated operations. The company notified stock exchanges BSE and NSE about the transcript availability, with ACC trading under scrip codes ACC and 500410 respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1754492253274,
            "Source": "earnings"
        },
        {
            "Title": "ACC Limited Reports Strong Q1 Performance with 20% Volume Growth and 53% EBITDA Jump",
            "Summary": "ACC Limited submitted an investor presentation for the quarter ended June 30, 2025, highlighting robust operational and financial performance. The company achieved its highest quarterly sales volume of 18.4 million tonnes, up 20% year-on-year, with revenue crossing Rs 10,000 crore mark (up 23% YoY). EBITDA reached Rs 1,961 crore, marking a 53% increase compared to the previous year. The company maintains a debt-free status with net worth of Rs 66,436 crore. Current cement capacity stands at 104.5 MTPA, with plans to reach 118 MTPA by March 2026. The company commissioned 57 MW wind power capacity, bringing total renewable energy capacity to 473 MW. ACC received approval from NCLT for the scheme of amalgamation with Adani Cementation Limited and was ranked as 'India's Most Trusted Cement Brand 2025' for the fourth consecutive year. The presentation was prepared for an analysts and institutional investors call scheduled for July 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753953728165,
            "Source": "earnings"
        },
        {
            "Title": "ACC Reports Mixed Q1 Results with Revenue Growth but Profit Below Estimates",
            "Summary": "ACC reported Q1 net profit of 3.9 billion rupees, up from 3.66 billion rupees year-over-year but falling short of the estimated 5.12 billion rupees. Revenue grew to 60 billion rupees from 51.3 billion rupees year-over-year, exceeding the estimate of 54.54 billion rupees. EBITDA increased to 7.7 billion rupees from 6.77 billion rupees year-over-year, though below the estimated 8.11 billion rupees. EBITDA margin declined to 12.74% from 13.02% year-over-year, missing the estimated 14.9%.",
            "Sentiment": "neutral",
            "PublishDate": 1753343541253,
            "Source": "earnings"
        },
        {
            "Title": "ACC Opens New Grinding Unit at Sindri Plant",
            "Summary": "ACC has opened a new grinding unit at its Sindri plant. The new unit has a capacity of 1.5 million tonnes per annum. This expansion increases the company's production capabilities and potentially its market presence in the region.",
            "Sentiment": "positive",
            "PublishDate": 1752063737000,
            "Source": "default"
        },
        {
            "Title": "ACC Group Sets Ambitious Cement Production Goal",
            "Summary": "The ACC Group Chair has announced that the company has achieved a milestone of producing 100 million tons of cement in a year. The Group has set a new target to reach 140 million tons of cement production by FY28.",
            "Sentiment": "positive",
            "PublishDate": 1750742938000,
            "Source": "default"
        },
        {
            "Title": "LIC Increases Stake in ACC to 8.582%",
            "Summary": "Life Insurance Corporation of India (LIC) has increased its stake in ACC Limited. The new stake held by LIC in ACC is now 8.582%. No further details about the transaction or the previous stake held by LIC were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1747829705000,
            "Source": "default"
        },
        {
            "Title": "ACC Ltd: Record Q4 Sales Volume, Dividend Declared",
            "Summary": "ACC Ltd reported its highest-ever quarterly sales volume of 11.9 mt, up 14% YoY. Q4 revenue increased 12% to ₹5,948.5 crore. Net profit slightly decreased by 1.7% to ₹735 crore. The company declared a dividend of ₹7.50 per share for FY 2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1745487715000,
            "Source": "earnings"
        },
        {
            "Title": "ACC Announces Dividend and Growth Outlook",
            "Summary": "ACC has declared a dividend of ₹7.5 per share and projects a growth outlook of 7-8% for FY'26. The company reported a 14% year-over-year increase in volume, supported by higher trade volumes and a 7 percentage point increase in premium product sales as a percentage of trade sales volume, maintaining market leadership.",
            "Sentiment": "positive",
            "PublishDate": 1745486297000,
            "Source": "result"
        },
        {
            "Title": "ACC Reports Mixed Q4 Results with Revenue Growth but Margin Decline",
            "Summary": "ACC, a cement company, has reported its Q4 financial results. The company's revenue increased to 60 billion rupees from 54 billion rupees year-over-year, showing growth. However, EBITDA slightly decreased to 8 billion rupees from 8.37 billion rupees in the same period last year. The EBITDA margin also declined to 13.47% from 15.51% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1745485498000,
            "Source": "result"
        },
        {
            "Title": "ACC Reports Slight Decline in Q4 Net Profit",
            "Summary": "ACC, a cement manufacturer, reported a net profit of 7.4 billion rupees for the fourth quarter, compared to 7.5 billion rupees in the same period last year, indicating a marginal year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1745485151000,
            "Source": "result"
        },
        {
            "Title": "ACC Reports Record Quarterly Volume Growth of 21% YoY",
            "Summary": "ACC, a cement manufacturer, has reported its highest ever quarterly volume growth. The company achieved a 21% year-over-year increase in volume, reaching 10.7 million tonnes. This performance marks a significant milestone for ACC, indicating strong demand and operational efficiency in the cement sector.",
            "Sentiment": "positive",
            "PublishDate": 1737965881000,
            "Source": "earnings"
        },
        {
            "Title": "ACC Reports Significant Increase in Q3 Other Income and Government Grants",
            "Summary": "ACC Limited has reported a substantial year-over-year increase in its third-quarter other income, rising from 840 million to 6.4 billion. Additionally, the company's government grants, including duty, have seen a significant jump from 591 million to 7.2 billion compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1737965272000,
            "Source": "earnings"
        },
        {
            "Title": "ACC Reports Q3 Revenue Increase",
            "Summary": "ACC Limited has reported a revenue of 51.76 billion rupees for the third quarter, showing an increase from 49.2 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1737965123000,
            "Source": "earnings"
        },
        {
            "Title": "ACC Reports Improved Q3 EBITDA and Margin",
            "Summary": "ACC, a cement manufacturing company, has reported a significant increase in its Q3 EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization). The EBITDA rose to 11.10 billion rupees from 9 billion rupees in the same quarter last year. Additionally, the company's EBITDA margin improved to 18.83% from 18.36% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1737965117000,
            "Source": "earnings"
        },
        {
            "Title": "ACC Reports Significant Increase in Q3 Net Profit",
            "Summary": "ACC Limited, a prominent cement manufacturer, has reported a substantial year-over-year increase in its third-quarter net profit. The company's net profit rose to 10.9 billion rupees, up from 5.3 billion rupees in the same quarter of the previous year. This represents a more than doubling of the company's net profit, indicating strong financial performance for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737965049000,
            "Source": "earnings"
        },
        {
            "Title": "ACC to Consider Q3 Results on January 27",
            "Summary": "ACC Limited, a prominent cement manufacturer, has announced that it will consider and approve its financial results for the third quarter on January 27. This announcement indicates the company's adherence to regular financial reporting practices and transparency with shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1737385554000,
            "Source": "earnings"
        },
        {
            "Title": "ACC Ltd: Shares Trade Marginally Higher Amid Market Volatility",
            "Summary": "ACC Ltd shares traded at Rs 1987.90 on BSE, up 0.02% from the previous close. The stock saw a gap up opening but faced volatility. ACC's market value stood at Rs 37241.03 crore. The stock's P/E ratio was 18.22, with a price-to-book value of 2.87.",
            "Sentiment": "neutral",
            "PublishDate": 1737093425000,
            "Source": "normal_news"
        },
        {
            "Title": "ACC Ltd: Shares Rise 1.94% Amid Broader Market Decline",
            "Summary": "ACC Ltd shares increased by 1.94% to Rs 1893.80 in Monday's trade, despite the Nifty falling. The stock hit an intraday high of Rs 1922.45 and low of Rs 1883.00. Trading volume was 10,446 shares with a value of Rs 1.98 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1736752457000,
            "Source": "normal_news"
        },
        {
            "Title": "CLSA Rates ACC as Outperform with Target Price of ₹2,580",
            "Summary": "CLSA, a global investment firm, has given ACC Limited an 'Outperform' rating with a target price of ₹2,580. This rating suggests that CLSA analysts expect ACC's stock to perform better than the market average in the near future.",
            "Sentiment": "positive",
            "PublishDate": 1736308157000,
            "Source": "normal_news"
        },
        {
            "Title": "ACC Ltd: Shares Rise Amid Market Decline",
            "Summary": "ACC Ltd shares increased 0.61% to Rs 2128.90 despite overall market decline. The stock saw a trading volume of 3,968 shares with a value of Rs 0.84 crore. ACC's P/E ratio stands at 19.49, with promoters holding 50.05% stake as of September 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1734675881000,
            "Source": "normal_news"
        },
        {
            "Title": "ACC Ltd: Shares Decline 2.15% in Wednesday's Trade",
            "Summary": "ACC Ltd shares fell 2.15% to Rs 2153.40 on Wednesday, trading below both 50-day and 200-day moving averages. The stock's MACD signaled a bearish trend.",
            "Sentiment": "negative",
            "PublishDate": 1734505733000,
            "Source": "normal_news"
        },
        {
            "Title": "ACC Ltd: Stock Declines 1.79% in Wednesday's Trading",
            "Summary": "ACC Ltd shares fell 1.79% to Rs 2153.95 during Wednesday's trading session, with a high of Rs 2181.30 and a low of Rs 2095.10. Technical indicators suggest a bearish trend, with the stock trading below its 50-DMA and 200-DMA.",
            "Sentiment": "negative",
            "PublishDate": 1732689184000,
            "Source": "normal_news"
        },
        {
            "Title": "ACC Clarifies No Allegations Against Company in US Indictments",
            "Summary": "ACC (Associated Cement Companies) has issued a statement declaring that there are no allegations against the company in recent US indictments. This announcement appears to be in response to potential concerns or speculation about the company's involvement in some legal matters in the United States.",
            "Sentiment": "neutral",
            "PublishDate": 1732179093000,
            "Source": "normal_news"
        },
        {
            "Title": "ACC: Shares Rise 1.44% Amid Market Decline",
            "Summary": "ACC Ltd. shares increased 1.44% to Rs 2325.30 in Thursday's trade, reaching an intraday high of Rs 2362.40. The stock's trading volume was 4,157 shares with a value of Rs 0.97 crore. ACC's P/E ratio stands at 21.33, with promoters holding 50.05% stake as of September 30, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1730967965000,
            "Source": "normal_news"
        },
        {
            "Title": "ACC Ltd: Share Price Rises 1.86% Amid Market Fluctuations",
            "Summary": "ACC Ltd shares increased by 1.86% to Rs 2370.80 in Wednesday's trading. The stock experienced a high of Rs 2374.90 and a low of Rs 2306.90. Trading volume and turnover were modest. The company's recent quarterly results showed a 48.52% increase in net profit compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730265742000,
            "Source": "normal_news"
        },
        {
            "Title": "ACC: Share Price Drops 1.83% Amid Market Decline",
            "Summary": "ACC Ltd.'s share price fell 1.83% to Rs 2223.95 during Friday's trading session as the Sensex dropped 733.77 points. The stock traded with a volume of 12:43PM shares and a turnover of Rs 1.68 crore on BSE.",
            "Sentiment": "negative",
            "PublishDate": 1729840395000,
            "Source": "normal_news"
        },
        {
            "Title": "ACC Reports Strong Q2 Volume Growth",
            "Summary": "ACC, a cement manufacturing company, has reported a 15% volume growth in the second quarter, significantly exceeding market estimates of 6%.",
            "Sentiment": "positive",
            "PublishDate": 1729757206000,
            "Source": "result"
        },
        {
            "Title": "ACC: Q2 Profit Plunges 48% Despite Revenue Growth",
            "Summary": "ACC Ltd reported a 48% YoY drop in Q2 consolidated net profit to Rs 200 crore, while revenue increased 4% to Rs 4,614 crore. Sales volume grew 15% YoY to 9.3 million tons. The company achieved a 15% reduction in kiln fuel cost due to an optimized fuel basket and improved coal consumption.",
            "Sentiment": "neutral",
            "PublishDate": 1729757167000,
            "Source": "result"
        },
        {
            "Title": "ACC Q2 EBITDA Falls Short of Estimates",
            "Summary": "ACC reported Q2 EBITDA of 4.29 billion rupees, below the estimated 4.57 billion and down from 5.4 billion year-over-year. The EBITDA margin was 9.31%, lower than the estimated 10.7% and last year's 12.37%.",
            "Sentiment": "negative",
            "PublishDate": 1729756548000,
            "Source": "result"
        }
    ]
}