{
    "Symbol": "ACCELYA",
    "ISIN": "INE793A01012",
    "News": [
        {
            "Title": "Accelya Transfers 920 Shares to IEPF Authority",
            "Summary": "Accelya Solutions India Limited has transferred 920 equity shares from 19 shareholders to the IEPF Authority under Section 124(6) of Companies Act 2013 for unclaimed dividends over seven consecutive years.",
            "Sentiment": "neutral",
            "PublishDate": 1770826822858,
            "Source": "co_actions_results"
        },
        {
            "Title": "Accelya Solutions Q3FY26 Results: Revenue ₹131.18 Cr",
            "Summary": "Accelya Solutions India reported Q3FY26 standalone revenue of ₹131.18 crores vs ₹124.26 crores YoY. Net profit declined to ₹13.21 crores from ₹30.93 crores due to exceptional item of ₹11.72 crores.",
            "Sentiment": "negative",
            "PublishDate": 1769691058001,
            "Source": "co_actions_results"
        },
        {
            "Title": "Accelya Solutions Reports Q2 Consolidated Revenue of Rs 1,362 Million, Net Profit Declines to Rs 296 Million",
            "Summary": "Accelya Solutions India Limited reported consolidated operating income of Rs 1,362.01 million for the quarter ended September 2025, up from Rs 1,317.32 million in the previous quarter. However, consolidated profit after tax declined to Rs 296.13 million compared to Rs 339.46 million in the June 2025 quarter. On a standalone basis, the company recorded revenue of Rs 1,335.92 million and profit after tax of Rs 286.70 million for the September quarter. The company operates in the travel and transportation vertical, providing financial and commercial solutions to the airline and travel industry. Basic earnings per share on a consolidated basis stood at Rs 19.84 for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762367390114,
            "Source": "earnings"
        },
        {
            "Title": "Accelya Solutions Reports Growth in Q1 Financial Performance",
            "Summary": "Accelya Solutions reported quarterly EBITDA of 512 million rupees compared to 477 million rupees year-over-year, with EBITDA margin improving to 38.87% from 37.22%. The company's consolidated net profit increased to 339 million rupees from 312 million rupees year-over-year. Revenue grew to 1.3 billion rupees from 1.28 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1753971675815,
            "Source": "earnings"
        },
        {
            "Title": "Accelya Solutions India Reports Strong Financial Results and Recommends Rs 40 Final Dividend",
            "Summary": "Accelya Solutions India Limited announced its audited financial results for the quarter and year ended June 30, 2025. The company reported consolidated operating income of Rs 1,317.32 million for the quarter ended June 2025, compared to Rs 1,366.86 million for the quarter ended March 2025. Consolidated profit after tax stood at Rs 339.46 million versus Rs 302.45 million in the previous quarter. On a standalone basis, the company recorded revenue from operations of Rs 45,305.76 lakhs for the year ended June 30, 2025, compared to Rs 50,123.32 lakhs in the previous year. The Board of Directors recommended a final dividend of Rs 40 per equity share for financial year 2024-25, subject to shareholder approval at the Annual General Meeting. The record date for dividend eligibility is set for Friday, October 24, 2025, with payout scheduled for Thursday, November 27, 2025. The company also appointed Nilesh A. Pradhan & Co. LLP as Secretarial Auditors for five consecutive years from 2025-26 to 2029-30.",
            "Sentiment": "positive",
            "PublishDate": 1753971632062,
            "Source": "corporate_action"
        },
        {
            "Title": "Accelya Solutions India Reports Q4 FY2023 Financial Results",
            "Summary": "Accelya Solutions India announced its Q4 financial results. The company reported a consolidated net profit of 302 million rupees, a significant increase from 2 million rupees in the same quarter last year and 324 million rupees in the previous quarter. Revenue for Q4 stood at 1.37 billion rupees, up from 1.31 billion rupees year-over-year. The company's profit before tax (PBT) was 417 million rupees, down from 454 million rupees in the previous year. It's worth noting that the company had an exceptional item of 336 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1745540088000,
            "Source": "default"
        },
        {
            "Title": "Accelya Solutions India Reports Q4 Financial Results",
            "Summary": "Accelya Solutions India has released its Q4 financial results. The company reported a net profit of 302 million rupees, compared to 2 million rupees in the same quarter last year. Revenue increased to 1.37 billion rupees from 1.31 billion rupees year-over-year. However, EBITDA decreased to 464 million rupees from 503 million rupees, with EBITDA margin dropping to 33.98% from 38.41%. The company's profit before tax (PBT) also declined to 417 million rupees from 454 million rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1745504171000,
            "Source": "result"
        },
        {
            "Title": "Accelya Solutions India Reports Cybersecurity Incident",
            "Summary": "Accelya Solutions India has disclosed a cybersecurity incident involving unlawful access to their computer systems in India. The company has stated that no operational disruption has been reported. External cybersecurity experts have been engaged to assist in the investigation of the incident.",
            "Sentiment": "neutral",
            "PublishDate": 1743466464000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Accelya Solutions India Reports Cybersecurity Incident",
            "Summary": "Accelya Solutions India has reported a cybersecurity incident involving unlawful access to their computer systems in India. The company states that no operational disruption has been reported. External cybersecurity experts have been engaged to assist in the investigation of the incident.",
            "Sentiment": "neutral",
            "PublishDate": 1743162819000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Accelya Solutions India: Q2 Profit Rises 4.62% YoY, Revenue Up 6.76%",
            "Summary": "Accelya Solutions India reported Q2 FY25 results with profit at ₹32.36 crore, up 4.62% YoY, and revenue at ₹133.18 crore, up 6.76% YoY. The company announced an interim dividend of ₹50.00 with a record date of 30 Jan, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1737695925000,
            "Source": "earnings"
        },
        {
            "Title": "Accelya Solutions Reports Q3 Financial Results and Declares Dividend",
            "Summary": "Accelya Solutions has announced its Q3 consolidated financial results. The company reported a net profit of 324 million rupees, up from 309 million rupees in the same quarter last year. Revenue increased to 1.33 billion rupees from 1.25 billion rupees year-over-year. Additionally, the company has declared a dividend of 50 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1737591216000,
            "Source": "earnings"
        },
        {
            "Title": "Accelya Solutions Declares Dividend of 50 Rupees per Share",
            "Summary": "Accelya Solutions has announced a dividend of 50 rupees per share for its shareholders. This corporate action represents a significant return of value to the company's investors.",
            "Sentiment": "positive",
            "PublishDate": 1737546064000,
            "Source": "corporate_action"
        },
        {
            "Title": "Accelya Solutions Reports Improved Q3 EBITDA and Margin",
            "Summary": "Accelya Solutions has reported an increase in its Q3 EBITDA to 510 million rupees, up from 459 million rupees in the same quarter last year. The company's EBITDA margin also improved, rising to 38.33% from 36.78% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1737545105000,
            "Source": "earnings"
        },
        {
            "Title": "Accelya Solutions Reports Increase in Q3 Net Profit and Revenue",
            "Summary": "Accelya Solutions has announced its Q3 financial results. The company's consolidated net profit rose to 324 million rupees, up from 309 million rupees in the same quarter last year. Revenue also increased to 1.33 billion rupees, compared to 1.25 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737545097000,
            "Source": "earnings"
        },
        {
            "Title": "Accelya Solutions Reports Q2 EBITDA and Margin",
            "Summary": "Accelya Solutions has reported its Q2 EBITDA as 485.5 million rupees, compared to 493 million rupees in the same quarter last year. The company's Q2 EBITDA margin is 38.19%, down from 38.74% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1729087904000,
            "Source": "result"
        },
        {
            "Title": "Accelya Solutions Reports Stable Q2 Revenue",
            "Summary": "Accelya Solutions has reported Q2 revenue of 1.3 billion rupees, which remains unchanged compared to both the previous year (YoY) and the previous quarter (QoQ).",
            "Sentiment": "neutral",
            "PublishDate": 1729087895000,
            "Source": "result"
        },
        {
            "Title": "Accelya Solutions Reports Q2 Net Profit Increase",
            "Summary": "Accelya Solutions has announced its Q2 consolidated net profit, which stands at 325 million rupees. This represents a year-over-year increase from 315 million rupees and a quarter-over-quarter increase from 312 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1729087879000,
            "Source": "result"
        },
        {
            "Title": "SEBI Issues Administrative Warning to Accelya Solutions India",
            "Summary": "<p>Accelya Solutions India has received an <span class='negative'>administrative warning letter</span> from the <b>Securities and Exchange Board of India (SEBI)</b>. The warning was issued due to a <span class='negative'>significant delay</span> in <span class='neutral'>updating the company's policy</span> for determining materiality.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728646739000,
            "Source": "corporate_action"
        },
        {
            "Title": "Accelya Solutions Schedules Q2 Results Board Meeting",
            "Summary": "<p>Accelya Solutions has announced a <span class='neutral'>board meeting</span> to be held on <b>October 16</b> to <span class='neutral'>consider and approve</span> the company's <span class='neutral'>financial results</span> for the <b>second quarter</b>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1727977388000,
            "Source": "corporate_action"
        }
    ]
}