{
    "Symbol": "ACE",
    "ISIN": "INE731H01025",
    "News": [
        {
            "Title": "ACE Shares Q3FY26 Conference Call Audio Recording",
            "Summary": "Action Construction Equipment Limited provides audio recording link for its Q3FY-2026 conference call held on February 04, 2026, in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770264202220,
            "Source": "co_actions_results"
        },
        {
            "Title": "Action Construction Equipment Plans Product Expansion",
            "Summary": "Action Construction Equipment announces strategic expansion into new product lines including piling rigs, reach stackers, and larger construction equipment, with potential PLI scheme support.",
            "Sentiment": "positive",
            "PublishDate": 1770261801230,
            "Source": "stocks"
        },
        {
            "Title": "Action Construction Equipment Expects Flat Revenue",
            "Summary": "Action Construction Equipment anticipates flat revenue for the current year while projecting improved profit margins compared to the previous year, indicating operational efficiency gains.",
            "Sentiment": "neutral",
            "PublishDate": 1770261556380,
            "Source": "stocks"
        },
        {
            "Title": "Action Construction Equipment Sets Ambitious Margin Targets",
            "Summary": "Action Construction Equipment plans to boost agricultural segment EBIT margins from 4-5% to 12-15% while targeting steady-state EBITDA margins of 18-19% including other income post BS-V norms implementation.",
            "Sentiment": "positive",
            "PublishDate": 1770261533118,
            "Source": "stocks"
        },
        {
            "Title": "Action Construction Equipment Eyes ₹6,000-7,000 Cr Revenue",
            "Summary": "Action Construction Equipment expects flat revenue this year despite lower unit sales but anticipates better profits. Company targets ₹6,000-7,000 crores revenue by FY29-30.",
            "Sentiment": "neutral",
            "PublishDate": 1770261481759,
            "Source": "stocks"
        },
        {
            "Title": "Action Construction Equipment Q3 Net Profit Rises",
            "Summary": "Action Construction Equipment reports net profit of ₹1.16 billion in Q3, marking growth from ₹1.10 billion in the same quarter last year, representing a year-on-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1770117333964,
            "Source": "co_actions_results"
        },
        {
            "Title": "ACE schedules Q3FY26 results call for Feb 4, 2026",
            "Summary": "Action Construction Equipment Limited has scheduled a conference call on February 04, 2026 at 04:00 PM IST to discuss Q3FY26 results, following the announcement on February 03, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769662622435,
            "Source": "co_actions_results"
        },
        {
            "Title": "ACE Board Meet on Feb 3 for Q3FY26 Results",
            "Summary": "Action Construction Equipment Limited has scheduled a board meeting on February 3, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768988677186,
            "Source": "co_actions_results"
        },
        {
            "Title": "ACE Partners With Sanghvi For Heavy Crane Production",
            "Summary": "Action Construction Equipment signs MOU with Sanghvi Movers to manufacture heavy cranes locally, supporting domestic manufacturing and reducing import dependency under Make in India initiative.",
            "Sentiment": "positive",
            "PublishDate": 1765428966262,
            "Source": "co_actions_results"
        },
        {
            "Title": "Action Construction Equipment Reports Rs 103.87 Crore Profit for September Quarter",
            "Summary": "Action Construction Equipment Limited reported a profit after tax of Rs 103.87 crore for the quarter ended September 30, 2025, compared to Rs 94.37 crore in the previous quarter. Revenue from operations stood at Rs 749.47 crore for the quarter. The company's Board of Directors approved the unaudited financial results in a meeting held on November 6, 2025. For the six-month period ended September 30, 2025, the company achieved a profit of Rs 198.24 crore with revenue of Rs 1,393.08 crore. The company operates in two main segments: Cranes, Material Handling and Construction Equipment, and Agriculture Equipment. During the quarter, the company issued Rs 3,500 lakhs of commercial paper with a three-month tenure.",
            "Sentiment": "positive",
            "PublishDate": 1762430653191,
            "Source": "earnings"
        },
        {
            "Title": "DGTR Imposes Anti-Dumping Duty on Crane Imports from China, Germany, and Singapore",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has imposed anti-dumping duties on crane imports from China, Germany, and Singapore. This development relates to Action Construction Equipment, which operates in the construction equipment sector.",
            "Sentiment": "neutral",
            "PublishDate": 1758511116357,
            "Source": "stock"
        },
        {
            "Title": "Action Construction Equipment Reports Mixed Q1 FY26 Results with Revenue Decline but Margin Expansion",
            "Summary": "Action Construction Equipment Limited reported Q1 FY26 standalone results showing total income of Rs 703 crores, down 7.63% year-on-year. Despite the revenue decline, the company achieved significant margin improvements with EBITDA rising 13.6% to Rs 142.55 crores and EBITDA margin expanding to 20.28%, up 300 basis points. PAT increased 15.67% to Rs 96.83 crores with PAT margin improving to 13.77%. The revenue decline was attributed to subdued demand due to pre-buying in previous quarters, early monsoon onset, and implementation of CEV Stage V emission norms. The company implemented price increases of 7-12% across product categories. The cranes and construction equipment segment saw revenue drop to Rs 605.43 crores from Rs 690 crores, while agricultural equipment grew 8.26% to Rs 46.51 crores. Management expects market normalization from Q2 FY26 onwards and aims to expand export business to 6-7% of revenues. The company targets doubling revenues to Rs 4,400 crores by FY27 and tripling to Rs 6,600 crores by FY29.",
            "Sentiment": "neutral",
            "PublishDate": 1755596463449,
            "Source": "earnings"
        },
        {
            "Title": "ACE Stock Drops 12% Following Weak Quarterly Performance",
            "Summary": "Action Construction Equipment's stock fell 12% after announcing quarterly results. The company's revenue declined 27.5% sequentially to ₹703.2 crore, while EBITDA dropped 16.4% to ₹143.9 crore. However, margins improved by 271 basis points to 20.46%. The company attributed the revenue decline to CEV stage 5 emission norms adoption, early monsoons, and global uncertainties. Management expects market normalization from the third quarter onwards. The stock was trading 6.54% lower at ₹943 and has declined 20% over the past month.",
            "Sentiment": "negative",
            "PublishDate": 1754987603441,
            "Source": "earnings"
        },
        {
            "Title": "Action Construction Delays Growth Targets Due to Market Conditions",
            "Summary": "Action Construction has postponed its growth forecast until the end of Q2 due to current market conditions. The company has delayed its revenue doubling target to INR 4,400 crores by FY27 and now aims to triple FY23 revenues to INR 6,600 crores by FY29.",
            "Sentiment": "negative",
            "PublishDate": 1754968780683,
            "Source": "stock"
        },
        {
            "Title": "Action Construction Equipment Shares Audio Link for Q1FY-2026 Conference Call",
            "Summary": "Action Construction Equipment Limited provided an audio recording link for their Q1FY-2026 conference call meeting held on August 11, 2025. The company shared the audio clip link (https://ccreservations.com/recordings/data/10035217.mp3) with BSE and NSE stock exchanges. The communication was signed by Company Secretary Anil Kumar.",
            "Sentiment": "neutral",
            "PublishDate": 1754929239211,
            "Source": "earnings"
        },
        {
            "Title": "ACE Reports Q1 EBITDA of 928M Rupees with Improved Margin",
            "Summary": "ACE reported Q1 EBITDA of 928 million rupees compared to 986 million rupees in the same period last year, representing a year-over-year decline. However, the company's EBITDA margin improved to 14.24% from 13.43% in the previous year's corresponding quarter, indicating better operational efficiency despite lower absolute earnings.",
            "Sentiment": "neutral",
            "PublishDate": 1754653644455,
            "Source": "earnings"
        },
        {
            "Title": "Action Construction Equipment Reports 16% Jump in Quarterly Profit to ₹97.7 Crores",
            "Summary": "Action Construction Equipment Limited reported a consolidated profit after tax of ₹97.7 crores for the quarter ended June 30, 2025, compared to ₹84.2 crores in the same period last year, marking a 16% increase. Revenue from operations declined to ₹652 crores from ₹734 crores year-over-year. The company's cranes and construction equipment segment generated ₹606 crores in revenue while agriculture equipment contributed ₹49 crores. Basic earnings per share increased to ₹8.21 from ₹7.07 in the previous year quarter. The board recommended a final dividend of ₹2 per equity share for the financial year ended March 2025. The company issued commercial papers worth ₹35 crores during the quarter and granted 35,661 employee stock options.",
            "Sentiment": "positive",
            "PublishDate": 1754651875973,
            "Source": "earnings"
        },
        {
            "Title": "Action Construction Equipment Invests in Hexa Energy HR1 for Solar Power",
            "Summary": "Action Construction Equipment has made an investment in Hexa Energy HR1 as part of a solar power initiative. The news indicates a move towards renewable energy by the construction equipment company, though specific details about the investment amount or project scope are not provided in the given headline.",
            "Sentiment": "positive",
            "PublishDate": 1752157010000,
            "Source": "default"
        },
        {
            "Title": "Action Construction Equipment Reports Q4 Results and Dividend",
            "Summary": "Action Construction Equipment announced its Q4 financial results and dividend recommendation. The company's Q4 EBITDA increased to 1.6 billion rupees from 1.3 billion rupees year-over-year, with EBITDA margin improving to 16.99% from 15.5%. Net profit rose to 1.2 billion rupees from 981.5 million rupees year-over-year and 1.1 billion rupees quarter-on-quarter. Q4 revenue grew to 9.6 billion rupees from 8.36 billion rupees year-over-year. The company also recommended a dividend of 2 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748262679000,
            "Source": "result"
        },
        {
            "Title": "India Signs Contracts Worth INR 6.97 Billion with ACE and JCB India",
            "Summary": "The Indian government has entered into contracts valued at INR 6.97 billion (approximately $84 million) with two companies: ACE and JCB India. This information comes from an official announcement by the Press Information Bureau (PIB) of India. The contracts likely involve the procurement of equipment or services from these companies, though specific details are not provided in the brief news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1740043769000,
            "Source": "order&deals"
        },
        {
            "Title": "Action Construction Launches India's First Fully Electric Construction Equipment",
            "Summary": "Action Construction Equipment has become the first company in India to introduce fully electric construction equipment. The company is currently awaiting the government's finalization of CMVR (Central Motor Vehicles Rules) guidelines for such products. This development was shared during a company conference call.",
            "Sentiment": "positive",
            "PublishDate": 1739243661000,
            "Source": "corporate_action"
        },
        {
            "Title": "Action Construction Equipment Expands Capacity to Rs 5,000 Crore",
            "Summary": "Action Construction Equipment (ACE) has announced that its capital expenditure plans are on track. The company is currently undergoing an expansion that will increase its total production capacity to approximately Rs 5,000 crore by the end of the fourth quarter of the current fiscal year. This information was shared during a company conference call.",
            "Sentiment": "positive",
            "PublishDate": 1739243566000,
            "Source": "corporate_action"
        },
        {
            "Title": "Action Construction Reaffirms Medium-Term Growth Targets",
            "Summary": "Action Construction has reiterated its medium-term guidance, aiming to double its FY23 achievements by FY26. The company plans to maintain its current EBITDA margins, with potential for slight expansion due to operating leverage and pricing strategies.",
            "Sentiment": "positive",
            "PublishDate": 1739243497000,
            "Source": "corporate_action"
        },
        {
            "Title": "ACE Reiterates Growth Guidance for Cranes Segment, Expects Flat Performance in Agri Segment",
            "Summary": "ACE has reiterated its guidance of approximately 16% or higher growth in its Cranes, Material Handling & Construction Equipment segment for the current year. However, the company expects its Agri segment to remain relatively flat during the same period. This information was shared during a company conference call.",
            "Sentiment": "neutral",
            "PublishDate": 1739243395000,
            "Source": "earnings"
        },
        {
            "Title": "Action Construction Equipment to Receive Major Defense Order",
            "Summary": "Action Construction Equipment (ACE) is reportedly on the verge of securing one of its largest defense orders to date, according to NDTV Profit. This development suggests a significant expansion of ACE's operations in the defense sector, potentially boosting the company's revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1739168764000,
            "Source": "order&deals"
        },
        {
            "Title": "Action Construction Equipment Reports Strong Q3 Financial Results",
            "Summary": "Action Construction Equipment has announced its financial results for the third quarter. The company's net profit increased to 1.1 billion rupees, up from 885 million rupees in the same period last year. Revenue also saw growth, reaching 8.7 billion rupees compared to 7.5 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739146469000,
            "Source": "earnings"
        },
        {
            "Title": "ACTION CONSTRUCTION EQUIPMENT Reports Improved Q3 EBITDA and Margin",
            "Summary": "ACTION CONSTRUCTION EQUIPMENT has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 1.31 billion rupees from 1.03 billion rupees in the same quarter last year. Additionally, the EBITDA margin improved to 14.95% from 13.67% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738931335000,
            "Source": "earnings"
        },
        {
            "Title": "Action Construction Equipment Reports Strong Q3 Financial Results",
            "Summary": "Action Construction Equipment has announced its financial results for the third quarter. The company's net profit increased to 1.1 billion rupees, up from 885 million rupees in the same period last year. Revenue also saw growth, rising to 8.7 billion rupees from 7.5 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738931329000,
            "Source": "earnings"
        },
        {
            "Title": "Action Construction Equipment Unveils New Backhoe Loader and EV Crane",
            "Summary": "Action Construction Equipment (ACE) has launched two new products at the Bauma Conexpo 2024. The company introduced its new BS-V(CE-V) AX124 Backhoe Loader, showcasing advancements in construction equipment. Additionally, ACE unveiled the first 100% Make in India electric crane, marking a significant step in the company's product line and commitment to domestic manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1734060990000,
            "Source": "corporate_action"
        },
        {
            "Title": "Action Construction Equipment: Confident of 15%+ Revenue Growth in FY2024-25",
            "Summary": "Action Construction Equipment's Executive Director Sorab Agarwal expresses confidence in achieving 15%+ revenue growth for FY2024-25. The company reported 14.6% YoY revenue growth in Q2. Agarwal cites favorable product mix, strong second-half performance, and improved market conditions post-elections as key drivers. The company's order book and export scenario are improving.",
            "Sentiment": "positive",
            "PublishDate": 1732592752000,
            "Source": "earnings"
        },
        {
            "Title": "ACTION CONSTRUCTION EQUIPMENT Reports Strong Q2 Financial Results",
            "Summary": "ACTION CONSTRUCTION EQUIPMENT has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 1.08 billion rupees from 891 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 14.32% from 13.26% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731058596000,
            "Source": "result"
        },
        {
            "Title": "Action Construction Equipment Reports Q2 Revenue Growth",
            "Summary": "Action Construction Equipment has reported a revenue of 7.5 billion rupees for the second quarter, compared to 6.7 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731058578000,
            "Source": "result"
        },
        {
            "Title": "Action Construction Equipment Reports 28% Increase in Q2 Net Profit",
            "Summary": "Action Construction Equipment Ltd. has announced its financial results for the second quarter, reporting a net profit of 944 million rupees. This represents a significant increase from the 737 million rupees reported in the same quarter of the previous year, marking a year-over-year growth of approximately 28%.",
            "Sentiment": "positive",
            "PublishDate": 1731058557000,
            "Source": "result"
        },
        {
            "Title": "Block Trade: ACTION CONSTRUCTION EQUIPMENT Shares",
            "Summary": "<p>A <span class='neutral'>significant block trade</span> occurred for <b>ACTION CONSTRUCTION EQUIPMENT LTD</b> on the NSE. Approximately <span class='neutral'>153,238 shares</span> were traded at a price of <span class='neutral'>Rs. 1357.70</span> per share, totaling <span class='neutral'>Rs. 20.81 Crores</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728014030000,
            "Source": "block_deals"
        },
        {
            "Title": "Anti-Dumping Investigation Initiated on Chinese Crane Imports",
            "Summary": "<p>An <span class='negative'>anti-dumping investigation</span> has been launched concerning the import of '<span class='neutral'>certain cranes</span>' from <b>China</b>. This investigation is based on an application filed by <b>Action Construction Equipment</b>, alleging <span class='negative'>dumping practices</span> and resulting <span class='negative'>harm</span> to the <span class='positive'>domestic industry</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1727946857000,
            "Source": "corporate_action"
        }
    ]
}