{
    "Symbol": "ACI",
    "ISIN": "INE128X01021",
    "News": [
        {
            "Title": "Archean Chemical Q3 FY26 Results Show Mixed Performance",
            "Summary": "Archean Chemical Industries reported 10% consolidated revenue growth in Q3 FY26 to INR2,615 million, but EBITDA declined 27% to INR698.6 million on standalone basis due to operational challenges in bromine production.",
            "Sentiment": "neutral",
            "PublishDate": 1770786038989,
            "Source": "co_actions_results"
        },
        {
            "Title": "Archean Chemical Signs MOU with Gujarat Govt",
            "Summary": "Archean Chemical Industries Limited signed MOU with Government of Gujarat on January 30, 2026 for development of captive salt jetty with throughput of 7 MMTPA along Gujarat coastline.",
            "Sentiment": "positive",
            "PublishDate": 1770733416374,
            "Source": "co_actions_results"
        },
        {
            "Title": "Archean Chemical Industries Board Meet on Feb 4",
            "Summary": "Archean Chemical Industries Limited has scheduled a board meeting for February 04, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769749243165,
            "Source": "co_actions_results"
        },
        {
            "Title": "Archean Chemical: Promoter Pledges 9.5L Shares",
            "Summary": "Chemikas Speciality LLP pledged 9,50,000 equity shares of Archean Chemical Industries as collateral for loans with Bajaj Financial Securities, increasing total pledged shares to 70,50,000.",
            "Sentiment": "neutral",
            "PublishDate": 1769582730824,
            "Source": "co_actions_results"
        },
        {
            "Title": "Archean Chemical Industries Extends ₹150 Cr Loan",
            "Summary": "Archean Chemical Industries provides ₹150 crore loan to wholly owned subsidiary Neun Infra for semiconductor project funding, supporting machinery procurement ahead of government fiscal agreement.",
            "Sentiment": "positive",
            "PublishDate": 1766213710514,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chemikas Speciality LLP Pledges 3.66 Lakh Shares in Archean Chemical Industries",
            "Summary": "Chemikas Speciality LLP disclosed the pledging of 3,66,666 equity shares of Archean Chemical Industries Limited under SEBI takeover regulations. The disclosure was made to BSE and NSE exchanges with details of total pledged shares provided in attached annexure.",
            "Sentiment": "neutral",
            "PublishDate": 1764744680157,
            "Source": "corporate_action"
        },
        {
            "Title": "Archean Chemical Reports Mixed Q2 Results, Receives Semiconductor Mission Approval",
            "Summary": "Archean Chemical Industries reported Q2 FY26 revenue of INR 2,317.8 million (8% decline YoY) with bromine production challenges due to technical issues and prolonged monsoons, while achieving a major milestone with India Semiconductor Mission approval for its INR 2,067 crore SiC project. The company maintained healthy EBITDA margins at 33% and remains net debt-free, with H1 FY26 revenue growing 10% to INR 5,232 million despite operational headwinds in core bromine and industrial salt businesses.",
            "Sentiment": "neutral",
            "PublishDate": 1763732232535,
            "Source": "earnings"
        },
        {
            "Title": "Chemikas Speciality LLP Pledges 48 Lakh Shares of Archean Chemical Industries",
            "Summary": "Chemikas Speciality LLP has pledged 48,00,000 equity shares of Archean Chemical Industries Limited under SEBI takeover regulations. The disclosure affects the shareholding pattern and encumbrance status of the promoter entity in the listed chemical company.",
            "Sentiment": "neutral",
            "PublishDate": 1763534668871,
            "Source": "corporate_action"
        },
        {
            "Title": "Archaean Chemical Subsidiary Begins Construction of Silicon Carbide Semiconductor Facility in Bhubaneswar",
            "Summary": "Archaean Chemical's subsidiary Sicsem Private Limited conducted a groundbreaking ceremony for a Silicon Carbide compound semiconductor fab and ATMP unit in Info Valley, Bhubaneswar, Odisha. The facility is scheduled to commence operations in November 2025, marking the company's expansion into semiconductor manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1763391866125,
            "Source": "earnings"
        },
        {
            "Title": "Archean Chemical Industries Reports Q2 Loss, Faces Income Tax Investigation",
            "Summary": "Archean Chemical Industries posted a net loss of Rs 3,846.27 lakhs for the quarter ended September 30, 2025, compared to a profit of Rs 2,186.69 lakhs in the same period last year, with revenue declining to Rs 22,076.01 lakhs from Rs 23,831.51 lakhs. The company faced a search and seizure operation by the Income Tax Department from September 4-9, 2025, across various locations, though management states it has no material adverse impact on quarterly results.",
            "Sentiment": "negative",
            "PublishDate": 1763173536855,
            "Source": "earnings"
        },
        {
            "Title": "Archean Chemical Reports Mixed Q2 Results with 76% Profit Growth Despite Revenue Decline",
            "Summary": "Archean Chemical delivered strong profitability in Q2 with net profit surging 76% to 385 million rupees, though revenue declined 7% to 2.21 billion rupees year-over-year. The company's EBITDA dropped to 650 million rupees from 761 million rupees, with margins compressing to 29.43% from 31.92% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1763138770861,
            "Source": "earnings"
        },
        {
            "Title": "Chemikas Speciality LLP Releases Pledge on 12 Lakh Archean Chemical Industries Shares",
            "Summary": "Chemikas Speciality LLP has released a pledge on 12,00,000 equity shares of Archean Chemical Industries Limited. The company disclosed this information to BSE and NSE under SEBI regulations regarding substantial acquisition of shares and takeovers. Archean Chemical Industries trades on BSE with scrip code 543657 and on NSE with symbol ACI.",
            "Sentiment": "neutral",
            "PublishDate": 1762408045467,
            "Source": "corporate_action"
        },
        {
            "Title": "Chemikas Speciality LLP Pledges Additional Shares in Archean Chemical Industries",
            "Summary": "Chemikas Speciality LLP has pledged 1,91,543 equity shares of Archean Chemical Industries Limited to HDFC Bank Ltd as collateral for loans. The pledge was created on October 30, 2025, and disclosed on November 1, 2025. Following this transaction, Chemikas Speciality LLP's total encumbered shareholding in Archean Chemical increased to 50,33,334 shares, representing 4.08% of the company's total share capital. The promoter maintains an overall holding of 3,76,93,219 shares, which constitutes 30.54% of Archean Chemical's total share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1762000709298,
            "Source": "corporate_action"
        },
        {
            "Title": "Income Tax Department Completes Search at Archean Chemical's Facilities",
            "Summary": "The Income Tax Department has completed a search operation at Archean Chemical's offices and plants. The company stated that its business activities remained uninterrupted during this process.",
            "Sentiment": "neutral",
            "PublishDate": 1757391747823,
            "Source": "stock"
        },
        {
            "Title": "Archean Chemical's Subsidiary SiCSem Gets Cabinet Approval for India's First Commercial Compound Semiconductor Fab",
            "Summary": "The Union Cabinet approved SiCSem Private Limited's proposal to establish a Silicon Carbide (SiC) based compound semiconductor fab in Bhubaneshwar, Odisha. SiCSem is a subsidiary of Archean Chemical Industries Limited and is collaborating with Clas-SiC Wafer Fab Ltd., UK for this project. The facility will be India's first commercial compound fab with an estimated investment of Rs.2067 crore. The fab will have an annual capacity of 60,000 wafers and packaging capacity of 96 million units. The manufactured products will have applications in missiles, defence equipment, electric vehicles, railway systems, fast chargers, data centre racks, consumer appliances, and solar power inverters. This approval was part of four semiconductor projects approved under India Semiconductor Mission with cumulative investment of Rs.4,600 crore, expected to generate employment for 2,034 skilled professionals.",
            "Sentiment": "positive",
            "PublishDate": 1755005673162,
            "Source": "stock"
        },
        {
            "Title": "Archean Chemical Industries Reports 30% Revenue Growth in Q1 FY26 Earnings Call",
            "Summary": "Archean Chemical Industries held its quarterly earnings call discussing results for the quarter ended June 30, 2025. The company reported total revenue of INR 2,915 million on standalone basis, representing 30% year-on-year growth. EBITDA stood at INR 958 million with 33% margin, while net profit reached INR 518.5 million. Industrial Salt contributed 70% of revenue at INR 194 crores with sales volume of 1.1 million tons, while Elemental Bromine contributed 30% at INR 84 crores with 4,054 tons sold. The company maintains its position as India's largest manufacturer and exporter of Elemental Bromine. Bromine Derivatives operations are running at 30-40% capacity utilization, contributing INR 23 crores in revenue. Management indicated Sulphate of Potash pilot trials are progressing well with plant scale trials expected in coming quarters. The company remains debt-free and expects gradual improvement in volumes across segments, with most contracts being long-term bilateral agreements providing business resilience.",
            "Sentiment": "positive",
            "PublishDate": 1754371455961,
            "Source": "earnings"
        },
        {
            "Title": "Archean Chemical Plans Technology-Driven Diversification Into Semiconductors and Energy Storage",
            "Summary": "Archean Chemical has outlined its long-term growth strategy focusing on entering the semiconductor sector, expanding energy storage operations, and developing its bromine value chain. The company expects this high-profit, technology-driven diversification to materialize beyond FY26.",
            "Sentiment": "positive",
            "PublishDate": 1753886657228,
            "Source": "stock"
        },
        {
            "Title": "Archean Chemical Industries Reports 30% Revenue Growth in Q1 FY26, Expands into Semiconductors and Energy Storage",
            "Summary": "Archean Chemical Industries reported total revenue growth of 30% to Rs 2,914.5 million for Q1 FY26, with exports contributing 81% of operating revenue. The company's profit after tax reached Rs 518.5 million compared to Rs 484.6 million in the previous year. The bromine business showed steady growth with limited impact from price volatility due to long-term bilateral contracts, while industrial salt maintained stable momentum. The company made strategic investments including acquiring a 22.24% stake in UK-based Clas-SiC Wafer Fab Limited for GBP 15 million to enter the semiconductor sector, and secured 18.14% stake in US-based Offgrid Energy Labs for $12 million to enter energy storage. Acume Chemicals' bromine derivatives products became operational and are scaling up. The company acquired Idealis Chemicals through NCLT in July 2024, with 3 manufacturing units undergoing trials. Archean maintains leadership in Indian bromine merchant sales and is the largest exporter of bromine and industrial salt in India, serving 41 domestic and 33 global clients.",
            "Sentiment": "positive",
            "PublishDate": 1753880905484,
            "Source": "earnings"
        },
        {
            "Title": "Archean Chemical Industries Schedules Q1 FY26 Earnings Call for July 31, 2025",
            "Summary": "Archean Chemical Industries Limited has scheduled an earnings call on July 31, 2025 at 11:00 AM IST to discuss operational and financial performance for Q1 FY26 (quarter ended June 30, 2025). The call will be led by key executives including Managing Director Ranjit Pendurthi, Executive Director Nagayanallur Ramachandran Kannan, CFO Natarajan Ramamurthy, and DGM Finance Rajeev Kumar. The company has provided pre-registration details and multiple access numbers for participants across different regions including India, USA, UK, Singapore, and Hong Kong. The schedule is subject to change due to potential exigencies.",
            "Sentiment": "neutral",
            "PublishDate": 1753716142550,
            "Source": "earnings"
        },
        {
            "Title": "Archean Chemical Industries Reports Q1 FY26 Results with Revenue of Rs 278.6 Crore",
            "Summary": "Archean Chemical Industries Limited announced its quarterly results for the period ended June 30, 2025. The marine chemicals manufacturer reported standalone revenue from operations of Rs 278.6 crore compared to Rs 321.8 crore in the previous quarter and Rs 211.2 crore in the same quarter last year. Net profit after tax stood at Rs 51.8 crore versus Rs 58.3 crore in the previous quarter and Rs 48.5 crore year-on-year. On a consolidated basis, revenue was Rs 292.4 crore with net profit of Rs 40.1 crore. The company's earnings per share was Rs 4.20 for standalone results and Rs 3.25 for consolidated results. The Board meeting was held on July 28, 2025, where directors approved the unaudited financial results. The company continues its strategic investments in Clas-SiC Wafer Fab Limited (UK) for semiconductor technology and Offgrid Energy Labs Inc (USA) for zinc-bromide battery technology.",
            "Sentiment": "neutral",
            "PublishDate": 1753711977510,
            "Source": "earnings"
        },
        {
            "Title": "Archean Chemical Reports Mixed Q1 Results with Revenue Growth and Margin Decline",
            "Summary": "Archean Chemical reported quarterly results showing revenue growth to 2.8 billion rupees from 2.1 billion rupees year-over-year. Net profit increased to 518 million rupees from 485 million rupees. EBITDA rose to 830 million rupees from 726 million rupees, though EBITDA margin declined to 29.78% from 34.4% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1753711573416,
            "Source": "earnings"
        },
        {
            "Title": "Archean Chemical Industries: Stock Drops 4% After Axis Securities Downgrade",
            "Summary": "Archean Chemical Industries stock declined 3.6% to ₹583.45 in intraday trade. Axis Securities has downgraded the stock. The company is owned by Goldman Sachs and is a favorite among Domestic Institutional Investors (DIIs).",
            "Sentiment": "negative",
            "PublishDate": 1746689004000,
            "Source": "normal_news"
        },
        {
            "Title": "Archean Chemical Reports Q4 Results and Dividend",
            "Summary": "Archean Chemical announced its Q4 financial results. The company reported a net profit of 583 million rupees, slightly down from 596 million rupees year-over-year, but up from 563 million rupees quarter-over-quarter. Revenue increased to 3.2 billion rupees from 2.83 billion rupees in the same quarter last year. The company also recommended a final dividend of 1.5 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1746403575000,
            "Source": "default"
        },
        {
            "Title": "Archean Chemicals Announces Q4 Results and Final Dividend",
            "Summary": "Archean Chemicals has recommended a final dividend of 1.5 rupees per share. The company reported Q4 EBITDA of 896 million rupees, slightly up from 881 million rupees year-over-year. However, the Q4 EBITDA margin decreased to 27.84% from 31.09% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1746198074000,
            "Source": "result"
        },
        {
            "Title": "Archean Chemical Reports Q4 FY23 Financial Results",
            "Summary": "Archean Chemical announced its Q4 financial results. The company reported a net profit of 583 million rupees, slightly down from 596 million rupees year-over-year, but up from 563 million rupees quarter-over-quarter. Revenue for Q4 increased to 3.2 billion rupees from 2.83 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1746197925000,
            "Source": "result"
        },
        {
            "Title": "Archean Chemical Reports Significant Decline in Q3 Profit and Revenue",
            "Summary": "Archean Chemical's Q3 net profit decreased to 563 million rupees from 1.02 billion rupees year-over-year, and increased from 219 million rupees quarter-over-quarter. The company's Q3 revenue fell to 2.4 billion rupees from 4 billion rupees compared to the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1739146385000,
            "Source": "earnings"
        },
        {
            "Title": "Archean Chemical Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Archean Chemical's Q3 EBITDA decreased to 842 million rupees from 1.46 billion rupees year-over-year. The company's EBITDA margin also saw a slight decline, dropping to 34.72% from 35.35% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738936194000,
            "Source": "earnings"
        },
        {
            "Title": "Archean Chemical Reports Q3 Financial Results",
            "Summary": "Archean Chemical has reported its financial results for the third quarter. The company's net profit stood at 563 million rupees, showing a decrease from 1.02 billion rupees year-over-year and an increase from 219 million rupees quarter-over-quarter. Revenue for Q3 was 2.4 billion rupees, down from 4 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738936121000,
            "Source": "earnings"
        },
        {
            "Title": "Archean Chemical Reports Q2 FY25 Results with Exceptional Item",
            "Summary": "Archean Chemical has reported its Q2 FY25 financial results. The company recorded an exceptional item of 402 million rupees in this quarter. The profit before tax (PBT) for Q2 stands at 698 million rupees, compared to 877 million rupees in the same quarter of the previous year, indicating a year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1731078088000,
            "Source": "result"
        },
        {
            "Title": "Archean Chemical Reports Q2 EBITDA Decline",
            "Summary": "Archean Chemical's Q2 EBITDA decreased to 761 million rupees from 956 million rupees year-over-year. The company's EBITDA margin also slightly declined to 31.92% from 32.91% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731078034000,
            "Source": "result"
        },
        {
            "Title": "Archean Chemical Reports Q2 Financial Results",
            "Summary": "Archean Chemical has reported its Q2 financial results. The company's net profit for the quarter was 219 million rupees, down from 663 million rupees year-over-year and 485 million rupees quarter-over-quarter. Revenue for Q2 was 2.4 billion rupees, compared to 2.9 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1731077981000,
            "Source": "result"
        },
        {
            "Title": "Archean Chemical Invests in Semiconductor and Energy Storage Initiatives",
            "Summary": "Archean Chemical has approved investments totaling approximately 293 crore rupees in two separate initiatives. The company will invest 15 million GBP (163 crore rupees) in Clas-Sic Wafer Fab, a UK-based company, and 12 million USD (130 crore rupees) in Offgrid Energy Labs, a US-based company. These investments are aimed at advancing semiconductor and energy storage technologies.",
            "Sentiment": "positive",
            "PublishDate": 1730079517000,
            "Source": "corporate_action"
        }
    ]
}