{
    "Symbol": "ACL",
    "ISIN": "INE666E01020",
    "News": [
        {
            "Title": "Andhra Cements Q3 Net Loss Widens to ₹44 Crores",
            "Summary": "Andhra Cements reported a net loss of ₹44.00 crores in Q3, marginally higher than the ₹43.70 crores loss recorded in the same quarter of the previous year, reflecting ongoing operational challenges.",
            "Sentiment": "negative",
            "PublishDate": 1768986821926,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sagar Cements Sells 7.76% Stake in Andhra Cements via OFS",
            "Summary": "Sagar Cements Limited divested 71,48,978 equity shares (7.76%) of Andhra Cements Limited through OFS mechanism on January 09 and 12, 2026, reducing its shareholding from 90.00% to 82.24%.",
            "Sentiment": "neutral",
            "PublishDate": 1768364370274,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sagar Cements Sells 7.76% Stake in Andhra Cements",
            "Summary": "Sagar Cements Limited divested 71,48,978 equity shares representing 7.76% stake in Andhra Cements through OFS mechanism on January 09-12, 2026, reducing its holding from 90% to 82.24%.",
            "Sentiment": "neutral",
            "PublishDate": 1768364339747,
            "Source": "co_actions_results"
        },
        {
            "Title": "Andhra Cements Promoter Sells 7.76% Stake for MPS",
            "Summary": "Sagar Cements Limited sold 71,48,978 equity shares representing 7.756% stake in Andhra Cements Limited on January 9 and 12, 2026, reducing promoter holding from 90% to 82.24% to meet minimum public shareholding norms.",
            "Sentiment": "neutral",
            "PublishDate": 1768309174353,
            "Source": "co_actions_results"
        },
        {
            "Title": "Andhra Cements hits 10% upper circuit on OFS news",
            "Summary": "Andhra Cements surged 10% to ₹75.86 after promoter Sagar Cements announced sale of 8.14% stake through OFS route for SEBI compliance. The regulatory-driven stake sale aims to reduce promoter holding from 90% to 81.86%.",
            "Sentiment": "positive",
            "PublishDate": 1767944171376,
            "Source": "co_actions_results"
        },
        {
            "Title": "Andhra Cements hits upper circuit on OFS opening",
            "Summary": "Andhra Cements shares surged 10% to hit upper circuit as promoter Sagar Cements' OFS for 8.14% stake opened at premium floor price of ₹72 per share, representing 8.9% premium to previous close.",
            "Sentiment": "positive",
            "PublishDate": 1767944112657,
            "Source": "co_actions_results"
        },
        {
            "Title": "Andhra Cements Installs New 6-Stage Preheater, Expands Production Capacity",
            "Summary": "Andhra Cements has begun installation of a new 6-stage preheater as part of its modernization efforts. The upgrade increases the company's clinker capacity to 2.30 MTPA and cement grinding capacity to 3.00 MTPA.",
            "Sentiment": "positive",
            "PublishDate": 1761211268621,
            "Source": "stock"
        },
        {
            "Title": "Andhra Cements Reports Net Loss of ₹71.54 Crore for Second Quarter",
            "Summary": "Andhra Cements Limited reported a net loss of ₹41.92 crore for the second quarter ended September 30, 2025, compared to ₹34.88 crore loss in the same period last year. For the six-month period, the company's net loss widened to ₹71.54 crore from ₹58.47 crore in the previous year. Revenue from operations declined to ₹77.85 crore in the quarter from ₹54.86 crore year-on-year, while six-month revenue increased to ₹177.38 crore from ₹118.25 crore. The company's total expenses for the quarter stood at ₹120.36 crore. Andhra Cements operates in cement manufacturing and is a subsidiary of Sagar Cements Limited. The company has decided to sell unused land parcels, which have been classified as assets held for sale.",
            "Sentiment": "negative",
            "PublishDate": 1761210354579,
            "Source": "earnings"
        },
        {
            "Title": "Andhra Cements Completes 6 MW Solar Power Plant at Manufacturing Facility",
            "Summary": "Andhra Cements Limited has successfully completed and operationalized a 6 MW Solar Power Plant at its cement manufacturing facility in Gamalapadu village, Dachepalli Mandal, Palnadu District, Andhra Pradesh. The solar plant is part of the company's green energy initiative. Andhra Cements is a subsidiary of Sagar Cements Limited.",
            "Sentiment": "positive",
            "PublishDate": 1756361477472,
            "Source": "stock"
        },
        {
            "Title": "Andhra Cements Reports Mixed Q1 Results with Revenue Growth but Higher Net Loss",
            "Summary": "Andhra Cements delivered mixed quarterly results with revenue increasing to 995 million rupees from 634 million rupees year-over-year. The company turned around its EBITDA performance, recording a gain of 66 million rupees compared to a loss of 54 million rupees in the same period last year, achieving an EBITDA margin of 6.67%. However, net loss widened to 296 million rupees from 236 million rupees year-over-year despite the revenue growth.",
            "Sentiment": "neutral",
            "PublishDate": 1753098878709,
            "Source": "earnings"
        },
        {
            "Title": "Andhra Cements Reports Increased Q4 Net Loss",
            "Summary": "Andhra Cements reported a net loss of 499 million rupees in Q4, compared to a loss of 188 million rupees in the same period last year. The company's revenue slightly decreased to 895 million rupees from 918 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1747043116000,
            "Source": "result"
        },
        {
            "Title": "Andhra Cements Reports Increased Q2 Net Loss",
            "Summary": "Andhra Cements reported a net loss of 348 million rupees in Q2, significantly higher than the 10 million rupee loss in the same quarter last year. The loss also increased from 236 million rupees in the previous quarter. Revenue for Q2 declined to 549 million rupees from 652 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1729729432000,
            "Source": "result"
        }
    ]
}