{
    "Symbol": "ACMESOLAR",
    "ISIN": "INE622W01025",
    "News": [
        {
            "Title": "ACME Solar Wins 220 MW Solar+BESS Project in MP",
            "Summary": "ACME Solar Holdings receives Letter of Award from Rewa Ultra Mega Solar Limited for 220 MW solar project with battery storage at Morena Solar Park, Madhya Pradesh at Rs. 2.764 per unit tariff.",
            "Sentiment": "positive",
            "PublishDate": 1770694137215,
            "Source": "co_actions_results"
        },
        {
            "Title": "ACME Solar Wins 301 MW SECI FDRE Project",
            "Summary": "ACME Solar Holdings secures 301 MW/1,204 MWh assured peak supply SECI FDRE-VII project through e-reverse auction, expanding total contracted portfolio to 8,071 MW across renewable energy solutions.",
            "Sentiment": "positive",
            "PublishDate": 1770352004065,
            "Source": "co_actions_results"
        },
        {
            "Title": "ACME Solar Appoints Rahul Kaushik as Head of Process",
            "Summary": "ACME Solar Holdings appoints Rahul Kaushik as Head of Process Transformation to strengthen governance frameworks and drive operational excellence across its 7,770 MW renewable energy portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1770176421459,
            "Source": "stocks"
        },
        {
            "Title": "ACME Solar schedules investor meets in Feb 2026",
            "Summary": "ACME Solar Holdings announces investor/analyst interactions on February 06 in Mumbai and February 09-10 in Singapore under regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1770129630439,
            "Source": "stocks"
        },
        {
            "Title": "ACME Solar Gets GEDA Certificate for 16 MW Wind Project",
            "Summary": "ACME Solar Holdings receives commissioning certificate from Gujarat Energy Development Agency for its 16 MW wind power project, marking another milestone in renewable energy expansion.",
            "Sentiment": "positive",
            "PublishDate": 1770041820778,
            "Source": "stocks"
        },
        {
            "Title": "Acme Solar Sets Ambitious 2030 Capacity Targets",
            "Summary": "Acme Solar Holdings announces plans to achieve 10 GW generation capacity and 20 GWh battery storage by 2030, targeting 35% annual growth in renewable energy expansion.",
            "Sentiment": "positive",
            "PublishDate": 1769741457726,
            "Source": "stocks"
        },
        {
            "Title": "ACME Solar Secures 250 MW FDRE Project with NHPC",
            "Summary": "ACME Solar's subsidiary ACME Urja One signs PPA with NHPC Limited for 250 MW FDRE project at Rs. 4.33 per unit tariff, scheduled for commercial operation by June 2027.",
            "Sentiment": "positive",
            "PublishDate": 1769708609916,
            "Source": "co_actions_results"
        },
        {
            "Title": "ACME Solar Reports Strong Q3FY26 Results",
            "Summary": "ACME Solar Holdings reported consolidated revenue of Rs. 4,967.93 million for Q3FY26, with net profit of Rs. 1,137.09 million. The company also declared an interim dividend of Rs. 0.20 per share.",
            "Sentiment": "positive",
            "PublishDate": 1769702916820,
            "Source": "co_actions_results"
        },
        {
            "Title": "ACME Solar Gets Enhanced Credit Rating Facility",
            "Summary": "ACME Solar Holdings Limited receives reaffirmed Crisil AA-/Stable rating with enhanced facility amount increased to Rs.1,500 crore from Rs.1,000 crore under regulatory disclosure.",
            "Sentiment": "positive",
            "PublishDate": 1769681400093,
            "Source": "stocks"
        },
        {
            "Title": "ACME Solar schedules Q3FY26 earnings call for Jan 30",
            "Summary": "ACME Solar Holdings Limited has scheduled an earnings call on January 30, 2026 at 11:30 AM IST to discuss Q3 FY 2025-26 results with analysts and institutional investors.",
            "Sentiment": "neutral",
            "PublishDate": 1768907780669,
            "Source": "co_actions_results"
        },
        {
            "Title": "ACME Solar adds 12 MW wind capacity in Gujarat project",
            "Summary": "ACME Solar Holdings commissioned additional 12 MW wind power capacity at Surendaranagar project, bringing total operational capacity to 68 MW of planned 100 MW facility with Q2FY26 EBITDA up 108% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1768805146696,
            "Source": "stocks"
        },
        {
            "Title": "ACME Solar CCO Rahula Kumar Kashyapa Resigns",
            "Summary": "ACME Solar Holdings announces resignation of Chief Commercial Officer Rahula Kumar Kashyapa effective January 20, 2026, as he explores opportunities outside the organization.",
            "Sentiment": "neutral",
            "PublishDate": 1768492381723,
            "Source": "stocks"
        },
        {
            "Title": "ACME Solar Appoints Yogesh Sanklecha as Senior Manager",
            "Summary": "ACME Solar Holdings designates Yogesh Kumar Sanklecha, Head - Business Development, as Senior Management Personnel effective January 15, 2026, bringing 25+ years of ACME Group experience.",
            "Sentiment": "positive",
            "PublishDate": 1768403864272,
            "Source": "stocks"
        },
        {
            "Title": "ACME Solar Gets Certificate for 12 MW Wind Project",
            "Summary": "ACME Solar Holdings unit receives commissioning certificate from GEDA for completing 12 MW portion of its 100 MW wind project in Gujarat, marking significant progress in renewable energy development.",
            "Sentiment": "positive",
            "PublishDate": 1767710643874,
            "Source": "stocks"
        },
        {
            "Title": "ACME Solar Incorporates New Subsidiary for Renewable Energy",
            "Summary": "ACME Solar Holdings Limited has incorporated a wholly owned subsidiary, ACME Greentech Eighteen Private Limited, with ₹1.00 lakh initial capital to develop renewable energy projects.",
            "Sentiment": "positive",
            "PublishDate": 1767265663522,
            "Source": "stocks"
        },
        {
            "Title": "ACME Solar Forms New Subsidiary for Renewable Energy",
            "Summary": "ACME Solar Holdings Limited incorporates wholly owned subsidiary ACME Greentech Fifteen Private Limited with ₹1.00 lakh paid-up capital to develop renewable energy projects.",
            "Sentiment": "positive",
            "PublishDate": 1767265374044,
            "Source": "stocks"
        },
        {
            "Title": "ACME Solar subsidiary gets CRISIL A/Stable rating",
            "Summary": "ACME Venus Urja Private Limited, wholly owned subsidiary of ACME Solar Holdings, receives CRISIL A/Stable rating for ₹4,072 crore bank facilities from CRISIL Ratings Limited.",
            "Sentiment": "positive",
            "PublishDate": 1767102212469,
            "Source": "stocks"
        },
        {
            "Title": "Acme Solar Forms New Subsidiary Acme Greentech Nineteen",
            "Summary": "Acme Solar Holdings has established a new subsidiary named Acme Greentech Nineteen Private Limited as part of its corporate expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1766757780154,
            "Source": "stocks"
        },
        {
            "Title": "ACME Solar Incorporates New Renewable Energy Subsidiary",
            "Summary": "ACME Solar Holdings Limited has incorporated a wholly owned subsidiary, ACME Greentech Nineteen Private Limited, focused on renewable energy project development with initial capital of ₹1.00 lakh.",
            "Sentiment": "positive",
            "PublishDate": 1766757689997,
            "Source": "co_actions_results"
        },
        {
            "Title": "Acme Solar Holdings Forms New Subsidiary",
            "Summary": "Acme Solar Holdings has established a new fully owned subsidiary named Acme Greentech Seventeen Private Limited, expanding its corporate structure in the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1766578670111,
            "Source": "stocks"
        },
        {
            "Title": "ACME Solar Gets LOA for 130 MW Project at ₹4.35/Unit",
            "Summary": "ACME Solar Holdings receives Letter of Award from REMC Limited for 130 MW renewable energy round-the-clock power project with 25-year tariff at ₹4.35 per unit.",
            "Sentiment": "positive",
            "PublishDate": 1766548730088,
            "Source": "stocks"
        },
        {
            "Title": "ACME Solar incorporates new renewable energy subsidiary",
            "Summary": "ACME Solar Holdings Limited has incorporated a wholly owned subsidiary, ACME Greentech Sixteen Private Limited, with ₹1.00 lakh paid-up capital to develop renewable energy projects.",
            "Sentiment": "positive",
            "PublishDate": 1766510969460,
            "Source": "stocks"
        },
        {
            "Title": "ACME Solar Secures ₹4,725 Cr Financing Deal",
            "Summary": "ACME Solar Holdings has secured financing worth ₹4,725 crores as part of efforts to broaden its banking relationships and strengthen its financial position.",
            "Sentiment": "positive",
            "PublishDate": 1766026751472,
            "Source": "stocks"
        },
        {
            "Title": "Acme Solar Appoints Ayalur Kumar as CPO",
            "Summary": "ACME Solar Holdings appoints Ayalur Kumar as Chief Procurement Officer and Supply Chain Leader with 30 years experience to support 10 GW capacity target by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1765964680351,
            "Source": "stocks"
        },
        {
            "Title": "ACME Solar Commissions Additional 8 MW Wind Power Phase",
            "Summary": "ACME Solar Holdings subsidiary commissions third phase of 8 MW wind power capacity in Gujarat, taking total operational capacity to 52 MW out of 100 MW project.",
            "Sentiment": "positive",
            "PublishDate": 1765896036106,
            "Source": "stocks"
        },
        {
            "Title": "ACME Solar Clarifies Transmission Constraints Impact",
            "Summary": "ACME Solar Holdings clarifies that its 300MW Rajasthan project has received Long Term GNA effectiveness approval and is evacuating full capacity, unaffected by transmission constraints.",
            "Sentiment": "positive",
            "PublishDate": 1765773975756,
            "Source": "stocks"
        },
        {
            "Title": "ACME Solar Appoints KR Thiyagarajan as President-EPC",
            "Summary": "ACME Solar Holdings appoints KR Thiyagarajan as President-EPC and Senior Management Personnel, bringing 35 years of power sector experience to drive project execution excellence.",
            "Sentiment": "positive",
            "PublishDate": 1765377860885,
            "Source": "stocks"
        },
        {
            "Title": "Acme Solar Holdings Unit Secures Gujarat Approval for 16 MW Wind Power Project",
            "Summary": "Acme Solar Holdings' subsidiary has received regulatory approval from Gujarat state authorities to develop a 16 MW wind power project. This approval enables the renewable energy company to expand its wind power capacity and strengthen its presence in Gujarat's clean energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1765292612611,
            "Source": "stock"
        },
        {
            "Title": "Acme Solar Holdings Signs 200 MW Solar Project Agreement With SECI",
            "Summary": "Acme Solar Holdings Limited has signed an agreement with SECI for a 200 MW solar project, bringing the company's total capacity to 5.38 GW. The project is expected to be commissioned by June 2027, expanding the company's renewable energy portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1764044146740,
            "Source": "order&deals"
        },
        {
            "Title": "ACME Solar Wins 130 MW Railways Round-The-Clock Renewable Energy Tender at Rs 4.35 per Unit",
            "Summary": "ACME Solar Holdings Limited emerged as the winning bidder for 130 MW under REMCL's 1000 MW Round-the-Clock renewable energy project tender with a bid of Rs 4.35 per unit. The company will supply renewable energy with storage systems to Indian Railways through a direct Power Purchase Agreement, requiring project commissioning within 30 months and maintaining minimum 75% availability for first three years.",
            "Sentiment": "positive",
            "PublishDate": 1763953254182,
            "Source": "stock"
        },
        {
            "Title": "ACME Solar Holdings Grants 16.09 Lakh Employee Stock Options Under ESOP Plan 2024",
            "Summary": "ACME Solar Holdings' Nomination and Remuneration Committee approved the grant of 16,09,712 employee stock options to eligible employees under the ACME Employee Stock Option Plan 2024. The ESOPs will vest over four years at 25% annually with a minimum vesting period of one year and maximum exercise period of five years from vesting date.",
            "Sentiment": "positive",
            "PublishDate": 1763740820731,
            "Source": "corporate_action"
        },
        {
            "Title": "Acme Solar Launches 16 MW Second Phase of Gujarat Wind Power Project",
            "Summary": "Acme Solar has launched the second phase of its wind power project in Gujarat, adding 16 MW capacity as part of a larger 100 MW project. The development represents progress in the company's renewable energy expansion in the state.",
            "Sentiment": "positive",
            "PublishDate": 1763607974246,
            "Source": "stock"
        },
        {
            "Title": "ACME Solar Subsidiary Awarded INR 47.40 Crore Compensation by RERC",
            "Summary": "ACME Aklera Power Technology Private Limited secured INR 47.40 crore as change in law compensation from Rajasthan Electricity Regulatory Commission, covering basic customs duty on solar cells, GST increase from 5% to 12%, and carrying costs. The 250 MW solar project will receive additional revenue of 3.5% for 15 years through an annuity mechanism at 9% discount rate, setting a precedent for regulatory certainty in renewable energy.",
            "Sentiment": "positive",
            "PublishDate": 1763357721409,
            "Source": "stock"
        },
        {
            "Title": "ACME Solar VP-Procurement Sarthak Sengupta Resigns Due to Personal Reasons",
            "Summary": "Sarthak Sengupta, Vice President-Procurement and Senior Management Personnel at ACME Solar Holdings Limited, resigned due to personal reasons with effect from November 14, 2025. The resignation affects the company's senior management structure in the procurement division, with ACME Solar acknowledging his contributions and leadership during his tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1763173333096,
            "Source": "corporate_governance"
        },
        {
            "Title": "ACME Solar Holdings Subsidiary Receives ₹474 Million Compensation for GST and Customs Duty Changes",
            "Summary": "ACME Solar Holdings' subsidiary received compensation of ₹474 million due to 'change in law' provisions related to GST hikes and new customs duties. The compensation addresses financial impact on the subsidiary from regulatory changes in tax and duty structures.",
            "Sentiment": "positive",
            "PublishDate": 1763125220498,
            "Source": "stock"
        },
        {
            "Title": "ACME Solar Holdings Allots 8.84 Lakh Shares to Employee Welfare Trust Under ESOP Plan",
            "Summary": "ACME Solar Holdings Limited allotted 8,84,023 equity shares with face value of Rs. 2 each to ACME Employees Welfare Trust on November 6, 2025, under the ACME Employee Stock Option Plan 2024. The shares were allotted at face value totaling Rs. 17,68,046, though their market value based on NSE closing price of Rs. 269.10 on the allotment date was Rs. 23,78,90,589.30. The trustee for the employee welfare trust is Catalyst Trusteeship Limited. This represents 0.1458% of the company's equity shares post-allotment.",
            "Sentiment": "neutral",
            "PublishDate": 1762962282393,
            "Source": "corporate_action"
        },
        {
            "Title": "ICRA Assigns AA-/Stable Rating to ACME Solar's Rs 990 Crore Bank Facilities for Rajasthan Project",
            "Summary": "ICRA has assigned an ICRA AA-/Stable rating to long-term bank facilities of ACME Dhaulpur Powertech Private Limited, a wholly owned subsidiary of ACME Solar Holdings Limited. The rating applies to a 300 MW ISTS solar power project in Jaisalmer, Rajasthan, for its Rs 990 crore term loan facility from Indian Renewable Energy Development Agency Limited (IREDA). This is the second AA- rating for the project, following a similar rating from CRISIL. The plant has been operational since January 2025 and is achieving a capacity utilization factor of 29.05% since commissioning. ICRA cited experienced sponsor, revenue visibility, strong debt coverage metrics, timely payments and strong counterparty as key strengths. The project is supported by a 25-year Power Purchase Agreement with Solar Energy Corporation of India Limited. The stable outlook reflects steady cash flow visibility from the long-term PPA and satisfactory generation performance.",
            "Sentiment": "positive",
            "PublishDate": 1762856791232,
            "Source": "stock"
        },
        {
            "Title": "ACME Solar Wins 450 MW Peak Power Project Worth INR 6.75/Unit",
            "Summary": "ACME Solar Holdings Limited secured a 450 MW-1800 MWh assured peak power SJVN FDRE-IV project at a tariff of INR 6.75/unit for 25 years. The project was awarded on November 10, 2025, following an e-reverse auction held on October 9, 2025. The project requires supplying power of only 4 MWh per MW of capacity during any four-hour period each day within peak demand windows with 90% monthly availability. It will integrate 300 MW of solar capacity and approximately 1800 MWh of Battery Energy Storage System (BESS) technology. The project focuses on peak power supply to support grid stability and manage critical peak demand, utilizing night-time connectivity in high irradiation zones in Rajasthan. This marks ACME Solar's first project using Indian-made solar cells under ALMM List-II. Chief Commercial Officer Rahul Kashyap noted this represents the lowest price achieved in pure peak power tenders so far.",
            "Sentiment": "positive",
            "PublishDate": 1762833647824,
            "Source": "stock"
        },
        {
            "Title": "ACME Solar Reports 104% Revenue Growth in Q2, Expands Portfolio to 7,390 MW with New Battery Storage Projects",
            "Summary": "ACME Solar Holdings reported quarterly revenue of INR 601 crores, marking a 104% year-on-year increase. EBITDA grew 108% to INR 534 crores with an 89% margin. The company commissioned 378 MW capacity and expects to complete the remaining 72 MW by early January. ACME won new projects totaling 720 MW, including a 50 MW firm and dispatchable renewable energy project with Tata Power and a 670 MW solar plus battery energy storage system. The total portfolio now stands at 7,390 MW, including 13.5 GWh of battery storage capacity. The company secured financing of INR 7,000 crores for 680 MW projects and achieved credit rating upgrades to AA- from both CRISIL and ICRA. Net operational debt to EBITDA stands at 4.3x, while days sales outstanding dropped to 27 days. ACME plans to operate 1 GWh of battery storage on merchant basis from Q4 FY26, expected to generate annual EBITDA of INR 170 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762757798870,
            "Source": "earnings"
        },
        {
            "Title": "ACME Solar Allots 8.84 Lakh Equity Shares Under Employee Stock Option Plan",
            "Summary": "ACME Solar Holdings Limited has allotted 8,84,023 equity shares with a face value of Rs. 2 each to ACME Employees Welfare Trust under the ACME Employee Stock Option Plan 2024. The allotment was approved by the Operational Committee of the Board of Directors on November 6, 2025. Following this allotment, the company's paid-up equity share capital increased to Rs. 1,21,19,43,608, divided into 60,59,71,804 equity shares of Rs. 2 face value each. The shares allotted to the Trust will be transferred to eligible employees upon exercise of their options. These new shares will rank equally with existing equity shares in all respects. The company is listed on both NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1762451129884,
            "Source": "corporate_action"
        },
        {
            "Title": "Acme Solar Holdings Provides FY26 Execution and Investment Guidance",
            "Summary": "Acme Solar Holdings outlined its FY26 execution plans to commission 450MW of renewable energy capacity. The company has already commissioned 378MW and has 72MW under advanced construction expected to complete by early January. The company plans to operate 1GWh of battery energy storage system on merchant basis from Q4 FY26, which is expected to generate annual EBITDA of approximately INR170 crores. The company provided FY26 CapEx guidance of INR12,000-14,000 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762400099616,
            "Source": "stock"
        },
        {
            "Title": "ACME Solar Reports Strong Q2 FY26 Results with 108% EBITDA Growth and 28MW Wind Project Commissioning",
            "Summary": "ACME Solar Holdings Limited announced its financial results for the second quarter ended September 30, 2025. The company reported consolidated revenue of INR 601 crores, up 103.8% year-on-year, with EBITDA of INR 534 crores, representing a 108.3% increase. PAT surged 652.1% to INR 115 crores. The company partially commissioned 28MW of its 100MW wind project in Gujarat, taking cumulative H1 FY26 commissioned capacity to 378MW. ACME Solar won 720MW/2,460MWh capacity and signed PPAs for 50MW/220MWh, including its first PPA with private discom Tata Power Company Limited. The company ordered additional 2GWh BESS from global suppliers, bringing total BESS ordered to 5.1GWh. Credit ratings were upgraded to AA-/Stable by both CRISIL and ICRA. The company declared an interim dividend of Rs. 0.20 per share totaling Rs. 121.02 million for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1762204469979,
            "Source": "earnings"
        },
        {
            "Title": "Acme Solar Holdings Sets Ambitious 2030 Targets with 10 GW Renewable Capacity and 15 GWh Battery Storage",
            "Summary": "Acme Solar Holdings has announced targets to achieve 10 GW of renewable energy capacity and 15 GWh of Battery Energy Storage Systems (BESS) by 2030. The company has signed Power Purchase Agreements (PPAs) for 5,180 MW and secured 5.1 GWh in BESS orders. The company's strategy focuses on hybrid projects, Firm and Dispatchable Renewable Energy (FDRE), and battery storage initiatives. Acme Solar maintains AA-/Stable credit ratings, supporting its expansion plans and operational scaling objectives.",
            "Sentiment": "positive",
            "PublishDate": 1762186905557,
            "Source": "stock"
        },
        {
            "Title": "Acme Solar Holdings Reports Strong Quarterly Growth with Net Profit Rising to 1.15 Billion Rupees",
            "Summary": "Acme Solar Holdings reported quarterly consolidated net profit of 1.15 billion rupees compared to 153 million rupees in the same period last year. The company's quarterly revenue increased to 4.7 billion rupees from 2.6 billion rupees year-over-year. This represents significant growth in both profitability and revenue metrics for the solar energy company.",
            "Sentiment": "positive",
            "PublishDate": 1762185006293,
            "Source": "earnings"
        },
        {
            "Title": "Acme Solar Holdings Subsidiary Secures 25-Year Inter-State Electricity Trading License",
            "Summary": "Acme Solar Holdings announced that its subsidiary has received a 25-year Category 'IV' trading license for inter-state electricity trading from CERC (Central Electricity Regulatory Commission). The license enables the subsidiary to generate revenue through trading margins in the electricity market.",
            "Sentiment": "positive",
            "PublishDate": 1761907080614,
            "Source": "stock"
        },
        {
            "Title": "ACME Solar Commissions 28 MW Wind Power Project Phase in Gujarat",
            "Summary": "ACME Solar Holdings Limited commissioned the first phase of 28 MW out of a planned 100 MW wind power project in Surendaranagar, Gujarat through its subsidiary ACME Eco Clean Energy Private Limited. The commissioning was witnessed by Gujarat Energy Development Agency and Paschim Gujarat Vij Company Limited officials, with formal certification expected soon. This increases ACME Solar's total operational capacity from 2,890 MW to 2,918 MW. The project was financed through Power Finance Corporation and constructed using in-house EPC with SANY's 4 MW turbines. Power generated will be sold under a 25-year Power Purchase Agreement with Gujarat Urja Vikas Nigam Limited. The project shares infrastructure with ACME Solar's existing 50 MW wind power project at the same location.",
            "Sentiment": "positive",
            "PublishDate": 1760725187195,
            "Source": "stock"
        },
        {
            "Title": "ACME Solar Signs 25-Year PPA with Tata Power-D for 50 MW Renewable Energy Project",
            "Summary": "ACME Solar Holdings Limited signed a 25-year Power Purchase Agreement with Tata Power Company Limited for a 50 MW Firm and Dispatchable Renewable Energy project. The agreement was signed on October 16, 2025, following a Letter of Award received in September 2025. The PPA is priced at INR 4.43 per unit with a minimum annual Capacity Utilization Factor of 40% and requires four hours of peak-hour supply with 90% monthly availability. The project will integrate solar and Battery Energy Storage System technologies. With this agreement, ACME Solar has signed PPAs for 600 MW cumulative capacity and 550 MWh of standalone battery storage projects in the current financial year. ACME Solar operates 2,890 MW of renewable energy capacity across solar, wind, storage, and hybrid solutions.",
            "Sentiment": "positive",
            "PublishDate": 1760692127517,
            "Source": "order&deals"
        },
        {
            "Title": "Acme Solar Holdings Plans to Increase Stake in Acme Sigma Urja to 99.66%",
            "Summary": "Acme Solar Holdings plans to increase its ownership in Acme Sigma Urja to 99.66% through a ₹1.5 crore investment. This move will significantly enhance the company's control over its subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1760073514337,
            "Source": "stock"
        },
        {
            "Title": "ACME Solar Receives Highest Credit Rating Upgrade to AA-/Stable, Appoints New Manufacturing COO",
            "Summary": "CRISIL Ratings upgraded ACME Solar Holdings' long-term bank facilities worth ₹1,000 crore to 'CRISIL AA-/Stable' from 'CRISIL A+/Positive', marking the company's highest rating upgrade. This is the second AA-/Stable rating for the renewable energy firm and is expected to reduce debt costs across projects. The upgrade reflects ACME Solar's expanding operational portfolio of 2,890 MW and execution track record. The company has a pipeline of 2.84 GW solar, hybrid and wind projects plus a 550 MWh battery energy storage system project scheduled for completion over the next two to three years. CRISIL noted strong liquidity with consolidated cash exceeding ₹1,400 crore, including over ₹800 crore at standalone level. ACME Group appointed Jitendra Agrawal as Chief Operating Officer for its renewable equipment manufacturing business to scale up domestic and international market presence. The company established a 1.2 GW solar module manufacturing facility in Jaipur with ₹230 crore investment, producing high-efficiency modules for utility-scale power plants, KUSUM projects, exports and rooftop installations. ACME launched ACM-HD144N N-Type TOPCon Bifacial Dual Glass Mono Modules with 600W peak power ratings and 30-year performance warranty. The recent GST reduction on solar modules from 12% to 5% is expected to shorten payback periods by two to three months for energy consumers. Shares were trading at ₹289.70, up ₹1.40 or 0.49% on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1759821280162,
            "Source": "stock"
        },
        {
            "Title": "ACME Solar Receives Highest Credit Rating of 'ICRA AA-/Stable' from ICRA Limited",
            "Summary": "ACME Solar Holdings Limited shares closed at ₹286.60 on NSE, declining ₹1.70 or 0.59%. ICRA Limited assigned the company its highest-ever credit rating of 'ICRA AA-/Stable' for long-term non-fund based bank facilities. The rating reflects ACME Solar's diversified portfolio across multiple locations with central government off-takers, revenue visibility from long-term power purchase agreements, optimal generation performance, and comfortable debt coverage metrics. ICRA highlighted the company's strengthened financial position following its IPO and availability of equity funding for construction projects. The improved rating is expected to reduce borrowing costs for ACME Solar and its subsidiaries. The company operates as an integrated renewable energy firm with 2,890 MW operational capacity, offering solar, wind, storage, and hybrid solutions with in-house engineering and construction capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1759491045619,
            "Source": "stock"
        }
    ]
}