{
    "Symbol": "ACUTAAS",
    "ISIN": "INE00FF01025",
    "News": [
        {
            "Title": "Acutaas Chemicals Completes 75% Stake Acquisition",
            "Summary": "Acutaas Chemicals' subsidiary completes acquisition of 75% shareholding in Indichem Inc, a South Korean semiconductor chemicals company, making it a step-down subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1770818152030,
            "Source": "co_actions_results"
        },
        {
            "Title": "Acutaas Chemicals Publishes FY25 Sustainability Report",
            "Summary": "Acutaas Chemicals Limited released its Annual Sustainability Report for FY 2024-25, highlighting ESG achievements including EcoVadis Platinum Medal recognition and ₹1,000 crore revenue milestone.",
            "Sentiment": "positive",
            "PublishDate": 1769694417072,
            "Source": "stocks"
        },
        {
            "Title": "Acutaas Chemicals Plans Rs 350 Cr Investment Push",
            "Summary": "Acutaas Chemicals announces Rs 220 crore capex for FY26 plus Rs 130 crore for Indochem JV. Battery chemicals business to grow from Q1 FY27 with two new products. Targets 25%+ annual revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1769660766636,
            "Source": "stocks"
        },
        {
            "Title": "Acutaas Chemicals Shares Q3 FY26 Earnings Call",
            "Summary": "Acutaas Chemicals Limited has made available the recording of its earnings call held on January 28, 2026, in compliance with SEBI regulations for investor transparency.",
            "Sentiment": "neutral",
            "PublishDate": 1769609735339,
            "Source": "co_actions_results"
        },
        {
            "Title": "Acutaas Chemicals Raises Revenue Growth Forecast to 30%",
            "Summary": "Acutaas Chemicals has revised its revenue growth forecast upward from 25% to approximately 30%, signaling stronger business momentum and improved market outlook for the company.",
            "Sentiment": "positive",
            "PublishDate": 1769593982048,
            "Source": "stocks"
        },
        {
            "Title": "Acutaas Chemicals Q3 Net Profit Surges 143% YoY",
            "Summary": "Acutaas Chemicals reported strong Q3 performance with net profit rising to ₹1.1 billion from ₹453 million in the previous year, marking significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1769593009100,
            "Source": "co_actions_results"
        },
        {
            "Title": "Acutaas Chemicals Gets Relief in GST Demand Case",
            "Summary": "Acutaas Chemicals Limited receives favorable order dropping GST demand of Rs. 15.44 lakhs along with interest and penalty related to alleged ineligible Input Tax Credit claims.",
            "Sentiment": "positive",
            "PublishDate": 1769520023820,
            "Source": "stocks"
        },
        {
            "Title": "AcutaaS Chemicals Inaugurates Phase 1 Manufacturing Block",
            "Summary": "AcutaaS Chemicals inaugurated Phase 1 of its new manufacturing block for electrolyte additives and battery chemicals at Jhagadia facility, potentially adding 30% to annual production revenue.",
            "Sentiment": "positive",
            "PublishDate": 1768813589251,
            "Source": "stocks"
        },
        {
            "Title": "Acutaas Chemicals Gets Credit Rating Reaffirmation with Enhanced Bank Facilities",
            "Summary": "CARE Ratings reaffirmed Acutaas Chemicals Limited's long-term and short-term bank facilities rating at CARE A4 Stable/CARE A1+ while enhancing the facility amount from Rs. 125 crores to Rs. 135 crores. The rating action was based on the company's operational and financial performance for FY25 and H1FY26, affecting the company's borrowing capacity across multiple banking partners including Axis Bank, ICICI Bank, HDFC Bank, and DBS Bank India.",
            "Sentiment": "positive",
            "PublishDate": 1764851643100,
            "Source": "stock"
        },
        {
            "Title": "Acutaas Chemicals Reports Strong Q2 FY26 Results with 24% Revenue Growth and Margin Expansion",
            "Summary": "Acutaas Chemicals Limited reported revenue of INR 306.2 crores for Q2 FY26, representing 24.1% year-on-year growth. The company's EBITDA reached INR 95.3 crores with margins expanding to 31.1%, up 1,130 basis points year-on-year. PAT grew 91.3% to INR 71.9 crores with margins at 23.5%. The Advanced Pharmaceutical Intermediates segment drove growth with revenue of INR 262.6 crores, up 27.1% year-on-year, primarily from CDMO business expansion. Specialty Chemicals segment recorded INR 43.6 crores revenue with 7.3% growth. For H1 FY26, total revenue reached INR 513.4 crores, up 21.3% year-on-year. The company revised its EBITDA margin guidance to 28-30% for FY26 and maintains 25% revenue growth target. Capex of INR 141 crores in H1 focused on electrolyte additive project at Jaghadia site and pilot plant at Sachin site. The electrolyte additive plant is expected to be completed by Q4 FY26, while the Korea joint venture Indichem is expected to start contributing from H2 FY27. Working capital improved to 100 days from 128 days in Q1 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1761290731542,
            "Source": "earnings"
        },
        {
            "Title": "Acutass Chemicals Raises FY26 Revenue Growth Guidance to 25% with Improved EBITDA Margins",
            "Summary": "Acutass Chemicals anticipates a 25% revenue increase for FY26. The company has raised its EBITDA margin guidance for FY26 to 28-30% due to higher CDMO contributions. The specialty chemicals business is expected to grow by 10-15%. Working capital is projected to be between 95-105 days for the year.",
            "Sentiment": "positive",
            "PublishDate": 1760930602826,
            "Source": "stock"
        },
        {
            "Title": "AcutaaS Chemicals MD Targets 25% Revenue Growth",
            "Summary": "AcutaaS Chemicals' Managing Director expressed confidence in achieving approximately 25% revenue growth for the year.",
            "Sentiment": "positive",
            "PublishDate": 1760684586933,
            "Source": "stock"
        },
        {
            "Title": "Acutaas Chemicals Reports Strong Q2 Growth with Revenue Up 27% and Profit Nearly Doubling",
            "Summary": "Acutaas Chemicals (AMI Organics) delivered strong quarterly performance with revenue rising to 3.1 billion rupees from 2.44 billion rupees year-over-year. The company's EBITDA increased significantly to 966 million rupees compared to 481 million rupees in the same period last year, while EBITDA margin expanded to 31.65% from 19.76%. Net profit nearly doubled to 730 million rupees from 377 million rupees year-over-year, reflecting improved operational efficiency and business growth.",
            "Sentiment": "positive",
            "PublishDate": 1760682896133,
            "Source": "earnings"
        },
        {
            "Title": "Acutaas Chemicals Limited Approves Q2 and Half-Year Financial Results",
            "Summary": "Acutaas Chemicals Limited's Board of Directors approved the unaudited standalone and consolidated financial results for the second quarter and half year ended September 30, 2025. The results include Balance Sheet and Cash Flow Statement for the half year period. The financial results were reviewed by the Audit Committee and received a Limited Review Report from the company's statutory auditors, Maheshwari & Co., Chartered Accountants. The board meeting was held on October 17, 2025, commencing at 11:00 A.M.",
            "Sentiment": "neutral",
            "PublishDate": 1760682857354,
            "Source": "earnings"
        },
        {
            "Title": "ACUTAAS Chemicals Shareholders Approve Re-appointment of Executive Directors and Independent Directors",
            "Summary": "ACUTAAS Chemicals Limited shareholders approved the re-appointment of key leadership positions at their Annual General Meeting held on September 25, 2025. Nareshkumar Ramjibhai Patel was re-appointed as Managing Director and Executive Chairman for five years from May 1, 2026 to April 30, 2031. Chetankumar Chhaganlal Vaghasia and Virendra Nath Mishra were re-appointed as Whole Time Directors for five-year terms starting May 1, 2026 and April 1, 2026 respectively. Two independent directors, Richa Manoj Goyal and Hetal Madhukant Gandhi, were also re-appointed for second terms of five consecutive years. Additionally, shareholders approved the appointment of M/s. KSPS & Co. LLP as Secretarial Auditors for a five-year term from FY 2025-26 to FY 2029-30.",
            "Sentiment": "positive",
            "PublishDate": 1758811478581,
            "Source": "corporate_governance"
        },
        {
            "Title": "Acutaas Chemicals Receives Platinum Medal from EcoVadis, Ranking in Top 1% Globally for Sustainability",
            "Summary": "Acutaas Chemicals Limited received a Platinum Medal accreditation from EcoVadis based on their sustainability scorecard published on August 26, 2025. This represents an upgrade from the company's previous Gold Medal rating. The Platinum Rating places Acutaas among the top 1% of companies assessed by EcoVadis globally for sustainability performance.",
            "Sentiment": "positive",
            "PublishDate": 1756287640433,
            "Source": "stock"
        },
        {
            "Title": "Acutaas Designates Abhishek Patel as Senior Management Person, Adjusts ESOS 2023 for Stock Split",
            "Summary": "Acutaas Chemicals Limited's Nomination and Remuneration Committee designated Mr. Abhishek Haribhai Patel, Vice President - Strategy, as a Senior Management Person effective July 30, 2025. Patel has been with the company since January 8, 2024, and previously served as Chief Financial Officer from 2018-2022, playing a key role in the company's 2021 IPO. He holds a Bachelor's degree in Engineering from Sardar Patel University and an MBA from ICFAI University. The committee also approved adjustments to the Employee Stock Option Scheme 2023 following a 1:2 stock split with record date April 25, 2025. Under Category I, 1,100 options granted on August 12, 2024 were adjusted to 2,200 options with exercise price reduced from Rs. 100 to Rs. 50 per option. Category II ungranted options increased from 3,34,370 to 6,68,740 options, with exercise price range adjusted from Rs. 10-610 per share to Rs. 5-305 per share. The adjustments maintain unchanged overall employee benefit values and do not require shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1753885162084,
            "Source": "corporate_action"
        },
        {
            "Title": "Acutaas Chemicals Reports Complete Utilization of INR 99.099 Crores Preferential Issue Proceeds",
            "Summary": "Acutaas Chemicals Limited confirmed complete utilization of INR 99.099 crores raised through a preferential issue of equity shares allotted on May 31, 2024. The company reported no deviations or variations in the use of funds for the quarter ended June 30, 2025. The funds were allocated as originally planned: INR 77 crores for capital expenditure related to electrolytes additives business and INR 22.099 crores for general corporate purposes. The company filed its compliance statement with BSE and NSE exchanges confirming adherence to the original fund utilization plan.",
            "Sentiment": "positive",
            "PublishDate": 1753878023433,
            "Source": "corporate_action"
        },
        {
            "Title": "ACUTAAS Chemicals MD Targets 25% Growth with Improved Margins for FY26",
            "Summary": "ACUTAAS Chemicals' Managing Director has expressed confidence in achieving 25% growth with better margins for FY26. The company leadership appears optimistic about the business outlook and margin improvement prospects.",
            "Sentiment": "positive",
            "PublishDate": 1753865209732,
            "Source": "stock"
        },
        {
            "Title": "Acutaas Chemicals Reports Strong Q1 Performance with 72% EBITDA Growth",
            "Summary": "Acutaas Chemicals delivered robust quarterly results with EBITDA rising to 509 million rupees from 295 million rupees year-over-year, representing significant growth. The company's EBITDA margin expanded to 24.56% compared to 16.71% in the same period last year. Revenue increased to 2.1 billion rupees from 1.71 billion rupees year-over-year, showing strong top-line growth alongside improved profitability margins.",
            "Sentiment": "positive",
            "PublishDate": 1753863518533,
            "Source": "earnings"
        },
        {
            "Title": "Acutaas Chemicals Approves Quarterly Financial Results",
            "Summary": "Acutaas Chemicals Limited's Board of Directors approved the company's unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The results were reviewed and recommended by the Audit Committee and accompanied by a limited review report from the company's statutory auditors, Maheshwari & Co., Chartered Accountants. The board meeting was held on July 30, 2025, commencing at 11:30 a.m. and concluding at 1:25 p.m.",
            "Sentiment": "neutral",
            "PublishDate": 1753863427628,
            "Source": "earnings"
        },
        {
            "Title": "Acutaas Chemicals Schedules Q1FY26 Earnings Conference Call for July 30, 2025",
            "Summary": "Acutaas Chemicals Limited has scheduled an earnings conference call on July 30, 2025, at 4:30 PM IST to discuss financial results for the first quarter ended June 30, 2025. The call will be hosted by JM Financial and will include key company executives: Chairman and Managing Director Naresh Patel, Vice President (Strategy) Abhishek Patel, and Chief Financial Officer Bhavin Shah. The company was formerly known as AMI Organics Limited and trades on BSE with scrip code 543349 and on NSE with symbol ACUTAAS. Multiple dial-in numbers are provided for domestic and international participants across USA, UK, Singapore, and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1753439826264,
            "Source": "earnings"
        },
        {
            "Title": "ACUTAAS CHEMICALS Board Meeting Scheduled for July 30, 2025 to Review Q1 Financial Results",
            "Summary": "ACUTAAS CHEMICALS LIMITED has scheduled a Board of Directors meeting for July 30, 2025, to consider and approve the unaudited standalone and consolidated financial results for the first quarter ended June 30, 2025. The meeting will be held at the company's registered office and will be preceded by an Audit Committee meeting on the same day. The trading window for designated persons remains closed from July 1, 2025 until August 1, 2025, which is 48 hours after the declaration of quarterly financial results. The company was formerly known as AMI ORGANICS LIMITED and trades on BSE with scrip code 543349 and on NSE with symbol ACUTAAS.",
            "Sentiment": "neutral",
            "PublishDate": 1753360051378,
            "Source": "corporate_action"
        },
        {
            "Title": "Acutaas Chemicals Invests Rs 49.99 Crores in Subsidiary for Semiconductor Specialty Chemicals Expansion",
            "Summary": "Acutaas Chemicals Limited has invested Rs 49.99 crores in its wholly-owned subsidiary Acutaas Advance Material Limited through a rights issue, subscribing to 30,48,780 equity shares at Rs 164 per share (Rs 10 face value plus Rs 154 premium). The company plans additional investments up to Rs 150 crores through loans or equity subscription to support expansion of specialty chemicals business for the semiconductor industry. The subsidiary, incorporated in September 2023, operates in specialty chemicals manufacturing for semiconductors with presence in India and a joint venture manufacturing facility in South Korea. The subsidiary reported turnover of Rs 73.35 lakhs in FY 2023-24 and Rs 30 lakhs in FY 2024-25. The first tranche investment will be completed within one month, with further investments planned by March 31, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1753270425320,
            "Source": "corporate_action"
        },
        {
            "Title": "Acutaas Chemicals' Subsidiary Enters Joint Venture in South Korea",
            "Summary": "Acutaas Chemicals' subsidiary Baml has entered into a joint venture with J & Materials in South Korea. Baml will invest 30 billion Korean Won in the joint venture company. The new entity will manufacture, distribute, supply, and sell specialty chemicals for the semiconductor industry in South Korea and other countries. The joint venture partners may also agree to produce and sell other products through this company.",
            "Sentiment": "positive",
            "PublishDate": 1751241527000,
            "Source": "default"
        },
        {
            "Title": "Acutaas Chemicals Forms Joint Venture for Specialty Chemicals in South Korea",
            "Summary": "Acutaas Chemicals has formed a joint venture with J & Materials to create and sell specialty chemicals for the semiconductor industry in South Korea and other nations. The joint venture involves an investment of KRW 30 billion in the new company.",
            "Sentiment": "positive",
            "PublishDate": 1751025883000,
            "Source": "default"
        },
        {
            "Title": "AMI Organics: Q4 Profit Doubles, Strong FY26 Growth Projected",
            "Summary": "AMI Organics reported Q4 net profit doubling to ₹53 crore, revenue up 37% to ₹308.5 crore, and EBITDA rising 97%. The company surpassed ₹1,000 crore in FY25 revenue and projects 25% revenue growth for FY26. Stock jumped 10% following results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1746174762000,
            "Source": "earnings"
        },
        {
            "Title": "AMI Organics Anticipates 25% Revenue Growth in FY26",
            "Summary": "AMI Organics' Managing Director has expressed confidence in achieving 25% revenue growth for the fiscal year 2026. The company expects robust growth across all its business segments, contributing to this projected increase.",
            "Sentiment": "positive",
            "PublishDate": 1746173004000,
            "Source": "default"
        },
        {
            "Title": "AMI Organics Reports Strong Q4 Financial Results",
            "Summary": "AMI Organics has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 841 million rupees from 401 million rupees in the previous year, with the EBITDA margin expanding to 27.6% from 18.2%. Revenue grew to 3 billion rupees from 2.2 billion rupees, while net profit rose to 628 million rupees from 321 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1746171762000,
            "Source": "result"
        },
        {
            "Title": "AMI Organics Declares Dividend",
            "Summary": "AMI Organics has announced a dividend of 1.5 rupees per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1746171188000,
            "Source": "result"
        }
    ]
}