{
    "Symbol": "ADANIPOWER",
    "ISIN": "INE814H01029",
    "News": [
        {
            "Title": "Adani Power incorporates nuclear energy subsidiary",
            "Summary": "Adani Power Limited has incorporated a wholly owned subsidiary, Adani Atomic Energy Limited, focused on nuclear energy generation with authorized capital of Rs. 5,00,000 divided into 50,000 equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1770862523947,
            "Source": "stocks"
        },
        {
            "Title": "Adani Power releases January 2026 investor presentation",
            "Summary": "Adani Power Limited has published its investor presentation for January 2026, providing stakeholders with updated company information and sector insights through multiple formats.",
            "Sentiment": "neutral",
            "PublishDate": 1769859346639,
            "Source": "stocks"
        },
        {
            "Title": "Adani Power Plans 24 GW Capacity Addition by FY32",
            "Summary": "Adani Power expects high power demand and improved merchant prices next year. The company plans to add 24 gigawatts of capacity over 6-7 years, targeting 42 gigawatts by FY31-32.",
            "Sentiment": "positive",
            "PublishDate": 1769743644409,
            "Source": "stocks"
        },
        {
            "Title": "Adani Power Q3 Net Profit Drops to ₹25B vs ₹30.6B YoY",
            "Summary": "Adani Power reports consolidated net profit of ₹25 billion for Q3, down from ₹30.6 billion year-on-year, missing analyst estimates of ₹31 billion.",
            "Sentiment": "negative",
            "PublishDate": 1769677037606,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Power Allots ₹7,500 Cr Debentures in Four Series",
            "Summary": "Adani Power Limited successfully allotted 7,50,000 secured non-convertible debentures worth ₹7,500 crore across four series with tenors ranging from 2-5 years and coupon rates of 8.00%-8.40%.",
            "Sentiment": "positive",
            "PublishDate": 1769530507397,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Power faces Bangladesh tariff dispute scrutiny",
            "Summary": "Bangladesh committee alleges Adani Power charges 50% above market rates for electricity from Godda plant, while company seeks Indian grid connectivity by December 2025 as potential relief measure.",
            "Sentiment": "negative",
            "PublishDate": 1769473400087,
            "Source": "stocks"
        },
        {
            "Title": "Adani Power Clarifies Position on US SEC Case",
            "Summary": "Adani Power states it is not a party to US SEC proceedings and confirms no allegations have been made against the company in the case.",
            "Sentiment": "neutral",
            "PublishDate": 1769473022866,
            "Source": "stocks"
        },
        {
            "Title": "Adani Power schedules Q3FY26 earnings call",
            "Summary": "Adani Power Limited announces earnings conference call for research analysts and institutional investors on January 29, 2026, to discuss Q3FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769007375579,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Power plans ₹7,500 cr NCD fundraise",
            "Summary": "Adani Power seeks to raise ₹7,500 crore through non-convertible debentures with 2-5 year tenors, supported by strong investor demand for corporate bonds.",
            "Sentiment": "positive",
            "PublishDate": 1768920124243,
            "Source": "stocks"
        },
        {
            "Title": "NCLAT upholds Adani Power's ₹4,000-cr VIPL plan",
            "Summary": "National Company Law Appellate Tribunal dismisses appeals against Adani Power's resolution plan for Vidarbha Industries Power Limited, confirming acquisition of 600 MW power asset.",
            "Sentiment": "positive",
            "PublishDate": 1768836077626,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Power Gets CARE AA Rating on ₹69,000 Cr Facilities",
            "Summary": "CareEdge Ratings assigns CARE AA; Stable rating to Adani Power's additional ₹12,000 crore term loan facilities and reaffirms ratings on existing ₹57,000 crore facilities, totaling ₹69,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1768315164887,
            "Source": "stocks"
        },
        {
            "Title": "JM Financial Initiates Buy On Adani Power At ₹178 Target",
            "Summary": "JM Financial initiates coverage on Adani Power with Buy rating and ₹178 target price, citing strong thermal power growth opportunity as India's peak demand projected to rise to 386GW by FY32.",
            "Sentiment": "positive",
            "PublishDate": 1768206492842,
            "Source": "stocks"
        },
        {
            "Title": "Adani Power Board Meet Set for Jan 29 for Q3 Results",
            "Summary": "Adani Power Limited has scheduled its board meeting for January 29, 2026, to approve Q3FY26 financial results for the quarter ended December 31, 2025, followed by an investor conference call.",
            "Sentiment": "neutral",
            "PublishDate": 1767795669040,
            "Source": "co_actions_results"
        },
        {
            "Title": "JM Financial initiates Adani Power coverage with Buy rating",
            "Summary": "JM Financial sets ₹178 target price for Adani Power, implying 22.8% upside. Brokerage cites strong execution capabilities and thermal power demand outlook for optimistic stance.",
            "Sentiment": "positive",
            "PublishDate": 1767610894323,
            "Source": "stocks"
        },
        {
            "Title": "Adani Power Wins SC Case on SEZ Customs Duty",
            "Summary": "Supreme Court rules that Adani Power will not be required to pay customs duty for electricity supplied from Special Economic Zones to the domestic market, providing significant regulatory relief.",
            "Sentiment": "positive",
            "PublishDate": 1767591487588,
            "Source": "stocks"
        },
        {
            "Title": "Adani Power Targets 41.9 GW Capacity by FY32",
            "Summary": "India's largest private thermal power producer aims to expand from current 18.1 GW to 41.9 GW capacity by FY32, with analysts setting ₹178 target price on superior operating metrics.",
            "Sentiment": "positive",
            "PublishDate": 1767377099478,
            "Source": "stocks"
        },
        {
            "Title": "Adani Power shares surge 7% on multi-year growth outlook",
            "Summary": "Adani Power shares jumped 7.1% to ₹153.20 as brokerages highlighted multi-year earnings upcycle driven by 2.3x capacity expansion to 41.9 GW by FY33E and strong PPA wins of 12.4 GW.",
            "Sentiment": "positive",
            "PublishDate": 1767262266464,
            "Source": "stocks"
        },
        {
            "Title": "Adani Power announces senior management change",
            "Summary": "Adani Power Limited announces cessation of Mr. Sameer Ganju as Senior Management Personnel effective December 26, 2025, as part of ongoing transition process across Adani Group.",
            "Sentiment": "neutral",
            "PublishDate": 1766838190812,
            "Source": "stocks"
        },
        {
            "Title": "Adani Power Targets 41.87 GW Capacity by FY32",
            "Summary": "Adani Power raises capacity target to 41.87 GW by FY32 with ₹2 lakh crore capex commitment, marking aggressive thermal power expansion with 23.72 GW additional pipeline secured.",
            "Sentiment": "positive",
            "PublishDate": 1766589956899,
            "Source": "stocks"
        },
        {
            "Title": "Antique Initiates 'Buy' on Adani Power at ₹187 Target",
            "Summary": "Antique Stock Broking has initiated a 'Buy' rating on Adani Power with a price target of ₹187, marking a positive outlook for the power generation company's stock performance.",
            "Sentiment": "positive",
            "PublishDate": 1765856743432,
            "Source": "stocks"
        },
        {
            "Title": "Adani Power Gets ESG Score of 65 from NSE Analytics",
            "Summary": "Adani Power Limited receives an ESG score of 65 from NSE Sustainability Ratings & Analytics, placing it in the 'Aspiring ESG' rating category and leading the thermal power sector in ESG performance.",
            "Sentiment": "positive",
            "PublishDate": 1765822587457,
            "Source": "stocks"
        },
        {
            "Title": "Morgan Stanley Maintains Overweight on Adani Power",
            "Summary": "Morgan Stanley maintains 'Overweight' rating on Adani Power with a price target of ₹185.00, reflecting positive outlook on the power generation company's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1765510617283,
            "Source": "stocks"
        },
        {
            "Title": "Adani Power Deal Delayed by UP Regulator Over Cost Clarity Issues",
            "Summary": "The Uttar Pradesh Power Regulator has postponed approval of a power supply agreement with Adani Power due to insufficient clarity regarding the associated costs. The delay affects Adani Power's business operations and potentially impacts power supply arrangements in the state.",
            "Sentiment": "negative",
            "PublishDate": 1763608560261,
            "Source": "stock"
        },
        {
            "Title": "Adani Power Secures Major 3,200 MW Power Plant Order from Assam, Morgan Stanley Raises Target Price to Rs 185",
            "Summary": "Adani Power received a Letter of Award from Assam Power Distribution Company to develop and operate a 3,200 MW ultra-supercritical thermal power plant under DBFOO model, with commissioning expected between December 2030-2032. Morgan Stanley raised the target price to Rs 185 from Rs 163, projecting the company's market share to rise to 15% by FY32 with a 41.9 GW portfolio and 20% EBITDA CAGR over FY25-FY33.",
            "Sentiment": "positive",
            "PublishDate": 1763091996241,
            "Source": "stock"
        },
        {
            "Title": "Adani Power Wins Bihar's 2,400 MW Bhagalpur Power Project With Lowest Bid of Rs 6.075 Per kWh",
            "Summary": "The Bihar government awarded the 2,400 MW Bhagalpur power project to Adani Power after a competitive bidding process. Adani Power quoted the lowest electricity tariff at Rs 6.075 per kWh, beating three other bidders including Torrent Power (Rs 6.145), Lalitput Power Generation (Rs 6.165), and JSW Energy (Rs 6.205). The project requires an investment of around Rs 30,000 crore and aims to meet Bihar's electricity demand, projected to double to over 17,000 MW by 2034-35. The award has sparked political controversy, with Congress alleging inflated pricing and favoritism. However, sources indicate the tariff is competitive compared to recent bids in other states. The project is expected to boost industrial activity and employment in Bihar, a state that has seen limited private investment over the past 50 years.",
            "Sentiment": "neutral",
            "PublishDate": 1762514451231,
            "Source": "order&deals"
        },
        {
            "Title": "Adani Power Continues Bangladesh Electricity Supply Despite Billing Disputes",
            "Summary": "Adani Power maintains electricity supply to Bangladesh Power Development Board with regular payments being received. The company has reported disagreements over cost calculations and billing matters with the Bangladesh Power Development Board. Adani Power will utilize dispute resolution processes to address these billing disagreements.",
            "Sentiment": "neutral",
            "PublishDate": 1762175278566,
            "Source": "stock"
        },
        {
            "Title": "Adani Power Emerges as Lowest Bidder for 3.2 GW Coal Power Project in Assam",
            "Summary": "Adani Power has become the lowest bidder for a 3.2 GW coal power project in Assam. The development was shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1761888942618,
            "Source": "stock"
        },
        {
            "Title": "Adani Power Plans to More Than Double Capacity to 41,870 MW by FY32",
            "Summary": "Adani Power announced plans to expand its total capacity from the current 18,150 MW to 41,870 MW by FY32, with 23,720 MW already locked-in. The company secured 6.6 GW of new power purchase agreements across Bihar, Madhya Pradesh, and Karnataka under the SHAKTI Policy. Financial targets include EBITDA above ₹24,000 crore in FY26, net debt-to-EBITDA ratio at 1.75×, and return on capital employed near 20 percent. The company reported 7 percent year-on-year growth in thermal and merchant volumes, with expansion to Pirpainti and Anuppur facilities driving the next growth phase.",
            "Sentiment": "positive",
            "PublishDate": 1761838526856,
            "Source": "stock"
        },
        {
            "Title": "Adani Power Approves Amalgamation Plan for Fully Owned Subsidiaries",
            "Summary": "Adani Power has approved an amalgamation plan involving its fully owned subsidiaries. The company is proceeding with a consolidation strategy that will merge these subsidiary entities.",
            "Sentiment": "neutral",
            "PublishDate": 1761812090582,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Power Reports Mixed Q2 Results with Revenue Growth but Lower Profit",
            "Summary": "Adani Power reported quarterly consolidated net profit of 29 billion rupees, down from 33 billion rupees in the same period last year. Revenue increased to 135 billion rupees from 133.4 billion rupees year-over-year. EBITDA declined to 51.5 billion rupees from 52.76 billion rupees, while EBITDA margin compressed to 38.27% from 39.55% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1761811750775,
            "Source": "earnings"
        },
        {
            "Title": "Adani Power Sees Rs. 19.73 Crore Block Trade on NSE",
            "Summary": "Adani Power Ltd. recorded a block trade worth Rs. 19.73 crores on the National Stock Exchange. The transaction involved approximately 1,188,768 shares at a price of Rs. 166.01 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1761209592468,
            "Source": "order&deals"
        },
        {
            "Title": "Adani Power Shares Rise 4% on Grid Connection Approval and Bhutan Joint Venture",
            "Summary": "Adani Power shares gained 4.4% to Rs 164.38 after the centre approved the company's proposal to connect its Godda Ultra Super Critical Thermal Power Plant to the Indian grid through an overhead transmission line. The plant currently supplies electricity exclusively to Bangladesh. The company also formed a joint venture with Bhutan's Druk Green Power Corporation for a 570 MW hydroelectric project, with shareholding of 49:51 respectively. Morgan Stanley initiated coverage with an Overweight rating, expecting the company to expand its portfolio from 18.15 GW to 41.9 GW by FY32. In quarterly results, consolidated net profit fell 15.5% year-on-year to Rs 3,305 crore, while revenue declined 5.9% to Rs 14,167 crore. However, profit rose 27.1% sequentially from the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1760677823298,
            "Source": "stock"
        },
        {
            "Title": "Adani Power Sees Rs 2,194 Crore Block Trade on BSE",
            "Summary": "Adani Power executed a block trade worth Rs 2,194.19 crore on BSE involving approximately 140.22 million shares at a price of Rs 156.48 per share at market open.",
            "Sentiment": "neutral",
            "PublishDate": 1760587165011,
            "Source": "order&deals"
        },
        {
            "Title": "Adani Power Sees Rs 269.67 Crore Block Trade on BSE",
            "Summary": "Adani Power witnessed a block trade worth Rs 269.67 crore on BSE involving approximately 17.89 million shares at a price of Rs 150.75 per share. The transaction took place at market opening.",
            "Sentiment": "neutral",
            "PublishDate": 1759895773934,
            "Source": "order&deals"
        },
        {
            "Title": "Adani Power Sees Two Large Block Trades Worth Rs. 443 Crores on NSE",
            "Summary": "Adani Power witnessed two significant block trades on the NSE. The first transaction involved 4,144,554 shares at Rs. 147.54 per share, totaling Rs. 61.15 crores. The second larger transaction comprised 26,289,184 shares at Rs. 145.28 per share, amounting to Rs. 381.93 crores. Combined, these block trades involved over 30 million shares worth approximately Rs. 443 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1759463236723,
            "Source": "order&deals"
        },
        {
            "Title": "Adani Power Shares Surge 6% After Chairman's Letter Following Two-Day Selloff",
            "Summary": "Adani Power shares climbed 6.3% to Rs 154 after dropping nearly 21% over two sessions. The recovery followed a letter from Chairman Gautam S. Adani to shareholders addressing the Hindenburg report impact and SEBI's dismissal of allegations against the group. The previous decline came after profit booking following a 1:5 stock split and a 35% rally driven by positive brokerage reports and regulatory clearance news. In his letter, Adani highlighted the group's financial performance, noting portfolio EBITDA growth from Rs 57,205 crore in FY23 to Rs 89,806 crore in FY25, representing 57% growth. The group's gross block expanded by Rs 2 lakh crore over two years, reaching Rs 6,09,133 crore in FY25. Key milestones included commissioning India's first container transhipment port at Vizhinjam, adding 6 GW of renewable capacity, and expanding the energy network with 7,000 circuit kms of transmission lines.",
            "Sentiment": "positive",
            "PublishDate": 1758778569538,
            "Source": "stock"
        },
        {
            "Title": "Adani Power Surges 6.6% Leading Adani Group Rally",
            "Summary": "Adani Power shares rose 6.6% to Rs 154 on NSE, leading gains among Adani Group stocks. The stock was trading 4.67% higher at Rs 151.2, significantly outperforming the Nifty 50's 0.05% advance. Adani Total Gas followed with nearly 5% intraday gains. Weekly performance shows Adani Power up 8% and Adani Total Gas up 7%, with monthly gains of 19% and 13% respectively. Trading volume reached 5.7 times the 30-day average. All five analysts covering Adani Power maintain 'buy' ratings with a consensus target price of Rs 140.88. Most Adani Group stocks traded higher, including Adani Green, Adani Enterprises, and Adani Ports, all gaining around 1%.",
            "Sentiment": "positive",
            "PublishDate": 1758774714302,
            "Source": "stock"
        }
    ]
}