{
    "Symbol": "ADANIPORTS",
    "ISIN": "INE742F01042",
    "News": [
        {
            "Title": "Adani Ports Launches $495M Tender Offer for Senior Notes",
            "Summary": "Adani Ports and Special Economic Zone Limited announces cash tender offers for up to $345.14M of 4.0% Senior Notes due 2027 and $150M of 3.10% Senior Notes due 2031, offering early tender premiums.",
            "Sentiment": "neutral",
            "PublishDate": 1770683516083,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Ports Block Trade Worth Rs 361.56 Crore on NSE",
            "Summary": "Adani Ports & SEZ witnessed a significant block trade on NSE involving approximately 2.3 million shares valued at Rs 361.56 crore, executed at Rs 1569.3 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1770349986529,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Ports Plans ₹16,000 Cr Vizhinjam Expansion",
            "Summary": "Adani Ports announces Phase 2 expansion at Vizhinjam port with ₹16,000 crore investment, targeting capacity increase from 1.6 million TEUs to 5.7 million TEUs by FY30.",
            "Sentiment": "positive",
            "PublishDate": 1770176692007,
            "Source": "stocks"
        },
        {
            "Title": "Adani Ports CFO Change: Menon Replaces Muthukumaran",
            "Summary": "Adani Ports announces CFO transition as D. Muthukumaran steps down February 28, 2026, with Sreedhar Krishna Menon taking over March 1, 2026. Board approves Q3 FY26 results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770125816192,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Ports Raises FY26 EBITDA Forecast by ₹8 Billion",
            "Summary": "Adani Ports & SEZ has revised its FY26 EBITDA forecast upward to ₹2.28 billion, representing an increase of ₹8 billion, while projecting revenue to reach ₹380 billion for the fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1770106043276,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Ports Reports Strong 12% Growth in January",
            "Summary": "Adani Ports handled 44.8 million metric tons of cargo in January 2026, marking 12% YoY growth with containers up 16%, liquids up 21%, and dry cargo up 8%.",
            "Sentiment": "positive",
            "PublishDate": 1770035037757,
            "Source": "stocks"
        },
        {
            "Title": "Adani Ports Gets A- Credit Rating from Japan Agency",
            "Summary": "Japan Credit Rating Agency assigns A-/Stable ratings to Adani Ports for both foreign and local currency long-term issuer categories, marking the company's first ratings from the Japanese agency.",
            "Sentiment": "positive",
            "PublishDate": 1769695169143,
            "Source": "stocks"
        },
        {
            "Title": "Adani Ports Creates New UAE Subsidiary",
            "Summary": "AOP Marine Agency Services LLC establishes AOP Marine and Logistics Services LLC in UAE with 80% indirect stake through Adani Ports & SEZ Ltd, expanding Middle East operations.",
            "Sentiment": "positive",
            "PublishDate": 1769658908004,
            "Source": "stocks"
        },
        {
            "Title": "SC Overturns HC Order on Adani Ports Gujarat Land",
            "Summary": "Supreme Court sets aside High Court order directing return of land allotted to Adani Ports in Gujarat, providing relief to the port operator in ongoing land dispute case.",
            "Sentiment": "positive",
            "PublishDate": 1769499794084,
            "Source": "stocks"
        },
        {
            "Title": "Adani Ports Clarifies US Legal Summons Media Report",
            "Summary": "Adani Ports and Special Economic Zone Limited responds to stock exchange queries regarding media reports about US regulator seeking legal summons, stating no disclosure requirements triggered.",
            "Sentiment": "neutral",
            "PublishDate": 1769193929202,
            "Source": "stocks"
        },
        {
            "Title": "Adani Ports Director Rajkumar Beniwal Resigns",
            "Summary": "Adani Ports and Special Economic Zone Limited announces resignation of Director Mr. Rajkumar Beniwal, IAS, Vice Chairman & CEO of Gujarat Maritime Board, effective January 19, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768831786590,
            "Source": "stocks"
        },
        {
            "Title": "Adani Ports Board Meet Set for Feb 3 to Review Q3 Results",
            "Summary": "Adani Ports and Special Economic Zone Limited has scheduled its board meeting for February 3, 2026, to consider Q3FY26 financial results. Trading window remains closed from January 1 until 48 hours post-announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1768576514925,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Ports' Auditor Converts to LLP Structure",
            "Summary": "Adani Ports and Special Economic Zone Limited announces that its statutory auditor M S K A & Associates has converted into a Limited Liability Partnership effective January 13, 2026, while continuing audit obligations.",
            "Sentiment": "neutral",
            "PublishDate": 1768576264252,
            "Source": "stocks"
        },
        {
            "Title": "Adani Ports Receives 'Excellent' ESG Rating of 76",
            "Summary": "Adani Ports and Special Economic Zone Limited has been assigned an 'Excellent' ESG rating of 76 by ESG Risk Assessments and Insights Limited, reflecting the company's position as an ESG leader with robust risk management framework.",
            "Sentiment": "positive",
            "PublishDate": 1768478421875,
            "Source": "stocks"
        },
        {
            "Title": "Moody's Upgrades Outlook on Multiple Adani Entities",
            "Summary": "Moody's Ratings upgraded outlook to stable from negative for Adani Transmission Step-One, Adani Electricity Mumbai, and Adani Ports, while reaffirming Baa3 investment grade ratings across entities.",
            "Sentiment": "positive",
            "PublishDate": 1768478374441,
            "Source": "stocks"
        },
        {
            "Title": "Adani Ports in Focus After Rs 1.5L Cr Investment Plan",
            "Summary": "Adani Group announces Rs 1.5 lakh crore investment over five years in Gujarat's Kutch region, including doubling Mundra port capacity and completing 37 GW Khavda renewable energy project by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1768189165875,
            "Source": "stocks"
        },
        {
            "Title": "Adani Ports Plans ₹1.5 Lakh Crore Kutch Investment",
            "Summary": "Karan Adani announces massive ₹1.5 lakh crore investment in Kutch region over five years, alongside plans to double Mundra port capacity in next decade.",
            "Sentiment": "positive",
            "PublishDate": 1768188927678,
            "Source": "stocks"
        },
        {
            "Title": "Adani Ports Schedules EGM for February 2, 2026",
            "Summary": "Adani Ports and Special Economic Zone Limited announces Extraordinary General Meeting on February 2, 2026 to approve material related party transactions involving subsidiaries worth ~USD 2.54 billion.",
            "Sentiment": "neutral",
            "PublishDate": 1768053493939,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Ports shares in focus after 9% cargo growth",
            "Summary": "Adani Ports shares likely in focus after reporting 9% YoY cargo growth in December 2025. Container volumes surged 18% while YTD cargo reached 367.3 MMT with 11% growth. Stock gained 24.46% over past year.",
            "Sentiment": "positive",
            "PublishDate": 1767619961738,
            "Source": "stocks"
        },
        {
            "Title": "Mumbai Airport Clarifies Cargo Operations Continue",
            "Summary": "Mumbai Airport denies complete cargo shutdown reports, confirms only freighter operations suspended during Aug 2026-May 2027 infrastructure works while 65% cargo continues via passenger flights.",
            "Sentiment": "neutral",
            "PublishDate": 1767496536295,
            "Source": "stocks"
        },
        {
            "Title": "Adani Ports Completes NQXT Australia Acquisition",
            "Summary": "APSEZ finalizes acquisition of North Queensland Export Terminal through equity allotment, raising FY26 EBITDA guidance to ₹22,350-23,350 crores and cargo volume target to 545-555 MMT.",
            "Sentiment": "positive",
            "PublishDate": 1766487229277,
            "Source": "co_actions_results"
        },
        {
            "Title": "LIC reduces stake in Adani Ports to 7.34%",
            "Summary": "Life Insurance Corporation of India disclosed a substantial reduction in its shareholding in Adani Ports and Special Economic Zone Ltd from 9.35% to 7.34% through market sales.",
            "Sentiment": "neutral",
            "PublishDate": 1765516230354,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Ports Receives ESG Score of 66 from NSE Sustainability Ratings",
            "Summary": "NSE Sustainability Ratings & Analytics independently assigned Adani Ports and Special Economic Zone Limited an ESG score of 66 for FY2025, placing the company in the Aspiring ESG rating category. The rating was prepared without company engagement, using publicly available data, and has been disclosed to stock exchanges as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1765352943525,
            "Source": "stock"
        },
        {
            "Title": "Motherson Partners with Adani Ports to Develop RoRo Terminal at Dighi Port",
            "Summary": "Motherson's joint venture SAMRX has announced an agreement with Dighi Port Limited, a subsidiary of Adani Ports and SEZ, to establish a dedicated Roll-on/Roll-off terminal at Dighi Port in Maharashtra for finished vehicle logistics. The state-of-the-art terminal will handle end-to-end finished vehicle logistics with an annual capacity of 200,000 cars, offering comprehensive services including yard management, AI-based inspection technologies, EV charging infrastructure, and customs clearance.",
            "Sentiment": "positive",
            "PublishDate": 1764914956317,
            "Source": "order&deals"
        },
        {
            "Title": "Adani Ports Reports Strong Growth with 41 MMT Cargo in November, 14% YoY Increase",
            "Summary": "Adani Ports And Special Economic Zone handled 41 MMT of cargo in November 2025, marking a 14% year-over-year growth, with container volumes surging 20% YoY. The company's year-to-date cargo reached 325.4 MMT, representing an 11% increase compared to the previous year, demonstrating robust operational performance across its port facilities.",
            "Sentiment": "positive",
            "PublishDate": 1764646689348,
            "Source": "stock"
        },
        {
            "Title": "CRISIL Reaffirms AAA Credit Ratings for Adani Ports Across Multiple Instruments",
            "Summary": "CRISIL Ratings Limited reaffirmed AAA/Stable ratings for Adani Ports and Special Economic Zone Limited's bank facilities worth Rs. 10,020 crore and non-convertible debentures worth Rs. 17,252 crore, along with A1+ rating for commercial paper worth Rs. 6,700 crore. The rating reaffirmation maintains the company's highest credit quality status across its debt instruments totaling Rs. 33,972 crore.",
            "Sentiment": "positive",
            "PublishDate": 1763658221009,
            "Source": "stock"
        },
        {
            "Title": "Adani Ports Joins TNFD As Adopter, Commits to Nature-Related Disclosure by FY26",
            "Summary": "Adani Ports has joined the Task Force on Nature-related Financial Disclosures (TNFD) as an adopter and has committed to implementing nature-related financial disclosures by FY26. This move positions the company among organizations that will provide transparency on nature-related risks and dependencies in their financial reporting.",
            "Sentiment": "positive",
            "PublishDate": 1762925766114,
            "Source": "stock"
        },
        {
            "Title": "Adani Ports Sets Financial Targets with EBITDA Guidance of INR 21,000-22,000 Crores",
            "Summary": "Adani Ports announced its financial guidance and operational targets. The company aims to maintain a net debt-to-EBITDA ratio of 2.5x and expects to achieve cargo volume of 505-510 million metric tonnes this fiscal year. Full year EBITDA guidance is set at INR 21,000-22,000 crores. For domestic ports, the company provided long-term margin guidance of 75-77%. Logistics margins are targeted at 40-45% for non-IFN and non-trading business over time.",
            "Sentiment": "positive",
            "PublishDate": 1762399342192,
            "Source": "stock"
        },
        {
            "Title": "Adani Ports Shareholders Approve Appointment of Manish Kejriwal as Independent Director",
            "Summary": "Adani Ports and Special Economic Zone Limited shareholders approved the appointment of Manish Kejriwal (DIN: 00040055) as an Independent Director through postal ballot. The e-voting process conducted from October 5, 2025 to November 3, 2025 through MUFG Intime India Private Limited saw 99.34% of total votes polled in favor of the special resolution, with only 0.66% voting against. A total of 2,653 equity shareholders participated in the remote e-voting process. The scrutinizer Chirag Shah confirmed the resolution was duly passed with the requisite majority.",
            "Sentiment": "positive",
            "PublishDate": 1762296997601,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Ports Reports Strong Q2 Results with ₹3,120 Crore Net Profit, Approves Subsidiary Merger",
            "Summary": "Adani Ports and Special Economic Zone Limited reported consolidated net profit of ₹3,120 crore for the quarter ended September 30, 2025, compared to ₹2,413 crore in the same period last year. Revenue from operations increased to ₹5,167 crore from ₹4,670 crore year-on-year. For the half-year period, net profit rose to ₹6,431 crore from ₹5,528 crore previously. The company's Board also approved a scheme of amalgamation of its wholly-owned subsidiary Adani Harbour Services Limited with the parent company, subject to regulatory approvals. The merger aims to reduce administrative work and realize operational synergies. The company completed a tender offer to buy back $386 million worth of senior notes across three tranches during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762243299353,
            "Source": "earnings"
        },
        {
            "Title": "Adani Ports Reports Strong Q2 Results with Revenue Up 30% and Net Profit Rising 27%",
            "Summary": "Adani Ports delivered robust quarterly results with revenue increasing to 91.7 billion rupees from 70.7 billion rupees year-over-year. The company reported consolidated net profit of 31 billion rupees compared to 24.5 billion rupees in the same period last year. EBITDA figures showed mixed reporting with one statement indicating 44.6 billion rupees versus 31.30 billion rupees year-over-year with margin improvement to 48.65% from 44.30%, while another company statement reported EBITDA of 55.50 billion rupees versus 43.69 billion rupees with margin at 60.54% compared to 61.82% previously. The company maintained its cargo volume target of 505-515 million tons for the fiscal year and expects capital expenditure between 110-120 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1762242101829,
            "Source": "earnings"
        },
        {
            "Title": "Fitch Upgrades Adani Ports Outlook to Stable, Affirms BBB- Rating",
            "Summary": "Fitch Ratings upgraded Adani Ports and Special Economic Zone Ltd.'s outlook to 'Stable' from 'Negative' while affirming its 'BBB-' rating for Long-Term Foreign-Currency Issuer Default Rating and unsecured note rating. The rating agency cited easing contagion risk as the Adani Group demonstrated access to diversified funding sources despite the November 2024 US indictment relating to certain board members of Adani Green Energy Ltd. SEBI ruled in September that Adani Group did not violate regulatory disclosure norms or constitute market manipulation as alleged in the 2023 Hindenburg report. The group continued investing in projects with increased capital expenditure in the first half of the financial year ending March 2026. Fitch expects liquidity and funding to remain aligned with the rating, supported by cash flow from a seaports portfolio, capex flexibility, and demonstrated credit market access. The agency noted that risks remain manageable despite uncertainty about the US investigation outcome and timing. Adani Ports benefits from geographically diversified port locations, advanced intermodal connectivity, and operational efficiency, enabling high customer retention through comprehensive infrastructure handling various cargoes.",
            "Sentiment": "positive",
            "PublishDate": 1762232820143,
            "Source": "stock"
        },
        {
            "Title": "Adani Ports Reports 6% Growth in Cargo Volume to 40.2 MMT in October",
            "Summary": "Adani Ports and Special Economic Zone Limited handled 40.2 MMT of port cargo volume in October, representing a 6% year-over-year increase, driven by container volumes which grew 24% year-over-year. For the year-to-date period through October, the company handled 284.4 MMT of port cargo, marking a 10% year-over-year growth with containers leading at 21% growth. In logistics operations, rail volume reached 60,387 TEUs in October, up 16% year-over-year, while GPWIS volume was 1.7 MMT, down 6% year-over-year. Year-to-date logistics rail volume stood at 418,793 TEUs, showing significant growth of 415% year-over-year, and GPWIS volume reached 12.7 MMT, up 41% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762140190450,
            "Source": "stock"
        },
        {
            "Title": "Adani Ports Receives ESG Rating Upgrade from MSCI",
            "Summary": "Adani Ports and Special Economic Zone Limited announced it received an upgrade in its Environmental, Social and Governance (ESG) rating from CCC to B by Morgan Stanley Capital International (MSCI) ESG Ratings. The company stated this upgrade reflects its continued commitment to improve ESG performance.",
            "Sentiment": "positive",
            "PublishDate": 1761893684712,
            "Source": "stock"
        },
        {
            "Title": "Adani Ports Explores Investment in Vadhvan Port Projects Through Non-Binding MOUs",
            "Summary": "Adani Ports has clarified that it is exploring investment opportunities in Vadhvan Port projects. The company has entered into non-binding memorandums of understanding (MOUs) with JNPT for the Vadhvan Port development. These MOUs represent the company's interest in the project but do not constitute a firm commitment to invest.",
            "Sentiment": "neutral",
            "PublishDate": 1761752073347,
            "Source": "stock"
        },
        {
            "Title": "Adani Ports Sees Block Trade Worth Rs. 63.46 Crores on NSE",
            "Summary": "Adani Ports and Special Economic Zone Ltd. witnessed a block trade on the National Stock Exchange valued at Rs. 63.46 crores. The transaction involved approximately 430,873 shares executed at a price of Rs. 1,472.90 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1760587638635,
            "Source": "order&deals"
        },
        {
            "Title": "Adani Ports Block Trade Worth Rs. 73.79 Crores Executed on NSE",
            "Summary": "Adani Ports and Special Economic Zone Ltd. saw a block trade executed on the National Stock Exchange involving approximately 512,956 shares at a price of Rs. 1,438.50 per share. The total transaction value amounted to Rs. 73.79 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1760500976432,
            "Source": "order&deals"
        },
        {
            "Title": "Adani Ports Sees Rs. 163.36 Crore Block Trade on NSE",
            "Summary": "Adani Ports and Special Economic Zone Ltd. witnessed a block trade worth Rs. 163.36 crores on the National Stock Exchange. The transaction involved approximately 1,135,463 shares at a price of Rs. 1,438.70 per share at market open.",
            "Sentiment": "neutral",
            "PublishDate": 1760413951450,
            "Source": "order&deals"
        },
        {
            "Title": "Adani Ports ESG Score Improves to 66, Moves to Top 96 Percentile in Transportation Sector",
            "Summary": "Adani Ports and Special Economic Zone Limited reported an improvement in its ESG score from 65 to 66 in the Corporate Sustainability Assessment dated October 8, 2025. The company advanced from the top 95 percentile to the top 96 percentile within the Transportation and Transportation Infrastructure sector. Adani Ports maintains the highest score in the environmental dimension among its sector peers.",
            "Sentiment": "positive",
            "PublishDate": 1760108631956,
            "Source": "stock"
        },
        {
            "Title": "Navi Mumbai Airport Set for First Passenger Flight in December",
            "Summary": "Navi Mumbai International Airport will commence passenger flight operations in December. Arun Bansal, CEO of Adani Airports, announced the timeline but noted that the specific airline for the inaugural flight has not been determined. Bansal indicated that Adani maintains positive relationships with all carriers.",
            "Sentiment": "positive",
            "PublishDate": 1759743899377,
            "Source": "stock"
        },
        {
            "Title": "Adani Ports Seeks Shareholder Approval for Manish Kejriwal's Independent Director Appointment",
            "Summary": "Adani Ports and Special Economic Zone Limited has issued a postal ballot notice dated October 3, 2025, seeking shareholder approval for the appointment of Manish Kejriwal as an Independent Director. Kejriwal was appointed as Additional Director on August 5, 2025, for a three-year term. The 57-year-old is Founder and Managing Partner of Kedaara Capital, a private equity firm managing over $6 billion. He previously founded Temasek Holdings' India office and was a Partner at McKinsey & Company. The e-voting period runs from October 5, 2025 (9:00 AM) to November 3, 2025 (5:00 PM). Kejriwal currently serves as director on several boards including Bajaj Finserv Limited and Alembic Pharmaceuticals Limited. CS Chirag Shah has been appointed as scrutinizer for the postal ballot process.",
            "Sentiment": "neutral",
            "PublishDate": 1759500945040,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Ports Reports Record Rail Volumes and 22% TEU Growth in September",
            "Summary": "Adani Ports achieved record logistics rail volumes in H1 FY26. The company reported 22% year-over-year growth in TEUs (Twenty-foot Equivalent Units) for September, while GPWIS remained unchanged during the period.",
            "Sentiment": "positive",
            "PublishDate": 1759463230762,
            "Source": "stock"
        },
        {
            "Title": "Adani Ports Reports 11% Cargo Volume Growth and Record H1 Performance",
            "Summary": "Adani Ports achieved 11% cargo volume growth in September. The company set a record in H1 FY26 with 244.2 MMT cargo handling. Container volume increased 20% year over year during this period.",
            "Sentiment": "positive",
            "PublishDate": 1759462897938,
            "Source": "stock"
        },
        {
            "Title": "Adani Ports Chairman Addresses Shareholders Following SEBI Dismissal of Hindenburg Allegations",
            "Summary": "Gautam Adani, Chairman of Adani Ports and Special Economic Zone Limited, issued a letter to shareholders addressing the aftermath of Hindenburg's January 24, 2023 report and SEBI's recent dismissal of allegations against the Adani Group. Adani stated that SEBI delivered an 'unequivocal verdict dismissing the allegations' and described it as validation of the company's transparency and governance. He highlighted the group's financial performance during this period, with portfolio EBITDA growing from ₹57,205 crores in FY23 to ₹89,806 crores in FY25, representing 57% absolute growth and 25% two-year CAGR. The Gross Block expanded from ₹4,12,318 crores to ₹6,09,133 crores over the same period, adding nearly ₹2 lakh crores. Key projects completed include India's first container transshipment port at Vizhinjam, 6 GW of renewable capacity including the Khavda project, the world's largest copper smelter complex, and 7,000 circuit kms of transmission lines with 4 GW of new thermal capacity. Adani committed to strengthening governance standards, accelerating innovation and sustainability, and continuing infrastructure investments for India's growth.",
            "Sentiment": "positive",
            "PublishDate": 1758692229757,
            "Source": "stock"
        },
        {
            "Title": "Adani Ports Agrees to Increase Sri Lanka Container Terminal Capacity Ahead of Schedule",
            "Summary": "Adani Ports has agreed to boost the container terminal capacity at its Sri Lanka facility before the scheduled deadline. The agreement involves expanding operational capacity at the terminal ahead of the originally planned timeline.",
            "Sentiment": "positive",
            "PublishDate": 1758094888535,
            "Source": "stock"
        },
        {
            "Title": "Adani Ports Subsidiary Acquires Dependencia Logistics for ₹37.77 Crore",
            "Summary": "Mandhata Build Estate, a subsidiary of Adani Ports, has purchased the full stake in Dependencia Logistics for ₹37.77 crore. The acquisition is aimed at expanding the company's logistics operations.",
            "Sentiment": "positive",
            "PublishDate": 1757521557669,
            "Source": "order&deals"
        },
        {
            "Title": "Adani Ports Board Approves Rs 6,000 Crore Non-Convertible Debenture Issuance",
            "Summary": "Adani Ports and Special Economic Zone Limited's Board of Directors approved the issuance of Non-Convertible Debentures up to Rs 6,000 crore on a private placement basis. The secured, rated, listed, redeemable debentures will be issued in one or more tranches for capital expenditure, refinancing existing debt, and general corporate purposes. The debentures are proposed to be listed on BSE Limited and/or National Stock Exchange of India Limited. The tenure, coupon rate, interest payment schedule, and security details will be determined at the time of issue. The terms may include call and put options as determined from time to time.",
            "Sentiment": "neutral",
            "PublishDate": 1757082219356,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Ports Breaks Ground on ₹600 Crore Logistics Park in Kochi",
            "Summary": "Adani Ports and Special Economic Zone Limited announced the groundbreaking of Adani Logistics Park in Kalamassery, Kochi. The project spans 70 acres and involves an investment of over ₹600 crore under the Invest in Kerala program. The facility will feature 1.3 million sq. ft. of integrated logistics infrastructure with smart and sustainable features including EV charging stations and digital integration. The park is expected to create over 1,500 jobs and serve key sectors including e-commerce, FMCG/FMCD, pharmaceuticals, automotive, and retail. Kerala Chief Minister Pinarayi Vijayan will inaugurate the project. The facility aims to reduce transportation costs, enable just-in-time operations, and enhance export capabilities while creating opportunities for SMEs within the supply chain ecosystem.",
            "Sentiment": "positive",
            "PublishDate": 1755928013809,
            "Source": "stock"
        },
        {
            "Title": "Adani Ports Announces Late Results of $450 Million Senior Notes Tender Offers",
            "Summary": "Adani Ports and Special Economic Zone Limited announced the late results of its tender offers to repurchase senior notes across three series. The company sought to purchase up to $125 million of 4.20% Senior Notes due 2027, $200 million of 4.0% Senior Notes due 2027, and $125 million of 4.375% Senior Notes due 2029. The tender offers expired on August 13, 2025. For the 4.2% Notes, the aggregate principal amount tendered before the early deadline exceeded the maximum acceptance amount, so no additional notes were accepted. After the early tender date, the company received valid tenders of $700,000 for 4.0% Notes and $950,000 for 4.375% Notes, which will be accepted without proration. The final settlement date is expected around August 18, 2025. The company indicated it may undertake further liability management exercises as part of its capital management plan.",
            "Sentiment": "neutral",
            "PublishDate": 1755130679820,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Ports Provides Web Link for Earnings Call Transcript Access",
            "Summary": "Adani Ports and Special Economic Zone Limited has made available a web link to access the transcript of their earnings call discussing unaudited financial results for the quarter ended June 30, 2025. The provided information consists of a cover letter for transcript submission but does not include the actual financial details or operational metrics from the earnings call.",
            "Sentiment": "neutral",
            "PublishDate": 1754677222426,
            "Source": "earnings"
        }
    ]
}