{
    "Symbol": "ADANIENT",
    "ISIN": "INE423A01024",
    "News": [
        {
            "Title": "Adani Enterprises Receives OFAC Information Request",
            "Summary": "Adani Enterprises discloses receipt of Request for Information from U.S. OFAC regarding WSJ allegations on Iran-related transactions. Company voluntarily engaging with authorities.",
            "Sentiment": "neutral",
            "PublishDate": 1770700586466,
            "Source": "stocks"
        },
        {
            "Title": "Adani Enterprises Sets Feb 13 Record Date for Call",
            "Summary": "Adani Enterprises fixes February 13, 2026 as record date for second and final call payment of ₹450 per rights equity share, representing 25% of ₹1,800 issue price.",
            "Sentiment": "neutral",
            "PublishDate": 1770646775630,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Enterprises converts shares to 75% paid-up status",
            "Summary": "Adani Enterprises Limited has converted 13,77,96,213 partly paid-up equity shares from 50% to 75% paid-up status following receipt of first call money on February 2, 2026, as part of its ongoing rights issue process.",
            "Sentiment": "neutral",
            "PublishDate": 1770218111765,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Enterprises Q3FY26 Monitoring Report Filed",
            "Summary": "Adani Enterprises submitted monitoring agency report for Q3FY26 showing Rs. 12,465.15 crore received and Rs. 8,097.56 crore utilized from rights issue proceeds, with no deviations reported.",
            "Sentiment": "neutral",
            "PublishDate": 1770112538964,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Enterprises Q3 Net Profit Surges to ₹56.3B",
            "Summary": "Adani Enterprises reports consolidated net profit of ₹56.3 billion in Q3 vs ₹578 million YoY, driven by exceptional item of ₹56.3 billion. PBT doubles to ₹13 billion.",
            "Sentiment": "positive",
            "PublishDate": 1770110167212,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Defence Partners with Leonardo for Helicopters",
            "Summary": "Adani Defence, a subsidiary of Adani Enterprises, has announced a strategic partnership with Leonardo to develop helicopter ecosystem capabilities in India's defence sector.",
            "Sentiment": "positive",
            "PublishDate": 1770102940438,
            "Source": "stocks"
        },
        {
            "Title": "Adani Enterprises Signs MOU with Embraer for Aircraft",
            "Summary": "Adani Enterprises subsidiary signs MOU with Embraer S.A. to develop regional transport aircraft ecosystem in India following material price movement in shares.",
            "Sentiment": "positive",
            "PublishDate": 1769578758861,
            "Source": "stocks"
        },
        {
            "Title": "Adani Group stocks rally up to 5% on Tuesday",
            "Summary": "Adani Group companies traded in green with solid gains led by Adani Enterprises and Adani Ports & SEZ amid positive investor sentiment and broad-based buying interest on Tuesday's session.",
            "Sentiment": "positive",
            "PublishDate": 1769503129631,
            "Source": "stocks"
        },
        {
            "Title": "Adani, Embraer to set up aircraft assembly line in India",
            "Summary": "Adani Defence and Aerospace partners with Brazilian aerospace major Embraer to establish civilian aircraft final assembly line in India. MoU signing scheduled for January 27 in New Delhi.",
            "Sentiment": "positive",
            "PublishDate": 1769345376817,
            "Source": "stocks"
        },
        {
            "Title": "Adani Enterprises Completes Flight Simulation Acquisition",
            "Summary": "Adani Enterprises subsidiary completes acquisition of 72.8% stake in Flight Simulation Technique Centre Pvt. Limited through its defence arm ADSTL and joint venture HASL.",
            "Sentiment": "positive",
            "PublishDate": 1769167730759,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Enterprises Hits 10% Lower Circuit Limit",
            "Summary": "Adani Enterprises shares declined 10% to ₹1,877.80, hitting the lower circuit limit on Friday. The company reported strong FY25 performance with net profit surging to ₹7,510.22 crore from ₹3,293.40 crore in FY24.",
            "Sentiment": "negative",
            "PublishDate": 1769163564776,
            "Source": "stocks"
        },
        {
            "Title": "Adani Enterprises Falls 7.87% Amid Market Volatility",
            "Summary": "Adani Enterprises shares declined 7.87% to ₹1,922.10, ranking among top Nifty 50 losers. Company reported strong FY25 performance with net profit surging 127.94% to ₹7,510.22 crores despite revenue growth of just 1.53%.",
            "Sentiment": "neutral",
            "PublishDate": 1769159334808,
            "Source": "stocks"
        },
        {
            "Title": "SEC Seeks Court Approval to Summon Adani Executives",
            "Summary": "US Securities and Exchange Commission requests Federal court permission to serve summons via email to Gautam Adani and Sagar Adani in alleged USD 265 million bribery fraud case.",
            "Sentiment": "negative",
            "PublishDate": 1769143342218,
            "Source": "stocks"
        },
        {
            "Title": "Adani Enterprises acquires full stake in IANS India",
            "Summary": "Adani Enterprises' subsidiary AMG Media Networks Limited executed Share Purchase Agreement on January 21, 2026 to acquire remaining stake in IANS India Private Limited, making it wholly owned subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1769101147512,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Group unveils ₹6 lakh crore investment plan",
            "Summary": "Adani Group announces massive ₹6 lakh crore investment blueprint across aviation, clean energy, urban infrastructure, digital platforms and advanced manufacturing at WEF 2026 in Davos.",
            "Sentiment": "positive",
            "PublishDate": 1768979680938,
            "Source": "stocks"
        },
        {
            "Title": "LIC, GQG reshape Adani portfolios in Q3 FY25",
            "Summary": "LIC reduced stakes in Adani Enterprises and Adani Ports while increasing ACC holdings. GQG booked profits in Adani Ports and Adani Power during the December quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1768968335064,
            "Source": "stocks"
        },
        {
            "Title": "Adani Enterprises Board Meet Set for Feb 3, 2026",
            "Summary": "Adani Enterprises announces board meeting on February 3, 2026 to consider Q3FY26 unaudited financial results. Trading window closed from January 1 till 48 hours post-results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1768905544276,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Enterprises closes ₹1,000-cr NCD issue early",
            "Summary": "Adani Enterprises approved early closure of its ₹1,000-crore NCD issue after receiving overwhelming response. The bond sale was fully subscribed within 45 minutes, with base issue snapped in just 10 minutes.",
            "Sentiment": "positive",
            "PublishDate": 1767789266208,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Enterprises' ₹1,000 cr NCD issue sold out fast",
            "Summary": "Adani Enterprises' ₹1,000 crore NCD issue was fully subscribed within 45 minutes, with the base ₹500 crore portion sold in just 10 minutes. Non-institutional investors dominated demand.",
            "Sentiment": "positive",
            "PublishDate": 1767682221349,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Enterprises Acquires 49% Stake in SVVPL",
            "Summary": "Adani Enterprises subsidiary ARTL executed definitive documents to acquire 49% stake in Sree Vishwa Varadhi Private Limited with option for additional stake acquisition subject to regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1767461499346,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Enterprises Updates First Call Payment Period",
            "Summary": "Adani Enterprises issued corrigendum changing first call payment period for partly paid-up equity shares to January 13-27, 2026, with record date December 23, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767363243248,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Enterprises Launches ₹1,000 Cr NCD Issue Jan 6",
            "Summary": "Adani Enterprises opens third NCD issue Jan 6-19 offering 8.48%-8.90% yields across 24-60 month tenors, following previous issue's remarkable 3-hour subscription success.",
            "Sentiment": "positive",
            "PublishDate": 1767339296986,
            "Source": "co_actions_results"
        },
        {
            "Title": "AdaniConneX Acquires Giridhari Build Estate for ₹366.65 Cr",
            "Summary": "Adani Enterprises' joint venture AdaniConneX Private Limited completed acquisition of 100% stake in Giridhari Build Estate Limited for ₹366.65 crores on December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767257604287,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Group Stocks Surge, Led by Total Gas' 8% Rally",
            "Summary": "Adani Group companies witnessed strong gains on Thursday's trading session, with Adani Total Gas leading the rally with 8% surge, followed by Adani Power's 5% rise and NDTV's 3% gain.",
            "Sentiment": "positive",
            "PublishDate": 1767246225030,
            "Source": "stocks"
        },
        {
            "Title": "Adani Enterprises Completes 39% Stake Acquisition",
            "Summary": "Adani Enterprises subsidiary completes acquisition of 39% stake in Flight Simulation Technique Centre through ₹820 crore deal, expanding aviation services footprint.",
            "Sentiment": "positive",
            "PublishDate": 1767199654249,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Enterprises files NCD prospectus for ₹1,000 cr issue",
            "Summary": "Adani Enterprises files prospectus with RoC and stock exchanges for ₹1,000 crore NCD public issue opening January 6, 2026, offering 8 series with yields up to 8.90% across different tenors.",
            "Sentiment": "positive",
            "PublishDate": 1767032086658,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Enterprises Shareholders Approve Amalgamation Scheme",
            "Summary": "Adani Enterprises shareholders approved composite scheme of amalgamation with 99.9998% votes in favour during NCLT-convened meeting on December 29, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766993355916,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Group Plans ₹1.8L Cr Defence Investment",
            "Summary": "Adani Defence & Aerospace announces massive ₹1.8 lakh crore investment for 2025 in unmanned systems, guided weapons, and AI-enabled military operations to strengthen India's indigenous defence capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1766931408336,
            "Source": "stocks"
        },
        {
            "Title": "Pawar Praises Adani's Journey As Youth Inspiration",
            "Summary": "NCP (SP) chief Sharad Pawar praised Gautam Adani's entrepreneurial journey from Gujarat to national success as inspiration for hardworking youth at the AI centre inauguration in Baramati.",
            "Sentiment": "positive",
            "PublishDate": 1766856693226,
            "Source": "stocks"
        },
        {
            "Title": "Adani Cement Merger May Benefit Ambuja Shareholders",
            "Summary": "Analysts view the proposed merger within Adani Group's cement businesses as favorable for Ambuja Cements shareholders, with share-swap ratios neutral for ACC and positive for Orient Cement minority shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1766585908503,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Enterprises Files Draft Prospectus for ₹1,000 Cr NCD",
            "Summary": "Adani Enterprises management committee approved and filed draft prospectus for ₹500 crore NCD issue with ₹500 crore over-subscription option, totaling ₹1,000 crores, following board approval.",
            "Sentiment": "positive",
            "PublishDate": 1766567553792,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Enterprises Gets Credit Rating Updates",
            "Summary": "Adani Enterprises receives credit rating assignments and reaffirmations from CARE Ratings and ICRA Limited across multiple financial instruments totaling over ₹26,000 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1766516191119,
            "Source": "stocks"
        },
        {
            "Title": "Adani Group Eyes Engine MRO & Aircraft Conversion",
            "Summary": "Adani Group announces plans to enter engine maintenance, repair, and overhaul services along with passenger-to-freighter aircraft conversion, targeting India's growing aviation sector.",
            "Sentiment": "positive",
            "PublishDate": 1766374280667,
            "Source": "stocks"
        },
        {
            "Title": "Adani Group in Talks for 1,600 MW Nuclear Project in UP",
            "Summary": "Adani Group discusses building 1,600 MW small modular nuclear reactors in Uttar Pradesh, marking its formal entry into India's newly opened private nuclear power sector.",
            "Sentiment": "positive",
            "PublishDate": 1766141189329,
            "Source": "stocks"
        },
        {
            "Title": "Adani Enterprises Subsidiary Incorporates New Company",
            "Summary": "Adani Road Transport Limited, a wholly owned subsidiary of Adani Enterprises, has incorporated MRDP-III Development Limited with ₹1.00 lakh subscribed capital for infrastructure development projects.",
            "Sentiment": "neutral",
            "PublishDate": 1766079839378,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Enterprises Sets Dec 23 Record Date for First Call",
            "Summary": "Adani Enterprises fixes December 23, 2025 as record date for first call payment of ₹450 per share on partly paid-up equity shares from its ₹24,930 crore rights issue.",
            "Sentiment": "neutral",
            "PublishDate": 1765377211289,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Enterprises Completes 99% Acquisition of AGH Port Aviation Services",
            "Summary": "Adani Airport Holdings Limited, a wholly owned subsidiary of Adani Enterprises, has completed the acquisition of 99% stake in AGH Port Aviation Services Private Limited from Indo Thai Airport Management Services Private Limited. AGH Port has now become a step-down subsidiary of Adani Enterprises following the completion of this transaction.",
            "Sentiment": "positive",
            "PublishDate": 1765296842540,
            "Source": "order&deals"
        },
        {
            "Title": "Adani Group Plans ₹25 Billion Investment for Green Data Centre in Telangana",
            "Summary": "Adani Group announced plans to invest ₹25 billion in Telangana for a data centre project, establishing a 48-megawatt green data centre in Hyderabad. The investment represents a significant expansion into the data infrastructure sector for the conglomerate and brings substantial capital investment to the state.",
            "Sentiment": "positive",
            "PublishDate": 1765187674090,
            "Source": "stock"
        },
        {
            "Title": "Adani Enterprises Subsidiary Forms New Airport City Development Company",
            "Summary": "Adani Airport Holdings Limited incorporated a wholly owned subsidiary called Adani Airport City Limited on December 6, 2025, with authorized share capital of Rs. 10 lakh. The new entity will focus on designing, developing, financing, constructing, operating and maintaining structures on airport land parcels earmarked for city-side development.",
            "Sentiment": "positive",
            "PublishDate": 1765180354876,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Enterprises Incorporates Wholly Owned Subsidiary for Education and Skill Development",
            "Summary": "Adani Enterprises Limited incorporated a wholly owned subsidiary named Adani Skills@Education Limited on December 6, 2025, with a subscribed capital of Rs. 1,00,000 divided into 10,000 equity shares of Rs. 10 each. The subsidiary will focus on upskilling Adani employees and providing training, education, and skill development services through various traditional and digital means including seminars, online classes, and consultancy services.",
            "Sentiment": "positive",
            "PublishDate": 1765031600651,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Enterprises Launches New Subsidiary AdaniConnex Hyderabad Three",
            "Summary": "Adani Enterprises has launched a new subsidiary named AdaniConnex Hyderabad Three. The establishment of this new subsidiary expands Adani Enterprises' corporate structure and business operations.",
            "Sentiment": "positive",
            "PublishDate": 1764771366011,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Group Plans $15 Billion Airport Expansion Investment by 2030",
            "Summary": "Adani Group has announced plans to invest $15 billion in expanding India's airport infrastructure by 2030. The investment initiative affects Adani Enterprises and positions the conglomerate for significant growth in India's aviation sector development.",
            "Sentiment": "positive",
            "PublishDate": 1764731345902,
            "Source": "stock"
        },
        {
            "Title": "Adani Enterprises Unit Astraan Defence Transfers 49% Stake to MSM Group",
            "Summary": "Astraan Defence, a unit of Adani Enterprises, has transferred 10.09 crore equity shares representing a 49% stake to MSM Group S.R.O. The transaction reduces Agneya Systems Ltd's holding in Astraan Defence from 100% to 51%, indicating a strategic partnership or investment arrangement.",
            "Sentiment": "neutral",
            "PublishDate": 1764730437850,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Airport Holdings Completes 25% Stake Sale in World Plate Collective Cuisines to AJ Holding",
            "Summary": "Adani Airport Holdings Limited, a wholly owned subsidiary of Adani Enterprises, completed the divestment of 25% stake in World Plate Collective Cuisines Limited to UAE-based food and beverage company AJ Holding Limited for Rs. 2.50 lakh cash consideration. The transaction changes the ownership structure to 75:25 ratio between AAHL and AJ Holding, with AJ Holding being a non-promoter entity operating restaurant operations, cloud kitchens, and coffee ventures across UAE and India.",
            "Sentiment": "neutral",
            "PublishDate": 1764693167726,
            "Source": "order&deals"
        },
        {
            "Title": "Adani Enterprises Completes Acquisition of Trade Castle Tech Park Through Joint Venture",
            "Summary": "Adani ConneX Private Limited, a joint venture of Adani Enterprises, has completed the acquisition of 100% stake in Trade Castle Tech Park Private Limited (TCTPPL), making it a step-down joint venture. The acquisition was completed on December 2, 2025, following the share purchase agreement signed on November 22, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1764669614948,
            "Source": "order&deals"
        },
        {
            "Title": "TDSAT Order Could Lead to Sharp Rise in Mumbai Airport User Charges Following ₹50,000 Cr Under-Recovery",
            "Summary": "A TDSAT order may result in a significant increase in user charges at Mumbai Airport operated by Adani Enterprises. The potential hike follows an under-recovery of ₹50,000 crores, which could impact passengers and airlines using the airport.",
            "Sentiment": "negative",
            "PublishDate": 1764559079559,
            "Source": "stock"
        },
        {
            "Title": "Adani Group CFO Sets 1 Trillion Rupees Total Debt Target by 2030",
            "Summary": "Adani Group's Chief Financial Officer has announced a target to reach 1 trillion rupees in total debt by 2030. This debt expansion plan affects Adani Enterprises and the broader Adani Group's financial strategy and growth trajectory.",
            "Sentiment": "positive",
            "PublishDate": 1764336286700,
            "Source": "stock"
        },
        {
            "Title": "Adani Group Plans to Raise 900 Billion Rupees, Expands Into Battery Energy Storage",
            "Summary": "Adani Group CFO announced plans to raise 900 billion rupees within the next year, with 440 billion rupees needed this fiscal year. The company is exploring battery energy storage solutions and establishing a chemical-based supply chain manufacturing system, though faces challenges with rare earth material availability.",
            "Sentiment": "neutral",
            "PublishDate": 1764332695191,
            "Source": "stock"
        },
        {
            "Title": "Adani Enterprises Completes Divestment of Entire Stake in PT Adani Global Indonesia",
            "Summary": "Adani Enterprises' subsidiaries Adani Global Limited (Mauritius) and Adani Global Pte Ltd (Singapore) have completed the divestment of their entire stake in PT Adani Global (Indonesia) to ENERGICO FZCO. PT Adani Global and its subsidiaries have ceased to be step-down subsidiaries of Adani Enterprises with effect from November 28, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764318112200,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Enterprises Units Acquire Majority Stake in FSTC for ₹8.2 Billion",
            "Summary": "Adani Enterprises' subsidiary units have acquired a 72.8% stake in FSTC through a deal valued at ₹8.2 billion rupees. The acquisition gives Adani Enterprises controlling interest in FSTC, representing a significant expansion move for the conglomerate.",
            "Sentiment": "positive",
            "PublishDate": 1764288441966,
            "Source": "order&deals"
        }
    ]
}