{
    "Symbol": "ADANIGREEN",
    "ISIN": "INE364U01010",
    "News": [
        {
            "Title": "Adani Green Clarifies Media Reports on Fundraising",
            "Summary": "Adani Green Energy clarifies media reports about $2 billion fundraising plans from Japanese markets, stating no specific action or decision is pending and no material impact on operations.",
            "Sentiment": "neutral",
            "PublishDate": 1770038184040,
            "Source": "stocks"
        },
        {
            "Title": "Adani Green Energy clarifies US SEC proceedings",
            "Summary": "Adani Green Energy provides update on US SEC civil case involving promoters, reiterates company not party to proceedings with no charges brought against it.",
            "Sentiment": "neutral",
            "PublishDate": 1769838262754,
            "Source": "stocks"
        },
        {
            "Title": "Adani Green Energy Subsidiary Forms Windrix Energy",
            "Summary": "Adani Green Energy's subsidiary has established Windrix Energy Limited, marking a new corporate development in the renewable energy sector.",
            "Sentiment": "neutral",
            "PublishDate": 1769780666517,
            "Source": "stocks"
        },
        {
            "Title": "Adani Green Energy Targets 5 GW+ Hydro PSP by 2030",
            "Summary": "Adani Green Energy announces ambitious expansion plan to add over 5 GW of hydro pumped storage project capacity by 2030, strengthening its renewable energy portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1769775053978,
            "Source": "stocks"
        },
        {
            "Title": "Adani Green Gets BBB+ Rating from Japan Agency",
            "Summary": "Japan Credit Rating Agency assigns BBB+ long-term issuer rating with stable outlook to Adani Green Energy Limited, marking the company's first rating from the Japanese agency.",
            "Sentiment": "positive",
            "PublishDate": 1769697713795,
            "Source": "stocks"
        },
        {
            "Title": "Adani Green Clarifies BESS Project & Capex Plans",
            "Summary": "Adani Green Energy responds to media reports about 7 GWh BESS project in Gujarat and Rs. 40,000 crore capex plans for FY27, reiterating commitment to world's largest single location BESS deployment.",
            "Sentiment": "neutral",
            "PublishDate": 1769509215326,
            "Source": "stocks"
        },
        {
            "Title": "Adani Green Energy Shares Rise 6% After Sharp Decline",
            "Summary": "Adani Green Energy shares surged 6% to Rs 818.45 as investors bought the dip following Friday's 12% decline. Company clarified SEC proceedings and commissioned new 50 MW solar project.",
            "Sentiment": "neutral",
            "PublishDate": 1769490202790,
            "Source": "stocks"
        },
        {
            "Title": "Adani Green Operationalizes 50 MW Solar Project",
            "Summary": "Adani Green Energy Limited has operationalized a 50 MW solar power project at Khavda, Gujarat, increasing its total operational renewable generation capacity to 17,287.2 MW.",
            "Sentiment": "positive",
            "PublishDate": 1769319232268,
            "Source": "stocks"
        },
        {
            "Title": "Adani Green clarifies SEC proceedings impact",
            "Summary": "Adani Green Energy issues clarification on SEC proceedings against directors, stating company not party to civil case and no adverse business impact expected from ongoing legal matters.",
            "Sentiment": "neutral",
            "PublishDate": 1769192957362,
            "Source": "stocks"
        },
        {
            "Title": "Adani Green Energy Reports Q3 Net Loss of ₹410 Crores",
            "Summary": "Adani Green Energy Limited posted a consolidated net loss of ₹410 million in Q3, marking a significant shift from the ₹4.92 billion profit recorded in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1769158050319,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Green Adds 2,995 MW Capacity in 9M FY26",
            "Summary": "Adani Green Energy successfully commissioned 2,995 MW of greenfield renewable energy capacity during the first nine months of FY26, marking significant expansion in its operational portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1768197990045,
            "Source": "stocks"
        },
        {
            "Title": "Adani Green Energy Reports 48% Capacity Growth in 9M FY26",
            "Summary": "AGEL's operational capacity surged to 17.20 GW with 5.60 GW additions, while energy sales jumped 37% to 27,636 million units. Company ranked No. 1 globally in green utilities.",
            "Sentiment": "positive",
            "PublishDate": 1768197943096,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Green Reports 48% Growth in Operational Capacity",
            "Summary": "Adani Green Energy achieves significant operational expansion with 48% YoY growth in capacity and 37% increase in energy sales during nine-month period, demonstrating strong business momentum.",
            "Sentiment": "positive",
            "PublishDate": 1768197789791,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Green Energy Signs Power & Investment Deals",
            "Summary": "Adani Green Energy Limited has entered into power consumption and investment agreements with its subsidiary unit, marking a strategic business development for the renewable energy company.",
            "Sentiment": "positive",
            "PublishDate": 1767795249441,
            "Source": "stocks"
        },
        {
            "Title": "Adani Green shares in focus on captive power deal",
            "Summary": "Adani Green Energy shares likely to be in focus after subsidiary signed 20.8 MW solar-wind hybrid power deal with Asahi India Glass from Khavda project with technical indicators showing mixed signals.",
            "Sentiment": "neutral",
            "PublishDate": 1767795225147,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Green Energy Incorporates Ecogen Seven Subsidiary",
            "Summary": "Adani Green Energy officially incorporates step-down subsidiary Adani Ecogen Seven Limited through AREH11L with ₹1 lakh authorized and paid-up capital for renewable energy generation.",
            "Sentiment": "positive",
            "PublishDate": 1767710667752,
            "Source": "stocks"
        },
        {
            "Title": "Adani Green Energy Forms Two New Subsidiaries",
            "Summary": "Adani Green Energy Limited announces incorporation of two step-down subsidiaries - Adani Ecogen Eight Limited and Adani Ecogen Six Limited - through its wholly-owned subsidiary for renewable energy operations.",
            "Sentiment": "neutral",
            "PublishDate": 1767707491022,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Green Energy Q3FY26 Results Call on Jan 23",
            "Summary": "Adani Green Energy Limited has scheduled an investor conference call on January 23, 2026 at 4:30 PM IST to discuss Q3FY26 financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767434235022,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Green Forms New Renewable Energy Subsidiary",
            "Summary": "Adani Green Energy Limited incorporates step-down subsidiary Adani Ecogen Five Limited with ₹1 lakh capital to focus on renewable power generation through wind and solar energy sources.",
            "Sentiment": "positive",
            "PublishDate": 1767339702929,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Green Energy EGM Voting Results Released",
            "Summary": "Adani Green Energy announced detailed voting results for its January 2, 2026 EGM, showing strong shareholder support with 95.88% approval for director re-appointment and 100% for related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1767339673640,
            "Source": "stocks"
        },
        {
            "Title": "Adani Green Energy Forms New Renewable Subsidiary",
            "Summary": "Adani Green Energy establishes Adani Ecogen Four Limited through subsidiary AREH11L with ₹1 lakh capital. New entity focuses on renewable energy generation but operations yet to begin.",
            "Sentiment": "positive",
            "PublishDate": 1767161085708,
            "Source": "stocks"
        },
        {
            "Title": "Adani Green Operationalizes 307.4 MW Projects",
            "Summary": "Adani Green Energy Limited has operationalized 307.4 MW renewable power projects at Khavda, Gujarat, increasing its total operational capacity to 17,237.2 MW. Power generation commenced January 1, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767149671085,
            "Source": "stocks"
        },
        {
            "Title": "Adani Green Energy Block Trade Worth ₹100.78 Crores",
            "Summary": "Adani Green Energy witnessed a significant NSE block trade of ₹100.78 crores involving 1,004,521 shares at ₹1,003.30 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767073578430,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Green Creates New Subsidiary Ecothrive",
            "Summary": "Adani Green Energy Limited has established Ecothrive Renewables Limited as a fully owned subsidiary company.",
            "Sentiment": "neutral",
            "PublishDate": 1766758234052,
            "Source": "stocks"
        },
        {
            "Title": "Adani Green Forms New Renewable Energy Subsidiary",
            "Summary": "Adani Green Energy incorporates Ecothrive Renewables Limited as step-down subsidiary through AREH11L with ₹1.00 lakh capital for renewable power generation operations.",
            "Sentiment": "positive",
            "PublishDate": 1766755624783,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Green Energy Tops Global Green Utilities Ranking",
            "Summary": "Adani Green Energy Ltd has secured the top position in Energy Intelligence's Annual Global Top 100 Green Utilities Rankings, surpassing major utilities from China and Europe with its 16.7 GW operational renewable capacity.",
            "Sentiment": "positive",
            "PublishDate": 1766661060798,
            "Source": "stocks"
        },
        {
            "Title": "SEBI Closes Insider Trading Case Against Pranav Adani",
            "Summary": "Securities and Exchange Board of India has closed the insider trading investigation against Pranav Adani related to Adani Green Energy scrip without imposing any directions or penalties on the matter.",
            "Sentiment": "positive",
            "PublishDate": 1765551665431,
            "Source": "stocks"
        },
        {
            "Title": "Adani Green Energy Block Trade Worth ₹50.99 Crores",
            "Summary": "Adani Green Energy executed a significant NSE block trade worth ₹50.99 crores involving 512,076 shares at ₹995.70 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1765429709109,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Green Energy Receives ESG Rating of 78 from NSE Sustainability",
            "Summary": "Adani Green Energy Limited received an ESG rating of 78 from NSE Sustainability Ratings & Analytics Limited, based on publicly available data. The company clarified it did not engage NSE Sustainability for this rating, as the assessment was conducted independently by the rating agency.",
            "Sentiment": "positive",
            "PublishDate": 1765284635804,
            "Source": "stock"
        },
        {
            "Title": "Adani Green Energy's ESG Rating Improves to 94% from Previous 90%",
            "Summary": "CSRHUB published an updated ESG rating for Adani Green Energy Limited, upgrading the company's rating to 94% from the previous 90%. The improved ESG rating reflects enhanced environmental, social, and governance performance metrics for the renewable energy company.",
            "Sentiment": "positive",
            "PublishDate": 1764946818734,
            "Source": "stock"
        },
        {
            "Title": "Adani Green Energy Establishes Two New Subsidiaries to Expand Renewable Energy Portfolio",
            "Summary": "Adani Green Energy has formed two new subsidiaries, Urjasetu Renewables and Hydrobloom Power, as part of its strategic expansion in the renewable energy sector. The move positions the company to broaden its renewable energy offerings and strengthen its market presence in the clean energy space.",
            "Sentiment": "positive",
            "PublishDate": 1764687278685,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Green Energy Commissions 200 MW Solar Projects in Gujarat",
            "Summary": "Adani Green Energy has started operations of 200 MW power projects in Khavda, Gujarat, expanding its renewable energy footprint. The commissioning increases the company's total renewable capacity to 16,929.8 MW, strengthening its position in India's clean energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1764558373671,
            "Source": "stock"
        },
        {
            "Title": "Total Energies Plans to Sell Up to 6% Stake in Adani Green",
            "Summary": "Total Energies is planning to sell up to 6% of its stake in Adani Green Energy. This divestment move by the French energy major could impact the ownership structure and investor composition of the renewable energy company.",
            "Sentiment": "neutral",
            "PublishDate": 1763953836709,
            "Source": "stock"
        },
        {
            "Title": "Adani Green Energy Subsidiary Asukal Establishes Two New Wholly-Owned Companies for Renewable Projects",
            "Summary": "Asukal, a subsidiary of Adani Green Energy, has formed two new fully-owned companies focused on renewable energy projects. This corporate restructuring move expands the organizational structure within Adani Green Energy's renewable energy business operations.",
            "Sentiment": "positive",
            "PublishDate": 1763728342392,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Green Energy Submits Investor Presentation for Conferences",
            "Summary": "Adani Green Energy Limited submitted an equity investor presentation to BSE and NSE exchanges for upcoming conferences, with the presentation also being uploaded to the company's website. The presentation covers the company's renewable energy portfolio, business strategy, operational excellence, and ESG framework commitments.",
            "Sentiment": "neutral",
            "PublishDate": 1763358853303,
            "Source": "stock"
        },
        {
            "Title": "Adani Group Secures Rs 63,000 Crore Energy Projects from Assam Government",
            "Summary": "Adani Power and Adani Green Energy received letters of award worth Rs 63,000 crore from Assam Government for energy projects, with Adani Power investing Rs 48,000 crore in a 3,200 MW thermal power plant and Adani Green Energy investing Rs 15,000 crore in pumped storage facilities. The projects represent the largest private sector investment in northeastern India and aim to enhance energy security, industrial development, and job creation in the region.",
            "Sentiment": "positive",
            "PublishDate": 1763107404308,
            "Source": "order&deals"
        },
        {
            "Title": "Adani Energy Solutions Plans 1,126 MW Battery Storage Project Implementation",
            "Summary": "Adani Energy Solutions announced plans to implement a 1,126 MW / 3,530 MWh Battery Energy Storage System (BESS) project, which has been reported as India's largest battery storage project. The company confirmed that no disclosure requirement applies following the report about this significant energy storage initiative.",
            "Sentiment": "neutral",
            "PublishDate": 1763090423368,
            "Source": "stock"
        },
        {
            "Title": "Adani Green Unit Wins 500 MW Pumped Hydro Storage Contract Worth Rs 515 Crore",
            "Summary": "Adani Green's unit secured a 500 MW pumped hydro storage contract from APDCL valued at Rs 1.03 crore per MW for a 40-year duration. The contract represents a significant long-term energy storage project that will enhance the company's renewable energy portfolio and provide stable revenue streams over four decades.",
            "Sentiment": "positive",
            "PublishDate": 1763090397437,
            "Source": "stock"
        },
        {
            "Title": "Adani Green Energy Reports No Deviation in Rs 9,350 Crore Convertible Warrant Fund Utilization",
            "Summary": "Adani Green Energy Limited confirmed no deviation in the utilization of proceeds from its Rs 9,350 crore convertible warrant issue for the quarter ended September 30, 2025. The funds were allocated across three objectives: Rs 4,675 crore for debt repayment, Rs 2,338 crore for investment in renewable projects, and Rs 2,337 crore for general corporate purposes. The company received 100% of the issue amount and all conversion options were exercised by warrant holders. Monitoring agency India Ratings & Research Private Limited confirmed no deviation from stated objects based on management undertaking and statutory auditor certificate. The warrants were issued at Rs 1,480.75 per warrant to promoter group entity Ardour Investment Holding Ltd.",
            "Sentiment": "neutral",
            "PublishDate": 1763030278563,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Green Energy Reports 39% Jump in Energy Sales, Adds 2.4 GW Capacity in H1 FY26",
            "Summary": "Adani Green Energy delivered strong operational and financial performance for the first half of fiscal year 2026. Energy sales rose 39% year-on-year to 19.6 billion units, driven by capacity additions and operational excellence. The company expanded renewable energy capacity by 49% year-on-year to 16.7 gigawatts, adding 2.4 gigawatts of greenfield capacity in H1 FY26, representing 74% of total capacity addition in entire FY25. Revenue from power supply increased 26% year-on-year to INR 6,088 crores, while EBITDA grew 25% to INR 5,651 crores with margins at 92%. Cash profits surged 17% year-on-year to INR 3,094 crores. The company remains on track to achieve its targeted 50 gigawatt capacity by 2030. At Khavda, Gujarat, the world's largest renewable energy plant development continues with 7.1 gigawatt solar, wind, and hybrid assets including 661 megawatt of group projects already operational. The company faces some grid evacuation challenges affecting less than 5% of total capacity, with 4.8 gigawatts currently being sold as infirm power. Management expects another 2.5 gigawatts of evacuation capacity in H2 and maintains commitment to add 5 gigawatts for the full year.",
            "Sentiment": "positive",
            "PublishDate": 1762238259428,
            "Source": "earnings"
        },
        {
            "Title": "Adani Green Energy Subsidiaries Sign Investment Agreements with RSWM Limited",
            "Summary": "Adani Green Energy Limited subsidiaries have executed two investment agreements with RSWM Limited on October 31, 2025. The agreements involve Adani Renewable Energy Holding Eighteen Limited and Adani Solar Energy Jodhpur Six Limited in one agreement, and Adani Renewable Energy Holding Four Limited and Adani Renewable Energy Forty One Limited in another. Under these agreements, RSWM Limited will subscribe to a minimum 26% proportionate equity share capital in the respective generator projects to meet minimum captive shareholding requirements under captive rules. The agreements follow power consumption agreements signed on October 30, 2025. Adani Green Energy will retain control by appointing all directors on the boards of the generator companies and holds buyback rights for RSWM's shares upon termination of the power consumption agreements. The transactions are not classified as related party transactions.",
            "Sentiment": "neutral",
            "PublishDate": 1761930690645,
            "Source": "order&deals"
        },
        {
            "Title": "Adani Green Energy Subsidiaries Sign 60 MW Solar-Wind Hybrid Power Supply Agreement",
            "Summary": "Adani Solar Energy Jodhpur Six Limited and Adani Renewable Energy Forty One Limited, wholly-owned step down subsidiaries of Adani Green Energy Limited, have entered into Power Consumption Agreements and Tripartite Agreements to supply 60 MW of solar-wind hybrid power to a commercial and industrial customer. The hybrid power will be supplied from a 50 MW solar power plant located at Baap, Rajasthan and a 52 MW wind power plant located at Khavda, Gujarat. The agreements were executed on October 30, 2025 at 4:47 pm.",
            "Sentiment": "positive",
            "PublishDate": 1761837091003,
            "Source": "stock"
        },
        {
            "Title": "Adani Green Plans 17 GW Capacity Addition at Khavda Unit in 9 Months",
            "Summary": "Adani Green announced expectations to add 17 GW of additional power capacity from its Khavda unit within a 9-month timeframe. The information was shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1761720772608,
            "Source": "stock"
        },
        {
            "Title": "Adani Green Targets 5GW Capacity Expansion by FY26",
            "Summary": "Adani Green announced plans to increase its capacity by 5GW by FY26. This information was shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1761720324841,
            "Source": "stock"
        },
        {
            "Title": "Adani Green Energy Surges 11% on Strong Margin Expansion and Profit Growth",
            "Summary": "Adani Green Energy shares rallied 11.15% to hit an intraday high of ₹1,145, marking the second rally of over 11% since September 21. The surge followed the company's quarterly results showing net profit jumped 111.2% year-on-year to ₹583 crore, aided by a one-off tax writeback of ₹213 crore. EBITDA rose 17.4% to ₹2,603 crore with margins expanding sharply to 86.5% from 73.8% compared to the previous year. Revenue remained flat at ₹3,008 crore. The quarter faced challenges from weak solar trends, lower merchant realisations, and limited grid availability. The company's renewable energy portfolio grew 49% year-on-year to 16.7 GW, with projects worth ₹14,029 crore under construction. Adani Green added 5.5 GW capacity and incurred ₹28,366 crore in capex in the first half, increasing net debt by ₹11,609 crore. The company remains on track to achieve its 50 GW target by FY30. Other Adani group stocks also gained, with the company's market capitalisation crossing ₹1.72 lakh crore.",
            "Sentiment": "positive",
            "PublishDate": 1761720040829,
            "Source": "earnings"
        },
        {
            "Title": "Adani Green Energy Reports Strong H1 FY26 Results with 39% Energy Sales Growth",
            "Summary": "Adani Green Energy Limited reported robust financial performance for the half year ended September 30, 2025. The company's energy sales increased 39% year-on-year to 19,569 million units, while revenue from power supply grew 26% to Rs 6,088 crore. EBITDA expanded 25% to Rs 5,651 crore with an industry-leading margin of 91.8%. The company's operational renewable energy capacity reached 16.7 GW, representing 49% growth year-on-year. During H1 FY26, Adani Green added 2,437 MW of greenfield capacity, which constitutes 74% of the capacity addition achieved in the entire previous fiscal year. The company continues development of its 30 GW renewable energy project at Khavda, Gujarat, with current operational capacity at the site standing at 7.1 GW. Cash profit increased 17% to Rs 3,094 crore. The Board approved unaudited financial results for the quarter and half year ended September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761652479477,
            "Source": "earnings"
        },
        {
            "Title": "Adani Green Energy Reports 49% Growth in Operational Capacity to 16.7 GW in H1 FY26",
            "Summary": "Adani Green Energy Limited reported significant operational growth in H1 FY26, with renewable energy capacity increasing 49% year-on-year to 16.7 GW. The company added 2.4 GW of greenfield capacity during the period, representing 74% of its annual capacity addition in FY25. Energy sales rose 39% to 19,569 million units, driven by robust capacity additions. The company operationalized 4,200 MW of solar power plants, 491 MW of wind power plants, and 805 MW of hybrid power plants. Solar portfolio achieved 24.8% capacity utilization factor with 99.0% plant availability, while wind portfolio reached 37.8% CUF with 95.2% plant availability. AGEL maintained its position as India's largest renewable energy portfolio operator and received recognition including ranking 1st in India and 7th globally in renewable energy sector ESG assessment by Sustainalytics. The company continues targeting 50 GW capacity by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1760537442727,
            "Source": "stock"
        },
        {
            "Title": "Adani Green Energy Incorporates Five New Hydro Energy Subsidiaries",
            "Summary": "Adani Green Energy Limited has incorporated five new wholly-owned step-down subsidiaries through its subsidiary Adani Saur Urja (KA) Limited. The new entities are Adani Hydro Energy Eleven Limited, Adani Hydro Energy Twelve Limited, Adani Hydro Energy Fifteen Limited, Adani Hydro Energy Fourteen Limited, and Adani Hydro Energy Seventeen Limited, incorporated between October 13-15, 2025. Each subsidiary has an authorized capital of Rs. 1,00,000, with varying paid-up capital amounts. The companies are focused on generating power using renewable energy sources including wind, solar, and other renewable sources. All five subsidiaries are registered in India and have yet to commence business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1760536984507,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Green Energy Operationalizes 50 MW Solar Project, Total Capacity Reaches 16,729.80 MW",
            "Summary": "Adani Green Energy Limited operationalized a 50 MW solar power project in Khavda, Gujarat through its wholly-owned stepdown subsidiary Adani Green Energy Twenty Six A Limited. The plant commenced power generation on October 16, 2025, following a decision made on October 15, 2025. This addition brings the company's total operational renewable generation capacity to 16,729.80 MW.",
            "Sentiment": "positive",
            "PublishDate": 1760519014240,
            "Source": "stock"
        },
        {
            "Title": "Adani Green Secures $250 Million Loan from Four Global Banks",
            "Summary": "Adani Green Energy Ltd signed a deal to raise approximately $250 million from four global lenders: DBS Bank Ltd., DZ Bank, Rabobank, and Bank SinoPac Co Ltd. The five-year loan carries an interest rate of around 8.20% and will be used to refinance existing debt. This financing is part of the Adani Group's strategy to reduce leverage over the next five years, with no plans to issue international bonds until 2027. The group secured over $10 billion in new credit facilities during the first half of the year across multiple units. In March, Adani Green refinanced a construction-linked loan worth Rs 92.61 billion with India's Power Finance Corporation Ltd. The Adani family injected about $1.1 billion of equity into Adani Green Energy in July.",
            "Sentiment": "positive",
            "PublishDate": 1759769615153,
            "Source": "stock"
        }
    ]
}