{
    "Symbol": "ADANIENSOL",
    "ISIN": "INE931S01010",
    "News": [
        {
            "Title": "Adani Energy Solutions Delivers 1 Crore Smart Meters",
            "Summary": "Adani Energy Solutions achieves early delivery of 1 crore smart meters with industry-leading installation rate of 25,000 meters daily. Company plans to deliver another 1 crore meters in FY27.",
            "Sentiment": "positive",
            "PublishDate": 1770270378394,
            "Source": "stocks"
        },
        {
            "Title": "Adani Energy Solutions clarifies fundraising reports",
            "Summary": "Adani Energy Solutions responds to BSE inquiry about media reports claiming three Adani group companies plan to raise $2 billion from Japanese markets, stating no specific action planned.",
            "Sentiment": "neutral",
            "PublishDate": 1770046437066,
            "Source": "stocks"
        },
        {
            "Title": "Adani Energy Solutions Gets BBB+/Stable Rating",
            "Summary": "Japan Credit Rating Agency assigns BBB+/Stable rating to Adani Energy Solutions for both foreign and local currency long-term issuer categories, marking a positive credit assessment.",
            "Sentiment": "positive",
            "PublishDate": 1769708214024,
            "Source": "stocks"
        },
        {
            "Title": "Adani Energy Solutions clarifies hybrid power deal",
            "Summary": "Adani Energy Solutions confirms hybrid power supply contract with Asahi India Glass signed on January 7, 2026, stating it falls within ordinary business operations and requires no regulatory disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1769583017903,
            "Source": "stocks"
        },
        {
            "Title": "Adani Energy Solutions Gets Credit Rating Upgrade",
            "Summary": "India Ratings upgrades Adani Electricity Mumbai Limited's issuer rating to 'IND AAA' from 'IND AA+' with stable outlook. AEML is a material subsidiary of Adani Energy Solutions.",
            "Sentiment": "positive",
            "PublishDate": 1769524981405,
            "Source": "stocks"
        },
        {
            "Title": "Adani Energy Solutions clarifies US regulator report",
            "Summary": "Adani Energy Solutions Limited issued clarification to stock exchanges stating no allegations made against company in US regulator proceedings, no disclosure requirements triggered under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769195596013,
            "Source": "stocks"
        },
        {
            "Title": "Adani Energy Solutions drops 8.73% amid high volume",
            "Summary": "Adani Energy Solutions shares fell 8.73% to ₹844.10 in Friday's session, ranking among top losers on Nifty Next 50. Despite revenue growth to ₹23,767.09 crores in 2025, net profit declined to ₹921.69 crores.",
            "Sentiment": "negative",
            "PublishDate": 1769165005943,
            "Source": "stocks"
        },
        {
            "Title": "Adani Energy Solutions Reports 16.2% Revenue Growth",
            "Summary": "Adani Energy Solutions delivered strong H1 FY26 performance with total income rising 16.2% YoY to ₹20,737 crores, driven by transmission assets and smart meter expansion reaching 92.5 lakh installations.",
            "Sentiment": "positive",
            "PublishDate": 1769094405376,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Energy Solutions Q3FY26 QIP Monitoring Report",
            "Summary": "Adani Energy Solutions filed Q3FY26 monitoring agency report for ₹8,373.10 crore QIP with fund reallocation between transmission and smart meter projects, showing complete utilization except ₹37,739.86 pending.",
            "Sentiment": "neutral",
            "PublishDate": 1769090672359,
            "Source": "stocks"
        },
        {
            "Title": "Adani Energy Solutions Q3 Net Profit Dips to ₹5.52B",
            "Summary": "Adani Energy Solutions reported consolidated net profit of ₹5.52 billion in Q3, down from ₹5.60 billion in the same quarter last year, marking a 1.43% year-on-year decline in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1769076027878,
            "Source": "co_actions_results"
        },
        {
            "Title": "Moody's Revises Adani Energy Outlook to Stable",
            "Summary": "Moody's upgraded outlook to 'Stable' from 'Negative' for Adani Energy Solutions subsidiaries while affirming Baa3 senior secured ratings for transmission and electricity distribution units.",
            "Sentiment": "positive",
            "PublishDate": 1768558211305,
            "Source": "stocks"
        },
        {
            "Title": "Adani Energy Solutions Q3FY26 Results Call Jan 23",
            "Summary": "Adani Energy Solutions announces investor conference call on January 23, 2026 at 11:00 AM IST to discuss Q3FY26 financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768303029646,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Energy Solutions Power Capacity Jumps 40%",
            "Summary": "Adani Energy Solutions reports significant growth in power transformation capacity to 118,175 MVA in Q3 FY26, marking a substantial 40% increase from 84,186 MVA in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1768219407131,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Energy reports 102% collection efficiency in Q3",
            "Summary": "Adani Energy Solutions maintains robust operational performance with 101.75% collection efficiency and 99.69% system availability. Transmission order book stands at ₹77,787 crore.",
            "Sentiment": "positive",
            "PublishDate": 1768216189117,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Energy Solutions Q3FY26 Operational Update",
            "Summary": "AESL reports strong Q3FY26 performance with transmission network expanding to 27,901 ckm, smart meters reaching 92.5 lakh installations, and MUL units sold growing 57% YoY to 371 MUs.",
            "Sentiment": "positive",
            "PublishDate": 1768213209491,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Energy Solutions Board Meet on Jan 22, 2026",
            "Summary": "Adani Energy Solutions Limited has scheduled a board meeting for January 22, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed from January 1-26, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767622977426,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Energy Solutions Forms New IFSC Subsidiary",
            "Summary": "Adani Energy Solutions has incorporated Atsol Global IFSC Limited as a wholly owned subsidiary, correcting earlier information about the subsidiary's name and expanding its corporate structure.",
            "Sentiment": "neutral",
            "PublishDate": 1766403750010,
            "Source": "stocks"
        },
        {
            "Title": "Adani Energy Solutions Forms New IFSC Subsidiary",
            "Summary": "Adani Energy Solutions announces incorporation of ATSOL Global IFSC Limited, a step-down subsidiary with ₹5.00 lakh authorized capital to operate as Global Treasury Centre under IFSCA regulations.",
            "Sentiment": "positive",
            "PublishDate": 1766401721623,
            "Source": "co_actions_results"
        },
        {
            "Title": "PFC Consulting Transfers KPS III HVDC to Adani for ₹203.25 Cr",
            "Summary": "PFC Consulting Limited completed transfer of its fully owned subsidiary KPS III HVDC Transmission Limited to Adani Energy Solutions for ₹203.25 crore through Share Purchase Agreement executed December 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765531539946,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Energy Solutions Receives ESG Rating of 71 from NSE Sustainability",
            "Summary": "Adani Energy Solutions Limited received a consolidated ESG rating of 71 from NSE Sustainability Ratings & Analytics Limited for FY2025, reflecting the company's performance on Environmental, Social and Governance parameters. The rating was developed independently by NSE Sustainability based on publicly available data without any engagement from the company.",
            "Sentiment": "positive",
            "PublishDate": 1765280869221,
            "Source": "stock"
        },
        {
            "Title": "Adani Energy Solutions Shareholders Approve Material Related Party Transaction Modifications",
            "Summary": "Adani Energy Solutions Limited shareholders approved material modifications to related party transactions between subsidiary Powerpulse Trading Solutions Limited and Adani Power Limited as well as Mahan Energgen Limited through postal ballot voting. Both ordinary resolutions passed with 100% of votes polled in favor, with 23.63% of total paid-up equity capital participating in the e-voting process conducted from November 8 to December 7, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765269720463,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Energy Solutions Appoints Anil Ahuja as Independent Director",
            "Summary": "Adani Energy Solutions Limited appointed Mr. Anil Ahuja (DIN-00759440) as Additional Director (Non-Executive and Independent) for a three-year term effective November 29, 2025, subject to shareholder approval. The appointment brings four decades of investment and business leadership experience across Asia, with previous board positions at HDFC Bank Limited, HDFC Securities Limited, Jubilant Foodworks and Adani Enterprises Limited.",
            "Sentiment": "positive",
            "PublishDate": 1764409115038,
            "Source": "corporate_governance"
        },
        {
            "Title": "Adani Energy Solutions Receives Intent Letter for Renewable Energy Power Transmission System",
            "Summary": "Adani Energy Solutions has received an intent letter for a power transmission system project related to renewable energy. The development indicates potential new business opportunities for the company in the renewable energy transmission infrastructure sector.",
            "Sentiment": "positive",
            "PublishDate": 1763477642510,
            "Source": "stock"
        },
        {
            "Title": "Adani Energy Solutions Seeks Shareholder Approval for Enhanced Related Party Transaction Limits",
            "Summary": "Adani Energy Solutions Limited has issued a postal ballot notice seeking shareholder approval for incremental amounts in material related party transactions. The company proposes to enhance transaction limits for its wholly-owned subsidiary Powerpulse Trading Solutions Limited (formerly Adani Energy Solutions Step-Thirteen Limited) with related parties Adani Power Limited and Mahan Energen Limited for FY 2025-26. The incremental amounts being sought are Rs. 4,500 crore (over and above the already approved limit of Rs. 8,220 crore) for transactions with Adani Power Limited, and Rs. 2,000 crore (over and above the already approved limit of Rs. 1,775 crore) for transactions with Mahan Energen Limited. These transactions involve power trading activities where Powerpulse Trading Solutions, holding a power trading license from Central Electricity Regulatory Commission, will facilitate power sales on merchant basis at market-discovered prices. The voting period runs from November 8, 2025 to December 7, 2025, with voting restricted to electronic mode only.",
            "Sentiment": "neutral",
            "PublishDate": 1762454422541,
            "Source": "corporate_action"
        },
        {
            "Title": "RSWM Partners with Adani Energy Solutions for 60MW Green Energy Supply",
            "Summary": "RSWM Ltd, a leading textile manufacturer and flagship company of LNJ Bhilwara Group, has signed an agreement with Adani Energy Solutions Ltd (AESL) for the supply of 60MW of renewable energy. Under the agreement, RSWM invested ₹260 crores under the Group Captive Scheme with a renewable genco for the supply of 31.53 crore units of green power annually to its manufacturing facilities across Rajasthan. This partnership will increase RSWM's renewable energy contribution from the current 33% to 70% of its total energy requirements. AESL will manage the entire green power value chain for RSWM's additional power requirements. The collaboration aims to enhance long-term energy security and operational efficiency while reducing carbon footprint. AESL is targeting a Commercial & Industrial portfolio of 7,000MW over the next five years.",
            "Sentiment": "positive",
            "PublishDate": 1762328399944,
            "Source": "order&deals"
        },
        {
            "Title": "Fitch Upgrades Adani Energy Solutions Outlook to Stable, Maintains BBB- Rating",
            "Summary": "Fitch Ratings has changed the outlook for Adani Energy Solutions Limited (AESL) and Adani Electricity Mumbai Limited (AEML) to stable from negative while confirming their long-term Issuer Default Rating (IDR) at 'BBB-'. This rating action affects both entities within the Adani Energy Solutions group.",
            "Sentiment": "positive",
            "PublishDate": 1762238275356,
            "Source": "stock"
        },
        {
            "Title": "Adani Energy Solutions Reports 16% Revenue Growth, Plans INR 17,000-18,000 Crore Capex for FY26",
            "Summary": "Adani Energy Solutions Limited reported total income of INR 13,793 crores for the first half, marking 16% growth over the previous year. Consolidated EBITDA increased 13% to INR 4,144 crores, while consolidated PBT grew 34% to INR 1,404 crores. The company successfully commissioned three transmission projects during the first half: Khavda Phase-II Part-A, Khavda Pooling Station, and Sangod transmission line. The company has a transmission order pipeline of INR 60,000 crores and smart meter order book of 2.46 crores with revenue potential of INR 29,000 crores. Smart meter installations reached 73 lakh meters with 42.5 lakh meters installed in the first half alone. The company plans to capitalize INR 17,000-18,000 crores of capex for the full year, expected to contribute INR 2,800 crores of EBITDA on an annual run-rate basis. AEML Mumbai utility reported distribution losses of 4.30%, described as best in class. The company bought back $44 million of USD bonds during the quarter as part of deleveraging efforts. Management expects to commission at least three transmission projects worth over INR 12,000 crores in the second half.",
            "Sentiment": "positive",
            "PublishDate": 1761899232084,
            "Source": "earnings"
        },
        {
            "Title": "Adani Energy Solutions Plans ₹55,000 Crore Investment to Achieve ₹38-40,000 Crore EBITDA by FY27",
            "Summary": "Adani Energy Solutions has outlined plans to achieve EBITDA of ₹38,000-40,000 crores by FY27 through a capital expenditure of ₹55,000 crores. The investment will focus on smart grids, green transmission infrastructure, and Mumbai distribution operations. The company is targeting integration of 50GW renewable energy capacity as part of its expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1761581778058,
            "Source": "stock"
        },
        {
            "Title": "Adani Energy Solutions Reports Fund Utilization Progress for QIP Proceeds",
            "Summary": "Adani Energy Solutions Limited submitted its monitoring agency report for the quarter ended September 30, 2025, regarding the utilization of Rs. 8,373.10 crore raised through Qualified Institutional Placement. CARE Ratings Limited served as the monitoring agency. The company utilized Rs. 8,292.14 crore of the total proceeds, with Rs. 80.96 crore remaining unutilized. Key allocations included Rs. 2,860 crore for funding capital expenditure requirements of subsidiaries for transmission systems (fully utilized), Rs. 937.52 crore utilized out of Rs. 1,000 crore allocated for smart meter purchase and installation, Rs. 2,420 crore for debt repayment (fully utilized), Rs. 2,030.60 crore for general corporate purposes (fully utilized), and Rs. 44.02 crore out of Rs. 62.50 crore for issue expenses. The company made reallocations between transmission systems and smart meters objects due to increased capital expenditure requirements, with board approval obtained in April 2025. Unutilized proceeds of Rs. 145.97 crore were deployed in fixed deposits and mutual funds.",
            "Sentiment": "neutral",
            "PublishDate": 1761567787123,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Energy Solutions Anticipates Major Capital Spending Growth and Strong Bid Activity",
            "Summary": "Adani Energy Solutions expects significant growth in capital spending this year and anticipates strong bid activity. The company reports a solid transmission sector tendering pipeline valued at 960 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1761566068641,
            "Source": "stock"
        },
        {
            "Title": "Adani Energy Solutions Reports 27% Revenue Growth in Q2 FY2026",
            "Summary": "Adani Energy Solutions Limited reported consolidated revenue from operations of ₹6,595.83 crores for the quarter ended September 30, 2025, compared to ₹6,183.70 crores in the same period last year. The company's profit after tax increased to ₹557.10 crores from ₹773.15 crores in the previous year quarter. For the half-year period, revenue grew to ₹13,415.11 crores from ₹11,562.25 crores, while profit after tax reached ₹1,096.04 crores. The company operates across transmission, distribution, smart meter, and trading segments. Total assets stood at ₹82,672.75 crores as of September 30, 2025, with total borrowings of ₹45,373.65 crores. The Board approved these unaudited financial results in a meeting held on October 27, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761564066485,
            "Source": "earnings"
        },
        {
            "Title": "Adani Energy Solutions Sees Block Trade Worth Rs. 154.72 Crores on NSE",
            "Summary": "Adani Energy Solutions executed a block trade on the National Stock Exchange involving approximately 1,649,516 shares at Rs. 938.00 per share. The transaction was valued at Rs. 154.72 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1760675503473,
            "Source": "order&deals"
        },
        {
            "Title": "Adani Energy Solutions Reports Q2 FY26 Operational Updates with Network Expansion and Smart Meter Growth",
            "Summary": "Adani Energy Solutions Limited submitted provisional operational updates for Q2 FY26. The company added 190 circuit kilometers during the quarter, bringing total transmission network to 26,705 ckm with system availability at 99.63%. AEML Mumbai improved distribution loss to 4.36% while maintaining 99.999% supply reliability. Total units sold in Mumbai increased 2% to 2,650 million units. MUL Mundra saw strong 55% growth in units sold to 364 million units. The company installed 18.2 lakh new smart meters in Q2, reaching 73.7 lakh total smart meters. Four new transmission projects worth Rs 700 crore were secured, bringing total order book to Rs 60,004 crore across 13 projects. AEML secured a new smart metering contract for 18.36 lakh meters with revenue potential of Rs 2,323 crore. The Mumbai utility repurchased $44.66 million worth of bonds as part of deleveraging plans.",
            "Sentiment": "positive",
            "PublishDate": 1760100792385,
            "Source": "stock"
        },
        {
            "Title": "Adani Energy Solutions Achieves Zero-Waste-To-Landfill Certification Across All Operations",
            "Summary": "Adani Energy Solutions Ltd. received Zero-Waste-to-Landfill certification from Intertek for all operational sites and corporate headquarters, achieving 100% waste diversion rate with 0% landfill waste. The company maintained over 99% diversion rates for three consecutive years (99.87%, 99.88%, and 99.99% respectively), becoming India's first transmission company to achieve this milestone. AESL operates across 54 locations in 16 states with a transmission network of 26,696 ckm and 93,236 MVA transformation capacity. The company serves over 12 million consumers through its distribution business in Mumbai and Mundra SEZ. This achievement supports AESL's ESG strategy launched in FY21, aiming to rank among the top 10 global electric utility companies in ESG benchmarking.",
            "Sentiment": "positive",
            "PublishDate": 1758716243384,
            "Source": "stock"
        },
        {
            "Title": "Adani Electricity Mumbai Completes $44.7 Million Buyback of Senior Secured Notes",
            "Summary": "Adani Electricity Mumbai Limited (AEML) has repurchased $44.7 million of its $300 million 3.867% senior secured notes due 2031. Following this buyback, the remaining outstanding amount of these notes has been reduced to $255.3 million. The transaction represents a debt reduction strategy by the Adani Energy Solutions subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1756818541989,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Energy Solutions Incorporates New Wholly Owned Subsidiary",
            "Summary": "Adani Energy Solutions has incorporated a wholly owned subsidiary named 'Adani Energy Solutions Step-Fourteen Limited'.",
            "Sentiment": "neutral",
            "PublishDate": 1756811545873,
            "Source": "stock"
        },
        {
            "Title": "Adani Energy Solutions Incorporates New Wholly Owned Subsidiary for Power Infrastructure Services",
            "Summary": "Adani Energy Solutions Limited incorporated a wholly owned subsidiary named Adani Energy Solutions Step-Fifteen Limited on August 27, 2025. The new entity has an authorized and paid-up share capital of Rs. 1 lakh each, with shares acquired at face value of Rs. 10 per share through cash consideration. The subsidiary operates in the electric utilities industry and was established for transmission, distribution and supply of power and other infrastructure services. The company is registered with the Registrar of Companies, Gujarat at Ahmedabad and has not yet commenced business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1756306239483,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Energy Solutions Forms New Subsidiary Adani Electricity Puducherry Limited",
            "Summary": "Adani Energy Solutions has established a new subsidiary called Adani Electricity Puducherry Limited. This represents an expansion of the company's electricity business operations into the Puducherry region.",
            "Sentiment": "positive",
            "PublishDate": 1756193611332,
            "Source": "stock"
        },
        {
            "Title": "Adani Energy Solutions Sees Rs. 454.94 Crore Block Trade on NSE",
            "Summary": "Adani Energy Solutions executed a block trade worth Rs. 454.94 crores on the National Stock Exchange. The transaction involved approximately 5,772,944 shares at a price of Rs. 788.05 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1755148326882,
            "Source": "order&deals"
        },
        {
            "Title": "Adani Energy Solutions Establishes New Business Unit",
            "Summary": "Adani Energy Solutions has formed a new subsidiary unit called Adani Energy Solutions Step-Sixteen.",
            "Sentiment": "neutral",
            "PublishDate": 1755009819352,
            "Source": "stock"
        },
        {
            "Title": "Envestcom Sells 1.8% Stake in Adani Energy Solutions for ₹1,737 Crore",
            "Summary": "Envestcom Holding RSC sold 22 million shares representing 1.83% stake in Adani Energy Solutions through bulk deals on NSE and BSE at ₹790 per share, generating ₹1,736.73 crore. The transaction reduced Envestcom's shareholding from 2.68% to 0.85%. Adani Energy Solutions shares closed at ₹790.65 on BSE, declining 1.5% from the previous session.",
            "Sentiment": "neutral",
            "PublishDate": 1754526315629,
            "Source": "order&deals"
        },
        {
            "Title": "Adani Energy Solutions Sees Rs. 870.19 Crore Block Trade on NSE",
            "Summary": "Adani Energy Solutions executed a block trade worth Rs. 870.19 crores on the National Stock Exchange. The transaction involved approximately 11,015,112 shares at a price of Rs. 790.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1754466245991,
            "Source": "order&deals"
        },
        {
            "Title": "Adani Energy Solutions Incorporates Wholly Owned Subsidiary for Electricity Business",
            "Summary": "Adani Energy Solutions Limited incorporated a wholly owned subsidiary named Adani Electricity Vasai-Virar Limited on August 5, 2025. The new subsidiary operates in the electric utilities industry and was established to carry on business activities including production, generation, conversion, transformation, transmission, processing, storing, supply and distribution of electricity. The subsidiary has an authorized and paid-up share capital of Rs. 1 lakh each, with equity shares acquired at face value of Rs. 10 per share through cash consideration. Adani Energy Solutions holds 100% shareholding in the subsidiary. The new entity is registered with the Registrar of Companies, Gujarat at Ahmedabad and has yet to commence business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1754399453075,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Energy Solutions Incorporates Three New Wholly Owned Electricity Subsidiaries",
            "Summary": "Adani Energy Solutions Limited has incorporated three wholly owned subsidiary companies: Adani Electricity Kalyan Dombivli Limited, Adani Electricity Pune Limited, and Adani Electricity Vidharbha Limited. All three subsidiaries were incorporated on August 4, 2025, and registered with the Registrar of Companies, Gujarat at Ahmedabad. Each subsidiary has an authorized and paid-up share capital of Rs. 1 lakh, with equity shares acquired at face value of Rs. 10 each through cash consideration. The subsidiaries operate in the electric utilities industry and are established to carry on business activities including production, generation, conversion, transformation, transmission, processing, storing, supply and distribution of electricity. All three companies are yet to commence business operations and have no turnover. The acquisitions do not fall within related party transactions and require no governmental or regulatory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1754319126844,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Energy Solutions Establishes Three New Fully Owned Subsidiaries",
            "Summary": "Adani Energy Solutions has added three new fully owned subsidiaries to its corporate structure. The company has expanded its organizational framework through the creation of these new subsidiary entities.",
            "Sentiment": "positive",
            "PublishDate": 1754317740625,
            "Source": "stock"
        },
        {
            "Title": "Adani Energy Solutions Reports 28% Revenue Growth, Installs 24 Lakh Smart Meters in Q1",
            "Summary": "Adani Energy Solutions Limited reported strong quarterly results with total income rising 28% and EBITDA increasing 14% year-on-year to INR 2,017 crores. PAT surged 71% to INR 539 crores. The company installed 24 lakh smart meters during the quarter, bringing cumulative installations to 55.44 lakh meters, with 51 lakh already commissioned and generating revenue. Three transmission projects were commissioned including Khavda Phase 2 Part-A and Khavda Pooling Station in Gujarat, and Sangod Transmission Project in Rajasthan. The company secured a new transmission project worth INR 59,300 crores order book. Distribution losses in AEML improved to 4.24% from 5.18% in the previous year. The company launched its C&I business serving 14 industrial customers with 717 MW load and is building India's largest district cooling facility at Mundra with 45,000 tons refrigeration capacity. Consolidated capex increased to INR 2,224 crores from INR 1,313 crores in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1753708014486,
            "Source": "earnings"
        },
        {
            "Title": "Adani Energy Solutions Reports Strong Q1 Revenue Growth of 26.8%",
            "Summary": "Adani Energy Solutions reported Q1 revenue of 68.2 billion rupees, representing a significant increase from 53.79 billion rupees in the same period last year. The company's consolidated net profit before exceptional items rose to 6.6 billion rupees from 4.5 billion rupees year-over-year. EBITDA increased to 18.1 billion rupees from 16.5 billion rupees, though the EBITDA margin declined to 26.55% from 30.69% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753349348753,
            "Source": "earnings"
        },
        {
            "Title": "Adani Energy Solutions Down 36% From Peak, Awaits Earnings for Breakout Above Rs 940",
            "Summary": "Adani Energy Solutions shares have declined 36% from their August 2024 peak and are trading in a sideways range ahead of quarterly earnings. The stock is up 7.2% year-to-date but down 8% over three months, currently trading at 4.75 times book value. Technical analysts identify key support at Rs 840 (200-day moving average) and resistance near Rs 900, with a potential upside target of Rs 940-980 if the stock breaks above Rs 885. The company previously reported a 78% jump in net profit to Rs 647 crore and 35% revenue growth to Rs 6,375 crore in the March quarter. Analysts suggest the upcoming earnings results could serve as a catalyst to break the current consolidation pattern and determine the stock's next directional move.",
            "Sentiment": "neutral",
            "PublishDate": 1753332744488,
            "Source": "stock"
        },
        {
            "Title": "Adani Energy Solutions Forecasts High System Availability for Q1FY26",
            "Summary": "Adani Energy Solutions has reported that it expects an average system availability of 99.8% for the first quarter of the fiscal year 2026.",
            "Sentiment": "positive",
            "PublishDate": 1752225105000,
            "Source": "default"
        },
        {
            "Title": "Adani Energy Solutions: Secures Rs 44,000 Crore in Transmission Orders",
            "Summary": "Adani Energy Solutions Ltd. has secured transmission orders worth nearly Rs 44,000 crore and is executing Rs 13,600 crore worth of smart metering projects. The Adani Group reported a 7% growth in revenues and 8.2% growth in EBITDA, with a Net Debt-to-EBITDA ratio of 2.6x. The group plans annual Capex spending of $15-20 billion for the next 5 years.",
            "Sentiment": "positive",
            "PublishDate": 1750744365000,
            "Source": "order&deals"
        }
    ]
}