{
    "Symbol": "ADFFOODS",
    "ISIN": "INE982B01027",
    "News": [
        {
            "Title": "ADF Foods Q3 FY26 Revenue Hits Record INR191 Crores",
            "Summary": "ADF Foods delivered exceptional Q3 FY26 performance with consolidated revenue reaching all-time high of INR191 crores, up 29.5% YoY. EBITDA surged 40.6% to INR37.1 crores with healthy margins of 19.4%.",
            "Sentiment": "positive",
            "PublishDate": 1770899566040,
            "Source": "co_actions_results"
        },
        {
            "Title": "ADF Foods Updates Key Personnel List After CFO Change",
            "Summary": "ADF Foods Limited has updated its list of Key Managerial Personnel authorized to determine materiality following the appointment of Srinivas Ayyagari as new CFO on February 3, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770133646481,
            "Source": "stocks"
        },
        {
            "Title": "ADF Foods Board Meeting Set for February 3, 2026",
            "Summary": "ADF Foods Limited has scheduled a board meeting on February 3, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window remains closed until February 5, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769612052557,
            "Source": "co_actions_results"
        },
        {
            "Title": "ADF Foods CFO Shardul Doshi Resigns for New Opportunities",
            "Summary": "ADF Foods announces resignation of Chief Financial Officer Shardul Doshi effective December 10, 2025. Company initiating search for suitable replacement while maintaining normal finance operations.",
            "Sentiment": "neutral",
            "PublishDate": 1765383947456,
            "Source": "stocks"
        },
        {
            "Title": "ADF Foods CFO Shardul Doshi Resigns to Pursue New Opportunities",
            "Summary": "Shardul Doshi has resigned from his position as Chief Financial Officer and Key Managerial Personnel at ADF Foods Limited, with his resignation effective from December 10, 2025. The company is in the process of appointing a suitable replacement for the CFO position and will continue its finance functions as usual during the interim period.",
            "Sentiment": "neutral",
            "PublishDate": 1765365243860,
            "Source": "corporate_governance"
        },
        {
            "Title": "ADF Foods Promoters Release Pledge on 5 Lakh Shares After Bajaj Finance Loan Repayment",
            "Summary": "Promoters Parul Bimal Thakkar and Sumer Bimal Thakkar released pledge on 4,50,000 and 50,000 shares respectively of ADF Foods Limited on December 5, 2025, following full repayment of loan to Bajaj Finance Limited. The entire shareholding of the promoter group now stands pledge-free, improving the company's ownership structure and reducing encumbrance risks for investors.",
            "Sentiment": "positive",
            "PublishDate": 1765353257887,
            "Source": "corporate_action"
        },
        {
            "Title": "ADF Foods Reports 39% Profit Jump Despite US Tariff Challenges, Expands Costco Presence",
            "Summary": "ADF Foods delivered strong quarterly results with standalone revenue growing 12% to INR 140 crores and PAT surging 39% to INR 29.7 crores, driven by better product mix and foreign exchange gains. The company secured new retail listings including Costco stores across US and Australia for its Ashoka and Truly Indian brands, expanding its presence to over 2,000 stores while maintaining pricing despite ongoing US tariff uncertainties.",
            "Sentiment": "positive",
            "PublishDate": 1764072877480,
            "Source": "earnings"
        },
        {
            "Title": "ADF Foods Receives Permanent Revocation Orders from Gujarat Pollution Control Board for Two Manufacturing Plants",
            "Summary": "ADF Foods Limited received permanent revocation orders on November 19, 2025, from the Gujarat Pollution Control Board for alleged violations of the Water (Prevention and Control of Pollution) Act, 1974 at two manufacturing plants in Nadiad, Gujarat. The company states there is no impact on financial, operational or other activities, and both manufacturing units remained fully functional during the interim period.",
            "Sentiment": "negative",
            "PublishDate": 1763631118507,
            "Source": "stock"
        },
        {
            "Title": "Adf Foods Reports 34% Jump in Q2 Net Profit to 264 Million Rupees",
            "Summary": "Adf Foods reported quarterly consolidated net profit of 264 million rupees compared to 197 million rupees in the same period last year, marking a 34% increase. Revenue remained flat at 1.6 billion rupees year-over-year. EBITDA grew to 358 million rupees from 277 million rupees, while EBITDA margin expanded to 21.99% from 17.15% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762733542984,
            "Source": "earnings"
        },
        {
            "Title": "ADF Foods Reports Quarterly Results and Declares 30% Interim Dividend",
            "Summary": "ADF Foods Limited's Board approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company declared an interim dividend of Rs. 0.60 per share (30%) on equity shares with face value of Rs. 2 each for Financial Year 2025-26. The dividend will be paid within 30 days to shareholders whose names appear in the Register of Members as on November 13, 2025 (Record Date). The Board meeting was held on November 7, 2025, commencing at 3:45 p.m. and concluding at 5:00 p.m. The financial results were reviewed by statutory auditors MSKA Associates, Chartered Accountants.",
            "Sentiment": "positive",
            "PublishDate": 1762568111742,
            "Source": "earnings"
        },
        {
            "Title": "ADF Foods Targets Double-Digit Growth Through Capacity Expansion and Market Diversification",
            "Summary": "ADF Foods has outlined its strategy for consistent double-digit growth, driven by strong global demand in ethnic and ready-to-eat food segments. The company is expanding manufacturing capacity at its Nadiad and Gujarat facilities. ADF Foods is focusing on launching new products in U.S. and U.K. markets while strengthening its distribution network. The company aims to improve margins through backward integration and automation initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1762528254428,
            "Source": "stock"
        },
        {
            "Title": "ADF Foods Reports 34% Jump in Q2 Net Profit to 264 Million Rupees",
            "Summary": "ADF Foods reported a net profit of 264 million rupees for Q2, representing a 34% increase from 197 million rupees in the same period last year. Revenue remained flat at 1.6 billion rupees compared to the previous year. EBITDA grew significantly to 358 million rupees from 277 million rupees, while EBITDA margin expanded to 21.99% from 17.15% year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1762522252814,
            "Source": "earnings"
        },
        {
            "Title": "ADF Foods Reports 10% Revenue Growth in Q1 FY26, Secures New Listings with Costco and Tesco",
            "Summary": "ADF Foods Limited reported consolidated revenue of INR 132.9 crores for Q1 FY26, marking a 10% year-on-year increase despite global economic uncertainties and seasonal fluctuations. Consolidated EBITDA stood at INR 23.5 crores with a healthy margin of 17.7%. The company secured new listings for its Ashoka brand with major retail chains including Costco in Australia and the US, and additional listings with Tesco in the UK. The Truly Indian brand is now available in 1,600 stores across the USA and received new Costco listings. ADF Foods completed a brand refresh for Truly Indian with updated packaging set to rollout in Q3 FY26. The company's Surat Greenfield facility expansion is progressing as planned and expected to commence operations in the second half of FY26 with a capacity of 10,000 metric tons. The company maintains a debt-free balance sheet with a robust net cash balance of INR 95 crores. Management remains cautiously optimistic about sustaining growth trajectory despite ongoing tariff uncertainties and global economic challenges.",
            "Sentiment": "positive",
            "PublishDate": 1754463964357,
            "Source": "earnings"
        },
        {
            "Title": "ADF Foods Targets Revenue of Over ₹1,000 Crore by FY27",
            "Summary": "ADF Foods has set a revenue target of over ₹1,000 crore by FY27. The company plans to maintain high-teen EBITDA margins during its global expansion phase.",
            "Sentiment": "positive",
            "PublishDate": 1753896161485,
            "Source": "stock"
        },
        {
            "Title": "ADF Foods Reports 9.3% Revenue Growth to INR 132.9 Crores in Q1 FY26",
            "Summary": "ADF Foods Limited reported revenue from operations of INR 132.9 crores for Q1 FY26, marking a 9.3% year-over-year growth. The company achieved EBITDA of INR 23.5 crores with margins at 17.7%, while PAT stood at INR 15.2 crores with 11.5% margins. The processed foods division generated INR 112.2 crores in revenue with 21.5% EBITDA margins, while the distribution business contributed INR 20.7 crores with 17.4% EBITDA margins. The company secured new listings for its Ashoka brand in USA, UK, and Australia, and for Truly Indian brand in USA during the quarter. ADF Foods operates through five prominent brands including Ashoka, Truly Indian, ADF Soul, Camel, and Aeroplane, serving 55+ countries globally with 400+ product SKUs.",
            "Sentiment": "positive",
            "PublishDate": 1753894025493,
            "Source": "earnings"
        },
        {
            "Title": "ADF Foods Reports Q1 FY26 Results with Consolidated Revenue of Rs 13,287.87 Lakhs",
            "Summary": "ADF Foods Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of Rs 13,287.87 lakhs compared to Rs 12,162.46 lakhs in the same quarter last year. Consolidated profit after tax stood at Rs 1,524.48 lakhs versus Rs 1,438.60 lakhs in the previous year quarter. On a standalone basis, revenue from operations was Rs 10,033.74 lakhs against Rs 9,701.90 lakhs in the corresponding quarter. Standalone profit after tax increased to Rs 1,699.19 lakhs from Rs 1,712.68 lakhs. The company's earnings per share on a consolidated basis was Rs 1.39 for the quarter. The results were approved by the Board of Directors in a meeting held on July 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753890529118,
            "Source": "earnings"
        },
        {
            "Title": "ADF Foods Reports Higher Q1 Profit and Revenue with Improved Margins",
            "Summary": "ADF Foods reported quarterly consolidated net profit of 152 million rupees compared to 150 million rupees in the same period last year. Revenue increased to 1.3 billion rupees from 1.2 billion rupees year-over-year. The company's EBITDA rose to 235 million rupees from 196 million rupees, while EBITDA margin improved to 17.71% from 16.12% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753889139092,
            "Source": "earnings"
        },
        {
            "Title": "ADF Foods Schedules Q1 & FY 2025-26 Earnings Conference Call",
            "Summary": "ADF Foods Limited has announced an earnings conference call for Q1 & FY 2025-26 scheduled for Friday, August 1, 2025, at 4:00 PM IST. The call will be conducted by CFO Shardul Doshi and GM of Sales & Strategy Sumer Thakkar. Dial-in numbers have been provided for domestic and international participants, including access numbers for Hong Kong, Singapore, USA, and UK. The company has made pre-registration available and posted the details on its website.",
            "Sentiment": "neutral",
            "PublishDate": 1753430735328,
            "Source": "earnings"
        },
        {
            "Title": "ADF Foods Reports Decline in Q4 EBITDA and Margin",
            "Summary": "ADF Foods experienced a decrease in its fourth quarter EBITDA, which fell to 246.9 million rupees from 342.9 million rupees in the same period last year. The company's EBITDA margin also declined, dropping to 15.52% from 22.32% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1747239622000,
            "Source": "result"
        },
        {
            "Title": "ADF Foods Reports Q4 Financial Results",
            "Summary": "ADF Foods announced its Q4 financial results. The company's revenue increased to 1.59 billion rupees from 1.54 billion rupees year-over-year. However, consolidated net profit decreased to 164.4 million rupees from 258.6 million rupees year-over-year and 187.6 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747239580000,
            "Source": "result"
        },
        {
            "Title": "Adf Foods Receives Temporary Revocation of Plant Closure Orders",
            "Summary": "Adf Foods has received revocation orders from the Gujarat Pollution Control Board for the closure directions of two of its plants. The closure orders have been temporarily lifted for a period of three months.",
            "Sentiment": "positive",
            "PublishDate": 1745885342000,
            "Source": "default"
        },
        {
            "Title": "ADF Foods Receives Temporary Revocation of Plant Closure Orders",
            "Summary": "ADF Foods has received revocation orders from the Gujarat Pollution Control Board for the closure directions of two of its plants. The closure orders have been temporarily lifted for a period of three months.",
            "Sentiment": "positive",
            "PublishDate": 1745851459000,
            "Source": "default"
        },
        {
            "Title": "ADF Foods Ordered to Close Two Plants by Gujarat Pollution Board",
            "Summary": "ADF Foods has been directed by the Gujarat Pollution Control Board to cease operations at two of its manufacturing plants. This regulatory action suggests potential environmental compliance issues at the affected facilities.",
            "Sentiment": "negative",
            "PublishDate": 1744904603000,
            "Source": "default"
        },
        {
            "Title": "ADF Foods Reports Q3 EBITDA and Margin",
            "Summary": "ADF Foods announced its Q3 financial results. The company reported an EBITDA of 264 million rupees, compared to 269 million rupees in the same quarter last year. The EBITDA margin decreased to 17.88% from 20.79% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739545227000,
            "Source": "earnings"
        },
        {
            "Title": "ADF Foods Reports Q3 Financial Results",
            "Summary": "ADF Foods has announced its Q3 consolidated financial results. The company reported a net profit of 188 million rupees, slightly down from 194 million rupees year-over-year and 197 million rupees quarter-over-quarter. However, revenue increased to 1.5 billion rupees from 1.29 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739545151000,
            "Source": "earnings"
        },
        {
            "Title": "Authum Investment Increases Stake in ADF Foods",
            "Summary": "Investor Authum Investment has increased its shareholding in ADF Foods by 0.71% during the third quarter. Following this acquisition, Authum Investment's total stake in the company now stands at 14.83%.",
            "Sentiment": "positive",
            "PublishDate": 1736406483000,
            "Source": "corporate_action"
        },
        {
            "Title": "ADF Foods Plans to Expand Product Line",
            "Summary": "ADF Foods has announced plans to introduce new product categories in the latter half of the year. The company will also be expanding its Truly Indian brand with the addition of new items.",
            "Sentiment": "positive",
            "PublishDate": 1730689542000,
            "Source": "corporate_action"
        },
        {
            "Title": "ADF Foods Reaffirms Growth Targets in Earnings Call",
            "Summary": "During a recent earnings call, ADF Foods reiterated its commitment to doubling revenue by fiscal year 2027 and maintaining high-teens profit margins in the long term. The company outlined an ambitious plan to double its top line every three years, with a specific goal of reaching ₹1,000 crore in revenue by FY '27.",
            "Sentiment": "positive",
            "PublishDate": 1730689257000,
            "Source": "corporate_action"
        },
        {
            "Title": "ADF Foods Declares Dividend",
            "Summary": "ADF Foods has announced a dividend of 0.60 rupees per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1730128067000,
            "Source": "corporate_action"
        },
        {
            "Title": "ADF Foods Reports Q2 EBITDA Growth",
            "Summary": "ADF Foods has reported its Q2 financial results. The company's EBITDA increased to 277 million rupees from 248 million rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 17.15% from 17.47% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730128028000,
            "Source": "result"
        },
        {
            "Title": "ADF Foods Reports Strong Q2 Financial Results",
            "Summary": "ADF Foods announced its Q2 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 197 million rupees from 150 million rupees in the same quarter last year. Revenue also saw substantial growth, reaching 1.6 billion rupees compared to 1.2 billion rupees in the previous year's Q2.",
            "Sentiment": "positive",
            "PublishDate": 1730127973000,
            "Source": "result"
        }
    ]
}