{
    "Symbol": "ADL",
    "ISIN": "INE0CHO01012",
    "News": [
        {
            "Title": "Archidply Decor Board Meet Set for Feb 12, 2026",
            "Summary": "Archidply Decor Limited has scheduled its board meeting for February 12, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770457733287,
            "Source": "co_actions_results"
        },
        {
            "Title": "Archidply Decor Reports Financial Results for Quarter and Half Year Ended September 30, 2025",
            "Summary": "Archidply Decor Limited announced its unaudited standalone financial results for the quarter and half year ended September 30, 2025, which were approved by the Board of Directors on November 14, 2025. The company operates in the wood-based products segment and received an unqualified review report from statutory auditors for the quarterly results.",
            "Sentiment": "neutral",
            "PublishDate": 1763136186488,
            "Source": "earnings"
        },
        {
            "Title": "Archidply Decor Limited Approves Re-appointment of Two Independent Directors for Second Five-Year Term",
            "Summary": "Archidply Decor Limited's Board of Directors has approved the re-appointment of Mr. Neeraj Kumar Mittal and Mr. Dinesh Kumar Marda as Independent Directors for a second term of five years, from September 29, 2025 to September 28, 2030, subject to shareholder approval. The decision was made at a board meeting held on August 13, 2025, based on the recommendation of the Nomination and Remuneration Committee. Mr. Mittal brings over 30 years of expertise in business management, finance, and accounts, and serves as Director of Plasmix Private Limited. Mr. Marda has over 35 years of experience in the granite and paper industries and is a partner in Sunshine Granites and Director of Sai Shakti Kraft Papers Private Limited. Both directors have confirmed they meet independence criteria under the Companies Act, 2013 and have not been debarred from holding director positions by any regulatory authority.",
            "Sentiment": "positive",
            "PublishDate": 1755076339133,
            "Source": "corporate_governance"
        },
        {
            "Title": "Archidply Decor Reports Loss of Rs 14.43 Lakhs in Q1 Results",
            "Summary": "Archidply Decor Limited reported a net loss of Rs 14.43 lakhs for the quarter ended June 30, 2025, compared to a loss of Rs 21.87 lakhs in the same quarter last year. Revenue from operations declined to Rs 1,106.01 lakhs from Rs 1,234.97 lakhs year-over-year. Total income decreased to Rs 1,135.07 lakhs from Rs 1,262.74 lakhs. The company's total expenditure was Rs 1,153.87 lakhs, resulting in a loss before tax of Rs 18.79 lakhs. Basic and diluted earnings per share stood at negative Rs 0.26. The Board of Directors approved these unaudited standalone financial results on August 13, 2025, which were reviewed by statutory auditors GRV & PK. The company operates in a single segment of wood-based products.",
            "Sentiment": "negative",
            "PublishDate": 1755073872634,
            "Source": "earnings"
        }
    ]
}