{
    "Symbol": "ADOR",
    "ISIN": "INE045A01017",
    "News": [
        {
            "Title": "Ador Welding Q3FY26 Net Profit Jumps 61% to ₹27.10 Cr",
            "Summary": "Ador Welding reported strong Q3FY26 results with net profit rising 61% YoY to ₹27.10 crores. Revenue grew 5.14% to ₹286.95 crores while EPS increased to ₹15.57 from ₹9.67 in Q3FY25.",
            "Sentiment": "positive",
            "PublishDate": 1768553030931,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ador Welding Q3FY26 Net Profit Surges 61% to ₹271 Cr",
            "Summary": "Ador Welding reported strong Q3FY26 results with net profit jumping 61.23% to ₹271 crores and revenue growing 5.14% to ₹2,869.5 crores, driven by robust welding segment performance.",
            "Sentiment": "positive",
            "PublishDate": 1768552866198,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ador Welding Q3 Revenue Grows 6.2% to ₹290 Cr",
            "Summary": "Ador Welding reported Q3 revenue of ₹290 crores vs ₹273 crores YoY, with EBITDA jumping 45% to ₹35.20 crores and net profit surging 61% to ₹27.10 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768552584285,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ador Welding Poised for Growth from Defence Push",
            "Summary": "Government initiatives targeting ₹3 lakh crore defence manufacturing, naval fleet expansion to 175-200 ships, and 100 GW nuclear capacity create strong demand for Ador Welding's specialized solutions.",
            "Sentiment": "positive",
            "PublishDate": 1768055656567,
            "Source": "stocks"
        },
        {
            "Title": "Ador Welding Announces Senior Management Changes in Research & Development Division",
            "Summary": "Ador Welding Limited announced the retirement of Mr. Somnath Chakravarty as Head-Research, Development & Quality (Welding Consumables) effective November 17, 2025, and the appointment of Mr. Krishnakant Pandey as Head-Research & Development (Welding Consumables) from November 18, 2025. The transition involves replacing the retiring head with an experienced welding technology professional who holds engineering and MBA qualifications with over 22 years of industry experience across power generation, oil & gas, automotive and heavy fabrication segments.",
            "Sentiment": "neutral",
            "PublishDate": 1763379089352,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ador Welding Reports 5% Sales Growth and Margin Improvement in Latest Quarterly Results",
            "Summary": "Ador Welding Limited held an investor call following their board meeting to discuss quarterly results. The company reported 5% sales growth with gross margins at 32.7% and EBITDA margins at 12.5%, representing a 500 basis points improvement. PBT margins reached 12.2%. On a half-yearly basis, revenues were softer with gross margins at 31%, EBITDA at 11%, and PBT at INR58 crores (11%). The company operates with 850 employees across five manufacturing facilities with capacities of 90,000 metric tons of welding consumables and 30,000 welding equipment units. Sales are distributed 83% domestically and 16-17% internationally across 15 countries. Managing Director Aditya Malkani noted that volumes remained flat but margin expansion came from pricing discipline and improved product mix. The company launched new products including data mapping equipment, electric battery welders with solar components, and products for wind applications. Working capital management improved with inventory days at 47. The company announced an employee stock option plan and expects to complete a problematic project in the current quarter. Domestic volumes showed 4-5% growth while international markets faced challenges due to tariffs and project delays in key markets like Saudi Arabia.",
            "Sentiment": "positive",
            "PublishDate": 1760705880668,
            "Source": "earnings"
        },
        {
            "Title": "Ador Welding Plans Technology Upgrades and Export Expansion to Improve Margins",
            "Summary": "Ador Welding has outlined plans to enhance margins and profit growth through technology upgrades, targeting export markets, and operational improvements. The company expects these initiatives to take effect in the second half of FY26.",
            "Sentiment": "positive",
            "PublishDate": 1760547520492,
            "Source": "stock"
        },
        {
            "Title": "Ador Welding Reports Strong Q2 Performance with 14.72 EPS Despite Project Challenges",
            "Summary": "Ador Welding Limited's Board approved unaudited financial results for the second quarter and half year ended September 30, 2025. The company reported revenue from operations of Rs 28,000 lakhs for Q2 2025, up from Rs 26,776 lakhs in Q2 2024. Net profit reached Rs 2,562 lakhs in Q2 2025 compared to a loss of Rs 1,609 lakhs in the same quarter last year. Basic earnings per share stood at Rs 14.72 for Q2 2025. For the half year, revenue was Rs 53,054 lakhs with net profit of Rs 2,216 lakhs. The company operates two main segments: Welding (Rs 27,087 lakhs revenue in Q2) and Flares & Process Equipment (Rs 921 lakhs revenue in Q2). The Flares & Process Equipment division faced challenges with a turnkey project that encountered delays, leading to provisions of Rs 1,293 lakhs for cost overruns and Rs 1,499 lakhs for potential liquidated damages in the previous quarter. The company also faces a Bureau of Indian Standards compounding matter involving Rs 3,643 lakhs, which is under legal challenge. The Nomination and Remuneration Committee approved 29,500 stock options under the Ador Employee Stock Option Plan 2025 with an exercise price of Rs 10 per option.",
            "Sentiment": "positive",
            "PublishDate": 1760518169946,
            "Source": "earnings"
        },
        {
            "Title": "Ador Welding Reports Net Loss of Rs 346 Lakhs in Q1 FY26 Due to Project Cost Overruns",
            "Summary": "Ador Welding Limited reported a net loss of Rs 346 lakhs for the quarter ended June 30, 2025, compared to a net profit of Rs 2,077 lakhs in the same quarter last year. Revenue from operations declined to Rs 25,054 lakhs from Rs 26,815 lakhs year-on-year. The company recognized provisions of Rs 1,293 lakhs for estimated cost overruns and Rs 1,499 lakhs for potential liquidated damages related to a turnkey project in the Flares & Process Equipment segment that commenced in 2022-23 and was targeted for completion by June 2025. The project has encountered delays due to operational and external challenges. The Welding segment generated revenue of Rs 23,682 lakhs with segment results of Rs 3,445 lakhs, while the Flares & Process Equipment segment reported revenue of Rs 1,372 lakhs but posted negative segment results of Rs 3,411 lakhs. Basic earnings per share stood at negative Rs 1.99 compared to positive Rs 15.27 in the previous year quarter.",
            "Sentiment": "negative",
            "PublishDate": 1755075264823,
            "Source": "earnings"
        },
        {
            "Title": "ADOR Welding Reports Q1 Loss as Revenue Declines Year-over-Year",
            "Summary": "ADOR Welding reported quarterly financial results showing a significant decline in performance. The company recorded an EBITDA loss of 43 million rupees compared to a gain of 277 million rupees in the same period last year. Revenue decreased to 2.5 billion rupees from 2.7 billion rupees year-over-year. The company posted a net loss of 35 million rupees, marking a sharp reversal from the 208 million rupees profit recorded in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1755073919365,
            "Source": "earnings"
        },
        {
            "Title": "ADOR Welding Announces Q4 Results and Dividend",
            "Summary": "ADOR Welding has declared a dividend of 20 rupees per equity share. The company's Q4 EBITDA was 311 million rupees, down from 326 million rupees year-over-year, with EBITDA margin decreasing to 10.10% from 11.03%. Q4 net profit stood at 220 million rupees, compared to 255 million rupees year-over-year and 168 million rupees quarter-over-quarter. Revenue for Q4 increased to 3.1 billion rupees from 2.96 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1746536545000,
            "Source": "result"
        },
        {
            "Title": "Ador Welding Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Ador Welding has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 242 million rupees from 276 million rupees year-over-year. Additionally, the EBITDA margin declined to 8.86% from 10.63% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1737730384000,
            "Source": "earnings"
        },
        {
            "Title": "ADOR Welding Reports Mixed Q3 Financial Results",
            "Summary": "ADOR Welding has released its Q3 financial results. The company reported a net profit of 168 million rupees, down from 200 million rupees in the same quarter last year. However, revenue increased to 2.73 billion rupees from 2.2 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1737730378000,
            "Source": "earnings"
        }
    ]
}