{
    "Symbol": "ADROITINFO",
    "ISIN": "INE737B01033",
    "News": [
        {
            "Title": "Adroit Infotech Board Meet on Feb 3 for Q3 Results",
            "Summary": "Adroit Infotech Limited has scheduled a board meeting for February 3, 2026, to approve Q3FY26 unaudited financial results and address unpaid call money from rights issue of 30,91,222 equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1769502109595,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adroit Infotech Subsidiary Wins ₹46 Cr Order",
            "Summary": "Verso Altima India, subsidiary of Adroit Infotech Limited, secured a ₹46.00 crore contract from Amdocs Development Limited for application maintenance support services spanning five years.",
            "Sentiment": "positive",
            "PublishDate": 1769004185059,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adroit Infotech Subsidiary Launches Two New Products",
            "Summary": "VersoAltima India, wholly-owned subsidiary of Adroit Infotech, announced the launch of VAI360 Unified CRM and IntelHub-X Enterprise Gateway Hub on December 19, 2025, targeting telecom and broadband industries.",
            "Sentiment": "positive",
            "PublishDate": 1766490763442,
            "Source": "stocks"
        },
        {
            "Title": "Adroit Infotech Subsidiary Gets SAP Partner Authorization",
            "Summary": "Verso Altima India, wholly-owned subsidiary of Adroit Infotech, receives SAP Partner Edge-Sell authorization to directly sell SAP solutions and accelerate digital transformation services.",
            "Sentiment": "positive",
            "PublishDate": 1765807950731,
            "Source": "stocks"
        },
        {
            "Title": "Adroit Infotech Appoints New Group CEO and COO",
            "Summary": "Adroit Infotech Limited announced the appointment of two key executives effective November 6, 2025. Naveen Naidu has been appointed as Group Chief Executive Officer, bringing over 20 years of industry experience in digital transformation and SAP solutions. Satish Kumar Yadav has been named Group Chief Operating Officer, with more than 20 years of experience in operational efficiency and growth. Both executives have extensive backgrounds in telecom, cable, broadband, IoT, logistics, retail, and toll management sectors. Naidu holds a B.Tech in Computer Science and M.Tech from NIT Rourkela, while Yadav has a Bachelor of Engineering in Computer Science from RCETC. Both appointments were unanimously approved by the Board of Directors based on recommendations from the Nomination and Remuneration Committee. Neither executive is related to any current Director or Key Managerial Personnel of the company.",
            "Sentiment": "positive",
            "PublishDate": 1762450277789,
            "Source": "corporate_governance"
        },
        {
            "Title": "Adroit Infotech Subsidiary Secures INR 29 Crore Contract from Internet Service Provider",
            "Summary": "Adroit Infotech Limited's subsidiary, VERSO ALTIMA INDIA PVT LIMITED, has secured a contract worth INR 29.0 Crores from a major Internet Service Provider for Application Maintenance and Support Services. The contract spans five years and includes comprehensive onsite and offshore support services. The order was officially issued on September 10, 2025. The project involves functional and technical support for application maintenance services. Adroit Infotech is described as a specialist SAP consulting and managed services company with nearly two decades of experience. VERSO ALTIMA INDIA specializes in digital transformation services across industries including telecom, cable & media, ISP, logistics, retail, IoT, and data analytics, with operations in multiple countries including India, UK, Brazil, Thailand, Singapore, Tanzania, Indonesia, Dubai and USA.",
            "Sentiment": "positive",
            "PublishDate": 1758005992826,
            "Source": "order&deals"
        },
        {
            "Title": "Adroit Infotech Limited Announces 35th AGM and Reports Mixed Financial Performance for FY2025",
            "Summary": "Adroit Infotech Limited has submitted its Annual Report for 2024-25 and scheduled its 35th Annual General Meeting for September 9, 2025, via video conferencing. The company reported consolidated revenue of Rs. 3,391.16 lakhs (up from Rs. 2,583.70 lakhs in FY2024) and consolidated EBITDA of Rs. 893.54 lakhs (vs Rs. 565.10 lakhs previously). However, standalone operations showed mixed results with revenue of Rs. 914.50 lakhs but a net loss of Rs. 1.96 lakhs compared to a profit of Rs. 207.88 lakhs in the previous year. The company completed rights issue calls during the year, with final allotment made for 29,409,836 shares, though 3,091,222 shares remain partially unpaid. No dividend has been recommended for FY2025. The AGM will address various resolutions including director appointments, borrowing limits, and ESOP scheme modifications.",
            "Sentiment": "neutral",
            "PublishDate": 1755187256504,
            "Source": "corporate_action"
        },
        {
            "Title": "Adroit Infotech Reports No Deviations in Rights Issue Fund Utilization for Quarter Ended June 2025",
            "Summary": "Adroit Infotech Limited reported no deviations in the utilization of funds raised through its Rights Issue for the quarter ended June 30, 2025. The company raised Rs. 4,572.07 lakhs through the Rights Issue on February 14, 2025, and has utilized Rs. 1,405.22 lakhs in line with the objectives stated in the prospectus dated January 19, 2024. The funds were allocated across six categories: business expansion (Rs. 358 lakhs utilized out of Rs. 1,750 lakhs allocated), paying off non-current liabilities (Rs. 357.16 lakhs out of Rs. 755 lakhs), working capital requirements (Rs. 315.52 lakhs out of Rs. 653.44 lakhs), general corporate purposes (Rs. 358.07 lakhs out of Rs. 661.72 lakhs), and issue expenses (Rs. 16.47 lakhs out of Rs. 55 lakhs). No funds were utilized for business acquisition, which had an allocation of Rs. 1,000 lakhs. The remaining unutilized proceeds are maintained in an account with Axis Bank. The statement was reviewed by the Audit Committee and approved by the Board on July 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753197569161,
            "Source": "corporate_action"
        },
        {
            "Title": "Adroit Infotech Reports Q1 FY2026 Results, Appoints New Directors and Closes US Subsidiary",
            "Summary": "Adroit Infotech approved its unaudited financial results for the quarter ended June 30, 2025, showing consolidated revenue of Rs 10.42 crores and profit of Rs 84.23 lakhs, while standalone revenue was Rs 1.52 crores with profit of Rs 48.14 lakhs. The company appointed two new additional directors - Srinivas Rangnath Parankusam and Jammula Venkata Raja Sekhar Reddy - and accepted resignations from two existing directors. The board approved closure of its wholly-owned US subsidiary Adroit Infotech US Inc. and reconstituted various board committees. The company also changed its internal auditors from P R Chandra & Co to D Ravi & Co for FY 2025-26 and reappointed Ms. Putcha Sarada as secretarial auditor.",
            "Sentiment": "neutral",
            "PublishDate": 1753196350563,
            "Source": "earnings"
        },
        {
            "Title": "Adroit Infotech Limited Reconstitutes Board Committees with New Appointments",
            "Summary": "Adroit Infotech Limited has reconstituted four board committees through a resolution passed on July 22, 2025. The Audit Committee is now chaired by Srinivas Ranganath Parankusam with members Jammula Venkata Raja Sekhar Reddy and Sudhakiran Sunkerneni Reddy. The Nomination and Remuneration Committee is headed by Venkateswar Reddy Vari, with Srinivas Ranganath Parankusam and Sridhar Reddy Pyata as members. The Stakeholder Relationship Committee is chaired by Jammula Venkata Raja Sekhar Reddy, including Venkateswar Reddy Vari and Sridhar Reddy Pyata as members. The Rights Issue Committee is led by Srinivas Ranganath Parankusam with Sudhakiran Sunkerneni Reddy and Venkateswar Reddy Vari as members. The committees comprise a mix of independent directors, non-independent directors, and executive directors in various positions.",
            "Sentiment": "neutral",
            "PublishDate": 1753195904623,
            "Source": "corporate_governance"
        },
        {
            "Title": "Adroit Infotech: Subsidiary Secures ₹2.10 Crore International Contract",
            "Summary": "Verso Altima India Private Limited, a subsidiary of Adroit Infotech Limited, has won a ₹2.10 crore contract from Indonesian company PT Supra Primatama Nusantara for SAP BRIM managed services. The one-year contract involves functional and technical support for SAP BRIM application.",
            "Sentiment": "positive",
            "PublishDate": 1741248863000,
            "Source": "order&deals"
        },
        {
            "Title": "Adroit Infotech Secures 6.2 Crore Rupee Contract from Azam Media",
            "Summary": "Adroit Infotech has won an order worth 6.2 crore rupees from Azam Media for SAP-implementation services. The company's current market capitalization stands at 98 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1740388854000,
            "Source": "order&deals"
        },
        {
            "Title": "Adroit Infotech: Q3 Profit Plunges 65.61% YoY Despite Revenue Growth",
            "Summary": "Adroit Infotech reported Q3 FY25 results with revenue up 8.47% YoY to ₹7.68 crore, but profit down 65.61% YoY to ₹0.54 crore. Operating income fell 76.88% YoY. EPS declined to ₹0.18, a 64% YoY drop. Quarter-on-quarter performance showed improvement with revenue up 8.63% and profit up 20%.",
            "Sentiment": "negative",
            "PublishDate": 1737609498000,
            "Source": "earnings"
        }
    ]
}