{
    "Symbol": "ADSL",
    "ISIN": "INE102I01027",
    "News": [
        {
            "Title": "Allied Digital Q3FY26: 12% Revenue Growth",
            "Summary": "Allied Digital Services reports 12% YoY revenue growth to Rs. 247 crores in Q3FY26, with consolidated nine-month revenue reaching Rs. 700 crores, up 16% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1770219811793,
            "Source": "co_actions_results"
        },
        {
            "Title": "Allied Digital Services clarifies share volume surge",
            "Summary": "Allied Digital Services responds to BSE inquiry about recent trading volume increase, stating all material information has been disclosed as per regulations with no undisclosed developments.",
            "Sentiment": "neutral",
            "PublishDate": 1770021316841,
            "Source": "stocks"
        },
        {
            "Title": "Allied Digital Board Meet Set for Feb 4 for Q3FY26",
            "Summary": "Allied Digital Services Limited has scheduled a board meeting on February 04, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769701898447,
            "Source": "co_actions_results"
        },
        {
            "Title": "Allied Digital Services Reports 15% Revenue Growth to Rs 234 Crore in Q2 FY26",
            "Summary": "Allied Digital Services achieved consolidated revenues of Rs 234 crore in Q2 FY26, marking 15% year-over-year growth and the highest quarterly revenue in company history, with PBT growing 32% to Rs 21 crore and PAT increasing 33% to Rs 15 crore. The company secured order intake of approximately Rs 698 crore during the quarter and targets reaching Rs 1,000 crore in annual revenue, driven by strong performance in US operations, smart city projects including the completed Pune Command and Control center, and new enterprise client wins across healthcare, retail, and industrial sectors.",
            "Sentiment": "positive",
            "PublishDate": 1763068622838,
            "Source": "earnings"
        },
        {
            "Title": "Allied Digital Services Reports 15% Revenue Growth to ₹234 Crore in Q2 with Strong Order Wins",
            "Summary": "Allied Digital Services Limited delivered consolidated revenues of ₹234 crore for the quarter ended September 30, 2025, marking a 15% year-on-year growth. This represents the fifth consecutive quarter of revenues surpassing ₹200 crore. EBITDA grew 23% year-on-year to ₹28 crore, while profit after tax increased 33% year-on-year. The company secured new orders worth ₹169.8 crore during the quarter, including multi-year managed services contracts with European pharmaceutical companies and American apparel conglomerates. Growth was primarily driven by the Solutions business through Smart City project executions and enterprise transformation engagements. Geographically, India operations led the growth with standalone revenues increasing 10% year-on-year. The company completed the AI-enabled Integrated Command and Control Center for Pune city surveillance, making it the first city in India to launch such a system. Chairman and Managing Director Nitin D. Shah received the Asia One Greatest Leader of the Millennium 2025 award, while the company was recognized as UAE's Fastest Growing Technology Brand 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762690374535,
            "Source": "earnings"
        },
        {
            "Title": "Allied Digital Services Reports 33% Jump in Q2 Net Profit to 154M Rupees",
            "Summary": "Allied Digital Services reported Q2 consolidated net profit of 154 million rupees compared to 116 million rupees in the same period last year. Revenue increased to 2.3 billion rupees from 2 billion rupees year-over-year. EBITDA rose to 213 million rupees from 192 million rupees, though EBITDA margin declined slightly to 9.12% from 9.46% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762530174637,
            "Source": "earnings"
        },
        {
            "Title": "Allied Digital Services Schedules Earnings Call for Quarter and Half Year Results",
            "Summary": "Allied Digital Services Limited (ADSL) will host an earnings conference call for analysts and investors on November 10, 2025, at 10:30 AM IST. The call will discuss operational and financial performance for the quarter and half year ended September 30, 2025, followed by a Q&A session. The company will be represented by Founder CMD Nitin D Shah, Whole-Time Director Nehal Shah, Global CEO Paresh Shah, and CFO Gopal Tiwari. ADSL is a BSE/NSE-listed global IT services provider operating since 1984, headquartered in Mumbai, serving clients in 70+ countries with a workforce of 3,000+ professionals.",
            "Sentiment": "neutral",
            "PublishDate": 1762283103080,
            "Source": "corporate_action"
        },
        {
            "Title": "Allied Digital Services to Participate in Bharat Connect Conference",
            "Summary": "Allied Digital Services Limited announced its participation in the Bharat Connect Conference: Rising Stars organized by Arihant Capital on September 24, 2025. The company will be represented by Nehal Shah, Whole-Time Director, and Gopal Tiwari, Chief Financial Officer. The company stated that no unpublished price sensitive information will be shared during the investor meeting. Allied Digital is a global IT consulting and services company with operations across 70+ countries, offering cloud enablement, cybersecurity, and infrastructure management services.",
            "Sentiment": "neutral",
            "PublishDate": 1758199109807,
            "Source": "stock"
        },
        {
            "Title": "Allied Digital Services Reports 22% Revenue Growth to Rs 219 Crore in Q1 FY2026, Wins Rs 420 Crore Multi-Year Deal",
            "Summary": "Allied Digital Services Limited reported consolidated revenues of Rs 219 crore for Q1 FY2026, marking 22% year-on-year growth and the fourth consecutive quarter exceeding Rs 200 crore. The company's trailing 12-month revenue reached approximately Rs 850 crore, progressing toward its Rs 1,000 crore annualized revenue target. India operations drove primary growth with standalone revenues rising 27% year-on-year, led by enterprise and government segments including the Pune City Surveillance project. The company announced winning a Rs 420 crore five-year contract with a European pharmaceutical company for digital transformation services. EBITDA increased 16% to Rs 22 crore, while profit after tax rose 44% to Rs 14 crore. The board declared a 30% dividend. Order intake reached Rs 185 crore during the quarter. Management noted pricing pressures from customers seeking cost control and expects this trend to continue for three to four quarters. The company is targeting EBITDA margins of 11-12% and quarterly revenue run rates of Rs 250 crore within a couple of quarters. Allied Digital is exploring acquisitions in cybersecurity and cloud spaces while expanding its AI-based solutions including Agentic AI platform already in production with US and Indian customers.",
            "Sentiment": "positive",
            "PublishDate": 1754922670939,
            "Source": "earnings"
        },
        {
            "Title": "Allied Digital Services Wins Rs 420 Crore Five-Year Contract from European Pharmaceutical Company",
            "Summary": "Allied Digital Services Limited secured a five-year contract worth Rs 420 crore from a leading European multinational pharmaceutical company. The agreement involves transforming digital workplace solutions for over 120,000 employees across 66 countries in the Americas, Europe, and Middle East. The contract scope includes deskside and hardware support, collaboration and meeting room technology management, audio-video platform support, and Installation, Move, Add, and Change (IMAC) services. Allied Digital will also establish dedicated IT experience centers in key regions. CMD Nitin D Shah stated this engagement validates the company's global capabilities in delivering large-scale transformative projects and solidifies their position as a trusted enterprise-grade solutions provider.",
            "Sentiment": "positive",
            "PublishDate": 1754459173323,
            "Source": "order&deals"
        },
        {
            "Title": "Allied Digital Secures ₹420 Crore Contract with European Pharmaceutical Company",
            "Summary": "Allied Digital has secured a major contract worth ₹420 crore with a European pharmaceutical firm. The contract represents a significant business win for the company.",
            "Sentiment": "positive",
            "PublishDate": 1754458738574,
            "Source": "stock"
        },
        {
            "Title": "Allied Digital Plans Multi-Year Expansion Across 70+ Countries with ₹188 Crore Cash Reserve",
            "Summary": "Allied Digital is positioning for multi-year growth driven by smart city initiatives, government projects, global enterprise recovery, and AI/Gen AI solutions. The company maintains a net debt-free balance sheet with ₹188 crore in cash and plans to leverage increasing global contracts to expand operations across more than 70 countries.",
            "Sentiment": "positive",
            "PublishDate": 1754407468429,
            "Source": "stock"
        },
        {
            "Title": "Allied Digital Services Reports 22% Revenue Growth in Q1 FY26",
            "Summary": "Allied Digital Services Limited reported consolidated revenue of ₹219 crore for Q1 FY26, marking a 22% year-over-year increase from ₹179 crore in Q1 FY25. The IT services company posted a profit after tax (PAT) of ₹14 crore, up 40% from ₹10 crore in the same quarter last year. EBITDA grew 16% to ₹22 crore. India operations drove growth with 31% increase in revenue to ₹80 crore, while international markets contributed ₹139 crore, up 18%. The company secured new orders worth ₹185 crore during the quarter, including contracts with a New York-based investment bank, a commercial vehicle components leader, and a global ice cream brand. Government segment revenue surged 69% to ₹71 crore. Chairman Nitin D. Shah highlighted strong traction in Enterprise and Government segments, with Smart City projects gaining momentum and international business showing early recovery signs.",
            "Sentiment": "positive",
            "PublishDate": 1754403989583,
            "Source": "earnings"
        },
        {
            "Title": "Allied Digital Services Reports Q4 Financial Results",
            "Summary": "Allied Digital Services has reported its Q4 financial results. The company experienced an EBITDA loss of 93 million rupees, compared to a profit of 243 million rupees in the same quarter of the previous year. Revenue for Q4 increased to 2.04 billion rupees from 1.77 billion rupees in the previous year. The company also reported a consolidated net loss of 87 million rupees for Q4, in contrast to a profit of 107.9 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1749177794000,
            "Source": "result"
        },
        {
            "Title": "Allied Digital Secures Rs. 80 Crore Order for Pune Smart City Project",
            "Summary": "Allied Digital has received a follow-up order worth Rs. 80 crore for the Pune Smart City project. This new order brings the total value of their involvement in the project to over Rs. 500 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747992269000,
            "Source": "default"
        },
        {
            "Title": "Allied Digital Secures Contract for MSETCL Network Modernization",
            "Summary": "Allied Digital has been awarded a contract for the upgradation and modernization of the Maharashtra State Electricity Transmission Company Limited (MSETCL) network using SD-WAN technology. This project aims to enhance the efficiency and capabilities of MSETCL's network infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1738844430000,
            "Source": "order&deals"
        },
        {
            "Title": "Allied Digital Services Reports Q3 EBITDA Growth",
            "Summary": "Allied Digital Services has reported its Q3 financial results. The company's EBITDA increased to 250.5 million rupees, up from 207 million rupees in the same quarter last year. However, the EBITDA margin decreased slightly to 11.36% from 12.08% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738341567000,
            "Source": "earnings"
        },
        {
            "Title": "Allied Digital Services Reports Q3 Revenue Increase",
            "Summary": "Allied Digital Services has announced its third quarter revenue, which stands at 2.2 billion rupees. This represents a significant increase from the previous year's third quarter revenue of 1.7 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738341557000,
            "Source": "earnings"
        },
        {
            "Title": "Allied Digital Services Reports Significant Profit Growth in Q3",
            "Summary": "Allied Digital Services has announced its Q3 consolidated net profit, which stands at 166.8 million rupees. This represents a substantial year-over-year increase from 98 million rupees in the same quarter last year. The company also showed quarter-over-quarter growth, with profits rising from 101.8 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738341545000,
            "Source": "earnings"
        },
        {
            "Title": "Allied Blenders and Distillers Ltd Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) for Allied Blenders and Distillers Ltd. The transaction involved approximately 501,815 shares, traded at a price of Rs. 425.50 per share. The total value of the block trade amounted to Rs. 21.35 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1735534418000,
            "Source": "block_deals"
        },
        {
            "Title": "Allied Digital Services Invests in UAE Subsidiary",
            "Summary": "Allied Digital Services has made an investment in a subsidiary company located in the United Arab Emirates.",
            "Sentiment": "neutral",
            "PublishDate": 1730128112000,
            "Source": "corporate_action"
        },
        {
            "Title": "Allied Digital Services Reports Q2 Financial Results",
            "Summary": "Allied Digital Services has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 is 192 million rupees, compared to 208.2 million rupees in the same quarter last year. The EBITDA margin has decreased from 12.06% to 9.46% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730127273000,
            "Source": "result"
        },
        {
            "Title": "Allied Digital Services Reports Q2 Financial Results",
            "Summary": "Allied Digital Services announced its Q2 consolidated financial results. The company reported a net profit of 102 million rupees, up from 97.2 million rupees year-over-year and 85 million rupees quarter-over-quarter. Revenue for Q2 reached 2 billion rupees, an increase from 1.7 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730127195000,
            "Source": "result"
        },
        {
            "Title": "Allied Digital: Wins Rs 430-Crore Pune Safe City Project",
            "Summary": "<p><span class='positive'>Allied Digital Services Ltd.</span> secured a <span class='positive'>Rs 430 crore contract</span> for the <b>Pune Safe City Project</b>. The <span class='neutral'>six-year project</span> involves implementing a <span class='positive'>comprehensive surveillance system</span> with over <span class='neutral'>4,000 AI-enabled cameras</span> across <span class='neutral'>1,400 locations</span> in Pune. The project includes <span class='positive'>advanced technology features</span> and <span class='positive'>infrastructure upgrades</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728373154000,
            "Source": "normal_news"
        },
        {
            "Title": "Allied Digital Secures Major Contract",
            "Summary": "<p>Allied Digital has won an <span class='positive'>order worth Rs 430 crore</span> (approximately $52 million USD). This <span class='positive'>significant contract</span> represents a <b>substantial business opportunity</b> for the company.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728370131000,
            "Source": "corporate_action"
        }
    ]
}