{
    "Symbol": "ADVAIT",
    "ISIN": "INE0ALI01010",
    "News": [
        {
            "Title": "Advait Energy Q3FY26 Results: Revenue Up 32% YoY",
            "Summary": "Advait Energy Transitions reported strong Q3FY26 performance with revenue rising 32% YoY to Rs 12,471.43 lakh and net profit growing 20% to Rs 1,251.00 lakh. Material subsidiary exploring Rs 90 crore fundraising.",
            "Sentiment": "positive",
            "PublishDate": 1770804400470,
            "Source": "co_actions_results"
        },
        {
            "Title": "Advait Energy Subsidiary Signs Green Hydrogen MoUs",
            "Summary": "Advait Energy Transitions' subsidiary Advait Greenergy signed three non-binding MoUs during India Energy Week for hydrogen storage systems and electrolyser technology collaborations.",
            "Sentiment": "positive",
            "PublishDate": 1770491830032,
            "Source": "co_actions_results"
        },
        {
            "Title": "Advait Energy Transitions Q3 & 9MFY26 Earnings Call Feb 12",
            "Summary": "Advait Energy Transitions Limited schedules earnings conference call for February 12, 2026 at 12:00 PM IST to discuss Q3 & 9MFY26 financial results under SEBI Regulation 30.",
            "Sentiment": "neutral",
            "PublishDate": 1770388769328,
            "Source": "co_actions_results"
        },
        {
            "Title": "Advait Energy Wins ₹19.99 Crore MSETCL Order",
            "Summary": "Advait Energy Transitions secures ₹19.99 crore contract from Maharashtra State Electricity Transmission Company for emergency restoration system with 6-month completion timeline.",
            "Sentiment": "positive",
            "PublishDate": 1770193697595,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kedia Securities Acquires 1.14% Stake in Advait Energy",
            "Summary": "Vijay Kedia's Kedia Securities Private Limited has acquired a 1.14% stake in Advait Energy Transitions during Q3, marking a notable investment move in the energy transition sector.",
            "Sentiment": "neutral",
            "PublishDate": 1768796765518,
            "Source": "co_actions_results"
        },
        {
            "Title": "Advait Energy gets ₹245 Cr PGVCL order, stock jumps 3%",
            "Summary": "Advait Energy Transitions emerges as L1 bidder for RDSS projects worth ₹245 crore from PGVCL across five Gujarat regions. Stock rises 2.78% on news, reaching intraday high of ₹1,477.60.",
            "Sentiment": "positive",
            "PublishDate": 1767962010256,
            "Source": "co_actions_results"
        },
        {
            "Title": "Advaity Energy Wins ₹245.33 Cr PGVCL RDSS Tender",
            "Summary": "Advaity Energy Transitions Limited emerges as L1 bidder for PGVCL's 11 KV medium voltage covered conductor project across five Gujarat districts worth ₹245.33 crores under RDSS scheme.",
            "Sentiment": "positive",
            "PublishDate": 1767952837598,
            "Source": "co_actions_results"
        },
        {
            "Title": "Advait Energy Wins ₹246.33 Cr RDSS Contract",
            "Summary": "Advait Energy Transitions confirmed as top bidder for 11 KV medium voltage covered conductor supply and commissioning contract worth ₹246.33 crore across five regions under RDSS scheme.",
            "Sentiment": "positive",
            "PublishDate": 1767952409846,
            "Source": "co_actions_results"
        },
        {
            "Title": "Advait Energy Wins ₹27.87 Cr PTCUL Power Project",
            "Summary": "Advait Energy Transitions Limited emerges as L1 bidder for PTCUL's 132 kV HTLS re-conductoring project worth ₹27.87 crores, marking significant infrastructure win for the company.",
            "Sentiment": "positive",
            "PublishDate": 1767952353979,
            "Source": "co_actions_results"
        },
        {
            "Title": "Advait Energy Wins ₹27.88 Cr HTLS Conductor Order",
            "Summary": "Advait Energy Transitions confirmed as top bidder for replacing old ACSR Panther conductor with HTLS conductor in major infrastructure upgrade project worth ₹27.88 crores including taxes.",
            "Sentiment": "positive",
            "PublishDate": 1767951977682,
            "Source": "co_actions_results"
        },
        {
            "Title": "Advait Energy Wins ₹100 Cr DGVCL Contract",
            "Summary": "Advait Energy Transitions secures major ₹100 crore contract from DGVCL for MVCC power infrastructure development under the KSY program, marking significant business expansion.",
            "Sentiment": "positive",
            "PublishDate": 1766134910403,
            "Source": "co_actions_results"
        },
        {
            "Title": "Advait Energy Allots 420 Shares Under ESOP Scheme",
            "Summary": "Advait Energy Transitions Limited allotted 420 equity shares to employees under ESOP 2022 scheme on December 15, 2025, increasing paid-up capital to ₹10.94 crores with 1,09,37,381 total shares.",
            "Sentiment": "neutral",
            "PublishDate": 1765805482130,
            "Source": "co_actions_results"
        },
        {
            "Title": "Advait Energy Promoter Increases Stake to 14.89%",
            "Summary": "Promoter Rejal Sheth acquired 3,979 additional shares through open market purchase, raising shareholding from 14.85% to 14.89% in Advait Energy Transitions Limited.",
            "Sentiment": "positive",
            "PublishDate": 1765463370334,
            "Source": "stocks"
        },
        {
            "Title": "Advait Energy Transitions Secures ₹25.36 Crore Contract with Malaysian Firm",
            "Summary": "Advait Energy Transitions has secured an international contract worth ₹25.36 crore with a Malaysian company. This contract represents a significant business development for the company's international operations and revenue expansion.",
            "Sentiment": "positive",
            "PublishDate": 1764560078315,
            "Source": "stock"
        },
        {
            "Title": "Advait Energy Transitions Secures ₹25.36 Crore Contract from Malaysian Entity for High Voltage Installation Works",
            "Summary": "Advait Energy Transitions Limited received an order worth ₹25.36 crore from Purnama Solution (M) Sdn. Bhd. for executing high voltage OPGW installation works under two Tenaga Nasional Berhad contracts in Malaysia. The contracts involve fiber optic supply services on TNB high voltage infrastructure projects in Central and Johor Utara regions.",
            "Sentiment": "positive",
            "PublishDate": 1764419501969,
            "Source": "order&deals"
        },
        {
            "Title": "Advait Energy Transitions Secures Rs 21.30 Crore Order from PGCIL",
            "Summary": "Advait Energy Transitions Limited received an order worth Rs 21.30 crore from Powergrid Corporation of India Ltd. for Package ERS-1 procurement of Emergency Restoration System suitable up to 765kV AC/800kV on November 28, 2025. The order was secured in the normal course of business and represents a significant contract for the company's energy infrastructure operations.",
            "Sentiment": "positive",
            "PublishDate": 1764409365965,
            "Source": "order&deals"
        },
        {
            "Title": "Advait Energy Transitions Allots 184 Equity Shares Under ESOP Scheme",
            "Summary": "Advait Energy Transitions Limited allotted 184 equity shares of Rs. 10 face value each to employees under its Employee Stock Option Scheme 2022, with shares exercised at Rs. 10 per share. The allotment increases the company's paid-up share capital to Rs. 10,93,69,610 consisting of 1,09,36,961 equity shares, with the new shares ranking equally with existing shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764076575763,
            "Source": "corporate_action"
        },
        {
            "Title": "Advait Energy Transitions Reports 160% Revenue Growth, Order Book Crosses Rs 1,000 Crores",
            "Summary": "Advait Energy Transitions Limited reported consolidated revenue of Rs 275 crores for H1 FY2026, marking 160% year-on-year growth, with EBITDA of Rs 31.06 crores growing 87% and order book surpassing Rs 1,000 crores with 177% YoY growth. The company secured major orders including Rs 90 crores ERS order from PowerGrid and Rs 100+ crores EPC order from DGVCL, while expanding manufacturing capabilities across power transmission and renewable energy divisions.",
            "Sentiment": "positive",
            "PublishDate": 1763727007697,
            "Source": "earnings"
        },
        {
            "Title": "Advait Energy Plans Aggressive Green Energy Expansion with 25%+ Revenue Growth Target",
            "Summary": "Advait Energy is targeting aggressive expansion in green energy and transmission infrastructure while venturing into hydrogen storage and charging infrastructure. The company guides for top-line growth above 25% year-over-year, supported by strong order book visibility in power and renewables sectors and new joint venture alliances to boost export content.",
            "Sentiment": "positive",
            "PublishDate": 1763052475399,
            "Source": "earnings"
        },
        {
            "Title": "Advait Energy Transitions Schedules Earnings Call for Q2 FY26 Results",
            "Summary": "Advait Energy Transitions Limited has scheduled an earnings conference call for November 14, 2025, at 2:00 PM IST to discuss its quarterly and half-year results ended September 30, 2025. The call will be led by key management including Founder Managing Director Shalin Sheth, Head of Human Resources Strategy Rutvi Sheth, and Managing Director of subsidiary Advait Greenergy Vatsal Kundalia. The company, formerly known as Advait Infratec Limited, operates in energy transition and infrastructure with headquarters in Ahmedabad, Gujarat. Since rebranding in July 2023, the company has expanded into renewable energy, battery storage, green hydrogen technologies and grid solutions, having executed 450 power transmission, substation and telecom infrastructure projects across 45 countries.",
            "Sentiment": "neutral",
            "PublishDate": 1762778879670,
            "Source": "corporate_action"
        },
        {
            "Title": "Advait Energy Transitions' Subsidiary Signs MoU with Gujarat Government for Rs 1,450 Crore Investment",
            "Summary": "Advait Greenergy Private Limited, a subsidiary of Advait Energy Transitions Limited, signed a Memorandum of Understanding with the Government of Gujarat on October 10, 2025, at Mehsana Gujarat. The agreement is part of the Investment Promotion Activity for Vibrant Gujarat Regional Conference. Under the MoU, the Gujarat government will facilitate the subsidiary in obtaining necessary permissions, registrations, approvals, and clearances from concerned state departments as per existing policies and regulations. Advait Greenergy plans to establish two projects in Gujarat with a combined investment of Rs 1,450 crores. The transaction does not involve any related party arrangements or shareholding between the parties.",
            "Sentiment": "positive",
            "PublishDate": 1760106209255,
            "Source": "order&deals"
        },
        {
            "Title": "Advait Energy Transitions Secures ₹87.3 Crore Order",
            "Summary": "Advait Energy Transitions has secured a new order worth ₹87.3 crores. The company announced this business development, which represents a significant contract win for the energy transitions firm.",
            "Sentiment": "positive",
            "PublishDate": 1759830868052,
            "Source": "order&deals"
        },
        {
            "Title": "Advait Energy Increases Stake in Advait Greenergy to 68.99%",
            "Summary": "Advait Energy has increased its shareholding in Advait Greenergy to 68.99% by acquiring an additional 14,820 shares. This acquisition represents a strategic move to boost the company's ownership stake in its subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1759245550467,
            "Source": "corporate_action"
        },
        {
            "Title": "Advait Energy Transitions Sells 100% Stakes in Two Subsidiaries for ₹2 Lakh Total",
            "Summary": "Advait Energy Transitions Limited has sold its entire stakes in two wholly owned subsidiaries - A&G Hydrogen Technologies Private Limited and Advaiteco Technologies Private Limited - to its subsidiary Advait Greenergy Private Limited. Each subsidiary was sold for ₹1,00,000 through the transfer of 10,000 equity shares at face value of ₹10 per share. Both subsidiaries were recently incorporated, with A&G Hydrogen Technologies established in July 2024 and Advaiteco Technologies in May 2025, resulting in nil turnover and revenue. Following the transaction, both companies will become step-down subsidiaries of Advait Energy Transitions Limited. The sale is structured as a related party transaction conducted at arm's length, with completion expected before December 3, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757686381082,
            "Source": "corporate_action"
        },
        {
            "Title": "Advait Energy Secures ₹80 Crore Order",
            "Summary": "Advait Energy has obtained a new order worth ₹80 crore. The company announced this business development, which represents a significant contract win for the energy sector firm.",
            "Sentiment": "positive",
            "PublishDate": 1756807097254,
            "Source": "order&deals"
        },
        {
            "Title": "Advait Energy Transitions Reports Fund Utilization Statement for Preferential Issue",
            "Summary": "Advait Energy Transitions Limited submitted its quarterly statement showing fund utilization from preferential issue of equity and warrants. The company raised ₹82.30 crores through preferential equity issue, ₹6.29 crores through warrants, and ₹2.57 crores from warrant conversions. Funds were allocated for working capital requirements, capital investment in plant and machinery, subsidiary investments, and general corporate purposes. The company reported no deviation in fund utilization during the quarter. As of June 30, 2025, ₹30.99 crores from equity issue and ₹35.46 lakhs from warrant proceeds had been utilized. The statement was reviewed by the Audit Committee and signed by Whole-time Director & CFO Rejal Sheth.",
            "Sentiment": "neutral",
            "PublishDate": 1754401661753,
            "Source": "corporate_action"
        },
        {
            "Title": "Advait Energy Transitions Reports 53% Jump in Q1 Net Profit to 84 Million Rupees",
            "Summary": "Advait Energy Transitions reported consolidated net profit of 84 million rupees in Q1, up from 55 million rupees in the same period last year. Revenue doubled to 1.2 billion rupees compared to 598 million rupees year-over-year. EBITDA increased to 137 million rupees from 80 million rupees, though EBITDA margin declined to 11.6% from 13.5% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754383225158,
            "Source": "earnings"
        },
        {
            "Title": "Advait Energy Transitions Extends Timeline for Subsidiary Sale Completion by 4 Months",
            "Summary": "Advait Energy Transitions Limited has extended the timeline for completing the sale of its 100% stake in two wholly owned subsidiaries to December 3, 2025, from the original date of August 4, 2025. The company is selling A&G Hydrogen Technologies Private Limited and Advaiteco Technologies Private Limited to Advait Greenergy Private Limited, a subsidiary of Advait Energy Transitions. Each subsidiary involves the sale of 10,000 equity shares at ₹10 per share, totaling ₹1,00,000 for each transaction. The extension is attributed to ongoing procedural formalities for the share transfer process.",
            "Sentiment": "neutral",
            "PublishDate": 1754291013857,
            "Source": "corporate_action"
        },
        {
            "Title": "Statutory Auditor Resigns from Advait Energy Transitions' Material Subsidiary",
            "Summary": "M/s H.J. Goswami & Associates, Chartered Accountants, resigned as Statutory Auditor of Advait Greenergy Private Limited, a material subsidiary of Advait Energy Transitions Limited, effective July 31, 2025. The auditor cited increased compliance scope and inability to devote sufficient time to company affairs as reasons for resignation. The auditor was appointed on September 30, 2024, with the term originally scheduled to expire on March 31, 2029. The latest audit report was submitted on July 28, 2025, for the period ending June 30, 2025. The auditor confirmed no other material reasons existed for the resignation beyond those stated.",
            "Sentiment": "neutral",
            "PublishDate": 1753970155062,
            "Source": "corporate_governance"
        },
        {
            "Title": "Advait Energy Sells Two Units to Enhance Green Energy Portfolio",
            "Summary": "Advait Energy has announced the sale of two of its units as part of a strategy to enhance its green energy portfolio. The company is focusing on expanding its presence in the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1750991148000,
            "Source": "default"
        },
        {
            "Title": "Advait Energy Transition Ltd: Shares Surge on Vijay Kedia's Stake Purchase",
            "Summary": "Advait Energy Transition Ltd.'s shares hit a 10-month high after Vijay Kedia's firm bought a 0.92% stake for Rs 17.25 crore. The stock rose 14.76% to Rs 244.60, with trading volume 36 times its 30-day average.",
            "Sentiment": "positive",
            "PublishDate": 1749702733000,
            "Source": "block_deals"
        },
        {
            "Title": "Vijay Kedia Acquires 0.93% Stake in Advait Energy",
            "Summary": "Vijay Kedia of Kedia Securities has purchased 100,000 shares of Advait Energy for ₹17.25 crores. This acquisition represents a 0.93% stake in the company.",
            "Sentiment": "positive",
            "PublishDate": 1749697999000,
            "Source": "default"
        },
        {
            "Title": "Advait Energy Transitions: Vijay Kedia Acquires Rs 17 Crore Stake",
            "Summary": "Ace investor Vijay Kedia purchased 1 lakh shares of Advait Energy Transitions at Rs 1,725 per share, totaling Rs 17.25 crore. The smallcap company, with a market cap of Rs 1,800 crore, specializes in power transmission and telecom infrastructure solutions. Advait's Q4FY25 results show a 58% increase in net profit to Rs 11.4 crore and a 225% jump in revenue to Rs 198 crore.",
            "Sentiment": "positive",
            "PublishDate": 1749655327000,
            "Source": "block_deals"
        },
        {
            "Title": "Advait Energy Transitions Secures Order Worth ₹130 Crore",
            "Summary": "Advait Energy Transitions has received an order valued at ₹130 crore. The company's market capitalization is reported to be ₹1620 crore. This new order is expected to increase the company's revenue by approximately 40%.",
            "Sentiment": "positive",
            "PublishDate": 1747385599000,
            "Source": "default"
        },
        {
            "Title": "Advait Energy Transitions Secures ₹86 Crore Order",
            "Summary": "Advait Energy Transitions has received a new order valued at ₹86 crore (approximately $10.3 million). This significant order is likely to boost the company's revenue and potentially impact its market position in the energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1747203803000,
            "Source": "default"
        },
        {
            "Title": "Advait Energy Transitions Reports Strong Q4 Results and Dividend",
            "Summary": "Advait Energy Transitions announced its Q4 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 128.8 million rupees, up from 72 million rupees in the same quarter last year and 97.9 million rupees in the previous quarter. Revenue also saw a substantial rise to 1.95 billion rupees, compared to 597 million rupees in the year-ago period. Additionally, the company has recommended a dividend of 1.75 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747095750000,
            "Source": "default"
        },
        {
            "Title": "Advait Energy Transitions Reports Q4 Results and Dividend Announcement",
            "Summary": "Advait Energy Transitions announced its Q4 financial results and dividend. The company's Q4 consolidated net profit increased to 128.8M rupees from 72M rupees year-over-year. Revenue grew significantly to 1.95B rupees from 597M rupees. However, EBITDA margin decreased to 9.77% from 19.2%. The company recommended a dividend of 1.75 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747068869000,
            "Source": "result"
        },
        {
            "Title": "Advait Energy Secures Turnkey Contract for 11 KV Medium Voltage Covered Conductor",
            "Summary": "Advait Energy has been confirmed as the successful bidder (L1 stage) for a turnkey contract. The contract involves the supply, installation, testing, and commissioning of 11 KV medium voltage covered conductor systems.",
            "Sentiment": "positive",
            "PublishDate": 1744689768000,
            "Source": "order&deals"
        },
        {
            "Title": "Advait Energy Transitions Secures L1 Stage Bid for Turnkey Contract",
            "Summary": "Advait Energy Transitions has received confirmation of being the successful bidder at the L1 stage for a turnkey contract tender. This indicates that the company has been selected as the lowest bidder and is likely to be awarded the contract, pending final negotiations and approvals.",
            "Sentiment": "positive",
            "PublishDate": 1743671742000,
            "Source": "order&deals"
        },
        {
            "Title": "Advait Energy Transitions Secures Order from Adani Green Energy",
            "Summary": "Advait Energy Transitions has received an order from Adani Green Energy for turnkey solutions in solar EPC (Engineering, Procurement, and Construction). This order signifies a business relationship between the two companies in the renewable energy sector, specifically in solar power project development.",
            "Sentiment": "positive",
            "PublishDate": 1743466364000,
            "Source": "order&deals"
        },
        {
            "Title": "Advait Energy Transitions Secures Solar EPC Order from Adani Green Energy",
            "Summary": "Advait Energy Transitions has received an order from Adani Green Energy for turnkey solutions in solar EPC (Engineering, Procurement, and Construction). This order signifies a business collaboration between the two companies in the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1743172397000,
            "Source": "order&deals"
        },
        {
            "Title": "Advait Energy Transitions Wins Bid for Power Grid Corp Package",
            "Summary": "Advait Energy Transitions has emerged as the lowest bidder (L1) for Package OPGW-04, an order from Power Grid Corporation of India. This successful bid represents a significant business opportunity for Advait Energy Transitions in the power transmission sector.",
            "Sentiment": "positive",
            "PublishDate": 1742948003000,
            "Source": "order&deals"
        },
        {
            "Title": "Advait Energy Transitions Secures L1 Bidder Status for Power Grid Corp Contract",
            "Summary": "Advait Energy Transitions has been declared the L1 (lowest) bidder for the OPGW-04 package order from Power Grid Corporation of India. This development indicates that Advait Energy Transitions is in a favorable position to potentially secure the contract for this specific package from the state-owned electric utilities company.",
            "Sentiment": "positive",
            "PublishDate": 1742901366000,
            "Source": "order&deals"
        },
        {
            "Title": "Advait Energy Transitions: Targets 13-18% Margin Growth in Next 2-3 Years",
            "Summary": "Advait Energy Transitions Ltd. expects 13-18% margin growth over the next 2-3 years due to enhanced production capacity. The company anticipates revenue from a new facility by April 2027 and plans to expand its New and Renewable Energy division. Equal revenue contribution from Power Transmission Solutions and NRE divisions is expected in 3-4 years.",
            "Sentiment": "positive",
            "PublishDate": 1742280545000,
            "Source": "normal_news"
        },
        {
            "Title": "Advait Energy Transitions Reports Q3 EBITDA Growth",
            "Summary": "Advait Energy Transitions announced its Q3 financial results. The company's EBITDA increased to 148 million rupees, up from 123 million rupees in the same quarter last year. However, the EBITDA margin decreased to 15.05% from 16.93% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739369972000,
            "Source": "earnings"
        },
        {
            "Title": "Advait Energy Transitions Reports Q3 Financial Results",
            "Summary": "Advait Energy Transitions has announced its Q3 financial results. The company's consolidated net profit increased to 98 million rupees, up from 77 million rupees in the same quarter last year. Revenue also saw growth, reaching 984 million rupees compared to 726 million rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739369969000,
            "Source": "earnings"
        },
        {
            "Title": "Advait Infratech Secures Order from Gujarat Energy Transmission Corporation",
            "Summary": "Advait Infratech has won an order from Gujarat Energy Transmission Corporation Limited (GETCO). This development indicates a new business opportunity for the company in the energy transmission sector.",
            "Sentiment": "positive",
            "PublishDate": 1736319026000,
            "Source": "order&deals"
        },
        {
            "Title": "Advait Infratech Reports Q2 EBITDA and Margin",
            "Summary": "Advait Infratech announced its Q2 financial results. The company's EBITDA for the quarter was 83 million rupees, compared to 88 million rupees in the same quarter last year. The EBITDA margin for Q2 was 17.86%, slightly lower than the 18.04% reported in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1731600524000,
            "Source": "result"
        },
        {
            "Title": "Advait Infratech Reports Q2 Financial Results",
            "Summary": "Advait Infratech announced its Q2 consolidated net profit of 40 million rupees, down from 55 million rupees year-over-year and 54 million rupees quarter-over-quarter. The company's Q2 revenue was 462 million rupees, compared to 489 million rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1731600484000,
            "Source": "result"
        }
    ]
}