{
    "Symbol": "ADVANIHOTR",
    "ISIN": "INE199C01026",
    "News": [
        {
            "Title": "Advani Hotels seeks postal ballot approval for CEO pay",
            "Summary": "Advani Hotels & Resorts initiates postal ballot for Mr. Prahlad S. Advani's remuneration as CEO and Whole Time Director from March 1, 2026 to July 31, 2027, following failed special resolution in September 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769601626239,
            "Source": "stocks"
        },
        {
            "Title": "Advani Hotels Declares Re.1 Interim Dividend",
            "Summary": "Advani Hotels & Resorts announces first interim dividend of Re.1 per share for shareholders, marking a significant corporate action for the hospitality company.",
            "Sentiment": "positive",
            "PublishDate": 1769177373118,
            "Source": "co_actions_results"
        },
        {
            "Title": "Advani Hotels Board Meet Jan 23 for Buyback & Q3",
            "Summary": "Advani Hotels & Resorts schedules board meeting for January 23, 2026, to review share buyback proposals and third quarter financial results, marking key corporate governance milestone.",
            "Sentiment": "neutral",
            "PublishDate": 1768806796531,
            "Source": "co_actions_results"
        },
        {
            "Title": "Advani Hotels Shareholders Approve Articles Amendment",
            "Summary": "Advani Hotels & Resorts (India) Limited successfully passes special resolution for Articles of Association alteration through postal ballot with 99.998% votes in favour from 234 shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1768218482365,
            "Source": "co_actions_results"
        },
        {
            "Title": "Advani Hotels & Resorts Seeks Shareholder Approval for Share Buyback Authorization",
            "Summary": "Advani Hotels & Resorts has issued a postal ballot notice seeking shareholder approval to amend its Articles of Association by adding Article 53A, which would authorize the company to buy back its own shares subject to applicable legal limits. The e-voting period runs from December 12, 2025, to January 10, 2026, with results to be declared by January 12, 2026, as the Board explores options to enhance shareholder value and returns.",
            "Sentiment": "positive",
            "PublishDate": 1765365264864,
            "Source": "corporate_action"
        },
        {
            "Title": "Advani Hotels Board Explores Shareholder Value Enhancement Including Share Buyback",
            "Summary": "Advani Hotels And Resorts (India) board has initiated exploration of various ways to enhance shareholder value, with share buyback being one of the options under consideration. The board has also approved changes to the company's articles and postal ballot process as part of its strategic initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1764688342942,
            "Source": "corporate_action"
        },
        {
            "Title": "Advani Hotels & Resorts Reports Wider Net Loss and Revenue Decline in Q2",
            "Summary": "Advani Hotels & Resorts reported a net loss of 9.8 million rupees in Q2, compared to a loss of 5.6 million rupees in the same period last year. The company's revenue decreased to 152 million rupees from 167 million rupees year-over-year. The results show both deepening losses and declining revenue performance for the hospitality company.",
            "Sentiment": "negative",
            "PublishDate": 1762604193626,
            "Source": "earnings"
        },
        {
            "Title": "Advani Hotels Reports Loss in Q2 FY26 Despite Revenue Growth",
            "Summary": "Advani Hotels & Resorts (India) Limited reported a net loss of ₹97.66 lakhs for the quarter ended September 30, 2025, compared to a profit of ₹235.06 lakhs in the previous quarter. Total income increased to ₹2,607.40 lakhs from ₹2,088.86 lakhs in the prior quarter. For the half-year period, the company posted a profit of ₹137.40 lakhs on total income of ₹4,696.26 lakhs. Employee benefit expenses rose to ₹837.41 lakhs in the quarter from ₹874.71 lakhs previously. The company noted that due to the seasonal nature of the hospitality business, quarterly results are not indicative of full-year performance. Cash and cash equivalents stood at ₹2,955.91 lakhs as of September 30, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762603692486,
            "Source": "earnings"
        },
        {
            "Title": "Advani Hotels & Resorts Reports Decline in Q1 Financial Performance",
            "Summary": "Advani Hotels & Resorts reported Q1 net profit of 24 million rupees, down from 36 million rupees in the same period last year. Revenue decreased to 199 million rupees from 221 million rupees year-over-year. EBITDA fell to 30 million rupees compared to 47 million rupees previously, while EBITDA margin contracted to 14.81% from 21.08% in the prior year period.",
            "Sentiment": "negative",
            "PublishDate": 1754061170594,
            "Source": "earnings"
        },
        {
            "Title": "Advani Hotels & Resorts Reports Q4 Financial Results",
            "Summary": "Advani Hotels & Resorts has released its Q4 financial results. The company's EBITDA increased to 151 million rupees from 143 million rupees year-over-year. The EBITDA margin improved to 45.08% from 43.96% in the same period last year. Revenue rose to 335 million rupees from 326 million rupees year-over-year. The standalone net profit for Q4 was 114.7 million rupees, up from 106 million rupees year-over-year and 119.2 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1748019273000,
            "Source": "result"
        },
        {
            "Title": "Advani Hotels & Resorts Reports Increased Q3 Profit and Revenue",
            "Summary": "Advani Hotels & Resorts has announced its financial results for the third quarter. The company reported a net profit of 119 million rupees, up from 93 million rupees in the same period last year. Revenue also increased to 351 million rupees from 323 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739146423000,
            "Source": "earnings"
        },
        {
            "Title": "Advani Hotels & Resorts Reports Improved Q3 EBITDA and Margin",
            "Summary": "Advani Hotels & Resorts has announced its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 159 million rupees, up from 128 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin improved to 45.13% from 39.67% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738933842000,
            "Source": "earnings"
        },
        {
            "Title": "Advani Hotels & Resorts Reports Q3 Profit and Revenue Growth",
            "Summary": "Advani Hotels & Resorts has announced its financial results for the third quarter. The company reported a net profit of 119 million rupees, up from 93 million rupees in the same period last year. Revenue also increased to 351 million rupees from 323 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738933837000,
            "Source": "earnings"
        },
        {
            "Title": "Advani Hotels & Resorts Reports Q2 EBITDA Loss",
            "Summary": "Advani Hotels & Resorts (India) reported a Q2 EBITDA loss of 10 million rupees, compared to a gain of 3.6 million rupees in the same quarter last year. This represents a significant decline in the company's operational performance year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731602924000,
            "Source": "result"
        },
        {
            "Title": "Advani Hotels & Resorts Reports Q2 Net Loss",
            "Summary": "Advani Hotels & Resorts (India) reported a net loss of 5.6 million rupees in Q2, compared to a loss of 4.5 million rupees in the same quarter last year. The company's revenue decreased to 167 million rupees from 172 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731602780000,
            "Source": "result"
        }
    ]
}