{
    "Symbol": "ADVENTHTL",
    "ISIN": "INE28GN01010",
    "News": [
        {
            "Title": "Advent Hotels Q3 Net Profit Surges 177% to ₹285M",
            "Summary": "Advent Hotels International reported consolidated net profit of ₹285 million in Q3, up from ₹103 million year-on-year. Revenue grew to ₹1.15 billion from ₹1.1 billion in the same period.",
            "Sentiment": "positive",
            "PublishDate": 1770210030886,
            "Source": "co_actions_results"
        },
        {
            "Title": "Advent International Faces Investor Concerns Over Portfolio",
            "Summary": "Private equity firm Advent International addresses stakeholder concerns regarding management changes and exit strategies across portfolio companies including Crompton Greaves, Eureka Forbes, and Cohance.",
            "Sentiment": "negative",
            "PublishDate": 1767613922820,
            "Source": "co_actions_results"
        },
        {
            "Title": "Advent Hotels Fined ₹1.42L for Q2FY26 Compliance Delay",
            "Summary": "Advent Hotels International receives ₹60,000 fine each from BSE and NSE for delayed Q2FY26 financial results submission due to regulatory interpretation confusion post-listing.",
            "Sentiment": "negative",
            "PublishDate": 1765965449976,
            "Source": "stocks"
        },
        {
            "Title": "Sanjana Vinod Goenka Increases Stake in Advent Hotels International Through Market Purchase",
            "Summary": "Sanjana Vinod Goenka, a promoter group member, acquired 50,000 equity shares of Advent Hotels International Limited through market purchase on December 5, 2025. Her shareholding increased from 4.2419% to 4.3347% of the company's total share capital, with the promoter group collectively holding 19.9615% of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1765197791235,
            "Source": "corporate_action"
        },
        {
            "Title": "Sanjana Vinod Goenka Acquires Additional Shares in Advent Hotels International",
            "Summary": "Sanjana Vinod Goenka, a promoter group member, acquired 50,000 equity shares of Advent Hotels International Limited through market purchase, increasing her shareholding from 4.1493% to 4.2419%. The acquisition was disclosed under SEBI regulations for substantial acquisition of shares and takeovers, with the transaction completed on December 4, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764912331224,
            "Source": "corporate_action"
        },
        {
            "Title": "Vinod Goenka HUF Acquires Additional Shares in Advent Hotels International",
            "Summary": "Vinod Goenka HUF, a promoter group entity, acquired 50,000 equity shares of Advent Hotels International Limited through market purchase on December 1, 2025. The acquisition increased their shareholding from 0.0994% to 0.1920% of the company's total share capital of Rs. 53,94,28,870.",
            "Sentiment": "neutral",
            "PublishDate": 1764759619982,
            "Source": "corporate_action"
        },
        {
            "Title": "Advent Hotels Reports Rs 424.24 Crore Half-Year Profit Following Hospitality Business Demerger",
            "Summary": "Advent Hotels International Limited posted a standalone profit after tax of Rs 424.24 crore for the half year ended September 30, 2025, compared to a loss of Rs 0.12 crore in the previous year, following the demerger of hospitality business from Valor Estate Limited. The company's consolidated revenue from operations reached Rs 157.47 crore for the half year, with total comprehensive income of Rs 31.35 crore, marking a significant turnaround in financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1764333781131,
            "Source": "earnings"
        },
        {
            "Title": "Advent Hotels International Reports Strong Q2 Performance with Rs 302.46 Lakh Profit After Demerger",
            "Summary": "Advent Hotels International Limited posted a standalone profit of Rs 302.46 lakh for the quarter ended September 30, 2025, following the completion of its hospitality business demerger from Valor Estate Limited approved by NCLT in June 2025. The company, primarily engaged in hospitality business including hotels, resorts and serviced residences, issued 5.39 crore equity shares to Valor Estate shareholders as part of the demerger scheme with an appointed date of April 1, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1764333255039,
            "Source": "earnings"
        }
    ]
}