{
    "Symbol": "ADVENZYMES",
    "ISIN": "INE837H01020",
    "News": [
        {
            "Title": "Advanced Enzyme Tech Opens Special Window for Share Transfer",
            "Summary": "Advanced Enzyme Technologies Ltd announces special window for transfer and dematerialization of physical shares, published in newspapers on February 10, 2026 under regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1770781650917,
            "Source": "co_actions_results"
        },
        {
            "Title": "Advanced Enzyme Tech Makes Q3FY26 Call Recording Available",
            "Summary": "Advanced Enzyme Technologies Limited has made the audio recording of its February 4, 2026 conference call discussing Q3FY26 unaudited financial results available on its website for investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1770231181443,
            "Source": "co_actions_results"
        },
        {
            "Title": "Advanced Enzyme Tech Schedules Q3FY26 Results Call",
            "Summary": "Advanced Enzyme Technologies Ltd announces conference call on February 04, 2026 at 4:00 PM IST to discuss Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769607319488,
            "Source": "co_actions_results"
        },
        {
            "Title": "Advanced Enzyme Tech Changes Auditor Firm Structure",
            "Summary": "Advanced Enzyme Technologies announces conversion of statutory auditors M S K A & Associates to M S K A & Associates LLP effective January 13, 2026, with audit engagement continuing unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1768467531465,
            "Source": "stocks"
        },
        {
            "Title": "Advanced Enzyme Technologies Reports 26% Revenue Growth to INR 1,845 Million in Q2 FY26",
            "Summary": "Advanced Enzyme Technologies delivered strong quarterly results with revenue growing 26% YoY to INR 1,845 million and EBITDA rising 42% to INR 601 million, driven by growth across all business segments. The company maintained its mid-teen growth guidance despite US tariff challenges that could impact EBITDA by INR 10-11 crores, while continuing expansion in Asia and Europe markets.",
            "Sentiment": "positive",
            "PublishDate": 1763377788071,
            "Source": "earnings"
        },
        {
            "Title": "Advanced Enzyme Technologies Outlines Growth Strategy with Focus on Human Nutrition and Global Expansion",
            "Summary": "Advanced Enzyme Technologies has outlined its strategy for sustained global growth, focusing on three key areas: human nutrition, animal health, and bio-processing. The company is launching new products across specialty enzymes and increasing R&D spending for high-margin innovations. Advanced Enzyme is strengthening its distribution networks in the U.S. and Europe. The company has provided a positive outlook for FY26, supported by planned capacity expansion in India and Mexico.",
            "Sentiment": "positive",
            "PublishDate": 1762963855037,
            "Source": "stock"
        },
        {
            "Title": "Advanced Enzyme Technologies Reports Strong Q2 Growth with 41% Jump in EBITDA",
            "Summary": "Advanced Enzyme Technologies delivered robust quarterly performance with EBITDA rising to 600 million rupees from 424 million rupees year-over-year, representing a 41% increase. The company's EBITDA margin expanded to 32.55% from 29% in the same period last year. Revenue grew to 1.85 billion rupees compared to 1.5 billion rupees year-over-year, marking a 23% increase. Consolidated net profit surged 32% to 434 million rupees from 328 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762923661771,
            "Source": "earnings"
        },
        {
            "Title": "Advanced Enzyme Technologies Presents at DAM Capital Pharma Conference",
            "Summary": "Advanced Enzyme Technologies Limited participated in an investor presentation at the Pharma and Healthcare conference organized by DAM Capital Advisors Limited on September 23, 2025. The company submitted the presentation materials to stock exchanges as required. Advanced Enzymes is a research-driven company with global leadership in manufacturing enzymes and probiotics, serving industries including human healthcare, animal nutrition, baking, and various processing sectors. The company operates 9 manufacturing units (8 in India, 1 in USA) and 7 R&D facilities across India, USA, and Germany. For the latest results, the company reported revenue of ₹6,369 million with EBITDA margin of 31%. The company has a global presence across 68+ countries with 700+ customers worldwide and maintains 400+ products in its portfolio.",
            "Sentiment": "neutral",
            "PublishDate": 1758531055201,
            "Source": "stock"
        },
        {
            "Title": "Advanced Enzyme Technologies Reports Record Quarterly Revenue of INR 1,859 Million with 20% YoY Growth",
            "Summary": "Advanced Enzyme Technologies Limited achieved its highest ever quarterly revenue of INR 1,859 million, marking 20% year-over-year and 11% quarter-over-quarter growth. The Human Healthcare segment led performance with INR 1,221 million revenue (21% YoY growth), while Animal Healthcare showed strong momentum at INR 260 million (51% YoY growth). EBITDA reached INR 564 million with 30% margin, and PAT grew 16% to INR 404 million. The Bioprocessing segment declined 6% year-over-year to INR 236 million, though management views this as temporary. The company established new subsidiary Advanced Nutrazyme Private Limited and expects to commission a new R&D facility. Management faces challenges from US tariffs potentially impacting INR 50 crore in exports and pricing pressures, while maintaining optimism for double-digit growth with current capacity utilization at 60-65%.",
            "Sentiment": "positive",
            "PublishDate": 1754922394602,
            "Source": "earnings"
        },
        {
            "Title": "Advanced Enzyme Technologies Reports 20% Revenue Growth in Q1 FY26",
            "Summary": "Advanced Enzyme Technologies Limited reported consolidated revenue of ₹1,859 million for Q1 FY26, marking a 20% year-on-year increase from ₹1,545 million in Q1 FY25. EBITDA grew 10% to ₹564 million, while profit after tax increased 16% to ₹404 million. The human nutrition segment, contributing 66% of total revenue, grew 21% to ₹1,221 million. Animal nutrition segment showed strong performance with 51% growth to ₹260 million. However, the bio-processing segment declined 6% to ₹236 million. Geographically, domestic sales increased 32% to ₹979 million, while international sales grew 9% to ₹881 million. EBITDA margin stood at 30% and PAT margin at 22%. The company maintains focus on expanding its product portfolio in probiotics, human nutrition B2C business through its Wellfa brand, and bio-catalysis for API manufacturers.",
            "Sentiment": "positive",
            "PublishDate": 1754129043035,
            "Source": "earnings"
        },
        {
            "Title": "Advanced Enzyme Technologies Reports 17% Growth in Q1 Net Profit",
            "Summary": "Advanced Enzyme Technologies reported consolidated net profit of Rs 399.3 million for Q1, representing a year-over-year increase from Rs 341.5 million in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1754119859575,
            "Source": "earnings"
        },
        {
            "Title": "Advanced Enzyme's Subsidiary JC Biotech Approves Solar Power Investment Partnership",
            "Summary": "JC Biotech Private Limited, a 95.72% subsidiary of Advanced Enzyme Technologies Limited, has approved a collaboration with Raywatt Solar Power Systems Private Limited to develop a group captive solar power project. The subsidiary will invest in 26% equity shares of a Special Purpose Vehicle (SPV) to be set up for this project, aiming to meet the power requirements of its plant in Andhra Pradesh through sustainable and cost-effective solar energy. The total investment is up to ₹10 million through cash consideration, with completion expected by March 31, 2026. The solar power plant will serve JC Biotech's facility located at APIIC Growth centre, Gundlapalli Village, Ongole, Andhra Pradesh. No governmental or regulatory approvals are required for this investment amount.",
            "Sentiment": "positive",
            "PublishDate": 1753446769280,
            "Source": "corporate_action"
        },
        {
            "Title": "JC Biotech Partners with Raywatt Solar Power for Collaboration",
            "Summary": "JC Biotech has approved a partnership with Raywatt Solar Power for collaboration. The announcement appears to be related to Advanced Enzyme Tech, though the specific nature of the collaboration and business details were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1753445222776,
            "Source": "order&deals"
        },
        {
            "Title": "Advanced Enzyme Technologies Forms New Subsidiary for Nutrition and Wellness",
            "Summary": "Advanced Enzyme Technologies has established a new subsidiary called Advanced Nutrazyme Pvt Ltd. This new entity is focused on the nutrition and wellness sector.",
            "Sentiment": "positive",
            "PublishDate": 1751635550000,
            "Source": "default"
        },
        {
            "Title": "Advanced Enzyme Technologies Declares Dividend",
            "Summary": "Advanced Enzyme Technologies has announced a dividend of 1.20 rupees per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1747119321000,
            "Source": "result"
        },
        {
            "Title": "Advanced Enzyme Tech Reports Q4 Financial Results",
            "Summary": "Advanced Enzyme Tech has released its Q4 financial results. The company reported an EBITDA of 457 million rupees, down from 553 million rupees year-over-year. The EBITDA margin decreased to 27.33% from 35.06%. Revenue increased to 1.7 billion rupees from 1.57 billion rupees. Consolidated net profit slightly decreased to 265 million rupees from 283 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747119247000,
            "Source": "result"
        },
        {
            "Title": "Advanced Enzyme Tech to Consider Q4 Results on May 13",
            "Summary": "Advanced Enzyme Technologies Limited has announced that it will consider its fourth quarter (Q4) financial results on May 13. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746532722000,
            "Source": "default"
        },
        {
            "Title": "Advanced Enzyme Technologies Schedules Analyst and Investor Meeting",
            "Summary": "Advanced Enzyme Technologies has announced a meeting with analysts and investors scheduled for March 19. This suggests the company is preparing to share important information or updates with financial stakeholders.",
            "Sentiment": "neutral",
            "PublishDate": 1741879673000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Advanced Enzyme Technologies Reports Q3 EBITDA and Margin",
            "Summary": "Advanced Enzyme Technologies has reported its Q3 financial results. The company's EBITDA for the quarter was 552 million rupees, compared to 538 million rupees in the same quarter last year, showing a slight increase. However, the EBITDA margin decreased from 33.41% to 32.64% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739008672000,
            "Source": "earnings"
        },
        {
            "Title": "Advanced Enzyme Tech Reports Q3 Financial Results",
            "Summary": "Advanced Enzyme Tech has released its Q3 financial results. The company reported a consolidated net profit of 376 million rupees, down from 418 million rupees in the same quarter last year. However, revenue increased to 1.69 billion rupees from 1.61 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739008666000,
            "Source": "earnings"
        },
        {
            "Title": "Advanced Enzyme Tech Reports Q2 EBITDA Decline",
            "Summary": "Advanced Enzyme Technologies has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 424 million rupees from 513 million rupees year-over-year. The EBITDA margin also declined to 29.04% from 32.51% compared to the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1731143514000,
            "Source": "result"
        },
        {
            "Title": "Advanced Enzyme Tech Reports Q2 Financial Results",
            "Summary": "Advanced Enzyme Technologies has reported its Q2 consolidated financial results. The company's net profit decreased to 328 million rupees from 344 million rupees year-over-year. Revenue also declined to 1.46 billion rupees from 1.58 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731143505000,
            "Source": "result"
        }
    ]
}