{
    "Symbol": "AEGISVOPAK",
    "ISIN": "INE0INX01018",
    "News": [
        {
            "Title": "Aegis Vopak VP HR & Admin Retires Feb 2026",
            "Summary": "Aegis Vopak Terminals announces retirement of Mr. Girish Bhagoji Gurkhe, Vice President- HR & Administration, effective February 05, 2026, as disclosed under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770307871030,
            "Source": "stocks"
        },
        {
            "Title": "Aegis Vopak Publishes Q3FY26 Financial Results",
            "Summary": "Aegis Vopak Terminals Limited published newspaper advertisement for Q3FY26 unaudited standalone and consolidated financial results under Regulation 47 of SEBI LODR Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769843684953,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aegis Vopak Q3 FY26: Revenue up 22.3%, PAT surges 62.7%",
            "Summary": "Aegis Vopak Terminals reported strong Q3 FY26 results with revenue of Rs. 1,975 Mn (+22.3% YoY) and PAT of Rs. 615 Mn (+62.7% YoY). Nine-month performance showed revenue of Rs. 5,491 Mn (+18.3%) and PAT of Rs. 1,632 Mn (+90.0%).",
            "Sentiment": "positive",
            "PublishDate": 1769750438952,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aegis Vopak Q3FY26 IPO Proceeds Monitoring Report",
            "Summary": "CARE Ratings reports ₹2,797.95 crore utilized from Aegis Vopak's ₹2,800 crore IPO proceeds for Q3FY26, with ₹2.05 crore remaining unutilized. No deviations from stated objectives observed.",
            "Sentiment": "neutral",
            "PublishDate": 1769693019054,
            "Source": "stocks"
        },
        {
            "Title": "Aegis Vopak Schedules Q3 FY26 Earnings Call Jan 30",
            "Summary": "Aegis Vopak Terminals Limited announces earnings conference call with analysts and investors on January 30, 2026 at 3:00 PM IST to discuss Q3 FY26 financial results under regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1769518897608,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aegis Vopak Terminals Allots ₹1,030 Crore NCDs",
            "Summary": "Aegis Vopak Terminals completes allotment of 1,03,000 non-convertible debentures worth ₹1,030 crores on January 05, 2026, with 7.40% annual coupon rate and 3-year maturity period.",
            "Sentiment": "positive",
            "PublishDate": 1767589435885,
            "Source": "stocks"
        },
        {
            "Title": "Aegis Vopak Terminals Acquires 75% Stake in Hindustan Aegis LPG",
            "Summary": "Aegis Vopak Terminals has signed an agreement to acquire a 75% stake in Hindustan Aegis LPG Limited, marking a significant expansion in the LPG terminal business.",
            "Sentiment": "positive",
            "PublishDate": 1767363336508,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aegis Vopak Terminals Approves Rs 1,030 Crore NCD Fundraising",
            "Summary": "Aegis Vopak Terminals Limited's Board approved raising up to Rs 1,030 crores through Non-Convertible Debentures on private placement basis. The 3-year NCDs will carry 7.20% annual interest with put and call options, secured by first ranking charge over company's Kandla and Pipavav LPG terminal assets.",
            "Sentiment": "positive",
            "PublishDate": 1764824818729,
            "Source": "corporate_action"
        },
        {
            "Title": "AEGIS Vopak Terminals Plans Non-Convertible Debenture Fundraising on December 4th",
            "Summary": "AEGIS Vopak Terminals announced plans to explore fundraising through non-convertible debentures scheduled for December 4th. The debt fundraising initiative will provide the company with capital for its business operations and growth requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1764592085707,
            "Source": "stock"
        },
        {
            "Title": "Aegis Vopak Terminals Approves Director Appointment and Material Related Party Transactions via Postal Ballot",
            "Summary": "Aegis Vopak Terminals Limited shareholders approved three ordinary resolutions through postal ballot concluded on November 30, 2025, including appointment of Mr. Wimal Roy Shylindra Kumar Samlal as Non-Executive Non-Independent Director and material related party transactions with Aegis Gas (LPG) Private Limited and Vopak India B.V. The resolutions were passed with requisite majority through remote e-voting process, with voting results showing approval rates ranging from 98.67% to 99.99% across the three proposals.",
            "Sentiment": "positive",
            "PublishDate": 1764588616860,
            "Source": "corporate_action"
        },
        {
            "Title": "Aegis Vopak Reports 26% Revenue Growth in Q2 FY26, Announces Strategic Expansion Plans",
            "Summary": "Aegis Vopak Terminals Limited reported revenue growth of 26.2% year-on-year to INR 187.6 crores in quarterly results. Operating EBITDA increased 25.8% to INR 137.4 crores, while profit surged 141.8% to INR 53.9 crores. The company announced the proposed acquisition of 75% stake in Hindustan Aegis LPG Limited, adding 25,000 metric tons of LPG capacity at Haldia. New LPG terminals at Pipavav and Mangalore, commissioned in June 2025, are now fully operational and contributing to revenue. The company signed a non-binding MoU to invest in Vadhavan Port and another MoU with Larsen Toubro for Ammonia Terminals at Kandla. JNPA expansion project involving Rs. 1,675 crores capital expenditure is underway, with 318,100 cubic meters of liquid capacity and 77,286 metric tons of LPG storage. The company targets cumulative capital expenditure of USD 1.2 billion by next year and USD 5 billion by 2030. Pipeline connectivity through KGPL and JLPL is expected to boost volumes, with JLPL operational by Q3 FY26 and KGPL by Q4 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1762865375125,
            "Source": "earnings"
        },
        {
            "Title": "Aegis Vopak Terminals Board Approves ₹660 Crore NCD Issuance",
            "Summary": "Aegis Vopak Terminals' board has approved the issuance of 66,000 Non-Convertible Debentures (NCDs) valued at ₹660 crores. The company's market capitalization stands at ₹30 billion.",
            "Sentiment": "neutral",
            "PublishDate": 1762503819734,
            "Source": "corporate_action"
        },
        {
            "Title": "Aegis Vopak Terminals Reports Full Utilization of ₹2,800 Crore IPO Proceeds",
            "Summary": "Aegis Vopak Terminals Limited has submitted its monitoring agency report for the quarter ended September 30, 2025, showing complete utilization of its ₹2,800 crore IPO proceeds. The company fully deployed ₹2,015.95 crore for debt repayment and ₹671.30 crore for capital expenditure toward acquiring a cryogenic LPG terminal at Mangalore. Issue-related expenses totaled ₹83.36 crore, with ₹3.63 crore used for general corporate purposes including lease liability payments. The monitoring report by CARE Ratings Limited indicates no deviation from stated objectives, with a remaining balance of ₹25.66 crore comprising monitoring and public issue accounts. All statutory approvals have been obtained and no major deviations were recorded since the last monitoring report.",
            "Sentiment": "positive",
            "PublishDate": 1762483120291,
            "Source": "stock"
        },
        {
            "Title": "Aegis Vopak Terminals Announces Major Expansion with ₹1,675 Cr JNPA Project",
            "Summary": "Aegis Vopak Terminals is accelerating its expansion plans with a ₹1,675 crore JNPA project and new LPG terminals at Pipavav and Mangalore. The company aims to reach $1.2 billion in capital expenditure by FY27 and $5 billion by 2030. The expansion includes enhancing storage capacity across 6 ports and entering the ammonia and renewable gas segments. The company is strengthening its pan-India network through prudent leverage and long-term contracts.",
            "Sentiment": "positive",
            "PublishDate": 1762442097556,
            "Source": "stock"
        },
        {
            "Title": "Aegis Vopak Terminals Reports 19% Revenue Growth in Q2 FY2026",
            "Summary": "Aegis Vopak Terminals Limited reported revenue from operations of ₹16,007.08 lakh for the quarter ended September 30, 2025, compared to ₹13,496.96 lakh in the previous quarter. For the half-year period, revenue reached ₹29,904.04 lakh versus ₹25,148.86 lakh in the corresponding period last year. The company posted a net profit of ₹4,899.18 lakh for the quarter and ₹9,165.40 lakh for the half-year. Total comprehensive income for the quarter was ₹13,564.73 lakh, significantly higher than ₹1,688.24 lakh in the same quarter last year. The company's equity share capital stands at ₹1,10,799.15 lakh with earnings per share of ₹0.45 for the quarter. The company completed its IPO in the previous quarter, issuing 119,148,936 equity shares at ₹235 per share, raising ₹2,80,000 lakh.",
            "Sentiment": "positive",
            "PublishDate": 1762434048591,
            "Source": "earnings"
        },
        {
            "Title": "Aegis Vopak Terminals Reports Strong Q2 Performance with 142% Jump in Net Profit",
            "Summary": "Aegis Vopak Terminals delivered robust quarterly results with consolidated net profit surging to 539 million rupees from 223 million rupees in the same period last year. Revenue grew to 1.9 billion rupees compared to 1.5 billion rupees year-over-year. EBITDA increased to 1.4 billion rupees from 1.1 billion rupees, though EBITDA margin slightly declined to 73.26% from 73.52% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762432585306,
            "Source": "earnings"
        },
        {
            "Title": "Aegis Vopak Terminals Signs ₹502.5 Crore Framework Agreement to Acquire LPG Terminal Project",
            "Summary": "Aegis Vopak Terminals Limited executed a Framework Agreement with promoter company Aegis Logistics Limited to acquire a Greenfield Terminal project at Jawaharlal Nehru Port. The J2 Project includes 77,286 MT LPG storage capacity, 318,100 cbm liquid products storage, and LPG bottling plant with 35,000 MT capacity. The company will pay ₹502.5 crore upon execution of the Framework Agreement. Aegis Logistics Limited will construct and develop the terminal, with a separate Asset Transfer Agreement to be executed upon project completion. The transaction is conducted on an arm's length basis between the related parties.",
            "Sentiment": "positive",
            "PublishDate": 1762324404366,
            "Source": "order&deals"
        },
        {
            "Title": "Aegis Vopak Terminals Schedules Q2 FY26 Earnings Conference Call",
            "Summary": "Aegis Vopak Terminals Limited has scheduled an earnings conference call with analysts and investors for November 7, 2025, at 4:30 PM IST to discuss Q2 FY26 results. The call will be led by Chairman Managing Director Raj Chandaria and Non-Executive Director Murad Moledina. The company has provided dial-in details for multiple international locations including India, Hong Kong, Singapore, USA, and UK. The earnings call invite and related information are available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1761982108384,
            "Source": "earnings"
        },
        {
            "Title": "Aegis Vopak Terminals Seeks Shareholder Approval for Director Appointment and Material Related Party Transactions",
            "Summary": "Aegis Vopak Terminals Limited has dispatched a postal ballot notice to shareholders seeking approval for three resolutions. The company proposes to appoint Mr. Wimal Roy Shylindra Kumar Samlal as Non-Executive Non-Independent Director, who was initially appointed by the Board on October 16, 2025. Additionally, shareholders will vote on material related party transactions with Aegis Gas (LPG) Private Limited for acquiring 51% equity stake in Hindustan Aegis LPG Limited for up to INR 703 crores, and with Vopak India B.V for acquiring 24% equity stake in the same entity for up to INR 331 crores. Post-transaction, Hindustan Aegis LPG Limited will become a subsidiary of Aegis Vopak Terminals. The e-voting period runs from November 1, 2025, to November 30, 2025, with results to be announced by December 2, 2025. The transactions are valued at 113.19% and 53.29% of the company's consolidated turnover respectively and are based on independent valuation reports prepared by Deloitte Haskins Sells.",
            "Sentiment": "neutral",
            "PublishDate": 1761925828064,
            "Source": "corporate_action"
        },
        {
            "Title": "Aegis Vopak Terminals Acquires 75% Stake in LPG Storage Company for Rs 1,130 Crore",
            "Summary": "Aegis Vopak Terminals Ltd. announced the acquisition of a 75% equity stake in Hindustan Aegis LPG Ltd. (HALPG) for Rs 1,130 crore. The board approved the purchase from promoter Aegis Gas (LPG) Pvt. and Vopak India BV. The acquisition will expand Aegis Vopak's terminalling business at its Haldia location in West Bengal, focusing on LPG storage, bottling, and terminalling activities. HALPG, incorporated in 1994, specializes in storage and terminalling of LPG and allied products, with a turnover of Rs 168 crore in financial year 2025. The transaction is expected to complete by January 15, 2026. Aegis Vopak Terminals is a joint venture between Aegis Logistics Ltd. and Royal Vopak of the Netherlands, operating 20 tank terminals across six Indian ports with total storage capacity of 1.7 million cbm for liquid storage and 201K MT for LPG.",
            "Sentiment": "positive",
            "PublishDate": 1761721176535,
            "Source": "order&deals"
        },
        {
            "Title": "Aegis Vopak Terminals to Acquire 96% Stake in Aegis Terminal (Pipavav) Limited",
            "Summary": "Aegis Vopak Terminals Limited's Board of Directors approved the acquisition of a 96% equity stake in Aegis Terminal (Pipavav) Limited (ATPL) for INR 10. The acquisition involves purchasing 48,000 equity shares of INR 10 each from Aegis Gas (LPG) Private Limited, a promoter group company. ATPL, incorporated in 2013, operates in storage and terminalling facilities for oil, chemicals and petroleum products but has not yet commenced commercial operations, reporting nil turnover. The transaction is structured as a related party transaction conducted on an arm's length basis. Upon completion by November 30, 2025, ATPL will become a subsidiary of Aegis Vopak Terminals Limited. The acquisition aims to support potential business activities and requires no governmental or regulatory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1761656226331,
            "Source": "order&deals"
        },
        {
            "Title": "Aegis Vopak Terminals Appoints New Director, Approves Rs 660 Crore NCD Fundraising",
            "Summary": "Aegis Vopak Terminals Limited's Board approved the appointment of Mr. Wimal Roy Shylindra Kumar Samlal as Additional Non-Executive Non-Independent Director, effective October 16, 2025. The newly appointed director holds degrees in medicine and business informatics with over 28 years of financial sector experience, currently serving as senior vice president – Finance, Asia and Middle East at Vopak Asia Pte Ltd, Singapore. Simultaneously, Mr. Deepak Gajanan Dalvi resigned from his position as Non-Executive Non-Independent Director due to pre-occupation. The Board also approved raising funds up to Rs 660 crores through Non-Convertible Debentures via private placement. The NCDs will have a face value of Rs 1 lakh each, offering 6.92% annual interest with quarterly coupon payments and bullet principal repayment. The debentures will mature 3 years from allotment date and are proposed to be listed on NSE Limited. The NCDs include put and call options exercisable 12 months from allotment and annually thereafter, with first ranking charge on the company's tangible moveable fixed assets at Mangalore Port and cashflows.",
            "Sentiment": "positive",
            "PublishDate": 1760619194349,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aegis Vopak Terminals Board to Consider Debenture Fundraising",
            "Summary": "Aegis Vopak Terminals has scheduled a board meeting for October 16 to discuss fundraising through debentures. The meeting will focus on potential debt financing options for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1760361315328,
            "Source": "corporate_action"
        },
        {
            "Title": "Aegis Vopak Terminals Reports 4.5% Revenue Growth in Q1 FY26, Adds Two New LPG Terminals",
            "Summary": "Aegis Vopak Terminals Limited reported quarterly revenue of INR164 crores, up 4.5% sequentially. The company added two cryogenic LPG storage terminals - one at New Mangalore Port with 82,000 metric tons capacity and another at Pipavav Port with 48,000 metric tons capacity, increasing total LPG storage from 70,800 to 200,800 metric tons. Operating EBITDA reached INR119.9 crores, up 3.1% sequentially. The company utilized IPO proceeds to fully repay bank borrowings of approximately INR2,016 crores, resulting in a 37% reduction in interest costs. Profit grew 85.1% year-on-year to INR47.7 crores. The board approved INR1,675 crores capex for new terminals at JNPA port. The company targets $5 billion aggregate capex by 2030 and signed a non-binding MOU with L&T for ammonia terminals at Kandla. Revenue from new terminals will begin accruing from Q2 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1755075294413,
            "Source": "earnings"
        },
        {
            "Title": "Aegis Vopak Terminals Plans $1.2 Billion Capital Expenditure by Next Year",
            "Summary": "Aegis Vopak Terminals has announced plans for $1.2 billion in capital expenditure by next year. The company aims to reach a total of $5 billion in capital spending by 2030. The funding for these expenditures will come through internal resources and debt financing.",
            "Sentiment": "positive",
            "PublishDate": 1754566833403,
            "Source": "stock"
        },
        {
            "Title": "Aegis Vopak Terminals Reports Full Utilization of ₹2,711 Crore IPO Proceeds in First Quarter",
            "Summary": "Aegis Vopak Terminals Limited utilized ₹2,711.42 crore out of its ₹2,800 crore IPO proceeds during the quarter ended June 30, 2025. The company completed repayment of ₹2,015.95 crore in outstanding borrowings to HDFC Bank and DBS, and fully utilized ₹671.30 crore for capital expenditure towards the contracted acquisition of a cryogenic LPG terminal at Mangalore. Issue-related expenses of ₹24.17 crore were also settled during the quarter. The monitoring agency CARE Ratings Limited reported no deviations from the stated IPO objectives, with ₹88.58 crore remaining unutilized and held in monitoring and public issue accounts. The company operates in storage and warehousing services, specifically providing storage and terminalling facilities for Liquefied Petroleum Gas and liquid products.",
            "Sentiment": "positive",
            "PublishDate": 1754556470817,
            "Source": "stock"
        },
        {
            "Title": "Aegis Vopak Terminals Reports Q1 2025 Results, Approves INR 1,675 Crore Capex for New Terminal Project",
            "Summary": "Aegis Vopak Terminals Limited announced its quarterly results for the period ended June 30, 2025. On a standalone basis, the company reported revenue from operations of INR 13,835.36 lakhs and profit after tax of INR 4,268.22 lakhs. On a consolidated basis, revenue from operations stood at INR 16,401.10 lakhs with profit after tax of INR 4,771.77 lakhs. The Board approved a capital expenditure proposal of INR 1,675 crores for developing a Greenfield Terminal project at Jawaharlal Nehru Port, which will include 77,286MT LPG and 318,100cbm Liquid Products storage facilities, along with an LPG Bottling Plant of 35,000MT annual capacity. Additionally, the Board approved amendments to the Articles of Association granting special rights to joint venture shareholders Aegis Logistics Limited and Vopak India B.V., including the right to nominate directors and Aegis's exclusive right to appoint the Board Chairperson, subject to member and regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1754547758269,
            "Source": "earnings"
        },
        {
            "Title": "Aegis Vopak Reports Q1 EBITDA Growth to ₹1.19 Billion, Approves ₹1,675 Crore Investment for New Terminal",
            "Summary": "Aegis Vopak reported Q1 EBITDA of ₹1.19 billion compared to ₹1.13 billion in the same period last year, representing year-over-year growth. The company's EBITDA margin was 73.1% versus 73.69% in the previous year. The company's board has approved a ₹1,675 crore investment for developing a new terminal and LPG bottling facility at JNPA as part of the J2 Project.",
            "Sentiment": "positive",
            "PublishDate": 1754546940289,
            "Source": "earnings"
        },
        {
            "Title": "Aegis Vopak Reports 85% Jump in Quarterly Net Profit to 477 Million Rupees",
            "Summary": "Aegis Vopak reported consolidated net profit of 477 million rupees for the first quarter, representing an 85% increase compared to 258 million rupees in the same period last year. The company is listed as a new listing on the exchange.",
            "Sentiment": "positive",
            "PublishDate": 1754546554314,
            "Source": "earnings"
        },
        {
            "Title": "Aegis Vopak Terminals Reports Strong Growth with Revenue Up 24% to ₹621 Crore in FY25",
            "Summary": "Aegis Vopak Terminals Limited reported consolidated revenue of ₹621.08 crore for FY25, up from ₹561.76 crore in FY24. Net profit increased to ₹127.23 crore from ₹86.54 crore. The company's Gas Terminal Division revenue grew 34.61% to ₹276.35 crore, while Liquid Terminal Division revenue was ₹344.73 crore. The company completed acquisitions of additional terminals at Mangalore and JNPA during the year. EBITDA increased to ₹461.43 crore from ₹403.17 crore. The company successfully completed its IPO in June 2025, listing on NSE and BSE.",
            "Sentiment": "positive",
            "PublishDate": 1753160516214,
            "Source": "corporate_action"
        },
        {
            "Title": "Aegis Vopak Terminals Ltd: Shares Close 10% Higher on Listing Day",
            "Summary": "Aegis Vopak Terminals Ltd shares closed at Rs 242 on NSE, a 10% premium to the listing price, after initially listing at a 6% discount. The IPO was subscribed 2.09 times, with strong institutional interest but muted retail and non-institutional participation.",
            "Sentiment": "positive",
            "PublishDate": 1748860101000,
            "Source": "normal_news"
        },
        {
            "Title": "Aegis Vopak Terminals: Shares List at 6% Discount on Stock Exchange Debut",
            "Summary": "Aegis Vopak Terminals Ltd. shares listed on the National Stock Exchange at Rs 220, a 6.38% discount to the issue price of Rs 235. The IPO, which raised Rs 2,800 crore, was subscribed 2.09 times. The company is India's largest third-party operator of tank storage terminals for LPG and liquid products, with a significant market share in both sectors.",
            "Sentiment": "neutral",
            "PublishDate": 1748837869000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aegis Vopak Pre-Market Discovery Price Set at 220 Rupees",
            "Summary": "The pre-market discovery price for Aegis Vopak has been determined to be 220 rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1748837640000,
            "Source": "default"
        }
    ]
}