{
    "Symbol": "AEGISLOG",
    "ISIN": "INE208C01025",
    "News": [
        {
            "Title": "Aegis Logistics Q3 Net Profit Jumps 45% YoY",
            "Summary": "Aegis Logistics reported consolidated net profit of ₹1.80 billion for Q3, marking a significant 45.16% increase from ₹1.24 billion in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1769756880696,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aegis Logistics Board Meet on Jan 30 for Q3FY26 Results",
            "Summary": "Aegis Logistics has scheduled its board meeting for January 30, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window remains closed until February 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769167802937,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aegis Logistics faces ₹2.87 cr GST penalty orders",
            "Summary": "Aegis Logistics receives two GST demand orders totaling ₹2.87 crores in penalties from Gujarat tax authorities for FY 2018-19 and FY 2021-22, related to ITC disallowance issues.",
            "Sentiment": "negative",
            "PublishDate": 1767620573080,
            "Source": "stocks"
        },
        {
            "Title": "Aegis Logistics Reports Strong Q2 FY26 Results with 31% Revenue Growth",
            "Summary": "Aegis Logistics delivered robust quarterly results with consolidated revenue growing 31% year-on-year to INR 2,294 crores from INR 1,750 crores. Normalized EBITDA improved 46% to INR 347 crores from INR 237 crores, while profit after tax increased 61% to INR 244 crores from INR 152 crores. The company handled record LPG volumes of 1.41 million tonnes versus 1.06 million tonnes in the same quarter last year, representing 32% growth. Distribution volumes grew 49% to 1.92 lakh metric tonnes. The company is executing major expansion projects including INR 1,675 crores CAPEX at JNPT for additional liquid and LPG capacity, and developing India's first ammonia terminal at Pipavav with 36,000 metric tonne capacity expected to be operational in Q1 of next fiscal year. Management expects to exceed their previously guided 25% CAGR growth target from 2022 to 2027.",
            "Sentiment": "positive",
            "PublishDate": 1763029174631,
            "Source": "earnings"
        },
        {
            "Title": "Aegis Logistics Updates Growth Guidance, Declines Specific LPG Volume Targets",
            "Summary": "Aegis Logistics provided updated guidance during a conference call. The company expects to exceed its previously given guidance of 25% CAGR from 2022-2027. Management expects to maintain 30% CAGR growth in distribution volumes and anticipates distribution margins of around INR 4,000 per ton to be sustainable with increasing volumes. However, management declined to provide specific LPG volume guidance, noting it depends on multiple factors.",
            "Sentiment": "positive",
            "PublishDate": 1762746524966,
            "Source": "stock"
        },
        {
            "Title": "Aegis Logistics Reports 141% Jump in Quarterly Profit to ₹167 Crore",
            "Summary": "Aegis Logistics Limited reported quarterly results for the quarter and six months ended September 30, 2025. The company's standalone profit increased to ₹167 crore compared to ₹72 crore in the previous year quarter. Revenue from operations rose to ₹1,028 crore from ₹656 crore year-on-year. For the half-year period, profit reached ₹236 crore versus ₹238 crore in the corresponding period last year, while revenue grew to ₹1,864 crore from ₹1,390 crore. The company operates through two main segments - Liquid Terminal Division and Gas Terminal Division. During the quarter, Aegis Logistics and its subsidiary Aegis Vopak Terminals Limited entered into a Business Transfer Agreement for transfer of Gas storage undertaking at Pipavav location, resulting in a profit of ₹114 crore included under other income. The company declared and paid an interim dividend of 200% (₹2 per share) for financial year 2025-26. On a consolidated basis, the company reported quarterly profit of ₹244 crore compared to ₹152 crore in the previous year, with revenue increasing to ₹2,294 crore from ₹1,750 crore.",
            "Sentiment": "positive",
            "PublishDate": 1762505967614,
            "Source": "earnings"
        },
        {
            "Title": "Aegis Logistics Reports Strong Q2 Growth with Revenue Up 31% Year-on-Year",
            "Summary": "Aegis Logistics delivered robust quarterly results with revenue rising to 22.9 billion rupees from 17.5 billion rupees year-on-year. The company's EBITDA increased to 2.9 billion rupees compared to 2.2 billion rupees in the same period last year. However, EBITDA margin declined slightly to 12.67% from 12.79% year-on-year. Consolidated net profit grew to 1.8 billion rupees versus 1.26 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762497296891,
            "Source": "earnings"
        },
        {
            "Title": "Aegis Logistics Signs Framework Agreement with Aegis Vopak Terminals for ₹502.5 Crore Terminal Project",
            "Summary": "Aegis Logistics Limited executed a Framework Agreement with Aegis Vopak Terminals Limited (AVTL) on November 5, 2025. Under the agreement, Aegis Logistics will construct and develop a Greenfield Terminal at Jawaharlal Nehru Port (JNPA) consisting of 77,286 MT LPG storage capacity, 318,100 cbm Liquid Products storage, and an LPG Bottling Plant with 35,000 MT per annum capacity. The project, known as J2 Project, will be acquired by AVTL upon completion. Aegis Logistics will receive ₹502.5 crore from AVTL upon execution of the Framework Agreement. The companies will execute separate Asset Transfer Agreements after project completion. AVTL is an Associate Company of Aegis Logistics, making this a related party transaction conducted on an arm's length basis.",
            "Sentiment": "positive",
            "PublishDate": 1762325895291,
            "Source": "order&deals"
        },
        {
            "Title": "Aegis Logistics Seeks Shareholder Approval for ₹703 Crore Related Party Transaction",
            "Summary": "Aegis Logistics Limited has issued a postal ballot notice seeking shareholder approval for a material related party transaction worth up to ₹703 crores. The transaction involves the sale of 51% equity stake in Hindustan Aegis LPG Limited (HALPG) by Aegis Gas (LPG) Private Limited (AGPL), a wholly-owned subsidiary, to Aegis Vopak Terminal Limited (AVTL), an associate company. AGPL currently holds 51% equity in HALPG, while AVTL is 44.71% owned by Aegis Logistics. The transaction is valued at 10.39% of the company's consolidated turnover and is based on an independent valuation report by Deloitte Haskins Sells. The e-voting period runs from November 1 to November 30, 2025. The company states this will promote operational synergies and enhance business efficiency within the group structure, with AVTL set to hold 75% stake in HALPG after completion. The Audit Committee has approved the transaction subject to shareholder consent, confirming it will be conducted on an arm's length basis.",
            "Sentiment": "neutral",
            "PublishDate": 1761925815991,
            "Source": "corporate_action"
        },
        {
            "Title": "Aegis Logistics Board Approves ₹701.61 Crore Stake Sale in Subsidiary",
            "Summary": "Aegis Logistics' board has approved the sale of a 51% stake in its subsidiary Hindustan Aegis LPG Limited to Aegis Vopak Terminal Limited for ₹701.61 crores. The transaction is expected to be completed by January 15, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1761719969281,
            "Source": "order&deals"
        },
        {
            "Title": "Aegis Logistics Subsidiary Sells 96% Stake in Terminal Company to Associate Firm",
            "Summary": "Aegis Vopak Terminals Limited (AVTL), an associate of Aegis Logistics Limited, has approved the acquisition of a 96% equity stake in Aegis Terminal (Pipavav) Limited (ATPL) from Aegis Gas (LPG) Private Limited (AGPL). The transaction involves 48,000 equity shares valued at INR 10 each, with a total consideration of INR 4,80,000. ATPL, which has not yet commenced commercial operations, reported nil revenue for FY 2024-25 and a negative net worth of Rs. 1,98,053. Following the completion of this transaction, ATPL will cease to be a subsidiary of AGPL and step-down subsidiary of Aegis Logistics. The transaction is expected to be completed on or before November 30, 2025, and is classified as a related party transaction conducted on an arm's length basis.",
            "Sentiment": "neutral",
            "PublishDate": 1761658632467,
            "Source": "order&deals"
        },
        {
            "Title": "Huron Holdings Acquires Additional 10,000 Shares in Aegis Logistics, Increases Stake to 31.67%",
            "Summary": "Huron Holdings Limited, a promoter entity of Aegis Logistics Limited, acquired 10,000 shares through an inter-se transfer among promoters. The acquisition increased Huron Holdings' shareholding from 31.6697% to 31.6725% of total voting rights. The transaction was completed on September 26, 2025, and was conducted off-market. Aegis Logistics' total equity share capital remains unchanged at Rs. 35.10 crore, divided into 35.10 crore equity shares of Re. 1 each. The company's shares are listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1759206202470,
            "Source": "corporate_action"
        },
        {
            "Title": "Aegis Logistics Shares Surge 10% on High Trading Volumes",
            "Summary": "Aegis Logistics shares gained 10% on Monday, September 15, marking the biggest single-day gain since March and the fifth-best session in 2025. Trading volumes reached a four-month high with nearly 31 lakh shares traded, significantly above the 20-day average of 1.1 lakh shares. The stock crossed above its 50-day moving average at ₹724, with key resistance levels at ₹763 (100-DMA) and ₹772 (200-DMA). Brokerage coverage remains mixed with two 'Buy' and two 'Hold' recommendations. The shares closed 7.40% higher at ₹754.20. Despite the rally, the stock remains down 8% in 2025, following a 133% gain in 2024.",
            "Sentiment": "positive",
            "PublishDate": 1757926163897,
            "Source": "stock"
        },
        {
            "Title": "Aegis Logistics Adds 61,000 KL Storage Capacity at Mumbai Port with ₹99.88 Crore Investment",
            "Summary": "Aegis Logistics Limited announced a new capacity addition of 61,000 KL at Pirpau, Mumbai Port, effective from September 6, 2025. The company will invest ₹99.88 crores for this expansion, funded through internal accruals. The additional storage capacity aims to meet current and future customer demands while reducing load on existing liquid storage facilities at Mumbai. The expansion is expected to strengthen operational resilience and enhance competitive positioning.",
            "Sentiment": "positive",
            "PublishDate": 1757147588475,
            "Source": "stock"
        },
        {
            "Title": "Aegis Logistics Reports 11% PAT Growth in Q1 FY26, Expands Terminal Capacity Across Multiple Ports",
            "Summary": "Aegis Logistics Limited reported quarterly results with profit after tax increasing 11% to Rs. 175 crores compared to Rs. 158 crores in the same quarter last year. Normalized EBITDA stood at Rs. 256 crores, up 2% year-on-year. The company's LPG business EBITDA grew 6% to Rs. 150 crores while revenue increased 8% to Rs. 1,575 crores. LPG volume handled at terminals rose 15% to 1.16 million tons. The liquid segment delivered stable EBITDA of Rs. 106 crores with revenue of Rs. 144 crores. The company added new LPG storage capacity at Mangalore (82,000 metric tons) and Pipavav (48,000 metric tons) ports. Aegis continues to hold 44.71% equity in subsidiary AVTL, which was successfully listed in June 2025. The company announced multiple expansion projects including Rs. 1,675 crores investment at JNPT port and Rs. 250 crores liquid capacity expansion at Mumbai port. Management expects to reach US$ 5 billion aggregate capital expenditure by 2030. The company's ESG rating was upgraded from A to AA by MSCI and it signed a cross-selling fuel agreement with Jio BP.",
            "Sentiment": "positive",
            "PublishDate": 1755194860538,
            "Source": "earnings"
        },
        {
            "Title": "Aegis Logistics Makes Earnings Call Recording Available on Company Website",
            "Summary": "Aegis Logistics Limited has made the audio recording of its earnings conference call available on its website. The call covered the company's unaudited financial results for the quarter ended June 30, 2025 and was held on August 8, 2025 at 3:00 p.m. IST. The recording can be accessed at the company's investor information section on their website. The company trades on NSE under the symbol AEGISLOG and on BSE under scrip code 500003.",
            "Sentiment": "neutral",
            "PublishDate": 1754675443255,
            "Source": "earnings"
        },
        {
            "Title": "Aegis Logistics Plans ₹2,800 Crore Investment for LNG and LPG Infrastructure Expansion",
            "Summary": "Aegis Logistics is planning a ₹2,800 crore investment to expand its LNG and LPG infrastructure. The company's strategy includes port expansion and expects record volumes that are projected to boost EBITDA and margins until FY28. The investment is part of the company's long-term growth plans in the energy infrastructure sector.",
            "Sentiment": "positive",
            "PublishDate": 1754579098363,
            "Source": "stock"
        },
        {
            "Title": "Aegis Logistics Reports Mixed Q1 Results with Revenue Growth but Lower EBITDA",
            "Summary": "Aegis Logistics reported Q1 consolidated net profit of Rs 1.3 billion, unchanged from the previous year. Revenue increased to Rs 17.2 billion from Rs 16 billion year-over-year. However, EBITDA declined to Rs 2.2 billion from Rs 2.3 billion, with EBITDA margin compressing to 12.8% from 14.51% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1754549464725,
            "Source": "earnings"
        },
        {
            "Title": "Aegis Logistics to Transfer LPG Terminal to Aegis Vopak Terminals",
            "Summary": "Aegis Logistics has announced plans to transfer its LPG terminal to Aegis Vopak Terminals for 4.28 billion rupees. The news indicates a significant corporate transaction involving the transfer of assets between related entities.",
            "Sentiment": "neutral",
            "PublishDate": 1752192365000,
            "Source": "default"
        },
        {
            "Title": "Aegis Logistics: Transfers Pipavav LPG Terminal to Aegis Vopak for ₹428 Crore",
            "Summary": "Aegis Logistics has transferred its newly commissioned LPG cryogenic terminal at Pipavav to Aegis Vopak Terminals Limited for ₹428.4 crore in cash. The terminal, with 48,000 MT storage capacity, was commissioned on July 3, 2025. The transaction aims to consolidate LPG terminalling services under AVTL.",
            "Sentiment": "positive",
            "PublishDate": 1752155963000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aegis Logistics to Transfer LPG Terminal to Aegis Vopak Terminals",
            "Summary": "Aegis Logistics has announced plans to transfer its LPG terminal to Aegis Vopak Terminals for ₹4.28 billion. The transaction involves the transfer of a specific asset, namely an LPG terminal, between two related entities. This move suggests a significant restructuring or strategic decision within the Aegis group of companies.",
            "Sentiment": "neutral",
            "PublishDate": 1752153627000,
            "Source": "default"
        },
        {
            "Title": "Aegis Logistics Launches LPG Cryogenic Terminal in Pipavav",
            "Summary": "Aegis Logistics has launched a new LPG (Liquefied Petroleum Gas) cryogenic terminal in Pipavav. The terminal has a storage capacity of 48,000 MT (Metric Tonnes).",
            "Sentiment": "positive",
            "PublishDate": 1751544299000,
            "Source": "default"
        },
        {
            "Title": "Aegis Logistics Reports Q4 Financial Results",
            "Summary": "Aegis Logistics has announced its Q4 financial results. The company's EBITDA increased to 4.1 billion rupees from 3.08 billion rupees year-over-year. The EBITDA margin improved to 23.98% from 16.70% in the same period last year. Consolidated net profit rose to 2.82 billion rupees from 2 billion rupees year-over-year. However, revenue decreased to 17.1 billion rupees from 18.4 billion rupees compared to the previous year's quarter.",
            "Sentiment": "positive",
            "PublishDate": 1750390930000,
            "Source": "result"
        },
        {
            "Title": "Aegis Logistics Transfers LPG Terminal and Storage Facility in Separate Deals",
            "Summary": "Aegis Logistics has made two significant transactions: 1) The company transferred an 82,000 MT cryogenic LPG terminal at New Mangalore Port to AVTL for ₹671.3 crore through a slump sale. 2) Aegis Logistics also formed a ₹49.5 crore deal with CRL Terminals to hand over a 94,148 CBM storage facility at Kandla.",
            "Sentiment": "neutral",
            "PublishDate": 1750386114000,
            "Source": "default"
        },
        {
            "Title": "Aegis Logistics Subsidiary Launches New LPG Terminal in Mangalore",
            "Summary": "Sea Lord Containers Limited, a subsidiary of Aegis Logistics, has opened a new cryogenic Liquefied Petroleum Gas (LPG) terminal in Mangalore. The facility boasts a static storage capacity of 82,000 MT for storing and handling LPG.",
            "Sentiment": "positive",
            "PublishDate": 1749708883000,
            "Source": "default"
        },
        {
            "Title": "Aegis Logistics Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 1,005,114 shares of Aegis Logistics Ltd. was executed on the National Stock Exchange (NSE) at a price of Rs. 814.00 per share. The total value of the transaction amounted to Rs. 81.82 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1747198654000,
            "Source": "block_details"
        },
        {
            "Title": "Aegis Logistics: Stock Surges 19% After Four-Day Decline",
            "Summary": "Aegis Logistics stock rebounded by nearly 19% on February 19, following a four-day slump. The company recently reported a 5% YoY increase in Q3 FY25 PAT, despite a 9% revenue decline. Aegis has expanded operations by acquiring port land and filed for an IPO of its subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1739958098000,
            "Source": "normal_news"
        },
        {
            "Title": "Aegis Logistics: Potential Listing of Joint Venture Could Be Key Catalyst",
            "Summary": "Motilal Oswal suggests that the potential listing of Aegis Vopak Terminals, a joint venture of Aegis Logistics, could be a significant near-term catalyst for the company.",
            "Sentiment": "positive",
            "PublishDate": 1732163355000,
            "Source": "normal_news"
        },
        {
            "Title": "Aegis Logistics Approves Preferential Issue and IPO for Subsidiary",
            "Summary": "Aegis Logistics has approved two significant financial moves. First, a subsidiary of the company has approved a preferential issue of up to 8 billion rupees on a private placement basis. Second, the company has approved an Initial Public Offering (IPO) for Aegis Vopak Terminals, with equity shares worth up to 40 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1730160442000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aegis Logistics Reports Q2 Financial Results",
            "Summary": "Aegis Logistics announced its Q2 financial results. The company's consolidated net profit was 1.26 billion rupees, slightly down from 1.27 billion rupees year-over-year, but down from 1.3 billion rupees quarter-over-quarter. Revenue increased significantly to 17.5 billion rupees from 12.3 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730075146000,
            "Source": "result"
        }
    ]
}