{
    "Symbol": "AEROENTER",
    "ISIN": "INE065D01027",
    "News": [
        {
            "Title": "Aeroflex Enterprises Q3FY26 Results Show Strong Growth",
            "Summary": "Aeroflex Enterprises reported consolidated revenue of ₹19,142.11 lakhs for Q3FY26, up from ₹15,729.86 lakhs in Q3FY25. Net profit reached ₹2,480.74 lakhs compared to ₹2,185.27 lakhs in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770882981049,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aeroflex Enterprises EOGM Approves Subsidiary Disinvestment",
            "Summary": "Aeroflex Enterprises Limited shareholders unanimously approved the disinvestment of company's stake in M.R. Organisation Limited through special resolution at EOGM held on January 27, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769522352888,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aeroflex EGM Set for Jan 27 to Approve MRO Divestment",
            "Summary": "Aeroflex Enterprises scheduled EGM for January 27, 2026 to seek shareholder approval for divestment of material subsidiary M.R. Organisation Limited via special resolution under Regulation 30.",
            "Sentiment": "neutral",
            "PublishDate": 1766581612547,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aeroflex Enterprises Reports 21% Revenue Growth in Q2FY26, Expands into Enterprise Technology",
            "Summary": "Aeroflex Enterprises delivered strong performance with 21% year-on-year increase in consolidated total income during the quarter ended September 30, 2025, driven by growth across all business segments including subsidiaries M.R. Organisation and Aeroflex Industries. The company announced plans to invest in Dev Information Technology Limited to strengthen capabilities in enterprise technology and cloud infrastructure, while its subsidiary Aeroflex Industries secured contracts worth ₹15.6 crore for liquid cooling solutions from a listed US corporation.",
            "Sentiment": "positive",
            "PublishDate": 1763058089750,
            "Source": "earnings"
        },
        {
            "Title": "Aeroflex Enterprises Reports Mixed Q2 Results with Higher EBITDA but Lower Margins",
            "Summary": "Aeroflex Enterprises reported Q2 EBITDA of 296 million rupees compared to 249 million rupees in the same period last year, representing growth in absolute terms. However, the company's EBITDA margin declined to 17.20% from 18.08% year-over-year, indicating reduced profitability efficiency despite higher earnings.",
            "Sentiment": "positive",
            "PublishDate": 1763048210931,
            "Source": "earnings"
        },
        {
            "Title": "Aeroflex Enterprises Enters Digital Transformation Business, Plans Rs 8,500 Crore Investment in Dev Information Technology",
            "Summary": "Aeroflex Enterprises Limited's board approved entry into digital transformation business, focusing on cloud, automation, and data technologies along with IT-enabled services. The company plans to acquire a stake in Dev Information Technology Limited through strategic investment up to Rs 8,500 lakhs via equity shares and convertible warrants. As part of this strategy, Aeroflex will subscribe to 1.5 crore warrants convertible into equity shares at Rs 45.45 per warrant, totaling Rs 6,817.50 lakhs. The investment will be executed in tranches subject to requisite approvals.",
            "Sentiment": "positive",
            "PublishDate": 1760776331132,
            "Source": "order&deals"
        },
        {
            "Title": "Aeroflex Enterprises Re-appoints Parthasarathi Sarkar as Independent Director for Second Five-Year Term",
            "Summary": "Aeroflex Enterprises Limited shareholders approved the re-appointment of Mr. Parthasarathi Sarkar as Non-Executive Independent Director for a second term of five years, from July 26, 2025 to July 25, 2030. The decision was made through a special resolution passed at the company's 40th Annual General Meeting held on September 16, 2025, based on recommendations from the Nomination Remuneration and Compensation Committee and Board of Directors. Sarkar holds an MBA from IIM Ahmedabad and B.Tech from IIT Delhi, previously worked with Unilever and served over two decades in various capacities at Tata companies, including working directly with Ratan Tata on the Tata Group's first long-term strategic plan in the early 1980s. He currently runs P. Sarkar Associates, a management consulting business focused on acquisitions and financial restructuring. Sarkar is not related to any other company director and is not debarred from holding directorship positions.",
            "Sentiment": "positive",
            "PublishDate": 1758026608979,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aeroflex Enterprises Sets Record Date for Final Dividend of Re. 0.30 Per Share",
            "Summary": "Aeroflex Enterprises Limited has fixed September 09, 2025, as the record date for determining shareholder eligibility for a final dividend of Re. 0.30 per share for financial year 2024-25. The dividend represents 15% on the face value of Rs. 2 per equity share and was recommended by the Board of Directors in their meeting held on May 24, 2025. The dividend is subject to shareholder approval at the upcoming Annual General Meeting. If approved, the dividend payment will be made on or before October 14, 2025, within 30 days of shareholder approval and subject to tax deduction at source.",
            "Sentiment": "positive",
            "PublishDate": 1755877626550,
            "Source": "corporate_action"
        },
        {
            "Title": "Aeroflex Enterprise Plans Expansion Into Electric Vehicles, Hydrogen, And Aerospace Sectors",
            "Summary": "Aeroflex Enterprise is targeting rapid expansion across electric vehicles, hydrogen, and aerospace sectors. The company expects its export pipeline and high-quality product mix to drive profit growth. The expansion strategy includes capital expenditures and research & development investments to support entry into global markets.",
            "Sentiment": "positive",
            "PublishDate": 1755016001329,
            "Source": "stock"
        },
        {
            "Title": "Aeroflex Enterprise Reports Mixed Q1 Results with Revenue Growth and Profit Decline",
            "Summary": "Aeroflex Enterprise reported consolidated net profit of 102 million rupees in Q1, down from 132 million rupees in the same period last year. The company's revenue increased to 1.3 billion rupees compared to 1.2 billion rupees year-over-year. The results show revenue growth of approximately 8.3% while net profit declined by about 22.7%.",
            "Sentiment": "neutral",
            "PublishDate": 1755005824255,
            "Source": "earnings"
        },
        {
            "Title": "Aeroflex Neu Limited Allots 72 Lakh Convertible Warrants at ₹90 Each for Business Expansion",
            "Summary": "Aeroflex Neu Limited, a subsidiary of Aeroflex Enterprises Limited, has allotted 72,00,000 convertible warrants at ₹90 per warrant to promoters and non-promoters. Each warrant is convertible into one equity share with a face value of ₹10. The parent company, Aeroflex Enterprises Limited, subscribed to 36,00,000 of these warrants. The funds raised from this warrant issuance will be utilized for business expansion and future growth of Aeroflex Neu Limited. The allotment was made in accordance with the Companies Act, 2013 and SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1753447890095,
            "Source": "corporate_action"
        },
        {
            "Title": "Aeroflex Enterprises Acquires Additional 13% Stake in M.R. Organisation for ₹16.71 Crores",
            "Summary": "Aeroflex Enterprises Limited has completed the acquisition of an additional 13% equity stake in M.R. Organisation Limited (MRO) for ₹16.71 crores, purchasing 3,35,888 equity shares at ₹497.60 per share. This represents the second tranche of a Share Purchase Agreement dated July 27, 2024, increasing Aeroflex's total stake to 64%. MRO operates in tech-based last-mile utility services, specializing in air compressor parts and kits. The company reported revenue of ₹79.20 crores for FY25 with an EBITDA margin of 33.9%, showing growth from ₹69.39 crores in FY24 and ₹59.88 crores in FY23. MRO has presence across 29 Indian states through 59 locations and 5 warehouses, exports to 75 countries, and maintains international offices in USA, UK, and Europe. The company recently acquired Madhura Compressors Private Limited and ABP Impex LDA to strengthen its compressor capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1753365338698,
            "Source": "order&deals"
        },
        {
            "Title": "SAT Industries' Unit Acquires Majority Stake in Madhura Compressors",
            "Summary": "M.R. Organisation, a unit of SAT Industries, has acquired a 51% equity stake in Madhura Compressors Pvt. Ltd. This strategic move is aimed at expanding the company's compressor ecosystem.",
            "Sentiment": "positive",
            "PublishDate": 1747047872000,
            "Source": "default"
        },
        {
            "Title": "SAT Industries Approves 300 Million Rupee Investment in M.R. Organisation Ltd",
            "Summary": "The board of SAT Industries has approved an investment of 300 million rupees in M.R. Organisation Ltd. This decision represents a significant corporate action that could potentially impact the company's financial position and strategic direction.",
            "Sentiment": "positive",
            "PublishDate": 1738331185000,
            "Source": "corporate_action"
        },
        {
            "Title": "SAT Industries Reports Strong Q3 EBITDA Growth",
            "Summary": "SAT Industries has announced its Q3 financial results, showing significant improvement in both EBITDA and EBITDA margin. The company's EBITDA increased to 287 million rupees from 157 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 18.23% from 13.26% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738328183000,
            "Source": "earnings"
        },
        {
            "Title": "SAT Industries Reports Increased Q3 Profit and Revenue",
            "Summary": "SAT Industries has announced its Q3 financial results. The company's consolidated net profit rose to 140 million rupees, up from 119 million rupees year-over-year and 148 million rupees quarter-over-quarter. Revenue for Q3 increased to 1.57 billion rupees, compared to 1.18 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738328103000,
            "Source": "earnings"
        },
        {
            "Title": "Sat Industries Reports Q2 FY24 Financial Results",
            "Summary": "Sat Industries has announced its Q2 FY24 consolidated financial results. The company reported a net profit of 148 million rupees, which is significantly lower compared to 1.75 billion rupees in the same quarter last year (YoY). However, it shows an improvement from 132 million rupees in the previous quarter (QoQ). Revenue for Q2 stood at 1.38 billion rupees, slightly higher than 1.37 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731455859000,
            "Source": "result"
        }
    ]
}