{
    "Symbol": "AERONEU",
    "ISIN": "INE035801013",
    "News": [
        {
            "Title": "Aeroflex Neu Q3FY26 profit jumps 12,657% YoY",
            "Summary": "Aeroflex Neu Limited reported consolidated net profit of ₹74.07 lakhs for Q3FY26 vs loss of ₹0.11 lakhs in Q3FY25. Revenue declined 4.46% YoY to ₹3,088.40 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770126752923,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aeroflex Neu Updates Website and Email IDs",
            "Summary": "Aeroflex Neu Limited announces change of website domain from www.sahpolymers.com to www.aeroflexneu.com and updates official email addresses to reflect new branding.",
            "Sentiment": "neutral",
            "PublishDate": 1769779119889,
            "Source": "stocks"
        },
        {
            "Title": "Aeroflex Neu Limited Reports No Deviation in Fund Utilization for Quarter Ended September 30, 2025",
            "Summary": "Aeroflex Neu Limited (formerly Sah Polymers Ltd.) filed its statement of deviation and variation in fund utilization for the quarter and half year ended September 30, 2025. The company reported no deviation or variation in the use of funds raised through allotment of convertible warrants on preferential basis dated July 25, 2025. Out of total funds raised of Rs. 6,480 lakhs, the company received Rs. 1,620 lakhs (25% of issue price) with remaining 75% (Rs. 4,860 lakhs) to be received upon conversion of warrants into equity shares within 18 months. During the quarter, Rs. 2.75 lakhs was utilized for long-term working capital requirements and Rs. 10.33 lakhs for preferential issue expenses. The funds were originally allocated for construction and development of office complexes, IT parks and industrial complexes (Rs. 4,000 lakhs), working capital (Rs. 1,200 lakhs), preferential issue expenses (Rs. 25 lakhs), and general corporate purposes (Rs. 1,255 lakhs).",
            "Sentiment": "neutral",
            "PublishDate": 1762286185484,
            "Source": "corporate_action"
        },
        {
            "Title": "Aeroflex Neu Limited Reports Strong Q2 Performance with 107% Profit Growth",
            "Summary": "Aeroflex Neu Limited announced its quarterly results for the quarter and half-year ended September 30, 2025. The company reported a profit of ₹106.88 lakhs for the quarter compared to ₹26.7 lakhs in the corresponding quarter of the previous year. For the half-year period, profit increased to ₹188.03 lakhs from ₹56.37 lakhs loss in the previous year. Total income for the quarter stood at ₹2,960.08 lakhs versus ₹2,093.86 lakhs in the previous year quarter. The company's Board of Directors approved these unaudited standalone and consolidated financial results in a meeting held on November 4, 2025. The company had previously allotted 72,00,000 share warrants convertible into equity shares at ₹90 per warrant on July 25, 2025. Basic earnings per share for continuing operations was ₹0.40 for the current quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762257184137,
            "Source": "earnings"
        },
        {
            "Title": "Aeroflex Neu Limited Reports Quarterly Results for Quarter Ended June 30, 2025",
            "Summary": "Aeroflex Neu Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of ₹2,969.88 lakhs compared to ₹2,910.83 lakhs in the same quarter last year. Consolidated profit after tax stood at ₹81.15 lakhs versus ₹29.60 lakhs in the previous year quarter. On a standalone basis, revenue from operations was ₹2,584.95 lakhs against ₹2,631.33 lakhs in the corresponding quarter of the previous year, with profit after tax of ₹31.15 lakhs compared to ₹28.36 lakhs. The company's name was changed from Sah Polymers Limited to Aeroflex Neu Limited effective July 7, 2025. Basic earnings per share for continuing operations was ₹0.31 for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754051482791,
            "Source": "earnings"
        },
        {
            "Title": "Aeroflex Neu Limited Allots 72 Lakh Convertible Warrants Worth Rs 64.80 Crores",
            "Summary": "Aeroflex Neu Limited's Board of Directors approved the allotment of 72,00,000 convertible warrants at Rs 90 per warrant, raising Rs 64.80 crores through preferential issue. The warrants are convertible into equity shares with a face value of Rs 10 each. Aeroflex Enterprises Limited (promoter) received 36,00,000 warrants, while non-promoters Benani Capital Scheme-1 and VPK Global Venture Fund-Scheme-1 each received 6,00,000 warrants. Post-conversion, Aeroflex Enterprises Limited will hold 54.30% stake, while each non-promoter will hold 1.85%. The company received 25% of the warrant price upfront, with conversion allowed within 18 months from the issue date. Each warrant converts into one equity share.",
            "Sentiment": "positive",
            "PublishDate": 1753442679686,
            "Source": "corporate_action"
        }
    ]
}