{
    "Symbol": "AEROFLEX",
    "ISIN": "INE024001021",
    "News": [
        {
            "Title": "Aeroflex Industries Allots 30.10 Lakh Equity Shares",
            "Summary": "Aeroflex Industries completed preferential allotment of 30,10,398 equity shares at ₹182.70 per share, raising ₹54.99 crore from six non-promoter investors including Ashish Kacholia.",
            "Sentiment": "positive",
            "PublishDate": 1770125451994,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aeroflex Industries Board Meet on Feb 3 for Equity Allotment",
            "Summary": "Aeroflex Industries has scheduled a board meeting on February 03, 2026, to consider allotment of equity shares on preferential basis following in-principle approval from stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1769689779264,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aeroflex Industries Q3 EBITDA Jumps 30% to ₹283M",
            "Summary": "Aeroflex Industries reports strong Q3 performance with EBITDA rising 30.41% to ₹283 million from ₹217 million year-on-year, while EBITDA margin improves to 23.44%.",
            "Sentiment": "positive",
            "PublishDate": 1769612909063,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aeroflex Industries Schedules Q3 FY26 Earnings Call",
            "Summary": "Aeroflex Industries Limited has scheduled an earnings call for January 29, 2026, at 11:00 AM IST to discuss Q3 and 9M FY26 operational and financial performance with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1769090767643,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aeroflex Industries Expands Operations & Raises ₹548.1 Cr",
            "Summary": "Aeroflex Industries announces major facility expansion for liquid cooling skids, installs robotic welding lines, sets up annealing plant for stainless steel hoses, and raises ₹548.10 crores through equity issuance at ₹182.70 per share.",
            "Sentiment": "positive",
            "PublishDate": 1766069200345,
            "Source": "stocks"
        },
        {
            "Title": "Aeroflex Industries Approves ₹97.56 Cr Expansion Plan",
            "Summary": "Board approves expansion of liquid cooling skids, robotic welding lines, and ₹55 crore preferential issue of 30.10 lakh equity shares at ₹182.70 per share to fund growth initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1765807288560,
            "Source": "stocks"
        },
        {
            "Title": "Aeroflex Industries Reports Record Quarterly Performance with Revenue Crossing INR 100 Crores",
            "Summary": "Aeroflex Industries Limited achieved its highest quarterly performance with revenue reaching INR 111 crores, marking 16% year-on-year growth and 31% quarter-on-quarter growth. The company recorded its best-ever EBITDA margin of 23.5% with EBITDA at INR 26 crores. Despite U.S. tariffs on Indian imports, the company received no order cancellations from U.S. customers, though some shipments worth INR 5-6 crores were deferred from Q2 to Q3. The subsidiary Hyd-Air contributed INR 9 crores in sales compared to INR 1.5 crores in the previous year. The company secured a second order for liquid cooling solutions from a large U.S. corporation, building on its breakthrough order from the previous quarter. Domestic sales contribution improved from 19% to 27%. The company is executing a capex plan of INR 77 crores for expanding hose and miniature metal bellows capacity, expected to complete by March 2026. Management expects EBITDA margins to remain in the 21-22% range going forward and anticipates the liquid cooling business to become a significant growth driver.",
            "Sentiment": "positive",
            "PublishDate": 1762205882109,
            "Source": "earnings"
        },
        {
            "Title": "Aeroflex Industries Reports 16% Revenue Growth and 23.5% EBITDA Margin",
            "Summary": "Aeroflex Industries achieved record revenue growth of 16% year-over-year with an EBITDA margin of 23.5%. The company is strengthening its liquid cooling solutions for data centers and AI infrastructure while expanding operations across more than 80 countries. Aeroflex plans to double its capacity and enter new high-tech flow-control segments by FY27.",
            "Sentiment": "positive",
            "PublishDate": 1761668150457,
            "Source": "earnings"
        },
        {
            "Title": "Aeroflex Industries Reports 31% Jump in Q2 Profit to ₹1,423 Crores",
            "Summary": "Aeroflex Industries Limited announced its quarterly results for the quarter ended September 30, 2025. The company reported a consolidated net profit of ₹1,423.36 lakhs, representing a significant increase from ₹716.69 lakhs in the previous quarter. Revenue from operations grew to ₹11,087.37 lakhs compared to ₹8,433.34 lakhs in the preceding quarter. For the half-year period, total comprehensive income reached ₹2,140.05 lakhs. The company's standalone results showed revenue from operations of ₹10,175.63 lakhs for the quarter. The Board of Directors approved these unaudited financial results at their meeting held on October 28, 2025. The company operates in a single segment of manufacturing products and has a subsidiary, Hyd-Air Engineering Pvt Ltd.",
            "Sentiment": "positive",
            "PublishDate": 1761657716526,
            "Source": "earnings"
        },
        {
            "Title": "Aeroflex Industries Reports Growth in Q2 Financial Performance",
            "Summary": "Aeroflex Industries reported Q2 consolidated net profit of 142 million rupees compared to 137 million rupees in the same period last year. Revenue increased to 1.1 billion rupees from 950 million rupees year-over-year. The company's EBITDA rose to 259 million rupees from 203 million rupees, while EBITDA margin improved to 23.34% from 21.34% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761656258475,
            "Source": "earnings"
        },
        {
            "Title": "Aeroflex Industries Secures 78 Million Rupee Order for Flow Control Components",
            "Summary": "Aeroflex Industries has secured a new order worth approximately 78 million rupees for advanced flow control components.",
            "Sentiment": "positive",
            "PublishDate": 1760618674674,
            "Source": "order&deals"
        },
        {
            "Title": "Aeroflex Industries Gets Ministry Approval for Memorandum of Association Changes",
            "Summary": "Aeroflex Industries Limited received approval from the Ministry of Corporate Affairs for alterations to its main object clause in the Memorandum of Association. The changes were initially approved by shareholders at the 31st Annual General Meeting held on August 05, 2025, through a special resolution. The Ministry granted approval on September 04, 2025. The alterations expand the company's business scope to include smart technology devices, AI-enabled products, IT hardware and software services, along with their existing manufacturing operations of metallic flexible flow solutions, hoses, expansion bellows, and related industrial components. The amendments also allow revenue generation through outsourcing, consultancy, installation services, and research and development activities.",
            "Sentiment": "positive",
            "PublishDate": 1757065243509,
            "Source": "corporate_action"
        },
        {
            "Title": "Aeroflex Reports Mixed Q1 Results with Revenue Growth and Profit Decline",
            "Summary": "Aeroflex reported consolidated net profit of 102 million rupees in Q1, down from 132 million rupees in the same quarter last year. The company's revenue increased to 1.3 billion rupees compared to 1.2 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1755005829710,
            "Source": "earnings"
        },
        {
            "Title": "Aeroflex Industries Re-appoints Two Directors Following Shareholder Approval",
            "Summary": "Aeroflex Industries Limited announced the re-appointment of two directors approved by shareholders at the Annual General Meeting held on August 5, 2025. Mr. Parthasarathi Sarkar was re-appointed as Non-Executive Independent Director for a second term of 5 years, effective from September 3, 2025 to September 2, 2030. Mr. Mustafa Kachwala was re-appointed as Whole-Time Director for 3 years, effective from April 1, 2026 to March 31, 2029. Both appointments were recommended by the Nomination and Remuneration Committee and the Board of Directors. Mr. Sarkar holds an MBA from IIM Ahmedabad and B.Tech from IIT Delhi, with previous experience at Unilever and Tata Administrative Services. He currently runs P. Sarkar Associates, a management consulting business. Mr. Kachwala handles the company's financial affairs and has been associated with Aeroflex since 2010. Neither director is related to other company directors or debarred from holding directorship positions.",
            "Sentiment": "neutral",
            "PublishDate": 1754404114526,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aeroflex Industries Reports 6% Revenue Decline in Q1 FY26, Enters Data Center Cooling Market",
            "Summary": "Aeroflex Industries reported total income of INR 84.67 crores for Q1 FY26, marking a 6% year-on-year decline. EBITDA stood at INR 15.8 crores with an 18.68% margin, while profit after tax was INR 7.1 crores (8.46% margin). The revenue decline was attributed to external macroeconomic factors, particularly tariff issues that increased from 3.5% to 10%, causing temporary procurement delays from export customers. However, domestic business grew over 30% during the quarter. The company entered the data center cooling solutions market, signing a long-term agreement with a US corporation having over USD 50 billion market capitalization and receiving its first order worth INR 7.8 crores. Metal bellows contributed INR 1.3 crores in revenue. Management expects the tariff impact to be temporary and maintains EBITDA growth guidance of over 20% for the full year, with margins expected to normalize at 21-22% as new capacity utilizations improve.",
            "Sentiment": "neutral",
            "PublishDate": 1754301272362,
            "Source": "earnings"
        },
        {
            "Title": "Aeroflex Industries Uploads Q1 2025 Earnings Call Audio Recording",
            "Summary": "Aeroflex Industries Limited has uploaded the audio recording of their earnings call for the quarter ended June 30, 2025, to their company website. The earnings call was held on July 29, 2025, and the audio recording is now available at https://www.aeroflexindia.com/wp-content/uploads/2025-Q1-Audio-Recording.mp3. The company notified both BSE Limited and National Stock Exchange of India Limited about this upload. The notification was signed by Mustafa Abid Kachwala, who serves as Whole-time Director and CFO.",
            "Sentiment": "neutral",
            "PublishDate": 1753790150724,
            "Source": "earnings"
        },
        {
            "Title": "Aeroflex Expands into Data Centre Cooling Market and High-Margin Bellows Capacity",
            "Summary": "Aeroflex is entering the global data centre cooling market as part of its strategic expansion into next-generation industrial innovation. The company is also expanding capacity in high-margin bellows products and integrating Hyd-Air operations. These initiatives are positioned to support multi-year growth for the company.",
            "Sentiment": "positive",
            "PublishDate": 1753712510710,
            "Source": "stock"
        },
        {
            "Title": "Aeroflex Industries Appoints Ms. Ruthu Parampogi as Company Secretary & Compliance Officer",
            "Summary": "Aeroflex Industries Limited has appointed Ms. Ruthu Parampogi as Company Secretary & Compliance Officer effective July 28, 2025. The appointment was approved by the Board of Directors at their meeting held on the same date. Ms. Parampogi is a qualified Company Secretary and Associate Member of the Institute of Company Secretaries of India with membership number A60982. She brings over 6 years of experience in secretarial department with expertise in corporate secretarial functions, statutory compliances, and governance matters. She holds a Bachelor's degree in Commerce and a Bachelor's degree in Law (LLB). The appointment has no specified term mentioned.",
            "Sentiment": "positive",
            "PublishDate": 1753711506063,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aeroflex Industries Reports Decline in Q1 Financial Performance",
            "Summary": "Aeroflex Industries reported quarterly net profit of 72 million rupees, down from 124 million rupees in the same period last year. Revenue decreased to 843 million rupees from 897 million rupees year-over-year. EBITDA fell to 155 million rupees compared to 182 million rupees previously, with EBITDA margin declining to 18.37% from 20.66% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1753709313092,
            "Source": "earnings"
        },
        {
            "Title": "Aeroflex Enterprises Increases Stake in M.R. Organisation by 13%",
            "Summary": "Aeroflex Enterprises has acquired an additional 13% stake in M.R. Organisation, expanding its ownership position in the company.",
            "Sentiment": "positive",
            "PublishDate": 1753365389189,
            "Source": "order&deals"
        },
        {
            "Title": "Aeroflex Industries Schedules Q1 FY26 Earnings Call with Analysts and Investors",
            "Summary": "Aeroflex Industries Limited has scheduled a virtual meeting with analysts and investors on July 29, 2025, at 11:00 AM IST to discuss Q1 FY26 operational and financial performance. The earnings call will be led by Managing Director Asad Daud and the management team. The company has provided registration details and multiple access numbers for participants from different regions including India, USA, UK, Singapore, and Hong Kong. The meeting was announced through regulatory filing to NSE and BSE by Whole-time Director & CFO Mustafa Abid Kachwala.",
            "Sentiment": "neutral",
            "PublishDate": 1753169762409,
            "Source": "earnings"
        },
        {
            "Title": "Aeroflex Industries: Shares Surge 27% in Three Days Amid High Trading Volumes",
            "Summary": "Aeroflex Industries shares rose 9% on Friday, marking a 27% increase over three trading sessions. The stock is now 100% above its IPO price, trading at ₹209.22. High trading volumes were attributed to algo traders. The stock is now in overbought territory with an RSI above 81.",
            "Sentiment": "positive",
            "PublishDate": 1750395830000,
            "Source": "normal_news"
        },
        {
            "Title": "Aeroflex Industries: Record Trading Volume Driven by Algo Traders",
            "Summary": "Aeroflex Industries experienced its highest-ever trading volume since its August 2023 IPO, with over 70 million shares traded on Thursday. NSE data analysis suggests this surge was primarily driven by algorithmic traders.",
            "Sentiment": "neutral",
            "PublishDate": 1750347087000,
            "Source": "normal_news"
        },
        {
            "Title": "Aeroflex Industries: Smallcap Stock Surges 18% Amid Heavy Trading",
            "Summary": "Aeroflex Industries stock jumped 17.9% to Rs 206.10 on BSE with high trading volumes. Ashish Kacholia increased stake to 1.92%. The company recently expanded production capacity and introduced a new product, Metal Bellows.",
            "Sentiment": "positive",
            "PublishDate": 1750328534000,
            "Source": "normal_news"
        },
        {
            "Title": "Aeroflex Industries Projects Strong Growth and Profitability",
            "Summary": "Aeroflex Industries has provided positive financial projections during a recent conference call. The company expects a minimum of 20-25% growth in bottom line for the current financial year. Looking ahead to FY '26, Aeroflex anticipates growth in profitability to exceed 25%, accompanied by a 100 basis point increase in margin. The company also noted that it had previously forecasted and achieved over 25% growth in profitability for FY '25.",
            "Sentiment": "positive",
            "PublishDate": 1746416182000,
            "Source": "default"
        },
        {
            "Title": "Aeroflex Reports Increased Q4 Profit and Revenue",
            "Summary": "Aeroflex has announced its Q4 financial results. The company's consolidated net profit rose to 112 million rupees, up from 100 million rupees year-over-year, but down from 150 million rupees quarter-over-quarter. Revenue for Q4 increased to 917 million rupees, compared to 778 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1746021479000,
            "Source": "result"
        },
        {
            "Title": "Aeroflex Industries' UK Subsidiary Dissolved",
            "Summary": "Aeroflex Industries has announced that its UK subsidiary, Aeroflex Industries, U.K., has been dissolved. This corporate action indicates a change in the company's international business structure.",
            "Sentiment": "neutral",
            "PublishDate": 1742385923000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aeroflex Reports Strong Q3 Financial Results",
            "Summary": "Aeroflex has announced its Q3 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit increased to 152 million rupees, up from 90 million rupees in the same quarter last year and 137 million rupees in the previous quarter. Revenue also saw a substantial rise, reaching 998 million rupees compared to 731 million rupees in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1736985891000,
            "Source": "earnings"
        },
        {
            "Title": "Aeroflex Plans Capacity Expansion for Value-Added Products",
            "Summary": "Aeroflex has announced plans for further capacity additions focused on value-added offerings. The company executive stated that these expansions are expected to enhance EBITDA margins and strengthen Aeroflex's market position, as revealed in an investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1736951254000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aeroflex Industries Reports Strong Q3 Financial Results",
            "Summary": "Aeroflex Industries has announced its Q3 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit increased to 152 million rupees, up from 90 million rupees in the same quarter last year and 137 million rupees in the previous quarter. Revenue also saw substantial growth, reaching 998 million rupees compared to 731 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1736948411000,
            "Source": "earnings"
        },
        {
            "Title": "Aeroflex Industries Schedules Board Meeting for Q3 Results and Expansion Plan",
            "Summary": "Aeroflex Industries has announced a board meeting on January 15 to consider and approve the company's Q3 results. Additionally, the board will discuss and potentially approve an expansion plan for the company.",
            "Sentiment": "positive",
            "PublishDate": 1736429501000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aeroflex Industries Expands Production Capacity",
            "Summary": "Aeroflex Industries has increased its production capacity for S.S. Hose and Brading by 1.5 million meters per annum. This expansion raises the company's total production capacity from 15.0 million meters to 16.5 million meters annually.",
            "Sentiment": "positive",
            "PublishDate": 1735804130000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aeroflex Industries Approves Rs 400 Crore Fundraising via QIP",
            "Summary": "The board of Aeroflex Industries has approved raising up to Rs 400 crore through a Qualified Institutional Placement (QIP). This decision indicates the company's intent to secure significant capital for potential expansion or other strategic initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1734160219000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aeroflex Industries to Consider Fund Raising Options",
            "Summary": "Aeroflex Industries has announced a board meeting scheduled for December 14 to discuss and consider various options for raising funds, including the possibility of a Qualified Institutional Placement (QIP).",
            "Sentiment": "neutral",
            "PublishDate": 1733923101000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aeroflex Industries Expands into New-Age Industries",
            "Summary": "Aeroflex Industries has announced plans to expand its product range, targeting entry into various new-age industries including aerospace, semiconductor, solar connectors, electric vehicles, robotics, and defense. This information was shared in the company's investor presentation, indicating a strategic move to diversify and capitalize on emerging technological sectors.",
            "Sentiment": "positive",
            "PublishDate": 1730296680000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aeroflex Industries Aims to Boost Revenue with Focus on High-Margin Products",
            "Summary": "Aeroflex Industries has announced its strategy to increase revenue by concentrating on high-margin product segments, particularly assemblies and fittings, as revealed in their investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1730296629000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aeroflex Industries Expands Production Capacity",
            "Summary": "Aeroflex Industries has increased its existing production capacity to 15.0 million meters in a phased manner. The company also plans to add another 1.5 million meters of capacity by December 2024, as stated in their investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1730296582000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aeroflex Industries Reaffirms 25% Annual EBITDA Growth Target",
            "Summary": "An executive from Aeroflex Industries has expressed confidence in the company's future prospects during an investor presentation. The company has reaffirmed its guidance of achieving a 25% growth in absolute EBITDA on a yearly basis.",
            "Sentiment": "positive",
            "PublishDate": 1730296301000,
            "Source": "normal_news"
        },
        {
            "Title": "Aeroflex Industries Closes UK Unit",
            "Summary": "Aeroflex Industries has announced the closure of its UK-based unit, Aeroflex Industries, U.K.",
            "Sentiment": "negative",
            "PublishDate": 1730295777000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aeroflex Industries Reports Q2 EBITDA Growth",
            "Summary": "Aeroflex Industries has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 202 million rupees, up from 180 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 21.65% from 21.01% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730290069000,
            "Source": "result"
        },
        {
            "Title": "Aeroflex Industries Reports Q2 Revenue Growth",
            "Summary": "Aeroflex Industries has announced its Q2 revenue of 935 million rupees, showing an increase from 840 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730290059000,
            "Source": "result"
        },
        {
            "Title": "Aeroflex Industries Reports Q2 Profit Increase",
            "Summary": "Aeroflex Industries has reported a net profit of 136 million rupees for the second quarter, showing an increase from 116 million rupees year-over-year and 124 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730290047000,
            "Source": "result"
        }
    ]
}