{
    "Symbol": "AETHER",
    "ISIN": "INE0BWX01014",
    "News": [
        {
            "Title": "Aether Industries Allots 5,251 Shares Under ESOP",
            "Summary": "Aether Industries Limited has allotted 5,251 equity shares to employees under its Employee Stock Option Scheme 2021, increasing total share capital to Rs. 1,32,66,25,920 comprising 13,26,62,592 equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1770706270524,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aether Industries Q3FY26 Earnings Call on Feb 3",
            "Summary": "Aether Industries Limited has scheduled its Q3FY26 earnings conference call for February 3, 2026, at 4:00 PM to discuss financial performance for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769684909617,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aether Industries Allots 22,577 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Aether Industries Limited allotted 22,577 equity shares at Rs. 321 per share to eligible employees under its Employee Stock Option Scheme 2021 on November 20, 2025. The allotment increases the company's total share capital to Rs. 1,32,61,28,180 comprising 13,26,12,818 equity shares of Rs. 10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1763618715642,
            "Source": "corporate_action"
        },
        {
            "Title": "Aether Industries Reports 38% Revenue Growth in Q2 FY26, Expands R&D Capacity",
            "Summary": "Aether Industries achieved consolidated revenue of Rs. 275.1 crores in Q2 FY26 versus Rs. 198.8 crores in Q2 FY25, with EBITDA margins improving to 31% from 25%. The company is expanding R&D capacity with 24 new fume hoods and planning a new R&D extension with 130+ fume hoods, while commissioning three new production blocks at Site-3 and Site-5 by Q4 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1763466693267,
            "Source": "earnings"
        },
        {
            "Title": "Aether Industries Reports No Deviation in QIP Fund Utilization for Q2 FY26",
            "Summary": "Aether Industries Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing no deviation from stated objectives in its Rs 7,500 million QIP fund utilization. CRISIL Ratings confirmed proper deployment of proceeds toward manufacturing facility expansion projects and working capital requirements as per the original placement document.",
            "Sentiment": "positive",
            "PublishDate": 1763123748648,
            "Source": "earnings"
        },
        {
            "Title": "Aether Industries Schedules Earnings Conference Call for November 13, 2025",
            "Summary": "Aether Industries Limited has scheduled an earnings conference call for November 13, 2025, starting at 5:00 PM to discuss the company's financial performance for the quarter and half-year ended September 30, 2025. The call will be conducted by HDFC Securities and will feature key company representatives including Co-Founders Dr. Aman Desai (Director of Research and Operations) and Mr. Rohan Desai (Director of Commercial), along with CFO Mr. Faiz Nagariya and Lead Investor Relations Mr. Kushal Doshi. The company has provided dial-in details for participants to join the conference call.",
            "Sentiment": "neutral",
            "PublishDate": 1762282300746,
            "Source": "corporate_action"
        },
        {
            "Title": "Ather Energy Unveils Next-Generation Electric Scooter Platform and Technology Updates",
            "Summary": "Ather Energy Limited announced multiple product and technology updates at Ather Community Day 2025. The company unveiled a next-generation electric scooter platform and introduced AtherStack 7.0 featuring voice interaction capabilities. The company also launched next-generation fast chargers and an infinite cruise feature. Additionally, the Rizta scooter received upgrades including a touchscreen dashboard and a new riding mode.",
            "Sentiment": "positive",
            "PublishDate": 1756544282053,
            "Source": "stock"
        },
        {
            "Title": "Aether Industries Reports 35% Revenue Growth to INR 2,587 Million in Q1 FY26",
            "Summary": "Aether Industries delivered strong quarterly results with consolidated revenue rising 35% year-on-year to INR 2,587 million. EBITDA surged 94% to INR 781 million with margins expanding to 30% from 22% in the previous year. PAT increased 57% to INR 470 million. The company's large-scale manufacturing vertical grew 9% year-on-year and 8% quarter-on-quarter, while adding six new clients during the quarter. Business model contribution showed 51% from large-scale manufacturing, 37% from contract/exclusive manufacturing, and 10% from contract research services. Export revenue accounted for 33% of total revenues. The company executed a 10-year exclusive manufacturing agreement with Milliken Chemical & Textile India for a new product, dedicating Site 3+ for this contract. Site 5 development continues on schedule with first two production blocks expected by end of Q3 FY26. Management plans INR 350 crores capex for FY26 and expects to receive INR 50-60 crores in insurance claims. Working capital cycle improved to 190 days from 195 days. The company is expanding R&D facilities with INR 30-40 crores investment to increase labs from 8 to 23 and fume hoods from 65 to 195.",
            "Sentiment": "positive",
            "PublishDate": 1753791299333,
            "Source": "earnings"
        },
        {
            "Title": "Aether Industries Targets 25% EBITDA Margin on New Products, Milliken Contract to Match Current Margins",
            "Summary": "Aether Industries has set a target of achieving at least 25% EBITDA margin on new products before receiving production approval. The company's Milliken contract is expected to deliver margins that are equal to or exceed the company's current margin levels.",
            "Sentiment": "positive",
            "PublishDate": 1753415120721,
            "Source": "stock"
        },
        {
            "Title": "Aether Industries Reports 35% Revenue Growth in Q1, Appoints New Auditors and Addresses NSE Compliance Notice",
            "Summary": "Aether Industries Limited reported consolidated revenue of ₹2,587 million for the quarter ended June 30, 2025, marking a 35% year-on-year increase from ₹1,920 million in the same period last year. The company's profit after tax reached ₹470 million, up 57% year-on-year from ₹299 million. The board approved the appointment of statutory, secretarial, cost, and internal auditors for varying terms. The company scheduled its 13th Annual General Meeting for September 12, 2025. Aether addressed a non-compliance notice from NSE regarding Regulation 23(9) of SEBI LODR Regulations, with the board commenting that the issue appears to result from a technical submission problem. The company executed a Contract/Exclusive Manufacturing Agreement with Milliken & Company, making Aether the sole manufacturing partner for a key strategic product over an initial 10-year period. Site 5 expansion is progressing with commissioning of two production blocks expected by end of Q3 FY26, while Site 3++ expansion remains on track with product launch targeted for Q4 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1753354080665,
            "Source": "earnings"
        },
        {
            "Title": "Aether Industries to Review Q1 Results on July 24",
            "Summary": "Aether Industries has scheduled a meeting to review its first quarter results on July 24.",
            "Sentiment": "neutral",
            "PublishDate": 1751284734000,
            "Source": "default"
        },
        {
            "Title": "Aether Industries: Kotak Cuts Price Target, Awaits Better Execution",
            "Summary": "Kotak Institutional Equities reduced Aether Industries' price target to ₹890 from ₹910, maintaining a 'Neutral' stance. The company secured a 10-year contract with Milliken, likely for material science products. Despite this, Kotak expects a gradual ramp-up for other contracts and sees the stock as not inexpensive at current valuations.",
            "Sentiment": "neutral",
            "PublishDate": 1750407519000,
            "Source": "normal_news"
        },
        {
            "Title": "Aether Industries Finalizes Contract Manufacturing Agreement with Milliken Chemical and Textile",
            "Summary": "Aether Industries has announced the finalization of a contract manufacturing agreement with Milliken Chemical and Textile. The news indicates a new business partnership between the two companies, potentially involving production or manufacturing services.",
            "Sentiment": "positive",
            "PublishDate": 1750150844000,
            "Source": "default"
        },
        {
            "Title": "Aether Industries: Promoter Initiates Share Sale, Stock Hits One-Month Low",
            "Summary": "Aether Industries' share price fell 6.77% as promoter Purnima Desai began an offer for sale (OFS) of up to 89.79 lakh shares (6.77% of total equity). The floor price is set at Rs 700 per share, a 14% discount to the previous close. Non-retail investors can bid today, with retail and employee bidding opening tomorrow.",
            "Sentiment": "negative",
            "PublishDate": 1747115686000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aether Industries: Promoter to Sell 6.77% Stake via OFS",
            "Summary": "Aether Industries promoter Purnima Desai will sell 6.77% stake (89,79,173 shares) through an offer for sale on May 13-14, 2025. The OFS includes separate windows for retail and non-retail investors, with 10% reserved for retail and 25% for mutual funds and insurance companies.",
            "Sentiment": "neutral",
            "PublishDate": 1747059292000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aether Industries Promoter to Sell 6.77% Equity via OFS",
            "Summary": "Purnima Desai, a promoter of Aether Industries, plans to sell up to 6.77% equity (89.79 lakh shares) in the company through an Offer for Sale (OFS) on May 13 and 14. The floor price for the offer has been set at ₹700 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1747054219000,
            "Source": "default"
        },
        {
            "Title": "Aether Industries Reports Strong Q4 FY2023 Financial Results",
            "Summary": "Aether Industries has reported a significant turnaround in its Q4 financial performance. The company posted a consolidated net profit of 503 million rupees, compared to a loss of 14 million rupees in the same quarter last year. Revenue increased to 2.4 billion rupees from 1.17 billion rupees year-over-year. The company also reported an exceptional item of 28.5 million rupees. Profit before tax (PBT) rose to 665.8 million rupees from 77.7 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1746403616000,
            "Source": "default"
        },
        {
            "Title": "Aether Industries Reports Strong Q4 Financial Results",
            "Summary": "Aether Industries has announced its Q4 financial results, showing significant year-over-year improvements. The company's revenue increased to 2.4 billion rupees from 1.17 billion rupees in the previous year. EBITDA rose to 796.5 million rupees with a margin of 33.2%, up from 102.3 million rupees and 8.7% margin last year. The consolidated net profit reached 503 million rupees, compared to a loss of 14 million rupees in the same quarter last year. The company also reported an exceptional item of 28.5 million rupees, down from 74 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1746185813000,
            "Source": "result"
        },
        {
            "Title": "Aether Industries Acquires Industrial Plot for Expansion in Gujarat",
            "Summary": "Aether Industries has acquired an industrial plot in Gujarat for future manufacturing expansion. The plot is strategically located adjacent to the company's existing manufacturing facility, indicating a planned increase in production capacity.",
            "Sentiment": "positive",
            "PublishDate": 1737936696000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aether Industries Acquires Industrial Plot for Expansion in Gujarat",
            "Summary": "Aether Industries has acquired an industrial plot in Gujarat for future manufacturing expansion. The plot is strategically located adjacent to the company's existing manufacturing facility and is expected to play a crucial role in the company's growth plans.",
            "Sentiment": "positive",
            "PublishDate": 1737722461000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aether Industries: Q3 Profit Soars 149%, Revenue Up 41%",
            "Summary": "Aether Industries reported Q3 FY25 results with profit rising 148.94% YoY to ₹43.39 crore and revenue increasing 41.4% YoY to ₹219.68 crore. Operating income grew 248.33% YoY. EPS stood at ₹3.41, up 104.19% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1737178553000,
            "Source": "earnings"
        },
        {
            "Title": "Aether Industries: Q3 Profit Doubles, Shares Surge Despite Fire Incident",
            "Summary": "Aether Industries reported a 150% YoY increase in Q3 FY25 net profit to Rs 43.3 crore. Revenue rose 41.4% to Rs 219.6 crore. EBITDA margin improved to 29.4%. A fire at Manufacturing Facility 2 led to a GPCB closure notice and Rs 5 lakh compensation. Share price rose 7.70% to Rs 920, later settling at 3.95% higher.",
            "Sentiment": "positive",
            "PublishDate": 1737102365000,
            "Source": "earnings"
        },
        {
            "Title": "Aether Industries Finalizes Supply Agreement with Baker Hughes",
            "Summary": "Aether Industries has announced the finalization of their Supply Service Agreement (SSA) with Baker Hughes. The company has completed manufacturing validation quantities and ordered raw materials. Production ramp-up is scheduled to begin in the fourth quarter of fiscal year 2025.",
            "Sentiment": "positive",
            "PublishDate": 1737098859000,
            "Source": "order&deals"
        },
        {
            "Title": "Aether Industries Reports Strong Q3 EBITDA Growth",
            "Summary": "Aether Industries has reported a significant increase in its Q3 consolidated EBITDA, rising to 648 million rupees from 313 million rupees in the same period last year. The company's EBITDA margin also improved substantially, reaching 29.49% compared to 20.14% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1737097629000,
            "Source": "earnings"
        },
        {
            "Title": "Aether Industries Reports Q3 Revenue Growth",
            "Summary": "Aether Industries has announced its third-quarter revenue, which stands at 1.97 billion rupees. This represents an increase from the previous year's figure of 1.6 billion rupees, indicating year-over-year growth for the company.",
            "Sentiment": "positive",
            "PublishDate": 1737097477000,
            "Source": "earnings"
        },
        {
            "Title": "Aether Industries Reports Strong Q3 EBITDA Growth",
            "Summary": "Aether Industries has reported a significant increase in its Q3 EBITDA, rising to 597 million rupees from 313 million rupees year-over-year. The company's EBITDA margin also improved substantially, reaching 30.24% compared to 20.17% in the same period last year. This performance indicates a notable improvement in the company's operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1737097427000,
            "Source": "earnings"
        },
        {
            "Title": "Aether Industries Reports Significant Profit Growth in Q3",
            "Summary": "Aether Industries has announced its financial results for the third quarter, reporting a net profit of 409 million rupees. This represents a substantial increase from the 190 million rupees reported in the same period of the previous year, indicating strong year-over-year growth for the company.",
            "Sentiment": "positive",
            "PublishDate": 1737097366000,
            "Source": "earnings"
        },
        {
            "Title": "Aether Industries: Strategic Supply Agreement Amendment with Baker Hughes",
            "Summary": "Aether Industries executed an amendment to its strategic supply agreement with Baker Hughes on January 7, finalizing volume and pricing terms for two exclusive products. These will be manufactured by Aether's subsidiary, Aether Specialty Chemicals Ltd, at their newly developed site 4. The company's manufacturing facility II in Surat has resumed full operations after GPCB revoked a closure order.",
            "Sentiment": "positive",
            "PublishDate": 1736919852000,
            "Source": "order&deals"
        },
        {
            "Title": "Aether Industries Amends Strategic Supply Agreement with Baker Hughes",
            "Summary": "Aether Industries has modified its strategic supply agreement with Baker Hughes. The amendment focuses on finalizing the volumes and pricing for the initial products covered under the agreement. This update suggests progress in their business relationship and potentially indicates a move towards more concrete terms in their supply arrangement.",
            "Sentiment": "positive",
            "PublishDate": 1736912275000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aether Industries to Begin Full-Capacity Operations at Manufacturing Facility II",
            "Summary": "Aether Industries has announced that it will commence full-capacity operations at its Manufacturing Facility II once all stipulated conditions are met. This indicates the company is expanding its production capabilities while ensuring compliance with regulatory requirements.",
            "Sentiment": "positive",
            "PublishDate": 1736393788000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aether Industries Resumes Operations at Manufacturing Facility II",
            "Summary": "Aether Industries has received a revocation order from the Gujarat Pollution Control Board (GPCB) allowing the resumption of operations at its Manufacturing Facility II. This indicates that the company has likely addressed any environmental or regulatory concerns that led to the previous suspension of operations at this facility.",
            "Sentiment": "positive",
            "PublishDate": 1736393628000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aether Industries to Consider Q3 Results on January 17",
            "Summary": "Aether Industries has announced that it will consider its third quarter (Q3) financial results on January 17. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1735732711000,
            "Source": "earnings"
        },
        {
            "Title": "Aether Industries Completes 15 MW Solar Power Project",
            "Summary": "Aether Industries has announced the final execution and commissioning of a 15 MW solar power project. This development suggests the company's investment in renewable energy infrastructure, potentially aimed at reducing operational costs and environmental impact.",
            "Sentiment": "positive",
            "PublishDate": 1735529859000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aether Industries: Q2 Profit Dips, Revenue Climbs 21%",
            "Summary": "Aether Industries reported a 4.4% YoY decrease in Q2 net profit to ₹35 crore, while revenue increased 21.2% to ₹198.7 crore. EBITDA rose 16.6% to ₹53.4 crore, with margins at 27%. The company signed a three-year contract with Chemoxy International Ltd. to produce bio-based products, expecting production of 100+ MT per year to start within 10 months.",
            "Sentiment": "neutral",
            "PublishDate": 1729237963000,
            "Source": "result"
        },
        {
            "Title": "Aether Industries Reports Q2 Financial Results",
            "Summary": "Aether Industries announced its Q2 financial results. The company's EBITDA increased to 548 million rupees from 460 million rupees year-over-year. However, the EBITDA margin slightly decreased to 27.9% from 28.01% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1729235477000,
            "Source": "result"
        },
        {
            "Title": "Aether Industries Reports Q2 Revenue Growth",
            "Summary": "Aether Industries has announced its second quarter revenue for the current fiscal year. The company reported revenue of 1.96 billion rupees, compared to 1.6 billion rupees in the same quarter of the previous year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1729235334000,
            "Source": "result"
        },
        {
            "Title": "Aether Industries Reports Slight Increase in Q2 Net Profit",
            "Summary": "Aether Industries has announced its financial results for the second quarter. The company's net profit rose marginally to 381 million rupees, compared to 378 million rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1729235308000,
            "Source": "result"
        },
        {
            "Title": "Aether Industries Commissions 5 MW Solar Power Project",
            "Summary": "Aether Industries has announced the commissioning of an additional 5 MW solar power project facility. This development suggests the company is expanding its renewable energy capacity, potentially to reduce operational costs and environmental impact.",
            "Sentiment": "positive",
            "PublishDate": 1729175711000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aether Industries Schedules Q2 Results Board Meeting",
            "Summary": "<p>Aether Industries has announced a <span class='neutral'>board meeting</span> scheduled for <b>October 18</b> to <span class='neutral'>consider and approve</span> the company's <span class='neutral'>financial results</span> for the <b>second quarter</b> of the fiscal year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728031332000,
            "Source": "corporate_action"
        }
    ]
}