{
    "Symbol": "AFCONS",
    "ISIN": "INE101I01011",
    "News": [
        {
            "Title": "Afcons Infrastructure Reports Full NCD Utilization",
            "Summary": "Afcons Infrastructure Limited has fully utilized ₹50.00 crores raised through Non-Convertible Debentures in October 2025, with no deviations reported for Q3 FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1770807697363,
            "Source": "stocks"
        },
        {
            "Title": "Afcons Infrastructure Completes IPO Fund Utilization",
            "Summary": "Afcons Infrastructure has fully utilized its ₹12,500 million IPO proceeds across all designated objects including equipment purchase, working capital, debt repayment and general corporate purposes.",
            "Sentiment": "positive",
            "PublishDate": 1770736282838,
            "Source": "co_actions_results"
        },
        {
            "Title": "Afcons Infrastructure Q3 FY26 Results & Board Updates",
            "Summary": "Afcons Infrastructure reported Q3 FY26 results with revenue of ₹2,973.74 crore and profit after tax of ₹105.18 crore. Board approved reclassification of 29 promoter group entities to public shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1770729437552,
            "Source": "co_actions_results"
        },
        {
            "Title": "Afcons Infrastructure Receives Reclassification Request",
            "Summary": "Afcons Infrastructure receives requests from 29 promoter group entities seeking reclassification to public shareholders under SEBI regulations. Board meeting scheduled for February 10, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770210291888,
            "Source": "stocks"
        },
        {
            "Title": "Afcons Infrastructure Grants 1,10,701 ESOPs to Staff",
            "Summary": "Afcons Infrastructure's Nomination and Remuneration Committee approved grant of 1,10,701 employee stock options under ESOP 2025 at exercise price of Rs 271 per option on February 04, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770209445434,
            "Source": "co_actions_results"
        },
        {
            "Title": "Afcons Infrastructure Q3 & 9M FY26 Earnings Call Feb 11",
            "Summary": "Afcons Infrastructure Limited announces earnings conference call on February 11, 2026 at 11:00 AM IST to discuss Q3 and nine months financial results ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770145975439,
            "Source": "co_actions_results"
        },
        {
            "Title": "Afcons Wins €100M+ Road Project in Uganda",
            "Summary": "Afcons Infrastructure Limited secures strategic road infrastructure project in Uganda valued at over €100 million, funded by multilateral development agency, reinforcing export-led growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1769880891524,
            "Source": "co_actions_results"
        },
        {
            "Title": "Afcons Infrastructure faces EUR 17.85 mn bond invocation",
            "Summary": "Afcons Infrastructure disclosed that client SAG invoked surety bonds worth EUR 17.85 million related to a Gabon road project, with the company initiating arbitration proceedings over contractual disputes.",
            "Sentiment": "negative",
            "PublishDate": 1769879991453,
            "Source": "stocks"
        },
        {
            "Title": "AFCONS Infrastructure Wins ₹270.3M Arbitration Award",
            "Summary": "AFCONS Infrastructure receives favorable arbitration award of ₹270.3 million and secures bank guarantee of ₹275.4 million, strengthening its financial position through legal resolution.",
            "Sentiment": "positive",
            "PublishDate": 1769781343965,
            "Source": "stocks"
        },
        {
            "Title": "Afcons Infrastructure Submits Q3 FY26 CP Certificate",
            "Summary": "Afcons Infrastructure Limited has submitted its Commercial Paper proceeds utilisation certificate for Q3 FY26 to BSE and NSE, confirming proper fund utilisation as per SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768827299499,
            "Source": "stocks"
        },
        {
            "Title": "Afcons Infrastructure Receives GST Demand Order",
            "Summary": "Afcons Infrastructure disclosed receiving a GST demand order from Tirupati Division GST Authority for ₹1.20 crores related to IGST credit reversal. The company plans to file an appeal and expects no significant financial impact.",
            "Sentiment": "negative",
            "PublishDate": 1768232244200,
            "Source": "stocks"
        },
        {
            "Title": "Afcons achieves breakthrough in CIDCO water tunnel",
            "Summary": "Afcons Infrastructure achieved first tunnel breakthrough in CIDCO's history at Hetawane Water Supply Scheme, completing 5.52 km of 8.7 km tunnel work and committing to finish project six months ahead of schedule.",
            "Sentiment": "positive",
            "PublishDate": 1767010360291,
            "Source": "stocks"
        },
        {
            "Title": "Afcons Infrastructure Share Pledge Extension Disclosed",
            "Summary": "Goswami Infratech extends pledge on 9.20 crore Afcons shares worth ₹356.32 crores to common security trustee for debenture holders across multiple debt instruments totaling over ₹2,944 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1766732504432,
            "Source": "co_actions_results"
        },
        {
            "Title": "Afcons Wins India's Most Innovative Company Award 2025",
            "Summary": "Afcons Infrastructure Limited clinched two top honours at CII Industrial Innovation Awards 2025, including Grand Award for Top Innovative Company across all sectors and categories.",
            "Sentiment": "positive",
            "PublishDate": 1766224208820,
            "Source": "stocks"
        },
        {
            "Title": "Afcons Infrastructure Grants 1.01 Cr Stock Options",
            "Summary": "Afcons Infrastructure's board committee approved grant of 1,01,71,230 employee stock options under ESOP 2025 plan to eligible employees on December 12, 2025, with exercise price of ₹10.00 per option.",
            "Sentiment": "positive",
            "PublishDate": 1765537854134,
            "Source": "stocks"
        },
        {
            "Title": "Afcons Infrastructure Receives ₹243.52 Cr Award",
            "Summary": "Afcons Infrastructure Limited officially received ₹243.52 crores arbitration award on December 11, 2025, for Chenab Bridge rail project, confirming positive financial impact.",
            "Sentiment": "positive",
            "PublishDate": 1765532357748,
            "Source": "stocks"
        },
        {
            "Title": "Afcons Infrastructure Secures EPC Orders Worth ₹8.84 Billion in November",
            "Summary": "Afcons Infrastructure received engineering, procurement and construction (EPC) orders valued at ₹8.84 billion during November. The order wins strengthen the company's project pipeline and revenue visibility in the infrastructure construction sector.",
            "Sentiment": "positive",
            "PublishDate": 1764633486908,
            "Source": "stock"
        },
        {
            "Title": "Afcons Infrastructure Reports 3.4% Revenue Growth in H1 FY26, Cuts Full-Year Guidance to 10%",
            "Summary": "Afcons Infrastructure recorded revenue of INR 6,520 crores in H1 FY26 with EBITDA margin improving to 13%, but reduced full-year revenue growth guidance from 20% to 10% due to delayed L1 order conversions and payment issues in projects like Jal Jeevan Mission. The company maintains a strong order book of INR 32,681 crores and expects INR 20,000 crores in new order inflows for the year, with major projects including Croatia Railway and Vadhvan Port breakwater in the pipeline.",
            "Sentiment": "neutral",
            "PublishDate": 1763373459106,
            "Source": "earnings"
        },
        {
            "Title": "Afcons Infrastructure Raises Rs. 30 Crores Through Commercial Paper Issuance",
            "Summary": "Afcons Infrastructure Limited issued Commercial Papers worth Rs. 30 crores on November 14, 2025, through private placement with a 7.50% annual interest rate. The unsecured instruments are proposed to be listed on the National Stock Exchange of India Limited and will be repaid on maturity.",
            "Sentiment": "neutral",
            "PublishDate": 1763131695419,
            "Source": "corporate_action"
        },
        {
            "Title": "Afcons Management Expects Full Year EBITDA to Exceed 11% Guidance",
            "Summary": "Afcons management stated during a conference call that the company's full year EBITDA is expected to perform better than the previously provided guidance of 11%.",
            "Sentiment": "positive",
            "PublishDate": 1763023718161,
            "Source": "earnings"
        },
        {
            "Title": "Afcons Infrastructure Reports IPO Proceeds Utilization for September 2025 Quarter",
            "Summary": "Afcons Infrastructure Limited submitted a monitoring agency report from Crisil Ratings regarding the utilization of proceeds from its Initial Public Offering for the quarter ended September 30, 2025. The company raised Rs 12,500 million through its IPO conducted from October 25-29, 2024. The proceeds were allocated across four main objectives: Rs 800 million for construction equipment purchase, Rs 3,200 million for long-term working capital, Rs 6,000 million for debt repayment, and Rs 2,146.37 million for general corporate purposes. As of September 30, 2025, Rs 12,499.31 million has been utilized with only Rs 168.84 million remaining unutilized, which is earmarked for capital expenditure towards construction equipment. The monitoring report indicates no deviations from the stated objectives and confirms all utilization is in line with the offer document disclosures.",
            "Sentiment": "neutral",
            "PublishDate": 1762990342498,
            "Source": "corporate_action"
        },
        {
            "Title": "Afcons Infrastructure Reports Record Order Book, Plans Overseas Expansion",
            "Summary": "Afcons Infrastructure has achieved a record order book driven by rail, metro and marine projects. The company is focusing on execution excellence and overseas diversification in Africa and Middle East markets. Capital expenditure plans include enhancing EPC capabilities and automation. The company maintains a strong bid pipeline that supports multi-year revenue growth visibility.",
            "Sentiment": "positive",
            "PublishDate": 1762960672942,
            "Source": "stock"
        },
        {
            "Title": "Afcons Infrastructure Reports 22.5% Drop in Net Profit Despite Revenue Growth",
            "Summary": "Afcons Infrastructure, part of Shapoorji Pallonji Group, reported net profit of ₹105 crore for the second quarter ended September 30, 2025, down 22.5% from ₹135.4 crore in the same period last year. Revenue grew marginally by 1% to ₹2,988.3 crore from ₹2,959.7 crore year-on-year. EBITDA declined 4.6% to ₹328.7 crore with margin compressing to 11% from 11.6% previously. The company maintains an order book of ₹32,681 crore and recently secured a ₹576 crore contract for civil infrastructure works. Executive Chairman Subramanian Krishnamurthy attributed the modest growth to extended monsoons during the first half. Shares closed higher at ₹422.40 on NSE.",
            "Sentiment": "negative",
            "PublishDate": 1762955424372,
            "Source": "earnings"
        },
        {
            "Title": "Afcons Infrastructure Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Afcons Infrastructure reported quarterly revenue of 29.9 billion rupees, up from 29.5 billion rupees year-over-year. However, the company's net profit declined to 1.12 billion rupees from 1.4 billion rupees in the same period last year. EBITDA decreased to 3.4 billion rupees from 3.5 billion rupees year-over-year, while EBITDA margin compressed to 11.31% from 11.77% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762951766157,
            "Source": "earnings"
        },
        {
            "Title": "Afcons Infrastructure Shareholders Approve Director Appointments and Employee Stock Option Plan",
            "Summary": "Afcons Infrastructure Limited shareholders approved eight resolutions through postal ballot voting that concluded on November 10, 2025. The approved resolutions include the appointment of Pallon Shapoorji Mistry and Firoz Cyrus Mistry as Non-Executive and Non-Independent Directors, and Santosh Balachandran Nayar as an Independent Director. Shareholders also approved the Afcons Infrastructure Limited-Employee Stock Option Plan 2025 and granted stock options to employees of subsidiary and associate companies. Additionally, remuneration variations for Subramanian Krishnamurthy, Executive Chairman, and Srinivasan Paramasivan, Managing Director, were approved in connection with stock option grants. All resolutions passed with requisite majority, with approval rates ranging from 92.34% to 99.51%. The voting was conducted through remote e-voting with a cut-off date of October 3, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762854849980,
            "Source": "corporate_action"
        },
        {
            "Title": "Afcons Infrastructure Schedules Earnings Conference Call for November 13, 2025",
            "Summary": "Afcons Infrastructure Limited will conduct an earnings conference call on November 13, 2025 at 2:00 PM IST to discuss financial performance for the quarter and half year ended September 30, 2025. The call will be led by key management including Executive Chairman Subramanian Krishnamurthy, Managing Director Srinivasan Paramasivan, CFO Ramesh Kumar Jha, and Head of Corporate Strategy Hitesh Singh. DAM Capital Advisors Ltd is organizing the conference call with analyst Bhoomika Nair leading the session. Dial-in details and international timing schedules have been provided for participants.",
            "Sentiment": "neutral",
            "PublishDate": 1762567843787,
            "Source": "earnings"
        },
        {
            "Title": "Afcons Infrastructure Raises Rs. 55 Crores Through Commercial Paper Issuance",
            "Summary": "Afcons Infrastructure Limited issued commercial papers worth Rs. 55 crores on October 15, 2025, with a 7.50% annual interest rate and 152-day tenure. The unsecured instruments will mature on March 16, 2026, and are proposed to be listed on the National Stock Exchange of India Limited. The commercial papers were issued to The Maharashtra State Co-Operative Bank Ltd (Rs. 50 crores) and The Vishweshwar Sahakari Bank Ltd (Rs. 5 crores) on a private placement basis. The instruments carry a Crisil A1+ credit rating with upfront interest payment and principal repayment scheduled for the maturity date.",
            "Sentiment": "neutral",
            "PublishDate": 1760532131388,
            "Source": "corporate_action"
        },
        {
            "Title": "Afcons Infrastructure Raises Rs 50 Crores Through Non-Convertible Debentures Issue",
            "Summary": "Afcons Infrastructure Limited allotted 5,000 non-convertible debentures with a face value of Rs 1,00,000 each on October 14, 2025, raising Rs 50 crores through private placement. The unsecured, listed, redeemable debentures carry an 8.40% annual coupon rate and have a 3-year tenure, maturing on October 13, 2028. The NCDs will be listed on the National Stock Exchange of India Limited. Interest payments are scheduled for October 14, 2026, October 14, 2027, and October 13, 2028, with principal redemption at par on the maturity date. The debentures received a CRISIL AA- rating with a stable outlook.",
            "Sentiment": "positive",
            "PublishDate": 1760451005101,
            "Source": "corporate_action"
        },
        {
            "Title": "Afcons Infrastructure Redeems Rs. 25 Crore Commercial Paper on Maturity",
            "Summary": "Afcons Infrastructure Limited has fully redeemed its Commercial Paper worth Rs. 25 crores on the maturity date of October 13, 2025. The Commercial Paper with ISIN INE101I14EN9 was originally issued on July 14, 2025, representing a three-month tenure. The company completed the redemption as scheduled on the maturity date.",
            "Sentiment": "neutral",
            "PublishDate": 1760347964512,
            "Source": "corporate_action"
        },
        {
            "Title": "Afcons Infrastructure Seeks Shareholder Approval for Director Appointments and Employee Stock Option Plan",
            "Summary": "Afcons Infrastructure Limited has issued a postal ballot notice seeking shareholder approval for eight special business matters. The company proposes to appoint Pallon Shapoorji Mistry and Firoz Cyrus Mistry as Non-Executive and Non-Independent Directors, and Santosh Balachandran Nayar as an Independent Director. The notice also includes approval for the 'Afcons Infrastructure Limited – Employee Stock Option Plan 2025' covering up to 1,83,89,232 options, representing 5% of outstanding share capital. The plan extends to employees of subsidiary and associate companies. Additionally, the company seeks approval for variation in remuneration terms for Executive Chairman Subramanian Krishnamurthy and Managing Director Srinivasan Paramasivan to include ESOP benefits for their remaining tenure until June 30, 2026. The remote e-voting period runs from October 12, 2025 to November 10, 2025, with results to be declared by November 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760099652784,
            "Source": "corporate_action"
        },
        {
            "Title": "Afcons Infrastructure Secures ₹576 Crore Contract, Receives MCA Inspection Letter",
            "Summary": "Shapoorji Pallonji Group company Afcons Infrastructure secured a civil and allied infrastructure works contract worth ₹576 crore including GST. The company received an inspection letter from the Ministry of Corporate Affairs' Regional Director for the western region under Section 206(5) of the Companies Act, 2013. The inspection extends the review period to FY2024-25 from the previous FY2018-19 to FY2022-23 timeframe, covering additional projects and seeking clarifications on alleged non-compliances and accounting matters. Afcons stated it believes its legal position is strong and will defend the matter appropriately. The company was previously declared lowest bidder for a €677 million railway project in Croatia involving track reconstruction and electrification work with a 72-month completion timeline. Afcons shares closed 1.31% higher at ₹465.00 on NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1760007758394,
            "Source": "stock"
        },
        {
            "Title": "AFCONS Infrastructure Secures ₹576 Crore Contract for Civil Infrastructure Projects",
            "Summary": "AFCONS Infrastructure has been awarded a contract valued at ₹576 crores for civil and related infrastructure projects. The contract value includes GST.",
            "Sentiment": "positive",
            "PublishDate": 1760004851209,
            "Source": "order&deals"
        },
        {
            "Title": "Afcons Infrastructure Appoints Two New Directors and Approves ESOP Plan",
            "Summary": "Afcons Infrastructure Limited appointed Santosh Balachandran Nayar as Additional Director (Non-Executive & Independent) and Firoz Cyrus Mistry as Additional Director (Non-Executive & Non-Independent), both effective from September 25, 2025. Nayar brings over 40 years of experience in project finance and banking, having held senior positions at State Bank of India, IFCI Limited, and India Infrastructure Finance Company Limited. Mistry, aged 29 and a promoter of the SP Group, is the son of Late Cyrus Mistry and holds a liberal arts degree from Yale University. The company also categorized Udai Veer Singh as Senior Management Personnel in his role as Executive Vice President (Operations). Additionally, the board approved the Afcons Infrastructure Limited Employee Stock Option Plan 2025, creating a pool of 1,83,89,232 stock options exercisable into equity shares of Rs. 10 face value each. The company also approved issuance of 5,000 non-convertible debentures worth Rs. 50 crores on a private placement basis with 3-year tenure, proposed to be listed on NSE. Executive Chairman Krishnamurthy Subramanian noted that both appointments follow Pallon S Mistry joining the board last month, signaling next-generation family involvement in Afcons.",
            "Sentiment": "positive",
            "PublishDate": 1758788628631,
            "Source": "corporate_governance"
        },
        {
            "Title": "Afcons Infrastructure Schedules Board Meeting to Consider Employee Stock Option Plan and NCDs Issuance",
            "Summary": "Afcons Infrastructure Limited has scheduled a Board of Directors meeting for September 25, 2025, to consider two key proposals. The board will review the adoption of the Afcons Infrastructure Limited Employee Stock Option Plan 2025, which requires approval from the Nomination and Remuneration Committee and shareholders. Additionally, the board will consider issuing Rated Unsecured Listed Redeemable Non-Convertible Debentures on a private placement basis. The company has notified both BSE and NSE about the scheduled meeting.",
            "Sentiment": "positive",
            "PublishDate": 1758558501362,
            "Source": "corporate_action"
        },
        {
            "Title": "Afcons Infrastructure Announces Leadership Reshuffle, Elevates Shapoorji Mistry to Chairman Emeritus",
            "Summary": "Afcons Infrastructure announced a leadership reshuffle, transitioning Shapoorji Mistry from Chairman to Chairman Emeritus after 25 years on the board, including 13 years as Chairman. Krishnamurthy Subramanian, previously Executive Vice-Chairman, has been appointed as Executive Chairman. Subramanian brings 22 years of experience with Afcons and previously served as Managing Director for 15 years. The company also inducted Pallon S Mistry to its board of directors, representing the next generation of the Shapoorji Pallonji family. Under Shapoorji Mistry's leadership from FY2012 to FY2025, Afcons' turnover grew nearly fivefold to ₹13,023 crore, with EBITDA rising at over 14.5% CAGR and the order book expanding more than fivefold to ₹36,869 crore. The company has executed major projects including the Chenab Railway Bridge, Atal Tunnel, and India's first underwater tunnel for Kolkata Metro. Afcons shares were trading at ₹418.70, down 0.81%.",
            "Sentiment": "neutral",
            "PublishDate": 1756453874985,
            "Source": "corporate_governance"
        },
        {
            "Title": "Afcons Infrastructure Issues Rs. 25 Crore Commercial Papers, Reports 6.4% Revenue Growth in Q1 FY26",
            "Summary": "Afcons Infrastructure Limited issued Commercial Papers worth Rs. 25 crores on August 13, 2025, with a 91-day tenure and 7.80% interest rate, proposed to be listed on NSE. The company reported quarterly results showing total income of Rs. 3,419 crores compared to Rs. 3,213 crores in the previous year, representing 6.4% growth. EBITDA improved to Rs. 445 crores (13% margin) from Rs. 372 crores (11.6% margin), while profit after tax increased to Rs. 137 crores (4% margin) from Rs. 92 crores (2.9% margin). The company maintains an unexecuted order book of Rs. 35,311 crores and secured new orders worth Rs. 1,100 crores during the quarter. Management confirmed annual turnover growth guidance of 20-25% and expects to achieve order procurement targets. The company holds L1 position worth Rs. 21,556 crores, including three new projects in Croatia, marking entry into European markets.",
            "Sentiment": "positive",
            "PublishDate": 1755096227811,
            "Source": "corporate_action"
        },
        {
            "Title": "AFCONS Infrastructure Targets Growth With ₹43,191 Crore Order Book",
            "Summary": "AFCONS Infrastructure aims for strong growth backed by an order book worth ₹43,191 crore. The company is expanding into metro, high-speed rail, and international projects. AFCONS emphasizes efficiency, technology, and sustainable practices to maintain top margins and strengthen its global presence.",
            "Sentiment": "positive",
            "PublishDate": 1754666616847,
            "Source": "stock"
        },
        {
            "Title": "Afcons Infrastructure Uploads Q1 FY26 Earnings Call Audio Recording",
            "Summary": "Afcons Infrastructure Limited has uploaded the audio recording of their Q1 FY26 earnings conference call to their website. The earnings call was held on August 8, 2025, at 5:30 p.m. IST. The company made the audio recording available through a direct link on their website and notified the BSE and National Stock Exchange of India about this upload.",
            "Sentiment": "neutral",
            "PublishDate": 1754666314992,
            "Source": "earnings"
        },
        {
            "Title": "Afcons Infrastructure Submits Monitoring Report on IPO Proceeds Utilization for Quarter Ended June 30, 2025",
            "Summary": "Afcons Infrastructure Limited submitted a monitoring agency report on the utilization of proceeds from its Initial Public Offer for the quarter ended June 30, 2025. The report was prepared by Crisil Ratings Limited as the monitoring agency. The company raised Rs 12,500 million through its IPO conducted from October 25-29, 2024, with net proceeds of Rs 12,146.37 million after issue expenses of Rs 353.63 million. The proceeds were allocated for four main purposes: Rs 800 million for capital expenditure towards construction equipment purchase, Rs 3,200 million for long-term working capital requirements, Rs 6,000 million for prepayment of outstanding borrowings, and Rs 2,146.37 million for general corporate purposes. As of June 30, 2025, Rs 11,977.53 million has been utilized with Rs 168.84 million remaining unutilized. The monitoring agency reported no deviations from the objects stated in the offer document and confirmed that all utilization was in line with the prospectus. The unutilized funds of Rs 187.95 million are deployed in fixed deposits with IndusInd Bank and monitoring accounts.",
            "Sentiment": "neutral",
            "PublishDate": 1754665582247,
            "Source": "corporate_action"
        },
        {
            "Title": "AFCONS Infrastructure Reports Higher Q1 EBITDA and Margin Growth",
            "Summary": "AFCONS Infrastructure reported Q1 EBITDA of 4.34 billion rupees compared to 3.67 billion rupees in the same period last year. The company's EBITDA margin improved to 12.91% from 11.73% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754650095509,
            "Source": "earnings"
        },
        {
            "Title": "Afcons Infrastructure Schedules Q1 FY26 Earnings Conference Call for August 8, 2025",
            "Summary": "Afcons Infrastructure Limited will host a Q1 FY26 earnings conference call on Friday, August 8, 2025, at 5:30 PM IST to discuss the company's unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The call will be led by DAM Capital Advisors Ltd, with participation from key management including Executive Vice Chairman Subramanian Krishnamurthy, Managing Director Srinivasan Paramasivan, Chief Financial Officer Ramesh Jha, and Head Corporate Strategy Hitesh Singh. Dial-in access will be available through universal numbers, with international timing accommodations for Hong Kong, Singapore, UK, and USA markets.",
            "Sentiment": "neutral",
            "PublishDate": 1754395079302,
            "Source": "earnings"
        },
        {
            "Title": "Afcons Infrastructure Raises Rs. 50 Crores Through Commercial Paper Issuance",
            "Summary": "Afcons Infrastructure Limited issued Commercial Papers worth Rs. 50 crores through private placement on August 5, 2025. The unsecured instruments carry an interest rate of 8.30% per annum with a tenure of 365 days, maturing on August 5, 2026. The commercial papers were issued to Bangiya Gramin Vikash Bank and carry a Crisil A1+ credit rating. The interest payment is structured upfront, while the principal amount will be paid on maturity. The commercial papers will not be listed on any stock exchange.",
            "Sentiment": "neutral",
            "PublishDate": 1754393755823,
            "Source": "corporate_action"
        },
        {
            "Title": "Afcons Infrastructure Re-appoints Giridhar Rajagopalan as Deputy Managing Director for Two Years",
            "Summary": "Afcons Infrastructure Limited shareholders approved the re-appointment of Giridhar Rajagopalan as Whole-Time Director designated as Deputy Managing Director for a two-year term from July 1, 2025 to June 30, 2027 at the company's 49th Annual General Meeting held on July 25, 2025. Rajagopalan, who holds DIN 02391515, is a Civil Engineering graduate with over 46 years of experience and heads the company's technical functions including Planning, Design, Methods, Quality, Safety, and Technical Training. Under his leadership, Afcons became the first Indian Infrastructure company to win the Global, Asia Pacific and India MAKE Award for two consecutive years (2016 & 2017) and has received multiple MIKE awards from 2018 to 2024. He is not related to any other Directors of the company and is not debarred from holding directorial positions.",
            "Sentiment": "positive",
            "PublishDate": 1753467430965,
            "Source": "corporate_governance"
        },
        {
            "Title": "Afcons Infrastructure Withdraws Credit Ratings and Wins EUR 677 Million Croatia Railway Project",
            "Summary": "Afcons Infrastructure Limited has withdrawn credit ratings for its bank facilities by ICRA Limited following the company's request and receipt of no-objection certificates from most bankers, except Bank of Baroda. The company has requested withdrawal of ratings from Bank of Baroda as well, pending completion of documentation. Separately, Afcons has been declared the Lowest Bidder (L1) for a railway line rehabilitation and construction project in Croatia by HŽ INFRASTRUKTURA d.o.o. The project involves reconstruction of existing track and construction of a second track on the Dugo Selo - Novska railway line, including overhead electrification and signalling works. The contract is valued at EUR 677,071,899.78 (approximately Rs. 6,800 crores) with a 72-month completion period.",
            "Sentiment": "positive",
            "PublishDate": 1753161095891,
            "Source": "stock"
        },
        {
            "Title": "Afcons Infrastructure Shares Rise 4% After Winning €677 Million Croatia Railway Contract",
            "Summary": "Afcons Infrastructure shares gained 3.7% to Rs 434.45 after the Shapoorji Pallonji group company emerged as the lowest bidder for a railway project in Croatia. The contract, awarded by HŽ Infrastruktura d.o.o., involves reconstructing existing track and building a second line on the Dugo Selo–Novska route, including electrification and signalling work. The project is valued at €677 million (approximately Rs 6,800 crore) excluding VAT, with a 72-month completion timeline. Despite the recent gain, the stock has declined 17% over six months and 22% year-to-date. Analysts maintain a 'Strong Buy' rating with an average target price of Rs 543, indicating potential 30% upside from current levels.",
            "Sentiment": "positive",
            "PublishDate": 1753159084390,
            "Source": "stock"
        },
        {
            "Title": "Afcons Infrastructure Emerges as Lowest Bidder for ₹6,800 Crore Croatia Railway Project",
            "Summary": "Afcons Infrastructure has become the lowest bidder for a railway project in Croatia valued at ₹6,800 crore. The project represents a significant international infrastructure opportunity for the company.",
            "Sentiment": "positive",
            "PublishDate": 1753100779922,
            "Source": "order&deals"
        },
        {
            "Title": "Afcons Infrastructure Lowest Bidder for €455 Million Croatian Road Projects",
            "Summary": "Afcons Infrastructure has emerged as the lowest bidder for road projects in Croatia valued at €455 million (approximately 4535 crore rupees). The projects are located in Croatia, but no further details about the specific nature of the road projects or the bidding process are provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752801148000,
            "Source": "default"
        },
        {
            "Title": "Afcons Infrastructure Lowest Bidder for Croatian Road Project",
            "Summary": "Afcons Infrastructure has become the lowest bidder for a road project in Croatia valued at €455 million. The project involves infrastructure development in Croatia.",
            "Sentiment": "positive",
            "PublishDate": 1752760481000,
            "Source": "default"
        },
        {
            "Title": "AFCONS Infrastructure Issues 550 Million Rupees in Commercial Papers",
            "Summary": "AFCONS Infrastructure has issued commercial papers worth 550 million rupees. No further details about the terms, purpose, or duration of these commercial papers were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1752239031000,
            "Source": "default"
        },
        {
            "Title": "AFCONS Infrastructure Secures New Contract Worth 175 Crore Rupees",
            "Summary": "AFCONS Infrastructure has been awarded a new contract valued at 175 crore rupees. The news briefly mentions the company securing this contract but provides no further details about the nature of the project, its location, or the timeline.",
            "Sentiment": "positive",
            "PublishDate": 1751431666000,
            "Source": "default"
        }
    ]
}