{
    "Symbol": "AFFLE",
    "ISIN": "INE00WC01027",
    "News": [
        {
            "Title": "Affle 3i Grants 1,37,080 Stock Options to Employees",
            "Summary": "Affle 3i Limited granted 1,37,080 stock options to eligible employees under ESOP Scheme 2021 with effective grant date of January 28, 2026, covering equity shares of face value Rs. 2 each.",
            "Sentiment": "positive",
            "PublishDate": 1769602928334,
            "Source": "co_actions_results"
        },
        {
            "Title": "Affle 3i Schedules Q3FY26 Earnings Call for Feb 2",
            "Summary": "Affle 3i Limited announces earnings conference call on February 02, 2026 at 10:00 AM IST to discuss Q3 and nine months results ended December 31, 2025, with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1769578572434,
            "Source": "co_actions_results"
        },
        {
            "Title": "Affle 3i Allots 44,250 Shares Under ESOP Scheme",
            "Summary": "Affle 3i Limited allotted 44,250 equity shares worth ₹88,500 to employees' welfare trust under ESOP scheme on January 12, 2026, increasing paid-up capital to ₹28.15 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1768197968133,
            "Source": "co_actions_results"
        },
        {
            "Title": "Affle 3I Appoints Sameer Sondhi as CSO & North America CEO",
            "Summary": "Affle 3I Limited announces the appointment of Sameer Sondhi as Chief Strategic Investments Officer and CEO for North America operations, marking a key leadership addition to the company's strategic team.",
            "Sentiment": "positive",
            "PublishDate": 1767358992650,
            "Source": "stocks"
        },
        {
            "Title": "Affle 3i Appoints Sameer Sondhi as CEO North America",
            "Summary": "Affle 3i Limited has appointed Mr. Sameer Sondhi as Chief Executive Officer, North America and Chief Strategic Investments Officer, Developed Markets, effective January 2, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767332831566,
            "Source": "stocks"
        },
        {
            "Title": "Affle 3i Senior Management Change Announced",
            "Summary": "Affle 3i Limited announces organizational restructuring as Javier Fernandez, People Director, ceases to be designated as Senior Management Personnel effective December 15, 2025, following change in reporting structure.",
            "Sentiment": "neutral",
            "PublishDate": 1765799973295,
            "Source": "stocks"
        },
        {
            "Title": "Affle3i Limited Grants 84,212 Stock Options to Employees Under ESOP Scheme",
            "Summary": "Affle3i Limited (formerly Affle India Limited) granted 84,212 stock options to eligible employees under its Employee Stock Option Scheme-2021. The options cover 84,212 equity shares with a face value of Rs. 2 each. The exercise price will be based on the closing market price on the National Stock Exchange on November 11, 2025. The options will vest in four equal tranches of 25% each at 12, 24, 36, and 48 months from the grant date of November 12, 2025. Employees will have one year from the vesting date to exercise their options. The scheme complies with SEBI regulations for share-based employee benefits.",
            "Sentiment": "positive",
            "PublishDate": 1762954803905,
            "Source": "corporate_action"
        },
        {
            "Title": "Affle Reports 19.1% Revenue Growth to INR 6,467 Million in Q2 with Strong Margin Expansion",
            "Summary": "Affle3i Limited delivered revenue of INR 6,467 million in the second quarter, marking a 19.1% year-over-year growth. The company achieved EBITDA of INR 1,461 million with 28.9% growth and 172 basis points margin expansion. PAT reached INR 1,105 million, growing 20.1% year-over-year. The CPCU business drove 109 million conversions at INR 58.0 per conversion, generating revenue of INR 6,319 million. India and Global Emerging Markets contributed 73.9% to revenue with 20.0% growth, while Developed Markets grew 16.8% contributing 26.1%. The company launched Niko, an AI agenti capability for iOS ecosystem automation. Management noted impact from Real Money Gaming issues in India but expects this to be offset by early festive season demand. The company was granted two new US patents, expanding its IP portfolio to 16 patents. Sequential margin expansion continued for the sixth consecutive quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762531705735,
            "Source": "earnings"
        },
        {
            "Title": "Affle 3i Limited Reports No Material Deviation in Rs 737.43 Crore Preferential Issue Fund Utilization",
            "Summary": "Affle 3i Limited submitted its monitoring agency report for the quarter ended September 30, 2025, regarding the utilization of proceeds from its preferential issue. ICRA Limited, the monitoring agency, reported no material deviation from the stated objects of the issue. The company raised Rs 749.02 crore through the issuance of 69 lakh equity shares at Rs 1,085.54 per share. Net proceeds were revised to Rs 737.43 crore due to higher issue-related expenses. During the quarter, the company utilized Rs 238.32 crore across various objectives: Rs 37.58 crore for technology development, Rs 75 crore for repaying subsidiary liabilities, and Rs 125.74 crore for general corporate purposes including working capital requirements and loan repayment. Unutilized funds of Rs 499.11 crore are deployed in fixed deposits and mutual funds across various banks. All projects remain on schedule with completion targeted for March 2027.",
            "Sentiment": "neutral",
            "PublishDate": 1762489522101,
            "Source": "corporate_action"
        },
        {
            "Title": "Affle3i Limited Reports Strong Q2 Growth with Revenue Rising 25% to ₹6,467 Crores",
            "Summary": "Affle3i Limited announced its quarterly results for the second quarter ended September 30, 2025. The company reported consolidated revenue from operations of ₹6,467.18 million, compared to ₹6,207.40 million in the previous quarter. For the half-year period, consolidated revenue reached ₹12,674.58 million versus ₹10,623.85 million in the same period last year. Consolidated profit after tax for the quarter was ₹1,105.01 million, with half-year profit at ₹2,160.13 million compared to ₹1,748.81 million in the previous year. On a standalone basis, the company posted quarterly revenue of ₹2,198.30 million and profit after tax of ₹300.06 million. The Board of Directors approved these unaudited financial results in their meeting held on November 1, 2025. The company's earnings per share for the quarter stood at ₹7.87 on a consolidated basis and ₹2.14 on a standalone basis.",
            "Sentiment": "positive",
            "PublishDate": 1761992426221,
            "Source": "earnings"
        },
        {
            "Title": "Affle 3i Limited Announces Senior Management Change for VP Global Sales",
            "Summary": "Affle 3i Limited announced that Ms. Gozde Alemli, VP Global Sales & Business Development, will cease to be designated as Senior Management effective October 28, 2025. The change occurs because she will no longer directly report to the CEO. The company disclosed this information under regulatory requirements for changes in senior management personnel.",
            "Sentiment": "neutral",
            "PublishDate": 1761656071008,
            "Source": "corporate_governance"
        },
        {
            "Title": "Affle 3i Limited Allots 37,000 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Affle 3i Limited has allotted 37,000 equity shares with a face value of Rs. 2 each to Affle (India) Limited Employees' Welfare Trust under the Employee Stock Option Scheme 2021. Following this allotment, the company's issued, subscribed and paid-up share capital has increased to Rs. 281,354,432, divided into 140,677,216 equity shares of Rs. 2 each. The company is applying for listing of these shares on NSE and BSE. The company has clarified that this share allotment is not material in nature to the company.",
            "Sentiment": "neutral",
            "PublishDate": 1761376022639,
            "Source": "corporate_action"
        },
        {
            "Title": "Affle 3i Receives 16th US Patent for AI-Based Fraud Detection Technology",
            "Summary": "Affle 3i has been granted its 16th US patent for an AI-based fraud detection system. This patent represents the company's continued innovation in artificial intelligence technology for fraud prevention applications.",
            "Sentiment": "positive",
            "PublishDate": 1757657970307,
            "Source": "stock"
        },
        {
            "Title": "Affle 3I Secures Global Data Privacy and Information Security Certifications",
            "Summary": "Affle 3I has obtained global certifications for data privacy and information security. The certifications demonstrate the company's compliance with international standards for protecting data and securing information systems.",
            "Sentiment": "positive",
            "PublishDate": 1755780357377,
            "Source": "stock"
        },
        {
            "Title": "Affle 3i Reports Record Q1 Results with 19.5% Revenue Growth and 239 bps EBITDA Margin Expansion",
            "Summary": "Affle 3i Limited delivered its highest-ever quarterly performance with revenue of INR 6,207 million, representing 19.5% year-over-year growth. The company achieved record EBITDA of INR 1,397 million with 33.7% growth and 239 basis points margin expansion to 22.5%. PAT reached INR 1,055 million, up 21.8% year-over-year. The CPCU business drove 107 million conversions at INR 58.0 per conversion, generating CPCU revenue of INR 6,200 million. India & Global Emerging Markets contributed 72.3% of revenue with 18.1% growth, while Developed Markets grew 23.3% and contributed 27.7%. The company integrated Opticks AI into its consumer platform stack and became an Apple-certified partner. Management targets 20% organic revenue growth for FY2026 and medium-term EBITDA margin goal of 23%. The company maintains its 10X decadal growth vision through organic expansion and selective acquisitions.",
            "Sentiment": "positive",
            "PublishDate": 1754315650607,
            "Source": "earnings"
        },
        {
            "Title": "Affle Receives 15th US Patent for User Visibility Count Encoding Technology",
            "Summary": "Affle has been granted a US patent for a method to encode user visibility count, which tracks advertisement exposure frequency while reducing memory and computing requirements. The technology uses probabilistic encoding and algorithmic hashing functions to estimate advertisement exposure across connected devices, particularly effective for Connected TV where direct user interaction is limited. It also supports digital ecosystems including IoT, Virtual Reality and Augmented Reality. The innovation enhances targeting accuracy, campaign performance and the company's CPCU model by enabling precise evaluation of user awareness and optimizing media spending. This represents Affle's 15th granted patent, adding to a portfolio of 36 unique patent applications. The patent was invented by eight team members including Anuj Khanna Sohum, Charles Yong, and others.",
            "Sentiment": "positive",
            "PublishDate": 1753881800209,
            "Source": "stock"
        },
        {
            "Title": "Affle (India) Reports Strong Q1 Growth with Net Profit Rising 21% to 1.05 Billion Rupees",
            "Summary": "Affle (India) delivered robust quarterly results with consolidated net profit increasing to 1.05 billion rupees from 866 million rupees year-over-year. Revenue grew to 6.2 billion rupees compared to 5.19 billion rupees in the same period last year. EBITDA rose to 1.4 billion rupees from 1.04 billion rupees year-over-year. The company's margin improved to 22.51% from 20.12% in the previous year period, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1753662290014,
            "Source": "earnings"
        },
        {
            "Title": "Affle 3i Limited Reports Strong Q1 FY2026 Results with 19.5% Revenue Growth",
            "Summary": "Affle 3i Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of ₹6,207.40 million, up from ₹5,195.03 million in the same quarter last year, representing a 19.5% year-over-year growth. Consolidated profit after tax increased to ₹1,055.00 million compared to ₹865.90 million in Q1 FY2025, marking a 21.8% growth. On a standalone basis, revenue from operations grew to ₹1,989.56 million from ₹1,631.46 million year-over-year, while standalone profit after tax reached ₹297.00 million versus ₹281.68 million in the previous year. The company's earnings per share on a consolidated basis improved to ₹7.52 from ₹6.18 in the corresponding quarter of the previous year. The board meeting was held on July 26, 2025, and the results were reviewed by Walker Chandiok & Co LLP.",
            "Sentiment": "positive",
            "PublishDate": 1753524712470,
            "Source": "earnings"
        },
        {
            "Title": "Affle 3i Limited's VP Global Strategic Partnerships Vishal Soni Steps Down from Senior Management Role",
            "Summary": "Affle 3i Limited announced that Vishal Soni, VP Global Strategic Partnerships, ceased to be designated as Senior Management effective July 24, 2025. Soni will now focus on specific projects and initiatives for the company and will no longer report directly to the CEO. This represents a change in organizational structure rather than a departure from the company.",
            "Sentiment": "neutral",
            "PublishDate": 1753441775281,
            "Source": "corporate_governance"
        },
        {
            "Title": "Affle Receives 14th Patent in India for AI-Powered Ad Fraud Detection",
            "Summary": "Affle has been granted its 14th patent in India for an artificial intelligence-powered ad fraud detection system. The technology focuses on real-time detection of fraudulent digital ad traffic using machine learning techniques.",
            "Sentiment": "positive",
            "PublishDate": 1751644136000,
            "Source": "default"
        },
        {
            "Title": "Affle (India) Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 102,353 shares of Affle (India) Ltd. took place on the National Stock Exchange (NSE) at a price of Rs. 1940.40 per share. The total value of the transaction was Rs. 19.86 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1750830263000,
            "Source": "block_details"
        },
        {
            "Title": "Affle to Evaluate Investment in Bobble on June 16, 2025",
            "Summary": "Affle has scheduled a meeting on June 16, 2025, to assess the progress of its investment in Talent Unlimited Online Services Private Limited, also known as 'Bobble.' The company will review the performance and status of this investment during the meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1749465372000,
            "Source": "default"
        },
        {
            "Title": "Affle 3i: Q4 Profit Jumps 17.8%, Revenue Up 18.9%",
            "Summary": "Affle 3i reported a 17.8% increase in Q4 net profit to Rs 103 crore. Revenue rose 18.9% to Rs 602.2 crore. Ebitda grew 1.7% to Rs 107 crore with margin improving to 17.8%. Share price increased 3.86% following the results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1747021880000,
            "Source": "earnings"
        },
        {
            "Title": "Affle India Reports Strong Q4 EBITDA Growth",
            "Summary": "Affle India's Q4 EBITDA increased to 1.3 billion rupees from 980 million rupees year-over-year. The company's EBITDA margin also improved, rising to 22.26% from 19.36% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1746872272000,
            "Source": "result"
        },
        {
            "Title": "Affle Reports Strong Q4 Financial Results",
            "Summary": "Affle, a technology company, has reported its Q4 financial results. The consolidated net profit increased to 1.03 billion rupees, up from 875 million rupees year-over-year. Revenue also saw growth, reaching 6 billion rupees compared to 5.1 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1746872066000,
            "Source": "result"
        },
        {
            "Title": "Affle India Granted Two Patents in India",
            "Summary": "Affle India has been granted two patents in India, which were previously granted to the company in the United States. This development strengthens the company's overall intellectual property portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1746854188000,
            "Source": "default"
        },
        {
            "Title": "Affle to Consider Q4 Results on May 10",
            "Summary": "Affle (India) Limited has announced that it will consider its fourth quarter financial results on May 10. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746445354000,
            "Source": "default"
        },
        {
            "Title": "Indian Government Proposes Removal of Equalisation Levy on Online Advertising",
            "Summary": "The Indian government has proposed to eliminate the 6% equalisation levy on online advertising, effective from April 1st. This change is included in the Finance Bill and will directly impact companies like Affle (India) that operate in the digital advertising space.",
            "Sentiment": "positive",
            "PublishDate": 1742876633000,
            "Source": "corporate_action"
        },
        {
            "Title": "Affle Reports Strong Q3 Financial Results",
            "Summary": "Affle, a technology company, has announced its Q3 financial results. The company's consolidated net profit increased to 1 billion rupees, up from 768 million rupees in the same quarter last year. Revenue also saw significant growth, reaching 6.1 billion rupees compared to 4.99 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739146213000,
            "Source": "earnings"
        },
        {
            "Title": "Affle Reports Strong Q3 EBITDA Growth",
            "Summary": "Affle, a technology company, has reported significant year-over-year growth in its third-quarter financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 1.31 billion rupees, up from 967 million rupees in the same quarter of the previous year. Additionally, Affle's EBITDA margin improved to 21.84% from 19.39% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739012033000,
            "Source": "earnings"
        },
        {
            "Title": "Affle Reports Strong Q3 Financial Results",
            "Summary": "Affle, a technology company, has announced its Q3 financial results. The company's consolidated net profit increased to 1 billion rupees, up from 768 million rupees in the same quarter last year. Revenue also saw significant growth, reaching 6.1 billion rupees compared to 4.99 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739012028000,
            "Source": "earnings"
        },
        {
            "Title": "Affle (India) Secures Patent for Conversational Agent Switching System",
            "Summary": "Affle (India) has announced that it has been granted a patent for a system that allows switching between conversational agents. This technology could potentially enhance the company's capabilities in AI-driven customer interactions and digital marketing solutions.",
            "Sentiment": "positive",
            "PublishDate": 1738670112000,
            "Source": "corporate_action"
        },
        {
            "Title": "Affle India Granted New Patent for Advertisement Fraud Detection System",
            "Summary": "Affle India has been granted a new patent in India for a system that utilizes advertisement fraud data. The patent specifically covers a system designed to use data for blacklisting fraudulent entities in the advertising space. This development enhances Affle's technological capabilities in combating ad fraud and improving the integrity of digital advertising.",
            "Sentiment": "positive",
            "PublishDate": 1738236023000,
            "Source": "corporate_action"
        }
    ]
}