{
    "Symbol": "AFFORDABLE",
    "ISIN": "INE692Z01013",
    "News": [
        {
            "Title": "Affordable Robotic Q3 FY26 Results Show Mixed Performance",
            "Summary": "Affordable Robotic & Automation reports Q3 FY26 standalone revenue of ₹1606.99 lakhs, down 53.74% YoY, with net profit at ₹36.07 lakhs versus ₹446.78 lakhs in Q3 FY25. Nine-month performance shows revenue decline.",
            "Sentiment": "negative",
            "PublishDate": 1770820210123,
            "Source": "co_actions_results"
        },
        {
            "Title": "ARAPL's Order Book Surges to Rs. 140 Crore, Up from Rs. 120 Crore in November 2024",
            "Summary": "Affordable Robotic Automation Limited announced its order book crossed Rs. 140 crore as of November 25, 2025, with 80% orders from repeat customers including Bajaj, Mahindra Group, and real estate clients like Rustomjee, scheduled for delivery before March 2026. The company executed Rs. 42.60 crore of orders in the first half of FY26 and secured 8 robots under the RaaS model valued at Rs. 7.3 crore with approximately 65% IRR, while expanding its US market presence through the Humro brand.",
            "Sentiment": "positive",
            "PublishDate": 1764235421755,
            "Source": "stock"
        },
        {
            "Title": "Affordable Robotic Automation Promoter Sells 35,000 Shares to Fund Subsidiary Investment",
            "Summary": "Promoter Milind Manohar Padole sold 35,000 equity shares (0.31% stake) of Affordable Robotic Automation Limited on September 22, 2025, reducing his holding from 29.14% to 28.83%. The sale proceeds will be provided as an interest-free loan to the company for further investment in subsidiary ARAPL RaaS Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1763438592414,
            "Source": "corporate_action"
        },
        {
            "Title": "Affordable Robotic Automation Promoter Sells 1.6 Lakh Shares",
            "Summary": "Milind Manohar Padole, promoter and Managing Director of Affordable Robotic Automation Limited, sold 160,000 equity shares on October 31, 2025. His shareholding decreased from 30.56% to 29.14% following the on-market transaction. The sale proceeds will be provided as an interest-free loan to the company, which will use the funds for further investment in its subsidiary ARAPL RaaS Private Limited. The company's total equity share capital remains at 11,246,266 shares of Rs. 10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1762404397024,
            "Source": "corporate_action"
        },
        {
            "Title": "ARAPL Subsidiary Humro Secures Rs 4.13 Crore US Order for Autonomous Mobile Robots",
            "Summary": "Affordable Robotic Automation Limited (ARAPL) announced that its subsidiary ARAPL RaaS (Humro) secured an order worth Rs 4.13 crore from a leading US-based logistics and warehouse management company. The order involves supplying six autonomous mobile robots on a two-year lease arrangement. The deal follows successful prototype trials conducted over three months at the client's facilities and marks Humro's entry into a new product category. The order opens potential for large-scale deployment of 47-50 mobile robots in each of the client's two US warehouses over the next two years. ARAPL has announced a proposed investment of USD 8-10 million in Humro, including USD 3 million personally infused by Founder Managing Director Milind Padolee as an interest-free loan with an option for equity conversion. Humro currently has four approved Make in India mobile robotics products in its portfolio and aims to accelerate expansion in the US market.",
            "Sentiment": "positive",
            "PublishDate": 1762402755282,
            "Source": "stock"
        },
        {
            "Title": "Affordable Robotic Automation Reports Profitable H1 Performance with New Orders Worth INR 4000 Lakhs",
            "Summary": "Affordable Robotic Automation Limited (ARAPL) achieved profitability in the first half of the year, driven by operational efficiency and improved contribution from core business segments. The company secured new orders worth INR 4000 lakhs, representing 40% of all new orders booked in H1-FY2026. The car parking automation segment strengthened through partnerships with new corporate clients. ARAPL's board approved a new investment of up to INR 8000 lakhs in subsidiary ARAPL RaaS Pvt. Ltd., with promoter Milind Padolee providing an interest-free loan of INR 2600 lakhs convertible to equity or warrants. The subsidiary rebranded its product line as Humro, derived from Human Robot. The company shipped 20 robots to the USA with integration of the first 6 units initiated in October 2025. ARAPL continues investments in deep-tech innovation including in-house vehicle and motor controllers, autonomy kits, digital twins, and AI-driven layers for route optimization.",
            "Sentiment": "positive",
            "PublishDate": 1761989478758,
            "Source": "earnings"
        },
        {
            "Title": "Affordable Robotic Automation Promoter Sells 2.45% Stake to Fund Subsidiary Investment",
            "Summary": "Milind Manohar Padole, promoter and Managing Director of Affordable Robotic Automation Limited, sold 275,000 equity shares representing 2.45% of the company's total share capital on October 28, 2025. The transaction was conducted through on-market sales, reducing his shareholding from 33.01% to 30.56%. Padole stated that the proceeds from the share sale will be provided as an interest-free loan to Affordable Robotic Automation Limited, which will use the funds for further investment in its subsidiary company ARAPL RaaS Private Limited. The company has 11,246,266 equity shares of Rs. 10 each outstanding, and the sale was disclosed under SEBI regulations for substantial acquisition of shares and insider trading.",
            "Sentiment": "neutral",
            "PublishDate": 1761897546856,
            "Source": "corporate_action"
        },
        {
            "Title": "ARAPL Reports Strong Q2 Results with 37% Revenue Growth and Secures First U.S. Order for Atlas AC2000 Forklift",
            "Summary": "Affordable Robotic & Automation Limited (ARAPL) announced quarterly results with net revenue reaching ₹2,575.87 lakhs, showing 37% quarter-on-quarter growth. EBITDA turned positive at ₹596.32 lakhs compared to negative ₹201.29 lakhs in the previous quarter, representing 396% growth. Profit After Tax stood at ₹418.54 lakhs, up 216% quarter-on-quarter. The company secured its first order for Atlas AC2000 autonomous truck loading forklift from a U.S. logistics company, valued at ₹3.6 crore for two robots on a three-year lease. This opens potential for scaled deployment of 15-16 robots per site across 15 U.S. warehouses over the next two years. ARAPL RaaS has rebranded its product line under the name Humro. The company operates from 5 plants in Pune with 400+ engineers and technologists in India and 7 team members in the USA, with facilities in North Carolina and California.",
            "Sentiment": "positive",
            "PublishDate": 1760106584648,
            "Source": "earnings"
        },
        {
            "Title": "Affordable Robotic & Automation Limited Approves Quarterly Financial Results for September 2025",
            "Summary": "Affordable Robotic & Automation Limited's board of directors approved the company's standalone and consolidated unaudited financial results for the quarter ended September 30, 2025, during a meeting held on October 10, 2025. The board meeting commenced at 4:30 PM IST and concluded at 6:00 PM IST. The company submitted the financial results along with a limited review report from statutory auditors M/s. Vijay Moondra & Co. to BSE and NSE exchanges. The consolidated results include subsidiaries ARAPL RaaS Private Limited, ARAPL RaaS International LLC, and Masterji.AI Private Limited. The auditors found no material misstatements in the financial results and confirmed compliance with applicable accounting standards and SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1760104347731,
            "Source": "earnings"
        },
        {
            "Title": "ARAPL Subsidiary Secures First US Order Worth Rs 3.6 Crore for Autonomous Truck Loading Robot",
            "Summary": "Affordable Robotic & Automation Limited announced that its subsidiary ARAPL RaaS (Humro) secured its first order from a US-based logistics company for two Atlas AC2000 autonomous truck loading-unloading robots. The order is valued at Rs 3.6 crore under a three-year lease arrangement. The robots feature LiDAR-based navigation and real-time obstacle detection for autonomous truck loading and unloading operations. The order followed successful prototype trials over three months at the client's facilities. The US client operates 15 warehouses where 15-16 mobile robots could potentially be deployed over the next two years. ARAPL announced a proposed USD 8-10 million investment into Humro, including USD 3 million from founder Milind Padole. Humro announced a 10% price adjustment from December 2025 due to new US tariffs but stated its products remain 15-20% more cost-effective than competitors.",
            "Sentiment": "positive",
            "PublishDate": 1759301881255,
            "Source": "stock"
        },
        {
            "Title": "Affordable Robotic & Automation Unit Secures First US Order for Autonomous Truck Loading Robot",
            "Summary": "Affordable Robotic & Automation announced that its unit has received its first order from the United States for an autonomous truck loading and unloading robot. This marks the company's initial entry into the US market for this specific robotic automation technology.",
            "Sentiment": "positive",
            "PublishDate": 1759300981527,
            "Source": "stock"
        },
        {
            "Title": "Affordable Robotic & Automation Promoter Milind Padole Sells Equity Shares",
            "Summary": "Affordable Robotic & Automation Limited disclosed that promoter Mr. Milind Manohar Padole has sold equity shares in the company. The disclosure was made under SEBI Substantial Acquisition of Shares and Takeover Regulations and was communicated to BSE and NSE exchanges. The company is listed on BSE with scrip code 541402 and on NSE with symbol AFFORDABLE.",
            "Sentiment": "neutral",
            "PublishDate": 1759235264741,
            "Source": "corporate_action"
        },
        {
            "Title": "Affordable Robotic & Automation Limited Promoter Sells Equity Shares",
            "Summary": "Affordable Robotic & Automation Limited disclosed that promoter Mr. Milind Manohar Padole has sold equity shares in the company. The disclosure was made under SEBI Substantial Acquisition of Shares and Takeover Regulations 2011. The company informed BSE and NSE about this transaction through a regulatory filing signed by Company Secretary Ruchika Shinde.",
            "Sentiment": "neutral",
            "PublishDate": 1758866717988,
            "Source": "corporate_action"
        },
        {
            "Title": "Affordable Robotic & Automation Promoter Milind Padole Sells Equity Shares",
            "Summary": "Affordable Robotic & Automation Limited disclosed that promoter Mr. Milind Manohar Padole has sold equity shares in the company. The company submitted a revised disclosure under Regulation 29(2) of SEBI regulations regarding this share sale transaction. Company Secretary Ruchika Shinde communicated this information to BSE and NSE on September 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758611658757,
            "Source": "corporate_action"
        },
        {
            "Title": "Affordable Robotic & Automation Limited Approves Rs. 75-85 Crore Funding Plan Including Promoter Loan and Preferential Issue",
            "Summary": "Affordable Robotic & Automation Limited's board approved multiple funding initiatives during a meeting held on September 18, 2025. The company accepted a Rs. 25 crore interest-free loan from its Promoter/Managing Director, with provisions to convert it into equity or warrants in the future. The promoter plans to fund this loan through the sale of his personal shareholding. Additionally, the board approved raising Rs. 50-60 crores through a preferential round. The combined funds will be reinvested into the company's wholly owned subsidiary, ARAPL RaaS Private Limited, as an interest-free loan that will be converted to equity during the preferential issue round, subject to regulatory approvals under Companies Act 2013, SEBI ICDR and LODR Regulations.",
            "Sentiment": "positive",
            "PublishDate": 1758207227734,
            "Source": "corporate_action"
        },
        {
            "Title": "Affordable Robotic & Automation Promoter Sells Equity Shares",
            "Summary": "Affordable Robotic & Automation Limited disclosed that promoter Mr. Milind Manohar Padole has sold equity shares in the company. The disclosure was made under Regulation 29(2) of SEBI's Substantial Acquisition of Shares and Takeovers Regulations, 2011. Company Secretary Ruchika Shinde communicated this information to BSE and NSE exchanges on September 05, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757336795200,
            "Source": "corporate_action"
        },
        {
            "Title": "Humro Implements 10% Price Adjustment to Address US Tariff Changes",
            "Summary": "Humro, a subsidiary brand of Affordable Robotic & Automation Limited, announced a comprehensive strategy to address recent tariff changes affecting US imports. The company will implement a 10% price adjustment across all products starting November to account for additional duties, which represent approximately 7% of its topline revenue. Despite the adjustment, Humro states its solutions will remain 15-20% cheaper than closest competitors. The company is implementing Complete Knockdown (CKD) and Semi Knockdown (SKD) shipment methods and partnering with local US vendors to reduce duty impact. Humro has pre-stocked robots in the US that will account for nearly 50% of sales through November. The company operates in the US warehouse automation market, which is projected to grow at 20.6% CAGR from 2025-2030, rising from $5.78 billion in 2024 to nearly $16.6 billion by 2030. Management emphasized their proof-of-concept model remains unchanged, allowing customers to deploy machines with no upfront costs.",
            "Sentiment": "neutral",
            "PublishDate": 1756292628597,
            "Source": "stock"
        },
        {
            "Title": "Affordable Robotic & Automation Reports Narrowed Losses in Q1 Results",
            "Summary": "Affordable Robotic & Automation Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue of Rs. 1,882.15 lakhs, remaining broadly stable compared to the previous year. EBITDA loss narrowed significantly by 41% to Rs. 201.29 lakhs from Rs. 339.49 lakhs in the corresponding quarter. Loss before tax improved by 24% to Rs. 360.46 lakhs from Rs. 473.73 lakhs. Employee benefits expense declined by 14% and other expenses reduced by 8%. On consolidated basis, EBITDA loss was Rs. 196.88 lakhs compared to Rs. 611.31 lakhs in the previous year. The company has shipped 15 robots to the USA with installation planned in coming months, shipped another 5 robots last month, and plans to ship additional 25 robots by November 2025. The fund-raising process is expected to close within the month. The company has rebranded ARAPL RaaS as 'Humro' while maintaining the company name as ARAPL RaaS Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1754927301144,
            "Source": "earnings"
        },
        {
            "Title": "Affordable Robotic & Automation Limited Approves Quarterly Financial Results for June 30, 2025",
            "Summary": "Affordable Robotic & Automation Limited's board of directors approved standalone and consolidated unaudited financial results for the quarter ended June 30, 2025, during a meeting held on August 11, 2025. The board meeting commenced at 5:00 PM IST and concluded at 6:30 PM IST. The company submitted the financial results along with limited review reports from statutory auditors M/s. Vijay Moondra & Co. The consolidated results include subsidiaries ARAPL RaaS Private Limited, ARAPL RaaS International LLC, and Masterji. AI Private Limited. The company has also formed ARAPL North America LLC, though no investment has been made and no transactions have occurred. The auditors found no material misstatements in the financial results and confirmed compliance with applicable accounting standards and disclosure requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1754924986613,
            "Source": "earnings"
        },
        {
            "Title": "Affordable Robotic Subsidiary Granted Patent for Smart Stock Audit System",
            "Summary": "A subsidiary of Affordable Robotic has been granted a patent by the Government of India for a system and method for smart stock audit. This patent, titled 'A System and Method for Smart Stock Audit,' suggests the company is innovating in the field of inventory management and auditing processes.",
            "Sentiment": "positive",
            "PublishDate": 1738053395000,
            "Source": "corporate_action"
        },
        {
            "Title": "Affordable Robotic Secures $15 Million Funding and $4 Million in New Orders",
            "Summary": "Affordable Robotic has approved a fund raise of $15 million USD to support its business expansion plans. Additionally, the company has successfully secured orders worth $4 million USD as part of its ongoing business operations.",
            "Sentiment": "positive",
            "PublishDate": 1733184437000,
            "Source": "corporate_action"
        },
        {
            "Title": "Affordable Robotic Secures $15M Funding and $4M in New Orders",
            "Summary": "Affordable Robotic has approved a fund raise of $15 million USD to support its business expansion plans. Additionally, the company has successfully secured orders worth $4 million USD as part of its ongoing business operations.",
            "Sentiment": "positive",
            "PublishDate": 1733137345000,
            "Source": "corporate_action"
        },
        {
            "Title": "Affordable Robotic & Automation: Stock Surges 31% in 2 Days",
            "Summary": "<p><span class='positive'>Affordable Robotic & Automation's</span> stock hit a <span class='positive'>52-week high</span> of Rs 829, <span class='positive'>surging 31%</span> in two days amid <span class='positive'>heavy trading volumes</span>. The company received <span class='positive'>in-principle approval</span> from NSE for <b>migration from SME platform to main board</b>. <span class='neutral'>Vijay Kedia</span> held <span class='neutral'>9.93% stake</span> as of March 2024.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728898825000,
            "Source": "normal_news"
        }
    ]
}