{
    "Symbol": "AFIL",
    "ISIN": "INE916Y01027",
    "News": [
        {
            "Title": "Akme Fintrade Gets CARE BBB+ Rating for ₹465 Crore",
            "Summary": "CARE Ratings assigns BBB+ stable rating to Akme Fintrade's ₹250 crore term loan and ₹200 crore NCDs, while reaffirming A3+ rating for ₹15 crore commercial paper program.",
            "Sentiment": "positive",
            "PublishDate": 1770286407339,
            "Source": "stocks"
        },
        {
            "Title": "Akme Fintrade Allots ₹30 Cr NCDs, Approves Postal Ballot",
            "Summary": "Akme Fintrade (India) Limited's board approved allotment of 30,000 NCDs worth ₹30 crores at 11.50% coupon rate with 36-month tenure and postal ballot matters on January 19, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768804191693,
            "Source": "co_actions_results"
        },
        {
            "Title": "Akme Fintrade Gets IVR BBB+ Rating Reaffirmed",
            "Summary": "Infomerics reaffirmed IVR BBB+ rating for Akme Fintrade's facilities worth ₹450 crores, citing healthy earnings profile with 52% growth in net interest income and consistent AUM expansion to ₹833.33 crores.",
            "Sentiment": "positive",
            "PublishDate": 1767965918492,
            "Source": "stocks"
        },
        {
            "Title": "Akme Fintrade Approves ₹30 Cr NCD Issuance",
            "Summary": "Akme Fintrade (India) has approved the issuance of ₹30 crores worth of senior secured non-convertible debentures through private placement, with NSE listing planned and minimum security cover of 1.10X.",
            "Sentiment": "positive",
            "PublishDate": 1767942606593,
            "Source": "co_actions_results"
        },
        {
            "Title": "Akme Fintrade Approves ₹30 Crore NCD Issuance",
            "Summary": "Akme Fintrade (India) Limited's Loan & Investment Committee approved issuance of non-convertible debentures worth up to ₹30 crores on private placement basis with 1.10x security cover.",
            "Sentiment": "neutral",
            "PublishDate": 1767941322842,
            "Source": "co_actions_results"
        },
        {
            "Title": "Akme Fintrade Secures ₹120 Million Loan Approval",
            "Summary": "Akme Fintrade (India) Limited receives loan approval worth ₹120 million from Hinduja Leyland Finance, strengthening its financial position for business operations.",
            "Sentiment": "positive",
            "PublishDate": 1765889655685,
            "Source": "stocks"
        },
        {
            "Title": "Akme Fintrade Board Approves ₹200 Cr NCD Issuance",
            "Summary": "Akme Fintrade (India) Limited's board approved issuance of non-convertible debentures up to ₹200 crores on private placement basis and appointed Jinit Jain as Additional Director.",
            "Sentiment": "positive",
            "PublishDate": 1765608982084,
            "Source": "co_actions_results"
        },
        {
            "Title": "Akme Fintrade Secures ₹5 Crore Term Loan Facility",
            "Summary": "Akme Fintrade (India) Limited announces sanction of ₹5.00 crore term loan from MAS Financial Services Limited, strengthening its financial position for business operations.",
            "Sentiment": "positive",
            "PublishDate": 1765545660765,
            "Source": "stocks"
        },
        {
            "Title": "Akme Fintrade Reports Strong H1 FY26 Performance with 54.80% AUM Growth",
            "Summary": "Akme Fintrade (India) Limited, an RBI-registered NBFC, achieved Assets Under Management of ₹2,767.46 crores in H1 FY26, marking 54.80% year-on-year growth, with disbursements rising 135.35% to ₹227.62 crores. The company reported Profit After Tax of ₹19.66 crores (17.32% growth) and maintains expansion plans targeting ₹950 crores AUM for FY26 while diversifying into gold loans and insurance distribution.",
            "Sentiment": "positive",
            "PublishDate": 1763616141730,
            "Source": "earnings"
        },
        {
            "Title": "Akme Fintrade Allots ₹20 Crore Non-Convertible Debentures on Private Placement",
            "Summary": "Akme Fintrade (India) Limited's Board approved the allotment of 20,000 secured, listed, rated, transferable, redeemable non-convertible debentures of ₹10,000 each, totaling ₹20 crore on private placement basis. The debentures carry 12% coupon rate with monthly interest payments, mature on April 16, 2028, and are secured by LAP/Equipment Loans/Business Loans maintained at 125% of outstanding principal amount.",
            "Sentiment": "neutral",
            "PublishDate": 1763067262948,
            "Source": "corporate_action"
        },
        {
            "Title": "Akme Fintrade Reports 17.32% Surge in Net Profit with Strong AUM Growth",
            "Summary": "Akme Fintrade (India) Limited posted a 17.32% growth in net profit at ₹19.65 Cr for H1FY26, driven by higher disbursements and 54.15% increase in gross interest income. The NBFC's Assets under Management grew 54.80% to ₹767.46 Cr, with the company receiving board approval to enter the gold loan business amid strong demand in rural and semi-urban vehicle financing segments.",
            "Sentiment": "neutral",
            "PublishDate": 1763065662287,
            "Source": "earnings"
        },
        {
            "Title": "Akmefintrade (India) Limited Receives IRDAI Registration as Corporate Agent",
            "Summary": "Akmefintrade (India) Limited has obtained a Certificate of Registration from the Insurance Regulatory and Development Authority of India (IRDAI) to operate as a Corporate Agent (Composite) under the Insurance Act, 1938. The certificate was issued on November 10, 2025, and is valid until November 9, 2028. This registration enables the company to solicit insurance products to its customers as a Corporate Agent. The company informed stock exchanges NSE and BSE about this regulatory approval through a disclosure filing.",
            "Sentiment": "positive",
            "PublishDate": 1762948029056,
            "Source": "stock"
        },
        {
            "Title": "Akme Fintrade Approves Issuance of Non-Convertible Debentures Worth INR 20 Crores",
            "Summary": "Akme Fintrade (India) Limited's Loan Investment Committee has approved the issuance of Senior, Secured, Listed, Rated, Transferable, Redeemable, Non-Convertible Debentures worth up to INR 20 crores on a private placement basis. The debentures will be issued in one or more tranches and will be listed on the National Stock Exchange of India Limited. The company will maintain security coverage through LAP/Equipment Loans/Business Loans at 1.25 times or 125% of the aggregate principal outstanding amount of the NCDs. In case of covenant breach, the company will pay an additional 2% per annum coupon over the applicable rate until full redemption or covenant replenishment.",
            "Sentiment": "neutral",
            "PublishDate": 1762505939863,
            "Source": "corporate_action"
        },
        {
            "Title": "Akme Fintrade Board Approves ₹30 Crore Secured Debenture Issue",
            "Summary": "Akme Fintrade (India)'s board has approved the issuance of 30,000 secured debentures valued at ₹30 crores. The debentures carry a 12% coupon rate and are set to mature on April 16, 2028.",
            "Sentiment": "neutral",
            "PublishDate": 1760593806195,
            "Source": "corporate_action"
        },
        {
            "Title": "Akme Fintrade Board Approves ₹60 Crore NCD Issuance at 12% Coupon Rate",
            "Summary": "Akme Fintrade (India) board has approved the issuance of rated, secured, redeemable non-convertible debentures worth ₹60 crores. The debentures carry a 12% coupon rate with a 30-month repayment plan.",
            "Sentiment": "positive",
            "PublishDate": 1759992301246,
            "Source": "corporate_action"
        },
        {
            "Title": "Akme Fintrade Plans INR 35 Crore Non-Convertible Debenture Issue",
            "Summary": "Akme Fintrade (India) Limited has scheduled a Board of Directors meeting for October 9, 2025 to consider and approve the issuance of Senior, Secured, Rated, Listed and Transferable Non-Convertible Debentures up to INR 35 Crores on a private placement basis. The NCDs will be issued in one or more tranches.",
            "Sentiment": "neutral",
            "PublishDate": 1759495733389,
            "Source": "corporate_action"
        },
        {
            "Title": "ICICI Bank Sanctions Rs. 10 Crore Term Loan to Akme Fintrade",
            "Summary": "ICICI Bank Limited has sanctioned a term loan of Rs. 10 crore to Akme Fintrade (India) Limited. The company disclosed this loan sanction through a regulatory filing to stock exchanges including NSE and BSE. Akme Fintrade trades under the symbol AFIL on NSE and scrip code 544200 on BSE.",
            "Sentiment": "positive",
            "PublishDate": 1756292634171,
            "Source": "stock"
        },
        {
            "Title": "Akme Fintrade Board Approves ₹50 Crore Fundraising Through NCDs",
            "Summary": "Akme Fintrade's board has approved a fundraising initiative of ₹50 crore through Non-Convertible Debentures (NCDs). This debt instrument will allow the company to raise capital from investors without diluting equity ownership.",
            "Sentiment": "positive",
            "PublishDate": 1755839169194,
            "Source": "corporate_action"
        },
        {
            "Title": "Akme Fintrade Reports Strong Q1 FY26 Results with 27% PAT Growth and Approves INR 30 Crore NCD Issuance",
            "Summary": "Akme Fintrade (India) Limited reported robust financial performance for Q1 ended June 30, 2025, with net profit rising 27.41% to INR 9.61 crores compared to INR 7.55 crores in Q4 FY25. Assets under Management grew to INR 675.05 crores from INR 618.61 crores. Interest income increased 6.14% quarter-on-quarter to INR 30.61 crores. The company's Return on Equity improved to 9.94% from 8.07%, while Capital Adequacy Ratio stood strong at 57.70%. The Board approved issuance of Non-Convertible Debentures up to INR 30 crores on private placement basis with 12% coupon rate and 24-month tenure. The company also recommended appointment of M/s. Ronak Jhuthawat & Co as Secretarial Auditors for five years from FY 2025-26 to 2029-30, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1755091844757,
            "Source": "earnings"
        },
        {
            "Title": "Akme Fintrade Plans INR 15 Crore Non-Convertible Debenture Issue",
            "Summary": "Akme Fintrade (India) Limited has scheduled a board meeting for August 5, 2025, to consider and approve the issuance of listed, rated, senior, secured, transferable, redeemable non-convertible debentures worth up to INR 15 crores through private placement. The debentures may be issued in one or more tranches. The company has informed stock exchanges NSE and BSE about this board meeting in compliance with SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1754664690038,
            "Source": "corporate_action"
        }
    ]
}