{
    "Symbol": "AFSL",
    "ISIN": "INE00ZE01026",
    "News": [
        {
            "Title": "Abans Financial Services Reports Q3 FY26 Results",
            "Summary": "Abans Financial Services announced Q3 FY26 financial results with consolidated revenue of Rs 6,49,600.96 lakhs and net profit of Rs 3,431.03 lakhs for the quarter ended December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1770630482003,
            "Source": "co_actions_results"
        },
        {
            "Title": "Abans Financial Services Allots 9,633 Equity Shares Under ESOP Scheme",
            "Summary": "Abans Financial Services Limited allotted 9,633 equity shares of ₹2 each through its ESOP Allotment Committee under the company's ESOP Scheme 2023. The allotment increases the company's paid-up equity share capital to ₹210,13,17,680 consisting of 5,06,58,840 equity shares, with the new shares ranking pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764331742261,
            "Source": "corporate_action"
        },
        {
            "Title": "Abans Financial Services' Dubai Subsidiary Changes Statutory Auditors",
            "Summary": "Expert House Chartered Accountants resigned as statutory auditors of Abans Middle East DMCC, Dubai due to preoccupation with other assignments, with JHS Chartered Accountants LLC appointed as replacement for a two-year term. The auditor change affects the material subsidiary of Abans Financial Services Limited and was approved by the subsidiary's board on November 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763055333041,
            "Source": "corporate_action"
        },
        {
            "Title": "Abans Financial Services Reports Q2 FY26 Results with Mixed Performance Across Segments",
            "Summary": "Abans Financial Services Limited announced its quarterly results for the quarter and half year ended September 30, 2025. On a standalone basis, the company reported revenue from operations of Rs. 132.26 lakhs for the quarter, compared to Rs. 112.97 lakhs in the same quarter last year. However, the company posted a net loss of Rs. 105.26 lakhs for the quarter versus a loss of Rs. 82.54 lakhs in the previous year. On a consolidated basis, the group showed stronger performance with total income of Rs. 6,83,320.04 lakhs for the quarter compared to Rs. 64,192.58 lakhs last year. Consolidated net profit after tax was Rs. 4,184.66 lakhs for the quarter versus Rs. 2,738.43 lakhs in the corresponding quarter of the previous year. The company also approved the appointment of Mr. Chintan Mehta as an Authorized Person for determining materiality of events and making disclosures to stock exchanges. Additionally, the company allotted 33,867 equity shares under its Employee Stock Option Scheme during the period.",
            "Sentiment": "neutral",
            "PublishDate": 1762909410336,
            "Source": "earnings"
        },
        {
            "Title": "Abans Financial Services Reports Strong Q2 Growth with Net Profit Rising 50% and Revenue Surging Over 10x",
            "Summary": "Abans Financial Services reported consolidated net profit of 381.9 million rupees for Q2, representing a 50% increase from 253.9 million rupees in the same quarter last year. The company's revenue showed dramatic growth, reaching 68.32 billion rupees compared to 6.41 billion rupees in the previous year's corresponding quarter, marking more than a 10-fold increase.",
            "Sentiment": "positive",
            "PublishDate": 1762870163621,
            "Source": "earnings"
        },
        {
            "Title": "Abans Commodities Submits Settlement Application to SEBI After SAT Orders",
            "Summary": "Abans Commodities (I) Pvt. Ltd., a subsidiary of Abans Financial Services, has submitted a settlement application to SEBI following orders from the Securities Appellate Tribunal (SAT).",
            "Sentiment": "neutral",
            "PublishDate": 1759234868783,
            "Source": "stock"
        },
        {
            "Title": "Abans Financial Services Reports 35% YoY Net Profit Growth in Q1 FY26",
            "Summary": "Abans Financial Services Limited reported strong quarterly results with revenue of ₹1,895 crores, EBITDA of ₹52.8 crores, and net profit of ₹32.69 crores, marking a 35% year-on-year increase. The diversified financial services company achieved a milestone with Assets Under Management reaching ₹3,500 crores. The company operates across asset management, investment advisory, broking, lending, and treasury operations with a global presence in India, UK, Mauritius, and GIFT City. Management highlighted strong momentum in asset management and distribution businesses, with fee-based investment services generating ₹165 crores revenue in FY25. The company is expanding through strategic partnerships, launching new asset management vehicles, and entering merchant banking. Management expressed confidence in doubling AUMs every 12-18 months and expects fee income margins to expand as fixed infrastructure costs are already established.",
            "Sentiment": "positive",
            "PublishDate": 1754976811716,
            "Source": "earnings"
        },
        {
            "Title": "Abans Financial Services Board Approves Revised Insider Trading Code and Postal Ballot Notice",
            "Summary": "The Board of Directors of Abans Financial Services Limited approved a revised Code of Conduct to Regulate, Monitor and Report Trading by Insiders, pursuant to SEBI regulations. The board also approved a notice for postal ballot seeking shareholder approval for material related party transactions. The board meeting was held on August 07, 2025, commencing at 16:32 IST and concluding at 17:00 IST. The revised code will be available on the company's website and includes comprehensive guidelines for insider trading prevention, trading windows, pre-clearance procedures, and compliance requirements for designated persons and their immediate relatives.",
            "Sentiment": "neutral",
            "PublishDate": 1754576108382,
            "Source": "corporate_action"
        },
        {
            "Title": "Abans Financial Services Board Approves Q1 FY26 Results and Revises Insider Trading Code",
            "Summary": "Abans Financial Services Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025, along with limited review reports from statutory auditors. The board meeting, held on August 7, 2025, also approved a revised Code of Conduct for insider trading regulations and authorized a postal ballot notice seeking shareholder approval for material related party transactions. The consolidated results include performance from multiple domestic and international subsidiaries, with two domestic subsidiaries reporting total revenue of Rs. 1,77,903.71 lakhs and net profit of Rs. 3,011.33 lakhs for the quarter. Five subsidiaries reported combined revenue of Rs. 12,545.48 lakhs with net profit of Rs. 480.15 lakhs, while six other subsidiaries recorded revenue of Rs. 288.71 lakhs with a net loss of Rs. 79.68 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1754574690605,
            "Source": "earnings"
        },
        {
            "Title": "Abans Financial Services Reports Mixed Q1 Results with Revenue Surge and Margin Decline",
            "Summary": "Abans Financial Services reported quarterly results showing revenue of 18.9 billion rupees compared to 3 billion rupees in the same period last year. The company's consolidated net profit increased to 299 million rupees from 222 million rupees year-over-year. EBITDA rose to 514 million rupees from 437 million rupees in the previous year. However, EBITDA margin declined significantly to 2.71% from 14.75% in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1754571435297,
            "Source": "earnings"
        },
        {
            "Title": "Abans Financial Services Announces Amalgamation Scheme for Five Subsidiaries",
            "Summary": "Abans Financial Services Limited has announced a proposed scheme of arrangement for the amalgamation of its subsidiary and step-down subsidiaries. The scheme involves merging Abans Capital Private Limited, Abans Commodities (I) Private Limited, Abans Securities Private Limited, and Clamant Broking Services Private Limited into Abans Broking Services Private Limited, with an appointed date of April 1, 2025. The Board of Directors of the transferee company approved the proposal on August 6, 2025. The companies involved operate in complementary businesses including stock-broking, commodities trading, and investment services. The rationale includes operational efficiency, cost reduction, simplified group structure, and enhanced financial strength. Under the share exchange ratio, 1,253 fully paid equity shares of the transferee company will be issued for every 1 equity share held in the transferor company. The scheme is subject to regulatory approvals and will not affect the shareholding pattern of the listed entity.",
            "Sentiment": "positive",
            "PublishDate": 1754571017637,
            "Source": "corporate_action"
        },
        {
            "Title": "Abans Financial Services Approves Investment in Subsidiaries",
            "Summary": "Abans Financial Services has approved investments in two of its subsidiaries: Abans Capital and Abans Financial Services. This decision indicates a strategic move to strengthen the company's financial services portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1744721818000,
            "Source": "default"
        },
        {
            "Title": "Abans Holdings Reports Strong Q3 Financial Results",
            "Summary": "Abans Holdings has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 259 million rupees from 216 million rupees in the same quarter last year. Revenue saw a substantial rise, reaching 12.8 billion rupees compared to 5 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739198083000,
            "Source": "earnings"
        },
        {
            "Title": "Abans Holdings Reports Q2 Financial Results",
            "Summary": "Abans Holdings announced its Q2 financial results. The company's EBITDA increased to 464 million rupees from 385.8 million rupees year-over-year. However, the EBITDA margin decreased to 7.23% from 10.26% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731327085000,
            "Source": "result"
        },
        {
            "Title": "Abans Holdings Reports Significant Revenue Growth in Q2",
            "Summary": "Abans Holdings has announced its Q2 revenue, which stands at 6.4 billion rupees. This represents a substantial increase from the previous year's Q2 revenue of 3.6 billion rupees, indicating strong year-over-year growth for the company.",
            "Sentiment": "positive",
            "PublishDate": 1731326860000,
            "Source": "result"
        },
        {
            "Title": "Abans Holdings Reports Q2 Profit Increase",
            "Summary": "Abans Holdings has reported a consolidated net profit of 254 million rupees for the second quarter, showing an increase from 213.5 million rupees year-over-year and 222 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731326816000,
            "Source": "result"
        }
    ]
}