{
    "Symbol": "AGARIND",
    "ISIN": "INE204E01012",
    "News": [
        {
            "Title": "Agarwal Industrial Wins ₹218.59 Cr BPCL Tender",
            "Summary": "Agarwal Industrial Corporation Limited secured a major tender from BPCL worth ₹218.59 crores for supplying 42,800 MT of bulk bitumen to Kakinada and Mangalore locations during 2026-27.",
            "Sentiment": "positive",
            "PublishDate": 1770027514506,
            "Source": "co_actions_results"
        },
        {
            "Title": "Agarwal Industrial Wins Orders Worth ₹220 Crore",
            "Summary": "Agarwal Industrial Corporation has secured two significant orders totaling ₹220 crore, marking a major business development for the company's order book and revenue pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1770011889473,
            "Source": "co_actions_results"
        },
        {
            "Title": "Agarwal Industrial Acquires 100% Stake in Konkan Storage",
            "Summary": "Agarwal Industrial Corporation Limited completes acquisition of Konkan Storage Systems (Karwar) Private Limited, making it a wholly owned subsidiary with 100% paid-up equity share capital transfer.",
            "Sentiment": "positive",
            "PublishDate": 1769679493585,
            "Source": "co_actions_results"
        },
        {
            "Title": "Agarwal Industrial Corp Reports Mixed Q2 Results with Revenue and Profit Decline",
            "Summary": "Agarwal Industrial Corp's Q2 results showed revenue declining to 2.4B rupees from 3.25B rupees year-over-year, while net profit dropped to 120M rupees from 184M rupees. Despite the revenue decline, the company improved its EBITDA margin to 11.45% from 10.8%, though absolute EBITDA fell to 280M rupees from 351M rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1763048169465,
            "Source": "earnings"
        },
        {
            "Title": "Agarwal Industrial Corporation Faces Exchange Penalties for Delayed Company Secretary Appointment",
            "Summary": "Agarwal Industrial Corporation disclosed that BSE and NSE imposed penalties for a 27-day delay in appointing a Company Secretary and Compliance Officer. The delay occurred after the previous Company Secretary resigned with short notice. Despite hiring recruitment consultants and submitting a waiver application with supporting documentation to NSE, the exchange rejected the waiver request. The company has paid the imposed penalty and stated there is no material impact on its financial operations or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1762507255640,
            "Source": "corporate_governance"
        },
        {
            "Title": "Agarwal Industrial Corporation Wins ₹330 Crore Bitumen Supply Contract from IOCL",
            "Summary": "Agarwal Industrial Corporation Limited secured a tender from Indian Oil Corporation Limited for supplying Bulk Bitumen (VG-30 & VG-40 Grades) to Kakinada locations. The contract includes a firm quantity of approximately 60,500 MT valued at ₹213.56 crores and an optional quantity of about 33,000 MT worth ₹116.50 crores. The total estimated value reaches ₹330.05 crores based on current market prices. The company will supply approximately 93,500 MT of bitumen across 17 parcels in total.",
            "Sentiment": "positive",
            "PublishDate": 1758085770319,
            "Source": "order&deals"
        },
        {
            "Title": "Agarwal Industrial Corporation Reports 16% Revenue Decline in Q1 FY26 Amid External Challenges",
            "Summary": "Agarwal Industrial Corporation Limited reported revenues of Rs. 594 crores for Q1 FY26, declining 16.1% year-over-year from Rs. 708 crores in Q1 FY25. EBITDA fell 38.7% to Rs. 38 crores with margins at 6.4%, while profit after tax dropped 66.6% to Rs. 13 crores. Bitumen volumes decreased 26.9% to 124,614 MT. The company faced disruptions from India-Pakistan war affecting operations for 15 days and geopolitical tensions in the Middle East impacting shipping for nearly a month. Early monsoon onset also slowed construction activity and bitumen demand. The bitumen segment contributed Rs. 496 crores to revenue, shipping business added Rs. 72 crores, logistics Rs. 16 crores, and petroleum Rs. 13 crores. The company operates 11 shipping vessels with 113,549 MT capacity, seven manufacturing facilities, and storage capacity of 30,500 MT across seven ports. Management highlighted government infrastructure targets of Rs. 7 lakh crore project awards by FY26, scaling to Rs. 10 lakh crore annually thereafter through programs like Bharatmala and PM Gati Shakti.",
            "Sentiment": "negative",
            "PublishDate": 1755602673045,
            "Source": "earnings"
        },
        {
            "Title": "Agarwal Industrial Corp Reports Decline in Q1 Financial Performance",
            "Summary": "Agarwal Industrial Corp reported quarterly results showing a decline across key financial metrics. EBITDA dropped to 361 million rupees from 602 million rupees year-over-year, while EBITDA margin contracted to 6.09% from 8.5%. Consolidated net profit fell to 130 million rupees compared to 390 million rupees in the same period last year. Revenue decreased to 5.9 billion rupees from 7 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1755175271239,
            "Source": "earnings"
        },
        {
            "Title": "Agarwal Industrial Corporation Reports Quarterly Results and Announces Dividend of Rs 3.30 Per Share",
            "Summary": "Agarwal Industrial Corporation Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs 50,934.95 lakhs and net profit of Rs 1,005.40 lakhs for the quarter. On a consolidated basis, revenue from operations stood at Rs 59,360.65 lakhs with net profit of Rs 1,303.01 lakhs. The board approved a dividend of Rs 3.30 per equity share of face value Rs 10 for financial year 2024-2025, subject to shareholder approval at the Annual General Meeting scheduled for September 22, 2025. The company also approved the acquisition of 100% equity shares of Konkan Storage Systems (Karwar) Private Limited, which operates port-based industrial and infrastructure activities. Book closure period is set from September 17-22, 2025 for dividend payment and AGM voting purposes.",
            "Sentiment": "positive",
            "PublishDate": 1755174742712,
            "Source": "earnings"
        },
        {
            "Title": "Agarwal Industrial to Acquire Full Ownership of Konkan Storage Systems",
            "Summary": "Agarwal Industrial has announced plans to purchase full ownership of Konkan Storage Systems. The news indicates a significant corporate action involving the acquisition of another company's complete ownership.",
            "Sentiment": "neutral",
            "PublishDate": 1752234127000,
            "Source": "default"
        },
        {
            "Title": "Agarwal Industrial Corp to Acquire Full Stake in Konkan Storage Systems",
            "Summary": "Agarwal Industrial Corp has announced plans to purchase the full stake in Konkan Storage Systems for 220 million rupees. This acquisition represents a significant corporate action for Agarwal Industrial Corp, potentially expanding its storage capabilities or market presence.",
            "Sentiment": "positive",
            "PublishDate": 1751976170000,
            "Source": "default"
        },
        {
            "Title": "Agarwal Industrial Corp Reports Q4 Results and Dividend Recommendation",
            "Summary": "Agarwal Industrial Corp has announced its Q4 financial results. The company's revenue increased to 8.23 billion rupees from 7.76 billion rupees year-over-year. However, EBITDA decreased to 535.2 million rupees from 601.5 million rupees, with EBITDA margin dropping to 6.5% from 7.75%. Consolidated net profit declined to 305.4 million rupees from 380 million rupees year-over-year, but increased from 277 million rupees quarter-on-quarter. The company has recommended a final dividend of 3.30 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1748015441000,
            "Source": "result"
        },
        {
            "Title": "Agarwal Industrial Secures ₹300 Crore Order from BPCL",
            "Summary": "Agarwal Industrial Corporation has won a significant order worth ₹300 crore from Bharat Petroleum Corporation Limited (BPCL). This order represents a major business opportunity for Agarwal Industrial and demonstrates the company's ability to secure large contracts from prominent clients in the petroleum sector.",
            "Sentiment": "positive",
            "PublishDate": 1740121552000,
            "Source": "order&deals"
        },
        {
            "Title": "Agarwal Industrial Corp Reports Q3 FY24 Financial Results",
            "Summary": "Agarwal Industrial Corp has announced its Q3 financial results. The company reported a consolidated net profit of 277 million rupees, slightly up from 276 million rupees in the same quarter last year. Revenue increased to 5.4 billion rupees from 4.9 billion rupees year-over-year. EBITDA rose to 533 million rupees from 443 million rupees, with the EBITDA margin improving to 9.83% from 9.08% in the corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739454265000,
            "Source": "earnings"
        },
        {
            "Title": "Agarwal Industrial Corp Expands Fleet with New Vessel",
            "Summary": "Agarwal Industrial Corporation has announced the induction of its 11th vessel, MT Aquilo, which has a carrying capacity of 12,357 MT. This addition expands the company's fleet and potentially increases its shipping capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1737014342000,
            "Source": "corporate_action"
        },
        {
            "Title": "Agarwal Industrial Corporation Secures Major Bitumen Supply Agreement",
            "Summary": "Agarwal Industrial Corporation has entered into a supply agreement for bulk bitumen (VG30 & VG40) worth 255 crore rupees. This significant deal represents a major business development for the company in the industrial materials sector.",
            "Sentiment": "positive",
            "PublishDate": 1733207361000,
            "Source": "order&deals"
        },
        {
            "Title": "Agarwal Industrial Secures Bulk Bitumen Supply Tenders Worth 765 Million Rupees",
            "Summary": "Agarwal Industrial has successfully won tenders to supply bulk bitumen, with the contracts valued at 765 million rupees. This development represents a significant business opportunity for the company in the infrastructure and construction materials sector.",
            "Sentiment": "positive",
            "PublishDate": 1732666665000,
            "Source": "order&deals"
        },
        {
            "Title": "Agarwal Industrial Secures Bulk Bitumen Supply Tenders Worth 765 Million Rupees",
            "Summary": "Agarwal Industrial Corporation has successfully won tenders to supply bulk bitumen, with the contracts valued at 765 million rupees. This development represents a significant business opportunity for the company in the infrastructure and construction materials sector.",
            "Sentiment": "positive",
            "PublishDate": 1732619807000,
            "Source": "order&deals"
        },
        {
            "Title": "Agarwal Industrial Corp Reports Q2 EBITDA Growth",
            "Summary": "Agarwal Industrial Corp announced its Q2 financial results. The company's EBITDA increased to 351 million rupees from 268 million rupees year-over-year. However, the EBITDA margin decreased slightly to 10.80% from 11.57% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731497940000,
            "Source": "result"
        },
        {
            "Title": "Agarwal Industrial Corp Reports Strong Q2 Revenue Growth",
            "Summary": "Agarwal Industrial Corporation has announced its Q2 financial results, reporting revenue of 3.25 billion rupees. This represents a significant year-over-year increase from 2.3 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731497682000,
            "Source": "result"
        },
        {
            "Title": "Agarwal Industrial Corp Reports Q2 Profit Increase",
            "Summary": "Agarwal Industrial Corporation has reported a consolidated net profit of 184 million rupees for the second quarter, showing an increase from 160 million rupees year-over-year. However, this represents a decrease from 390 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1731497651000,
            "Source": "result"
        }
    ]
}