{
    "Symbol": "AGARWALEYE",
    "ISIN": "INE943P01029",
    "News": [
        {
            "Title": "Dr. Agarwal's Health Care Q3FY26 earnings call Feb 4",
            "Summary": "Dr. Agarwal's Health Care Limited announces board meeting on February 03, 2026 to approve Q3FY26 results and earnings call on February 04, 2026 at 11:30 AM IST to discuss financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1769607162671,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dr. Agarwal's Health Care promoter shareholding change",
            "Summary": "Dr. Amar Agarwal acquires 5.12 lakh shares from Dr. Adil Agarwal through inter-se transfer by way of gift, increasing his stake from 4.29% to 4.46% in the healthcare company.",
            "Sentiment": "neutral",
            "PublishDate": 1767434864155,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dr. Agarwal's Health Care Allots 3.38L ESOP Shares",
            "Summary": "Dr. Agarwal's Health Care Limited allotted 3,37,504 equity shares under ESOP scheme 2022, increasing paid-up capital to ₹31.68 crores with shares exercised at ₹135 each on January 06, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1765557073639,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dr. Ashvin Agarwal Transfers 9.4 Lakh Shares to Dr. Ashar Agarwal in Promoter Gift Transaction",
            "Summary": "Dr. Ashvin Agarwal transferred 9,40,578 shares (0.30% stake) of Dr. Agarwal's Health Care Limited to Dr. Ashar Agarwal through an inter-se promoter transfer by way of gift on December 4, 2025. The transaction reduced Dr. Ashvin Agarwal's holding from 4.76% to 4.46% in the healthcare company, representing an internal restructuring within the promoter group.",
            "Sentiment": "neutral",
            "PublishDate": 1765001180294,
            "Source": "corporate_action"
        },
        {
            "Title": "Dr. Agarwal's Health Care Seeks Shareholder Approval for New Statutory Auditor Appointment",
            "Summary": "Dr. Agarwal's Health Care Limited has issued a postal ballot notice seeking member approval to appoint M/s. S.R. Batliboi & Associates LLP as statutory auditors, replacing M/s. Deloitte Haskins & Sells who resigned on November 12, 2025. The e-voting period runs from November 18 to December 17, 2025, with the proposed auditor fee set at ₹52.50 lakh for FY 2025-26, as part of pre-merger alignment activities with subsidiary Dr. Agarwal's Eye Hospital Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1763371499928,
            "Source": "corporate_action"
        },
        {
            "Title": "Dr. Agarwal's Health Care Changes Auditors as Deloitte Steps Down, S.R. Batliboi Associates Appointed",
            "Summary": "Dr. Agarwal's Health Care Limited announced that Deloitte Haskins & Sells has stepped down as statutory auditors of the company and its material subsidiary Dr. Thind Eye Care Private Limited, effective November 12, 2025. The resignation was tendered to facilitate alignment with the existing auditors of the company's listed material subsidiary Dr. Agarwal's Eye Hospital Limited as part of an ongoing merger process. The Board approved the appointment of S.R. Batliboi Associates LLP as the new statutory auditors to fill the casual vacancy, subject to shareholder approval through postal ballot. The new auditors will hold office until the conclusion of the 16th Annual General Meeting. Deloitte confirmed no concerns or issues were raised, and the change aims to streamline audit and reporting practices for the combined entity.",
            "Sentiment": "neutral",
            "PublishDate": 1762983311042,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dr. Agarwal's Health Care Reports 88% PAT Growth in H1 FY26, Crosses INR 1,000 Crore Revenue Mark",
            "Summary": "Dr. Agarwal's Health Care Limited reported strong financial performance for H1 FY26, with total income reaching INR 1,007 crores, marking a 20.2% year-on-year growth and crossing the INR 1,000 crore milestone for the first time. PAT grew significantly by 88.4% to INR 75 crores, with margins expanding by 270 basis points to 7.2%. EBITDA increased 24.9% to INR 285 crores with margins improving by 100 basis points to 28.3%. For Q2 FY26, total income was INR 507 crores (18.2% growth) with PAT of INR 36 crores (71% growth). The company expanded its network by adding 24 new facilities, bringing the total to 258 facilities across 239 locations in India. High-end cataract surgeries increased 41.7% and robotic cataract surgeries grew 69% year-on-year. The company served over 14.3 lakh patients and performed nearly 157,000 surgeries during the period. Management expects H2 to be stronger than H1, with plans to launch 30 more facilities in the remaining quarters.",
            "Sentiment": "positive",
            "PublishDate": 1762287024032,
            "Source": "earnings"
        },
        {
            "Title": "Dr. Agarwal's Health Care Grants 265,000 Stock Options and Allots 12,523 Shares Under ESOP Scheme",
            "Summary": "Dr. Agarwal's Health Care Limited's Nomination and Remuneration Committee approved the grant of 265,000 stock options under its Employee Stock Option Scheme 2022 to eligible employees of the company and subsidiaries. The company also allotted 12,523 equity shares of face value INR 1 each to employees who exercised their vested options. Following this allotment, the company's paid-up equity share capital increased from INR 31,61,58,357 to INR 31,61,70,880. The ESOP scheme features a three-year vesting schedule with 50% of options vesting after one year, 25% after two years, and 25% after three years. The exercise price is based on fair market value with potential discount of up to 20%. The scheme aims to reward employee performance, motivate contribution to company growth and profitability, and retain talent.",
            "Sentiment": "positive",
            "PublishDate": 1761852789440,
            "Source": "corporate_action"
        },
        {
            "Title": "Dr. Agarwal's Health Care Reports Strong H1 FY2026 Results with 88% PAT Growth",
            "Summary": "Dr. Agarwal's Health Care Limited announced its quarterly results for the period ended September 30, 2025. The company achieved total income of INR 1,007 crores in H1 FY2026, representing 20.2% year-on-year growth. EBITDA grew 24.9% to INR 285 crores with margins of 28.3%. Profit after tax surged 88.4% to INR 75 crores with margins of 7.4%. For Q2 FY2026, total income reached INR 507 crores (18.2% growth), EBITDA of INR 144 crores (21.2% growth), and PAT of INR 36 crores (71% growth). The company expanded its network to 258 facilities with 24 new centers added during the half-year. It performed 157,281 surgeries in H1 FY2026, showing 14.6% growth. Revenue from operations in India grew 20.6% to INR 886 crores. CEO Dr. Adil Agarwal noted this marks the first time the company crossed the INR 1,000 crore total income milestone. The company operates across 10 countries and served over 14 lakh patients during the period.",
            "Sentiment": "positive",
            "PublishDate": 1761851786939,
            "Source": "earnings"
        },
        {
            "Title": "Dr. Agarwal's Health Care Reports No Deviation in IPO Proceeds Utilization for September Quarter",
            "Summary": "Dr. Agarwal's Health Care Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing no deviation from the stated objectives of its Initial Public Offer. The company raised Rs. 300 crore through its IPO held from January 29-31, 2025, with net proceeds of Rs. 272.466 crore after expenses. ICRA Limited, the monitoring agency, confirmed that fund utilization aligned with disclosed purposes including repayment of borrowings (Rs. 195 crore), general corporate purposes (Rs. 77.466 crore), and issue expenses (Rs. 27.534 crore). The company has deployed Rs. 53.581 crore in fixed deposits across various banks earning returns between 5.80% to 6.50%, with total market value including interest reaching Rs. 54.015 crore. All project timelines remain on schedule with no delays reported in implementation.",
            "Sentiment": "positive",
            "PublishDate": 1761837130034,
            "Source": "corporate_action"
        },
        {
            "Title": "Dr. Agarwal's Health Care Reports 79% Jump in Q2 Net Profit to 296.9 Million Rupees",
            "Summary": "Dr. Agarwal's Health Care reported consolidated net profit of 296.9 million rupees for Q2, compared to 165.8 million rupees in the same period last year. Revenue increased to 4.99 billion rupees from 4.16 billion rupees year-over-year. EBITDA rose to 1.36 billion rupees from 1.07 billion rupees, while EBITDA margin improved to 27.30% from 25.68% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761833134121,
            "Source": "earnings"
        },
        {
            "Title": "Dr. Agarwal's Health Care Schedules Earnings Call for Quarter and Half Year Results",
            "Summary": "Dr. Agarwal's Health Care Limited has announced an earnings conference call scheduled for October 31, 2025, from 11:30 AM to 12:30 PM IST. The call will discuss the company's unaudited financial results for the quarter and half year ended September 30, 2025. The session will be led by Dr. Adil Agarwal (Whole-time Director and CEO), Mr. Yashwanth Venkat (CFO), and Ms. Aashna Dharia (Head, Investor Relations). The company has provided comprehensive dial-in details for both domestic and international participants across multiple countries.",
            "Sentiment": "neutral",
            "PublishDate": 1761638612209,
            "Source": "earnings"
        },
        {
            "Title": "Dr Agarwal's Health Care and Eye Hospital Boards Approve Merger Despite Share Price Decline",
            "Summary": "The boards of Dr. Agarwal's Health Care Ltd. (AHCL) and Dr. Agarwal's Eye Hospital (AEHL) have approved a merger of AEHL into AHCL. AHCL currently holds a 71.9% stake in AEHL, which contributed 23% to the parent's profit after tax in the first quarter. Under the merger terms, AHCL will issue 23 new equity shares for every two AEHL shares held by shareholders. The company also approved a preferential share issue worth ₹70 crore at ₹5,270 per share. Morgan Stanley maintains an 'Overweight' rating with a ₹494 price target, citing the merger's potential for operational streamlining and enhanced shareholder value. The brokerage notes the trailing acquisition EV/EBITDA multiple of 22x represents a 14% discount to the hospital sector average. Despite the positive merger news, both companies' shares declined on Thursday, with AEHL falling 13.5% to ₹4,448 and AHCL dropping 4.6% to ₹438.6.",
            "Sentiment": "neutral",
            "PublishDate": 1756436189011,
            "Source": "order&deals"
        },
        {
            "Title": "Dr. Agarwal's Health Care and Dr. Agarwal's Eye Hospital Approve Merger Scheme",
            "Summary": "Dr. Agarwal's Health Care Limited and Dr. Agarwal's Eye Hospital Limited have approved a scheme of amalgamation, subject to regulatory approvals. Under the merger, AHCL will issue 23 equity shares for every 2 AEHL shares held by eligible shareholders. AEHL will be absorbed into AHCL as a going concern. The boards also approved AHCL's acquisition of additional AEHL shares worth ₹70 crores through preferential issue, increasing its stake from 71.90% to 72.67%. The merger aims to achieve operational efficiencies, streamlined functions, unified capital allocation, and simplified governance framework. AHCL reported standalone turnover of ₹1,043.89 crores and net worth of ₹1,933.64 crores as of March 31, 2025, while AEHL reported turnover of ₹397.15 crores and net worth of ₹209.61 crores. The share exchange ratio is based on joint valuation by PWC Business Consulting Services LLP and Bansi S Mehta Valuers LLP. Additionally, the company approved director changes, with Ankur Nand Thadani's appointment as Non-Executive Director and Ved Prakash Kalanoria's cessation as Nominee Director, both effective September 24, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1756303666857,
            "Source": "corporate_action"
        },
        {
            "Title": "Dr. Agarwal's Health Care Reports Strong Q1 Results with 22% Revenue Growth and Doubled Profits",
            "Summary": "Dr. Agarwal's Health Care Limited reported total income of INR 501 crores, up 22.3% year-over-year, with revenue from operations at INR 487 crores, up 20.8%. The eye care services provider achieved EBITDA of INR 141 crores, up 28.9%, with margins improving 140 basis points to 28.2%. Profit after tax more than doubled to INR 38 crores, expanding margins by 315 basis points to 7.6%. The company served over 7 lakh patients and performed 78,882 surgeries, up 16% year-over-year. The network expanded with 13 new facilities added, including entry into the Delhi market. High-end cataract surgeries increased to 25.5% of total cataract procedures, while robotic cataract surgeries grew 72% to 1,160 procedures. The company plans to open 42 new facilities in the next three quarters and expects ROCE to increase by 1-1.5% in FY26 from 16% in March 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755347645694,
            "Source": "earnings"
        },
        {
            "Title": "Dr. Agarwal's Health Care Reports No Deviation in IPO Proceeds Utilization for Q1 FY2026",
            "Summary": "Dr. Agarwal's Health Care Limited submitted its monitoring agency report for the quarter ended June 30, 2025, showing proper utilization of proceeds from its Initial Public Offer. ICRA Limited, the monitoring agency, reported no deviation from the stated objects of the issue. The company raised Rs. 300 crore through fresh issue with net proceeds of Rs. 272.466 crore. During the quarter, Rs. 257 crore was utilized across three main categories: Rs. 195 crore for loan repayment (fully utilized), Rs. 49.656 crore for general corporate purposes, and Rs. 12.344 crore for issue-related expenses. The remaining Rs. 43 crore of unutilized funds were deployed in fixed deposits with ICICI Bank and Yes Bank, earning returns between 5.50% to 6.55%. General corporate purposes included purchases of medical equipment, electrical equipment, furniture and fixtures, non-compete agreement payments, and acquisition-related payments. Both loan repayment and general corporate purposes remain on schedule for completion.",
            "Sentiment": "neutral",
            "PublishDate": 1755151708403,
            "Source": "stock"
        },
        {
            "Title": "Dr. Agarwals Health Care Reports 150% Jump in Q1 Net Profit to 300M Rupees",
            "Summary": "Dr. Agarwals Health Care reported consolidated net profit of 300 million rupees in Q1, compared to 120 million rupees in the same period last year. Revenue increased to 4.9 billion rupees from 4 billion rupees year-over-year. EBITDA rose to 1.3 billion rupees from 1.04 billion rupees, while EBITDA margin improved slightly to 25.96% from 25.74%.",
            "Sentiment": "positive",
            "PublishDate": 1755002867428,
            "Source": "earnings"
        },
        {
            "Title": "Dr. Agarwal's Health Care Opens New Branch in Dombivli, Mumbai",
            "Summary": "Dr. Agarwal's Health Care has expanded its operations by opening a new branch in Dombivli, Mumbai. This move indicates the company's efforts to increase its presence in the Mumbai metropolitan area and potentially reach a wider patient base.",
            "Sentiment": "positive",
            "PublishDate": 1742541044000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dr Agarwal's Health Care: Q4 PAT Rises 25% to Rs 28.24 Crore",
            "Summary": "Dr Agarwal's Health Care reported a Q4 FY2024 consolidated profit after tax of Rs 28.24 crore, up from Rs 22.59 crore year-over-year. Total income surged to Rs 443.43 crore from Rs 344.69 crore. The company added 42 new facilities in the April-December 2024 period. Post Q4, it completed its IPO, raising Rs 3,027 crore with shares listed on BSE and NSE from February 4.",
            "Sentiment": "positive",
            "PublishDate": 1739610914000,
            "Source": "earnings"
        },
        {
            "Title": "Dr. Agarwal's Health Care: Q3 PAT Surges 25% YoY in Post-IPO Debut",
            "Summary": "Dr. Agarwal's Health Care reported Q3 FY2025 results with revenue up 29.5% YoY to ₹431 crore, EBITDA up 26.3% to ₹128 crore, and PAT up 25% to ₹28 crore. The company added 12 new facilities in Q3 and 42 in the first nine months of FY2025. Total facilities now stand at 221 across 10 countries.",
            "Sentiment": "positive",
            "PublishDate": 1739544564000,
            "Source": "earnings"
        },
        {
            "Title": "Dr Agarwal's Health Care: Shares Close Slightly Below IPO Price on Debut",
            "Summary": "Dr Agarwal's Health Care Ltd. shares ended at Rs 400.8 on BSE, a 0.29% discount to the IPO price of Rs 402. The Rs 3,027.3-crore IPO was undersubscribed at 1.49 times. The company plans to use Rs 195 crore for debt repayment and the rest for general corporate purposes and potential acquisitions.",
            "Sentiment": "neutral",
            "PublishDate": 1738664010000,
            "Source": "result"
        },
        {
            "Title": "Dr Agarwal's Health Care: Sluggish Market Debut with 1% Discount",
            "Summary": "Dr Agarwal's Health Care Ltd. listed at ₹396.90 on BSE, a 1.2% discount from its IPO price of ₹402. The company's shares listed at par on NSE. The IPO was subscribed 1.55 times, with QIBs showing the strongest interest. The company plans to use ₹195 crore from the fresh issue to repay debt.",
            "Sentiment": "neutral",
            "PublishDate": 1738643313000,
            "Source": "normal_news"
        }
    ]
}