{
    "Symbol": "AGIIL",
    "ISIN": "INE976R01033",
    "News": [
        {
            "Title": "AGI Infra Launches Urbana Square Commercial Project",
            "Summary": "AGI Infra Limited announced the launch of Urbana Square, a commercial project in Jalandhar, Punjab, featuring 142 commercial shops and 218 office spaces. Bookings commenced January 03, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767814953339,
            "Source": "stocks"
        },
        {
            "Title": "AGI Infra Launches Urbana Square Commercial Project",
            "Summary": "AGI Infra Limited announced the launch of Urbana Square, a commercial project in Jalandhar, Punjab, featuring 142 commercial shops and 218 office spaces. Booking commenced on January 03, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767725042723,
            "Source": "stocks"
        },
        {
            "Title": "AGI Infra Launches Urbana Square Commercial Project",
            "Summary": "AGI Infra Limited announced the launch of Urbana Square, a commercial project in Jalandhar, Punjab, featuring 142 commercial shops and 218 office spaces with bookings starting January 03, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767504117439,
            "Source": "stocks"
        },
        {
            "Title": "AGI Infra Appoints Book Running Lead Manager for QIP",
            "Summary": "AGI Infra Limited's board approved appointment of Aryaman Financial Services Limited as Book Running Lead Manager for its Qualified Institutional Placement issue during meeting held on January 03, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767439695716,
            "Source": "stocks"
        },
        {
            "Title": "AGI Infra Gets RERA Nod for Urbana Square Project",
            "Summary": "AGI Infra Limited receives RERA approval for its commercial project 'Urbana Square' in Jalandhar, marking a significant milestone in the company's real estate development portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1766718931397,
            "Source": "stocks"
        },
        {
            "Title": "AGI INFRA Reports Strong Q2 Growth with 26% Jump in Net Profit",
            "Summary": "AGI INFRA delivered robust quarterly performance with net profit rising 26% to 220.5M rupees and revenue growing 10% to 853M rupees year-over-year. The company's EBITDA margin expanded significantly to 39.42% from 34.32%, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1763121598677,
            "Source": "earnings"
        },
        {
            "Title": "AGI Infra Receives Approval to Raise Up to 5 Billion Rupees",
            "Summary": "AGI Infra has received approval for fundraising activities with a limit of up to 5 billion rupees. The approval enables the company to proceed with its capital raising plans.",
            "Sentiment": "positive",
            "PublishDate": 1761219418531,
            "Source": "corporate_action"
        }
    ]
}