{
    "Symbol": "AGSTRA",
    "ISIN": "INE583L01014",
    "News": [
        {
            "Title": "AGS Transact Extends Resolution Plan Deadline to Feb 9",
            "Summary": "AGS Transact Technologies has extended the deadline for resolution plan submissions to 09.02.2026, following approval from the Committee of Creditors during the ongoing CIRP process.",
            "Sentiment": "neutral",
            "PublishDate": 1770201797591,
            "Source": "stocks"
        },
        {
            "Title": "AGS Transact Extends Resolution Plan Deadline to Feb 3",
            "Summary": "AGS Transact Technologies extends deadline for resolution plan submissions to 03.02.2026 following Committee of Creditors approval during ongoing CIRP proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1769589407572,
            "Source": "stocks"
        },
        {
            "Title": "AGS Transact Technologies CoC Meeting Updates",
            "Summary": "AGS Transact Technologies' Committee of Creditors approved key appointments including legal counsel and statutory auditor during their 5th meeting held on January 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769585921561,
            "Source": "stocks"
        },
        {
            "Title": "AGS Transact Technologies Enters Corporate Insolvency Resolution Process",
            "Summary": "The National Company Law Tribunal Mumbai Bench ordered the commencement of corporate insolvency resolution process for AGS Transact Technologies Limited on August 25, 2025. Brijendra Kumar Mishra has been appointed as the interim resolution professional. Creditors are required to submit their claims with proof by September 8, 2025. Financial creditors must submit claims electronically, while other creditors may submit in person, by post, or electronically. A corrigendum was issued on September 3, 2025, correcting the estimated closure date of the insolvency resolution process from February 21, 2025 to February 21, 2026. The company is listed on BSE (scrip code: 543451) and NSE (symbol: AGSTRA).",
            "Sentiment": "negative",
            "PublishDate": 1761910068283,
            "Source": "corporate_action"
        },
        {
            "Title": "AGS Transact Technologies Enters Insolvency Process Over Rs 2.4 Crore Unpaid Dues",
            "Summary": "The Mumbai bench of India's bankruptcy court admitted payments solution provider AGS Transact Technologies Ltd. into insolvency following a plea by operational creditor Securitrans India Pvt. over unpaid dues worth Rs 2.4 crore. Brijendra Kumar Mishra has been appointed as interim resolution professional to handle the company's day-to-day operations. A moratorium under Section 14 of the Insolvency and Bankruptcy Code restricts legal proceedings against the company and prohibits asset transfers. AGS Transact has faced severe financial stress over the past six months, leading to non-functional bank ATMs due to cash fulfillment issues. The company owes over Rs 592 crore to banks with overdue payments of Rs 17 crore. Its subsidiary Securevalue India Ltd. defaulted on term loans and owes nearly Rs 127 crore. AGS failed to publish quarterly financial results citing personnel shortages in the finance department and vacancies in the board and audit committee. Nearly 400 employees have formed a WhatsApp group to address unpaid dues, with some claiming provident fund contributions haven't been deposited for a year. Chairman Ravi Goyal assured employees that the company is not shutting down while leadership addresses the challenges.",
            "Sentiment": "negative",
            "PublishDate": 1756443295090,
            "Source": "corporate_governance"
        },
        {
            "Title": "AGS Transact Technologies Faces Financial Distress as Share Price Falls Below Warrant Conversion Price",
            "Summary": "AGS Transact Technologies Limited submitted its quarterly monitoring report for the period ended June 30, 2025, regarding the utilization of proceeds from a preferential issue of convertible warrants. The company raised Rs 159.36 crore from the issue, revised down from Rs 199.99 crore due to undersubscription. Total proceeds received till June 2025 were Rs 73.42 crore. The monitoring agency CRISIL Ratings highlighted several unfavorable events affecting the company's viability: the company's credit rating was revised to 'Default' in February 2025 due to delayed debt servicing, the share price dropped significantly to Rs 5.28 as of August 12, 2025, which is below the warrant conversion price of Rs 79.25, and the company is subject to insolvency proceedings under the Insolvency and Bankruptcy Code. No utilization of proceeds occurred during the reported quarter. The company's current account balance was frozen, making funds unavailable for utilization. The proceeds were intended for working capital, loan repayment, and general corporate purposes.",
            "Sentiment": "negative",
            "PublishDate": 1755498101552,
            "Source": "corporate_action"
        },
        {
            "Title": "AGS Transact Technologies: Financial Crisis Leads to Unpaid Salaries and Operational Chaos",
            "Summary": "AGS Transact Technologies is facing severe financial stress, resulting in unpaid employee salaries for months, non-functional ATMs, and defaults on loans. The company's HR department has ceased operations, preventing employees from resigning. AGS owes over Rs 592 crore to banks and has overdue payments of Rs 17 crore. The company has initiated loan restructuring discussions and is considering stake sales in subsidiaries.",
            "Sentiment": "negative",
            "PublishDate": 1750132009000,
            "Source": "corporate_governance"
        },
        {
            "Title": "AGS Transact Technologies Announces Resignation of Secretarial Auditor",
            "Summary": "AGS Transact Technologies has announced that Bhandari & Associates has resigned as the company's secretarial auditor. No further details about the reason for the resignation or a potential replacement were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1748001512000,
            "Source": "default"
        },
        {
            "Title": "AGS Transact Tech to Sell 90% Stake in Novus Technologies",
            "Summary": "AGS Transact Technologies has announced the acceptance of a term sheet to sell a 90% equity interest in its step-down subsidiary, Novus Technologies Pte. Ltd. This move represents a significant corporate action that could potentially reshape the company's structure and operations.",
            "Sentiment": "neutral",
            "PublishDate": 1744870119000,
            "Source": "default"
        },
        {
            "Title": "AGS Transact Technologies: Chairman Promises Phased Salary Payments Amid Financial Troubles",
            "Summary": "AGS Transact Technologies, facing financial difficulties, plans to clear pending salaries in tranches. Chairman Ravi Goyal assured employees the company is not shutting down, despite disruptions in operations and collections. The company has defaulted on loan repayments, faces credit rating downgrades, and plans to downsize operations. Multiple top executives and independent directors have recently resigned.",
            "Sentiment": "negative",
            "PublishDate": 1744293248000,
            "Source": "corporate_governance"
        },
        {
            "Title": "AGS Transact Technologies: Three Top Officials Resign Amid Financial Turmoil",
            "Summary": "AGS Transact Technologies Ltd. announced the resignation of CFO Saurabh Lal and Executive Directors Stanley Johnson Panacherry and Vinayak R Goyal. The company faces severe business disruptions due to financial stress, leading to non-functional ATMs and loan defaults. AGS Transact owes over Rs 592 crore to banks, with an insolvency petition filed against it by an operational creditor.",
            "Sentiment": "negative",
            "PublishDate": 1743584804000,
            "Source": "corporate_governance"
        },
        {
            "Title": "RBI to Review Cash Handling by ATM Operator AGS Transact",
            "Summary": "The Reserve Bank of India (RBI) is set to examine the cash handling operations of AGS Transact, a prominent ATM operator. This review by the central bank suggests increased scrutiny of cash management practices in the financial services sector, potentially impacting AGS Transact's operations and the broader ATM industry.",
            "Sentiment": "neutral",
            "PublishDate": 1742286841000,
            "Source": "corporate_governance"
        },
        {
            "Title": "AGS Transact Technologies Migrates ATMs to Minimize Service Disruption",
            "Summary": "AGS Transact Technologies is actively working with banking customers to support operations across its ATM network. The company has already migrated approximately 50% of ATMs to banks and Managed Service Providers (MSPs) networks to minimize service disruption. AGS Transact is committed to gradually resuming operations across its network and will continue to consider migrating ATMs where necessary.",
            "Sentiment": "neutral",
            "PublishDate": 1741739412000,
            "Source": "corporate_action"
        },
        {
            "Title": "AGS Transact Technologies Migrates ATMs to Minimize Disruption",
            "Summary": "AGS Transact Technologies' subsidiary is actively collaborating with banking customers to support operations across their ATM network. The company has successfully migrated approximately 50% of ATMs in their network to banks and Managed Service Providers (MSPs) networks to minimize service disruption.",
            "Sentiment": "positive",
            "PublishDate": 1741703735000,
            "Source": "corporate_action"
        },
        {
            "Title": "AGS Transact Technologies: Insolvency Threat Looms Over Unpaid Dues",
            "Summary": "AGS Transact Technologies faces potential insolvency proceedings initiated by creditor Maxwel Aircon for alleged non-payment of dues. The company has defaulted on 7.26 billion rupees in obligations, leading to credit rating downgrades and a 62.4% stock plunge since February 4.",
            "Sentiment": "negative",
            "PublishDate": 1740983739000,
            "Source": "corporate_governance"
        },
        {
            "Title": "AGS Transact Technologies Reports Increased Q3 Net Loss",
            "Summary": "AGS Transact Technologies has reported a significant increase in its consolidated net loss for the third quarter. The company's net loss widened to 1.9 billion rupees, compared to a loss of 153 million rupees in the same period last year. Additionally, the company's revenue decreased to 2.1 billion rupees from 3.7 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739751148000,
            "Source": "earnings"
        },
        {
            "Title": "AGS Transact Technologies Reports Significant Increase in Q3 Net Loss",
            "Summary": "AGS Transact Technologies has reported a substantial increase in its consolidated net loss for the third quarter. The company's net loss widened to 1.9 billion rupees, compared to a loss of 153 million rupees in the same period last year. Additionally, the company's revenue decreased to 2.1 billion rupees from 3.7 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739608825000,
            "Source": "earnings"
        },
        {
            "Title": "Investor Ajay Upadhyaya Acquires 7.5 Lakh Shares of AGS Transact",
            "Summary": "On December 19, investor Ajay Upadhyaya purchased 750,000 shares of AGS Transact Technologies Limited. This significant acquisition represents a notable transaction in the company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1734617945000,
            "Source": "block_deals"
        },
        {
            "Title": "AGS Transact Technologies Considers Stake Sales in Subsidiaries",
            "Summary": "AGS Transact Technologies is evaluating the potential sale of a 20% stake in SecureValue India and a 26% stake in India Transact Services. These considerations suggest the company may be looking to restructure its holdings or raise capital through partial divestments in its subsidiary companies.",
            "Sentiment": "neutral",
            "PublishDate": 1734330697000,
            "Source": "corporate_action"
        },
        {
            "Title": "AGS Transact Technologies Considers Monetizing Stake in Wholly-Owned Subsidiaries",
            "Summary": "AGS Transact Technologies has announced that it is evaluating various options to monetize its existing stake in one or more of its wholly-owned direct subsidiaries. This strategic move could potentially unlock value for the company and its shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1733808132000,
            "Source": "corporate_action"
        },
        {
            "Title": "AGS Transact Technologies Expands Smart Mobility Payment Solutions in Mumbai",
            "Summary": "AGS Transact Technologies has announced the expansion of its smart mobility payment solutions with the pilot launch of 'ongo Ride' Instant NCMC (National Common Mobility Card) solution in Mumbai. This initiative aims to enhance the city's public transportation payment systems, potentially improving convenience for commuters.",
            "Sentiment": "positive",
            "PublishDate": 1733184329000,
            "Source": "corporate_action"
        },
        {
            "Title": "AGS Transact Tech Expands Smart Mobility Payment Solutions in Mumbai",
            "Summary": "AGS Transact Tech has announced the expansion of its smart mobility payment solutions with the pilot launch of 'ONGO Ride', an instant National Common Mobility Card (NCMC) solution, in Mumbai. This initiative aims to enhance the city's public transportation payment systems, potentially improving convenience for commuters.",
            "Sentiment": "positive",
            "PublishDate": 1733149948000,
            "Source": "corporate_action"
        },
        {
            "Title": "AGS Transact Technologies Expands NCMC Solution to All Chennai Metro Stations",
            "Summary": "AGS Transact Technologies has received approval to extend its instant 'Ready-to-Use' National Common Mobility Card (NCMC) solution across all Chennai Metro stations. This expansion will enable seamless and convenient travel for commuters using the Chennai Metro system.",
            "Sentiment": "positive",
            "PublishDate": 1732254610000,
            "Source": "corporate_action"
        },
        {
            "Title": "AGS Transact Tech Anticipates Growth from Bank ATM and CRM Tenders",
            "Summary": "AGS Transact Technologies expects continued revenue growth opportunities as banks continue to issue Request for Proposals (RFPs) for Automated Teller Machines (ATMs) and Cash Recycling Machines (CRMs). This information was shared during a company conference call.",
            "Sentiment": "positive",
            "PublishDate": 1730777363000,
            "Source": "normal_news"
        },
        {
            "Title": "AGS Transact Tech MD Outlines Growth Strategy for FY25",
            "Summary": "The Managing Director of AGS Transact Technologies has stated that the company is focusing on maintaining growth momentum and exploring strategic partnerships in the second half of fiscal year 2025. The goal is to strengthen the company's position as a leader in omnichannel payment solutions.",
            "Sentiment": "positive",
            "PublishDate": 1730689270000,
            "Source": "corporate_action"
        },
        {
            "Title": "AGS Transact Tech Reports Significant Q2 EBITDA Growth",
            "Summary": "AGS Transact Tech has reported a substantial increase in its Q2 EBITDA, rising to 882 million rupees from 74 million rupees year-over-year. The company's EBITDA margin also saw a significant improvement, increasing to 25.10% from 1.97% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730373635000,
            "Source": "result"
        },
        {
            "Title": "AGS Transact Tech Reports Q2 Revenue Decline",
            "Summary": "AGS Transact Tech has reported a revenue of 3.52 billion rupees for the second quarter, compared to 3.77 billion rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1730373620000,
            "Source": "result"
        },
        {
            "Title": "AGS Transact Tech Reports Q2 Profit Turnaround",
            "Summary": "AGS Transact Tech has reported a consolidated net profit of 151.7 million rupees for the second quarter, compared to a loss of 609 million rupees in the same period last year. The company also showed a quarter-on-quarter improvement, with profits increasing from 138 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730373606000,
            "Source": "result"
        },
        {
            "Title": "AGS Transact: UPI QR Cash Withdrawals at 1,000+ ATMs",
            "Summary": "AGS Transact Technologies has implemented UPI QR-based cash withdrawals at over 1,000 ATMs of a public sector bank. This feature allows customers to withdraw cash by scanning QR codes through their bank's mobile app, enhancing security and user experience. The company's shares rose 3.34% on the NSE following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1729671193000,
            "Source": "normal_news"
        },
        {
            "Title": "AGS Transact Tech Enables UPI QR-Based Cash Withdrawals on Public Sector Bank ATMs",
            "Summary": "AGS Transact Tech has implemented UPI QR-based cash withdrawal functionality on over 1,000 ATMs of a public sector bank. This new feature allows for card-free banking, offering customers a faster and more convenient way to withdraw cash using UPI QR codes.",
            "Sentiment": "positive",
            "PublishDate": 1729661108000,
            "Source": "corporate_action"
        },
        {
            "Title": "AGS Transact Tech Secures Contract Extension from Indian Bank",
            "Summary": "<p>AGS Transact Tech has been granted an <span class=\"positive\">extension</span> on their contract with Indian Bank. The extended contract is projected to <span class=\"positive\">generate revenue</span> of <b>50 crore rupees</b> over a period of <b>3 years</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728552310000,
            "Source": "corporate_action"
        }
    ]
}