{
    "Symbol": "AHCL",
    "ISIN": "INE0Y8W01017",
    "News": [
        {
            "Title": "Anlon Healthcare Q3 Results & Leadership Changes",
            "Summary": "Anlon Healthcare reports strong Q3FY26 performance with ₹515.20 lakh profit and announces key leadership changes including new CFO and Independent Director appointments.",
            "Sentiment": "positive",
            "PublishDate": 1770636780992,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anlon Healthcare announces new product development",
            "Summary": "Anlon Healthcare Limited informs stock exchanges about new product development and positive impact from India-EU trade agreement on company operations under Regulation 30 compliance.",
            "Sentiment": "positive",
            "PublishDate": 1769590228620,
            "Source": "stocks"
        },
        {
            "Title": "Neomile Reduces Stake in Anlon Healthcare by 2.46%",
            "Summary": "Neomile Asset Managers sold 13.07 lakh shares of Anlon Healthcare through open market transactions, reducing their holding from 7.62% to 5.16% between November 2025 and January 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767961219266,
            "Source": "co_actions_results"
        },
        {
            "Title": "Neomile Asset Managers Sells Anlon Healthcare Stake",
            "Summary": "Neomile Asset Managers and its funds disposed of 13.07 lakh shares in Anlon Healthcare, reducing their combined stake from 7.62% to 5.16% through open market transactions between November 2025 and January 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767960963941,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anlon Healthcare Completes 67.48% Stake Acquisition",
            "Summary": "Anlon Healthcare Limited successfully completed acquisition of 67.48% equity stake in Apiqo Organics Private Limited on January 9, 2026, making it a subsidiary under SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1767950257488,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anlon Healthcare to Open Marketing Office in Ahmedabad",
            "Summary": "Anlon Healthcare Limited announces plans to establish a new marketing office in Ahmedabad, Gujarat, as part of its business expansion strategy in the near future.",
            "Sentiment": "positive",
            "PublishDate": 1766138668376,
            "Source": "stocks"
        },
        {
            "Title": "Anlon Healthcare Q1FY26 Results Show Mixed Performance",
            "Summary": "Anlon Healthcare reported ₹354.69 lacs net profit for Q1FY26, down from ₹376.35 lacs in Q1FY25. Revenue declined 12% YoY to ₹3,329.72 lacs despite strong operational efficiency improvements.",
            "Sentiment": "neutral",
            "PublishDate": 1766056852741,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anlon Healthcare Seeks Shareholder Approval to Modify IPO Fund Usage for Strategic Acquisitions",
            "Summary": "Anlon Healthcare Limited has issued a postal ballot notice seeking shareholder approval to vary its IPO fund utilization, proposing to use ₹2,332.69 lakhs from capital expenditure proceeds for strategic acquisitions of Bizotic Lifescience Private Limited and Apiqo Organics Private Limited. The company aims to achieve inorganic growth and manufacturing capacity expansion through these brownfield investments instead of the originally planned greenfield expansion, with voting scheduled from December 9, 2025 to January 7, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1765203733771,
            "Source": "corporate_action"
        },
        {
            "Title": "Anlon Healthcare Acquires 67.48% Stake in Apiqo Organics for Rs 54 Crore",
            "Summary": "Anlon Healthcare Limited entered into a Share Purchase Agreement to acquire 67.48% shareholding in Apiqo Organics Private Limited for Rs 5.40 crore, making it a subsidiary. The acquisition enhances vertical integration and adds 700-800 MT annual manufacturing capacity for pharmaceutical intermediates, strengthening the company's position as a reliable partner for global pharmaceutical companies.",
            "Sentiment": "positive",
            "PublishDate": 1764662849030,
            "Source": "order&deals"
        },
        {
            "Title": "Anlon Healthcare Acquires Majority Stake in Bizotic Lifescience for ₹38 Million",
            "Summary": "Anlon Healthcare is acquiring a 56.67% stake in Bizotic Lifescience for ₹38 million rupees. This acquisition will give Anlon Healthcare majority control over Bizotic Lifescience's operations and business.",
            "Sentiment": "positive",
            "PublishDate": 1764332383072,
            "Source": "order&deals"
        },
        {
            "Title": "Anlon Healthcare Reports Strong Q2 FY26 Results, Plans Major Capacity Expansion",
            "Summary": "Anlon Healthcare delivered exceptional quarterly results with total income rising 116% to INR 52.32 crore and PAT jumping nearly 4x to INR 9.32 crore, driven by strong operating leverage and improved business mix. The company is planning a 700 metric ton greenfield expansion and exploring inorganic acquisitions to meet growing demand from regulated markets, targeting 30% revenue CAGR over the next three years.",
            "Sentiment": "positive",
            "PublishDate": 1763985049814,
            "Source": "earnings"
        },
        {
            "Title": "Anlon Healthcare Releases Q2/H1 FY26 Investor Presentation",
            "Summary": "Anlon Healthcare Limited submitted its quarterly investor presentation to BSE and NSE exchanges, showcasing its pharmaceutical intermediates and APIs business operations across 15 countries. The Gujarat-based company operates with 400 MTPA manufacturing capacity at 84.41% utilization and has filed 21 Drug Master Files with global regulatory authorities.",
            "Sentiment": "neutral",
            "PublishDate": 1763527891190,
            "Source": "stock"
        },
        {
            "Title": "Anlon Healthcare Schedules Earnings Conference Call for Quarterly Results Discussion",
            "Summary": "Anlon Healthcare Limited has announced an earnings conference call scheduled for November 19, 2025, at 4:00 PM IST to discuss its unaudited financial results for the quarter and half year ended September 30, 2025. The call will be led by Chairman Managing Director Mr. Punit Rasadia and will focus on publicly available information without discussing any unpublished price-sensitive information.",
            "Sentiment": "neutral",
            "PublishDate": 1763103498717,
            "Source": "earnings"
        },
        {
            "Title": "Anlon Healthcare Reports Strong Q2 Performance with 37.8% Revenue Growth",
            "Summary": "Anlon Healthcare Limited reported quarterly results for the period ended September 30, 2025. Revenue from operations increased to Rs. 3,329.2 lacs compared to Rs. 2,416.63 lacs in the previous year quarter, representing a 37.8% growth. Profit after tax rose to Rs. 931.73 lacs from Rs. 359.60 lacs year-over-year. For the half-year period, revenue reached Rs. 6,199.88 lacs versus Rs. 5,355.74 lacs previously, while profit after tax was Rs. 1,286.42 lacs compared to Rs. 635.58 lacs. The company's equity shares are listed on NSE (symbol: AHCL) and BSE (code: 544497) since September 3, 2025. The pharmaceutical manufacturer specializes in Active Pharmaceutical Ingredients (APIs) and drug intermediates. Total assets increased to Rs. 28,751.92 lacs from Rs. 18,848.09 lacs as of March 31, 2025. The company utilized Rs. 8,245.45 lacs from its IPO proceeds of Rs. 12,103 lacs, with Rs. 3,857.55 lacs remaining unutilized.",
            "Sentiment": "positive",
            "PublishDate": 1762856350939,
            "Source": "earnings"
        },
        {
            "Title": "Anlon Healthcare Reports Strong Q2 Growth with Revenue Doubling Year-over-Year",
            "Summary": "Anlon Healthcare delivered robust Q2 performance with revenue reaching 522 million rupees, more than doubling from 242 million rupees in the same quarter last year. Net profit surged to 93 million rupees from 26 million rupees year-over-year. EBITDA increased to 137 million rupees compared to 75 million rupees in the previous year, though EBITDA margin compressed to 26.3% from 31% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762852528549,
            "Source": "earnings"
        },
        {
            "Title": "Neomile Asset Managers Reduces Stake in Anlon Healthcare Through Open Market Sale",
            "Summary": "Neomile Asset Managers Private Limited has sold 14,75,992 shares of Anlon Healthcare Limited through open market transactions between November 3-4, 2025. The sale reduced Neomile's holding from 10.40% to 7.62% of the company's total share capital. The transactions involved 2.78% of Anlon Healthcare's equity, with the company's total share capital remaining at 5,31,51,500 shares. Neomile Growth Fund-Series I was acting in concert with Neomile Corporate Advisory Limited as the seller. Anlon Healthcare is listed on both NSE and BSE exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1762405417806,
            "Source": "corporate_action"
        },
        {
            "Title": "Anlon Healthcare Board Authorizes Commercial Property Purchase in Rajkot",
            "Summary": "Anlon Healthcare Limited's Board of Directors authorized the purchase of a commercial office property located at Golden Crown, New 150 Feet Ring Road, Rajkot, Gujarat. The board meeting was held on September 27, 2025, and designated Whole Time Director Meet Atulkumar Vachhani to handle the property acquisition and related procedures. The company trades on BSE under scrip code 544497 and on NSE under scrip code AHCL.",
            "Sentiment": "neutral",
            "PublishDate": 1758982789207,
            "Source": "stock"
        },
        {
            "Title": "Anlon Healthcare Develops Two New Anti-Malarial Products for November 2025 Launch",
            "Summary": "Anlon Healthcare Limited announced the successful development of two new anti-malarial products: Artemether and Lumefantrine. Both products are expected to launch in November 2025. The development is part of the company's strategy to expand its product portfolio and serve evolving client needs. The company will provide further updates on developments to stock exchanges.",
            "Sentiment": "positive",
            "PublishDate": 1758361281817,
            "Source": "stock"
        },
        {
            "Title": "Anlon Healthcare Limited Discloses Shareholding Change Following Equity Share Acquisition",
            "Summary": "Anlon Healthcare Limited has disclosed a change in shareholding following the acquisition of equity shares in the company. The disclosure was made under Regulation 29(2) of SEBI (Substantial Acquisition of Shares & Takeovers) Regulation, 2011. The company notified both BSE and NSE exchanges about this shareholding change. Anlon Healthcare trades on BSE with scrip code 544497 and on NSE with scrip code AHCL.",
            "Sentiment": "neutral",
            "PublishDate": 1757936068433,
            "Source": "corporate_action"
        }
    ]
}