{
    "Symbol": "AHLEAST",
    "ISIN": "INE926K01017",
    "News": [
        {
            "Title": "Asian Hotels Board Meet Set for Feb 13 to Review Q3 Results",
            "Summary": "Asian Hotels (East) Limited has scheduled its board meeting for February 13, 2026, to consider and approve Q3FY26 financial results. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769775988823,
            "Source": "co_actions_results"
        },
        {
            "Title": "Asian Hotels (East) Reports Q2 Profit Despite Subsidiary Legal Challenges",
            "Summary": "Asian Hotels (East) Limited posted standalone net profit of Rs 476.17 lakhs for Q2 ended September 30, 2025, while facing potential asset impairment concerns over its wholly-owned subsidiary GJS Hotels following government order to vacate Odisha property and forfeiture of Rs 350 lakhs bank guarantee. The auditors highlighted that without recognizing impairment provisions totaling Rs 1,255.25 lakhs related to GJS Hotels investments, the reported profits could turn into losses, raising questions about asset recoverability amid ongoing legal proceedings.",
            "Sentiment": "negative",
            "PublishDate": 1763175548131,
            "Source": "earnings"
        },
        {
            "Title": "Asian Hotels (East) to Convert Rs 234 Crore Loan into Equity Shares of Subsidiary Novak Hotels",
            "Summary": "Asian Hotels (East) Limited's Board approved converting outstanding loans of up to Rs 234 crores into 23.40 crore equity shares of its wholly-owned subsidiary Novak Hotels Pvt Ltd, which will execute the Hyatt Regency Mumbai hotel project. The debt-to-equity conversion aims to strengthen the subsidiary's capital structure, reduce indebtedness, and improve consolidated financial position without any fresh capital infusion.",
            "Sentiment": "positive",
            "PublishDate": 1763139487782,
            "Source": "corporate_action"
        },
        {
            "Title": "Asian Hotels (East) Reports Q1 Profit of Rs 454.89 Lakhs Despite Auditor Concerns Over Subsidiary Investment",
            "Summary": "Asian Hotels (East) Limited reported a net profit of Rs 454.89 lakhs for the quarter ended June 30, 2025, compared to Rs 320.68 lakhs in the same period last year. Revenue from operations declined to Rs 2,495.73 lakhs from Rs 2,246.70 lakhs year-over-year. However, auditors raised significant concerns about the company's investment in wholly-owned subsidiary GJS Hotels Limited. The Government of Odisha ordered GJS to vacate leased property in November 2024 due to non-compliance with lease terms, resulting in forfeiture of a Rs 350 lakhs bank guarantee. The company holds Rs 860.86 lakhs in equity investments and Rs 394.39 lakhs in loans to GJS. Auditors believe impairment provisions totaling Rs 1,255.25 lakhs should have been recognized, which would have resulted in a net loss of Rs 800.36 lakhs instead of the reported profit. GJS has filed a writ petition challenging the government order. The company also faces income tax disputes with demands of Rs 13,927.73 lakhs and Rs 1,420.18 lakhs for different assessment years, both under appeal. Earnings per share stood at Rs 2.63 for the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1755184818419,
            "Source": "earnings"
        }
    ]
}