{
    "Symbol": "AHLUCONT",
    "ISIN": "INE758C01029",
    "News": [
        {
            "Title": "Ahluwalia Contracts Q3FY26 Conference Call Feb 16",
            "Summary": "Ahluwalia Contracts schedules conference call for February 16, 2026 at 3:30 PM IST to discuss Q3FY26 results with multiple international dial-in options available.",
            "Sentiment": "neutral",
            "PublishDate": 1770717548446,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ahluwalia Contracts Board Meet on Feb 14 for Q3 Results",
            "Summary": "Ahluwalia Contracts schedules board meeting on February 14, 2026 to consider Q3FY26 unaudited financial results and scheme of amalgamation of five wholly owned subsidiaries.",
            "Sentiment": "neutral",
            "PublishDate": 1770045400983,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ahluwalia Contracts Wins ₹3,070 Cr Contract",
            "Summary": "Ahluwalia Contracts secures major contract worth ₹3,070 crores, strengthening its order book. The construction company currently maintains a market capitalization of ₹6,200 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768544514108,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ahluwalia Contracts Gets AA- Credit Rating Reaffirmed",
            "Summary": "CARE Ratings reaffirmed Ahluwalia Contracts' long-term bank facilities rating at AA- with stable outlook based on FY25 audited and H1 FY26 unaudited financial performance review.",
            "Sentiment": "positive",
            "PublishDate": 1766212826255,
            "Source": "stocks"
        },
        {
            "Title": "Ahluwalia Contracts Wins ₹888.38 Cr Ayodhya Project",
            "Summary": "Ahluwalia Contracts secures major construction order from Bihar State Tourism Development Corporation for Shri Ram Janmabhoomi Tirtha Kshetra development in Ayodhya, valued at ₹888.38 crores with 42-month execution timeline.",
            "Sentiment": "positive",
            "PublishDate": 1765883310834,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ahluwalia Contracts Reports Strong Q2FY26 Results with 106% PAT Growth",
            "Summary": "Ahluwalia Contracts achieved turnover of Rs. 1,177.30 crores and PAT of Rs. 79.45 crores in Q2FY26, registering growth of 16.39% and 106.07% respectively compared to Q2FY25. The company maintains net order book of Rs. 18,057.60 crores with EBITDA margin improving to 10.92% from 7.25% in the corresponding period.",
            "Sentiment": "positive",
            "PublishDate": 1763710996814,
            "Source": "earnings"
        },
        {
            "Title": "Ahluwalia Contracts Surges 11% on Strong September Quarter Performance",
            "Summary": "Ahluwalia Contracts shares jumped over 10% to Rs 980 after reporting doubled net profit of Rs 78.6 crore and 16.4% revenue growth to Rs 1,177 crore in September quarter results. The construction company's margins improved significantly from 7.3% to 10.9% year-on-year, with EBITDA rising 75.2% to Rs 129 crore.",
            "Sentiment": "positive",
            "PublishDate": 1763353463800,
            "Source": "earnings"
        },
        {
            "Title": "Ahluwalia Contracts Reports Strong Q2FY26 Performance with 41% EBITDA Growth",
            "Summary": "Ahluwalia Contracts delivered robust quarterly results with total income of ₹11,923 million and EBITDA of ₹1,286 million, marking a 10.9% EBITDA margin compared to 8.6% in the previous quarter. The construction company maintains a strong unexecuted order book of ₹180,576 million as of September 30, 2025, with 43 ongoing projects across 15 states and overseas operations.",
            "Sentiment": "positive",
            "PublishDate": 1763198843750,
            "Source": "earnings"
        },
        {
            "Title": "Ahluwalia Contracts Approves 30% Dividend of Re. 0.60 Per Share for FY2025",
            "Summary": "Ahluwalia Contracts (India) Ltd shareholders approved a 30% dividend of Re. 0.60 per share for the financial year ending March 31, 2025, at their 45th Annual General Meeting held on September 29, 2025. The dividend will be settled by October 28, 2025, and credited to shareholders' bank accounts. The company will deduct tax at source from dividend payments as required under the Income Tax Act, with TDS rates varying based on shareholders' residential status and category.",
            "Sentiment": "positive",
            "PublishDate": 1759208755993,
            "Source": "corporate_action"
        },
        {
            "Title": "Ahluwalia Contracts Appoints New Auditors and Sets 46th AGM Date for September 29, 2025",
            "Summary": "Ahluwalia Contracts (India) Ltd's Board of Directors approved several key appointments during their meeting on August 28, 2025. The company appointed SCV & Co., LLP as statutory auditors for five years (2025-26 to 2029-30), replacing Amod Agrawal and Associates whose term ends at the upcoming AGM. N M & Co. was appointed as cost auditor for financial year 2025-26, while Santosh Kumar Pradhan was named secretarial auditor for five years (2025-26 to 2029-30). The Board also approved the Directors' Report for the year ended March 31, 2025, and scheduled the 46th Annual General Meeting for September 29, 2025 at 12:30 p.m. via video conferencing. The record date for dividend payment and AGM participation was fixed as September 22, 2025, with share transfer books closing from September 23-29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1756361898128,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ahluwalia Contracts Holds Analyst Call to Discuss Q1 FY2025-26 Results",
            "Summary": "Ahluwalia Contracts (India) Ltd, an Engineering, Designing & Construction company, conducted an analyst and institutional investor meeting on August 18, 2025, to discuss their Q1 FY2025-26 unaudited results. The company has made an audio recording of the conference call available on their website and notified stock exchanges about the meeting. The company is listed on BSE, National Stock Exchange of India, and Calcutta Stock Exchange, with its registered office located in New Delhi.",
            "Sentiment": "neutral",
            "PublishDate": 1755596947970,
            "Source": "earnings"
        },
        {
            "Title": "Ahluwalia Contracts Reports Strong Q1 Growth with 67% Jump in Net Profit",
            "Summary": "Ahluwalia Contracts delivered robust quarterly results with net profit rising to 511 million rupees from 306 million rupees year-over-year. Revenue increased to 10 billion rupees compared to 9.2 billion rupees in the same period last year. EBITDA grew significantly to 862.8 million rupees from 604.5 million rupees, while EBITDA margin expanded to 8.59% from 6.58% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1755469970007,
            "Source": "earnings"
        },
        {
            "Title": "Ahluwalia Contracts Board Approves Quarterly Financial Results for June 30, 2025",
            "Summary": "Ahluwalia Contracts (India) Ltd's Board of Directors approved the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The board meeting was held on August 14, 2025, through physical/virtual/video conferencing mode and lasted from 3:30 p.m. to 4:30 p.m. The company also received a Limited Review Report from statutory auditors. The engineering, designing and construction company is listed on NSE (AHLUCONT) and BSE (532811).",
            "Sentiment": "neutral",
            "PublishDate": 1755174561208,
            "Source": "earnings"
        },
        {
            "Title": "Ahluwalia Contracts Reports Strong Q1 Growth with 67% Jump in Net Profit",
            "Summary": "Ahluwalia Contracts delivered robust quarterly performance with net profit rising to 511 million rupees from 306 million rupees year-over-year. Revenue increased to 10 billion rupees compared to 9.2 billion rupees in the same period last year. The company's EBITDA grew significantly to 862.8 million rupees from 604.5 million rupees, while EBITDA margin expanded to 8.59% from 6.58% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1755171360295,
            "Source": "earnings"
        },
        {
            "Title": "Ahluwalia Contracts: Secures ₹2,089 Crore Order from DLF",
            "Summary": "Ahluwalia Contracts (India) Ltd has won a ₹2,089 crore order from DLF Ltd for civil and structural works on DLF's premium housing project in Gurugram. The project is set to be completed in 44 months. This follows two recent major contract wins totaling ₹1,103.56 crore announced on June 27.",
            "Sentiment": "positive",
            "PublishDate": 1752487686000,
            "Source": "order&deals"
        },
        {
            "Title": "Ahluwalia Contracts Secures 2,089 Crore Rupee Contract",
            "Summary": "Ahluwalia Contracts has received a contract valued at 2,089 Crore Rupees. The company's current market capitalization is 6,600 Crore Rupees.",
            "Sentiment": "positive",
            "PublishDate": 1752485192000,
            "Source": "default"
        },
        {
            "Title": "Ahluwalia Contracts: Secures Rs 1,100 Crore in New Construction Projects",
            "Summary": "Ahluwalia Contracts (India) has won two major construction projects worth a combined Rs 1,103.56 crore. The first order, valued at Rs 821 crore, is for a residential development in Gurugram. The second, worth Rs 282.56 crore, is for a group housing project in Bengaluru. Both projects are to be completed within 32-36 months.",
            "Sentiment": "positive",
            "PublishDate": 1751255118000,
            "Source": "order&deals"
        },
        {
            "Title": "Ahluwalia Contracts (India) Ltd: Secures ₹1,103 Crore in New Construction Orders",
            "Summary": "Ahluwalia Contracts (India) Ltd has won two major domestic construction projects worth ₹1,103.56 crore. The first order, valued at ₹821 crore, is for residential towers in Gurugram. The second order, worth ₹282.56 crore, is for a housing project in Bengaluru. The company's stock rose over 5% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1751017165000,
            "Source": "order&deals"
        },
        {
            "Title": "Ahluwalia Contracts Secures ₹1104 Crore Order",
            "Summary": "Ahluwalia Contracts has secured a new order valued at ₹1104 crore. The news briefly mentions the company's name and the value of the order without providing additional details about the nature of the contract or the client.",
            "Sentiment": "positive",
            "PublishDate": 1751015682000,
            "Source": "default"
        },
        {
            "Title": "Ahluwalia Contracts: Dolat Capital Downgrades Despite Order Book Growth",
            "Summary": "Ahluwalia Contracts secured orders worth Rs 84.4 billion in FY25, with an order book of Rs 157.8 billion as of March 2025, providing 3.8x revenue visibility. The company is L1 in projects worth Rs 18.0 billion and expects Rs 50 billion inflow in FY26E. Dolat Capital downgraded the stock to 'Reduce' but increased the target price.",
            "Sentiment": "neutral",
            "PublishDate": 1748938147000,
            "Source": "earnings"
        },
        {
            "Title": "Ahluwalia Contracts Targets 30% Growth and Rs. 6,000 Cr Revenue by FY27",
            "Summary": "Ahluwalia Contracts has announced ambitious growth plans during a recent concall. The company expects to grow at 30% and aims to achieve Rs. 6,000 crore in revenue by FY27. For the current year, the company is targeting an output of Rs. 400 crore to 500 crore from the Signature Global project.",
            "Sentiment": "positive",
            "PublishDate": 1748920468000,
            "Source": "default"
        },
        {
            "Title": "Ahluwalia Contracts Provides Financial Projections and Order Inflow Targets",
            "Summary": "Ahluwalia Contracts has shared financial projections during a concall update. The company expects a contribution of Rs. 150 crore from the Gem and Jewelry Park, starting in Q3 of H2. They anticipate an additional Rs. 5,000 crore in orders this year, on top of Rs. 2,000-2,100 crore already received. The revenue guidance for the financial year is about 15% growth. The targeted order inflow for the financial year is expected to be around Rs. 7,000-8,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1748920260000,
            "Source": "default"
        },
        {
            "Title": "Ahluwalia Contracts Reports Q4 Financial Results",
            "Summary": "Ahluwalia Contracts has announced its Q4 financial results. The company reported a net profit of 832 million rupees, compared to 2 billion rupees year-over-year and 494 million rupees quarter-over-quarter. Q4 revenue stood at 12.15 billion rupees, up from 11.64 billion rupees in the same quarter last year. The company reported an exceptional item of 1.95 billion rupees. Profit before tax (PBT) for Q4 was 1.1 billion rupees, compared to 741 million rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1748823171000,
            "Source": "default"
        },
        {
            "Title": "Ahluwalia Contracts Reports Q4 Financial Results",
            "Summary": "Ahluwalia Contracts has reported its Q4 financial results. The company's profit before tax (PBT) increased to 1.1 billion rupees from 741 million rupees year-over-year. EBITDA rose to 1.23 billion rupees from 1.04 billion rupees, with the EBITDA margin improving to 10.17% from 8.96%. However, net profit decreased to 832 million rupees from 2 billion rupees year-over-year, but increased from 494 million rupees quarter-over-quarter. Revenue grew to 12.15 billion rupees from 11.64 billion rupees year-over-year. The company also reported an exceptional item of 1.95 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1748606817000,
            "Source": "result"
        },
        {
            "Title": "Ahluwalia Contracts Secures 3.96 Billion Rupee Order from Godrej Properties",
            "Summary": "Ahluwalia Contracts has received a significant order worth 3.96 billion rupees (approximately $47.5 million) from Godrej Properties. This order represents a major business development for Ahluwalia Contracts and potentially indicates growth in the real estate and construction sectors.",
            "Sentiment": "positive",
            "PublishDate": 1744677306000,
            "Source": "order&deals"
        },
        {
            "Title": "Ahluwalia Contracts Secures 3.96 Billion Rupee Order from Godrej Properties",
            "Summary": "Ahluwalia Contracts (India) Limited has been awarded a significant order worth 3.96 billion rupees from Godrej Properties. This new contract represents a major business development for Ahluwalia Contracts and showcases the company's continued growth in the construction sector.",
            "Sentiment": "positive",
            "PublishDate": 1744614983000,
            "Source": "order&deals"
        },
        {
            "Title": "Ahluwalia Contracts Reports Decline in Q3 Profit and Revenue",
            "Summary": "Ahluwalia Contracts has reported a decrease in both net profit and revenue for the third quarter compared to the same period last year. The company's net profit fell to 494 million rupees from 707 million rupees year-over-year. Revenue also declined to 9.52 billion rupees from 10 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1739320526000,
            "Source": "earnings"
        },
        {
            "Title": "Ahluwalia Contracts Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Ahluwalia Contracts has reported a decrease in its third-quarter EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) to 843 million rupees, down from 1.12 billion rupees in the same period last year. The company's EBITDA margin also declined to 8.85% from 10.90% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739278325000,
            "Source": "earnings"
        },
        {
            "Title": "Ahluwalia Contracts Reports Decline in Q3 Profit and Revenue",
            "Summary": "Ahluwalia Contracts has reported a decrease in both net profit and revenue for the third quarter compared to the same period last year. The company's net profit fell to 494 million rupees from 707 million rupees, while revenue decreased to 9.52 billion rupees from 10 billion rupees.",
            "Sentiment": "negative",
            "PublishDate": 1739278320000,
            "Source": "earnings"
        },
        {
            "Title": "Ahluwalia Contracts Q2 Financial Results",
            "Summary": "Ahluwalia Contracts (India) reported a decrease in Q2 EBITDA to 734 million rupees from 898 million rupees year-over-year. The company's Q2 EBITDA margin also declined to 7.25% from 9.96% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731585607000,
            "Source": "result"
        },
        {
            "Title": "Ahluwalia Contracts Reports Q2 Revenue Growth",
            "Summary": "Ahluwalia Contracts (India) has reported a revenue of 10.1 billion rupees for the second quarter, compared to 9 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731585347000,
            "Source": "result"
        },
        {
            "Title": "Ahluwalia Contracts Q2 Net Profit Declines Year-over-Year",
            "Summary": "Ahluwalia Contracts (India) reported a net profit of 383.6 million rupees for the second quarter, showing a decrease from 553 million rupees in the same quarter last year. However, it represents an increase from 306 million rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1731585297000,
            "Source": "result"
        },
        {
            "Title": "Ahluwalia Contracts: Secures ₹1,095 Crore Order from DLF City Centre",
            "Summary": "<p>Ahluwalia Contracts (India) Ltd. has <span class='positive'>received</span> a <span class='positive'>₹1,095 crore order</span> from DLF City Centre for <span class='neutral'>construction work</span> in Gurugram. The project, to be <span class='neutral'>completed in 21 months</span>, involves <b>civil and composite steel structural works</b> for Block 5, 6, and 7 at Downtown, Phase-2, Sector-25A.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728630145000,
            "Source": "normal_news"
        },
        {
            "Title": "Ahluwalia Contracts Secures Major Order Worth 1,095 Crore Rupees",
            "Summary": "<p><span class='positive'>Ahluwalia Contracts</span>, a <b>construction company</b>, has <span class='positive'>won</span> a <span class='positive'>significant order</span> valued at <b>1,095 crore rupees</b> (approximately $132 million USD). This <span class='positive'>large contract</span> is likely to <span class='positive'>boost</span> the company's <b>project pipeline</b> and potentially <span class='positive'>impact</span> its future <b>revenue</b> and <b>growth prospects</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728626151000,
            "Source": "corporate_action"
        }
    ]
}