{
    "Symbol": "AIAENG",
    "ISIN": "INE212H01026",
    "News": [
        {
            "Title": "AIA Engineering Q3 Net Profit Rises 13.5% YoY",
            "Summary": "AIA Engineering reports consolidated net profit of ₹2.94 billion for Q3, marking a 13.5% increase from ₹2.59 billion in the same quarter last year, demonstrating strong operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1769760809071,
            "Source": "co_actions_results"
        },
        {
            "Title": "AIA Engineering's Subsidiary Completes 70% Acquisition of Australian Mining Company VMPS",
            "Summary": "Vega Industries (Middle East) FZC, a wholly-owned subsidiary of AIA Engineering, acquired an additional 14% stake in VEGA MPS PTY LIMITED for AUD 5.64 million, completing its 70% acquisition of the Australian mining liners business. The acquisition strengthens AIA Engineering's mining liner business segment through VMPS's design, supply and engineering capabilities for the mineral processing industry.",
            "Sentiment": "positive",
            "PublishDate": 1765358144749,
            "Source": "corporate_action"
        },
        {
            "Title": "AIA Engineering Reports Stable Q2 Performance, Wins Major Chile Contract for Hi-Chrome Solutions",
            "Summary": "AIA Engineering Limited reported quarterly results with sales of 63,000 tons generating revenue of Rs. 1,029 crores, EBITDA of Rs. 395 crores, and profit after tax of Rs. 277 crores. The company secured an 18-month contract from a Chilean customer worth approximately Rs. 33 million for 22,000-23,000 tons, marking its first major breakthrough in the South American copper mining market with hi-chrome grinding media solutions. This represents the company's first customer using hi-chrome for grinding media in that region. The company is conducting trials at multiple mining sites and expects potential volume growth of 30,000 tons annually from next year, driven by its integrated liner and grinding media package solutions. Management indicated that most future sales will come from solution-based offerings rather than individual products, which could help avoid anti-dumping and pricing pressures. The company maintains current capacity utilization at 55-60% of its 460,000 tons annual capacity.",
            "Sentiment": "positive",
            "PublishDate": 1762767234708,
            "Source": "earnings"
        },
        {
            "Title": "AIA Engineering Block Trade Worth Rs. 60.87 Crores Executed on NSE",
            "Summary": "AIA Engineering executed a block trade on the National Stock Exchange involving 181,277 shares at a price of Rs. 3,357.70 per share. The total transaction value amounted to Rs. 60.87 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1762753769212,
            "Source": "order&deals"
        },
        {
            "Title": "AIA Engineering Projects 30,000 Tons Volume Growth, EBITDA Margins of 20-22%",
            "Summary": "AIA Engineering expects at least 30,000 tons of annual volume growth next year. The company anticipates EBITDA margins of 20-22% but believes 24-25% margins are achievable in the long term. Annual maintenance capex is guided at around INR 150 crores. Formal guidance will be provided after reviewing ongoing large trials.",
            "Sentiment": "positive",
            "PublishDate": 1762746124914,
            "Source": "stock"
        },
        {
            "Title": "AIA Engineering Reports Strong Q2 Performance with 58% Revenue Growth",
            "Summary": "AIA Engineering Limited announced quarterly results for the period ended September 30, 2025. The company reported total revenue from operations of Rs 989.79 crores for the quarter, compared to Rs 603.27 crores in the previous quarter, representing significant growth. Net profit for the quarter stood at Rs 277.44 crores versus Rs 305.02 crores in the prior quarter. For the half-year period, total revenue reached Rs 1,792.53 crores compared to Rs 1,717.01 crores in the corresponding period last year. The company operates in manufacturing of high chrome mill internals as its primary business segment. The Board of Directors decided to discontinue manufacturing operations at the Nagpur unit, though this closure will not adversely affect production, business operations, or profitability. The company faces cash deposit requirements for Countervailing Duty at 3.16% and Anti-Dumping Duty at 6.91% effective from June 13, 2025, on certain high chrome iron grinding media imported from India following a US Department of Commerce determination.",
            "Sentiment": "positive",
            "PublishDate": 1762522231652,
            "Source": "earnings"
        },
        {
            "Title": "AIA Engineering Reports Growth in Q2 Financial Results",
            "Summary": "AIA Engineering reported Q2 revenue of 10.5 billion rupees compared to 10.4 billion rupees in the same period last year. The company's consolidated net profit increased to 2.8 billion rupees from 2.6 billion rupees year-over-year. EBITDA rose to 2.97 billion rupees from 2.75 billion rupees, while EBITDA margin improved to 28.34% from 26.40% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762503812912,
            "Source": "earnings"
        },
        {
            "Title": "AIA Engineering Schedules Investor Conference Call for Q2/H1 FY2026 Results Discussion",
            "Summary": "AIA Engineering Limited has announced an investor conference call scheduled for November 7, 2025, at 4:30 p.m. IST to discuss the company's unaudited financial results for the quarter and half-year ended September 30, 2025. The management team will present the company's financial performance and address investor questions during the call. Dial-in numbers have been provided for participants, including a universal dial-in number and toll-free access.",
            "Sentiment": "neutral",
            "PublishDate": 1762188556213,
            "Source": "earnings"
        },
        {
            "Title": "AIA Engineering's Subsidiary Welcast Steels to Permanently Close Bengaluru Manufacturing Facility",
            "Summary": "AIA Engineering Limited announced that its subsidiary Welcast Steels Limited will permanently close its manufacturing facility in Bengaluru on December 15, 2025. The Board of Directors of Welcast Steels made this decision on October 15, 2025. The facility, established in 1972, manufactures hi-chrome grinding media used in cement, mining and thermal power plants. The closure is attributed to outdated technology, high production costs, declining capacity utilization, and economic unviability of operations. Modernizing the plant is not feasible due to high investment requirements and space constraints. The closed facility contributed approximately 84.50 crores in turnover (1.97% of total) and 39.72 crores in net worth (0.57% of total) during the last financial year. AIA Engineering stated the closure will not adversely affect operations as the company has sufficient surplus capacity to meet requirements.",
            "Sentiment": "negative",
            "PublishDate": 1760522839352,
            "Source": "corporate_action"
        },
        {
            "Title": "AIA Engineering Secures $32.90 Million Order from Chilean Copper Mine",
            "Summary": "AIA Engineering Ltd has received a $32.90 million order from a copper mine in Chile for high-chrome grinding media. The order is scheduled to be completed over an 18-month period beginning in November 2025.",
            "Sentiment": "positive",
            "PublishDate": 1759821569194,
            "Source": "order&deals"
        },
        {
            "Title": "AIA Engineering Block Trade Worth Rs. 61.87 Crores Executed on NSE",
            "Summary": "AIA Engineering witnessed a block trade on the National Stock Exchange involving 201,512 shares at a price of Rs. 3,070.30 per share. The total transaction value amounted to Rs. 61.87 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1759221758105,
            "Source": "order&deals"
        },
        {
            "Title": "AIA Engineering Block Trade Worth Rs. 67.59 Crores Executed on NSE",
            "Summary": "AIA Engineering executed a block trade on the National Stock Exchange involving 220,335 shares at a price of Rs. 3,067.80 per share. The total transaction value amounted to Rs. 67.59 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1758880382447,
            "Source": "order&deals"
        },
        {
            "Title": "AIA Engineering Appoints Udayan Choksi as Independent Director for Five-Year Term",
            "Summary": "AIA Engineering Limited appointed Mr. Udayan Dileep Choksi as an Independent Director for a five-year term effective September 20, 2025. The appointment was approved by shareholders at the company's 35th Annual General Meeting held on September 15, 2025. Mr. Choksi is a Chartered Accountant and Lawyer with nearly 25 years of practice experience, specializing in GST, pre-GST taxes, Customs and International Trade. He advises multinational corporations and large Indian businesses on tax matters and is a Partner at Veritas Legal. The company confirmed that Mr. Choksi meets the independence criteria under the Companies Act, 2013 and SEBI Listing Regulations, and has no relationships with other directors on the Board.",
            "Sentiment": "positive",
            "PublishDate": 1757938635694,
            "Source": "corporate_governance"
        },
        {
            "Title": "AIA Engineering Block Trade Worth Rs. 36.42 Crores Executed on NSE",
            "Summary": "AIA Engineering Ltd. witnessed a block trade on the National Stock Exchange worth Rs. 36.42 crores. The transaction involved approximately 120,091 shares at a price of Rs. 3,033.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1756446714092,
            "Source": "order&deals"
        },
        {
            "Title": "AIA Engineering Reports Flat Q1 FY26 Volume Growth at 60,156 Tons with Strong Margins",
            "Summary": "AIA Engineering reported quarterly results with production of 59,500 tons and sales of 60,156 tons, remaining flat compared to the same quarter last year. The company generated revenue of INR 1,026 crores with realization of INR 170 per kg and achieved EBITDA of INR 420.39 crores at 40.46% margin. Profit after tax reached INR 305 crores, up from INR 259 crores in the previous year's first quarter. The company's net cash position stands at INR 4,083 crores. Management expects the current fiscal year to remain flat in terms of volume growth but anticipates return to decent growth from next fiscal year due to ongoing conversion efforts from forged to high chrome solutions. The company received relief in Brazil with antidumping duty termination and CVD reduction from 6.5% to 2.9%. Plans for manufacturing plants in China and Ghana are progressing but taking longer than expected due to approval processes. The company is expanding renewable energy capacity to 100+ megawatts, which will cover 55% of power requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1755519834923,
            "Source": "earnings"
        },
        {
            "Title": "AIA Engineering Reports ₹569 Crore Order Book With Strong Growth Expectations",
            "Summary": "AIA Engineering has an order book worth ₹569 crore and expects strong growth driven by high mining demand and increased capital expenditure. The company maintains robust EBITDA margins above 40%.",
            "Sentiment": "positive",
            "PublishDate": 1755101297107,
            "Source": "stock"
        },
        {
            "Title": "AIA Engineering Submits Revised Q1 FY26 Results After Note Omission",
            "Summary": "AIA Engineering Limited resubmitted its unaudited standalone financial results for the quarter ended June 30, 2025, after inadvertently omitting a note about its single reportable business segment - Manufacturing of High Chrome Mill Internals. The company reported standalone revenue from operations of ₹83,274.06 lakhs and profit after tax of ₹23,403.40 lakhs for the quarter. On a consolidated basis, revenue from operations was ₹103,894.71 lakhs with profit after tax of ₹30,516.78 lakhs. The Board decided to discontinue manufacturing operations at the Nagpur unit on July 29, 2025, which will not adversely affect production or profitability. The company faces US duties of 3.16% countervailing duty and 6.70% anti-dumping duty on certain grinding media imports from India, effective from May 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755080284996,
            "Source": "earnings"
        },
        {
            "Title": "AIA Engineering Reports Growth in Q1 Financial Results",
            "Summary": "AIA Engineering reported Q1 revenue of 10.4 billion rupees compared to 10.2 billion rupees in the previous year. The company's consolidated net profit increased to 3.05 billion rupees from 2.6 billion rupees year-over-year. EBITDA rose to 3.06 billion rupees from 2.89 billion rupees, while EBITDA margin improved to 29.5% from 28.32% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1755073166927,
            "Source": "earnings"
        },
        {
            "Title": "AIA Engineering Schedules Earnings Call for Quarter Ended June 30, 2025",
            "Summary": "AIA Engineering Limited has scheduled an investors' conference call on August 16, 2025, at 4:30 PM to discuss the unaudited financial results for the quarter ended June 30, 2025. The management team will present the company's financial performance and address questions from participants. The company has provided dial-in numbers for participants to join the earnings call.",
            "Sentiment": "neutral",
            "PublishDate": 1754565430013,
            "Source": "earnings"
        },
        {
            "Title": "AIA Engineering Shuts Down Nagpur Manufacturing Unit",
            "Summary": "AIA Engineering Limited discontinued manufacturing operations at its Nagpur unit located at L-3, MIDC Industrial Area, Hingna, with closure effective from July 29, 2025. The Board of Directors made this decision during a meeting held on the same date. The Nagpur unit generated turnover of ₹14,028.02 lakhs during FY2024-25, which the company describes as significantly low compared to consolidated turnover of ₹4,28,744.39 lakhs. The company stated the closure aims to achieve enhanced productivity, logistical efficiencies, improved supply chain coordination and reduced transit costs. AIA Engineering asserted that this closure will not adversely affect production, business operations, or profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1753773442160,
            "Source": "corporate_action"
        },
        {
            "Title": "Brazil Reduces Countervailing Duty on Indian Grinding Media",
            "Summary": "AIA Engineering reports that Brazil has decreased the countervailing duty on Indian grinding media to 2.90%.",
            "Sentiment": "positive",
            "PublishDate": 1751506366000,
            "Source": "default"
        },
        {
            "Title": "Brazil Reduces Countervailing Duty on Indian Grinding Media",
            "Summary": "Brazil has lowered the countervailing duty on Indian grinding media to 2.90%. This decision affects AIA Engineering, an Indian company that produces grinding media. The reduction in duty could potentially benefit AIA Engineering's exports to Brazil.",
            "Sentiment": "positive",
            "PublishDate": 1751456525000,
            "Source": "default"
        },
        {
            "Title": "AIA Engineering Reports Q4 Results and Declares Dividend",
            "Summary": "AIA Engineering has released its Q4 financial results. The company's EBITDA increased to 3.01 billion rupees from 2.9 billion rupees year-over-year. The EBITDA margin improved to 26.07% from 25.86%. Revenue slightly increased to 11.6 billion rupees from 11.5 billion rupees. Consolidated net profit rose to 2.85 billion rupees from 2.6 billion rupees. Additionally, the company has declared a dividend of 16 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747991405000,
            "Source": "result"
        },
        {
            "Title": "U.S. Imposes Duties on High Chrome Cast Iron Grinding Media from India",
            "Summary": "The United States has finalized and imposed countervailing and anti-dumping duties on high chrome cast iron grinding media imported from India. The countervailing duty is set at 3.16%, while the anti-dumping duty is 6.70%. These duties will come into effect on May 22, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1747988869000,
            "Source": "default"
        },
        {
            "Title": "AIA Engineering Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 200,823 shares of AIA Engineering Ltd. took place on the National Stock Exchange (NSE) at a price of Rs. 3154.40 per share, totaling Rs. 63.35 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1745469786000,
            "Source": "block_details"
        },
        {
            "Title": "AIA Engineering Reports Q3 EBITDA Decline",
            "Summary": "AIA Engineering has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 2.83 billion rupees, down from 3.11 billion rupees in the same quarter of the previous year. The EBITDA margin slightly decreased to 26.55% from 26.62% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738916404000,
            "Source": "earnings"
        },
        {
            "Title": "AIA Engineering Reports Decline in Q3 FY24 Financial Performance",
            "Summary": "AIA Engineering has announced its Q3 financial results, showing a year-over-year decline in both net profit and revenue. The company's consolidated net profit decreased to 2.59 billion rupees from 2.8 billion rupees in the same quarter last year. Revenue also fell to 10.5 billion rupees from 11.7 billion rupees in the corresponding period.",
            "Sentiment": "negative",
            "PublishDate": 1738916336000,
            "Source": "earnings"
        },
        {
            "Title": "AIA Engineering Expands Global Manufacturing Footprint",
            "Summary": "AIA Engineering's subsidiary Vega ME plans to establish new facilities for manufacturing hi-chrome grinding media in China and Ghana. The company is also evaluating locations in Indonesia and elsewhere. The proposed capacity addition is 100,000 MTPA, with an estimated investment of $50 million. The expansion is expected to be completed within 3 years.",
            "Sentiment": "positive",
            "PublishDate": 1737073279000,
            "Source": "corporate_action"
        },
        {
            "Title": "AIA Engineering Announces $50 Million Capacity Expansion",
            "Summary": "AIA Engineering has announced plans for a significant capacity expansion. The company intends to add 100,000 MTPA (Metric Tons Per Annum) to its production capacity. This expansion project is estimated to require an investment of approximately $50 million. The company expects to complete the capacity addition within a three-year timeframe.",
            "Sentiment": "positive",
            "PublishDate": 1737027524000,
            "Source": "corporate_action"
        },
        {
            "Title": "AIA Engineering Expands Global Manufacturing Footprint",
            "Summary": "AIA Engineering's subsidiary, Vega ME, is set to establish facilities for manufacturing hi-chrome grinding media in China and Ghana. The company is also evaluating potential locations in Indonesia and other countries for further expansion.",
            "Sentiment": "positive",
            "PublishDate": 1737027518000,
            "Source": "corporate_action"
        },
        {
            "Title": "AIA Engineering Ltd: Block Trade of 268,271 Shares on NSE",
            "Summary": "A block trade of approximately 268,271 shares of AIA Engineering Ltd occurred on the National Stock Exchange (NSE) at a price of Rs. 3384.80 per share. The total value of the transaction amounted to Rs. 90.80 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1735720922000,
            "Source": "block_deals"
        },
        {
            "Title": "AIA Engineering Subsidiary Increases Stake in VMPS Australia",
            "Summary": "AIA Engineering's subsidiary, Vega ME, has acquired an additional 13% stake in VMPS, Australia for A$2.7 million. This acquisition increases Vega ME's total shareholding in VMPS to 56%.",
            "Sentiment": "positive",
            "PublishDate": 1732106979000,
            "Source": "corporate_action"
        },
        {
            "Title": "AIA Engineering Announces Capex Plans and Buyback Payout",
            "Summary": "AIA Engineering has announced a planned capital expenditure of INR250 crores, which includes investments in renewable power, a rubber liner plant, and a 36,000-ton expansion for grinding media. The company has also completed a buyback payout, reflected in their net cash figure of INR3,212 crores.",
            "Sentiment": "positive",
            "PublishDate": 1730345682000,
            "Source": "corporate_action"
        },
        {
            "Title": "AIA Engineering Reports Inventory Levels in Line with Production Volume",
            "Summary": "AIA Engineering has reported its current inventory levels during a conference call. The company maintains 76 days of finished goods inventory and 65 days of raw material inventory. These levels are consistent with the company's reduced production and sales volumes compared to the previous period.",
            "Sentiment": "neutral",
            "PublishDate": 1730345481000,
            "Source": "normal_news"
        },
        {
            "Title": "AIA Engineering Reports Lower Q2 EBITDA and Margin",
            "Summary": "AIA Engineering's Q2 EBITDA decreased to 2.75 billion rupees from 4.4 billion rupees year-over-year. The company's Q2 EBITDA margin also declined to 26.75% from 29.51% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730276685000,
            "Source": "result"
        },
        {
            "Title": "AIA Engineering Reports Q2 Revenue Decline",
            "Summary": "AIA Engineering's second quarter revenue decreased to 10.4 billion rupees from 12.9 billion rupees in the same quarter last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1730276625000,
            "Source": "result"
        },
        {
            "Title": "AIA Engineering Reports Decline in Q2 Consolidated Net Profit",
            "Summary": "AIA Engineering's consolidated net profit for the second quarter decreased to 2.6 billion rupees from 3.19 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1730276600000,
            "Source": "result"
        },
        {
            "Title": "AIA Engineering Ltd: Large Block Trade on NSE",
            "Summary": "<p>A <span class='neutral'>significant block trade</span> of <b>AIA Engineering Ltd</b> shares occurred on the <b>National Stock Exchange (NSE)</b>. Approximately <span class='neutral'>427,192 shares</span> were traded at a price of <span class='neutral'>Rs. 4,150.00 per share</span>, totaling <span class='neutral'>Rs. 177.28 crores</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728379045000,
            "Source": "block_deals"
        },
        {
            "Title": "U.S. Sets Preliminary Countervailing Duty on AIA Engineering's Iron Grinding Media",
            "Summary": "<p>The <span class='neutral'>United States</span> has imposed a <b>preliminary countervailing duty</b> of <span class='negative'>3.36%</span> on certain <span class='neutral'>iron grinding media</span> imported from <span class='neutral'>India</span>, specifically affecting <span class='neutral'>AIA Engineering</span>. This duty is part of a <span class='neutral'>trade measure</span> aimed at addressing potential <span class='negative'>unfair subsidies</span>.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728039131000,
            "Source": "corporate_action"
        },
        {
            "Title": "AIA Engineering Ltd: Large Block Trade on NSE",
            "Summary": "<p>A <span class='neutral'>significant block trade</span> occurred on the <span class='neutral'>National Stock Exchange (NSE)</span> for <b>AIA Engineering Ltd</b>. Approximately <span class='neutral'>183,377 shares</span> were traded at a price of <span class='neutral'>Rs. 4300.00</span> per share, amounting to a total transaction value of <span class='neutral'>Rs. 78.85 crores</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1727955358000,
            "Source": "block_deals"
        }
    ]
}