{
    "Symbol": "AIIL",
    "ISIN": "INE206F01022",
    "News": [
        {
            "Title": "Authum Investment Reports Q3FY26 Results",
            "Summary": "Authum Investment & Infrastructure Limited announced Q3FY26 quarterly results for quarter ended December 31, 2025, with consolidated profit of ₹161.47 crores and standalone profit of ₹168.02 crores.",
            "Sentiment": "positive",
            "PublishDate": 1770730464171,
            "Source": "co_actions_results"
        },
        {
            "Title": "Authum Investment Emerges as Successful Bidder for A A Estates",
            "Summary": "Authum Investment & Infrastructure Limited has been selected as the successful resolution applicant for A A Estates Private Limited with a cash consideration of Rs. 36 crore, subject to NCLT approval.",
            "Sentiment": "positive",
            "PublishDate": 1769678749439,
            "Source": "co_actions_results"
        },
        {
            "Title": "Authum Investment sets January 13 record date for bonus",
            "Summary": "Authum Investment & Infrastructure Limited reissues announcement fixing January 13, 2026 as record date for 4:1 bonus share allotment, correcting typographical error in earlier communication.",
            "Sentiment": "neutral",
            "PublishDate": 1767188282799,
            "Source": "co_actions_results"
        },
        {
            "Title": "Authum Investment Infrastructure Allots Rs 300 Crore Preference Shares to Promoter",
            "Summary": "Authum Investment Infrastructure Limited's Fund Raising Committee allotted 30,00,000 Non-Cumulative Non-Convertible Redeemable Preference Shares at Rs 1,000 per share to promoter Mentor Capital Limited on private placement basis. The allotment brings total NCRPS issued to 1,80,00,000 shares worth Rs 1,800 crores, strengthening the company's capital structure through promoter funding.",
            "Sentiment": "positive",
            "PublishDate": 1765277942337,
            "Source": "corporate_action"
        },
        {
            "Title": "Authum Investment Infrastructure Raises Rs 400 Crores Through Preference Share Allotment",
            "Summary": "Authum Investment Infrastructure Limited allotted 4 crore Non-Cumulative Non-Convertible Redeemable Preference Shares at Rs 1,000 per share to raise Rs 400 crores. The shares were allotted to Mentor Capital Limited, a promoter of the company, on a private placement basis.",
            "Sentiment": "positive",
            "PublishDate": 1765027110158,
            "Source": "corporate_action"
        },
        {
            "Title": "Authum Investment Infrastructure Limited Incorporates Wholly Owned Subsidiary for CSR Activities",
            "Summary": "Authum Investment Infrastructure Limited incorporated Authum Foundation as a wholly owned subsidiary under Section 8 of the Companies Act, 2013 on December 05, 2025, with authorized share capital of Rs. 10 lakh and paid-up capital of Rs. 1 lakh. The subsidiary will carry out Corporate Social Responsibility activities and other social activities as permitted under company objectives, with Authum contributing up to Rs. 21 lakh for 100% shareholding.",
            "Sentiment": "neutral",
            "PublishDate": 1764940209682,
            "Source": "corporate_action"
        },
        {
            "Title": "Authum Investment Infrastructure Limited Seeks Shareholder Approval for Capital Increase and Bonus Share Issue",
            "Summary": "Authum Investment Infrastructure Limited has initiated a postal ballot seeking shareholder approval to increase authorized share capital from Rs. 100 crores to Rs. 128 crores and issue bonus shares in 4:1 ratio by capitalizing Rs. 67.94 crores from reserves. The e-voting period runs from December 2, 2025 to December 31, 2025, with results to be declared by January 2, 2026, affecting all eligible shareholders as of the November 28, 2025 cut-off date.",
            "Sentiment": "positive",
            "PublishDate": 1764592413160,
            "Source": "corporate_action"
        },
        {
            "Title": "Authum Investment & Infra Approves 4:1 Bonus Share Issue",
            "Summary": "Authum Investment & Infra has approved a 4:1 bonus share issue for its shareholders. Existing shareholders will receive four additional shares for every one share held, increasing their shareholding without additional cost.",
            "Sentiment": "positive",
            "PublishDate": 1764334065332,
            "Source": "corporate_action"
        },
        {
            "Title": "Authum Investment & Infrastructure Schedules Board Meeting for Bonus Discussion",
            "Summary": "Authum Investment & Infrastructure has scheduled a board meeting on November 28 to discuss bonus matters. The meeting indicates potential bonus distribution considerations for the company's stakeholders.",
            "Sentiment": "positive",
            "PublishDate": 1764052417751,
            "Source": "corporate_action"
        },
        {
            "Title": "Authum Investment Infrastructure Completes 100% Acquisition of BICCello India",
            "Summary": "Authum Investment Infrastructure Limited has completed the acquisition of 100% shares in BICCello (India) Private Limited by purchasing 4,14,87,608 equity shares from existing shareholders. The transaction gives Authum complete voting control over BICCello, following their earlier announcement in October regarding the proposed acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1763785718655,
            "Source": "order&deals"
        },
        {
            "Title": "Authum Investment Infrastructure Receives Shareholder Approval for Rs 2,450 Crore Preference Share Issue",
            "Summary": "Authum Investment Infrastructure Limited received shareholder approval through postal ballot to issue up to 2.45 crore Non-Cumulative Non-Convertible Redeemable Preference Shares worth Rs 2,450 crores to promoter Mentor Capital Limited on private placement basis. The preference shares carry a face value of Rs 10 each at an issue price of Rs 1,000 per share with a dividend rate of 0.01% per annum and will be redeemed at premium to provide 6.5% IRR.",
            "Sentiment": "positive",
            "PublishDate": 1763473951540,
            "Source": "corporate_action"
        },
        {
            "Title": "Authum Investment Infrastructure Appoints Former IAS Officer Rajeev RA as Independent Director",
            "Summary": "Authum Investment Infrastructure Limited appointed Mr. Rajeev RA as Non-Executive Independent Director for a five-year term from October 7, 2025 to October 6, 2030, approved by shareholders through postal ballot on November 17, 2025. The appointment brings extensive government experience spanning 34 years as an IAS officer with expertise in urban development, finance, and infrastructure projects worth USD 21.42 billion including Metro and sea bridge projects in Mumbai.",
            "Sentiment": "positive",
            "PublishDate": 1763472425587,
            "Source": "corporate_action"
        },
        {
            "Title": "Authum Investment Infrastructure Limited Seeks Shareholder Approval for Employee Stock Option Scheme 2025",
            "Summary": "Authum Investment Infrastructure Limited has issued a postal ballot notice seeking shareholder approval for its Employee Stock Option Scheme 2025. The scheme proposes to grant up to 5,00,000 employee stock options to eligible employees of the company and its subsidiaries, with each option convertible to one equity share of face value Re. 1. The options will have a vesting period of 1-4 years from grant date and an exercise period of maximum 5 years from vesting. The e-voting period runs from November 13, 2025 (9:00 AM) to December 12, 2025 (5:00 PM), with results to be declared by December 16, 2025. The scheme aims to align employee interests with long-term company growth, attract and retain talent, and promote employee ownership culture. Maximum options per employee are capped at 3,00,000.",
            "Sentiment": "positive",
            "PublishDate": 1762987888774,
            "Source": "corporate_action"
        },
        {
            "Title": "Authum Investment Infrastructure Reports Strong Quarterly Results and Approves Employee Stock Option Scheme",
            "Summary": "Authum Investment Infrastructure Limited's board approved unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported consolidated profit before tax of Rs 1,682.76 crores for the half-year and Rs 1,143.54 crores for the quarter. The board also approved an Employee Stock Option Scheme 2025 for granting up to 5,00,000 options to eligible employees of the company and its subsidiaries, subject to shareholder approval through postal ballot. The e-voting period for the postal ballot will commence on November 13, 2025, and conclude on December 12, 2025. The company's consolidated total assets stood at Rs 20,075.65 crores as of September 30, 2025, compared to Rs 16,087.30 crores in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762821422774,
            "Source": "earnings"
        },
        {
            "Title": "Authum Investment Infrastructure Completes Acquisition of 35.09% Voting Rights in Rivaara Labs",
            "Summary": "Authum Investment Infrastructure Limited has completed the acquisition of equity shares and cumulative compulsorily convertible participating preference shares (CCPS) in Rivaara Labs Private Limited. The transaction includes subscribing to 3.6 crore CCPS issued by Rivaara Labs and purchasing 1.58 crore equity shares and 3.69 crore CCPS from existing shareholders. An additional 40 lakh CCPS will be acquired within the next 10 days. Following this transaction, Authum Investment Infrastructure is entitled to exercise 35.09% of the total voting rights in Rivaara Labs.",
            "Sentiment": "positive",
            "PublishDate": 1761853258356,
            "Source": "order&deals"
        },
        {
            "Title": "Authum Investment & Infrastructure Gets Credit Rating Upgrade to Crisil A/Stable",
            "Summary": "CRISIL Ratings upgraded Authum Investment & Infrastructure Limited's long-term bank loan facilities rating to 'Crisil A/Stable' from 'Crisil A-/Stable' for facilities worth Rs. 1000 crore. The upgrade reflects the company's strengthened capital position, with networth increasing to Rs 14,690 crore as of March 31, 2025, and further to Rs 16,670 crore by June 30, 2025. The rating improvement is driven by sustained profitability from investment portfolio gains and expectations of continued business diversification through lending, asset reconstruction and collections services. For the latest results, consolidated profit after tax was Rs 4,241 crore, with 57% of total income coming from investment gains. The company maintains comfortable gearing at 0.05 times as of March 31, 2025, and operates with total assets of Rs 16,087 crore, of which Rs 12,739 crore is deployed in investments and Rs 2,168 crore in lending portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1761319995881,
            "Source": "stock"
        },
        {
            "Title": "Authum Investment & Infrastructure Limited Approves Rs. 2,450 Crore Preference Share Issuance to Promoter",
            "Summary": "Authum Investment & Infrastructure Limited's Board approved the issuance of up to 2.45 crore Non-Cumulative Non-Convertible Redeemable Preference Shares at Rs. 1,000 each to promoter Mentor Capital Limited through private placement, totaling Rs. 2,450 crores. The shares carry a face value of Rs. 10 with a premium of Rs. 990, offering a dividend rate of 0.01% per annum and will be redeemed at premium to provide an IRR of 6.5% over a 15-year tenure. The proposal requires shareholder approval through postal ballot. Additionally, Ms. Alpana Dangi resigned as Non-Executive Director due to personal commitments. The Board also approved seeking shareholder approval for appointing Mr. Rajeev RA as Independent Director and for material related party transactions with Mentor Capital Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1760619124110,
            "Source": "corporate_action"
        },
        {
            "Title": "Authum Investment Acquires 90% Stake in Security Receipts Linked to Wind World India Debt",
            "Summary": "Authum Investment & Infrastructure Limited (AIIL) acquired 90% of security receipts issued by Omkara PS 05/2025-26 Trust for INR 11,025 million. The trust acquired the debt of Wind World India Limited from National Asset Reconstruction Company Limited. AIIL received 1,10,25,000 security receipts out of a total issue size of INR 12,250 million. Wind World India operates approximately 4,500 MW of windmills for operation and maintenance services, and owns 550 MW of wind power assets for power generation and sale through its subsidiaries.",
            "Sentiment": "neutral",
            "PublishDate": 1759332690910,
            "Source": "order&deals"
        },
        {
            "Title": "Authum Investment Acquires 3% Stake in Serovia Pharma for INR 300 Crores",
            "Summary": "Authum Investment & Infrastructure Limited signed an investment agreement on September 15, 2025, to acquire a 3% stake in Serovia Pharma Private Limited through subscription of compulsorily convertible preference shares. The deal involves a cash consideration of INR 3,000,001,553 for 18,95,053 Series B CCPS with a face value of INR 10 and premium of INR 1573.07 per share. The payment will be made in two installments of 50% each. Serovia Pharma, incorporated on July 19, 2025, operates in the pharmaceutical industry focusing on developing, manufacturing, and distributing pharmaceutical products globally. The company plans to expand its presence to Cyprus and the US. The transaction is expected to complete by September 20, 2025, subject to pre-closing conditions including board and shareholder approvals. Authum states this acquisition aligns with their portfolio diversification strategy in sectors with stability and growth potential.",
            "Sentiment": "positive",
            "PublishDate": 1758027565910,
            "Source": "order&deals"
        },
        {
            "Title": "Authum Investment & Infrastructure Acquires 35.09% Stake in Rivaara Labs for Rs 36.57 Crore",
            "Summary": "Authum Investment & Infrastructure Limited entered into a Share Subscription cum Purchase Agreement with Rivaara Labs Private Limited and Mr. Siddharth Bharat Daftary. The transaction involves subscribing to 3.6 crore cumulative compulsorily convertible participating preference shares and purchasing existing shares from shareholders. The total acquisition cost is Rs 36.57 crore, comprising Rs 36 crore as primary infusion and Rs 56.83 lakh as purchase consideration. Upon completion, Authum will hold 35.09% voting rights in Rivaara Labs. Rivaara Labs operates in the diagnostic services sector, including pathology, imaging, PCR testing, genomic sequencing, and digital healthcare products. The company reported a net worth of negative Rs 3,482.93 lakh and turnover of Rs 2,552.69 lakh as of March 31, 2025. The acquisition is expected to complete by September 30, 2025, subject to fulfillment of conditions including board and shareholder approvals.",
            "Sentiment": "positive",
            "PublishDate": 1756187411312,
            "Source": "order&deals"
        },
        {
            "Title": "Mentor Capital and Alpana Dangi Increase Stake in Authum Investment to 74.28%",
            "Summary": "Mentor Capital Limited and Alpana Dangi acquired 46,61,309 additional shares in Authum Investment and Infrastructure Limited through open market purchases on August 14, 2025. The acquisition increased their combined shareholding from 71.54% to 74.28% of the company's voting rights. Before the transaction, they held 12,14,99,996 shares (71.54%), and after the acquisition, their total holding reached 11,68,38,687 shares (68.79% individual holding plus 6.24% encumbered shares totaling 74.28%). The shares were acquired at a cost of 2.74% of the total voting capital. Authum Investment's equity share capital remains unchanged at Rs. 16,98,45,100 divided into 169,845,100 shares of Re. 1 each. The company's shares are listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1755497288295,
            "Source": "corporate_action"
        },
        {
            "Title": "Mentor Capital Limited Sells 2.74% Stake in Authum Investment & Infrastructure to Institution",
            "Summary": "Mentor Capital Limited, a promoter of Authum Investment & Infrastructure Limited, sold approximately 2.74% of its stake in the company through secondary market transactions to a renowned institution. The promoters confirmed they do not intend to sell any further stake in Authum for the next 12 months. The disclosure was made by Whole Time Director Amit Dangi on August 16, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755337762300,
            "Source": "order&deals"
        },
        {
            "Title": "Authum Investment & Infrastructure Limited Incorporates Sports Subsidiary Billion Dream Sports",
            "Summary": "Authum Investment & Infrastructure Limited has incorporated a new subsidiary company named Billion Dream Sports Private Limited. The subsidiary was incorporated on July 31, 2025, with corporate identification number U93110MH2025PTC453429 and has an authorized and paid-up share capital of Rs. 10 lakhs. Authum holds a 99.99% shareholding in the subsidiary through cash subscription, with funds infused on August 7, 2025. The subsidiary will operate in the sports industry, focusing on promoting, managing, organizing and conducting sports activities including cricket, football, basketball and athletics. It will also acquire and manage sports franchises, professional sports teams, and handle recruitment, training, sponsorship and representation of athletes in domestic and international sporting events. The company has its registered office in Mumbai, Maharashtra.",
            "Sentiment": "positive",
            "PublishDate": 1754655063107,
            "Source": "corporate_action"
        },
        {
            "Title": "Authum Investment Acquires Additional Stake in Star Aerospace, Total Holding Reaches 14.59%",
            "Summary": "Authum Investment & Infrastructure Limited acquired 8,34,082 additional equity shares in Star Aerospace Limited for approximately Rs 112 crores through cash consideration. This acquisition increased Authum's stake from 7.96% to 14.59% of Star Aerospace's expanded equity share capital. Star Aerospace Limited is a defense manufacturing company established in 2015, specializing in high-precision mechanical and electro-optical systems for aerospace and defense applications. The company reported a net worth of Rs 86.91 crores, turnover of Rs 84.18 crores, and EBITA of Rs 25.08 crores. Star Aerospace has supplied defense equipment to Indian Armed Forces and has presence in USA, Southeast Asia, and Middle East. Authum stated the acquisition aligns with their strategy of portfolio diversification and investing in sectors with stability and growth potential. The transaction does not fall under related party transactions and required no governmental or regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1754586576901,
            "Source": "order&deals"
        },
        {
            "Title": "Enforcement Directorate Initiates Enquiry at Authum Investment & Infrastructure Premises",
            "Summary": "Enforcement Directorate officials initiated an enquiry at Authum Investment & Infrastructure Limited's premises on July 24th, 2025. The matter relates specifically to Reliance Commercial Finance Limited and Reliance Home Finance Limited. Authum has submitted relevant documentation to authorities and stated it will respond to additional queries transparently. The company asserted that this development does not impact its operations, financial performance, or strategic direction, with all business aspects remaining fully functional. Authum emphasized it operates independently with clear governance structure and remains focused on long-term growth plans.",
            "Sentiment": "neutral",
            "PublishDate": 1753400778951,
            "Source": "stock"
        },
        {
            "Title": "Authum Investment & Infra Reports Q1 Financial Results",
            "Summary": "Authum Investment & Infra has reported its Q1 financial results. The company's net profit for the quarter was 9.41 billion rupees, compared to 10.92 billion rupees in the same period last year. Revenue for Q1 stood at 12.1 billion rupees, down from 14.12 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1752502245000,
            "Source": "result"
        },
        {
            "Title": "Authum Investment: Revised ISARC Acquisition Terms Boost Stock to Record High",
            "Summary": "Authum Investment & Infrastructure's shares hit an all-time high of ₹2,135.95 after announcing revised terms for acquiring India SME Asset Reconstruction Company Limited (ISARC). The new agreement increases Authum's stake to 88.37% of ISARC's voting rights for a total investment of ₹312.5 crore. The acquisition is set to complete by July 31, 2025, with all regulatory approvals secured.",
            "Sentiment": "positive",
            "PublishDate": 1747197118000,
            "Source": "corporate_action"
        },
        {
            "Title": "Authum Investment & Infra Reports Strong Q4 Financial Results",
            "Summary": "Authum Investment & Infra has reported significant year-over-year growth in its Q4 financial results. The company's net profit increased to 17.7 billion rupees, up from 15 billion rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 14.4 billion rupees compared to 8.86 billion rupees in the previous year. Quarter-on-quarter, net profit grew from 5.45 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1747068963000,
            "Source": "result"
        },
        {
            "Title": "Authum Investment & Infra to Consider Q4 Results on May 12",
            "Summary": "Authum Investment & Infrastructure Limited has announced that it will consider its financial results for the fourth quarter on May 12. This indicates the company is preparing to release its quarterly earnings report, which is a standard practice for publicly traded companies.",
            "Sentiment": "neutral",
            "PublishDate": 1746619410000,
            "Source": "default"
        },
        {
            "Title": "Authum Investment & Infra to Acquire Vas Infrastructure Ltd for 860.4 Million Rupees",
            "Summary": "Authum Investment & Infrastructure Limited has been selected as the resolution applicant to acquire Vas Infrastructure Ltd (VIL) for a sum of 860.4 million rupees. This acquisition is likely part of a resolution process, possibly due to financial distress of VIL.",
            "Sentiment": "neutral",
            "PublishDate": 1743639059000,
            "Source": "corporate_action"
        },
        {
            "Title": "Authum Investment & Infrastructure Selected to Acquire VIL for 860.4 Million Rupees",
            "Summary": "Authum Investment & Infrastructure Limited has been chosen as the selected resolution applicant to acquire VIL (presumably Vodafone Idea Limited) for a sum of 860.4 million rupees. This development suggests a potential acquisition or restructuring deal involving the two companies.",
            "Sentiment": "positive",
            "PublishDate": 1743602049000,
            "Source": "corporate_action"
        },
        {
            "Title": "Authum Investment & Infrastructure Selected as Resolution Applicant for VIL Acquisition",
            "Summary": "Authum Investment & Infrastructure Limited has been chosen as the selected resolution applicant to acquire VIL (presumably Vodafone Idea Limited, though this needs confirmation). This development suggests that Authum has been approved to proceed with the acquisition process of VIL, potentially as part of a resolution or restructuring plan.",
            "Sentiment": "positive",
            "PublishDate": 1743601799000,
            "Source": "corporate_action"
        },
        {
            "Title": "Authum Investment: RBI Approves Acquisition of SIDBI's ARC Business",
            "Summary": "Authum Investment and Infrastructure Ltd received RBI approval to acquire 79.28% stake in India SME Asset Reconstruction Co. Ltd (ISARC) for ₹260 crore. The deal includes primary and secondary transactions, with Authum injecting ₹170 crore to boost ISARC's net worth to ₹300 crore. This acquisition marks Authum's expansion into distressed asset management amid changes in India's ARC sector.",
            "Sentiment": "positive",
            "PublishDate": 1743149060000,
            "Source": "corporate_action"
        },
        {
            "Title": "Authum Investment & Infrastructure Receives Letter of Intent for Carnival Techno Park Acquisition",
            "Summary": "Authum Investment & Infrastructure has received a Letter of Intent (LOI) for the acquisition of Carnival Techno Park. This indicates a potential significant corporate action involving the purchase of a property asset, which could impact the company's portfolio and future operations.",
            "Sentiment": "positive",
            "PublishDate": 1742775344000,
            "Source": "corporate_action"
        },
        {
            "Title": "Authum Investment & Infrastructure Receives Letter of Intent for Carnival Techno Park Acquisition",
            "Summary": "Authum Investment & Infrastructure has received a Letter of Intent (LOI) for the acquisition of Carnival Techno Park. This indicates that the company is in the process of potentially acquiring a new property or development, which could expand its portfolio and business operations.",
            "Sentiment": "positive",
            "PublishDate": 1742563377000,
            "Source": "corporate_action"
        },
        {
            "Title": "Authum Investment & Infrastructure Limited: Board Approves Reappointment of Two Key Directors",
            "Summary": "Authum Investment & Infrastructure Limited's board approved the reappointment of Amit Dangi and Akash Suri as Whole-Time Directors for five-year terms, subject to shareholder approval. Dangi's term is from June 29, 2025, to June 28, 2030, while Suri, also the CEO, will serve from September 27, 2025, to September 26, 2030.",
            "Sentiment": "neutral",
            "PublishDate": 1741337140000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Authum Investment Acquires 42.33% Stake in Prataap Snacks",
            "Summary": "Authum Investment has acquired a 42.33% stake in Prataap Snacks. The acquisition was valued at approximately Rs 764.55 crore and was executed through a combination of open market purchases and a share purchase agreement.",
            "Sentiment": "neutral",
            "PublishDate": 1740576031000,
            "Source": "corporate_action"
        },
        {
            "Title": "Authum Investment to Acquire Shares in Welspun Michigan Engineers",
            "Summary": "Authum Investment & Infrastructure has entered into an agreement to acquire 34,802 shares of Welspun Michigan Engineers. The acquisition is valued at 235 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1738164447000,
            "Source": "corporate_action"
        },
        {
            "Title": "RCFL Receives RBI Order for Voluntary Exit from NBFC Business",
            "Summary": "Authum Investment has announced that Reliance Commercial Finance Limited (RCFL) has received an order from the Reserve Bank of India (RBI) approving its voluntary exit from the Non-Banking Financial Company (NBFC) business.",
            "Sentiment": "neutral",
            "PublishDate": 1738066852000,
            "Source": "corporate_action"
        },
        {
            "Title": "Authum Investment & Infra Reports Q3 Financial Results",
            "Summary": "Authum Investment & Infra has reported its Q3 financial results. The company's net profit for the quarter stands at 5.45 billion rupees, showing a decrease from 6.03 billion rupees year-over-year and 8.44 billion rupees quarter-over-quarter. However, the company's revenue has increased to 6.18 billion rupees from 4.9 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1736985880000,
            "Source": "earnings"
        },
        {
            "Title": "Authum Investment & Infra Reports Q3 Financial Results",
            "Summary": "Authum Investment & Infra has reported its Q3 financial results. The company's net profit for the quarter stood at 5.45 billion rupees, compared to 6.03 billion rupees year-over-year and 8.44 billion rupees quarter-over-quarter. Revenue for Q3 increased to 6.18 billion rupees from 4.9 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1736956745000,
            "Source": "earnings"
        },
        {
            "Title": "Authum Investment & Infrastructure Receives CCI Approval for Prataap Snacks Stake Acquisition",
            "Summary": "Authum Investment & Infrastructure has received approval from the Competition Commission of India (CCI) to acquire a 42.31% stake in Prataap Snacks Limited. The company is now proceeding with an open offer as part of this acquisition process.",
            "Sentiment": "positive",
            "PublishDate": 1735696003000,
            "Source": "corporate_action"
        },
        {
            "Title": "Authum Investment & Infrastructure Reports Q2 Revenue Growth",
            "Summary": "Authum Investment & Infrastructure has reported a revenue of 10.91 billion rupees for the second quarter, compared to 9.73 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729528020000,
            "Source": "result"
        },
        {
            "Title": "Authum Investment & Infrastructure Reports Q2 Profit Increase",
            "Summary": "Authum Investment & Infrastructure has reported a net profit of 8.44 billion rupees for the second quarter, showing an increase from 7.88 billion rupees year-over-year. The profit also increased from 10.93 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1729528012000,
            "Source": "result"
        },
        {
            "Title": "Authum Investment to Acquire Stake in ISARC",
            "Summary": "<p>Authum Investment & Infrastructure has entered into a <span class='neutral'>Purchase cum Shareholders' Agreement</span> to <span class='positive'>acquire 22.76%</span> of the <b>expanded share capital</b> of <span class='neutral'>ISARC</span> (India SME Asset Reconstruction Company).</p>",
            "Sentiment": "positive",
            "PublishDate": 1728917825000,
            "Source": "corporate_action"
        },
        {
            "Title": "Authum Investment Acquires Real Estate Assets",
            "Summary": "<p>Authum Investment has announced an <span class='positive'>acquisition</span> in the <span class='neutral'>real estate sector</span>. The company views this as a <span class='positive'>strategic investment</span> to <span class='positive'>capitalize</span> on the value of underlying assets and <span class='positive'>generate revenue</span> through future <span class='neutral'>monetization</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728571443000,
            "Source": "corporate_action"
        },
        {
            "Title": "Authum Investment Selected as Resolution Applicant for Creatoz Builders Acquisition",
            "Summary": "<p><span class='neutral'>Authum Investment</span> has been chosen as the <span class='positive'>successful resolution applicant</span> to acquire <span class='neutral'>Creatoz Builders Private Limited (CBPL)</span>. A <span class='neutral'>letter of intent</span> was issued on <b>October 9, 2024</b>, pending approval from the <span class='neutral'>National Company Law Tribunal (NCLT), Mumbai Bench</span>, and other legal authorities.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728571402000,
            "Source": "corporate_action"
        }
    ]
}