{
    "Symbol": "AIMTRON",
    "ISIN": "INE0RUV01018",
    "News": [
        {
            "Title": "Aimtron Electronics Gains 4% on ₹11.60 Cr Orders",
            "Summary": "Aimtron Electronics shares jumped 4.1% after securing new orders worth ₹11.60 crores from domestic clients in Aerospace & Defence and Industrial IoT segments, with completion expected within 12 months.",
            "Sentiment": "positive",
            "PublishDate": 1769078483350,
            "Source": "co_actions_results"
        },
        {
            "Title": "AIMTRON Electronics Enters Railway Signaling Sector",
            "Summary": "AIMTRON Electronics has announced its strategic entry into the railway signaling systems sector, marking a significant expansion of the company's business operations into critical railway infrastructure technology.",
            "Sentiment": "positive",
            "PublishDate": 1767687684982,
            "Source": "stocks"
        },
        {
            "Title": "Aimtron Teams Up With Aurassure For IoT Weather Systems",
            "Summary": "Aimtron Electronics announces partnership with Aurassure to develop modern IoT-enabled weather monitoring systems in India, marking expansion into weather technology sector.",
            "Sentiment": "positive",
            "PublishDate": 1767163140101,
            "Source": "stocks"
        },
        {
            "Title": "Aimtron Electronics Hits 52-Week High Despite Closing Lower on Strong H1 FY26 Results",
            "Summary": "Aimtron Electronics closed at ₹865 on Thursday, down 1.25% from the previous close, after touching a fresh 52-week high of ₹899 during intraday trading. The stock showed significant volatility with trading volumes of 1.37 lakh shares worth ₹11.57 crore. The company reported strong H1 FY26 financial performance with revenue of ₹122.58 crore, marking 112.5% year-on-year growth. EBITDA surged 104.8% to ₹30.11 crore while profit after tax climbed 81.4% to ₹20.29 crore. Earnings per share increased to ₹9.94 from ₹5.48 in the corresponding period last year. The electronics manufacturer attributed growth to strong execution across defence, exports, IoT and original design manufacturing verticals. The company secured a ₹97.55 crore ODM contract with a US infrastructure firm and a ₹46 crore domestic AI/IIoT order. Aimtron's order book stood at ₹463.85 crore as of September 30, approximately three times its FY25 revenue. The company raised ₹94.57 crore through convertible warrants in August 2025 for greenfield expansion and received AS9100D certification in October for global aerospace and defence market access.",
            "Sentiment": "positive",
            "PublishDate": 1762434187277,
            "Source": "stock"
        },
        {
            "Title": "Aimtron Electronics Reports Strong H1 Performance with Revenue Doubling to 1.2 Billion Rupees",
            "Summary": "Aimtron Electronics reported H1 revenue of 1.2 billion rupees compared to 577 million rupees in the previous year. The company's EBITDA increased to 301 million rupees from 147 million rupees year-over-year. However, EBITDA margin declined slightly to 24.56% from 25.49% in the previous year. Consolidated net profit rose to 203 million rupees versus 112 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762237452740,
            "Source": "earnings"
        },
        {
            "Title": "Aimtron Electronics Secures Major Order from Vanix for IIOT and AI Devices",
            "Summary": "Aimtron Electronics announced receiving a significant order from Vanix for Industrial Internet of Things (IIOT) and artificial intelligence devices. The order represents a notable business development for the electronics company.",
            "Sentiment": "positive",
            "PublishDate": 1756465052623,
            "Source": "order&deals"
        },
        {
            "Title": "Aimtron Signs ₹97.55 Crore ODM Deal in Digital Infrastructure Sector",
            "Summary": "Aimtron has secured a contract worth ₹97.55 crore for Original Design Manufacturing (ODM) in the digital infrastructure and continuity solutions sector. The deal is significant for the company, which appears to be operating in the technology or manufacturing industry.",
            "Sentiment": "positive",
            "PublishDate": 1751260662000,
            "Source": "default"
        },
        {
            "Title": "Aimtron Electronics Secures New Orders Worth ₹49.64 Crore",
            "Summary": "Aimtron Electronics has obtained new orders valued at ₹49.64 crore. The company has set a revenue target of ₹158 crore for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1750843938000,
            "Source": "default"
        },
        {
            "Title": "Aimtron Electronics Secures 38 Crore Rupee Order",
            "Summary": "Aimtron Electronics has won an order worth 38 crore rupees. This significant contract represents a substantial business opportunity for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1733200423000,
            "Source": "order&deals"
        },
        {
            "Title": "Aimtron Electronics Secures $1.8 Million Order",
            "Summary": "Aimtron Electronics has won a new order valued at $1.8 million. The details of the order, including the client and specific products or services involved, were not provided in the brief news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1733127776000,
            "Source": "order&deals"
        }
    ]
}