{
    "Symbol": "AIRAN",
    "ISIN": "INE645W01026",
    "News": [
        {
            "Title": "Airan Limited Adopts New Memorandum of Association to Comply with Companies Act 2013",
            "Summary": "Airan Limited shareholders approved the adoption of a new Memorandum of Association (MOA) at a meeting held on September 27, 2025. The company updated its MOA from the previous Companies Act 1956 framework to align with the Companies Act 2013. Key changes include restructuring of object clauses by merging Clause III(C) 'Other Objects' with Clause III(B), retitling Clause III(B) as 'Matters which are necessary for furtherance of the objects specified in Clause III(A)', and updating the liability clause to specify that member liability is limited to unpaid amounts on shares held. The company emphasized that its main business objects remain unchanged, with modifications made solely for regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1759247610741,
            "Source": "corporate_action"
        },
        {
            "Title": "Airan Limited Reports Quarterly Results for June 2025 with Positive Earnings",
            "Summary": "Airan Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025, during a board meeting held on August 14, 2025. On a standalone basis, the company reported revenue from operations of Rs. 2,296.28 lakhs and net profit of Rs. 264.32 lakhs, with basic earnings per share of Rs. 0.20. On a consolidated basis, revenue from operations reached Rs. 2,569.89 lakhs with net profit of Rs. 323.13 lakhs and basic earnings per share of Rs. 0.25. The consolidated results include six subsidiaries: Quadpro ITES Limited, Cqub Infosystems Private Limited, Airan Global Private Limited, Airan Singapore Private Limited, Airan Australia Pty Limited, and Airan UK Limited. The company operates in the service sector with geographical segments covering operations within India and outside India. Statutory auditors Deora Maheshwari Co. issued limited review reports for both standalone and consolidated results.",
            "Sentiment": "positive",
            "PublishDate": 1755180938221,
            "Source": "earnings"
        },
        {
            "Title": "Airan Limited Gets Exchange Approval for Promoter Reclassification, Reducing Promoter Stake to 72.21%",
            "Summary": "Airan Limited received approval from BSE and NSE for reclassification of four promoter shareholders to public category. The reclassified entities include Sudeepkumar V Agrawal HUF, Sudeepkumar Vishwanath Agrawal, Vandana Sudeepkumar Agrawal, and Kunchit Sudeepkumar Agrawal. This reclassification resulted in promoter shareholding decreasing from 72.34% to 72.21%, while public holding increased from 27.66% to 27.79%. The total shares reclassified were 1,65,000 shares representing 0.13% of the company. BSE approved the application through letter dated July 21, 2025, and NSE provided similar approval on the same date. The original application was submitted in October 2023.",
            "Sentiment": "neutral",
            "PublishDate": 1753161159359,
            "Source": "corporate_action"
        }
    ]
}