{
    "Symbol": "AJANTPHARM",
    "ISIN": "INE031B01049",
    "News": [
        {
            "Title": "Ajanta Pharma Denies Restaurant Brands Asia Deal Rumors",
            "Summary": "Ajanta Pharma clarifies it's not involved in Restaurant Brands Asia acquisition; promoter group's separate entity Lenexis Foodworks pursuing the deal independently.",
            "Sentiment": "neutral",
            "PublishDate": 1770701823958,
            "Source": "stocks"
        },
        {
            "Title": "Ajanta Pharma Vests 4,300 SARs, Cancels 800 ESOPs",
            "Summary": "Ajanta Pharma's board committee approved vesting of 4,300 cash-settled Stock Appreciation Rights and cancellation of 800 employee stock options under its Share Based Incentive Plan 2019.",
            "Sentiment": "neutral",
            "PublishDate": 1769768816499,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ajanta Pharma Q3 Net Profit Rises 16% to ₹2.7B",
            "Summary": "Ajanta Pharma reported consolidated net profit of ₹2.7 billion for Q3, marking a 16% year-on-year growth from ₹2.33 billion in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1769767373402,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ajanta Pharma Denies Interest in Restaurant Brands Asia",
            "Summary": "Ajanta Pharma has officially clarified that it has not considered purchasing shares in Restaurant Brands Asia, according to Reuters reports.",
            "Sentiment": "neutral",
            "PublishDate": 1768884945251,
            "Source": "stocks"
        },
        {
            "Title": "Promoters Increase Pledges in 3 Key Stocks by Up to 2%",
            "Summary": "Ajanta Pharma, Lloyds Metals, and Emami witnessed promoter pledge increases in Q3FY26, with pledge levels reaching 17.29%, 14.42%, and 11.60% respectively, requiring close investor monitoring.",
            "Sentiment": "neutral",
            "PublishDate": 1768840876025,
            "Source": "stocks"
        },
        {
            "Title": "Ajanta Pharma Forms Wholly Owned Subsidiary in Ireland",
            "Summary": "Ajanta Pharma Limited has incorporated a wholly owned subsidiary 'Ajanta Pharma Ireland Ltd.' in Ireland to carry on pharmaceutical business operations, as disclosed under SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1768300366455,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ajanta Pharma Sets Up New Irish Subsidiary",
            "Summary": "Ajanta Pharma has established a new subsidiary in Ireland named Ajanta Pharma Ireland, marking the pharmaceutical company's expansion into the European market through strategic international presence.",
            "Sentiment": "positive",
            "PublishDate": 1768300147783,
            "Source": "stocks"
        },
        {
            "Title": "Ajanta Pharma Q3FY26 earnings call on Jan 30",
            "Summary": "Ajanta Pharma schedules earnings conference call for January 30, 2026 at 16:30 hrs IST to discuss Q3FY26 unaudited financial results with leadership team and investor Q&A session.",
            "Sentiment": "neutral",
            "PublishDate": 1768214172493,
            "Source": "co_actions_results"
        },
        {
            "Title": "Motilal Oswal Maintains Buy on Ajanta Pharma",
            "Summary": "Motilal Oswal maintains buy rating on Ajanta Pharma with target price of ₹3,145, citing strategic initiatives across India, Asia, and Africa markets.",
            "Sentiment": "positive",
            "PublishDate": 1767064214983,
            "Source": "stocks"
        },
        {
            "Title": "Ajanta Pharma Signs In-licensing Deal with Biocon",
            "Summary": "Ajanta Pharma enters in-licensing agreement with Biocon for Semaglutide supply across 26 countries in Africa, Middle East and Central Asia, with exclusive rights in 23 markets.",
            "Sentiment": "positive",
            "PublishDate": 1766490732521,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ajanta Pharma Promoter Releases Pledge on 4.2 Lakh Shares",
            "Summary": "Aayush Agrawal, promoter of Ajanta Pharma Limited, has released pledge on 4,20,255 shares citing upward movement in market price as the reason. The disclosure was made under SEBI regulations with the prescribed forms filed to BSE and NSE exchanges.",
            "Sentiment": "positive",
            "PublishDate": 1765358135289,
            "Source": "corporate_action"
        },
        {
            "Title": "Ajanta Pharma Promoter Creates Pledge on 1.7 Lakh Shares for New Loan",
            "Summary": "Aayush Agrawal, trustee of Aayush Agrawal Trust and promoter of Ajanta Pharma Limited, has pledged 1,70,000 shares with Bajaj Finance Ltd for securing a new loan. The pledge creation was completed on November 19, 2025, as disclosed under SEBI regulations to stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1764304788221,
            "Source": "corporate_action"
        },
        {
            "Title": "Ajanta Pharma Promoter Releases Pledge on 10.5 Lakh Equity Shares",
            "Summary": "Ravi Agrawal, a promoter of Ajanta Pharma Limited, has released pledge on 10,50,000 equity shares of the company. The release was executed due to excess pledge. The disclosure was made to BSE and NSE under SEBI regulations, with the pledge release completed on the shares. The regulatory filing includes details of the share encumbrance release as required under substantial acquisition and takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763029192436,
            "Source": "corporate_action"
        },
        {
            "Title": "Ajanta Pharma Sets Record Date for First Interim Dividend Payment",
            "Summary": "Ajanta Pharma Limited has announced Monday, November 10, 2025 as the record date for determining shareholders eligible to receive the first interim dividend. The company communicated this information to BSE and NSE stock exchanges. Ajanta Pharma trades under the scrip codes BSE-AJANTPHARM532331 on BSE and AJANTPHARMEQ on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1762158695002,
            "Source": "corporate_action"
        },
        {
            "Title": "Ajanta Pharma Reports Q2 Revenue Growth and Announces Rs. 28 Interim Dividend",
            "Summary": "Ajanta Pharma reported Q2 revenue of 13.5 billion rupees compared to 11.9 billion rupees in the previous year. The company's consolidated net profit increased to 2.6 billion rupees from 2.16 billion rupees year-over-year. EBITDA rose to 3.3 billion rupees from 3.1 billion rupees, though EBITDA margin declined to 24.22% from 26.22% in the same period last year. The pharmaceutical company declared a first interim dividend of Rs. 28 per share.",
            "Sentiment": "positive",
            "PublishDate": 1762156788737,
            "Source": "earnings"
        },
        {
            "Title": "Ajanta Pharma Board to Consider Interim Dividend Declaration",
            "Summary": "Ajanta Pharma has notified stock exchanges that its Board of Directors will consider declaring the first interim dividend for the financial year ending March 31, 2026, during their meeting scheduled for November 3, 2025. The board will also consider fixing November 10, 2025 as the record date for interim dividend payment if declared. The same meeting will review unaudited financial results for the second quarter and half year ended September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761279757252,
            "Source": "corporate_action"
        },
        {
            "Title": "Ajanta Pharma Promoter Aayush Agrawal Pledges 6.45 Lakh Shares for New Loan and Additional Margin",
            "Summary": "Aayush Agrawal, promoter of Ajanta Pharma Limited, has pledged 6,45,000 shares for new loan and additional margin purposes. The pledge creation was disclosed on October 1, 2025. According to the regulatory filing, Aayush M Agrawal Trust's total encumbered shareholding has increased to 65,80,002 shares representing 5.27% of total share capital. The pledges were created with multiple financial institutions including Deutsche Investments India Pvt Ltd for additional margin (1,20,000 shares) and HSBC InvestDirect Financial Services India Ltd for additional margin (70,000 shares). The disclosure was made under SEBI regulations to BSE and NSE where Ajanta Pharma shares are listed under the scrip code AJANTPHARM.",
            "Sentiment": "neutral",
            "PublishDate": 1759492447266,
            "Source": "corporate_action"
        },
        {
            "Title": "Ajanta Pharma Promoter Ravi Agrawal Releases Pledge on 130,000 Shares for Refinancing",
            "Summary": "Ravi Agrawal, a promoter of Ajanta Pharma Limited, released pledge on 130,000 shares for refinancing purposes. The disclosure was made under SEBI regulations with the prescribed forms submitted to BSE and NSE exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1757497157837,
            "Source": "corporate_action"
        },
        {
            "Title": "Ajanta Pharma Reports Ongoing Income Tax Search at Offices and Manufacturing Units",
            "Summary": "Ajanta Pharma announced that the Income Tax Department conducted a search at some of its offices and manufacturing units on August 19, 2025, with the search still ongoing. The company stated it is fully cooperating with officials and providing requested clarifications. Business operations continue as usual without impact from the search. The company denied social media rumors and attributed recent significant share price movements to market-driven factors. For the first quarter ended June 30, 2025, Ajanta Pharma reported a 4% increase in net profit to ₹255.3 crore and 13.8% revenue growth to ₹1,302.7 crore. EBITDA grew 6.3% to ₹351.3 crore with a margin of 27%. The company achieved ROCE of 33% and RONW of 26%. Shares closed at ₹2,681.50, down 0.94%.",
            "Sentiment": "neutral",
            "PublishDate": 1755709438926,
            "Source": "stock"
        },
        {
            "Title": "IT Department Conducts Raids at Ajanta Pharma Premises",
            "Summary": "The Income Tax Department conducted raids at Ajanta Pharma's premises. No additional details about the scope, duration, or reasons for the raids were provided.",
            "Sentiment": "negative",
            "PublishDate": 1755597270502,
            "Source": "stock"
        },
        {
            "Title": "Ajanta Pharma Uploads Audio Recording of Q1 FY2026 Earnings Call",
            "Summary": "Ajanta Pharma has made available the audio recording of its earnings call held on July 28, 2025, at 4:00 p.m. on the company's website. The recording can be accessed at https://ajantapharma.com//images/EarningsAudio-Q1-FY2026.mp3. The company indicated that a written transcript of the earnings call will be submitted later. The notification was signed by Gaurang Shah, Senior VP – Legal & Company Secretary.",
            "Sentiment": "neutral",
            "PublishDate": 1753704431288,
            "Source": "earnings"
        },
        {
            "Title": "Ajanta Pharma Reports Growth in Q1 Revenue and Profit Despite Margin Decline",
            "Summary": "Ajanta Pharma reported Q1 consolidated net profit of 2.55 billion rupees compared to 2.5 billion rupees in the same period last year. Revenue increased to 13.03 billion rupees from 11.5 billion rupees year-over-year. EBITDA rose to 3.5 billion rupees from 3.3 billion rupees, though EBITDA margin declined to 27% from 29% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753695300009,
            "Source": "earnings"
        },
        {
            "Title": "Ajanta Pharmaceuticals: Block Trade of 315,631 Shares on NSE",
            "Summary": "A block trade of approximately 315,631 shares of Ajanta Pharmaceuticals Ltd. occurred on the National Stock Exchange (NSE) for a total value of Rs. 82.68 crores. The shares were traded at a price of Rs. 2619.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1752475148000,
            "Source": "block_details"
        },
        {
            "Title": "Ajanta Pharmaceuticals Block Trade on NSE",
            "Summary": "A block trade of approximately 210,693 shares of Ajanta Pharmaceuticals Ltd. occurred on the National Stock Exchange (NSE) for Rs. 53.62 crores. The trade was executed at a price of Rs. 2545.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1750220919000,
            "Source": "block_details"
        },
        {
            "Title": "Ajanta Pharma: Q4 Revenue Up, Margins Contract",
            "Summary": "Ajanta Pharma reported Q4 FY25 revenue of Rs 11.7 billion, up 11% YoY. Ebitda rose 6.8% YoY to Rs 2.97 billion, but margins contracted. PAT increased 11.1% YoY to Rs 2.3 billion. Systematix maintains 'Buy' rating but cuts target price.",
            "Sentiment": "neutral",
            "PublishDate": 1746164030000,
            "Source": "earnings"
        },
        {
            "Title": "Ajanta Pharma: Q4 Profit and Revenue Rise 11%, Margin Contracts",
            "Summary": "Ajanta Pharma reported an 11% year-on-year increase in both profit (₹225 crore) and revenue (₹1,170 crore) for Q4. EBITDA rose 7% to ₹297 crore, with a margin of 25%. The company distributed ₹700 crore to shareholders in FY2025, representing a 76% payout of total PAT.",
            "Sentiment": "positive",
            "PublishDate": 1746008033000,
            "Source": "earnings"
        },
        {
            "Title": "Ajanta Pharma Reports Q4 Financial Results",
            "Summary": "Ajanta Pharma has released its Q4 financial results. The company reported revenue of 11.7 billion rupees, up from 10.54 billion rupees year-over-year. EBITDA increased to 2.97 billion rupees from 2.78 billion rupees, although the EBITDA margin decreased slightly to 25.38% from 26.4%. Consolidated net profit rose to 2.25 billion rupees from 2 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1746006942000,
            "Source": "result"
        },
        {
            "Title": "Ajanta Pharma Added to FTSE All World Index",
            "Summary": "Ajanta Pharma has been added to the FTSE All World Index, which is expected to result in an inflow of approximately $23.8 million (2.0 billion rupees) into the stock.",
            "Sentiment": "positive",
            "PublishDate": 1742548494000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ajanta Pharma Announces Expansion of Pithampur Facility",
            "Summary": "Ajanta Pharma has announced plans to expand its manufacturing capabilities by adding a liquid formulation facility at its Pithampur site. The company states that this expansion will require an investment of 920 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1742470351000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ajanta Pharma Reports Q3 Financial Results",
            "Summary": "Ajanta Pharma announced its third quarter consolidated financial results. The company's net profit increased to 2.33 billion rupees, up from 2 billion rupees in the same quarter last year. Revenue also saw growth, reaching 11.46 billion rupees compared to 11.05 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738284343000,
            "Source": "earnings"
        },
        {
            "Title": "Ajanta Pharma: Q3 Profit Up 11%, Revenue Grows 3.7%",
            "Summary": "Ajanta Pharma reported Q3 FY25 net profit of ₹233 crore, up 11% YoY. Revenue increased 3.7% to ₹1,146 crore. EBITDA margin declined to 28% from 29%. Branded generic business in India grew 12%, outpacing market growth. US generic business sales rose 4%.",
            "Sentiment": "positive",
            "PublishDate": 1738235782000,
            "Source": "earnings"
        },
        {
            "Title": "Ajanta Pharma Provides Financial Outlook for FY 2025",
            "Summary": "Ajanta Pharma has shared financial projections during a conference call. The company expects its EBITDA margin to be around 28% (plus or minus 0.5% to 1%) for the entire year. For FY 2025, Ajanta Pharma anticipates mid-single-digit growth in its US business and mid-teens growth in its branded generic business.",
            "Sentiment": "positive",
            "PublishDate": 1730172188000,
            "Source": "normal_news"
        },
        {
            "Title": "Ajanta Pharma Expects Stable Gross Margins",
            "Summary": "Ajanta Pharma anticipates its gross margin to remain relatively stable, with potential quarterly fluctuations of 50 to 100 basis points due to changes in product mix, as reported in a recent conference call update.",
            "Sentiment": "neutral",
            "PublishDate": 1730172160000,
            "Source": "normal_news"
        },
        {
            "Title": "Ajanta Pharma: Q2 Branded Generics Revenue Exceeds Expectations",
            "Summary": "Ajanta Pharma's Q2 results show branded generics revenue outperforming expectations, according to a Systematix report.",
            "Sentiment": "positive",
            "PublishDate": 1730171669000,
            "Source": "result"
        },
        {
            "Title": "Ajanta Pharma: Board Approves ₹28 Interim Dividend Amid Q2 Results",
            "Summary": "Ajanta Pharma declares ₹28 per share interim dividend, totaling ₹350 crore. Record date set for November 6, 2024, with payment by November 15. Q2 profit up 11% YoY to ₹216 crore, revenue rose 15% to ₹1,187 crore.",
            "Sentiment": "positive",
            "PublishDate": 1730113414000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ajanta Pharma Reports Q2 Financial Results",
            "Summary": "Ajanta Pharma announced its Q2 financial results. The company's EBITDA increased to 3.1 billion rupees from 2.9 billion rupees year-over-year. However, the EBITDA margin decreased to 26.22% from 28.26% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730111308000,
            "Source": "result"
        },
        {
            "Title": "Ajanta Pharma Reports Q2 Revenue Growth",
            "Summary": "Ajanta Pharma, an Indian pharmaceutical company, has reported its second quarter revenue for the current fiscal year. The company's revenue increased to 11.9 billion rupees, up from 10.28 billion rupees in the same quarter of the previous year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730111299000,
            "Source": "result"
        },
        {
            "Title": "Ajanta Pharma Reports Q2 Consolidated Net Profit Increase",
            "Summary": "Ajanta Pharma announced its Q2 consolidated net profit of 2.16 billion rupees, showing an increase from 1.9 billion rupees year-over-year. The profit also improved from 2.45 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730111288000,
            "Source": "result"
        },
        {
            "Title": "Ajanta Pharma: Board to Consider First Interim Dividend on October 28",
            "Summary": "Ajanta Pharma's board will meet on October 28 to consider a first interim dividend for FY 2024-25. The record date for dividend payment is set for November 6, 2024. The company will also review its Q2 results during the meeting.",
            "Sentiment": "positive",
            "PublishDate": 1729680957000,
            "Source": "corporate_action"
        }
    ]
}