{
    "Symbol": "AJAXENGG",
    "ISIN": "INE274Y01021",
    "News": [
        {
            "Title": "Ajax Engineering Appoints Interim CFO Ganesh B J",
            "Summary": "Ajax Engineering Limited has appointed Mr. Ganesh B J as Interim Chief Financial Officer with effect from December 31, 2025, following board approval and committee recommendations.",
            "Sentiment": "positive",
            "PublishDate": 1767184655677,
            "Source": "stocks"
        },
        {
            "Title": "Ajax Engineering Reports 48% Revenue Growth Despite Margin Pressure from New Emission Norms",
            "Summary": "Ajax Engineering delivered strong quarterly results with revenue growing 48% to INR 445 crores driven by SLCM segment growth, though EBITDA margins declined 280 basis points to 10.2% due to higher production costs of new CEV5 machines. The company maintained its market leadership position at 71% market share while navigating industry challenges including extended monsoons, cash flow delays for contractors, and transition to new emission standards.",
            "Sentiment": "neutral",
            "PublishDate": 1763607954894,
            "Source": "earnings"
        },
        {
            "Title": "Ajax Engineering Provides Mixed FY26 Guidance with Margin Pressure Expected",
            "Summary": "Ajax Engineering management expects early double-digit top-line growth for FY26, below their historical 18% CAGR, with EBITDA margins declining by 150-200 basis points compared to FY25. The company anticipates margin improvement in H2 FY26 through operating leverage from higher volumes and potential price adjustments, while declining to provide FY27 guidance.",
            "Sentiment": "neutral",
            "PublishDate": 1763203146358,
            "Source": "stock"
        },
        {
            "Title": "Ajax Engineering Reports 48% Revenue Growth in Q2FY26 Despite Margin Pressures",
            "Summary": "Ajax Engineering delivered 48% year-on-year revenue growth to ₹4,448 million in Q2FY26, driven by large contract deliveries in the SLCM segment. The company faced margin contraction due to increased production costs from emission norm changes, with gross margins declining 650 basis points to 24.0%, though management expects improvement in H2FY26.",
            "Sentiment": "positive",
            "PublishDate": 1763067961277,
            "Source": "earnings"
        },
        {
            "Title": "Ajax Engineering Expands Operations with Record Order Book and Plant Enhancement",
            "Summary": "Ajax Engineering reports a record order book in concrete equipment while expanding its Bengaluru plant and commissioning a new production line for slip-form pavers. The company is diversifying into road construction machinery and smart IoT solutions, targeting double-digit EBITDA margins through innovation-led products.",
            "Sentiment": "positive",
            "PublishDate": 1763052182006,
            "Source": "stock"
        },
        {
            "Title": "Ajax Engineering Reports Quarterly Financial Results for September 2025",
            "Summary": "Ajax Engineering Limited announced its unaudited financial results for the quarter and six months ended September 30, 2025, with statutory auditors S.R. Batliboi and Associates LLP providing an unmodified opinion on the results. The Board of Directors approved the financial statements at their meeting on November 13, 2025, which will be published in newspapers and made available on the company's website as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1763047576589,
            "Source": "earnings"
        },
        {
            "Title": "Ajax Engineering CFO Tuhin Basu Resigns to Pursue Entrepreneurship",
            "Summary": "Tuhin Basu has resigned from his position as Chief Financial Officer of Ajax Engineering Limited, effective September 30, 2025. Basu cited his decision to embark on an entrepreneurship journey as the reason for his resignation and confirmed there are no other material reasons for his departure. He will continue working with the company in an advisory role starting October 1, 2025. Ajax Engineering has notified stock exchanges BSE and NSE of this change in key managerial personnel.",
            "Sentiment": "neutral",
            "PublishDate": 1758722547374,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ajax Engineering Reports Flat Revenue Growth and Margin Pressure in Q1 FY26 Results",
            "Summary": "Ajax Engineering Limited reported flat revenue of Rs. 467 crores for Q1 FY26, while EBITDA declined 23% to Rs. 61 crores with margins compressing to 13.2% from 17.1% in the previous year. PAT fell to Rs. 53 crores from Rs. 67 crores. The company successfully transitioned to CEV-5 emission-compliant machines, which comprised 90% of SLCM sales, though this increased material costs by 400 basis points. Market share recovery was evident in July, reaching above 75%. The company faces headwinds from infrastructure project execution slowdown, with PMGSY road construction declining 37% and highway construction pace reducing 9%. Management expects early double-digit volume growth for FY26 and plans to increase pricing towards the end of Q2 FY26. Ajax maintains Rs. 680 crores in cash and investments while expanding its dealer network and developing new facilities.",
            "Sentiment": "neutral",
            "PublishDate": 1754977962012,
            "Source": "earnings"
        },
        {
            "Title": "Ajax Engineering Q1FY26 Results: Revenue Flat at ₹4,665 Mn, Profit Falls 21% Amid Operational Challenges",
            "Summary": "Ajax Engineering reported mixed quarterly results with revenue from operations remaining flat at ₹4,665 million compared to ₹4,690 million in Q1FY25. Profit after tax declined 21% to ₹529 million from ₹670 million, while EBITDA dropped 23% to ₹614 million. The company faced challenges from unseasonal rains, emission norm changes, and slower project execution. EBITDA margin compressed 390 basis points to 13.2%, and PAT margin fell 290 basis points to 11.3%. However, non-SLCM volumes grew 25% year-on-year, while SLCM business remained stable. The company maintains market leadership with approximately 69% share in India's SLCM market and operates through 114 customer touchpoints with 52 dealers across 22 states. Ajax Engineering expects margin pressure in the near term but anticipates recovery through operational efficiencies and pricing adjustments.",
            "Sentiment": "negative",
            "PublishDate": 1754142412496,
            "Source": "stock"
        },
        {
            "Title": "Ajax Engineering Reports Q1 FY26 Results, Appoints Cost and Internal Auditors",
            "Summary": "Ajax Engineering Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs. 4,665.15 million compared to Rs. 4,690.04 million in the same quarter last year. Net profit for the quarter was Rs. 528.75 million versus Rs. 669.90 million in the previous year's corresponding quarter. Basic earnings per share stood at Rs. 4.62 compared to Rs. 5.86 in the prior year quarter. The Board appointed Mr. A.N. Sriram as Cost Auditor and PricewaterhouseCoopers Private Limited as Internal Auditors for financial year 2025-26. The company also announced its 33rd Annual General Meeting scheduled for September 5, 2025, to be conducted through video conferencing.",
            "Sentiment": "neutral",
            "PublishDate": 1754137842467,
            "Source": "earnings"
        },
        {
            "Title": "Ajax Engineering: Target Price Cut by Citi Amid Competition Concerns",
            "Summary": "Citi Research reduced Ajax Engineering's target price to Rs 690 from Rs 745, maintaining a 'Neutral' rating. The brokerage cut profit estimates for FY26 and FY27 by 8.5% and 8.1% respectively, citing rising competition and potential market share loss. Citi estimates 14% CAGR revenue growth for FY24-27, lower than competitors.",
            "Sentiment": "negative",
            "PublishDate": 1749523847000,
            "Source": "normal_news"
        },
        {
            "Title": "AJAX ENGINEERING Reports Q4 Financial Results",
            "Summary": "AJAX ENGINEERING has released its Q4 financial results. The company's EBITDA for Q4 was 111 million rupees, compared to 109 million rupees in the same quarter last year. The EBITDA margin decreased to 14.66% from 16.62% year-over-year. Net profit for Q4 was 910 million rupees, up from 883 million rupees year-over-year and 681 million rupees quarter-over-quarter. Q4 revenue increased to 7.6 billion rupees from 6.6 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748359241000,
            "Source": "result"
        },
        {
            "Title": "Ajax Engineering: Nuvama Initiates 'Buy' with ₹800 Target",
            "Summary": "Nuvama Institutional Equities initiated coverage on Ajax Engineering with a 'Buy' rating and a price target of ₹800, implying an 18% upside. The brokerage projects a 13% revenue CAGR over FY25-29E, citing Ajax's dominant market share in self-loading concrete mixers and strong presence in other construction equipment segments. Shares rose 3.40% to ₹700.20 following the recommendation.",
            "Sentiment": "positive",
            "PublishDate": 1744890699000,
            "Source": "normal_news"
        },
        {
            "Title": "Ajax Engineering Anticipates Muted Growth in Near Term",
            "Summary": "According to the Managing Director of Ajax Engineering, as stated in an investor presentation, the company expects the next few months to remain slightly subdued in terms of growth. However, they anticipate growth momentum to begin picking up from the second half of the fiscal year 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1741593942000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ajax Engineering Reports 38.5% Year-over-Year Revenue Growth in Q3",
            "Summary": "Ajax Engineering has announced its financial results for the third quarter, reporting a revenue of 5.4 billion rupees. This represents a significant increase from the 3.9 billion rupees reported in the same quarter of the previous year, indicating a year-over-year growth of approximately 38.5%.",
            "Sentiment": "positive",
            "PublishDate": 1741593857000,
            "Source": "earnings"
        },
        {
            "Title": "Ajax Engineering Reports Q3 EBITDA Growth",
            "Summary": "Ajax Engineering has reported its Q3 financial results. The company's EBITDA increased to 881 million rupees, up from 667 million rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 16.07% from 16.70% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1741593836000,
            "Source": "earnings"
        },
        {
            "Title": "AJAX Engineering Reports 26% Increase in Q3 Net Profit",
            "Summary": "AJAX Engineering has reported a net profit of 681 million rupees for the third quarter, compared to 539 million rupees in the same period last year, representing a year-over-year increase of approximately 26%.",
            "Sentiment": "positive",
            "PublishDate": 1741593795000,
            "Source": "earnings"
        },
        {
            "Title": "Ajax Engineering: 18% Growth Forecast Despite Weak Market Debut",
            "Summary": "Ajax Engineering Ltd. projects up to 18% growth after its market listing. The company's shares opened lower than the IPO price on both BSE and NSE, with discounts of 6% and 8.4% respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1739851263000,
            "Source": "normal_news"
        },
        {
            "Title": "Ajax Engineering: Morgan Stanley Offloads Rs 45 Crore Stake",
            "Summary": "Morgan Stanley sold over 7.58 lakh shares worth Rs 45 crore in Ajax Engineering at Rs 588.74 per share via a block deal through Morgan Stanley IFSC Fund. The stock, which recently listed at a discount, closed at Rs 593.40 on NSE and Rs 595.60 on BSE, recovering from its initial dip.",
            "Sentiment": "neutral",
            "PublishDate": 1739848631000,
            "Source": "block_deals"
        },
        {
            "Title": "Ajax Engineering: Morgan Stanley Offloads Shares Worth Rs 45 Crore on Debut Day",
            "Summary": "Morgan Stanley sold over 7.58 lakh shares of Ajax Engineering at Rs 588.74 per share via block deal on the company's stock market debut. Ajax Engineering listed at a discount of 8.4% on NSE and 5.7% on BSE against its IPO price of Rs 629. The stock ended the day at Rs 593.40 on NSE and Rs 595.60 on BSE, showing slight gains over listing price.",
            "Sentiment": "neutral",
            "PublishDate": 1739809309000,
            "Source": "block_deals"
        },
        {
            "Title": "Ajax Engineering Ltd: Shares Fluctuate After Weak Market Debut",
            "Summary": "Ajax Engineering Ltd shares opened at a discount on both BSE and NSE, fluctuating between ₹594 and ₹566. The stock debuted at ₹593 on BSE (5.72% below issue price) and ₹576 on NSE (8.42% below issue price). Market capitalization stood at ₹6,611.57 crore. Despite the weak opening, analysts remain optimistic about the company's long-term prospects in India's infrastructure sector.",
            "Sentiment": "neutral",
            "PublishDate": 1739775773000,
            "Source": "normal_news"
        },
        {
            "Title": "Ajax Engineering: Muted Debut Expected as Shares List Today",
            "Summary": "Ajax Engineering shares are set to debut on the stock market today with a Grey Market Premium (GMP) of Rs 0, indicating a flat to negative listing. The IPO, priced at Rs 629 at the upper end, was subscribed 6 times overall, with institutional investors showing the highest interest at 13 times subscription. The company, a leading concrete equipment manufacturer, will not receive any proceeds as the issue was entirely an offer for sale.",
            "Sentiment": "neutral",
            "PublishDate": 1739759039000,
            "Source": "normal_news"
        }
    ]
}