{
    "Symbol": "AKI",
    "ISIN": "INE642Z01026",
    "News": [
        {
            "Title": "AKI India Q3FY26 Results Show Mixed Performance",
            "Summary": "AKI India Limited reported Q3FY26 results with net sales declining to ₹1329.50 lakhs from ₹2174.81 lakhs YoY. Net profit dropped to ₹18.93 lakhs versus ₹66.97 lakhs in Q3FY25.",
            "Sentiment": "negative",
            "PublishDate": 1770920070260,
            "Source": "co_actions_results"
        },
        {
            "Title": "AKI India Reconstitutes Board with New Directors",
            "Summary": "AKI India Limited appointed three new independent directors and accepted resignations of three existing directors on January 9, 2026, while reconstituting key board committees.",
            "Sentiment": "neutral",
            "PublishDate": 1767966153306,
            "Source": "stocks"
        },
        {
            "Title": "AKI India Appoints 3 New Independent Directors",
            "Summary": "AKI India Limited announced major board changes with appointment of three new independent directors and resignation of three existing directors, along with reconstitution of key committees.",
            "Sentiment": "neutral",
            "PublishDate": 1767966062640,
            "Source": "stocks"
        },
        {
            "Title": "AKI India Appoints 3 New Independent Directors",
            "Summary": "AKI India Limited announces major board restructuring with appointment of three new independent directors and resignation of three existing directors, effective January 9, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767965883921,
            "Source": "stocks"
        },
        {
            "Title": "AKI India Reshuffles Board with New Directors",
            "Summary": "AKI India Limited appoints three new independent directors while accepting resignations from three existing directors, effective January 9, 2026. Board committees reconstituted accordingly.",
            "Sentiment": "neutral",
            "PublishDate": 1767964799065,
            "Source": "stocks"
        },
        {
            "Title": "AKI India Director Mrs. Sameena Asad Iraqi Passes Away",
            "Summary": "AKI India Limited announces the demise of Mrs. Sameena Asad Iraqi, Whole Time Director and Promoter Group member, who held 5.59% equity stake and served the company since 2002.",
            "Sentiment": "negative",
            "PublishDate": 1767274465342,
            "Source": "stocks"
        },
        {
            "Title": "AKI India Limited Receives LWG Gold Certification for Leather Manufacturing",
            "Summary": "AKI India Limited has been awarded the Gold Rating by the Leather Working Group (LWG) under Category C for rawhide/skin to finished leather manufacturing, following successful completion of the LWG Leather Manufacturer Audit Standard. The certification, valid until October 17, 2027, is expected to enhance the company's visibility, improve competitiveness, and create positive opportunities for future business and sales performance as global brands prioritize sourcing from LWG-certified suppliers.",
            "Sentiment": "positive",
            "PublishDate": 1764846310256,
            "Source": "stock"
        },
        {
            "Title": "AKI India Limited Reports Mixed Quarterly Performance with Standalone Profit Growth",
            "Summary": "AKI India Limited posted standalone net profit of ₹46.31 lakhs for the quarter ended September 30, 2025, compared to ₹20.77 lakhs in the previous quarter, while total income from operations reached ₹918.79 lakhs. The company's consolidated results showed net profit of ₹63.31 lakhs for the quarter, with the Board approving both standalone and consolidated unaudited financial results along with limited review reports.",
            "Sentiment": "neutral",
            "PublishDate": 1763145032640,
            "Source": "earnings"
        },
        {
            "Title": "AKI India Limited Reports Q1 FY2026 Financial Results with Mixed Performance",
            "Summary": "AKI India Limited announced its quarterly results for the period ended June 30, 2025. On a standalone basis, net sales declined to ₹1,136.46 lakhs from ₹1,870.98 lakhs in the same quarter last year. However, the company reported a net profit of ₹20.77 lakhs compared to ₹35.59 lakhs in the corresponding quarter of the previous year. On a consolidated basis, net sales decreased to ₹1,766.34 lakhs from ₹2,077.47 lakhs year-over-year, with net profit at ₹23.04 lakhs versus ₹43.42 lakhs in the same period last year. The company operates in the leather and leather goods segment. Additionally, AKI India raised ₹20.59 crores through conversion of warrants on a preferential basis in June 2025, with funds allocated for working capital requirements and general corporate purposes. The consolidated results include subsidiaries AKI UK Limited and AKI Castil Shoes LLP.",
            "Sentiment": "negative",
            "PublishDate": 1755180960970,
            "Source": "earnings"
        },
        {
            "Title": "AKI India Limited Receives Trading Approval for 1.47 Crore Equity Shares from Warrant Conversion",
            "Summary": "AKI India Limited has received trading approval from BSE and NSE for 1,46,73,782 fully paid-up equity shares of Rs. 2 each, issued at a premium of Rs. 16.71 per share. These shares were allotted following the conversion of warrants from a total of 1,74,41,782 convertible warrants issued on a preferential basis to promoters and non-promoters. The shares are listed and admitted for trading from August 7, 2025, with distinctive numbers ranging from 88532175 to 103205956. The shares are subject to lock-in periods with varying dates - some locked until March 5, 2026, and others until March 5, 2027. The company's original application for this preferential issue was made on November 11, 2023.",
            "Sentiment": "positive",
            "PublishDate": 1754553929572,
            "Source": "corporate_action"
        },
        {
            "Title": "DGCA Initiates Enforcement Action Against Air India for Overdue Emergency Slide Inspections",
            "Summary": "The Directorate General of Civil Aviation has launched enforcement proceedings against Air India for operating an aircraft with overdue emergency slide inspections, discovered during a regulatory audit. The aircraft was immediately grounded until required rectifications were completed. Emergency slides are critical inflatable evacuation devices, and their inspection is mandatory per safety regulations. The enforcement action comes amid broader regulatory concerns at Air India, with DGCA recently issuing multiple show-cause notices addressing crew rostering, fatigue management, and maintenance documentation issues. The airline has been given 14-15 days to respond to these notices. The safety breach occurred against the backdrop of the June 12 crash of Air India Flight AI 171, which resulted in 260 fatalities.",
            "Sentiment": "negative",
            "PublishDate": 1753716595977,
            "Source": "stock"
        },
        {
            "Title": "AKI India Limited Announces Book Closure for 31st Annual General Meeting",
            "Summary": "AKI India Limited has set book closure dates from August 6, 2025 to August 13, 2025 for its 31st Annual General Meeting. The company's register of members and share transfer books will remain closed during this period to determine shareholder eligibility for receiving meeting notices and participating in e-voting. The cut-off date for determining shareholders eligible to receive notices is July 18, 2025, while August 6, 2025 is the cut-off date for e-voting participation. The announcement was signed by Managing Director Mohammad Ajwad.",
            "Sentiment": "neutral",
            "PublishDate": 1753366837556,
            "Source": "corporate_action"
        },
        {
            "Title": "Air India Reports ₹10,859 Crore Loss Despite Becoming Tata Group's Fourth-Largest Revenue Contributor",
            "Summary": "Air India reported a consolidated net loss of ₹10,859 crore for FY25, making it the largest loss-making entity within the Tata Group while simultaneously becoming the fourth-largest revenue contributor to the conglomerate. The airline generated revenue of ₹78,636 crore, approaching market leader IndiGo's ₹84,098.2 crore, though IndiGo posted a profit of ₹7,253 crore during the same period. These figures represent Air India's first financial statement as a unified entity following the merger of Air India, Air India Express, Vistara, and AirAsia India. The merger of Air India and Vistara was completed on November 12, 2024, after the merger of Air India Express and AIX Connect on October 1, 2024. The high losses reflect structural and operational costs associated with ongoing transformation, including aircraft leases, training, integration systems, and tech upgrades. The consolidated results are not comparable to previous years as this marks the first time all four airlines have been reported as a single entity.",
            "Sentiment": "negative",
            "PublishDate": 1753365526422,
            "Source": "earnings"
        },
        {
            "Title": "Air India Reports Rise in Pilot Sick Leaves Following AI-171 Crash, Faces DGCA Compliance Violations",
            "Summary": "Air India experienced a minor increase in pilot sick leaves across all fleets after the AI-171 crash. On June 16, 112 pilots reported sick, including 51 Commanders and 61 First Officers. The London-bound AI-171 flight crashed shortly after takeoff from Ahmedabad, killing at least 275 people including 241 passengers and crew members. The Civil Aviation Ministry reported 58 aviation safety incidents over the last three years, with 24 in 2023, 17 in 2024, and 17 in 2025. The DGCA issued four showcause notices to Air India on July 23 for 29 compliance violations including crew scheduling failures, training violations, and flights operated with insufficient cabin crew. The violations occurred on flights between December 2024 and May 2025. Air India has 15 days to respond to the notices.",
            "Sentiment": "negative",
            "PublishDate": 1753353238504,
            "Source": "stock"
        },
        {
            "Title": "Air India Receives Four Showcause Notices from DGCA for 29 Safety and Crew Violations",
            "Summary": "The Directorate General of Civil Aviation issued four showcause notices to Air India for 29 compliance violations related to crew scheduling, training, and safety standards. The violations include 3 instances of crew not receiving mandatory weekly rest, 19 instances of crew training and procedure violations, 3 instances of cabin crew flying with lapsed competency cards or without required post-incident retraining, and four flights operated with insufficient cabin crew for ultra-long-range routes. These violations occurred during flights operated on April 10-11, February 16-May 19, and December 1, 2024. Air India has 15 days to respond to the notices dated July 23. The DGCA warned of potential enforcement action including fines or executive removals, noting that systemic issues remain unresolved despite repeated warnings. Air India stated the notices relate to voluntary disclosures made over the past year and committed to crew and passenger safety. The airline faces increased scrutiny following the crash of London-bound flight AI171 that killed at least 270 people.",
            "Sentiment": "negative",
            "PublishDate": 1753348187913,
            "Source": "stock"
        },
        {
            "Title": "Air India Aircraft Experiences APU Fire After Landing in Delhi from Hong Kong",
            "Summary": "An Air India flight AI 315 from Hong Kong to Delhi experienced a fire in its auxiliary power unit (APU) after landing at Indira Gandhi International Airport. The Airbus A321-251NX landed at 12:12 pm and the fire occurred after parking at the gate while passengers were disembarking. The APU was automatically shut down by the system as designed. All passengers and crew members disembarked safely with no injuries reported. The aircraft sustained some damage and has been grounded for investigation. Aviation regulators have been informed of the incident.",
            "Sentiment": "negative",
            "PublishDate": 1753190885794,
            "Source": "stock"
        },
        {
            "Title": "AKI India Limited Appoints New Auditors and Schedules Annual General Meeting",
            "Summary": "AKI India Limited's Board of Directors recommended the appointment of M/s. R K Parmarthi & Co., Chartered Accountants as statutory auditor and M/s. Jitendra Parmar & Associates as secretarial auditor for five consecutive years from 2025-26 to 2029-30, subject to shareholder approval. The Board also approved the notice and related documents for the 31st Annual General Meeting scheduled for August 13, 2025 at 2:00 PM through video conference. R K Parmarthi & Co. is a 33-year-old partnership firm based in Kanpur, primarily engaged in accounting and auditing activities. Jitendra Parmar & Associates is an Ahmedabad-based firm with over 9 years of corporate legal experience in private and public listed companies.",
            "Sentiment": "neutral",
            "PublishDate": 1753190710822,
            "Source": "corporate_action"
        },
        {
            "Title": "Air India and Air India Express Complete DGCA-Mandated Fuel Switch Inspections, Find No Issues",
            "Summary": "Air India and Air India Express completed precautionary inspections on the locking mechanism of Fuel Control Switch (FCS) on all Boeing 787 and Boeing 737 aircraft in their fleets, with no issues found during the checks. The inspections were conducted following DGCA directives issued on July 14, requiring Indian carriers to inspect FCS locks on Boeing aircraft by July 21. The regulatory order came after a preliminary report by the Aircraft Accident Investigation Bureau cited the disengagement of a fuel switch lock as a factor in the crash of Air India flight AI171 in Ahmedabad on June 12. Other Indian carriers operating Boeing 737 jets, including Akasa Air and SpiceJet, were also subject to the same directive. Air India began the inspections voluntarily on July 12 and completed them within the compliance period.",
            "Sentiment": "neutral",
            "PublishDate": 1753172733089,
            "Source": "stock"
        },
        {
            "Title": "Air India Flight Aborts Takeoff at Delhi Airport Due to Technical Issue",
            "Summary": "An Air India flight bound for Kolkata aborted takeoff at Delhi airport on Monday evening due to a technical snag. Flight AI2403 was rescheduled to depart later the same evening after the cockpit crew detected a technical issue during the takeoff roll and discontinued the takeoff following standard operating procedures. All passengers disembarked safely and received support from airline staff. The flight was scheduled to operate with an A321 aircraft.",
            "Sentiment": "negative",
            "PublishDate": 1753116674422,
            "Source": "stock"
        },
        {
            "Title": "Air India Receives Nine Show Cause Notices for Safety Violations in Six Months",
            "Summary": "Air India received nine show cause notices related to five safety violations over the last six months, with enforcement action completed for one violation. This follows a fatal crash of Air India's Boeing 787-8 aircraft traveling from Ahmedabad to London Gatwick, which killed 260 people and injured 81. The Directorate General of Civil Aviation ordered additional inspections of the airline's Boeing 787-8/9 fleet. Out of 33 aircraft, 31 operational planes were inspected with minor findings in 8 aircraft, which were cleared for operation after repairs. Two aircraft remain under scheduled maintenance. Civil Aviation Minister K Rammohan Naidu stated that no adverse reliability trends were reported for Air India regarding the crashed aircraft during the six months prior. The DGCA conducted 254 enforcement actions this year through April, compared to 673 in 2024 and 542 in 2023. The regulator has planned 56 regulatory audits for this year.",
            "Sentiment": "negative",
            "PublishDate": 1753113382996,
            "Source": "stock"
        },
        {
            "Title": "Air India Flight Overshoots Runway at Mumbai Airport Due to Heavy Rain, All Passengers Safe",
            "Summary": "Air India flight AI 2744 from Kochi overshot the runway while landing at Mumbai's Chhatrapati Shivaji Maharaj International Airport on 21 July 2025 at 9:27 am due to heavy rain. The Airbus A320 experienced a runway excursion after touchdown, with three tyres bursting and potential engine damage from debris. Despite the incident, all passengers and crew disembarked safely without injury. The aircraft has been grounded for inspection. The airport's primary runway sustained minor damage and operations shifted to the secondary runway while repairs are conducted. Both Air India and the airport confirmed the incident, emphasizing that passenger and crew safety remains their top priority.",
            "Sentiment": "neutral",
            "PublishDate": 1753084136295,
            "Source": "stock"
        },
        {
            "Title": "Aviation Minister Defends Air India Crash Investigation Process Amid Media Speculation",
            "Summary": "Union Civil Aviation Minister Ram Mohan Naidu stated that the investigation into the Air India Dreamliner crash in Ahmedabad is following international protocols and urged against speculation until the final report is complete. The Aircraft Accident Investigation Bureau is conducting the probe transparently, with black box data decoded in India for the first time rather than being sent abroad. The comments follow a Wall Street Journal report suggesting cockpit voice recordings indicate the captain may have turned off fuel switches to both engines. The AAIB preliminary findings confirmed both fuel control switches moved from 'RUN' to 'CUTOFF' seconds after take-off on June 12, causing engine thrust loss. Cockpit recordings captured one pilot asking 'Why did you cut off?' with another replying 'I didn't,' though the AAIB did not identify which pilot made the statements. Air India Flight 171, a Boeing 787-8, crashed 32 seconds after take-off, killing 241 of 242 people on board and 19 on the ground.",
            "Sentiment": "neutral",
            "PublishDate": 1753083387035,
            "Source": "stock"
        },
        {
            "Title": "US NTSB Supports India's Investigation into Air India Flight 171 Crash, Criticizes Media Speculation",
            "Summary": "The US National Transportation Safety Board backed India's Aircraft Accident Investigation Bureau in calling recent media coverage of the Air India Flight 171 crash investigation 'premature and speculative.' NTSB Chairwoman Jennifer Homendy emphasized that investigations of this magnitude take time, following the AAIB's preliminary report release. The AAIB criticized international media for drawing conclusions through selective and unverified reporting while the investigation remains ongoing. The preliminary report revealed both engines of the Boeing 787-8 Dreamliner shut down within seconds of take-off from Ahmedabad on June 12. Flight AI 171, bound for London Gatwick, struck the BJ Medical College hostel complex after departure, marking the first fatal accident involving a Boeing 787 Dreamliner. Tata Sons has established a ₹500 crore charitable trust for victims with a 5-member board.",
            "Sentiment": "negative",
            "PublishDate": 1752903783244,
            "Source": "stock"
        },
        {
            "Title": "Air India: CEO Responds to Plane Crash in Ahmedabad",
            "Summary": "Air India's CEO Campbell Wilson announced the dispatch of a special team to Ahmedabad following the crash of flight AI 171. The plane, carrying 242 people including crew, was en route to London. A helpline has been set up for families. The cause of the crash is under investigation.",
            "Sentiment": "negative",
            "PublishDate": 1749739710000,
            "Source": "normal_news"
        },
        {
            "Title": "Air India: Reassessing Partnership with Turkish Technic Amid Geopolitical Tensions",
            "Summary": "Air India CEO Campbell Wilson announces review of maintenance partnership with Turkish Technic due to recent India-Pakistan tensions and Turkey's perceived stance. The airline is actively seeking alternative service providers for aircraft maintenance and refurbishment, potentially severing ties with Turkish Technic to respect public sentiment.",
            "Sentiment": "negative",
            "PublishDate": 1748827242000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Air India: Targeting Long-Haul Transit Traffic for Revenue Growth",
            "Summary": "Air India aims to capture a larger share of international transit traffic, particularly from North America and Europe to Asian destinations. The airline has seen significant revenue growth since Tata Group's acquisition, with passenger revenue up 1.6 times, cargo revenue 1.9 times, and ancillary revenue 2.6 times. Air India plans to expand its market share in long-haul routes, currently dominated by foreign airlines.",
            "Sentiment": "positive",
            "PublishDate": 1736726419000,
            "Source": "normal_news"
        },
        {
            "Title": "Air India: Supply Chain Issues Force Growth Plan Recalibration",
            "Summary": "Air India CEO Campbell Wilson reports that delivery delays and supply chain issues are forcing the airline to adjust its growth plans. The carrier is refitting existing aircraft and looking to expand partnerships with Singapore Airlines. Air India has ordered 500 new planes from Airbus and Boeing to compete globally.",
            "Sentiment": "neutral",
            "PublishDate": 1732873457000,
            "Source": "normal_news"
        },
        {
            "Title": "Air India: CEO Discusses Turnaround Progress, Vistara Merger, and Expansion Plans",
            "Summary": "Air India CEO Campbell Wilson states the airline's turnaround is accelerating, with the average employee age reduced from 54 to 35 and 9,000 new hires in the past year. The recent Vistara merger is expected to catalyze growth. Air India plans to expand its fleet from 120 to over 470 aircraft, with one-third of wide-body fleet already modernized.",
            "Sentiment": "positive",
            "PublishDate": 1732790840000,
            "Source": "corporate_action"
        },
        {
            "Title": "Air India: Valuation Soars to Rs 56,000 Crore Post-Merger",
            "Summary": "Air India has completed its merger with Vistara Airlines. Singapore Airlines has invested Rs 3,194.5 crore for a 25.1% stake in the merged entity, valuing Air India at approximately Rs 56,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1731471217000,
            "Source": "corporate_action"
        }
    ]
}