{
    "Symbol": "AKSHOPTFBR",
    "ISIN": "INE523B01011",
    "News": [
        {
            "Title": "Aksh Optifibre Q3FY26 Loss Widens to ₹380.66 Crores",
            "Summary": "Aksh Optifibre reported standalone net loss of ₹380.66 crores for Q3FY26, wider than ₹292.52 crores in Q3FY25. Revenue declined 7.86% to ₹2,623.47 crores amid operational challenges.",
            "Sentiment": "negative",
            "PublishDate": 1770400687073,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aksh Optifibre Board Meet Set for Feb 6, 2026",
            "Summary": "Aksh Optifibre Limited has scheduled its board meeting for February 6, 2026, to consider Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769080760882,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aksh Optifibre Wins Arbitration Against BSNL",
            "Summary": "Arbitral Tribunal awards ₹9.21 lakh plus interest and costs of ₹16.12 lakh to Aksh Optifibre in dispute with BSNL over delayed payments for 2018-19 supplies.",
            "Sentiment": "positive",
            "PublishDate": 1766748970634,
            "Source": "stocks"
        },
        {
            "Title": "Aksh Optifibre Promoter Director Sells Shares Worth 0.03% Stake",
            "Summary": "Dr. Kailash Shantilal Choudhari, Promoter Director of Aksh Optifibre Limited, sold 40,967 equity shares through open market transactions on December 04, 2025. His shareholding decreased from 2.77% to 2.74% of the company's total voting capital, with the transaction disclosed under SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1765000387514,
            "Source": "corporate_action"
        },
        {
            "Title": "Aksh Optifibre Reports Wider Losses in Q1 FY26 Amid Revenue Decline and Banking Disputes",
            "Summary": "Aksh Optifibre Limited reported quarterly results for the period ended June 30, 2025, showing deteriorating financial performance. Standalone revenue from operations declined to Rs 2,691.30 lakhs from Rs 4,097.60 lakhs in the same quarter last year. The company posted a standalone net loss of Rs 375.95 lakhs compared to Rs 311.07 lakhs loss in the previous year quarter. On a consolidated basis, the net loss widened to Rs 645.83 lakhs from Rs 551.50 lakhs year-on-year. Both manufacturing and services segments reported losses, with manufacturing segment recording a loss of Rs 203.95 lakhs and services segment posting a loss of Rs 45.27 lakhs. The company faces significant regulatory challenges, including unaccounted liabilities of Rs 1,951.70 lakhs in interest and Rs 840.19 lakhs in duty related to export schemes. Additionally, Aksh Optifibre received notices from Union Bank of India and HDFC Bank under SARFAESI Act, with HDFC Bank claiming Rs 3,663 lakhs. The company has filed applications with Debt Recovery Tribunal and is exploring one-time settlement options with banks.",
            "Sentiment": "negative",
            "PublishDate": 1754664763582,
            "Source": "earnings"
        },
        {
            "Title": "Aksh Optifibre: Q3 FY25 Loss Widens, Revenue Drops Significantly",
            "Summary": "Aksh Optifibre reported Q3 FY25 results with a loss of ₹4.74 crore, up 12.59% YoY. Revenue declined 43.95% YoY to ₹28.99 crore. QoQ, revenue grew 10.99% and losses reduced by 47.68%. Operating income increased 30.68% QoQ but decreased 185.25% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1739653043000,
            "Source": "earnings"
        }
    ]
}