{
    "Symbol": "AKSHARCHEM",
    "ISIN": "INE542B01011",
    "News": [
        {
            "Title": "AksharChem Q3FY26 Reports Loss of ₹461.56 Lakhs",
            "Summary": "AksharChem (India) Limited posted a net loss of ₹461.56 lakhs for Q3FY26 compared to profit of ₹119.05 lakhs in Q3FY25, with revenue declining to ₹8,037.87 lakhs from ₹9,068.58 lakhs year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1769603190369,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aksharchem Board Meet Set for Jan 28 to Review Q3 Results",
            "Summary": "Aksharchem (India) Limited has scheduled a board meeting on January 28, 2026, to consider and approve unaudited financial results for Q3 and nine months ended December 31, 2025. Trading window remains closed until 48 hours post-announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1768904843858,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aksharchem Solar Plant Operational from November 12",
            "Summary": "Aksharchem (India) confirms its 5.19 MWP solar power plant at Village Makdala has been operational since November 12, 2025, with GEDA commissioning certificate received December 09, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766061612859,
            "Source": "stocks"
        },
        {
            "Title": "Aksharchem India Reports Quarterly Loss, Receives Insurance Settlement for Fire Damage",
            "Summary": "Aksharchem (India) Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported a loss before tax for the quarter. The company received a partial insurance settlement of Rs. 543.16 lakhs for fire damage that occurred at its VS Plant in May 2024, with an additional Rs. 28.63 lakhs intimated as final settlement. The company recognized Rs. 169.61 lakhs as an exceptional item for the quarter related to this insurance claim. The fire had originally caused damage worth Rs. 402.18 lakhs to property, plant, equipment and inventory. Aksharchem operates in the chemical business segment and maintains facilities in Gujarat. The board meeting was held on November 12, 2025, where these results were approved.",
            "Sentiment": "neutral",
            "PublishDate": 1762984511110,
            "Source": "earnings"
        },
        {
            "Title": "Aksharchem India's General Manager Rajesh Samal Resigns Due to Family Concerns",
            "Summary": "Aksharchem (India) Limited announced that Mr. Rajesh Samal, General Manager (Works) and designated Senior Management Personnel, has resigned from his position effective October 31, 2025. Samal cited family concerns as the reason for his resignation. In his resignation letter, he expressed gratitude to management and colleagues for their support during his tenure and requested to be relieved from duties on the same date. The company has notified stock exchanges BSE and NSE about this senior management change.",
            "Sentiment": "neutral",
            "PublishDate": 1761906218263,
            "Source": "corporate_governance"
        },
        {
            "Title": "AksharChem Resumes Production at Green Plant After Planned Maintenance Shutdown",
            "Summary": "AksharChem (India) Limited has resumed production at its Green plant in Mahesana effective October 13, 2025, following a planned shutdown for repair and maintenance that began in September. The plant is located at Village Indrad, Chhatral-Kadi Road, Mahesana. The company stated that the shutdown does not have any material impact on its financials.",
            "Sentiment": "neutral",
            "PublishDate": 1760413592129,
            "Source": "stock"
        },
        {
            "Title": "AksharChem (India) Limited Shuts Down Green Plant for Maintenance",
            "Summary": "AksharChem (India) Limited announced a planned shutdown of its Green plant located in Indrad, Mahesana for repair and maintenance activities. The shutdown began on September 15, 2025 and is expected to last up to three weeks. The plant is situated at Village: Indrad, Chhatral-Kadi Road, Mahesana-382715.",
            "Sentiment": "neutral",
            "PublishDate": 1757935675219,
            "Source": "stock"
        },
        {
            "Title": "AksharChem Reports Rs 71.10 Lakh Quarterly Profit, Approves Key Reappointments",
            "Summary": "AksharChem (India) Limited reported a profit of Rs 71.10 lakhs for the quarter ended June 30, 2025, compared to Rs 115.16 lakhs in the same period last year. The company's revenue from operations stood at Rs 9,696.23 lakhs for the quarter. The board approved the reappointment of Mrs. Paru M. Jaykrishna as Chairperson & Managing Director for three years from April 2026 to March 2029, subject to shareholder approval. Additionally, Mr. Bipin L. Makwana was reappointed as Secretarial Auditor for five consecutive years from FY 2025-26 to FY 2029-30. The company operates in the chemical business segment and had previously experienced a fire incident at its plant in May 2024, for which insurance claims were processed.",
            "Sentiment": "neutral",
            "PublishDate": 1753447314294,
            "Source": "earnings"
        }
    ]
}