{
    "Symbol": "AKSHAR",
    "ISIN": "INE256Z01025",
    "News": [
        {
            "Title": "Akshar Spintex Board Approves Postal Ballot Notice",
            "Summary": "Akshar Spintex Limited's board meeting on January 19, 2026 approved postal ballot notice for director appointments and remuneration matters through remote e-voting process.",
            "Sentiment": "neutral",
            "PublishDate": 1768817281715,
            "Source": "stocks"
        },
        {
            "Title": "Akshar Spintex Appoints Bhavin Kothiya as Additional Independent Director",
            "Summary": "Akshar Spintex Limited has appointed Mr. Bhavin Jayantibhai Kothiya (DIN: 11379649) as Additional Director in the category of Non-Executive Independent Director for a 5-year term effective November 24, 2025, subject to shareholder approval. The appointee brings 4 years of experience in the pharmaceutical sector as a Quality Inspector and is not debarred from holding directorial positions by any regulatory authority.",
            "Sentiment": "positive",
            "PublishDate": 1763978722855,
            "Source": "corporate_governance"
        },
        {
            "Title": "Akshar Spintex Reports Loss of Rs 332.79 Lakhs in Q2 FY2026",
            "Summary": "Akshar Spintex Limited reported a net loss of Rs 332.79 lakhs for the quarter ended September 30, 2025, compared to a loss of Rs 95.65 lakhs in the same quarter of the previous year. Revenue from operations declined to Rs 2,234.18 lakhs from Rs 2,319.35 lakhs year-over-year. For the half-year period, the company posted a net loss of Rs 441.28 lakhs against Rs 107.20 lakhs in the corresponding period last year, while half-year revenue increased to Rs 4,852.98 lakhs from Rs 4,397.17 lakhs. The company operates in cotton yarn spinning and has paid-up equity share capital of Rs 7,874.68 lakhs. The auditor noted concerns regarding the company's failure to conduct physical verification of fixed assets and inventories during the review period.",
            "Sentiment": "negative",
            "PublishDate": 1762515340252,
            "Source": "earnings"
        },
        {
            "Title": "Akshar Spintex Limited Promoters File Disclosure for Inter Se Share Transfer",
            "Summary": "Harikrushna Shamjibhai Chauhan, representing acquirers and persons acting in concert, submitted a disclosure under SEBI regulations for an inter se transfer of shares through off-market transactions among promoters and promoter group of Akshar Spintex Limited. The disclosure was filed pursuant to Regulation 10(5) of SEBI (SAST) Regulations, 2011.",
            "Sentiment": "neutral",
            "PublishDate": 1761833100103,
            "Source": "corporate_action"
        },
        {
            "Title": "Akshar Spintex Limited Appoints Namrata Jagdishbhai Seta as Company Secretary and Compliance Officer",
            "Summary": "Akshar Spintex Limited appointed Miss Namrata Jagdishbhai Seta as Company Secretary and Compliance Officer effective October 18, 2025. The appointment was approved by the Board of Directors following recommendation from the Nomination and Remuneration Committee. Seta will also serve as Key Managerial Personnel under Section 203 of the Companies Act. She holds a Bachelor of Commerce degree and Company Secretary qualification, with membership number ACS 44802. Seta brings over 9 years of practicing experience in Corporate Laws, Corporate Governance and SEBI related matters as an associate member of the Institute of Company Secretaries of India.",
            "Sentiment": "neutral",
            "PublishDate": 1760780620108,
            "Source": "corporate_governance"
        },
        {
            "Title": "Akshar Spintex Shareholders Reject Harry Paghdar's Managing Director Appointment",
            "Summary": "Akshar Spintex Limited's shareholders voted down the special resolution to appoint Harry Dineshbhai Paghdar as Managing Director at the Annual General Meeting held on August 25, 2025. The Board had initially appointed Paghdar as Additional Director and Managing Director on May 21, 2025, but required shareholder approval. Following the failed resolution, the Managing Director position became vacant after August 25, 2025. The company stated it will continue to assess and evaluate potential candidates for the role. Paghdar is the son of Mrs. Illaben D. Paghdar, who is a Director of the company.",
            "Sentiment": "negative",
            "PublishDate": 1756295443533,
            "Source": "corporate_governance"
        },
        {
            "Title": "Akshar Spintex Limited Approves Unaudited Quarterly Financial Results",
            "Summary": "Akshar Spintex Limited's Board of Directors approved the company's unaudited standalone financial results for the quarter ended June 30, 2025, during a meeting held on August 7, 2025. The results were accompanied by a limited review report from auditor HB Kalaria & Associates. The board meeting took place at the company's registered office in Haripar, Jamnagar, and lasted from 1:15 p.m. to 2:05 p.m. The Chief Finance Officer certified that the financial results do not contain false or misleading statements. The auditor's review noted that the company has not transferred unspent CSR amounts for non-ongoing projects to the specified fund within the required timeframe, but confirmed the company has no ongoing projects with unspent CSR funds.",
            "Sentiment": "neutral",
            "PublishDate": 1754558937191,
            "Source": "earnings"
        },
        {
            "Title": "Akshar Spintex Board Approves Annual Report, Director Appointments and Schedules 12th AGM for August 25",
            "Summary": "Akshar Spintex Limited's Board of Directors approved the annual report for the year ended March 31, 2025, and made several key recommendations for shareholder approval. The Board recommended the reappointment of Harikrushna Samjibhai Chauhan as director, who is liable to retire by rotation. The Board also recommended regularizing the appointment of Harry Paghdar as Managing Director and Sureshkumar Chaturbhai Gajera as Independent Director. Additionally, the Board approved the appointment of D N Vora and Associates as Secretarial Auditors for five consecutive financial years from 2025-26 to 2029-30, and recommended Parsottambhai Vasoya's reappointment for a second five-year term. The company scheduled its 12th Annual General Meeting for August 25, 2025, at 3:00 PM via video conferencing, with remote e-voting available from August 22-24, 2025. The cut-off date for e-voting eligibility was set as August 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754039114026,
            "Source": "corporate_governance"
        }
    ]
}