{
    "Symbol": "AKUMS",
    "ISIN": "INE09XN01023",
    "News": [
        {
            "Title": "Akums Drugs Q3FY26 Earnings Call on Feb 16",
            "Summary": "Akums Drugs & Pharmaceuticals Limited has scheduled its Q3FY26 earnings call for February 16, 2026, at 12:00 PM IST to discuss unaudited financial results with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1769872436384,
            "Source": "co_actions_results"
        },
        {
            "Title": "Akums Drugs Receives EU-GMP Certificates for Two Plants",
            "Summary": "Akums Drugs and Pharmaceuticals Limited secured European GMP certificates for its Plant 1 and Plant 2 facilities at Haridwar, enabling access to EU regulated markets and new business opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1769169912291,
            "Source": "stocks"
        },
        {
            "Title": "Ruby Qc Investment sells 4.62% stake in Akums Drugs",
            "Summary": "Ruby Qc Investment Holdings Pte Ltd disposed of 72.79 lakh equity shares representing 4.62% stake in Akums Drugs and Pharmaceuticals Limited through block deal on December 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766397737178,
            "Source": "co_actions_results"
        },
        {
            "Title": "Akums Drugs Subsidiary Faces Additional ₹1.80 Cr Penalty",
            "Summary": "Maxcure Nutravedics Limited, wholly-owned subsidiary of Akums Drugs & Pharmaceuticals, receives additional penalty of ₹1.80 crores from Gujarat State Tax authorities for shipping address errors in invoices.",
            "Sentiment": "negative",
            "PublishDate": 1765872561180,
            "Source": "stocks"
        },
        {
            "Title": "Akums Drugs Q2FY26 Earnings: Revenue Flat at INR 1,018 Crores, EBITDA Margins Drop to 9.3%",
            "Summary": "Akums Drugs reported flat quarterly results with revenue at INR 1,018 crores (down 1.5% year-on-year) and EBITDA margins declining to 9.3% from 11.7% in Q2FY25, impacted by continued API price declines of 8% and higher overheads from new facilities. The company announced a joint venture with Zambia government for a USD 45 million manufacturing plant and secured European CDMO contract approvals, with commercial supplies to Europe expected from 2027.",
            "Sentiment": "negative",
            "PublishDate": 1763366633080,
            "Source": "earnings"
        },
        {
            "Title": "Akums Drugs Fully Utilizes Rs 6,373.70 Million IPO Proceeds Across All Stated Objectives",
            "Summary": "Akums Drugs and Pharmaceuticals Limited has completely utilized its IPO proceeds of Rs 6,373.70 million across five key areas including debt repayment (Rs 3,870 million), working capital funding (Rs 550 million), inorganic growth initiatives (Rs 278.70 million), and general corporate purposes (Rs 1,675 million). CRISIL Ratings Limited's monitoring report for the quarter ended September 30, 2025, confirms no deviations from the original objectives stated in the offer document, with all funds deployed as planned between September 2024 and June 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763174961012,
            "Source": "stock"
        },
        {
            "Title": "Akums Drugs Reports Strong Q2 Results, Approves USD 24 Million Zambia Investment and Key Management Appointments",
            "Summary": "Akums Drugs and Pharmaceuticals approved quarterly results for the quarter and half year ended 30 September 2025, alongside designating two senior management personnel including Dr. Shantanu Rajaram Chobhe as President (CQA) Formulation and Mr. Vinayak Bhat as VP (Operations) API division. The company's board approved a USD 24 million investment in Akums Healthcare (Zambia) Private Limited to establish manufacturing facilities and expand operations in the Zambian market and neighboring African countries, with the investment to be made in a staggered manner through March 2028.",
            "Sentiment": "positive",
            "PublishDate": 1763063579544,
            "Source": "stock"
        },
        {
            "Title": "Akums Drugs Pays Rs 3.83 Lakh Fine to NSE for Board Composition Non-Compliance",
            "Summary": "Akums Drugs and Pharmaceuticals paid a fine of Rs 3,83,500 to NSE on September 18, 2025, for non-compliance with SEBI regulation 17(1) regarding Board of Directors composition. The company informed both NSE and BSE that the matter was discussed in the Board meeting and the fine was paid within the stipulated timeline after NSE's final decision on their waiver application.",
            "Sentiment": "negative",
            "PublishDate": 1763060871143,
            "Source": "corporate_governance"
        },
        {
            "Title": "Akums Drugs & Pharmaceuticals Targets 20% CAGR Through Multi-Segment Expansion and New Manufacturing Facilities",
            "Summary": "Akums Drugs & Pharmaceuticals is expanding into injectables, oncology, and derma segments while commissioning 4 new facilities to enhance manufacturing capacity. The company is strengthening global CDMO partnerships and targeting 20% CAGR through diversification into regulated markets.",
            "Sentiment": "positive",
            "PublishDate": 1763051989238,
            "Source": "stock"
        },
        {
            "Title": "Akums Drugs Reports Q2FY26 Results with International Expansion into Zambia and Europe",
            "Summary": "Akums Drugs and Pharmaceuticals reported consolidated revenue of ₹1,018 crore for Q2FY26 with EBITDA at ₹94 crore (9.3% margin) and PAT of ₹43 crore, while CDMO segment contributed ₹804 crore with 7% volume growth. The company expanded globally with a pharmaceutical plant groundbreaking in Zambia and first commercial supply of formulations to Europe including Dapagliflozin tablets to Switzerland.",
            "Sentiment": "neutral",
            "PublishDate": 1763041345307,
            "Source": "earnings"
        },
        {
            "Title": "Akums Drugs and Pharma Reports Decline in Q2 Financial Performance",
            "Summary": "Akums Drugs and Pharma reported quarterly consolidated net profit of 408 million rupees compared to 652 million rupees in the same period last year. Revenue decreased to 10.16 billion rupees from 10.33 billion rupees year-over-year. EBITDA fell to 934.8 million rupees from 1.12 billion rupees, while EBITDA margin compressed to 9.19% from 11.73% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1763038705576,
            "Source": "earnings"
        },
        {
            "Title": "Akums Drugs & Pharmaceuticals Schedules Q2FY26 Earnings Call",
            "Summary": "Akums Drugs & Pharmaceuticals Limited has scheduled an earnings/analysts conference call for November 14, 2025 at 12:00 PM IST to discuss its Q2FY26 un-audited financial results. The call will be moderated by Pranav Chawla from Ambit Capital's Institutional Equities division. Company representatives include Managing Directors Sanjeev Jain and Sandeep Jain, Chief Financial Officer Sumeet Sood, and Head of Strategy Sahil Maheshwari. The company has provided dial-in details for participants and updated the disclosure on its website.",
            "Sentiment": "neutral",
            "PublishDate": 1762777546790,
            "Source": "earnings"
        },
        {
            "Title": "Akums Drugs Receives 20-Year Patent for Dual Release GERD Treatment Tablet",
            "Summary": "Akums Drugs And Pharmaceuticals has received a 20-year patent for a unique dual release gastro-resistant tablet designed to improve relief for GERD patients. The innovative tablet uses special tablet-in-tablet technology and has received DCGI approval.",
            "Sentiment": "positive",
            "PublishDate": 1762165716258,
            "Source": "stock"
        },
        {
            "Title": "Akums Drugs And Pharmaceuticals Establishes New Subsidiary in Malta",
            "Summary": "Akums Drugs And Pharmaceuticals has formed a new subsidiary named 'Akums Healthcare Malta Private Limited' in Malta. The company obtained the registration certificate for this subsidiary on October 20, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760947469496,
            "Source": "stock"
        },
        {
            "Title": "Akums Drugs Incorporates Joint Venture Company in Zambia",
            "Summary": "Akums Drugs and Pharmaceuticals Limited has incorporated a joint venture company named Akums Healthcare (Zambia) Private Limited in Zambia. The certificate of incorporation is dated October 13, 2025. This follows previous disclosures made by the company on October 18, 2024 and August 22, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760372178062,
            "Source": "stock"
        },
        {
            "Title": "Akums Drugs Signs Framework Agreement with Zambia Government for Local Manufacturing Facility",
            "Summary": "Akums Drugs and Pharmaceuticals Limited executed a Framework Agreement with the Government of the Republic of Zambia on August 22, 2025, to establish a local manufacturing facility in Zambia. The project will be implemented through a joint venture company where Akums will hold a 51% majority stake and a Zambian state instrumentality will own 49%. The facility is expected to commence manufacturing in 2028, producing general oral solids, liquids, injectables, and beta-lactam products. Until the facility becomes operational, the Government of Zambia will purchase medicines worth a minimum of USD 50 million over two years (2026-2027) at USD 25 million annually from Akums' facilities in India. The joint venture is expected to be established before year-end 2025. The facility aims to support Zambian national health programs, enhance local production capabilities, and potentially export to neighboring African countries including Zimbabwe, Namibia, Botswana, Malawi, Tanzania, and Mozambique. Akums will provide proprietary technology, know-how, and technical expertise through a separate Technology Transfer Agreement.",
            "Sentiment": "positive",
            "PublishDate": 1755883971902,
            "Source": "order&deals"
        },
        {
            "Title": "Akums Drugs Reports 19% EBITDA Growth in Q1 FY26 Despite Modest Revenue Increase",
            "Summary": "Akums Drugs & Pharmaceuticals reported total income of Rs. 1,051 crores, up 2.4% year-over-year for Q1 FY26. The company achieved stronger profitability with reported EBITDA of Rs. 156 crores, growing 19% year-over-year, and EBITDA margin expanding to 14.8%. The CDMO segment, which contributes the largest revenue share at Rs. 813 crores, grew 4% year-over-year despite a 2.5% impact from lower API prices. Domestic Branded Formulations revenue reached Rs. 107 crores with 3.4% growth, while API revenue declined 35% to Rs. 45 crores as the company focuses on select high-margin molecules. The company received 27 DCGI approvals in the quarter and achieved the milestone of 1,000 cumulative DCGI approvals. Management expects mid-single digit growth for the CDMO business in FY26 with margins remaining in the 14-15% range. The company is expanding internationally with its first European dossier approval for Rivaroxaban and targeting $100 million in formulation exports over the next five years.",
            "Sentiment": "positive",
            "PublishDate": 1755523266216,
            "Source": "earnings"
        },
        {
            "Title": "Akums Drugs Reports 19% YoY Growth in Adjusted EBITDA, Achieves 1,000 DCGI Approvals Milestone",
            "Summary": "Akums Drugs and Pharmaceuticals reported total income of ₹1,051 crore for Q1 FY26, with adjusted EBITDA of ₹156 crore reflecting 19.1% year-on-year growth. EBITDA margins improved to 14.8% from 12.7% in the previous year, representing a 208 basis points improvement. The company achieved a milestone of 1,000 DCGI approvals, adding 27 new approvals during the quarter. Akums received its first European dossier approval for Rivaroxaban and filed its first dossier for Dapagliflozin combination in Switzerland. The company received €100 million as advance payment for its European contract, bringing cash surplus to ₹1,518 crore. CDMO business contributed 79% to group turnover with 14.7% EBITDA margin. Domestic branded formulation grew 3% year-on-year while international branded formulation increased 2%. Trade generics and API segments remained in operational loss though losses are gradually reducing. Commercial supplies for the European contract are scheduled to commence from April 2027.",
            "Sentiment": "positive",
            "PublishDate": 1754658010366,
            "Source": "earnings"
        },
        {
            "Title": "Akums Drugs and Pharma Reports Marginal Growth in Q1 Net Profit",
            "Summary": "Akums Drugs and Pharma reported Q1 consolidated net profit of 635 million rupees compared to 602 million rupees in the same period last year. Revenue remained flat at 10.2 billion rupees year-over-year. EBITDA stayed unchanged at 1.3 billion rupees, while EBITDA margin improved slightly to 12.59% from 12.56% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754655172378,
            "Source": "earnings"
        },
        {
            "Title": "Akums Drugs & Pharmaceuticals Schedules Q1 FY26 Earnings Call for August 11, 2025",
            "Summary": "Akums Drugs & Pharmaceuticals Limited will host an earnings/analysts conference call on August 11, 2025, at 12:00 PM IST to discuss its unaudited financial results for Q1 FY26. The call will be moderated by Prashant Nair from Ambit Capital's Institutional Equities division. Company representatives include Managing Directors Sanjeev Jain and Sandeep Jain, Chief Financial Officer Sumeet Sood, and Head of Strategy Sahil Maheshwari. The company has provided dial-in details for domestic and international participants, with access numbers for India, Singapore, Hong Kong, USA, and UK.",
            "Sentiment": "neutral",
            "PublishDate": 1754380613781,
            "Source": "earnings"
        },
        {
            "Title": "Akums Drugs Reports Q4 Financial Results",
            "Summary": "Akums Drugs announced its Q4 consolidated financial results. The company reported a net profit of 148 million rupees, compared to a loss of 413 million rupees in the same quarter last year and a profit of 65 million rupees in the previous quarter. Revenue for Q4 was 10.55 billion rupees, up from 9.44 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1748304325000,
            "Source": "default"
        },
        {
            "Title": "AKUMS DRUGS Reports Significant Improvement in Q4 Financial Results",
            "Summary": "AKUMS DRUGS has reported a substantial increase in its Q4 EBITDA, rising to 939 million rupees from 31 million rupees year-over-year. The company's EBITDA margin improved to 8.90% from 0.33% in the same period. AKUMS DRUGS also turned a profit in Q4, reporting a consolidated net profit of 148 million rupees, compared to a loss of 413 million rupees in the previous year and a profit of 65 million rupees in the previous quarter. The company's Q4 revenue increased to 10.55 billion rupees from 9.44 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748266702000,
            "Source": "result"
        },
        {
            "Title": "Akums Drugs and Pharmaceuticals: Income Tax Raids Offices and Executives' Homes",
            "Summary": "The Income Tax Department conducted a search operation at Akums Drugs and Pharmaceuticals' offices, manufacturing units, and residences of managing directors and CFO from January 15-21, 2025. The company cooperated fully and has not received any written communication or financial demands from the department regarding the outcome or alleged violations.",
            "Sentiment": "neutral",
            "PublishDate": 1737643732000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Akums Drugs & Pharmaceuticals: Income Tax Search Triggers Share Price Drop",
            "Summary": "Akums Drugs & Pharmaceuticals Ltd. shares fell over 6% following an Income Tax Department search at the company's offices and manufacturing units. The company is cooperating with officials and expects minimal disruption to business operations.",
            "Sentiment": "negative",
            "PublishDate": 1737526393000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Akums Drugs: Secures €200 Million CDMO Contract for European Market",
            "Summary": "Akums Drugs and Pharmaceuticals Ltd. has signed a long-term contract worth ₹1,760 crore (€200 million) with a leading global pharma company to manufacture and supply oral liquid formulations for the European market. Commercial supply will start in 2027 and continue until 2032. Akums received an upfront payment of €100 million for product development and site approval.",
            "Sentiment": "positive",
            "PublishDate": 1735028633000,
            "Source": "order&deals"
        },
        {
            "Title": "Akums Drugs Signs Exclusive Agreement with South Korean Nutraceutical Company",
            "Summary": "Akums Drugs has entered into an exclusive master sales agreement with Caregen Co. Ltd, a prominent South Korean company specializing in nutraceuticals. This partnership suggests a strategic move by Akums Drugs to expand its product portfolio or distribution network in the nutraceutical segment.",
            "Sentiment": "positive",
            "PublishDate": 1731998854000,
            "Source": "corporate_action"
        },
        {
            "Title": "Akums Drugs: Stock Plummets 35% in 10 Days, Falls Below IPO Price",
            "Summary": "Akums Drugs and Pharmaceuticals Ltd. stock has fallen 35% over 10 sessions, now trading below its IPO price. Q2 results show 16% YoY profit rise but 11.9% revenue decline. MD expects flat revenue for FY25 with 15% CDMO margin. Current share price at ₹582.10, 14% below IPO price of ₹679.",
            "Sentiment": "negative",
            "PublishDate": 1731565825000,
            "Source": "result"
        },
        {
            "Title": "Akums Drugs Reports Q2 EBITDA Decline",
            "Summary": "Akums Drugs has reported a decrease in its Q2 EBITDA, which fell to 1.12 billion rupees from 1.52 billion rupees year-over-year. The company's EBITDA margin also declined to 11.73% from 12.84% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731292344000,
            "Source": "result"
        },
        {
            "Title": "AKUMS DRUGS Reports Q2 Financial Results",
            "Summary": "AKUMS DRUGS announced its Q2 consolidated financial results. The company's net profit increased to 652 million rupees, up from 318 million rupees in the same quarter last year. However, revenue decreased to 10.3 billion rupees from 11.8 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731292332000,
            "Source": "result"
        },
        {
            "Title": "AKUMS DRUGS Signs MOU with Zambian Government for Local Medicine Manufacturing",
            "Summary": "AKUMS DRUGS has entered into a Memorandum of Understanding (MOU) with the Government of the Republic of Zambia. The agreement aims to establish local manufacturing of medicines in Zambia.",
            "Sentiment": "positive",
            "PublishDate": 1729236212000,
            "Source": "corporate_action"
        },
        {
            "Title": "Akums Drugs: Shares Surge on Canadian Distribution Deal",
            "Summary": "Akums Drugs & Pharmaceuticals Ltd shares rose 5.5% after signing an exclusive license and distribution agreement with Canada's Triple Hair Inc for the Indian market. The deal grants Akums rights to develop and market Triple Hair's products in India, subject to regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1729066967000,
            "Source": "normal_news"
        },
        {
            "Title": "Akums Drugs: Exclusive License Agreement with Triple Hair Inc for Indian Market",
            "Summary": "Akums Drugs & Pharmaceuticals has signed an exclusive License & Distribution Agreement with Triple Hair Inc for developing and marketing Triple Hair's patented hair products in India, pending regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1729064520000,
            "Source": "corporate_action"
        },
        {
            "Title": "AKUMS Drugs Launches New Medication in India",
            "Summary": "<p><span class=\"neutral\">AKUMS Drugs</span> has <span class=\"positive\">introduced</span> a <b>new medication</b> in the <span class=\"neutral\">Indian market</span>. The product <span class=\"positive\">combines</span> three <b>active ingredients</b>: <span class=\"neutral\">Famotidine</span>, <span class=\"neutral\">Calcium Carbonate</span>, and <span class=\"neutral\">Magnesium Hydroxide</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728475688000,
            "Source": "corporate_action"
        }
    ]
}