{
    "Symbol": "AKZOINDIA",
    "ISIN": "INE133A01011",
    "News": [
        {
            "Title": "Akzo Nobel India Q3FY26 Results: Revenue Dips 1%",
            "Summary": "Akzo Nobel India reports Q3FY26 revenue decline of 1% to ₹907.7 crore amid competitive pressures, while maintaining EBITDA margin at 14.9%. JSW Paints completes acquisition with 61.2% stake.",
            "Sentiment": "neutral",
            "PublishDate": 1770109215169,
            "Source": "co_actions_results"
        },
        {
            "Title": "Akzo Nobel India to Become JSW Dulux Limited",
            "Summary": "Akzo Nobel India Limited's board approves name change to JSW Dulux Limited and key director appointments, including Parth Sajjan Jindal as Chairman, subject to shareholder approval via postal ballot.",
            "Sentiment": "neutral",
            "PublishDate": 1769604673067,
            "Source": "stocks"
        },
        {
            "Title": "Akzo Nobel India Q3FY26 Results Call on Feb 3",
            "Summary": "Akzo Nobel India Limited has scheduled a group conference call on February 3, 2026 at 3 pm to discuss Q3FY26 financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769586641582,
            "Source": "co_actions_results"
        },
        {
            "Title": "Akzo Nobel India Receives GST Order Worth ₹8.83 Lakh",
            "Summary": "Akzo Nobel India Limited received a GST order from Gujarat authorities on January 9, 2026, with total demand of ₹8.83 lakh including tax, interest and penalty for disallowed input tax credit.",
            "Sentiment": "negative",
            "PublishDate": 1767971149352,
            "Source": "stocks"
        },
        {
            "Title": "Akzo Nobel India Receives GST Order from Bihar Dept",
            "Summary": "Akzo Nobel India receives GST order from Bihar department with demand of ₹8.29 lakh for disallowed input tax credit. Company reviewing order for response within stipulated timeframe.",
            "Sentiment": "negative",
            "PublishDate": 1767971094515,
            "Source": "stocks"
        },
        {
            "Title": "Akzo Nobel Appoints Rajiv Rajgopal as Joint MD & CEO",
            "Summary": "Akzo Nobel announces key leadership change with Rajiv Rajgopal assuming the role of Joint Managing Director and Chief Executive Officer, marking a significant development in the company's executive structure.",
            "Sentiment": "positive",
            "PublishDate": 1767970256422,
            "Source": "stocks"
        },
        {
            "Title": "Akzo Nobel India Faces ₹4.51 Lakh GST Demand Order",
            "Summary": "Akzo Nobel India receives Maharashtra GST Department order demanding ₹4.51 lakh including tax, interest, and penalty for duplicate e-way bill issues during April 2018-March 2019 period.",
            "Sentiment": "negative",
            "PublishDate": 1767852177832,
            "Source": "stocks"
        },
        {
            "Title": "Akzo Nobel GST Demand of ₹3.95 Cr Completely Dropped",
            "Summary": "Maharashtra GST Department has completely dropped the tax demand of ₹3.95 crores against Akzo Nobel India, annulling the original demand order following the company's response with supporting documents.",
            "Sentiment": "positive",
            "PublishDate": 1767852102269,
            "Source": "stocks"
        },
        {
            "Title": "Akzo Nobel Gets Relief in Karnataka GST Dispute",
            "Summary": "Akzo Nobel India receives significantly reduced GST demand of ₹41.57 lakhs from Karnataka authorities, down from initial ₹176.65 crores for FY19 input tax credit disallowance.",
            "Sentiment": "positive",
            "PublishDate": 1767266699991,
            "Source": "stocks"
        },
        {
            "Title": "Akzo Nobel Faces ₹44.98L GST Demand from Telangana",
            "Summary": "Akzo Nobel India receives GST order from Telangana department demanding ₹44.98 lakh including tax, interest and penalty for input tax credit disallowance during April 2021-March 2022 period.",
            "Sentiment": "negative",
            "PublishDate": 1767266668470,
            "Source": "stocks"
        },
        {
            "Title": "Akzo Nobel India Gets GST Order from Karnataka Dept",
            "Summary": "Akzo Nobel India receives GST order from Karnataka department with reduced demand of ₹2.46 crores compared to initial show cause notice of ₹14.96 crores for input tax credit disallowance.",
            "Sentiment": "positive",
            "PublishDate": 1767114023501,
            "Source": "stocks"
        },
        {
            "Title": "Akzo Nobel India GST Demand Reduced to ₹2.30 Lakh",
            "Summary": "Akzo Nobel India receives GST order from Bihar department with significantly reduced demand of ₹2.30 lakh from initial ₹23.04 lakh notice for FY22 input tax credit disallowance.",
            "Sentiment": "positive",
            "PublishDate": 1767007583047,
            "Source": "stocks"
        },
        {
            "Title": "Akzo Nobel Receives GST Order from Haryana Dept",
            "Summary": "Akzo Nobel India receives GST order from Haryana department with demand of ₹39.09 lakh for ITC disallowance during April 2018-March 2021 period. Company reviewing order for further submissions.",
            "Sentiment": "negative",
            "PublishDate": 1767007499616,
            "Source": "stocks"
        },
        {
            "Title": "Akzo Nobel India Gets Relief in Gujarat GST Case",
            "Summary": "Akzo Nobel India Limited receives favorable order from Gujarat GST Department, with tax demand of ₹4.36 lakh including interest and penalty completely dropped in duplicate e-way bill case.",
            "Sentiment": "positive",
            "PublishDate": 1766770160998,
            "Source": "stocks"
        },
        {
            "Title": "AkzoNobel India Faces GST Notice Worth ₹5.20 Lakh",
            "Summary": "AkzoNobel India receives GST notice from Tamil Nadu authorities alleging transport document defects with penalty of ₹5,19,840. Company preparing response within stipulated timeframe.",
            "Sentiment": "negative",
            "PublishDate": 1766464700402,
            "Source": "stocks"
        },
        {
            "Title": "AkzoNobel India Faces ₹67.32 Cr GST Demand Order",
            "Summary": "AkzoNobel India receives GST order demanding ₹67.32 crores from West Bengal GST Department for disallowance of input tax credit covering April 2021-March 2022 period.",
            "Sentiment": "negative",
            "PublishDate": 1766209154079,
            "Source": "stocks"
        },
        {
            "Title": "HDFC Mutual Fund Raises Stake in Akzo Nobel to 5.85%",
            "Summary": "HDFC Mutual Fund has increased its holding in Akzo Nobel India to 5.85% of paid-up equity share capital through open market acquisition on December 17, 2025, as disclosed under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1766140233414,
            "Source": "mutualfunds"
        },
        {
            "Title": "AkzoNobel India Receives GST Order Worth ₹22.26 Lakh",
            "Summary": "AkzoNobel India received a GST order from Kerala authorities demanding ₹22.26 lakh, reduced from initial ₹32.43 lakh show cause notice. Company plans to respond within stipulated timeframe.",
            "Sentiment": "negative",
            "PublishDate": 1765803189370,
            "Source": "stocks"
        },
        {
            "Title": "AkzoNobel India Promoter Sells 9% Stake for ₹305.68 Cr",
            "Summary": "Imperial Chemical Industries Limited sells 40.97 lakh equity shares representing 9% stake through block deal on NSE. Earlier, AkzoNobel Coatings International B.V. exited with 24.30% stake sale.",
            "Sentiment": "neutral",
            "PublishDate": 1765544466836,
            "Source": "co_actions_results"
        },
        {
            "Title": "AkzoNobel India Receives Reduced GST Demand Order from Karnataka Department",
            "Summary": "AkzoNobel India received a GST order from Karnataka GST Department reducing the demand amount from Rs. 99.93 lakh to Rs. 5.05 lakh related to input tax credit disallowance for April 2021-March 2022 period. The company is preparing to respond within the stipulated timeframe as the order remains open for further submissions before relevant authorities.",
            "Sentiment": "negative",
            "PublishDate": 1764749246407,
            "Source": "stock"
        },
        {
            "Title": "Morgan Stanley Publishes Post-Offer Advertisement for Akzo Nobel India Open Offer Completion",
            "Summary": "Morgan Stanley India published a post-offer advertisement on November 14, 2025, marking the completion of an open offer to acquire up to 1,18,40,482 equity shares (26.0% voting share capital) of Akzo Nobel India Limited at INR 3231.77 per share by SWP Paints Limited and associated entities. The advertisement was published in Financial Express and Dainik Statesman newspapers and shared with stock exchanges, completing regulatory requirements under SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763111360256,
            "Source": "corporate_action"
        },
        {
            "Title": "JSW Paints Enters Debenture Trust Deed for AkzoNobel India Acquisition Financing",
            "Summary": "JSW Paints Limited entered into a debenture trust deed with Axis Trustee Services Limited on October 30, 2025, to raise funds for acquiring AkzoNobel India Limited. The arrangement involves issuance of INR-denominated, senior, unsecured, rated, listed and redeemable non-convertible debentures for up to INR 3,300 crores. JSW Paints has a share purchase agreement dated June 27, 2025, with existing promoters Imperial Chemical Industries Limited and AkzoNobel Coatings International B.V. to acquire their entire shareholding in AkzoNobel India. Upon completion, JSW will become the promoter of AkzoNobel India and exercise control over the company. The debenture trust deed imposes certain restrictions on AkzoNobel India's business activities including limitations on amalgamations, asset disposals, creating security over assets, incurring financial indebtedness, and material changes to business nature. These restrictions will be effective from the acquisition closing date and require debenture trustee consent or compliance with specified parameters for certain corporate actions.",
            "Sentiment": "neutral",
            "PublishDate": 1763023518658,
            "Source": "order&deals"
        },
        {
            "Title": "AkzoNobel India Reports 3% Volume Growth Despite 1.5% Revenue Decline in Q2FY26",
            "Summary": "AkzoNobel India Limited reported quarterly results showing 3% volume growth across decorative and industrial coatings segments, though overall revenue declined 1.5% to INR 834.9 crores. The company achieved mid-single digit growth in premium decorative paints and premium automotive specialty coatings. Gross margins stood at 41.3%, impacted by product mix and raw material inflation in coatings business. EBIT margin remained stable at 11.1% due to disciplined cost management. The company implemented price corrections of 1.5-2% in September and October to improve competitiveness. Management cited weather disruptions and competitive intensity as challenges, particularly in mass market segments. Cash generation improved significantly with INR 277 crores generated. The results exclude Powder Coatings and International Research Center businesses which were divested in July 2025. Management expects double-digit volume growth and high single-digit revenue growth in the next quarter, maintaining EBITDA margin guidance of 14-16%. The company is preparing for integration with JSW Group following the acquisition.",
            "Sentiment": "neutral",
            "PublishDate": 1762989650262,
            "Source": "earnings"
        },
        {
            "Title": "AkzoNobel India Signs Intellectual Property and Brand License Agreements with Parent Company",
            "Summary": "AkzoNobel India Limited entered into two agreements with its ultimate parent company AkzoNobel N.V. following a previously disclosed share purchase agreement with JSW Paints Limited. The first agreement is an Intellectual Property License Amendment and Consolidation Agreement (IPLA) that allows AkzoNobel India to use certain intellectual property rights including copyrights, patents, domain names and trademarks on a royalty-bearing basis for performance coatings business. The second is a Corporate Brand License Agreement (CBLA) that permits the company to use the AkzoNobel corporate brand on a royalty-free basis for a transitional period of 15 months. The CBLA requires the company to phase out use of the AkzoNobel brand within 12-18 months, which will incur costs while the value derived from the brand diminishes. Both agreements ensure business continuity during the proposed transaction period and include standard provisions for quality standards, compliance, audits and usage restrictions.",
            "Sentiment": "neutral",
            "PublishDate": 1762916553030,
            "Source": "corporate_action"
        },
        {
            "Title": "Akzo Nobel India Reports Exceptional Item of 16.7B Rupees, Revenue Declines in Q2",
            "Summary": "Akzo Nobel India recorded an exceptional item of 16.7 billion rupees in Q2. The company's net profit surged to 16.8 billion rupees compared to 979 million rupees in the same quarter last year. However, revenue declined to 8.35 billion rupees from 9.8 billion rupees year-over-year. Profit before tax decreased to 977 million rupees from 1.3 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762438410876,
            "Source": "earnings"
        },
        {
            "Title": "JSW Paints Launches Open Offer for Akzo Nobel India at ₹3,231.77 Per Share",
            "Summary": "JSW Paints Limited, along with persons acting in concert JTPM Metal Traders Limited and JSW Eduinfra Private Limited, has launched an open offer to acquire up to 1,18,40,482 equity shares (26% of voting capital) of Akzo Nobel India Limited at ₹3,231.77 per share. The offer received Competition Commission of India approval on September 16, 2025. The committee of independent directors deemed the offer price fair and reasonable. The tendering period runs from October 23, 2025 to November 6, 2025. Morgan Stanley India Company Private Limited serves as the manager to the offer. The offer size may be proportionately reduced to ensure the acquirer's total shareholding doesn't exceed 75% of voting capital.",
            "Sentiment": "neutral",
            "PublishDate": 1760948761632,
            "Source": "order&deals"
        },
        {
            "Title": "JSW Paints Makes Open Offer for 26% Stake in Akzo Nobel India at ₹3,231.77 Per Share",
            "Summary": "JSW Paints Limited, along with persons acting in concert JTPM Metal Traders Limited and JSW EduInfra Private Limited, has made an open offer to acquire up to 1,18,40,482 equity shares representing 26% of Akzo Nobel India Limited's voting share capital. The offer price is set at ₹3,231.77 per equity share, totaling ₹2,997.11 crore in cash consideration. The Independent Directors Committee of Akzo Nobel India submitted its recommendation on the offer, which was published in newspapers including Financial Express, Jansatta, Dainik Statesman, and Navshakti. The recommendation was approved at a meeting held on October 15, 2025, and published on October 17, 2025. The offer is being managed by Morgan Stanley India Company Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1760684160187,
            "Source": "order&deals"
        },
        {
            "Title": "JSW Paints Plans to Acquire Up to 26% Stake in Akzo Nobel India for ₹2,997 Crore",
            "Summary": "JSW Paints has announced plans to purchase up to 26% of Akzo Nobel India shares at ₹3,231.77 per share. The total transaction value could reach ₹2,997.11 crore. This acquisition would give JSW Paints a significant stake in the paint manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1760429318253,
            "Source": "order&deals"
        },
        {
            "Title": "Akzo Nobel India Promoters Sell 5% Stake for ₹765 Crore as JSW Group Prepares Acquisition",
            "Summary": "Imperial Chemical Industries, a key promoter of Akzo Nobel India, sold 22.77 lakh shares at an average price of ₹3,359, totaling ₹765 crore. The stake was purchased by major institutions including Goldman Sachs, Morgan Stanley, Citigroup Global Markets Mauritius, Nippon India MF, and others. Following the sale, Imperial Chemical Industries' holding decreased from 50.46% to 45.46%, reducing overall promoter shareholding from 74.76% to 69.76%. Meanwhile, JSW Group plans to raise ₹7,000 crore through non-convertible debentures to fund JSW Paints' acquisition of Akzo Nobel India. The bonds will have a four-year, seven-month tenor with zero-coupon structure offering 8.5% IRR. JSW Paints has agreed to acquire up to 75% stake for ₹8,986 crore and will make a mandatory open offer for 25% worth ₹3,929 crore. The acquisition will position JSW Paints as the third-largest decorative paint company in the ₹70,000 crore paint industry.",
            "Sentiment": "neutral",
            "PublishDate": 1758812031984,
            "Source": "order&deals"
        },
        {
            "Title": "Imperial Chemical Industries Sells 5% Stake in Akzo Nobel India for ₹765 Crore",
            "Summary": "Imperial Chemical Industries sold a 5% stake in Akzo Nobel India through a block deal worth ₹765 crore at ₹3,358.8 per share. Nippon India acquired 1.8% equity for ₹274 crore, while WF Asian Smaller Companies Fund bought 1.2% for ₹174 crore. Other buyers included Goldman Sachs Funds, Baroda BNP Paribas Mutual Fund, and Aditya Birla Sun Life Mutual Fund. Akzo Nobel India plans to expand its market share from 4-5% to 7-7.5% in the near-term, targeting the mass economy paint segment with a medium-term revenue goal of ₹10,000 crore. The company operates across decorative paints, automotive coatings, industrial coatings, and other specialty segments, with revenue of ₹4,091.21 crore in FY25. Shares closed at ₹3,386.60, down 0.24%.",
            "Sentiment": "neutral",
            "PublishDate": 1758722720075,
            "Source": "order&deals"
        },
        {
            "Title": "Imperial Chemical to Sell 5% Stake in Akzo Nobel India for ₹742.7 Crore",
            "Summary": "Imperial Chemical Industries plans to divest up to 5% stake in Akzo Nobel India Ltd through a block deal worth ₹742.7 crore. The floor price is set at ₹3,261.80 per share, representing a 4% discount to Akzo Nobel's last closing price. The seller will face a 30-day lock-up period on remaining shares after transaction completion. Akzo Nobel India operates across decorative paints, automotive coatings, industrial coatings, marine and yacht coatings, and powder coatings segments. The company reported revenue from operations of ₹4,091.21 crore in FY25. Akzo Nobel India shares closed at ₹3,399, up 0.66% on September 23.",
            "Sentiment": "neutral",
            "PublishDate": 1758635774748,
            "Source": "order&deals"
        },
        {
            "Title": "SEBI Approves JSW Paints Acquisition of Up to 75% Stake in Akzo Nobel India",
            "Summary": "SEBI has granted approval for JSW Paints to acquire up to 75% stake in Akzo Nobel India. This regulatory clearance enables JSW Paints to proceed with the significant acquisition in the paints and coatings sector.",
            "Sentiment": "positive",
            "PublishDate": 1758028041612,
            "Source": "order&deals"
        },
        {
            "Title": "Akzo Nobel India Expects Strong Q3, Q4 Performance Driven by Festive Season Demand",
            "Summary": "Akzo Nobel India anticipates strong performance in the third and fourth quarters driven by post-monsoon recovery and festive season demand. Chairman and Managing Director Rajiv Rajgopal expects October, November, and December to perform well, with strength continuing beyond Diwali. The company has outlined a two-step growth strategy: first achieving mid-single digit growth equal to GDP growth, then pursuing double-digit growth with aggressive top-line focus as directed by incoming owners. JSW Paints is acquiring a 74.76% stake in Akzo Nobel India for Rs 8,986 crore, including the Dulux brand, liquid coatings, marine and protective coatings, and vehicle refinished business. The deal excludes the powder coating business and Bengaluru research centre. The acquisition awaits Competition Commission of India approval, expected by mid-to-late October, with the entire deal anticipated to complete by year-end or early January 2026. Akzo Nobel India shares closed 0.48% lower at Rs 3,374.8.",
            "Sentiment": "positive",
            "PublishDate": 1757746193152,
            "Source": "stock"
        },
        {
            "Title": "Akzo Nobel India Receives Amnesty Order from Karnataka GST Department, Waiving Interest and Penalty",
            "Summary": "Akzo Nobel India Limited received an Amnesty Order on August 26, 2025, from the Karnataka GST Department regarding a previously disclosed litigation. The company had received a Demand Order on January 16, 2024, concerning financial year 2017-2018, disallowing Input Tax Credit under the CGST/SGST Act of 2017 with a total demand of Rs. 13,49,442. This amount comprised tax of Rs. 5,58,486, interest of Rs. 7,08,783, and penalty of Rs. 82,173. The company submitted an amnesty application by paying the tax amount of Rs. 5,58,486 along with supporting documents. The Additional Commissioner of Commercial Taxes granted the amnesty order dated July 7, 2025, waiving both interest and penalty amounts. The original Demand Order now stands annulled.",
            "Sentiment": "positive",
            "PublishDate": 1756204563667,
            "Source": "stock"
        },
        {
            "Title": "Akzo Nobel India Wins Appeal Against Central Excise Department, INR 11.19 Lakh Tax Demand Set Aside",
            "Summary": "Akzo Nobel India Limited received a favorable appeal order from CESTAT, Chandigarh regarding a tax dispute with the Central Excise and Service Tax Department, Mohali. The original demand from March 2021 involved INR 5,58,325 in tax payment plus interest and penalty for alleged wrong utilization of Education Cess and Secondary Higher Education Cess during 2015-2017 under Cenvat Credit Rules. The tribunal completely set aside the tax demand including interest and penalty, granting total relief of INR 11.19 lakhs plus additional interest. The original demand order has been annulled, resolving the litigation in favor of the company.",
            "Sentiment": "positive",
            "PublishDate": 1755063125814,
            "Source": "stock"
        },
        {
            "Title": "Akzo Nobel India Reports 4% Revenue Decline in Q1 FY26, Cites Strategic Review Impact",
            "Summary": "Akzo Nobel India Limited reported a 4% revenue decline with flat volumes in Q1 FY26. The decorative paints business saw a decline marginally higher than the company average, while the coatings business experienced low single-digit growth compared to previous high single-digit growth. Gross margins faced dilution due to business mix skewing toward lower-margin segments like coil coatings. The company made investments in digital projects for lead management, impacting EBIT and EBITDA. June saw significant decline attributed to the strategic review process, with dealer apprehension regarding warranties and service continuity. Management reported recovery in July following reassurance measures. The company operates with an 80-20 retail-to-projects split in decoratives and overall 57-43 paints-to-coatings ratio. Employee salary increments averaged 6.5%. The powder coatings business has been sold to AkzoNobel Global, with proceeds distributed as dividends. JSW Group's acquisition is expected to complete by December 2025, with both companies running separately initially. Management targets high single-digit growth for FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1754648518066,
            "Source": "earnings"
        },
        {
            "Title": "Akzo Nobel India Receives Revised GST Demand of ₹2.6 Crore in Appeal Order",
            "Summary": "Akzo Nobel India received an appeal order on August 6, 2025, from the Commissioner (Appeals-1) of Chennai, Tamil Nadu GST Department regarding input tax credit disallowance for the period 2017-2020. The revised demand amount is ₹2,59,58,119, comprising tax of ₹2,37,07,258, applicable interest, and penalty of ₹22,50,861. This represents a reduction from the original demand of ₹6,17,39,762 issued on December 31, 2023. The company had submitted its reply with supporting documents within the specified timeframe. The appeal order is open for further submissions to relevant authorities, and the company is currently preparing its response within the given timelines.",
            "Sentiment": "neutral",
            "PublishDate": 1754554685997,
            "Source": "stock"
        },
        {
            "Title": "Akzo Nobel India Reports 20% Profit Decline, Announces Rs 156 Special Dividend",
            "Summary": "Akzo Nobel India reported a 20.6% decline in consolidated net profit to Rs 91 crore in the June quarter, down from Rs 114.6 crore in the same period last year. Revenue from operations fell to Rs 995.1 crore from Rs 1,036.3 crore year-on-year, impacted by lower sales amid tepid consumer demand. Total expenses decreased marginally to Rs 881.6 crore from Rs 891.7 crore. The company's B2B segment continued its growth trajectory while retail remained subdued due to weak consumer demand and increased competition. Despite margin pressure, the company maintained double-digit profitability and continued investments in growth initiatives. The board approved a one-time special interim dividend of Rs 156 per share. JSW Paints had agreed to acquire a 74.76% stake in the company for Rs 8,986 crore, followed by an open offer for an additional 25% stake worth up to Rs 3,929.06 crore.",
            "Sentiment": "negative",
            "PublishDate": 1754303199233,
            "Source": "earnings"
        },
        {
            "Title": "Akzo Nobel India Declares Special Dividend of Rs 156 Per Share Despite Q1 Profit Decline",
            "Summary": "Akzo Nobel India announced a special interim dividend of Rs 156 per share. The company reported Q1 net profit of Rs 910 million, down from Rs 1.15 billion in the previous year. Revenue decreased to Rs 9.95 billion from Rs 10.36 billion year-over-year. EBITDA fell to Rs 1.34 billion from Rs 1.69 billion, with EBITDA margin declining to 13.52% from 16.3% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1754294829675,
            "Source": "corporate_action"
        },
        {
            "Title": "Akzo Nobel India Faces Increased GST Demand of ₹2.9 Crores After Appeal Order",
            "Summary": "Akzo Nobel India Limited received an Order-in-Appeal on July 31, 2025, regarding a GST dispute with the Telangana GST Department. The company initially faced a tax demand of ₹21.85 lakhs from an order dated December 30, 2023, which was significantly lower than the original show cause notice demand of ₹35.61 crores. The GST Assessing Officer appealed this decision, contesting a litigation amount of ₹2.9 crores along with interest and penalty. The Commissioner of Appeals upheld the Department's appeal, meaning Akzo Nobel now faces the higher demand amount. The company is preparing to respond to the Appeal Order within the stipulated timeframe and can make further submissions to relevant authorities.",
            "Sentiment": "negative",
            "PublishDate": 1754026281816,
            "Source": "stock"
        },
        {
            "Title": "Akzo Nobel India: JSW Paints Launches Open Offer for 25.24% Stake",
            "Summary": "JSW Paints has issued a draft letter of offer to acquire up to 25.24% of Akzo Nobel India's voting share capital at Rs 3,417.77 per share. This follows JSW Paints' earlier announcement to acquire a 74.76% controlling stake from Dutch promoters for Rs 8,986 crore. The open offer, if fully subscribed, could be worth Rs 3,929.06 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1752461706000,
            "Source": "corporate_action"
        },
        {
            "Title": "JSW Paints Launches Open Offer for Akzo Nobel India Stake",
            "Summary": "JSW Paints has initiated an open offer to acquire up to 25.24% stake in Akzo Nobel India for ₹3,929 crore. The offer price is set at ₹3,417.77 per share. A draft offer document has been submitted to the Securities and Exchange Board of India (SEBI) for review.",
            "Sentiment": "neutral",
            "PublishDate": 1752241645000,
            "Source": "default"
        },
        {
            "Title": "Akzo Nobel India: Asian Paints Sells Entire Stake for Rs 734 Crore",
            "Summary": "Asian Paints has sold its entire 4.42% stake (20,10,626 shares) in Akzo Nobel India for Rs 734 crore at Rs 3,651 per share. This follows JSW Paints' recent agreement to acquire a 74.76% controlling stake in Akzo Nobel India from its Dutch promoters for Rs 8,986 crore, subject to regulatory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1752115550000,
            "Source": "block_deals"
        },
        {
            "Title": "Akzo Nobel India: Large Block Deal Worth ₹754 Crore Executed",
            "Summary": "A 4.4% equity stake in Akzo Nobel India, worth ₹754 crore, changed hands in a large trade. The transaction involved 17.9 lakh shares at an average price of ₹3,662 per share. Asian Paints previously held a similar 4.42% stake in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1752055350000,
            "Source": "block_deals"
        },
        {
            "Title": "Akzo Nobel: Block Trade of 1.93 Million Shares Worth Rs 705.74 Crore on NSE",
            "Summary": "A significant block trade of Akzo Nobel shares occurred on the National Stock Exchange (NSE). The trade involved approximately 1,934,586 shares at a price of Rs 3,648 per share, totaling Rs 705.74 crore in value.",
            "Sentiment": "neutral",
            "PublishDate": 1752055167000,
            "Source": "block_details"
        },
        {
            "Title": "Bel Secures 5.28 Billion Rupee Order",
            "Summary": "Bel (Bharat Electronics Limited) has won an order worth 5.28 billion rupees (approximately $63.5 million). No further details about the order or its nature were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1751328388000,
            "Source": "default"
        },
        {
            "Title": "Bel Receives 5.85 Billion Rupees in Defence Equipment Orders",
            "Summary": "Bel, a Navratna Defence PSU under the Ministry of Defence, has secured new orders valued at 5.85 billion rupees. These orders are for critical defence equipment including fire control and sighting systems for missiles, communication systems, jammers, spares, and related services.",
            "Sentiment": "positive",
            "PublishDate": 1750636726000,
            "Source": "default"
        },
        {
            "Title": "Akzo Nobel India Board Approves Intragroup Business Transfer",
            "Summary": "The Board of Directors of Akzo Nobel India has approved a major intragroup business transfer. This decision follows clearance from the company's Supervisory Board. The specific details of the business transfer or its implications are not provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1749774472000,
            "Source": "default"
        },
        {
            "Title": "Akzo Nobel India Board Approves Intragroup Business Transfer",
            "Summary": "The Board of Directors of Akzo Nobel India has approved a significant intragroup business transfer. This decision comes after receiving approval from the company's Supervisory Board. The nature and details of the business transfer are not specified in the given information.",
            "Sentiment": "positive",
            "PublishDate": 1749736003000,
            "Source": "default"
        },
        {
            "Title": "Akzo Nobel: Market Share Gains Amidst Competitive Landscape",
            "Summary": "Akzo Nobel gained market share in Q4 FY25 despite competition from Birla Opus. ICICI Securities suggests the competitive equilibrium in paints is disrupted. They maintain an underweight rating on large cap paints but suggest contrarian investors consider Akzo Nobel, Indigo Paints, or Kansai Nerolac.",
            "Sentiment": "neutral",
            "PublishDate": 1747312274000,
            "Source": "normal_news"
        }
    ]
}