{
    "Symbol": "ALANKIT",
    "ISIN": "INE914E01040",
    "News": [
        {
            "Title": "Alankit Limited Q3 FY26 Financial Results Published",
            "Summary": "Alankit Limited submits newspaper publication of unaudited standalone and consolidated financial results for Q3 FY26 ended December 31, 2025, as per SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770898033235,
            "Source": "co_actions_results"
        },
        {
            "Title": "Alankit Limited Reports Quarterly Results, Board Postpones Director Appointments",
            "Summary": "Alankit Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company reported consolidated revenue from operations of ₹5,617.64 lakhs for the quarter, compared to ₹6,020.52 lakhs in the previous quarter. Net profit for the quarter stood at ₹449.34 lakhs versus ₹439.65 lakhs in the prior quarter. The Board decided not to proceed with the proposed appointment of two additional Independent Directors - Rakesh Sareen and Raj Kumar Gupta - due to non-availability of the candidates. The company faces income tax demand notices amounting to ₹18,498.53 lakhs for assessment years 2011-12 to 2020-21, which management considers not tenable based on legal opinion. During the quarter ended June 30, 2025, the company had written back trade payables of ₹1,080.20 lakhs and written off trade receivables of ₹464.64 lakhs. The company has made payments of ₹5,393.00 lakhs for purchase of immovable property from a related party, with legal title transfer still pending.",
            "Sentiment": "neutral",
            "PublishDate": 1762947024695,
            "Source": "earnings"
        },
        {
            "Title": "Alankit Limited Begins Onboarding Services for 'Sarpanch Samvaad' Mobile Application",
            "Summary": "Alankit Limited has commenced services for onboarding Sarpanches onto the 'Sarpanch Samvaad' mobile application, which is designed for social engagement of village leaders. The company stated this initiative demonstrates its commitment to supporting government projects.",
            "Sentiment": "positive",
            "PublishDate": 1755177654630,
            "Source": "stock"
        },
        {
            "Title": "Alankit Ltd Reports Q1 FY2026 Results, Schedules 36th AGM for September 23",
            "Summary": "Alankit Ltd's board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported consolidated revenue of Rs 10,770.55 lakhs and net profit of Rs 596.15 lakhs for the quarter. Standalone revenue stood at Rs 2,722.57 lakhs with net profit of Rs 234.75 lakhs. The board scheduled the 36th Annual General Meeting for September 23, 2025, via video conferencing and approved re-appointment of N.C. Khanna as Secretarial Auditor for five years from FY 2025-26 to FY 2029-30. The company wrote back trade payables of Rs 1,080.20 lakhs and wrote off trade receivables of Rs 464.64 lakhs during the quarter. Alankit faces income tax demands of Rs 18,498.53 lakhs for assessment years 2011-12 to 2020-21, against which appeals have been filed.",
            "Sentiment": "neutral",
            "PublishDate": 1755161870121,
            "Source": "earnings"
        },
        {
            "Title": "Alankit Limited Empanelled by Quality Council of India for Sarpanch Mobile App Services",
            "Summary": "Alankit Limited has been empanelled by the Quality Council of India (QCI) to provide services for onboarding Sarpanches on the 'Sarpanch Samvaad' mobile application. The company will undertake onboarding, provide handholding support, and deliver adequate knowledge to Sarpanches about the mobile application developed by QCI. The initiative is designed to support government projects focused on social engagement of Sarpanches.",
            "Sentiment": "positive",
            "PublishDate": 1754660369225,
            "Source": "stock"
        },
        {
            "Title": "Alankit Reports Significant Growth in Q3 EBITDA and Margin",
            "Summary": "Alankit Limited has reported a substantial increase in its Q3 EBITDA, which rose to 66 million rupees from 36 million rupees in the same quarter last year. The company's EBITDA margin also improved, reaching 9.11% compared to 6.77% in the previous year's corresponding quarter. This performance indicates a notable improvement in the company's operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1738226542000,
            "Source": "earnings"
        },
        {
            "Title": "Alankit Reports Mixed Q3 Financial Results",
            "Summary": "Alankit Limited has reported its Q3 financial results. The company's consolidated net profit decreased to 51 million rupees from 81 million rupees in the same quarter last year. However, revenue increased to 726 million rupees from 526 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738226457000,
            "Source": "earnings"
        },
        {
            "Title": "Alankit Limited Renews Business Correspondent Agreement with Central Bank of India",
            "Summary": "Alankit Limited has successfully renewed its empanelled service agreement with the Central Bank of India. Under this agreement, Alankit will continue to provide services as a Business Correspondent for the bank.",
            "Sentiment": "positive",
            "PublishDate": 1735273817000,
            "Source": "corporate_action"
        },
        {
            "Title": "Alankit Settles Case with Protean eGov Technologies",
            "Summary": "Alankit Limited has reached a settlement in a case with Protean eGov Technologies. The details of the case and the terms of the settlement are not provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1734958470000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Alankit Settles Claim for Rs 38.06 Crore",
            "Summary": "Alankit has announced the settlement of a claim. The original claim was for Rs 68.5 crore, but it has been settled for a reduced amount of Rs 38.06 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1734958417000,
            "Source": "corporate_action"
        },
        {
            "Title": "Alankit Reports Q2 EBITDA Growth",
            "Summary": "Alankit Limited has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 increased to 54.1 million rupees, up from 46.2 million rupees in the same quarter last year. The EBITDA margin for Q2 stands at 8.41%.",
            "Sentiment": "positive",
            "PublishDate": 1729847358000,
            "Source": "result"
        },
        {
            "Title": "Alankit Reports Significant Revenue Growth in Q2",
            "Summary": "Alankit, an Indian company, has reported a substantial increase in its second-quarter revenue. The company's revenue rose to 640 million rupees, up from 430 million rupees in the same quarter of the previous year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1729847246000,
            "Source": "result"
        },
        {
            "Title": "Alankit Reports Increased Q2 Profit",
            "Summary": "Alankit Limited has reported a consolidated net profit of 31 million rupees for the second quarter, compared to 20.7 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729847201000,
            "Source": "result"
        }
    ]
}