{
    "Symbol": "ALBERTDAVD",
    "ISIN": "INE155C01010",
    "News": [
        {
            "Title": "Albert David MD & CEO Umesh Kunte Resigns",
            "Summary": "Albert David Limited announces resignation of Managing Director and CEO Umesh Manohar Kunte effective December 18, 2025, citing personal reasons and priorities.",
            "Sentiment": "neutral",
            "PublishDate": 1766067594154,
            "Source": "stocks"
        },
        {
            "Title": "Albert David Limited Reports Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "Albert David Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The pharmaceutical manufacturing company reported revenue from operations of Rs. 5,857 lakhs for the quarter, compared to Rs. 7,056.64 lakhs in the previous quarter. The company posted a net loss of Rs. 540.04 lakhs for the quarter versus a loss of Rs. 779.76 lakhs in the prior quarter. For the half year period, revenue from operations stood at Rs. 13,779.18 lakhs with a net loss of Rs. 526.71 lakhs. The company paid a dividend of Rs. 5.00 per equity share during the quarter, resulting in a total outflow of Rs. 285.36 lakhs. The results were reviewed by the Audit Committee and approved by the Board of Directors. The company operates in pharmaceutical manufacturing with one reportable segment.",
            "Sentiment": "neutral",
            "PublishDate": 1762950716941,
            "Source": "earnings"
        },
        {
            "Title": "Albert David Appoints Dr. Rajiv Anant Desai as Independent Director Through Postal Ballot",
            "Summary": "Albert David Ltd shareholders approved the appointment of Dr. Rajiv Anant Desai as Independent Director for a five-year term from August 2, 2025 to August 1, 2030 through postal ballot. The special resolution received overwhelming support with 99.99% of votes cast in favor. Dr. Desai holds M.Sc in Chemistry, Ph.D in Pharmaceutical Chemistry, and MBA from NMIMS Mumbai, bringing over 38 years of experience in India and Switzerland. He previously served as Executive Vice President, Global Corporate Quality at Lupin Limited until June 2022 and currently works as Senior Technical Advisor with Indian Pharmaceutical Alliance. The e-voting process ran from August 18 to September 16, 2025, with 135 shareholders participating out of 15,227 total shareholders on record.",
            "Sentiment": "positive",
            "PublishDate": 1758110683932,
            "Source": "corporate_governance"
        },
        {
            "Title": "Albert David Ltd Seeks Shareholder Approval for Independent Director Appointment via Postal Ballot",
            "Summary": "Albert David Ltd has issued a postal ballot notice seeking shareholder approval for the appointment of Dr. Rajiv Anant Desai as an Independent Director for a five-year term from August 2, 2025 to August 1, 2030. The e-voting period runs from August 18 to September 16, 2025. Dr. Desai, aged 63, holds M.Sc in Chemistry, Ph.D in Pharmaceutical Chemistry, and MBA qualifications with over 38 years of experience in the pharmaceutical industry. He previously served as Executive Vice President at Lupin Limited and currently works as Senior Technical Advisor with Indian Pharmaceutical Alliance. The company has appointed Mrs. Shikha Gupta as scrutinizer for the postal ballot process. The notice was sent electronically to 13,995 shareholders whose email addresses are registered with the company. Results will be declared within 48 hours of voting conclusion.",
            "Sentiment": "neutral",
            "PublishDate": 1755092681956,
            "Source": "corporate_action"
        },
        {
            "Title": "Albert David Limited Reports Q1 FY2026 Financial Results with Mixed Performance",
            "Summary": "Albert David Limited published its unaudited financial results for the quarter ended June 30, 2025. The company reported total income from operations of Rs. 7,056.64 lakhs compared to Rs. 8,935.64 lakhs in the corresponding quarter of the previous year. Net profit for the period after tax stood at Rs. 793.76 lakhs versus Rs. 1,884.44 lakhs in Q1 FY2025. The company's equity share capital remained stable at Rs. 570.72 lakhs. Basic and diluted earnings per share were Rs. 13.91 compared to Rs. 33.02 in the same quarter last year. The results were reviewed by the audit committee and approved by the board of directors on August 2, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1754299495042,
            "Source": "earnings"
        },
        {
            "Title": "Albert David Limited Approves Q1 Financial Results and Appoints New Independent Director",
            "Summary": "Albert David Limited's Board of Directors approved unaudited financial results for the first quarter ended June 30, 2025. The company appointed Dr. Rajiv Anant Desai as Additional Non-Executive Independent Director for a 5-year term starting August 2, 2025, subject to shareholder approval through postal ballot. Dr. Desai, aged 63, holds M.Sc in Chemistry, Ph.D in Pharmaceutical Chemistry, and MBA qualifications with over 38 years of experience across global pharmaceutical operations. He previously served as Executive Vice President at Lupin Limited and currently works as Senior Technical Advisor with Indian Pharmaceutical Alliance. The Board approved a postal ballot notice to obtain shareholder approval for the director appointment.",
            "Sentiment": "positive",
            "PublishDate": 1754136121488,
            "Source": "corporate_action"
        },
        {
            "Title": "Albert David Reports 59% Decline in Q1 Net Profit to ₹77.5 Million",
            "Summary": "Albert David's net profit dropped significantly to ₹77.5 million in Q1 compared to ₹190.4 million in the same quarter of the previous year, representing a year-over-year decline of 59%.",
            "Sentiment": "negative",
            "PublishDate": 1754135476536,
            "Source": "earnings"
        },
        {
            "Title": "Albert David Ltd Recommends Dividend of 5 Rupees per Share",
            "Summary": "Albert David Ltd has announced a recommendation for a dividend of 5 rupees per equity share. This decision indicates a distribution of profits to the company's shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1747140992000,
            "Source": "result"
        },
        {
            "Title": "Albert David Ltd Reports Q4 Financial Results",
            "Summary": "Albert David Ltd has reported its Q4 financial results. The company experienced an EBITDA loss of 48 million rupees, compared to a gain of 96 million rupees in the same quarter last year. The net loss for Q4 was 103 million rupees, an improvement from the 129 million rupees loss in the previous year, but a decline from the 94 million rupees loss in the previous quarter. Revenue for Q4 stood at 749 million rupees, down from 891 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1747140895000,
            "Source": "result"
        },
        {
            "Title": "Albert David Reports Q3 Financial Results",
            "Summary": "Albert David Limited has reported its financial results for the third quarter. The company experienced a net loss of 94 million rupees, which is an improvement compared to the 187 million rupees loss in the same quarter last year. However, it represents a decline from the previous quarter's loss of 181 million rupees. The company's revenue for Q3 stood at 831 million rupees, down from 880 million rupees in the corresponding quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1739360356000,
            "Source": "earnings"
        },
        {
            "Title": "Albert David Invests in Sunsure Solarpark Five",
            "Summary": "Albert David has announced an investment of 7.9 million rupees in equity shares of Sunsure Solarpark Five.",
            "Sentiment": "positive",
            "PublishDate": 1731597529000,
            "Source": "corporate_action"
        },
        {
            "Title": "Albert David Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Albert David, a pharmaceutical company, has reported a decrease in its Q2 EBITDA to 62 million rupees from 84 million rupees in the same quarter last year. The company's EBITDA margin also declined to 6.32% from 9.47% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731596448000,
            "Source": "result"
        },
        {
            "Title": "Albert David Reports Q2 Financial Results",
            "Summary": "Albert David Limited has announced its Q2 financial results. The company reported a net profit of 181 million rupees, down from 203 million rupees year-over-year and 188 million rupees quarter-over-quarter. However, revenue increased to 984 million rupees from 932 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731596398000,
            "Source": "result"
        }
    ]
}