{
    "Symbol": "ALEMBICLTD",
    "ISIN": "INE426A01027",
    "News": [
        {
            "Title": "Alembic Gets USFDA Approval for Parkinson's Drug",
            "Summary": "Alembic Pharmaceuticals receives USFDA final approval for Carbidopa, Levodopa and Entacapone tablets, therapeutically equivalent to Stalevo, bringing total ANDA approvals to 234.",
            "Sentiment": "positive",
            "PublishDate": 1770357909056,
            "Source": "stocks"
        },
        {
            "Title": "Alembic Pharma Q3 Net Profit Drops to ₹1.33B",
            "Summary": "Alembic Pharmaceuticals reports consolidated net profit of ₹1.33 billion in Q3, down from ₹1.40 billion in the same quarter previous year, marking a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1770280433516,
            "Source": "co_actions_results"
        },
        {
            "Title": "Alembic Gets USFDA Approval for Eye Drug Generic",
            "Summary": "Alembic Pharmaceuticals receives USFDA final approval for Difluprednate Ophthalmic Emulsion, 0.05%, generic equivalent to Durezol. Company now has 233 total ANDA approvals from USFDA.",
            "Sentiment": "positive",
            "PublishDate": 1769498340485,
            "Source": "stocks"
        },
        {
            "Title": "Alembic Pharma gets USFDA tentative approval for cancer drug",
            "Summary": "Alembic Pharmaceuticals receives tentative USFDA approval for Bosutinib Tablets 400mg, used in treating chronic myelogenous leukemia. The drug has an estimated US market size of $251 million.",
            "Sentiment": "positive",
            "PublishDate": 1768202492881,
            "Source": "stocks"
        },
        {
            "Title": "Alembic Gets USFDA Approval for Bosutinib Tablets",
            "Summary": "Alembic Pharmaceuticals receives USFDA tentative approval for 400 mg Bosutinib tablets, generic version of Bosulif, targeting US$ 251 million market by September 2025.",
            "Sentiment": "positive",
            "PublishDate": 1768200247266,
            "Source": "stocks"
        },
        {
            "Title": "Alembic Gets USFDA Nod for Eye Drop Solution",
            "Summary": "Alembic Pharmaceuticals receives final USFDA approval for Travoprost Ophthalmic Solution USP 0.004% to treat high intraocular pressure in $61 million market opportunity.",
            "Sentiment": "positive",
            "PublishDate": 1766036107470,
            "Source": "stocks"
        },
        {
            "Title": "Alembic Gets USFDA Nod for Eye Drop Formulation",
            "Summary": "Alembic Pharmaceuticals receives final USFDA approval for Loteprednol Etabonate and Tobramycin Ophthalmic Suspension with 180-day exclusivity benefits.",
            "Sentiment": "positive",
            "PublishDate": 1765434725065,
            "Source": "stocks"
        },
        {
            "Title": "Alembic Pharmaceuticals Receives USFDA Approval for Hypertension Drug Diltiazem",
            "Summary": "Alembic Pharmaceuticals secured USFDA final approval for Diltiazem Hydrochloride Tablets in four strengths, a cardiovascular therapy for high blood pressure and angina treatment. The approval brings the company's total ANDA approvals to 230, while shares closed 1.28% lower at Rs 904.20 and have declined 14% in 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763349959238,
            "Source": "stock"
        },
        {
            "Title": "Alembic Limited Reports Mixed Q2 FY26 Results with Consolidated Revenue at Rs 5,586 Lakhs",
            "Summary": "Alembic Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company reported consolidated revenue from operations of Rs 5,586 lakhs for the quarter, compared to Rs 5,291 lakhs in the same period last year. Net profit after tax stood at Rs 4,780 lakhs for the quarter versus Rs 6,077 lakhs in the previous year. For the half year, consolidated revenue reached Rs 10,561 lakhs against Rs 10,370 lakhs last year, while net profit was Rs 9,269 lakhs compared to Rs 12,386 lakhs in the corresponding period. The company operates two main business segments: Active Pharmaceutical Ingredients Business and Real Estate Business. Earnings per share for the quarter was Rs 5.00 compared to Rs 4.71 in the same quarter last year. The Board meeting was held on November 10, 2025, commencing at 4:00 p.m. and concluding at 4:45 p.m.",
            "Sentiment": "neutral",
            "PublishDate": 1762775010710,
            "Source": "earnings"
        },
        {
            "Title": "Alembic Pharma Targets 18-20% EBITDA Margins Through Production Ramp-Up and New Launches",
            "Summary": "Alembic Pharmaceuticals aims to increase its EBITDA margins to 18-20% over the next couple of years from the current 17%, according to Managing Director Pranav Amin. The company expects margin improvement through enhanced capacity and production ramp-up in the second half of the financial year. Alembic has allocated Rs 400 crore for capex, primarily for maintenance and de-bottlenecking. Despite ongoing pricing pressure in the US market, the company is countering this through higher volumes and new product additions. The generics segment outside the US has shown consistent growth over 15-20 quarters and represents a high-margin opportunity. Alembic plans high-value launches in the US market over the next 12-18 months, including complex injectables, peptides, and ophthalmic products. The company's shares closed 2.79% higher at Rs 950 on the NSE.",
            "Sentiment": "positive",
            "PublishDate": 1762320804034,
            "Source": "stock"
        },
        {
            "Title": "Alembic Pharma Reports 21% Profit Growth; Shares Rise 7% on Strong US and API Performance",
            "Summary": "Alembic Pharmaceuticals reported consolidated net profit of ₹185 crore for Q2 FY26, up 21% from ₹153 crore in the same period last year. Revenue increased 16% to ₹1,910 crore from ₹1,648 crore, while EBITDA grew 32% to ₹315.3 crore with operating margins expanding to 16.5% from 14.5%. The US generics business drove growth with 21% increase to ₹566 crore and three new product launches. Ex-US international generics revenue jumped 31% to ₹392 crore. The API segment grew 15% to ₹261 crore. The company received six ANDA approvals, bringing total approvals to 226. Alembic completed acquisition of Utility Therapeutics to enter US branded drugs market. Managing Director Shaunak Amin highlighted continued momentum across core businesses and R&D investment at around 10% of revenue. Shares traded 7.3% higher at ₹991.70 following the results.",
            "Sentiment": "positive",
            "PublishDate": 1762248997984,
            "Source": "earnings"
        },
        {
            "Title": "Alembic Pharma Gets USFDA Approval for Ticagrelor Tablets for Heart Patients",
            "Summary": "Alembic Pharmaceuticals received USFDA final approval for its Ticagrelor tablets (60mg) used to reduce cardiovascular death, heart attack, and stroke risks in patients with acute coronary syndrome or heart attack history. The tablets are therapeutically equivalent to AstraZeneca's Brilinta Tablets and have an estimated market size of $236 million for 12 months ending June 2025. The company previously received approval for the 90mg strength and now holds 227 total ANDA approvals from USFDA. Alembic Pharma shares traded flat at ₹905.15, down 13.7% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1761729283222,
            "Source": "stock"
        },
        {
            "Title": "Alembic Pharmaceuticals Receives USFDA Approval for Generic Triamcinolone Injectable",
            "Summary": "Alembic Pharmaceuticals received final USFDA approval for its generic version of Triamcinolone Acetonide Injectable Suspension USP 40 mg/mL. The approved product is a corticosteroid formulation used for joint-injection and intralesional administration. This approval brings Alembic's total ANDA approvals to 227, comprising 206 final approvals and 21 tentative approvals. The company expects this approval to contribute to its U.S. generics business growth and support its goal of capturing greater market share in North American regulated markets.",
            "Sentiment": "positive",
            "PublishDate": 1760793311768,
            "Source": "stock"
        },
        {
            "Title": "Alembic Pharma Receives USFDA Approval for Generic Depression and Anxiety Drug",
            "Summary": "Alembic Pharmaceuticals received final approval from the US Food & Drug Administration for its generic version of Paroxetine extended-release tablets in 25 mg and 37.5 mg strengths. The approved drug is therapeutically equivalent to Apotex Inc's reference product Paxil CR extended-release tablets. The medication is indicated for treating major depressive disorder, panic disorder, social anxiety disorder, and premenstrual dysphoric disorder.",
            "Sentiment": "positive",
            "PublishDate": 1758796368299,
            "Source": "stock"
        },
        {
            "Title": "Alembic Limited Appoints Udit Amin as Managing Director Through Postal Ballot",
            "Summary": "Alembic Limited shareholders approved the appointment of Mr. Udit Amin (DIN: 00244235) as Managing Director through a postal ballot conducted via remote e-voting. The special resolution was passed with 98.90% votes in favor and 1.10% against, with 690 members participating and casting 19,19,80,794 total votes. The voting process remained open for 30 days from August 21, 2025, to September 19, 2025. Promoter and Promoter Group held 18,20,11,077 shares and voted 100% in favor, while public institutions and non-institutions also showed strong support for the appointment.",
            "Sentiment": "positive",
            "PublishDate": 1758294118645,
            "Source": "corporate_governance"
        },
        {
            "Title": "Alembic Pharma Receives FDA Inspection Report for Two API Facilities at Panelav",
            "Summary": "Alembic Pharma received an Establishment Inspection Report (EIR) from the USFDA for its API-I and API-II facilities located at Panelav. The inspection was conducted from May 26th to 31st, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757895075733,
            "Source": "stock"
        },
        {
            "Title": "Alembic Pharma Receives USFDA Clearance for Panelav Manufacturing Facilities",
            "Summary": "Alembic Pharmaceuticals received an Establishment Inspection Report (EIR) from the USFDA for its API-I and API-II facilities at Panelav, Gujarat, following an inspection conducted between May 26-31, 2025. The EIR signifies regulatory compliance at these manufacturing sites. The company previously received an EIR for its API-III facility at Karakhadi in June 2025 after a March inspection. Alembic secured final USFDA approval for its Macitentan Tablets, 10 mg generic drug application on August 19, 2025. In its quarterly results, the company reported a 15% increase in net profit to ₹154 crore compared to ₹135 crore in the same quarter last year. Revenue grew 10% to ₹1,711 crore, while EBITDA rose 19% to ₹282 crore with margins improving to 16.5% from 15.2% year-on-year. Shares closed at ₹945.40 on the NSE, down 0.18%.",
            "Sentiment": "positive",
            "PublishDate": 1757762980734,
            "Source": "stock"
        },
        {
            "Title": "Alembic Pharma Receives USFDA Approval for Hypertension Drug, Shares Rise 2%",
            "Summary": "Alembic Pharmaceuticals received final USFDA approval for its Macitentan Tablets, 10 mg, used to treat pulmonary arterial hypertension in adults. The approved drug is therapeutically equivalent to Actelion Pharmaceuticals' Opsumit Tablets. The Macitentan tablets market is estimated at $1,180 million for the 12 months ending June 2025. In its latest quarterly results, Alembic Pharma reported net profit growth of 15% to ₹154 crore, revenue increase of 10% to ₹1,711 crore, and EBITDA growth of 19% to ₹282 crore with margin expansion to 16.5%. Shares gained 2% to ₹991.35 following the announcement, though the stock has declined 7% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1755598276801,
            "Source": "stock"
        },
        {
            "Title": "Alembic Limited Seeks Shareholder Approval for Udit Amin's Appointment as Managing Director",
            "Summary": "Alembic Limited has issued a postal ballot notice seeking shareholder approval through e-voting for the appointment of Udit Amin as Managing Director for a five-year term starting October 1, 2025. The appointment requires a special resolution and Central Government approval since Amin is a Non-Resident Indian. The proposed remuneration includes basic salary, perquisites and allowances up to a maximum of Rs. 10 crore per annum. Amin, who holds 22 years of experience across real estate, specialty chemicals, and pharmaceutical industries, has been serving as a Non-Executive Non-Independent Director since February 2017. He previously served as Managing Director until January 2017. The e-voting period runs from August 21 to September 19, 2025. The notice also mentions that Malika Amin, the current Managing Director & CEO, has expressed her desire to step down from her executive position effective January 1, 2026, and will continue as a Non-Executive Non-Independent Director.",
            "Sentiment": "neutral",
            "PublishDate": 1755596693903,
            "Source": "corporate_action"
        },
        {
            "Title": "Glenmark, Alembic and Sun Pharma Recall Products in US Market Due to Manufacturing Issues",
            "Summary": "Three Indian pharmaceutical companies are recalling products from the US market due to manufacturing defects. Glenmark Pharmaceuticals is recalling multiple batches of Carvedilol tablets totaling 73,056 units due to nitrosamine impurity above permissible limits, and 22,656 bottles of Theophylline extended-release tablets for failing dissolution specifications. Alembic Pharmaceuticals recalled 9,492 bottles of Doxepin Hydrochloride capsules due to nitrosamine impurity detection above proposed limits. Sun Pharmaceutical Industries' US arm recalled 11,328 bottles of Spironolactone tablets after contamination with aluminum. All recalls are classified as Class II, indicating potential temporary or medically reversible adverse health consequences with remote risk of serious effects.",
            "Sentiment": "negative",
            "PublishDate": 1755576593208,
            "Source": "stock"
        },
        {
            "Title": "Alembic Pharma Receives Final USFDA Approval for Tretinoin Cream 0.025%",
            "Summary": "Alembic Pharma has obtained final approval from the US Food and Drug Administration for its Tretinoin Cream 0.025%. This regulatory approval allows the pharmaceutical company to market and sell this topical medication in the United States market.",
            "Sentiment": "positive",
            "PublishDate": 1755328970916,
            "Source": "stock"
        },
        {
            "Title": "Alembic Reports Mixed Q1 Results with Net Profit Growth Despite Revenue Decline",
            "Summary": "Alembic reported Q1 consolidated net profit of 178 million rupees, up from 174 million rupees in the same period last year. However, the company's Q1 revenue declined to 497 million rupees from 508 million rupees year-over-year. EBITDA for the quarter was 196 million rupees compared to 204 million rupees in the previous year, while EBITDA margin compressed to 39.34% from 40.17% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1754994822332,
            "Source": "earnings"
        },
        {
            "Title": "Alembic Pharma Reports 15% Jump in Net Profit, Revenue Grows 10%",
            "Summary": "Alembic Pharmaceuticals reported its June quarter results with net profit rising 15% to ₹154 crore compared to ₹135 crore in the same quarter last year. Revenue increased 10% to ₹1,711 crore from ₹1,562 crore year-on-year. EBITDA grew 19% to ₹282 crore from ₹237 crore, with EBITDA margin improving to 16.5% from 15.2%. Despite the positive results, shares traded flat at ₹968.75 following the earnings announcement, with the stock down 8% on a year-to-date basis.",
            "Sentiment": "positive",
            "PublishDate": 1754381358788,
            "Source": "earnings"
        },
        {
            "Title": "Alembic Pharma Receives USFDA Approval for Anti-Convulsant Drug Carbamazepine",
            "Summary": "Alembic Pharmaceuticals received final approval from the US Food and Drug Administration for Carbamazepine extended release tablets in 100mg, 200mg and 400mg strengths. The approved abbreviated new drug application is therapeutically equivalent to Novartis Pharmaceuticals Corporation's reference drug Tegretol-XR Extended Release Tablets. The Carbamazepine tablets are used as an anti-convulsant drug and for treating pain associated with trigeminal neuralgia. According to IQVIA, the tablets have an estimated market size of $71 million for the 12 months ending March 2025. Alembic Pharma now has 225 ANDA approvals from the USFDA, comprising 202 final approvals and 23 tentative ones. The company's shares closed 1.91% lower at ₹999 and have declined 4.77% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1753513455109,
            "Source": "stock"
        },
        {
            "Title": "Alembic Reports Q4 Results and Dividend Recommendation",
            "Summary": "Alembic has announced its Q4 financial results and dividend recommendation. The company's Q4 consolidated net profit increased to 238 million rupees from 212.9 million rupees year-over-year. Revenue rose to 603 million rupees from 490.4 million rupees. EBITDA improved to 273 million rupees, up from 241.5 million rupees, although the EBITDA margin decreased to 45.35% from 49.25%. The company has recommended a dividend of 2.4 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747139105000,
            "Source": "result"
        },
        {
            "Title": "Alembic Reports Significant Increase in Q3 EBITDA and Margin",
            "Summary": "Alembic has reported a substantial year-over-year improvement in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) rose to 264 million rupees, compared to 117 million rupees in the same quarter of the previous year. Additionally, Alembic's EBITDA margin expanded significantly, reaching 45.58% versus 29.70% in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1738932271000,
            "Source": "earnings"
        },
        {
            "Title": "Alembic Reports Significant Increase in Q3 Profit and Revenue",
            "Summary": "Alembic, an Indian pharmaceutical company, has reported a substantial increase in both net profit and revenue for the third quarter. The consolidated net profit rose to 261 million rupees from 99 million rupees in the same period last year, marking a 163.6% increase. Similarly, the company's revenue grew to 579 million rupees from 393 million rupees, representing a 47.3% year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738932266000,
            "Source": "earnings"
        },
        {
            "Title": "Alembic Pharmaceuticals Reports Strong Q2 EBITDA Growth",
            "Summary": "Alembic Pharmaceuticals has reported a significant increase in its Q2 EBITDA, rising to 196 million rupees from 101.5 million rupees year-over-year. The company's EBITDA margin also improved, reaching 37.01% compared to 31.44% in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731066636000,
            "Source": "result"
        },
        {
            "Title": "Alembic Pharmaceuticals Reports Q2 Financial Results",
            "Summary": "Alembic Pharmaceuticals announced its Q2 financial results. The company's consolidated net profit increased to 773 million rupees, up from 517 million rupees year-over-year and 174 million rupees quarter-over-quarter. Revenue for Q2 rose to 529 million rupees from 322 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731066547000,
            "Source": "result"
        }
    ]
}