{
    "Symbol": "ALGOQUANT",
    "ISIN": "INE598D01035",
    "News": [
        {
            "Title": "Algoquant Fintech Board Meet Set for Feb 14, 2026",
            "Summary": "Algoquant Fintech Limited has scheduled a board meeting for February 14, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770371643302,
            "Source": "co_actions_results"
        },
        {
            "Title": "Algoquant Fintech Completes Postal Ballot for Director",
            "Summary": "Algoquant Fintech Limited successfully completed postal ballot on January 28, 2026, securing approval for re-appointment of Mr. Amit Gupta as Independent Director with 99.9997% votes in favor through remote e-voting process.",
            "Sentiment": "positive",
            "PublishDate": 1769750472394,
            "Source": "stocks"
        },
        {
            "Title": "Algoquant Fintech Begins Trading on NSE",
            "Summary": "Algoquant Fintech Limited commences trading on NSE with 28.10 crore equity shares, establishing dual listing on both NSE and BSE to enhance liquidity and investor accessibility.",
            "Sentiment": "positive",
            "PublishDate": 1767445685858,
            "Source": "co_actions_results"
        },
        {
            "Title": "Algoquant Fintech Releases 18.37% Pledge Encumbrance",
            "Summary": "Algoquant Financials LLP released encumbrance on 5.17 crore shares representing 18.37% stake in Algoquant Fintech Limited from F&O segment while creating new pledge in MCX segment on December 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765531904486,
            "Source": "stocks"
        },
        {
            "Title": "Algoquant Fintech Promoter Releases Share Pledge",
            "Summary": "Devansh Gupta releases pledge on 5.00 lakh equity shares of Algoquant Fintech Limited, reducing his encumbered shareholding from 19.47% to zero as part of capital fund raising activities.",
            "Sentiment": "positive",
            "PublishDate": 1765514739757,
            "Source": "stocks"
        },
        {
            "Title": "Algoquant Financials LLP Releases Encumbrance on Equity Shares in Algoquant Fintech Limited",
            "Summary": "Algoquant Financials LLP, a promoter and promoter group entity, has disclosed the release of encumbrances on equity shares held in Algoquant Fintech Limited under SEBI takeover regulations. The disclosure was submitted to BSE Limited for regulatory compliance and record-keeping purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1763791941715,
            "Source": "corporate_action"
        },
        {
            "Title": "Algoquant Fintech Commences Stock Broking Operations Following Business Transfer",
            "Summary": "Algoquant Fintech Limited has begun operations as a Stock Broker and Self-Clearing Member following the completion of a business transfer from Growth Securities Private Limited. The company received necessary certificates from exchanges and Depository Participants to act as Stock Broker. The transfer of Stock Broking business and Self-Clearing Membership from Growth Securities was completed prior to market hours on November 3, 2025. The transfer of Depository Participant business from Growth Securities to Algoquant Fintech is currently under process. This business transfer is part of a scheme of arrangement among Growth Securities Private Limited, Algoquant Investments Private Limited, and Algoquant Fintech Limited.",
            "Sentiment": "positive",
            "PublishDate": 1762142649725,
            "Source": "corporate_action"
        },
        {
            "Title": "Algoquant Fintech Completes Rs 5 Crore Acquisition of 0.28% Stake in NCDEX",
            "Summary": "Algoquant Fintech Limited has completed the acquisition of 253,370 equity shares representing 0.28% of National Commodity & Derivatives Exchange Limited (NCDEX) for Rs 5,00,00,036. The transaction was finalized after fulfilling conditions outlined in a share subscription and shareholder's agreement. The company had previously disclosed approval for this investment in August 2025, and the fund transfer was completed at 4:01 PM on the announcement date.",
            "Sentiment": "positive",
            "PublishDate": 1759494555142,
            "Source": "order&deals"
        },
        {
            "Title": "AlgoQuant Fintech Invests 12.8 Million Rupees in Subsidiary",
            "Summary": "AlgoQuant Fintech has made an investment of 12.8 million rupees in its subsidiary company.",
            "Sentiment": "positive",
            "PublishDate": 1758720211912,
            "Source": "stock"
        },
        {
            "Title": "Algoquant Fintech Limited Receives SEBI Registration as Depository Participant",
            "Summary": "Algoquant Fintech Limited has obtained SEBI certificate of registration under Regulation 36 of the SEBI (Depositories and Participants) Regulations, 2018 to act as a Participant with Central Depository Services (India) Limited. The registration was granted following a scheme of arrangement involving Growth Securities Private Limited, Algoquant Investments Private Limited, and Algoquant Fintech Limited under sections 230 to 232 of the Companies Act, 2013. The certificate is valid from September 18, 2025, with registration number IN-DP-817-2025. The registration allows the company to operate as a depository participant subject to compliance with various regulatory conditions including payment of annual fees, adherence to anti-money laundering requirements, and registration with FIU-IND through FINnet Gateway.",
            "Sentiment": "positive",
            "PublishDate": 1758286548736,
            "Source": "corporate_action"
        },
        {
            "Title": "Algoquant Financials LLP Creates and Releases Share Pledges in Algoquant Fintech Limited",
            "Summary": "Algoquant Financials LLP, a promoter entity of Algoquant Fintech Limited, disclosed both the creation and release of encumbrances on its equity shares on September 3, 2025. The company created a pledge of 5,27,24,982 shares (18.75% of total share capital) in favor of Globe Capital Market Ltd for fund raising purposes. Simultaneously, it released a pledge of 5,54,24,982 shares (19.71% of total share capital) that was previously held by Growth Securities Private Limited, also for fund raising purposes. Algoquant Financials LLP holds 14,51,06,928 shares representing 51.62% of the total share capital in Algoquant Fintech Limited. The promoter group collectively holds 20,71,18,008 shares, representing 73.68% of the company's total share capital. The transactions involved transferring pledged shares from the F&O segment to the commodity segment under different entities.",
            "Sentiment": "neutral",
            "PublishDate": 1757393325728,
            "Source": "corporate_action"
        },
        {
            "Title": "Algoquant Financials LLP Creates and Releases Share Pledges in Algoquant Fintech Limited",
            "Summary": "Algoquant Financials LLP, a promoter entity holding 51.62% stake in Algoquant Fintech Limited, disclosed multiple share encumbrance transactions on August 26, 2025. The company created pledges on 4.1 crore shares (14.59% of total capital) and 26.25 lakh shares (0.93% of total capital) in favor of Globe Capital Market Limited for fund raising purposes on August 20, 2025. Simultaneously, it released pledges on 3.98 crore shares (14.16% of total capital) from MCX Commodity segment. The transactions involved transferring shares from F&O segment to Commodity segment under the same entity. The promoter group's total holding stands at 73.68%, with other promoters Dhruv Gupta holding 18.50% and Devansh Gupta holding 3.56%. The company also issued bonus shares in 8:1 ratio, which increased the promoter holdings proportionally.",
            "Sentiment": "neutral",
            "PublishDate": 1756357552927,
            "Source": "corporate_action"
        },
        {
            "Title": "Algoquant Financials LLP Releases Pledge on 60.24 Lakh Shares of Algoquant Fintech Limited",
            "Summary": "Algoquant Financials LLP, a promoter of Algoquant Fintech Limited, released encumbrance on 60,24,998 equity shares (19.29% of total share capital) that were pledged to Globe Capital Market Limited for fund raising purposes. The release was executed on August 19, 2025. Following the release, the promoter's encumbered shareholding decreased to 32,49,998 shares (10.40% of total share capital) from the previous 60,24,998 shares. The promoter group collectively holds 2,30,13,112 shares representing 73.68% of the company's total share capital. The shares were released from the F&O segment, with a separate pledge created in favor of the same entity under the commodity segment.",
            "Sentiment": "positive",
            "PublishDate": 1756206260523,
            "Source": "corporate_action"
        }
    ]
}