{
    "Symbol": "ALICON",
    "ISIN": "INE062D01024",
    "News": [
        {
            "Title": "Alicon Castalloy Board Meet Set for Feb 13, 2026",
            "Summary": "Alicon Castalloy Limited has scheduled a board meeting for February 13, 2026, to approve Q3 FY26 unaudited standalone and consolidated financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769751997015,
            "Source": "co_actions_results"
        },
        {
            "Title": "Alicon Castalloy Reports Sequential Growth in Q2 FY26 with Improved Margins Despite Export Challenges",
            "Summary": "Alicon Castalloy Limited reported revenues of Rs. 429 crore for Q2 FY26, marking the third consecutive quarter of sequential growth despite a 7.7% year-on-year decline. The company achieved gross margins of 48.9%, an improvement of 300 basis points quarter-on-quarter, and EBITDA margins of 12.9%. The performance was impacted by 50% tariffs on Indian exports to the U.S. introduced in August, customer-specific issues in Europe including a cyber-attack affecting a U.K.-based OEM for 5 weeks, and weaker demand from commercial vehicle customers in the U.S. The company won seven new parts from six customers during the quarter, with total order value of Rs. 257 crore over five years. Revenue mix showed 2-wheelers contributing 44%, passenger vehicles 41%, commercial vehicles 10%, and non-auto 5%. The company announced a leadership transition with Sumit Bhatnagar set to become CEO from April 1, 2026, succeeding Rajeev Sikand. Alicon maintains an order book of Rs. 9,100 crore spanning FY24 to FY29 and expects capex of Rs. 125-130 crore for the full year.",
            "Sentiment": "neutral",
            "PublishDate": 1762964739215,
            "Source": "earnings"
        },
        {
            "Title": "Alicon Castalloy Reports Strong Quarter-on-Quarter Recovery with 49% PAT Growth",
            "Summary": "Alicon Castalloy announced its quarterly results with total income of Rs. 428.9 crore, up 2.4% quarter-on-quarter. The company showed significant profitability improvement with profit after tax rising 49.1% QoQ to Rs. 14 crore and EBITDA increasing 11% QoQ to Rs. 55.5 crore. However, year-on-year performance declined with total income down 8% and PAT lower by 17% compared to the same quarter last year. The company faced challenges from international market headwinds, tariff uncertainties, and supply chain issues related to rare earth materials and semiconductors. Group CEO Rajeev Sikand highlighted focused initiatives for value addition and operational efficiency improvements. The company benefited from GST rate rationalization on automobiles in the domestic market. Alicon also announced the appointment of Sumit Bhatnagar as CEO-Designate, with Sikand preparing to conclude his 21-year tenure in March 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1762494856021,
            "Source": "earnings"
        },
        {
            "Title": "Alicon Castalloy Reports Q2 Results and Appoints New Company Secretary",
            "Summary": "Alicon Castalloy's Board approved unaudited financial results for the quarter ended September 30, 2025. The company appointed Ms. Sneha Shukla as Company Secretary and Compliance Officer effective November 10, 2025. Ms. Shukla is an Associate Member of the Institute of Company Secretaries of India with 7 years of experience in secretarial and legal fields. For Q2 2025, standalone revenue from operations was Rs. 28,507.48 lakhs compared to Rs. 31,242.76 lakhs in Q2 2024. Net profit for the quarter was Rs. 1,405.90 lakhs versus Rs. 2,236.53 lakhs in the previous year quarter. On a consolidated basis, revenue was Rs. 28,818.39 lakhs for Q2 2025 against Rs. 31,790.58 lakhs in Q2 2024, with net profit of Rs. 1,388.75 lakhs compared to Rs. 1,940.34 lakhs in the prior year quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762438853374,
            "Source": "earnings"
        },
        {
            "Title": "Alicon Castalloy Reports Mixed Q2 Results with Revenue Decline but Margin Improvement",
            "Summary": "Alicon Castalloy reported quarterly results showing EBITDA of 548 million rupees compared to 560 million rupees in the same period last year. The company's EBITDA margin improved to 12.79% from 12.08% year-over-year. Consolidated net profit declined to 139 million rupees from 168 million rupees in the previous year. Revenue decreased to 4.3 billion rupees from 4.6 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762432590820,
            "Source": "earnings"
        },
        {
            "Title": "Alicon Castalloy Appoints Sumit Bhatnagar as CEO-Designate, Names New CHRO",
            "Summary": "Alicon Castalloy Ltd announced two key leadership appointments. Sumit Bhatnagar has been appointed as Chief Executive Officer-Designate effective September 22, 2025, and will succeed Rajeev Sikand, who will superannuate on March 31, 2026. Additionally, Ashish Srivastava has been appointed as Chief Human Resource Officer, joining September 25, 2025. Bhatnagar brings over 26 years of automotive industry experience across business development, operations, and supply chain management. He currently serves as Group President of ANAND since January 2017 and Managing Director of ANEVOLVE since January 2022. Bhatnagar holds a BE in Production Engineering and PGDBM in Finance and Strategy from IIM Kozhikode. He holds no shares in the company and is not related to any board directors. Sikand, the outgoing CEO, holds 508,638 shares in the company.",
            "Sentiment": "positive",
            "PublishDate": 1757058694400,
            "Source": "corporate_governance"
        },
        {
            "Title": "Alicon Castalloy Reports 5% Revenue Decline in Q1 FY26 Amid Global Trade Headwinds",
            "Summary": "Alicon Castalloy reported revenue of Rs. 419 crore in Q1 FY26, down 5% year-on-year from Rs. 440 crore in Q1 FY25. The company faced challenges from new U.S. tariffs of 25% on Indian goods with an additional 25% penalty tariff for Russia-related trade, effectively creating a 50% tariff. China's restrictions on rare earth material exports also impacted supply chains, particularly affecting EV motor magnets. Despite headwinds, EBITDA improved to Rs. 50 crore with 11.9% margin compared to 11.2% in the previous quarter. The company added seven new parts from five customers including two new logos during the quarter. Gross margin declined to 45.9% from 47.5% due to aluminum price increases and sales mix changes. The company maintains its order book of Rs. 9,100 crore spanning through FY29 and continues its CAPEX plan of Rs. 165-170 crore for FY26. Management appointed new leadership including a COO and Head of Defense, Aerospace and Railways vertical.",
            "Sentiment": "negative",
            "PublishDate": 1755161222777,
            "Source": "earnings"
        },
        {
            "Title": "Alicon Castalloy Sets September 15, 2025 Record Date for Rs. 3 Final Dividend",
            "Summary": "Alicon Castalloy Limited has established September 15, 2025 as the record date for determining shareholder eligibility for final dividend payment of Rs. 3 per equity share for financial year 2024-25. The company's book closure period will run from September 15 to 19, 2025. The Board of Directors recommended this final dividend of Rs. 3 per equity share of Rs. 5 each, representing a 60% dividend rate.",
            "Sentiment": "positive",
            "PublishDate": 1754723386188,
            "Source": "corporate_action"
        },
        {
            "Title": "Alicon Castalloy Reports Mixed Q1 FY26 Results with Sequential Improvement Despite Macro Headwinds",
            "Summary": "Alicon Castalloy announced its financial results for the quarter ended June 30, 2025. The company reported total income of Rs. 418.7 crore, down 2% sequentially from Rs. 425.6 crore and 5% lower year-on-year from Rs. 440.7 crore. Despite the revenue decline, profitability showed sequential improvement with EBITDA rising 4% to Rs. 49.9 crore and PBT increasing 16% to Rs. 15.2 crore compared to the previous quarter. However, year-on-year comparisons showed EBITDA declining 14% and PBT dropping 41%. The company faced challenges from tariff uncertainty, shortage of rare earth materials from China, and muted demand, with its addressable market declining nearly 4%. Management highlighted resilient performance despite macro-economic volatility and noted efforts to improve profitability through cost optimization. The company appointed Manish Kapoor as Chief Operating Officer and established a dedicated vertical for Defence, Aerospace, and Railways sectors under Harshvardhan Gune.",
            "Sentiment": "neutral",
            "PublishDate": 1754634438030,
            "Source": "earnings"
        },
        {
            "Title": "Alicon Castalloy Proposes ₹3 Final Dividend Despite Q1 Profit Decline",
            "Summary": "Alicon Castalloy has proposed a final dividend of ₹3 per equity share. The company's Q1 results showed mixed performance with consolidated net profit declining to ₹93 million from ₹190 million year-over-year. Revenue decreased to ₹4.18 billion from ₹4.4 billion. EBITDA fell to ₹491 million from ₹575 million, while EBITDA margin compressed to 11.75% from 13.07% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1754569585417,
            "Source": "corporate_action"
        },
        {
            "Title": "Alicon Castalloy Recommends Dividend",
            "Summary": "Alicon Castalloy has recommended a dividend of 2.5 rupees per share to its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1747050325000,
            "Source": "result"
        },
        {
            "Title": "Alicon Castalloy Reports Q4 Financial Results",
            "Summary": "Alicon Castalloy has released its Q4 financial results. The company's EBITDA decreased to 468 million rupees from 576 million rupees year-over-year, with the EBITDA margin falling to 11.01% from 13.74%. Consolidated net profit dropped to 94 million rupees from 205 million rupees year-over-year, but increased from 8 million rupees quarter-over-quarter. Revenue remained relatively stable at 4.2 billion rupees compared to 4.19 billion rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1747050282000,
            "Source": "result"
        },
        {
            "Title": "Alicon Castalloy Reports Significant Decline in Q3 Profit",
            "Summary": "Alicon Castalloy, an automotive components manufacturer, has reported a substantial decrease in its third-quarter consolidated net profit. The company's net profit fell to 8 million rupees, down from 167 million rupees in the same quarter of the previous year. Revenue also saw a slight decline, dropping to 3.9 billion rupees from 4 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739181639000,
            "Source": "earnings"
        },
        {
            "Title": "Alicon Castalloy Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Alicon Castalloy, an automotive components manufacturer, has reported a significant decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 343 million rupees from 522 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin contracted to 8.74% from 12.89% year-over-year, indicating a substantial reduction in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1739181634000,
            "Source": "earnings"
        }
    ]
}