{
    "Symbol": "ALKEM",
    "ISIN": "INE540L01014",
    "News": [
        {
            "Title": "Alkem Labs Reschedules Q3FY26 Results Call to 5 PM",
            "Summary": "Alkem Laboratories has revised the timing of its Q3FY26 and 9MFY26 financial results conference call to 5:00 PM IST on February 13, 2026, moving it one hour later than originally scheduled.",
            "Sentiment": "neutral",
            "PublishDate": 1770895818274,
            "Source": "co_actions_results"
        },
        {
            "Title": "Alkem Labs Board Approves Subsidiary Merger Plan",
            "Summary": "Alkem Laboratories' board has approved the merger of Alkem Medtech Ortho Private Limited with Alkem Medtech Private Limited, pending NCLT approval and shareholder consent for the corporate restructuring.",
            "Sentiment": "neutral",
            "PublishDate": 1770366861026,
            "Source": "co_actions_results"
        },
        {
            "Title": "Alkem Labs Block Trade Worth Rs. 58.81 Crores",
            "Summary": "Alkem Laboratories witnessed a significant NSE block trade worth Rs. 58.81 crores involving 101,852 shares at Rs. 5774.00 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769573368285,
            "Source": "co_actions_results"
        },
        {
            "Title": "Alkem Labs Sets Q3 Results Date for Feb 13",
            "Summary": "Alkem Laboratories has announced that its board will convene on February 13 to review and approve the company's third quarter financial results for the current fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1769156033479,
            "Source": "co_actions_results"
        },
        {
            "Title": "Alkem Labs Receives ₹2.35 Cr GST Demand Order",
            "Summary": "Alkem Laboratories receives GST order from Additional Commissioner demanding ₹2.35 crores with penalty for alleged excess Input Tax Credit availment during 2019-2023 period.",
            "Sentiment": "negative",
            "PublishDate": 1769075879196,
            "Source": "stocks"
        },
        {
            "Title": "Alkem Laboratories Block Trade Worth ₹15.32 Crores",
            "Summary": "Alkem Laboratories witnessed a significant block trade on NSE involving 26,165 shares at ₹5,856.00 per share, totaling ₹15.32 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1768544034427,
            "Source": "co_actions_results"
        },
        {
            "Title": "Alkem Labs Launches Renocia Hair Growth Kit",
            "Summary": "Alkem Laboratories launches Renocia Cyclical Therapy, a scientifically-designed weekly nutritional supplement kit with separate formulations for men and women, using vegetarian ingredients.",
            "Sentiment": "positive",
            "PublishDate": 1767865425253,
            "Source": "stocks"
        },
        {
            "Title": "Alkem Labs Receives GST Order Worth ₹2.18 Crores",
            "Summary": "Alkem Laboratories receives GST demand order of ₹1.09 crores with equal penalty for alleged excess input tax credit availment during 2018-2021. Company plans to contest the order.",
            "Sentiment": "negative",
            "PublishDate": 1767251543150,
            "Source": "stocks"
        },
        {
            "Title": "Alkem Wellness Completes ₹532.5 Cr Trade Generics Sale",
            "Summary": "Alkem Wellness pays final ₹32.5 crore installment to complete the ₹532.5 crore sale of its trade generics business, marking a significant corporate restructuring move.",
            "Sentiment": "neutral",
            "PublishDate": 1767099857638,
            "Source": "co_actions_results"
        },
        {
            "Title": "Alkem Labs Receives GST Order Worth ₹9.72 Cr",
            "Summary": "Alkem Laboratories received a GST demand order of ₹9.72 crores from West Bengal authorities for FY2021-22, covering tax, interest and penalty. Company plans to contest the order.",
            "Sentiment": "negative",
            "PublishDate": 1767091815073,
            "Source": "stocks"
        },
        {
            "Title": "Alkem Labs Receives GST Demand Order Worth ₹56.71 Cr",
            "Summary": "Alkem Laboratories receives GST demand order from Delhi authorities for FY2018-19, alleging excess input tax credit availment. Company plans to contest the order through appeal process.",
            "Sentiment": "negative",
            "PublishDate": 1767078458198,
            "Source": "stocks"
        },
        {
            "Title": "Alkem Labs Receives GST Orders Worth ₹1.89 Crores",
            "Summary": "Alkem Laboratories received two GST demand orders totaling ₹1.89 crores with penalties for alleged excess Input Tax Credit claims from Haryana and Rajasthan authorities. Company plans to contest both orders.",
            "Sentiment": "negative",
            "PublishDate": 1767001570488,
            "Source": "stocks"
        },
        {
            "Title": "Alkem Labs Invests ₹300 Cr in Subsidiary Enzene",
            "Summary": "Alkem Laboratories acquired 64.02 lakh equity shares in subsidiary Enzene Biosciences for ₹299.99 crores through rights issue, increasing stake to 99.61%.",
            "Sentiment": "positive",
            "PublishDate": 1766756603186,
            "Source": "co_actions_results"
        },
        {
            "Title": "Alkem Labs Receives GST Demand Order Worth ₹3.82L",
            "Summary": "Alkem Laboratories received a GST demand order from Kerala tax authorities for ₹2.05 lakh plus penalty and interest, totaling ₹3.82 lakh for FY2021-22. Company plans to contest the order.",
            "Sentiment": "negative",
            "PublishDate": 1766754952059,
            "Source": "stocks"
        },
        {
            "Title": "Alkem Labs Senior VP Vijay Shetty Resigns",
            "Summary": "Alkem Laboratories announces resignation of Senior VP-Global Distribution Supply Chain Vijay Shetty, effective December 12, 2025, to pursue better opportunities outside the company.",
            "Sentiment": "neutral",
            "PublishDate": 1765524750680,
            "Source": "stocks"
        },
        {
            "Title": "Malta Medicines Authority Finds No Critical Issues at Alkem's Daman Facility During Inspection",
            "Summary": "Malta Medicines Authority conducted an inspection of Alkem Laboratories' Daman facility and found no critical issues. The inspection identified three major observations and several minor observations that require the company's attention.",
            "Sentiment": "neutral",
            "PublishDate": 1765343852904,
            "Source": "stock"
        },
        {
            "Title": "Alkem Laboratories Senior VP Rakesh Tripathi Resigns Due to Personal Commitments",
            "Summary": "Mr. Rakesh Tripathi, Senior Vice President-Regulated Plant Operations at Alkem Laboratories, has resigned from his position effective December 8, 2025, citing personal and family reasons after 8.7 years with the company. The pharmaceutical company has acknowledged his valuable contributions during his tenure as Senior Management Personnel.",
            "Sentiment": "neutral",
            "PublishDate": 1765173960667,
            "Source": "corporate_governance"
        },
        {
            "Title": "Alkem Laboratories Appoints Prakash Ramnani to Senior Management Position",
            "Summary": "Alkem Laboratories appointed Mr. Prakash Ramnani to a senior management position effective December 5, 2025. Ramnani brings over 25 years of experience in pharmaceutical manufacturing operations and technology transfer, with qualifications including M.Pharm and B.Pharm degrees.",
            "Sentiment": "positive",
            "PublishDate": 1764932940134,
            "Source": "corporate_governance"
        },
        {
            "Title": "Alkem Laboratories Receives GST Demand Order Worth Rs. 54.94 Lakh",
            "Summary": "Alkem Laboratories received a GST demand order from Assistant Commissioner, Central GST Division, Dehradun for Rs. 27.14 lakh along with penalty of Rs. 27.79 lakh for alleged excess ITC availment during F.Y. 2018-2019 to 2022-2023. The company disagrees with the order and plans to contest it, stating no material impact on financial or operational activities.",
            "Sentiment": "negative",
            "PublishDate": 1764931156051,
            "Source": "stock"
        },
        {
            "Title": "Alkem Labs' Sikkim Manufacturing Facility Passes Health Ministry Inspection",
            "Summary": "The Health Ministry conducted an inspection of Alkem Labs' manufacturing facility in Sikkim, India, and concluded the review with no major observations. This regulatory clearance indicates the facility meets compliance standards, which is positive for Alkem Labs' manufacturing operations and regulatory standing.",
            "Sentiment": "positive",
            "PublishDate": 1763951420559,
            "Source": "stock"
        },
        {
            "Title": "Alkem Laboratories Launches Probiotic 'dss' in India for Gut Health Management",
            "Summary": "Alkem Laboratories has launched a probiotic product called 'dss', which is based on the original De Simone formulation, in the Indian market. The product is positioned for gut health management, expanding the company's healthcare portfolio in the domestic market.",
            "Sentiment": "positive",
            "PublishDate": 1763678820137,
            "Source": "stock"
        },
        {
            "Title": "Alkem Laboratories Reports Strong Q2FY26 Results with 17.2% Revenue Growth",
            "Summary": "Alkem Laboratories achieved record quarterly revenue of INR 40,010 million with 17.2% Y-o-Y growth, driven by robust performance across India (12.4% growth), U.S. (28% growth), and international markets (32.4% growth). The company became the number one player in India's acute segment, outperformed IPM in 6 out of 11 therapies, and expects EBITDA margins of 19.5%-20% for the full year despite new business investments.",
            "Sentiment": "positive",
            "PublishDate": 1763534351392,
            "Source": "earnings"
        },
        {
            "Title": "Alkem Laboratories Receives GST Demand Order Worth Rs 3.61 Crore",
            "Summary": "Alkem Laboratories received a GST demand order from Gujarat authorities for Rs 1,80,87,074 along with equal penalty and interest for alleged excess availment of ineligible input tax credit from FY 2018-19 to 2024-25. The pharmaceutical company disagrees with the order and plans to contest it, stating no material impact on its financial or operational activities.",
            "Sentiment": "negative",
            "PublishDate": 1763467037035,
            "Source": "stock"
        },
        {
            "Title": "Alkem Laboratories Reports Strong Q2FY26 Performance with 17% Revenue Growth",
            "Summary": "Alkem Laboratories delivered robust quarterly results with total revenue rising 17.2% YoY to ₹40,010 million and EBITDA growing 22.3% to ₹9,208 million, achieving 23.0% EBITDA margin. The pharmaceutical company showed strong performance across domestic (12.4% growth) and international markets (29.5% growth), with US business contributing 19.3% of total sales and net profit reaching ₹7,651 million.",
            "Sentiment": "positive",
            "PublishDate": 1763060886374,
            "Source": "earnings"
        },
        {
            "Title": "Alkem Laboratories Reports 19.55% Rise in Consolidated Net Profit for Six Months Ended September 2025",
            "Summary": "Alkem Laboratories reported consolidated net profit of Rs 2,394 million for the six months ended September 30, 2025, compared to Rs 2,063.2 million in the same period last year. Revenue from operations increased to Rs 27,144.9 million from Rs 24,816.9 million. For the quarter ended September 30, 2025, net profit was Rs 1,279.8 million versus Rs 1,152.0 million in the previous year quarter. The company's total assets stood at Rs 174,260.8 million as of September 30, 2025. Exceptional items for the half-year included a gain of Rs 142.9 million from the sale of Indore facility. The company executed a Business Transfer Agreement effective October 1, 2025, transferring its Generic Business Undertaking to wholly-owned subsidiary Alkem Wellness Limited. Basic earnings per share for the six months was Rs 119.55 compared to Rs 103.20 in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1763026368777,
            "Source": "earnings"
        },
        {
            "Title": "Alkem Labs Completes EU GMP Inspection at Baddi Facility Without Major Issues",
            "Summary": "Alkem Labs announced that the EU GMP (Good Manufacturing Practice) inspection at its Baddi facility has concluded without any major issues being identified.",
            "Sentiment": "positive",
            "PublishDate": 1762782387631,
            "Source": "stock"
        },
        {
            "Title": "Alkem Laboratories Receives GST Penalty Order of Rs. 2.16 Lakh",
            "Summary": "Alkem Laboratories has received a penalty order of Rs. 2,16,263 from the Assistant Commissioner, Sector 4 (Mobile Squad-7), Agra, Uttar Pradesh under the IGST Act, 2017. The order was received on October 31, 2025, related to a consignment of goods that was detained due to alleged technical discrepancies in accompanying documents. The company disagrees with the demand order and plans to contest it through appropriate actions including filing an appeal. Alkem stated there is no material impact on the company's financial, operational or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1762169335116,
            "Source": "stock"
        },
        {
            "Title": "Alkem Laboratories Partners with IIT Bombay for Research Centre on Immuno-Therapeutics and Regenerative Medicines",
            "Summary": "Alkem Laboratories announced a partnership with IIT Bombay to establish a research centre focused on immuno-therapeutics and regenerative medicines. The Alkem Foundation will provide financial support covering 20-25% of the company's CSR commitments over a seven-year period for this initiative.",
            "Sentiment": "positive",
            "PublishDate": 1762155860094,
            "Source": "stock"
        },
        {
            "Title": "Alkem Laboratories Block Trade Worth Rs. 56.15 Crores Executed on NSE",
            "Summary": "Alkem Laboratories executed a block trade on the National Stock Exchange involving approximately 100,805 shares at Rs. 5,570 per share, totaling Rs. 56.15 crores. The transaction represents a significant institutional trade in the pharmaceutical company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1760589166853,
            "Source": "order&deals"
        },
        {
            "Title": "Alkem Laboratories Faces Rs 3.37 Crore GST Demand, Plans to Contest Order",
            "Summary": "Alkem Laboratories received an appeal order from the Commissioner of Customs & Central Tax Appeals-II Commissionerate, Hyderabad, confirming a GST demand of Rs 3.37 crore along with interest and penalty of Rs 33.93 lakh for the period 2020-2021 to 2021-2022. The order alleges excess availment of Input Tax Credit under IGST, CGST and SGST Acts. The company disagrees with the demand and plans to contest it through appropriate legal actions including filing an appeal. Alkem stated there is no material impact on its financial, operational or other activities due to this order, believing the dispute is not tenable and that it has adequate factual and legal grounds to defend its position.",
            "Sentiment": "negative",
            "PublishDate": 1759312149764,
            "Source": "stock"
        },
        {
            "Title": "Alkem Labs Transfers Trade Generics Business to Subsidiary, Reports Strong Quarterly Results",
            "Summary": "Alkem Laboratories has entered into a business transfer agreement with its wholly-owned subsidiary Alkem Wellness to transfer its trade generics business on a slump sale basis, effective from October 1, 2025. The company received a GST order confirming a demand of ₹35.11 crore along with a penalty of ₹3.5 crore for the period July 2017-18 to March 2022, primarily alleging denial of input tax credit due to double claims. Alkem disagrees with the order and plans to contest it. For the April-June period, the company reported strong performance with revenue rising 11% year-on-year to ₹3,371 crore, net profit surging 21.45% to ₹668 crore, and EBITDA jumping 21.35% to ₹739 crore, driven by 2.9% overall volume growth. Shares ended lower by 1.72% at ₹5,413.50.",
            "Sentiment": "positive",
            "PublishDate": 1758895401232,
            "Source": "stock"
        },
        {
            "Title": "Alkem Lab Transfers Trade Generics Business to Alkem Wellness",
            "Summary": "Alkem Lab will transfer its Trade Generics Business to Alkem Wellness effective October 1, 2025. This represents a business restructuring move within the pharmaceutical company's operations.",
            "Sentiment": "neutral",
            "PublishDate": 1758888366363,
            "Source": "corporate_action"
        },
        {
            "Title": "Alkem Laboratories Faces Rs. 35.11 Crore GST Demand and Rs. 3.51 Crore Penalty",
            "Summary": "Alkem Laboratories received a GST appeal order demanding Rs. 35.11 crore along with a penalty of Rs. 3.51 crore. The pharmaceutical company has announced its intention to contest this order.",
            "Sentiment": "negative",
            "PublishDate": 1758553789804,
            "Source": "stock"
        },
        {
            "Title": "Alkem Laboratories Launches Pertuza Biosimilar for HER2-Positive Breast Cancer Treatment in India",
            "Summary": "Alkem Laboratories launched Pertuza injection 420mg/14mL, an indigenously-developed biosimilar for HER2-positive breast cancer treatment in India. The drug demonstrated equivalence in efficacy, safety, and immunogenicity to the reference product in a pivotal phase 3 clinical trial. CEO Dr Vikas Gupta stated that breast cancer is the most common cancer among Indian women and the launch aims to provide effective, accessible, and affordable treatment options. In quarterly results, Alkem reported revenue growth of 11% year-on-year to ₹3,371 crore, exceeding estimates of ₹3,155 crore. Net profit surged 21.5% to ₹668 crore compared to ₹550 crore in the same period last year, well above the forecast of ₹481 crore. EBITDA increased 21.3% to ₹739 crore with margins expanding by 190 basis points to 21.9%. The company's shares ended 1% lower at ₹5,486 on the NSE.",
            "Sentiment": "positive",
            "PublishDate": 1758541379945,
            "Source": "stock"
        },
        {
            "Title": "Alkem Laboratories Launches Pertuza Biosimilar for HER2-Positive Breast Cancer Treatment in India",
            "Summary": "Alkem Laboratories launched Pertuza injection 420mg/14mL, a pertuzumab biosimilar, in India for treating HER2-positive breast cancer. The indigenously-developed and manufactured biosimilar demonstrated equivalence in efficacy, safety, and immunogenicity to the reference product in a pivotal phase 3 clinical trial conducted by Alkem's biotech subsidiary. The company aims to address accessibility challenges, as limited HER2-positive breast cancer patients currently use pertuzumab due to cost barriers. CEO Dr. Vikas Gupta stated that breast cancer is the most common cancer among Indian women and the launch strengthens Alkem's oncology portfolio. The company's oncology portfolio includes cetuximab biosimilar, denosumab biosimilar, bevacizumab biosimilar, and romiplostim biosimilar. Alkem is the fifth largest pharmaceutical company in the Indian market with 19 manufacturing facilities and R&D centers across India and the US.",
            "Sentiment": "positive",
            "PublishDate": 1758537678557,
            "Source": "stock"
        },
        {
            "Title": "Alkem Laboratories Reports Strong Q1 FY2026 Results with 11.2% Revenue Growth and 21.8% Net Profit Increase",
            "Summary": "Alkem Laboratories delivered robust quarterly results with total revenue growing 11.2% year-over-year to INR 33,711 million. The company's India business grew 12% to INR 22,656 million, outperforming the Indian Pharmaceutical Market growth of 8.5% by registering 9.7% growth. The U.S. business expanded 8.8% to INR 6,982 million, while non-U.S. international operations grew 9.1% to INR 3,556 million. EBITDA increased 21.4% to INR 7,391 million with a margin of 21.9%, and net profit rose 21.8% to INR 6,643 million. The company launched sacubitril/valsartan in July 2025 and filed BLA for denosumab biosimilar in the U.S., expecting approval by mid-2026. Management maintains guidance while expressing confidence in potentially exceeding targets, with gross margin guidance of 64% and EBITDA margin guidance of 19-20% for the full year. The company is expanding into new areas including MedTech business and CDMO operations, with the CDMO facility expected to be operational by Q3/Q4 FY2026.",
            "Sentiment": "positive",
            "PublishDate": 1755596435946,
            "Source": "earnings"
        },
        {
            "Title": "Alkem Laboratories Reports Strong Q1 Growth with Revenue Rising to 33.7B Rupees",
            "Summary": "Alkem Laboratories delivered strong quarterly results with revenue increasing to 33.7 billion rupees from 30.31 billion rupees in the previous year. Consolidated net profit rose to 6.6 billion rupees compared to 5.5 billion rupees year-over-year. EBITDA grew to 7.4 billion rupees from 6.1 billion rupees, while EBITDA margin improved to 21.9% from 20.08%. The company provided FY26 EBITDA margin guidance of 19.5%.",
            "Sentiment": "positive",
            "PublishDate": 1754985818949,
            "Source": "earnings"
        },
        {
            "Title": "Alkem Laboratories Reschedules Q1FY26 Results Conference Call to August 12, 2025",
            "Summary": "Alkem Laboratories has rescheduled its Q1FY26 financial results conference call to Tuesday, August 12, 2025 at 5:00 PM IST, revising from a previously announced date of August 5, 2025. The one-hour conference call will be hosted by Motilal Oswal Securities and will feature CEO Dr. Vikas Gupta and CFO Mr. Nitin Agrawal discussing the company's quarterly financial results. The call will follow the announcement of Q1FY26 results on the same day. Dial-in details have been provided for both domestic and international participants across multiple countries including the USA, UK, Singapore, and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1754561908943,
            "Source": "earnings"
        },
        {
            "Title": "Alkem Laboratories Schedules Q1FY26 Results Conference Call for August 12, 2025",
            "Summary": "Alkem Laboratories Limited will hold a conference call on Tuesday, August 12, 2025, from 4:30 pm to 5:30 pm IST to discuss its Q1FY26 financial results with investors and analysts. The call will be held after the company announces its quarterly results on the same day. CEO Dr. Vikas Gupta and CFO Mr. Nitin Agrawal will represent the company on the call, which will be hosted by Motilal Oswal Securities Ltd. The company has provided dial-in details for domestic and international participants, with an option for Express Join with Diamond Pass registration.",
            "Sentiment": "neutral",
            "PublishDate": 1754393022686,
            "Source": "earnings"
        },
        {
            "Title": "Alkem Reports 10.3% Year-Over-Year Growth in May 2025",
            "Summary": "Alkem, a pharmaceutical company, has reported a 10.3% year-over-year growth in May 2025. No additional details about the nature of this growth or specific financial figures were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1749528668000,
            "Source": "default"
        },
        {
            "Title": "Alkem Laboratories: Promoter Sells 1.4% Stake in Block Deal",
            "Summary": "A 1.4% equity stake in Alkem Laboratories changed hands in a block deal. Promoter Jayanti Sinha was expected to sell a 1.42% stake worth ₹825 crore at a floor price of ₹4,850 per share. The stock is currently trading at ₹4,985, down 0.2%.",
            "Sentiment": "neutral",
            "PublishDate": 1749009121000,
            "Source": "block_deals"
        },
        {
            "Title": "Alkem Labs: Block Trade of ₹856.39 Crore on BSE",
            "Summary": "A block trade of Alkem Labs shares occurred on the Bombay Stock Exchange (BSE). The trade involved approximately 1,749,304 shares at a price of ₹4,895.6 per share, totaling ₹856.39 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1749008897000,
            "Source": "block_details"
        },
        {
            "Title": "Alkem Lab: Major Stake Sale by Ms. Jayanti Sinha",
            "Summary": "Ms. Jayanti Sinha has sold a 1.42% stake in Alkem Lab through a block deal. The sale was conducted at a floor price of ₹4,850 per share, with the total transaction valued at approximately ₹825 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1748957303000,
            "Source": "default"
        },
        {
            "Title": "Alkem Laboratories: Promoter to Sell ₹825 Crore Stake via Block Deal",
            "Summary": "Jayanti Sinha, a promoter group member, plans to sell 1.42% stake in Alkem Laboratories. The block deal is expected tomorrow with a floor price of ₹4,850 per share, a 3% discount to current market price. Total transaction size is estimated at ₹825 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1748955733000,
            "Source": "block_deals"
        },
        {
            "Title": "Alkem Labs Outlines Growth Plans and Financial Projections",
            "Summary": "Alkem Labs has shared several business updates and financial projections during a conference call. The company aims to achieve sales of Rs. 450-500 crore from its CDMO business over the next three years at full capacity utilization. For the current financial year, Alkem expects a 1.5% to 2% volume growth. The company plans to launch 5-6 new products this year and is confident about delivering growth, anticipating more stable market trends. Alkem projects EBITDA margins to remain around 19.5% for this financial year. Revenue growth is expected to be in the range of 7% to 8% for the coming year, with potential for slightly higher growth.",
            "Sentiment": "positive",
            "PublishDate": 1748575516000,
            "Source": "default"
        },
        {
            "Title": "Alkem Laboratories: Q4 Miss Prompts Jefferies to Cut Estimates",
            "Summary": "Alkem Labs reported Q4 revenue up 7% YoY to Rs 3,104 crore, below estimates. Ebitda fell 8% short of expectations at Rs 393 crore, with margins down 125 bps to 12.4%. PAT decreased 9% YoY to Rs 308 crore. Jefferies lowered price target to Rs 4,460, maintaining 'underperform' rating due to execution risks on new growth initiatives.",
            "Sentiment": "negative",
            "PublishDate": 1748573998000,
            "Source": "earnings"
        },
        {
            "Title": "Alkem Laboratories: Q4 Profit Up 4% YoY, Misses Estimates; Declares ₹8 Dividend",
            "Summary": "Alkem Labs reported Q4FY25 net profit of ₹306 crore, up 4.26% YoY but below estimates. Revenue rose 7.1% to ₹3,144 crore. EBITDA fell 2.6% to ₹391.5 crore. India business grew 6.5%, international sales up 7.2%. Company recommended ₹8 per share dividend.",
            "Sentiment": "neutral",
            "PublishDate": 1748509944000,
            "Source": "earnings"
        },
        {
            "Title": "Alkem Lab Reports Lower Non-US Business Growth Than Guided",
            "Summary": "Alkem Lab's full year non-US business growth was reported at 8.7%, falling short of the company's guidance of 13-14%.",
            "Sentiment": "negative",
            "PublishDate": 1748508848000,
            "Source": "default"
        },
        {
            "Title": "Alkem Laboratories Achieves Full Year EBITDA Margin of 19.38%",
            "Summary": "Alkem Laboratories reported its full year EBITDA margin at 19.38%, which is slightly above the company's guidance of 19%. This indicates that the company has met and marginally exceeded its projected financial performance in terms of profitability.",
            "Sentiment": "positive",
            "PublishDate": 1748507614000,
            "Source": "default"
        },
        {
            "Title": "Alkem Laboratories Reports Q4 Financial Results and Dividend Declaration",
            "Summary": "Alkem Laboratories has announced its Q4 financial results. The company reported revenue of 31.4 billion rupees, up from 29.3 billion rupees in the same quarter last year. EBITDA stood at 3.9 billion rupees, slightly down from 4 billion rupees year-over-year. The EBITDA margin decreased to 12.45% from 13.69% in the previous year. Consolidated net profit increased to 3.1 billion rupees from 2.9 billion rupees. Additionally, the company declared a dividend of 8 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1748507297000,
            "Source": "result"
        }
    ]
}