{
    "Symbol": "ALKYLAMINE",
    "ISIN": "INE150B01039",
    "News": [
        {
            "Title": "Alkyl Amines Chemicals Q3 Net Profit Drops 3.4%",
            "Summary": "Alkyl Amines Chemicals reported Q3 standalone net profit of ₹423 million, down from ₹438 million in the same quarter last year, marking a year-on-year decline of 3.4%.",
            "Sentiment": "negative",
            "PublishDate": 1770106069000,
            "Source": "co_actions_results"
        },
        {
            "Title": "Alkyl Amines Board Meet on Feb 3 for Q3FY26 Results",
            "Summary": "Alkyl Amines Chemicals has scheduled its board meeting for February 3, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768567343678,
            "Source": "co_actions_results"
        },
        {
            "Title": "Alkyl Amines Clarifies Volume Surge to BSE",
            "Summary": "Alkyl Amines Chemicals responds to BSE inquiry about significant trading volume increase, stating no undisclosed information affecting share price movement and confirming regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1767948784633,
            "Source": "stocks"
        },
        {
            "Title": "CRISIL Reaffirms AA-/Stable Rating for Alkyl Amines",
            "Summary": "CRISIL has reaffirmed Alkyl Amines Chemicals' AA-/Stable long-term rating and A1+ short-term rating on bank facilities worth ₹189.38 crores, reflecting the company's strong credit profile.",
            "Sentiment": "positive",
            "PublishDate": 1767013464146,
            "Source": "stocks"
        },
        {
            "Title": "Alkyl Amines Allots 75 Shares Under ESOP-2018",
            "Summary": "Alkyl Amines Chemicals Limited allotted 75 equity shares to eligible employees under ESOP-2018 on December 19, 2025, increasing paid-up capital to ₹10.23 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1766130267700,
            "Source": "co_actions_results"
        },
        {
            "Title": "Alkyl Amines Chemicals Seeks Shareholder Approval for Director's Remuneration Revision",
            "Summary": "Alkyl Amines Chemicals Limited has initiated a postal ballot process to revise the remuneration of Whole-time Director-Operations Mr. Rakesh S. Goyal, specifically increasing his commission from 0.10% to 0.30% of net profits effective January 1, 2026. The e-voting period runs from November 21, 2025 to December 20, 2025, with results to be declared by December 23, 2025, affecting shareholders' voting rights and the company's executive compensation structure.",
            "Sentiment": "neutral",
            "PublishDate": 1763466361101,
            "Source": "corporate_action"
        },
        {
            "Title": "Alkyl Amines Chemicals Reports Subdued H1 FY26 Performance Due to US Geopolitical Pressures",
            "Summary": "Alkyl Amines Chemicals Limited reported a challenging first half with flat topline performance despite marginal volume growth. Executive Director Kirat Patel attributed the subdued performance to US government actions impacting the company in four ways: direct US exports affected, customer demand reduced due to their US export challenges, increased Chinese competition in domestic markets, and sanctions on some Indian distributors in their supply chain. The methylamines segment was more impacted than ethylamines, with overall market facing capacity overhang as fourth player Aarti Drugs commissioned its plant. The company expects mechanical completion of its new Rs. 120 crore project in Kurkumbh by February-March 2026, targeting dyes, pigments and electronics markets. Anti-dumping duties on acetonitrile implemented in June are expected to show benefits from Q4 onwards, though Chinese competitors remain aggressive on pricing. Management anticipates the current subdued demand conditions may continue due to ongoing geopolitical uncertainties.",
            "Sentiment": "negative",
            "PublishDate": 1762992429688,
            "Source": "earnings"
        },
        {
            "Title": "Alkyl Amines Chemicals Provides FY26-27 Business Outlook and Project Timeline",
            "Summary": "Alkyl Amines Chemicals announced that their new product facility at Kurkumbh is expected to achieve mechanical completion between February-March 2026, with commercialization planned for Q1 FY27. The company projects an asset turnover ratio of 1.5x for this facility. For FY26, the company expects volume growth to be subdued and below their normal growth rate of 7-15%. Regarding their acetonitrile business, the company anticipates real benefits starting from Q4 FY26, with improvements expected primarily in volumes rather than prices.",
            "Sentiment": "neutral",
            "PublishDate": 1762486898652,
            "Source": "stock"
        },
        {
            "Title": "Alkyl Amines Chemicals Reports Mixed Q2 Results with Revenue and Profit Decline",
            "Summary": "Alkyl Amines Chemicals reported quarterly revenue of 3.9 billion rupees, down from 4.1 billion rupees in the same period last year. The company's net profit decreased to 430 million rupees from 474 million rupees year-over-year. However, EBITDA margin improved to 18.03% from 17.72% despite EBITDA declining to 702 million rupees from 735 million rupees compared to the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762242929018,
            "Source": "earnings"
        },
        {
            "Title": "Alkyl Amines Chemicals Reports Mixed Q1 Results with Revenue Growth but Lower EBITDA",
            "Summary": "Alkyl Amines Chemicals reported Q1 revenue of 4.05 billion rupees compared to 4 billion rupees in the same period last year. The company's net profit increased to 494 million rupees from 489 million rupees year-over-year. However, EBITDA declined to 765 million rupees from 791 million rupees, with EBITDA margin contracting to 18.9% from 19.79% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1755156535600,
            "Source": "earnings"
        },
        {
            "Title": "Alkyl Amines Chemicals Ltd: Q4 Profit Up 18%, Announces Dividend",
            "Summary": "Alkyl Amines Chemicals Ltd reported an 18% YoY increase in Q4 net profit to ₹46 crore. Revenue rose 8% YoY to ₹386 crore. EBITDA grew 2% to ₹68 crore, with margins declining 170 bps to 17.6%. The company recommended a final dividend of ₹10 per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746783959000,
            "Source": "earnings"
        },
        {
            "Title": "Alkyl Amines Chemicals Announces Dividend",
            "Summary": "Alkyl Amines Chemicals has declared a dividend of 10 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1746781776000,
            "Source": "default"
        },
        {
            "Title": "Alkyl Amines Chemicals Q4 Financial Results",
            "Summary": "Alkyl Amines Chemicals reported its Q4 financial results. Revenue increased to 3.86 billion rupees from 3.56 billion rupees year-over-year. EBITDA remained relatively stable at 682 million rupees compared to 684 million rupees in the previous year. However, the EBITDA margin decreased to 17.67% from 19.16%. Net profit rose to 460 million rupees from 384 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1746781449000,
            "Source": "result"
        },
        {
            "Title": "Alkyl Amines: Chemical Sector Challenges Amidst Declining Performance",
            "Summary": "Alkyl Amines faces declining sales, profitability, and volume growth. Challenges include sectoral headwinds, Chinese competition, and raw material price fluctuations. The company aims to stabilize margins at 20-22%, diversify product mix, and explore inorganic growth opportunities. Anti-dumping duties on acetonitrile imports could potentially improve margins from H2 FY26.",
            "Sentiment": "negative",
            "PublishDate": 1746070817000,
            "Source": "normal_news"
        },
        {
            "Title": "Alkyl Amines to Consider Q4 Results on May 9",
            "Summary": "Alkyl Amines Chemicals Limited has announced that it will consider its fourth quarter (Q4) financial results on May 9. This indicates the company is preparing to release its earnings report for the latest fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1744893140000,
            "Source": "default"
        },
        {
            "Title": "Anti-Dumping Investigation on Acetonitrile Imports from China, Russia, and Taiwan",
            "Summary": "The government has initiated an anti-dumping investigation concerning imports of acetonitrile originating from or exported by China PR, Russia, and Taiwan. This investigation affects Alkyl Amines Chemicals, likely a domestic producer of acetonitrile.",
            "Sentiment": "neutral",
            "PublishDate": 1742871825000,
            "Source": "corporate_action"
        },
        {
            "Title": "Alkyl Amines Chemicals Reports Q3 Profit and Revenue Growth",
            "Summary": "Alkyl Amines Chemicals has reported a significant increase in both profit and revenue for the third quarter. The company's net profit rose to 438 million rupees, up from 334 million rupees in the same period last year. Revenue also saw growth, reaching 3.7 billion rupees compared to 3.22 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737936826000,
            "Source": "earnings"
        },
        {
            "Title": "Alkyl Amines Chemicals: Q3 Profit Rises 30.9% YoY Despite Revenue Dip",
            "Summary": "Alkyl Amines Chemicals reported Q3 FY25 results with profit up 30.9% YoY to ₹43.76 crore, despite a 10.53% QoQ revenue decline to ₹371.2 crore. EPS increased 30.93% YoY to ₹8.55. Analysts have mixed views, with the consensus recommendation being 'Sell'.",
            "Sentiment": "neutral",
            "PublishDate": 1737786071000,
            "Source": "earnings"
        },
        {
            "Title": "Alkyl Amines Chemicals Reports Improved Q3 EBITDA and Margin",
            "Summary": "Alkyl Amines Chemicals has reported an increase in its Q3 EBITDA to 709 million rupees, up from 596 million rupees in the same quarter last year. The company's EBITDA margin also improved, rising to 19.11% from 18.51% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1737726842000,
            "Source": "earnings"
        },
        {
            "Title": "Alkyl Amines Chemicals Reports Q3 Profit and Revenue Growth",
            "Summary": "Alkyl Amines Chemicals has reported a significant increase in both profit and revenue for the third quarter. The company's net profit rose to 438 million rupees, up from 334 million rupees in the same period last year. Revenue also saw growth, reaching 3.7 billion rupees compared to 3.22 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1737726835000,
            "Source": "earnings"
        },
        {
            "Title": "Alkyl Amines Chemicals to Consider Q3 Results on January 24",
            "Summary": "Alkyl Amines Chemicals Limited has announced that it will consider its financial results for the third quarter on January 24. This indicates the company is preparing to release its quarterly earnings report, which is a standard practice for publicly traded companies.",
            "Sentiment": "neutral",
            "PublishDate": 1736516415000,
            "Source": "earnings"
        },
        {
            "Title": "Anti-Dumping Investigation Initiated on Chinese MIPA Imports",
            "Summary": "An anti-dumping investigation has been initiated concerning the imports of Monoisopropylamine (MIPA) originating from or exported by China PR. This investigation affects Alkyl Amines, a company likely involved in the production or trade of MIPA.",
            "Sentiment": "neutral",
            "PublishDate": 1735702878000,
            "Source": "corporate_action"
        },
        {
            "Title": "Alkyl Amines Chemicals to Set Up New Plant at Dahej",
            "Summary": "Alkyl Amines Chemicals has approved the establishment of a new plant at its Dahej facilities. The plant will add a new product with an annual capacity of 3,000 to 4,000 metric tons. The investment required for this expansion is estimated to be between 1.15 billion to 1.50 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1730794642000,
            "Source": "corporate_action"
        },
        {
            "Title": "Alkyl Amines Chemicals Reports Strong Q2 Performance",
            "Summary": "Alkyl Amines Chemicals has reported significant year-over-year improvements in its Q2 financial results. The company's EBITDA increased to 730.3 million rupees from 500.1 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 17.67% from 13.92% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730794482000,
            "Source": "result"
        },
        {
            "Title": "Alkyl Amines Chemicals Reports Q2 Revenue Growth",
            "Summary": "Alkyl Amines Chemicals has reported a revenue of 4.1 billion rupees for the second quarter, compared to 3.52 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730794411000,
            "Source": "result"
        },
        {
            "Title": "Alkyl Amines Chemicals Reports Significant Profit Increase in Q2",
            "Summary": "Alkyl Amines Chemicals has reported a net profit of 474 million rupees for the second quarter, compared to 270.2 million rupees in the same period last year, representing a substantial year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730794388000,
            "Source": "result"
        },
        {
            "Title": "Alkyl Amines Chemicals Schedules Q2 Results Board Meeting",
            "Summary": "<p><span class='neutral'>Alkyl Amines Chemicals</span> has announced a <b>board meeting</b> on <span class='neutral'>November 5</span> to <span class='neutral'>consider and approve</span> the company's <b>financial results</b> for the <span class='neutral'>second quarter</span> of the current fiscal year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728467028000,
            "Source": "corporate_action"
        }
    ]
}