{
    "Symbol": "ALLCARGO",
    "ISIN": "INE418H01029",
    "News": [
        {
            "Title": "Allcargo Logistics Q3FY26 QIP Monitoring Report Filed",
            "Summary": "Allcargo Logistics submitted its Q3FY26 monitoring agency report showing ₹100.50 crore utilized from ₹161.12 crore QIP proceeds, with ₹60.62 crore remaining unutilized and deployed in fixed deposits.",
            "Sentiment": "neutral",
            "PublishDate": 1770358155084,
            "Source": "co_actions_results"
        },
        {
            "Title": "Allcargo Logistics Q3FY26 Earnings Call on Feb 6",
            "Summary": "Allcargo Logistics schedules earnings conference call for February 6, 2026 at 3:30 PM IST to discuss Q3FY26 financial performance for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769752843166,
            "Source": "co_actions_results"
        },
        {
            "Title": "Allcargo Logistics Senior Sales Head Resigns",
            "Summary": "Mayank Dwivedi, National Head – Sales and Marketing at Allcargo Logistics Limited, has resigned from his position effective January 29, 2026, citing personal reasons for his departure.",
            "Sentiment": "neutral",
            "PublishDate": 1769684202754,
            "Source": "stocks"
        },
        {
            "Title": "Mukul Agrawal Acquires 2.94% Stake in Allcargo Logistics",
            "Summary": "Ace investor Mukul Agrawal purchased 4.41 crore shares worth Rs. 40.4 crore in Allcargo Logistics Limited during Q3 FY26, acquiring a 2.94% stake in the integrated logistics provider.",
            "Sentiment": "positive",
            "PublishDate": 1769494690372,
            "Source": "co_actions_results"
        },
        {
            "Title": "Allcargo Logistics Gets CRISIL Rating Downgrade",
            "Summary": "CRISIL downgrades Allcargo Logistics' ratings to 'A/Negative' from 'AA-' and withdraws ratings on ₹508 crore facilities transferred to Allcargo Global post-demerger. Downgrade reflects subdued operating performance.",
            "Sentiment": "negative",
            "PublishDate": 1769164387443,
            "Source": "co_actions_results"
        },
        {
            "Title": "Allcargo Logistics Faces ₹50L CCI Penalty",
            "Summary": "Competition Commission of India imposes ₹50 lakh penalty on Allcargo Logistics under Section 43A for alleged non-compliance in Gati acquisition. Company examining order for legal recourse.",
            "Sentiment": "negative",
            "PublishDate": 1768032388174,
            "Source": "stocks"
        },
        {
            "Title": "Allcargo Logistics Board Meet Set for Feb 5, 2026",
            "Summary": "Allcargo Logistics has scheduled its board meeting for February 5, 2026, to consider and approve Q3FY26 unaudited standalone and consolidated financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767597994771,
            "Source": "co_actions_results"
        },
        {
            "Title": "Delhi HC restrains VRS from using Allcargo mark",
            "Summary": "Delhi High Court grants interim relief to Allcargo Logistics, restraining VRS All Cargo from using deceptively similar trademarks in logistics services dispute.",
            "Sentiment": "positive",
            "PublishDate": 1767033159377,
            "Source": "stocks"
        },
        {
            "Title": "Allcargo Logistics Expands to Cover 100% PIN Codes",
            "Summary": "Allcargo Logistics launches Allcargo Extended Reach (AER) network, expanding coverage from 21,000 to over 32,000 PIN codes and doubling direct serviceable locations to over 10,000.",
            "Sentiment": "positive",
            "PublishDate": 1766133076367,
            "Source": "stocks"
        },
        {
            "Title": "Allcargo Logistics Seeks Shareholder Approval for Ketan Kulkarni's Appointment as MD & CEO",
            "Summary": "Allcargo Logistics has issued a postal ballot notice seeking member approval for appointing Ketan Nishikant Kulkarni as Director and Managing Director & CEO for a 5-year term from November 1, 2025 to October 31, 2030. The appointment follows Adarsh Hegde ceasing to be MD effective November 1, 2025 due to a composite scheme of arrangement, with voting scheduled from December 9, 2025 to January 7, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1765209145411,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Logistics Provides Cost Allocation Guidance Following Demerger Scheme Approval",
            "Summary": "Allcargo Logistics issued guidance to shareholders on calculating cost of acquisition for equity shares following the National Company Law Tribunal's approval of its composite scheme of arrangement on October 10, 2025. The demerger allocates 87.94% of acquisition cost to Allcargo Logistics and 12.06% to the resulting company Allcargo Global Limited, based on net book values of ₹1,24,220 lakhs and ₹14,978 lakhs respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1764245571493,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Logistics Reports Turnaround to INR 9 Crore Profit After Restructuring Completion",
            "Summary": "Allcargo Logistics achieved a profit before tax of INR 9 crores in Q2 FY26 compared to losses in previous quarters, following completion of its composite scheme that merged Express and Consultative Logistics businesses while demerging international operations into Allcargo Global. The company reported 11% revenue growth to INR 537 crores with 27% EBITDA increase to INR 62 crores, driven by record quarterly performance in both Express and Consultative Logistics segments.",
            "Sentiment": "positive",
            "PublishDate": 1763723823935,
            "Source": "earnings"
        },
        {
            "Title": "Allcargo Logistics Reports 11% H1 Revenue Growth Following Domestic Supply Chain Merger",
            "Summary": "Allcargo Logistics announced 11% H1 revenue growth exceeding ₹1,000 crore following NCLT approval of its restructuring plan that merged domestic supply chain operations and demerged international business. The company appointed Ketan Kulkarni as MD & CEO and Deepak Pareek as CFO, with quarterly revenue rising 9%, EBITDA up 23%, and PBT surging 88% sequentially.",
            "Sentiment": "positive",
            "PublishDate": 1763223118065,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Logistics Reports Q2 Net Loss of 40M Rupees Despite Revenue Growth",
            "Summary": "Allcargo Logistics swung to a consolidated net loss of 40 million rupees in Q2 compared to a profit of 170 million rupees in the same quarter last year. The company's revenue increased to 5.4 billion rupees from 4.8 billion rupees year-over-year, showing growth despite profitability challenges.",
            "Sentiment": "negative",
            "PublishDate": 1763207223457,
            "Source": "earnings"
        },
        {
            "Title": "Allcargo Logistics Submits QIP Monitoring Report Post-Merger with Allcargo Gati",
            "Summary": "Allcargo Logistics submitted a monitoring agency report for proceeds raised through Qualified Institutions Placement worth Rs 161.12 crore, following the merger with Allcargo Gati Limited which ceased to exist as a separate entity effective November 1, 2025. ICRA Limited reported no deviation from stated objectives, with Rs 100.50 crore utilized and Rs 60.62 crore remaining unutilized from the original issue size of Rs 169.28 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1763191228260,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Logistics Schedules Earnings Conference Call for Quarter and Half-Year Results",
            "Summary": "Allcargo Logistics Limited has announced an earnings conference call to discuss its financial performance for the quarter and half-year ended September 30, 2025. The call is scheduled for Monday, November 17, 2025, at 3:30 p.m. IST. The company representatives include MD & CEO Ketan Kulkarni, Director Strategy and Group CFO Ravi Jakhar, Chief Financial Officer Deepak Pareek, and Investor Relations head Sanjay Punjabi. The company has provided various access numbers for participants including universal access and international toll-free numbers for multiple countries including Canada, Hong Kong, Japan, Singapore, UK, and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1762956531932,
            "Source": "earnings"
        },
        {
            "Title": "Allcargo Logistics Demerger Record Date Set for November 12, Creates Two Independent Entities",
            "Summary": "Allcargo Logistics has set November 12 as the record date for its demerger of the international supply chain business into Allcargo Global, revised from the earlier date of November 10. Shareholders will receive one share of Allcargo Global for every share held in Allcargo Logistics under a 1:1 ratio. The demerger became effective November 1 following NCLT order filing. As part of the restructuring, Allcargo Gati has been dissolved and amalgamated with Allcargo Logistics, leading to suspension of Gati's share trading and upcoming delisting. The arrangement creates two focused entities: Allcargo Global will handle international supply chain operations across 180+ countries including freight forwarding and logistics, while Allcargo Logistics will focus on domestic express distribution, supply chain management, and logistics infrastructure. The separation aims to streamline operations and unlock shareholder value through independent growth strategies.",
            "Sentiment": "positive",
            "PublishDate": 1762939450694,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Logistics Completes Composite Scheme of Arrangement, Allcargo Gati Dissolved",
            "Summary": "Allcargo Logistics Limited has made effective a Composite Scheme of Arrangement involving multiple entities including Allcargo Supply Chain Private Limited, Gati Express Supply Chain Private Limited, Allcargo Gati Limited, and Allcargo Global Limited. The scheme became effective on November 1, 2025, after filing certified copies of NCLT orders with the Registrar of Companies. Under the arrangement, Allcargo Gati Limited has been dissolved without winding up and amalgamated with Allcargo Logistics. Trading in Allcargo Gati Limited's equity shares will remain suspended and the shares will be de-listed from BSE and NSE following exchange intimations.",
            "Sentiment": "neutral",
            "PublishDate": 1761984108907,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Logistics Revises Record Date to November 12 for Composite Scheme of Arrangement",
            "Summary": "Allcargo Logistics Limited has revised the record date from November 10, 2025 to November 12, 2025 for its Composite Scheme of Arrangement sanctioned by the National Company Law Tribunal, Mumbai Bench. The revised record date will determine shareholders of Allcargo Logistics Limited eligible to receive fully paid-up equity shares of Allcargo Global Limited in a 1:1 ratio (one equity share of ₹2 each of Allcargo Global Limited for every one equity share of ₹2 each held in Allcargo Logistics Limited). Additionally, it will determine shareholders of Allcargo Gati Limited who shall be entitled to receive equity shares of Allcargo Logistics Limited. All other terms and conditions from the previous intimation remain unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1761915690606,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Logistics Sets November 1 as Effective Date for Composite Scheme of Arrangement",
            "Summary": "Allcargo Logistics Limited announced that its Board of Directors has approved November 1, 2025 as the effective date for its Composite Scheme of Arrangement, following sanction by the National Company Law Tribunal, Mumbai Bench on October 10, 2025. The company has set November 10, 2025 as the record date to determine shareholders of Allcargo Gati Limited who will be entitled to receive equity shares under the scheme arrangement.",
            "Sentiment": "neutral",
            "PublishDate": 1761851701764,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Logistics Reports Mixed September 2025 Performance with LCL Volume Decline and Air Freight Growth",
            "Summary": "Allcargo Logistics shared its September 2025 operational update showing mixed results across business segments. LCL operations recorded 717,000 cubic meters in volume, declining 4% month-on-month and 6% year-on-year, with global market uncertainty attributed to trade policy changes. The company noted a shift in global trade patterns, with Asia to North America trade declining while Asia to Europe, Middle East and Latin America showing increases. FCL operations remained stable at 53,921 TEUs, flat compared to both last month and last year. Air operations showed positive momentum with 3,012 tonnes in volume, representing 14% growth over last year and 1% growth over last month. Container utilization declined in line with volume reductions, while 40 feet container ratio remained unchanged from previous periods.",
            "Sentiment": "neutral",
            "PublishDate": 1761562928161,
            "Source": "stock"
        },
        {
            "Title": "Allcargo Terminals Reports 18% Year-Over-Year Growth in CFS Volumes",
            "Summary": "Allcargo Terminals reported CFS volumes of 59.7 thousand TEUs in September 2025, representing an 18% increase compared to the same period last year. The volumes also showed a 5% month-over-month increase from August 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760593060382,
            "Source": "stock"
        },
        {
            "Title": "Allcargo Logistics Gets NCLT Approval for Business Restructuring into Two Listed Entities",
            "Summary": "Allcargo Logistics Limited received approval from the National Company Law Tribunal Mumbai Bench for its Composite Scheme of Arrangement. The restructuring will demerge the International Supply Chain business into a new listed entity called Allcargo Global Limited, while the domestic express and contract logistics business will be consolidated under Allcargo Logistics Limited. Shareholders of Allcargo Logistics will receive shares in both entities on a 1:1 basis, while Allcargo Gati shareholders will get 63 shares of Allcargo Logistics for every 10 shares held. The company will now file the sanctioned scheme with the Registrar of Companies and proceed with implementation including determining record dates and share allotment. Post-restructuring, the Allcargo Group will have four listed strategic business units operating independently with dedicated management oversight and clearer strategic focus.",
            "Sentiment": "positive",
            "PublishDate": 1760346437717,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLT Sanctions Composite Scheme of Arrangement for Allcargo Logistics and Subsidiaries",
            "Summary": "The National Company Law Tribunal Mumbai Bench has sanctioned a Composite Scheme of Arrangement involving Allcargo Logistics Limited and its subsidiaries on October 10, 2025. The scheme involves multiple entities including Allcargo Supply Chain Private Limited (wholly owned subsidiary), Gati Express & Supply Chain Private Limited, Allcargo Gati Limited, and Allcargo Global Limited (wholly owned subsidiary). The arrangement includes mergers, demergers, and restructuring under Sections 230 to 232 of the Companies Act, 2013. Allcargo Logistics is awaiting the certified copy of the order along with the sanctioned scheme from NCLT, which will be uploaded on the company's website once available.",
            "Sentiment": "positive",
            "PublishDate": 1760167219413,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Logistics Subsidiary Files Criminal Complaint Against CEO and Customer Over Rs 10 Crore Liability Dispute",
            "Summary": "ALX Shipping Agencies India Private Limited, a wholly owned subsidiary of Allcargo Logistics Limited, filed a complaint with the Economic Offences Wing, Mumbai against its CEO Sandeep Bakshi and Vishal Mehta, owner of customer Rushabh Sealink and Logistics Pvt. Ltd. The complaint alleges criminal conspiracy involving unauthorized agreements that created a Rs 10 crore liability for ALX related to freight advances paid to shipping lines. ALX's internal investigation revealed irregularities where the accused allegedly colluded to make ALX liable for payments to Rushabh without proper authority. The case involves cross-complaints, as Vishal Mehta has also filed complaints against multiple entities including ALX. Allcargo Logistics stated there is no impact on the company's financial, operational or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1759506273577,
            "Source": "stock"
        },
        {
            "Title": "Rs 325 Crore Shipping Fraud Surfaces in Mumbai Involving Multiple Logistics Companies",
            "Summary": "A fraud exceeding Rs 325 crore has emerged in Mumbai's shipping and logistics sector. Vishal Mehta, director of Rushabh Sealink & Logistics Pvt. Ltd., filed a complaint with Mumbai Police's Economic Offences Wing naming ALX Shipping Agencies India Pvt. Ltd. (subsidiary of Allcargo Logistics Ltd.), Dubai-based Aladdin Express DMCC, and OEL Express India Pvt. Ltd. The companies allegedly offered shipping investments with assured profits but later siphoned money through dubious contracts. Two vessels were central to the case: Leela Mombasa, carrying Rs 130 crore worth of cargo, was diverted to Oman and delayed by nearly two weeks, while XXH-2 was diverted from Jeddah to Karachi and held for 10 days. Mehta was allegedly extorted for $1 million for ship operations. Security cheques from ALX Shipping Agencies and OEL Express bounced due to insufficient funds and signature mismatch. Over Rs 290 crore worth of cargo remains stuck, causing heavy losses to exporters. The complaint names several individuals including Sandeep Bakshi, Ravi Jakhar, Vikas Khan, Ali Khan, Wing Kit Tsoi, Abdullah, and Mohammad Rizwan Shaikh.",
            "Sentiment": "negative",
            "PublishDate": 1759330638115,
            "Source": "stock"
        },
        {
            "Title": "Allcargo Logistics Presents Analyst Day 2025 Strategy and Growth Targets",
            "Summary": "Allcargo Logistics submitted an investor presentation for Analyst Day 2025 outlining strategic initiatives and financial aspirations. The company operates as the world's number 1 LCL consolidator with 14% market share across 180 countries with 375 offices. Key growth initiatives include expanding into new markets like eastern Europe, Latin America, and Africa, launching 20+ new trade lanes in the US and LATAM, and developing AI-enabled digital platforms. The company targets significant volume growth by FY30: LCL volume from 8.9 million cbm to 11 million cbm, FCL volume from 640k TEUs to 1000k TEUs, and air volume from 34k tons to 60k tons. Financial aspirations include growing gross profit from Rs 2,750 crores in FY25 to Rs 3,900 crores by FY30, while increasing EBITDA from Rs 327 crores to Rs 800 crores. The company is implementing AI automation tools, establishing global shared service centers, and focusing on operating leverage to drive profitability. ESG commitments include achieving 100% carbon neutrality by 2040 and maintaining zero regulatory non-compliance.",
            "Sentiment": "positive",
            "PublishDate": 1758800013818,
            "Source": "stock"
        },
        {
            "Title": "NCLT Reserves Order on Allcargo Logistics' Composite Scheme of Arrangement",
            "Summary": "The National Company Law Tribunal (NCLT) has reserved its order on the Composite Scheme of Arrangement involving Allcargo Logistics Limited and its subsidiaries after a hearing held on September 24, 2025. The scheme involves multiple entities including Allcargo Supply Chain Private Limited, Gati Express & Supply Chain Private Limited, Allcargo Gati Limited, and Allcargo Global Limited along with their respective shareholders. The arrangement is being processed under Sections 230 to 232 of the Companies Act, 2013.",
            "Sentiment": "neutral",
            "PublishDate": 1758720777405,
            "Source": "corporate_action"
        },
        {
            "Title": "ECU Worldwide Launches AI-Powered iTopaz Platform to Replace Legacy ERP System",
            "Summary": "ECU Worldwide, a subsidiary of Allcargo Logistics, announced the rollout of iTopaz, an AI-powered digital platform for global supply chains. The company is partnering with IBM Consulting, Tata Consultancy Services, and Amazon Web Services for the implementation, which will be completed by 2027. iTopaz will replace the company's decade-old desktop-based Topaz ERP system with a cloud-enabled, web-based architecture using open-source databases. The platform features a three-tier architecture and containerized environment for platform independence. Allcargo Group previously moved three on-premise data centers to the cloud and has been incorporating AI tools into business processes over the past 18 months. The company aims to optimize global supply chains using AI, IoT, predictive analytics, and blockchain technologies.",
            "Sentiment": "positive",
            "PublishDate": 1756790316981,
            "Source": "stock"
        },
        {
            "Title": "Allcargo Logistics Reports Strong Growth Across Business Segments in July",
            "Summary": "Allcargo Logistics reported its July business update showing growth across key segments. LCL (Less than Container Load) operations increased 10% month-on-month, while FCL (Full Container Load) services grew 9% year-on-year. The company's air cargo segment demonstrated significant expansion with a 46% year-on-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1756378536487,
            "Source": "stock"
        },
        {
            "Title": "Allcargo Logistics NCLT Hearing for Composite Scheme Rescheduled to September 24, 2025",
            "Summary": "Allcargo Logistics Limited announced that the NCLT hearing for their Composite Scheme of Arrangement has been rescheduled from August 13, 2025 to September 24, 2025 due to time constraints. The scheme involves restructuring and transfers among multiple entities including Allcargo Logistics Limited, Allcargo Supply Chain Private Limited, Gati Express & Supply Chain Private Limited, Allcargo Gati Limited, and Allcargo Global Limited along with their respective shareholders. The arrangement is being processed under Sections 230 to 232 of the Companies Act, 2013.",
            "Sentiment": "neutral",
            "PublishDate": 1755165549749,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Logistics Expects 8-10% Volume Growth in July-September Quarter",
            "Summary": "Allcargo Logistics anticipates seasonal improvement in global trade with festive demand driving 8-10% higher international volumes quarter-on-quarter in the July-September period. The company posted revenue of ₹3,816 crore and a loss of ₹98.9 crore with 2.7% margins in the April-June 2025 period. On the domestic front, contract logistics business reported 50% revenue increase year-on-year and 30% EBITDA growth year-on-year. Express logistics showed 18% EBITDA rise over the last quarter following management reshuffle. CFO Ravi Jakhar sees potential for 6-8% annual volume growth long-term, contingent on trade conditions normalizing, though geopolitical tensions and tariff disputes remain challenges. The company's market capitalization stands at ₹3,323.77 crore with stock trading at ₹33.80, down 44% over the last year.",
            "Sentiment": "positive",
            "PublishDate": 1755070066626,
            "Source": "stock"
        },
        {
            "Title": "Allcargo Logistics Focuses on E-Commerce and Automotive Growth While Expecting Forex Recovery",
            "Summary": "Allcargo Logistics is concentrating on growth in e-commerce, automotive, and chemicals sectors. The company is expanding its contract logistics operations and implementing technology solutions to improve efficiency and enhance long-term margins. The company expects to recover from forex losses as global demand remains strong.",
            "Sentiment": "positive",
            "PublishDate": 1755015968600,
            "Source": "stock"
        },
        {
            "Title": "Allcargo Logistics Reports Sharp Decline in Q1 Profitability Despite Revenue Growth",
            "Summary": "Allcargo Logistics reported mixed Q1 results with revenue increasing to 38 billion rupees from 37.6 billion rupees year-over-year. However, the company's profitability deteriorated significantly, with EBITDA falling to 204 million rupees from 1.3 billion rupees in the same period last year. EBITDA margin compressed to 0.54% from 3.51% year-over-year. The company swung to a consolidated net loss of 995 million rupees compared to a profit of 37 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1755009851711,
            "Source": "earnings"
        },
        {
            "Title": "Allcargo Logistics Acquires Full Ownership of Ecu-Line Saudi Arabia for ₹22 Crore",
            "Summary": "Allcargo Logistics has acquired complete ownership of Ecu-Line Saudi Arabia LLC through a buyout transaction valued at ₹22 crore. This acquisition gives the company full control of its Saudi Arabian operations.",
            "Sentiment": "positive",
            "PublishDate": 1754490804562,
            "Source": "order&deals"
        },
        {
            "Title": "Allcargo Logistics Schedules Board Meeting on August 12 to Approve Quarterly Financial Results",
            "Summary": "Allcargo Logistics Limited has scheduled a Board of Directors meeting for August 12, 2025, at 4:30 p.m. to consider and approve unaudited financial results for the quarter ended June 30, 2025. The results will include both standalone and consolidated financials. The trading window for company securities will reopen 48 hours after the declaration of the financial results for all designated persons and connected individuals covered under the company's insider trading code.",
            "Sentiment": "neutral",
            "PublishDate": 1754479715920,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Logistics Reports 3% Drop in LCL Volume Amid Weak Macroeconomic Conditions",
            "Summary": "Allcargo Logistics experienced a 3% decrease in Less than Container Load (LCL) volume in June compared to May. The company attributed this decline to weak macroeconomic conditions during June but expects recovery in July.",
            "Sentiment": "negative",
            "PublishDate": 1753268849441,
            "Source": "stock"
        },
        {
            "Title": "Allcargo Logistics Dissolves Three Foreign Subsidiaries",
            "Summary": "Allcargo Logistics has dissolved three of its foreign subsidiaries. No additional details about the specific subsidiaries, reasons for dissolution, or financial impact were provided.",
            "Sentiment": "neutral",
            "PublishDate": 1752850626350,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Logistics Reports Growth in Container Load and Air Freight",
            "Summary": "Allcargo Logistics has reported growth despite ongoing political instability. The company experienced a 6.3% year-over-year increase in Full Container Load and a 4.4% year-over-year rise in Air Freight.",
            "Sentiment": "positive",
            "PublishDate": 1750744254000,
            "Source": "default"
        },
        {
            "Title": "Allcargo Logistics: Mixed Performance in May Amid Trade Volatility",
            "Summary": "Allcargo Logistics reported a 3% month-on-month increase in LCL volumes to 728,000 cubic metres, but a 4% year-on-year decline. FCL volumes remained flat sequentially at 56,684 TEUs, with 6% year-on-year growth. Air freight volumes rose 12% month-on-month and 4% year-on-year to 3.06 million kilos. The company expressed cautious optimism despite demand volatility.",
            "Sentiment": "neutral",
            "PublishDate": 1750682029000,
            "Source": "result"
        },
        {
            "Title": "Allcargo Logistics Dissolves Jordan Gulf Subsidiary",
            "Summary": "Allcargo Logistics has announced that its subsidiary, Jordan Gulf for Freight Services, will be dissolved effective May 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1747402775000,
            "Source": "default"
        },
        {
            "Title": "Allcargo Logistics Reports Increase in LCL Volume for March 2025",
            "Summary": "Allcargo International Supply Chain (ISC) reported a monthly operational update for March 2025. The Less than Container Load (LCL) volume stood at 724,000 cubic meters, showing an increase from 604,000 cubic meters in February 2025. However, it's slightly lower than the 739,000 cubic meters recorded in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1745799374000,
            "Source": "default"
        },
        {
            "Title": "AllCargo Logistics Reports Increase in LCL Volume for March 2025",
            "Summary": "AllCargo International Supply Chain (ISC) has reported its monthly operational update for March 2025. The Less than Container Load (LCL) volume stood at 724,000 cubic meters, showing an increase from 604,000 cubic meters in February 2025. However, it's slightly lower than the 739,000 cubic meters recorded in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1745591502000,
            "Source": "default"
        },
        {
            "Title": "Allcargo Logistics Establishes New Subsidiary in Turkey",
            "Summary": "Allcargo Logistics has incorporated a new step-down wholly owned subsidiary in Turkey. This strategic move expands the company's international presence and operational capabilities in the Turkish market.",
            "Sentiment": "positive",
            "PublishDate": 1744121440000,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Logistics Subsidiary Acquires 5% Stake in Allcargo ULS",
            "Summary": "A subsidiary of Allcargo Logistics has acquired a 5% stake in Allcargo ULS for 500 million Korean Won. This acquisition represents a strategic investment by the company in its South Korean operations.",
            "Sentiment": "neutral",
            "PublishDate": 1743684587000,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Logistics' Subsidiary Acquires Additional Stake in ECU Worldwide Japan",
            "Summary": "Allcargo Logistics announced that its subsidiary, Ecuhold N.V., has acquired an additional 10% stake in ECU Worldwide Japan. The cost of this acquisition is reported to be $220,000.",
            "Sentiment": "positive",
            "PublishDate": 1743639065000,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Logistics Subsidiary Acquires Additional Stake in ECU Worldwide Japan",
            "Summary": "Allcargo Logistics has announced that its subsidiary, ECUHold N.V., has acquired an additional 10% stake in ECU Worldwide Japan. The cost of this acquisition is reported to be $220,000.",
            "Sentiment": "positive",
            "PublishDate": 1743601708000,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Logistics Reports Decrease in LCL Volume for February 2025",
            "Summary": "Allcargo Logistics reported a decrease in Less than Container Load (LCL) volume for February 2025. The volume stood at 604,000 cubic meters, down from 679,000 cubic meters in February 2024 and 741,000 cubic meters in January 2025. This represents a year-over-year decrease of approximately 11% and a month-over-month decrease of about 18.5%.",
            "Sentiment": "negative",
            "PublishDate": 1742516440000,
            "Source": "result"
        },
        {
            "Title": "Allcargo Logistics Reports Decrease in LCL Volume for February 2025",
            "Summary": "Allcargo Logistics reported a decrease in Less than Container Load (LCL) volume for February 2025. The company's LCL volume stood at 604,000 cubic meters, down from 679,000 cubic meters in February 2024 and 741,000 cubic meters in January 2025.",
            "Sentiment": "negative",
            "PublishDate": 1742472749000,
            "Source": "result"
        },
        {
            "Title": "Allcargo Logistics Subsidiary Flamingo Line Del Ecuador Liquidated",
            "Summary": "Allcargo Logistics has announced that its subsidiary, Flamingo Line Del Ecuador, has been liquidated. This development suggests a strategic restructuring or divestment within the company's international operations.",
            "Sentiment": "neutral",
            "PublishDate": 1742297680000,
            "Source": "corporate_action"
        }
    ]
}