{
    "Symbol": "ALLDIGI",
    "ISIN": "INE835G01018",
    "News": [
        {
            "Title": "Alldigi Tech Declares INR 30 Interim Dividend",
            "Summary": "Alldigi Tech announces second interim dividend of INR 30 per share with face value of INR 10 each, demonstrating strong financial performance and commitment to shareholder returns.",
            "Sentiment": "positive",
            "PublishDate": 1769530774373,
            "Source": "co_actions_results"
        },
        {
            "Title": "Alldigi Tech Board Meet on Jan 27 for Q3 Results",
            "Summary": "Alldigi Tech Limited has scheduled a board meeting on January 27, 2026, to consider Q3FY26 financial results and potential interim dividend declaration for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1769001105099,
            "Source": "co_actions_results"
        },
        {
            "Title": "Alldigi Tech receives ₹18.61 cr GST assessment order",
            "Summary": "Alldigi Tech Limited received GST assessment order for ₹9.31 crores with equal penalty for April 2018-March 2023 period. Company plans to appeal the demand related to Input Tax Credit issues.",
            "Sentiment": "negative",
            "PublishDate": 1767198617802,
            "Source": "stocks"
        },
        {
            "Title": "Alldigi Tech CEO Naozer Dalal to Retire on Dec 31",
            "Summary": "Alldigi Tech Limited announces superannuation of Chief Executive Officer Mr. Naozer Dalal effective December 31, 2025, with succession planning underway.",
            "Sentiment": "neutral",
            "PublishDate": 1765975598265,
            "Source": "stocks"
        },
        {
            "Title": "AlldigiTech Reports 12% Revenue Growth in Q2 FY26, Achieves 10th Consecutive Quarter of Strong Performance",
            "Summary": "AlldigiTech Limited reported revenue from operations of INR 147 crores for Q2 FY26, marking 12% year-on-year and 2% quarter-on-quarter growth. For the half-year, revenue reached INR 291 crores, up 12% year-on-year. EBITDA stood at INR 36 crores for the quarter (up 17% year-on-year) and INR 73 crores for H1 (up 17% year-on-year). The company processed 47.6 lakh employee records during the quarter, 10% higher year-on-year. International business share increased from 62% to 64%. The Tech Digital business reported 15% year-on-year growth in Q2, while BPM segment grew 11% year-on-year. The company booked sales ACV of INR 15 crores in H1, twice that of the corresponding period last year. Cash position as of September 30 was INR 137 crores. AlldigiTech received external recognition from Everest PEAK Matrix as a major contender for multi-country payroll services and CXM services. The company successfully completed migration for India-based customers onto the SmartPay4 platform and won ACV of INR 9 crores for SmartHR platform. Management expects to continue growing revenue in mid-to-high teens and aims to add 100-150 basis points to EBITDA margins.",
            "Sentiment": "positive",
            "PublishDate": 1762406879465,
            "Source": "earnings"
        },
        {
            "Title": "Alldigi Tech Projects 15-17% Revenue Growth for FY26, Reports Strong H1 Performance",
            "Summary": "Alldigi Tech projects 15-17% revenue growth for FY26, driven by its Global BPM and Tech-Digital segments. The company reported H1 revenue of ₹291 crores, representing 16.9% year-on-year growth. EBITDA margin stood at 24.9% while profit after tax increased 45.5% year-on-year. The company targets operating margin above 25% for FY27. Alldigi Tech is expanding its AI-driven payroll platform PulseHR.ai and scaling its global delivery capacity to 6,400 seats across India and Manila to achieve double-digit profit growth.",
            "Sentiment": "positive",
            "PublishDate": 1761841932465,
            "Source": "earnings"
        },
        {
            "Title": "AlldigiTech Reports Mixed Q2 Results with Standalone Profit Drop Despite Revenue Growth",
            "Summary": "AlldigiTech Limited reported quarterly results with standalone revenue rising to Rs 87.26 crores from Rs 81.06 crores year-over-year, while consolidated revenue grew to Rs 147.42 crores from Rs 131.43 crores. However, standalone net profit declined to Rs 8.83 crores from Rs 25.64 crores in the same quarter last year. Consolidated net profit increased to Rs 17.62 crores from Rs 12.16 crores. For the six-month period, standalone revenue reached Rs 170.64 crores compared to Rs 159.89 crores, with net profit falling to Rs 44.61 crores from Rs 43.88 crores. Consolidated six-month revenue was Rs 290.75 crores versus Rs 260.75 crores, with net profit declining to Rs 32.81 crores from Rs 44.09 crores. The company operates through Business Process Management and Technology & Digital segments, with BPM contributing Rs 110.48 crores and T&D contributing Rs 36.94 crores in quarterly consolidated revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1761836627009,
            "Source": "earnings"
        },
        {
            "Title": "Alldigi Tech Reports 11.3% Revenue Growth and 17.3% EBITDA Growth in Q1 FY26",
            "Summary": "Alldigi Tech Limited reported quarterly results with revenue reaching ₹143.9 crores, representing 11.3% year-over-year growth and 1.5% quarter-over-quarter growth. EBITDA increased to ₹36.6 crores, up 17.3% year-over-year and 4.0% quarter-over-quarter, with EBITDA margin improving to 25.4%. PAT stood at ₹14.9 crores, showing 53.4% year-over-year decline but 22.8% quarter-over-quarter growth. The company's international revenue mix increased to 66.2% compared to 62.0% in the previous year. Both business segments contributed to growth - BPM segment grew 9% and Tech & Digital segment grew 19%. The company renamed its segments from Customer Experience Management to Business Process Management and Employee Experience Management to Technology & Digital. Employee records processed reached 45.4 lacs, up 12% year-over-year. The board declared an interim dividend of ₹30 per equity share. The company completed SP4 migration for 92% of India customers and added 11 new logos with ACV of ₹9.5 crores.",
            "Sentiment": "positive",
            "PublishDate": 1753905686130,
            "Source": "earnings"
        },
        {
            "Title": "Alldigi Tech Renames Business Segments, Declares INR 30 Interim Dividend",
            "Summary": "Alldigi Tech Limited has restructured its business segments, renaming Customer Experience Management (CXM) to BPM and Employee Experience Management (EXM) to Tech & Digital, effective from Q1 FY26. The changes align with parent company Digitide Solutions Limited's reporting structure and reflect the company's shift toward AI-enabled, tech-driven offerings. HRO Statutory Compliance services have been reclassified from the EXM segment to BPM. The Board declared an interim dividend of INR 30 per equity share for FY2025-26, payable by August 18, 2025 to shareholders on record as of August 8, 2025. For the quarter ended June 30, 2025, consolidated revenue from operations was INR 14,391 lakhs compared to INR 12,932 lakhs in the same quarter last year. Consolidated profit for the period was INR 1,489 lakhs versus INR 3,195 lakhs in the previous year quarter. The company also amended its Code of Practices and Procedures for Fair Disclosure of Unpublished Price Sensitive Information.",
            "Sentiment": "positive",
            "PublishDate": 1753896818410,
            "Source": "corporate_action"
        },
        {
            "Title": "Alldigi Tech Schedules Board Meeting for Q1 FY2025-26 Results and Potential Dividend Declaration",
            "Summary": "Alldigi Tech Limited has scheduled a Board of Directors meeting for July 30, 2025, to consider and approve unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The board will also consider declaring an interim dividend for financial year 2025-26 to equity shareholders. The company has implemented a trading window closure from July 1, 2025, until August 1, 2025, restricting dealings in company securities during this period.",
            "Sentiment": "neutral",
            "PublishDate": 1753361666527,
            "Source": "corporate_action"
        },
        {
            "Title": "ALLDIGI TECH Reports Q4 Financial Results",
            "Summary": "ALLDIGI TECH has released its Q4 financial results. The company reported an EBITDA of 352 million rupees, slightly down from 354 million rupees year-over-year. The EBITDA margin decreased to 24% from 27.3% in the previous year. Consolidated net profit was 193 million rupees, down from 207 million rupees year-over-year. However, revenue increased to 1.46 billion rupees from 1.30 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747275723000,
            "Source": "result"
        },
        {
            "Title": "Alldigi Tech Reports Strong Q3 Financial Results",
            "Summary": "Alldigi Tech has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 199 million rupees, up from 113 million rupees in the same quarter last year. Revenue also saw a notable rise, reaching 1.39 billion rupees compared to 1.2 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1737591161000,
            "Source": "earnings"
        },
        {
            "Title": "Alldigi Tech: Rs 30 Interim Dividend Announced, Record Date Nov 6",
            "Summary": "Alldigi Tech declared an interim dividend of Rs 30 per share for FY 2024-25. The record date is set for November 6, 2024, with payment due by November 18. The company reported a 16.97% increase in Q2 sales but a 25.25% drop in net profit.",
            "Sentiment": "neutral",
            "PublishDate": 1730000007000,
            "Source": "corporate_action"
        },
        {
            "Title": "ALLDIGI TECH Declares Interim Dividend",
            "Summary": "ALLDIGI TECH has announced an interim dividend of 30 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1729781577000,
            "Source": "corporate_action"
        },
        {
            "Title": "AllDigi Tech Reports Improved Q2 EBITDA and Margin",
            "Summary": "AllDigi Tech has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 308 million rupees, up from 254 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 23.45% from 22.61% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729779028000,
            "Source": "result"
        },
        {
            "Title": "AllDigi Tech Reports Q2 Financial Results",
            "Summary": "AllDigi Tech announced its Q2 consolidated net profit of 121 million rupees, down from 162.4 million rupees year-over-year but up from 319.5 million rupees quarter-over-quarter. The company's Q2 revenue increased to 1.3 billion rupees from 1.12 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1729778981000,
            "Source": "result"
        }
    ]
}