{
    "Symbol": "ALLTIME",
    "ISIN": "INE0GV601021",
    "News": [
        {
            "Title": "All Time Plastics Q3FY26 Results: Profit Jumps 7.24%",
            "Summary": "All Time Plastics reported Q3FY26 net profit of ₹917.17 lakhs vs ₹1,200.52 lakhs in Q3FY25. Revenue grew 7.24% to ₹15,938.98 lakhs. Company commenced bamboo products production and invested ₹10 crores in bamboo projects.",
            "Sentiment": "positive",
            "PublishDate": 1770652155220,
            "Source": "co_actions_results"
        },
        {
            "Title": "All Time Plastics Amends Joint Venture Agreement",
            "Summary": "All Time Plastics Limited has amended its joint venture agreement with Dragon Bridge Pte. Limited and All Time Plastics Pte. Limited, allowing direct customer servicing for certain overseas clients.",
            "Sentiment": "neutral",
            "PublishDate": 1770376928875,
            "Source": "stocks"
        },
        {
            "Title": "All Time Plastics Clarifies EU GSP Suspension Impact",
            "Summary": "All Time Plastics explains continued EU suspension of GSP benefits on plastic goods until December 2028, confirming duty rates and prices for EU customers remain unchanged despite the regulatory development.",
            "Sentiment": "neutral",
            "PublishDate": 1769483893467,
            "Source": "stocks"
        },
        {
            "Title": "All Time Plastics Partners with NECBDC for Bamboo",
            "Summary": "All Time Plastics Limited signed MoU with North East Cane and Bamboo Development Council to serve as Product and Market Development Partner for engineered bamboo initiatives in Assam and Nagaland.",
            "Sentiment": "positive",
            "PublishDate": 1769368344694,
            "Source": "co_actions_results"
        },
        {
            "Title": "All Time Plastics Appoints New CHRO Amitrajit Ghosh",
            "Summary": "All Time Plastics Limited announces the appointment of Amitrajit Ghosh as Chief Human Resource Officer effective December 18, 2025, while Manoj Deshmukh ceases to be part of senior management.",
            "Sentiment": "neutral",
            "PublishDate": 1766054874696,
            "Source": "stocks"
        },
        {
            "Title": "All Time Plastics Receives Rs 1.31 Lakh Tax Refund After Revised Income Tax Order",
            "Summary": "All Time Plastics Limited received a revised rectification order from the Income Tax Department for assessment year 2022-23, converting a previous demand of Rs 2.82 crores into a refund of Rs 1.31 lakhs. The company stated there is no material impact on its operations or activities from this tax settlement.",
            "Sentiment": "positive",
            "PublishDate": 1764075581939,
            "Source": "stock"
        },
        {
            "Title": "All Time Plastics Q2 FY26 Results: Revenue Grows 12.5% to INR 147 Crores Despite Margin Pressures",
            "Summary": "All Time Plastics reported Q2 FY26 revenue of INR 147 crores with 12.5% quarterly growth and H1 revenue of INR 305 crores showing 17% growth, though gross margins declined from 39.27% to 36.18% due to customer mix changes and raw material sales. The company expanded capacity to 37,000 metric tons, secured orders from new customers in Australia and Japan, received approval for bamboo product trials from a large customer, and aims to reduce customer concentration while ramping up domestic market share from 17% to 25%.",
            "Sentiment": "neutral",
            "PublishDate": 1763202429540,
            "Source": "earnings"
        },
        {
            "Title": "All Time Plastics Limited Reports IPO and Pre-IPO Proceeds Utilization for Quarter Ended September 30, 2025",
            "Summary": "All Time Plastics Limited submitted its monitoring agency report for the quarter ended September 30, 2025, detailing the utilization of IPO and Pre-IPO proceeds. The company raised Rs 2,800 million through its IPO (August 7-11, 2025) and Rs 700 million through Pre-IPO placement. During the quarter, the company utilized Rs 1,357.51 million for loan repayment and working capital facilities, Rs 49.90 million for equipment and machinery purchases for the Manekpur facility, and Rs 228.91 million for issue expenses. The monitoring report, prepared by Crisil Ratings Limited, indicates no deviation from disclosed objects and confirms all utilization is as per the prospectus. Unutilized proceeds of Rs 1,844.36 million are deployed in fixed deposits with various banks earning returns between 5.25% to 6.16%. The company's promoters are Bhupesh Punamchand Shah, Kailesh Punamchand Shah, and Nilesh Punamchand Shah, and it operates in the Housewares Specialities sector.",
            "Sentiment": "neutral",
            "PublishDate": 1762899186945,
            "Source": "stock"
        },
        {
            "Title": "All Time Plastics Reports Strong Q2 Performance with 4.3x Revenue Growth",
            "Summary": "All Time Plastics Limited announced its quarterly results for the period ended September 30, 2025. The company reported consolidated revenue from operations of ₹14,740.38 lakhs compared to ₹3,376.75 lakhs in the corresponding quarter of the previous year. Net profit increased to ₹4,217.74 lakhs from ₹4,284.65 lakhs in the same period last year. The company completed its Initial Public Offering of 14,570,760 equity shares at ₹275 per share, raising funds for debt repayment, equipment purchase for the Manekpur facility, and general corporate purposes. The equity shares were listed on NSE and BSE on August 14, 2025. During the quarter, the company incorporated All Time Bamboo Private Limited as a wholly owned subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1762821461684,
            "Source": "earnings"
        },
        {
            "Title": "All Time Plastics Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "All Time Plastics reported Q2 revenue of 1.5 billion rupees, up from 1.3 billion rupees in the same period last year. However, the company's consolidated net profit declined to 41 million rupees from 134 million rupees year-over-year. EBITDA fell to 162 million rupees compared to 257 million rupees in the previous year, while EBITDA margin compressed to 10.96% from 19.63% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762788128557,
            "Source": "earnings"
        },
        {
            "Title": "All Time Plastics Expands Production Capacity by 4,000 Metric Tons at Khatalwada Plant",
            "Summary": "All Time Plastics Limited has increased its production capacity by 4,000 metric tons at its Khatalwada Plant in Manekpur, raising the company's total annual capacity from 33,000 to 37,000 metric tonnes. The capacity addition has already been completed with an investment of ₹18.33 crores, financed through internal accruals and debt. The company's existing capacity utilization stands at 83.6%. The expansion aims to meet future customer demands.",
            "Sentiment": "positive",
            "PublishDate": 1758532675524,
            "Source": "stock"
        },
        {
            "Title": "All Time Plastics Reports 21.5% Revenue Growth in Q1 FY26, Plans Major Capacity Expansion",
            "Summary": "All Time Plastics Limited reported revenue growth of 21.5% to Rs 158 crores in Q1 FY26 compared to Rs 130 crores in Q1 FY25. The company's EBITDA increased 15.6% to Rs 29.4 crores, while PAT rose to Rs 12.8 crores from Rs 12.2 crores. The plastic consumer products manufacturer, which is India's second-largest exporter in its category, operates at 89.7% capacity utilization across three plants with annual capacity of 33,000 metric tons. The company is installing additional machinery with 4,000 metric tons capacity at its Khatalwada plant and plans to expand total capacity from 33,000 to 52,500 metric tons using Rs 113.7 crores from IPO proceeds. Export sales constitute 83.6% of revenue with domestic sales at 16.4%. IKEA remains the largest customer contributing around 60% of sales through a 28-year relationship without formal contracts. The company acquired 12 new customers including one in Europe, one in the US, and 10 in the domestic market. Management discussed potential tariff impacts on US business, which represents 11.2% of sales, but indicated no current disruption to operations.",
            "Sentiment": "positive",
            "PublishDate": 1757336838737,
            "Source": "earnings"
        },
        {
            "Title": "All Time Plastics Reports 21% Revenue Growth in Q1 Results",
            "Summary": "All Time Plastics reported Q1 revenue of 1.58 billion rupees, up from 1.3 billion rupees year-over-year. The company's consolidated net profit increased to 128 million rupees from 122 million rupees in the same period last year. EBITDA rose to 287 million rupees compared to 249 million rupees year-over-year, though EBITDA margin declined to 18.2% from 19.2% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1756801783235,
            "Source": "earnings"
        }
    ]
}