{
    "Symbol": "ALMONDZ",
    "ISIN": "INE326B01035",
    "News": [
        {
            "Title": "Almondz Global Securities Q3FY26 Results",
            "Summary": "Almondz Global Securities reports Q3FY26 standalone net profit of ₹126 lakh vs ₹57 lakh YoY. Revenue jumps to ₹2,729 lakh from ₹755 lakh. Nine-month profit rises to ₹310 lakh.",
            "Sentiment": "positive",
            "PublishDate": 1770801647179,
            "Source": "co_actions_results"
        },
        {
            "Title": "Almondz Global Securities' Scheme Application Returned",
            "Summary": "Almondz Global Securities Limited informed exchanges that their Composite Scheme of Arrangement application has been returned by the Membership Department, following initial board approval in September 2025.",
            "Sentiment": "negative",
            "PublishDate": 1769173441513,
            "Source": "stocks"
        },
        {
            "Title": "Almondz Global Securities Reports Mixed Quarterly Performance with Consolidated Profit Rising to Rs 387 Lakh",
            "Summary": "Almondz Global Securities Limited announced its quarterly results for the quarter and half year ended September 30, 2025. On a standalone basis, the company reported a net profit of Rs 60 lakh for the quarter compared to Rs 61 lakh in the same period last year. However, consolidated net profit showed significant improvement at Rs 387 lakh versus Rs 285 lakh in the previous year quarter. For the half year period, standalone net profit reached Rs 183 lakh while consolidated profit was Rs 1,077 lakh. The company's total revenue from operations on a standalone basis was Rs 754 lakh for the quarter, while consolidated revenue reached Rs 3,373 lakh. The company operates across three main segments: debt and equity market operations, consultancy and advisory fees, and wealth advisory/broking activities. Basic earnings per share on a consolidated basis stood at Rs 0.22 for the quarter. The board meeting was held on November 11, 2025, and the results were reviewed by statutory auditors Mohan Gupta & Co.",
            "Sentiment": "neutral",
            "PublishDate": 1762876440223,
            "Source": "earnings"
        },
        {
            "Title": "Avonmore Capital Approves Complex Demerger and Amalgamation Scheme Involving Multiple Companies",
            "Summary": "Avonmore Capital & Management Services Limited's Board approved a composite scheme involving the demerger of broking business from Almondz Global Securities Limited and subsequent amalgamations of six companies. The scheme separates broking and non-broking businesses to comply with Securities Contract Regulations Rules that restrict stock exchange members from engaging in non-securities businesses. Under the arrangement, Almondz Global Securities' broking business will be demerged into Almondz Broking Services Limited, which will retain the Almondz Global Securities name and seek stock exchange listing. The remaining non-broking business of Almondz Global Securities, along with five other companies (Almondz Insolvency Resolutions Services, Almondz Finanz, Apricot Infosoft, Avonmore Developer, and Anemone Holding), will be amalgamated into Avonmore Capital. The share exchange ratios include 1:1 for the demerged broking entity and 967:1000 for the remaining business amalgamation. Post-scheme, Avonmore Capital's promoter shareholding will decrease from 58.38% to 45.40%. The scheme requires approvals from the National Company Law Tribunal, shareholders, creditors, and regulatory authorities.",
            "Sentiment": "neutral",
            "PublishDate": 1757592531101,
            "Source": "corporate_action"
        },
        {
            "Title": "Premier Green Innovations Forms Strategic Alliance with Entity 1 for Waste-to-Value Platform Development",
            "Summary": "Premier Green Innovations Private Limited, a joint venture company in which Almondz Global Securities Limited holds 40.99% stake through its wholly owned subsidiary, has entered into a strategic alliance with Entity 1 Value Emission Pvt Ltd. The partnership focuses on developing and deploying MECC-based waste-to-value platforms to produce hydrogen, methanol, ethyl acetate, and other value-added products. The alliance involves an investment of Rs. 500 crores over 3 years to build alternative materials for a full-scale alternate refinery. Entity 1's first MECC reactor has been installed at PGIPL's Kangra site, with trial production set to commence. The technology will convert agricultural and industrial waste into clean fuels and chemicals, with methanol priced at Rs. 22 per litre. The modular reactors are designed for 0.5-100 tonnes per day capacity, enabling rapid deployment and reduced capital expenditure.",
            "Sentiment": "positive",
            "PublishDate": 1757437832794,
            "Source": "order&deals"
        },
        {
            "Title": "Navjeet S. Sobti (HUF) Acquires 0.05% Stake in Almondz Global Securities",
            "Summary": "Navjeet S. Sobti (HUF) has acquired 100,000 shares of Almondz Global Securities Ltd through open market purchase. The acquisition represents 0.05% of the company's total share capital and diluted share capital. Prior to this transaction, Navjeet S. Sobti (HUF) held no shares in the company. The shares were purchased on August 6, 2025. Almondz Global Securities has an equity share capital of 173,646,754 shares valued at Rs. 173,646,754, with a total diluted share capital of 185,779,800 shares. The disclosure was submitted to BSE and NSE under SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1754562984005,
            "Source": "corporate_action"
        },
        {
            "Title": "Almondz Global Infra-Consultant Ceases to be Wholly Owned Subsidiary After Share Allotment",
            "Summary": "Almondz Global Infra-Consultant Limited (AGICL) has ceased to be a wholly owned subsidiary of Almondz Global Securities Limited following a share allotment to Avonmore Capital & Management Services Limited. AGICL allotted 33,19,318 equity shares at Rs. 45.19 per share, totaling Rs. 14,99,99,980, through conversion of loan to equity. Almondz Global Securities' shareholding in AGICL was diluted to 79.15% of total paid-up capital, though the absolute number of shares held remains unchanged. AGICL continues as a subsidiary company rather than a wholly owned subsidiary. AGICL contributed 76% of income (Rs. 11,486.96 lacs) and 15% of net worth (Rs. 3,658.62 lacs) to the parent company in the last financial year.",
            "Sentiment": "neutral",
            "PublishDate": 1754045765244,
            "Source": "corporate_action"
        },
        {
            "Title": "Almondz Global Securities Publishes Consolidated Unaudited Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Almondz Global Securities Limited has published its consolidated unaudited financial results for the quarter ended June 30, 2025, in newspapers. The company submitted copies of these published results to BSE and NSE stock exchanges. The results were signed by Ajay Pratap, Director Legal & Corporate Affairs & Company Secretary, and published in compliance with listing regulations. The financial results document contains detailed quarterly performance data and statutory disclosures for the securities company.",
            "Sentiment": "neutral",
            "PublishDate": 1753772929203,
            "Source": "earnings"
        },
        {
            "Title": "Almondz Global Securities Submits Revised Annual Secretarial Compliance Report for FY2025",
            "Summary": "Almondz Global Securities Limited submitted a revised Annual Secretarial Compliance Report for the financial year ended March 31, 2025, under SEBI Listing Regulations. The report, certified by practicing company secretary Ashu Gupta & Co., indicates the company has generally complied with applicable SEBI regulations and statutory provisions. However, the report highlights a compliance deviation regarding the appointment of an independent director beyond the age of 75 years, specifically Mr. Surinder Singh Kohli, who was appointed in August 2024. Both NSE and BSE imposed fines of Rs. 92,040 each (inclusive of GST) on the company for this non-compliance. NSE rejected the company's waiver request and the fine was paid on July 4, 2025, while BSE's response to the waiver request remains pending. The report confirms compliance with other key areas including secretarial standards, policy adoption, website maintenance, director qualifications, subsidiary disclosures, document preservation, performance evaluation, related party transactions, insider trading regulations, and event disclosures.",
            "Sentiment": "neutral",
            "PublishDate": 1753439770954,
            "Source": "corporate_governance"
        }
    ]
}