{
    "Symbol": "ALOKINDS",
    "ISIN": "INE270A01029",
    "News": [
        {
            "Title": "Alok Industries Faces Rs 49.86 Lakh GST Penalty",
            "Summary": "Alok Industries receives penalty order from CGST & Central Excise, Daman for alleged incorrect input tax credit availment. Company plans to file appeal against the February 10, 2026 order.",
            "Sentiment": "negative",
            "PublishDate": 1770740435365,
            "Source": "stocks"
        },
        {
            "Title": "Alok Industries Q3 Consolidated Loss Narrows to ₹218 Cr",
            "Summary": "Alok Industries reported Q3FY26 consolidated net loss of ₹218 crores, improved from ₹270 crores YoY. Consolidated revenue remained flat at ₹860 crores compared to previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1768476267171,
            "Source": "co_actions_results"
        },
        {
            "Title": "Alok Industries Clarifies Volume Movement to BSE",
            "Summary": "Alok Industries Limited responds to BSE surveillance query, confirming compliance with SEBI disclosure regulations and stating no pending disclosures required under listing obligations.",
            "Sentiment": "neutral",
            "PublishDate": 1766559676788,
            "Source": "stocks"
        },
        {
            "Title": "Alok Industries sells 100% stake in Mileta a.s.",
            "Summary": "Alok Industries' subsidiary AIIL entered into agreement to sell entire stake in Czech textile manufacturing unit Mileta a.s. to CRESCON for EUR 558,825 cash consideration.",
            "Sentiment": "neutral",
            "PublishDate": 1765905276398,
            "Source": "co_actions_results"
        },
        {
            "Title": "Alok Industries Reports Rs 378 Crore Loss in Half Year Ended September 2025",
            "Summary": "Alok Industries Limited reported a net loss of Rs 378.45 crore for the half year ended September 30, 2025, compared to Rs 458.11 crore loss in the same period last year. Revenue from operations decreased to Rs 1,785.71 crore from Rs 1,821.51 crore year-on-year. The company recorded exceptional gains of Rs 30.85 crore, primarily from insurance proceeds and sale of tornado-damaged assets. EBITDA turned positive at Rs 61.45 crore for the half year. The company's accumulated losses stand at Rs 23,246.85 crore, with current liabilities exceeding current assets by Rs 112.04 crore. Despite losses, management prepared financial results on going concern basis citing strong textile industry growth and positive cash flow projections.",
            "Sentiment": "neutral",
            "PublishDate": 1760612611470,
            "Source": "earnings"
        },
        {
            "Title": "Alok Industries Reports Narrower Q2 Loss Despite Revenue Growth",
            "Summary": "Alok Industries reported a consolidated net loss of 1.62 billion rupees in Q2, an improvement from the previous year's loss of 2.62 billion rupees. The company's revenue increased to 9.41 billion rupees compared to 8.85 billion rupees in the same period last year. EBITDA turned positive at 46 million rupees versus a loss of 450 million rupees in the prior year, with EBITDA margin improving to 0.49% from negative 5.13%.",
            "Sentiment": "positive",
            "PublishDate": 1760612107077,
            "Source": "earnings"
        },
        {
            "Title": "DGTR Initiates Anti-Dumping Investigation on Calcium Carbonate Filler Masterbatch Imports from Vietnam",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has commenced an anti-dumping probe on imports of calcium carbonate filler masterbatch from Vietnam. This investigation affects Alok Industries and relates to potential unfair pricing practices in the import of this industrial material used in manufacturing processes.",
            "Sentiment": "neutral",
            "PublishDate": 1759116080102,
            "Source": "stock"
        },
        {
            "Title": "Alok Industries Appoints New Auditors and Re-appoints Three Independent Directors for Five-Year Terms",
            "Summary": "Alok Industries Limited appointed M/s Chaturvedi & Shah LLP as statutory auditors for a five-year term, replacing S R B C & CO LLP whose term concluded at the Annual General Meeting held on September 4, 2025. The company also re-appointed three Independent Directors - Shri Achuthan Siddharth, Ms. Mumtaz Bandukwala, and Shri Rahul Dutt - for second terms of 5 years each, effective from September 14, 2025. Chaturvedi & Shah LLP is a Mumbai-based chartered accountancy firm founded in 1967 with experience serving large corporates across different sectors. The three independent directors bring expertise in audit, legal practice, and corporate law, with combined experience spanning several decades in their respective fields.",
            "Sentiment": "neutral",
            "PublishDate": 1757044267570,
            "Source": "corporate_governance"
        },
        {
            "Title": "Alok Industries Reports Q1 Financial Results",
            "Summary": "Alok Industries has released its Q1 financial results. The company's EBITDA remained stable at 200 million rupees year-over-year, with the EBITDA margin improving slightly to 2.14% from 1.99%. However, the consolidated net loss narrowed to 1.7 billion rupees from 2.1 billion rupees in the same period last year. Revenue decreased to 9.3 billion rupees from 10 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1752753883000,
            "Source": "result"
        },
        {
            "Title": "Alok Industries: Shares Surge 15% on US Tariff on Bangladesh Imports",
            "Summary": "Alok Industries shares jumped 15% after US President Trump announced a 35% tariff on imports from Bangladesh. The stock hit a high of Rs 23.20 on NSE with over 26 crore shares traded. The move is expected to benefit Indian textile companies.",
            "Sentiment": "positive",
            "PublishDate": 1751982318000,
            "Source": "normal_news"
        },
        {
            "Title": "Alok Industries Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade of Alok Industries Ltd. shares occurred on the National Stock Exchange (NSE). Approximately 12,126,303 shares were traded at a price of Rs. 19.67 per share, totaling Rs. 23.85 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1745308728000,
            "Source": "block_details"
        },
        {
            "Title": "Alok Industries: Share Price Surges 18% Post Q4 Results",
            "Summary": "Alok Industries' share price rose up to 18.4% in morning trade on BSE, reaching an intraday high of ₹19.50. The surge followed the company's Q4 results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1745296652000,
            "Source": "result"
        },
        {
            "Title": "Alok Industries Reports Q4 FY2023 Financial Results",
            "Summary": "Alok Industries announced its Q4 FY2023 financial results. The company reported a consolidated net loss of 744.7 million rupees, an improvement from the 2.16 billion rupee loss in the same quarter last year. However, this represents a decline from the previous quarter's loss of 2.73 billion rupees. Revenue for Q4 stood at 9.53 billion rupees, down from 14.69 billion rupees year-over-year. The company also reported an exceptional item of 941.4 million rupees. The loss before tax (LBT) for Q4 was 1.68 billion rupees, compared to a loss of 2.2 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1745281630000,
            "Source": "default"
        },
        {
            "Title": "Alok Industries Reports Q4 Financial Results",
            "Summary": "Alok Industries has reported its Q4 financial results. The company's revenue decreased to 9.53 billion rupees from 14.69 billion rupees year-over-year. The consolidated net loss for Q4 was 744.7 million rupees, compared to a loss of 2.16 billion rupees in the same quarter last year and a loss of 2.73 billion rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1745237318000,
            "Source": "result"
        },
        {
            "Title": "Alok Industries: Q3 FY25 Loss Widens, Revenue Declines",
            "Summary": "Alok Industries reported a Q3 FY25 loss of ₹272.99 crore, up 18.73% YoY. Revenue decreased 31.06% YoY to ₹863.86 crore. Operating income fell 37.46% YoY despite a slight QoQ improvement. SG&A expenses increased 23.63% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1737093459000,
            "Source": "earnings"
        },
        {
            "Title": "Alok Industries Reports Reduced Q3 EBITDA Loss",
            "Summary": "Alok Industries has reported a Q3 EBITDA loss of 420 million rupees, which is an improvement compared to the loss of 600 million rupees in the same quarter of the previous year. This indicates a reduction in the company's operational losses year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1737016157000,
            "Source": "earnings"
        },
        {
            "Title": "Alok Industries Reports Q3 Revenue Decline",
            "Summary": "Alok Industries has reported a significant decrease in its third-quarter revenue. The company's revenue for Q3 stood at 8.6 billion rupees, down from 12.5 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1737016123000,
            "Source": "earnings"
        },
        {
            "Title": "Alok Industries Reports Increased Q3 Consolidated Net Loss",
            "Summary": "Alok Industries has reported a consolidated net loss of 2.7 billion rupees for the third quarter, compared to a loss of 2.3 billion rupees in the same period last year. This represents an increase in the company's net loss year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1737016044000,
            "Source": "earnings"
        },
        {
            "Title": "Alok Industries Schedules Board Meeting for Q3 Results",
            "Summary": "Alok Industries has announced a board meeting scheduled for January 16 to consider and approve the company's financial results for the third quarter of the current fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1736430425000,
            "Source": "corporate_action"
        },
        {
            "Title": "Alok Industries: Share Price Dips Amid Market Gains",
            "Summary": "Alok Industries shares are trading at ₹21.23, down 0.56% from the previous close. The stock has hit a high of ₹21.46 and a low of ₹21.08 today. Trading volume is 67.65% lower than the previous session. The company's shareholding pattern shows 0.08% MF holding and 2.40% FII holding as of September quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1732859969000,
            "Source": "normal_news"
        },
        {
            "Title": "Alok Industries: Share Price Up 0.89% Amid Market Downturn",
            "Summary": "Alok Industries shares are trading at ₹21.52, up 0.89% while Sensex is down 0.96%. The stock has hit a high of ₹21.82 and a low of ₹21.21. Trading volume is 48.05% lower than the previous session. Technical analysis suggests a potential trend reversal after a strong downtrend.",
            "Sentiment": "neutral",
            "PublishDate": 1732773006000,
            "Source": "normal_news"
        },
        {
            "Title": "Alok Industries: Share Price Rises 1.85% Amid Mixed Market",
            "Summary": "Alok Industries shares are trading at ₹21.43, up 1.85% from the previous close. The stock has hit a high of ₹21.57 and a low of ₹20.91 today. Trading volume is 22.39% lower than the previous session. The company's shareholding pattern shows 0.00% promoter holding, 0.08% MF holding (increased from June), and 2.40% FII holding (decreased from June).",
            "Sentiment": "neutral",
            "PublishDate": 1732686481000,
            "Source": "normal_news"
        },
        {
            "Title": "Alok Industries: Share Price Rises 1.94% Amid Market Fluctuations",
            "Summary": "Alok Industries shares are trading at ₹20.97, up 1.94% from the previous close. The stock hit a high of ₹21.18 and a low of ₹20.47. Trading volume is 22.39% lower than the previous session. The company's promoter holding is 0.00%, MF holding is 0.08%, and FII holding is 2.40% as of September quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1732599687000,
            "Source": "normal_news"
        },
        {
            "Title": "Alok Industries: Share Price Rises 3.05% Amid Market Uptrend",
            "Summary": "Alok Industries shares are trading at ₹20.92, up 3.05% from the previous close. The stock has hit a high of ₹21.05 and a low of ₹20.65. Trading volume is 58.30% lower than the previous session. The company has 0% promoter holding, 0.08% MF holding, and 2.40% FII holding as of September quarter.",
            "Sentiment": "positive",
            "PublishDate": 1732513141000,
            "Source": "normal_news"
        },
        {
            "Title": "Alok Industries Reports Q2 EBITDA Loss",
            "Summary": "<p><span class='neutral'>Alok Industries</span> has reported an <span class='negative'>EBITDA loss</span> of <b>450 million rupees</b> in the second quarter, compared to an <span class='positive'>EBITDA gain</span> of <b>360 million rupees</b> in the same period last year. This represents a <span class='negative'>significant year-over-year decline</span> in the company's operational performance.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728894463000,
            "Source": "result"
        },
        {
            "Title": "Alok Industries Reports Q2 Revenue Decline",
            "Summary": "<p><span class='neutral'>Alok Industries</span> has reported a <span class='negative'>significant decrease</span> in <b>revenue</b> for the second quarter. The company's revenue <span class='negative'>fell</span> to <b>8.9 billion rupees</b>, down from <b>13.6 billion rupees</b> in the same quarter of the previous year, representing a <span class='negative'>year-over-year decline</span>.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728894341000,
            "Source": "result"
        },
        {
            "Title": "Alok Industries Reports Increased Q2 Loss",
            "Summary": "<p><span class='neutral'>Alok Industries</span> has reported a consolidated <span class='negative'>net loss</span> of <b>2.62 billion rupees</b> for the second quarter, compared to a <span class='negative'>loss</span> of <b>1.74 billion rupees</b> in the same period last year. This represents a <span class='negative'>significant increase</span> in the company's losses year-over-year.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728894300000,
            "Source": "result"
        }
    ]
}