{
    "Symbol": "ALPEXSOLAR",
    "ISIN": "INE0R4701017",
    "News": [
        {
            "Title": "Alpex Solar Secures ₹215 Crore Order, Revenue Boost",
            "Summary": "Alpex Solar Limited has secured a significant order worth ₹215 crores, which is expected to increase the company's annual revenue by approximately 25%. The solar equipment manufacturer continues to expand its market presence.",
            "Sentiment": "positive",
            "PublishDate": 1768380934672,
            "Source": "co_actions_results"
        },
        {
            "Title": "Alpex Solar Board Approves ₹125 Cr NCD Fundraising",
            "Summary": "Alpex Solar's board has approved raising ₹125 crore through unlisted secured non-convertible debentures, marking a significant capital mobilization initiative for the electrical equipment company.",
            "Sentiment": "positive",
            "PublishDate": 1765874179405,
            "Source": "co_actions_results"
        },
        {
            "Title": "Alpex Solar Reports Strong Q2 Growth with Revenue Surging to 5.2 Billion Rupees",
            "Summary": "Alpex Solar delivered robust quarterly performance with revenue reaching 5.2 billion rupees compared to 1.9 billion rupees in the same period last year. Net profit more than doubled to 521 million rupees from 232 million rupees year-over-year. EBITDA increased significantly to 777 million rupees from 306 million rupees, though EBITDA margin declined to 14.89% from 16.26% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762152007136,
            "Source": "earnings"
        },
        {
            "Title": "Alpex Solar Plans 2.2 GW Solar Cell Project Launch in Two Phases",
            "Summary": "Alpex Solar announced plans to launch a 2.2 GW solar cell project that will be implemented in two stages. The company has scheduled 1.4 GW trial production to begin in the first quarter of FY 2026-27.",
            "Sentiment": "positive",
            "PublishDate": 1761720776922,
            "Source": "stock"
        },
        {
            "Title": "Alpex Solar Raises ₹260.17 Crore to Expand Solar Module Capacity to 3.6 GW",
            "Summary": "Alpex Solar has successfully raised ₹260.17 crore through a new share issue. The company plans to use these funds to increase its solar module manufacturing capacity to 3.6 GW by FY27. The company currently maintains an order book worth ₹1,278.84 crore.",
            "Sentiment": "positive",
            "PublishDate": 1758777569709,
            "Source": "stock"
        },
        {
            "Title": "Alpex Solar Secures ₹350 Crore Order",
            "Summary": "Alpex Solar has secured an order valued at ₹350 crores. The company's market capitalization stands at ₹3,001 crores.",
            "Sentiment": "positive",
            "PublishDate": 1757325376952,
            "Source": "order&deals"
        },
        {
            "Title": "Alpex Solar Secures Major Order Worth 2.3 Billion Rupees",
            "Summary": "Alpex Solar has secured a significant order valued at 2.3 billion rupees. The announcement represents a substantial business development for the solar company.",
            "Sentiment": "positive",
            "PublishDate": 1753192060389,
            "Source": "order&deals"
        },
        {
            "Title": "Alpex Solar: Secures Orders Worth Rs 1,068.84 Crore",
            "Summary": "Alpex Solar has won multiple orders totaling Rs 1,068.84 crore. Major contracts include a Rs 349.99 crore project from Coal India subsidiary, a Rs 210 crore solar module supply to SECI, and a Rs 378 crore order from a leading industry player. The company also secured a Rs 65.33 crore contract for solar water pumps from Haryana Renewable Energy Development Agency.",
            "Sentiment": "positive",
            "PublishDate": 1747307881000,
            "Source": "order&deals"
        },
        {
            "Title": "Alpex Solar Secures ₹378 Crore Order",
            "Summary": "Alpex Solar, a company listed on the SME (Small and Medium Enterprises) exchange, has received a significant order worth ₹378 crore. This substantial contract represents a major business development for the company, potentially boosting its revenue and market position in the solar energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1746698404000,
            "Source": "default"
        },
        {
            "Title": "Alpex Solar Secures ₹65 Crore Order",
            "Summary": "Alpex Solar, an SME company, has received a new order worth 65 crore rupees. This significant order is likely to boost the company's revenue and business prospects.",
            "Sentiment": "positive",
            "PublishDate": 1745573430000,
            "Source": "default"
        },
        {
            "Title": "Alpex Solar Secures 380 Crore Order",
            "Summary": "Alpex Solar has received a significant order valued at 380 crore rupees. This development is likely to have a positive impact on the company's financial outlook and business operations.",
            "Sentiment": "positive",
            "PublishDate": 1745382615000,
            "Source": "default"
        },
        {
            "Title": "Alpex Solar: Secures Rs 210 Crore Solar Module Supply Order from SECI",
            "Summary": "Alpex Solar has won a Rs 210.71 crore order from Solar Energy Corporation of India (SECI) for supplying advanced solar photovoltaic modules. The order will be fulfilled through their recently expanded 1.2 GW capacity manufacturing facility in Greater Noida.",
            "Sentiment": "positive",
            "PublishDate": 1741019821000,
            "Source": "order&deals"
        },
        {
            "Title": "Alpex Solar Secures 210 Crore Rupee Contract",
            "Summary": "Alpex Solar, a company with a market capitalization of 1400 crore rupees, has won a contract worth 210 crore rupees. This development is significant for the small and medium enterprise (SME) sector.",
            "Sentiment": "positive",
            "PublishDate": 1740729973000,
            "Source": "order&deals"
        },
        {
            "Title": "Alpex Solar Secures 450 Million Rupee Order from MSEDCL",
            "Summary": "Alpex Solar has received an order worth 450 million rupees from Maharashtra State Electricity Distribution Company Limited (MSEDCL). This significant order is likely to boost the company's revenue and market position in the solar energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1739838539000,
            "Source": "order&deals"
        },
        {
            "Title": "Alpex Solar Secures Major Solar Panel Supply Order",
            "Summary": "<p><span class='positive'>Alpex Solar</span> has received an <b>order</b> worth <span class='positive'>2.77 billion rupees</span> for the supply of <span class='positive'>solar panels</span>. The company, with a <b>market capitalization</b> of <span class='neutral'>2,349.81 crore rupees</span>, is listed in the <span class='neutral'>SME (Small and Medium Enterprise)</span> segment.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728989298000,
            "Source": "corporate_action"
        },
        {
            "Title": "Alpex Solar Approves ₹6.42 Billion Expansion Plan for Solar Cell Plant",
            "Summary": "<p><span class='positive'>Alpex Solar</span> has <span class='positive'>approved</span> a <span class='positive'>significant expansion plan</span> for its <b>solar cell manufacturing plant</b> in Uttar Pradesh. The company plans to <span class='positive'>invest ₹6.42 billion</span> to <span class='positive'>increase</span> the plant's capacity to <b>1.6 GW</b>. This expansion represents a <span class='positive'>major investment</span> in <span class='positive'>renewable energy infrastructure</span> and could potentially <span class='positive'>boost</span> Alpex Solar's <span class='positive'>production capabilities</span> in the <span class='positive'>growing solar energy sector</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727950205000,
            "Source": "corporate_action"
        }
    ]
}