{
    "Symbol": "ALPHAGEO",
    "ISIN": "INE137C01018",
    "News": [
        {
            "Title": "Alphageo Reports Q3 FY26 Loss of ₹584.44 Lakhs",
            "Summary": "Alphageo (India) Limited reported a net loss of ₹584.44 lakhs for Q3 FY26, with revenue rising to ₹1683.73 lakhs. The company faces regulatory challenges with FEMA proceedings.",
            "Sentiment": "negative",
            "PublishDate": 1770802410987,
            "Source": "co_actions_results"
        },
        {
            "Title": "Alphageo India Reports Loss of Rs 574.82 Lakhs in Q2 FY25 Despite Revenue Growth",
            "Summary": "Alphageo India Limited posted a net loss of Rs 574.82 lakhs for the quarter ended September 30, 2025, compared to a profit of Rs 176.85 lakhs in the same quarter last year, despite total income rising to Rs 595.38 lakhs from Rs 241.58 lakhs. The geophysical services company faces ongoing regulatory challenges including Rs 1,601.08 lakhs in seized fixed deposits by the Directorate of Enforcement under FEMA and a tax demand of Rs 1,645 lakhs on the Managing Director.",
            "Sentiment": "negative",
            "PublishDate": 1763109898614,
            "Source": "earnings"
        },
        {
            "Title": "Alphageo Offshore Services Faces Legal Challenge Over Oil India Contract Award",
            "Summary": "Alphageo Offshore Services Private Limited, a material subsidiary of Alphageo (India) Limited, received a Special Civil Application filed in the Gujarat High Court at Ahmedabad on November 4, 2025. The application was filed by Advent Oilfield Services Private Limited, challenging the award of a contract from Oil India Limited to Alphageo Offshore Services. The contract award was previously disclosed to stock exchanges on September 25, 2025. The matter is currently under legal proceedings, and Alphageo Offshore Services is evaluating the application in consultation with legal advisors. The company stated it will keep stock exchanges informed of any material developments. No financial implications have been determined at this stage.",
            "Sentiment": "negative",
            "PublishDate": 1762349779217,
            "Source": "stock"
        },
        {
            "Title": "Alphageo's Subsidiary Wins Rs. 34.98 Crore Seismic Data Contract from Oil India Limited",
            "Summary": "Alphageo Offshore Services Private Limited, a material subsidiary of Alphageo (India) Limited, has been awarded a contract by Oil India Limited for 2D and 3D Seismic Data Acquisition in Gujarat. The contract is valued at Rs. 34.98 crores plus applicable taxes and must be completed by May 2026. This is a domestic contract with no related party transactions or promoter group interests involved. Alphageo (India) Limited received notification of the contract award from its subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1758800021430,
            "Source": "order&deals"
        },
        {
            "Title": "Alphageo India Reports Q1 2025 Results, Schedules 38th AGM for September 26",
            "Summary": "Alphageo (India) Limited's Board approved unaudited consolidated and standalone financial results for the quarter ended June 30, 2025. On a consolidated basis, the company reported revenue from operations of Rs 4,084.28 lakhs compared to Rs 2,526.48 lakhs in the same quarter last year. Profit after tax stood at Rs 74.23 lakhs versus Rs 402.32 lakhs in the previous year quarter. On standalone basis, revenue was Rs 4,084.28 lakhs against Rs 1,869.60 lakhs last year, with profit after tax of Rs 91.72 lakhs compared to Rs 290.14 lakhs. The Board scheduled the 38th Annual General Meeting for September 26, 2025, via video conferencing. The Register of Members and Share Transfer Book will be closed from September 20-26, 2025, for determining dividend eligibility. The company operates in geophysical data acquisition, processing and interpretation services. Earnings per share on consolidated basis was Rs 1.27 compared to Rs 5.89 in the previous year quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1755008113517,
            "Source": "earnings"
        },
        {
            "Title": "Alphageo (India) Ltd: Secures ₹118 Crore Orders from ONGC, Stock Surges 19%",
            "Summary": "Alphageo (India) Ltd has won two contracts from ONGC totaling ₹118.63 crore for 2D seismic data acquisition in Chhattisgarh and Krishna-Godavari. The Chhattisgarh project is valued at ₹38.29 crore and the Krishna-Godavari project at ₹80.34 crore, with completion dates set for January and May 2026 respectively. The company's stock price jumped over 19% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1734337503000,
            "Source": "order&deals"
        },
        {
            "Title": "AlphaGeo Secures 120 Crore Rupee Order",
            "Summary": "AlphaGeo, a company with a market capitalization of 240 crore rupees, has won a new order worth 120 crore rupees. This order represents a significant business opportunity for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1734335433000,
            "Source": "order&deals"
        },
        {
            "Title": "AlphaGeo Reports Improved Q2 EBITDA",
            "Summary": "AlphaGeo has reported a significant turnaround in its Q2 EBITDA, posting a gain of 15 million rupees compared to a loss of 40 million rupees in the same quarter last year. The company's Q2 EBITDA margin stands at 8.08%.",
            "Sentiment": "positive",
            "PublishDate": 1731311312000,
            "Source": "result"
        },
        {
            "Title": "AlphaGeo Reports Significant Revenue Growth in Q2",
            "Summary": "AlphaGeo has reported a substantial year-over-year increase in its second-quarter revenue, rising from 24 million rupees to 187 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1731311260000,
            "Source": "result"
        },
        {
            "Title": "AlphaGeo Reports Profit in Q2, Reversing Previous Year's Loss",
            "Summary": "AlphaGeo has reported a consolidated net profit of 18 million rupees for the second quarter, compared to a loss of 43 million rupees in the same period last year. This represents a significant turnaround in the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1731311181000,
            "Source": "result"
        }
    ]
}