{
    "Symbol": "AMANTA",
    "ISIN": "INE084K01015",
    "News": [
        {
            "Title": "Amanta Healthcare Q3FY26: Revenue up 9.84% YoY",
            "Summary": "Amanta Healthcare reported Q3FY26 revenue of ₹74.49 crore, up 9.84% YoY, with PAT growing 8.12% to ₹4.7 crore. Nine-month PAT surged 51.28% YoY to ₹9.3 crore.",
            "Sentiment": "positive",
            "PublishDate": 1770819484556,
            "Source": "co_actions_results"
        },
        {
            "Title": "Amanta Healthcare Announces Senior Management Changes",
            "Summary": "Amanta Healthcare Limited announces inclusion of Urmil Oza as Senior Management Personnel and removal of Shailesh Shah, effective February 10, 2026, following board approval.",
            "Sentiment": "neutral",
            "PublishDate": 1770710991524,
            "Source": "stocks"
        },
        {
            "Title": "Amanta Healthcare Opens Special Transfer Window",
            "Summary": "Amanta Healthcare announces special window for transfer and dematerialisation of physical securities from February 05, 2026 to February 04, 2027 following SEBI circular dated January 30, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770030780198,
            "Source": "stocks"
        },
        {
            "Title": "Amanta Healthcare Corrects Solar Plant Capacity to 10.8 MWp",
            "Summary": "Amanta Healthcare Limited corrects solar power plant capacity from 10.8 KWp to 10.8 MWp in agreement with Zodiac Energy Limited, re-executing the agreement on January 02, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767090759052,
            "Source": "stocks"
        },
        {
            "Title": "Amanta Healthcare Reports IPO Fund Utilization Progress for September Quarter",
            "Summary": "Amanta Healthcare utilized Rs 3,030.02 lakhs from its Rs 12,600 lakhs IPO proceeds during the quarter ended September 30, 2025, primarily for capital expenditure on manufacturing equipment and civil construction work. The pharmaceutical company has Rs 9,569.98 lakhs remaining for planned expansion of SteriPort and SVP manufacturing lines at its Gujarat facility, with production expected to commence from January 2026 and 2027 respectively.",
            "Sentiment": "positive",
            "PublishDate": 1763104286085,
            "Source": "earnings"
        },
        {
            "Title": "Amanta Healthcare Reports Fund Utilization Deviation Due to GST Payment Adjustments",
            "Summary": "Amanta Healthcare Limited filed a statement of deviation in fund utilization for the quarter ended September 30, 2025. The company raised Rs 126 crore through its IPO. The deviation occurred due to GST payment modifications over the costs mentioned in the IPO Offer Document, which resulted in adjustments to issue expenses and a corresponding reduction in general corporate purpose expenses. The company allocated funds for capital expenditure requirements including civil construction work and purchase of equipment for setting up new manufacturing lines - Rs 7000 lakhs for SteriPort at Hariyala, Kheda, Gujarat (with Rs 764.81 lakhs utilized) and Rs 3013.11 lakhs for SVP manufacturing line at the same location. General corporate purposes allocation was modified from Rs 660.46 lakhs to Rs 302.08 lakhs. Issue expenses were adjusted from Rs 1926.43 lakhs to Rs 2284.81 lakhs with Rs 2265.21 lakhs utilized. The Audit Committee reviewed the statement and provided no comments.",
            "Sentiment": "neutral",
            "PublishDate": 1762903911537,
            "Source": "corporate_action"
        },
        {
            "Title": "Amanta Healthcare Reports Quarterly Results and Completes IPO Listing",
            "Summary": "Amanta Healthcare Limited's Board of Directors approved the company's standalone unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported total income of Rs 7,095.80 lakhs for the quarter and Rs 13,850.45 lakhs for the six-month period. Net profit for the quarter was Rs 207.8 lakhs and Rs 185.50 lakhs for the half-year. The company completed its Initial Public Offering (IPO) during the quarter, issuing 10,000,000 equity shares at Rs 126 per share, raising Rs 12,600 lakhs. The equity shares were listed on BSE Limited and National Stock Exchange of India Limited on September 9, 2025. IPO-related expenses of Rs 262.88 lakhs were recognized as an exceptional item. The company operates in pharmaceutical manufacturing and contract manufacturing services. PriceWaterhouseCoopers provided an unmodified review opinion on the financial results.",
            "Sentiment": "positive",
            "PublishDate": 1762887593450,
            "Source": "earnings"
        }
    ]
}