{
    "Symbol": "AMBER",
    "ISIN": "INE371P01015",
    "News": [
        {
            "Title": "Amber Enterprises schedules Q3 FY26 earnings call",
            "Summary": "Amber Enterprises India Limited has scheduled an earnings call for February 9, 2026 at 6:00 PM IST to discuss Q3 and 9M FY26 unaudited financial results with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1770212830666,
            "Source": "co_actions_results"
        },
        {
            "Title": "Amber Enterprises Gets Gujarat HC Stay on Duty Notice",
            "Summary": "Amber Enterprises India receives stay order from Gujarat High Court on show cause notice regarding duty benefits. Court grants interim relief with no financial penalties imposed until next hearing.",
            "Sentiment": "positive",
            "PublishDate": 1768983969282,
            "Source": "stocks"
        },
        {
            "Title": "Amber Enterprises secures 116 acres for ₹6,785 cr project",
            "Summary": "Amber Enterprises India Limited receives land allotment from YEIDA for manufacturing facilities with combined investment of ₹6,785 crores, expected to create over 3,000 jobs in phased manner.",
            "Sentiment": "positive",
            "PublishDate": 1768829289451,
            "Source": "stocks"
        },
        {
            "Title": "Amber Enterprises Subsidiaries Get ECMS Approval",
            "Summary": "Amber Enterprises' step-down subsidiaries Ascent-K Circuit and Shogini Technoarts received formal approval under Electronics Components Manufacturing Scheme in presence of Union Minister Ashwini Vaishnaw.",
            "Sentiment": "positive",
            "PublishDate": 1767354087241,
            "Source": "stocks"
        },
        {
            "Title": "Amber Enterprises Unit Increases Unitronics Stake",
            "Summary": "Il Jin Electronics, a unit of Amber Enterprises, has acquired an additional 3.65% stake in Unitronics, bringing its total equity holding to 44.81%.",
            "Sentiment": "positive",
            "PublishDate": 1767150873405,
            "Source": "co_actions_results"
        },
        {
            "Title": "Amber Enterprises Plans ₹500 Crore R&D Expansion in Punjab",
            "Summary": "Amber Enterprises announces ₹500 crore investment to expand its Research & Development Centre in Punjab for HVAC products, leveraging state incentive policies to advance energy-efficient technologies.",
            "Sentiment": "positive",
            "PublishDate": 1766064488708,
            "Source": "stocks"
        },
        {
            "Title": "Il Jin Electronics Acquires 80% Stake in Shogini Technoarts for Rs 5.06 Billion",
            "Summary": "Il Jin Electronics, a unit of Amber Enterprises, has acquired an 80% stake in Shogini Technoarts through a deal valued at approximately Rs 5.06 billion. This acquisition expands Amber Enterprises' portfolio through its subsidiary's strategic investment in the technology company.",
            "Sentiment": "positive",
            "PublishDate": 1764633588105,
            "Source": "order&deals"
        },
        {
            "Title": "Amber Enterprises' Subsidiary ILJIN Increases Stake in Unitronics to 41.16%",
            "Summary": "ILJIN Electronics (India) Private Limited, a material subsidiary of Amber Enterprises India Limited, acquired additional ordinary shares of Unitronics (1989) (RG) Ltd. through two transactions in November 2025, purchasing 65,000 shares on 4th November and 70,000 shares on 23rd November at NIS 24.59 per share. Following these acquisitions, ILJIN now holds a 41.16% ownership stake in Unitronics through its wholly-owned subsidiary ILJIN Holding Ltd, with the aggregate cost exceeding materiality thresholds requiring regulatory disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1763967031483,
            "Source": "corporate_action"
        },
        {
            "Title": "CRISIL Reaffirms AA-/Positive Rating for Amber Enterprises' Subsidiary Sidwal Refrigeration",
            "Summary": "CRISIL reaffirmed the AA-/Positive credit rating on Rs. 245 crore bank facilities of Sidwal Refrigeration Industries Private Limited, removing it from Rating Watch with Developing Implications. The rating action affects Amber Enterprises India Limited's material subsidiary and reflects stable creditworthiness of the refrigeration company's banking facilities with YES Bank and HDFC Bank.",
            "Sentiment": "positive",
            "PublishDate": 1763745044090,
            "Source": "stock"
        },
        {
            "Title": "CRISIL Upgrades Credit Rating for Amber Enterprises' Material Subsidiary ILJIN Electronics",
            "Summary": "CRISIL upgraded the credit rating of ILJIN Electronics (India) Private Limited, a material subsidiary of Amber Enterprises India Limited, with long-term rating improved to CRISIL AA-/Positive and short-term rating to CRISIL A1+. The upgrade removes the company from Rating Watch with Developing Implications and covers total bank loan facilities of Rs. 320 crore across multiple banks including HDFC, ICICI, YES Bank, and Axis Bank.",
            "Sentiment": "positive",
            "PublishDate": 1763744727080,
            "Source": "stock"
        },
        {
            "Title": "Amber Enterprises India Gets Credit Rating Reaffirmation from CRISIL",
            "Summary": "CRISIL reaffirmed Amber Enterprises India's credit ratings on November 20, 2025, maintaining long-term rating at AA-/Positive and short-term rating at A1+, while removing the company from Rating Watch with Developing Implications. The ratings cover total bank loan facilities worth Rs. 3,252 crore across multiple banks including HDFC, ICICI, Axis Bank, and others.",
            "Sentiment": "positive",
            "PublishDate": 1763646559345,
            "Source": "stock"
        },
        {
            "Title": "Amber Enterprises Acquires Majority Stake in PCB Manufacturer Shogini Technoarts",
            "Summary": "Amber Enterprises' subsidiary IL JIN Electronics India entered a definitive agreement to acquire a majority stake in Shogini Technoarts, one of India's top five PCB manufacturers with facilities in Pune. Kotak Institutional Equities maintains an 'add' rating with ₹8,200 price target, expecting PCBs to contribute over 40% of the company's $1 billion electronics segment revenue target by FY2028.",
            "Sentiment": "positive",
            "PublishDate": 1763349289555,
            "Source": "order&deals"
        },
        {
            "Title": "Il Jin Electronics to Acquire Majority Stake in Pune-Based Shogini Tech",
            "Summary": "Il Jin Electronics is set to purchase a majority stake in Shogini Tech, a Pune-based company, as part of its PCB manufacturing expansion strategy. The acquisition aims to strengthen the company's position in the printed circuit board manufacturing sector.",
            "Sentiment": "positive",
            "PublishDate": 1763204788077,
            "Source": "order&deals"
        },
        {
            "Title": "Amber Enterprises Executes Amendment to Investment Agreement for ILJIN Electronics",
            "Summary": "Amber Enterprises executed amendment agreements on November 13, 2025, to revise the allocation proportions of equity shares and preference shares among investors in its material subsidiary ILJIN Electronics. The amendments affect the distribution between Raptor Investments Limited and Two Infinity Partners while maintaining the total subscription amount of Rs. 1,100 crore for the electronics segment's organic and inorganic growth.",
            "Sentiment": "neutral",
            "PublishDate": 1763046777357,
            "Source": "corporate_action"
        },
        {
            "Title": "Amber Enterprises Reports Flat Revenue of ₹1,647 Crores Despite 30-35% Industry Decline in Q2 FY26",
            "Summary": "Amber Enterprises India Limited delivered flat revenue of ₹1,647 crores in Q2 FY26 compared to the previous year, despite a sharp 30-35% decline in the room air conditioning industry due to unfavorable weather and customer purchase deferrals between GST rate cut announcement and implementation. The company reported operating EBITDA of ₹98 crores (down 19%) and a loss after tax of ₹32 crores. The Consumer Durable division saw revenue decline by 18% against the industry's steeper fall. Electronics division grew 30% to ₹642 crores, while Railway division recorded 7% growth to ₹132 crores. During the quarter, Amber raised ₹1,000 crores through QIP from marquee investors, and ILJIN Electronics secured ₹1,750 crores funding. The company completed acquisitions of 60% stake in Power-One Microsystems and 40.2% in Israel-based Unitronics. Amber's PCB project under ECMS scheme received approval with planned investment of ₹991 crores. Management expects Consumer Durable division to grow 13-15% for the year and Electronics division to reach over ₹3,200 crores revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1763018728109,
            "Source": "earnings"
        },
        {
            "Title": "Amber Enterprises Reports Mixed Q2 Results with 25% Revenue Growth Offset by Profit Decline",
            "Summary": "Amber Enterprises India Limited reported consolidated revenue growth of 25% to ₹5,096 crores for H1FY26 compared to ₹4,086 crores in H1FY25. However, the company posted a net loss of ₹32 crores in Q2FY26 versus a profit of ₹24 crores in Q2FY25. Operating EBITDA increased 13% to ₹361 crores in H1FY26. The Consumer Durables Division faced challenges due to unfavorable weather conditions and GST reduction announcements affecting RAC industry demand. The Electronics Division showed strong performance with 60% revenue growth and 30% operating EBITDA growth in H1FY26, supported by the Power-One acquisition. The Railway Sub-systems & Defense Division achieved 17% revenue growth. The company completed expansion projects including ILJIN Electronics' acquisition of 40.2% stake in Unitronics and majority stake purchase in Power-One Microsystems. Finance costs increased due to the Power-One acquisition and elevated inventory levels.",
            "Sentiment": "neutral",
            "PublishDate": 1762476705055,
            "Source": "earnings"
        },
        {
            "Title": "Amber Enterprises Allots 23,100 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Amber Enterprises India Limited allotted 23,100 equity shares with a face value of Rs. 10 each to eligible employees and subsidiaries under its Employee Stock Option Plan 2017. The Share Allotment Committee approved the allotment on November 6, 2025. Following this allotment, the company's paid-up equity share capital increased from 35,148,942 shares to 35,172,042 shares. The total issued share capital after this allotment stands at Rs. 35,17,20,420. The newly allotted shares rank pari-passu with existing equity shares and are listed on NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1762461135013,
            "Source": "corporate_action"
        },
        {
            "Title": "Amber Enterprises Reports Mixed Q2 Results with Major Acquisitions and QIP Fundraising",
            "Summary": "Amber Enterprises India Limited announced its unaudited financial results for the quarter ended September 30, 2025. The company completed several strategic acquisitions including Power-One Micro Systems Private Limited for Rs. 26,200 lakhs through subsidiary ILJIN Electronics, and ILJIN Holding Ltd. The company raised Rs. 99,999.95 lakhs through a Qualified Institutional Placement (QIP) by issuing 12,57,861 equity shares at Rs. 7,950 per share. ILJIN also received Rs. 37,000.11 lakhs through issuance of Compulsory Convertible Preference Shares. The results include consolidated financials covering the holding company and its subsidiaries across Consumer Durables, Electronics, and Railway Sub-systems & Defense divisions. The company's auditors S.R. Batliboi & Co. LLP issued unmodified review reports for both standalone and consolidated results.",
            "Sentiment": "neutral",
            "PublishDate": 1762453988610,
            "Source": "earnings"
        },
        {
            "Title": "Amber Enterprises Reports No Deviation in Rs 1,000 Crore QIP Fund Utilization",
            "Summary": "Amber Enterprises India Limited submitted a monitoring agency report for its Rs 1,000 crore Qualified Institutions Placement (QIP) for the quarter ended September 30, 2025. CARE Ratings Limited, the appointed monitoring agency, reported no deviation from the stated objectives and no range of deviation. The company utilized Rs 986 crore as per disclosures in the offer document. Specifically, Rs 900 crore was used for repayment of outstanding borrowings of the company and its subsidiaries, and Rs 86 crore was deployed for general corporate purposes including working capital repayments. The QIP issue period was from September 16, 2025 to September 22, 2025. Rs 14 crore remains unutilized and is held in an escrow account. The report was reviewed by the Audit Committee and approved by the Board of Directors.",
            "Sentiment": "neutral",
            "PublishDate": 1762449373071,
            "Source": "stock"
        },
        {
            "Title": "Amber Enterprises India Reports Q2 Net Loss of 329M Rupees, Revenue Declines to 16.5B Rupees",
            "Summary": "Amber Enterprises India reported quarterly results showing a net loss of 329 million rupees compared to 192.5 million rupees in the same period last year. Revenue decreased to 16.5 billion rupees from 16.8 billion rupees year-over-year. EBITDA fell to 913 million rupees from 1.13 billion rupees, while EBITDA margin compressed to 5.54% from 6.75% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762432129082,
            "Source": "earnings"
        },
        {
            "Title": "Il Jin Electronics Acquires 5.6 Million Unitronics Shares from Amber Enterprises India",
            "Summary": "Il Jin Electronics has purchased 5.6 million shares of Unitronics from Amber Enterprises India. The transaction involves a share transfer between the companies, though specific financial details of the deal were not disclosed.",
            "Sentiment": "neutral",
            "PublishDate": 1760017379278,
            "Source": "order&deals"
        },
        {
            "Title": "Amber Enterprises Acquires Full Stake in Iljin Holding Ltd",
            "Summary": "Amber Enterprises has acquired the complete stake in Iljin Holding Ltd, making Iljin Holding a wholly-owned subsidiary. The acquisition is expected to enhance Amber's investment in Unitronics.",
            "Sentiment": "positive",
            "PublishDate": 1759735059552,
            "Source": "order&deals"
        },
        {
            "Title": "Amber Enterprises Subsidiary ILJIN Electronics Raises Rs 550 Crores Through Preference Share Issuance",
            "Summary": "Amber Enterprises India Limited executed shareholders' agreements and securities subscription agreements with its material subsidiary ILJIN Electronics (India) Private Limited and multiple investors. ILJIN will issue 8,45,092 Compulsorily Convertible Preference Shares worth Rs 550 crores to raise funds for organic and inorganic growth of the electronics segment. The investors include Singularity Equity Fund, Axis New Opportunities AIF, Nuvama Crossover Opportunities Fund, Motilal Oswal Finvest Limited, Avendus Future Leaders Fund III, Incred Wealth And Investment Services, and Frangipani Capital Advisors. Amber currently holds 90.22% of ILJIN's total paid-up equity share capital, which will be reduced following the CCPS issuance. The investors will receive standard pre-emptive rights and other customary rights. The CCPS conversion will occur at a mutually agreed price between parties at the time of conversion.",
            "Sentiment": "positive",
            "PublishDate": 1758824524085,
            "Source": "corporate_action"
        },
        {
            "Title": "Amber Enterprises Completes QIP, Raises Rs. 1,000 Crore Through Share Allocation",
            "Summary": "Amber Enterprises India Limited has closed its qualified institutions placement, allocating 12,57,861 equity shares at Rs. 7,950 per share to eligible qualified institutional buyers. The Fund Raising Committee approved the closure of the issue on September 22, 2025, after receiving application forms and funds in the escrow account. Each equity share carries a face value of Rs. 10 with a premium of Rs. 7,940 per share. The company has adopted a placement document and will send allocation confirmation notes to the institutional buyers.",
            "Sentiment": "positive",
            "PublishDate": 1758554553420,
            "Source": "corporate_action"
        },
        {
            "Title": "Amber Enterprises' Subsidiary Acquires Israeli Entity ILJIN Holding Ltd as Strategic Investment Platform",
            "Summary": "IL JIN Electronics (India) Private Limited, a material subsidiary of Amber Enterprises India Limited, acquired 100% equity stake in ILJIN Holding Ltd on September 21, 2025. The acquisition involved purchasing 100 ordinary shares from existing shareholder Gary Sussman through cash consideration. ILJIN Holding Ltd, incorporated on September 7, 2025 under Israeli law, becomes a wholly owned subsidiary of ILJIN and a step-down subsidiary of Amber Enterprises. The newly formed entity serves as a special purpose vehicle to facilitate ILJIN's strategic international investments and acquisitions. ILJIN Holding has no operational history or turnover as it was established exclusively to support international investment strategy. The acquisition does not constitute a related party transaction and required no governmental or regulatory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1758457827651,
            "Source": "order&deals"
        },
        {
            "Title": "Amber Enterprises Launches QIP with Floor Price Set at Rs 7,790.88 Per Share",
            "Summary": "Amber Enterprises India Limited has launched a qualified institutions placement (QIP) of equity shares with a face value of Rs 10 each. The Fund Raising Committee approved opening the issue on September 16, 2025, and set the floor price at Rs 7,790.88 per equity share based on SEBI ICDR Regulations pricing formula. The company may offer a discount of up to 5% on the floor price. The issue received prior approvals from the Board of Directors on July 12, 2025, and shareholders through a special resolution at the Annual General Meeting held on August 11, 2025. The preliminary placement document dated September 16, 2025, has been filed with BSE and NSE. The trading window for designated persons has been closed until further notice in accordance with insider trading regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1758031325292,
            "Source": "corporate_action"
        },
        {
            "Title": "Amber Enterprises Raises Rs 100 Crore for Material Subsidiary ILJIN Electronics Through CCPS Issuance",
            "Summary": "Amber Enterprises India Limited executed Shareholders' Agreements and Securities Subscription Agreements with its material subsidiary ILJIN Electronics (India) Private Limited and investors on September 6, 2025. The agreements facilitate raising Rs 100 crore for ILJIN's organic and inorganic growth in the electronics segment through issuance of 1,53,653 Compulsorily Convertible Preference Shares (CCPS) to Incred Growth Partners Fund I and Incred Wealth and Investment Services Private Limited. Amber currently holds 90.22% of ILJIN's total paid-up equity share capital, which will be reduced following the CCPS issuance. The investors will receive standard pre-emptive rights customary to such transactions. CCPS conversion will occur at a mutually agreed price between parties at the time of conversion.",
            "Sentiment": "positive",
            "PublishDate": 1757219558341,
            "Source": "corporate_action"
        },
        {
            "Title": "Amber Enterprises' Subsidiary ILJIN Electronics Raises Rs 1,100 Crore from Three Investors",
            "Summary": "Amber Enterprises India Limited executed shareholders' agreements and securities subscription agreements with its material subsidiary ILJIN Electronics (India) Private Limited and three investors - Raptor Investments Limited, Two Infinity Partners, and Chryscapital Fund X. ILJIN will issue 38,414 equity shares worth Rs 25 crore and 16,51,768 compulsorily convertible preference shares worth Rs 1,075 crore to raise total funds of Rs 1,100 crore for organic and inorganic growth of the electronics segment. The transaction will reduce Amber's shareholding in ILJIN from the current 90.22%. The investors will collectively have the right to nominate one non-executive director on ILJIN's board and will receive standard pre-emptive rights. The CCPS conversion will occur at a mutually agreed price between parties at the time of conversion.",
            "Sentiment": "positive",
            "PublishDate": 1757218614977,
            "Source": "corporate_action"
        },
        {
            "Title": "Gowthama & Company Resigns as Statutory Auditor of Amber Enterprises' Material Subsidiary",
            "Summary": "M/s Gowthama & Company has resigned from their position as statutory auditors of Ascent Circuits Private Limited, a material step-down subsidiary of Amber Enterprises India Limited. The auditors cited preoccupancy with other assignments as the reason for their resignation. Gowthama & Company was appointed on September 30, 2022, with their term originally scheduled to expire in March 2027. Their latest work was a limited review report for the quarter ending June 30, 2025, submitted on July 26, 2025. The resigning auditors confirmed they have not raised any concerns regarding the company's management and stated there are no other material reasons for their resignation beyond those provided.",
            "Sentiment": "neutral",
            "PublishDate": 1754636765568,
            "Source": "corporate_governance"
        },
        {
            "Title": "Amber Enterprises Reports 44% Revenue Growth in Q1FY26, Announces Strategic Acquisitions Worth ₹665 Crores",
            "Summary": "Amber Enterprises India Limited reported consolidated revenue growth of 44% to ₹3,449 crores for Q1FY26, with operating EBITDA increasing 31% to ₹263 crores and PAT growing 42% to ₹106 crores. The Consumer Durables division achieved 33% revenue growth to ₹2,560 crores despite challenging conditions in the room AC industry. The Electronics division delivered exceptional performance with 97% revenue growth to ₹766 crores, while the Railway division recorded 29% growth to ₹123 crores. The company announced two major acquisitions: Power-One Micro Systems for ₹262 crores, which operates in battery energy storage and solar inverter space with 17-18% EBITDA margins on ₹245 crores revenue base, and a 40.24% stake in Unitronics Israel for ₹403 crores, an industrial automation company with 30% EBITDA margins on $57 million revenue base. Amber filed applications under Electronics Manufacturing Component Scheme worth ₹990 crores for multilayer PCBs and ₹3,200 crores for HDI PCBs through Korea Circuit JV. The company targets taking its Electronics division to $1 billion revenue within three years with 11.5-12% EBITDA margins and expects consolidated margins of 8-9% by FY26 end.",
            "Sentiment": "positive",
            "PublishDate": 1754399385124,
            "Source": "earnings"
        },
        {
            "Title": "IL JIN Electronics Acquires 60% Stake in Power-One Micro Systems for Rs. 262 Crore",
            "Summary": "IL JIN Electronics (India) Private Limited, a material subsidiary of Amber Enterprises India Limited, has completed the acquisition of a 60% stake in Power-One Micro Systems Private Limited for Rs. 262 crore. The transaction was completed on August 5, 2025, with the consideration subject to adjustments as per definitive agreements. Following this acquisition, Power-One has become a subsidiary of IL JIN and a step-down subsidiary of Amber Enterprises India Limited.",
            "Sentiment": "positive",
            "PublishDate": 1754397215481,
            "Source": "order&deals"
        },
        {
            "Title": "Amber Enterprises Completes Amalgamation of Subsidiaries IL JIN Electronics and Ever Electronics",
            "Summary": "Amber Enterprises India Limited announced the completion of a merger between two of its subsidiaries - IL JIN Electronics (India) Private Limited and Ever Electronics Private Limited. The National Company Law Tribunal, Mumbai approved the amalgamation scheme on May 30, 2025, with the certified copy issued on June 24, 2025. The scheme became effective on June 27, 2025, when both companies filed the required forms with the Registrar of Companies, Pune. Final approval for IL JIN was received on August 4, 2025, resulting in Ever Electronics' status being changed to an amalgamated company. IL JIN Electronics was identified as a material subsidiary of Amber Enterprises, while Ever Electronics was a subsidiary of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1754315188203,
            "Source": "corporate_action"
        },
        {
            "Title": "Amber Enterprise Acquires Power-One Micro Systems to Expand Electronics Division",
            "Summary": "Amber Enterprise has acquired Power-One Micro Systems in a strategic move to strengthen its electronics division. The acquisition will enable Amber Enterprise to enter new market segments including battery storage, solar inverters, EV chargers, and UPS systems.",
            "Sentiment": "positive",
            "PublishDate": 1753799702417,
            "Source": "order&deals"
        },
        {
            "Title": "Amber Enterprises Reports Strong Quarterly Performance, Plans Revenue Expansion",
            "Summary": "Amber Enterprises delivered strong first quarter performance and outlined ambitious growth plans. The company aims to boost component exports and expand its electronics and EMS capabilities through strategic joint ventures. Amber Enterprises plans to double revenue from mobility, railways, and defense sectors within the next two years. The growth strategy is supported by backward integration initiatives and improved operating efficiency measures.",
            "Sentiment": "positive",
            "PublishDate": 1753798399352,
            "Source": "stock"
        },
        {
            "Title": "Amber Enterprises Reports 44% Revenue Growth to ₹3,449 Crore in Q1FY26",
            "Summary": "Amber Enterprises India Limited reported strong quarterly results with revenue growing 44% year-over-year to ₹3,449 crore. Operating EBITDA increased 31% to ₹263 crore, while profit after tax rose 42% to ₹106 crore. The Consumer Durables Division drove growth with 33% revenue increase to ₹2,560 crore despite challenging conditions in the RAC industry. The Electronics Division showed exceptional performance with 97% revenue growth to ₹766 crore, supported by anti-dumping duties on PCBs. The Railway Sub-systems & Defense Division grew 29% to ₹123 crore, driven by metro projects. The company filed applications under the Electronic Component Manufacturing Scheme for multi-layer and HDI PCBs. ILJIN Electronics signed agreements to acquire majority stakes in Power-One and 40.24% in Israeli company Unitronics for ₹403 crore, expanding into industrial applications and global markets.",
            "Sentiment": "positive",
            "PublishDate": 1753792001558,
            "Source": "earnings"
        },
        {
            "Title": "Amber Enterprises India Reports 44% Jump in Quarterly Net Profit to 1.04 Billion Rupees",
            "Summary": "Amber Enterprises India reported consolidated net profit of 1.04 billion rupees for the first quarter, compared to 724 million rupees in the same period last year, representing a year-on-year increase of approximately 44%.",
            "Sentiment": "positive",
            "PublishDate": 1753775016852,
            "Source": "earnings"
        },
        {
            "Title": "Il Jin Plans to Acquire Control of Israeli Company Unitronics 1989 Ltd.",
            "Summary": "Il Jin is planning to take control of Unitronics 1989 Ltd., an Israeli company listed on the Tel Aviv Stock Exchange. The announcement was made in relation to Amber Enterprises.",
            "Sentiment": "neutral",
            "PublishDate": 1753666955722,
            "Source": "stock"
        },
        {
            "Title": "Amber Enterprises' Subsidiary ILJIN Acquires 40.24% Stake in Israeli Automation Company Unitronics",
            "Summary": "ILJIN Electronics (India) Private Limited, a material subsidiary of Amber Enterprises India Limited, has entered into agreements to acquire approximately 40.24% stake in Unitronics (1989) (R\"G) Ltd., an Israel-based industrial automation company. Following the acquisition, ILJIN and Mr. Haim Shani will jointly control approximately 45.13% of Unitronics, making it a subsidiary of ILJIN. The acquisition involves purchasing 5,624,591 shares at NIS 27.75 per share for an aggregate purchase price of NIS 156,082,400.3. Unitronics, founded in 1989 and listed on Tel Aviv Stock Exchange since 2004, specializes in industrial automation products including PLCs, HMIs, VFDs, Servo Drives, and IoT solutions. The company reported revenues of NIS 192,236 thousand in 2024, NIS 211,671 thousand in 2023, and NIS 155,520 thousand in 2022. The acquisition aligns with Amber's Electronic Division strategy to expand into industrial applications and leverage backward integration capabilities for manufacturing localization. The transaction is expected to complete within 60 business days and requires no governmental or regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1753661249423,
            "Source": "order&deals"
        },
        {
            "Title": "Amber Enterprises India Schedules Q1FY26 Earnings Call for July 30, 2025",
            "Summary": "Amber Enterprises India Limited has scheduled an earnings call on July 30, 2025, at 9:30 AM IST to discuss the Q1FY26 financial results with investors and analysts. Key executives including the CEO, Managing Director, CFO, and Head of Investor Relations will participate in the call. The company will discuss its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. Participants can pre-register for the call, and both local and international toll-free numbers have been provided for access.",
            "Sentiment": "neutral",
            "PublishDate": 1753432619043,
            "Source": "earnings"
        },
        {
            "Title": "Amber Enterprises India: Board Approves ₹2,500 Crore Fundraising Plan",
            "Summary": "Amber Enterprises' board has approved an enabling resolution to raise up to ₹2,500 crore through issuance of permissible securities. The fundraising is subject to regulatory and shareholder approvals. The decision was made at a board meeting on July 12, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1752328252000,
            "Source": "corporate_action"
        },
        {
            "Title": "Amber Enterprises Approves Plan to Raise Up to ₹2,500 Crore",
            "Summary": "The board of Amber Enterprises has approved a plan to raise up to ₹2,500 crore through allowed securities. No specific details about the type of securities or the timeline for this fundraising were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752319651000,
            "Source": "default"
        },
        {
            "Title": "Amber Enterprises India Plans to Raise Up to 25 Billion Rupees",
            "Summary": "Amber Enterprises India has announced plans to raise funds of up to 25 billion rupees. The company has not provided specific details on how the funds will be used or the method of fundraising.",
            "Sentiment": "neutral",
            "PublishDate": 1752061749000,
            "Source": "default"
        },
        {
            "Title": "Amber Enterprises: Subsidiary Acquires Majority Stake in Power-One Micro Systems",
            "Summary": "Amber Enterprises' subsidiary IL JIN Electronics India has agreed to acquire a majority stake in Power-One Micro Systems, a Bengaluru-based company specializing in battery energy storage systems, solar inverters, EV chargers, and UPS. The acquisition aims to expand Amber's electronic division into growing sectors like BESS and EV charging.",
            "Sentiment": "positive",
            "PublishDate": 1751251122000,
            "Source": "corporate_action"
        },
        {
            "Title": "Amber Enterprises' Subsidiary to Acquire Majority Stake in Power-One Micro Systems",
            "Summary": "Iljin Electronics, a subsidiary of Amber Enterprises, is set to purchase a majority stake in Power-One Micro Systems. This acquisition will expand Iljin Electronics' presence in the energy solutions sector, including solar inverters, Battery Energy Storage Systems (BESS), Uninterruptible Power Supply (UPS), and Electric Vehicle (EV) chargers.",
            "Sentiment": "positive",
            "PublishDate": 1751106628000,
            "Source": "default"
        },
        {
            "Title": "Amber Enterprises Names Ascent Circuits as Significant Subsidiary",
            "Summary": "Amber Enterprises has designated Ascent Circuits as a significant subsidiary of the company. No further details about the nature of this designation or its implications were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1750341120000,
            "Source": "default"
        },
        {
            "Title": "Amber Enterprises: Strong Q4 Performance Drives Optimism",
            "Summary": "Amber Enterprises reported strong Q4 results with 30-40% revenue and EBITDA growth. CLSA upgraded the stock to 'outperform' with a target price of Rs 7,275, citing robust growth in electronics (74% YoY) and consumer durables. Jefferies maintained a 'buy' rating with a Rs 8,600 target, projecting +50% EPS CAGR over FY25-28. The company plans Rs 250 crore capex for FY26 to support new customer wins and growth in emerging verticals.",
            "Sentiment": "positive",
            "PublishDate": 1747710079000,
            "Source": "earnings"
        },
        {
            "Title": "Amber Enterprises: Q4 Revenue Surges 33.8%, Dolat Capital Maintains 'Accumulate'",
            "Summary": "Amber Enterprises reported a 33.8% increase in Q4 revenue to Rs. 37.5 billion. Ebitda grew 32.8% YoY to Rs 2,948 million, with margin remaining flat at 7.9%. PAT rose 22.6% to Rs 1,161 million. Net working capital improved from 13 to 9 days in FY25. Dolat Capital maintains 'Accumulate' rating based on strong growth outlook.",
            "Sentiment": "positive",
            "PublishDate": 1747660091000,
            "Source": "earnings"
        },
        {
            "Title": "Amber Enterprises: Electronics Division Growth to Boost Margins by FY29",
            "Summary": "Amber Enterprises expects its electronics division to achieve double-digit margins by FY28, leading to consolidated margins of 9-9.5% by FY29. The company plans to invest Rs 3,000 crore in the new PLI scheme for passive electronics components. Amber's electronics division is growing 45-50% annually, with margins improving from 2.8% to 7.5-8%.",
            "Sentiment": "positive",
            "PublishDate": 1743777436000,
            "Source": "normal_news"
        },
        {
            "Title": "Amber Enterprises India Receives Show Cause Notice from Noida Customs",
            "Summary": "Amber Enterprises India has been issued a show cause notice by the Noida Customs authorities. The company plans to respond to the notice after consulting with relevant parties.",
            "Sentiment": "neutral",
            "PublishDate": 1741220817000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Amber Enterprises India Receives Show Cause Notice from Noida Customs",
            "Summary": "Amber Enterprises India has been issued a show cause notice by the Noida Customs authorities. The company has stated that it will submit a reply to the notice after consulting with relevant parties.",
            "Sentiment": "neutral",
            "PublishDate": 1741178756000,
            "Source": "corporate_governance"
        }
    ]
}