{
    "Symbol": "AMBIKCO",
    "ISIN": "INE540G01014",
    "News": [
        {
            "Title": "Ambika Cotton Mills Faces ₹1.80 Lakh ROC Penalty",
            "Summary": "Ambika Cotton Mills Limited received adjudication order from ROC Coimbatore imposing penalty of ₹1.80 lakh for 2-day delay in filing Form MGT-15, citing technical glitches in MCA portal.",
            "Sentiment": "negative",
            "PublishDate": 1768029757108,
            "Source": "stocks"
        },
        {
            "Title": "Ambika Cotton Mills Reports 13.3% Growth in Q2 Net Profit",
            "Summary": "Ambika Cotton Mills reported quarterly net profit of 159.4 million rupees compared to 140.7 million rupees in the same period last year. Revenue remained flat at 2 billion rupees year-over-year. EBITDA increased to 266.9 million rupees from 234 million rupees, while EBITDA margin improved to 13.37% from 11.68%.",
            "Sentiment": "positive",
            "PublishDate": 1762587476353,
            "Source": "earnings"
        },
        {
            "Title": "Ambika Cotton Mills Reports Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "Ambika Cotton Mills Limited announced its unaudited financial results for the quarter and six months ended September 30, 2025. The Board of Directors considered and approved these results at their meeting held on November 8, 2025. The company's other expenditure includes foreign currency fluctuation loss of Rs 5.52 crores, which includes MTM loss of Rs 4.87 crores. The results were subject to limited review by the company's statutory auditors. The company reported no pending investor complaints during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762587425942,
            "Source": "earnings"
        },
        {
            "Title": "Ambika Cotton Mills Approves Final Dividend of ₹37 Per Share at Annual General Meeting",
            "Summary": "Ambika Cotton Mills Limited shareholders approved a final dividend of ₹37 per equity share at the company's 37th Annual General Meeting held on September 27, 2025. The dividend represents 370% on the face value of ₹10 per share. The meeting was conducted through video conferencing and other audio-visual means at 12:00 noon, with shareholders approving the dividend as recommended by the Board.",
            "Sentiment": "positive",
            "PublishDate": 1758960972963,
            "Source": "corporate_action"
        },
        {
            "Title": "Ambika Cotton Mills Fined Rs 27.1 Lakh by NSE and BSE for SEBI Regulation Violations",
            "Summary": "Ambika Cotton Mills Limited has been fined by NSE and BSE for non-compliance with SEBI regulations 17(1)(b) and 17(1A). Each exchange imposed penalties totaling Rs 13.56 lakh including GST, bringing the combined fine to Rs 27.1 lakh. The company filed a waiver application which was rejected by NSE. Ambika Cotton Mills has paid the fine amount and plans to file an appeal before the Securities Appellate Tribunal (SAT) against NSE's order.",
            "Sentiment": "negative",
            "PublishDate": 1757763237461,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ambika Cotton Mills Announces Book Closure and Rs 37 Final Dividend for FY2024-25",
            "Summary": "Ambika Cotton Mills Limited has announced a book closure period from September 21-27, 2025, for its 37th Annual General Meeting scheduled for September 27, 2025. The company has recommended a final dividend of Rs 37 per equity share (face value Rs 10 each) for financial year 2024-25, subject to shareholder approval. Shareholders registered as of September 20, 2025, will be eligible for the dividend payment. The AGM will be conducted through video conferencing and will address ordinary business including adoption of audited financial statements and director re-appointment, as well as special business items including approval for continued directorship, secretarial auditor appointment, amendment of Articles of Association to increase maximum directors from nine to fifteen, voluntary delisting from BSE while remaining listed on NSE, and ratification of cost auditor remuneration of Rs 75,000.",
            "Sentiment": "positive",
            "PublishDate": 1756369267799,
            "Source": "corporate_action"
        },
        {
            "Title": "Ambika Cotton Mills Reports Q1 Results with Revenue at Rs 191.98 Crore",
            "Summary": "Ambika Cotton Mills Limited announced its quarterly results for the period ended June 30, 2025. The company reported revenue from operations of Rs 191.98 crore compared to Rs 136.31 crore in the previous quarter and Rs 209.09 crore in the same quarter last year. Total income stood at Rs 195.27 crore. The company posted a profit of Rs 15.92 crore for the quarter, slightly higher than Rs 15.86 crore in the previous quarter but lower than Rs 21.53 crore in the corresponding quarter of the previous year. Basic and diluted earnings per share were Rs 27.81 compared to Rs 37.61 in the same quarter last year. The Board of Directors approved these results in their meeting held on August 8, 2025. The results have been subject to limited review by statutory auditors.",
            "Sentiment": "neutral",
            "PublishDate": 1754639127676,
            "Source": "earnings"
        },
        {
            "Title": "Ambika Cotton Mills Reports Decline in Q1 Financial Performance",
            "Summary": "Ambika Cotton Mills reported quarterly revenue of 1.9 billion rupees, down from 2.1 billion rupees in the same period last year. The company's EBITDA decreased to 269 million rupees from 338 million rupees year-over-year, with EBITDA margin falling to 14.03% from 16.19%. Net profit also declined to 159 million rupees compared to 215 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754638650822,
            "Source": "earnings"
        },
        {
            "Title": "Ambika Cotton Mills Announces Q4 Results and Dividend",
            "Summary": "Ambika Cotton Mills has declared a dividend of 37 rupees per share. The company reported Q4 financial results: EBITDA of 236 million rupees compared to 304 million rupees year-over-year, with EBITDA margin improving to 17.32% from 14.76%. Revenue decreased to 1.36 billion rupees from 2.1 billion rupees in the same quarter last year. Net profit slightly declined to 159 million rupees from 161 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1748332255000,
            "Source": "result"
        },
        {
            "Title": "Ambika Cotton Mills Reports Q3 Revenue Decline",
            "Summary": "Ambika Cotton Mills has reported a decrease in revenue for the third quarter. The company's revenue stood at 1.6 billion rupees, down from 2 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1739261858000,
            "Source": "earnings"
        },
        {
            "Title": "Ambika Cotton Mills Reports Q3 EBITDA and Margin Results",
            "Summary": "Ambika Cotton Mills has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 224 million rupees, compared to 273 million rupees in the same quarter of the previous year, showing a year-over-year decrease. However, the EBITDA margin improved to 14.37% from 13.91% in the corresponding period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739261854000,
            "Source": "earnings"
        },
        {
            "Title": "Ambika Cotton Mills Reports Q3 Net Profit Increase",
            "Summary": "Ambika Cotton Mills has reported a net profit of 143 million rupees for the third quarter, compared to 130 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1739261780000,
            "Source": "earnings"
        },
        {
            "Title": "Ambika Cotton Mills Reports Q2 EBITDA Decline",
            "Summary": "Ambika Cotton Mills has reported its Q2 EBITDA as 234 million rupees, down from 264.5 million rupees in the same quarter last year. The company's Q2 EBITDA margin also decreased to 11.68% from 13.26% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731050498000,
            "Source": "result"
        },
        {
            "Title": "Ambika Cotton Mills Reports Q2 Revenue Increase",
            "Summary": "Ambika Cotton Mills has reported a revenue of 2 billion rupees for the second quarter, compared to 1.9 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731050463000,
            "Source": "result"
        },
        {
            "Title": "Ambika Cotton Mills Reports Q2 Net Profit Increase",
            "Summary": "Ambika Cotton Mills has reported a net profit of 141 million rupees for the second quarter, compared to 131 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731050438000,
            "Source": "result"
        }
    ]
}