{
    "Symbol": "AMBICAAGAR",
    "ISIN": "INE792B01012",
    "News": [
        {
            "Title": "Venkata Rajya Lakshmi Sravika Sakala Acquires 11.06% Stake in Ambica Agarbathies Aroma Industries",
            "Summary": "Venkata Rajya Lakshmi Sravika Sakala acquired 19,00,000 shares representing 11.06% voting rights in Ambica Agarbathies Aroma Industries Limited through release of encumbered shares on 20 November, 2025. The acquisition was disclosed under SEBI substantial acquisition regulations, with the acquirer being a non-promoter entity in the company listed on National Stock Exchange of India.",
            "Sentiment": "neutral",
            "PublishDate": 1763971902088,
            "Source": "corporate_action"
        },
        {
            "Title": "Rich N Rich Finance Releases Encumbered Shares in Ambica Agarbathies Aroma Industries",
            "Summary": "Rich N Rich Finance and Holdings Limited released its entire encumbered holding of 19,00,000 shares (11.06% stake) in Ambica Agarbathies Aroma Industries Limited on November 20, 2025. The release of encumbrance reduces Rich N Rich's shareholding from 11.06% to nil, affecting the ownership structure of the target company.",
            "Sentiment": "neutral",
            "PublishDate": 1763795214862,
            "Source": "corporate_action"
        },
        {
            "Title": "Ambica Agarbathies Aroma Industries Reports Quarterly Results for Period Ended September 30, 2025",
            "Summary": "Ambica Agarbathies Aroma Industries Limited announced its unaudited financial results for the second quarter and half year ended September 30, 2025. The company reported total income of Rs 68.65 crores for the half year compared to Rs 58.99 crores in the previous year. Net profit for the half year stood at Rs 2.07 crores versus Rs 2.05 crores in the prior year. The company operates two business segments - Agarbathies Division which generated Rs 51.90 crores in half-year revenue, and Hotel Division contributing Rs 16.76 crores. Basic earnings per share was Rs 4.20 for the half year. The company noted irregular repayment of EMIs to LIC Housing Finance Limited due to cash flow constraints from COVID-19 impact, though management expects to regularize payments going forward.",
            "Sentiment": "neutral",
            "PublishDate": 1762815532970,
            "Source": "earnings"
        },
        {
            "Title": "Ambica Agarbathies Reports 31% Revenue Growth in Q1 with Strong Profitability Recovery",
            "Summary": "Ambica Agarbathies Aroma & Industries Limited reported revenue from operations of Rs 3,014.35 lakhs for the quarter ended June 30, 2025, representing a 31% increase from Rs 2,300.63 lakhs in the same quarter last year. The company posted a profit of Rs 113.53 lakhs compared to Rs 111.73 lakhs in the previous year quarter, showing improved performance after a loss of Rs 193.53 lakhs in the March 2025 quarter. Total income reached Rs 3,188.15 lakhs including other income of Rs 173.80 lakhs. The company operates through two divisions - Agarbathies Division generated Rs 2,351.69 lakhs in revenue while Hotel Division contributed Rs 836.46 lakhs. Earnings per share stood at Rs 0.66 for the quarter. The company noted that its hotel division faced challenges due to COVID-19 impact, leading to irregular EMI payments to UC Housing Finance Limited, though management expects to regularize payments going forward.",
            "Sentiment": "positive",
            "PublishDate": 1755100814301,
            "Source": "earnings"
        }
    ]
}