{
    "Symbol": "AMBUJACEM",
    "ISIN": "INE079A01024",
    "News": [
        {
            "Title": "Ambuja Cements Issues IEPF Share Transfer Notice",
            "Summary": "Ambuja Cements Limited published newspaper notices to shareholders regarding compulsory transfer of unclaimed equity shares to IEPF Account, with deadline set for April 25, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770397839411,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ambuja Cements Issues IEPF Share Transfer Notice",
            "Summary": "Ambuja Cements notifies shareholders about compulsory transfer of equity shares to IEPF for unclaimed dividends spanning 2018-2025, with April 25, 2026 deadline to claim.",
            "Sentiment": "neutral",
            "PublishDate": 1770290900019,
            "Source": "stocks"
        },
        {
            "Title": "Ambuja Cements Plans UAE Investor Roadshow Feb 12-13",
            "Summary": "Ambuja Cements announces non-deal roadshow in UAE for February 12-13, 2026, featuring in-person investor and analyst interactions from 9 AM to 6 PM local time.",
            "Sentiment": "neutral",
            "PublishDate": 1770215719705,
            "Source": "stocks"
        },
        {
            "Title": "Ambuja Cements Q3FY26 Results & Leadership Changes",
            "Summary": "Ambuja Cements announced Q3FY26 financial results with revenue of ₹5,908.67 crore and profit after tax of ₹203.99 crore. Board approved senior management changes including MD Ajay Kapur's superannuation.",
            "Sentiment": "neutral",
            "PublishDate": 1769764871005,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ambuja Cements shares drop 5.6% amid volume surge",
            "Summary": "Ambuja Cements shares declined 5.6% to ₹516 in Friday's trading session driven by high volume. The company reported revenue of ₹9,174.49 crore and net profit of ₹2,297.89 crore in September 2025 quarter.",
            "Sentiment": "negative",
            "PublishDate": 1769159692863,
            "Source": "stocks"
        },
        {
            "Title": "Ambuja Cements Expands Rajasthan Capacity by 2.4 MT",
            "Summary": "Ambuja Cements successfully completes expansion of its cement grinding unit in Rajasthan, adding 2.4 million tons of annual production capacity to strengthen its market position.",
            "Sentiment": "positive",
            "PublishDate": 1768579047968,
            "Source": "stocks"
        },
        {
            "Title": "Ambuja Cements Q3FY26 Results Call on Jan 30",
            "Summary": "Ambuja Cements schedules post-results conference call for January 30, 2026 at 5:00 PM to discuss Q3FY26 earnings with senior management team including CEO and CFO.",
            "Sentiment": "neutral",
            "PublishDate": 1768311692022,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ambuja Cements Leads Nirmal Bang's Top Cement Picks",
            "Summary": "Nirmal Bang maintains constructive stance on cement sector for Q3 FY26, highlighting Ambuja Cements as preferred large-cap pick followed by Ramco Cements and Nuvoco Vistas amid strong demand trends.",
            "Sentiment": "positive",
            "PublishDate": 1767856042568,
            "Source": "stocks"
        },
        {
            "Title": "Ambuja Cements Sees ₹141.45 Cr NSE Block Trade",
            "Summary": "Ambuja Cements witnessed a significant block trade on NSE worth ₹141.45 crores involving 2,509,516 shares at ₹563.65 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767763340112,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ambuja Cements clarifies volume surge to BSE",
            "Summary": "Ambuja Cements responds to BSE inquiry about significant trading volume increase, stating movement is purely market-driven with no management control or specific knowledge of reasons.",
            "Sentiment": "neutral",
            "PublishDate": 1766566069124,
            "Source": "stocks"
        },
        {
            "Title": "CITI Sets Buy Rating on Ambuja Cement at ₹625 Target",
            "Summary": "CITI Research has issued a Buy recommendation for Ambuja Cement with a target price of ₹625 per share, indicating positive outlook for the cement manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1766548361699,
            "Source": "stocks"
        },
        {
            "Title": "Macquarie Sets ₹608 Target for Ambuja Cement",
            "Summary": "Macquarie maintains outperform rating on Ambuja Cement with target price of ₹608, reflecting positive outlook on the cement major's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1766548337535,
            "Source": "stocks"
        },
        {
            "Title": "CLSA Sets ₹680 Price Target for Ambuja Cements",
            "Summary": "CLSA maintains Outperform rating on Ambuja Cements with price target of ₹680, reflecting positive outlook on the cement manufacturer's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1766461608761,
            "Source": "stocks"
        },
        {
            "Title": "Morgan Stanley Maintains Overweight on Ambuja Cements",
            "Summary": "Morgan Stanley maintains 'Overweight' rating on Ambuja Cements with a price target of ₹650.00, reflecting positive outlook on the cement manufacturer's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1766461579230,
            "Source": "stocks"
        },
        {
            "Title": "Antique Maintains Buy Rating on Ambuja Cements",
            "Summary": "Antique Stock Broking maintains its Buy rating on Ambuja Cements with an unchanged target price of ₹690.00, reflecting continued confidence in the cement manufacturer's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1766461554484,
            "Source": "stocks"
        },
        {
            "Title": "ACC Shareholders Approve Merger with Ambuja Cements",
            "Summary": "ACC shareholders approve amalgamation with Ambuja Cements at 328:100 share exchange ratio, part of dual merger creating unified cement platform with 155 MTPA capacity target by FY28.",
            "Sentiment": "positive",
            "PublishDate": 1766416734345,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ambuja Cements Gets ESG Rating of 65 for FY25",
            "Summary": "Ambuja Cements receives ESG rating of 65 in 'Aspiring' category from NSE Sustainability Ratings for Financial Year 2025, demonstrating continued commitment to ESG performance enhancement.",
            "Sentiment": "positive",
            "PublishDate": 1765384752873,
            "Source": "stocks"
        },
        {
            "Title": "Ambuja Cement's Chief Sales & Marketing Officer Navin Malhotra Resigns",
            "Summary": "Navin Malhotra resigned from his position as Chief Sales & Marketing Officer and Senior Management Personnel at Ambuja Cements Limited effective December 6, 2025. Malhotra cited career opportunities outside the organization as the reason for his departure from the cement company.",
            "Sentiment": "neutral",
            "PublishDate": 1765018372741,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ambuja Cements Shareholders Approve Material Related Party Transactions Through Postal Ballot",
            "Summary": "Ambuja Cements Limited shareholders approved two ordinary resolutions through postal ballot voting conducted from October 31 to November 29, 2025, relating to material related party transactions with Penna Cement Industries Limited for Financial Year 2025-26. The first resolution received 99.99% approval while the second resolution between ACC Limited and Penna Cement Industries Limited received 97.32% approval from shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1764668012012,
            "Source": "corporate_action"
        },
        {
            "Title": "Ambuja Cements Begins 4 Million Ton Brownfield Expansion at Bhatapara Clinker Unit",
            "Summary": "Ambuja Cements has commenced a brownfield expansion project at its Bhatapara clinker unit with a capacity of 4 million tons per year. The expansion represents a significant capacity addition for the cement manufacturer at its existing facility.",
            "Sentiment": "positive",
            "PublishDate": 1764596022330,
            "Source": "stock"
        },
        {
            "Title": "Ambuja Cements Receives GST Penalty Order Worth Rs. 22.07 Crore from Patna Tax Authority",
            "Summary": "Ambuja Cements has received a penalty order under Section 73 of CGST/SGST Act 2017 from Assistant Commissioner, Patna for short/non-payment of GST worth Rs. 2.14 crore and excess ITC utilization, with a total penalty of Rs. 22.07 crore imposed. The company plans to contest the order by filing an appeal and does not foresee any material impact on its financial or operational activities.",
            "Sentiment": "negative",
            "PublishDate": 1764167251082,
            "Source": "stock"
        },
        {
            "Title": "ACC Limited Appoints New CFO as Part of Adani Group Leadership Restructuring",
            "Summary": "ACC Limited announced that Rakesh Tiwary will step down as Chief Financial Officer effective November 21, 2025, to transition to a new role within the Adani portfolio of companies. Rohit Soni, who served as CFO of Adani New Industries Limited, will assume the CFO position at ACC Limited starting November 22, 2025, as part of an ongoing leadership development process across the Adani Group.",
            "Sentiment": "neutral",
            "PublishDate": 1763745058646,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sanghi Industries Shareholders Approve Scheme of Arrangement with Ambuja Cements",
            "Summary": "Sanghi Industries Limited shareholders approved the Scheme of Arrangement with Ambuja Cements Limited through an NCLT-convened meeting held on November 20, 2025, with 99.85% votes in favor. The resolution received requisite statutory majority under the Companies Act 2013 and SEBI regulations, with promoters holding 58.08% of paid-up share capital providing authorization.",
            "Sentiment": "positive",
            "PublishDate": 1763662162955,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLT Approves Ambuja Cement-Penna Cement Merger, Shareholder Meeting Set for December 30",
            "Summary": "The National Company Law Tribunal has approved the amalgamation scheme between Penna Cement Industries and Ambuja Cement, directing a shareholder meeting on December 30, 2025 via video conference. The merger will result in cash consideration for Penna Cement shareholders, with Ambuja holding 99.94% stake in the transferor company as of September 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763638141809,
            "Source": "corporate_action"
        },
        {
            "Title": "ACC Becomes India's First Cement Company To Adopt TNFD Guidelines",
            "Summary": "ACC has become India's first cement company to follow Task Force on Nature-related Financial Disclosures (TNFD) guidelines, enhancing transparency on nature-related risks and opportunities. The company will begin official reporting under these guidelines starting in financial year 2026.",
            "Sentiment": "positive",
            "PublishDate": 1763091926462,
            "Source": "stock"
        },
        {
            "Title": "Adani Cement Partners with Coolbrook for World's First Commercial RotoDynamic Heater Deployment",
            "Summary": "Adani Cement and Coolbrook announced a delivery agreement for the world's first commercial deployment of RotoDynamic Heater (RDH) technology at the Boyareddypalli Integrated Cement Plant in Andhra Pradesh, India. The technology will decarbonize the calcination phase of cement production by providing clean heat to dry and enhance alternative fuels. The deployment is expected to directly reduce 60,000 tonnes of CO2 emissions annually with potential to increase 10x in due course. The RDH system will be powered entirely by Adani Cement's renewable energy portfolio, ensuring emission-free industrial heat generation. This supports Adani Cement's net-zero goals by 2050 and targets to increase alternative fuel ratio to 30% and achieve 60% green power share by FY28. The companies plan to launch at least five additional projects within the next two years.",
            "Sentiment": "positive",
            "PublishDate": 1762916517420,
            "Source": "stock"
        },
        {
            "Title": "Ambuja Cement Reports 58% Jump in EBITDA to INR 1,761 Crores in Q2 FY26",
            "Summary": "Ambuja Cement delivered strong quarterly results with sales volume reaching a record 16.6 million tons, up 20% year-on-year, significantly outpacing the industry's 4% growth. Revenue increased 21% to INR 9,174 crores with a 3% price gain. EBITDA surged 58% to INR 1,761 crores, while EBITDA per metric ton jumped 32% to INR 1,060. The company achieved substantial cost reductions of INR 238 per metric ton year-on-year, driven by lower kiln fuel costs at INR 1.65 per 1,000 kilocalories. Profit after tax soared 364% to INR 2,302 crores, including a one-time tax write-back of INR 1,697 crores. The company expanded capacity to 107 million tons and announced debottlenecking initiatives to add 15 million tons at a low capex of INR 48 per ton, revising the target capacity from 140 to 155 million tons by FY28. Premium cement share reached 35% of total trade sales with 28% growth in premium product volumes. The company maintains its debt-free status with CRISIL AAA stable rating and targets further cost reductions to INR 4,000 per ton by March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1762600105634,
            "Source": "earnings"
        },
        {
            "Title": "Ambuja Cements Faces Rs 1.34 Crore Tax Demand from CGST Howrah Commissionerate",
            "Summary": "Ambuja Cements received an order from CGST Howrah Commissionerate disallowing Cenvat Credit of Rs 44.86 lakh and imposing interest and penalty of equal amounts, totaling Rs 1.34 crore. The order was issued under section 74(9) of the CGST Act, 2017, citing disallowance of excess Input Tax Credit availed. The company plans to file an appeal against the order before the appropriate appellate authority and does not foresee any material impact on its financial, operational or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1762350986676,
            "Source": "stock"
        },
        {
            "Title": "Ambuja Cements Reports 22% Revenue Growth and Raises FY28 Capacity Target",
            "Summary": "Ambuja Cements reported consolidated net profit of ₹1,766 crore for the September quarter, significantly higher than ₹480 crore in the same period last year, aided by a tax write-back of ₹1,465 crore. Revenue increased 22% to ₹9,175 crore from ₹7,552 crore, marking the company's highest-ever Q2 topline. The company raised its FY28 capacity target by 15 MTPA to 155 MTPA from the earlier goal of 140 MTPA through debottlenecking at $48 per tonne. Ambuja plans to install 13 blenders across plants over the next 12 months to optimize product mix and enhance premium cement share. The company targets ending FY26 with total cost of ₹4,000 per tonne and expects 5% annual reduction over two years to reach ₹3,650 per tonne by FY28. CEO Vinod Bahety expressed optimism about delivering double-digit revenue growth and four-digit PMT EBITDA for the rest of FY26. Shares traded 1.4% higher at ₹573.20 following the results.",
            "Sentiment": "positive",
            "PublishDate": 1762160462075,
            "Source": "earnings"
        },
        {
            "Title": "Ambuja Cements Reports No Deviations in Use of Preferential Issue Proceeds",
            "Summary": "Ambuja Cements Limited confirmed no deviations or variations in the use of proceeds from its preferential issue of equity shares for the quarter ended September 30, 2025. The company raised Rs 15,000.046 crores in two tranches - Rs 6,660.946 crores in Tranche-1 on March 28, 2024, and Rs 8,339.099 crores in Tranche-2 on April 17, 2024. The funds were allocated for capital expenditures, de-bottlenecking capital expenditure, logistics infrastructure, digitizing logistics, optimizing plants for ESG compliance, acquisitions, consolidation, working capital requirements, technology investment, and general corporate purposes. As of June 30, 2025, Rs 14,795.1 crores had been utilized with no amount used during the reported quarter. The statement was reviewed by the company's Audit Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1762159572279,
            "Source": "corporate_action"
        },
        {
            "Title": "Ambuja Cements Targets Double-Digit Revenue Growth and Four-Digit PMT EBITDA",
            "Summary": "Ambuja Cements has expressed confidence about achieving double-digit revenue growth and maintaining four-digit PMT EBITDA performance. The company maintains a positive outlook on reaching these financial targets.",
            "Sentiment": "positive",
            "PublishDate": 1762157586381,
            "Source": "stock"
        },
        {
            "Title": "Ambuja Cements Raises FY28 Capacity Target to 155 MTPA",
            "Summary": "Ambuja Cements has increased its FY28 capacity goal to 155 MTPA from the previous target of 140 MTPA. The announcement contains conflicting information about the increase amount, with references to both 15 MTPA and 25 MTPA additions, though the final target remains 155 MTPA.",
            "Sentiment": "positive",
            "PublishDate": 1762157214769,
            "Source": "stock"
        },
        {
            "Title": "Ambuja Cements Reports Record Quarterly Volume of 16.6 MT, Up 20% Year-Over-Year",
            "Summary": "Ambuja Cements achieved record quarterly volume of 16.6 million tonnes, representing a 20% increase compared to the same period in the previous year. This marks the company's highest quarterly volume performance.",
            "Sentiment": "positive",
            "PublishDate": 1762156782736,
            "Source": "stock"
        },
        {
            "Title": "Ambuja Cements Reports Mixed Q2 Results with Revenue Growth but Exceptional Charges Impact Profits",
            "Summary": "Ambuja Cements Limited reported quarterly results with revenue from operations reaching ₹7,834 crore compared to ₹7,285 crore in the previous year. The company's profit before tax stood at ₹1,350 crore versus ₹1,437 crore last year. However, the company recorded exceptional expenses of ₹223 crore, primarily due to provisions for government grants related to West Bengal incentive schemes. The company completed several major acquisitions including Orient Cement Limited (72.66% stake) and Penna Cement Industries Limited (99.94% stake). Tax adjustments provided relief with ₹1,180 crore written back due to favorable court decisions. The company's cement segment generated ₹7,536 crore in revenue while ready-mix concrete contributed ₹298 crore. Total assets increased to ₹81,104 crore from ₹57,129 crore in March 2025, reflecting the impact of acquisitions.",
            "Sentiment": "neutral",
            "PublishDate": 1762156734992,
            "Source": "earnings"
        },
        {
            "Title": "Ambuja Cements Reports Strong Q2 Results with ₹18B Net Profit and ₹15B Tax Write-Back",
            "Summary": "Ambuja Cements reported consolidated net profit of ₹18 billion for Q2, significantly higher than ₹5 billion in the same period last year. The company's revenue increased to ₹91.3 billion from ₹73 billion year-over-year. EBITDA rose to ₹17.60 billion compared to ₹11.11 billion previously, with EBITDA margin improving to 19.2% from 15.22%. The company recorded a tax write-back of ₹15 billion versus a tax expense of ₹2.5 billion in the corresponding period last year.",
            "Sentiment": "positive",
            "PublishDate": 1762156280279,
            "Source": "earnings"
        },
        {
            "Title": "NCLT Approves Shareholder Meeting for Penna Cement-Ambuja Cements Merger",
            "Summary": "The National Company Law Tribunal (NCLT) Ahmedabad has directed Ambuja Cements Limited to convene a meeting of equity shareholders on December 30, 2025, at 11:00 a.m. IST via video conference to consider the proposed amalgamation scheme with Penna Cement Industries Limited. The scheme involves amalgamation of Penna Cement (transferor company) with Ambuja Cements (transferee company) with an appointed date of August 16, 2024. Ambuja Cements acquired 99.94% of Penna Cement's paid-up equity share capital. The NCLT dispensed with meetings for various stakeholder categories of both companies, including equity shareholders of Penna Cement (due to consent affidavits from 99.96% shareholders), and unsecured creditors of both companies (as no compromise is offered and liabilities remain unchanged). The tribunal appointed Justice Kalpesh Jhaveri as chairperson for the shareholder meeting. Both companies showed excess of assets over liabilities, with Penna Cement having Rs. 2,967.75 crores and Ambuja Cements having Rs. 48,967.16 crores as of June 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762091309392,
            "Source": "corporate_action"
        },
        {
            "Title": "Ambuja Cements Seeks Shareholder Approval for Material Related Party Transactions with Penna Cement Industries",
            "Summary": "Ambuja Cements has issued a postal ballot notice seeking shareholder approval for material related party transactions with Penna Cement Industries Limited (PCIL) and between PCIL and ACC Limited for Financial Year 2025-26. The transactions include purchase/sale of cement, clinker, raw materials, spare parts, power, and various services. PCIL's capacity utilization has increased significantly from 40% clinker and 30% cement to 90% and 60% respectively following Ambuja's acquisition in August 2024. The proposed transactions are valued at ₹1,500 crore between Ambuja and PCIL, and ₹2,800 crore between PCIL and ACC. The e-voting period runs from October 31, 2025 to November 29, 2025. The Audit Committee and Board have approved these transactions, which are conducted at arm's length and in the ordinary course of business.",
            "Sentiment": "neutral",
            "PublishDate": 1761837623040,
            "Source": "corporate_action"
        },
        {
            "Title": "Ambuja Cements Block Trade Worth Rs. 74.38 Crores Executed on NSE",
            "Summary": "Ambuja Cements Ltd. executed a block trade on the National Stock Exchange involving approximately 1,308,068 shares at Rs. 568.60 per share, totaling Rs. 74.38 crores. The transaction represents a significant institutional trade in the cement company's shares.",
            "Sentiment": "neutral",
            "PublishDate": 1761211279865,
            "Source": "order&deals"
        },
        {
            "Title": "Ambuja Cements Announces Shareholder Meeting for Sanghi Industries Arrangement Scheme",
            "Summary": "Ambuja Cements Limited has scheduled an equity shareholders meeting for November 20, 2025, at 1:00 PM IST via video conferencing to consider a scheme of arrangement with Sanghi Industries Limited. The meeting follows orders from the National Company Law Tribunal, Ahmedabad Bench, dated September 26 and October 9, 2025. Notice was published in newspapers on October 15-16, 2025. The scheme requires approval from a majority representing three-fourths in value of voting equity shareholders, with remote e-voting available from November 15-19, 2025. Justice (Retd.) Kalpesh Jhaveri has been appointed as meeting chairman, with Mr. Raimeen Maradiya as scrutinizer for the voting process.",
            "Sentiment": "neutral",
            "PublishDate": 1760607360706,
            "Source": "corporate_action"
        },
        {
            "Title": "Ambuja Cements Schedules Quarterly Results Review for November 3",
            "Summary": "Ambuja Cements will review its second quarter results on November 3. The cement company has announced this date for examining its quarterly financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1760528055035,
            "Source": "earnings"
        },
        {
            "Title": "Ambuja Cements Receives Tribunal Order for Shareholder Meeting on Sanghi Industries Merger",
            "Summary": "The National Company Law Tribunal, Ahmedabad Bench, has directed Ambuja Cements Limited to convene a meeting of equity shareholders on November 20, 2025, at 1:00 p.m. IST via video conference. The meeting will consider and approve the proposed amalgamation scheme between Sanghi Industries Limited and Ambuja Cements Limited. This follows an earlier disclosure made by the company on December 17, 2024, regarding the merger proposal. Shareholders will vote on whether to approve the arrangement with or without modifications.",
            "Sentiment": "neutral",
            "PublishDate": 1758901902899,
            "Source": "corporate_action"
        },
        {
            "Title": "Ambuja Cements Receives Order Blocking CENVAT Credit With Penalty, Plans Appeal",
            "Summary": "Ambuja Cements has received an order that blocks its CENVAT credit and imposes a penalty. The company plans to appeal this decision.",
            "Sentiment": "negative",
            "PublishDate": 1758887778411,
            "Source": "stock"
        },
        {
            "Title": "Ambuja Cements Expands Capacity to 106.45 MTPA with New Grinding Unit in Andhra Pradesh",
            "Summary": "Ambuja Cements Limited announced that its subsidiary Penna Cement Industries Limited has successfully commissioned a 2 MTPA brownfield expansion of a Cement Grinding Unit in Krishnapatnam, Andhra Pradesh. This expansion increases Ambuja Cement's consolidated cement capacity to 106.45 MTPA. The company informed stock exchanges including NSE, BSE, and Luxembourg Stock Exchange about this development.",
            "Sentiment": "positive",
            "PublishDate": 1758706767692,
            "Source": "stock"
        },
        {
            "Title": "Adani Group Chairman Addresses Shareholders Following SEBI Dismissal of Hindenburg Allegations",
            "Summary": "Gautam Adani, Chairman of Adani Group, issued a letter to Ambuja Cements shareholders addressing the aftermath of Hindenburg's January 24, 2023 report. Adani stated that SEBI has dismissed the allegations against the group, calling it a validation of the company's transparency and governance. During the period following the report, the Adani Group's portfolio EBITDA grew from ₹57,205 crores in FY23 to ₹89,806 crores in FY25, representing 57% absolute growth. The group's Gross Block expanded from ₹4,12,318 crores to ₹6,09,133 crores over the same period. Key projects completed include India's first container transshipment port at Vizhinjam, 6 GW of renewable capacity additions including the Khavda project, commissioning of a copper smelter complex, and expansion of 7,000 circuit kms of transmission lines with 4 GW of new thermal capacity. Adani committed to strengthening governance standards, accelerating innovation and sustainability, and continuing infrastructure investments.",
            "Sentiment": "positive",
            "PublishDate": 1758693161180,
            "Source": "stock"
        },
        {
            "Title": "Delhi High Court Directs Ambuja Cements and JSW Cement to Mediation Over 'Kawach' Trademark Dispute",
            "Summary": "The Delhi High Court directed Ambuja Cements and JSW Cement to explore mediation in a trademark dispute over the 'Kawach' brand name. Ambuja Cements, owned by the Adani Group, seeks to restrain JSW firms from using 'Kawach' in their product branding, alleging JSW copied the name for its 'Jal Kawach' cement product launched recently. Ambuja has used the registered trademark 'Ambuja Kawach' since 2020 for its water-repellent cement. The company claims JSW's 'JSW Cement CHD Jal Kawach' uses similar branding and marketing descriptors including 'water resistance,' 'seepage prevention,' and 'durability.' Ambuja contends this constitutes trademark infringement and unfair business practices aimed at leveraging its brand reputation. The court posted the matter for October 15 if mediation fails. Ambuja Cements shares closed 1.6% higher at Rs 582.40.",
            "Sentiment": "neutral",
            "PublishDate": 1758165689138,
            "Source": "stock"
        },
        {
            "Title": "Ambuja Cements Sees Large Block Trade Worth Rs. 969.46 Crores on NSE",
            "Summary": "Ambuja Cements executed a significant block trade on the National Stock Exchange involving approximately 17,557,911 shares at a price of Rs. 552.15 per share. The total transaction value amounted to Rs. 969.46 crores, representing a substantial trading activity in the cement company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1757576742476,
            "Source": "order&deals"
        },
        {
            "Title": "Ambuja Cements Sees Block Trade Worth Rs. 98.61 Crores on NSE",
            "Summary": "Ambuja Cements executed a block trade on the National Stock Exchange involving approximately 1,720,980 shares at Rs. 573.00 per share, totaling Rs. 98.61 crores. The transaction represents a significant institutional trade in the cement company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1756964982478,
            "Source": "order&deals"
        },
        {
            "Title": "Ambuja Cements Block Trade Worth Rs. 52.64 Crores Executed on NSE",
            "Summary": "Ambuja Cements Ltd. witnessed a block trade on the National Stock Exchange involving approximately 907,543 shares at Rs. 580.00 per share, totaling Rs. 52.64 crores. The transaction represents a significant institutional or bulk trading activity in the cement company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1756959211377,
            "Source": "order&deals"
        },
        {
            "Title": "Adani Plans to Sell 5% Stake in Ambuja Cements for ₹15,000 Crore",
            "Summary": "Adani is planning to sell a 5% stake in Ambuja Cements for ₹15,000 crore. The proceeds from this stake sale may be used to reduce debt in the cement business.",
            "Sentiment": "neutral",
            "PublishDate": 1756261563072,
            "Source": "stock"
        },
        {
            "Title": "Ambuja Cements Reports Record Quarterly Revenue of Rs 10,289 Crores, EBITDA Rises 28% YoY",
            "Summary": "Ambuja Cements achieved its highest quarterly revenue of Rs 10,289 crores, up 23% year-on-year, driven by record sales volume of 18.4 million tonnes (up 20% YoY) and market share expansion to 15.5%. The company reported its highest quarterly EBITDA of Rs 1,961 crores with EBITDA per tonne at Rs 1,069, representing a 28% year-on-year increase. EBITDA margin improved to 19.1%, up 3.8 percentage points. Premium products now constitute 33% of trade sales, up 43% YoY, supporting a 4% price gain. The company successfully integrated Orient Cement (acquired in April) and commissioned 5 million tonnes of grinding capacity. Current cement capacity stands at 104.5 million tonnes, targeting 118 million tonnes by FY26 and 140 million tonnes by FY28. Cost improvements of Rs 119 per metric tonne were achieved through power, fuel, and logistics optimization. The company maintains a debt-free status with AAA credit rating and cash position of approximately Rs 3,000 crores. Management revised demand growth estimates upward from 6-7% to 7-8% for the current fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1754492079523,
            "Source": "earnings"
        }
    ]
}