{
    "Symbol": "AMDIND",
    "ISIN": "INE005I01014",
    "News": [
        {
            "Title": "AMD Industries Reports Net Loss of Rs 295.94 Lakhs in Q2 FY26",
            "Summary": "AMD Industries Limited posted a net loss of Rs 295.94 lakhs for the quarter ended September 30, 2025, compared to a loss of Rs 111.56 lakhs in the same quarter last year, with revenue from operations declining to Rs 5,896.37 lakhs from Rs 5,389.19 lakhs. The packaging company's Board approved these unaudited quarterly results on November 13, 2025, with the trading window remaining closed until November 15, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1763060273574,
            "Source": "earnings"
        },
        {
            "Title": "AMD Industries Acquires 100% Stake in Hindustan Autoplast for Rs 15 Lakh",
            "Summary": "AMD Industries Limited has approved the acquisition of a 100% stake in Hindustan Autoplast Private Limited, a promoter group entity, for a total consideration of Rs. 15,00,000. The transaction involves acquiring 1,50,000 equity shares at Rs 10 per share on an arm's length basis. Hindustan Autoplast operates in manufacturing of plastic components and auto parts but is currently in initial stage of operations with the project yet to be set up. AMD Industries aims to explore organic growth opportunities to consolidate operations and improve operational efficiency through this acquisition. The transaction is expected to be completed by October 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760416695169,
            "Source": "order&deals"
        },
        {
            "Title": "AMD Industries Gets Board Approval to Acquire 100% Stake in Two Promoter Entities",
            "Summary": "AMD Industries Limited received in-principle board approval on August 14, 2025, to acquire 100% stake in two promoter entities - Hindustan Autoplast Private Limited and Hindblend Texplast Private Limited. Both entities are in initial stages of operations. The acquisition aims to consolidate operations, enhance synergy, and improve operational efficiency while providing organic growth to the company's balance sheet size. The transaction is subject to extensive due diligence, regulatory approvals, execution of definitive agreements, and other customary conditions. Further details will be disclosed upon execution of definitive agreements or material developments.",
            "Sentiment": "positive",
            "PublishDate": 1755186723270,
            "Source": "order&deals"
        },
        {
            "Title": "AMD Industries Appoints Sanjeev Singhal as Chief Financial Officer",
            "Summary": "AMD Industries Limited appointed Mr. Sanjeev Singhal as Chief Financial Officer effective August 14, 2025. The Board of Directors approved the appointment in their meeting held on the same date. Singhal is a Qualified Chartered Accountant and Law Graduate with over 27 years of experience in accounts, finance, MIS, budgeting and taxation. He has previously worked with companies including Voltas Limited, Pioneer Poly Leather Pvt. Ltd., SMC Power Generation Ltd., and Pashupati Group. Singhal holds no shares in the company.",
            "Sentiment": "positive",
            "PublishDate": 1755184156165,
            "Source": "corporate_governance"
        },
        {
            "Title": "AMD Industries Reports Net Profit of Rs 151.27 Lakhs in Quarter Ended June 2025",
            "Summary": "AMD Industries Limited approved its unaudited financial results for the quarter ended June 30, 2025. The company reported net revenue from operations of Rs 8,666.83 lakhs compared to Rs 9,547.81 lakhs in the same quarter last year. Net profit for the quarter was Rs 151.27 lakhs, down from Rs 375.31 lakhs in the corresponding quarter of the previous year. Profit before tax stood at Rs 205.78 lakhs versus Rs 500.55 lakhs in the year-ago period. Basic and diluted earnings per share were Rs 0.79 each, compared to Rs 1.96 in the same quarter last year. The board meeting was held on August 14, 2025, and the trading window will remain closed until August 17, 2024. The company operates in the packaging business, manufacturing crown caps, PET-preforms, and plastic closures.",
            "Sentiment": "negative",
            "PublishDate": 1755177981443,
            "Source": "earnings"
        },
        {
            "Title": "AMD Industries CFO Prabir Kumar Mukhopadhyay Resigns Due to Personal Reasons",
            "Summary": "AMD Industries Limited announced the resignation of Mr. Prabir Kumar Mukhopadhyay from his position as Chief Financial Officer, effective from the close of business hours on July 31, 2025. Mukhopadhyay cited personal reasons for his departure in his resignation letter dated July 1, 2025. The company acknowledged his contributions and services during his tenure as CFO. Mukhopadhyay confirmed there are no material reasons for his resignation beyond those mentioned in his resignation letter. He holds no shareholding in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1753957473915,
            "Source": "corporate_governance"
        }
    ]
}