{
    "Symbol": "AMJLAND",
    "ISIN": "INE606A01024",
    "News": [
        {
            "Title": "AMJ Land Holdings Q3 FY25 Results Show Strong Growth",
            "Summary": "AMJ Land Holdings Limited reported improved financial performance for Q3 FY25 with total income from operations at ₹1,181.84 lakhs and net profit after tax of ₹136.03 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770216915886,
            "Source": "co_actions_results"
        },
        {
            "Title": "AMJ Land Holdings Approves Related Party Transactions",
            "Summary": "AMJ Land Holdings Limited shareholders approve renewal of lease agreements with Pudumjee Paper Products Limited for 29 acres land and 3,000 sq. mtrs. sub-station area through postal ballot with 98.71% approval.",
            "Sentiment": "positive",
            "PublishDate": 1769788412284,
            "Source": "stocks"
        },
        {
            "Title": "AMJ Land Holdings Board Meet Set for Feb 3, 2026",
            "Summary": "AMJ Land Holdings Limited has scheduled a board meeting on February 3, 2026, to consider and approve Q3 FY26 unaudited financial results. Trading window closed from January 1 to February 5, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768994939174,
            "Source": "co_actions_results"
        },
        {
            "Title": "AMJ Land Holdings Issues Postal Ballot Corrigendum",
            "Summary": "AMJ Land Holdings Limited issues corrigendum to postal ballot notice dated December 30, 2025, providing additional disclosures for material related party transactions as required under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768827867594,
            "Source": "stocks"
        },
        {
            "Title": "AMJ Land Holdings Reports Mixed Q2 Performance with Standalone Profit Drop Despite Revenue Growth",
            "Summary": "AMJ Land Holdings Limited announced its quarterly results for the quarter ended September 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 346.38 lakhs compared to Rs 386.03 lakhs in the previous quarter, while profit for the period was Rs 456.57 lakhs versus Rs 540.84 lakhs in the prior quarter. On a consolidated basis, the company achieved revenue from operations of Rs 1,909.99 lakhs in Q2 compared to Rs 1,731.93 lakhs in Q1, with consolidated profit reaching Rs 493.18 lakhs versus Rs 561.60 lakhs in the previous quarter. The company operates in two main segments: Real Estate Business and Wind Power Generation. Basic and diluted earnings per share on a standalone basis was Rs 1.11 for the quarter. The Board meeting was held on November 1, 2025, where directors approved the unaudited financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1761984119327,
            "Source": "earnings"
        },
        {
            "Title": "AMJ Land Holdings Reports Quarterly Financial Results for Quarter Ended June 30, 2025",
            "Summary": "AMJ Land Holdings Limited's board reviewed and recorded standalone and consolidated unaudited financial results for the quarter ended June 30, 2025. The board meeting was held on August 2, 2025, from 3:52 PM to 4:02 PM. On standalone basis, the company reported revenue from operations of Rs 386.03 lakhs and profit for the period of Rs 1.85 lakhs. Basic and diluted earnings per share stood at Rs 0.83. On consolidated basis, revenue from operations was Rs 2,569.49 lakhs with profit for the period at Rs 72.12 lakhs. Consolidated basic and diluted earnings per share was Rs 0.85. The company operates in two business segments: Real Estate Business and Wind Power Generation. The results were reviewed by the Audit Committee and approved by the Board of Directors, with limited review conducted by statutory auditors J M Agrawal & Co.",
            "Sentiment": "neutral",
            "PublishDate": 1754132577572,
            "Source": "earnings"
        },
        {
            "Title": "AMJ Land Holdings Schedules Board Meeting for August 2 to Approve Quarterly Financial Results",
            "Summary": "AMJ Land Holdings Limited has scheduled a Board of Directors meeting for August 2, 2025, to consider and approve the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company has closed its trading window for all directors, officers, designated persons, and connected persons from July 1, 2025, until August 4, 2025, which extends 48 hours after the declaration of financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1753098021164,
            "Source": "corporate_action"
        }
    ]
}