{
    "Symbol": "AMNPLST",
    "ISIN": "INE275D01022",
    "News": [
        {
            "Title": "Amines & Plasticizers Board Meet on Feb 13, 2026",
            "Summary": "Amines & Plasticizers Limited has scheduled a board meeting on February 13, 2026, to consider Q3FY26 unaudited financial results. Trading window remains closed until February 15, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769849621731,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shish Industries Clarifies Price Movement to BSE",
            "Summary": "Shish Industries Limited responds to BSE inquiry on significant price movement, confirming no undisclosed material information and compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1766071231339,
            "Source": "stocks"
        },
        {
            "Title": "Amines Plasticizers Reports Subdued Q2 & H1 FY26 Performance with Revenue and Profit Decline",
            "Summary": "Amines Plasticizers Limited reported consolidated revenue of ₹133.14 crores (down 20% YoY) and PAT of ₹6.17 crores (down 37% YoY) for Q2 FY26, with H1 FY26 revenue at ₹273.43 crores (down 10% YoY) and PAT at ₹13.60 crores (down 26% YoY). The company attributed the decline to volatile macroeconomic conditions, geopolitical factors, and supply constraints of key raw material ethylene oxide due to planned maintenance shutdowns by suppliers.",
            "Sentiment": "neutral",
            "PublishDate": 1763174183939,
            "Source": "earnings"
        },
        {
            "Title": "Amines Plasticizers Withholds Final Dividend for FY 2024-25 Due to Non-Compliant KYC",
            "Summary": "Amines Plasticizers Limited has withheld final dividend of Rs. 0.50 per equity share for Financial Year 2024-25 for shareholders whose folios are not KYC compliant as per SEBI regulations. The company has dispatched intimation letters to affected shareholders urging them to update mandatory KYC details including PAN, address, mobile number, and bank account details with registrar MUFG Intime India Private Limited to enable dividend release.",
            "Sentiment": "neutral",
            "PublishDate": 1763104886162,
            "Source": "corporate_action"
        },
        {
            "Title": "Amines & Plasticizers Limited Receives Credit Rating Actions from ICRA",
            "Summary": "Amines & Plasticizers Limited announced that ICRA Ltd has taken rating actions on its bank facilities totaling Rs. 179.75 crore. The company received reaffirmed [ICRA]A (Stable) ratings for its Rs. 100 crore long-term fund-based working capital facilities and Rs. 42 crore long-term interchangeable facilities. For short-term facilities, ICRA reaffirmed and assigned [ICRA]A1 rating for Rs. 29.75 crore non-fund-based facilities, which were enhanced from Rs. 28 crore. Additionally, the company received a new [ICRA]A1 rating assignment for Rs. 50 crore short-term fund-based facilities as an additional credit facility.",
            "Sentiment": "positive",
            "PublishDate": 1761576070671,
            "Source": "stock"
        },
        {
            "Title": "Amines & Plasticizers Reports 2.05% Revenue Growth But 14.17% Decline in Net Profit for Q1FY26",
            "Summary": "Amines & Plasticizers Limited reported quarterly results with revenue from operations reaching ₹140.29 crore, marking a 2.05% year-on-year increase. However, net profit declined 14.17% to ₹7.43 crore, while EBITDA dropped 13.96% to ₹13.07 crore. EBITDA margin compressed to 9.31% from 11.05% in the previous year. Chairman and Managing Director Hemant Ruia attributed the challenging performance to global macroeconomic uncertainties, volatile tariffs, and geopolitical developments causing customers to defer purchase decisions. The company experienced a partial shutdown at its Turbhe Plant for planned maintenance and faced slowdowns in key export markets due to geopolitical concerns. The company anticipates moderated export volumes for the remainder of FY26 but remains confident in domestic business resilience with firm orders and stable demand. APL continues collaborations with global MNCs for customized product development with multiple MOUs in place.",
            "Sentiment": "negative",
            "PublishDate": 1755177758712,
            "Source": "earnings"
        },
        {
            "Title": "Amines & Plasticizers Reports Mixed Q1 Results with Revenue Growth and Profit Decline",
            "Summary": "Amines & Plasticizers reported Q1 net profit of 75 million rupees, down from 84 million rupees in the same period last year. The company's Q1 revenue increased to 1.4 billion rupees compared to 1.37 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1755005787101,
            "Source": "earnings"
        },
        {
            "Title": "Amines & Plasticizers Q4 Financial Results",
            "Summary": "Amines & Plasticizers reported its Q4 financial results. The company's EBITDA was 210 million rupees, compared to 220 million rupees year-over-year. The EBITDA margin improved to 12.65% from 12.43% in the same period last year. Consolidated net profit was 128 million rupees, slightly down from 129.4 million rupees year-over-year, but up from 98 million rupees quarter-on-quarter. Revenue for Q4 was 1.65 billion rupees, down from 1.77 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1748356732000,
            "Source": "result"
        },
        {
            "Title": "Amines & Plasticizers Reports Stable Q3 EBITDA, Margin Decline",
            "Summary": "Amines & Plasticizers has reported Q3 EBITDA of 170 million rupees, which remains unchanged compared to the same period last year. However, the company's EBITDA margin has decreased from 9.71% to 8.89% year-over-year, indicating a slight decline in profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1739451663000,
            "Source": "earnings"
        },
        {
            "Title": "Amines & Plasticizers Reports Q3 Financial Results",
            "Summary": "Amines & Plasticizers Limited has announced its Q3 consolidated financial results. The company reported a net profit of 98 million rupees, slightly down from 99 million rupees in the same quarter last year. However, revenue increased to 1.9 billion rupees from 1.7 billion rupees year-over-year, indicating growth in sales despite a marginal decline in profits.",
            "Sentiment": "neutral",
            "PublishDate": 1739451659000,
            "Source": "earnings"
        },
        {
            "Title": "Amines & Plasticizers Reports Q2 EBITDA Growth",
            "Summary": "Amines & Plasticizers Limited has reported a year-over-year increase in Q2 EBITDA, rising from 159.2 million rupees to 163 million rupees. However, the company's Q2 EBITDA margin slightly decreased from 10.12% to 9.77% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731588737000,
            "Source": "result"
        },
        {
            "Title": "Amines & Plasticizers Reports Q2 Revenue Growth",
            "Summary": "Amines & Plasticizers Limited has reported a revenue of 1.7 billion rupees for the second quarter, compared to 1.57 billion rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731588575000,
            "Source": "result"
        },
        {
            "Title": "Amines & Plasticizers Reports Q2 Profit Increase",
            "Summary": "Amines & Plasticizers Limited has reported a consolidated net profit of 97.8 million rupees for the second quarter, showing an increase from 90.8 million rupees in the same quarter last year and 86.6 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731588533000,
            "Source": "result"
        }
    ]
}