{
    "Symbol": "AMRUTANJAN",
    "ISIN": "INE098F01031",
    "News": [
        {
            "Title": "Amrutanjan Board Meet on Feb 3 for Q3FY26 Results",
            "Summary": "Amrutanjan Health Care Limited has scheduled a board meeting on February 3, 2026, to consider Q3FY26 unaudited financial results and declare second interim dividend for FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1769601301017,
            "Source": "co_actions_results"
        },
        {
            "Title": "Amrutanjan Healthcare Reports 7.08% Revenue Growth in Q2FY26 with Strong Pain Management Segment Performance",
            "Summary": "Amrutanjan Healthcare Limited reported net sales of Rs. 117.70 crores in Q2FY26, representing 7.08% growth compared to Rs. 109.92 crores in Q2FY25. Profit before tax increased 20.51% to Rs. 19.21 crores, while profit after tax grew 14.23% to Rs. 15.94 crores. For H1FY26, net sales reached Rs. 211.75 crores (9.35% growth) with profit before tax rising 36.88% to Rs. 30.51 crores. The pain management segment showed strong performance with overall pain category growing 16% and body category achieving 21% growth. Key growth drivers included Maha Strong (31% growth), Back Pain Roll On (26% growth), and Head Roll On (42% growth). The company's OTC segment generated Rs. 112.80 crores in Q2FY26, while the beverages segment recorded Rs. 4.29 crores (26.55% growth). Comfy brand sales remained flat at Rs. 32.78 crores due to changes in quantity purchase scheme accounting. The company plans to launch premium sanitary pads and revive the JIFFY analgesic brand with Diclofenac topical range. A new sanitary napkin plant is expected to be commissioned by late Q4.",
            "Sentiment": "positive",
            "PublishDate": 1762874676064,
            "Source": "earnings"
        },
        {
            "Title": "Amrutanjan Healthcare Sets Record Date for First Interim Dividend",
            "Summary": "Amrutanjan Healthcare Limited has fixed November 18, 2025 as the record date for payment of its first interim dividend for the financial year 2025-26. The dividend will be paid to members whose names appear in the register of members and as beneficial owners as per details from NSDL and CDSL on the record date. The company has informed NSE and BSE about this decision.",
            "Sentiment": "positive",
            "PublishDate": 1762778429076,
            "Source": "corporate_action"
        },
        {
            "Title": "Amrutanjan Health Care Reports Strong Q2 Growth Across Key Financial Metrics",
            "Summary": "Amrutanjan Health Care delivered robust quarterly performance with net profit rising to 139.6 million rupees from 117.9 million rupees year-over-year. Revenue increased to 1.18 billion rupees compared to 1.1 billion rupees in the same period last year. EBITDA grew to 165.2 million rupees from 136 million rupees, while EBITDA margin expanded to 14.04% from 12.38% year-over-year, indicating improved operational efficiency alongside revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1762774301645,
            "Source": "earnings"
        },
        {
            "Title": "Amrutanjan Targets Double-Digit Growth Through Premium Products and Market Expansion",
            "Summary": "Amrutanjan is pursuing double-digit growth through several strategic initiatives. The company is focusing on premium wellness and pain management products while expanding its sports recovery product range. The growth strategy includes aggressive distribution reach expansion, increased focus on exports, and enhanced digital marketing efforts to boost brand equity.",
            "Sentiment": "positive",
            "PublishDate": 1755102959898,
            "Source": "stock"
        },
        {
            "Title": "Amrutanjan Health Care Reports 80% Jump in Quarterly Profit, Schedules AGM for September",
            "Summary": "Amrutanjan Health Care Limited reported profit after tax of ₹831.12 lakhs for the quarter ended June 30, 2025, compared to ₹461.56 lakhs in the same quarter last year. Revenue from operations increased to ₹9,404.57 lakhs from ₹8,373.60 lakhs year-on-year. The company's board approved the quarterly financial results and scheduled the 88th Annual General Meeting for September 23, 2025, via video conference. The board appointed SPNP & Associates as secretarial auditors for five years starting April 2025, subject to shareholder approval. Record date for dividend payment and AGM voting eligibility was set for September 16, 2025. Basic earnings per share stood at ₹2.87 compared to ₹1.60 in the previous year quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754995643541,
            "Source": "earnings"
        },
        {
            "Title": "Amrutanjan Health Care Reports Q4 Results and Dividend Announcement",
            "Summary": "Amrutanjan Health Care has announced its Q4 financial results and a dividend recommendation. The company's Q4 revenue increased to 1.35B rupees from 1.27B rupees year-over-year. EBITDA rose to 177M rupees from 162.4M rupees, with the EBITDA margin improving to 13.07% from 12.78%. Net profit for Q4 increased to 151.8M rupees from 136.6M rupees year-over-year. The company has recommended a final dividend of 2.60 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747309266000,
            "Source": "result"
        },
        {
            "Title": "Amrutanjan Health Care to Consider Q4 Results on May 15",
            "Summary": "Amrutanjan Health Care Limited has announced that it will consider and approve its financial results for the fourth quarter on May 15. This is a routine quarterly financial reporting event for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1746704582000,
            "Source": "default"
        },
        {
            "Title": "Amrutanjan Health Care: Q3 Profit Rises 10.32% YoY to ₹19.25 Crore",
            "Summary": "Amrutanjan Health Care reported Q3 FY25 results with revenue up 4.92% YoY to ₹122.75 crore and profit increasing 10.32% YoY to ₹19.25 crore. Operating income grew 8.4% YoY. EPS rose to ₹6.66. The company declared an interim dividend of ₹1.0 per share.",
            "Sentiment": "positive",
            "PublishDate": 1739566540000,
            "Source": "earnings"
        },
        {
            "Title": "Amrutanjan Health Care Declares Dividend",
            "Summary": "Amrutanjan Health Care has declared a dividend of 1 rupee per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1739360807000,
            "Source": "corporate_action"
        },
        {
            "Title": "Amrutanjan Health Care Reports Improved Q3 EBITDA and Margin",
            "Summary": "Amrutanjan Health Care has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 234 million rupees from 216 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 19.02% from 18.43% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739360747000,
            "Source": "earnings"
        },
        {
            "Title": "Amrutanjan Health Care Reports Q3 Financial Results",
            "Summary": "Amrutanjan Health Care has announced its financial results for the third quarter. The company's net profit increased to 192 million rupees, up from 174 million rupees year-over-year and 118 million rupees quarter-over-quarter. Revenue for Q3 reached 1.22 billion rupees, showing a slight increase from 1.17 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739360562000,
            "Source": "earnings"
        },
        {
            "Title": "Amrutanjan Health Care Reports Strong Q2 Results and Declares Interim Dividend",
            "Summary": "Amrutanjan Health Care announced its Q2 financial results, showing significant year-over-year improvements. Net profit increased to 117.9 million rupees from 68.5 million rupees last year. Revenue rose to 1.1 billion rupees from 993 million rupees. EBITDA grew to 136 million rupees from 68.4 million rupees, with EBITDA margin expanding to 12.37% from 6.89%. The company also declared a first interim dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1731455896000,
            "Source": "result"
        }
    ]
}