{
    "Symbol": "ANANTRAJ",
    "ISIN": "INE242C01024",
    "News": [
        {
            "Title": "Anant Raj Cloud Partners with Submer for AI Infrastructure",
            "Summary": "Anant Raj Limited's subsidiary enters strategic collaboration with Spain-based Submer Technologies to develop AI-ready datacenters across India with modular, sustainable computing platforms.",
            "Sentiment": "positive",
            "PublishDate": 1770533009169,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anant Raj Files Q3FY26 QIP Monitoring Report",
            "Summary": "Anant Raj Limited submits monitoring agency report for Q3FY26, showing ₹296.98 crore utilization from ₹1,100 crore QIP proceeds with no deviations from stated objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1769008742838,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anant Raj Q3 Net Profit Rises 27% to ₹1.40 Billion",
            "Summary": "Anant Raj reported consolidated net profit of ₹1.40 billion in Q3, up 27% from ₹1.10 billion year-on-year. Revenue grew 21% to ₹6.40 billion from ₹5.30 billion in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1769008210987,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anant Raj Gets Credit Rating Upgrade from Infomerics",
            "Summary": "Anant Raj Limited receives upgraded credit ratings from Infomerics on ₹351 crore bank facilities. Long-term rating improved to IVR A-/Stable from IVR BBB/Stable, while short-term rating enhanced to IVR A2+ from IVR A3+.",
            "Sentiment": "positive",
            "PublishDate": 1768404160742,
            "Source": "stocks"
        },
        {
            "Title": "Anant Raj Data Centres Generate ₹58.42 Cr Revenue",
            "Summary": "Anant Raj's data centre business delivered ₹58.42 crore revenue in H1 FY26 with 28 MW operational capacity. EBITDA margins expanded to 27.23% as the company targets 63 MW capacity by December 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768041808847,
            "Source": "stocks"
        },
        {
            "Title": "Anant Raj Subsidiaries Invest in Blessed Landbase LLP for Real Estate Activities",
            "Summary": "Anant Raj announced that its subsidiaries have made an investment in Blessed Landbase LLP, a company engaged in real estate activities. The investment aligns with Anant Raj's main business operations in the real estate sector.",
            "Sentiment": "neutral",
            "PublishDate": 1764167274785,
            "Source": "order&deals"
        },
        {
            "Title": "AnantRaj Reports Strong Q2 Performance with Data Center Business Gaining Momentum",
            "Summary": "AnantRaj Limited delivered robust quarterly results with revenue of INR 630.79 crores (up 23% YoY) and PAT of INR 138.18 crores (up 30.79% YoY), while successfully completing a QIP of INR 1,100 crores and achieving net cash positive status. The company expanded its data center capacity to 28 megawatts with plans to reach 63 megawatts by December 2026, generating INR 35.47 crores from data center operations in Q2 while maintaining strong growth in its real estate business.",
            "Sentiment": "positive",
            "PublishDate": 1763538572032,
            "Source": "earnings"
        },
        {
            "Title": "Anant Raj Announces Rs 4,500 Crore Investment Plan for Andhra Pradesh Data Centre and IT Park",
            "Summary": "Anant Raj's subsidiary ARCPL signed an MoU with Andhra Pradesh Economic Development Board to invest Rs 4,500 crore in two phases for developing data centre facilities and IT park infrastructure. The project is expected to create 8,500 direct and 7,500 indirect jobs while adding to the company's existing 307 MW data centre capacity under development.",
            "Sentiment": "positive",
            "PublishDate": 1763350380959,
            "Source": "stock"
        },
        {
            "Title": "Anant Raj Commits ₹4,500 Crore Investment for Data Centre and IT Park Development in Andhra Pradesh",
            "Summary": "Anant Raj Limited's subsidiary signed an MoU with Andhra Pradesh Economic Development Board to invest ₹4,500 crore in developing new data centre facilities and an integrated IT Park in the state. The project will be executed in two phases and is expected to create 8,500 direct and 7,500 indirect jobs, significantly strengthening the state's digital infrastructure ecosystem.",
            "Sentiment": "positive",
            "PublishDate": 1763193131934,
            "Source": "order&deals"
        },
        {
            "Title": "AnantRaj's Subsidiary Wins Two Cloud Infrastructure Awards",
            "Summary": "AnantRaj Limited announced that its wholly owned subsidiary, AnantRaj Cloud Pvt. Ltd. (ARCPL), received two awards: 'Best Cloud Infrastructure Provider 2025-India' and 'Excellence Award in Cloud Infrastructure Data Sovereignty 2025'. The awards were presented at the Technology Innovator Awards by Corporate Vision, published by AI Global Media Ltd based in the United Kingdom. The recognition highlights AnantRaj Cloud's role in building India's first fully-owned, sovereign, sustainable cloud ecosystem through its data centers and the Ashok Cloud Platform.",
            "Sentiment": "positive",
            "PublishDate": 1762916973490,
            "Source": "stock"
        },
        {
            "Title": "Anant Raj Reports 31% Jump in Q2 Profit, Revenue Grows 23%",
            "Summary": "Anant Raj Ltd reported a 30.8% year-on-year increase in consolidated profit after tax to Rs 138 crore for Q2FY26, compared to Rs 105.5 crore in Q2FY25. Revenue grew 23% to Rs 631 crore from Rs 513 crore in the same quarter last year. EBITDA surged 49.7% to Rs 168.4 crore, with margins improving by 476 basis points to 26.7%. The company remains net cash positive and has prepaid Rs 125 crore of debt. Several real estate projects are progressing, including The Estate One luxury development in Gurugram and Phase-IV expansion of Anant Raj Estate Township. The company's data center subsidiary Anant Raj Cloud plans to scale operations to 117 MW IT Load by FY28 across multiple locations. Shares closed flat at Rs 620.05 on Friday.",
            "Sentiment": "positive",
            "PublishDate": 1762747092317,
            "Source": "earnings"
        },
        {
            "Title": "AnantRaj Limited Reports Strong Quarterly Results, Completes Rs 1,100 Crore QIP",
            "Summary": "AnantRaj Limited announced its quarterly results for the period ended September 30, 2025, showing consolidated profit after tax of Rs 252 crores for the half-year period. The company successfully completed a Qualified Institutions Placement (QIP) raising Rs 1,100 crores, receiving strong response from Foreign Portfolio Investors and Domestic Institutional Investors. The company achieved net cash positive status and prepaid debt of Rs 125 crores. Key operational updates include progress on luxury residential projects including The Estate One on Golf Course Extension Road covering 5.0875 acres with approximately 1.09 million sq.ft area, and expansion of AnantRaj Estate Phase-IV covering additional 6.075 acres. The company is expanding its data center operations across Manesar, Rai and Panchkula locations with planned capacity of 117 MW IT Load by FY 28. Project deliveries are progressing with Navya project expected to commence Phase-2 delivery from December 2025, and Ashok Estate delivery almost completed. The Board approved dividend of Rs 0.73 per equity share for the previous financial year and redeemed non-convertible debentures worth Rs 20.50 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762605539956,
            "Source": "earnings"
        },
        {
            "Title": "Anant Raj Reports 30% Growth in Q2 Net Profit to 1.38 Billion Rupees",
            "Summary": "Anant Raj delivered strong quarterly results with consolidated net profit rising to 1.38 billion rupees compared to 1.06 billion rupees in the same period last year. Revenue increased to 6.31 billion rupees from 5.13 billion rupees year-over-year. EBITDA grew to 1.68 billion rupees versus 1.13 billion rupees previously, while EBITDA margin expanded to 26.61% from 21.99% in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1762602006426,
            "Source": "earnings"
        },
        {
            "Title": "AnantRaj Limited Schedules Earnings Conference Call for Q2H1FY26 Results",
            "Summary": "AnantRaj Limited will host a conference call for analysts and investors to discuss their Q2H1FY26 results on Wednesday, November 12, 2025, at 4:00 PM IST. The company participants include Managing Director Amit Sarin, Chief Financial Officer Pankaj Gupta, and Chief Business Officer Manoj Goyal. The Board of Directors was scheduled to consider the unaudited financial results for the quarter and half year ended September 30, 2025, at their meeting on November 8, 2025. Conference dial-in numbers and pre-registration options have been provided for participants.",
            "Sentiment": "neutral",
            "PublishDate": 1762520113811,
            "Source": "earnings"
        },
        {
            "Title": "Anant Raj Limited Receives RERA Registration for 6.0750 Acres Expansion of Estate Project",
            "Summary": "Anant Raj Limited obtained RERA Registration Certificate for an additional 6.0750 acres at its Anant Raj Estate residential project located at Golf Course Extension Road, Sector-63 A, Gurugram, Haryana. The expansion, designated as Anant Raj Estate-Phase IV, received RERA Registration No. RERA-GRG-PROJ-2043-2025 on October 17, 2025. The residential project targets the domestic market and will be launched in due course.",
            "Sentiment": "positive",
            "PublishDate": 1760784577552,
            "Source": "stock"
        },
        {
            "Title": "Anant Raj Limited Completes QIP, Raises Funds at ₹662 Per Share",
            "Summary": "Anant Raj Limited completed its qualified institutions placement (QIP) of equity shares on October 13, 2025. The company's Finance and Investment Committee approved an issue price of ₹662 per share, which includes a premium of ₹660 per share and represents a 4.86% discount to the floor price of ₹695.83 per share. The QIP allocated 1,66,16,314 equity shares with a face value of ₹2 each to qualified institutional buyers. The committee also approved the placement document and finalized allocation notes to be sent to eligible QIBs.",
            "Sentiment": "positive",
            "PublishDate": 1760374963615,
            "Source": "corporate_action"
        },
        {
            "Title": "Anant Raj Launches Qualified Institutions Placement with Floor Price of ₹695.83 Per Share",
            "Summary": "Anant Raj has announced the launch of a Qualified Institutions Placement (QIP) for equity shares. The company has set a floor price of ₹695.83 per equity share for this institutional fundraising initiative.",
            "Sentiment": "neutral",
            "PublishDate": 1759849099086,
            "Source": "corporate_action"
        },
        {
            "Title": "Anant Raj Targets $1 Billion Data Center Business by FY31-32",
            "Summary": "Anant Raj has announced plans to expand its data center business to reach $1 billion by FY31-32. The company is focusing on growing this segment as part of its business strategy.",
            "Sentiment": "positive",
            "PublishDate": 1758948812989,
            "Source": "stock"
        },
        {
            "Title": "Government Considers 20-Year Tax Exemption for Data Centers",
            "Summary": "The government is considering implementing a 20-year tax exemption policy for data centers. This potential policy change could impact companies operating in the data center sector, including Anantraj.",
            "Sentiment": "positive",
            "PublishDate": 1757907739445,
            "Source": "stock"
        },
        {
            "Title": "Anant Raj Targets ₹1,200 Crore Revenue from Data Center Operations by FY27",
            "Summary": "Anant Raj is expanding its data center operations with ambitious revenue projections. The company estimates revenue from data center and cloud services to reach approximately ₹1,200 crore by FY27, with further growth projected to ₹9,000 crore by FY32. This expansion represents the company's strategic move into the data center and cloud services sector.",
            "Sentiment": "positive",
            "PublishDate": 1754377958593,
            "Source": "stock"
        },
        {
            "Title": "Anant Raj Reports Strong Q1 FY26 Results with 26% Revenue Growth and Data Center Expansion",
            "Summary": "Anant Raj Limited reported revenue of ₹592 crores for Q1 FY26, marking a 26% year-on-year increase. EBITDA grew 42% to ₹161 crores with margins improving to 27% from 23% in the previous year. PAT increased 38% to ₹126 crores. The company operationalized its second data center facility at Panchkula with 7 MW IT load capacity, enhancing total operational data center capacity to 28 MW. In real estate, the company launched 'The Estate Apartments' at Sector-63A Gurugram with excellent market response and initiated development of a community center and commercial tower at Ashok Estate. The company acquired a large private sector client for colocation and cloud services covering approximately 3 MW IT load at its Manesar facility. Anant Raj has outlined expansion plans to scale up to 307 MW IT load capacity by 2031 and expects to launch new residential projects including Luxury Group Housing-2.",
            "Sentiment": "positive",
            "PublishDate": 1753460510800,
            "Source": "earnings"
        },
        {
            "Title": "Anant Raj Limited Shareholders Approve All 11 Resolutions at Annual General Meeting",
            "Summary": "Anant Raj Limited held its 40th Annual General Meeting on July 23, 2025, where shareholders approved all 11 proposed resolutions with requisite majority. The approved resolutions included adoption of audited financial statements for the year ended March 31, 2025, declaration of final dividend, re-appointment of directors including Managing Director Amit Sarin, Whole-time Directors Aman Sarin and Ashim Sarin, and independent directors Rajesh Tuteja and Kulpreet Sond. Shareholders also approved the appointment of Rajendra Prasad Sharma as independent director and Priya Jindal as secretarial auditor, along with ratification of cost auditor remuneration. The meeting had 265,443 shareholders on record date with 46 shareholders attending either in person or through proxy. E-voting was conducted from July 20-22, 2025, with votes unblocked on July 23, 2025. The scrutinizer's report confirmed all voting processes were conducted in compliance with regulatory requirements.",
            "Sentiment": "positive",
            "PublishDate": 1753449158201,
            "Source": "corporate_action"
        },
        {
            "Title": "Anant Raj Limited Reports 38% Jump in Quarterly Profit, Expands Data Center Operations",
            "Summary": "Anant Raj Limited reported consolidated profit of Rs. 125.90 crores for the quarter ended June 30, 2025, compared to Rs. 91.01 crores in the same period last year. Revenue from operations increased to Rs. 592.41 crores from Rs. 471.83 crores year-over-year. The company is operationalizing its second data center facility at Panchkula and secured a major private sector client for colocation and cloud services with approximately 3 MW IT load capacity at its Manesar facility. In real estate, the company launched 'The Estate Apartments' at Anant Raj Estate, Sector-63A, Gurugram, and received approval for community center and commercial tower development at its Ashok Estate project. The company also announced preparations for launching its Group Housing-2 project spanning 1.09 million sq. ft. Shareholders approved a final dividend of Re. 0.73 per equity share for the previous financial year.",
            "Sentiment": "positive",
            "PublishDate": 1753358888138,
            "Source": "earnings"
        },
        {
            "Title": "Anant Raj Schedules Board Meeting for Q1 Results Discussion",
            "Summary": "Anant Raj has announced that it will hold a board meeting on July 24 to discuss the company's Q1 results.",
            "Sentiment": "neutral",
            "PublishDate": 1751283923000,
            "Source": "default"
        },
        {
            "Title": "Anant Raj Ltd: $2 Billion Investment in Data Centers Planned",
            "Summary": "Anant Raj Ltd plans to invest 180 billion rupees ($2.1 billion) in data centers, aiming for a capacity of over 300 megawatts by 2032. The company will launch two more data centers in Haryana, adding to one already operational. This move aligns with India's growing data center market, expected to reach 1.8 gigawatts capacity in the next four years.",
            "Sentiment": "positive",
            "PublishDate": 1751271404000,
            "Source": "corporate_action"
        },
        {
            "Title": "Anant Raj Plans $2.1 Billion Investment in Data Centers",
            "Summary": "Anant Raj has announced plans to invest $2.1 billion in data centers. This move aligns the company with other Indian firms seeking to capitalize on the growing demand for artificial intelligence infrastructure. The investment highlights the increasing interest in data center development within India's tech sector.",
            "Sentiment": "positive",
            "PublishDate": 1751268332000,
            "Source": "default"
        },
        {
            "Title": "Anant Raj: Q4 Net Profit Surges 51.5% YoY to Rs 118.6 Crore",
            "Summary": "Anant Raj reported strong Q4FY25 results with net profit up 51.5% YoY to Rs 118.6 crore. Revenue increased 22.2% to Rs 540.7 crore, and EBITDA rose 36.5% to Rs 142.4 crore. The company declared a final dividend of Rs 0.73 per share.",
            "Sentiment": "positive",
            "PublishDate": 1745292907000,
            "Source": "earnings"
        },
        {
            "Title": "Anant Raj Reports Strong Q4 Financial Performance",
            "Summary": "Anant Raj has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 1.42 billion rupees from 1.04 billion, with EBITDA margin rising to 26.33% from 23.58%. Revenue grew to 5.41 billion rupees from 4.43 billion. Consolidated net profit rose to 1.19 billion rupees, up from 783 million in the previous year and 1.10 billion in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745248575000,
            "Source": "result"
        },
        {
            "Title": "Anant Raj Ltd: Q4 Profit Soars 51.5%, Announces Dividend",
            "Summary": "Anant Raj Ltd reported a 51.5% increase in Q4 net profit to ₹118.6 crore. Revenue rose 22.2% to ₹540.7 crore, and EBITDA grew 36.5% to ₹142.4 crore. The company announced a dividend of ₹0.73 per share for FY 2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1745240844000,
            "Source": "earnings"
        },
        {
            "Title": "Anant Raj: Real Estate Stock Plummets 50% from Recent High",
            "Summary": "Anant Raj's stock has crashed 50% from its December peak of ₹947 to around ₹475 in four months. Despite this, analysts remain optimistic about the company's growth prospects, particularly in the data center sector. Anant Raj plans to invest ₹100 billion to develop a 307 MW data center footprint and has launched its cloud platform, 'Ashok Cloud'.",
            "Sentiment": "neutral",
            "PublishDate": 1744713684000,
            "Source": "normal_news"
        },
        {
            "Title": "Anant Raj Announces Commencement of Phase-IV of Birla Navya Project",
            "Summary": "Anant Raj Limited has announced that its subsidiary, Avarna Projects, is initiating Phase-IV of the Birla Navya project. This development indicates progress in the company's real estate ventures and suggests ongoing expansion of their residential or commercial property portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1739878361000,
            "Source": "corporate_action"
        },
        {
            "Title": "Anant Raj Signs Agreement with CSC Data Services India for Rack Rental and Cloud Services",
            "Summary": "Anant Raj has entered into an agreement with CSC Data Services India to promote rack rental business and cloud services. This partnership aims to expand Anant Raj's presence in the data center and cloud services sector.",
            "Sentiment": "positive",
            "PublishDate": 1739791375000,
            "Source": "corporate_action"
        },
        {
            "Title": "Anant Raj: Q3 Profit Surges 54% YoY to Rs 110 Crore",
            "Summary": "Anant Raj reported a 53.6% YoY increase in Q3 FY25 net profit to Rs 110.3 crore. Revenue from operations grew 36.3% YoY to Rs 534.6 crore. EBITDA jumped 47.1% YoY to Rs 133.1 crore with margin expansion to 24.9%. The company clarified that evolving AI landscape would increase demand for data centers, following concerns over Chinese AI startup DeepSeek's impact on tech stocks.",
            "Sentiment": "positive",
            "PublishDate": 1738554491000,
            "Source": "earnings"
        },
        {
            "Title": "Anant Raj Limited Reports Strong Q3 Financial Results",
            "Summary": "Anant Raj Limited has announced its Q3 consolidated financial results. The company's net profit increased to 1 billion rupees, up from 714 million rupees year-over-year, and remained stable compared to the previous quarter. Revenue for Q3 rose to 5.3 billion rupees, showing growth from 3.9 billion rupees year-over-year and a slight increase from 5.1 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738518839000,
            "Source": "earnings"
        },
        {
            "Title": "Anant Raj Ltd: Q3 Net Profit Soars 55% with Revenue Crossing ₹500 Crore",
            "Summary": "Anant Raj Ltd reported a 55% increase in Q3 net profit to ₹110 crore. Revenue rose 36.2% to ₹534 crore, while EBITDA grew 47.1% to ₹133.1 crore. EBITDA margin expanded to 24.9%. The company clarified that current AI trends will likely increase demand for data centres.",
            "Sentiment": "positive",
            "PublishDate": 1738417123000,
            "Source": "earnings"
        },
        {
            "Title": "Anant Raj Ltd: Stock Plummets Amid DeepSeek AI Launch",
            "Summary": "Anant Raj Ltd's stock has fallen nearly 40% over two days following the launch of DeepSeek's affordable AI chatbot. The company's data centre business, which contributes 8% to its operating profit, may be impacted by this development. Anant Raj plans to expand its data centre capacity from 6MW to 307MW over the next 4-5 years.",
            "Sentiment": "negative",
            "PublishDate": 1738045807000,
            "Source": "normal_news"
        },
        {
            "Title": "Anant Raj Ltd: Motilal Oswal Predicts 30% Upside Potential",
            "Summary": "Motilal Oswal initiated coverage on Anant Raj Ltd with a 'Buy' rating and a price target of ₹1,100 per share, suggesting a 30% upside. The company is diversifying into data centers and cloud services, with plans for 300MW DC capacity in 4-5 years. Anant Raj's residential business expects 14msf deliveries by FY30, potentially generating ₹8,510 crore NOPAT. The stock has gained 190% in 2024 so far.",
            "Sentiment": "positive",
            "PublishDate": 1734681778000,
            "Source": "normal_news"
        },
        {
            "Title": "Anant Raj Announces QIP and Convertible Warrants Issuance",
            "Summary": "Anant Raj has announced plans to issue shares or convertible securities through a Qualified Institutional Placement (QIP) for 20 billion rupees. Additionally, the company will issue convertible warrants aggregating up to 1 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1730124157000,
            "Source": "corporate_action"
        },
        {
            "Title": "Anant Raj Reports Q2 EBITDA Growth",
            "Summary": "Anant Raj, a real estate company, has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 1.12 billion rupees, up from 790 million rupees in the same quarter last year. However, the EBITDA margin decreased slightly to 21.93% from 23.80% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730123739000,
            "Source": "result"
        },
        {
            "Title": "Anant Raj Reports Strong Q2 Financial Results",
            "Summary": "Anant Raj Limited has announced its Q2 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit increased to 1.05 billion rupees, up from 600 million rupees in the same quarter last year and 910 million rupees in the previous quarter. Revenue also saw substantial growth, reaching 5.12 billion rupees compared to 3.3 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730123683000,
            "Source": "result"
        }
    ]
}