{
    "Symbol": "ANANDRATHI",
    "ISIN": "INE463V01026",
    "News": [
        {
            "Title": "Anand Rathi Wealth Issues Postal Ballot Corrigendum",
            "Summary": "Anand Rathi Wealth Limited issues corrigendum to postal ballot notice dated January 12, 2026, changing CEO re-appointment resolution from ordinary to special resolution.",
            "Sentiment": "neutral",
            "PublishDate": 1770385312544,
            "Source": "stocks"
        },
        {
            "Title": "Anand Rathi Financial Services Pledges Shares",
            "Summary": "Anand Rathi Financial Services Limited pledged 3,45,000 equity shares of Anand Rathi Wealth Limited on February 2, 2026, representing 0.42% of total share capital for availing margin limits.",
            "Sentiment": "neutral",
            "PublishDate": 1770138579625,
            "Source": "stocks"
        },
        {
            "Title": "Aqua Proof Wall Plast pledges Anand Rathi shares",
            "Summary": "Aqua Proof Wall Plast Private Limited pledged 1,00,000 equity shares of Anand Rathi Wealth Limited on January 30, 2026, representing 0.120% of total share capital for margin limits.",
            "Sentiment": "neutral",
            "PublishDate": 1770113798069,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Wealth Promoter Pledges Shares",
            "Summary": "Anand Rathi Financial Services Limited pledged 3.20 lakh shares of Anand Rathi Wealth Limited to Suresh Rathi Securities for margin limits, representing 0.385% of total share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1769076793774,
            "Source": "stocks"
        },
        {
            "Title": "2026 Investment Guide: SIPs, Asset Allocation Tips",
            "Summary": "Anand Rathi Wealth's Chirag Muni outlines goal-based investing strategies for 2026, emphasizing SIP discipline, 70-80% equity allocation, and stepping up investments annually for wealth creation.",
            "Sentiment": "neutral",
            "PublishDate": 1768535747859,
            "Source": "mutualfunds"
        },
        {
            "Title": "Anand Rathi Wealth nears ₹1 lakh crore AUM milestone",
            "Summary": "CEO Rakesh Rawal reports AUM growth of ₹20,000 crore this year driven equally by market performance and fresh inflows. Company maintains 30% profit margin floor with 47% ROE.",
            "Sentiment": "positive",
            "PublishDate": 1768365384978,
            "Source": "stocks"
        },
        {
            "Title": "Anand Rathi Maintains FY26 Revenue Target at ₹1,175 Cr",
            "Summary": "Anand Rathi Wealth sticks to FY26 revenue forecast of ₹1,175 crores and PAT estimate of ₹375 crores despite achieving 76% revenue and 78% PAT targets by Q3 FY26. Company adopts conservative approach.",
            "Sentiment": "neutral",
            "PublishDate": 1768362377088,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Wealth Targets 20-25% Growth Next Fiscal",
            "Summary": "Anand Rathi Wealth maintains its growth guidance of 20-25% for the next fiscal year, with plans to reinvest gains into strengthening departments rather than focusing solely on operating leverage.",
            "Sentiment": "positive",
            "PublishDate": 1768362331590,
            "Source": "stocks"
        },
        {
            "Title": "Anand Rathi Wealth Reports 30% YoY Net Profit Jump",
            "Summary": "Anand Rathi Wealth Ltd delivered strong Q3 FY26 results with net profit rising 30% YoY to ₹100.10 crores and revenue growing 22% to ₹290.00 crores. AUM increased 30% to ₹99,008 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768303837722,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Wealth Q3FY26 Earnings Call Audio Live",
            "Summary": "Anand Rathi Wealth Limited has made available the audio recording of its Q3 & 9M FY26 earnings conference call held on January 13, 2026, with transcript to follow soon.",
            "Sentiment": "neutral",
            "PublishDate": 1768303328883,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Wealth maintains 20-25% growth target",
            "Summary": "Anand Rathi Wealth reported Q3FY26 revenue of ₹289.60 crore with 45.4% margin, maintaining its 20-25% annual growth guidance despite 17 consecutive quarters above 20% growth.",
            "Sentiment": "positive",
            "PublishDate": 1768292739649,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Q3 net profit surges 30% to ₹100 cr",
            "Summary": "Anand Rathi Wealth reports strong Q3 FY26 performance with 30% profit growth to ₹100 crore and 25% revenue increase to ₹306 crore, driven by robust AUM growth.",
            "Sentiment": "positive",
            "PublishDate": 1768274142372,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Wealth Q3 Net Profit Jumps 29.6% YoY",
            "Summary": "Anand Rathi Wealth reports strong Q3 performance with consolidated net profit rising to ₹99.80 crores from ₹77.00 crores year-on-year, while revenue grows 21.9% to ₹289.00 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768262926306,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Wealth Posts 30% Profit Jump in Q3 FY26",
            "Summary": "Anand Rathi Wealth reported 30% profit growth to ₹100.10 crore in Q3 FY26, with revenue rising 25% to ₹306 crore. AUM reached ₹99,008 crore, marking 30% YoY growth driven by strong client engagement.",
            "Sentiment": "positive",
            "PublishDate": 1768231431361,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Q3 Results: PAT jumps 30% to ₹100 cr",
            "Summary": "Anand Rathi Wealth reports strong Q3 performance with 30% jump in net profit to ₹100 crore and 25% revenue growth to ₹306 crore. AUM rises 30% to ₹99,008 crore with steady client growth.",
            "Sentiment": "positive",
            "PublishDate": 1768230850751,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Wealth Targets 20-25% Long-Term Growth",
            "Summary": "Anand Rathi Wealth has outlined its strategic growth expectations, projecting sustained expansion of 20% to 25% over the long term, reflecting confidence in business fundamentals.",
            "Sentiment": "positive",
            "PublishDate": 1768230336474,
            "Source": "stocks"
        },
        {
            "Title": "Anand Rathi Wealth Reports Strong 9-Month Performance",
            "Summary": "Anand Rathi Wealth achieves ₹292.60 crores profit in 9 months against full-year guidance of ₹375 crores, with revenue reaching ₹861.00 crores compared to annual target of ₹1,175 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768229885647,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Wealth Q3FY26 Results Show Strong Growth",
            "Summary": "Anand Rathi Wealth Limited reports 29.60% YoY growth in PAT to ₹100.10 crores for Q3FY26, with total revenue rising 25.20% to ₹305.70 crores and AUM reaching ₹99,008 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768229044999,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Wealth Q3FY26 Results & Board Changes",
            "Summary": "Anand Rathi Wealth reported Q3FY26 consolidated revenue of ₹28,962.39 cr with net profit of ₹10,018.67 cr. Board appointed three new independent directors and approved CEO reappointment.",
            "Sentiment": "positive",
            "PublishDate": 1768227467717,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Wealth Q3FY26 Results & Board Changes",
            "Summary": "Anand Rathi Wealth reported Q3FY26 consolidated revenue of ₹28,962.39 lakhs with net profit of ₹10,018.67 lakhs. Board appointed three new independent directors and approved CEO reappointment.",
            "Sentiment": "positive",
            "PublishDate": 1768226912195,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Wealth Q3 profit jumps 29% YoY",
            "Summary": "Anand Rathi Wealth reported 29% YoY growth in Q3 net profit to ₹99.70 crore, driven by 22% revenue growth and strong digital wealth AUM expansion of 29%.",
            "Sentiment": "positive",
            "PublishDate": 1768226456291,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Wealth Q3 EBITDA Rises 21.5% YoY",
            "Summary": "Anand Rathi Wealth reports Q3 EBITDA of ₹1.30 billion, up from ₹1.07 billion year-on-year, with EBITDA margin improving to 45.38% from 45.17% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1768226085973,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Wealth Q3 Profit Jumps 30% to ₹99.80 Cr",
            "Summary": "Anand Rathi Wealth reports strong Q3 performance with consolidated net profit rising 30% YoY to ₹99.80 crores, while revenue grows 22% to ₹289 crores compared to previous year.",
            "Sentiment": "positive",
            "PublishDate": 1768226065446,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Wealth Reappoints Rakesh Rawal as CEO",
            "Summary": "Anand Rathi Wealth Limited has reappointed Rakesh Rawal as Whole-Time Director and Chief Executive Officer, continuing his leadership role at the wealth management firm.",
            "Sentiment": "positive",
            "PublishDate": 1768225804540,
            "Source": "stocks"
        },
        {
            "Title": "Anand Rathi Wealth Q3FY26 Results & Board Changes",
            "Summary": "Anand Rathi Wealth reports Q3FY26 consolidated revenue of ₹28,962.39 cr with net profit of ₹10,018.67 cr. Board appoints three new independent directors and approves CEO reappointment.",
            "Sentiment": "positive",
            "PublishDate": 1768225783661,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Wealth Q3FY26 PAT Surges 30% to ₹100 Cr",
            "Summary": "Anand Rathi Wealth Limited reported strong Q3FY26 results with consolidated PAT growing 30% YoY to ₹100 crores and revenue rising 25% to ₹306 crores. AUM reached ₹99,008 crores with 30% YoY growth.",
            "Sentiment": "positive",
            "PublishDate": 1768225142489,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Wealth Q3FY26 Results & Board Changes",
            "Summary": "Anand Rathi Wealth reports Q3FY26 consolidated revenue of ₹28,962.39 cr and net profit of ₹10,018.67 cr. Board appoints three new independent directors and approves CEO reappointment.",
            "Sentiment": "positive",
            "PublishDate": 1768224657837,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Wealth Earnings Call on Jan 13 for Q3FY26",
            "Summary": "Anand Rathi Wealth Limited has scheduled its Q3 & 9M FY26 earnings conference call for January 13, 2026 at 2:00 pm IST for investors and analysts, following the board meeting on January 12.",
            "Sentiment": "neutral",
            "PublishDate": 1767096408826,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Wealth Sells Stake for ₹5.37 Crore",
            "Summary": "Anand Rathi Wealth Limited has completed the sale of its stake in Freedom Wealth Solutions for ₹5.37 crore, marking a strategic divestment move by the wealth management company.",
            "Sentiment": "neutral",
            "PublishDate": 1766066571583,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aqua Proof Wall Plast Increases Anand Rathi Wealth Stake",
            "Summary": "Aqua Proof Wall Plast Private Limited, a promoter group entity, acquired 70,000 shares of Anand Rathi Wealth Limited through open market transactions on December 9, 2025, increasing its holding from 0.0659% to 0.1502%.",
            "Sentiment": "neutral",
            "PublishDate": 1765384513274,
            "Source": "co_actions_results"
        },
        {
            "Title": "Amit Capital Acquires 50,000 Anand Rathi Wealth Shares",
            "Summary": "Amit Capital and Securities Private Limited acquired 50,000 shares of Anand Rathi Wealth Limited through open market purchase on December 9, 2025, representing 0.0602% stake.",
            "Sentiment": "neutral",
            "PublishDate": 1765384481096,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Insurance Brokers Acquires 2.1L Shares",
            "Summary": "Anand Rathi Insurance Brokers Limited acquired 2,10,000 shares carrying voting rights, representing 0.2529% stake, as disclosed under SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1765383242446,
            "Source": "co_actions_results"
        },
        {
            "Title": "Two Promoter Group Entities Acquire Shares in Anand Rathi Wealth Limited",
            "Summary": "Amit Capital Securities Private Limited acquired 50,000 shares (0.0602%) and Aqua Proof Wall Plast Private Limited acquired 70,000 shares (0.0843%) in Anand Rathi Wealth Limited through open market transactions on December 9, 2025. Both entities are part of the promoter group, with their combined acquisitions totaling 1,20,000 shares representing 0.1445% of the company's equity share capital of 8,30,20,634 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1765366916725,
            "Source": "corporate_action"
        },
        {
            "Title": "Anand Rathi Insurance Brokers Discloses Share Acquisition Under SEBI Regulations",
            "Summary": "Anand Rathi Insurance Brokers Limited disclosed the acquisition of 2,10,000 shares carrying voting rights, representing 0.2529% of the company's shareholding. The disclosure was made pursuant to SEBI takeover regulations, indicating changes in the company's shareholding structure.",
            "Sentiment": "neutral",
            "PublishDate": 1765362198680,
            "Source": "order&deals"
        },
        {
            "Title": "Anand Rathi Wealth UK Limited Receives Full FCA Authorization",
            "Summary": "Anand Rathi Wealth Limited announced that its wholly-owned subsidiary, Anand Rathi Wealth UK Limited, has received full authorization from the Financial Conduct Authority (FCA). The authorization enables the subsidiary to operate under full regulatory approval in the UK market, expanding the company's international presence.",
            "Sentiment": "positive",
            "PublishDate": 1764838724435,
            "Source": "stock"
        },
        {
            "Title": "Anand Rathi Wealth Infuses Additional GBP 499,900 Capital in UK Subsidiary",
            "Summary": "Anand Rathi Wealth Limited announced further capital infusion of GBP 499,900 into its wholly-owned subsidiary Anand Rathi Wealth UK Limited, which was incorporated in February 2025. The UK subsidiary, registered under Company Registration No. 16223861 with Registrar of Companies for England and Wales, has yet to commence business operations.",
            "Sentiment": "positive",
            "PublishDate": 1764084135451,
            "Source": "stock"
        },
        {
            "Title": "Anand Rathi Wealth Limited Infuses Initial Capital in UK Subsidiary",
            "Summary": "Anand Rathi Wealth Limited has infused initial capital of GBP 100 into its wholly-owned subsidiary Anand Rathi Wealth UK Limited at GBP 0.01 per share, acquiring 100% shareholding. The UK subsidiary was incorporated in February 2025 for financial intermediation services but has yet to commence business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1763398833391,
            "Source": "corporate_action"
        },
        {
            "Title": "Anand Rayons Reports 36% Jump in Net Profit to 15M Rupees",
            "Summary": "Anand Rayons reported net profit of 15 million rupees in Q2, compared to 11 million rupees in the same quarter last year. The company's revenue increased to 1.1 billion rupees from 829 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762760702487,
            "Source": "earnings"
        },
        {
            "Title": "Aqua Proof Wall Plast Increases Stake in Anand Rathi Wealth Limited",
            "Summary": "Aqua Proof Wall Plast Private Limited, a promoter group entity, acquired 1,044 shares of Anand Rathi Wealth Limited through open market transactions on August 2, 2024. The acquisition increased their holding from 7,807 shares (0.0189%) to 8,851 shares (0.0214%) of the total equity share capital. Anand Rathi Wealth Limited has a total equity share capital of 4,15,10,317 shares of Rs. 5 each, and its shares are listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1761833015616,
            "Source": "corporate_action"
        },
        {
            "Title": "Anand Rathi Wealth Reports 31% PAT Growth in Q2 FY26, AUM Reaches ₹91,568 Crores",
            "Summary": "Anand Rathi Wealth Limited delivered strong quarterly results with consolidated revenue growing 23% year-on-year to ₹307 crores in Q2 FY26. Profit after tax increased 31% to ₹99.89 crores compared to ₹76 crores in the same quarter last year. The company's AUM reached ₹91,568 crores, adding over double the IPO-time AUM of ₹30,200 crores in four years. Equity mutual fund net flows surged 101% year-on-year to ₹2,062 crores during the quarter. For H1 FY26, total revenue grew 19% to ₹591 crores with PAT rising 29% to ₹194 crores. The company achieved a strong ROE of 45.5% on an annualized basis and declared 120% interim dividend of ₹6 per share. The firm added 1,800+ families in the last 12 months, bringing total clients to 12,781, while maintaining low client attrition at 0.09% for the quarter. Management expressed confidence in sustaining 20-25% growth rates and maintaining the AUM guidance of ₹1 lakh crores.",
            "Sentiment": "positive",
            "PublishDate": 1760784948751,
            "Source": "earnings"
        },
        {
            "Title": "Anand Rathi Wealth Sets FY26 Targets of ₹1,175 Crore Revenue and ₹375 Crore Profit",
            "Summary": "Anand Rathi Wealth has announced financial targets for FY26, aiming for ₹1,175 crore in revenue and ₹375 crore in profit. The company expects over 20% growth in assets under management (AUM), driven by high net worth individual (HNI) inflows and digital expansion initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1760370041411,
            "Source": "stock"
        },
        {
            "Title": "Anand Rathi Wealth Board Approves Divestment of Entire Stake in Freedom Wealth Solutions",
            "Summary": "Anand Rathi Wealth Limited's Board of Directors approved the disinvestment of its entire shareholding in Freedom Wealth Solutions Private Limited, a non-material subsidiary. The board meeting held on October 13, 2025, gave in-principle approval for transferring the complete stake to an identified purchaser at mutually agreed price and terms. This transaction will result in Freedom Wealth Solutions Private Limited ceasing to be a subsidiary of Anand Rathi Wealth Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1760367934968,
            "Source": "corporate_action"
        },
        {
            "Title": "Anand Rathi Wealth COO Niranjan Babu Ramayanam Resigns Due to Personal Commitments",
            "Summary": "Niranjan Babu Ramayanam has resigned from his position as Chief Operating Officer of Anand Rathi Wealth Limited due to personal commitments. His resignation will be effective from the close of business hours on November 10, 2025. Ramayanam will continue to discharge his duties until that date to facilitate a smooth transition. The company has notified the stock exchanges about this senior management personnel change.",
            "Sentiment": "neutral",
            "PublishDate": 1760361648073,
            "Source": "corporate_governance"
        },
        {
            "Title": "Anand Rathi Wealth Reports Strong Q2 FY26 Results, Declares Rs 6 Interim Dividend",
            "Summary": "Anand Rathi Wealth Limited's Board approved unaudited financial results for Q2 and H1 FY2025-26. The company reported consolidated revenue from operations of Rs 29,736.64 lakhs for Q2 FY26, up from Rs 24,248.13 lakhs in Q2 FY25. Net profit after tax increased to Rs 9,989.60 lakhs compared to Rs 7,631.10 lakhs in the previous year quarter. For the half-year period, revenue grew to Rs 57,138.29 lakhs from Rs 48,009.50 lakhs, while net profit rose to Rs 19,380.61 lakhs from Rs 14,975.28 lakhs. The Board declared an interim dividend of Rs 6 per equity share (120% of face value of Rs 5 each) for FY2025-26, with record date set as October 17, 2025. The company appointed Mr. Pravin Jogani as Company Secretary and Compliance Officer. Additionally, the Board approved incorporation of a subsidiary company in GIFT City, Gujarat, subject to regulatory approvals. Earnings per share for Q2 FY26 stood at Rs 12.03 compared to Rs 9.16 in Q2 FY25.",
            "Sentiment": "positive",
            "PublishDate": 1760355175912,
            "Source": "corporate_action"
        },
        {
            "Title": "TCS, Anand Rathi Wealth, and Elecon Engineering Announce Dividend Payouts This Week",
            "Summary": "Three companies will trade ex-dividend this week with specific record dates for shareholder eligibility. TCS declared a second interim dividend of Rs 11 per share with a record date of October 15 and payment scheduled for November 4, potentially disbursing Rs 3,979 crore based on 361 crore total shares. Elecon Engineering announced an interim dividend of Rs 0.50 per share with a record date of October 16 and payment by November 3, following a 14% revenue increase to Rs 578 crore in the July-September quarter. Anand Rathi Wealth set October 17 as the record date for its interim dividend, with board meeting scheduled for October 13 to finalize dividend details. Under India's T+1 settlement cycle, investors must purchase shares before the record date to qualify for dividend payments.",
            "Sentiment": "positive",
            "PublishDate": 1760242087895,
            "Source": "corporate_action"
        },
        {
            "Title": "Anand Rathi Wealth Shares Hit Record High of ₹2,940 on Strong Trading Volume",
            "Summary": "Anand Rathi Wealth shares rose over 5% to reach a record high of ₹2,940, marking the second consecutive day of gains. Trading volume reached 4 lakh shares, significantly above the 20-day average of 80,000 shares. The stock posted its fourth consecutive monthly gain in August with an 11.9% increase and has gained 50% in 2025. The company issued a 1:1 bonus share ratio and announced a final dividend of ₹7 per share. Joint CEO Feroze Azeez indicated internal discussions about issuing bonuses every two to three years with an aspiration to pay ₹14 dividend on expanded shares. Since its December 2021 IPO at ₹550 per share, the stock has gained 434.5% when adjusted for bonus shares. Three analysts cover the stock with one 'buy' rating and two 'hold' ratings.",
            "Sentiment": "positive",
            "PublishDate": 1756710060130,
            "Source": "stock"
        },
        {
            "Title": "Anand Rathi Wealth Limited Appoints Ms. Anupama Sharma as Compliance Officer",
            "Summary": "Anand Rathi Wealth Limited has appointed Ms. Anupama Sharma as the company's Compliance Officer, effective September 1, 2025. The Board of Directors approved the appointment on August 28, 2025, based on the Nomination and Remuneration Committee's recommendation dated August 26, 2025. Ms. Sharma is a Fellow member of the Institute of Company Secretaries of India (Membership No. FCS-11356) and holds a Bachelor's degree in Law and Master's degree in Commerce from University of Rajasthan. She brings over 8 years of experience in Corporate Laws, Secretarial functions and compliance requirements. The appointment fulfills regulatory requirements under SEBI (LODR) Regulations, 2015 and SEBI (Prohibition of Insider Trading) Regulations, 2015.",
            "Sentiment": "neutral",
            "PublishDate": 1756383745045,
            "Source": "corporate_governance"
        },
        {
            "Title": "Anand Rathi Sets Ambitious Growth Targets for FY26",
            "Summary": "Anand Rathi has set a target of Rs 1 Lakh Crore in Assets Under Management (AUM) by FY26. The company has already achieved 40% of this target in Q1. Additionally, Anand Rathi projects FY26 revenue of ₹1,175 Crores and Profit After Tax (PAT) of ₹375 Crores. In Q1 FY26, the company has attained 24% of its revenue goal and 25% of its PAT goal.",
            "Sentiment": "positive",
            "PublishDate": 1752464710000,
            "Source": "default"
        },
        {
            "Title": "Anand Rathi Wealth: Q1 Profit Surges 28% YoY to Rs 94 Crore",
            "Summary": "Anand Rathi Wealth reported a 28% YoY increase in Q1FY26 consolidated net profit to Rs 94 crore. Total revenue rose 16% to Rs 284 crore. AUM grew 27% YoY to Rs 87,797 crore. The company saw its highest-ever net flows in a quarter at Rs 3,825 crore. Active client families increased 19% YoY to 12,330.",
            "Sentiment": "positive",
            "PublishDate": 1752206080000,
            "Source": "earnings"
        },
        {
            "Title": "Anand Rathi Wealth Reports Q1 Financial Results",
            "Summary": "Anand Rathi Wealth has announced its quarterly financial results. The company's consolidated net profit for Q1 increased to 936 million rupees from 732 million rupees in the same quarter last year. Revenue for Q1 rose to 2.74 billion rupees from 2.38 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1752192393000,
            "Source": "default"
        }
    ]
}