{
    "Symbol": "ANDHRSUGAR",
    "ISIN": "INE715B01021",
    "News": [
        {
            "Title": "Andhra Sugars Q3 EBITDA Surges 140% to ₹514M",
            "Summary": "Andhra Sugars reports strong Q3 performance with EBITDA jumping to ₹514 million from ₹214 million year-on-year, while EBITDA margin nearly doubles to 8.14%.",
            "Sentiment": "positive",
            "PublishDate": 1770277688260,
            "Source": "co_actions_results"
        },
        {
            "Title": "Andhra Sugars Approves 470 Million Rupees Investment for Compressed Bio Gas Plant",
            "Summary": "Andhra Sugars has approved the establishment of a 10 TPD (tonnes per day) compressed bio gas plant with an investment of 470 million rupees. The company has given the green light for this bio gas production facility.",
            "Sentiment": "positive",
            "PublishDate": 1762334547974,
            "Source": "stock"
        },
        {
            "Title": "Andhra Sugars Reports Improved Q4 Financial Performance",
            "Summary": "Andhra Sugars has reported its Q4 financial results. The company's EBITDA increased to 517 million rupees from 303 million rupees year-over-year. The EBITDA margin improved to 10.33% from 7% in the same period last year. The company also reported an exceptional item of 239 million rupees. The profit before tax (PBT) for Q4 rose to 406 million rupees from 188 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748506389000,
            "Source": "result"
        },
        {
            "Title": "Andhra Sugars Reports Decrease in Q4 Consolidated Net Profit",
            "Summary": "Andhra Sugars has reported a consolidated net profit of 59 million rupees for the fourth quarter, compared to 253 million rupees in the same period last year, representing a significant year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1748506291000,
            "Source": "result"
        },
        {
            "Title": "Andhra Sugars Faces Farmer Boycott and Plant Closure",
            "Summary": "Farmers in the zones of Andhra Sugars' sugar factory have decided not to cultivate sugar cane. Additionally, the company is not planning to operate its sugar plant at Taduvai for the 2025-26 crushing season. This decision by both farmers and the company could significantly impact sugar production in the region.",
            "Sentiment": "negative",
            "PublishDate": 1733745121000,
            "Source": "corporate_action"
        }
    ]
}