{
    "Symbol": "ANDHRAPAP",
    "ISIN": "INE435A01051",
    "News": [
        {
            "Title": "Andhra Paper Q3FY26 Results: Profit Jumps to ₹984.89 Lakhs",
            "Summary": "Andhra Paper Limited reported net profit of ₹984.89 lakhs in Q3FY26 vs ₹1,164.87 lakhs in Q3FY25. Revenue from operations increased to ₹41,868.62 lakhs from ₹38,570.20 lakhs YoY.",
            "Sentiment": "positive",
            "PublishDate": 1770204304870,
            "Source": "co_actions_results"
        },
        {
            "Title": "Andhra Paper Limited Receives Credit Ratings from ICRA Limited for Rs 350 Crore Bank Facilities",
            "Summary": "ICRA Limited assigned credit ratings to Andhra Paper Limited's bank facilities totaling Rs 350 crore, including ICRA [AA] (Stable) for long-term fund-based facilities of Rs 306 crore and ICRA [A1+] for short-term non-fund based facilities of Rs 25 crore. The ratings are at the same level as previously assigned by CARE Ratings Limited, representing a procedural transition with enhanced rated limits reflecting current banking arrangements.",
            "Sentiment": "neutral",
            "PublishDate": 1764852172965,
            "Source": "corporate_action"
        },
        {
            "Title": "Andhra Paper Limited Voluntarily Withdraws Credit Rating from CARE Ratings",
            "Summary": "Andhra Paper Limited voluntarily requested and received withdrawal of its bank facilities credit rating from CARE Ratings Limited, with the withdrawal completed on November 28, 2025 after obtaining no-objection certificate from lenders. The company informed stock exchanges BSE and NSE about the rating withdrawal as part of its regulatory disclosure obligations.",
            "Sentiment": "neutral",
            "PublishDate": 1764392507271,
            "Source": "corporate_action"
        },
        {
            "Title": "Andhra Paper Reports Net Loss of Rs 20.26 Crore in Q2 Due to Worker Strike and Plant Outage",
            "Summary": "Andhra Paper Limited reported a net loss of Rs 20.26 crore for the quarter ended September 30, 2025, compared to a profit of Rs 21.31 crore in the same period last year. Revenue from operations declined to Rs 362.08 crore from Rs 393.42 crore year-on-year. The company's manufacturing operations at Rajahmundry were disrupted by a worker strike from July 6-12, 2025, over wage settlement demands, leading to a lockout declaration on July 13. Additionally, a planned annual maintenance outage occurred for 14 days from July 13-26, 2025. For the half-year period, the company posted a net profit of Rs 43.16 crore on revenue of Rs 755.50 crore. The company operates in pulp, paper and paperboard manufacturing as its single business segment.",
            "Sentiment": "negative",
            "PublishDate": 1762471726073,
            "Source": "earnings"
        },
        {
            "Title": "Andhra Paper Reports Q2 Loss with Revenue Declining to 3.6B Rupees",
            "Summary": "Andhra Paper reported quarterly results showing an EBITDA loss of 68 million rupees compared to a gain of 523 million rupees in the same period last year. The company posted a net loss of 203 million rupees versus a loss of 417 million rupees year-over-year. Revenue declined to 3.6 billion rupees from 4.3 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762430723849,
            "Source": "earnings"
        },
        {
            "Title": "Andhra Paper Limited Reconstitutes Board Committees with New Appointments",
            "Summary": "Andhra Paper Limited has reconstituted its board committees effective October 29, 2025. The Audit Committee will be chaired by Virendra Sinha with new members Ramesh Kumar Aggarwal and Papia Sengupta joining alongside Saurabh Bangur. The Nomination and Remuneration Committee will have Virendra Sinha as chairman with Deepak Jalan as a new member and Shree Kumar Bangur continuing. The Stakeholders Relationship Committee will be headed by Virendraa Bangur with Papia Sengupta and Mukesh Jain as members. The Risk Management Committee remains under Saurabh Bangur's chairmanship with Mukesh Jain continuing and Deepak Jalan being added as a new member.",
            "Sentiment": "neutral",
            "PublishDate": 1761657618307,
            "Source": "corporate_governance"
        },
        {
            "Title": "Andhra Paper Limited Reappoints Papia Sengupta as Independent Director for Second Term",
            "Summary": "Andhra Paper Limited shareholders approved the reappointment of Papia Sengupta as an Independent Director for a second term of three years, effective September 01, 2025, at the 61st Annual General Meeting held on August 07, 2025. Sengupta, who holds DIN 07701564, is a science graduate with CFA and CAIIB qualifications. Her core competencies include Corporate & MSME Finance, Stressed Assets Management, Risk Management, Banking, Treasury & Investment, Audit & Inspection, Overseas Banking, and Human Resource Management. The company confirmed that Sengupta has not been debarred from holding directorship by any regulatory authority and is not related to any other director of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1754737293606,
            "Source": "corporate_governance"
        },
        {
            "Title": "Andhra Paper Approves Rs 178 Crore Investment to Upgrade Paper Machine at Rajahmundry Facility",
            "Summary": "Andhra Paper Limited's Board of Directors approved a capital investment of up to Rs 178 crores for upgrading and rebuilding Paper Machine-3 at their Rajahmundry manufacturing facility. The project is expected to increase production capacity by 60% incrementally, adding up to 60 tonnes per day to the existing capacity of 36,000 tonnes per annum, which is currently operating at 100% utilization. The capacity addition is estimated to be completed within 13 months and will be financed through internal accruals or bank financing. The company stated that this capacity addition aligns with their core area of operations.",
            "Sentiment": "positive",
            "PublishDate": 1754402502463,
            "Source": "stock"
        },
        {
            "Title": "Andhra Paper Approves Rs. 178 Crore Capital Investment and Appoints Two Independent Directors",
            "Summary": "Andhra Paper Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, along with the limited review report from statutory auditors M/s. MSKA & Associates. The Board appointed Mr. Ramesh Kumar Aggarwal and Mr. Deepak Jalan as Additional Directors in Non-Executive Independent Director capacity for three years from October 29, 2025 to October 28, 2028, subject to shareholder approval through postal ballot. The company approved capital investment of Rs. 178 crores for upgrading Paper Machine-3 at the Rajahmundry facility, expected to increase production capacity by 60% from the existing 36,000 tons per annum. The project is estimated to complete within 13 months and will be financed through internal accruals or bank financing. The Board also noted payment of fines under protest levied by NSE and BSE for alleged non-compliance with regulations, with an appeal petition submitted before Securities Appellate Tribunal, Mumbai.",
            "Sentiment": "positive",
            "PublishDate": 1754401617649,
            "Source": "corporate_action"
        },
        {
            "Title": "Andhra Paper Reports Flat EBITDA at 336M Rupees with Margin Compression",
            "Summary": "Andhra Paper reported Q1 EBITDA of 336 million rupees, unchanged from the same period last year. However, the company's EBITDA margin declined to 8.54% compared to 10.66% in the previous year, indicating reduced profitability despite maintaining absolute earnings levels.",
            "Sentiment": "negative",
            "PublishDate": 1754400698944,
            "Source": "earnings"
        },
        {
            "Title": "Andhra Paper Announces Lockout at Rajahmundry Plant",
            "Summary": "Andhra Paper has declared a lockout at its Rajahmundry plant due to an ongoing workers' strike. The company has temporarily closed the facility in response to the labor dispute.",
            "Sentiment": "negative",
            "PublishDate": 1752217175000,
            "Source": "default"
        },
        {
            "Title": "Andhra Paper Declares Dividend, Reports Q4 EBITDA Decline",
            "Summary": "Andhra Paper has declared a dividend of 1 rupee per equity share. The company's Q4 EBITDA decreased to 203 million rupees from 352 million rupees year-over-year. The Q4 EBITDA margin also declined to 4.98% from 9.68% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1746713886000,
            "Source": "result"
        },
        {
            "Title": "Andhra Paper Reports Decline in Q4 Net Profit",
            "Summary": "Andhra Paper's Q4 net profit decreased to 79 million rupees, down from 384 million rupees year-over-year and 116 million rupees quarter-over-quarter. However, Q4 revenue increased to 4.1 billion rupees from 3.6 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1746713777000,
            "Source": "result"
        },
        {
            "Title": "Andhra Paper Reports Significant Decline in Q3 EBITDA and Margin",
            "Summary": "Andhra Paper's Q3 EBITDA decreased to 283 million rupees from 1.1 billion rupees year-over-year. The company's EBITDA margin also fell sharply to 7.34% from 23.00% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738844479000,
            "Source": "earnings"
        },
        {
            "Title": "Andhra Paper Reports Significant Decline in Q3 Profit and Revenue",
            "Summary": "Andhra Paper has reported a substantial decrease in both net profit and revenue for the third quarter. The company's net profit fell to 116 million rupees from 820 million rupees in the same period last year. Revenue also declined, dropping to 3.9 billion rupees from 4.8 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738844474000,
            "Source": "earnings"
        },
        {
            "Title": "Andhra Paper Ltd: Rajahmundry Unit Resumes Operations After Lockout Settlement",
            "Summary": "Andhra Paper Ltd has revoked the lockout at its Rajahmundry manufacturing facility, effective January 7, 2025, following an amicable settlement with trade unions. Normal operations have resumed after a workers' strike that began on January 3, 2025, causing a daily production loss of 510 metric tonnes.",
            "Sentiment": "positive",
            "PublishDate": 1736247369000,
            "Source": "corporate_action"
        },
        {
            "Title": "Andhra Paper Reaches Settlement with Trade Unions",
            "Summary": "Andhra Paper Limited has announced an amicable settlement with its trade unions. This agreement likely resolves ongoing labor disputes or negotiations, potentially improving the company's operational stability and labor relations.",
            "Sentiment": "positive",
            "PublishDate": 1736243501000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Andhra Paper Ltd: Workers' Strike Disrupts Rajahmundry Plant Operations",
            "Summary": "Andhra Paper Ltd's Rajahmundry plant operations disrupted due to workers' strike starting January 3, 2025. Daily production loss of 510 MT. Strike initiated by Workers Trade Unions demanding higher wage revision. Management in discussions with unions for resolution.",
            "Sentiment": "negative",
            "PublishDate": 1735920830000,
            "Source": "normal_news"
        },
        {
            "Title": "Andhra Paper's Rajahmundry Plant Operations Disrupted by Workers' Strike",
            "Summary": "Andhra Paper's manufacturing plant in Rajahmundry is experiencing operational disruptions due to a workers' strike. The company reports that each day of the strike results in a production loss of approximately 510 metric tons.",
            "Sentiment": "negative",
            "PublishDate": 1735914371000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Andhra Paper Reports Significant Decline in Q2 EBITDA",
            "Summary": "Andhra Paper's Q2 EBITDA has dropped to 523 million rupees from 1.31 billion rupees year-over-year. The company's EBITDA margin has also decreased, falling to 12.10% from 27.23% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730724058000,
            "Source": "result"
        },
        {
            "Title": "Andhra Paper Reports Q2 Financial Results",
            "Summary": "Andhra Paper has announced its Q2 financial results. The company reported a net profit of 417 million rupees, which is lower compared to 1 billion rupees in the same quarter last year (YoY) but higher than 277 million rupees in the previous quarter (QoQ). The Q2 revenue stood at 4.3 billion rupees, down from 4.82 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730724004000,
            "Source": "result"
        }
    ]
}