{
    "Symbol": "ANGELONE",
    "ISIN": "INE732I01013",
    "News": [
        {
            "Title": "Angel One Reports Strong Growth in Client Base & Funding",
            "Summary": "Angel One's client funding book surged 45.7% YoY to ₹61.18 billion in January, while client base expanded 20.8% to 36.39 million, demonstrating robust business momentum across key metrics.",
            "Sentiment": "positive",
            "PublishDate": 1770172083561,
            "Source": "stocks"
        },
        {
            "Title": "Angel One Schedules Committee Meet for NCD Issuance",
            "Summary": "Angel One Limited has scheduled its Loan Investment and Borrowings Committee meeting for February 03, 2026, to consider the issuance of Non-Convertible Debentures on private placement basis.",
            "Sentiment": "neutral",
            "PublishDate": 1769691405226,
            "Source": "stocks"
        },
        {
            "Title": "Angel One Q3FY26: Revenue up 4% YoY, margin improves",
            "Summary": "Angel One reported total income of ₹10.30 billion in Q3FY26, up 4% YoY. Operating margin improved to 39.4% from 34.5% in Q2FY26. Motilal Oswal maintains BUY rating with target price of ₹3,400.",
            "Sentiment": "positive",
            "PublishDate": 1768981958132,
            "Source": "co_actions_results"
        },
        {
            "Title": "Angel One Makes Q3 FY26 Earnings Call Recording Available",
            "Summary": "Angel One Limited has made the audio recording of its earnings call with analysts and investors held on January 16, 2026, available on its official website under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768566711719,
            "Source": "co_actions_results"
        },
        {
            "Title": "Angel One Rules Out Pricing Hikes in Concall",
            "Summary": "Angel One management confirms no plans to increase per-order pricing in future, maintaining current fee structure for clients during recent conference call.",
            "Sentiment": "neutral",
            "PublishDate": 1768544389568,
            "Source": "stocks"
        },
        {
            "Title": "Angel One, capital market stocks surge up to 8%",
            "Summary": "Angel One and other capital market stocks gained up to 8% following strong Q3 results. Angel One reported 27% QoQ profit growth to ₹269 crore, approved ₹23 interim dividend and 1:10 stock split.",
            "Sentiment": "positive",
            "PublishDate": 1768538986299,
            "Source": "co_actions_results"
        },
        {
            "Title": "Angel One approves 1:10 stock split, face value to ₹1",
            "Summary": "Angel One Board approves subdivision of equity shares in 1:10 ratio, reducing face value from ₹10 to ₹1 per share to enhance affordability and liquidity for retail investors.",
            "Sentiment": "positive",
            "PublishDate": 1768483696733,
            "Source": "co_actions_results"
        },
        {
            "Title": "Angel One Declares ₹23 Interim Dividend, Stock Split",
            "Summary": "Angel One announces Q3 FY26 results with ₹23 per share interim dividend and 1:10 stock split. Board withdraws proposed business transfer scheme after careful consideration of market developments.",
            "Sentiment": "positive",
            "PublishDate": 1768483655513,
            "Source": "co_actions_results"
        },
        {
            "Title": "Angel One Q3FY26: Dividend ₹23, 1:10 Stock Split",
            "Summary": "Angel One declares ₹23 interim dividend and 1:10 stock split for Q3FY26, while withdrawing proposed business transfer to subsidiary Angel Securities Limited.",
            "Sentiment": "positive",
            "PublishDate": 1768483133505,
            "Source": "co_actions_results"
        },
        {
            "Title": "Angel One Q3: FnO Share Drops to 44.3% of Revenue",
            "Summary": "Angel One management reveals FnO contribution declined to 44.3% from 52.5% YoY, showing deliberate shift to balanced revenue mix. Q3 profit at ₹268.60 cr, ₹23 dividend approved.",
            "Sentiment": "neutral",
            "PublishDate": 1768482179507,
            "Source": "co_actions_results"
        },
        {
            "Title": "Angel One Narrows Gap with Zerodha in Active Clients",
            "Summary": "Angel One's active client base reached 6.76 million, closing the gap with market leader Zerodha at 6.85 million clients. The difference has shrunk dramatically from 1.17 million in FY24 to just 90,000 clients currently.",
            "Sentiment": "positive",
            "PublishDate": 1768319860818,
            "Source": "stocks"
        },
        {
            "Title": "Angel One Board Meet Jan 15: Stock Split & Dividend",
            "Summary": "Angel One's board meeting on January 15, 2026, will discuss stock split proposal and first interim dividend for FY26 alongside Q3 financial results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1768147641531,
            "Source": "co_actions_results"
        },
        {
            "Title": "Angel One Board to Consider Share Split & Interim Dividend",
            "Summary": "Angel One's board will meet on January 15, 2026, to discuss share subdivision and first interim dividend for FY26. Record date set for January 21, 2026, with trading window closed until January 17.",
            "Sentiment": "positive",
            "PublishDate": 1768027105461,
            "Source": "co_actions_results"
        },
        {
            "Title": "Angel One Shares Rise 2% On Strong December Business Update",
            "Summary": "Angel One shares gained 2% after reporting strong December performance with 35% month-on-month growth in client acquisition and 10% increase in orders, ahead of January 15 board meeting.",
            "Sentiment": "positive",
            "PublishDate": 1767794466999,
            "Source": "co_actions_results"
        },
        {
            "Title": "Angel One Appoints Ajit Sinha as General Counsel",
            "Summary": "Angel One Limited announces Ajit Sinha's appointment as General Counsel, bringing 24+ years of experience from NSE, HSBC, and Citicorp Finance to strengthen legal and compliance frameworks.",
            "Sentiment": "positive",
            "PublishDate": 1767590773011,
            "Source": "stocks"
        },
        {
            "Title": "Angel One Reports Strong Growth with Client Funding Up 50.1% and User Base Reaching 35.08 Million",
            "Summary": "Angel One achieved ₹59.50 billion in client funding during November, marking a 50.1% year-over-year increase, while expanding its client base to 35.08 million users. The brokerage firm demonstrated robust growth with a 21.9% year-over-year expansion in its customer base, indicating strong business momentum.",
            "Sentiment": "neutral",
            "PublishDate": 1764730659335,
            "Source": "stock"
        },
        {
            "Title": "Angel One Allots 31,590 Equity Shares Under Employee Incentive Plan",
            "Summary": "Angel One's Securities Allotment Committee approved the allotment of 31,590 equity shares with face value of Rs. 10 each to eligible employees under the Angel Broking Employee Long Term Incentive Plan 2021. Following this allotment, the company's issued, subscribed and paid-up capital stands at Rs. 908,393,390 comprising 90,839,339 equity shares of Rs. 10 face value each.",
            "Sentiment": "neutral",
            "PublishDate": 1764230526635,
            "Source": "corporate_action"
        },
        {
            "Title": "Angel One's Group General Counsel Meenal Maheshwari Shah Resigns",
            "Summary": "Ms. Meenal Maheshwari Shah, Group General Counsel and Senior Management Personnel at Angel One, has tendered her resignation from the company. This departure affects the senior leadership structure of the financial services firm.",
            "Sentiment": "neutral",
            "PublishDate": 1763422497383,
            "Source": "corporate_governance"
        },
        {
            "Title": "Angel One Fined Rs 3 Lakh by SEBI for Trading Terminal Violations",
            "Summary": "SEBI imposed a penalty of Rs 3,00,000 on Angel One Limited for alleged non-compliances related to authorized person trading activities. The violations were identified during a thematic inspection conducted by SEBI and NSE focusing on authorized persons using large numbers of trading terminals for proprietary trade. The inspection covered the period from January 1, 2024 to June 30, 2024, with an onsite inspection of authorized person Mr. Ashwin Thakkar conducted on July 30, 2024. The alleged violations include operation of terminals by unapproved/unauthorized users, non-availability of terminals at reported locations, authorized person dealing with other authorized persons of the company, and inadequate supervision of authorized persons. Angel One stated there is no material financial or operational impact on the company due to this order.",
            "Sentiment": "negative",
            "PublishDate": 1762946391934,
            "Source": "corporate_governance"
        },
        {
            "Title": "Angel One Reports Mixed October Performance with 11-Month High in Daily Orders",
            "Summary": "Angel One disclosed its October business metrics showing mixed performance across segments. The company achieved an 11-month high in average daily orders at 6.69 million, up 15.3% month-on-month, bringing it closer to its FY25 average run rate. Client base grew to 34.57 million, while the average client funding book increased to Rs 57.91 billion. However, the number of orders declined 21.9% year-on-year to 133.76 million. The company witnessed lifetime high orders and turnover in the commodity segment, though its commodity market share moderated to 55.1% due to composition shifts toward bullion. Overall equity market share remained stable at 20.4%, while cash turnover market share was 18.5%. Angel One's overall average daily turnover reached Rs 50,204 crores, up 23.1% year-on-year.",
            "Sentiment": "neutral",
            "PublishDate": 1762393813820,
            "Source": "stock"
        },
        {
            "Title": "Angel One Settles Disclosure Violation Case with Sebi for Rs 34.57 Lakh",
            "Summary": "Angel One settled a case with Sebi by paying Rs 34.57 lakh for alleged disclosure lapses. The brokerage was accused of failing to disclose material developments related to a proposed scheme of arrangement and delayed disclosure by approximately 2 hours regarding a meeting outcome on August 9, 2023. These actions violated Sebi's LODR Regulations. Sebi initiated adjudication proceedings and issued a show-cause notice dated April 16, 2025. Angel One filed a settlement application without admitting or denying the findings, and upon payment of the settlement amount, Sebi disposed of the proceedings.",
            "Sentiment": "negative",
            "PublishDate": 1762254640297,
            "Source": "corporate_governance"
        },
        {
            "Title": "SEBI Issues Settlement Order for Angel One Limited",
            "Summary": "SEBI has announced a settlement order regarding Angel One Limited. The regulatory body has reached a settlement arrangement with the stockbroking company.",
            "Sentiment": "neutral",
            "PublishDate": 1762244409226,
            "Source": "corporate_governance"
        },
        {
            "Title": "Angel One Grants 2,090 Stock Options to Employee Under Long-Term Incentive Plan",
            "Summary": "Angel One Limited granted 2,090 Restrictive Stock Units (RSUs) to one eligible employee under its Angel Broking Employee Long Term Incentive Plan 2021. The grant was effective November 3, 2025, with each RSU convertible into one equity share of face value Rs. 10. The RSUs will vest over a 4-year period, and the exercise period will commence from the vesting date and expire 10 years from the grant date. The Long Term Incentive Plan 2021 was adopted in accordance with SEBI regulations and is administered by the company's Nomination and Remuneration Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1762187301332,
            "Source": "corporate_action"
        },
        {
            "Title": "Angel One Allots 90,821 Equity Shares Under Employee Incentive Plan",
            "Summary": "Angel One Limited has allotted 90,821 equity shares with a face value of Rs. 10 each to eligible employees under the Angel Broking Employee Long Term Incentive Plan 2021. The Securities Allotment Committee approved this allotment in a meeting held on October 30, 2025. Following this allotment, the company's issued, subscribed, and paid-up capital now stands at Rs. 908,077,490, comprising 90,807,749 equity shares of Rs. 10 face value each.",
            "Sentiment": "neutral",
            "PublishDate": 1761825853640,
            "Source": "corporate_action"
        },
        {
            "Title": "Angel One Reports 5.3% Revenue Growth to ₹12 Billion in Q2 FY26, Launches AI Chatbot and Insurance JV",
            "Summary": "Angel One delivered quarterly results with gross revenues increasing 5.3% quarter-on-quarter to ₹12 billion and net revenues growing 5.6% to ₹9.4 billion. The client base crossed 34 million with over 1.7 million new clients added, representing 12.2% sequential growth. The company's Demat market share rose to 16.5% and retail equity turnover market share increased by 71 basis points to 20.5%. The client funding book reached ₹53 billion, up 26.1% quarter-on-quarter. Angel One launched an AI-powered chatbot called Ask Angel, which resolved over 80% of user queries without escalation and reduced resolution time by 67% for 95% of cases. The company registered nearly 2.4 million new SIPs, growing 24% sequentially, and strengthened its position as the second largest player in incremental SIPs. Credit disbursals rose sharply from ₹2.3 billion to ₹4.6 billion this quarter. Angel One entered a joint venture with LivWell Holding Company for digital-led life insurance, holding a 26% stake in the ₹4 billion venture subject to regulatory approvals. The company announced plans to set up a branch in GIFT City. Ionic Wealth expanded AUM to over ₹61 billion from 1,250+ clients, while the asset management business launched commodity funds with ₹4 billion in assets across nearly 1.4 lakh folios. The company maintains guidance for 40-45% operating margins by Q4 exit.",
            "Sentiment": "positive",
            "PublishDate": 1761220573140,
            "Source": "earnings"
        },
        {
            "Title": "Angel One Considers Capital Raising Options Following 100% FDI Rule Change",
            "Summary": "Angel One is planning to either raise additional capital or allow its foreign partner to increase their stake. This decision follows new regulations that permit 100% foreign direct investment in the sector.",
            "Sentiment": "positive",
            "PublishDate": 1760683342803,
            "Source": "stock"
        },
        {
            "Title": "Angel One Sets EBITDA Margin Target of 40-45% by Q4 FY26, Projects Long-Term Growth Across Business Segments",
            "Summary": "Angel One has outlined its financial targets and business expansion timeline. The company aims to achieve 40-45% EBITDA margin by Q4 FY26 and targets a long-term operating margin of 45-50%. For new business ventures, the company expects wealth management operations to break even within 2.5-3 years, while its Asset Management Company (AMC) business is projected to reach breakeven in 7-8 years. These new ventures are expected to contribute double-digit revenue growth over the next 3-5 years. The company's core broking business is projected to grow 25-30% in the long term.",
            "Sentiment": "positive",
            "PublishDate": 1760671825756,
            "Source": "stock"
        },
        {
            "Title": "Angel One Raises Brokerage Fees as Profits Decline for Third Consecutive Quarter",
            "Summary": "Angel One will increase its brokerage charges starting November 17, marking its first fee revision in several years. The equity delivery brokerage will rise to the lower of Rs 20 or 0.1% per trade with a minimum charge of Rs 5, up from Rs 2 previously. Intraday cash segment trades will now be charged the lower of Rs 20 or 0.1% per trade, compared to the earlier rate of 0.03%. The fee hike comes as the company faces declining profitability, with September quarter consolidated profit falling 50% year-on-year to Rs 2,120 crore, marking the third consecutive quarterly decline. Revenue dropped 20.7% to Rs 12,020 crore, while gross client acquisition decreased 41.9% and total orders fell 26.3%. The changes follow regulatory curbs on derivatives trading, including SEBI raising minimum contract values for derivatives and limiting weekly index options to one per exchange in November 2024, which has reduced retail trading activity across the industry.",
            "Sentiment": "negative",
            "PublishDate": 1760608962096,
            "Source": "stock"
        },
        {
            "Title": "Angel One Profit Drops 50% to Rs 212 Crore Amid Regulatory Impact on Derivatives Trading",
            "Summary": "Angel One reported its third consecutive quarterly profit decline, with consolidated profit falling 50% year-on-year to Rs 212 crore for the July-September quarter. The decline was attributed to SEBI's regulatory measures implemented in November, which raised minimum contract values and restricted weekly index options to one per exchange, impacting equity derivatives trading and retail investor activity. Key business metrics showed significant declines: gross client acquisition fell 41.9%, total orders dropped 26.3%, and revenue declined 20.7% year-on-year to Rs 1,202 crore. However, sequential performance showed improvement with profit growing 85.1% from the previous quarter's Rs 114 crore and revenue rising 5.4% from Rs 1,141 crore. To counter the slowdown, Angel One is diversifying beyond broking into margin funding, wealth management, insurance, loan distribution, and asset management. SEBI indicated in August it is considering further measures to extend equity derivatives contract tenures and limit trading participants.",
            "Sentiment": "negative",
            "PublishDate": 1760587721348,
            "Source": "earnings"
        },
        {
            "Title": "Angel One Focuses on AI-Driven Financial Technology and Diversified Revenue Streams",
            "Summary": "Angel One is targeting growth through artificial intelligence-driven financial technology and diversified income sources. The company is positioning itself to leverage AI capabilities in its financial services offerings while working to expand its revenue base across multiple streams.",
            "Sentiment": "positive",
            "PublishDate": 1760547109632,
            "Source": "stock"
        },
        {
            "Title": "Angel One Reports 79% Sequential Profit Jump in Q2 Results",
            "Summary": "Angel One reported quarterly results showing net profit surged 78.8% sequentially to Rs 294 crore. Total income rose 5.3% quarter-on-quarter to Rs 1,056 crore. Assets under management increased 16.8% to Rs 400 crore, while wealth management AUM grew 21.3% to Rs 6,140 crore with client base expanding to over 1,250. The brokerage processed 36 crore total orders, up 5% from previous quarter's 34.4 crore. F&O orders jumped 7.2% while cash orders declined 2.2%. Total unique SIPs registered rose 23.8% to 2.4 million and credit disbursals nearly doubled with a 97% increase to Rs 4.6 billion. Total client base grew 4.9% quarter-on-quarter, though NSE active client base fell 5.9%. Group CEO Ambarish Kenghe highlighted strong momentum across businesses with mutual fund SIPs reaching record highs and Ionic Wealth crossing Rs 61 billion in AUM. Shares closed 1.69% higher at Rs 2,445.20.",
            "Sentiment": "positive",
            "PublishDate": 1760540702230,
            "Source": "earnings"
        },
        {
            "Title": "Angel One Reports Decline in Q2 Financial Performance, Plans GIFT City Branch",
            "Summary": "Angel One reported Q2 consolidated net profit of 2.1 billion rupees, down from 4.23 billion rupees year-over-year. Revenue decreased to 12 billion rupees from 15.15 billion rupees in the same period last year. EBITDA fell to 4.16 billion rupees compared to 6.72 billion rupees year-over-year, with EBITDA margin declining to 34.57% from 44.35%. The company plans to establish a new branch in GIFT City, Gujarat.",
            "Sentiment": "negative",
            "PublishDate": 1760537017768,
            "Source": "stock"
        },
        {
            "Title": "Angel One Approves Financial Results and GIFT City Business Unit Setup",
            "Summary": "Angel One Limited's Board of Directors approved the unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The board also approved setting up a business unit in GIFT City, Gandhinagar, Gujarat, subject to regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1760536976472,
            "Source": "earnings"
        },
        {
            "Title": "Angel One Reports Strong Growth in Client Funding and User Base in September",
            "Summary": "Angel One reported its September average client funding book reached ₹55.53 billion, marking a 35.8% increase year-over-year. The company's client base expanded to 34.08 million users, representing a 24.0% growth compared to the same period last year. Both metrics demonstrate significant growth in the company's business operations.",
            "Sentiment": "positive",
            "PublishDate": 1759718515306,
            "Source": "stock"
        },
        {
            "Title": "Angel One Appoints Sridhar Govardhan as Group Chief Information Security Officer",
            "Summary": "Angel One Limited confirmed that Sridhar Govardhan has joined as Group Chief Information Security Officer, effective October 1, 2025. Govardhan becomes part of the company's Senior Management Personnel through this full-time employment appointment. He brings 24+ years of cybersecurity expertise, having previously held security leadership roles at Wipro (including Global CISO), Flipkart, and CoinDCX, where he developed frameworks for emerging technologies including Web3 and crypto. His experience spans cybersecurity strategy, risk management, compliance, and governance.",
            "Sentiment": "positive",
            "PublishDate": 1759305389564,
            "Source": "corporate_governance"
        },
        {
            "Title": "Angel One Incorporates Life Insurance Associate Company with LivWell for INR 1.04 Billion Investment",
            "Summary": "Angel One Limited has incorporated a new associate company named Angel One LivWell Life Insurance Limited on September 11, 2025, in collaboration with LivWell Holding Company Pte. Limited. The company was incorporated under Corporate Identification Number U65110KA2025FLC208328. Angel One will hold a 26% shareholding in the life insurance venture and invest approximately INR 1.04 billion through cash consideration at face value. The new entity will operate as an unlisted public company in the life insurance business in India, subject to regulatory approvals from IRDAI and Ministry of Corporate Affairs. Angel One will not exercise control over the company despite its stake. The investment aims to expand Angel One's presence in the broader financial services ecosystem, complementing its existing stock broking and financial services business to drive long-term value creation for stakeholders.",
            "Sentiment": "positive",
            "PublishDate": 1758029609572,
            "Source": "order&deals"
        },
        {
            "Title": "Angel One Shares Decline as Gross Client Acquisition Drops 15% in August",
            "Summary": "Angel One reported mixed business results for August. Gross client acquisition fell 15% to 5.5 lakh from 6.4 lakh in July, marking the first decline after four consecutive months of growth. However, the overall client base grew 1.5% to 3.35 crore. Average daily orders increased 8.1% to 57.8 lakh, driving average daily turnover up 10.5% to ₹45.84 lakh crore, the highest since October 2024. Average daily premium turnover surged 30.5% to ₹1.46 lakh crore. Market share gains were recorded across segments: equity increased 67 basis points to 20.7%, F&O rose 92 basis points to 22.1%, and commodity jumped 390 basis points to 67.6%. Angel One shares initially gained 2.9% but reversed to trade 0.2% lower at ₹2,267.7, with the stock down 25% year-to-date.",
            "Sentiment": "negative",
            "PublishDate": 1756970479293,
            "Source": "stock"
        },
        {
            "Title": "Angel One Reports 37.4% Growth in Client Funding Book to ₹52.91 Billion in August",
            "Summary": "Angel One reported an average client funding book of ₹52.91 billion in August, representing a 37.4% increase year-over-year. The company's client base reached 33.57 million, marking a 26.0% growth compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1756953845362,
            "Source": "stock"
        },
        {
            "Title": "Angel One Shares Drop 6.6% Following SEBI Chairman's Derivatives Tenure Comments",
            "Summary": "Angel One shares declined 6.6% after SEBI Chairperson Tuhin Kanta Pandey discussed increasing the tenure of derivative contracts and announced plans for a consultation paper on equity derivatives tenure. The stock traded 5% lower at ₹2,583.9 and remains down 27% from its 52-week high. Angel One reported its F&O market share increased to 21.2% in July from 20.8% in June, while equity market share rose to 20.1% from 19.6%. The company's MD & CEO Dinesh Thakkar previously stated that 45% of Angel One's revenue comes from F&O broking and expressed optimism about margins improving to nearly 40% by the March quarter from 34% in the first quarter.",
            "Sentiment": "negative",
            "PublishDate": 1755760926126,
            "Source": "stock"
        },
        {
            "Title": "Angel One: New SEBI Broker Rules to Benefit Tech-Driven Brokerages",
            "Summary": "Angel One announced that new SEBI broker rules will benefit large technology-driven brokerages by reducing compliance issues. The proposed regulations aim to simplify compliance processes, eliminate unnecessary procedural steps, and align regulatory requirements with technological advancements. These changes are expected to reduce operating costs and improve scalability for brokerage firms.",
            "Sentiment": "positive",
            "PublishDate": 1755060017745,
            "Source": "stock"
        },
        {
            "Title": "Angel One Reports Mixed July 2025 Performance with 28% Client Base Growth but 44% Drop in New Acquisitions",
            "Summary": "Angel One Limited disclosed its July 2025 business metrics showing a client base of 33.06 million, representing a 28.2% year-over-year increase and 1.8% month-over-month growth. The company's average client funding book reached Rs. 50.79 billion, up 36.1% annually and 7.9% monthly. However, gross client acquisition declined significantly to 0.64 million, down 43.6% from July 2024's 1.14 million despite a 17% monthly increase. Total orders dropped 28.2% year-over-year to 123 million, while average daily orders fell 31.3% to 5.35 million. The company showed strength in mutual fund SIPs with 889,210 unique registrations, up 16% annually. Market share expanded across segments, with overall equity market share reaching 20.1% and F&O market share at 21.2%. Average daily turnover based on notional turnover was Rs. 41,502 billion overall, down 4.6% year-over-year but up 18.6% monthly. Commodity market share stood at 63.7%, representing a significant 546 basis points monthly increase.",
            "Sentiment": "neutral",
            "PublishDate": 1754361258819,
            "Source": "stock"
        },
        {
            "Title": "Angel One Partners with LivWell to Launch Digital-First Life Insurance Joint Venture",
            "Summary": "Angel One will enter the life insurance sector through a joint venture with LivWell, backed by private equity firm Olympus Capital. The partnership involves a ₹400 crore capital infusion, with Angel One contributing 26% (₹104 crore) and LivWell contributing 74% (₹296 crore). The joint venture aims to become India's first fintech-partnered life insurance business, targeting the 83% protection gap particularly among the 26-35 age group. Former Prudential Asia regional CEO Wilf Blackburn will serve as chairperson, while former Aviva Vietnam deputy CEO Nikhil Verma will be CEO. The venture is expected to create new revenue streams for Angel One and strengthen its digital distribution network. Angel One shares closed up 0.8% at ₹2,828, though the stock has declined 6.3% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1753326612770,
            "Source": "stock"
        },
        {
            "Title": "Angel One Reports 8.1% Revenue Growth in Q1 FY26 Despite Regulatory Headwinds",
            "Summary": "Angel One Limited reported gross revenues of ₹11.4 billion in Q1 FY26, marking an 8.1% quarter-on-quarter increase, while net revenues grew 7.3% to ₹8.9 billion. The company added over 1.5 million clients during the quarter, with 88% coming from Tier 2, 3 and beyond cities. Total orders rose 4.8% sequentially to 343 million, demonstrating healthy client engagement despite being the first full quarter after index derivative regulations implementation. The client funding book reached an all-time high of ₹48 billion. However, reported PAT declined 34% quarter-on-quarter to ₹1.1 billion due to IPL sponsorship costs of ₹1.1 billion and variable pay adjustments. On a normalized basis, adjusting for these items, PAT grew 26% to approximately ₹1.9 billion. The company maintained its market share at 16.3% for total demat accounts and 21.7% for incremental acquisitions. Management expressed confidence in achieving normalized operating margins of 40-45% by the end of Q4 FY26, citing expected improvements in market conditions and retail participation.",
            "Sentiment": "positive",
            "PublishDate": 1753274236386,
            "Source": "earnings"
        },
        {
            "Title": "Angel One Approves Joint Venture with LivWell to Enter Life Insurance Business",
            "Summary": "Angel One Limited's Board of Directors approved a joint venture with LivWell Holding Company Pte. Limited to enter the life insurance business in India. Angel One will hold a 26% equity stake as the Indian promoter, while LivWell will hold 74%. The investment is estimated at approximately INR 1.04 billion. The joint venture entity will be classified as an associate company of Angel One and is subject to regulatory approvals from IRDAI and the Ministry of Corporate Affairs. Angel One operates in stock broking and financial services, and this expansion aims to broaden its presence in the financial services ecosystem to drive long-term value creation for stakeholders.",
            "Sentiment": "positive",
            "PublishDate": 1753272592536,
            "Source": "order&deals"
        },
        {
            "Title": "NSE Issues Stricter Guidelines for Retail Algorithmic Trading, Broking Stocks in Focus",
            "Summary": "The National Stock Exchange released a detailed operational framework for retail algorithmic trading, putting broking firms including Angel One in focus. The new guidelines require brokers to be liable for all algo orders and mandate auditing and monitoring of all API access. Key requirements include using only secure, authenticated APIs with static IP addresses and two-factor authentication, conducting periodic audits, and submitting compliance logs. Algo providers must have minimum two years of market experience and be empanelled with exchanges. Each strategy requires registration with a unique Algo ID. The framework introduces 5-level participant categorization and defines white-box algorithms like TWAP and VWAP, and black-box algorithms including alpha-seeking strategies. Execution algos receive fast-track approval within 7 working days, while other strategies get approval within 10 days. Clients submitting more than 10 orders per second must register their strategy. All client orders via APIs must originate from servers located in India.",
            "Sentiment": "neutral",
            "PublishDate": 1753248827593,
            "Source": "stock"
        },
        {
            "Title": "Angel One: Investec Maintains 'Buy' Despite Q1 Profit Dip",
            "Summary": "Investec maintains 'buy' rating on Angel One with a Rs 2,700 target price, despite a 61% YoY PAT decline in Q1 FY26. The company beat estimates with Rs 1.14 billion PAT, showing strong traction in new initiatives like credit disbursements and wealth management. Investec expects sequential improvement in revenue and earnings growth.",
            "Sentiment": "positive",
            "PublishDate": 1752731981000,
            "Source": "result"
        },
        {
            "Title": "Angel One: Q1 Profit Plunges 61% YoY, Wealth AUM Surges 34% QoQ",
            "Summary": "Angel One reported a 61% YoY drop in Q1 net profit to Rs 114.4 crore. Revenue declined 19% YoY to Rs 1,140 crore. Wealth management AUM rose 33.6% QoQ to Rs 50.7 billion. Client funding book reached Rs 48 billion. Credit disbursals up 123.6% QoQ.",
            "Sentiment": "neutral",
            "PublishDate": 1752722596000,
            "Source": "earnings"
        },
        {
            "Title": "Angel One Reports Decline in Q1 Net Profit and Revenue",
            "Summary": "Angel One, a financial services company, has reported its quarterly results. The consolidated net profit for Q1 decreased to 1.14 billion rupees from 2.9 billion rupees in the same period last year. Revenue also declined to 11.4 billion rupees from 14 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1752711053000,
            "Source": "default"
        },
        {
            "Title": "Angel One: Q1 Profit Plunges 61% YoY, Wealth AUM Grows 34%",
            "Summary": "Angel One reported a 61% YoY drop in Q1 FY26 net profit to ₹114.4 crore. Revenue fell 19% to ₹1,140 crore. EBITDA declined 41.7% to ₹274.1 crore. Wealth AUM rose 33.6% sequentially to ₹50.7 billion. Client funding book reached ₹48 billion. Credit disbursals up 123.6% sequentially.",
            "Sentiment": "neutral",
            "PublishDate": 1752680194000,
            "Source": "earnings"
        },
        {
            "Title": "Angel One Expands Digital Fintech Platform and Services",
            "Summary": "Angel One is enhancing its position as a leading digital fintech company by developing a comprehensive platform. The company is increasing its involvement in various asset classes and developing annuity-driven wealth and asset management services. These efforts are aimed at achieving sustainable growth in India and potentially beyond.",
            "Sentiment": "positive",
            "PublishDate": 1752677910000,
            "Source": "default"
        }
    ]
}