{
    "Symbol": "ANIKINDS",
    "ISIN": "INE087B01017",
    "News": [
        {
            "Title": "Anik Industries Q3FY26 Results: Revenue Jumps 101%",
            "Summary": "Anik Industries reported strong Q3FY26 performance with revenue rising 101.19% YoY to ₹1693.64 lakhs. Net profit declined 4.56% to ₹81.82 lakhs despite robust revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1770909948997,
            "Source": "co_actions_results"
        },
        {
            "Title": "ANIK Industries Gets Approval for Promoter Reclassification",
            "Summary": "ANIK Industries Limited received approval from NSE and BSE to reclassify 16 promoters holding 6,48,260 shares (2.33% stake) from promoter category to public category under SEBI Regulation 31A.",
            "Sentiment": "neutral",
            "PublishDate": 1768975418971,
            "Source": "stocks"
        },
        {
            "Title": "ANIK Industries Appoints Mahesh Kumar Sharma as Director",
            "Summary": "ANIK Industries Limited announces appointment of Mr. Mahesh Kumar Sharma as Additional cum Executive Director for four years effective January 20, 2026, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1768910731271,
            "Source": "stocks"
        },
        {
            "Title": "Anik Industries Reports Mixed Financial Performance in Q2 FY26",
            "Summary": "Anik Industries Limited announced unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025, with the Board meeting held on November 14, 2025. The company operates across property development, trading, and wind power segments, with consolidated revenue of Rs. 7,197.15 lakhs for the quarter compared to Rs. 2,005.86 lakhs in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1763145282598,
            "Source": "earnings"
        },
        {
            "Title": "Anik Industries Whole-Time Director Shivam Asthana Passes Away",
            "Summary": "Anik Industries Limited announced the death of Mr. Shivam Asthana, Whole-Time Director of the company, on Wednesday, October 29, 2025. Asthana held DIN 06426864 and had a long association with the company. The company described his passing as sudden and unexpected, calling it an irreparable loss. The board of directors and employees have conveyed their condolences to his family. The company has informed the National Stock Exchange and BSE Limited about this development.",
            "Sentiment": "negative",
            "PublishDate": 1761848542657,
            "Source": "corporate_governance"
        },
        {
            "Title": "Anik Industries Appoints Ankur Bindal as Company Secretary and Compliance Officer",
            "Summary": "Anik Industries Limited's Board of Directors approved the appointment of Mr. Ankur Bindal as Company Secretary and Compliance Officer effective September 17, 2025. Bindal is an associate member of the Institute of Companies Secretaries of India with membership number A57859. He holds a Bachelor of Commerce in taxation, LLB, and M.Com in Corporate Governance, with over 6 years of experience. The board also authorized Key Managerial Personnel to determine materiality of events and make disclosures to stock exchanges. The board meeting was held on September 17, 2025, from 4:30 PM to 5:20 PM at the company's corporate office.",
            "Sentiment": "positive",
            "PublishDate": 1758111479299,
            "Source": "corporate_governance"
        },
        {
            "Title": "Anik Industries Company Secretary Sourabh Vishnoi Resigns Due to Personal Reasons",
            "Summary": "Anik Industries Limited announced that Mr. Sourabh Vishnoi has resigned from his position as Company Secretary and Compliance Officer, effective from the close of business hours on August 14, 2025. The resignation was due to personal reasons and other professional commitments. Mr. Vishnoi confirmed there are no other material reasons for his departure beyond those stated. Following his resignation, he also ceased to be the Nodal Officer of the Company. The Board of Directors accepted the resignation during their meeting held on August 14, 2025, and acknowledged his valuable contribution during his association with the company.",
            "Sentiment": "neutral",
            "PublishDate": 1755168223215,
            "Source": "corporate_governance"
        },
        {
            "Title": "Anik Industries Reports Q1 FY26 Results with Standalone Net Profit of Rs 54.22 Lakhs",
            "Summary": "Anik Industries Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported standalone net profit of Rs 54.22 lakhs compared to Rs 113.09 lakhs in the same quarter last year. Total revenue from operations stood at Rs 4,776.33 lakhs versus Rs 1,060.61 lakhs in the previous year quarter. On consolidated basis, net profit was Rs 23.13 lakhs against Rs 102.41 lakhs in the corresponding quarter. The company operates through segments including Property Development, Trading Others, and Wind Power. Basic earnings per share for standalone operations was Rs 0.20 compared to Rs 0.41 in the same quarter last year. The company has one subsidiary named Revera Milk & Foods Private Limited.",
            "Sentiment": "negative",
            "PublishDate": 1753970651029,
            "Source": "earnings"
        },
        {
            "Title": "Anik Industries Schedules Board Meeting on July 31, 2025 to Approve Quarterly Financial Results",
            "Summary": "Anik Industries Limited has scheduled a Board of Directors meeting for July 31, 2025, to consider and approve unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The board will also review the Statutory Auditors' Limited Review Report on these results. The company's trading window has been closed from July 1, 2025, for all designated persons and their immediate relatives, and will reopen 48 hours after the announcement of the quarterly results.",
            "Sentiment": "neutral",
            "PublishDate": 1753362687662,
            "Source": "corporate_action"
        }
    ]
}