{
    "Symbol": "ANMOL",
    "ISIN": "INE02AR01019",
    "News": [
        {
            "Title": "Anmol India Board Meet Set for Feb 12 for Q3FY26 Results",
            "Summary": "Anmol India Limited has scheduled its board meeting for February 12, 2026, to consider and approve unaudited standalone financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770118191344,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anmol India Appoints New Independent Director",
            "Summary": "Anmol India Ltd held an Extra-Ordinary General Meeting on December 26, 2025, to appoint Mr. Ripan Kumar Goyal as Non-Executive Independent Director through special resolution.",
            "Sentiment": "neutral",
            "PublishDate": 1766742712395,
            "Source": "stocks"
        },
        {
            "Title": "Anmol India Non-Executive Director Passes Away",
            "Summary": "Anmol India Limited announces the sad demise of Non-Executive Director Mr. Kapil on December 18, 2025. He had served on the board since October 1, 2024.",
            "Sentiment": "negative",
            "PublishDate": 1766060251935,
            "Source": "stocks"
        },
        {
            "Title": "Anmol India Limited Appoints Ripan Kumar Goyal as Non-Executive Independent Director",
            "Summary": "Anmol India Limited has appointed Mr. Ripan Kumar Goyal (DIN: 11397550) as Non-executive Independent Director, subject to shareholder approval through Extra-Ordinary General Meeting. The appointment brings 29 years of banking experience from Union Bank of India and insurance advisory expertise to the company's board.",
            "Sentiment": "positive",
            "PublishDate": 1764842156063,
            "Source": "corporate_governance"
        },
        {
            "Title": "Anmol India Reports ₹5.85 Crore Profit for Half-Year Ended September 2025",
            "Summary": "Anmol India Limited's Board approved unaudited financial results showing a profit of ₹5.85 crore for the half-year ended September 30, 2025, compared to ₹5.01 crore in the same period last year. The coal trading company reported revenue from operations of ₹805.65 crore for the half-year period, with earnings per share of ₹1.03.",
            "Sentiment": "neutral",
            "PublishDate": 1763055679080,
            "Source": "earnings"
        },
        {
            "Title": "Anmol India Independent Director Bhupinderpreet Kaur to Resign Due to Personal Commitments",
            "Summary": "Anmol India announced that Independent Director Mrs. Bhupinderpreet Kaur will resign from her position effective September 30, 2025. She cited personal commitments as the reason for her resignation.",
            "Sentiment": "neutral",
            "PublishDate": 1759305836848,
            "Source": "corporate_governance"
        },
        {
            "Title": "Anmol India Limited Reports Quarterly Net Profit of ₹5.72 Crores",
            "Summary": "Anmol India Limited's Board of Directors approved unaudited standalone financial results for the quarter ended June 30, 2025. The company reported revenue from operations of ₹577.36 crores compared to ₹520.93 crores in the same quarter last year. Net profit increased to ₹5.72 crores from ₹4.00 crores in the corresponding quarter of the previous year. Earnings per share stood at ₹1.01 for both basic and diluted calculations. The company operates in coal trading and other items as a single business segment. The results were reviewed by the Audit Committee and approved at a Board meeting held on August 8, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754656152643,
            "Source": "earnings"
        }
    ]
}