{
    "Symbol": "ANSALAPI",
    "ISIN": "INE436A01026",
    "News": [
        {
            "Title": "Ansal API Appoints Six New Directors in Board Reshuffle",
            "Summary": "Ansal Properties & Infrastructure Limited appointed six new directors following the cessation of promoter Pranav Ansal from key positions, including new Chairman Sanjay Jain.",
            "Sentiment": "neutral",
            "PublishDate": 1770912367951,
            "Source": "stocks"
        },
        {
            "Title": "Ansal Properties Board Reconstituted with 3 New Directors",
            "Summary": "Ansal Properties and Infrastructure Limited appoints three new directors after promoter Pranav Ansal's cessation from Chairman and Director positions effective October 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770140609921,
            "Source": "stocks"
        },
        {
            "Title": "Ansal Properties COC Approves Key Fernhill Decisions",
            "Summary": "Ansal Properties' 48th Committee of Creditors meeting approved appointment of site manager and ratified expenses for Fernhill Project under insolvency resolution process.",
            "Sentiment": "neutral",
            "PublishDate": 1770136287960,
            "Source": "stocks"
        },
        {
            "Title": "Ansal Properties Holds 6th CoC Meeting on Dec 30",
            "Summary": "Ansal Properties and Infrastructure Limited conducted its sixth Committee of Creditors meeting on December 30, 2025, discussing project delays, RERA compliance issues, and operational status under CIRP.",
            "Sentiment": "neutral",
            "PublishDate": 1767617918309,
            "Source": "stocks"
        },
        {
            "Title": "Ansal Properties 46th CoC Meeting Outcome Announced",
            "Summary": "Ansal Properties & Infrastructure Limited announced the outcome of its 46th Committee of Creditors meeting for Fernhill Project held on December 21, 2025, with voting concluding on December 26, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765973234230,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ansal Properties Reports Q1 FY26 Results Under CIRP",
            "Summary": "Ansal Properties and Infrastructure posted net profit of ₹13.21 crores in Q1 FY26, marking a significant turnaround from ₹1,433.91 crores loss in Q1 FY25, while operating under Corporate Insolvency Resolution Process with newspaper publication compliance.",
            "Sentiment": "positive",
            "PublishDate": 1765800304993,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ansal Properties to Release Standalone Financial Results Only Due to CIRP Constraints",
            "Summary": "Ansal Properties and Infrastructure Limited will disseminate only standalone financial results for the quarter ended June 30, 2025 on December 15, 2025, as the company cannot obtain consolidated data from subsidiaries due to ongoing Corporate Insolvency Resolution Process. The company remains under CIRP with its affairs managed by Resolution Professional Navneet Kumar Gupta, while trading window stays closed until 48 hours after results announcement.",
            "Sentiment": "negative",
            "PublishDate": 1765279453779,
            "Source": "corporate_action"
        },
        {
            "Title": "Ansal Properties' Fernhill Project COC Approves Security Agency Appointment and CIRP Extension",
            "Summary": "The 44th Committee of Creditors meeting for Ansal Properties' Fernhill project approved the appointment of a new security agency, legal representation for HRERA matters, and consultants for DTCP approval assistance. The COC also approved excluding elapsed CIRP period since resolution plan filing and authorized a 60-day extension application to NCLT for the ongoing insolvency resolution process.",
            "Sentiment": "neutral",
            "PublishDate": 1764064067636,
            "Source": "corporate_action"
        },
        {
            "Title": "Ansal Properties' Fernhill Project Resolution Plan Remanded Back by NCLT for Reconsideration",
            "Summary": "The NCLT remanded Ansal Properties and Infrastructure Limited's Fernhill Project resolution plan back to the Committee of Creditors for reconsideration to address objections raised by homebuyers and belated claims issues. The Resolution Professional conducted the 44th CoC meeting to discuss the tribunal's directions, seek CIRP period extension of 60 days, and ratify appointments of new security agency and consultants for the Gurugram project.",
            "Sentiment": "neutral",
            "PublishDate": 1763726542398,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLT Approves Resolution Plan for Ansal Properties' Serene Residency Project",
            "Summary": "The National Company Law Tribunal approved a resolution plan for Ansal Properties and Infrastructure Limited's Serene Residency Group Housing Project in Greater Noida. Apex Heights Private Limited was selected as the successful resolution applicant with 100% Committee of Creditors approval. The plan provides Rs. 102 crores to secured financial creditors (34.96% of admitted claims) and addresses homebuyer claims through project completion. Construction timelines range from 6 months to 33 months for different towers from the handover date. The plan includes provisions for escalation charges of Rs. 250-350 per sq ft for existing allottees and establishes a monitoring committee for implementation oversight. GNIDA will receive Rs. 9.95 crores against its admitted claim of Rs. 28.47 crores. The resolution addresses overleveraging issues and aims to complete the stalled housing project for affected homebuyers.",
            "Sentiment": "positive",
            "PublishDate": 1762889171244,
            "Source": "corporate_action"
        },
        {
            "Title": "Ansal Properties Reports Rs 1,620 Crore Loss as Company Undergoes Insolvency Process",
            "Summary": "Ansal Properties and Infrastructure Limited reported a comprehensive loss of Rs 1,629.16 crore for the financial year ended March 31, 2025, compared to a profit of Rs 2.48 crore in the previous year. The company has been under Corporate Insolvency Resolution Process since February 25, 2025, with Navneet Kumar Gupta appointed as Resolution Professional. The company's accumulated losses of Rs 3,154.70 crore exceed its share capital and free reserves, resulting in negative net worth of Rs 1,816.21 crore. Current liabilities exceed current assets by Rs 2,234.83 crore, indicating severe liquidity issues. The company could not provide consolidated financial results due to difficulties obtaining financial statements from subsidiaries. Auditors issued a qualified opinion citing unrecognized interest of Rs 30.05 crore on NPA borrowings. The company faces multiple legal challenges including arbitration awards, RERA deregistrations, and pending court cases. No dividend was declared for the financial year.",
            "Sentiment": "negative",
            "PublishDate": 1762539482571,
            "Source": "earnings"
        },
        {
            "Title": "Ansal Properties to Release Audited Financial Results on November 7, 2025 Amid Ongoing Insolvency Process",
            "Summary": "Ansal Properties and Infrastructure Limited announced it will disseminate audited standalone financial results for the year ended March 31, 2025 on November 7, 2025. The company is unable to provide consolidated financial results due to difficulties obtaining financial statements from subsidiaries and other entities. The company is currently undergoing Corporate Insolvency Resolution Process under the Insolvency and Bankruptcy Code, 2016, with its affairs managed by Resolution Professional Navneet Kumar Gupta, appointed by the National Company Law Tribunal. The trading window remains closed since April 1, 2025 and will stay closed until 48 hours after the financial results dissemination. Two of the company's housing projects are being managed separately under resolution processes, with The Serene Residency project's resolution plan approved by NCLT on October 6, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762175238855,
            "Source": "corporate_action"
        },
        {
            "Title": "Ansal Properties' Fernhill Project CoC Holds 43rd Meeting Amid Ongoing Legal Disputes",
            "Summary": "Ansal Properties and Infrastructure Limited's Committee of Creditors held its 43rd meeting for the Fernhill Project in Gurgaon on October 23, 2025. The company is undergoing Corporate Insolvency Resolution Process under the Insolvency and Bankruptcy Code, with Resolution Professional Jalesh Kumar Grover managing the project. Multiple legal proceedings are ongoing at NCLT Delhi, including applications from homebuyers seeking claim admissions and disputes with Samyak Projects Private Limited over project access. The next hearing is scheduled for November 10, 2025. The Resolution Professional reported challenges in resuming fit-out activities due to interference from Samyak Projects, despite having necessary approvals from DTCP. Homebuyers are considering filing a writ petition in Punjab & Haryana High Court against police authorities for lack of action. The meeting addressed various homebuyer concerns regarding possession rights, project ownership, and settlement processes. The Resolution Professional clarified that only Ansal Properties holds legal authority over unsold units, not Samyak Projects.",
            "Sentiment": "negative",
            "PublishDate": 1761384194600,
            "Source": "corporate_action"
        },
        {
            "Title": "ED Freezes ₹10.55 Crore Worth of Ansal Properties in Money Laundering Investigation",
            "Summary": "The Enforcement Directorate has frozen properties valued at ₹10.55 crore that are linked to Ansal Properties as part of a money laundering case investigation.",
            "Sentiment": "negative",
            "PublishDate": 1759843986350,
            "Source": "stock"
        },
        {
            "Title": "Ansal Properties Committee of Creditors Approves Key Appointments in Insolvency Process",
            "Summary": "Ansal Properties and Infrastructure Limited held its fifth Committee of Creditors meeting on September 10, 2025, as part of its Corporate Insolvency Resolution Process. The committee approved several key appointments including Ms. Vanita Agarwal as Secretarial Auditor for FY 2025-26 and M/s SLO Technologies Private Limited as Transaction Auditor for determining avoidance transactions. The committee also approved changes in management of wholly owned subsidiary Ansal API Infrastructure Limited by appointing two new directors, Mr. Avanish Kumar and Mr. Devesh Kumar, while replacing existing directors. Other agenda items included updates on creditor lists, valuation progress, legal matters, and operational status. The company has been under Corporate Insolvency Resolution Process since February 25, 2025, with Resolution Professional Shri Navneet Kumar Gupta managing its affairs.",
            "Sentiment": "neutral",
            "PublishDate": 1759495775037,
            "Source": "corporate_action"
        },
        {
            "Title": "Ansal Properties Schedules 42nd Creditors Meeting for Fernhill Project Under Insolvency Process",
            "Summary": "Ansal Properties and Infrastructure Limited has scheduled the 42nd Committee of Creditors meeting for its Fernhill project in Gurgaon, Haryana on September 24, 2025. The meeting is part of the ongoing Corporate Insolvency Resolution Process for the project. The Fernhill project was admitted into the insolvency process following orders from the National Company Law Appellate Tribunal dated January 13, 2023, and the National Company Law Tribunal dated November 16, 2022. The project is currently managed by Resolution Professional Jalesh Kumar Grover. Separately, Ansal Properties' affairs, business and assets are being managed by Resolution Professional Navneet Kumar Gupta, who was appointed by the National Company Law Tribunal on February 25, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1758612766879,
            "Source": "corporate_action"
        },
        {
            "Title": "Ansal Properties Holds Fifth Committee of Creditors Meeting During Insolvency Process",
            "Summary": "Ansal Properties and Infrastructure Limited conducted its fifth Committee of Creditors meeting on September 10, 2025, as part of its ongoing Corporate Insolvency Resolution Process. The meeting ran from 4:00 PM to 6:10 PM via audio/video conferencing. Key agenda items included approval of secretarial auditor appointment and fees for financial year 2025-2026, appointment of transaction auditor for avoidance transaction determination, and management changes for wholly-owned subsidiary Ansal API Infrastructure Limited. The committee also reviewed the updated creditors list, valuation progress by appointed valuers, and legal updates regarding the CIRP process. The company is under insolvency proceedings initiated by the National Company Law Tribunal, New Delhi, with Navneet Kumar Gupta serving as Resolution Professional managing the company's affairs, business and assets.",
            "Sentiment": "neutral",
            "PublishDate": 1757939799423,
            "Source": "corporate_action"
        },
        {
            "Title": "Ansal Properties Reschedules 5th Committee of Creditors Meeting to September 10, 2025",
            "Summary": "Ansal Properties and Infrastructure Limited has rescheduled its 5th Meeting of the Committee of Creditors from September 8, 2025 to September 10, 2025. The company is currently undergoing Corporate Insolvency Resolution Process (CIRP) as ordered by the National Company Law Tribunal (NCLT), New Delhi Bench. The company manages multiple housing projects including The Serene Residency Group Housing Project in Greater Noida and The Fernhill Project in Gurgaon, which are being handled by respective Resolution Professionals.",
            "Sentiment": "neutral",
            "PublishDate": 1757337068036,
            "Source": "corporate_action"
        },
        {
            "Title": "Ansal Properties Holds 41st Committee of Creditors Meeting for Fernhill Project Under Insolvency Process",
            "Summary": "Ansal Properties and Infrastructure Limited conducted its 41st adjourned Committee of Creditors meeting for the Fernhill Project in Gurgaon on September 3, 2025. The meeting addressed ongoing litigation status, structural audit results showing retrofitting costs of Rs. 1.02 crore, and stalled settlement discussions with Samyak Projects Private Limited. The Resolution Professional reported that construction work has commenced on Towers N and P, with an engineer hired at Rs. 60,000 monthly to oversee activities. DTCP has acknowledged the RP's authority to proceed with construction under Section 25 of the Insolvency and Bankruptcy Code. Settlement talks with Samyak Projects remain unsuccessful, with disputes over fair value computation and unsold area calculations. The company is undergoing Corporate Insolvency Resolution Process with multiple pending applications before NCLT, with the next hearing scheduled for September 8, 2025. Approximately 67 homebuyers participated virtually in the meeting along with the authorized representative and unsecured financial creditor.",
            "Sentiment": "neutral",
            "PublishDate": 1757076270302,
            "Source": "corporate_action"
        },
        {
            "Title": "Ansal Properties Holds 24th Creditors Meeting for Serene Residency Project Under Insolvency Process",
            "Summary": "Ansal Properties and Infrastructure Limited conducted the 24th Committee of Creditors meeting for its Serene Residency Group Housing Project in Greater Noida on August 29, 2025. The project is undergoing Corporate Insolvency Resolution Process following an NCLT order dated October 20, 2023. The meeting, held via audio/video conferencing from 11:00 AM to 12:30 PM, covered standard procedural items including roll call, quorum verification, review of previous meeting minutes from July 31, 2025, updates on legal cases, and operational status of the project. The company's affairs are being managed by Resolution Professional Navneet Kumar Gupta, who was appointed by the National Company Law Tribunal in February 2025. The company also has other projects under resolution including the Fernhill Project in Gurgaon managed by a different resolution professional.",
            "Sentiment": "neutral",
            "PublishDate": 1756980422574,
            "Source": "corporate_action"
        },
        {
            "Title": "Ansal Properties Schedules 24th Creditors Meeting for Serene Residency Project Under Insolvency Process",
            "Summary": "Ansal Properties and Infrastructure Limited has scheduled the 24th meeting of the Committee of Creditors for its 'Serene Residency Group Housing Project' on August 29, 2025. The project, located in Sector ETA II, Greater Noida, Uttar Pradesh, is undergoing Corporate Insolvency Resolution Process initiated through an NCLT order dated October 20, 2023. The company itself is under Corporate Insolvency Resolution Process under the Insolvency and Bankruptcy Code, 2016, with its affairs managed by Resolution Professional Shri Navneet Kumar Gupta, who was appointed by the National Company Law Tribunal, New Delhi. The same Resolution Professional also manages the Serene Residency project, while another project, Fernhill Project in Gurgaon, Haryana, is managed by a different Resolution Professional, Shri Jalesh Kumar Grover.",
            "Sentiment": "negative",
            "PublishDate": 1756296493328,
            "Source": "corporate_action"
        },
        {
            "Title": "Ansal Properties Delays Q1 FY26 Financial Results Due to Insolvency Process and Technical Issues",
            "Summary": "Ansal Properties and Infrastructure Limited announced a delay in submitting its unaudited financial results for Q1 FY26 beyond the August 14, 2025 deadline. The company is currently undergoing Corporate Insolvency Resolution Process initiated by the National Company Law Tribunal on February 25, 2025, with affairs now managed by Resolution Professional Shri Navneet Kumar Gupta. Additional factors contributing to the delay include compromised company email systems in March 2025 that disrupted communications, search and seizure proceedings by the Income Tax Department from April 8-11, 2025, and similar proceedings by the Enforcement Directorate starting April 30, 2025. The company also has not yet released its audited financial results for Q4 FY25. The trading window remains closed since April 1, 2025 and will stay closed until 48 hours after the financial results are published.",
            "Sentiment": "negative",
            "PublishDate": 1755008578384,
            "Source": "stock"
        },
        {
            "Title": "Ansal Properties Fernhill Project Committee of Creditors Holds 40th Meeting Amid Ongoing Samyak Dispute",
            "Summary": "Ansal Properties and Infrastructure Limited's Fernhill Project in Gurgaon held its 40th Committee of Creditors meeting on August 6, 2025. The project is undergoing Corporate Insolvency Resolution Process with Jalesh Kumar Grover as Resolution Professional. Key discussions included ongoing litigation status with 27 pending cases, primarily involving disputes with Samyak Projects Private Limited over land ownership and fair value calculations. The RP reported that despite multiple negotiation attempts, no consensus has been reached with Samyak, with settlement discussions ranging from Rs. 6 crores to Rs. 37.50 crores. Construction approval from DTCP is pending, with officials indicating 2-3 months timeline. A structural audit is underway with Rs. 1.62 lakh paid to auditors for retrofitting cost assessment. The meeting included 64 homebuyers participating virtually, with discussions covering construction timelines, registry processes, and escalation concerns with the Successful Resolution Applicant Krish Infrastructure. All matters are scheduled for next hearing on September 8, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754646139039,
            "Source": "corporate_action"
        },
        {
            "Title": "Ansal Properties Launches 100-Day Shareholder Campaign While Under Insolvency Process",
            "Summary": "Ansal Properties and Infrastructure Limited has launched a 100-day campaign called 'Saksham Niveshak' running from July 28, 2025 to November 6, 2025, aimed at helping shareholders update their KYC details, bank mandates, nominee information, and resolve unclaimed dividend issues. The campaign follows directions from the Investor Education and Protection Fund Authority circular dated July 16, 2025. The company is simultaneously undergoing Corporate Insolvency Resolution Process under the Insolvency and Bankruptcy Code 2016, with its affairs managed by Resolution Professional Shri Navneet Kumar Gupta, appointed by the National Company Law Tribunal. All unclaimed dividends and shares have been transferred to IEPFA up to financial year 2010-2011, as no dividends were paid thereafter. Shareholders can contact the company's Registrar and Transfer Agent, MUFG Intime India Private Limited, for assistance with updating information or claiming unclaimed dividends through e-form IEPF-5.",
            "Sentiment": "neutral",
            "PublishDate": 1754480704039,
            "Source": "corporate_action"
        },
        {
            "Title": "Ansal Properties Schedules 40th Creditors Meeting for Fernhill Project on August 6, 2025",
            "Summary": "Ansal Properties and Infrastructure Limited has scheduled the 40th Meeting of the Committee of Creditors for its 'Fernhill project' in Gurgaon, Haryana for August 6, 2025. This meeting is part of the ongoing Corporate Insolvency Resolution Process for the specific project. The company is undergoing Corporate Insolvency Resolution Process under the Insolvency and Bankruptcy Code, 2016, with its affairs being managed by Resolution Professional Shri Navneet Kumar Gupta. The Fernhill Project in Gurgaon is specifically managed by Resolution Professional Shri Jalesh Kumar Grover. The Corporate Insolvency Resolution Process was admitted through an order dated January 13, 2023 by the National Company Law Appellate Tribunal, New Delhi, confining the process to the Fernhill project.",
            "Sentiment": "neutral",
            "PublishDate": 1754114840553,
            "Source": "corporate_action"
        },
        {
            "Title": "Ansal Properties Schedules 23rd Creditors Meeting for Serene Residency Project Under Insolvency Process",
            "Summary": "Ansal Properties and Infrastructure Limited has scheduled the 23rd Committee of Creditors meeting for its Serene Residency Group Housing Project on July 31, 2025. The project, located in Sector ETAII, Greater Noida, is under Corporate Insolvency Resolution Process managed by Resolution Professional Shri Navneet Kumar Gupta. The company itself is undergoing Corporate Insolvency Resolution Process under the Insolvency and Bankruptcy Code, 2016, with its affairs being managed by the same Resolution Professional appointed by the National Company Law Tribunal, New Delhi. The company also has another project, Fernhill Project in Gurgaon, managed by a different Resolution Professional, Shri Jalesh Kumar Grover.",
            "Sentiment": "negative",
            "PublishDate": 1753856479979,
            "Source": "corporate_action"
        },
        {
            "Title": "Ansal Properties and Infrastructure Ltd: FIR Lodged Against Real Estate Group in UP",
            "Summary": "Uttar Pradesh Police filed an FIR against Ansal Group for alleged cheating, breach of trust, criminal conspiracy, and organized crime. The action follows instructions from CM Yogi Adityanath. NCLT has admitted Ansal Properties into CIRP due to a ₹257 crore loan default to IL&FS Financial Services.",
            "Sentiment": "negative",
            "PublishDate": 1741114169749,
            "Source": "corporate_governance"
        }
    ]
}