{
    "Symbol": "ANTELOPUS",
    "ISIN": "INE818A01017",
    "News": [
        {
            "Title": "Antelopus Selan Energy Q3FY26 Production Surges 35%",
            "Summary": "Antelopus Selan Energy reports strong Q3FY26 performance with average sales reaching 1,498 boepd, marking 35% quarter-on-quarter growth. Net profit surged to ₹28.50 crores driven by volume expansion.",
            "Sentiment": "positive",
            "PublishDate": 1769095518317,
            "Source": "co_actions_results"
        },
        {
            "Title": "Antelopus Selan Energy Clarifies Price Movement",
            "Summary": "Antelopus Selan Energy Limited responds to BSE inquiry on recent share price movements, stating no material events requiring disclosure and attributing price changes to market forces.",
            "Sentiment": "neutral",
            "PublishDate": 1768889129254,
            "Source": "stocks"
        },
        {
            "Title": "Antelopus Selan Energy Clarifies Recent Share Price Movement",
            "Summary": "Antelopus Selan Energy issued a clarification stating no material operational or undisclosed events caused recent share price movements, with the company operating normally and maintaining Q2 guidance parameters. The company attributes the price fluctuation to market-driven factors and reaffirms commitment to transparency and regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1763973883601,
            "Source": "stock"
        },
        {
            "Title": "Antelopus Selan Energy Reports Q2 FY26 Results with Production Growth from New Wells",
            "Summary": "Antelopus Selan Energy Limited reported quarterly results showing average sales of 1,107 barrels of oil equivalent per day (boepd). The company brought three new wells on production at Karjisan field, with two wells starting production in mid-August and a third well beginning production in November. Total income reached INR 57.45 crores compared to INR 53.56 crores in the previous quarter, while net profit was INR 11.81 crores versus INR 11.22 crores in the prior quarter. Year-over-year revenues declined by approximately 19% due to lower blended price realizations (down 12.5%) and reduced sales volumes (down 12%). The company completed drilling and well logging at Duarmara field, indicating hydrocarbon presence in TS1, TS2, and TS3 zones, with commercial sales planned for Q4 FY26. A new 10-well drilling campaign at Cambay field is scheduled to commence in early Q4 FY26. The company maintains consistent EBITDA margins with an oil and gas product mix of approximately 80% oil and 20% gas by revenue.",
            "Sentiment": "positive",
            "PublishDate": 1762878695677,
            "Source": "earnings"
        },
        {
            "Title": "Antelopus Selan Energy Completes Major Share Acquisition Under Court-Approved Scheme",
            "Summary": "Antelopus Selan Energy Limited acquired 1,99,62,358 equity shares through a Composite Scheme of Arrangement between Antelopus Energy Private Limited and Selan Exploration Technology Limited. The scheme was approved by the National Company Law Tribunal, Chandigarh Bench on June 10, 2025, became effective on July 5, 2025, with share allotment completed on August 12, 2025. The acquisition involved four entities: Ms. Payal Upadhyay, Mr. Suniti Kumar Bhat, Mr. Siva Kumar Pothepalli, and Blackbuck Energy Investments Limited. Their combined shareholding increased from 30.46% to 69.94% of the company's voting rights. The company's total equity share capital expanded from INR 15.20 crores to INR 35.16 crores following the transaction. All acquirers are now part of the promoter group post-scheme implementation.",
            "Sentiment": "neutral",
            "PublishDate": 1755095917586,
            "Source": "corporate_action"
        },
        {
            "Title": "Selan Exploration Reports Q1 FY26 Results, Completes AEPL Merger and Expands Operations",
            "Summary": "Selan Exploration Technology Limited reported quarterly results showing production of 1,063 boepd compared to 1,177 boepd in the previous quarter and 1,099 boepd in the year-ago period. Total income declined to INR 53.56 crores from INR 64.96 crores in the previous quarter, while net profit decreased to INR 11.22 crores from INR 14.78 crores. The company completed its merger with Antelopus Energy Private Limited (AEPL), with the merged entity to be renamed 'Antelopus Selan Energy Limited.' Production commenced from the KG Basin 'Dangeru' field, marking expansion beyond the Cambay basin. The company completed drilling of 2 new wells in Karjisan with production expected to start by end of August, and announced acquisition of the remaining 50% participating interest in the Cambay Block. EBITDA margins remained consistent at 56% despite lower oil and gas prices, with the oil and gas product mix maintaining approximately 80% oil and 20% gas. The quarterly decline was attributed to a 10% drop in price realizations, natural decline in Bakrol wells after 15 months of consistent production, and key wells being offline due to operational reasons.",
            "Sentiment": "neutral",
            "PublishDate": 1755022754348,
            "Source": "earnings"
        },
        {
            "Title": "Selan Exploration Technology Approves Quarterly Results and Allots 1.99 Crore Shares Under Composite Scheme",
            "Summary": "Selan Exploration Technology Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The Board also allotted 1,99,62,358 equity shares with a face value of INR 10 each to shareholders of Antelopus Energy Private Limited as part of a Composite Scheme of Arrangement between the two companies. The allotment was made to shareholders as on the record date of July 5, 2025. The newly allotted shares will remain frozen until listing and trading permission is granted by stock exchanges. The company will apply for listing of these equity shares on stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1755004970254,
            "Source": "corporate_action"
        },
        {
            "Title": "Selan Exploration Tech Reports Decline in Q1 Revenue and Profit Despite Margin Improvement",
            "Summary": "Selan Exploration Tech reported Q1 results showing revenue of 506 million rupees compared to 635 million rupees in the previous year. Net profit decreased to 112 million rupees from 178 million rupees year-over-year. EBITDA fell to 268 million rupees from 332 million rupees in the same period last year. However, EBITDA margin improved to 52.99% from 52.30% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1755002941335,
            "Source": "earnings"
        },
        {
            "Title": "Selan Exploration Commences Gas Production at Mukkamala Field in Krishna-Godavari Basin",
            "Summary": "Selan Exploration has begun gas production operations at its Mukkamala field located in the Krishna-Godavari Basin. The company has successfully started extracting gas from this field, marking a new production milestone for the exploration company.",
            "Sentiment": "positive",
            "PublishDate": 1753436690939,
            "Source": "stock"
        },
        {
            "Title": "Selan Exploration Tech to Acquire Remaining 50% Stake in Cambay Field",
            "Summary": "Selan Exploration Tech has secured a 180-day exclusivity period for the sale and purchase agreement of the Cambay Field. The company plans to acquire the remaining 50% stake in the field. Total payments of $14 million have been agreed upon for the Cambay Field acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1751632175000,
            "Source": "default"
        },
        {
            "Title": "Selan Exploration Projects 61% Increase in FY'25 Production",
            "Summary": "Selan Exploration Technology Limited has announced its production forecast for the fiscal year 2025. The company expects average daily production volumes to reach approximately 1,193 barrels of oil equivalent per day (BOEPD), representing a significant year-on-year increase of 61%.",
            "Sentiment": "positive",
            "PublishDate": 1746857074000,
            "Source": "default"
        },
        {
            "Title": "Selan Exploration Technology Reports Q4 Financial Results",
            "Summary": "Selan Exploration Technology has announced its Q4 financial results. The company's EBITDA increased to 355 million rupees from 281 million rupees year-over-year. The EBITDA margin improved to 57.53% from 51.35% in the same period. Net profit rose to 159 million rupees from 123 million rupees year-over-year, while revenue grew to 617 million rupees from 547 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1746795110000,
            "Source": "result"
        },
        {
            "Title": "Selan Exploration Technology Reports Strong Q3 Financial Results",
            "Summary": "Selan Exploration Technology has reported a significant increase in both net profit and revenue for the third quarter. The company's net profit rose to 185 million rupees, up from 60 million rupees year-over-year and 214 million rupees quarter-over-quarter. Revenue also saw a substantial increase, reaching 654 million rupees compared to 436 million rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1739146415000,
            "Source": "earnings"
        },
        {
            "Title": "Selan Exploration Technology Reports Significant Q3 EBITDA Growth",
            "Summary": "Selan Exploration Technology has reported a substantial increase in its Q3 EBITDA, rising to 384 million rupees from 188 million rupees year-over-year. The company's EBITDA margin also improved significantly, reaching 58.71% compared to 42.03% in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738931840000,
            "Source": "earnings"
        },
        {
            "Title": "Selan Exploration Technology Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "Selan Exploration Technology has reported a substantial increase in both net profit and revenue for the third quarter. The company's net profit rose to 185 million rupees, up from 60 million rupees year-over-year and 214 million rupees quarter-over-quarter. Revenue also saw a significant boost, reaching 654 million rupees compared to 436 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738931760000,
            "Source": "earnings"
        },
        {
            "Title": "Selan Exploration Tech Reports Strong Q2 Financial Performance",
            "Summary": "Selan Exploration Tech has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 408 million rupees from 219 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 57.92% from 54.26% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730204360000,
            "Source": "result"
        },
        {
            "Title": "Selan Exploration Tech Reports Significant Revenue Growth in Q2",
            "Summary": "Selan Exploration Tech has reported a substantial increase in its second quarter revenue. The company's revenue for Q2 reached 704 million rupees, compared to 404 million rupees in the same period last year, representing a year-over-year growth of approximately 74%.",
            "Sentiment": "positive",
            "PublishDate": 1730204016000,
            "Source": "result"
        },
        {
            "Title": "Selan Exploration Tech Reports Q2 Net Profit Increase",
            "Summary": "Selan Exploration Tech has reported a significant increase in its Q2 net profit. The company's net profit rose to 213.6 million rupees, up from 94 million rupees in the same quarter last year (YoY). It also showed an improvement from 182 million rupees in the previous quarter (QoQ).",
            "Sentiment": "positive",
            "PublishDate": 1730204007000,
            "Source": "result"
        },
        {
            "Title": "Dolly Khanna Increases Stake in Selan Exploration",
            "Summary": "<p><span class='positive'>Investor</span> <span class='neutral'>Dolly Khanna</span> has <span class='positive'>increased</span> her <span class='neutral'>stake</span> in <span class='neutral'>Selan Exploration</span> from <b>1.56%</b> to <b>1.73%</b> during the <span class='neutral'>second quarter</span> of the fiscal year.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728972848000,
            "Source": "normal_news"
        }
    ]
}