{
    "Symbol": "ANTHEM",
    "ISIN": "INE0CZ201020",
    "News": [
        {
            "Title": "Anthem Biosciences Q3 Net Profit Drops to ₹928M",
            "Summary": "Anthem Biosciences reported consolidated net profit of ₹928 million in Q3, down from ₹1.2 billion in the same quarter last year, marking a year-on-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1770277800657,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anthem Biosciences Q3FY26 Earnings Call on Feb 5",
            "Summary": "Anthem Biosciences has scheduled its Q3FY26 earnings conference call for February 05, 2026, at 02:30 PM IST to discuss unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769518591723,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anthem Biosciences Issues ₹49 Cr Corporate Guarantee",
            "Summary": "Anthem Biosciences Limited has issued corporate guarantees totaling ₹49.00 crores to Citi Bank N.A. and Federal Bank Limited for its wholly owned subsidiary Neoanthem Lifesciences' working capital facilities.",
            "Sentiment": "neutral",
            "PublishDate": 1767776497850,
            "Source": "stocks"
        },
        {
            "Title": "Anthem Biosciences Reports Strong H1 FY26 Results with 26% Revenue Growth and 41.4% EBITDA Margin",
            "Summary": "Anthem Biosciences Limited delivered consolidated revenue of Rs. 1,090 Cr for the half-year ended September 30, 2025, with CRDMO business contributing Rs. 926 Cr and specialty ingredients Rs. 163 Cr. The company achieved EBITDA of Rs. 480 Cr with a margin of 41.4% and PAT of Rs. 309 Cr representing a 26.6% margin. Net cash position improved to Rs. 993 Cr. The company expanded its commercial molecules from 10 to 14 during the period, while late-phase molecules reduced from 10 to 6 as four moved to commercial status. Anthem commissioned CP6 and CP7 blocks adding 130 kiloliters capacity in Unit-II, with total CAPEX of Rs. 182 Cr. The company is progressing on Unit-IV development with planned Rs. 1,000 Cr investment over two years, targeting 400 kiloliters custom synthesis and 100 kiloliters fermentation capacity. Management expressed confidence in maintaining historical 20% CAGR growth trajectory and expects to operate at the upper end of 36%-37% EBITDA margin guidance.",
            "Sentiment": "positive",
            "PublishDate": 1762964908694,
            "Source": "earnings"
        },
        {
            "Title": "Anthem Biosciences Reports Insider Trading Code Violations by Two Designated Persons",
            "Summary": "Anthem Biosciences Limited reported violations of its insider trading code by two designated persons to stock exchanges. Srinivas L sold 674 equity shares during a trading window closure period that began October 1, 2025, through his pledgee agent despite instructing them not to sell during the restricted period. Bhuvaneswari sold 5,000 equity shares worth Rs. 41,75,000 without obtaining preclearance approval, as her previous approval had expired while she was on medical leave. The Audit Committee issued warning letters to both individuals and obtained acknowledgement letters confirming future compliance with the company's code of conduct. Both violations were treated seriously by the company, with warnings that future breaches will attract stricter disciplinary action.",
            "Sentiment": "negative",
            "PublishDate": 1762847677181,
            "Source": "corporate_governance"
        },
        {
            "Title": "Anthem Biosciences Reports Mixed Performance with Revenue Growth but Profit Decline in Q2 FY2026",
            "Summary": "Anthem Biosciences Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. On a consolidated basis, the company reported total income of Rs. 5,500.27 million for Q2 FY2026 compared to Rs. 5,249.56 million in the same quarter last year. However, profit before tax declined to Rs. 2,296.03 million from Rs. 1,995.33 million year-over-year. For the half-year period, total income increased to Rs. 10,902.36 million from Rs. 8,635.50 million in the previous year, while profit before tax rose to Rs. 4,158.51 million from Rs. 3,175.09 million. The company operates through two main segments: CRDMO (Contract Research, Development and Manufacturing Organization) which generated Rs. 4,658.13 million in Q2, and Speciality Ingredients contributing Rs. 842.14 million. The Board of Directors approved these results in their meeting held on November 8, 2025. The company's equity shares are listed on NSE and BSE since July 21, 2025, following its IPO.",
            "Sentiment": "neutral",
            "PublishDate": 1762613120917,
            "Source": "earnings"
        },
        {
            "Title": "Anthem Biosciences Reports Code of Conduct Violation by Designated Person",
            "Summary": "Anthem Biosciences Limited disclosed that a designated person violated the company's Code of Conduct by trading in company securities during a trading window closure period. The violation relates to provisions under SEBI Prohibition of Insider Trading Regulations. The matter will be presented to the upcoming Audit Committee meeting, and the company will provide detailed disclosure and action taken in due course.",
            "Sentiment": "negative",
            "PublishDate": 1761662719849,
            "Source": "corporate_governance"
        },
        {
            "Title": "Lock-in Periods End for Three Stocks: Anthem BioSciences, Shringar House, and Dev Accelerator",
            "Summary": "Three companies will see their share lock-in periods expire on Wednesday, October 15. Anthem BioSciences will have 8.9 million shares (2% of outstanding equity) become eligible for trading, with the stock gaining 8% since listing in July at ₹570 per share. Shringar House of Mangalsutra will see 3.6 million shares (4% of outstanding equity) become tradeable, with the stock currently trading around its listing price of ₹188.50. The company's ₹400 crore IPO was oversubscribed by 60 times. Dev Accelerator will have 5.2 million shares (6% of outstanding equity) eligible for trading, though the stock has declined 21% from its IPO price since listing in September. The end of lock-in periods makes shares eligible for trading but does not guarantee they will be sold in the open market.",
            "Sentiment": "neutral",
            "PublishDate": 1760493015652,
            "Source": "stock"
        },
        {
            "Title": "Anthem Biosciences Shares Jump 46% Since Listing on Strong Financial Performance",
            "Summary": "Anthem Biosciences shares have gained 46% since listing on July 21, with an 11% increase following strong June-quarter results announced on August 13. The drug discovery and manufacturing services company reported revenue growth of 59.5% year-on-year to ₹540.2 crore and net profit surge of 64.8% to ₹135.8 crore in the June quarter. The company is expanding capacity by 155 kilolitres to reach 425 kilolitres total by September 2025, with 54 kilolitres added in the June quarter. Two products received approval, increasing the commercial portfolio from 10 to 12. The company expects 20% annual revenue growth for FY26. Operating margin dropped to 38.1% from 39.2% due to share-based compensation charges of ₹4.4 crore. Anthem completed backward integration on a key molecule and is developing GLP-1 obesity and diabetes drugs as patents expire in multiple markets.",
            "Sentiment": "positive",
            "PublishDate": 1757984296837,
            "Source": "stock"
        },
        {
            "Title": "Anthem Biosciences Reports Strong Q1 FY26 Results with 60% Revenue Growth in First Post-Listing Earnings Call",
            "Summary": "Anthem Biosciences delivered consolidated revenue of INR 540 crores for the quarter ended June 30, 2025, representing strong year-on-year growth. The CRDM business contributed INR 452.7 crores while specialty ingredients generated INR 87.5 crores. EBITDA reached INR 214.3 crores with margins at 38%, and PAT was INR 135.8 crores with 24% margins. The company maintains a net cash position of INR 784.8 crores. Growth was driven by increased demand from commercial products across multiple customers. Two molecules moved from Phase 3 to commercial stage, expanding the commercial portfolio from 10 to 12 products. The company added 54 kiloliters of custom synthesis capacity in unit 2 during the quarter and plans to complete remaining expansions by calendar year end. Management expects to maintain historical growth rates of around 20% annually, though noted this was an exceptional quarter due to the lumpy nature of their business.",
            "Sentiment": "positive",
            "PublishDate": 1755514224174,
            "Source": "earnings"
        },
        {
            "Title": "Anthem Biosciences Expands Capabilities and Leverages Global Partnerships for Growth",
            "Summary": "Anthem Biosciences is expanding its API, intermediates, and formulation capabilities while enhancing its biologics and specialty chemistry services. The company is utilizing global partnerships as part of its strategy to increase revenue and improve profit margins.",
            "Sentiment": "positive",
            "PublishDate": 1755103976956,
            "Source": "stock"
        },
        {
            "Title": "Anthem Biosciences Seeks Shareholder Approval for ESOP Ratification and Related Party Remuneration",
            "Summary": "Anthem Biosciences Limited has issued a postal ballot notice seeking shareholder approval for three resolutions. The company is requesting ratification of its Employee Stock Option Plan 2024, which involves up to 11,409,700 stock options for employees, and extending these benefits to subsidiary company employees. Additionally, shareholders will vote on remuneration for related parties - Ishaan Bhardwaj (son of MD & CEO) at Rs 12 million annually as Senior Management Personnel, and Krithika Ganesh (daughter of Whole Time Director) at Rs 3.1 million annually as Deputy Manager. The voting will be conducted electronically from August 14 to September 12, 2025, with results to be declared by September 15, 2025. The ESOP ratification is required following the company's listing on NSE and BSE on July 21, 2025, as per SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1755103853791,
            "Source": "corporate_action"
        },
        {
            "Title": "Anthem Biosciences Reports Strong Q1 Results with 59% Revenue Growth; Promotes Ravi Kalla to CIO",
            "Summary": "Anthem Biosciences Limited reported quarterly results for the period ended June 30, 2025. Standalone revenue from operations increased to Rs 5,380.11 million compared to Rs 3,385.39 million in the same quarter last year. Profit for the period rose to Rs 1,483.40 million from Rs 853.36 million year-over-year. Consolidated revenue reached Rs 5,402.09 million versus Rs 3,385.94 million in the prior year quarter, with profit at Rs 1,357.91 million compared to Rs 823.79 million. The company's Board re-designated Mr. Ravi Kalla from Senior General Manager – Information Technology to Chief Information Officer, effective August 13, 2025. Kalla brings 25 years of IT experience and has been with Anthem since inception. The company allotted 2,532,951 equity shares under ESOP Scheme 2024 during the quarter. Basic earnings per share stood at Rs 2.65 for standalone results and Rs 2.43 for consolidated results.",
            "Sentiment": "positive",
            "PublishDate": 1755101105544,
            "Source": "earnings"
        },
        {
            "Title": "Anthem Biosciences Appoints Divya Prasad as Company Secretary and Compliance Officer",
            "Summary": "Anthem Biosciences Limited appointed Ms. Divya Prasad as Company Secretary and Compliance Officer effective October 18, 2024. Prasad holds ICSI Membership No: A41438 and continues in her role as Compliance Officer under SEBI listing regulations. The company, formerly known as Anthem Biosciences Private Limited, is listed on BSE with scrip code 544449 and NSE with symbol ANTHEM.",
            "Sentiment": "neutral",
            "PublishDate": 1753156783975,
            "Source": "corporate_governance"
        },
        {
            "Title": "Anthem Biosciences Shares Debut at ₹723.05, 27% Above Issue Price",
            "Summary": "Anthem Biosciences commenced trading at ₹723.05 per share, representing a premium over its issue price of ₹570. The stock opened higher than its initial public offering price on its trading debut.",
            "Sentiment": "positive",
            "PublishDate": 1753072725369,
            "Source": "stock"
        }
    ]
}