{
    "Symbol": "ANUHPHR",
    "ISIN": "INE489G01022",
    "News": [
        {
            "Title": "Anuh Pharma Reports Strong Q3FY26 Financial Results",
            "Summary": "Anuh Pharma Limited published unaudited financial results for Q3FY26, showing revenue of ₹19,717.81 lakhs and net profit of ₹1,345.10 lakhs with improved margins.",
            "Sentiment": "positive",
            "PublishDate": 1770551274818,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anuh Pharma faces ₹78.29L tax demand for AY 2020-21",
            "Summary": "Anuh Pharma Limited receives Income Tax Assessment Order with tax demand of ₹78,28,793 for Assessment Year 2020-21 due to disallowed deductions. Company plans to file appeal.",
            "Sentiment": "negative",
            "PublishDate": 1768991107818,
            "Source": "stocks"
        },
        {
            "Title": "Anuh Pharma Receives European Certificate of Suitability for Sulfadimethoxine",
            "Summary": "Anuh Pharma Limited has been granted the Certificate of Suitability (CEP) from the European Directorate for the Quality of Medicines HealthCare (EDQM) for Sulfadimethoxine. The CEP approval will enable expanded access to regulated markets and support customers with enhanced reliability, compliance, and supply security for this Active Pharmaceutical Ingredient.",
            "Sentiment": "positive",
            "PublishDate": 1764914946166,
            "Source": "stock"
        },
        {
            "Title": "Anuh Pharma Projects 15-16% Annual Growth Rate",
            "Summary": "Anuh Pharma has announced expectations for an annual growth rate ranging between 15% and 16%. The pharmaceutical company's growth projection indicates anticipated business expansion in its operations.",
            "Sentiment": "positive",
            "PublishDate": 1763385707636,
            "Source": "stock"
        },
        {
            "Title": "Anuh Pharma Reports 21% Revenue Growth to Rs 376.73 Cr in H1 FY2026, EBITDA Remains Flat",
            "Summary": "Anuh Pharma achieved revenue growth of 21.14% to Rs 376.73 crores in H1 FY2026 compared to Rs 310.98 crores in H1 FY2025, while EBITDA remained nearly flat at Rs 75.20 crores versus Rs 73.43 crores. The company expects margin recovery in H2 driven by operational efficiencies and higher capacity utilization, with expanded manufacturing capacity now at 2400 MTPA across 9 API blocks and 2 intermediate blocks.",
            "Sentiment": "positive",
            "PublishDate": 1763385681085,
            "Source": "stock"
        },
        {
            "Title": "Anuh Pharma Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Anuh Pharma announced quarterly results showing revenue growth to 1.86 billion rupees from 1.65 billion rupees year-over-year. However, the company experienced a decline in profitability with net profit falling to 76 million rupees from 150 million rupees compared to the same period last year. EBITDA decreased to 119 million rupees from 169 million rupees year-over-year, while EBITDA margin compressed to 6.39% from 10.17% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762517005624,
            "Source": "earnings"
        },
        {
            "Title": "Anuh Pharma Approves Key Leadership Appointments and Auditor Reappointments at 65th AGM",
            "Summary": "Anuh Pharma Limited's 65th Annual General Meeting approved several key appointments and reappointments. The company reappointed Bharat Nemchand Shah and Gaurav Satish Shah as Non-Executive Non-Independent Directors, with Shah having 5 decades of pharma experience and Gaurav holding 20 years of industry experience with a Bachelor's in Engineering from the USA. Ankit Kishor Chande was reappointed as Cost Auditor for financial year ending March 2026, bringing over 12 years of experience across 17 industries. GHV & Co. was appointed as Secretarial Auditor for a five-year term from FY 2025-26 to FY 2029-30. The meeting also approved the reappointment of Joint Managing Directors Ritesh Shah and Vivek Shah for five years from January 8, 2026 to January 7, 2031. Ritesh Shah brings 21 years of pharmaceutical experience in marketing and strategy, while Vivek Shah has over 15 years in operations, R&D, and regulatory affairs. Both Joint Managing Directors are sons of Vice Chairman Bipin Nemchand Shah.",
            "Sentiment": "positive",
            "PublishDate": 1756219669665,
            "Source": "corporate_governance"
        },
        {
            "Title": "Anuh Pharma Reports Q1 Results and Appoints New Chief Marketing Officer",
            "Summary": "Anuh Pharma Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 18,647.94 lakhs compared to Rs 13,790.83 lakhs in the same quarter last year. Profit after tax stood at Rs 830.12 lakhs versus Rs 950.91 lakhs in the corresponding quarter of the previous year. Basic earnings per share was Rs 1.66 compared to Rs 1.90 in the year-ago quarter. EBITDA margin was 7.34% for the quarter. The Board also appointed Mr. Vinayak Shenoy as Chief Marketing Officer effective August 11, 2025. Shenoy brings over 15 years of experience in APIs and Intermediates with expertise in global markets including USA, Europe, CIS, SEA, LATAM, and India.",
            "Sentiment": "neutral",
            "PublishDate": 1754656163516,
            "Source": "earnings"
        },
        {
            "Title": "Anuh Pharma Sets Revised Record Date for FY 2024-25 Final Dividend and AGM Voting Rights",
            "Summary": "Anuh Pharma Limited has announced a revised record date of August 15, 2025, for determining shareholder eligibility for the final dividend for FY 2024-25 and voting rights for the Annual General Meeting. The company's 65th AGM is scheduled for August 22, 2025, at 4:00 PM IST at Hall of Harmony, Nehru Centre, Mumbai. The final dividend is subject to declaration and approval by members at the AGM. Shareholders will be entitled to vote through remote e-voting facility or at the AGM. The Notice of AGM and Annual Report will be sent to shareholders separately.",
            "Sentiment": "neutral",
            "PublishDate": 1753780227009,
            "Source": "corporate_action"
        },
        {
            "Title": "Anuh Pharma Opens New Manufacturing Facility in Tarapur",
            "Summary": "Anuh Pharma has opened a new manufacturing facility in Tarapur, located in the Palghar district. The news indicates an expansion of the company's production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1752571359000,
            "Source": "default"
        },
        {
            "Title": "Anuh Pharma Reports Q4 Results and Recommends Dividend",
            "Summary": "Anuh Pharma has announced its Q4 financial results and dividend recommendation. The company's Q4 EBITDA was 187 million rupees, down from 192.2 million rupees year-over-year. The EBITDA margin decreased to 10.48% from 11.73% in the same period last year. Q4 net profit stood at 125 million rupees, compared to 153.6 million rupees year-over-year and 103 million rupees quarter-on-quarter. Revenue for Q4 increased to 1.9 billion rupees from 1.64 billion rupees year-over-year. The company has recommended a dividend of 1.5 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1748010641000,
            "Source": "result"
        },
        {
            "Title": "Anuh Pharma Reports Q3 Financial Results",
            "Summary": "Anuh Pharma has released its Q3 financial results. The company reported a net profit of 103 million rupees, which is lower compared to 191 million rupees in the same quarter last year (YoY) and 150 million rupees in the previous quarter (QoQ). The Q3 revenue stood at 1.6 billion rupees, down from 1.72 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739146411000,
            "Source": "earnings"
        },
        {
            "Title": "Anuh Pharma Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Anuh Pharma's third-quarter EBITDA decreased to 148 million rupees from 240 million rupees year-over-year. The company's EBITDA margin also fell to 9.27% from 13.93% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738932028000,
            "Source": "earnings"
        },
        {
            "Title": "Anuh Pharma Reports Q3 Financial Results",
            "Summary": "Anuh Pharma announced its Q3 financial results. The company reported a net profit of 103 million rupees, which is lower compared to both the previous year (191 million rupees) and the previous quarter (150 million rupees). The Q3 revenue stood at 1.6 billion rupees, down from 1.72 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1738931971000,
            "Source": "earnings"
        },
        {
            "Title": "Anuh Pharma Receives NSE Approval for Listing and Trading of Equity Shares",
            "Summary": "Anuh Pharma has received approval from the National Stock Exchange (NSE) for the listing and trading of 5,01,12,000 equity shares. Trading of these shares on the NSE is scheduled to commence on December 20, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1734573443000,
            "Source": "corporate_action"
        },
        {
            "Title": "Anuh Pharma's New Tarapur Plant to Boost Capacity",
            "Summary": "Anuh Pharma has announced that its new plant in Tarapur is expected to be operational by December 2024. This new facility will significantly increase the company's existing overall operational capacity by 400 MT per annum.",
            "Sentiment": "positive",
            "PublishDate": 1731679061000,
            "Source": "corporate_action"
        },
        {
            "Title": "Anuh Pharma Reports Q2 EBITDA Decline",
            "Summary": "Anuh Pharma's Q2 EBITDA decreased to 169 million rupees from 179 million rupees year-over-year. The company's EBITDA margin also fell to 10.17% from 12.00% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731067214000,
            "Source": "result"
        },
        {
            "Title": "Anuh Pharma Reports Q2 Financial Results",
            "Summary": "Anuh Pharma has announced its Q2 financial results. The company's net profit increased to 150 million rupees, up from 138 million rupees year-over-year and 95 million rupees quarter-over-quarter. Revenue for Q2 rose to 1.65 billion rupees, compared to 1.49 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731067082000,
            "Source": "result"
        }
    ]
}