{
    "Symbol": "ANUP",
    "ISIN": "INE294Z01018",
    "News": [
        {
            "Title": "Anup Engineering Q3 Net Profit Drops to ₹247M",
            "Summary": "The Anup Engineering reported a decline in Q3 net profit to ₹247 million compared to ₹314 million in the same quarter last year, marking a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1770118377742,
            "Source": "co_actions_results"
        },
        {
            "Title": "HDFC MF Raises Stake in Anup Engineering to 9.72%",
            "Summary": "HDFC Mutual Fund increased shareholding in The Anup Engineering Limited from 7.61% to 9.72% through open market purchases, acquiring 4,24,682 shares worth 2.12% stake as of January 23, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769575506676,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anup Engineering Q3FY26 Earnings Call on Feb 4",
            "Summary": "The Anup Engineering Limited schedules earnings conference call for February 4, 2026 at 16:30 hrs to discuss Q3FY26 financial performance for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769517440607,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anup Engineering Reports ₹568 Crore Order Book, Plans Kheda Plant Phase 2(B) by Q3 FY26",
            "Summary": "Anup Engineering announced a strong order book of ₹568 crores, which is expected to support company growth of 15-20%. The company maintains full-year EBITDA margins at 22%. The Kheda Plant's Phase 2(B) is expected to open by the end of Q3 FY26, with projected annual revenue of ₹100-150 crore from this facility.",
            "Sentiment": "positive",
            "PublishDate": 1762761512496,
            "Source": "stock"
        },
        {
            "Title": "Anup Engineering Announces Leadership Transition as Sanjay Lalbhai Steps Down, Punit Lalbhai Elevated to Chairman",
            "Summary": "The Anup Engineering Limited announced significant board changes on November 10, 2025. Sanjay S. Lalbhai stepped down from his position as Chairman and Non-Executive Director as part of the company's succession planning process. Punit S. Lalbhai, previously Vice-Chairman and Non-Executive Director, was elevated to Chairman of the Board to ensure continuity in leadership and sustained organizational growth. Additionally, Kulin S. Lalbhai was appointed as Additional Director in the capacity of Non-Executive Director, subject to member approval. Kulin Lalbhai is the son of Sanjay S. Lalbhai and brother of Punit S. Lalbhai. He serves as Vice Chairman of Arvind Limited, driving consumer and digital businesses, and holds an MBA from Harvard Business School and BS in Electrical Engineering from Stanford University. Sanjay Lalbhai expressed gratitude for his tenure and confidence in the new leadership, while Punit Lalbhai committed to working with the team to drive innovation and create value for stakeholders.",
            "Sentiment": "positive",
            "PublishDate": 1762761121271,
            "Source": "corporate_governance"
        },
        {
            "Title": "The Anup Engineering Reports Mixed Q2 Results with Revenue Growth and Profit Decline",
            "Summary": "The Anup Engineering reported Q2 consolidated net profit of 320 million rupees, down from 325 million rupees in the same period last year. Revenue increased to 2.3 billion rupees from 1.87 billion rupees year-over-year. EBITDA rose to 515 million rupees from 429 million rupees, while EBITDA margin decreased to 22.2% from 22.86% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762759967771,
            "Source": "earnings"
        },
        {
            "Title": "Anup Engineering and Graham Group to Terminate Manufacturing Agreement",
            "Summary": "Anup Engineering and Graham Group have mutually decided to end their manufacturing and supply agreement, with the termination set for October 2, 2025. The decision represents a conclusion to the business partnership between the two companies.",
            "Sentiment": "neutral",
            "PublishDate": 1759325746869,
            "Source": "stock"
        },
        {
            "Title": "Anup Engineering Hosts Investor Meet for Q1 FY26 Results at Singapore Conference",
            "Summary": "Anup Engineering Limited announced an institutional investor and analyst meet scheduled for August 11-12, 2025, at the Ambit Singapore Conference. The company released an investor presentation covering Q1 FY26 results and business overview. The presentation highlighted the company's 62-year experience in manufacturing heat exchangers, pressure vessels, and industrial equipment, serving industries including oil & gas, petrochemicals, and hydrogen. For Q1 FY26, consolidated revenue increased 20% to INR 175.2 crore compared to INR 146 crore in Q1 FY25. EBITDA grew 22.4% to INR 40.4 crore with margins at 23%. The company reported a consolidated orderbook of INR 604 crore as of July 31, 2025, available for billing in FY26, with an inquiry pipeline of INR 1,020 crore expected to close within three months. Anup Engineering operates manufacturing facilities in Gujarat and Tamil Nadu, with Phase 2A construction at its Kheda plant progressing with INR 50 crore capex, expected to commission in Q2 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1754658139549,
            "Source": "stock"
        },
        {
            "Title": "The Anup Engineering Reports ₹1,020 Crore Inquiry Pipeline",
            "Summary": "The Anup Engineering has reported an ongoing inquiry pipeline worth ₹1,020 crore. The company anticipates closing these inquiries within the next 3 months.",
            "Sentiment": "positive",
            "PublishDate": 1754404790303,
            "Source": "stock"
        },
        {
            "Title": "Anup Engineering Approves Quarterly Results and Appoints New Chief Marketing Officer",
            "Summary": "Anup Engineering Limited's Board of Directors approved the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company appointed Mr. Rudolph Mathias as Chief Marketing Officer and designated him as Senior Management Personnel effective August 5, 2025. Mathias brings over 25 years of global experience in international sales strategy, business development and strategic marketing across EPC, Oil & Gas and heavy industrial manufacturing companies. He holds a Bachelor of Arts from Osmania University and a Post Graduate Diploma in Project Management, with proven expertise in driving business growth, strategic planning, and international expansion across North America, Europe, the Middle East, Africa and India.",
            "Sentiment": "positive",
            "PublishDate": 1754375583632,
            "Source": "stock"
        },
        {
            "Title": "The Anup Engineering Reports Growth in Q1 Financial Performance",
            "Summary": "The Anup Engineering reported improved financial results for Q1. Revenue increased to 1.7 billion rupees from 1.5 billion rupees year-over-year. EBITDA rose to 404 million rupees compared to 330 million rupees in the previous year, while EBITDA margin expanded to 23.03% from 22.61%. Consolidated net profit grew to 263 million rupees from 240 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754373500059,
            "Source": "earnings"
        },
        {
            "Title": "Anup Engineering Sets Record Date for Rs. 17 Final Dividend Payment",
            "Summary": "Anup Engineering Limited has fixed August 6, 2025 as the record date for determining shareholder eligibility for a final dividend of Rs. 17 per equity share for the financial year ended March 31, 2025. The dividend payment is subject to approval at the Annual General Meeting scheduled for August 20, 2025, with payment to be made on or after August 25, 2025. The dividend applies to equity shares with a face value of Rs. 10 each.",
            "Sentiment": "positive",
            "PublishDate": 1753707459960,
            "Source": "corporate_action"
        },
        {
            "Title": "Anup Engineering Announces Strong Growth Projections",
            "Summary": "Anup Engineering has provided guidance for fiscal years 2025 and 2026, projecting a 25% revenue growth with an EBITDA of over 20%. The company is targeting exports to constitute approximately 50% of its revenue, as revealed in a recent conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1747192589000,
            "Source": "default"
        },
        {
            "Title": "The Anup Engineering Reports Q4 Results and Declares Dividend",
            "Summary": "The Anup Engineering has announced its Q4 financial results and declared a dividend. The company's Q4 revenue increased to 2 billion rupees from 1.57 billion rupees year-over-year. However, net profit decreased to 293 million rupees from 430 million rupees. EBITDA rose to 459 million rupees from 374 million rupees, but the EBITDA margin slightly decreased to 22.4% from 23.8%. The company has declared a dividend of 17 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1747117269000,
            "Source": "result"
        },
        {
            "Title": "Anup Engineering to Consider Q4 Results on May 13",
            "Summary": "The Anup Engineering Limited has announced that it will consider its fourth quarter financial results on May 13. This is a standard corporate practice where companies review and approve their quarterly financial statements before public disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1746532777000,
            "Source": "default"
        },
        {
            "Title": "The Anup Engineering Reports Q3 Revenue Growth",
            "Summary": "The Anup Engineering has announced its financial results for the third quarter. The company reported revenue of 1.7 billion rupees, compared to 1.28 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738303440000,
            "Source": "earnings"
        },
        {
            "Title": "The Anup Engineering Reports Q3 EBITDA Growth",
            "Summary": "The Anup Engineering has reported a significant increase in its Q3 EBITDA, rising to 402 million rupees from 303 million rupees year-over-year. The company's EBITDA margin also saw a slight improvement, increasing to 23.54% from 23.39% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738303411000,
            "Source": "earnings"
        },
        {
            "Title": "The Anup Engineering Reports 55% Increase in Q3 Net Profit",
            "Summary": "The Anup Engineering has reported a significant increase in its third-quarter net profit. The company's net profit for Q3 stood at 314 million rupees, compared to 202 million rupees in the same period last year, representing a year-over-year growth of approximately 55%.",
            "Sentiment": "positive",
            "PublishDate": 1738303320000,
            "Source": "earnings"
        },
        {
            "Title": "Anup Engineering Reports Strong Q2 Financial Results",
            "Summary": "Anup Engineering has announced its Q2 financial results, showing significant year-over-year growth. The company's net profit increased to 325 million rupees from 217 million rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 1.87 billion rupees compared to 1.4 billion rupees in the previous year's Q2.",
            "Sentiment": "positive",
            "PublishDate": 1729931632000,
            "Source": "result"
        }
    ]
}