{
    "Symbol": "ANURAS",
    "ISIN": "INE930P01018",
    "News": [
        {
            "Title": "Anupam Rasayan completes overseas acquisitions",
            "Summary": "Anupam Rasayan India Limited completes acquisition of Doriath S.à r.l. for EUR 7,024.84 and progresses with Batam S.à r.l. acquisition for EUR 958.38, establishing Luxembourg presence for consultancy services.",
            "Sentiment": "positive",
            "PublishDate": 1770906660839,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anupam Rasayan Q3FY26 Earnings Call on Feb 14",
            "Summary": "Anupam Rasayan India Limited schedules earnings call for February 14, 2026 at 15:00 hrs to discuss Q3 and 9-month FY26 financial results ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770729471094,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anupam Rasayan Passes Three Special Resolutions",
            "Summary": "Anupam Rasayan India Limited successfully passed three special resolutions through postal ballot, including approval for increased borrowing limits of ₹4,500 crores and enhanced investment powers.",
            "Sentiment": "positive",
            "PublishDate": 1769090225871,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anupam Rasayan Passes 3 Special Resolutions via E-Voting",
            "Summary": "Anupam Rasayan India Limited successfully passed three special resolutions through postal ballot e-voting on January 09, 2026, including approval for increased borrowing limits and asset disposal powers.",
            "Sentiment": "positive",
            "PublishDate": 1768064497862,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anupam Rasayan Releases 30L Pledged Shares",
            "Summary": "Catalyst Trusteeship Limited releases 30 lakh pledged shares of Anupam Rasayan India Limited, reducing encumbered holdings from 6.37% to 3.73% of total share capital.",
            "Sentiment": "positive",
            "PublishDate": 1767434523064,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anupam Rasayan Promoter Releases ₹30L Share Pledge",
            "Summary": "Anand Sureshbhai Desai, promoter of Anupam Rasayan India Limited, released pledge on 30,00,000 equity shares (2.64% stake) after loan repayment, reducing total pledged shares to 80,75,000.",
            "Sentiment": "positive",
            "PublishDate": 1767417063075,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anupam Rasayan Promoter Pledges 19.8 Lakh Shares",
            "Summary": "Mona Anandbhai Desai pledges 19,80,000 equity shares to Aditya Birla Capital Limited for loan purposes, increasing total pledged shares to 26,80,000 representing 2.35% of share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1767416828799,
            "Source": "stocks"
        },
        {
            "Title": "Anupam Rasayan Shares Jayhawk Acquisition Details",
            "Summary": "Anupam Rasayan reveals comprehensive details of its USD 150 million Jayhawk Fine Chemicals acquisition in investor call, highlighting strategic rationale and integration plans.",
            "Sentiment": "positive",
            "PublishDate": 1766141525797,
            "Source": "co_actions_results"
        },
        {
            "Title": "CRISIL Places Anupam Rasayan on Rating Watch Negative",
            "Summary": "CRISIL Ratings places Anupam Rasayan India Limited's bank facilities worth ₹1,369.82 crores on Rating Watch with Negative Implications following the announced USD 150 million Jayhawk Fine Chemicals acquisition.",
            "Sentiment": "negative",
            "PublishDate": 1766071555566,
            "Source": "stocks"
        },
        {
            "Title": "Anupam Rasayan Acquires US-Based Jayhawk Fine Chemicals for $134M to Expand Performance Materials Business",
            "Summary": "Anupam Rasayan India Limited signed a definitive agreement to acquire 100% equity of Jayhawk Fine Chemicals LLC, a US-based specialty chemical company, for an enterprise value of $134 million funded through internal accruals, debt and quasi equity. The acquisition provides Anupam strategic entry into the US market and expands its presence in high-value performance materials segment, with Jayhawk generating $78 million revenue and $15 million EBITDA in 2024.",
            "Sentiment": "positive",
            "PublishDate": 1765291808612,
            "Source": "order&deals"
        },
        {
            "Title": "Anupam Rasayan Seeks Shareholder Approval for Independent Director Appointment via Postal Ballot",
            "Summary": "Anupam Rasayan India Limited has issued a postal ballot notice seeking member approval for appointing Mr. Milind Madan Talathi as Non-Executive Independent Director for a three-year term from September 25, 2025 to September 24, 2028. The remote e-voting process runs from November 23, 2025 to December 22, 2025, with results to be announced on December 24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763806335395,
            "Source": "corporate_action"
        },
        {
            "Title": "Anupam Rasayan Submits Monitoring Agency Report for Preferential Issue Proceeds Utilization",
            "Summary": "Anupam Rasayan India Limited submitted CRISIL's monitoring agency report for the quarter ended September 30, 2025, covering utilization of Rs 550 crore preferential issue proceeds. The report shows Rs 429.69 crore was fully utilized for loan repayment and Rs 119.71 crore for general corporate purposes including vendor payments, with no deviations from disclosed objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1763067858178,
            "Source": "corporate_action"
        },
        {
            "Title": "Anupam Rasayan Reports Record Quarterly Revenue of ₹731 Crore, Up 149% Year-on-Year",
            "Summary": "Anupam Rasayan India Limited delivered exceptional performance with consolidated revenue of ₹731.4 crore, marking 148.8% year-on-year growth and 50.5% sequential growth. For the first half, consolidated revenue reached ₹1,217.2 crore, representing 122.1% year-on-year growth. The company has already surpassed total FY25 revenue within six months. EBITDA margins stood at 19.5% for the quarter and 25.5% for the half-year, with margins temporarily impacted by dispatches from older inventory. The company expects margins to normalize from Q3 onwards. Approximately 25-30% of quarterly revenue came from inventory liquidation. The order book remains healthy at ₹14,646 crore spread over 5-7 years, expected to contribute ₹450 crore in FY26 revenue. Life Science Related Specialty Chemicals contributed 84% of total revenue, with the Pharma segment growing 201% year-on-year. Performance Materials segment grew 306% year-on-year. Working capital days improved from 409 days to 247 days, with target reduction to 200 days. The company received ₹277.5 crore from warrants in July 2025, using ₹175 crore for debt repayment, resulting in net debt of ₹30 crore at consolidated level.",
            "Sentiment": "positive",
            "PublishDate": 1761376066514,
            "Source": "earnings"
        },
        {
            "Title": "Anupam Rasayan India Reports Strong Q2 Revenue Growth Despite Margin Decline",
            "Summary": "Anupam Rasayan India reported quarterly revenue of 7.3 billion rupees, representing significant growth from 2.94 billion rupees in the same period last year. The company's EBITDA increased to 1.36 billion rupees from 804 million rupees year-over-year. However, EBITDA margin contracted to 18.54% from 27.35% in the previous year. Consolidated net profit rose substantially to 444 million rupees compared to 167 million rupees in the prior year period.",
            "Sentiment": "positive",
            "PublishDate": 1760676311995,
            "Source": "earnings"
        },
        {
            "Title": "Anupam Rasayan India Appoints Milind Madan Talathi as Independent Director for Three-Year Term",
            "Summary": "Anupam Rasayan India Limited appointed Mr. Milind Madan Talathi as an Additional Director categorized as Non-Executive Independent Director for a three-year term from September 25, 2025 to September 24, 2028, subject to shareholder approval. The appointment was approved by the Board of Directors based on the recommendation of the Nomination and Remuneration Committee. Talathi will also join the Risk Management Committee. He holds a Chemical Engineering degree from UDCT Mumbai and a Management degree from Pune University, with around four decades of experience in chemical manufacturing operations across pesticides, polymers, fluorochemicals, and specialty chemicals. His career includes leadership roles at Tata Group's Rallis India Ltd., Century Enka Ltd. where he served as President (Operations), Gujarat Fluorochemicals as COO, and ELANTAS Beck India Ltd. as Whole Time Director. Talathi is not related to any existing directors and meets independence criteria under the Companies Act, 2013 and SEBI Listing Regulations.",
            "Sentiment": "positive",
            "PublishDate": 1758811935900,
            "Source": "corporate_governance"
        },
        {
            "Title": "Anupam Rasayan Reports 91% Revenue Growth in Q1 FY26, Expects Over 30% Growth for Full Year",
            "Summary": "Anupam Rasayan India Limited reported strong quarterly results with consolidated revenue of INR 486 crores, up 91% year-over-year, and EBITDA of INR 129 crores, up 118% year-over-year. The specialty chemicals company achieved an EBITDA margin of 26.3% and PAT of INR 49 crores, up 297% year-over-year. All business segments showed significant growth, with pharmaceuticals revenue growing 3x, performance materials over 2x, and agrochemicals 100% year-over-year. The company completed all planned capex projects and launched 17 new molecules in the pharma segment. Anupam Rasayan signed strategic agreements including a long-term master purchase agreement with a Japan-based multinational for semiconductor-related molecules and a letter of intent with European energy storage company E-Lyte Innovations. The order book stands at INR 14,646 crores. The company received INR 277.5 crores from a preferential issue, using INR 175 crores to repay term debt, making it long-term net debt free. Management expects over 30% revenue growth in FY26, citing recovery in customer demand and completion of inventory destocking.",
            "Sentiment": "positive",
            "PublishDate": 1755599281947,
            "Source": "earnings"
        },
        {
            "Title": "Anupam Rasayan India Makes Earnings Call Audio Recording Available on Company Website",
            "Summary": "Anupam Rasayan India Limited has made the audio recording of its earnings call available on its company website. The earnings call discussed the unaudited financial results for the quarter ended June 30, 2025, and was held on Thursday, August 14, 2025, at 03:30 p.m. IST. The recording can be accessed at www.anupamrasayan.com.",
            "Sentiment": "neutral",
            "PublishDate": 1755186871923,
            "Source": "earnings"
        },
        {
            "Title": "Anupam Rasayan Expands Long-Term Contracts and Invests in Eco-Friendly Processes",
            "Summary": "Anupam Rasayan has expanded its long-term contracts with global agrochemical and specialty chemical leaders. The company is incorporating value-added molecules into its operations and making investments in eco-friendly processes as part of its sustainable growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1755103954423,
            "Source": "stock"
        },
        {
            "Title": "Anupam Rasayan India Reports Strong Q1 Growth with Revenue Nearly Doubling",
            "Summary": "Anupam Rasayan India delivered strong quarterly performance with revenue rising to 4.86 billion rupees from 2.54 billion rupees year-over-year. The company's EBITDA increased significantly to 1.24 billion rupees compared to 532 million rupees in the same period last year, while EBITDA margin improved to 25.61% from 20.93%. Consolidated net profit surged to 340 million rupees versus 39 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1755093053059,
            "Source": "earnings"
        },
        {
            "Title": "Anupam Rasayan Board Approves $17 Million Corporate Guarantee for Subsidiary's Credit Facility",
            "Summary": "Anupam Rasayan India Limited's Board of Directors approved providing a corporate guarantee to secure a USD 17 million credit facility from Export-Import Bank of India for its wholly-owned subsidiary, Anupam General Trading FZE. The guarantee covers 110% of the facility amount plus interest. The subsidiary will use the buyer's credit facility to part finance import of chemicals and other related products from India. The facility is structured as a revolving credit line for one year, subject to annual review and renewal. The guarantee creates a contingent liability for Anupam Rasayan, with potential impact only if the subsidiary fails to meet its repayment obligations. The promoters and group companies have no interest in this arm's length transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1753881328595,
            "Source": "stock"
        },
        {
            "Title": "Anupam Rasayan Allocates 39.14 Lakh Equity Shares in Preferential Issue",
            "Summary": "Anupam Rasayan has allocated 39.14 lakh equity shares valued at ₹2775 crore through a preferential issue to non-promoters. This allocation is due to warrant conversion.",
            "Sentiment": "positive",
            "PublishDate": 1752588561000,
            "Source": "default"
        },
        {
            "Title": "Anupam Rasayan India Ltd.: Stock Soars 50% in Three Months Despite Bearish Outlook",
            "Summary": "Anupam Rasayan's stock has rallied 49.55% in the last three months, closing at Rs 1,141.80. However, the majority of analysts have a 'sell' rating on the stock, with a target price of Rs 685.71, implying a 40% potential downside. The company reported a 24.7% increase in Q4 revenue to Rs 500 crore and a 44% rise in net profit to Rs 44.5 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1751330351000,
            "Source": "normal_news"
        },
        {
            "Title": "Anupam Rasayan Secures LOI for Long-Term Electrolyte Salt Supply",
            "Summary": "Anupam Rasayan has obtained a Letter of Intent (LOI) from E-Lyte Innovations and Fuchs Lubricants Germany for the long-term supply of electrolyte salt. This agreement strengthens Anupam Rasayan's position in the lithium-ion battery chemicals sector.",
            "Sentiment": "positive",
            "PublishDate": 1749709215000,
            "Source": "default"
        },
        {
            "Title": "Anupam Rasayan India Reports Q4 Financial Results",
            "Summary": "Anupam Rasayan India has reported its Q4 financial results. The company's EBITDA increased to 1.4 billion rupees from 926 million rupees year-over-year. The EBITDA margin improved to 28.89% from 23.11% in the same period. Consolidated net profit rose to 446 million rupees from 309 million rupees year-over-year and 282 million rupees quarter-over-quarter. Revenue for Q4 grew to 5 billion rupees from 4.01 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748008244000,
            "Source": "result"
        },
        {
            "Title": "Anupam Rasayan Signs $106 Million Letter of Intent with Korean MNC",
            "Summary": "Anupam Rasayan has signed a 10-year Letter of Intent (LOI) worth $106 million (approximately ₹922 crore) with a leading Korean multinational corporation. This long-term agreement signifies a substantial business opportunity for the company.",
            "Sentiment": "positive",
            "PublishDate": 1741651523000,
            "Source": "order&deals"
        },
        {
            "Title": "Anupam Rasayan Signs $106 Million Letter of Intent with Korean Multinational",
            "Summary": "Anupam Rasayan has signed a Letter of Intent (LOI) worth $106 million (approximately ₹922 crore) with a leading Korean multinational company. The LOI is for a 10-year period, indicating a long-term business relationship.",
            "Sentiment": "positive",
            "PublishDate": 1741606902000,
            "Source": "order&deals"
        },
        {
            "Title": "Anupam Rasayan: EV Battery Chemical Supply Deal with Elementium",
            "Summary": "Anupam Rasayan signed a letter of intent with US-based Elementium Materials Inc to supply chemicals for EV batteries. Supply expected to start from FY2026 end. Potential five-year agreement worth $350-450 million. New plant setup required for full production.",
            "Sentiment": "positive",
            "PublishDate": 1740756680000,
            "Source": "order&deals"
        },
        {
            "Title": "Anupam Rasayan to Negotiate 5-Year Supply Agreement Worth $350-450 Million",
            "Summary": "Anupam Rasayan has announced plans to negotiate a supply agreement spanning five years. The cumulative sales from this agreement are expected to range between $350 million to $450 million.",
            "Sentiment": "positive",
            "PublishDate": 1740728404000,
            "Source": "corporate_action"
        },
        {
            "Title": "Anupam Rasayan India Announces Supply Commencement Timeline",
            "Summary": "Anupam Rasayan India has announced that it expects to commence supply operations by the end of the fiscal year 2026 (FY26).",
            "Sentiment": "positive",
            "PublishDate": 1740728397000,
            "Source": "corporate_action"
        },
        {
            "Title": "Anupam Rasayan Signs LOI with Elementium Materials for EV Battery Solvent",
            "Summary": "Anupam Rasayan has signed a Letter of Intent (LOI) with USA-based Elementium Materials Inc. The agreement is for the development and supply of an advanced solvent for electric vehicle (EV) batteries. This collaboration signifies Anupam Rasayan's entry into the growing EV battery materials market.",
            "Sentiment": "positive",
            "PublishDate": 1740728288000,
            "Source": "corporate_action"
        },
        {
            "Title": "Anupam Rasayan India Ltd: Targets Significant Revenue Growth for FY26",
            "Summary": "Anupam Rasayan aims for 30-35% revenue growth in FY26, driven by a rebound in agrochemical demand.",
            "Sentiment": "positive",
            "PublishDate": 1739529867000,
            "Source": "normal_news"
        },
        {
            "Title": "Anupam Rasayan India Reports Q3 Results and Signs Long-Term Supply Agreement",
            "Summary": "Anupam Rasayan India announced its Q3 consolidated net profit of 282 million rupees, up from 184 million rupees year-over-year. Q3 revenue increased to 3.9 billion rupees from 2.9 billion rupees. The company also signed a Letter of Intent with a US multinational corporation for the supply of a high-performance specialty chemical product over the next 10 years, with projected cumulative sales of $195 million (₹1,697 crores).",
            "Sentiment": "positive",
            "PublishDate": 1739492237000,
            "Source": "earnings"
        },
        {
            "Title": "Anupam Rasayan Signs LOI with US MNC for Specialty Chemical Supply",
            "Summary": "Anupam Rasayan has signed a Letter of Intent (LOI) with a US multinational corporation for the supply of a high-performance specialty chemical product. The agreement is set to span over the next 10 years, with projected cumulative sales reaching $195 million (approximately ₹1,697 crores).",
            "Sentiment": "positive",
            "PublishDate": 1739461349000,
            "Source": "order&deals"
        },
        {
            "Title": "Anupam Rasayan India Reports Strong Q3 EBITDA Growth",
            "Summary": "Anupam Rasayan India has reported significant year-over-year improvements in its Q3 financial performance. The company's EBITDA increased to 1.24 billion rupees from 791 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 31.86% from 26.76% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739454650000,
            "Source": "earnings"
        },
        {
            "Title": "Anupam Rasayan India Reports Strong Q3 Financial Results",
            "Summary": "Anupam Rasayan India has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 282 million rupees from 184 million rupees in the same quarter last year. Revenue also saw substantial growth, rising to 3.9 billion rupees from 2.9 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739454644000,
            "Source": "earnings"
        },
        {
            "Title": "Anupam Rasayan Establishes Dubai Subsidiary",
            "Summary": "Anupam Rasayan has incorporated a wholly owned subsidiary named Anupam General Trading FZE in Dubai. The new entity has been established with an initial capital of AED 20,000.",
            "Sentiment": "positive",
            "PublishDate": 1731758885000,
            "Source": "corporate_action"
        },
        {
            "Title": "Anupam Rasayan India Reports Q2 EBITDA Decline",
            "Summary": "Anupam Rasayan India's Q2 EBITDA decreased to 805 million rupees from 1.07 billion rupees year-over-year. The EBITDA margin remained relatively stable at 27.38% compared to 27.39% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1731603155000,
            "Source": "result"
        },
        {
            "Title": "Anupam Rasayan India Reports Q2 Financial Results",
            "Summary": "Anupam Rasayan India has reported its Q2 consolidated net profit at 167 million rupees, showing a significant decrease from 407 million rupees year-over-year and a slight increase from 39 million rupees quarter-over-quarter. The company's Q2 revenue stood at 2.9 billion rupees, down from 3.9 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1731603085000,
            "Source": "result"
        }
    ]
}