{
    "Symbol": "APARINDS",
    "ISIN": "INE372A01015",
    "News": [
        {
            "Title": "APAR Industries Seeks Shareholder Approval for Director",
            "Summary": "APAR Industries issued postal ballot notice dated January 29, 2026, seeking shareholder approval for appointment of Mr. Pitamber Shivnani as Independent Director through remote e-voting.",
            "Sentiment": "neutral",
            "PublishDate": 1770718574160,
            "Source": "stocks"
        },
        {
            "Title": "APAR Industries enters telecom service business",
            "Summary": "APAR Industries announces entry into telecom service business, winning ₹156.9 crore railway signalling and telecom infrastructure contract from South Eastern Railway for Kavach ATP system deployment.",
            "Sentiment": "positive",
            "PublishDate": 1769682368079,
            "Source": "stocks"
        },
        {
            "Title": "APAR Industries Q3 Net Profit Rises 19.4% YoY",
            "Summary": "APAR Industries reported consolidated net profit of ₹2.09 billion in Q3, marking a 19.4% increase from ₹1.75 billion in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1769673120032,
            "Source": "co_actions_results"
        },
        {
            "Title": "APAR Industries Grants 21,399 ESARs to Employees",
            "Summary": "APAR Industries' board committee approved grant of 21,399 Employee Stock Appreciation Rights to eligible employees under its 2024 ESAR plan at Rs. 7,411.50 per unit with 8-year exercise period.",
            "Sentiment": "positive",
            "PublishDate": 1769672518374,
            "Source": "co_actions_results"
        },
        {
            "Title": "APAR Industries Q3FY26 Conference Call Set for Jan 29",
            "Summary": "APAR Industries schedules conference call for January 29, 2026 at 3:30 PM IST to discuss Q3FY26 results with analysts and investors, hosted by S-Ancial Technologies.",
            "Sentiment": "neutral",
            "PublishDate": 1767362056278,
            "Source": "co_actions_results"
        },
        {
            "Title": "APAR Industries CEO-Cable Solutions Resigns",
            "Summary": "Shashi Amin, Chief Executive Officer-Cable Solutions at APAR Industries, resigned on December 12, 2025, to pursue new opportunities outside the company.",
            "Sentiment": "neutral",
            "PublishDate": 1765554198567,
            "Source": "stocks"
        },
        {
            "Title": "APAR Industries Opens Special Transfer Window",
            "Summary": "APAR Industries announces special window for re-lodgement of physical share transfer requests under SEBI circular, providing shareholders another opportunity to complete pending transfers.",
            "Sentiment": "neutral",
            "PublishDate": 1765457370772,
            "Source": "stocks"
        },
        {
            "Title": "APAR Industries Appoints Chandrashekhar Shrotri as CEO of Cable Solutions Division",
            "Summary": "APAR Industries appointed Mr. Chandrashekhar Shrotri as Chief Executive Officer-Cable Solutions in the senior management category, effective December 4, 2025. The appointment was made by the Board of Directors based on the recommendation of the Nomination and Compensation-cum-Remuneration Committee, bringing over 35 years of experience in sales, marketing, and general management from his previous role as Segment CEO at Siemens Limited.",
            "Sentiment": "positive",
            "PublishDate": 1764851908248,
            "Source": "corporate_governance"
        },
        {
            "Title": "APAR Industries Subsidiary Wins 15-Year Karnataka Fiber Network Contract",
            "Summary": "APAR Industries' wholly owned subsidiary ATDPPL has been selected by Karnataka Power Transmission Corporation Limited (KPTCL) to operate, maintain and monetize their existing 6,100 km OPGW fiber network for 15 years. The company will enter the dark fiber monetization business, marketing network capacity to telecom service providers. Under the PPP arrangement, ATDPPL will pay Rs. 5 crore annually as network rental and share revenue with KPTCL in a 60:40 ratio. This marks APAR's strategic entry into brownfield OPGW infrastructure operations, creating a new recurring revenue stream in passive communication infrastructure without requiring capital expenditure.",
            "Sentiment": "positive",
            "PublishDate": 1762477089642,
            "Source": "stock"
        },
        {
            "Title": "APAR Industries Reports 23% Revenue Growth to Rs 5,715 Crores in Q2FY26, Crosses Rs 10,000 Crores in First Half",
            "Summary": "APAR Industries reported consolidated revenue of Rs 5,715 crores in Q2FY26, representing 23.1% year-on-year growth with volume growth across all three divisions. Exports grew 43% year-on-year, contributing 34.7% of consolidated revenue compared to 29.8% in the previous year. EBITDA increased 24% to Rs 499 crores with an 8.7% margin, while profit after tax rose 30% to Rs 252 crores. For the first half, consolidated revenue reached Rs 10,820 crores, up 25% year-on-year, marking the first time the company crossed Rs 10,000 crores in one half. The conductor division showed strong performance with 34.9% revenue growth and 74.6% export growth, while the cable division posted 25.1% revenue growth. However, the company faces headwinds from rising metal prices and US tariff issues, with aluminum prices reaching 2,900 per ton and copper exceeding 11,200 per metric ton, causing customers to delay new orders. Management expects Q3 to face pressure due to these factors but remains optimistic about Q4 recovery.",
            "Sentiment": "positive",
            "PublishDate": 1762410979053,
            "Source": "earnings"
        },
        {
            "Title": "Apar Industries Targets Export Growth Through Renewable Conductors and Global Partnerships",
            "Summary": "Apar Industries is focusing on export-led expansion with an emphasis on renewable-grade conductors and high-margin cables. The company is pursuing global OEM partnerships as part of its strategy to maintain double-digit growth and stable profit margins.",
            "Sentiment": "positive",
            "PublishDate": 1761754772239,
            "Source": "stock"
        },
        {
            "Title": "Apar Industries Reports Strong Q2 Growth Amid Tariff Uncertainty",
            "Summary": "Apar Industries delivered robust quarterly results with revenue rising to 57.2 billion rupees from 46.5 billion rupees year-over-year. Consolidated net profit increased to 2.5 billion rupees compared to 1.94 billion rupees in the same period last year. EBITDA grew to 4.61 billion rupees from 3.6 billion rupees, while EBITDA margin improved to 8.06% from 7.7%. The company's Managing Director acknowledged current tariff uncertainty and indicated plans for tactical decisions to maintain market presence.",
            "Sentiment": "positive",
            "PublishDate": 1761725370995,
            "Source": "stock"
        },
        {
            "Title": "APAR Industries Block Trade Worth Rs. 81.11 Crores Executed on NSE",
            "Summary": "APAR Industries executed a block trade on the National Stock Exchange worth Rs. 81.11 crores. The transaction involved approximately 96,913 shares at a price of Rs. 8,369.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1760510113994,
            "Source": "order&deals"
        },
        {
            "Title": "APAR Industries Reports 27% Revenue Growth in Q1 FY26 Driven by Strong Domestic Demand",
            "Summary": "APAR Industries delivered strong quarterly results with revenue growing 27.3% year-on-year to Rs. 5,104 crores. The conductor division led growth with 43.9% revenue increase, supported by improved product mix and 18% volume growth. Premium products contributed 43.5% of conductor revenue compared to 37.1% in the previous year. EBITDA increased 27% to Rs. 501 crores with margins at 9.8%. Profit after tax grew 30% to Rs. 263 crores. The cable segment posted 36.3% revenue growth reaching Rs. 1,419 crores, with strong US performance growing 136% year-on-year. Export revenues contributed 31.6% to total turnover. The company maintains a conductor order book of Rs. 7,779 crores and received new orders worth Rs. 3,135 crores during the quarter. Management continues to guide for 25% value growth in cables and 10% volume growth in conductors, while maintaining EBITDA guidance of Rs. 30,000 plus tailwinds per metric ton for conductors.",
            "Sentiment": "positive",
            "PublishDate": 1754306982032,
            "Source": "earnings"
        },
        {
            "Title": "APAR Industries Reports 27.3% Revenue Growth and 29.9% PAT Growth in Q1 FY26",
            "Summary": "APAR Industries Limited announced its quarterly results for the three months ended June 30, 2025. The company reported consolidated revenue of ₹5,104 crores, marking a 27.3% year-over-year growth compared to Q1 FY25. Profit after tax increased by 29.9% to ₹263 crores with a margin of 5.2%. The domestic business showed strong performance with 38.3% growth, while export contribution stood at 31.6%. The conductor segment generated revenue of ₹2,785 crores with 43.9% YoY growth, specialty oils remained flat compared to last year, and cable solutions posted 36.3% YoY revenue growth. The company's order book for conductors remains strong at ₹7,779 crores. EBITDA margin after forex adjustments stood at 9.8%, unchanged from Q1 FY25 but higher by 0.5% sequentially.",
            "Sentiment": "positive",
            "PublishDate": 1753773965572,
            "Source": "earnings"
        },
        {
            "Title": "Apar Industries Reports Strong Q1 Growth with 30% Revenue Jump",
            "Summary": "Apar Industries delivered robust Q1 results with consolidated net profit rising to 2.63 billion rupees from 2.02 billion rupees year-over-year. Revenue increased significantly to 50.8 billion rupees compared to 40 billion rupees in the same period last year. EBITDA grew to 4.52 billion rupees from 3.75 billion rupees year-over-year, though EBITDA margin declined slightly to 8.86% from 9.37%. The company's Co Chairman expressed confidence in strong future performance.",
            "Sentiment": "positive",
            "PublishDate": 1753773498397,
            "Source": "stock"
        },
        {
            "Title": "Apar Industries: Small-Cap Stock Surges 50% in May After Strong Q4 Results",
            "Summary": "Apar Industries' stock price rose 48% in May, rebounding from previous underperformance. Q4 revenue increased 16.9% YoY to ₹5,210 crore, with growth across all segments. US market revenue surged 195.6% YoY in Q4. Profit after tax for Q4 grew 5.9% YoY to ₹250 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747379114000,
            "Source": "earnings"
        },
        {
            "Title": "Apar Industries: Q4 Profit Rises 6%, Revenue Surges 17%",
            "Summary": "Apar Industries reported a 5.9% YoY increase in Q4 FY25 net profit to Rs 250 crore, with revenue up 16.9% to Rs 5,210 crore. EBITDA rose 5.7% to Rs 483 crore, though margins contracted. The company achieved all-time high quarterly and annual revenue, with strong domestic demand growth.",
            "Sentiment": "positive",
            "PublishDate": 1747288286000,
            "Source": "earnings"
        },
        {
            "Title": "Apar Industries to Consider Q4 Results on May 14",
            "Summary": "Apar Industries has announced that it will consider its fourth quarter financial results on May 14. This is a standard quarterly financial reporting event for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1745582027000,
            "Source": "default"
        },
        {
            "Title": "Apar Industries: Small-Cap Stock Plummets 57% in 4 Months",
            "Summary": "Apar Industries' stock has fallen 57.31% from its January peak of ₹11,779 to ₹5,028. The decline followed disappointing Q3 FY24 results and challenges in the conductor business. Despite the recent drop, the stock is still up 637% over three years and 1,568% over five years. Nomura maintains a 'Buy' rating with a ₹10,300 target price.",
            "Sentiment": "negative",
            "PublishDate": 1744631216000,
            "Source": "normal_news"
        },
        {
            "Title": "Apar Industries Clarifies Inaccurate Media Report on US Revenue Contribution",
            "Summary": "Apar Industries has issued a clarification regarding a media report that claimed the company derives 50% of its revenue from the US market. The company explicitly states that this information is inaccurate, refuting the reported revenue contribution from the US market.",
            "Sentiment": "neutral",
            "PublishDate": 1743984533000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Apar Industries Clarifies Inaccurate Media Report on US Revenue Contribution",
            "Summary": "Apar Industries has issued a clarification regarding a media report that claimed the company derives 50% of its revenue from the US market. The company explicitly states that this information is inaccurate, refuting the reported revenue contribution from the United States.",
            "Sentiment": "neutral",
            "PublishDate": 1743777547000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Apar Industries Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade of Apar Industries Ltd. shares occurred on the National Stock Exchange (NSE). Approximately 39,989 shares were traded at a price of Rs. 7090.00 per share, totaling Rs. 28.35 crores in value.",
            "Sentiment": "neutral",
            "PublishDate": 1738643527000,
            "Source": "block_deals"
        },
        {
            "Title": "Apar Industries: Stock Plummets 30% in January After Weak Q3 Results",
            "Summary": "Apar Industries' stock has dropped 30% in January, marking its worst monthly performance since June 2008. The decline follows weak Q3 FY25 results, with net profit falling 20% YoY to ₹175 crore due to margin pressure in the conductor segment. Despite revenue growth, EBITDA declined 12% YoY. The company's order book stands at ₹7,600 crore, up 25% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1738227687000,
            "Source": "earnings"
        },
        {
            "Title": "Apar Industries: Q3 Profit Plunges 70.3% YoY Amid Revenue Decline",
            "Summary": "Apar Industries reported Q3 FY25 results with profit falling 70.3% YoY to ₹174.91 crore and revenue declining 59.68% YoY to ₹4716.42 crore. EPS decreased to ₹43.55. Despite challenges, analysts maintain a Buy consensus.",
            "Sentiment": "negative",
            "PublishDate": 1738130686000,
            "Source": "earnings"
        },
        {
            "Title": "Apar Industries: Share Price Plummets 19% on Weak Q3 Results",
            "Summary": "Apar Industries' stock dropped 19% to a seven-month low after reporting disappointing Q3 FY25 earnings. Net profit fell 19.6% to Rs 175 crore, despite revenue growth of 17.7%. Ebitda declined 12.1%, with margins contracting to 7.6% from 10.1% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738051791000,
            "Source": "earnings"
        },
        {
            "Title": "Apar Industries Reports Q3 Revenue Growth",
            "Summary": "Apar Industries has announced its third-quarter revenue results. The company reported revenue of 47 billion rupees, compared to 40 billion rupees in the same quarter of the previous year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738047914000,
            "Source": "earnings"
        },
        {
            "Title": "Apar Industries Reports Q3 Net Profit Decline",
            "Summary": "Apar Industries announced its Q3 consolidated net profit of 1.75 billion rupees, showing a decrease from 2.18 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738047899000,
            "Source": "earnings"
        },
        {
            "Title": "Apar Industries Reports Q3 EBITDA Decline",
            "Summary": "Apar Industries has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 3.6 billion rupees from 4.05 billion rupees in the same quarter last year. The EBITDA margin also declined to 7.58% from 10.09% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738047857000,
            "Source": "earnings"
        },
        {
            "Title": "APAR Industries Ltd. Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) for APAR Industries Ltd. The transaction involved approximately 100,658 shares, traded at a price of Rs. 9716.25 per share. The total value of this block trade amounted to Rs. 97.80 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1737618880000,
            "Source": "block_deals"
        },
        {
            "Title": "Apar Industries Announces CTC Production Capacity Expansion",
            "Summary": "Apar Industries has announced plans to expand its production capacity for its CTC (Continuous Transposed Conductor) business. The company aims to increase its total annual production capacity for CTC to 20,490 MT by the third quarter of fiscal year 2026.",
            "Sentiment": "positive",
            "PublishDate": 1731910859000,
            "Source": "corporate_action"
        },
        {
            "Title": "Apar Industries Maintains Profit Margin Guidance",
            "Summary": "Apar Industries has reaffirmed its profit margin guidance of Rs 28,500 per ton for the future, despite experiencing favorable conditions in certain markets and products with higher margins. This information was shared during a company conference call.",
            "Sentiment": "neutral",
            "PublishDate": 1730345645000,
            "Source": "normal_news"
        },
        {
            "Title": "Apar Industries Adjusts Growth Expectations",
            "Summary": "Apar Industries has indicated that it may fall short of its 10% volume growth guidance for the full year due to lower volume growth in the first half. The company plans to compensate for this shortfall in the second half of the year, as stated in a recent conference call update.",
            "Sentiment": "neutral",
            "PublishDate": 1730345639000,
            "Source": "normal_news"
        },
        {
            "Title": "Apar Industries Reports Q2 EBITDA and Margin",
            "Summary": "Apar Industries announced its Q2 financial results. The company's EBITDA for Q2 was 3.6 billion rupees, compared to 3.5 billion rupees in the same quarter last year. However, the EBITDA margin decreased to 7.7% from 8.89% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730188194000,
            "Source": "result"
        },
        {
            "Title": "Apar Industries Reports Q2 Revenue Growth",
            "Summary": "Apar Industries has announced its second quarter revenue for the current fiscal year. The company reported revenue of 46.5 billion rupees, compared to 39.26 billion rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730188169000,
            "Source": "result"
        },
        {
            "Title": "Apar Industries Reports Q2 Profit Growth",
            "Summary": "Apar Industries has announced its Q2 consolidated net profit of 1.94 billion rupees, showing an increase from 1.74 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730188149000,
            "Source": "result"
        }
    ]
}