{
    "Symbol": "APCL",
    "ISIN": "INE071F01012",
    "News": [
        {
            "Title": "Anjani Portland Cement Seeks Shareholder Approval for Rs 254 Crore Subsidiary Share Sale",
            "Summary": "Anjani Portland Cement Limited is conducting a postal ballot seeking member approval for selling 48% stake in subsidiary Bhavya Cement Private Limited to holding company Chettinad Cement Corporation for Rs 254.05 crore, alongside material related party transactions worth up to Rs 1,000 crore. The company aims to settle outstanding borrowings of Rs 359.45 crore and improve liquidity position as both the company and subsidiary have been making losses for the past three years.",
            "Sentiment": "neutral",
            "PublishDate": 1763718656933,
            "Source": "corporate_action"
        },
        {
            "Title": "Anjani Portland Cement Board Approves Share Sale and Related Party Transactions",
            "Summary": "Anjani Portland Cement's Board approved the sale of shares in subsidiary Bhavya Cements Private Limited to parent company Chettinad Cement Corporation Private Limited, along with material related party transactions and alteration of Articles of Association. The company will seek shareholder approval through postal ballot for these transactions, which include both ordinary course business dealings and the subsidiary share sale.",
            "Sentiment": "neutral",
            "PublishDate": 1763553102751,
            "Source": "corporate_action"
        },
        {
            "Title": "Anjani Portland Cement Resubmits Corrected Financial Results After Draft Submission Error",
            "Summary": "Anjani Portland Cement Limited corrected an inadvertent submission of draft financial results instead of final results for the quarter ended June 30, 2025. The company requested stock exchanges to replace the previously submitted documents with the correct final results. The standalone results showed revenue from operations of Rs 11,583 lakhs and net profit of Rs 269 lakhs for the quarter. The consolidated results reported revenue of Rs 13,953 lakhs with a net loss of Rs 145 lakhs. The company operates in cement manufacturing and power generation segments, with cement contributing Rs 9,871 lakhs to consolidated revenue. The results were reviewed by auditors and approved by the Board of Directors on August 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755002410246,
            "Source": "earnings"
        },
        {
            "Title": "Anjani Portland Cement Reports Q1 Results, Makes Key Appointments and Schedules AGM",
            "Summary": "Anjani Portland Cement approved its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs 11,574 lakhs compared to Rs 9,703 lakhs in the same quarter last year, with a net profit of Rs 270 lakhs versus a loss of Rs 1,006 lakhs in the previous year quarter. Consolidated revenue reached Rs 13,953 lakhs against Rs 11,578 lakhs last year, though it posted a consolidated net loss of Rs 345 lakhs compared to Rs 1,908 lakhs loss in the prior year. The board appointed Ms. Krithika Vijay Karthik as Company Secretary and Compliance Officer, M/s. Narasimha Murthy & Co. as Cost Auditors for FY 2025-26, and M/s. D Hanumantha Raju & Co. as Secretarial Auditors for five years from FY 2025-26 to FY 2029-30. The company also approved material related party transactions with its holding company Chettinad Cement Corporation Private Limited, subsidiary Bhavya Cements Private Limited, and Chettinad Minerals and Logistics Private Limited. The 41st Annual General Meeting is scheduled for September 25, 2025, via video conferencing.",
            "Sentiment": "positive",
            "PublishDate": 1754984150166,
            "Source": "earnings"
        },
        {
            "Title": "Anjani Portland Cement Reports Q4 Financial Results",
            "Summary": "Anjani Portland Cement has reported its Q4 financial results. The company experienced an EBITDA loss of 49 million rupees, compared to a gain of 103 million rupees in the same quarter last year. The consolidated net loss for Q4 was 130 million rupees, an increase from the 44 million rupees loss reported in the previous year. Revenue for the quarter stood at 1.4 billion rupees, down from 1.58 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1747986572000,
            "Source": "result"
        }
    ]
}