{
    "Symbol": "APCOTEXIND",
    "ISIN": "INE116A01032",
    "News": [
        {
            "Title": "Apcotex Industries Q3 FY26 Results Show Strong Growth",
            "Summary": "Apcotex Industries reported net profit of ₹2,221.53 lakhs for Q3 FY26, up 92.2% YoY. Board declared interim dividend of ₹2.50 per share with February 4, 2026 as record date.",
            "Sentiment": "positive",
            "PublishDate": 1769682501912,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apcotex Industries Board Meet on Jan 29 for Q3 Results",
            "Summary": "Apcotex Industries has scheduled a board meeting on January 29, 2026, to consider Q3FY26 audited financial results and interim dividend proposal under Regulation 29.",
            "Sentiment": "neutral",
            "PublishDate": 1768556818638,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apcotex Industries Receives GST Penalty of ₹4.32 Lakh",
            "Summary": "Apcotex Industries received a GST penalty order of ₹4.32 lakh from Maharashtra tax authorities for alleged blocked credit violations during FY2018-19. Company evaluating order with no expected material impact.",
            "Sentiment": "negative",
            "PublishDate": 1767099469373,
            "Source": "stocks"
        },
        {
            "Title": "Apcotex Industries Sees Promoter Group Share Transfer",
            "Summary": "Janaki Parekh acquires 4,000 shares from Rita Ashok Parekh through inter-se transfer by way of gift without consideration on December 10, 2025, increasing shareholding from 0.02% to 0.03%.",
            "Sentiment": "neutral",
            "PublishDate": 1765422149727,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apcotex Industries: Promoter Group Member Acquires 4,000 Shares Through Gift Transfer",
            "Summary": "Janaki Parekh, a promoter group member of Apcotex Industries Limited, is acquiring 4,000 shares (0.01% of share capital) from Rita Ashok Parekh through an inter-se gift transfer without consideration on December 10, 2025. The transaction increases Janaki Parekh's shareholding from 12,500 to 16,500 shares while Rita Ashok Parekh's holding decreases from 319,250 to 315,250 shares, with the acquisition exempt from open offer requirements under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764753677958,
            "Source": "corporate_action"
        },
        {
            "Title": "Apcotex Industries Reports Strong Q2 Performance with 48% EBITDA Growth, Announces Rs 210 Crore Capacity Expansion",
            "Summary": "Apcotex Industries delivered robust quarterly results with operating revenue of Rs 337 crores and EBITDA growing 48% year-on-year to Rs 41 crores, achieving a margin of 12.06%. Profit after tax surged 130% to Rs 25 crores with a PAT margin of 7.51%. The company turned net cash positive and achieved highest-ever export volumes, up 31% year-on-year. For the half-year, volumes increased 18% with operating revenue rising 4% to Rs 713 crores and EBITDA growing 34% to Rs 79 crores. The board approved a Rs 210 crore capacity expansion at the Valia facility, adding 37,000 metric tonnes of synthetic latex and 14,600 metric tonnes of nitrile rubber capacity with combined revenue potential of Rs 550-600 crores. The expansion will be completed by Q1 FY27-28 and financed through debt and internal accruals. The company received positive anti-dumping duty findings from DGTR and won the ICC Acharya P.C. Ray award for indigenous technology development.",
            "Sentiment": "positive",
            "PublishDate": 1762951327829,
            "Source": "earnings"
        },
        {
            "Title": "Apcotex Industries Approves ₹210 Crore Capacity Expansion at Gujarat Facility",
            "Summary": "Apcotex Industries' Board of Directors approved a ₹210 crore capital expenditure plan for capacity expansion at its manufacturing facility in Valia, Gujarat. The expansion includes adding 37,000 MTPA of Synthetic Latex and 14,600 MTPA of Nitrile Rubber and Allied Products. The company currently operates with optimal capacity utilization across its existing facilities producing 1,03,000 MTPA Synthetic Latex, 7,000 MTPA High Styrene Rubber, 21,000 MTPA Nitrile Rubber and Allied Products, and 50,000 MTPA Nitrile Latex. The new capacity will be implemented in phases and is expected to come online by Q1 FY27. The investment will be funded through a combination of internal accruals and debt, with the expansion aimed at meeting growing demand and increasing sales in domestic and international markets.",
            "Sentiment": "positive",
            "PublishDate": 1762367867724,
            "Source": "stock"
        },
        {
            "Title": "Apcotex Industries Reports 130% Jump in Q2 Net Profit Despite Revenue Decline",
            "Summary": "Apcotex Industries reported net profit of 253 million rupees in Q2, marking a significant increase from 110 million rupees in the same quarter last year. However, revenue declined to 3.37 billion rupees from 3.51 billion rupees year-over-year. The company's EBITDA improved substantially to 406 million rupees compared to 275 million rupees in the previous year, with EBITDA margin expanding to 12.06% from 7.83%.",
            "Sentiment": "positive",
            "PublishDate": 1762335772339,
            "Source": "earnings"
        },
        {
            "Title": "Apcotex Industries Promoter Group Member Acquires Additional 370 Shares",
            "Summary": "Hiloni Ankur Choksey, a promoter group member of Apcotex Industries Limited, acquired 370 shares through open market purchase on November 7, 2022. Following this acquisition, her total shareholding increased to 1,900 shares, representing 0.004% of the company's equity share capital. The company has an equity share capital of Rs. 10.37 crore consisting of 5.18 crore equity shares of Rs. 2 each. The disclosure was made under SEBI regulations governing substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1761833788580,
            "Source": "corporate_action"
        },
        {
            "Title": "Apcotex Industries Reports 12% Revenue Growth to Rs 376 Crores in Q1 FY26",
            "Summary": "Apcotex Industries Limited reported operating revenue of Rs 376 crores for the quarter ended June 30, 2025, marking 12% year-on-year growth. Operating EBITDA reached Rs 39 crores with 22% year-on-year growth and improved margins at 10.3% compared to 9.45% in the previous year. Profit after tax stood at Rs 19 crores with a PAT margin of 5.11%. The company achieved its highest ever quarterly sales volumes with 25% year-on-year volume growth, driven primarily by export revenues which grew 37% and contributed 37% of total revenue. Capacity utilization reached 85% at the Taloja latex plant, 90% at the Valia Nitrile latex plant, and nearly 100% for NBR and other products. The company delivered consistent sales volume growth for six consecutive quarters. Management indicated plans for de-bottlenecking and expansion projects focusing on latex, SBR latex, styrene acrylics, and NBR products. However, Nitrile Latex margins remained challenging due to industry overcapacity, despite high capacity utilization. The company is pursuing an anti-dumping case for NBR products and has invested Rs 3.5 crores in a hybrid power project for its Gujarat plant.",
            "Sentiment": "positive",
            "PublishDate": 1754370197400,
            "Source": "earnings"
        },
        {
            "Title": "Apcotex Industries Reports Quarterly Results and Appoints New CFO",
            "Summary": "Apcotex Industries Limited approved audited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 37,576.41 lakhs, total income of Rs 37,840.77 lakhs, and net profit after tax of Rs 1,915.94 lakhs. Earnings per share stood at Rs 3.70. The Board also appointed Mr. Vivek Thakur as Chief Financial Officer effective July 30, 2025. Thakur is a Chartered Accountant with over 24 years of experience, including more than 13 years in the chemicals sector, and was previously CFO at Visen Industries Limited. The company operates in synthetic emulsion polymers business.",
            "Sentiment": "positive",
            "PublishDate": 1753869982106,
            "Source": "corporate_action"
        },
        {
            "Title": "Apcotex Industries Reports Strong Q1 Growth with Revenue Rising to 3.76 Billion Rupees",
            "Summary": "Apcotex Industries delivered robust quarterly performance with revenue increasing to 3.76 billion rupees from 3.4 billion rupees year-over-year. The company's EBITDA grew to 386 million rupees compared to 318 million rupees in the same period last year, while EBITDA margin improved to 10.3% from 9.43%. Net profit also showed strong growth, rising to 192 million rupees from 148 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1753869164026,
            "Source": "earnings"
        },
        {
            "Title": "Apcotex Industries Schedules Earnings Conference Call for July 31, 2025",
            "Summary": "Apcotex Industries Limited has scheduled an earnings conference call on July 31, 2025 at 2:00 PM IST to discuss financial performance for the quarter ended June 30, 2025. The call will be led by Mr. Abhiraj Choksey, Vice Chairman & Managing Director. Dial-in numbers have been provided for multiple regions including India, USA, UK, Singapore, and Hong Kong. The company has notified stock exchanges NSE and BSE about the scheduled call.",
            "Sentiment": "neutral",
            "PublishDate": 1753180689112,
            "Source": "earnings"
        },
        {
            "Title": "Apcotex Industries Schedules Board Meeting on July 30 to Approve Quarterly Financial Results",
            "Summary": "Apcotex Industries Limited has scheduled a Board of Directors meeting on July 30, 2025, to consider and approve the audited financial results for the quarter ended June 30, 2025. The company also reminded that the trading window for insiders remains closed until 48 hours after the financial results are declared.",
            "Sentiment": "neutral",
            "PublishDate": 1753179682547,
            "Source": "corporate_action"
        },
        {
            "Title": "Apcotex Industries Announces Dividend of ₹4.5 Per Share",
            "Summary": "Apcotex Industries has declared a dividend of ₹4.5 per share for its shareholders. This corporate action represents a distribution of the company's profits to its investors.",
            "Sentiment": "positive",
            "PublishDate": 1746609422000,
            "Source": "result"
        },
        {
            "Title": "Apcotex Industries Reports Q4 Financial Results",
            "Summary": "Apcotex Industries has released its Q4 financial results. The company's revenue increased to 3.5 billion rupees from 3.11 billion rupees year-over-year. EBITDA rose to 384 million rupees from 313 million rupees, with the EBITDA margin improving to 11% from 10.08%. Net profit also saw an increase, reaching 168 million rupees compared to 153 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1746609344000,
            "Source": "result"
        },
        {
            "Title": "Apcotex Industries to Consider Q4 Results on May 7",
            "Summary": "Apcotex Industries has announced that it will consider its fourth quarter (Q4) financial results on May 7. This indicates the company is preparing to release its earnings report for the latest fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746014664000,
            "Source": "default"
        },
        {
            "Title": "Apcotex Industries to Acquire 26% Stake in Opera Vayu Narmada",
            "Summary": "Apcotex Industries has announced plans to acquire a 26% equity stake in Opera Vayu Narmada for 33.8 million rupees. This strategic investment represents a significant corporate action that could potentially impact the company's future operations and financial position.",
            "Sentiment": "neutral",
            "PublishDate": 1743077105000,
            "Source": "corporate_action"
        },
        {
            "Title": "Apcotex Industries: Q3 Profit Rises 3.86% YoY, Revenue Up 38.24%",
            "Summary": "Apcotex Industries reported Q3 FY25 results with profit at ₹11.56 crore, up 3.86% YoY. Revenue increased 38.24% YoY to ₹355.27 crore. EPS stood at ₹2.23, up 3.72% YoY. Operating income declined 4.87% YoY. Analysts maintain a unanimous Buy recommendation.",
            "Sentiment": "positive",
            "PublishDate": 1738130633000,
            "Source": "earnings"
        },
        {
            "Title": "Apcotex Industries Reports Significant Revenue Growth in Q3",
            "Summary": "Apcotex Industries has announced its third quarter financial results, reporting a revenue of 3.55 billion rupees. This represents a substantial increase from the 2.57 billion rupees reported in the same quarter of the previous year, indicating strong year-over-year growth for the company.",
            "Sentiment": "positive",
            "PublishDate": 1738056567000,
            "Source": "earnings"
        },
        {
            "Title": "Apcotex Industries Reports Increase in Q3 Net Profit",
            "Summary": "Apcotex Industries has announced its financial results for the third quarter. The company reported a net profit of 116 million rupees, compared to 111 million rupees in the same period last year, showing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738056542000,
            "Source": "earnings"
        },
        {
            "Title": "Apcotex Industries Reports Mixed Q3 Results",
            "Summary": "Apcotex Industries has reported its Q3 financial results. The company's EBITDA increased to 271 million rupees from 254 million rupees year-over-year. However, the EBITDA margin decreased to 7.62% from 9.91% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738056542000,
            "Source": "earnings"
        },
        {
            "Title": "Apcotex Industries Reports Q2 EBITDA Decline",
            "Summary": "Apcotex Industries has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 275 million rupees, down from 317 million rupees in the same quarter last year. The EBITDA margin also decreased to 7.83% from 11.34% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1729763399000,
            "Source": "result"
        },
        {
            "Title": "Apcotex Industries Reports Q2 Revenue Growth",
            "Summary": "Apcotex Industries has reported a revenue of 3.51 billion rupees for the second quarter, compared to 2.79 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729763365000,
            "Source": "result"
        },
        {
            "Title": "Apcotex Industries Reports Q2 Net Profit Decline",
            "Summary": "Apcotex Industries has reported a net profit of 110 million rupees for the second quarter, down from 153 million rupees in the same period last year. This represents a year-over-year decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1729763342000,
            "Source": "result"
        }
    ]
}