{
    "Symbol": "APEX",
    "ISIN": "INE346W01013",
    "News": [
        {
            "Title": "Apex Frozen Foods schedules Q3&9MFY26 earnings call",
            "Summary": "Apex Frozen Foods Limited has scheduled its Q3&9MFY26 earnings call for February 16, 2026 at 11:30 AM IST to discuss financial performance for the third quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770653654037,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shrimp stocks surge on India-EU trade deal optimism",
            "Summary": "Indian seafood exporters including Apex Frozen Foods and Avanti Feeds gained up to 10% as India-EU trade agreement promises zero tariffs on marine products over seven years.",
            "Sentiment": "positive",
            "PublishDate": 1769510406573,
            "Source": "stocks"
        },
        {
            "Title": "Apex Frozen Foods Q2FY26 Revenue Rises 19% to INR 238 Crores Despite US Tariff Challenges",
            "Summary": "Apex Frozen Foods reported Q2FY26 net revenue growth of 19% year-on-year to INR 238 crores, driven by higher realizations of INR 870 per kilo (up 25%) and favorable exchange rates, though sales volumes declined marginally to 2,606 metric tonnes due to US tariff uncertainties. The company successfully diversified its business with non-US exports now accounting for 56% of sales in Q2FY26, while gross profit surged 76% year-on-year to INR 96 crores with improved margins of 39%.",
            "Sentiment": "positive",
            "PublishDate": 1763722426151,
            "Source": "earnings"
        },
        {
            "Title": "Apex Frozen Foods Reports Strong Q2 FY26 Results with 19% Revenue Growth",
            "Summary": "Apex Frozen Foods achieved 19% YoY revenue growth to Rs 2,383 Mn in Q2 FY26, driven by higher average realization of Rs 870 per kg for shrimp sales. The company significantly improved profitability with gross margin expanding to 39.2% from 27.2% and EBITDA margin rising to 7.2% from 2.3% in the previous year quarter.",
            "Sentiment": "positive",
            "PublishDate": 1763219695690,
            "Source": "earnings"
        },
        {
            "Title": "Apex Frozen Foods Schedules Q2 FY26 Earnings Call for November 17, 2025",
            "Summary": "Apex Frozen Foods Limited has scheduled a conference call on Monday, November 17, 2025, at 11:00 AM IST to discuss the company's financial performance for the second quarter and half year ended September 30, 2025. The earnings call will be led by Managing Director Mr. Choudary Karuturi and CFO Mr. P. Durga Prasad, along with Sr. Manager Accounts. The company has provided dial-in details for participants from multiple countries including India, Hong Kong, Singapore, UK, and USA. Stellar IR Advisors Pvt Ltd is coordinating the call arrangements.",
            "Sentiment": "neutral",
            "PublishDate": 1762932575724,
            "Source": "earnings"
        },
        {
            "Title": "Apex Frozen Foods Reports Strong Q2 Turnaround with 119 Million Rupees Net Profit",
            "Summary": "Apex Frozen Foods delivered a significant turnaround in Q2 results, posting a net profit of 119 million rupees compared to a loss of 17 million rupees in the same period last year. Revenue grew to 2.38 billion rupees from 1.99 billion rupees year-over-year. EBITDA increased substantially to 113.9 million rupees from 39.5 million rupees, while EBITDA margin improved to 4.78% from 1.98% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762733548335,
            "Source": "earnings"
        },
        {
            "Title": "Apex Frozen Foods Reports Strong Q2 Performance with 19% Revenue Growth",
            "Summary": "Apex Frozen Foods Limited reported revenue from operations of ₹238.34 crores for the quarter ended September 30, 2025, compared to ₹199.52 crores in the same quarter last year. The company posted a net profit of ₹11.87 crores versus a loss of ₹1.67 crores in the corresponding quarter of the previous year. For the half-year period, revenue increased to ₹496.50 crores from ₹385.51 crores, with net profit rising to ₹20.97 crores from ₹2.13 crores. The company recorded exceptional items of ₹2.53 crores related to IEIS License granted for earlier years. Export benefits included in revenue were ₹11.58 crores for the quarter and ₹25.19 crores for the half-year. Earnings per share improved to ₹3.80 for the quarter from a loss of ₹0.53 per share in the same period last year. The company declared a final dividend of ₹2 per equity share for the financial year 2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1762587005307,
            "Source": "earnings"
        },
        {
            "Title": "Apex Frozen Foods Surges 20% on EU Export Approval for Indian Fishery Establishments",
            "Summary": "Apex Frozen Foods shares jumped 20% and hit upper circuit limits following the European Union's approval of 102 new Indian fishery establishments for exports. This represents the stock's biggest single-day gain since July 2021. The EU approval could increase Indian export establishments by 16% in volume terms and addresses a long-standing demand from India. Apex Frozen Foods has seen growing EU contribution to its revenue, with the region accounting for 39% of topline in financial year 2025 compared to 26% in financial year 2024. The company reported robust EU demand and continues strengthening its market presence there. Analysts expect the move to benefit shrimp processing companies including Apex Frozen, Avanti Feeds, and Coastal Corporation, with potential margin improvements expected in financial year 2027. The stock traded at ₹261.45, near its 52-week high of ₹281.7, and saw exceptional trading volume with 62 lakh shares changing hands in two hours versus the 50-day average of just over 50,000 shares.",
            "Sentiment": "positive",
            "PublishDate": 1757489056344,
            "Source": "stock"
        },
        {
            "Title": "Apex Frozen Foods Announces Book Closure for AGM and Dividend Eligibility",
            "Summary": "Apex Frozen Foods Limited has declared a book closure period from September 23, 2025 to September 29, 2025. The closure serves two purposes: conducting the company's 13th Annual General Meeting scheduled for September 29, 2025, and determining shareholder eligibility for the 2024-25 dividend. The dividend has been recommended by the board and is subject to shareholder approval at the AGM. The company trades on BSE with scrip code 540692 and on NSE with symbol APEX.",
            "Sentiment": "neutral",
            "PublishDate": 1757229558662,
            "Source": "corporate_action"
        },
        {
            "Title": "Apex Frozen Foods Sets Record Date for Final Dividend of Rs. 2.00 Per Share",
            "Summary": "Apex Frozen Foods Limited has fixed September 19, 2025 as the record date for determining shareholder eligibility for a final dividend of 20% (Rs. 2.00 per equity share) for the 2024-25 financial year. The dividend is subject to shareholder approval at the upcoming Annual General Meeting. If approved, the dividend will be paid on or before October 28, 2025, subject to applicable tax deductions at source.",
            "Sentiment": "positive",
            "PublishDate": 1757228572576,
            "Source": "corporate_action"
        },
        {
            "Title": "Apex Frozen Foods Board Approves Leadership Reappointments and Increases Managerial Remuneration Limit",
            "Summary": "Apex Frozen Foods' Board approved the continuation of Karuturi Satyanarayana Murthy as Executive Chairman beyond age 70 and his reappointment for five years from December 1, 2025 to November 30, 2030. The Board also approved the reappointment of Karuturi Subrahmanya Chowdary as Managing Director for the same period. Additionally, the company approved reappointments of Neelima Devi Karuturi as Whole-time Director from February 1, 2026 to January 31, 2031, and two independent directors for second five-year terms. The Board increased the overall limit of maximum managerial remuneration from 16% to 26% of net profits. The company scheduled its 13th Annual General Meeting for September 29, 2025 via video conferencing and appointed A S Ramkumar & Associates as Secretarial Auditors for five years. All appointments are subject to shareholder approval at the upcoming AGM.",
            "Sentiment": "positive",
            "PublishDate": 1757164929038,
            "Source": "corporate_governance"
        },
        {
            "Title": "Apex Frozen Foods Makes Q1 FY2026 Earnings Call Audio Recording Available Online",
            "Summary": "Apex Frozen Foods Limited has made the audio recording of their investors' conference call available on their company website. The call, held on August 18, 2025 at 11:30 AM IST, discussed the company's unaudited financial results for Q1 ended June 30, 2025. The company is listed on both BSE (scrip code 540692) and NSE (symbol APEX), with Karuturi Subrahmanya Chowdary serving as Managing Director. The disclosure was made in compliance with SEBI regulations 30 and 46(2)(ao) of the Listing Obligations and Disclosure Requirements Regulations, 2015. Investors can access the recording at www.apexfrozenfoods.in.",
            "Sentiment": "neutral",
            "PublishDate": 1755526155747,
            "Source": "earnings"
        },
        {
            "Title": "Apex Frozen Foods Reports Strong Q1 FY26 Results with 39% Revenue Growth",
            "Summary": "Apex Frozen Foods Limited, a leading Indian shrimp exporter, delivered robust Q1 FY26 performance with net revenue growing 39% year-on-year to Rs 258.2 crore. The company's profit after tax surged 139% to Rs 9.1 crore, while EBITDA increased 66% to Rs 18.4 crore. Key operational metrics showed total shrimp sales volume grew 17% to 3,015 MT with average realization improving 19% to Rs 811 per kg. The company expanded its Ready-to-Eat product share to 15% of total sales compared to 9% in the previous year. Sales to the USA grew 18% and European Union sales increased 22%. Gross margin improved to 33.7%, up 164 basis points year-on-year, while EBITDA margin expanded to 7.1%. The company operates with an integrated business model including hatchery operations, processing capacity of 34,240 MTPA, and exports primarily to USA, European Union, and China markets.",
            "Sentiment": "positive",
            "PublishDate": 1755152521438,
            "Source": "earnings"
        },
        {
            "Title": "Apex Frozen Foods Reports Strong Q1 Performance with 139% Jump in Net Profit",
            "Summary": "Apex Frozen Foods delivered robust quarterly results with net profit surging to 91 million rupees from 38 million rupees in the same period last year. Revenue grew significantly to 2.58 billion rupees compared to 1.85 billion rupees year-over-year. The company's EBITDA increased to 155 million rupees from 107 million rupees, while EBITDA margin improved to 5.98% from 5.75% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754912160081,
            "Source": "earnings"
        },
        {
            "Title": "Seafood Export Association Seeks Financial Support After $2 Billion Shrimp Export Disruption from Tariff Increase",
            "Summary": "The Seafood Export Association has requested immediate financial support following a $2 billion disruption in shrimp exports. The disruption was caused by a tariff increase implemented by President Trump. Apex Frozen Foods appears to be connected to this development in the seafood export sector.",
            "Sentiment": "negative",
            "PublishDate": 1754835678551,
            "Source": "stock"
        },
        {
            "Title": "Apex Frozen Foods Shares Jump Over 6% on India-UK Free Trade Agreement Benefits",
            "Summary": "Apex Frozen Food Ltd. shares surged over 6% following the signing of the India-UK Free Trade Agreement, which provides zero-duty access for 99% of marine exports. The Comprehensive Economic and Trade Agreement was signed in London with Prime Minister Narendra Modi and British counterpart Keir Starmer present. Under the agreement, shrimp, tuna, fishmeal, and feeds—previously taxed between 4.2–8.5%—will become completely duty-free. Apex Frozen shares rose as much as 6.61% to Rs 260 before settling 5.08% higher at Rs 256.27. The stock has declined 12.10% over the past 12 months and 5.92% year-to-date, with trading volume at 0.06 times its 30-day average.",
            "Sentiment": "positive",
            "PublishDate": 1753428623590,
            "Source": "stock"
        },
        {
            "Title": "Apex Frozen Foods Reports Q4 Profit and Recommends Dividend",
            "Summary": "Apex Frozen Foods reported a net profit of 20 million rupees in Q4, compared to a loss of 3.6 million rupees in the same quarter last year and a loss of 2 million rupees in the previous quarter. The company's revenue for Q4 was 1.97 billion rupees, up from 1.62 billion rupees in the same period last year. Additionally, the company has recommended a dividend of 2 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748559789000,
            "Source": "default"
        },
        {
            "Title": "Apex Frozen Foods Reports Q4 Results and Announces Dividend",
            "Summary": "Apex Frozen Foods has recommended a dividend of 2 rupees per equity share. For Q4, the company reported an EBITDA of 66 million rupees, up from 14 million rupees year-over-year. The EBITDA margin improved to 3.34% from 0.84% in the same period last year. The company posted a net profit of 20 million rupees in Q4, compared to a loss of 3.6 million rupees year-over-year and a loss of 2 million rupees quarter-over-quarter. Q4 revenue stood at 1.97 billion rupees, up from 1.62 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748523638000,
            "Source": "result"
        },
        {
            "Title": "Apex Frozen Reports Mixed Q3 Results",
            "Summary": "Apex Frozen has reported its Q3 financial results. The company's net loss narrowed to 2 million rupees, compared to a loss of 30 million rupees in the same quarter last year. Revenue showed significant growth, increasing to 2.3 billion rupees from 1.4 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738542295000,
            "Source": "earnings"
        },
        {
            "Title": "Apex Frozen Foods Reports Q3 Financial Results",
            "Summary": "Apex Frozen Foods has reported its Q3 financial results. The company's net loss has decreased to 2 million rupees from 30 million rupees in the same quarter last year. Revenue has significantly increased to 2.3 billion rupees from 1.4 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738518766000,
            "Source": "earnings"
        }
    ]
}