{
    "Symbol": "APLAPOLLO",
    "ISIN": "INE702C01027",
    "News": [
        {
            "Title": "APL Apollo Tubes Block Trade Worth Rs. 27.63 Crores",
            "Summary": "APL Apollo Tubes Ltd. witnessed a significant NSE block trade worth Rs. 27.63 crores involving 126,306 shares at Rs. 2187.40 per share, indicating institutional interest in the steel tubes manufacturer.",
            "Sentiment": "neutral",
            "PublishDate": 1770360455114,
            "Source": "co_actions_results"
        },
        {
            "Title": "APL Apollo Tubes Posts Strong Q3 Results",
            "Summary": "APL Apollo Tubes reported robust Q3 performance with volumes rising to 917 kt and VAP share increasing to 57%. Management raised FY27 EBITDA guidance to ₹5,500 per tonne and volume growth target to 20%.",
            "Sentiment": "positive",
            "PublishDate": 1769143671405,
            "Source": "co_actions_results"
        },
        {
            "Title": "APL Apollo Plans 60% Capacity Boost in Two Years",
            "Summary": "APL Apollo Tubes announces aggressive expansion plan to increase capacity from current 5 million tons to 8 million tons within two years, targeting 10 million tons by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1769136570472,
            "Source": "stocks"
        },
        {
            "Title": "APL Apollo Tubes Q3 Net Profit Surges 42.86% YoY",
            "Summary": "APL Apollo Tubes reports consolidated net profit of ₹3.10 billion for Q3, marking significant growth from ₹2.17 billion in the corresponding quarter of previous year, reflecting strong operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1769070239090,
            "Source": "co_actions_results"
        },
        {
            "Title": "APL Apollo Tubes Q3FY26 earnings call on Jan 22",
            "Summary": "APL Apollo Tubes Limited has scheduled its Q3FY26 earnings call for January 22, 2026 at 4:30 PM IST to discuss financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768476557920,
            "Source": "co_actions_results"
        },
        {
            "Title": "APL Apollo Tubes Block Trade Worth ₹53.49 Crores",
            "Summary": "APL Apollo Tubes witnessed a significant NSE block trade of ₹53.49 crores involving 282,816 shares at ₹1,891.40 per share, indicating substantial institutional activity in the steel tubes manufacturer.",
            "Sentiment": "neutral",
            "PublishDate": 1768295975777,
            "Source": "co_actions_results"
        },
        {
            "Title": "APL Apollo Issues ₹200 Cr Commercial Paper at 6.20%",
            "Summary": "APL Apollo Tubes Limited has issued commercial papers worth ₹200 crores with a 68-day tenure at 6.20% interest rate, maturing on March 18, 2026, and rated [ICRA] A1+.",
            "Sentiment": "neutral",
            "PublishDate": 1767945023806,
            "Source": "co_actions_results"
        },
        {
            "Title": "Motilal Oswal Sets ₹2,260 Target for APL Apollo",
            "Summary": "Motilal Oswal maintains BUY rating on APL Apollo Tubes with target price of ₹2,260, citing 11% YoY volume growth in Q3FY26 and strong market leadership position despite HRC price volatility.",
            "Sentiment": "positive",
            "PublishDate": 1767942418268,
            "Source": "stocks"
        },
        {
            "Title": "Motilal Oswal Raises APL Apollo Target to ₹2,260",
            "Summary": "Motilal Oswal maintains Buy rating on APL Apollo Tubes with revised target price of ₹2,260, up from previous target of ₹2,100, indicating positive outlook for the steel tube manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1767930855131,
            "Source": "stocks"
        },
        {
            "Title": "APL Apollo Tubes Block Trade Worth ₹16.75 Crores",
            "Summary": "APL Apollo Tubes witnessed a significant NSE block trade of ₹16.75 crores involving 86,194 shares at ₹1,943 per share, indicating substantial institutional activity in the steel tubes manufacturer.",
            "Sentiment": "neutral",
            "PublishDate": 1767775302122,
            "Source": "co_actions_results"
        },
        {
            "Title": "APL Apollo Tubes Sees ₹39.35 Cr Block Trade",
            "Summary": "APL Apollo Tubes witnessed a significant block trade worth ₹39.35 crores on NSE, involving 200,037 shares at ₹1,967 per share, indicating substantial institutional activity in the steel tubes manufacturer.",
            "Sentiment": "neutral",
            "PublishDate": 1767672955285,
            "Source": "co_actions_results"
        },
        {
            "Title": "APL Apollo posts record Q3 volumes, sales rise 11% YoY",
            "Summary": "APL Apollo Tubes achieved highest-ever quarterly sales volume of 916,976 tonnes in Q3FY26, up 11% YoY and 7% QoQ, with broad-based growth across product categories and strong nine-month performance.",
            "Sentiment": "positive",
            "PublishDate": 1767250916982,
            "Source": "co_actions_results"
        },
        {
            "Title": "APL Apollo Tubes Forms VCP Pattern, Eyes ₹2,100 Target",
            "Summary": "APL Apollo Tubes consolidates around 100-day EMA for a month, forming rounding bottom pattern. Stock breaks out from 2-month consolidation with bullish momentum targeting ₹2,100.",
            "Sentiment": "positive",
            "PublishDate": 1766589506303,
            "Source": "stocks"
        },
        {
            "Title": "APL Apollo Tubes Reports Record Quarterly Performance with EBITDA Spread Above INR 5,000 Per Ton",
            "Summary": "APL Apollo Tubes Limited announced record quarterly volume, EBITDA, and PAT financials for Q2 FY26 despite challenging market conditions including heavy monsoons and weak construction activity. The company achieved EBITDA spreads above INR 5,000 per ton, driven by brand power demonstration in general category products (EBITDA doubled to INR 3,400 per ton), value-added mix improvement from Raipur and Dubai plants (EBITDA above INR 5,500-6,000 per ton), and operating leverage gains from 850,000+ ton volume. Management maintains guidance of 10-15% volume growth and EBITDA spread of INR 4,600-5,000 per ton for the year. The company operates at 70% capacity utilization across 5 million ton capacity and plans to expand by 7 million tons over the next 2-3 years, including 1 million ton capacity in Middle East and 6 million ton in India. Working capital days remain at zero as of September 2025, boosting ROCE to 32-33%. The expansion will be funded entirely through internal cash flows.",
            "Sentiment": "positive",
            "PublishDate": 1761991005681,
            "Source": "earnings"
        },
        {
            "Title": "APL Apollo Tubes Sets Ambitious Growth Targets with EBITDA Per Ton Expected to Reach INR 6,000",
            "Summary": "APL Apollo Tubes announced its future EBITDA per ton target of INR 6,000, with a strategic focus on heavy construction and renewable sector products. The company aims for EBITDA of ₹450 crore in Q3 and Q4, and sees potential to exceed forecasts if GDP conditions improve. For FY26, APL Apollo targets 10-15% growth in volume with EBITDA of ₹4,600-5,000 per ton. The company expects monthly volume of 325,000 tons and total volume of 900,000 tons for Q3 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1761794659360,
            "Source": "stock"
        },
        {
            "Title": "APL Apollo Tubes Chairman Expects Stronger Performance in Second Half of FY26",
            "Summary": "APL Apollo Tubes' Chairman stated the company is prepared with its capacity, diversified product portfolio, distribution network and strong brand pull. The Chairman expressed expectations that the second half of FY26 will perform much better than the first half of FY26.",
            "Sentiment": "positive",
            "PublishDate": 1761729927300,
            "Source": "stock"
        },
        {
            "Title": "APL Apollo Tubes Reports Strong Q2 Growth with Revenue Rising to 52B Rupees",
            "Summary": "APL Apollo Tubes reported quarterly revenue of 52 billion rupees compared to 47.7 billion rupees in the same period last year. The company's EBITDA increased significantly to 4.47 billion rupees from 1.38 billion rupees year-over-year, with EBITDA margin expanding to 8.59% from 2.89%. Consolidated net profit rose substantially to 3.02 billion rupees versus 538 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761728726546,
            "Source": "earnings"
        },
        {
            "Title": "APL Apollo Tubes Issues Rs 100 Crore Commercial Paper with 6.02% Interest Rate",
            "Summary": "APL Apollo Tubes Limited issued Commercial Papers worth Rs 100 crores with a 71-day tenure, maturing on December 23, 2025. The commercial papers carry an interest rate of 6.02% and have been rated [ICRA] A1+. The papers were allotted on October 13, 2025, and issued in favor of Kotak Mahindra Bank Ltd. The Commercial Papers will be listed on BSE Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1760348670508,
            "Source": "corporate_action"
        },
        {
            "Title": "Apl Apollo Tubes Reports 855,037 Tons Sales Volume in Q2 FY26",
            "Summary": "Apl Apollo Tubes reported sales volume of 855,037 tons in Q2 FY26, representing an increase from 794,350 tons in Q1 FY26 and 758,267 tons in Q2 FY25. The quarterly results show sequential growth of approximately 7.6% compared to the previous quarter and year-over-year growth of about 12.8%.",
            "Sentiment": "positive",
            "PublishDate": 1759300988621,
            "Source": "stock"
        },
        {
            "Title": "APL Apollo Tubes Appoints Walker Chandiok & Co. LLP as New Statutory Auditors for Five-Year Term",
            "Summary": "APL Apollo Tubes Limited has appointed M/s Walker Chandiok & Co. LLP as their new Statutory Auditors for a five-year term from September 15, 2025, to 2030. This follows the completion of M/s. Deloitte Haskins and Sells LLP's second consecutive five-year term, which ended at the company's 40th Annual General Meeting on September 15, 2025. The appointment was approved by members at the AGM. Walker Chandiok & Co. LLP, established in 1935 and converted to LLP in 2014, operates from 15 locations in India with 70 partners and over 2,215 personnel. The firm is registered with ICAI, empaneled with PCAOB and CAG, and is considered one of the four largest audit firms in India with many NSE top 250 companies as clients.",
            "Sentiment": "neutral",
            "PublishDate": 1758029588744,
            "Source": "corporate_governance"
        },
        {
            "Title": "Deloitte Resigns as Statutory Auditor of APL Apollo Building Products Limited",
            "Summary": "Deloitte Haskins & Sells LLP has resigned as statutory auditor of APL Apollo Building Products Limited, a material subsidiary of Apollo Tubes Limited, effective August 11, 2025. The auditing firm was originally appointed to serve from September 30, 2023, until the conclusion of the 9th Annual General Meeting, covering a five-year term from April 1, 2023, to March 31, 2028. Deloitte completed the statutory audit for the year ended March 31, 2025, and issued their audit report on May 6, 2025. The resignation comes as Deloitte's term as statutory auditor for the parent company Apollo Tubes Limited is set to conclude at its 40th Annual General Meeting expected in August/September 2025. The company cited operational efficiency, synergies with the holding company's audit firm, and maintaining consistency in the audit process as reasons for aligning with the holding company's new statutory auditor. Deloitte confirmed no material concerns led to their resignation and stated they had not commenced the audit for the year ending March 31, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1754922895069,
            "Source": "corporate_governance"
        },
        {
            "Title": "APL Apollo Tubes Reports Below-Expected Q1 Performance, Revises FY26 Volume Growth Guidance to 10-15%",
            "Summary": "APL Apollo Tubes held its quarterly earnings call discussing performance that fell short of expectations. Sales volume was lower by at least 5% due to macro environment slowdown, geopolitical tensions including India-Pakistan and Middle East conflicts, early monsoon onset, and reduced money supply affecting dealer buying power. EBITDA spreads declined quarter-on-quarter by Rs. 250 per ton due to lower volumes and Rs. 100 per ton impact from ESOP expenses. The company revised its full-year volume growth guidance from 15-20% to 10-15%, while maintaining EBITDA spread guidance of Rs. 4,600-5,000 per ton. Management continues its brand premium strategy focusing on maintaining margins rather than chasing volumes. The company is expanding capacity from 4.5-5 million tons to 7 million tons over the next 2-3 years through new plants in Eastern India, Dubai, South India, and Bhuj. APL Apollo achieved 72% renewable energy consumption and maintains a net cash position with single-digit working capital days.",
            "Sentiment": "negative",
            "PublishDate": 1753507957229,
            "Source": "earnings"
        },
        {
            "Title": "APL Apollo Tubes Revises FY26 Growth Forecast Downward, Sets Long-Term EBITDA Targets",
            "Summary": "APL Apollo Tubes has reduced its volume growth forecast for FY26 to 10-15% from the previously projected 15-20%, citing slower performance in the first half of the year. The company has also updated its EBITDA spread guidance to Rs. 4,600-5,000 per tonne for FY26. Looking ahead, the company believes growth could exceed 15-20% in FY27 if economic conditions improve. APL Apollo has set a long-term EBITDA per tonne target of Rs. 5,500-6,000.",
            "Sentiment": "neutral",
            "PublishDate": 1753414624742,
            "Source": "stock"
        },
        {
            "Title": "APL Apollo Tubes Reports Q1FY26 Results with 10% Volume Growth and 23% EBITDA Increase",
            "Summary": "APL Apollo Tubes Limited announced quarterly results with sales volume of 794,350 tons (10% YoY growth, 7% QoQ decline) and revenue of Rs 51.7 billion (4% YoY increase, 6% QoQ decrease). EBITDA grew 23% YoY to Rs 3.7 billion with EBITDA per ton at Rs 4,683. Net profit increased 23% YoY to Rs 2.4 billion. The company's board approved three new director appointments: Chakram Kumar Singh as Director & COO, and independent directors Dukhabandhu Rath and Rakesh Sharma. The board terminated the existing employee stock option scheme from 2015 and instituted a new stock option plan for 2025 covering 5 million options. Chairman Sanjay Gupta cited challenging demand conditions due to macroeconomic environment, geopolitical tensions, and early monsoon impact on construction, but expects improvement in the second half of the financial year.",
            "Sentiment": "neutral",
            "PublishDate": 1753350724839,
            "Source": "corporate_action"
        },
        {
            "Title": "APL Apollo Tubes Reports 26% Jump in Q1 Net Profit to 2.4 Billion Rupees",
            "Summary": "APL Apollo Tubes reported consolidated net profit of 2.4 billion rupees in Q1, up from 1.9 billion rupees in the same period last year. Revenue increased to 51.7 billion rupees from 49.74 billion rupees year-over-year. EBITDA rose to 3.7 billion rupees compared to 3.02 billion rupees previously, with EBITDA margin improving to 7.2% from 6.06% in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1753349339768,
            "Source": "earnings"
        },
        {
            "Title": "APL Apollo Reports Q1 Sales Volume of 794,350 Tons",
            "Summary": "APL Apollo has reported its sales volume for the first quarter. The company achieved a sales volume of 794,350 tons, which represents a 10% year-over-year increase. However, this figure is 7% lower compared to the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1751353189000,
            "Source": "default"
        },
        {
            "Title": "APL Apollo Tubes Ltd. Block Trade on NSE",
            "Summary": "A block trade of APL Apollo Tubes Ltd. shares occurred on the National Stock Exchange (NSE). The trade involved approximately 106,207 shares at a price of Rs. 1789.30 per share, totaling Rs. 19.00 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1750915136000,
            "Source": "block_details"
        },
        {
            "Title": "APL Apollo Tubes Announces Expansion Plans and Growth Targets",
            "Summary": "APL Apollo Tubes has revealed plans to increase its production capacity from 5 million tonnes to 7 million tonnes over the next three years, with a capex of Rs 15 billion. The company is entering the super specialty tubes market with a 250,000-tonne capacity across four categories, investing Rs 300-400 crore. They also plan to increase capacity in the heavy segment by 100,000 tonnes. The company expects to maintain a 20% year-over-year volume growth for the next 3-4 years and anticipates improved EBITDA margins driven by new geographies, products, and better sales mix. Their FY26 guidance is around Rs 5,000 per tonne.",
            "Sentiment": "positive",
            "PublishDate": 1746674188000,
            "Source": "default"
        },
        {
            "Title": "APL Apollo Tubes: Q4 Profit Soars 72%, ₹1,500 Cr Capex Approved",
            "Summary": "APL Apollo Tubes reported a 72% YoY increase in Q4 net profit to ₹293 crore. Revenue rose 15.6% to ₹5,509 crore. The board approved a ₹1,500 crore capex plan to increase production capacity from 4.5 to 6.8 million tonnes. A final dividend of ₹5.75 per share was declared for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1746613102000,
            "Source": "earnings"
        },
        {
            "Title": "APL Apollo Tubes Revises FY25 Sales Volume Guidance",
            "Summary": "APL Apollo Tubes has updated its sales volume guidance for the fiscal year 2025. The company now expects sales volume to reach 3.16 million tons, slightly lower than the previously announced guidance of 3.2 million tons for FY '25.",
            "Sentiment": "neutral",
            "PublishDate": 1746611745000,
            "Source": "result"
        },
        {
            "Title": "APL Apollo Tubes Announces Expansion Plans and Q4 Results",
            "Summary": "APL Apollo Tubes has approved a capex plan of ₹1500 crore over the next three years, which will increase its overall capacity from 4.5 MT to 6.8 MT. The company has declared a dividend of ₹5.75 per share. For Q4, the company reported revenue of ₹55.09 billion, up from ₹47.65 billion year-over-year. Q4 EBITDA increased to ₹4.14 billion from ₹2.8 billion, with EBITDA margin improving to 7.5% from 5.88% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1746611132000,
            "Source": "result"
        },
        {
            "Title": "APL Apollo Tubes Reports Strong Q4 Profit Growth",
            "Summary": "APL Apollo Tubes has announced its Q4 consolidated net profit, which has increased to 2.93 billion rupees from 1.70 billion rupees in the same period last year. This represents a significant year-over-year growth in the company's profitability.",
            "Sentiment": "positive",
            "PublishDate": 1746610885000,
            "Source": "result"
        },
        {
            "Title": "APL Apollo Tubes Reports Record Q4 Sales Volume",
            "Summary": "APL Apollo Tubes has achieved its highest ever quarterly sales volume of 850,447 tons in Q4 of fiscal year 2025. This record-breaking performance indicates strong demand for the company's products and potential growth in the steel tubes sector.",
            "Sentiment": "positive",
            "PublishDate": 1743482509000,
            "Source": "result"
        },
        {
            "Title": "APL Apollo Tubes Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade occurred for APL Apollo Tubes Ltd. on the National Stock Exchange (NSE). The transaction involved approximately 231,271 shares, valued at Rs. 32.26 crores. The trade was executed at a price of Rs. 1394.95 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1741838190000,
            "Source": "block_deals"
        },
        {
            "Title": "APL Apollo Tubes Reports Mixed Q3 Financial Results",
            "Summary": "APL Apollo Tubes has announced its Q3 financial results. The company's EBITDA increased to 3.45 billion rupees from 2.79 billion rupees year-over-year, showing a significant improvement. However, the EBITDA margin decreased slightly to 6.35% from 6.68% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1737364778000,
            "Source": "earnings"
        },
        {
            "Title": "APL Apollo Tubes Reports Strong Q3 Revenue Growth",
            "Summary": "APL Apollo Tubes has announced its third-quarter revenue results, showing significant year-over-year growth. The company reported revenue of 54.3 billion rupees for Q3, compared to 41.8 billion rupees in the same quarter of the previous year. This represents a substantial increase in the company's top-line performance.",
            "Sentiment": "positive",
            "PublishDate": 1737364752000,
            "Source": "earnings"
        },
        {
            "Title": "APL Apollo Tubes Reports 31.5% Increase in Q3 Consolidated Net Profit",
            "Summary": "APL Apollo Tubes has announced its financial results for the third quarter, reporting a consolidated net profit of 2.17 billion rupees. This represents a significant increase of 31.5% compared to the 1.65 billion rupees reported in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1737364715000,
            "Source": "earnings"
        },
        {
            "Title": "APL Apollo Tubes to Consider Q3 Results",
            "Summary": "APL Apollo Tubes has announced that it will consider its financial results for the third quarter on January 20. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1736777929000,
            "Source": "earnings"
        },
        {
            "Title": "APL Apollo Tubes: Record Q3 Sales Volume Surges 37% Year-on-Year",
            "Summary": "APL Apollo Tubes Limited achieved its highest-ever quarterly sales volume of 828,200 tons in Q3FY25, up 37% year-on-year and 9% quarter-on-quarter. Nine-month FY25 sales totaled 2,307,531 tons, a 19% year-over-year increase. Growth was led by Apollo Structural General products at 360,326 tons and Apollo Z Rust-proof at 165,635 tons.",
            "Sentiment": "positive",
            "PublishDate": 1735720792000,
            "Source": "earnings"
        },
        {
            "Title": "APL Apollo Tubes Reports Record Sales Volume",
            "Summary": "APL Apollo Tubes has achieved its highest ever sales volume of 828,200 tons, compared to 603,659 tons in the same period last year, representing a significant year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1735717225000,
            "Source": "result"
        },
        {
            "Title": "APL Apollo Tubes Ltd: Block Trade of 152,880 Shares Worth Rs. 22.92 Crores",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) involving APL Apollo Tubes Ltd. The transaction comprised approximately 152,880 shares, valued at Rs. 22.92 crores. The shares were traded at a price of Rs. 1,499.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1732611609000,
            "Source": "block_deals"
        },
        {
            "Title": "APL Apollo Tubes Ltd: Block Trade of 201,140 Shares Worth Rs. 29.36 Crores",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) involving APL Apollo Tubes Ltd. Approximately 201,140 shares of the company were traded at a price of Rs. 1459.65 per share, resulting in a total transaction value of Rs. 29.36 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1732509149000,
            "Source": "block_deals"
        },
        {
            "Title": "APL Apollo Tubes Expects to Exceed FY '26 Production Guidance",
            "Summary": "APL Apollo Tubes has announced that it anticipates surpassing its previously set production guidance of 3.2 million tons for the fiscal year 2026. This expectation is contingent on the company meeting its targets for the second half of the current fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1730258884000,
            "Source": "corporate_action"
        },
        {
            "Title": "APL Apollo Tubes Expects Margin Expansion",
            "Summary": "APL Apollo Tubes anticipates its margin to increase to a normalized level of INR 5,000 per ton over the next two to three quarters. The company expects this margin level to be sustainable throughout FY '26 on a quarter-on-quarter basis, as reported in a recent conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1730258617000,
            "Source": "corporate_action"
        },
        {
            "Title": "APL Apollo Tubes Reports Significant Drop in Q2 EBITDA",
            "Summary": "APL Apollo Tubes experienced a substantial decline in its Q2 EBITDA, which fell to 1.38 billion rupees from 3.25 billion rupees year-over-year. The company's EBITDA margin also decreased significantly, dropping to 2.89% from 7.24% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730191227000,
            "Source": "result"
        },
        {
            "Title": "APL Apollo Tubes Reports Q2 Revenue Growth",
            "Summary": "APL Apollo Tubes has reported a revenue of 47.7 billion rupees for the second quarter, compared to 46.3 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730191111000,
            "Source": "result"
        },
        {
            "Title": "APL Apollo Tubes Reports Significant Decrease in Q2 Net Profit",
            "Summary": "APL Apollo Tubes, a leading steel products manufacturer, has reported a consolidated net profit of 540 million rupees for the second quarter, marking a substantial decrease from 2.03 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730191087000,
            "Source": "result"
        },
        {
            "Title": "APL Apollo Tubes: Record Q2 Sales Volume Boosts Stock",
            "Summary": "<p>APL Apollo Tubes reported its <span class='positive'>highest-ever</span> quarterly sales volume of <b>7.58 lakh tonnes</b> in Q2FY25, up from 7.21 lakh tonnes in Q1FY25 and 6.74 lakh tonnes in Q2FY24. <br/> H1FY25 sales volume <span class='positive'>increased 11%</span> year-on-year to <b>14.79 lakh tonnes</b>. The stock <span class='positive'>rose 2.35%</span> to ₹1,621.30 following the announcement.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727776698000,
            "Source": "result"
        }
    ]
}