{
    "Symbol": "APLLTD",
    "ISIN": "INE901L01018",
    "News": [
        {
            "Title": "Alembic Pharma Q3FY26: Revenue up 10.8% YoY",
            "Summary": "Alembic Pharmaceuticals reported consolidated revenue of Rs 1,876.31 crore for Q3FY26, up 10.8% YoY. Net profit stood at Rs 132.97 crore with EPS of Rs 6.76. Company appointed Rajkumar Baheti as Non-Executive Director.",
            "Sentiment": "positive",
            "PublishDate": 1770302384487,
            "Source": "co_actions_results"
        },
        {
            "Title": "Alembic Pharmaceuticals Announces Director Retirement",
            "Summary": "Alembic Pharmaceuticals Limited informed stock exchanges about the superannuation of Mr. Ashok Pandya, Resident Director, effective January 31st, 2026 after business hours.",
            "Sentiment": "neutral",
            "PublishDate": 1769867238009,
            "Source": "stocks"
        },
        {
            "Title": "Alembic Pharma Board Meet Set for Feb 5, 2026",
            "Summary": "Alembic Pharmaceuticals has scheduled a board meeting on February 5, 2026, to consider and approve Q3 FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768885648054,
            "Source": "co_actions_results"
        },
        {
            "Title": "Alembic Gets USFDA Tentative Nod for Bosutinib Tablets",
            "Summary": "Alembic Pharmaceuticals receives USFDA tentative approval for Bosutinib Tablets 400mg, targeting $251 million market. Company now holds 232 total ANDA approvals from USFDA.",
            "Sentiment": "positive",
            "PublishDate": 1768200536990,
            "Source": "stocks"
        },
        {
            "Title": "Alembic Pharma Files Writ Petition Against ₹421.68 Cr Bill",
            "Summary": "Alembic Pharmaceuticals has filed a writ petition with Gujarat High Court challenging supplementary invoices worth ₹421.68 crores from MGVCL related to rooftop solar PV system installation.",
            "Sentiment": "negative",
            "PublishDate": 1765881792504,
            "Source": "stocks"
        },
        {
            "Title": "Alembic Pharma Executive Prashant Khandelwal to Resign from International Business Role",
            "Summary": "Prashant Khandelwal will resign from his International Business Formulations role at Alembic Pharma effective December 1, 2025. The departure affects the pharmaceutical company's international business operations leadership structure.",
            "Sentiment": "neutral",
            "PublishDate": 1764598190873,
            "Source": "corporate_governance"
        },
        {
            "Title": "Alembic Pharmaceuticals Receives USFDA Final Approval for Generic Diltiazem Hydrochloride Tablets",
            "Summary": "Alembic Pharmaceuticals has obtained final approval from the USFDA for Diltiazem Hydrochloride Tablets, a generic version of Cardizem used to treat chronic stable angina. The approval allows the pharmaceutical company to market and distribute this generic cardiovascular medication in the US market.",
            "Sentiment": "positive",
            "PublishDate": 1763211572535,
            "Source": "stock"
        },
        {
            "Title": "Alembic Pharmaceuticals Receives USFDA Approval for Dexlansoprazole Capsules Worth $285 Million",
            "Summary": "Alembic Pharmaceuticals received final USFDA approval for Dexlansoprazole Delayed-Release Capsules in 30 mg and 60 mg strengths. The approved product has an expected market value of $285 million.",
            "Sentiment": "positive",
            "PublishDate": 1763014996622,
            "Source": "stock"
        },
        {
            "Title": "Alembic Pharmaceuticals Reports 16% Revenue Growth in Q2 FY26, Enters US Branded Drug Market",
            "Summary": "Alembic Pharmaceuticals delivered revenue of INR 1,910 crores in Q2 FY26, marking 16% year-on-year growth driven by higher volumes and new product launches. EBITDA before R&D expenses reached INR 503 crores with a 26% margin, up from 23% in the previous year. The company completed acquisition of Utility Therapeutics for $4 million upfront, entering the US branded drugs market with Pivya for urinary tract infections. R&D expenses increased 41% to INR 187 crores as the company invests in injectables and peptides development. India branded business grew 5% to INR 639 crores despite GST implementation disruptions. US business grew 21% supported by higher volumes, while rest-of-world markets expanded 31%. The company filed 2 ANDAs, received 6 approvals, and launched 3 products in the US during the quarter. Net debt increased to INR 1,280 crores from INR 967 crores, reflecting working capital funding and the acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1762846316187,
            "Source": "earnings"
        },
        {
            "Title": "Alembic Pharmaceuticals Receives USFDA Approval for Sumatriptan Injection Autoinjector",
            "Summary": "Alembic Pharmaceuticals received USFDA final approval for Sumatriptan Injection USP in 4 MG/0.5 ML and 6 MG/0.5 ML dosages delivered through a single-dose autoinjector. This represents the company's first drug-device combination product. The market size for this product is $73 million.",
            "Sentiment": "positive",
            "PublishDate": 1762508469218,
            "Source": "stock"
        },
        {
            "Title": "Alembic Pharmaceuticals Receives USFDA Approval for Dasatinib Tablets",
            "Summary": "Alembic Pharmaceuticals has received final USFDA approval for Dasatinib tablets in various dosages. The tablets are approved for treating PH+ CML and PH+ ALL in both adults and children. The market size for this product is estimated at $1,017 million.",
            "Sentiment": "positive",
            "PublishDate": 1762499515023,
            "Source": "stock"
        },
        {
            "Title": "Alembic Pharmaceuticals Converts Branch Office into Wholly Owned Subsidiary in UAE",
            "Summary": "Alembic Pharmaceuticals Limited has converted its branch office into a wholly owned subsidiary named Alembic Pharmaceuticals Scientific Office L.L.C., incorporated in the United Arab Emirates. The company acquired 100% shareholding for AED 50,000 through cash consideration. The subsidiary operates in the pharmaceuticals industry and received licensing approval from the Department of Economic Development, Government of Dubai. The transaction does not fall under related party transactions, and promoter groups have no interest in the deal.",
            "Sentiment": "neutral",
            "PublishDate": 1762457268137,
            "Source": "corporate_action"
        },
        {
            "Title": "Alembic Pharmaceuticals Provides Financial Guidance on Margins and R&D Spending",
            "Summary": "Alembic Pharmaceuticals shared its financial guidance during a conference call. The company expects U.S. business gross margins to remain in the 70-75% range. Long-term R&D spending is projected to stay around 8% of revenue, down from previous levels of 12-14%. Annual R&D spending guidance is maintained at INR 600-650 crores for FY26. The API business is expected to grow around 10% for the year. The company aims to improve EBITDA margins to 18-20% levels over the next couple of years.",
            "Sentiment": "positive",
            "PublishDate": 1762401192211,
            "Source": "stock"
        },
        {
            "Title": "Alembic Pharma Reports Strong Q2 Growth with 23% Rise in Net Profit",
            "Summary": "Alembic Pharma delivered robust quarterly performance with consolidated net profit rising to 1.85 billion rupees from 1.5 billion rupees year-over-year. Revenue increased to 19.1 billion rupees compared to 16.48 billion rupees in the same period last year. EBITDA grew to 3.15 billion rupees from 2.4 billion rupees, while EBITDA margin improved to 16.5% from 14.56% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762246944413,
            "Source": "earnings"
        },
        {
            "Title": "Alembic Pharma Receives USFDA Final Approval for Ticagrelor Tablets",
            "Summary": "Alembic Pharma has received final approval from the USFDA for Ticagrelor tablets. The company's US sales have reached $236 million.",
            "Sentiment": "positive",
            "PublishDate": 1761719542002,
            "Source": "stock"
        },
        {
            "Title": "Alembic Pharmaceuticals Receives USFDA Final Approval for Triamcinolone Acetonide Injectable Suspension",
            "Summary": "Alembic Pharmaceuticals Limited received final approval from the US Food & Drug Administration for Triamcinolone Acetonide Injectable Suspension USP, 40 mg/mL in both single-dose and multiple-dose vial formats. The approved product is therapeutically equivalent to Bristol-Myers Squibb Company's reference drug Kenalog-40 Injectable Suspension. The medication is indicated for various autoimmune, inflammatory, and other conditions where oral therapy is not feasible. The drug has an estimated market size of US$ 96 million for twelve months ending June 2025 according to IQVIA. With this approval, Alembic now has a cumulative total of 227 ANDA approvals from USFDA, comprising 206 final approvals and 21 tentative approvals.",
            "Sentiment": "positive",
            "PublishDate": 1760791233608,
            "Source": "stock"
        },
        {
            "Title": "Alembic Pharmaceuticals Receives USFDA Approval for Paroxetine Extended-Release Tablets",
            "Summary": "Alembic Pharmaceuticals received final USFDA approval for Paroxetine Extended-Release Tablets in 25 MG and 37.5 MG strengths, which are equivalent to Paxil CR. With this approval, the company's total USFDA ANDA approvals have reached 226.",
            "Sentiment": "positive",
            "PublishDate": 1758784115475,
            "Source": "stock"
        },
        {
            "Title": "Alembic Pharmaceuticals Receives US FDA Establishment Inspection Report for Panelav API Facilities",
            "Summary": "Alembic Pharmaceuticals Limited has received an Establishment Inspection Report (EIR) from the US FDA for its API-I and API-II facility in Panelav. The inspection was conducted from May 26 to May 31, 2025. The company informed BSE and NSE about receiving the EIR report on September 13, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757759452937,
            "Source": "stock"
        },
        {
            "Title": "Alembic Pharmaceuticals Receives USFDA Final Approval for Phytonadione Injectable with $44 Million Sales Expectation",
            "Summary": "Alembic Pharmaceuticals has received final approval from the USFDA for Phytonadione Injectable Emulsion USP. The company expects sales of $44 million from this approved product.",
            "Sentiment": "positive",
            "PublishDate": 1757395734894,
            "Source": "stock"
        },
        {
            "Title": "Alembic Pharmaceuticals Receives USFDA Final Approval for Macitentan Tablets",
            "Summary": "Alembic Pharmaceuticals Limited received final approval from the US Food & Drug Administration for its Macitentan Tablets, 10 mg. The approved drug is therapeutically equivalent to Opsumit Tablets from Actelion Pharmaceuticals US, Inc. Macitentan tablets are an endothelin receptor antagonist indicated for treating pulmonary arterial hypertension in adults to reduce disease progression risks and hospitalization. The drug has an estimated market size of US$ 1,180 million for the twelve months ending June 2025 according to IQVIA. With this approval, Alembic now has a cumulative total of 224 ANDA approvals from USFDA, comprising 203 final approvals and 21 tentative approvals.",
            "Sentiment": "positive",
            "PublishDate": 1755596532879,
            "Source": "stock"
        },
        {
            "Title": "Alembic Pharmaceuticals Receives USFDA Final Approval for Tretinoin Cream",
            "Summary": "Alembic Pharmaceuticals Limited received final approval from the US Food & Drug Administration for its Tretinoin Cream USP, 0.025%. The approved product is therapeutically equivalent to Bausch Health US, LLC's Retin-A Cream and is indicated for topical treatment of acne vulgaris. The Tretinoin cream market has an estimated size of US$ 94 million for the twelve months ending June 2025 according to IQVIA. With this approval, Alembic now has a cumulative total of 224 ANDA approvals, comprising 202 final approvals and 22 tentative approvals. Alembic Pharmaceuticals is a vertically integrated research and development pharmaceutical company established in 1907, manufacturing and marketing generic pharmaceutical products globally.",
            "Sentiment": "positive",
            "PublishDate": 1755273813913,
            "Source": "stock"
        },
        {
            "Title": "Alembic Pharmaceuticals Reports 10% Revenue Growth to Rs 1,711 Crores in Q1 FY26",
            "Summary": "Alembic Pharmaceuticals delivered total revenue of Rs 1,711 crores for Q1 FY26, marking 10% year-on-year growth. The company reported EBITDA after R&D expenses of Rs 288 crores (17% of revenue), growing 20% year-on-year. Net profit increased 15% to Rs 154 crores with EPS at Rs 7.85 per share. The US business grew 13% despite pricing pressures, supported by four new product launches and volume gains. Rest of world generics showed strong 21% growth driven by strategic expansion. However, the India branded business underperformed with only 5% growth at Rs 599 crores due to execution challenges and stricter sales tracking mechanisms. The API business remained flat at Rs 261 crores due to pricing pressures from data availability issues. The company received 6 ANDA approvals during the quarter and expects to launch 4-5 more products in Q2. Gross margins improved to 76.2% from 74.8% in the previous year, aided by better product mix and cost improvement programs. R&D expenses increased 26% to Rs 145 crores, aligning with full-year guidance of Rs 600-650 crores.",
            "Sentiment": "positive",
            "PublishDate": 1754924643778,
            "Source": "earnings"
        },
        {
            "Title": "Alembic Pharma Reports Strong Q1 Growth with Revenue Rising to 17.1 Billion Rupees",
            "Summary": "Alembic Pharma delivered solid quarterly performance with revenue increasing to 17.1 billion rupees from 15.62 billion rupees in the previous year. The company's consolidated net profit grew to 1.54 billion rupees compared to 1.35 billion rupees year-over-year. EBITDA rose to 2.8 billion rupees from 2.37 billion rupees, while EBITDA margin improved to 16.45% from 15.16% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1754379678558,
            "Source": "earnings"
        },
        {
            "Title": "Alembic Pharmaceuticals President Shreekumar Nair Retires from Supply Chain Role",
            "Summary": "Alembic Pharmaceuticals announced that Shreekumar Nair, President-Supply Chain Management and Operations, has superannuated from his position. His cessation from the role took effect on July 31st, 2025 after closure of business hours. The pharmaceutical company disclosed this senior management personnel change to stock exchanges BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1753966400457,
            "Source": "corporate_governance"
        },
        {
            "Title": "Alembic Pharmaceuticals' Credit Rating Reaffirmed at AA+/Stable with Enhanced Bank Loan Limit",
            "Summary": "CRISIL Ratings Limited has reaffirmed Alembic Pharmaceuticals Limited's AA+/Stable credit rating for its bank loan facilities. The rated amount has been enhanced from Rs. 600 crores to Rs. 800 crores, while the company's overall borrowing limit remains unchanged. The reaffirmation applies to the company's long-term bank loan facilities.",
            "Sentiment": "positive",
            "PublishDate": 1753519298581,
            "Source": "stock"
        },
        {
            "Title": "Alembic Pharmaceuticals Receives US FDA Approval for Carbamazepine Extended-Release Tablets",
            "Summary": "Alembic Pharmaceuticals Limited received final approval from the US FDA for its Carbamazepine Extended-Release Tablets USP in 100 mg, 200 mg, and 400 mg strengths. The approved drug is therapeutically equivalent to Novartis' Tegretol-XR and is indicated for use as an anticonvulsant and for treating pain associated with trigeminal neuralgia. The tablets have an estimated market size of US$ 71 million for twelve months ending March 2025. With this approval, Alembic now has a total of 225 ANDA approvals from the USFDA, comprising 202 final approvals and 23 tentative approvals.",
            "Sentiment": "positive",
            "PublishDate": 1753510755923,
            "Source": "stock"
        },
        {
            "Title": "Alembic Pharmaceuticals Schedules Post-Results Conference Call for Q1 FY26 Financial Results",
            "Summary": "Alembic Pharmaceuticals has scheduled a post-results conference call for analysts and institutional investors on August 5, 2025, at 4:30 PM IST to discuss the company's Q1 FY26 unaudited financial results. The call will be attended by senior management including Managing Directors Pranav Amin and Shaunak Amin, Executive Director R.K. Baheti, CFO G Krishnan, Head of International Business & Strategy Nilesh Wadhwa, and Sr. VP Finance Ajay Kumar Desai. Participants can join through pre-registration via Diamond Pass or through provided dial-in numbers including universal access numbers, India toll-free, and international toll-free options for USA, UK, Singapore, and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1753156792834,
            "Source": "earnings"
        },
        {
            "Title": "Alembic Pharmaceuticals Schedules Board Meeting for August 5 to Approve Quarterly Financial Results",
            "Summary": "Alembic Pharmaceuticals has scheduled a Board of Directors meeting on August 5, 2025, to consider and approve unaudited financial results for the quarter ended June 30, 2025. The company's trading window, which closed on July 1, 2025, will reopen 48 hours after the financial results are declared. The announcement was made through a communication to BSE and NSE exchanges, signed by Company Secretary Manisha Saraf.",
            "Sentiment": "neutral",
            "PublishDate": 1753095707724,
            "Source": "corporate_action"
        },
        {
            "Title": "Alembic Pharmaceuticals: $12 Million Acquisition Expands US Footprint",
            "Summary": "Alembic Pharmaceuticals' subsidiary has acquired Utility Therapeutics Ltd. for $12 million, expanding its UTI drug portfolio in the US. The deal includes 100% ownership and is expected to close within 30 days. Alembic aims to commercialize Utility's FDA-approved and pipeline products in the US market.",
            "Sentiment": "positive",
            "PublishDate": 1751513974000,
            "Source": "corporate_action"
        },
        {
            "Title": "Alembic Pharma's Unit Acquires Utility Therapeutics for $12 Million",
            "Summary": "Alembic Pharmaceuticals' unit has purchased Utility Therapeutics for $12 million. This acquisition aims to expand Alembic's range of urinary tract infection (UTI) drugs in the United States market.",
            "Sentiment": "positive",
            "PublishDate": 1751512978000,
            "Source": "default"
        },
        {
            "Title": "Alembic Pharmaceuticals: FDA Approval Boosts Stock by 12%",
            "Summary": "Alembic Pharmaceuticals received final FDA approval for Doxorubicin Hydrochloride Liposome injection, indicated for ovarian cancer, AIDS-related Kaposi Sarcoma, and multiple myeloma. The approved ANDA is for 20mg/10ml and 50mg/25ml strengths. The injection's estimated market size is $29 million for 12 months till March 2025. The company's stock surged up to 12% following the news.",
            "Sentiment": "positive",
            "PublishDate": 1751259438000,
            "Source": "normal_news"
        },
        {
            "Title": "Alembic Pharmaceuticals: USFDA Approval Boosts Shares 12%",
            "Summary": "Alembic Pharmaceuticals received FDA approval for Doxorubicin Hydrochloride Liposome injection to treat ovarian cancer and other ailments. The drug has an estimated market size of $29 million for FY2025. Alembic's shares surged over 12% to a six-month high following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1751259131000,
            "Source": "corporate_action"
        },
        {
            "Title": "Alembic Pharma Receives USFDA Approval for Doxorubicin Hydrochloride Liposome Injection",
            "Summary": "Alembic Pharmaceuticals has obtained final approval from the U.S. Food and Drug Administration (USFDA) for Doxorubicin Hydrochloride Liposome Injection. The market size for this product is estimated at $29 million.",
            "Sentiment": "positive",
            "PublishDate": 1751249598000,
            "Source": "default"
        },
        {
            "Title": "Alembic Pharmaceuticals: USFDA Issues EIR for Gujarat API Facility",
            "Summary": "Alembic Pharma's API-III facility in Karakhadi, Gujarat received an Establishment Inspection Report (EIR) from the USFDA following an inspection conducted from March 17-21, 2025. The company has 223 cumulative ANDA approvals from the USFDA. Q4 FY2025 saw a 12% decline in net profit but a 16.7% increase in revenue.",
            "Sentiment": "positive",
            "PublishDate": 1750238887000,
            "Source": "normal_news"
        },
        {
            "Title": "Alembic Pharmaceuticals Receives Inspection Report for API-III Facility",
            "Summary": "Alembic Pharmaceuticals has obtained an Establishment Inspection Report for its API-III facility located in Karakhadi. This report is typically issued by regulatory authorities following an inspection of pharmaceutical manufacturing facilities.",
            "Sentiment": "positive",
            "PublishDate": 1750228607000,
            "Source": "default"
        },
        {
            "Title": "USFDA Issues 4 Observations After CGMP Inspection at Alembic Pharma Facility",
            "Summary": "The U.S. Food and Drug Administration (USFDA) has conducted a routine Current Good Manufacturing Practice (CGMP) inspection at Alembic Pharmaceuticals' API-I & II Panelav facility. Following the inspection, the USFDA issued 4 observations. No further details about the nature of the observations or their potential impact on the company's operations were provided in the news article.",
            "Sentiment": "neutral",
            "PublishDate": 1748835382000,
            "Source": "default"
        },
        {
            "Title": "Alembic Pharmaceuticals: FDA Approval for Blood Cancer Drug Boosts Stock",
            "Summary": "Alembic Pharma received USFDA approval for Bosutinib Tablets (100 mg and 500 mg) used to treat chronic myelogenous leukemia. The drug has an estimated market size of $291 million for the twelve months ending March 2025. The company's shares rose 1.1% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1748592081000,
            "Source": "order&deals"
        },
        {
            "Title": "Alembic Pharma Receives USFDA Approval for Bosutinib Tablets",
            "Summary": "Alembic Pharmaceuticals has announced that it has received final approval from the U.S. Food and Drug Administration (USFDA) for Bosutinib Tablets. The approved product has reported U.S. sales of $291 million.",
            "Sentiment": "positive",
            "PublishDate": 1748586717000,
            "Source": "default"
        },
        {
            "Title": "Alembic Pharma Receives USFDA Approval for Amlodipine and Atorvastatin Tablets",
            "Summary": "Alembic Pharmaceuticals has announced that it has received final approval from the United States Food and Drug Administration (USFDA) for its Amlodipine and Atorvastatin Tablets. This approval allows the company to market these medications in the US market.",
            "Sentiment": "positive",
            "PublishDate": 1747981693000,
            "Source": "default"
        },
        {
            "Title": "Alembic Pharmaceuticals Receives USFDA Approval for Rivaroxaban Tablets",
            "Summary": "Alembic Pharmaceuticals has received final approval from the United States Food and Drug Administration (USFDA) for its Rivaroxaban Tablets. The estimated market size for this product in the US is $445 million.",
            "Sentiment": "positive",
            "PublishDate": 1747296029000,
            "Source": "default"
        },
        {
            "Title": "Alembic Pharma Provides R&D Expense Guidance",
            "Summary": "Alembic Pharma has provided guidance for its Research and Development (R&D) expenses. The company expects to spend around INR 500 crores in the next year. For FY '26, the guidance is set between INR 600 crores to INR 650 crores, depending on project progress.",
            "Sentiment": "neutral",
            "PublishDate": 1746588890000,
            "Source": "default"
        },
        {
            "Title": "Alembic Pharma Expects EBITDA Margin Improvement",
            "Summary": "Alembic Pharmaceuticals anticipates an increase in EBITDA margins over the coming quarters and years. This improvement is expected to be driven by factors including optimized R&D spending, as stated during a company conference call.",
            "Sentiment": "positive",
            "PublishDate": 1746588654000,
            "Source": "default"
        },
        {
            "Title": "Alembic Pharmaceuticals: Q4 Results Inline, Dolat Capital Upgrades Rating",
            "Summary": "Alembic Pharma's Q4 FY25 sales and PAT were in line with expectations. Ebitda margin slightly below estimates due to lower gross margin and higher R&D costs. US growth guidance for mid-teens, driven by 15+ product launches. R&D spending expected to be Rs 6-6.5 billion in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1746588232000,
            "Source": "earnings"
        },
        {
            "Title": "Alembic Pharmaceuticals: Q4 Profit Down 12%, Revenue Up, ₹11 Dividend Proposed",
            "Summary": "Alembic Pharmaceuticals reported Q4 consolidated net profit down 11.8% YoY to ₹157 crore, while revenue rose 16.7% to ₹1,769.6 crore. EBITDA increased 4.6% to ₹272 crore, but margin narrowed to 15.4%. Board proposed ₹11 per share dividend for FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1746523488000,
            "Source": "earnings"
        },
        {
            "Title": "Alembic Pharma Outlines Global Expansion Plans for FY26",
            "Summary": "Alembic Pharmaceuticals has announced its strategic focus for the fiscal year 2026, emphasizing timely product launches across various dosage forms. The company plans to introduce over 40 new products in the European Union, Canada, Australia, and South Africa, aiming to strengthen its international presence and market footprint.",
            "Sentiment": "positive",
            "PublishDate": 1746520185000,
            "Source": "default"
        },
        {
            "Title": "Alembic Pharma Reports Q4 FY23 Results and Dividend Declaration",
            "Summary": "Alembic Pharmaceuticals announced its Q4 FY23 financial results. Revenue increased to 17.69 billion rupees from 15.2 billion rupees year-over-year. EBITDA rose to 2.73 billion rupees from 2.59 billion rupees, although EBITDA margin decreased to 15.42% from 17.07%. The company's consolidated net profit declined to 1.6 billion rupees from 1.8 billion rupees. Additionally, Alembic Pharma declared a dividend of 11 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1746519785000,
            "Source": "result"
        },
        {
            "Title": "Alembic Pharmaceuticals: FDA Approves Generic Heart Attack Prevention Drug",
            "Summary": "Alembic Pharmaceuticals received USFDA approval for generic Ticagrelor Tablets (90 mg) and tentative approval for 60 mg. The drug reduces cardiovascular risks in acute coronary syndrome patients. Estimated market size is $1,062 million for 90 mg and $242 million for 60 mg tablets.",
            "Sentiment": "positive",
            "PublishDate": 1746203791000,
            "Source": "corporate_action"
        },
        {
            "Title": "Alembic Pharmaceuticals Receives USFDA Approval for Ticagrelor Tablets",
            "Summary": "Alembic Pharmaceuticals has announced that it has received final approval from the United States Food and Drug Administration (USFDA) for its Ticagrelor tablets. The US market for this product has annual sales of approximately USD 1 billion.",
            "Sentiment": "positive",
            "PublishDate": 1746172614000,
            "Source": "default"
        },
        {
            "Title": "Alembic Pharmaceuticals: US FDA Clears Panelav Oncology Plant",
            "Summary": "Alembic Pharmaceuticals received an establishment inspection report from the US FDA for its Panelav oncology formulation facility. The inspection was conducted in October 2024. Additionally, the company recently received FDA approval for Carbamazepine Tablets USP, 200 mg.",
            "Sentiment": "positive",
            "PublishDate": 1745980689000,
            "Source": "normal_news"
        },
        {
            "Title": "Alembic Pharma Receives FDA Inspection Report for Oncology Facility",
            "Summary": "Alembic Pharmaceuticals has received an Establishment Inspection Report (EIR) from the US Food and Drug Administration (FDA) for its oncology formulation facility in Panelav. The inspection, which covered both injectable and oral solid formulations, was conducted on October 7-8, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1745972657000,
            "Source": "default"
        }
    ]
}