{
    "Symbol": "APOLLO",
    "ISIN": "INE713T01028",
    "News": [
        {
            "Title": "Apollo Micro Systems Q3FY26 Investor Meet Scheduled",
            "Summary": "Apollo Micro Systems announces analyst/institutional investor meet for Q3FY26, using existing investor presentation available on company website under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770699963140,
            "Source": "stocks"
        },
        {
            "Title": "Apollo Micro Systems Reports No Deviation in Fund Use",
            "Summary": "Apollo Micro Systems confirms no deviation in Rs. 185.13 crore preferential issue proceeds utilization for Q3 FY26, with funds awaiting stock exchange listing approval.",
            "Sentiment": "neutral",
            "PublishDate": 1770662150973,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apollo Micro Systems Reports Strong Growth in FY25",
            "Summary": "Apollo Micro Systems showcases robust financial performance with 29% revenue CAGR and strategic acquisition of IDL Explosives, strengthening its position as India's leading defence technology company.",
            "Sentiment": "positive",
            "PublishDate": 1770637720614,
            "Source": "stocks"
        },
        {
            "Title": "Apollo Micro Systems Announces Q3FY26 Results",
            "Summary": "Apollo Micro Systems Limited held board meeting on February 9, 2026, approving unaudited standalone and consolidated financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770633133712,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apollo Micro Systems Plans ₹300 Cr Defence Factory",
            "Summary": "Apollo Micro Systems announces investment of ₹300 crore for new electronics and electro-mechanical manufacturing facility in Hyderabad dedicated to weapon systems production and testing.",
            "Sentiment": "positive",
            "PublishDate": 1768841449505,
            "Source": "stocks"
        },
        {
            "Title": "Apollo Micro Systems rises on trading approval",
            "Summary": "Apollo Micro Systems shares gained 2.5% after receiving BSE and NSE trading approval for 1.21 crore preferential equity shares issued to promoters and non-promoters, effective January 9, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767944001487,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apollo Micro Systems Lists 1.21 Cr Preferential Shares",
            "Summary": "Apollo Micro Systems secured trading approval for 1.21 crore preferential shares, with stock climbing 2.19% to ₹259.45. The defence company has delivered over 700% returns in three years.",
            "Sentiment": "positive",
            "PublishDate": 1767941823484,
            "Source": "stocks"
        },
        {
            "Title": "Apollo Micro Systems Lists ₹1,386.88 Cr Shares",
            "Summary": "Apollo Micro Systems received trading approval for 1.21 crore equity shares worth ₹1,386.88 crores on preferential basis, with trading commencing January 9, 2026 on NSE and BSE.",
            "Sentiment": "positive",
            "PublishDate": 1767880879494,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apollo Micro Systems Lists 65.69 Lakh Shares",
            "Summary": "Apollo Micro Systems receives trading approval for 65.69 lakh equity shares issued on preferential basis to promoters and non-promoters, with shares commencing trading from January 9, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767880616565,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apollo Micro Systems Wins Rs 257.89M Defence Order",
            "Summary": "Apollo Micro Systems declared lowest bidder for defence orders worth Rs 257.89 million from Defence PSU with 18-month execution timeline, continuing strong order momentum.",
            "Sentiment": "positive",
            "PublishDate": 1767238755558,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apollo Micro Systems Surges 5% on ₹420.89 Cr Order Win",
            "Summary": "Apollo Micro Systems shares jumped 5% to ₹272.50 after subsidiary IDL Explosives secured ₹420.89 crores worth of contracts, including a major ₹419.39 crore bulk explosives supply deal from Coal India subsidiaries.",
            "Sentiment": "positive",
            "PublishDate": 1767153330488,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apollo Micro Systems Wins ₹100.2 Cr Defence Order",
            "Summary": "Apollo Micro Systems secured orders worth ₹100.2 crores for unmanned aerial systems from a private firm, with delivery to the Ministry of Defence expected within four months.",
            "Sentiment": "positive",
            "PublishDate": 1766722778303,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apollo Micro Systems Gets DRDO Tech Transfer Deal",
            "Summary": "Apollo Micro Systems secures two technology transfers from DRDO for directed energy weapon systems including Multi-Channel 10kW Laser DEW System and EO Tracking System.",
            "Sentiment": "positive",
            "PublishDate": 1766376317166,
            "Source": "stocks"
        },
        {
            "Title": "Apollo Micro Systems Unit Gets 15-Year Defence License",
            "Summary": "IDL Explosives Limited, step-down subsidiary of Apollo Micro Systems, secures 15-year industrial license for manufacturing HMX and TNT explosives with combined capacity of 550 MTPA.",
            "Sentiment": "positive",
            "PublishDate": 1766078799224,
            "Source": "stocks"
        },
        {
            "Title": "Apollo Micro Systems Partners With Telangana Government For ₹1500 Crore Defence Expansion",
            "Summary": "Apollo Micro Systems has partnered with the Telangana Government for a new expansion project with a planned investment of ₹1500 crores focused on defence production. The expansion will include manufacturing of warheads and ammunition systems, strengthening the company's defence capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1765251808784,
            "Source": "order&deals"
        },
        {
            "Title": "Apollo Micro Systems Shareholders Reject Related Party Transactions, Approve Loan Guarantee for IDL Explosives",
            "Summary": "Apollo Micro Systems' postal ballot concluded on December 6, 2025, with shareholders rejecting material related party transactions (47.67% in favor vs 52.33% against) while approving a loan guarantee for probable step-down subsidiary IDL Explosives Limited with 97.70% votes in favor. The voting process was conducted entirely through remote e-voting with 746 valid votes cast across both resolutions, affecting the company's related party transaction approvals and subsidiary financing arrangements.",
            "Sentiment": "neutral",
            "PublishDate": 1765198425200,
            "Source": "corporate_action"
        },
        {
            "Title": "Apollo Micro Systems Targets 45-50% Revenue CAGR Over Next Two Years",
            "Summary": "Apollo Micro Systems has projected revenue growth of 45% to 50% CAGR over the next two years during an investor presentation. The growth projection indicates the company's expansion plans and provides guidance to investors and stakeholders about expected financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1764905896677,
            "Source": "stock"
        },
        {
            "Title": "Apollo Micro Systems Allots 28.89 Lakh Equity Shares Through Warrant Conversion",
            "Summary": "Apollo Micro Systems allotted 28,89,044 equity shares upon conversion of warrants by 8 investors who paid Rs. 24.70 crores as warrant exercise price at Rs. 85.50 per share. The allotment increased the company's paid-up capital from Rs. 35.44 crores to Rs. 35.73 crores, with 2.37 crore warrants converted out of the total 3.81 crore warrants issued.",
            "Sentiment": "positive",
            "PublishDate": 1764679834594,
            "Source": "corporate_action"
        },
        {
            "Title": "Apollo Micro Systems Receives Defence Manufacturing License for Unmanned Helicopters and Navigation Systems",
            "Summary": "Apollo Micro Systems Limited has been granted a defence manufacturing license by DPIIT for producing unmanned helicopters, inertial navigation systems, and radar equipment at its Hyderabad facility. The license enables the company to pursue manufacturing opportunities with the Ministry of Defence, with unmanned aerial systems expected to enter field trials within the next two quarters.",
            "Sentiment": "positive",
            "PublishDate": 1764650982220,
            "Source": "stock"
        },
        {
            "Title": "Apollo Micro Systems Promoter Group Members Acquire Equity Stakes Through Preferential Allotment",
            "Summary": "Baddam Kanishka Reddy and Baddam Chanakya Reddy, promoter group members of Apollo Micro Systems Limited, acquired 22,85,600 and 84,00,600 equity shares respectively through preferential allotment on November 26, 2025. Both acquisitions resulted in each member holding 2.37% stake in the company, with the total equity share capital increasing to 35,43,91,700 shares after the allotment.",
            "Sentiment": "neutral",
            "PublishDate": 1764411260698,
            "Source": "corporate_action"
        },
        {
            "Title": "Apollo Micro Systems Lists 21.07 Lakh Equity Shares on NSE and BSE",
            "Summary": "Apollo Micro Systems received trading approval for 21,07,194 equity shares of Rs. 1 each issued to non-promoters on preferential basis, with shares listed on NSE and BSE from November 28, 2025. The shares were issued at a premium of Rs. 113 pursuant to conversion of warrants and carry a lock-in period until May 31, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1764255144396,
            "Source": "corporate_action"
        },
        {
            "Title": "Apollo Micro Systems Receives Compounding Order for Companies Act Violation",
            "Summary": "Apollo Micro Systems Limited received a compounding order from the Regional Director (South East Region), Hyderabad for violation of Section 148(6) of the Companies Act, 2013, related to non-filing of cost audit report in Form CRA-4 within prescribed time. The company settled the violation by paying compounding fees on August 28, 2025, and stated there is no impact on its financial, operational or other activities.",
            "Sentiment": "neutral",
            "PublishDate": 1764166955748,
            "Source": "corporate_governance"
        },
        {
            "Title": "Apollo Microsystems Allots 1.21 Crore Equity Shares Through Warrant Conversion",
            "Summary": "Apollo Microsystems Limited allotted 1,21,47,964 equity shares upon conversion of warrants by six allottees including promoter group members and directors, receiving Rs. 103.86 crores as warrant exercise price. The allotment increased the company's paid-up capital from Rs. 34.22 crores to Rs. 35.44 crores, with the new shares ranking equally with existing equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1764166659198,
            "Source": "corporate_action"
        },
        {
            "Title": "Apollo Micro Systems Forms Strategic Alliance with IIT-Chennai and Indian Navy for Indigenous Defence Technology Development",
            "Summary": "Apollo Micro Systems Limited entered into a tri-party alliance with IIT-Chennai and Indian Navy's DGNAI to develop indigenous defence technologies, with the MoU exchanged at Swavalamban 2025 event in presence of Defence Minister Rajnath Singh. The collaboration focuses on advanced Electronic Warfare systems, precision guidance and control systems, and high-energy armament solutions, aiming to reduce foreign dependence and strengthen India's self-reliance in critical defence technologies.",
            "Sentiment": "positive",
            "PublishDate": 1764089815402,
            "Source": "order&deals"
        },
        {
            "Title": "Apollo MicroSystems Secures Orders Worth INR 273.69 Million from DRDO and Private Company",
            "Summary": "Apollo MicroSystems Limited received orders totaling INR 273.69 Million, comprising INR 57.69 Million from DRDO and INR 216.00 Million from a private company in the normal course of business. The orders represent significant business development for the defense and technology company and its stakeholders.",
            "Sentiment": "positive",
            "PublishDate": 1764045084098,
            "Source": "order&deals"
        },
        {
            "Title": "Apollo Micro Systems Secures USD 1.89 Million Export Order",
            "Summary": "Apollo Micro Systems has secured an export order worth USD 1.89 million (₹16.98 crore) as part of its regular business operations. The order represents new business for the company in its export segment.",
            "Sentiment": "positive",
            "PublishDate": 1763942829048,
            "Source": "order&deals"
        },
        {
            "Title": "Apollo Micro Systems Secures USD 1.89 Million Export Order",
            "Summary": "Apollo Micro Systems has received an export order worth USD 1.89 million as part of its regular business operations. The order represents new business for the company in international markets.",
            "Sentiment": "positive",
            "PublishDate": 1763810538035,
            "Source": "stock"
        },
        {
            "Title": "Apollo Microsystems Allots 65.69 Lakh Equity Shares Upon Warrant Conversion",
            "Summary": "Apollo Microsystems allotted 65,69,000 equity shares of Re. 1/- each upon conversion of warrants by three investors including promoter group members, raising Rs. 56.16 crores as warrant exercise price. The company's paid-up capital increased from Rs. 33.57 crores to Rs. 34.22 crores, while the board extended the conversion deadline for remaining 2.93 crore warrants from December 1, 2025 to June 30, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1763571529730,
            "Source": "corporate_action"
        },
        {
            "Title": "Apollo Micro Systems Allots 35,088 Equity Shares Upon Warrant Conversion",
            "Summary": "Apollo Micro Systems allotted 35,088 equity shares to Mr. Piyush Bhupendra Gala upon conversion of warrants at Rs. 114 per warrant. The company received Rs. 30,00,024 as warrant exercise price. The paid-up capital increased to Rs. 33,56,74,736 consisting of 33,56,74,736 equity shares. The company confirmed no deviation in utilization of preferential issue proceeds totaling Rs. 434.80 crores for working capital requirements, research and development, and general corporate purposes. Acuite Ratings Research Limited submitted a monitoring agency report confirming proper fund utilization as per stated objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1763002181973,
            "Source": "corporate_action"
        },
        {
            "Title": "Apollo Micro Systems Reports Record Q2FY26 Results with 69% Revenue Growth",
            "Summary": "Apollo Micro Systems delivered its highest quarterly revenue of INR 225 crores in Q2FY26, marking a 69% quarter-on-quarter increase from INR 134 crores in Q1FY26. The company reported EBITDA of INR 59 crores and PAT of INR 30 crores, representing a 70% quarter-on-quarter increase. For H1FY26, revenue grew 42% to INR 359 crores with EBITDA at INR 100 crores and PAT at INR 48 crores. The company completed acquisition of Ideal Explosives Limited for INR 107 crores and expects Unit 3 Phase 1 to become fully operational by June. Management projects 45-50% CAGR growth over FY26 and FY27 driven by core business, with order book standing at approximately INR 800 crores. The company anticipates several large defense orders including MIGM, QRSAM, and naval programs, with capacity expected to increase 8x once Unit 3 is operational.",
            "Sentiment": "positive",
            "PublishDate": 1762582792803,
            "Source": "earnings"
        },
        {
            "Title": "Apollo Micro Systems Seeks Shareholder Approval for ₹1,500 Crore Related Party Transactions and ₹700 Crore Loan Facility",
            "Summary": "Apollo Micro Systems Limited has issued a postal ballot notice seeking shareholder approval for two key resolutions. The first proposal involves material related party transactions worth up to ₹500 crores each with three entities - Apollo Defence Industries Private Limited (subsidiary), Apollo Strategic Technologies Private Limited (step down subsidiary), and IDL Explosives Limited (probable step down subsidiary) - totaling ₹1,500 crores for financial year 2025-26. These transactions represent 88.95% of the company's audited consolidated annual turnover of ₹562.06 crores for 2024-25. The second resolution seeks approval for providing loans, guarantees, or securities up to ₹700 crores to IDL Explosives Limited under Section 185 of the Companies Act, 2013. The e-voting period runs from November 8, 2025, to December 6, 2025, with results to be announced by December 8, 2025. The transactions are stated to be conducted at arm's length basis and in the ordinary course of business.",
            "Sentiment": "neutral",
            "PublishDate": 1762503789986,
            "Source": "corporate_action"
        },
        {
            "Title": "Apollo Micro Systems Secures Orders Worth INR 340.96 Million from Defense and Private Sectors",
            "Summary": "Apollo Micro Systems Limited announced receiving new orders totaling INR 340.96 million. The orders include INR 110.16 million from DRDO, INR 225.71 million from Defense Public Sector undertaking, and INR 5.08 million from Private Companies. The company received these orders in the ordinary course of its business operations.",
            "Sentiment": "positive",
            "PublishDate": 1762486413746,
            "Source": "stock"
        },
        {
            "Title": "Apollo Microsystems Projects 45-50% Annual Revenue Growth for FY26-FY27",
            "Summary": "Apollo Microsystems expects revenue to increase by 45-50% annually over FY26 and FY27, driven by their main operations. The company anticipates its core business revenue contribution will expand from the current 25-35% range to 40-45% in the future.",
            "Sentiment": "positive",
            "PublishDate": 1762401174639,
            "Source": "stock"
        },
        {
            "Title": "Apollo Micro Systems Reports Q2 FY26 Results with Share Warrant Conversions",
            "Summary": "Apollo Micro Systems Limited announced its quarterly results for the quarter and half-year ended September 30, 2025. The company converted 21,07,194 share warrants into equity shares at face value of Re. 1 each with a premium of Rs. 113 per share. At quarter-end, 3,59,59,864 share warrants remain pending for conversion into equity shares. The Board of Directors approved both standalone and consolidated unaudited financial results during their meeting held on November 4, 2025. Apollo Defence Industries, a subsidiary of the company, paid Rs. 107 crores under a Share Purchase Agreement for acquiring shares and control of IDL Explosives Limited. The company operates in the electromechanical components and systems segment along with allied components and services.",
            "Sentiment": "neutral",
            "PublishDate": 1762265808464,
            "Source": "earnings"
        },
        {
            "Title": "Apollo Micro Systems Reports Strong Q2 Growth with Net Profit Doubling to 330.4M Rupees",
            "Summary": "Apollo Micro Systems delivered robust quarterly performance with net profit surging to 330.4 million rupees from 158.7 million rupees year-over-year. Revenue increased to 2.25 billion rupees compared to 1.6 billion rupees in the same period last year. EBITDA rose significantly to 592.2 million rupees from 328 million rupees, while EBITDA margin expanded to 26.69% from 20.42% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762263115336,
            "Source": "earnings"
        },
        {
            "Title": "Apollo Micro Systems Emerges as Lowest Bidder for Defense Orders Worth INR 392.70 Million",
            "Summary": "Apollo Micro Systems Limited has been declared the lowest bidder for defense-related orders totaling INR 392.70 million. The orders comprise INR 43 million from DRDO and INR 349.7 million from Defense Public Sector Undertakings. Additionally, the company has received approval for Transfer of Technology of Mechatronic Fuze for Grenade by DRDO. The company announced these developments as business updates to stakeholders.",
            "Sentiment": "positive",
            "PublishDate": 1760586119118,
            "Source": "order&deals"
        },
        {
            "Title": "Apollo Micro Systems Reports Quarterly Revenue of Rs 225.26 Crores",
            "Summary": "Apollo Micro Systems reported standalone revenue of Rs 225.26 crores for the quarter ending September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760087547929,
            "Source": "earnings"
        },
        {
            "Title": "Apollo Micro Systems Partners with Sibersentinel and Zoom Technologies for Cybersecurity Solutions",
            "Summary": "Apollo Micro Systems Limited has signed Memorandums of Understanding with Sibersentinel Technologies Limited and Zoom Technologies (India) Private Limited to jointly design, develop, and deploy advanced cybersecurity solutions. The partnership targets government agencies, statutory bodies, financial institutions, and critical infrastructure sectors. The collaboration combines Apollo's expertise in defence-grade electronic systems with the cybersecurity capabilities of Sibersentinel and Zoom Technologies to provide indigenous digital protection solutions aligned with national security requirements.",
            "Sentiment": "positive",
            "PublishDate": 1758180114605,
            "Source": "order&deals"
        },
        {
            "Title": "Apollo Micro Systems Partners with Dynamic Engineering for BM-21 Grad Rocket Motor Development",
            "Summary": "Apollo Micro Systems has entered into a partnership with Dynamic Engineering And Design Inc. for technology exchange and joint development of rocket motors for BM-21 Grad Rockets. The collaboration aims to support Make In India initiatives and enhance self-reliance in defense manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1757572027114,
            "Source": "stock"
        },
        {
            "Title": "Apollo Micro Systems Shares Drop 9% as Investors Book Profits After Strong Rally",
            "Summary": "Apollo Micro Systems shares declined 8.5% to an intraday low of Rs 278.20, extending losses from the previous session's 2.5% drop. The decline appears driven by profit booking after the stock rallied over 62% in the past month and 175% over the last year. The stock recently touched its 52-week high of Rs 321 and currently trades around Rs 285, giving the company a market capitalization of approximately Rs 9,659 crore. Technical indicators show the stock's 14-day RSI at 82.4, well above the overbought threshold of 70, suggesting potential for short-term pullback. However, the stock remains above 7 out of 8 key Simple Moving Averages. One analyst maintains a 'Strong Buy' recommendation on the stock.",
            "Sentiment": "negative",
            "PublishDate": 1757314540313,
            "Source": "stock"
        },
        {
            "Title": "Apollo Micro Systems Surges 85% in Five Weeks on Defence Contract Approvals",
            "Summary": "Apollo Micro Systems Ltd. shares have gained 85% over five weeks, rising from ₹169 in early August to over ₹300. The stock posted gains of 21% this week, 12% last week, and 24% the week before. Trading volumes reached three-month highs, with over 21 crore shares changing hands this week compared to the usual 2-3.5 crore weekly average. The surge follows DRDO's approval of the company as production agency for Multi-Influence Ground Mine (MIGM) called Vighna, and a technology transfer agreement for Omni-Directional multi-EFP warhead for NASM-SR missile. Shares closed 0.3% lower at ₹312.5 on Friday.",
            "Sentiment": "positive",
            "PublishDate": 1757064945766,
            "Source": "stock"
        },
        {
            "Title": "Apollo Micro Systems Hits 52-Week High, Extends Rally to Fourth Day",
            "Summary": "Apollo Micro Systems shares surged 3.76% intraday to reach a new 52-week high of Rs 303, marking the fourth consecutive day of gains before settling 2% higher at Rs 298.40. The stock has delivered 160% returns over six months, outperforming other defense sector stocks including Astra Microwave Products (70%), BEML (66%), Paras Defence (53%), and Bharat Electronics (52%). The company's market capitalization is approaching Rs 10,000 crore. Apollo Micro Systems recently secured Rs 25.12 crore in contracts from DRDO and additional orders from PSUs. Revenue for the April-June quarter grew 46% year-on-year to Rs 133.6 crore from Rs 91.2 crore. Technical indicators show the stock trading above all key moving averages but with RSI at 86.3, suggesting an overbought condition.",
            "Sentiment": "positive",
            "PublishDate": 1756883617849,
            "Source": "stock"
        },
        {
            "Title": "Apollo Micro Systems Shares Rise Over 2% on DRDO Partnership for Defense Technology",
            "Summary": "Apollo Micro Systems shares gained over 2% after DRDO approved the company as the production agency for the Multi-Influence Ground Mine – Vighana. DRDO also agreed to transfer technology for the Omni-Directional multi-EFP warhead to Apollo Micro Systems, which is a key component of the Naval Anti-Ship Missile – Short Range (NASM-SR). The NASM-SR is designed for launch from helicopters and naval platforms to engage enemy ships at short range. The stock rose as much as 2.36% to Rs 269 on NSE and was trading 1.66% higher at Rs 267.15, outperforming the Nifty 50 which declined 0.44%. The stock has gained 157.66% over the last 12 months and 133.11% year-to-date. Trading volume was 4.1 times the 30-day average with an RSI of 77.05. One analyst has a 'buy' rating with a 12-month target price of Rs 240, implying a 10.4% downside.",
            "Sentiment": "positive",
            "PublishDate": 1756702005894,
            "Source": "stock"
        },
        {
            "Title": "Apollo Micro Systems Receives DRDO Approval for MIGM-Vighana Production and Technology Transfer",
            "Summary": "Apollo Micro Systems has received approval from DRDO for MIGM-Vighana production. The company has also signed a technology transfer agreement for omni-directional warhead technology.",
            "Sentiment": "positive",
            "PublishDate": 1756449939294,
            "Source": "stock"
        },
        {
            "Title": "Apollo Micro Systems Hits All-Time High as Defence Orders Drive Growth",
            "Summary": "Apollo Micro Systems shares reached an all-time high of Rs 245.45, rising 4.4% during Monday's early session. The Hyderabad-based defence company has doubled in value this year, driven by India's defence modernization and indigenization efforts. The company projects revenue growth of 45-50% CAGR over the next two years, excluding contributions from recently-acquired IDL Explosives. Management expects improved operating margins and a 100-120 day reduction in working capital cycle from fiscal 2027 as more orders move to serial production. Apollo Micro Systems was recently declared the lowest bidder for Rs 25.12 crore worth of orders from DRDO and Defence PSUs. The stock has gained 127% over the last 12 months and 106% year-to-date, with trading volume at 2.9 times its 30-day average.",
            "Sentiment": "positive",
            "PublishDate": 1756103624379,
            "Source": "stock"
        },
        {
            "Title": "Apollo Micro Systems Emerges as Lowest Bidder for Defense Orders Worth ₹25.12 Crores",
            "Summary": "Apollo Micro Systems has been named the lowest bidder for defense orders totaling ₹25.12 crores from DRDO and Defense PSUs. This positions the company to potentially secure these defense contracts through the competitive bidding process.",
            "Sentiment": "positive",
            "PublishDate": 1755766571712,
            "Source": "order&deals"
        },
        {
            "Title": "Apollo Micro Systems Receives Trading Approval for 2.7 Crore Preferential Shares",
            "Summary": "Apollo Micro Systems Limited has received trading approval for 2,70,42,894 equity shares of Rs. 1 each issued on a preferential basis to non-promoters. The shares have been granted trading approval by NSE and BSE and will be listed and admitted for trading from August 11, 2025. The shares carry a lock-in period until February 28, 2026. The shares have distinctive numbers ranging from 306489561 to 333532454 and will trade under the symbol APOLLO on NSE and scrip code 540879 on BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1754663594775,
            "Source": "corporate_action"
        },
        {
            "Title": "Apollo Micro Systems Reports 46% Revenue Growth in Q1 FY26, Secures $13.37 Million Export Order",
            "Summary": "Apollo Micro Systems delivered strong quarterly results with revenues surging 46% year-on-year to INR234 crores in Q1 FY26, compared to INR91 crores in the same quarter previous year. EBITDA rose 83% to INR41 crores with margin expansion of 600 basis points to 31%. PAT more than doubled with 110% growth to INR18 crores. The company secured its maiden export order worth $13.37 million (INR113.81 crores) for advanced avionics system development. ACUITE upgraded the company's credit ratings by two notches to A-/A2+. Current order book stands at INR735 crores. The company expects revenue to grow at 45-50% CAGR over FY26-27 driven by core business, with multiple products entering production phase. Management indicated this financial year could be a game changer with various defense programs progressing and expects INR2 lakh crores worth of defense orders from MOD in next six months.",
            "Sentiment": "positive",
            "PublishDate": 1754564699450,
            "Source": "earnings"
        },
        {
            "Title": "Apollo Micro Systems Reports Record Q1 FY26 Performance with 46% Revenue Growth",
            "Summary": "Apollo Micro Systems delivered its strongest first-quarter performance with revenue growing 46% year-on-year to ₹1,335.8 million in Q1 FY26, compared to ₹912.0 million in Q1 FY25. EBITDA increased 83% to ₹409.4 million with margins improving to 31% from 25%. Profit After Tax more than doubled with 110% growth to ₹176.8 million, expanding PAT margins to 13% from 9%. The company secured its first export order worth USD 13.37 million (approximately ₹113.81 crores). Apollo Micro Systems announced plans to invest ₹100 crores in R&D during FY26 to develop defense systems and high-end electronics. The company is targeting high-value defense programs and positioning itself as an end-to-end solutions provider for munitions and strategic platforms, with ambitions to become a global Original Equipment Manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1754284596654,
            "Source": "earnings"
        },
        {
            "Title": "Apollo Micro Systems Projects 45-50% Revenue Growth Over Next Two Years",
            "Summary": "Apollo Micro Systems expects to achieve 45-50% revenue growth over the next two years. The growth projection is attributed to strong order intake, local defence technology initiatives, and the company's acquisition of IDL Explosives, which will enable entry into the Tier-1 OEM market.",
            "Sentiment": "positive",
            "PublishDate": 1753722891959,
            "Source": "stock"
        }
    ]
}