{
    "Symbol": "APOLLOTYRE",
    "ISIN": "INE438A01022",
    "News": [
        {
            "Title": "Apollo Tyres Independent Director Vinod Rai Completes Tenure",
            "Summary": "Apollo Tyres announces completion of Mr. Vinod Rai's second term as Independent Director on February 8, 2026, with his cessation effective February 9, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770634376173,
            "Source": "stocks"
        },
        {
            "Title": "Apollo Tyres Q3 Net Profit Jumps 38% to ₹4.7B",
            "Summary": "Apollo Tyres reports strong Q3 performance with consolidated net profit rising 38% YoY to ₹4.7 billion, while revenue grows 12% to ₹77.4 billion, demonstrating robust operational momentum.",
            "Sentiment": "positive",
            "PublishDate": 1770211747163,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apollo Tyres Plans Major Andhra Pradesh Expansion",
            "Summary": "Apollo Tyres announces significant production capacity expansion at its Andhra Pradesh facility with an investment of 58.10 billion rupees, marking a major growth initiative for the tyre manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1770211713538,
            "Source": "stocks"
        },
        {
            "Title": "Apollo Tyres Declares ₹3.50 Interim Dividend",
            "Summary": "Apollo Tyres announces interim dividend of ₹3.50 per share for shareholders, reflecting the company's commitment to returning value to investors through regular dividend distributions.",
            "Sentiment": "positive",
            "PublishDate": 1770211684099,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apollo Tyres sponsors Team India jersey for brand growth",
            "Summary": "Apollo Tyres becomes official sponsor of Team India jersey across all formats, focusing on long-term brand value through cricket's unmatched reach and emotional connection with audiences.",
            "Sentiment": "positive",
            "PublishDate": 1769250069742,
            "Source": "stocks"
        },
        {
            "Title": "Apollo Tyres Board Meet on Feb 4 for Q3FY26 Results",
            "Summary": "Apollo Tyres Ltd has scheduled its board meeting for February 4, 2026, to consider Q3FY26 unaudited financial results and interim dividend declaration with record date set for February 10, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769168363556,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apollo Tyres eyes double-digit India growth at Davos",
            "Summary": "Apollo Tyres Vice-Chairman expects double-digit growth in India for 2026 driven by GST cuts, while shutting Netherlands plant amid weak European demand and Chinese competition.",
            "Sentiment": "positive",
            "PublishDate": 1768921775814,
            "Source": "stocks"
        },
        {
            "Title": "Apollo Tyres receives ESG rating of 68 from ESG Risk",
            "Summary": "Apollo Tyres Ltd has been assigned an ESG rating of 68 by ESG Risk Assessments & Insights Limited, disclosed under SEBI regulations on January 8, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767875097343,
            "Source": "stocks"
        },
        {
            "Title": "Apollo Tyres Postal Ballot Results: All Resolutions Pass",
            "Summary": "Apollo Tyres shareholders approve ₹10,000 cr NCD private placement and appointment of two independent directors through postal ballot with overwhelming majority support.",
            "Sentiment": "positive",
            "PublishDate": 1765951097945,
            "Source": "stocks"
        },
        {
            "Title": "Apollo Tyres Wins Rs 2,791 Million Tax Litigation as Madras High Court Quashes CGST Proceedings",
            "Summary": "The Madras High Court has quashed proceedings initiated under Section 74 of the CGST Act against Apollo Tyres, setting aside the entire demand of Rs 2,791 million in a composite supply matter. This legal victory eliminates a significant pending litigation that the company had previously disclosed to exchanges in August 2023.",
            "Sentiment": "positive",
            "PublishDate": 1764932915227,
            "Source": "stock"
        },
        {
            "Title": "Apollo Tyres Sets December 5 Cut-off Date for Postal Ballot on Debenture Placement and Director Appointments",
            "Summary": "Apollo Tyres has fixed December 5, 2025 as the cut-off date for shareholders to receive postal ballot notices for voting on private placement of non-convertible debentures and appointment of two independent directors. The company seeks shareholder consent through special resolutions for these proposals following board approvals in November and December 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764848182970,
            "Source": "corporate_action"
        },
        {
            "Title": "Apollo Tyres: 6.31 Crore Shares Pledged by Emerald Sage Investment",
            "Summary": "Emerald Sage Investment Ltd has pledged 6,30,50,966 equity shares of Apollo Tyres Limited, representing 9.93% of the company's paid-up share capital, in favor of Catalyst Trusteeship Limited as security agent for certain lenders. The pledge was created on 01 December 2025, with Apollo Tyres' total equity share capital remaining at INR 63,51,00,946.",
            "Sentiment": "neutral",
            "PublishDate": 1764824532980,
            "Source": "corporate_action"
        },
        {
            "Title": "Apollo Tyres Appoints Two Independent Directors Through Postal Ballot",
            "Summary": "Apollo Tyres Board approved seeking shareholder consent via postal ballot to appoint Rajendra Chitale and Tapan Mitra as Independent Directors effective February 9, 2026 for three-year terms. The appointments bring expertise from a renowned Chartered Accountant with regulatory experience and a seasoned HR professional with 40 years of manufacturing industry experience.",
            "Sentiment": "positive",
            "PublishDate": 1764588017455,
            "Source": "corporate_governance"
        },
        {
            "Title": "Catalyst Trusteeship Releases Pledge on 63 Million Apollo Tyres Shares Worth 9.93% Stake",
            "Summary": "Catalyst Trusteeship Limited released its pledge on 63,050,966 equity shares of Apollo Tyres Limited, representing 9.93% of the company's paid-up share capital on November 17, 2025. The pledge was originally created by Emerald Sage Investment Ltd in favor of Catalyst Trusteeship as security agent for certain lenders, and the release eliminates the encumbrance on these shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763610907545,
            "Source": "corporate_action"
        },
        {
            "Title": "Apollo Tyres Reports 6% Revenue Growth and 14.9% EBITDA Margin in Q2FY26",
            "Summary": "Apollo Tyres achieved consolidated revenue of INR 68.3 billion with 6% year-on-year growth and EBITDA margin of 14.9%, marking the highest revenue growth in 10 quarters driven by GST rationalization benefits and recovery in export markets. The company secured title sponsorship of the Indian cricket team and expects to maintain growth momentum in H2 with stable raw material costs and strong replacement demand recovery.",
            "Sentiment": "positive",
            "PublishDate": 1763460165286,
            "Source": "earnings"
        },
        {
            "Title": "Apollo Tyres Reports Q2FY26 Results with Revenue Growth and Margin Expansion",
            "Summary": "Apollo Tyres delivered consolidated revenue of INR 68,311 million in Q2FY26, marking 6.1% year-over-year growth with EBITDA margins improving to 14.9% from 13.6% in the previous quarter. The company achieved its highest year-over-year growth in 10 quarters driven by demand recovery, GST rationalization, and export recovery, while maintaining disciplined capital expenditure and low leverage with net debt to EBITDA at 0.8x.",
            "Sentiment": "neutral",
            "PublishDate": 1763099017745,
            "Source": "earnings"
        },
        {
            "Title": "Apollo Tyres Receives Customs Order for Rs 12.69 Lacs Penalty Over Anti-Dumping Duty Dispute",
            "Summary": "Apollo Tyres Ltd received an order from the Joint Commissioner (Customs), Nhava Sheva under the Customs Act demanding Anti-Dumping Duty and imposing a penalty and fine of Rs 12.69 lacs. The order relates to a dispute regarding short payment of Anti-Dumping Duty. Apollo Tyres plans to file an appeal before the Appellate Authority and states there is no material impact on the company's financial, operations or other activities.",
            "Sentiment": "neutral",
            "PublishDate": 1761632719400,
            "Source": "stock"
        },
        {
            "Title": "Apollo Tyres Targets Double-Digit Growth with GST Cut and Cricket Sponsorship Deal",
            "Summary": "Apollo Tyres aims for double-digit revenue growth in 2025-26 and 2026-27, driven by stronger domestic demand and a GST rate reduction from 28% to 18% on tyres. Vice Chairman and Managing Director Neeraj Kanwar stated the company will pass the full GST benefit to customers, which is expected to lower vehicle maintenance costs and stimulate demand. The company secured a ₹579 crore deal to become the Indian cricket team's jersey sponsor through March 2028, covering 121 bilateral games and 21 ICC matches, replacing Dream11. The partnership aims to strengthen consumer trust and enhance brand visibility in India, where Apollo generates 65% of its revenues, and across global cricket markets. Apollo Tyres has a market capitalization of ₹30,732 crore, with shares trading at ₹483.60 and declining 5% over the past year.",
            "Sentiment": "positive",
            "PublishDate": 1758174701097,
            "Source": "stock"
        },
        {
            "Title": "Apollo Tyres Signs ₹579 Crore BCCI Sponsorship Deal Despite 'Sponsor Jinx' Concerns",
            "Summary": "Apollo Tyres signed a ₹579 crore contract with the BCCI on September 16, 2025, for a period of two and a half years till March 2028. The deal is significantly higher than Dream11's previous ₹358 crore agreement for the same duration. Vice-Chairman and MD Neeraj Kanwar acknowledged awareness of the 'sponsor jinx' affecting past Indian cricket team jersey partners including Sahara, Byju's, and Dream11, but expressed confidence in Apollo's strong foundations since 1976. The sponsorship covers men's and women's jerseys across all formats, including 121 bilateral fixtures and 21 ICC matches. The BCCI was without a shirt sponsor after Dream11 exited following the central government's ban on real-money gaming platforms. Kanwar emphasized the synergy between Apollo and Team India, describing it as one institution partnering with another.",
            "Sentiment": "positive",
            "PublishDate": 1758172111392,
            "Source": "stock"
        },
        {
            "Title": "Apollo Tyres Signs Indian Cricket Team Jersey Sponsorship Deal Until 2027",
            "Summary": "Apollo Tyres has entered into a sponsorship agreement for the Indian cricket team's jersey, with the deal extending until 2027. The partnership positions the tire manufacturer as a sponsor of the national cricket team's apparel for the specified period.",
            "Sentiment": "positive",
            "PublishDate": 1758014705445,
            "Source": "stock"
        },
        {
            "Title": "Apollo Tyres Gets Approval for ₹11 Billion Chittoor Plant Expansion with State Support",
            "Summary": "Apollo Tyres has received approval from Andhra Pradesh for expanding its Chittoor plant. The expansion project is valued at ₹11 billion, and the company will receive ₹3 billion in support from the state government over a 10-year period.",
            "Sentiment": "positive",
            "PublishDate": 1757317027318,
            "Source": "stock"
        },
        {
            "Title": "Apollo Tyres Wins ₹3,016 Million Tax Appeal at CESTAT",
            "Summary": "CESTAT (Customs, Excise and Service Tax Appellate Tribunal) ruled in favor of Apollo Tyres Ltd in a pending litigation case worth ₹3,016 million. The tribunal validated the company's excise duty payments based on transaction value but rejected claims for MRP (Maximum Retail Price) payment.",
            "Sentiment": "positive",
            "PublishDate": 1756686142526,
            "Source": "stock"
        },
        {
            "Title": "Apollo Tyres Wins ₹3016 Million Litigation Appeal on Excise Duty Dispute",
            "Summary": "Apollo Tyres has won an appeal in a ₹3016 million litigation case. The ruling confirmed that excise duty should be calculated on transaction value, while the company's claim for payment based on Maximum Retail Price (MRP) was denied.",
            "Sentiment": "positive",
            "PublishDate": 1756544885189,
            "Source": "stock"
        },
        {
            "Title": "Apollo Tyres Reports 3.6% Revenue Growth with Margin Pressures in Europe Operations",
            "Summary": "Apollo Tyres reported consolidated revenue of INR 65.6 billion for the quarter, marking a 3.6% year-on-year growth. The company achieved an EBITDA margin of 13.2%, slightly improved from the previous quarter's 13.0% but lower than 14.4% in the same quarter last year. India operations showed 3% revenue growth to INR 47.3 billion with EBITDA margin improving to 13.6% from 11.2% in the previous quarter. The company reduced consolidated net debt by over 15% to INR 21 billion, bringing net debt to EBITDA ratio to 0.7x. Europe operations faced challenges with flat revenue at EUR 146 million year-on-year but significant sequential decline due to weak market conditions and seasonality. European EBITDA margin dropped to 10.8% from 13.7% in the same quarter last year. The company recorded an exceptional charge of INR 3.7 billion related to restructuring costs for the planned closure of its Netherlands plant in summer 2026. Apollo Tyres received approvals from a German passenger vehicle manufacturer and launched the Apollo Aspire 5 ultra-high performance tyre. The premium Vredestein brand recorded its highest ever volumes. Management expects stronger topline growth ahead, driven by replacement segment recovery in India and seasonal improvement in Europe.",
            "Sentiment": "neutral",
            "PublishDate": 1754991859459,
            "Source": "earnings"
        },
        {
            "Title": "Apollo Tyres Reports Sharp Drop in Q1 Net Profit Despite Revenue Growth",
            "Summary": "Apollo Tyres reported Q1 consolidated net profit of 129 million rupees, down significantly from 3.02 billion rupees in the same quarter last year. The company's revenue increased to 65.61 billion rupees from 63.3 billion rupees year-over-year. Exceptional items for the quarter totaled 3.7 billion rupees compared to 404 million rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754569570193,
            "Source": "earnings"
        },
        {
            "Title": "Apollo Tyres Schedules Board Meeting on August 7 to Approve Quarterly Financial Results",
            "Summary": "Apollo Tyres Ltd will hold a Board of Directors meeting on August 7, 2025, to consider and approve the un-audited financial results for the quarter ended June 30, 2025. The results will include both standalone and consolidated financials. The company's trading window for securities remains closed from July 1, 2025, and will continue until August 9, 2025, which is 48 hours after the declaration of the financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1754046657232,
            "Source": "corporate_action"
        },
        {
            "Title": "Apollo Tyres Ltd: Targets Double-Digit Growth, Q1 Outlook Positive",
            "Summary": "Apollo Tyres expects better Q1 earnings, targeting double-digit growth. Management sees potential outperformance vs peers in Q1, with growth in OEM and exports. Q4 saw 48% decline in net profit, but replacement market remains robust. Raw material costs stable, minimal tariff impact.",
            "Sentiment": "positive",
            "PublishDate": 1747376725000,
            "Source": "earnings"
        },
        {
            "Title": "Apollo Tyres Expects European Recovery and Debt Reduction",
            "Summary": "Apollo Tyres anticipates improved operating performance in Europe with additional capacity coming online later in 2025. The company has also reduced its gross debt from Rs 39 billion in March 2024 to Rs 34 billion in March 2025, strengthening its balance sheet.",
            "Sentiment": "positive",
            "PublishDate": 1747293281000,
            "Source": "default"
        },
        {
            "Title": "Apollo Tyres: Q4 Profit Plunges 48% YoY, Revenue Up 2.6%",
            "Summary": "Apollo Tyres reported a 47.8% YoY decline in Q4 FY25 net profit to Rs 85 crore. Revenue increased 2.6% YoY to Rs 6,424 crore. EBITDA fell 18.6% to Rs 837 crore, with margins contracting 341 bps to 13%. The company declared a dividend of Rs 50 per share.",
            "Sentiment": "negative",
            "PublishDate": 1747280625000,
            "Source": "earnings"
        },
        {
            "Title": "Apollo Tyres Reports Q4 FY23 Financial Results",
            "Summary": "Apollo Tyres announced its Q4 FY23 results. Consolidated net profit decreased to 1.85 billion rupees from 3.54 billion rupees year-over-year. Revenue increased to 64 billion rupees from 62.58 billion rupees year-over-year. The company reported an exceptional item of 1.2 billion rupees. Profit before tax (PBT) decreased to 3.8 billion rupees from 6 billion rupees year-over-year. The company has recommended a dividend of 5 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747267799000,
            "Source": "default"
        },
        {
            "Title": "Apollo Tyres: Q4 Profit Plunges 48%, Revenue Grows 2.6%",
            "Summary": "Apollo Tyres reported a 48% decline in Q4 FY25 consolidated profit to ₹185 crore, while revenue increased 2.6% YoY to ₹6,423 crore. The company acknowledged underperformance in sales. For FY25, net profit fell to ₹1,121 crore from ₹1,722 crore in FY24. The board recommended a dividend of ₹5 per share.",
            "Sentiment": "negative",
            "PublishDate": 1747233703000,
            "Source": "earnings"
        },
        {
            "Title": "Apollo Tyres Q4 Results: Profit Declines, Dividend Announced",
            "Summary": "Apollo Tyres reported a decrease in Q4 net profit to 1.85 billion rupees, down from 3.54 billion rupees year-over-year. Revenue increased slightly to 64 billion rupees from 62.58 billion rupees. The company's EBITDA margin declined to 13.04% from 16.43%. An exceptional item of 1.2 billion rupees was reported. Despite the profit decline, Apollo Tyres recommended a dividend of 5 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747233468000,
            "Source": "result"
        },
        {
            "Title": "Apollo Tyres to Consider Q4 Results on May 14",
            "Summary": "Apollo Tyres has announced that it will consider its fourth quarter financial results on May 14. This indicates the company is preparing to release its earnings report for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1746707350000,
            "Source": "default"
        },
        {
            "Title": "Apollo Tyres Increases Stake in Green Infra Wind Power Projects",
            "Summary": "Apollo Tyres has acquired an additional 3.43% equity share capital in Green Infra Wind Power Projects Ltd (GIWPPL). This acquisition increases Apollo Tyres' total shareholding in GIWPPL to 21.27%.",
            "Sentiment": "positive",
            "PublishDate": 1745885362000,
            "Source": "default"
        },
        {
            "Title": "Apollo Tyres Increases Stake in Green Infra Wind Power Projects",
            "Summary": "Apollo Tyres has acquired an additional 3.43% equity share capital in Green Infra Wind Power Projects Ltd (GIWPPL). This acquisition increases Apollo Tyres' total shareholding in GIWPPL to 21.27%.",
            "Sentiment": "positive",
            "PublishDate": 1745844383000,
            "Source": "default"
        },
        {
            "Title": "Apollo Tyres: Netherlands Plant to Cease Production by 2026",
            "Summary": "Apollo Tyres' Netherlands subsidiary ATNL will discontinue tyre production at its Enschede plant by summer 2026 due to high costs. The decision is subject to Works Council advice and Supervisory Board approval. In FY2024, ATNL contributed 6% to Apollo's consolidated revenue and PBT.",
            "Sentiment": "negative",
            "PublishDate": 1745638384000,
            "Source": "corporate_action"
        },
        {
            "Title": "Apollo Tyres to Close Dutch Plant, Eliminating 500 Jobs",
            "Summary": "Apollo Tyres has announced plans to close its plant in the Netherlands, resulting in the loss of approximately 500 jobs, according to the FNV labour union. This decision represents a significant restructuring move for the company, likely aimed at optimizing operations and reducing costs.",
            "Sentiment": "negative",
            "PublishDate": 1745587658000,
            "Source": "default"
        },
        {
            "Title": "UBS Reports Positive Growth Drivers for Apollo Tyres in Europe and China",
            "Summary": "UBS has reported that Apollo Tyres is experiencing another month of positive growth drivers, particularly in the replacement tire market. The growth is primarily driven by strong performance in Europe and China.",
            "Sentiment": "positive",
            "PublishDate": 1742364428000,
            "Source": "normal_news"
        },
        {
            "Title": "Apollo Tyres: Q3 Results Show Margin Improvement",
            "Summary": "Apollo Tyres' Q3 results indicate improved margin outlook due to normalizing raw material costs. The company has gained market share and pricing power over recent years. Nirmal Bang maintains a 'Buy' rating on the stock.",
            "Sentiment": "positive",
            "PublishDate": 1739162348000,
            "Source": "earnings"
        },
        {
            "Title": "Apollo Tyres: Q3 Profit Falls Short, Revenue Beats Expectations",
            "Summary": "Apollo Tyres reported a 32.1% decline in Q3 FY25 net profit to ₹337.2 crore, missing estimates. Revenue rose 5% YoY to ₹6,928 crore, beating expectations. EBITDA fell 21.6% to ₹947 crore, with margins contracting to 13.7% from 18.3% YoY due to higher input costs and competitive pressures.",
            "Sentiment": "negative",
            "PublishDate": 1738844656000,
            "Source": "earnings"
        },
        {
            "Title": "Apollo Tyres Ltd: Large Block Trade on NSE",
            "Summary": "A significant block trade of Apollo Tyres Ltd shares occurred on the National Stock Exchange (NSE). Approximately 400,785 shares were traded at a price of Rs. 502.80 per share, totaling Rs. 20.15 crores in value.",
            "Sentiment": "neutral",
            "PublishDate": 1736224277000,
            "Source": "block_deals"
        },
        {
            "Title": "Apollo Tyres: Mixed Q4 Results with Strong European Performance",
            "Summary": "Apollo Tyres reported Q4 results that missed headline estimates. However, the company's key European business outperformed expectations. Positive factors include a correction in rubber prices from recent highs, which could benefit the company's cost structure.",
            "Sentiment": "neutral",
            "PublishDate": 1731556910000,
            "Source": "result"
        },
        {
            "Title": "Apollo Tyres Reports Q2 Results and Approves Fund Raising",
            "Summary": "Apollo Tyres announced its Q2 financial results, with consolidated net profit at 2.97 billion rupees, down from 4.74 billion rupees year-over-year and 3 billion rupees quarter-over-quarter. Revenue increased to 64.4 billion rupees from 62.79 billion rupees year-over-year. The company also approved raising funds up to 10 billion rupees through the issue of non-convertible debentures.",
            "Sentiment": "neutral",
            "PublishDate": 1731549009000,
            "Source": "result"
        },
        {
            "Title": "Apollo Tyres Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Apollo Tyres has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 8.8 billion rupees from 11.6 billion rupees year-over-year. The EBITDA margin also declined to 13.64% from 18.47% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731508173000,
            "Source": "result"
        },
        {
            "Title": "Apollo Tyres Reports Q2 Revenue Growth",
            "Summary": "Apollo Tyres announced its second quarter revenue for the current fiscal year. The company reported revenue of 64.4 billion rupees, compared to 62.79 billion rupees in the same quarter of the previous year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731508018000,
            "Source": "result"
        },
        {
            "Title": "Apollo Tyres Reports Q2 FY24 Results",
            "Summary": "Apollo Tyres announced its consolidated net profit for the second quarter of the fiscal year 2024. The company reported a net profit of 2.97 billion rupees, which is lower compared to 4.74 billion rupees in the same quarter last year (YoY) and 3 billion rupees in the previous quarter (QoQ).",
            "Sentiment": "negative",
            "PublishDate": 1731507979000,
            "Source": "result"
        },
        {
            "Title": "Apollo Tyres to Consider Fund Raising via NCD Private Placement",
            "Summary": "Apollo Tyres has announced a board meeting scheduled for November 13 to discuss and potentially approve raising funds through the issuance of Non-Convertible Debentures (NCDs) via private placement.",
            "Sentiment": "neutral",
            "PublishDate": 1731068920000,
            "Source": "corporate_action"
        }
    ]
}