{
    "Symbol": "APOLLOHOSP",
    "ISIN": "INE437A01024",
    "News": [
        {
            "Title": "Apollo Hospitals Subsidiary Acquires Bangalore Hospital",
            "Summary": "Imperial Hospital and Research Centre Limited, Apollo Hospitals' subsidiary, completed acquisition of Belenus Champion Hospitals for Rs 1,650 million, expanding 125-bed facility to 175 beds.",
            "Sentiment": "positive",
            "PublishDate": 1770748657275,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apollo Hospitals Q3FY26 Results Show Strong Growth",
            "Summary": "Apollo Hospitals Enterprise Limited reported strong Q3FY26 results with consolidated revenue growing 17% YoY to Rs. 6,477 crore and PAT increasing 35% YoY to Rs. 502 crore. The company also declared an interim dividend of Rs. 10 per share.",
            "Sentiment": "positive",
            "PublishDate": 1770729620790,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apollo Hospitals Block Trade Worth Rs. 55.83 Crores",
            "Summary": "Apollo Hospitals Enterprise Ltd. witnessed a significant NSE block trade valued at Rs. 55.83 crores involving approximately 78,657 shares at Rs. 7097.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1770358864490,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apollo Hospitals Q3 FY26 Earnings Call on Feb 11",
            "Summary": "Apollo Hospitals Enterprise Limited announces conference call for analysts and investors on February 11, 2026 at 2:00 PM IST to discuss Q3 FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769751024431,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apollo Hospitals Gets AA+ Rating Reaffirmation",
            "Summary": "CRISIL reaffirms Apollo Hospitals' AA+ rating with positive outlook revision for Rs. 2800 crores bank facilities and Rs. 19 crores debentures, citing strong market position and improving financials.",
            "Sentiment": "positive",
            "PublishDate": 1769520404207,
            "Source": "stocks"
        },
        {
            "Title": "Apollo Hospitals: Schroders reduces stake to 2.99%",
            "Summary": "Schroder Investment Management sold 206,610 shares of Apollo Hospitals Enterprise Ltd on 21 January 2026, reducing their stake from 3.14% to 2.99% through open market transactions.",
            "Sentiment": "neutral",
            "PublishDate": 1769489681790,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apollo Hospitals Gets Nod for 30.58% Stake Acquisition",
            "Summary": "Apollo Hospitals Enterprise receives regulatory permission to acquire an additional 30.58% stake in its subsidiary Apollo Health And Lifestyle, strengthening its position in the wellness segment.",
            "Sentiment": "positive",
            "PublishDate": 1768914204473,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apollo Hospitals Board Meet on Feb 10 for Q3 Results",
            "Summary": "Apollo Hospitals Enterprise Limited announces board meeting scheduled for February 10, 2026 to approve Q3FY26 unaudited financial results. Trading window remains closed till February 12, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768556787760,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apollo Hospitals to Announce Q3 Results on Feb 10",
            "Summary": "Apollo Hospitals Enterprise has scheduled the consideration of its third quarter financial results for February 10, marking an important milestone for stakeholders tracking the healthcare major's performance.",
            "Sentiment": "neutral",
            "PublishDate": 1768556368640,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apollo Hospitals Block Trade Worth ₹16.65 Crores",
            "Summary": "Apollo Hospitals Enterprise Ltd. witnessed a significant block trade on NSE worth ₹16.65 crores involving 22,947 shares at ₹7,257.00 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768279554706,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apollo Hospitals Demerger Driven by Business Strategy",
            "Summary": "Managing Director Suneeta Reddy clarifies that Apollo's restructuring to spin off pharmacy and digital health businesses is a board-driven decision for shareholder value, dismissing family rift speculation.",
            "Sentiment": "neutral",
            "PublishDate": 1768266387269,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apollo Hospitals' Lower Margins Explained",
            "Summary": "Apollo Hospitals reports 15% EBITDA margin vs peers' 24-27% due to diversified business model including low-margin pharmacy (₹2,660 cr revenue) and loss-making diagnostics, while standalone hospital operations achieve 25% EBITDA margin.",
            "Sentiment": "neutral",
            "PublishDate": 1768059845445,
            "Source": "stocks"
        },
        {
            "Title": "Apollo Hospitals, Max Health face earnings downgrades",
            "Summary": "Macquarie maintains 'Underperform' ratings on Apollo Hospitals and Max Healthcare, citing aggressive sector capacity expansion and potential EBITDA drag from new hospitals affecting earnings outlook.",
            "Sentiment": "negative",
            "PublishDate": 1767939495974,
            "Source": "stocks"
        },
        {
            "Title": "Macquarie Raises Apollo Hospitals Target to ₹6,230",
            "Summary": "Macquarie maintains Underperform rating on Apollo Hospitals while raising target price to ₹6,230 from ₹5,700, representing a 9.3% upward revision in valuation despite continued cautious outlook.",
            "Sentiment": "neutral",
            "PublishDate": 1767931032256,
            "Source": "stocks"
        },
        {
            "Title": "Apollo Hospitals Block Trade Worth ₹236.09 Crores",
            "Summary": "Apollo Hospitals Enterprise executed a major NSE block trade worth ₹236.09 crores involving 319,564 shares at ₹7,388.00 per share, reflecting significant institutional activity in the healthcare stock.",
            "Sentiment": "neutral",
            "PublishDate": 1767848042473,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apollo Hospitals Block Trade Worth ₹17.65 Crores",
            "Summary": "Apollo Hospitals Enterprise Ltd. witnessed a significant NSE block trade worth ₹17.65 crores involving 25,217 shares at ₹6,998.00 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767157721427,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apollo Hospitals Acquires 51% Healthcare Startup Stake",
            "Summary": "Apollo Hospitals has acquired a majority 51% stake in a healthcare startup to enhance its digital services capabilities and improve overall patient care delivery across its network.",
            "Sentiment": "positive",
            "PublishDate": 1767157096863,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apollo Hospitals Gets NSE Nod for Corporate Restructuring",
            "Summary": "Apollo Hospitals Enterprise receives NSE approval for composite arrangement involving demerger and amalgamation. Company now awaits shareholder and regulatory approvals to complete the restructuring process.",
            "Sentiment": "positive",
            "PublishDate": 1766551522015,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apollo Hospitals Receives Stock Exchange Approval for Employee Stock Option Plan",
            "Summary": "Apollo Hospitals Enterprise Limited received in-principle approval from BSE and NSE for issuing and allotting a maximum of 21,56,770 equity shares of Rs. 5 each under the Apollo Hospitals Enterprise Limited - Employee Stock Option Plan 2024. BSE granted approval via letter dated November 7, 2025, and NSE provided similar approval on the same date. The approvals are subject to various conditions including regulatory compliance, payment of prescribed fees, receipt of statutory approvals, and adherence to listing agreement conditions. Both exchanges reserve the right to withdraw approval if submitted information is found incomplete or incorrect.",
            "Sentiment": "positive",
            "PublishDate": 1762596521656,
            "Source": "corporate_action"
        },
        {
            "Title": "Apollo Hospitals Plans 1,600 Bed Expansion in 14 Months to Drive 18% Revenue Growth",
            "Summary": "Apollo Hospitals Enterprise plans to add 1,600 beds over the next 14 months, targeting 18% revenue growth in its hospital business over three years. Managing Director Suneeta Reddy stated that existing operations will grow at 12% while new beds will contribute an additional 5% to revenue. The company added 148 pharmacy stores and expects double-digit margins from the pharmacy business within three to four years. Apollo has a remaining capital expenditure of Rs 5,000 crore as part of a broader plan to add 4,300 beds with total capex of Rs 8,300 crore. The company targets improving Ebitda margins to 25% through better case mix, operating leverage, and cost efficiencies. Apollo Hospitals shares closed down 1.8% at Rs 7,642 on the NSE.",
            "Sentiment": "positive",
            "PublishDate": 1762520601614,
            "Source": "stock"
        },
        {
            "Title": "Apollo Hospitals Plans Revenue Generation from Six New Hospital Openings, Explores Uzbekistan Expansion",
            "Summary": "Apollo Hospitals announced plans to generate revenue from six new hospitals that are set to open soon. The healthcare company is also discussing potential business opportunities in Uzbekistan as part of its expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1762492662332,
            "Source": "stock"
        },
        {
            "Title": "Apollo Hospitals Targets ₹30,000 Cr Revenue By FY27 Through Multi-Pronged Growth Strategy",
            "Summary": "Apollo Hospitals has outlined its growth strategy targeting double-digit expansion driven by new hospital additions, diagnostics business expansion, and its digital health platform Apollo 24/7. The company aims to cross ₹30,000 crore in revenue by FY27. The growth plan focuses on asset-light franchising models, preventive care services, and expanding international patient business. Apollo Hospitals also targets margin expansion through improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1762441146704,
            "Source": "stock"
        },
        {
            "Title": "Apollo Hospitals Enterprise Reports Strong Q2 Growth with 26% Jump in Net Profit",
            "Summary": "Apollo Hospitals Enterprise reported quarterly net profit of 4.77 billion rupees compared to 3.79 billion rupees in the same period last year. Revenue increased to 63 billion rupees from 55.9 billion rupees year-over-year. EBITDA rose to 9.4 billion rupees from 8.16 billion rupees, while EBITDA margin improved to 14.93% from 14.59% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762434138668,
            "Source": "earnings"
        },
        {
            "Title": "Apollo Hospitals' Preetha Reddy Advocates AI Solutions to Address Healthcare Staffing Shortage",
            "Summary": "Preetha Reddy, Vice Chairperson of Apollo Hospitals, highlighted India's healthcare staffing challenges at the India Business Leader Awards 2025. She emphasized that India has a large consumer base but insufficient trained medical professionals to serve them. Reddy proposed using artificial intelligence and technology as solutions to bridge this manpower gap. Apollo Hospitals has developed the Clinicians Intelligence Engine, a technology system that supports doctors in making faster decisions. The platform has created 260 clinical pathways to help medical professionals determine appropriate actions in real-time scenarios, including emergency room cases. The AI-based decision-support system aims to streamline patient care while maintaining accuracy and efficiency, allowing medical practitioners to focus on more complex work. Reddy noted that such technological solutions could also benefit public sector hospitals by improving accessibility and consistency in patient care across the country.",
            "Sentiment": "positive",
            "PublishDate": 1761928762498,
            "Source": "stock"
        },
        {
            "Title": "Apollo Hospitals Schedules Q2 FY26 Earnings Conference Call for November 7, 2025",
            "Summary": "Apollo Hospitals Enterprise Limited will host a conference call for analysts and investors on November 7, 2025 at 10:20 AM IST to discuss unaudited financial results for the three and six months ended September 30, 2025. The call will be led by key executives including Managing Director Mrs. Suneeta Reddy, Group CFO Mr. A. Krishnan, and other senior leadership from various divisions. The financial results will be announced on November 6, 2025, with earnings presentation available on the company's website. Apollo operates over 10,000 beds across 73 hospitals, over 6,000 pharmacies, and over 2,500 clinics and diagnostic centers globally.",
            "Sentiment": "neutral",
            "PublishDate": 1761837205719,
            "Source": "earnings"
        },
        {
            "Title": "Apollo Hospitals Schedules Board Meeting on November 6, 2025 for Q2 FY2026 Results",
            "Summary": "Apollo Hospitals Enterprise Ltd will hold a Board of Directors meeting on November 6, 2025 to consider and approve unaudited financial results for the three and six months ended September 30, 2025. The company has implemented a trading window closure for promoters, directors, connected persons and designated employees from October 1, 2025 until November 8, 2025, which is 48 hours after the financial results announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1760440421460,
            "Source": "corporate_action"
        },
        {
            "Title": "Apollo Hospitals Receives CCI Approval for Composite Scheme of Arrangement",
            "Summary": "Apollo Hospitals Enterprise Limited has received approval from the Competition Commission of India for a composite scheme of arrangement involving Apollo Healthco Limited, Keimed Private Limited, and Apollo Healthtech Limited. The scheme was approved by Apollo Hospitals' board on June 30, 2025. The CCI granted its approval on September 23, 2025, under Section 31(1) of the Competition Act, 2002. The scheme remains subject to other necessary statutory and regulatory approvals. A certified copy of the CCI's order is awaited.",
            "Sentiment": "positive",
            "PublishDate": 1758714678065,
            "Source": "corporate_action"
        },
        {
            "Title": "Apollo Hospitals Enterprise Sees Rs. 85.23 Crore Block Trade on NSE",
            "Summary": "Apollo Hospitals Enterprise Ltd. recorded a block trade worth Rs. 85.23 crores on the National Stock Exchange. The transaction involved approximately 111,089 shares at a price of Rs. 7,672.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1758603722046,
            "Source": "order&deals"
        },
        {
            "Title": "Apollo Hospitals Acquires IFC's 30.8% Stake in Subsidiary for ₹1,254 Crore, Plans ₹573 Crore Oncology Facility",
            "Summary": "Apollo Hospitals Enterprise will purchase IFC's 30.8% stake in subsidiary Apollo Health and Lifestyle (AHLL) for ₹1,254.07 crore in an all-cash transaction at ₹301.09 per share. This acquisition will increase Apollo's ownership in AHLL to 99.42%. AHLL reported turnover of ₹1,553.5 crore in financial year 2025. Apollo stated the acquisition enables sharper capital allocation and greater focus on high-potential segments. Additionally, Apollo is establishing a comprehensive oncology facility in Gurugram for ₹573 crore as part of a 500-bed hospital, scheduled for completion in financial year 2029. The facility will feature Single Gantry Proton Proteus One System technology, marking India's third proton therapy installation. Apollo aims to double oncology therapy revenue to ₹5,000 crore within three to four years. Nomura maintains a neutral rating with a target price of ₹6,856, representing a 12.8% downside from the previous closing price of ₹7,864.5. Among 32 analysts covering the stock, 28 have buy ratings, three hold, and one sell. Apollo shares closed 0.19% lower in the previous session but have gained 25.9% over six months.",
            "Sentiment": "positive",
            "PublishDate": 1757904530274,
            "Source": "order&deals"
        },
        {
            "Title": "Apollo Hospitals Acquires 30.58% Stake in Subsidiary AHLL for ₹1,254 Crore and Plans ₹573 Crore Oncology Facility in Gurugram",
            "Summary": "Apollo Hospitals Enterprise Limited's board approved the acquisition of a 30.58% stake in its subsidiary Apollo Health and Lifestyle Limited (AHLL) from International Finance Corporation (IFC) and IFC EAF for ₹12,540.68 million. The acquisition price is ₹301.09 per share for 41,650,368 equity shares. Following completion, AHLL will become a 99.42% subsidiary with the remaining 0.58% in the ESOP pool. The transaction requires Competition Commission of India approval and is expected to complete by November 2025. AHLL operates specialty hospitals, clinics, diagnostic centers, and dental facilities with a turnover of ₹15,535 million for the year ended March 31, 2025. Additionally, Apollo approved setting up a comprehensive oncology facility in Gurugram with a ₹5,730 million investment, featuring a Single Gantry Proton Proteus One System. The facility will add capacity to treat an additional 350 patients annually by 2029, funded through internal accruals. Apollo aims to double its oncology business scale to over ₹5,000 crore in 3-4 years.",
            "Sentiment": "positive",
            "PublishDate": 1757685351725,
            "Source": "order&deals"
        },
        {
            "Title": "Apollo Hospitals' Suneeta Reddy Sees Healthcare Tourism as Buffer Against US Tariff Impact",
            "Summary": "Suneeta Reddy, Managing Director of Apollo Hospitals Enterprise Limited, stated that India's healthcare tourism could offset negative impacts from US tariffs on India. Speaking at the 52nd National Management Convention of AIMA, Reddy highlighted a $100 billion opportunity in healthcare tourism, suggesting that capturing 20% of this market worth $20 billion by 2030 could compensate for tariff losses through medical value travel. She emphasized India's premium healthcare infrastructure delivers clinical outcomes at one-tenth of international costs and called for better connectivity with countries lacking advanced healthcare systems. Reddy advocated for GST input cost reforms similar to the education sector and welcomed recent GST rate cuts, linking them to personal income tax reductions that have increased consumer spending on insurance, education, and health. She noted that GST cuts on construction materials like bricks, granite, and marble will reduce healthcare infrastructure costs.",
            "Sentiment": "positive",
            "PublishDate": 1757415514391,
            "Source": "stock"
        },
        {
            "Title": "GST Council's Health Insurance Tax Exemption to Boost Healthcare Accessibility",
            "Summary": "The GST Council exempted health insurance premiums from indirect tax, which Apollo Hospitals MD Suneeta Reddy says will make insurance more affordable and expand coverage. The broader GST reforms include scrapping 12% and 28% slabs for 5% and 18% rates, with a 40% rate for sin goods. Life-saving cancer and chronic care drugs will have 0% GST instead of 12%, while most other medications will attract 5%. Hospital consumables, diagnostics, reagents, and bandages will move to 5% GST. Construction materials like cement, fly ash, and granite will see rate cuts, potentially lowering hospital infrastructure costs and encouraging capacity expansion. Reddy noted that while hospital bills may not drop immediately due to lack of input tax credit for hospitals, the rationalization of input costs should gradually make healthcare more affordable, with cancer care expected to benefit significantly.",
            "Sentiment": "positive",
            "PublishDate": 1756989455170,
            "Source": "stock"
        },
        {
            "Title": "Apollo Hospitals Enterprise Block Trade Worth Rs. 60 Crores Executed on NSE",
            "Summary": "Apollo Hospitals Enterprise Ltd. witnessed a block trade on the National Stock Exchange worth Rs. 60 crores. The transaction involved approximately 76,280 shares at a price of Rs. 7,866 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1756969416426,
            "Source": "order&deals"
        },
        {
            "Title": "Apollo Hospitals Promoter Suneetha Reddy Plans to Sell 1.25% Stake for ₹1,395 Crore",
            "Summary": "Suneetha Reddy, a promoter of Apollo Hospitals, plans to sell 18 lakh shares representing a 1.25% stake in the company through a block deal. The transaction is valued at ₹1,395 crore at a price of ₹7,747 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1755776086401,
            "Source": "order&deals"
        },
        {
            "Title": "Apollo Hospitals Targets 13-14% Revenue Growth, Plans 4,400 Bed Expansion",
            "Summary": "Apollo Hospitals Enterprise is targeting 13-14% revenue growth in FY26 from existing hospitals, with Managing Director Suneeta Reddy outlining a strategy focused on volume-driven growth and margin improvement. The company expects a 15% compound annual growth rate over four years, with 10% growth coming from new capacity additions. Apollo plans to add 4,400 beds over the next three to four years through acquisitions and new projects, including expansion in western and northern India with new hospitals in Pune and Gurugram. In Bengaluru, the company will add 700 beds, starting with 150 beds in the third quarter. The company is progressing with restructuring Apollo Healthco, expected to be listed as a separate entity within two years, where Apollo shareholders will receive 1.96 shares of Apollo HealthCo. Apollo has established a 19-minute delivery platform in urban centers for its e-pharmacy operations.",
            "Sentiment": "positive",
            "PublishDate": 1755401182043,
            "Source": "stock"
        },
        {
            "Title": "Dr. Prathap Reddy Shares Apollo Hospitals Journey on Leadership Language Show",
            "Summary": "Dr. Prathap C Reddy, founder and chairman of Apollo Hospitals, appeared on CNBC-TV18's Leadership Language show hosted by Shereen Bhan. During the interview, he discussed his journey building Apollo Hospitals into one of India's largest private hospital networks. The Chennai-based healthcare chain founder shared personal stories, challenges faced over four decades, and his guiding philosophy in transforming Indian healthcare.",
            "Sentiment": "positive",
            "PublishDate": 1755262289788,
            "Source": "stock"
        },
        {
            "Title": "Apollo Healthtech Targets January-March 2027 Listing Following Demerger from Apollo Hospitals",
            "Summary": "Apollo Healthtech, the demerged omni-channel pharmacy and digital health business of Apollo Hospitals, is targeting a listing between January-March 2027. The company has applied to stock exchanges for approval and will subsequently file with the Competition Commission of India and National Company Law Tribunal. Apollo Hospitals reported a 42% increase in consolidated net profit to ₹433 crore for the quarter, with revenues growing 15% to ₹5,842 crore driven by higher patient volumes and diagnostic growth. EBITDA rose 26% to ₹852 crore. The hospital chain plans to add 4,370 beds over the next 3-4 years through various expansion methods, with an investment of over ₹7,600 crore. The demerger is positioned as a value unlock for shareholders, with existing promoters maintaining their roles in both companies.",
            "Sentiment": "positive",
            "PublishDate": 1755047708705,
            "Source": "corporate_action"
        },
        {
            "Title": "Apollo Hospitals Plans 85 Million Rupee Investment in Apollo Gleneagles PET-CT",
            "Summary": "Apollo Hospitals has announced plans to invest up to 85 million rupees in Apollo Gleneagles PET-CT. The investment represents the company's expansion in medical imaging services through its subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1755009889608,
            "Source": "stock"
        },
        {
            "Title": "Apollo Hospitals Reports Strong Q1 Results and Acquires 50% Stake in Gleneagles PET-CT",
            "Summary": "Apollo Hospitals Enterprise delivered robust quarterly performance with consolidated net profit rising to 4.33 billion rupees from 3.05 billion rupees year-over-year, surpassing estimates of 3.83 billion rupees. Revenue increased to 58.42 billion rupees compared to 50.85 billion rupees in the previous year. EBITDA grew to 8.52 billion rupees from 6.75 billion rupees year-over-year, exceeding estimates of 7.8 billion rupees, while EBITDA margin improved to 14.58% from 13.27%. The company announced the acquisition of a 50% stake in Gleneagles PET-CT and expects to maintain double-digit revenue growth for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1755005780215,
            "Source": "order&deals"
        },
        {
            "Title": "Apollo Hospitals Enterprise Sees Rs. 62.34 Crore Block Trade on NSE",
            "Summary": "Apollo Hospitals Enterprise Ltd. witnessed a block trade worth Rs. 62.34 crores on the National Stock Exchange. The transaction involved approximately 87,010 shares at a price of Rs. 7,164.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1754539990825,
            "Source": "order&deals"
        },
        {
            "Title": "Apollo Hospitals Subsidiary Directed to Pay INR 4.96 Crore for Foreign Exchange Rule Violation",
            "Summary": "Apollo Hospitals Enterprise Limited disclosed that its subsidiary Apollo Healthco Limited has been directed by the Reserve Bank of India to deposit INR 4,95,50,000 for compounding a contravention of foreign exchange management rules. The RBI order dated July 31, 2025 relates to violation of Rule 4 read with Rule 2(k) of Foreign Exchange Management (Non-debt Instruments) Rules, 2019. Apollo Healthco had filed a compounding application with RBI regarding this contravention. The company stated there is no impact on financial, operational or other activities due to this order, and no further claims, penalties or proceedings are pending. The company remains in compliance with all applicable regulations and confirmed this development does not impact operations, financial health or future outlook.",
            "Sentiment": "neutral",
            "PublishDate": 1754050996231,
            "Source": "stock"
        },
        {
            "Title": "Apollo Hospitals' Shobana Kamineni Advocates for Mainstream Thinking Among Women Leaders",
            "Summary": "Shobana Kamineni, executive vice-chairperson of Apollo Hospitals, spoke at CNBC-TV18's Future Female Forward event in Bengaluru about leadership and women's roles in business. She emphasized that women must think mainstream to lead and grow, noting that women-led businesses receive less funding compared to men-led businesses. Kamineni highlighted that women are less risk-averse and need to be present in places that matter for building scalable businesses. She discussed Apollo's conscious effort to promote women in leadership positions across healthcare roles, stating that women have stronger loyalty and combine command capabilities with care instincts. Kamineni shared that she built Apollo Chennai, Apollo Hyderabad, and Apollo Delhi before age 28, emphasizing competence over age. She advised against complacency and stressed the importance of continuous learning, noting that societal changes for women represent a generational shift that will be accelerated by AI opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1753812981567,
            "Source": "stock"
        },
        {
            "Title": "Apollo Hospitals Schedules Board Meeting to Review Q1 Results",
            "Summary": "Apollo Hospitals has announced a board meeting scheduled for August 12 to review the company's first quarter results.",
            "Sentiment": "neutral",
            "PublishDate": 1752729798000,
            "Source": "default"
        },
        {
            "Title": "Apollo Hospitals Discusses Standardizing Treatment Costs Nationwide",
            "Summary": "Apollo Hospitals is engaged in discussions about standardizing treatment costs across India. The news mentions talks about creating uniform pricing for medical treatments on a national scale.",
            "Sentiment": "neutral",
            "PublishDate": 1752652451000,
            "Source": "default"
        },
        {
            "Title": "Apollo Hospitals: Rs. 34.49 Crore Block Trade on NSE",
            "Summary": "A block trade of approximately 47,878 shares of Apollo Hospitals Enterprise Ltd. was executed on the National Stock Exchange (NSE) for Rs. 34.49 crores. The trade was conducted at a price of Rs. 7,204.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1752470678000,
            "Source": "block_details"
        },
        {
            "Title": "Apollo Hospitals: NSE Block Trade of Rs. 66.71 Crores",
            "Summary": "A block trade of approximately 87,869 shares of Apollo Hospitals Enterprise Ltd. took place on the National Stock Exchange (NSE). The total value of the trade was Rs. 66.71 crores, with each share priced at Rs. 7592.50.",
            "Sentiment": "neutral",
            "PublishDate": 1751950777000,
            "Source": "block_details"
        },
        {
            "Title": "Apollo Hospitals Block Trade: 72,508 Shares Sold for Rs. 54.38 Crores",
            "Summary": "A block trade of approximately 72,508 shares of Apollo Hospitals Enterprise Ltd. occurred on the National Stock Exchange (NSE). The shares were traded at a price of Rs. 7500.50 per share, resulting in a total transaction value of Rs. 54.38 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1751437854000,
            "Source": "block_details"
        },
        {
            "Title": "Apollo Hospitals: Strategic Demerger Announced for Value Creation",
            "Summary": "Apollo Hospitals Enterprise Ltd. announces a strategic demerger to separate its core healthcare services from its digital health and pharmacy distribution business. The move aims to provide sharper focus and dedicated leadership for each entity.",
            "Sentiment": "positive",
            "PublishDate": 1751428057000,
            "Source": "corporate_action"
        },
        {
            "Title": "Apollo Hospitals Enterprise Ltd: Major Restructuring with NewCo Creation",
            "Summary": "Apollo Hospitals is creating a new listed entity by consolidating its pharmacy, digital health, and pharma distribution businesses. Shareholders will receive 195.2 shares of the new company for every 100 shares held. The new entity aims for ₹25,000 crore revenue by FY25 with a 7% EBITDA margin. Listing expected within 18-21 months.",
            "Sentiment": "positive",
            "PublishDate": 1751337172000,
            "Source": "corporate_action"
        },
        {
            "Title": "Apollo Hospitals: Major Restructuring and Digital Health Listing Approved",
            "Summary": "Apollo Hospitals Enterprise Limited's board approved a restructuring plan involving subsidiaries Apollo Healthco, Keimed Private, and Apollo Healthtech. The plan includes demerging and merging operations to create a consolidated Omni Channel Pharmacy and Digital Health platform. Apollo Healthtech will seek listing on NSE and BSE, with AHEL shareholders receiving 195.2 shares in the new entity for every 100 AHEL shares.",
            "Sentiment": "positive",
            "PublishDate": 1751299017000,
            "Source": "corporate_action"
        }
    ]
}