{
    "Symbol": "APOLLOPIPE",
    "ISIN": "INE126J01016",
    "News": [
        {
            "Title": "Apollo Pipes clarifies stock price movement to exchanges",
            "Summary": "Apollo Pipes Limited responds to BSE and NSE queries on price movement, confirming all regulatory disclosures are up to date under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770800930526,
            "Source": "stocks"
        },
        {
            "Title": "Apollo Pipes Q3FY26 Monitoring Report Filed",
            "Summary": "Apollo Pipes submitted Q3FY26 monitoring agency report showing no fund utilization during quarter. Company received Rs. 27.50 crores from preferential issue, awaiting Rs. 82.50 crores balance.",
            "Sentiment": "neutral",
            "PublishDate": 1769689842955,
            "Source": "stocks"
        },
        {
            "Title": "Apollo Pipes Q3FY26 Results Show Mixed Performance",
            "Summary": "Apollo Pipes reported Q3FY26 consolidated revenue of ₹24,718.04 lakhs, down from ₹30,792.65 lakhs in Q3FY25. The company posted a net loss of ₹475.71 lakhs compared to profit of ₹638.66 lakhs in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1769679728256,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apollo Pipes Q3FY26 Earnings Call Set for Jan 30",
            "Summary": "Apollo Pipes Limited has scheduled its Q3FY26 results discussion for January 30, 2026, at 11:30 AM IST. Senior management including CMD Sameer Gupta will participate in the conference call.",
            "Sentiment": "neutral",
            "PublishDate": 1769057863316,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apollo Pipes Reports 8% Volume Growth in Q2 FY26 Amid Industry Headwinds",
            "Summary": "Apollo Pipes Limited reported 8% consolidated sales volume growth in Q2 FY26, though margins remained under pressure due to lower capacity utilization and heightened competition. The company faced challenges from weak end-user demand and volatile PVC resin prices, impacting both private real estate and government infrastructure spending. Apollo is executing a four-pronged strategy including product portfolio expansion with PLB ducts, DWC pipes, PE gas pipes and PVC-O pipes, plus entry into UPVC doors and windows. The company increased focus on CPVC pipes (currently 15% of volume) through a tie-up with Lubrizol for TempRite brand, targeting 25% mix over next 2-3 years. Apollo incurred capex of INR 92 crores in H1 following INR 166 crores in FY25, remaining committed to expanding total installed capacity to 286,000 tons over next 2 years without debt. The West India facility acquired last year is seeing steady production ramp-up, while the new Varanasi plant is expected to commence operations soon. Management expects more favorable demand environment from November onwards post-monsoon, with increased government infrastructure spending anticipated to boost liquidity. The company maintains guidance of achieving around 100,000 tons sales volume for the full year, hoping for macro turnaround support.",
            "Sentiment": "neutral",
            "PublishDate": 1762241070221,
            "Source": "earnings"
        },
        {
            "Title": "Apollo Pipes Reduces Sales Volume Growth Guidance Due to Underperformance",
            "Summary": "Apollo Pipes has lowered its sales volume growth guidance following below-expected performance during the first seven months of the fiscal year. The company's revised outlook reflects weaker-than-anticipated sales volumes during this period.",
            "Sentiment": "negative",
            "PublishDate": 1761982769778,
            "Source": "stock"
        },
        {
            "Title": "Apollo Pipes Plans ₹280 Crore Investment to Expand Chennai Unit Capacity by 15%",
            "Summary": "Apollo Pipes announced a ₹280 crore investment to increase capacity by 15% at its Chennai unit. The expansion aims to meet rising demand in water infrastructure and agriculture sectors. The company will fund this expansion through term loans and is focusing on backward integration and brand-led retail growth strategies.",
            "Sentiment": "positive",
            "PublishDate": 1761754354252,
            "Source": "stock"
        },
        {
            "Title": "Apollo Pipes Reports Decline in Q2 Financial Performance",
            "Summary": "Apollo Pipes reported quarterly EBITDA of 158 million rupees compared to 194 million rupees in the same period last year. The company's EBITDA margin decreased to 6.69% from 7.75% year-over-year. Consolidated net profit fell to 16 million rupees from 42 million rupees in the previous year's corresponding quarter. Revenue declined to 2.36 billion rupees from 2.5 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1761739895157,
            "Source": "earnings"
        },
        {
            "Title": "Apollo Pipes Limited Schedules Q2FY26 Earnings Call for October 30, 2025",
            "Summary": "Apollo Pipes Limited has announced an earnings conference call to discuss its Q2FY26 results scheduled for Thursday, October 30, 2025, at 11:00 AM IST. The call will be attended by key company representatives including Chairman and Managing Director Sameer Gupta, Joint Managing Director Arun Agarwal, Chief Financial Officer Ajay Kumar Jain, and Group Chief Strategy Officer Anubhav Gupta. The company has provided dial-in numbers for participation and registration details for the earnings discussion.",
            "Sentiment": "neutral",
            "PublishDate": 1761133018879,
            "Source": "earnings"
        },
        {
            "Title": "Apollo Pipes Reports Flat Q1 FY26 Volume Growth Amid Industry Challenges",
            "Summary": "Apollo Pipes Limited reported flat year-on-year consolidated sales volume for Q1 FY26, with standalone volumes declining 4%. The company faced pressure from weak end-user demand in private real estate and government infrastructure spending, along with volatile PVC resin prices that led to channel partner destocking. Management highlighted a four-pronged strategy including product portfolio expansion with PLB ducts, DWC pipes, PE gas pipes, PVC-O pipes, and entry into UPVC doors and windows. The company is focusing on improving CPVC contribution from current 15% to above 20% over 1-2 years through partnerships with raw material suppliers. Apollo incurred Rs 70 crores CAPEX in Q1 following Rs 166 crores in FY25, targeting total installed capacity of 2,86,000 tons over next 2 years. The West India facility acquired last year is ramping up production, while the new Varanasi plant is expected to commence operations in coming months. Management expects double-digit volume growth for FY26, anticipating improved demand from September onwards post-monsoon. Current product mix shows 60% housing and 40% agriculture segments.",
            "Sentiment": "neutral",
            "PublishDate": 1755002454157,
            "Source": "earnings"
        },
        {
            "Title": "Apollo Pipes Plans Capacity Expansion to 286,000 TPA by FY27 Despite Q1FY26 Weakness",
            "Summary": "Apollo Pipes has outlined an aggressive expansion plan to increase capacity to 286,000 tonnes per annum by FY27. The company is targeting a revenue compound annual growth rate of over 25% despite experiencing weakness in Q1FY26 results amid challenging macroeconomic conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1754571410006,
            "Source": "stock"
        },
        {
            "Title": "Apollo Pipes Reports Q1 Financial Results and Board Approves Multiple Key Appointments",
            "Summary": "Apollo Pipes Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. On a consolidated basis, the company reported revenue from operations of Rs 27,500.16 lakh and net profit of Rs 816.12 lakh, with basic earnings per share of Rs 1.85. Standalone revenue was Rs 22,000.77 lakh with net profit of Rs 811.29 lakh and basic EPS of Rs 1.84. The Board recommended re-appointment of Mr. Arun Agarwal as Joint Managing Director for three years starting April 1, 2026, and appointment of AKGVG & Associates as new Statutory Auditors for five years, both subject to shareholder approval at the upcoming 39th AGM. The company also appointed new Secretarial Auditors, Cost Auditors, and Internal Auditors. Apollo Pipes acquired an additional 1% stake in subsidiary Kisan Mouldings Limited for Rs 4.95 crore, increasing its holding from 57.6% to 58.6%.",
            "Sentiment": "neutral",
            "PublishDate": 1754559632350,
            "Source": "earnings"
        },
        {
            "Title": "Apollo Pipes Reports Decline in Q1 Profitability and Margins",
            "Summary": "Apollo Pipes reported Q1 EBITDA of 207 million rupees, down from 289 million rupees in the same period last year. The company's EBITDA margin contracted to 7.52% from 9.4% year-over-year. Consolidated net profit fell to 81 million rupees compared to 125 million rupees in the previous year's corresponding quarter. Revenue declined slightly to 3 billion rupees from 3.1 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1754559094034,
            "Source": "earnings"
        },
        {
            "Title": "Apollo Pipes Launches UPVC Doors and Windows Production",
            "Summary": "Apollo Pipes has initiated production of UPVC doors and windows. The company now offers over 250 different products in this category with an annual production capacity of 4000 tons.",
            "Sentiment": "positive",
            "PublishDate": 1752480025000,
            "Source": "default"
        },
        {
            "Title": "Apollo Pipes Sets Ambitious Growth Targets for FY '26 and '27",
            "Summary": "Apollo Pipes has announced internal targets for FY '26 that exceed their guided 25% volume growth, aiming for a volume of 25,000-30,000 tons. The company also expects to add an additional 8,000-9,000 tons in FY '27, as revealed in a recent conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1747107323000,
            "Source": "default"
        },
        {
            "Title": "Apollo Pipes Reports Lower Q4 EBITDA and Margin",
            "Summary": "Apollo Pipes has reported its Q4 financial results. The company's EBITDA decreased to 240 million rupees from 254 million rupees year-over-year. The EBITDA margin also declined to 7.64% from 9.94% compared to the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1746874277000,
            "Source": "result"
        },
        {
            "Title": "Apollo Pipes Reports Strong Q4 Financial Results",
            "Summary": "Apollo Pipes has announced its Q4 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit increased to 98 million rupees, up from 67 million rupees year-over-year and 62 million rupees quarter-over-quarter. Revenue also saw a substantial rise, reaching 3.14 billion rupees compared to 2.6 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1746874058000,
            "Source": "result"
        },
        {
            "Title": "Apollo Pipes Acquires Additional Stake in Kisan Mouldings",
            "Summary": "Apollo Pipes has acquired an additional 0.50% stake in Kisan Mouldings for approximately Rs. 2.58 crores. This acquisition represents a strategic move by Apollo Pipes to increase its ownership in Kisan Mouldings.",
            "Sentiment": "neutral",
            "PublishDate": 1739320318000,
            "Source": "corporate_action"
        },
        {
            "Title": "Apollo Pipes Acquires Additional Stake in Kisan Mouldings",
            "Summary": "Apollo Pipes has acquired an additional 0.50% stake in Kisan Mouldings for approximately Rs. 2.58 crores. This acquisition represents a strategic move by Apollo Pipes to increase its ownership in Kisan Mouldings.",
            "Sentiment": "neutral",
            "PublishDate": 1739278911000,
            "Source": "corporate_action"
        },
        {
            "Title": "Apollo Pipes Reports Q3 EBITDA Growth with Slight Margin Decline",
            "Summary": "Apollo Pipes has announced its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 210 million rupees, up from 201 million rupees in the same quarter last year. However, the EBITDA margin decreased slightly to 8.59% from 9.09% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1737970252000,
            "Source": "earnings"
        },
        {
            "Title": "Apollo Pipes Reports Decline in Q3 Net Profit",
            "Summary": "Apollo Pipes has reported a net profit of 60 million rupees for the third quarter, compared to 91 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1737970157000,
            "Source": "earnings"
        },
        {
            "Title": "Apollo Pipes Schedules Board Meeting for Q3 Results and Fund Raising",
            "Summary": "Apollo Pipes has announced a board meeting on January 27 to consider and approve the company's financial results for the third quarter. Additionally, the board will discuss potential fund-raising options during the same meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1737381112000,
            "Source": "corporate_action"
        },
        {
            "Title": "Apollo Pipes: New Investors Arun Agarwal and Sahil Gupta Acquire Stakes",
            "Summary": "Two new investors, Arun Agarwal and Sahil Gupta, have appeared in Apollo Pipes' shareholding structure during Q3, each acquiring a 1.14% stake in the company. Arun Agarwal's stake is valued at approximately 79.2 crore rupees, while Sahil Gupta's stake is worth about 272.7 crore rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1736985875000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sahil Gupta Acquires 1.14% Stake in Apollo Pipes",
            "Summary": "Investor Sahil Gupta has acquired a 1.14% stake in Apollo Pipes during the third quarter. The stake is valued at approximately 272.7 crore rupees based on the reported net worth.",
            "Sentiment": "neutral",
            "PublishDate": 1736935475000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Arun Agarwal Acquires 1.14% Stake in Apollo Pipes",
            "Summary": "Investor Arun Agarwal has acquired a 1.14% stake in Apollo Pipes during the third quarter. The shareholding is valued at approximately 79.2 crore rupees based on the reported net worth.",
            "Sentiment": "neutral",
            "PublishDate": 1736935449000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Apollo Pipes Reports Q2 Financial Results",
            "Summary": "Apollo Pipes has announced its Q2 financial results. The company's EBITDA for the quarter was 181 million rupees, compared to 241 million rupees in the same quarter last year, showing a year-over-year decrease. The EBITDA margin for Q2 was 9.03%, down from 9.68% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1729845402000,
            "Source": "result"
        },
        {
            "Title": "Apollo Pipes Reports Decline in Q2 Profit and Revenue",
            "Summary": "Apollo Pipes has reported a significant decrease in both net profit and revenue for the second quarter compared to the same period last year. Net profit fell to 45 million rupees from 129 million rupees, while revenue decreased to 2 billion rupees from 2.5 billion rupees.",
            "Sentiment": "negative",
            "PublishDate": 1729845394000,
            "Source": "result"
        },
        {
            "Title": "Apollo Pipes Reports Decline in Q2 Revenue",
            "Summary": "Apollo Pipes has reported a revenue of 2 billion rupees for the second quarter, down from 2.5 billion rupees in the same quarter of the previous year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1729845389000,
            "Source": "result"
        },
        {
            "Title": "Apollo Pipes Reports Significant Drop in Q2 Net Profit",
            "Summary": "Apollo Pipes has reported a net profit of 44.7 million rupees for the second quarter, marking a substantial decrease from 129 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1729845376000,
            "Source": "result"
        }
    ]
}