{
    "Symbol": "APS",
    "ISIN": "INE0P0001010",
    "News": [
        {
            "Title": "Australian Premium Solar Reports Strong H1 Performance with 114% Profit Growth",
            "Summary": "Australian Premium Solar delivered significant growth in its H1 results, with net profit rising to 281 million rupees compared to 131 million rupees in the previous year, representing a 114% increase. Revenue also showed strong performance, reaching 3 billion rupees versus 1.6 billion rupees year-over-year, marking an 88% growth.",
            "Sentiment": "positive",
            "PublishDate": 1761808408510,
            "Source": "earnings"
        },
        {
            "Title": "Australian Premium Solar Secures Rs 110 Crore Order",
            "Summary": "Australian Premium Solar has received an order worth Rs 110 crores. The company operates in the solar energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1756700567585,
            "Source": "order&deals"
        },
        {
            "Title": "Australian Premium Solar Secures 13 Crore Rupee Contract for Agricultural Pump Solarization",
            "Summary": "Australian Premium Solar has received a Letter of Award (LOA) from TREDA for a project worth 13 crore rupees to solarize agricultural pumps. The company, with a market capitalization of 813 crore rupees, is classified as an SME (Small and Medium Enterprise).",
            "Sentiment": "positive",
            "PublishDate": 1740636525000,
            "Source": "order&deals"
        },
        {
            "Title": "Australian Premium Solar Awarded Letter of Intent for 200 MW Tender",
            "Summary": "Australian Premium Solar has been awarded a Letter of Intent (LOI) as part of a bidding process for a 200 MW tender. This indicates the company's potential involvement in a significant solar energy project.",
            "Sentiment": "positive",
            "PublishDate": 1739525589000,
            "Source": "order&deals"
        },
        {
            "Title": "Australian Premium Solar Secures 33 Crore Rupee Purchase Order",
            "Summary": "Australian Premium Solar has received a purchase order worth 33 crore rupees for the supply of APS-Solar PV modules. The contract is to be executed by May 31, 2025. The company's current market capitalization is 987 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1739165028000,
            "Source": "order&deals"
        },
        {
            "Title": "Australian Premium Solar Secures 91 Crore Rupee Order",
            "Summary": "Australian Premium Solar, a company with a market capitalization of 880 crore rupees, has won a significant order worth 91 crore rupees. This development is particularly noteworthy for the company, which is classified as a Small and Medium Enterprise (SME).",
            "Sentiment": "positive",
            "PublishDate": 1737692867000,
            "Source": "order&deals"
        },
        {
            "Title": "Australian Premium Solar (India) Secures 23 Crore Order",
            "Summary": "Australian Premium Solar (India) has won a new order worth 23 crore rupees. The company, which is listed as an SME (Small and Medium Enterprise), currently has a market capitalization of 1052 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1735882968000,
            "Source": "order&deals"
        },
        {
            "Title": "Australian Premium Solar (India) Secures 13 Crore Rupee Order",
            "Summary": "Australian Premium Solar (India) has won an order worth 13 crore rupees. The company, which is listed as an SME (Small and Medium Enterprise), has a market capitalization of 1044 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1735810902000,
            "Source": "order&deals"
        },
        {
            "Title": "Australian Premium Solar Expands Operations in India",
            "Summary": "Australian Premium Solar (India) has announced strategic expansions of its subsidiaries and a capital increase. The company is making a strategic investment by acquiring a 51% stake in Aplus Solar Cell and establishing a new wholly owned subsidiary with 100% ownership.",
            "Sentiment": "positive",
            "PublishDate": 1734482319000,
            "Source": "corporate_action"
        },
        {
            "Title": "Australian Premium Solar (India) Announces Strategic Subsidiary Expansions",
            "Summary": "Australian Premium Solar (India) has revealed plans for strategic subsidiary expansions and a capital increase. The company is taking a strategic investment approach, acquiring a 51% stake in Aplus Solar Cell and establishing a new wholly owned subsidiary with 100% ownership.",
            "Sentiment": "positive",
            "PublishDate": 1734442977000,
            "Source": "corporate_action"
        },
        {
            "Title": "Australian Premium Solar Secures 56 Crore Rupee Order",
            "Summary": "Australian Premium Solar has won a new order worth 56 crore rupees (approximately 6.7 million USD), as reported by SME Update. This represents a significant business development for the company in the solar energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1733814487000,
            "Source": "order&deals"
        },
        {
            "Title": "Australian Premium Solar (India) Secures 36.5 Crore Rupee Order",
            "Summary": "Australian Premium Solar (India) has won a new order valued at 36.5 crore rupees (approximately 365 million rupees). This development is significant for the company's operations in India and suggests potential growth in their solar energy business.",
            "Sentiment": "positive",
            "PublishDate": 1733731722000,
            "Source": "order&deals"
        },
        {
            "Title": "Australian Premium Solar Secures 27 Crore Rupee Order",
            "Summary": "Australian Premium Solar has won a new order worth 27 crore rupees (approximately $3.3 million USD). The company, which operates in the solar energy sector, has a current market capitalization of 1024 crore rupees (about $124 million USD).",
            "Sentiment": "positive",
            "PublishDate": 1732773318000,
            "Source": "order&deals"
        }
    ]
}