{
    "Symbol": "APTECHT",
    "ISIN": "INE266F01018",
    "News": [
        {
            "Title": "Aptech Gets ₹6.37 Cr IT Demand Notice for AY 2024-25",
            "Summary": "Aptech Limited receives income tax assessment order with demand notice of ₹6.37 crores for AY 2024-25 due to computational errors in deduction claims. Company expects no financial impact after rectification.",
            "Sentiment": "neutral",
            "PublishDate": 1770820296946,
            "Source": "stocks"
        },
        {
            "Title": "Aptech Q3FY26 Revenue Jumps 24.4% to ₹13,711.25 Lakhs",
            "Summary": "Aptech Limited reports strong Q3FY26 consolidated revenue of ₹13,711.25 lakhs, up 24.4% YoY. Net profit surged to ₹855.79 lakhs vs ₹357.82 lakhs in Q3FY25, despite exceptional items of ₹240.44 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770801604989,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aptech Wins ₹4.22 Cr Training Contract from Govt Body",
            "Summary": "Aptech Limited secures training programme contract worth ₹4.22 crores from autonomous state government body, to be executed during FY 2025-26, strengthening its enterprise business segment.",
            "Sentiment": "positive",
            "PublishDate": 1767615068055,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aptech Wins Government OMR Testing Contract",
            "Summary": "Aptech Limited secured a work order from an autonomous state government body to conduct OMR-based testing services, with examinations scheduled to begin in February 2026.",
            "Sentiment": "positive",
            "PublishDate": 1766585480648,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aptech Secures Contract Worth 38.8 Million Rupees",
            "Summary": "Aptech has secured a new contract valued at 38.8 million rupees. The contract win represents a business development for the company, though specific details about the contract scope and duration were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1763044179972,
            "Source": "order&deals"
        },
        {
            "Title": "Aptech Limited Reports Quarterly Results for September 2025",
            "Summary": "Aptech Limited's board approved unaudited financial results for the quarter and half year ended September 30, 2025. The consolidated results show total assets of ₹41,230.68 lakhs compared to ₹39,038.22 lakhs in March 2025. The company's consolidated cash and cash equivalents decreased to ₹1,767.70 lakhs from ₹2,533.78 lakhs. Trade receivables increased significantly to ₹6,189.72 lakhs from ₹3,595.07 lakhs. The standalone results show total assets of ₹31,669.78 lakhs versus ₹31,604.83 lakhs in March 2025. Cash flows from operating activities generated ₹193.59 lakhs for the consolidated entity while standalone operations used ₹23.73 lakhs. The company paid dividends of ₹2,609.99 lakhs during the period. Results include subsidiaries located in India and overseas, with auditor reviews conducted by Bansi S. Mehta & Co.",
            "Sentiment": "neutral",
            "PublishDate": 1762252910195,
            "Source": "earnings"
        },
        {
            "Title": "APTECH Reports Mixed Q2 Results with Higher Revenue and Profit but Lower EBITDA",
            "Summary": "APTECH reported Q2 consolidated net profit of 65 million rupees compared to 55 million rupees in the same period last year. Revenue increased to 1.35 billion rupees from 1.26 billion rupees year-over-year. However, EBITDA declined to 76 million rupees from 77.6 million rupees, with EBITDA margin dropping to 5.66% from 6.13% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762244839635,
            "Source": "earnings"
        },
        {
            "Title": "Aptech Limited Secures Rs. 2.54 Crore Surveillance Services Contract from State Government Body",
            "Summary": "Aptech Limited has received a work order worth Rs. 2.54 crore from an autonomous body under a state government to provide surveillance services for examinations. The contract involves installation, operation, and monitoring of surveillance systems across approximately 750 examination centres in all 24 districts of a specified state. Aptech will provide live surveillance coverage at examination control rooms and client headquarters, with recordings to be stored securely and submitted on sealed DVDs post-examination. The contract is expected to be executed until December 2025. The company operates globally with over 1000 centers offering educational programs across IT, media, retail, aviation, beauty, banking, and preschool segments through various brands including Arena Animation, MAAC, and Lakmé Academy.",
            "Sentiment": "positive",
            "PublishDate": 1760430751544,
            "Source": "stock"
        },
        {
            "Title": "Aptech Secures ₹24.77 Crore Government Contract for Computer-Based Examinations",
            "Summary": "Aptech has secured a work order worth ₹24.77 crore from a State Government Body to conduct computer-based examinations. The contract represents a significant business win for the education and training services company.",
            "Sentiment": "positive",
            "PublishDate": 1760028782494,
            "Source": "order&deals"
        },
        {
            "Title": "Aptech Partners with WOL3D to Launch India's First Structured 3D Printing Program",
            "Summary": "Aptech Limited and WOL3D announced a partnership to introduce India's first structured 3D printing and product design program for creative and industrial applications. The 60-hour hybrid program will be delivered through Aptech's MAAC and Arena Animation training centres, combining classroom instruction with hands-on training at WOL3D's experience facilities. The program serves as an add-on module for students in 3D animation and design courses, targeting sectors including aerospace, medical devices, industrial supply chains, and product design. The collaboration aims to address industry demand for skilled talent as India scales up additive manufacturing adoption under its National Strategy for Additive Manufacturing. Aptech operates over 1,000 training centres globally, while Mumbai-based WOL3D distributes 3D printing products and operates India's first 3D Printing Experience Centre. Aptech shares traded at ₹119.41, up 0.17%, while WOL3D shares traded at ₹126.40, up 0.32%.",
            "Sentiment": "positive",
            "PublishDate": 1760003489239,
            "Source": "stock"
        },
        {
            "Title": "Aptech Limited Re-appoints Ronnie Talati as Independent Director for Second Five-Year Term",
            "Summary": "Aptech Limited successfully completed a postal ballot for the re-appointment of Mr. Ronnie Talati as a Non-Executive, Independent Director for a second consecutive five-year term from September 15, 2025 to September 14, 2030. The special resolution was passed with requisite majority through remote e-voting, which concluded on September 11, 2025. Talati, a B.Com and LLB graduate, brings extensive experience from his career at Titan Company Limited where he served in various roles including Chief Executive Officer of the Eyewear Division until his retirement in December 2019. He previously headed the Fastrack brand as Vice President and served as Chief Marketing Officer for Titan's Watches & Accessories Division. Talati is not related to any directors or key managerial personnel of Aptech Limited and is not debarred from holding directorship positions.",
            "Sentiment": "positive",
            "PublishDate": 1757672736597,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aptech Secures 28 Million Rupee Contract",
            "Summary": "Aptech has secured a contract worth 28 million rupees. The company announced this contract acquisition as part of its business operations.",
            "Sentiment": "positive",
            "PublishDate": 1757587081654,
            "Source": "stock"
        },
        {
            "Title": "Aptech Secures Letter of Intent for Computer-Based Online Examinations",
            "Summary": "Aptech has secured a Letter of Intent from an autonomous government body to conduct computer-based online examinations for higher educational institutions.",
            "Sentiment": "positive",
            "PublishDate": 1756211980615,
            "Source": "stock"
        },
        {
            "Title": "Aptech Limited Seeks Shareholder Approval for Re-appointment of Independent Director Ronnie Talati",
            "Summary": "Aptech Limited has issued a postal ballot notice seeking shareholder approval for the re-appointment of Mr. Ronnie Talati as Non-Executive Independent Director for a second term of five consecutive years from September 15, 2025 to September 14, 2030. Talati's first term expires on September 14, 2025. The e-voting period runs from August 13, 2025 to September 11, 2025, with results to be announced by September 12, 2025. The Board recommended his re-appointment based on his skills in general management, strategy, operations and board governance. Talati, aged 66, previously served as CEO of Titan Company's Eyewear Division and Chief Marketing Officer of its Watches & Accessories Division before retiring in December 2019. He has attended 3 board meetings and holds 1 directorship in other listed entities.",
            "Sentiment": "neutral",
            "PublishDate": 1755177732644,
            "Source": "corporate_action"
        },
        {
            "Title": "Aptech Limited Board Approves Q2 2025 Financial Results and Auditor Appointments",
            "Summary": "Aptech Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, including both standalone and consolidated statements with limited review reports from statutory auditors. The Board also approved draft annual reports for 2024-25, including Directors' Report, Management Discussion and Analysis, and Corporate Governance Report. Key appointments include M/s SAPSJ & Associate as Cost Auditor for FY 2025-26 and M/s. S.G & Associates as Secretarial Auditor for five years from 2025-26 to 2029-30, both subject to shareholder approval. The company scheduled its 25th Annual General Meeting for September 17, 2025 at 12:00 Noon.",
            "Sentiment": "neutral",
            "PublishDate": 1754296708562,
            "Source": "corporate_action"
        },
        {
            "Title": "APTECH Reports 31% Jump in Quarterly Net Profit to 67 Million Rupees",
            "Summary": "APTECH posted consolidated net profit of 67 million rupees in its latest quarterly results, representing a year-over-year increase from 51 million rupees. The company's revenue also grew to 1.2 billion rupees compared to 1.04 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1754296200500,
            "Source": "earnings"
        },
        {
            "Title": "Aptech Limited Signs INR 2.39 Crore Training Contract with Government PSE",
            "Summary": "Aptech Limited has entered into a Memorandum of Understanding with a Government of India Public Sector Enterprise under the Ministry of Information and Broadcasting. The agreement involves providing 3D Animation and VFX training for 100 students over a 12-month period, valued at approximately INR 2.39 crores. Aptech is a vocational training company with over 800 centers globally, operating since 1986 across multiple sectors including IT training, media & entertainment, retail & aviation, beauty & wellness, banking & finance, and preschool education through brands like Arena Animation, MAAC, and Lakmé Academy.",
            "Sentiment": "positive",
            "PublishDate": 1753445127227,
            "Source": "order&deals"
        },
        {
            "Title": "Aptech Limited Regularizes Appointments of Two Whole-Time Directors Through Postal Ballot",
            "Summary": "Aptech Limited has regularized the appointments of Mr. Neeraj Malik and Mr. Sandip Weling as Whole-Time Directors (Executive, Non-Independent Directors) effective July 19, 2025, for a period of 5 years. The appointments were approved by shareholders through a postal ballot process that concluded on July 19, 2025. Mr. Neeraj Malik, age 46, serves as Chief Business Officer (Enterprise Business Group) and holds a Post-Graduate degree in Business Management with 24 years of work experience at companies including Wipro Infotech, TCS, and Indiamart Intermesh. Mr. Sandip Weling, age 55, serves as Chief Business Officer (Global Retail Business) and holds a Masters in Marketing Management with over 32 years of experience at companies including Eureka Forbes Limited, Mahindra Holidays & Resorts, and Bharti Axa Life Insurance. Both directors are not related to any existing directors or key managerial personnel of the company.",
            "Sentiment": "positive",
            "PublishDate": 1753161273816,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aptech Secures 19.4 Million Rupee Contract",
            "Summary": "Aptech has secured a contract valued at 19.4 million rupees. The news briefly mentions this business development without providing additional details about the nature of the contract or the client involved.",
            "Sentiment": "positive",
            "PublishDate": 1752065737000,
            "Source": "default"
        },
        {
            "Title": "Aptech Partners with State Government Institute for 72 Million Rupee Contract",
            "Summary": "Aptech has entered into a partnership with a state government institute for a contract valued at approximately 72 million rupees. The news highlights a significant business deal for the company, potentially indicating expanded operations or services in the public sector.",
            "Sentiment": "positive",
            "PublishDate": 1751976804000,
            "Source": "default"
        },
        {
            "Title": "Aptech Reports Q4 Results and Declares Interim Dividend",
            "Summary": "Aptech has announced its Q4 financial results, showing significant year-over-year improvements. The company reported a Q4 revenue of 1.19 billion rupees, up from 1.04 billion in the previous year. EBITDA increased to 77.8 million rupees from 47.8 million, with the EBITDA margin expanding to 6.56% from 4.59%. Consolidated net profit rose to 49.4 million rupees, compared to 27.5 million year-over-year and 35.8 million quarter-over-quarter. Additionally, Aptech declared an interim dividend of 4.5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746708845000,
            "Source": "result"
        },
        {
            "Title": "Aptech Ltd.: Launches AI-Powered Creative Evaluation Tool 'Creval'",
            "Summary": "Aptech Ltd. introduces Creval, an AI-powered tool for real-time evaluation of visual arts. Creval uses Amazon Bedrock for secure, customizable assessments of animation, 3D graphics, and photography. It offers comprehensive feedback, detailed reports, and is accessible as an e-commerce platform for students and professionals.",
            "Sentiment": "positive",
            "PublishDate": 1738225320000,
            "Source": "normal_news"
        },
        {
            "Title": "Aptech Ltd Reports Q3 Financial Results and Dividend Declaration",
            "Summary": "Aptech Ltd announced its Q3 consolidated net profit of 35 million rupees, down from 67 million rupees year-over-year and 55 million rupees quarter-over-quarter. Q3 revenue was 1.10 billion rupees, up from 1 billion rupees year-over-year but down from 1.26 billion rupees quarter-over-quarter. The company also approved a dividend of 10 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1737936735000,
            "Source": "earnings"
        },
        {
            "Title": "Aptech Awarded Multi-Year Project for Online Examinations",
            "Summary": "Aptech Limited has been awarded a multi-year project by an unnamed body to conduct computer-based online examinations. This contract represents a significant business opportunity for the company in the education technology sector.",
            "Sentiment": "positive",
            "PublishDate": 1734076250000,
            "Source": "order&deals"
        },
        {
            "Title": "Aptech Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Aptech Limited has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 decreased to 77.6 million rupees from 136 million rupees in the same quarter last year. The EBITDA margin also declined to 6.13% from 12.44% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731317503000,
            "Source": "result"
        },
        {
            "Title": "Aptech Reports Q2 Revenue Growth",
            "Summary": "Aptech Limited has announced its Q2 revenue figures. The company reported revenue of 1.3 billion rupees, compared to 1.1 billion rupees in the same quarter of the previous year, indicating year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731317420000,
            "Source": "result"
        },
        {
            "Title": "Aptech Reports Decline in Q2 Consolidated Net Profit",
            "Summary": "Aptech Limited, an education and training company, has reported a consolidated net profit of 55 million rupees for the second quarter, down from 114 million rupees in the same period last year. This represents a significant year-over-year decrease in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1731317392000,
            "Source": "result"
        }
    ]
}