{
    "Symbol": "APTUS",
    "ISIN": "INE852O01025",
    "News": [
        {
            "Title": "Aptus Value Housing Finance Q3 Net Profit Jumps 24%",
            "Summary": "Aptus Value Housing Finance India reported consolidated net profit of ₹2.36 billion for Q3, marking a significant 24% increase from ₹1.90 billion in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1770193655795,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aptus Value Housing Finance Amends Articles",
            "Summary": "Aptus Value Housing Finance board approves amendments to Articles of Association, granting promoters director nomination rights, affirmative voting powers, and board quorum rights, subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1768226312978,
            "Source": "stocks"
        },
        {
            "Title": "Aptus Value Housing Finance Gets Exchange Approval for Promoter Reclassification",
            "Summary": "NSE and BSE have approved Aptus Value Housing Finance's application to reclassify four promoter entities - Westbridge Crossover Fund LLC, JIH LLC, Mountain Managers Private Limited on behalf of MMPL Trust, and Sandeep Singhal on behalf of Konark Trust - from promoter category to public shareholders category. The reclassification was processed under Regulation 31A of SEBI LODR Regulations following the company's November application to both exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1764999896531,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aptus Value Housing Finance Allots 62,500 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Aptus Value Housing Finance India Limited allotted 62,500 equity shares of Rs. 2/- each to employees under the Aptus Employee Stock Option Scheme, 2021. The company's paid-up share capital increased from Rs. 1,00,13,20,472 to Rs. 1,00,14,45,472, with the newly allotted shares ranking pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764320912925,
            "Source": "corporate_action"
        },
        {
            "Title": "Aptus Value Housing Finance Allots Rs 150 Crore Non-Convertible Debentures Through Private Placement",
            "Summary": "Aptus Value Housing Finance India Limited's Resourcing Business Committee approved the allotment of 15,000 secured, redeemable, rated, listed non-convertible debentures worth Rs 1,00,000 each, totaling Rs 150 crores through private placement. The debentures will be listed on BSE Limited with monthly interest payments and principal repayment through equal monthly redemptions after a 12-month moratorium period.",
            "Sentiment": "positive",
            "PublishDate": 1764242017391,
            "Source": "corporate_action"
        },
        {
            "Title": "Aptus Value Housing Finance Declares Rs 2 Interim Dividend, Issues TDS Guidelines to Shareholders",
            "Summary": "Aptus Value Housing Finance India Limited declared an interim dividend of Rs 2 per equity share of face value Rs 2 for financial year 2025-26. The Board approved this dividend at its meeting held on October 31, 2025. The company has communicated detailed tax deduction at source (TDS) guidelines to shareholders, explaining various exemption categories and required documentation. For resident individuals, no tax will be deducted if total dividend for the year does not exceed Rs 10,000, otherwise 10% TDS applies. Non-resident shareholders face 20% withholding tax or treaty rates, whichever is lower. The company requires shareholders to submit necessary documents by November 7, 2025 to determine appropriate TDS rates. Shareholders can claim exemptions by providing forms like 15G/15H for individuals, or relevant certificates for institutional investors including mutual funds, insurance companies, and government entities.",
            "Sentiment": "positive",
            "PublishDate": 1762376450997,
            "Source": "corporate_action"
        },
        {
            "Title": "Aptus Value Housing Finance Seeks Reclassification of WestBridge Crossover Fund from Promoter to Public Category",
            "Summary": "Aptus Value Housing Finance India Limited has submitted an application to BSE Limited and National Stock Exchange of India Limited seeking approval for reclassification of WestBridge Crossover Fund, LLC from Promoter/Promoter group category to Public category. The company made this intimation in compliance with SEBI LODR Regulations 31A(8)(c) and Regulation 30.",
            "Sentiment": "neutral",
            "PublishDate": 1762372446387,
            "Source": "corporate_action"
        },
        {
            "Title": "Aptus Value Housing Finance Targets Rs. 25,000 Crore AUM in 3 Years with 25% CAGR",
            "Summary": "Aptus Value Housing Finance aims to maintain and enhance its 20% return on equity goal. The company is targeting 6-7% returns on direct assignment deals, which will comprise up to 10% of its loan book. The housing finance company anticipates reaching Rs. 25,000 crore in assets under management within 3 years through a 25% compound annual growth rate, with potential to achieve Rs. 26,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1762140524019,
            "Source": "stock"
        },
        {
            "Title": "Aptus Value Housing Finance Reports Strong Q2 Results, Declares Rs 2 Interim Dividend",
            "Summary": "Aptus Value Housing Finance India Limited announced its quarterly results for the period ended September 30, 2025. The company declared an interim dividend of Rs 2 per equity share (100% of face value) for financial year 2025-26, with record date set as November 7, 2025, and payment by November 30, 2025. The Board also approved the reclassification request from WestBridge Crossover Fund, LLC and its affiliated entities from promoter/promoter group category to public category following their complete disinvestment in the company's equity shares. This reclassification is subject to stock exchange approval and shareholder consent. The company's consolidated total income reached Rs 55,369 lakhs for the quarter, with profit after tax of Rs 22,655 lakhs. Basic earnings per share stood at Rs 4.54 for the quarter. The Board meeting was held on October 31, 2025, and the financial results have been reviewed by statutory auditors with an unmodified opinion.",
            "Sentiment": "positive",
            "PublishDate": 1761899697911,
            "Source": "earnings"
        },
        {
            "Title": "Aptus Value Housing Finance Reports Strong Q2 Growth with Revenue Up 29% and Profit Rising 25%",
            "Summary": "Aptus Value Housing Finance India reported Q2 revenue of 5.4 billion rupees, representing a year-over-year increase from 4.2 billion rupees. The company's consolidated net profit reached 2.27 billion rupees, up from 1.82 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1761899274988,
            "Source": "earnings"
        },
        {
            "Title": "Westbridge Crossover Fund Seeks Reclassification from Promoter to Public Category at Aptus Value Housing Finance",
            "Summary": "Aptus Value Housing Finance India Limited received a reclassification request from Westbridge Crossover Fund, LLC and its associated entities to move from Promoter/Promoter Group category to Public category. Westbridge Crossover Fund divested its entire 16.19% stake (8.09 crore shares) on September 4, 2025, through on-market sales. Associated entities Konark Trust and MMPL Trust also sold their holdings of 0.26% and 0.01% respectively. Post-divestment, none of these entities hold any shares in the company. The entities confirmed they meet all conditions for reclassification including holding less than 10% voting rights, having no control over company affairs, no special rights, no board representation, and not acting as key managerial persons. Aptus will process the request by obtaining approvals from the Board of Directors, stock exchanges, and shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1761219018096,
            "Source": "corporate_action"
        },
        {
            "Title": "WestBridge Crossover Fund Exits Aptus Value Housing Finance with Complete 16.19% Stake Sale",
            "Summary": "WestBridge Crossover Fund, LLC has completely divested its stake in Aptus Value Housing Finance India Limited by selling 8,09,11,314 equity shares, representing 16.19% of the company. The sale was executed through on-market transactions on September 04, 2025, reducing WBCF's shareholding from 16.19% to zero. The transaction involved shares from the total equity capital of 49,99,08,262 shares of INR 2 each. WBCF was part of the promoter group along with other persons acting in concert including Konark Trust and MMPL Trust. The complete exit triggered regulatory disclosure requirements under SEBI's takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1757336761383,
            "Source": "stock"
        },
        {
            "Title": "Aptus Value Housing Finance Executes Rs. 673.52 Crore Block Trade on NSE",
            "Summary": "Aptus Value Housing Finance India Ltd. completed a block trade on the National Stock Exchange worth Rs. 673.52 crores. The transaction involved approximately 20,060,273 shares at a price of Rs. 335.75 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1756958173444,
            "Source": "order&deals"
        },
        {
            "Title": "Westbridge Crossover Fund to Sell 16.5% Stake in Aptus Value Housing Finance for Rs 2,600 Crore",
            "Summary": "Westbridge Crossover Fund LLC plans to exit its position in Aptus Value Housing Finance India Ltd through a Rs 2,600-crore open market transaction. The fund will sell 8.23 crore shares representing a 16.5% stake at Rs 316 per share, a 5% discount to the current market price of Rs 332.15. Westbridge held a 16.19% stake as of June 2025. This follows previous stake sales by the promoter of 12.61% in June and 4.96% in May 2021. Aptus Value Housing Finance expects 20-22% lending growth in the near term and 29% year-on-year growth over the next two to three years. Managing Director P Balaji cited recent repo-rate reduction by RBI and upgraded credit rating by CARE Ratings as factors that will help the company borrow at more affordable terms.",
            "Sentiment": "neutral",
            "PublishDate": 1756899910178,
            "Source": "order&deals"
        },
        {
            "Title": "Aptus Value Housing Finance Reports Mixed Q1 Results with Revenue Growth and Rising NPAs",
            "Summary": "Aptus Value Housing Finance India reported Q1 consolidated net profit of 2.2 billion rupees, up from 1.7 billion rupees year-over-year. Revenue increased to 5.2 billion rupees from 3.95 billion rupees year-over-year. However, asset quality showed deterioration with Gross Non-Performing Assets (GNPA) rising to 1.34% from 1.18% quarter-over-quarter, and Net Non-Performing Assets (NNPA) increasing to 1% from 0.88% quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1753949644225,
            "Source": "earnings"
        },
        {
            "Title": "Aptus Value Housing Finance: 29% Loan Growth Expected Over Next Three Years",
            "Summary": "Aptus Value Housing Finance India Ltd. projects 20-22% near-term lending growth and 29% year-on-year growth over the next 2-3 years. Recent RBI repo rate cut and upgraded credit rating to 'AA; Stable' by CARE Ratings are expected to aid growth through more affordable borrowing terms. The company anticipates a 0.25% reduction in incremental borrowing costs.",
            "Sentiment": "positive",
            "PublishDate": 1751503814000,
            "Source": "normal_news"
        },
        {
            "Title": "Aptus Value Housing Finance: WestBridge Capital Reduces Stake in Major Share Sale",
            "Summary": "WestBridge Capital sold a 12.4% stake (6.19 crore shares) in Aptus Value Housing Finance for Rs 1,906 crore at Rs 307.54 per share. Their holding decreased from 28.59% to 16.19%. SBI Mutual Fund, Axis Mutual Fund, Morgan Stanley Asia Singapore, and Eastbridge Group collectively acquired 3.35% stake for Rs 514 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1748973508000,
            "Source": "block_deals"
        },
        {
            "Title": "Aptus Value Housing Finance India Ltd: Major Block Deal Triggers 9% Stock Decline",
            "Summary": "A block deal involving 6.70 crore shares (13.44% equity) of Aptus Value Housing Finance India Ltd occurred at an average price of ₹307 per share, totaling ₹2,063 crore. The stock declined up to 9% following the transaction. Westridge Investments was expected to divest a 9.8% stake.",
            "Sentiment": "negative",
            "PublishDate": 1748923414000,
            "Source": "block_deals"
        },
        {
            "Title": "Aptus Value Housing Finance India Ltd. Reports Large Block Trades",
            "Summary": "Two significant block trades were reported for Aptus Value Housing Finance India Ltd. on the NSE. The first trade involved 7,799,352 shares at Rs. 308.15 per share, totaling Rs. 240.34 crores. The second trade was larger, with 25,779,103 shares traded at Rs. 307.00 per share, amounting to Rs. 791.42 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1748922397000,
            "Source": "block_details"
        },
        {
            "Title": "Aptus Value Housing: Westridge Plans Rs 1,495 Crore Block Deal",
            "Summary": "Private equity firm Westridge Investments plans to sell 9.8% stake in Aptus Value Housing through a block deal worth Rs 1,495 crore. The floor price is set at Rs 305 per share. Aptus recently reported a 26% YoY increase in Q4 net profit to Rs 207 crore, with 10% YoY growth in disbursements and 25% AUM growth.",
            "Sentiment": "neutral",
            "PublishDate": 1748919144000,
            "Source": "block_deals"
        },
        {
            "Title": "Aptus Value Housing Finance: Westridge to Offload 9.8% Stake in ₹1,495 Crore Block Deal",
            "Summary": "Westridge Investments plans to sell a 9.8% stake in Aptus Value Housing Finance India Ltd through a block deal worth ₹1,495 crore. The floor price is set at ₹305 per share. Aptus recently reported a 26% YoY increase in Q4 net profit, with disbursements up 10% and AUM growing 25%.",
            "Sentiment": "neutral",
            "PublishDate": 1748884146000,
            "Source": "block_deals"
        },
        {
            "Title": "Aptus Value Housing Finance India Reports Strong Q4 Results and Declares Dividend",
            "Summary": "Aptus Value Housing Finance India announced its Q4 financial results, showing significant year-over-year growth. Net profit increased to 2.07 billion rupees, up from 1.6 billion last year. Revenue rose to 4.84 billion rupees from 3.7 billion. The company's asset quality improved slightly, with GNPA at 1.18% and NNPA at 0.88%. Additionally, the company declared a second interim dividend of 2.50 rupees per share and approved the issuance of NCDs worth up to 22.5 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1746576851000,
            "Source": "default"
        },
        {
            "Title": "Aptus Value Housing Finance India Ltd: Q4 Profit Jumps 26%, Disbursements Up 10%",
            "Summary": "Aptus Value Housing Finance reported a 26% YoY increase in Q4 net profit to ₹207 crore. Disbursements rose 10% to ₹1,064 crore. AUM grew 25% to ₹10,865 crore. ROE improved to 19.66%. Gross NPA slightly up at 1.19%. Company added 38 new branches, reaching 300 total.",
            "Sentiment": "positive",
            "PublishDate": 1746531499000,
            "Source": "earnings"
        },
        {
            "Title": "Aptus Value Housing Finance Reports Q4 Results and Corporate Actions",
            "Summary": "Aptus Value Housing Finance India has announced its Q4 results, showing improved financial performance. The company reported a consolidated net profit of 2.07 billion rupees, up from 1.6 billion rupees year-over-year. Revenue increased to 4.84 billion rupees from 3.7 billion rupees in the same period last year. The company's asset quality slightly improved, with GNPA at 1.18% and NNPA at 0.88%. Additionally, the company approved the issuance of NCDs worth up to 22.5 billion rupees and declared a second interim dividend of 2.50 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746530581000,
            "Source": "result"
        },
        {
            "Title": "Aptus Value Housing Finance to Consider Q4 Results on May 6",
            "Summary": "Aptus Value Housing Finance India Limited has announced that it will consider and approve its financial results for the fourth quarter of the fiscal year on May 6. This meeting will likely involve the company's board of directors reviewing and potentially approving the quarterly financial statements.",
            "Sentiment": "neutral",
            "PublishDate": 1744373398000,
            "Source": "earnings"
        },
        {
            "Title": "Aptus Value Housing Finance India Reports Q3 Net Profit Increase",
            "Summary": "Aptus Value Housing Finance India has reported a consolidated net profit of 1.9 billion rupees for the third quarter, compared to 1.57 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738310835000,
            "Source": "earnings"
        },
        {
            "Title": "APTUS Value Housing Finance Receives IRDAI Registration as Corporate Agent",
            "Summary": "APTUS Value Housing Finance has announced that the Insurance Regulatory and Development Authority of India (IRDAI) has granted them a certificate of registration to operate as a corporate agent. This certification allows the company to expand its services into the insurance sector, potentially offering insurance products alongside its existing housing finance services.",
            "Sentiment": "positive",
            "PublishDate": 1735192703000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aptus Value Housing Finance India Ltd: Block Trade of 958,841 Shares",
            "Summary": "A block trade of approximately 958,841 shares of Aptus Value Housing Finance India Ltd occurred on the National Stock Exchange (NSE). The transaction was valued at Rs. 29.28 crores, with shares trading at Rs. 305.40 each.",
            "Sentiment": "neutral",
            "PublishDate": 1735029785000,
            "Source": "block_deals"
        },
        {
            "Title": "Aptus Value Housing Finance India Ltd: Large Block Trade on NSE",
            "Summary": "A significant block trade of approximately 2,783,596 shares of Aptus Value Housing Finance India Ltd was executed on the National Stock Exchange (NSE) at a price of Rs. 321.55 per share. The total value of the transaction amounted to Rs. 89.51 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1732607742000,
            "Source": "block_deals"
        },
        {
            "Title": "Aptus Value Housing Finance: Strong AUM Growth Projected Despite Recent Stock Dip",
            "Summary": "Aptus Value Housing Finance India expects 25-30% AUM growth and net profit increase between FY24-FY27, despite an 18.5% stock drop in the past month. Q2 saw 26% YoY disbursement growth to Rs 935 crore, with AUM rising 27% to Rs 9,679 crore. The company maintains a GNPA ratio below 1.4% and plans to add 40 new branches this fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1731509569000,
            "Source": "normal_news"
        },
        {
            "Title": "Aptus Value Housing Finance Targets 30% AUM Growth",
            "Summary": "Aptus Value Housing Finance has announced guidance for 30% growth in its Assets Under Management (AUM) and loan book. The company expects to achieve 20% disbursement growth by the third quarter and 25% by the fourth quarter, as stated in a recent conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1730950613000,
            "Source": "normal_news"
        },
        {
            "Title": "Aptus Value Housing Finance: Q2 Results Exceed Expectations",
            "Summary": "Aptus Value Housing Finance reported Q2 results that were ahead of estimates. The outlook for the company remains positive according to Systematix.",
            "Sentiment": "positive",
            "PublishDate": 1730946536000,
            "Source": "result"
        },
        {
            "Title": "Aptus Value Housing Finance India Reports Q2 Gross NPA Improvement",
            "Summary": "Aptus Value Housing Finance India has reported a decrease in its Gross Non-Performing Assets (NPA) for the second quarter. The Gross NPA has reduced to 1.25% from 1.30% in the previous quarter, indicating an improvement in the company's loan portfolio quality.",
            "Sentiment": "positive",
            "PublishDate": 1730797217000,
            "Source": "result"
        },
        {
            "Title": "Aptus Value Housing Finance India Declares Dividend",
            "Summary": "Aptus Value Housing Finance India has announced a dividend of 2 rupees per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1730796546000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aptus Value Housing Finance India Reports Q2 Revenue Growth",
            "Summary": "Aptus Value Housing Finance India has reported a revenue of 4.2 billion rupees for the second quarter, compared to 3.3 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730796247000,
            "Source": "result"
        },
        {
            "Title": "Aptus Value Housing Finance India Reports Q2 Profit Growth",
            "Summary": "Aptus Value Housing Finance India has reported a consolidated net profit of 1.82 billion rupees for the second quarter, compared to 1.48 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730796217000,
            "Source": "result"
        },
        {
            "Title": "Aptus Value Housing: Stock Hits Record High on Positive Outlook",
            "Summary": "<p>Aptus Value Housing Finance India's stock <span class='positive'>rallied 11%</span> to a <span class='positive'>record high</span> of Rs 401.65 on NSE, driven by expectations of <span class='positive'>stable asset quality</span> and <span class='positive'>healthy profitability</span>. The company's focus on <b>affordable housing</b> and government initiatives support its <span class='positive'>growth prospects</span>. <br/> CARE Ratings <span class='positive'>revised the company's outlook to positive</span>, citing <span class='positive'>continued growth momentum</span> and <span class='positive'>strong financial metrics</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728893133000,
            "Source": "normal_news"
        }
    ]
}