{
    "Symbol": "AQYLON",
    "ISIN": "INE416A01044",
    "News": [
        {
            "Title": "Aqylon Nexus Q3FY26 profit jumps to ₹148.06 lakhs",
            "Summary": "Aqylon Nexus Limited reported strong Q3FY26 results with profit of ₹148.06 lakhs vs loss of ₹2,272.73 lakhs in Q3FY25. Revenue from operations surged 109.44% to ₹494.57 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770805695157,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aqylon Nexus Signs AI & Data Centre MoU with MBuzz",
            "Summary": "Aqylon Nexus Limited executed MoU with MBuzz Technologies, Middle East to explore AI solutions and hyperscale data centre opportunities. The non-binding agreement focuses on AI platforms and infrastructure development.",
            "Sentiment": "positive",
            "PublishDate": 1770108180159,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sri Adhikari Bros Announces Postal Ballot for Key Resolutions",
            "Summary": "Sri Adhikari Brothers Television Network announces postal ballot voting from January 14-February 12, 2026, covering share subdivision, borrowing powers, and chairperson appointment with five major resolutions.",
            "Sentiment": "neutral",
            "PublishDate": 1768209085262,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sri Adhikari Bros Approves Corporate Restructuring",
            "Summary": "Sri Adhikari Brothers Television Network shareholders approved three key resolutions including object clause amendment, name change, and statutory auditor appointment through postal ballot with 96.02% participation.",
            "Sentiment": "positive",
            "PublishDate": 1767331406662,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sri Adhikari Bros Announces Director Appointments",
            "Summary": "Sri Adhikari Brothers Television Network Limited completed postal ballot with 96.67% turnout, approving five director appointments including Managing Director and Independent Directors with overwhelming shareholder support.",
            "Sentiment": "positive",
            "PublishDate": 1767252667674,
            "Source": "co_actions_results"
        },
        {
            "Title": "Leading Leasing Finance sells 35K more SABTNL shares",
            "Summary": "Leading Leasing Finance sold additional 35,368 shares in Sri Adhikari Brothers Television Network during December 31, 2025 to January 1, 2026, reducing its stake from 11.43% to 11.29% through open market sale.",
            "Sentiment": "neutral",
            "PublishDate": 1765606215951,
            "Source": "co_actions_results"
        },
        {
            "Title": "Leading Leasing Finance Sells 3.25 Lakh Shares in Sri Adhikari Brothers Television Network",
            "Summary": "Leading Leasing Finance and Investment Company Limited sold 3,25,000 equity shares (1.28% stake) in Sri Adhikari Brothers Television Network Limited through open market transactions. The sale reduced Leading Leasing Finance's shareholding from 16.93% to 15.65% in the television network company.",
            "Sentiment": "neutral",
            "PublishDate": 1765341408181,
            "Source": "corporate_action"
        },
        {
            "Title": "Sri Adhikari Brothers Television Network Signs MoU with Telangana Government for 50 MW AI & Green Data Centre",
            "Summary": "Sri Adhikari Brothers Television Network has executed a memorandum of understanding with the Telangana Government for the development of a 50 MW AI and green data centre in the state. The project involves a planned investment of 40 billion rupees, marking a significant expansion into the data infrastructure sector for the television network company.",
            "Sentiment": "positive",
            "PublishDate": 1765322845930,
            "Source": "order&deals"
        },
        {
            "Title": "Leading Leasing Finance Reduces Stake in Sri Adhikari Brothers Television Network",
            "Summary": "Leading Leasing Finance and Investment Company Limited sold 1,10,000 equity shares of Sri Adhikari Brothers Television Network Limited between December 1-5, 2025, reducing its shareholding from 17.36% to 16.93%. The transaction was conducted through open market sales and disclosed under SEBI substantial acquisition regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1765193842636,
            "Source": "corporate_action"
        },
        {
            "Title": "Sri Adhikari Brothers Television Network Seeks Shareholder Approval for Name Change to Aqylon Nexus Limited and Business Pivot to AI",
            "Summary": "Sri Adhikari Brothers Television Network Limited has issued a postal ballot notice seeking shareholder approval to change its name to Aqylon Nexus Limited and amend its main business objects to focus on Artificial Intelligence, Machine Learning, and related technologies. The company is also appointing M/s. Bilimoria Mehta & Co. as new statutory auditors following the resignation of existing auditors M/s Hitesh Shah Associates, with remote e-voting scheduled from December 3, 2025 to January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1764592698576,
            "Source": "corporate_action"
        },
        {
            "Title": "Sri Adhikari Brothers Television Network Seeks Shareholder Approval for Key Leadership Appointments",
            "Summary": "Sri Adhikari Brothers Television Network has issued a postal ballot notice seeking member approval for appointing Srivatsava Sunkara as Managing Director and Kiran Kumar Inampudi as Executive Director and Chairman, along with three independent directors. The e-voting process runs from December 02, 2025 to December 31, 2025, with all appointments effective from October 10, 2025 to October 09, 2030.",
            "Sentiment": "neutral",
            "PublishDate": 1764339873821,
            "Source": "corporate_governance"
        },
        {
            "Title": "Leading Leasing Finance Reduces Stake in Sri Adhikari Brothers Television Network",
            "Summary": "Leading Leasing Finance and Investment Company Limited sold 1,60,000 equity shares of Sri Adhikari Brothers Television Network Limited through open market transactions on November 24, 2025. The sale reduced Leading Leasing Finance's shareholding from 17.99% to 17.36% in the television network company.",
            "Sentiment": "neutral",
            "PublishDate": 1764071683119,
            "Source": "corporate_action"
        },
        {
            "Title": "Sri Adhikari Brothers Television Network Approves Name Change to Aqylon Nexus and AI Business Pivot",
            "Summary": "Sri Adhikari Brothers Television Network's board approved changing the company name to Aqylon Nexus Limited and amended its main business objectives to focus on AI, machine learning, and related technologies. The company also appointed new statutory auditors after the resignation of existing auditors, proposed establishing a 50MW AI Green Data Centre Campus in Telangana, and will seek shareholder approval through postal ballot.",
            "Sentiment": "neutral",
            "PublishDate": 1763987541865,
            "Source": "corporate_action"
        },
        {
            "Title": "Leading Leasing Finance Reduces Stake in Sri Adhikari Brothers Television Network",
            "Summary": "Leading Leasing Finance and Investment Company Limited sold 2,00,000 equity shares of Sri Adhikari Brothers Television Network Limited through open market transactions on November 20, 2025. The sale reduced Leading Leasing Finance's shareholding from 18.78% to 17.89% in the television network company.",
            "Sentiment": "neutral",
            "PublishDate": 1763724544484,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sri Adhikari Brothers Television Network Reports Profit and Seeks Shareholder Approval for Key Appointments",
            "Summary": "Sri Adhikari Brothers Television Network Limited's Board approved unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported a profit of Rs. 1,227.04 lakhs for the half-year period, compared to a loss of Rs. 2,236.83 lakhs in the previous year. Revenue from operations was Rs. 434.28 lakhs for the quarter. The company recorded an exceptional gain of Rs. 1,543.59 lakhs from the sale of immovable properties in Andheri as part of the NCLT-approved Resolution Plan dated December 8, 2023. The Board approved a postal ballot notice seeking shareholder approval for five key appointments: Srivatsava Sunkara as Managing Director for a 5-year term from October 10, 2025 to October 9, 2030, Kiran Kumar Inampudi as Executive Non-Independent Director, and three Non-Executive Independent Directors. The company operates in content production and distribution segment. Auditors noted material uncertainty regarding going concern due to current liabilities exceeding current assets and negative other equity of Rs. 2,453.85 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1763022730102,
            "Source": "earnings"
        },
        {
            "Title": "Mr. Kurjibhai Premjibhai Rupareliya Announces Open Offer for 13.24% Stake in Sri Adhikari Brothers Television Network at ₹10 per Share",
            "Summary": "Mr. Kurjibhai Premjibhai Rupareliya, along with Leading Leasing Finance and Investment Company Limited as Person Acting in Concert, has announced an open offer to acquire 53,46,238 equity shares representing 13.24% of the emerging voting share capital of Sri Adhikari Brothers Television Network Limited (SABTNL) at ₹10 per share. The offer is made under SEBI (Substantial Acquisition of Shares and Takeovers) Regulations, 2011. The Independent Directors Committee has recommended the offer as fair and reasonable, stating the offer price aligns with SEBI regulations. Grow House Wealth Management Private Limited is managing the offer. The committee advised shareholders to independently evaluate the offer against current market price before participating.",
            "Sentiment": "neutral",
            "PublishDate": 1760585293861,
            "Source": "corporate_action"
        },
        {
            "Title": "Sri Adhikari Brothers Television Network Completes Sale of 35.68% Stake in Westwind Realtors",
            "Summary": "Sri Adhikari Brothers Television Network Limited has completed the sale of its entire 35.68% stake in Westwind Realtors Private Limited to Sri Adhikari Brothers Assets Holding Private Limited for Rs. 18.20 crores. The transaction involved selling premises shares and parking spaces across three floors of the Adhikari Chambers Building in Mumbai. Westwind Realtors ceased to be a subsidiary effective August 22, 2025. The related party transaction was approved through a postal ballot held on May 27, 2025, with results passed on June 27, 2025. The subsidiary contributed nil turnover or revenue during the last financial year.",
            "Sentiment": "neutral",
            "PublishDate": 1755874296012,
            "Source": "corporate_action"
        },
        {
            "Title": "Sri Adhikari Brothers Television Network Completes Resolution Plan One Year Ahead of Schedule",
            "Summary": "Sri Adhikari Brothers Television Network Limited has completed its resolution plan one year ahead of schedule and paid off all financial and operational creditors as per the plan. The company informed shareholders on May 27, 2025 about this completion. The media and entertainment company is now focusing on collaborating with young minds to execute new age ideas and take its business to newer heights. The company emphasizes its commitment to transparency with shareholders and investors while ramping up efforts in the evolving media and entertainment industry landscape.",
            "Sentiment": "positive",
            "PublishDate": 1755161188555,
            "Source": "stock"
        },
        {
            "Title": "Sri Adhikari Brothers Television Network Approves Quarterly Results and Plans Subsidiary Sale",
            "Summary": "Sri Adhikari Brothers Television Network Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, and appointed CS Krina Gokulkumar Shah as Secretarial Auditor for a five-year term from 2025-2026 to 2029-2030. The company will sell its 35.68% stake in subsidiary Westwind Realtors Private Limited to Sri Adhikari Brothers Assets Holding Private Limited for Rs. 18.20 crores, with the transaction expected to complete by August 31, 2025. The sale involves premises shares and parking spaces across multiple floors of the Adhikari Chambers Building in Mumbai. Westwind Realtors will cease to be a subsidiary after the transaction. The quarterly results show a standalone net loss of Rs. 183.57 lakhs compared to a profit of Rs. 6.48 lakhs in the same quarter last year. Revenue from operations declined to Rs. 3.47 lakhs from Rs. 100 lakhs year-over-year. The auditors noted material uncertainty regarding the company's going concern due to higher current liabilities than assets and inability to generate substantial operational revenue.",
            "Sentiment": "negative",
            "PublishDate": 1755157624455,
            "Source": "earnings"
        },
        {
            "Title": "Sri Adhikari Brothers Television Network: Penny Stock Soars 10,400% in One Year",
            "Summary": "Shares of Sri Adhikari Brothers Television Network Limited have surged from ₹3.75 to ₹390 in the past year, turning a ₹1 lakh investment into ₹1.04 crore. The company, known for founding SAB TV, has a content library of 5,500 hours and plans to expand into digital media. Despite recent gains, the stock is down 73.85% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1738509852000,
            "Source": "normal_news"
        }
    ]
}