{
    "Symbol": "ARCHIDPLY",
    "ISIN": "INE877I01016",
    "News": [
        {
            "Title": "Archidply Q3FY26 Net Profit Rises 93.5% to ₹172.64 Lakhs",
            "Summary": "Archidply Industries reports strong Q3FY26 performance with net profit jumping 93.5% YoY to ₹172.64 lakhs. Revenue grew 9.0% to ₹12,146.05 lakhs despite regulatory penalties and labour code impact of ₹138.86 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1769767155042,
            "Source": "co_actions_results"
        },
        {
            "Title": "Archidply Board Meet Set for Jan 30 to Review Q3 Results",
            "Summary": "Archidply Industries has scheduled a board meeting on January 30, 2026, to consider and approve unaudited financial results for Q3FY26 ended December 31, 2025. Trading window remains closed for designated persons.",
            "Sentiment": "neutral",
            "PublishDate": 1769075198146,
            "Source": "co_actions_results"
        },
        {
            "Title": "Archidply Industries Reports Mixed Q2 Results with Standalone Profit Growth but Consolidated Losses",
            "Summary": "Archidply Industries Limited announced its quarterly results for the quarter and half-year ended September 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 12,684.10 lakhs for the quarter compared to Rs 11,498.25 lakhs in the same quarter last year. Standalone profit for the quarter was Rs 236.08 lakhs versus Rs 161.05 lakhs in the previous year quarter. However, on a consolidated basis, the company reported a loss of Rs 350.30 lakhs for the quarter compared to a loss of Rs 521.62 lakhs in the same quarter last year. For the half-year period, standalone revenue was Rs 24,617.35 lakhs compared to Rs 22,453.07 lakhs last year, with profit of Rs 536.83 lakhs versus Rs 412.41 lakhs previously. The consolidated half-year results showed a loss of Rs 415.57 lakhs compared to Rs 735.80 lakhs loss in the previous year. The company operates in three main segments: Plywood and Allied Products, Laminates and Allied Products, and Medium Density Fibre Board. The results were approved by the Board of Directors and reviewed by statutory auditors.",
            "Sentiment": "neutral",
            "PublishDate": 1762940584981,
            "Source": "earnings"
        },
        {
            "Title": "CRISIL Downgrades Archidply Industries' Credit Rating to BB+/Stable from BBB-/Stable",
            "Summary": "CRISIL Ratings has downgraded Archidply Industries Limited's long-term credit rating on bank loan facilities worth Rs. 100.5 crore from 'CRISIL BBB-/Stable' to 'CRISIL BB+/Stable'. The downgraded facilities include cash credit facilities from HDFC Bank Limited (Rs. 10.5 crore) and State Bank of India (Rs. 70 crore), along with facilities from South Indian Bank Limited (Rs. 6 crore) and ICICI Bank Limited (Rs. 14 crore). The rating certificate was issued on July 29, 2025, and will remain valid until March 31, 2026.",
            "Sentiment": "negative",
            "PublishDate": 1753778098907,
            "Source": "stock"
        },
        {
            "Title": "Archidply Industries Reports 19.6% Growth in Net Profit for Quarter Ended June 30, 2025",
            "Summary": "Archidply Industries Limited announced its quarterly results for the period ended June 30, 2025. The company's standalone revenue from operations reached Rs. 11,933.25 lakhs, with net profit increasing to Rs. 300.75 lakhs compared to Rs. 251.39 lakhs in the same quarter last year. Profit before tax stood at Rs. 425.18 lakhs versus Rs. 328.01 lakhs in the previous year quarter. The company's earnings per share improved to Rs. 1.51 from Rs. 1.27 in the corresponding period. On a consolidated basis, revenue from operations was Rs. 14,785.34 lakhs with a net profit of Rs. 56.81 lakhs. The company operates across three main segments: Plywood and Allied Products (Rs. 8,420.44 lakhs revenue), Laminates and Allied Products (Rs. 3,219.09 lakhs), and Medium Density Fibre Board (Rs. 290.73 lakhs standalone, Rs. 3,142.83 lakhs consolidated). The results were approved by the Board of Directors on July 26, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753522759623,
            "Source": "earnings"
        }
    ]
}