{
    "Symbol": "ARCHIES",
    "ISIN": "INE731A01020",
    "News": [
        {
            "Title": "Archies Q3FY26 Results: Revenue Drops 23% YoY",
            "Summary": "Archies Limited reported Q3FY26 revenue of ₹1,369.74 lakhs, down 23% YoY. Company posted net loss of ₹7.46 lakhs vs profit of ₹2.83 lakhs in Q3FY25. Nine-month revenue declined 11% to ₹4,580.55 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1770803784291,
            "Source": "co_actions_results"
        },
        {
            "Title": "Archies Limited Gets Credit Rating Affirmation",
            "Summary": "ICRA affirms [ICRA]BB (Negative) long-term rating for Archies Limited's Rs. 24.10 crores bank credit line, as disclosed under SEBI LODR regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769518440898,
            "Source": "stocks"
        },
        {
            "Title": "Archies Limited Director Arun Singhal Resigns",
            "Summary": "Archies Limited announces resignation of Independent Director Mr. Arun Singhal effective September 22, 2024, due to completion of tenure period and personal reasons.",
            "Sentiment": "neutral",
            "PublishDate": 1768282854144,
            "Source": "stocks"
        },
        {
            "Title": "Archies Limited Seeks Shareholder Approval for Secretarial Auditor and Independent Director Appointments",
            "Summary": "Archies Limited has issued a postal ballot notice seeking shareholder approval for appointing M/s Dayal Maur as secretarial auditor for five consecutive years (FY2025-2026 to FY2029-2030) at Rs. 50,000 remuneration, and appointing Mr. Rijul Bansal as Non-Executive Independent Director for five years from November 14, 2025. The e-voting period runs from November 26, 2025 to December 25, 2025, with results to be declared by December 27, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764054195766,
            "Source": "corporate_action"
        },
        {
            "Title": "Archies Limited Reports Board Changes and Q2 Financial Results",
            "Summary": "Archies Limited appointed Rijul Bansal as Additional Independent Director for 5 years while Shreyans Kataria resigned, leading to reconstitution of Audit and Nomination committees. The company reported quarterly revenue of Rs 1,813.06 lakhs and a net loss of Rs 25.21 lakhs for the quarter ended September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763116621575,
            "Source": "earnings"
        },
        {
            "Title": "Archies Limited Reports Quarterly Profit, Announces Key Board Appointments and Committee Restructuring",
            "Summary": "Archies Limited approved unaudited financial results for the quarter ended June 30, 2025, reporting a profit of Rs 30.01 lakhs compared to a loss of Rs 101.61 lakhs in the same quarter last year. Revenue from operations increased to Rs 1,352.16 lakhs from Rs 1,320.17 lakhs year-over-year. The company announced several key appointments: re-appointment of Mr. Jagdish Moolchandani as Executive Director for three years from September 28, 2025; appointment of Ms. Hanisha as Additional Executive Director for two years from August 13, 2025; and appointment of Mr. Shreyans Kataria as Additional Independent Director for five years from August 13, 2025. All appointments are subject to shareholder approval. The company restructured its Audit Committee and Nomination & Remuneration Committee to include the new independent director. Archies also re-appointed M/s Dayal & Maur as Secretarial Auditors for five years and M/s Uberoi Sood and Kapoor as Tax Auditor for FY 2025-26. The 35th Annual General Meeting is scheduled for September 24, 2025. Segment-wise, Stationery and Paper Bag contributed the highest revenue at Rs 831.89 lakhs, followed by Gifts at Rs 379.78 lakhs and Greeting Cards at Rs 117.76 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1755080146858,
            "Source": "earnings"
        },
        {
            "Title": "Archies Partners with Magicpin for Enhanced Gifting Experience",
            "Summary": "Archies, a well-known gifting and greeting cards company, has announced a partnership with Magicpin, a digital platform. This collaboration aims to revolutionize the gifting experience for customers, potentially expanding Archies' reach and improving its digital presence in the gifting market.",
            "Sentiment": "positive",
            "PublishDate": 1736749603000,
            "Source": "corporate_action"
        },
        {
            "Title": "Archies Partners with Al Hasnae Gifts for Middle East Expansion",
            "Summary": "Archies, an Indian company, has announced a partnership with Al Hasnae Gifts to expand its operations into the Gulf Cooperation Council (GCC) region. This collaboration marks Archies' entry into the Middle East market, potentially opening up new growth opportunities for the company in the greeting cards and gifts sector.",
            "Sentiment": "positive",
            "PublishDate": 1735192548000,
            "Source": "corporate_action"
        }
    ]
}