{
    "Symbol": "ARE&M",
    "ISIN": "INE885A01032",
    "News": [
        {
            "Title": "Amara Raja Energy Addresses NSE Fine for Filing Delay",
            "Summary": "Amara Raja Energy & Mobility board reviews ₹5,900 NSE fine for one-day delay in XBRL filing, citing inadvertent oversight and strengthening compliance processes.",
            "Sentiment": "neutral",
            "PublishDate": 1770818559896,
            "Source": "stocks"
        },
        {
            "Title": "Amara Raja Energy & Mobility Q3 FY26 Call on Feb 12",
            "Summary": "Amara Raja Energy & Mobility Limited schedules investor call for February 12, 2026, at 4:30 PM IST to discuss Q3/9M-FY26 financial results. Virtual conference call hosted by Avendus Spark.",
            "Sentiment": "neutral",
            "PublishDate": 1770400261126,
            "Source": "co_actions_results"
        },
        {
            "Title": "Amara Raja Energy appoints new Chief Operations Officer",
            "Summary": "Amara Raja Energy & Mobility Limited has appointed Mr. Narayan Sudhakar Choudhary as Chief Operations Officer effective January 19, 2026, replacing the outgoing COO who will superannuate.",
            "Sentiment": "neutral",
            "PublishDate": 1768827355264,
            "Source": "stocks"
        },
        {
            "Title": "Amara Raja Energy Gets GST Appeal Order Upheld",
            "Summary": "Amara Raja Energy & Mobility receives appellate order upholding ₹22.06 crore GST demand from Delhi tax authority, company to file tribunal appeal with pre-deposit.",
            "Sentiment": "negative",
            "PublishDate": 1765972775758,
            "Source": "stocks"
        },
        {
            "Title": "Amara Raja Energy & Mobility Seeks Shareholder Approval for Employee Stock Option Scheme 2025",
            "Summary": "Amara Raja Energy & Mobility Limited has issued a postal ballot notice seeking shareholder approval for its Employee Stock Option Scheme 2025, involving up to 25 lakh stock options through secondary acquisition via an ESOP trust. The scheme aims to attract and retain talent by granting stock options to eligible employees of the company and its unlisted subsidiaries, with voting scheduled from November 26 to December 25, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1764062543614,
            "Source": "corporate_action"
        },
        {
            "Title": "Amara Raja Energy Mobility Reports 6.5% Revenue Growth in Q2 with Strong OEM Demand",
            "Summary": "Amara Raja Energy Mobility Limited reported consolidated revenue of INR 3,467 crores in quarterly results, representing 6.5% year-over-year growth. Lead acid business contributed 95% of revenue at INR 3,297 crores with 5% growth, driven by robust OEM demand across 4-wheeler and 2-wheeler segments that grew 30% year-over-year. Aftermarket volumes remained stable due to procurement delays following GST rate revisions. New Energy business delivered INR 170 crores revenue, growing over 50% compared to previous year, supported by increased demand for telecom packs and chargers. The company supplied 150 megawatts in telecom volumes and commenced 3-wheeler packs with LFP cells. Stand-alone operating margins stood at 12%, impacted by warranty expense provisions and EPR liability provisions totaling INR 35 crores. The company invested INR 350 crores in Amara Raja Advanced Cell Technologies, bringing total lithium subsidiary investment to INR 1,200 crores. Capex outlook for the full year is INR 1,400-1,500 crores with major allocation toward New Energy business. International volumes remained flat due to tariff uncertainties, while industrial volumes declined 11% primarily due to telecom segment weakness.",
            "Sentiment": "positive",
            "PublishDate": 1762984730729,
            "Source": "earnings"
        },
        {
            "Title": "Six Companies Set Dividend Record Date for November 13, Last Trading Day November 12",
            "Summary": "Six companies have set November 13 as the record date for dividend eligibility, making November 12 the final day for investors to purchase shares to qualify for dividend payments. Great Eastern Shipping announced an interim dividend of Rs 7.20 per share, while Patanjali Foods declared Rs 1.75 per share. Amara Raja Energy & Mobility approved Rs 5.40 per share, Sasken Technologies set Rs 12 per share, and ADF Foods announced Rs 0.60 per share. Kriti Nutrients declared a special dividend of Rs 3 per share. Due to India's T+1 settlement cycle, investors must own shares by November 12 to receive the dividend payments. Dividend income exceeding Rs 5,000 annually is subject to 10% TDS for resident individuals.",
            "Sentiment": "neutral",
            "PublishDate": 1762919765779,
            "Source": "corporate_action"
        },
        {
            "Title": "Amara Raja Energy & Mobility Approves Employee Stock Option Scheme 2025",
            "Summary": "Amara Raja Energy & Mobility Limited's Board of Directors approved the Employee Stock Option Scheme 2025 on November 6, 2025. The scheme covers a total pool of 25 lakh employee stock options convertible into 25 lakh equity shares of face value Re. 1 each. The scheme will be implemented through a Trust Route, where the Trust will acquire existing equity shares from the open market through secondary acquisition. The exercise price will be decided by the Nomination and Remuneration Committee and linked to market price, with the committee having power to provide up to 20% discount. Options may be exercised within a maximum period of 5 years from vesting date. The scheme is subject to shareholder approval through Postal Ballot and compliance with SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1762449851027,
            "Source": "corporate_action"
        },
        {
            "Title": "Amara Raja Energy & Mobility Reports 8% Revenue Growth in Q2 FY26",
            "Summary": "Amara Raja Energy & Mobility Limited reported revenue of Rs 3,388.18 crores for Q2 FY26, representing an 8% increase from Rs 3,349.92 crores in the same quarter of the previous year. The company posted a profit before tax of Rs 406 crores with earnings per share of Rs 16.52. Revenue growth was driven by strong OEM demand across 4-wheeler and 2-wheeler segments, robust performance from the lubes business, and increased export realizations. The new energy business showed growth in the telecom segment. Management noted declining lead-acid battery demand in telecom while lithium solutions gained traction. Global trade and tariff uncertainties impacted export performance. The company expects its Customer Qualification Plant for indigenous cell manufacturing to be operational by Q4 of the current fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1762437000655,
            "Source": "earnings"
        },
        {
            "Title": "Amara Raja Energy & Mobility Reports Mixed Q2 Results with Higher Profit but Lower EBITDA",
            "Summary": "Amara Raja Energy & Mobility reported Q2 consolidated net profit of 2.77 billion rupees, up from 2.36 billion rupees in the same period last year. Revenue increased to 34.67 billion rupees from 32.5 billion rupees year-over-year. However, EBITDA declined to 3.74 billion rupees from 4.33 billion rupees, while EBITDA margin compressed to 10.8% from 13.31% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762432597260,
            "Source": "earnings"
        },
        {
            "Title": "M&M Reports Strong October Sales Growth in Both Auto and Tractor Segments",
            "Summary": "M&M reported October total sales of 1,20,142 units in its auto segment, representing growth from 96,648 units in the same period last year and exceeding estimates of 96,060 units. The company's tractor segment also showed strong performance with October sales of 73,660 units compared to 65,453 units year-over-year, surpassing estimates of 61,200 units. Both segments delivered sales figures above market expectations.",
            "Sentiment": "positive",
            "PublishDate": 1762128885662,
            "Source": "stock"
        },
        {
            "Title": "Amara Raja Energy & Mobility Appoints Chandrasekar Radhakrishnan as Chief Business Officer - Automotive",
            "Summary": "Amara Raja Energy & Mobility Limited has appointed Mr. Chandrasekar Radhakrishnan as Chief Business Officer - Automotive (Domestic & SAARC) effective October 27, 2025. Radhakrishnan holds a bachelor's degree in Computer Engineering from Manipal Institute of Technology and a post-graduate degree in Marketing Studies from NMIMS, Mumbai. He has completed the Digital Business Leadership Program at Columbia Business School, New York. He brings extensive experience in Sales, Marketing, and P&L leadership across FMCG, Telecom and EV sectors, joining from Hero MotoCorp where he served as Head of Business Growth - Emerging Mobility. In his new role, he will drive the company's business strategy in India and SAARC region, strengthen brand positioning, and enable business growth through integrated marketing initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1761636740956,
            "Source": "corporate_governance"
        },
        {
            "Title": "Brahmayya & Co Resigns as Statutory Auditor of Amara Raja's Subsidiary",
            "Summary": "M/s Brahmayya & Co, Chartered Accountants resigned as statutory auditors of Amara Raja Advanced Cell Technologies Private Limited, a wholly owned material subsidiary of Amara Raja Energy & Mobility Limited, effective September 24, 2025. The auditing firm was originally appointed for a five-year term until March 31, 2028, following their appointment on August 29, 2023. The resignation was prompted by the company's decision to align its statutory auditor with that of the holding company for operational efficiency and consistency in the audit process. Brahmayya & Co had completed their tenure as statutory auditors of the holding company Amara Raja Energy & Mobility Limited on August 14, 2025. The resigning auditors confirmed no concerns regarding the management of the subsidiary and stated no other material reasons for their resignation beyond the alignment strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1758716200555,
            "Source": "corporate_governance"
        },
        {
            "Title": "Government May Introduce Incentive Program for Critical Mineral Recycling",
            "Summary": "The government is considering advocating for an incentive program focused on critical mineral recycling processes. This development relates to Amara Raja, though specific details about the company's involvement or the program's structure are not provided.",
            "Sentiment": "positive",
            "PublishDate": 1756890670004,
            "Source": "stock"
        },
        {
            "Title": "Amara Raja Energy & Mobility Makes Earnings Call Recording Available on Company Website",
            "Summary": "Amara Raja Energy & Mobility Limited has made the audio recording of their earnings call held on August 18, 2025, available on the company's website. The company had previously issued intimations about the earnings call on August 12 and 15, 2025. The company has changed its name from Amara Raja Batteries Limited to Amara Raja Energy & Mobility Limited, reflecting a strategic shift toward broader energy and mobility focus. The filing complies with SEBI regulations and demonstrates the company's commitment to transparency by providing equal access to earnings call information for all stakeholders.",
            "Sentiment": "neutral",
            "PublishDate": 1755533954116,
            "Source": "earnings"
        },
        {
            "Title": "Amara Raja Energy & Mobility Appoints Radhika Shapoorjee as Independent Director",
            "Summary": "Amara Raja Energy & Mobility Limited appointed Ms. Radhika Shapoorjee as an Independent Director. The appointment was approved by shareholders at the 40th Annual General Meeting held on August 14, 2025. Ms. Shapoorjee holds DIN: 03559547 and is not related to any Directors or Key Managerial Personnel of the company. She meets the criteria for Independent Director appointment under applicable statutes and has confirmed she has not been debarred from holding directorship by SEBI or other authorities.",
            "Sentiment": "neutral",
            "PublishDate": 1755194824057,
            "Source": "corporate_governance"
        },
        {
            "Title": "Amara Raja Energy & Mobility Reports Mixed Q1 Results with Revenue Growth but Lower Profit",
            "Summary": "Amara Raja Energy & Mobility reported Q1 consolidated net profit of 1.65 billion rupees, down from 2.49 billion rupees in the same period last year. The company's Q1 revenue increased to 34 billion rupees compared to 32.63 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1755159584854,
            "Source": "earnings"
        },
        {
            "Title": "Bhairavi Tushar Jani Retires from Amara Raja Energy & Mobility Board After Completing Second Term",
            "Summary": "Ms. Bhairavi Tushar Jani completed her second term as an Independent Director of Amara Raja Energy & Mobility Limited and retired from the Board effective August 13, 2025. Her appointment was previously approved by shareholders at the 35th Annual General Meeting held on August 7, 2020. The Board of Directors and Management expressed appreciation for her extensive contribution and stewardship during her tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1755151667508,
            "Source": "corporate_governance"
        },
        {
            "Title": "Amara Raja Energy & Mobility: Block Trade of 287,531 Shares",
            "Summary": "A block trade of approximately 287,531 shares of Amara Raja Energy & Mobility Ltd. occurred on the National Stock Exchange (NSE). The transaction was valued at Rs. 27.75 Crores, with shares trading at Rs. 965.00 each.",
            "Sentiment": "neutral",
            "PublishDate": 1751867966000,
            "Source": "block_details"
        },
        {
            "Title": "Amara Raja Energy & Mobility to Review Q1 Results on August 14",
            "Summary": "Amara Raja Energy & Mobility has announced that it will review its first quarter results on August 14.",
            "Sentiment": "neutral",
            "PublishDate": 1751027325000,
            "Source": "default"
        },
        {
            "Title": "Amara Raja Energy & Mobility: Q4 Profit Drops 29.7%, Declares Dividend",
            "Summary": "Amara Raja Energy & Mobility reported a 29.7% YoY decline in Q4 net profit to ₹1.62 billion. Revenue rose 5.2% to ₹30.60 billion. EBITDA fell 17% to ₹3.41 billion with margin narrowing to 11.13%. The company declared a final dividend of ₹5.20 per share.",
            "Sentiment": "negative",
            "PublishDate": 1748526987000,
            "Source": "earnings"
        },
        {
            "Title": "Hyundai Motor India Partners with Amara Raja for Advanced AGM Battery Technology",
            "Summary": "Hyundai Motor India has become the first automaker in the country to offer Made-in-India Advanced Glass Mat (AGM) battery technology, sourcing these batteries from Amara Raja Energy & Mobility. This move signifies a technological advancement in the Indian automotive sector and strengthens the partnership between the two companies.",
            "Sentiment": "positive",
            "PublishDate": 1734654805000,
            "Source": "corporate_action"
        },
        {
            "Title": "Amara Raja Energy & Mobility: Q2 Profit Up, Doubles Giga Factory Investment",
            "Summary": "Amara Raja reported a 6.32% YoY increase in Q2 net profit to Rs 240.71 crore, with revenue up 11.55% to Rs 3,135.83 crore. The company declared an interim dividend of Rs 5.3/share and doubled its investment limit to Rs 2,000 crore for setting up a gigafactory.",
            "Sentiment": "positive",
            "PublishDate": 1730725193000,
            "Source": "result"
        }
    ]
}