{
    "Symbol": "ARENTERP",
    "ISIN": "INE610C01014",
    "News": [
        {
            "Title": "Rajdarshan Industries Reports Loss of Rs 7.31 Lakhs in Q2 Despite Revenue of Rs 9.30 Lakhs",
            "Summary": "Rajdarshan Industries Limited reported a net loss of Rs 7.31 lakhs for the quarter ended September 30, 2025, compared to a profit of Rs 20.95 lakhs in the same quarter last year. Revenue from operations declined significantly to Rs 9.30 lakhs from Rs 37.98 lakhs year-on-year. The company's total income for the quarter was Rs 8.64 lakhs versus Rs 63.39 lakhs in the previous year. For the six-month period, the company maintained profitability with net profit of Rs 17.13 lakhs and total income of Rs 74.25 lakhs. The company's earnings per share for continuing operations was negative Rs 0.24 for the quarter. Total comprehensive income for the quarter was Rs 16.14 lakhs. The Board approved these unaudited financial results in a meeting held on November 13, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1763035671555,
            "Source": "earnings"
        },
        {
            "Title": "Rajdarshan Industries Re-appoints CEO Devendra Sharma for Five Years, Names New Secretarial Auditor",
            "Summary": "Rajdarshan Industries Limited shareholders approved two key appointments at their 44th Annual General Meeting held on September 30, 2025. The company re-appointed Mr. Devendra Sharma as CEO & Managing Director for a five-year term from February 1, 2026 to January 31, 2031. Sharma holds a Master's degree in Commerce and has been with the company in leadership roles for several years, contributing to business strategy formulation and expansion plans. Additionally, the company appointed M/s Ronak Jhuthawat & Co. as Secretarial Auditor for five consecutive years starting from FY 2025-26 to FY 2029-30. The firm has over 11 years of experience in corporate laws, SEBI regulations, and capital market transactions.",
            "Sentiment": "positive",
            "PublishDate": 1759284348701,
            "Source": "corporate_governance"
        },
        {
            "Title": "Rajdarshan Industries Re-appoints Devendra Sharma as CEO & Managing Director for 5-Year Term",
            "Summary": "Rajdarshan Industries Limited's Board of Directors approved the re-appointment of Mr. Devendra Sharma as CEO & Managing Director for a five-year term starting February 1, 2026. The decision was made based on recommendations from the Nomination & Remuneration Committee and requires shareholder approval at the upcoming 44th Annual General Meeting scheduled for September 30, 2025. Sharma holds a Master's degree in Commerce and has been with the company in a leadership capacity for several years, contributing to growth and business strategy implementation. He has played a key role in the company's expansion and diversification plans while mentoring the leadership team.",
            "Sentiment": "positive",
            "PublishDate": 1756994174105,
            "Source": "corporate_governance"
        },
        {
            "Title": "Rajdarshan Industries Reports ₹24.44 Lakh Net Profit in Q1 FY2026",
            "Summary": "Rajdarshan Industries Limited reported net profit of ₹24.44 lakh for the quarter ended June 30, 2025, compared to ₹39.68 lakh in the same quarter last year. Revenue from operations declined to ₹30.12 lakh from ₹112.18 lakh year-over-year. Total income was ₹65.61 lakh versus ₹157.78 lakh in the previous year quarter. The company's earnings per share stood at ₹0.79 compared to ₹1.28 in the corresponding quarter last year. Total comprehensive income was ₹97.68 lakh for the quarter. The board approved both standalone and consolidated unaudited financial results during a meeting held on August 14, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1755175132668,
            "Source": "earnings"
        },
        {
            "Title": "Rajdarshan Industries Schedules Board Meeting for August 14, 2025 to Approve Q1 FY2026 Results",
            "Summary": "Rajdarshan Industries Limited has scheduled a Board of Directors meeting for August 14, 2025. The board will consider and approve unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The meeting will also address other business items with the chair's permission. The company notified both the National Stock Exchange of India and Bombay Stock Exchange about the scheduled meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1753345241907,
            "Source": "corporate_action"
        }
    ]
}