{
    "Symbol": "ARFIN",
    "ISIN": "INE784R01023",
    "News": [
        {
            "Title": "ARFIN India Reports 68% Jump in Q3 Net Profit",
            "Summary": "ARFIN India Limited delivered strong quarterly performance with consolidated net profit rising to ₹51 million in Q3 from ₹30.3 million in the same period last year, marking significant year-on-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1769848827912,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arfin India Board Meet Set for Jan 31 for Q3FY26 Results",
            "Summary": "Arfin India Limited has scheduled its board meeting for January 31, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769080279507,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arfin India Expands EHV Conductor Manufacturing Capacity",
            "Summary": "Arfin India Limited announces purchase of advanced machinery including Rigid Multi-Stranding Machine and High Capacity Double Wire RBD Machine to enter Extra High Voltage conductor market and boost production capacity.",
            "Sentiment": "positive",
            "PublishDate": 1768908925473,
            "Source": "stocks"
        },
        {
            "Title": "Arfin India bags ₹321 cr repeat order from Diamond Power",
            "Summary": "Arfin India secured ₹321 crore repeat order from Diamond Power Infrastructure for aluminium conductors supply over 11 months, reinforcing customer relationships.",
            "Sentiment": "positive",
            "PublishDate": 1766991227324,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arfin India Launches Medium Voltage Covered Conductor Product Line",
            "Summary": "Arfin India Limited announced the introduction of a new Medium Voltage Covered Conductor (MVCC) product line within its Conductor & Cable Division, targeting growing demand from power distribution and utilities sectors. The company expects this niche product expansion to generate approximately 100 Crore in additional revenue over three years and improve overall margins, with production scheduled to commence in FY 2026-27.",
            "Sentiment": "positive",
            "PublishDate": 1764740856693,
            "Source": "stock"
        },
        {
            "Title": "Arfin India Promoter Mahendrakumar Shah Sells 29,626 Equity Shares",
            "Summary": "Mahendrakumar Rikhavchand Shah, a promoter of Arfin India Limited, disposed of 29,626 equity shares in the open market on December 2, 2025. The transaction was disclosed under SEBI regulations for substantial acquisition of shares and takeovers to BSE and NSE exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1764675584663,
            "Source": "corporate_action"
        },
        {
            "Title": "Arfin India Limited's Credit Ratings Reaffirmed by CRISIL at BBB/Stable and A3",
            "Summary": "CRISIL Ratings has reaffirmed Arfin India Limited's credit ratings at CRISIL BBB/Stable for long-term and CRISIL A3 for short-term facilities, covering total bank loan facilities of Rs. 129.21 crores. The ratings reflect the company's extensive promoter experience in the steel industry, established and diversified clientele, and strong capital structure. Operating revenue increased 15% from Rs. 535 crores in fiscal 2024 to Rs. 616 crores in fiscal 2025. Net worth improved to Rs. 157 crores as of March 31, 2025, from Rs. 90 crores a year earlier, aided by private placement equity infusion of Rs. 52.5 crores. However, the ratings are constrained by modest operating margins of 5.97% and large working capital cycle with gross current assets of 159 days. The company manufactures aluminum products, ferro alloys, and steel products at its Chhatral facility in Gandhinagar with installed capacity of 71,000 tonnes per annum.",
            "Sentiment": "neutral",
            "PublishDate": 1763018108195,
            "Source": "corporate_action"
        },
        {
            "Title": "Arfin India Limited Reports Q2 FY26 Results and Declares Interim Dividend",
            "Summary": "Arfin India Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. On a consolidated basis, the company reported revenue from operations of ₹12,793.68 lakhs for the quarter and ₹23,679.73 lakhs for the half-year. Net profit after tax stood at ₹245.46 lakhs for the quarter and ₹353.56 lakhs for the half-year. On a standalone basis, revenue from operations was ₹12,803.70 lakhs for the quarter and ₹23,678.77 lakhs for the half-year, with net profit of ₹205.42 lakhs for the quarter and ₹307.27 lakhs for the half-year. The Board declared an interim dividend of ₹0.11 per equity share for FY 2025-26, with November 17, 2025 fixed as the record date. The company operates in manufacturing and trading of ferrous and non-ferrous metals and was listed on NSE with effect from July 22, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762864054909,
            "Source": "corporate_action"
        },
        {
            "Title": "ARFIN India Reports Decline in Q2 Financial Performance Across Key Metrics",
            "Summary": "ARFIN India reported quarterly results showing decreased performance across major financial indicators. EBITDA fell to 88 million rupees from 97 million rupees year-over-year, while EBITDA margin compressed to 5.9% from 6.49%. Net profit declined to 20.5 million rupees compared to 26 million rupees in the same period last year. Revenue dropped to 1.3 billion rupees from 1.5 billion rupees year-over-year, reflecting broad-based weakness in the company's financial performance.",
            "Sentiment": "negative",
            "PublishDate": 1762846364857,
            "Source": "earnings"
        },
        {
            "Title": "Arfin India Secures ₹5.43 Crore Order for Aluminium Wire Rods Supply",
            "Summary": "Arfin India Limited received an order from JFE Shoji India Private Limited for supplying Aluminium Wire Rods to ArcelorMittal Nippon Steel India Ltd. The order is valued at approximately ₹5.43 crores for 500 MT to be delivered over four months from September to December 2025, with monthly supplies of around 125 MT. The company confirmed that none of its promoters or group companies have any interest in the entity that awarded the order, and the transaction does not constitute a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1758274629852,
            "Source": "order&deals"
        },
        {
            "Title": "Arfin India Secures ₹180 Crore Aluminium Supply Order from JFE Shoji India",
            "Summary": "Arfin India Limited has secured an order from JFE Shoji India Private Limited for the supply of aluminium products including ingots, wire rods, and cubes/shots. The order covers 6,900 MT valued at approximately ₹180 crores, to be executed over six months from October 2025 to March 2026. This translates to monthly supplies of around 1,150 MT worth approximately ₹30 crores per month. JFE Shoji India is a domestic entity of JFE Shoji Corporation, Japan. The company stated that no promoters or group companies have any interest in the entity that awarded the order, and it does not constitute a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1758199547833,
            "Source": "order&deals"
        },
        {
            "Title": "Arfin India Secures ₹25.98 Crore Order for Aluminium Deox Products Supply",
            "Summary": "Arfin India Limited received an order from JFE Shoji India Private Limited for supplying 900 MT of Aluminium Deox products worth approximately ₹25.98 crores. The products are scheduled for August delivery to various steel mills in Western India. The company confirmed that none of the promoter groups have any interest in the entity that awarded the order, and the transaction does not fall under related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1754298597559,
            "Source": "order&deals"
        },
        {
            "Title": "Arfin India Reports ₹101.85 Lakh Quarterly Profit, Schedules AGM for September 6",
            "Summary": "Arfin India Limited approved its unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹10,875.07 lakh and net profit of ₹101.85 lakh, compared to ₹300.69 lakh profit in the same quarter last year. On a consolidated basis, the company posted revenue of ₹10,886.05 lakh and profit of ₹108.10 lakh. Earnings per share stood at ₹0.06 for both standalone and consolidated results. The company scheduled its 33rd Annual General Meeting for September 6, 2025, to be conducted via video conferencing. Arfin India operates in manufacturing and trading of ferrous and non-ferrous metals and was listed on NSE with effect from July 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754293974662,
            "Source": "earnings"
        },
        {
            "Title": "ARFIN INDIA Reports Decline in Q1 Financial Performance",
            "Summary": "ARFIN INDIA reported quarterly results showing a decline across key financial metrics. Revenue fell to 1.1 billion rupees from 1.3 billion rupees in the same period last year. Net profit dropped significantly to 11 million rupees compared to 30 million rupees year-over-year. EBITDA decreased to 66 million rupees from 91 million rupees, while EBITDA margin compressed to 6.1% from 6.8% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754293573251,
            "Source": "earnings"
        },
        {
            "Title": "Arfin India Receives NSE Trading Approval, Listing Scheduled for July 22",
            "Summary": "Arfin India has received approval for trading on the National Stock Exchange (NSE). The company's listing is set to begin on July 22.",
            "Sentiment": "positive",
            "PublishDate": 1752906729252,
            "Source": "stock"
        },
        {
            "Title": "Arfin India Board Approves NSE Listing",
            "Summary": "Arfin India has received board approval for listing its shares on the National Stock Exchange (NSE). This decision indicates the company's intention to expand its presence in the Indian stock market.",
            "Sentiment": "positive",
            "PublishDate": 1748587958000,
            "Source": "default"
        },
        {
            "Title": "Arfin India Reports Q4 Financial Results",
            "Summary": "Arfin India has reported its quarterly financial results. The company's net profit for Q4 is 5 million rupees, compared to 21.8 million rupees in the same quarter last year, showing a year-over-year decrease. Revenue for Q4 is 1.78 billion rupees, up from 1.37 billion rupees in the corresponding quarter of the previous year, indicating an increase in revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1747987863000,
            "Source": "result"
        },
        {
            "Title": "Arfin India Reports Improved Q2 EBITDA and Margin",
            "Summary": "Arfin India has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 96.8 million rupees from 71.1 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 6.49% from 5.30% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729669989000,
            "Source": "result"
        },
        {
            "Title": "Arfin India Reports Q2 Profit and Revenue Growth",
            "Summary": "Arfin India has announced its Q2 financial results. The company's net profit increased to 26 million rupees from 17.4 million rupees in the same quarter last year. Revenue also saw growth, rising to 1.5 billion rupees from 1.34 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729669909000,
            "Source": "result"
        }
    ]
}