{
    "Symbol": "ARIES",
    "ISIN": "INE298I01015",
    "News": [
        {
            "Title": "Dr. Rahul Mirchandani Increases Stake in Aries Agro",
            "Summary": "Dr. Rahul Mirchandani acquired 1,80,000 shares through transmission from brother on December 19, 2025, increasing his shareholding from 27.29% to 28.67% in the fertilizer company.",
            "Sentiment": "neutral",
            "PublishDate": 1766390454753,
            "Source": "stocks"
        },
        {
            "Title": "Aries Agro Limited Approves Unaudited Financial Results for Q2 and Half Year Ended September 2025",
            "Summary": "Aries Agro Limited's Board approved unaudited standalone and consolidated financial results for the second quarter and half year ended September 30, 2025, during a meeting held on November 13, 2025. The company operates through three subsidiaries and one associate company, with its business focused on micro nutrients, fertilizers, and plant nutrition solutions that are impacted by cropping patterns and weather conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1763051275854,
            "Source": "earnings"
        },
        {
            "Title": "Aries Agro Reports Strong Q1 Performance with 993 Crore Net Profit, Sets AGM Date",
            "Summary": "Aries Agro Limited's board approved Q1 FY2025-26 unaudited financial results showing consolidated net profit of Rs 993.01 crore compared to Rs 715.96 crore in the corresponding quarter last year. Standalone net profit reached Rs 917.03 crore versus Rs 796.34 crore in the same period. The company scheduled its Annual General Meeting for September 26, 2025, and fixed September 19, 2025 as the record date for FY2024-25 dividend entitlement with payment due October 17, 2025. The board appointed A. Sekar as Secretarial Auditor for five consecutive financial years from FY2025-26 to FY2029-30, subject to shareholder approval. Revenue from operations increased to Rs 20,476.37 crore from Rs 17,593.40 crore year-over-year on a consolidated basis.",
            "Sentiment": "positive",
            "PublishDate": 1755088811127,
            "Source": "earnings"
        },
        {
            "Title": "Aries Agro Reports Q4 Loss and Recommends Dividend",
            "Summary": "Aries Agro has recommended a dividend of 1.2 rupees per equity share. The company reported a consolidated net loss of 37 million rupees in Q4, compared to a loss of 56 million rupees in the same quarter last year and 116 million rupees in the previous quarter. Q4 revenue increased to 1.7 billion rupees from 1.4 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747923403000,
            "Source": "result"
        }
    ]
}