{
    "Symbol": "ARIHANTCAP",
    "ISIN": "INE420B01036",
    "News": [
        {
            "Title": "Arihant Capital Gets Approval for 50 Lakh Equity Shares",
            "Summary": "Arihant Capital Markets receives in-principle approval from BSE and NSE for issuance of 50,00,000 equity shares upon conversion of warrants to promoter category at Rs. 68.50 per share.",
            "Sentiment": "positive",
            "PublishDate": 1770459576281,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arihant Capital Markets Receives Exchange Approval for Trading of 5 Lakh Preferential Equity Shares",
            "Summary": "Arihant Capital Markets Limited has received approval from both NSE and BSE for trading of 5,00,000 equity shares of face value Rs. 1 each issued at a premium of Rs. 86 per share to non-promoter group on preferential basis. The securities are listed and admitted for trading on both exchanges effective from December 10, 2025, with distinctive numbers from 104112801 to 104612800 and a lock-in period until June 25, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1765290065462,
            "Source": "corporate_action"
        },
        {
            "Title": "Arihant Capital Markets Converts 50 Lakh Warrants into Equity Shares Worth Rs 25.69 Crore",
            "Summary": "Arihant Capital Markets Limited's Preferential Allotment Committee approved the conversion of 50,00,000 warrants into equity shares at Rs 68.50 per share, raising Rs 25,68,75,000 from two promoter group entities. The allotment was made to Ashok Kumar Jain HUF and Arpit Jain HUF, each receiving 25,00,000 shares and holding 2.28% post-conversion shareholding.",
            "Sentiment": "positive",
            "PublishDate": 1763809039429,
            "Source": "corporate_action"
        },
        {
            "Title": "Arihant Capital Promoter Mrs. Kiran Jain Sells 35 Lakh Equity Shares",
            "Summary": "Mrs. Kiran Jain, a promoter of Arihant Capital Markets Limited, disposed of 35,00,000 equity shares representing 3.36% of the company's paid-up share capital on November 17, 2025 through open market transactions. Following this disposal, Mrs. Kiran Jain will hold 2,01,41,600 equity shares in the company, with the transaction disclosed under SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763531363250,
            "Source": "corporate_action"
        },
        {
            "Title": "Arihant Capital Markets Reports Partial Allotment in Preferential Equity Issue",
            "Summary": "Arihant Capital Markets Limited disclosed a statement of deviation for its preferential equity issue for the quarter ended September 30, 2025. The company received confirmation from only one of the proposed allottees, resulting in partial allotment. 5,00,000 equity shares amounting to ₹4.35 crores were allotted to this single allottee. The original allocation plan included ₹45.67 crores for business growth and technology infrastructure (reduced to ₹2.18 crores), ₹27.41 crores for working capital (reduced to ₹1.30 crores), and ₹18.27 crores for general corporate purposes (reduced to ₹0.87 crores). The funds utilized across all objectives showed a 95.23% deviation from the original plan due to the partial subscription.",
            "Sentiment": "neutral",
            "PublishDate": 1762473143912,
            "Source": "corporate_action"
        },
        {
            "Title": "Arihant Capital Markets Reports Decline in Q2 Profit and Revenue",
            "Summary": "Arihant Capital Markets reported a consolidated net profit of 131 million rupees for Q2, down from 199 million rupees in the same quarter last year. The company's revenue also decreased to 570 million rupees from 764 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762440325579,
            "Source": "earnings"
        },
        {
            "Title": "Arihant Capital Markets Allots 5 Lakh Equity Shares to Non-Promoter Investor for ₹43.5 Crore",
            "Summary": "Arihant Capital Markets Limited has allotted 5,00,000 equity shares on a preferential basis to Premadevi Taparia, a non-promoter investor. The shares were issued at ₹87 per share, including a premium of ₹86, raising ₹4.35 crore for the company. This allotment is part of a larger approved issuance of 1.05 crore equity shares. The company's paid-up equity share capital increased from ₹10.41 crore to ₹10.46 crore. The allotment was approved by the Preferential Allotment Committee following a special resolution passed at an extraordinary general meeting held on August 21, 2025, and in-principle approval from BSE and NSE on September 8, 2025. Premadevi Taparia now holds 0.48% stake in the company. The newly allotted shares will rank equally with existing equity shares and will be subject to lock-in requirements as per SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1758627545349,
            "Source": "corporate_action"
        },
        {
            "Title": "Arihant Capital Markets Receives Exchange Approval for Rs 91.35 Crore Preferential Share Issue",
            "Summary": "Arihant Capital Markets Limited has received in-principle approval from BSE and NSE to issue 1.05 crore equity shares to non-promoter investors on a preferential basis at Rs 87 per share. The approval was granted on September 8, 2025, for shares with a face value of Re 1 each. The exchanges have set several conditions including filing listing applications after allotment, obtaining statutory approvals from SEBI, RBI and MCA, and ensuring compliance with applicable regulations. NSE has specifically advised the company to strengthen internal controls and obtain undertakings from allottees to avoid intra-day trading until allotment. The exchanges reserve the right to withdraw approval if submitted information is found incomplete or misleading.",
            "Sentiment": "positive",
            "PublishDate": 1757933532029,
            "Source": "corporate_action"
        },
        {
            "Title": "Arihant Capital Markets Declares Re. 0.50 Dividend with September 20, 2025 Record Date",
            "Summary": "Arihant Capital Markets Limited has announced a dividend of Re. 0.50 per equity share for the financial year 2024-2025. The company set September 20, 2025 as the record date to determine shareholder eligibility for the dividend payment. The dividend represents a 50% payout on shares with a face value of Re. 1 each. Payment will be made on or after October 3, 2025, subject to applicable tax deductions at source.",
            "Sentiment": "positive",
            "PublishDate": 1757591981447,
            "Source": "corporate_action"
        },
        {
            "Title": "Arihant Capital Markets Approves Complex Restructuring Scheme to Create Two Listed Entities",
            "Summary": "Arihant Capital Markets Limited's board approved a composite scheme of arrangement involving multiple group companies on August 26, 2025. The restructuring includes amalgamation of wholly-owned subsidiary Arihant Financial Services Limited into Arihant Capital Markets with no share issuance, demerger of business segments (excluding retail broking, immovable properties and investments) to Arihant Elite Financial Solutions Limited on a 1:1 share ratio, and subsequent transfer of merchant banking and distribution businesses to specialized subsidiaries for cash consideration of INR 5.98 crores and INR 0.57 crores respectively. The scheme aims to create two focused listed entities - Arihant Capital Markets specializing in retail broking and Arihant Elite Financial Solutions focusing on NBFC business. The demerged undertaking represents 2.18% of Arihant Capital Markets' total standalone turnover. The restructuring requires approvals from shareholders, creditors, regulatory authorities including SEBI, RBI, and stock exchanges. The board also approved shifting the registered office within Indore city limits.",
            "Sentiment": "positive",
            "PublishDate": 1756210181340,
            "Source": "corporate_action"
        },
        {
            "Title": "Arihant Capital Markets Issues Second Corrigendum for EGM, Corrects Valuation Error",
            "Summary": "Arihant Capital Markets Limited has issued a second corrigendum for its Extra-Ordinary General Meeting scheduled for August 21, 2025. The corrigendum provides additional disclosures for the proposed preferential allotment of equity shares and corrects a valuation error. The company plans to raise ₹91.35 crore through the preferential issue, with funds allocated for business growth and expansion (₹45.67 crore), working capital and capital expenditure (₹27.41 crore), and general corporate purposes (₹18.27 crore). The corrigendum reveals an inadvertent error in the PAT figure for FY 2023, which was incorrectly stated as ₹3,858.34 lakhs instead of the correct ₹2,911.76 lakhs. This correction revised the PECV valuation to ₹81.29 per share and average valuation to ₹76.57 per share, down from the originally mentioned ₹77.31. However, the proposed issue price of ₹87 per share remains unchanged as it continues to meet regulatory requirements. The Registered Valuer issued an addendum on August 14, 2025, to correct the original valuation report.",
            "Sentiment": "neutral",
            "PublishDate": 1755523304506,
            "Source": "corporate_action"
        },
        {
            "Title": "Arihant Capital Markets Completes Acquisition of Two Financial Services Entities Through Subsidiary",
            "Summary": "Arihant Capital Markets Limited's wholly owned subsidiary, Arihant Elite Financial Solutions Limited, has completed the acquisition of Arihant Money Marvel Wealth Management Limited and Arihant Investment Banking Services Limited, making them step-down subsidiaries. Both acquired entities have authorized and paid-up capital of Rs 10 lakh each and have not yet commenced business operations. Arihant Investment Banking Services Limited will focus on merchant banking, portfolio management, underwriting, and advisory services. Arihant Money Marvel Wealth Management Limited will handle wealth management activities and business acquisitions. The acquisition was completed through cash consideration with equity shares subscribed at par value, giving 100% ownership through the subsidiary. Both entities are newly incorporated in India and operate in the financial services sector.",
            "Sentiment": "neutral",
            "PublishDate": 1755081423984,
            "Source": "order&deals"
        },
        {
            "Title": "Arihant Capital Markets Issues Corrigendum for EGM on Preferential Share Allotment",
            "Summary": "Arihant Capital Markets Limited has issued a corrigendum to its Extra-Ordinary General Meeting notice scheduled for August 21, 2025. The corrigendum provides additional disclosures for the preferential allotment of equity shares, including updated shareholding patterns and detailed fund utilization plans. The company plans to raise ₹91.35 crore through the preferential issue, with funds allocated for business growth and expansion (₹45.67 crore), working capital and capital expenditure (₹27.41 crore), and general corporate purposes (₹18.27 crore). The proposed allottees are Preeti Mahapatra, Harihara Mahapatra, and Premadevi Taparia, who would hold 4.18%, 4.18%, and 0.42% respectively after considering conversion of outstanding warrants. The funds will be utilized for expanding broking operations, technology infrastructure upgrades, opening new regional offices, and strategic initiatives within 12 months of receipt.",
            "Sentiment": "neutral",
            "PublishDate": 1754659871498,
            "Source": "corporate_action"
        },
        {
            "Title": "Arihant Capital Markets Approves Alteration of Main Object Clause in Memorandum of Association",
            "Summary": "Arihant Capital Markets Limited held an Extra-Ordinary General Meeting on July 31, 2025, where members approved the alteration of the Main Object Clause 1 of the Memorandum of Association. The meeting commenced at 12:30 PM and concluded at 12:55 PM. The voting results will be announced upon receipt of the Scrutinizer's Report.",
            "Sentiment": "neutral",
            "PublishDate": 1753953756666,
            "Source": "corporate_action"
        },
        {
            "Title": "Arihant Capital Markets Receives Approval to Raise ₹913.5 Million in Funding",
            "Summary": "Arihant Capital Markets has obtained approval to raise ₹913.5 million in funding. The approval represents a significant capital raising initiative for the financial services company.",
            "Sentiment": "positive",
            "PublishDate": 1753444173769,
            "Source": "stock"
        },
        {
            "Title": "Arihant Capital Markets to Consider Equity Fundraising on July 25",
            "Summary": "Arihant Capital Markets announced it will consider raising funds through equity shares on July 25. The company has scheduled this date to deliberate on potential equity fundraising options.",
            "Sentiment": "neutral",
            "PublishDate": 1753190543872,
            "Source": "stock"
        },
        {
            "Title": "Arihant Capital Market Reports Q4 Financial Results",
            "Summary": "Arihant Capital Market announced its Q4 consolidated net profit of 77 million rupees, down from 247 million rupees year-over-year and 123 million rupees quarter-over-quarter. The company's Q4 revenue stood at 463 million rupees, a decrease from 637 million rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1746873464000,
            "Source": "result"
        },
        {
            "Title": "Arihant Capital Markets Reports Q3 Financial Results",
            "Summary": "Arihant Capital Markets has reported its Q3 consolidated net profit at 123 million rupees, down from 196 million rupees year-over-year and 199 million rupees quarter-over-quarter. The company's Q3 revenue stood at 518 million rupees, a decrease from 727 million rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1739194086000,
            "Source": "earnings"
        },
        {
            "Title": "Arihant Capital Markets Reports Q2 Revenue Growth",
            "Summary": "Arihant Capital Markets has reported a revenue of 764 million rupees for the second quarter, compared to 560 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730968003000,
            "Source": "result"
        },
        {
            "Title": "Arihant Capital Markets Reports Q2 Profit Increase",
            "Summary": "Arihant Capital Markets has reported a consolidated net profit of 199 million rupees for the second quarter, up from 147 million rupees in the same period last year. This represents a year-over-year increase in profitability for the company.",
            "Sentiment": "positive",
            "PublishDate": 1730967981000,
            "Source": "result"
        }
    ]
}