{
    "Symbol": "ARIHANTSUP",
    "ISIN": "INE643K01018",
    "News": [
        {
            "Title": "Arihant Superstructures Decides Against Stock Split",
            "Summary": "Arihant Superstructures Limited announces decision not to proceed with stock split/sub-division of equity shares after board review on February 10, 2026, following proxy advisory recommendations.",
            "Sentiment": "neutral",
            "PublishDate": 1770716579668,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arihant Superstructures Seeks Shareholder Approval for Director Appointment and Auditor Change",
            "Summary": "Arihant Superstructures has issued a postal ballot notice seeking shareholder approval for regularizing Ms. Sheetal Bhilkar's appointment as Non-Executive Independent Director, changing the registrar to KFin Technologies, and appointing KJK Associates as statutory auditors to fill the vacancy caused by Ummed Jain & Co.'s resignation. The remote e-voting period runs from November 24, 2025 to December 23, 2025, with results to be declared within two working days of voting closure.",
            "Sentiment": "neutral",
            "PublishDate": 1763722409018,
            "Source": "corporate_action"
        },
        {
            "Title": "Arihant Superstructures Reports Q2 Results with Revenue of INR 1,227 Million",
            "Summary": "Arihant Superstructures Limited reported quarterly results with operating revenue of INR 1,227 million and EBITDA of INR 299 million, representing a 24.37% EBITDA margin. The company recorded profit after tax of INR 100 million with an 8.15% PAT margin. Pre-sales reached INR 2,358 million with 280 units sold covering 289,036 square feet of area. Collections totaled INR 1,110 million during the quarter. The company acquired 5 acres of additional land at Chowk Manival for the Town Villas project and received occupancy certificate for Arihant Amisha Phase 2 covering 134 units. Environmental clearance was obtained for World Villas, Anaika and Arihant Avanti Palace projects. Heavy extended monsoons during the quarter slowed project execution, impacting earnings. The company maintains 19 ongoing projects across Mumbai Metropolitan Region and Jodhpur with gross development value of INR 125 billion.",
            "Sentiment": "neutral",
            "PublishDate": 1763014184852,
            "Source": "earnings"
        },
        {
            "Title": "Arihant Superstructures Defers Stock Split Decision Pending Advisory Report",
            "Summary": "Arihant Superstructures' Board deferred its agenda item regarding stock split/sub-division of equity shares during a meeting held on November 12, 2025. The decision was made on the recommendation of the Stakeholders Relationship Committee. Independent Directors requested additional understanding on the subject and suggested obtaining a report from Proxy Advisory Firms/Consultants before proceeding with the corporate action. The Management and Board noted this requirement for further action, resulting in the deferral of the agenda item.",
            "Sentiment": "neutral",
            "PublishDate": 1762967993981,
            "Source": "corporate_action"
        },
        {
            "Title": "Arihant Superstructures Reports Board Meeting Outcomes and Quarterly Results for September 2025",
            "Summary": "Arihant Superstructures Limited held its board meeting on November 12, 2025, approving unaudited standalone and consolidated accounts for the quarter and half-year ended September 30, 2025. The company appointed KFin Technologies Limited as new Registrar and Share Transfer Agent. M/s. Ummed Jain Co., Chartered Accountants resigned as Statutory Auditor, with M/s. KJK Associates, Chartered Accountants appointed to fill the vacancy. The board approved a postal ballot notice and reconstituted board committees. For the quarter ended September 30, 2025, standalone revenue from operations was Rs. 1,316.92 lakhs with profit after tax of Rs. 33.81 lakhs. Consolidated revenue from operations reached Rs. 12,265.14 lakhs with profit after tax of Rs. 2,955.56 lakhs. The company had previously converted 20,90,000 share warrants into equity shares on June 14, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762945050831,
            "Source": "earnings"
        },
        {
            "Title": "Arihant Superstructures Schedules Q2 FY26 Earnings Conference Call",
            "Summary": "Arihant Superstructures Limited will conduct an earnings conference call on November 13, 2025, at 2:00 p.m. IST to discuss financial results for the quarter and half year ended September 30, 2025. The management team will include Chairman and Managing Director Ashok Chhajer, Whole Time Director Parth Chhajer, and Chief Financial Officer Udit Kasera. The company has provided multiple dial-in numbers for domestic and international participants across Hong Kong, Singapore, UK, and USA. Audio recording and transcript of the call will be published on the company's website following the conference.",
            "Sentiment": "neutral",
            "PublishDate": 1762503796506,
            "Source": "earnings"
        },
        {
            "Title": "Arihant Superstructures' Statutory Auditor Ummed Jain & Co. Resigns Due to Resource Constraints",
            "Summary": "Ummed Jain & Co., Chartered Accountants has resigned as the statutory auditor of Arihant Superstructures Limited effective November 13, 2025. The auditing firm cited internal resource re-allocation and pre-occupation with other professional engagements as reasons for their inability to devote required partners and audit team for the company and its subsidiaries. The resignation becomes effective after submission of the Limited Review Report for the quarter and half year ended September 30, 2025. The firm was appointed on September 23, 2023 and was scheduled to serve until the conclusion of the Annual General Meeting for FY 2027-28. The company stated there are no concerns raised by the resigning auditor regarding management and no material reason for resignation. The Audit Committee and Board will consider appointment of new statutory auditors to fill the casual vacancy.",
            "Sentiment": "neutral",
            "PublishDate": 1762375653904,
            "Source": "corporate_governance"
        },
        {
            "Title": "Arihant Superstructures Shares Audio Recordings of Quarterly Earnings Call",
            "Summary": "Arihant Superstructures Limited has made available audio recordings of their earnings call for the quarter ended June 30, 2025. The earnings call was conducted on August 13, 2025, and the company has provided a link to access the recordings. The announcement was signed by Parth Chhajer, Whole-time Director of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1755184005823,
            "Source": "earnings"
        },
        {
            "Title": "Arihant Superstructures Reports No Deviation in Convertible Warrants Fund Utilization",
            "Summary": "Arihant Superstructures Limited confirmed that funds raised through convertible warrants issued on a preferential basis were utilized according to the stated objectives for the quarter ended June 30, 2025. The company raised Rs. 37.63 crore through the issuance, receiving 25% upfront (Rs. 9.41 crore) on December 21, 2023, and the remaining 75% (Rs. 28.23 crore) on June 14, 2025. The funds were used as outlined in the prospectus and Letter of Offer, with no deviation from the objectives stated in the Extraordinary General Meeting notice from December 5, 2023. The Audit Committee reviewed the utilization and provided no additional comments.",
            "Sentiment": "neutral",
            "PublishDate": 1755181364928,
            "Source": "corporate_action"
        },
        {
            "Title": "Arihant Superstructures Appoints New CFO, Sets AGM Date, and Reports Mixed Quarterly Results",
            "Summary": "Arihant Superstructures Limited held a board meeting on August 12, 2025, appointing Udit Kasera as Chief Financial Officer and N L Bhatia & Associates as Secretarial Auditor for five years. The company scheduled its 42nd Annual General Meeting for September 27, 2025, via video conferencing. For the quarter ended June 30, 2025, standalone revenue from operations was ₹746.00 lakhs compared to ₹1,985.52 lakhs in the same quarter last year. Standalone profit after tax was ₹6.43 lakhs versus ₹4.69 lakhs in the previous year quarter. On a consolidated basis, revenue from operations reached ₹12,096.43 lakhs compared to ₹8,368.87 lakhs in the corresponding quarter of the previous year, with consolidated profit after tax at ₹1,590.62 lakhs versus ₹199.43 lakhs. The company converted 20,90,000 share warrants into equity shares on June 14, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754995581814,
            "Source": "earnings"
        },
        {
            "Title": "Arihant Super Reports Strong Q1 Performance with 695% Jump in Net Profit",
            "Summary": "Arihant Super delivered robust Q1 results with consolidated net profit surging to 159 million rupees from 20 million rupees year-over-year. Revenue grew to 1.2 billion rupees compared to 837 million rupees in the same period last year. The company's EBITDA increased significantly to 369 million rupees from 106 million rupees year-over-year, while EBITDA margin expanded to 30.51% from 12.64% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754992924204,
            "Source": "earnings"
        },
        {
            "Title": "Arihant Superstructures CFO Dhiraj Jopat Resigns Due to Personal Reasons",
            "Summary": "Arihant Superstructures Limited announced that Mr. Dhiraj Jopat has resigned from his position as Chief Financial Officer, effective August 04, 2025. Jopat cited personal reasons for his resignation and confirmed there are no other material reasons beyond those mentioned in his resignation letter. The company has appointed Mr. Udit Kasera as the new CFO to replace Jopat. In his resignation letter, Jopat thanked the board and management for providing him the opportunity to perform during his three years with the company and its group companies.",
            "Sentiment": "neutral",
            "PublishDate": 1754387429095,
            "Source": "corporate_governance"
        },
        {
            "Title": "GST Department Conducts Search Operations at Arihant Superstructures and Subsidiary Vatika Realty",
            "Summary": "The GST Department conducted search operations at Arihant Superstructures and its subsidiary Vatika Realty. The company has assured full compliance with regulations and stated that operations will continue without interruption.",
            "Sentiment": "neutral",
            "PublishDate": 1753970715405,
            "Source": "stock"
        },
        {
            "Title": "Income Tax Raid at Arihant Superstructures and Global Group",
            "Summary": "According to ET Now, an income tax raid is currently underway at Arihant Superstructures, a listed company, and Global Group, an unlisted entity. The raid is being conducted by the Income Tax Department, suggesting a potential investigation into financial matters or tax-related issues.",
            "Sentiment": "negative",
            "PublishDate": 1741160350000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Arihant Superstructures Outlines Multi-Year Project Launch and Completion Plan",
            "Summary": "Arihant Superstructures has announced a strategic timeline for launching and selling Gross Development Value (GDV) projects over the next four to six years. The company expects to complete these projects within a five to seven-year timeframe, as disclosed during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1738726315000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arihant Superstructures Projects 20-25% Growth and Achieves Land Acquisition Target",
            "Summary": "Arihant Superstructures has announced that it expects to achieve its growth guidance of 20-25%. The company has also successfully met its target of acquiring over 300 acres of land for FY '25, as revealed in a recent concall update.",
            "Sentiment": "positive",
            "PublishDate": 1738726275000,
            "Source": "earnings"
        },
        {
            "Title": "Arihant Superstructures Reports Q3 Revenue Increase",
            "Summary": "Arihant Superstructures has announced its third-quarter revenue, which stands at 1.5 billion rupees. This represents a year-over-year increase from the previous year's third-quarter revenue of 1.19 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738575006000,
            "Source": "earnings"
        },
        {
            "Title": "Arihant Superstructures Reports Strong Q3 Financial Performance",
            "Summary": "Arihant Superstructures has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 425 million rupees, up from 260 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 28.21% from 21.80% in the previous year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738574974000,
            "Source": "earnings"
        },
        {
            "Title": "Arihant Superstructures Reports Significant Profit Increase in Q3",
            "Summary": "Arihant Superstructures has announced its consolidated net profit for the third quarter, which stands at 254 million rupees. This represents a substantial increase from the 156 million rupees reported in the same period of the previous year, indicating a year-over-year growth in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1738574933000,
            "Source": "earnings"
        },
        {
            "Title": "Arihant Superstructures Expands World Villas Project",
            "Summary": "Arihant Superstructures has acquired 11 acres of land adjacent to their World Villas project. This acquisition is expected to significantly increase the revenue potential of the project to over 12 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1735172433000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arihant Superstructures Acquires 11 Acres Adjacent to World Villas Project",
            "Summary": "Arihant Superstructures has acquired 11 acres of land adjoining their World Villas project. This acquisition is expected to significantly increase the company's revenue potential, with estimates suggesting it could exceed 12 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1735041820000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arihant Superstructures to Issue Debentures Worth 25 Crore Rupees",
            "Summary": "Arihant Superstructures has announced plans to issue debentures valued at 25 crore rupees. This decision represents a significant financial move for the company, potentially aimed at raising capital for business operations or expansion.",
            "Sentiment": "neutral",
            "PublishDate": 1732614728000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arihant Superstructures to Launch Projects Near Navi Mumbai Airport",
            "Summary": "Arihant Superstructures has announced plans to launch new projects valued at approximately 8.8 billion rupees near the upcoming Navi Mumbai International Airport, according to their investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1730091651000,
            "Source": "corporate_action"
        }
    ]
}