{
    "Symbol": "ARKADE",
    "ISIN": "INE0QRL01017",
    "News": [
        {
            "Title": "Arkade Developers Plans New ₹230 Cr Project Launch",
            "Summary": "Arkade Developers announces new project next to Jal Ratan Deep this month with estimated GDV of ₹230 crores, bringing combined GDV of both projects to ₹580 crores.",
            "Sentiment": "positive",
            "PublishDate": 1770277145381,
            "Source": "stocks"
        },
        {
            "Title": "Arkade Developers Signs ₹350 Crore Goregaon Project",
            "Summary": "Arkade Developers has entered into an agreement for a mixed-use development project in Goregaon West, Mumbai, with an expected gross development value of ₹350 crore.",
            "Sentiment": "positive",
            "PublishDate": 1770277085416,
            "Source": "stocks"
        },
        {
            "Title": "Arkade Developers Director Acquires 10,000 Shares",
            "Summary": "Whole time Director Mr. Arpit V Jain purchased 10,000 equity shares worth ₹12.24 lakh at average price of ₹122.40 per share through market purchase on NSE, increasing his shareholding to 5.531%.",
            "Sentiment": "positive",
            "PublishDate": 1770128793996,
            "Source": "stocks"
        },
        {
            "Title": "Arkade Developers Q3FY26 Results Published",
            "Summary": "Arkade Developers Limited published its unaudited financial results for Q3FY26 in newspapers as per regulatory requirements. The company also announced major corporate developments including acquisition and ESOP grants.",
            "Sentiment": "neutral",
            "PublishDate": 1769753300042,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arkade Developers Q3 FY26 Earnings Call on Jan 29",
            "Summary": "Arkade Developers Limited announces earnings conference call scheduled for January 29, 2026 at 4:00 PM IST to discuss Q3 and 9-month FY26 financial performance with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1769147805989,
            "Source": "stocks"
        },
        {
            "Title": "Arkade Developers Receives MCA Approval for New Facility Management Subsidiary",
            "Summary": "Arkade Developers has obtained Ministry of Corporate Affairs approval to establish a new subsidiary called Arkade 360 Facility Management Private Limited. The approval enables the company to expand into facility management services through this newly approved corporate entity.",
            "Sentiment": "positive",
            "PublishDate": 1764768904914,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLT Cancels Shareholder Meetings for Arkade Developers and Filmistan",
            "Summary": "The National Company Law Tribunal (NCLT) has cancelled scheduled shareholder meetings for both Arkade Developers and Filmistan regarding a scheme. The cancellation affects shareholders of both companies who were expected to vote on the proposed scheme.",
            "Sentiment": "positive",
            "PublishDate": 1764335010349,
            "Source": "corporate_action"
        },
        {
            "Title": "Arkade Developers Reports 30% Revenue Growth in Q2 FY26, Plans 6-7 Project Launches Next Year",
            "Summary": "Arkade Developers reported revenue of Rs. 265 crores in Q2 FY26, up 30% year-on-year from Rs. 203 crores. EBITDA grew 8% to Rs. 63 crores with a margin of 24%. The company achieved pre-sales of Rs. 331 crores and collections of Rs. 320 crores during the quarter. Arkade completed the acquisition of Woolen and Textile Industries Limited in Bhandup West for Rs. 148 crores, adding a land parcel with potential GDV of Rs. 1,000 crores. The company secured naming rights for Arkade Bangur Nagar Metro Station and sold out four ready-to-move projects. Management announced plans to launch 6-7 projects in FY27 with combined potential sales of over Rs. 8,000 crores, including three launches in the first half. Two ongoing projects are scheduled for completion this fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1761296923987,
            "Source": "earnings"
        },
        {
            "Title": "Arkade Developers Reports Strong Q2 Performance, Approves Facility Management Subsidiary Formation",
            "Summary": "Arkade Developers Limited's Board approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company reported revenue from operations of Rs 26,154.33 lakhs for the quarter, with profit of Rs 4,466.58 lakhs. For the six-month period, revenue reached Rs 42,098.91 lakhs with profit of Rs 7,342.11 lakhs. The Board also approved incorporation of a wholly owned subsidiary for facility management services. During the quarter, the company acquired 100% shares in Filmistan Private Limited for Rs 170 crores, making it a wholly owned subsidiary. The Board approved a demerger scheme for Filmistan's rental business and tenancy rights into Arkade Developers, filed with NCLT on October 9, 2025. The company's IPO proceeds utilization shows Rs 33,164.90 lakhs utilized out of Rs 38,106.50 lakhs raised, with remaining funds temporarily invested in fixed deposits.",
            "Sentiment": "positive",
            "PublishDate": 1760604868204,
            "Source": "earnings"
        },
        {
            "Title": "Arkade Developers Reports 55% Jump in Quarterly Net Profit to 449M Rupees",
            "Summary": "Arkade Developers posted a net profit of 449 million rupees in its quarterly results, representing a significant increase from 290 million rupees in the same period last year. The real estate developer's profit grew by 159 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1760604493311,
            "Source": "earnings"
        },
        {
            "Title": "Arkade Developers Approves Plan to Separate Rental Business from Filmistan Private Limited",
            "Summary": "Arkade Developers Ltd has approved a plan to separate the rental business from Filmistan Private Limited. The company is awaiting regulatory approvals, including approval from the National Company Law Tribunal (NCLT).",
            "Sentiment": "neutral",
            "PublishDate": 1759132501378,
            "Source": "corporate_action"
        },
        {
            "Title": "Arkade Developers Converts Inter-Company Loans to Equity in Subsidiary Filmistan Private Limited",
            "Summary": "Arkade Developers Limited's Board approved converting pre-existing inter-company loans worth Rs. 12.61 crores into 7,415 equity shares of its wholly owned subsidiary Filmistan Private Limited. The conversion involves shares with face value of Re. 1 each at a premium of Rs. 16,999 per share, representing 7.41% shareholding. This restructuring of existing financial exposure requires no fresh capital infusion and will be completed within one month. Filmistan Private Limited operates in real estate leasing and cinematographic film business, with a net worth of negative Rs. 12.03 crores and turnover of Rs. 14.95 lakhs as of March 2025. The transaction is exempt from related party transaction provisions under listing regulations as it involves a wholly owned subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1758807617876,
            "Source": "corporate_action"
        },
        {
            "Title": "Arkade Developers Reports Strong Growth in First Year as Listed Company with ₹12,000-Cr Pipeline",
            "Summary": "Arkade Developers completed one year as a listed company on NSE and BSE, reporting revenue growth of 9% to ₹695 crore and net profit increase of 27.6% to ₹157 crore. The company achieved record pre-sales of ₹773 crore, up 20% year-on-year, and collections grew 22% to ₹716 crore. The company went public in September 2024 with an IPO oversubscribed 107 times and listed at 37% premium. Arkade launched three new residential projects and delivered four completed projects, bringing its total completed portfolio to 31 projects covering 5.5 million sq. ft. The company declared its first interim dividend of 10%, with promoters forgoing their entitlement. Arkade entered India's top 1,000 companies by market capitalization within four months of listing. The company plans to launch over 10 new projects across Mumbai and Thane, including acquisitions of Filmistan Studios property worth ₹3,200 crore GDV and Thane land parcel worth ₹2,000 crore GDV, creating a total development pipeline of ₹12,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1758708308404,
            "Source": "stock"
        },
        {
            "Title": "Arkade Developers Acquires Woollen And Textile Industries Ltd for ₹148 Crore",
            "Summary": "Arkade Developers has signed an agreement to acquire 100% stake in Woollen And Textile Industries Ltd for ₹148 crore. The acquisition includes 14,363.60 square meters of land located in Bhandup West. This transaction represents a complete takeover of the textile company by the real estate developer.",
            "Sentiment": "positive",
            "PublishDate": 1756887994276,
            "Source": "order&deals"
        },
        {
            "Title": "Fractional Real Estate Offers 7-8% Net Yields with Lower Entry Barriers, Says Arkade Developers CMD",
            "Summary": "Fractional ownership is emerging as a significant development in India's real estate market, allowing retail investors to access premium commercial assets previously available only to institutions and ultra-high net worth individuals. Amit Jain, CMD of Arkade Developers, states that fractional real estate delivers consistent net yields of 7-8% while reducing entry barriers. The model provides professional management, reducing operational complexities for investors. With interest rates stabilizing and inflation cooling, fractional real estate is positioned as an alternative to fixed income investments, offering steady rental yields combined with potential capital appreciation. Unlike direct ownership, fractional platforms handle leasing management and maintenance, enabling investors to earn yields without operational involvement. While office assets remain the most attractive segment due to predictable yields, fractional ownership could expand into residential and holiday homes over the next 3-5 years, particularly appealing to younger investors seeking both utility and returns.",
            "Sentiment": "positive",
            "PublishDate": 1756093477057,
            "Source": "stock"
        },
        {
            "Title": "Arkade Developers Promoter Amit Jain Acquires Additional 100,000 Equity Shares",
            "Summary": "Arkade Developers Limited disclosed that promoter and Managing Director Amit Mangilal Jain acquired 100,000 equity shares representing 0.05% of the company's total paid-up capital. The shares were purchased through market acquisition on the National Stock Exchange at an average price of Rs. 179.77 per share, with a total transaction value of Rs. 17,97,700. Following this acquisition, Jain's shareholding increased from 66.60% to 66.65% of the company's equity. The transaction was completed and disclosed on August 6, 2025, in compliance with SEBI insider trading regulations.",
            "Sentiment": "positive",
            "PublishDate": 1754474217730,
            "Source": "corporate_action"
        },
        {
            "Title": "Arkade Developers Reports 32% Revenue Growth, Declares Maiden Interim Dividend",
            "Summary": "Arkade Developers Limited reported revenue of Rs. 165 crores for Q1 FY26, marking a 32% year-on-year growth from Rs. 126 crores in the previous year. The company achieved its highest-ever pre-sales of Rs. 142 crores, up 17% year-on-year, with collections reaching Rs. 170 crores, reflecting a 42% increase. EBITDA stood at Rs. 34 crores with a 22% margin, while profit after tax was Rs. 29 crores with a 17% margin. The Board declared a maiden interim dividend of 10%, with promoters forgoing their dividends to enhance shareholder value. The company acquired significant projects including a four-acre Filmistan property in Goregaon West with projected GDP of Rs. 3,200 crores and land parcels in Thane targeting Rs. 2,000 crores GDP. Management expects major revenue acceleration from FY27 when the Filmistan and Thane projects become operational. EBITDA margins declined due to increased competition in redevelopment projects and plateaued property price appreciation, though management expects margins to improve through the year.",
            "Sentiment": "positive",
            "PublishDate": 1753968464393,
            "Source": "earnings"
        },
        {
            "Title": "Arkade Developers Plans ₹11,145 Crore Project Pipeline with Debt-Free Growth Strategy",
            "Summary": "Arkade Developers has announced plans for a ₹11,145 crore project pipeline as part of its multi-year expansion strategy. The company is focusing on debt-free growth and targeting the upscale segment for its development projects.",
            "Sentiment": "positive",
            "PublishDate": 1753450358339,
            "Source": "stock"
        },
        {
            "Title": "Arkade Developers Reports 17.1% Growth in Pre-Sales and 41.8% Jump in Collections for Q1 FY26",
            "Summary": "Arkade Developers Limited released its investor presentation for quarterly results ended June 30, 2025. The company reported pre-sales of ₹142 crores, marking a 17.1% year-on-year increase from ₹121 crores. Collections grew significantly by 41.8% to ₹170 crores compared to ₹120 crores in the same quarter last year. The company sold 48,000 sq.ft. of carpet area during the quarter, up 26.5% from 38,000 sq.ft. in Q1 FY25. Revenue reached ₹165 crores with net profit at ₹34 crores and EBITDA at ₹29 crores. The company announced a maiden interim dividend for shareholders. Arkade expanded its portfolio by acquiring three new projects: Filmistan in Goregaon with projected GDV of ₹3,216 crores, a Thane project worth ₹2,000 crores, and Jal Ratna in Goregaon valued at ₹350 crores. The company has 31 successfully delivered projects and currently maintains ongoing projects with projected turnover of ₹3,312 crores. Chairman and Managing Director Amit Mangilal Jain attributed the performance to execution excellence and strong demand in the luxury housing segment.",
            "Sentiment": "positive",
            "PublishDate": 1753439818420,
            "Source": "earnings"
        },
        {
            "Title": "Arkade Developers Reports Q1 FY2026 Results, Declares Re. 1 Interim Dividend",
            "Summary": "Arkade Developers Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs. 15,944.58 lakhs and profit after tax of Rs. 2,875.53 lakhs. Basic earnings per share stood at Rs. 1.55. The Board declared an interim dividend of Re. 1 per equity share with August 1, 2025 as the record date and payment by August 12, 2025. Promoter Amit Mangilal Jain and Executive Directors Arpit Vikram Jain and Sandeep Ummedmal Jain are forgoing their dividend rights to enhance shareholder value. The company operates solely in real estate development and has utilized Rs. 30,394.98 lakhs of its IPO proceeds of Rs. 38,106.50 lakhs, with Rs. 7,711.52 lakhs remaining unutilized as of June 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753437156791,
            "Source": "corporate_action"
        },
        {
            "Title": "Arkade Developers Reports Mixed Q1 Results with Revenue Growth but Profit Decline",
            "Summary": "Arkade Developers reported Q1 net profit of 288 million rupees, down from 302 million rupees in the same period last year. Revenue increased to 1.6 billion rupees compared to 1.25 billion rupees year-over-year. EBITDA declined to 342 million rupees from 420 million rupees, while EBITDA margin compressed to 21.48% from 33.48% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1753436697058,
            "Source": "earnings"
        },
        {
            "Title": "Arkade Developers Schedules Q1 FY26 Earnings Call for July 25, 2025",
            "Summary": "Arkade Developers Limited will host an earnings conference call on July 25, 2025, at 4:00 PM IST to discuss the company's operational and financial performance for Q1 FY26 (quarter ended June 30, 2025). The call will include participation from Chairman & Managing Director Amit Jain and Chief Financial Officer Samshet Shetye. The company will provide dial-in access numbers for various regions including India, USA, UK, Singapore, and Hong Kong. An audio recording and transcript of the earnings call will be made available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1753183956437,
            "Source": "earnings"
        },
        {
            "Title": "Arkade Developers Schedules Board Meeting for July 25, 2025 to Approve Q1 Results and Consider Interim Dividend",
            "Summary": "Arkade Developers Limited has scheduled a Board of Directors meeting for July 25, 2025 to consider and approve unaudited financial results for the quarter ended June 30, 2025. The board will also consider declaring the first interim dividend for financial year 2025-2026. The company's trading window has been closed from July 1, 2025 and will remain closed until 48 hours after the financial results are announced to stock exchanges. Arkade Developers trades on BSE with scrip code 544261 and on NSE with symbol ARKADE.",
            "Sentiment": "neutral",
            "PublishDate": 1753158349420,
            "Source": "corporate_action"
        },
        {
            "Title": "Arkade Developers: Acquiring Filmistan for ₹183 Crore",
            "Summary": "Arkade Developers Ltd. is set to acquire the entire stake in Filmistan Pvt Ltd. for ₹182.95 crore, making it a wholly-owned subsidiary. The acquisition, aimed at facilitating real estate sector expansion, is expected to complete within a month without regulatory approvals. Arkade Developers' Q4 net profit increased 70% to ₹33.3 crore, with revenue up 7% to ₹131.4 crore.",
            "Sentiment": "positive",
            "PublishDate": 1751523271000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arkade Developers Acquires Filmistan Pvt Ltd for ₹182.95 Crore",
            "Summary": "Arkade Developers has purchased the entire stake in Filmistan Pvt Ltd for ₹182.95 crore. This acquisition is aimed at enhancing the company's real estate growth prospects.",
            "Sentiment": "positive",
            "PublishDate": 1751519833000,
            "Source": "default"
        },
        {
            "Title": "Arkade Developers Acquires 1.1-Acre Redevelopment Project in Goregaon",
            "Summary": "Arkade Developers has acquired a 1.1-acre redevelopment project in Goregaon. The project has a potential revenue of Rs 350 crore.",
            "Sentiment": "positive",
            "PublishDate": 1750928119000,
            "Source": "default"
        },
        {
            "Title": "Arkade Developers: Targets 20% Growth in FY26 with Four New Project Launches",
            "Summary": "Arkade Developers aims for 20% top-line and bottom-line growth in FY26, driven by four new project launches including Filmistan and three redevelopment projects. The company expects a top line of Rs 3,500-4,000 crore from these launches. Additionally, Arkade acquired a 6.28-acre land parcel in Thane for Rs 172.5 crore, planning a Rs 2,000 crore GDV project to be launched in early 2026.",
            "Sentiment": "positive",
            "PublishDate": 1750133474000,
            "Source": "normal_news"
        },
        {
            "Title": "Arkade Developers Enters Thane with 6.28-acre Project",
            "Summary": "Arkade Developers has announced its strategic entry into Thane with a 6.28-acre project. The company is targeting a Gross Development Value (GDV) of ₹2,000 crore for this project. This marks Arkade's expansion into a new market area.",
            "Sentiment": "positive",
            "PublishDate": 1750031805000,
            "Source": "default"
        },
        {
            "Title": "Arkade Developers Launches 6.28-Acre Project in Thane",
            "Summary": "Arkade Developers has announced the launch of a strategic 6.28-acre project in Thane. The company aims to achieve a Gross Development Value (GDV) of ₹2,000 crore from this project. The development is located in Thane, a city near Mumbai, and represents a significant expansion for the company.",
            "Sentiment": "positive",
            "PublishDate": 1749816346000,
            "Source": "default"
        },
        {
            "Title": "Arkade Developers Targets Rs 4000 Crore Revenue from New Projects",
            "Summary": "Arkade Developers plans to launch four new projects with the aim of achieving a topline of Rs 4000 crore in FY26. The company is focusing on expanding its business and increasing revenue through these new developments.",
            "Sentiment": "positive",
            "PublishDate": 1747980869000,
            "Source": "default"
        },
        {
            "Title": "Arkade Developers: Q4 Profit Soars 70% to Rs 33.26 Crore",
            "Summary": "Arkade Developers reported a 70% increase in Q4 consolidated net profit to Rs 33.26 crore. Total income rose to Rs 134.34 crore. For FY 2024-25, net profit grew to Rs 156.92 crore with total income of Rs 694.60 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747141499000,
            "Source": "earnings"
        },
        {
            "Title": "Arkade Developers Reports Q4 Financial Results",
            "Summary": "Arkade Developers announced its Q4 financial results. The company's revenue increased to 1.3 billion rupees from 1.23 billion rupees year-over-year. EBITDA rose significantly to 445 million rupees from 270 million rupees in the same period last year. The EBITDA margin improved to 33.82% from 22% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747125585000,
            "Source": "result"
        },
        {
            "Title": "Arkade Developers Reports Q4 Net Profit Increase",
            "Summary": "Arkade Developers has reported a net profit of 333 million rupees for the fourth quarter, compared to 196 million rupees in the same period last year, representing a significant year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1747125457000,
            "Source": "result"
        },
        {
            "Title": "Arkade Developers: Pre-Sales Surge 20% to ₹773 Crore in FY25",
            "Summary": "Arkade Developers reported a 19.8% increase in pre-sales to ₹773 crore for FY25. Collections rose 21.8% to ₹716 crore. Total area sold increased by 22.7% to 2.49 lakh square feet. The company acquired a 15.5-acre land parcel in Mumbai's western suburbs with a projected GDV of ₹8,590 crore.",
            "Sentiment": "positive",
            "PublishDate": 1745307971000,
            "Source": "earnings"
        },
        {
            "Title": "Arkade Developers Reports Strong Pre-Sales Growth in FY24-25",
            "Summary": "Arkade Developers has experienced significant growth, reporting pre-sales of Rs 773 crores for the fiscal year 2024-2025. This robust performance indicates a positive trend in the company's real estate operations and market demand for their properties.",
            "Sentiment": "positive",
            "PublishDate": 1745299957000,
            "Source": "default"
        },
        {
            "Title": "Arkade Developers: Secures ₹865 Crore Borivali Redevelopment Deal",
            "Summary": "Arkade Developers Ltd has secured cluster redevelopment rights in Borivali, Mumbai, with an estimated gross development value of ₹865 crore. The project covers 7,084 square metres and is expected to yield 2.44 lakh square feet of saleable carpet area.",
            "Sentiment": "positive",
            "PublishDate": 1744101198000,
            "Source": "order&deals"
        },
        {
            "Title": "Arkade Developers Registers Agreement for Borivali West Redevelopment Project",
            "Summary": "Arkade Developers has registered a development agreement for a cluster redevelopment project in Borivali West. The project has an estimated Gross Development Value (GDV) of Rs 865 crores.",
            "Sentiment": "positive",
            "PublishDate": 1744091253000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arkade Developers: Plans Four New Projects, Targets Rs 12,000-Crore Pipeline",
            "Summary": "Arkade Developers plans to launch four projects in FY26, including three redevelopment projects in Mumbai and one land project in Goregaon West. The company aims to expand its total development pipeline to Rs 12,000 crore, with a target to complete within five years. They expect a 20% profit after tax on the total pipeline, amounting to approximately Rs 2,400 crore. The company is focusing on securing all necessary approvals before project commencement to avoid delays.",
            "Sentiment": "positive",
            "PublishDate": 1743226200000,
            "Source": "normal_news"
        },
        {
            "Title": "Arkade Developers Promoter Acquires 100,000 Additional Shares",
            "Summary": "A promoter of Arkade Developers has acquired an additional 100,000 shares of the company through open market transactions. This increase in shareholding by a promoter could potentially signal confidence in the company's future prospects.",
            "Sentiment": "positive",
            "PublishDate": 1741667455000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arkade Developers Registers Development Agreement for Malad West Project",
            "Summary": "Arkade Developers has registered a development agreement for a new project in Malad West, Mumbai. The project has an estimated gross development value of approximately 740 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1739944660000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arkade Developers Secures Major Redevelopment Project in Dahisar",
            "Summary": "Arkade Developers has secured a redevelopment project spanning 6.5 acres in Dahisar. The project has an estimated Gross Development Value (GDV) of approximately 1700 crore rupees. The company's current market capitalization stands at 29 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1739340064000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arkade Developers Acquires Land in Goregaon West for ₹165 Crore",
            "Summary": "Arkade Developers has acquired a 4-acre land parcel in Goregaon West, Mumbai, for ₹165 crore. The company projects a potential revenue of ₹2,000 crore from this acquisition, indicating significant development plans for the property.",
            "Sentiment": "positive",
            "PublishDate": 1738057581000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arkade Developers Reports Q3 Revenue Decline",
            "Summary": "Arkade Developers has reported a decrease in revenue for the third quarter. The company's Q3 revenue stood at 2.2 billion rupees, down from 2.4 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1737704547000,
            "Source": "earnings"
        },
        {
            "Title": "Arkade Developers Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Arkade Developers has reported a decrease in its third-quarter EBITDA, which fell to 610 million rupees from 660 million rupees year-over-year. The company's EBITDA margin also declined slightly to 27.14% from 27.58% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1737704537000,
            "Source": "earnings"
        },
        {
            "Title": "Arkade Developers Reports Increased Q3 Net Profit",
            "Summary": "Arkade Developers has announced its financial results for the third quarter, reporting a net profit of 501 million rupees. This represents a year-over-year increase from the previous year's Q3 net profit of 489 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1737704463000,
            "Source": "earnings"
        },
        {
            "Title": "Arkade Developers Expands with Three Redevelopment Projects in Western Mumbai",
            "Summary": "Arkade Developers has announced the addition of three redevelopment projects in Western Mumbai to its portfolio. The company anticipates these projects to generate a turnover of approximately 2,150 crore rupees. This expansion signifies Arkade Developers' strategic growth in the Mumbai real estate market, focusing on redevelopment opportunities in prime locations.",
            "Sentiment": "positive",
            "PublishDate": 1736149740000,
            "Source": "corporate_action"
        },
        {
            "Title": "ARKADE DEVELOPERS Reports Q2 Financial Results",
            "Summary": "ARKADE DEVELOPERS has reported its Q2 financial results. The company's EBITDA for Q2 is 587 million rupees, compared to 650 million rupees in the same quarter last year, showing a year-over-year decrease. The EBITDA margin for Q2 is 29.11%, down from 30.83% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1731502233000,
            "Source": "result"
        },
        {
            "Title": "Arkade Developers Reports Q2 Financial Results",
            "Summary": "Arkade Developers announced its Q2 financial results. The company reported a net profit of 434 million rupees, down from 479 million rupees year-over-year and up from 302 million rupees quarter-over-quarter. Revenue for Q2 was 2.02 billion rupees, slightly lower than the 2.1 billion rupees reported in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731502147000,
            "Source": "result"
        },
        {
            "Title": "Arkade Developers: Rs 570 Crore Investment in Mumbai Luxury Project",
            "Summary": "Arkade Developers Ltd. announces a Rs 570 crore investment in 'Arkade Rare', a luxury real estate project in Bhandup West, Mumbai. The project will develop 432 residential and 43 commercial units over 3 acres, with an estimated sales value of Rs 760 crore.",
            "Sentiment": "positive",
            "PublishDate": 1729598376000,
            "Source": "normal_news"
        },
        {
            "Title": "Arkade Developers to Launch Major Project in Bhandup",
            "Summary": "Arkade Developers has announced plans to launch a new residential and commercial project in Bhandup, Maharashtra. The project is estimated to have a revenue potential of 7.6 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1729511747000,
            "Source": "corporate_action"
        }
    ]
}