{
    "Symbol": "ARMANFIN",
    "ISIN": "INE109C01017",
    "News": [
        {
            "Title": "Arman Financial Services Board Meet on Feb 12",
            "Summary": "Arman Financial Services Limited has scheduled its board meeting for February 12, 2026, to consider Q3FY26 unaudited financial results and potential fundraising through NCDs.",
            "Sentiment": "neutral",
            "PublishDate": 1770460877110,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arman Financial Services Allots ₹125 Cr NCDs",
            "Summary": "Arman Financial Services Limited has allotted 125,000 non-convertible debentures worth ₹125 crores through private placement with 11.35% annual coupon rate and 30-month tenure.",
            "Sentiment": "positive",
            "PublishDate": 1769673379649,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arman Financial Services Transfers 7500 Shares to IEPF",
            "Summary": "Arman Financial Services Limited has transferred 7500 equity shares of face value ₹10 each to the Investor Education and Protection Fund under Section 124(6) of the Companies Act, 2013.",
            "Sentiment": "neutral",
            "PublishDate": 1769520927194,
            "Source": "stocks"
        },
        {
            "Title": "Arman Financial Services Completes Debenture Redemption",
            "Summary": "Arman Financial Services Limited successfully completed full redemption of ₹49.80 crore debentures with quarterly interest payment of ₹1.28 crore, executing both transactions ahead of the January 25, 2026 due date.",
            "Sentiment": "positive",
            "PublishDate": 1769163244822,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arman Financial Services Raises ₹1,250 Crores via NCDs",
            "Summary": "Arman Financial Services approves issuance of 125,000 non-convertible debentures worth ₹1,250 crores through private placement. The NCDs offer 11.35% annual interest with 30-month tenure.",
            "Sentiment": "positive",
            "PublishDate": 1768819721462,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arman Financial Services Plans ₹125 Cr NCD Issue",
            "Summary": "Arman Financial Services announces plans to raise ₹125 crores through non-convertible debentures to strengthen its capital base and support business expansion.",
            "Sentiment": "positive",
            "PublishDate": 1768819621941,
            "Source": "stocks"
        },
        {
            "Title": "Arman Financial Services Plans NCD Issue on Jan 19",
            "Summary": "Arman Financial Services announces plans to raise funds through the issuance of listed Non-Convertible Debentures (NCDs) scheduled for January 19, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768309405769,
            "Source": "stocks"
        },
        {
            "Title": "Arman Financial Gets Credit Rating Reaffirmed at A",
            "Summary": "Acuité Ratings reaffirmed Arman Financial Services' credit rating at 'Acuité A' for bank loans and NCDs, but revised outlook from 'Stable' to 'Negative' citing profitability concerns and rising credit costs.",
            "Sentiment": "neutral",
            "PublishDate": 1768030924575,
            "Source": "stocks"
        },
        {
            "Title": "Arman Financial Services Pays ₹2.47 Cr Debenture Interest",
            "Summary": "Arman Financial Services Limited successfully paid ₹2.47 crores in debenture interest to holders on January 09, 2026, one day ahead of the scheduled due date of January 10, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767953174325,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arman Financial Services pays ₹32.98L debenture interest",
            "Summary": "Arman Financial Services Limited successfully paid ₹32.98 lakh interest to debenture holders on the due date of January 5, 2026, maintaining compliance with SEBI regulations for its ₹40 crore debenture issue.",
            "Sentiment": "positive",
            "PublishDate": 1767599959628,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arman Financial Gets Credit Rating Reaffirmed",
            "Summary": "CARE Ratings reaffirmed CARE A- rating for Arman Financial's subsidiary Namra Finance's NCDs but maintained negative outlook on December 24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766561245954,
            "Source": "stocks"
        },
        {
            "Title": "Arman Financial Services Completes ₹3.33 Crore Debenture Redemption",
            "Summary": "Arman Financial Services Limited redeemed 8.33% of its Non-Convertible Debentures (ISIN: INE109C07105) amounting to ₹3,33,32,000 on December 5, 2025, as part of scheduled repayment obligations. The redemption leaves an outstanding debenture amount of ₹33,33,36,000, with the company fulfilling its debt servicing commitments to debenture holders.",
            "Sentiment": "neutral",
            "PublishDate": 1764920671803,
            "Source": "corporate_action"
        },
        {
            "Title": "Arman Financial Services Allots ₹75 Crore Non-Convertible Debentures",
            "Summary": "Arman Financial Services Limited has allotted 75,000 listed, rated, senior, secured non-convertible debentures worth ₹75 crore including a green shoe option of 25,000 debentures on a private placement basis. The debentures carry quarterly interest payments starting March 2026 and will mature on December 5, 2027, with ACUITE A- Stable rating from Acuite Ratings Research Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1764834277479,
            "Source": "corporate_action"
        },
        {
            "Title": "Arman Financial Services Approves ₹75 Crore Non-Convertible Debentures Issue",
            "Summary": "Arman Financial Services' Finance Investment Committee approved issuance of 75,000 non-convertible debentures worth ₹75 crores with a green shoe option of ₹25 crores, offering 11.35% annual interest payable quarterly. The debentures have a face value of ₹10,000 each with tentative maturity after 24 months and will be listed on BSE's Wholesale Debt segment, pending receipt of credit rating letter.",
            "Sentiment": "positive",
            "PublishDate": 1764149505671,
            "Source": "corporate_action"
        },
        {
            "Title": "Arman Financial Services Considers Non-Convertible Debenture Issuance",
            "Summary": "Arman Financial Services is evaluating the possibility of issuing non-convertible debentures as a funding option. This potential debt instrument issuance could provide the company with additional capital for its business operations and growth initiatives.",
            "Sentiment": "neutral",
            "PublishDate": 1763723009737,
            "Source": "stock"
        },
        {
            "Title": "Arman Financial Services Reports Q2FY26 Recovery with Profit Return and Improved Asset Quality",
            "Summary": "Arman Financial Services returned to profitability with INR 8 crores profit in Q2FY26 after INR 14.6 crores loss in Q1, driven by improved collection efficiency at 95.6% and declining impairment costs for three consecutive quarters from INR 89 crores in Q4FY25 to INR 38 crores in Q2FY26. The company's consolidated AUM stood at INR 2,130 crores with GNPA improving to 3.69% and NNPA at 0.53%, while disbursements grew 26% year-on-year to INR 475 crores in Q2FY26, signaling stabilization in the microfinance sector after prolonged credit stress.",
            "Sentiment": "positive",
            "PublishDate": 1763644561522,
            "Source": "earnings"
        },
        {
            "Title": "Elevation Capital V Limited Reduces Stake in Arman Financial Services to 10.35%",
            "Summary": "Elevation Capital V Limited sold 231,430 shares (2.20% stake) in Arman Financial Services Limited through open market transactions on November 14, 2025. The sale reduced Elevation Capital's holding from 12.55% to 10.35% in the financial services company listed on NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1763383897134,
            "Source": "corporate_action"
        },
        {
            "Title": "Arman Financial Reports Decline in H1 FY26 Performance with AUM at INR 2,130 Crore",
            "Summary": "Arman Financial Services reported consolidated AUM of INR 2,130 crore in Q2 FY26, down 13.6% year-on-year, with profit after tax declining to INR 7 crore in H1 FY26 from INR 47 crore in H1 FY25. The company faces challenges in microfinance collections due to industry-wide issues of staff attrition and over-leveraging at borrower level, while maintaining strong capital adequacy ratios of 38.73% for standalone operations.",
            "Sentiment": "positive",
            "PublishDate": 1763103448835,
            "Source": "earnings"
        },
        {
            "Title": "Arman Financial Services Files Regulatory Compliance Reports for Non-Convertible Debentures",
            "Summary": "Arman Financial Services Limited submitted security cover certificates and fund utilization declarations to BSE for its outstanding non-convertible debentures worth Rs. 128.47 crores as of September 30, 2025. The company confirmed full security coverage through exclusive charge on book debts and declared no material deviations in the use of proceeds from the stated objectives in offer documents.",
            "Sentiment": "neutral",
            "PublishDate": 1763065177483,
            "Source": "corporate_action"
        },
        {
            "Title": "Arman Financial Services Reports Decline in Q2 Consolidated Results",
            "Summary": "Arman Financial Services reported Q2 consolidated net profit of 80 million rupees compared to 153 million rupees year-over-year, representing a significant decline. The company's Q2 revenue also decreased to 1.59 billion rupees from 1.8 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1763044142112,
            "Source": "earnings"
        },
        {
            "Title": "Arman Financial Services Completes Quarterly Interest Payment to Debenture Holders",
            "Summary": "Arman Financial Services Limited paid ₹1.28 crore in quarterly interest to its debenture holders on October 24, 2025, one day ahead of the October 25 due date. The payment was made for debentures with ISIN INE109C07097, which has a total issue size of ₹49.8 crore. The interest payment record date was October 17, 2025, and the previous interest payment was made on July 25, 2025. The company reported no delays or issues with the payment process.",
            "Sentiment": "positive",
            "PublishDate": 1761286590585,
            "Source": "corporate_action"
        },
        {
            "Title": "Arman Financial Services Reports Q1 Net Loss of 146M Rupees, Revenue Drops to 1.5B Rupees",
            "Summary": "Arman Financial Services reported a net loss of 146 million rupees in Q1, compared to a profit of 313 million rupees in the same period last year. The company's revenue declined to 1.5 billion rupees from 1.84 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1755093062779,
            "Source": "earnings"
        },
        {
            "Title": "Arman Financial Services Schedules Conference Call to Discuss Q1 FY26 Results",
            "Summary": "Arman Financial Services Limited has scheduled a conference call on August 14, 2025, at 4:00 PM IST to discuss the company's unaudited financial results for the quarter ended June 30, 2025. The call will feature senior management including Vice Chairman and Managing Director Jayendra Patel, Joint Managing Director Aalok Patel, and Group Chief Financial Officer Vivek Modi. PhillipCapital (India) Private Limited is organizing the earnings call, which will be recorded and accessible through dial-in numbers and toll-free options for international participants. The company trades on NSE and BSE under the symbol ARMANFIN.",
            "Sentiment": "neutral",
            "PublishDate": 1754569290598,
            "Source": "earnings"
        },
        {
            "Title": "Arman Financial Services to Evaluate Non-Convertible Debenture Issuance",
            "Summary": "Arman Financial Services has announced plans to evaluate the issuance of Non-Convertible Debentures on June 14. The company will assess the potential for this financial instrument, which could be used for raising capital or debt restructuring.",
            "Sentiment": "neutral",
            "PublishDate": 1749654532000,
            "Source": "default"
        },
        {
            "Title": "Arman Financial Services Reports Q4 Results",
            "Summary": "Arman Financial Services has reported its latest quarterly results. The consolidated net profit for Q4 was 128 million rupees, compared to 508 million rupees in the same quarter last year. Revenue for Q4 was 1.99 billion rupees, up from 1.83 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748508469000,
            "Source": "result"
        },
        {
            "Title": "Namra Finance Approves Sale of Stressed Loan Portfolio",
            "Summary": "Namra Finance, a subsidiary of Arman Financial Services, has approved the sale of a stressed loan portfolio valued at 1.86 billion rupees. The sale will be executed for 367.5 million rupees, indicating a significant write-down on the stressed assets.",
            "Sentiment": "neutral",
            "PublishDate": 1743466415000,
            "Source": "corporate_action"
        },
        {
            "Title": "Namra Finance Approves Sale of Stressed Loan Portfolio",
            "Summary": "Arman Financial Services announced that its subsidiary, Namra Finance, has approved the sale of a stressed loan portfolio worth 1.86 billion rupees. The sale of this portfolio will be executed for 367.5 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1743167450000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arman Financial Services Subsidiary Approves Sale of NPA and Written Off Loans",
            "Summary": "Arman Financial Services has announced that its subsidiary has approved the sale of non-performing assets (NPA) and written off loans. The company also reported that its unsecured microfinance institution (MFI) portfolio has a principal outstanding of 1.87 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1742775352000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arman Financial Services' Subsidiary Approves Sale of NPA and Written-Off Loans",
            "Summary": "A subsidiary of Arman Financial Services has approved the sale of non-performing assets (NPA) and written-off loans. The company's unsecured microfinance institution (MFI) portfolio has a principal outstanding of 1.87 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1742562580000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arman Financial Services Reports Q3 Net Loss of 73 Million Rupees",
            "Summary": "Arman Financial Services has reported a consolidated net loss of 73 million rupees for the third quarter, compared to a loss of 420 million rupees in the same period last year and 153 million rupees in the previous quarter. The company's revenue for Q3 stood at 1.48 billion rupees, down from 1.7 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1739751517000,
            "Source": "earnings"
        },
        {
            "Title": "Arman Financial Services Reports Q3 Net Loss and Revenue Decline",
            "Summary": "Arman Financial Services has reported a consolidated net loss of 73 million rupees for the third quarter, compared to a loss of 420 million rupees in the same quarter last year. This represents a significant improvement year-over-year. However, compared to the previous quarter, the loss has increased from 153 million rupees. The company's revenue for Q3 stood at 1.48 billion rupees, down from 1.7 billion rupees in the same period last year, indicating a decline in top-line performance.",
            "Sentiment": "negative",
            "PublishDate": 1739537555000,
            "Source": "earnings"
        },
        {
            "Title": "Arohan Financial Services: RBI Lifts Lending Restrictions",
            "Summary": "The Reserve Bank of India has removed lending restrictions on Arohan Financial Services Ltd. with immediate effect. The decision came after the RBI was satisfied with the company's submissions and improved processes to ensure regulatory compliance.",
            "Sentiment": "positive",
            "PublishDate": 1735910016000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Arman Financial Services Reports Q2 FY2024 Financial Results",
            "Summary": "Arman Financial Services announced its Q2 financial results. The company reported a consolidated net profit of 153 million rupees, which is lower compared to 408 million rupees in the same quarter last year (YoY) and 313 million rupees in the previous quarter (QoQ). However, the company's revenue increased to 1.8 billion rupees from 1.6 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731508717000,
            "Source": "result"
        }
    ]
}