{
    "Symbol": "AROGRANITE",
    "ISIN": "INE210C01013",
    "News": [
        {
            "Title": "Aro Granite Posts Q3 Loss, Appoints New Director",
            "Summary": "Aro Granite Industries reported a net loss of Rs. 297.43 lacs for Q3 FY26 compared to Rs. 0.44 lacs loss in Q3 FY25. The company also appointed Varathan Arul as Independent Director.",
            "Sentiment": "negative",
            "PublishDate": 1770193389034,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aro Granite Board Meet Set for Feb 4 for Q3FY26 Results",
            "Summary": "Aro Granite Industries has scheduled its board meeting for February 4, 2026, to approve audited financial results for Q3FY26. Trading window remains closed until February 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769507317484,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aro Granite Industries Reports Loss in Q2 FY2025, Independent Director Resigns",
            "Summary": "Aro Granite Industries Limited reported a net loss of Rs 9.7 lacs for the quarter ended September 30, 2025, compared to a loss of Rs 5.58 lacs in the previous quarter. Total income decreased to Rs 2,082 lacs from Rs 2,747 lacs in the prior quarter. The company operates in two segments: manufacturing of granite tiles and slabs, and manufacturing of quartz slabs. Additionally, Mr. G Sundareshwara resigned as Independent Director effective November 11, 2025, citing increased professional and personal commitments. His resignation also resulted in him stepping down as Chairperson of the Audit Committee and member of other board committees. The Board reconstituted all committees following his departure, with Mr. Keshava Murthy Kalasachar appointed as the new Audit Committee Chairperson.",
            "Sentiment": "negative",
            "PublishDate": 1762937830238,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aro Granite Industries Reports Loss of Rs 642.28 Lacs in Q1 Results",
            "Summary": "Aro Granite Industries Limited reported a net loss of Rs 642.28 lacs for the quarter ended June 30, 2025, compared to a profit of Rs 75.43 lacs in the same quarter last year. Revenue from operations declined to Rs 2,703.66 lacs from Rs 3,755.26 lacs year-over-year. The company operates two business segments: manufacturing granite tiles and slabs, and manufacturing quartz engineered slabs. Total expenses for the quarter were Rs 2,737.43 lacs. The company's earnings per share stood at negative Rs 4.07 for the quarter. The audited financial results were approved by the Board of Directors following recommendation by the Audit Committee.",
            "Sentiment": "negative",
            "PublishDate": 1754036366411,
            "Source": "earnings"
        }
    ]
}