{
    "Symbol": "ARROWGREEN",
    "ISIN": "INE570D01018",
    "News": [
        {
            "Title": "Arrow Greentech Board Meet Set for Feb 13, 2026",
            "Summary": "Arrow Greentech Limited has scheduled a board meeting on February 13, 2026, to consider and approve Q3FY26 unaudited standalone and consolidated financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770460037307,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arrow Greentech Gets Sri Lanka Patent for Security Laminates",
            "Summary": "Arrow Greentech Limited has received patent approval from Sri Lanka for its security laminates technology, marking an important milestone in the company's intellectual property portfolio expansion.",
            "Sentiment": "positive",
            "PublishDate": 1769776219214,
            "Source": "stocks"
        },
        {
            "Title": "Arrow Greentech receives ₹6.03 crore IT demand order",
            "Summary": "Arrow Greentech Ltd disclosed receiving a ₹6.03 crore income tax demand order from IT Department for A.Y. 2017-18 following dismissal of company's appeal regarding expenditure disallowances.",
            "Sentiment": "negative",
            "PublishDate": 1769612231954,
            "Source": "stocks"
        },
        {
            "Title": "Arrow Greentech Reports Strong Q2 FY26 Performance with 47% QoQ Revenue Growth",
            "Summary": "Arrow Greentech delivered revenue of Rs. 611 million in Q2 FY26, marking 47% quarter-on-quarter growth, with EBITDA at Rs. 208 million and PAT at Rs. 157 million. The company's Green Products segment generated Rs. 123 million in revenue while High-Tech segment contributed Rs. 488 million, reflecting strong operational momentum across diversified business segments.",
            "Sentiment": "positive",
            "PublishDate": 1763209388726,
            "Source": "earnings"
        },
        {
            "Title": "Arrow Greentech Reports Decline in Q2 Financial Performance",
            "Summary": "Arrow Greentech's consolidated net profit dropped to 157 million rupees from 187 million rupees year-over-year, while revenue decreased to 611 million rupees from 648 million rupees. The company experienced declines across both key financial metrics in its quarterly results, affecting shareholders and indicating weaker operational performance compared to the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1763052569585,
            "Source": "earnings"
        },
        {
            "Title": "Arrow Greentech Sets Record Date for Rs. 4 Final Dividend Payment",
            "Summary": "Arrow Greentech Limited has set September 18, 2025 as the record date for determining shareholder eligibility for a final dividend of Rs. 4 per equity share. The dividend applies to equity shares with a face value of Rs. 10 each. The company communicated this decision to BSE and NSE on September 4, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1756975002998,
            "Source": "corporate_action"
        },
        {
            "Title": "Arrow Greentech Reports 27% Revenue Decline in Q1 FY26 Despite Margin Expansion",
            "Summary": "Arrow Greentech Limited reported revenue of Rs. 416 million for Q1 FY26, down 27% from Rs. 573 million in Q4 FY25. EBITDA decreased 11% to Rs. 142 million, though EBITDA margin improved to 34.2% from 28.0% in the previous quarter. Profit After Tax declined 4% to Rs. 109 million with PAT margin expanding to 25.1%. Year-over-year performance showed steeper declines with revenue down 37% and PAT down 46% compared to Q1 FY25. The company's Green Products segment revenue fell 32% quarter-on-quarter to Rs. 344 million, while Hightech Products remained stable at Rs. 70 million. Chairman Shilpan Patel attributed the softer performance to geopolitical tensions, supply chain challenges, and macroeconomic headwinds, noting negligible exports to USA while Brazil exports increased for green products.",
            "Sentiment": "negative",
            "PublishDate": 1755163368429,
            "Source": "earnings"
        },
        {
            "Title": "Arrow Greentech Reports Q1 FY26 Revenue of Rs. 416 Million with Improved Margins Despite Sequential Decline",
            "Summary": "Arrow Greentech Ltd announced Q1 FY26 results with revenue of Rs. 416 million, down 27% from Rs. 573 million in Q4 FY25. EBITDA was Rs. 142 million with margin improving to 34.2% from 28.0% in the previous quarter. Profit after tax stood at Rs. 109 million with PAT margin expanding to 25.1% from 19.3% quarter-on-quarter. The company operates in green packaging technology, specializing in water-soluble films and bio-compostable films. Chairman Shilpan Patel noted softer revenue performance but highlighted operational efficiency gains. The company reported negligible exports to USA while exports to Brazil increased for green products. Arrow Greentech continues focusing on high-tech security products aligned with Atma Nirbhar Bharat initiative and sustainable solutions through its Green Product business segment.",
            "Sentiment": "neutral",
            "PublishDate": 1755016856966,
            "Source": "earnings"
        },
        {
            "Title": "Arrow Greentech Approves Q1 2025 Results, Sets AGM Date and Dividend Book Closure",
            "Summary": "Arrow Greentech Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025, during a meeting held on August 12, 2025. The company announced book closure dates from September 19-22, 2025, for dividend payment and Annual General Meeting purposes. The 33rd Annual General Meeting is scheduled for September 22, 2025, at 3:00 PM via video conferencing. The Board also appointed Dilip M Bathija as Cost Auditor for Financial Year 2025-26. The consolidated results include subsidiaries Arrow Secure Technology Private Limited, Arrow Green Technologies (UK) Limited, Avery Pharmaceuticals Private Limited, and LQ Arrow Security Products (India) Private Limited, among others. One associate company, Sphere Bio Polymer Private Limited, was struck off and dissolved on May 26, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755009093861,
            "Source": "corporate_action"
        },
        {
            "Title": "Arrow Greentech Reports Q4 Results and Recommends Dividend",
            "Summary": "Arrow Greentech has announced its Q4 financial results and dividend recommendation. The company's Q4 consolidated net profit increased to 114 million rupees from 101 million rupees year-over-year. Revenue rose to 573 million rupees from 506 million rupees. EBITDA slightly improved to 160 million rupees from 156 million rupees, although the EBITDA margin decreased to 28% from 30.86%. The company has recommended a final dividend of 4 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747495016000,
            "Source": "result"
        },
        {
            "Title": "Arrow Greentech Reports Strong Q3 Financial Results",
            "Summary": "Arrow Greentech has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 128 million rupees, up from 49 million rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 551 million rupees compared to 249 million rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739146205000,
            "Source": "earnings"
        },
        {
            "Title": "Arrow Greentech Reports Significant EBITDA Growth in Q3",
            "Summary": "Arrow Greentech has announced its Q3 financial results, showing substantial year-over-year improvement. The company's EBITDA increased to 179 million rupees, up from 73 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 32.52% from 29.31% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739015899000,
            "Source": "earnings"
        },
        {
            "Title": "Arrow Greentech Reports Significant Growth in Q3 Financial Results",
            "Summary": "Arrow Greentech has announced its Q3 financial results, showing substantial year-over-year growth. The company's consolidated net profit increased to 128 million rupees, up from 49 million rupees in the same quarter last year. Revenue also saw a significant rise, reaching 551 million rupees compared to 249 million rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739015894000,
            "Source": "earnings"
        },
        {
            "Title": "Arrow Greentech Reports Significant Revenue Growth in Q2",
            "Summary": "Arrow Greentech has reported a substantial increase in its second-quarter revenue. The company's revenue for Q2 reached 648 million rupees, compared to 291 million rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730104034000,
            "Source": "result"
        },
        {
            "Title": "Arrow Greentech Reports Significant Profit Increase in Q2",
            "Summary": "Arrow Greentech has reported a substantial increase in consolidated net profit for the second quarter. The company's net profit rose to 186 million rupees, up from 51 million rupees in the same period last year, representing a year-over-year growth of approximately 265%.",
            "Sentiment": "positive",
            "PublishDate": 1730104002000,
            "Source": "result"
        }
    ]
}