{
    "Symbol": "ARSHIYA",
    "ISIN": "INE968D01022",
    "News": [
        {
            "Title": "Arshiya Limited Delays Q3FY26 Results Due to CIRP",
            "Summary": "Arshiya Limited disclosed reasons for delay in submitting Q3FY26 financial results, citing ongoing Corporate Insolvency Resolution Process, office relocation challenges, and data collection issues.",
            "Sentiment": "negative",
            "PublishDate": 1770911589302,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arshiya's Subsidiary Gets NCLT Approval for JSW Plan",
            "Summary": "NCR Rail Infrastructure Limited, Arshiya's wholly owned subsidiary, receives final NCLT approval for resolution plan submitted by JSW Infrastructure Limited under insolvency proceedings.",
            "Sentiment": "positive",
            "PublishDate": 1770894669396,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arshiya Limited Holds 12th COC Meeting Under CIRP",
            "Summary": "Arshiya Limited conducted its twelfth Committee of Creditors meeting on January 09, 2026, discussing CIRP updates, creditor claims, period extensions, and FY25 financial reports during the ongoing insolvency resolution process.",
            "Sentiment": "neutral",
            "PublishDate": 1767972237882,
            "Source": "stocks"
        },
        {
            "Title": "Arshiya Limited Delays Financial Results Submission Due to Insolvency Process Challenges",
            "Summary": "Arshiya Limited cannot submit its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025, due to ongoing Corporate Insolvency Resolution Process under IBC with Resolution Professional Pankaj Mahajan managing operations. The delay stems from data collection challenges during CIRP, office relocation disruptions, and mass employee resignations where 50 out of 71 employees left without proper handovers between July 30 and August 2, 2024.",
            "Sentiment": "negative",
            "PublishDate": 1763135105953,
            "Source": "corporate_governance"
        },
        {
            "Title": "Arshiya Limited Holds Tenth Committee of Creditors Meeting During Insolvency Process",
            "Summary": "Arshiya Limited conducted its tenth Committee of Creditors (CoC) meeting on July 29, 2025, via video conferencing from 2:30 PM to 4:40 PM. The company is currently undergoing Corporate Insolvency Resolution Process (CIRP). During the meeting, Resolution Professional Pankaj Mahajan briefed the CoC on various aspects of the CIRP, including process extension and company operations. The meeting was disclosed to stock exchanges NSE and BSE as a regulatory requirement.",
            "Sentiment": "neutral",
            "PublishDate": 1753795690917,
            "Source": "corporate_governance"
        },
        {
            "Title": "Arshiya Limited CFO Dineshkumar Banshilal Sodani Retires Due to Superannuation",
            "Summary": "Arshiya Limited announced the retirement of Mr. Dineshkumar Banshilal Sodani from his position as Chief Financial Officer and Key Managerial Personnel, effective July 27, 2025. The retirement is due to superannuation as he has reached the age limit. The company is currently under Corporate Insolvency Resolution Process, with Pankaj Mahajan serving as the Resolution Professional who signed the disclosure document.",
            "Sentiment": "neutral",
            "PublishDate": 1753783607562,
            "Source": "corporate_governance"
        },
        {
            "Title": "Arshiya Limited Schedules 10th Committee of Creditors Meeting During Insolvency Process",
            "Summary": "Arshiya Limited, which is undergoing Corporate Insolvency Resolution Process, has scheduled its 10th Committee of Creditors meeting for July 29, 2025. The meeting notification was issued by Resolution Professional Pankaj Mahajan to stock exchanges NSE and BSE. The company trades under scrip code ARSHIYA on NSE and 506074 on BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1753767957411,
            "Source": "corporate_action"
        }
    ]
}