{
    "Symbol": "ARSSBL",
    "ISIN": "INE549H01021",
    "News": [
        {
            "Title": "CRISIL Assigns A/Stable Rating to Anand Rathi Brokers",
            "Summary": "CRISIL assigned 'A/Stable' rating to INR 1400 crore bank facilities and reaffirmed 'A1' rating for INR 100 crore commercial paper of Anand Rathi Share and Stock Brokers Limited.",
            "Sentiment": "positive",
            "PublishDate": 1769608890450,
            "Source": "stocks"
        },
        {
            "Title": "Anand Rathi Share Brokers Reports IPO Fund Usage",
            "Summary": "Anand Rathi Share and Stock Brokers Limited submitted its Q3 FY26 monitoring agency report showing complete utilization of ₹7,035.00 crores from its IPO proceeds for working capital requirements.",
            "Sentiment": "positive",
            "PublishDate": 1768978238454,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Share Reports Strong Q3FY26 Growth",
            "Summary": "Anand Rathi Share and Stock Brokers Limited reported impressive Q3FY26 results with 21.50% YoY revenue growth to ₹2,481.99 million and 71.80% YoY profit surge to ₹370.04 million.",
            "Sentiment": "positive",
            "PublishDate": 1768557449170,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Q3 Net Profit Jumps 78% to ₹379 Million",
            "Summary": "Anand Rathi Share & Stock Brokers reported strong Q3 performance with net profit rising 78% YoY to ₹379 million, while revenue grew 24% to ₹2.48 billion and EBITDA margin expanded to 41.07%.",
            "Sentiment": "positive",
            "PublishDate": 1768522756402,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Q3 Net Profit Surges 72% YoY to ₹37 Cr",
            "Summary": "Anand Rathi Share and Stock Brokers reports Q3 consolidated net profit of ₹37 crore, up 32.6% QoQ and 72% YoY. Total revenue rose 22% YoY to ₹249 crore with strong non-broking growth.",
            "Sentiment": "positive",
            "PublishDate": 1768401519045,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Q3 Net Profit Jumps 33% QoQ to ₹370 Cr",
            "Summary": "Anand Rathi Shares & Stock Brokers reports 33% sequential growth in net profit to ₹370 crore for Q3, with revenue rising 9% QoQ to ₹248 crore and EBITDA margins stable at 40.81%.",
            "Sentiment": "positive",
            "PublishDate": 1768397437015,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Subsidiary Enters Investment Banking",
            "Summary": "Anand Rathi's wholly owned subsidiary ARIVPL approved expansion into Investment Banking and Investment Advisory services in GIFT City under IFSCA framework, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1768308621924,
            "Source": "stocks"
        },
        {
            "Title": "Anand Rathi Reschedules Q3FY26 Earnings Call",
            "Summary": "Anand Rathi Share and Stock Brokers Limited has rescheduled its Q3 FY26 earnings call to 3:00 PM IST on January 15, 2026, moving it earlier from the previously announced 5:30 PM slot.",
            "Sentiment": "neutral",
            "PublishDate": 1768308247814,
            "Source": "co_actions_results"
        },
        {
            "Title": "Broking stocks surge; Anand Rathi leads with 45% gain",
            "Summary": "Anand Rathi Share & Stock Brokers topped broking sector gains with 45% surge in three months, while Sensex gained modest 4%. Seven broking firms delivered 10-45% returns, outpacing broader market significantly.",
            "Sentiment": "positive",
            "PublishDate": 1767776447010,
            "Source": "stocks"
        },
        {
            "Title": "Anand Rathi Share and Stock Brokers Reports Financial Ratios for Quarter Ended September 30, 2025",
            "Summary": "Anand Rathi Share and Stock Brokers Limited submitted mandatory financial disclosures under SEBI regulations for the quarter ended September 30, 2025, showing net profit after tax of ₹5,071.55 lakhs and earnings per share of ₹11.40. The company's net worth increased significantly to ₹1,30,285.51 lakhs compared to ₹46,038.08 lakhs in the same period last year, reflecting improved financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1765194892862,
            "Source": "corporate_action"
        },
        {
            "Title": "Anand Rathi Share and Stock Brokers Faces Rs 2.15 Lakh Penalty from NSE Clearing",
            "Summary": "NSE Clearing Limited imposed a consolidated penalty of Rs 2,15,000 on Anand Rathi Share and Stock Brokers following a regular inspection of their Futures and Options segment and SLB scheme operations. The penalty covers violations including non-collection of crystallized obligations in cash, improper collateral segregation, and delayed submission of client bank account undertakings for the period July 2023 to June 2025.",
            "Sentiment": "negative",
            "PublishDate": 1764075520747,
            "Source": "corporate_governance"
        },
        {
            "Title": "Anand Rathi Share and Stock Brokers Clarifies Share Price Movement to BSE",
            "Summary": "Anand Rathi Share and Stock Brokers responded to BSE's inquiry about significant share price movement, stating no pending price-sensitive information or announcements from the company. The company attributed the price movement to market conditions and confirmed compliance with all disclosure requirements under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763442967431,
            "Source": "stock"
        },
        {
            "Title": "Anand Rathi Share and Stock Brokers Updates CIN and Listing Status Following Stock Exchange Listing",
            "Summary": "Anand Rathi Share and Stock Brokers Limited has updated its Corporate Identification Number (CIN) and listing status with the Ministry of Corporate Affairs following its equity shares listing on BSE and NSE on September 30, 2025. The company's CIN changed from U67120MH1991PLC064106 to L67120MH1991PLC064106, and its listing status was updated from 'No' to 'Yes' on the MCA master data. The company applied for these changes to the Registrar of Companies, Mumbai on October 13, 2025. The company has an authorized capital of Rs 33 crore and paid-up capital of Rs 31.36 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1761657427614,
            "Source": "stock"
        },
        {
            "Title": "Anand Rathi Share and Stock Brokers Penalized Rs 4.25 Lakh by MCX for Technical Glitch Reporting Non-Compliance",
            "Summary": "Multi Commodity Exchange of India Limited (MCX) imposed a penalty of Rs 4,25,000 plus applicable GST on Anand Rathi Share and Stock Brokers Limited. The penalty was imposed by MCX's Member Committee for non-compliance with reporting requirements related to technical glitches reported on more than 6 occasions during financial year 2024-25. The violations were against SEBI circular dated November 25, 2022, and MCX circular dated December 16, 2022. The penalty will be debited from the company's settlement account within 14 days of receipt of the order.",
            "Sentiment": "negative",
            "PublishDate": 1761654379278,
            "Source": "corporate_governance"
        },
        {
            "Title": "Anand Rathi Share and Stock Brokers Reports Strong Q2 Performance, Completes IPO Listing",
            "Summary": "Anand Rathi Share and Stock Brokers Limited approved unaudited financial results for quarters ended June 30, 2025 and September 30, 2025. The company completed its IPO of ₹74,500 lakhs through fresh issue of 1,80,10,692 equity shares at ₹414 per share, with listing on NSE and BSE on September 30, 2025. For Q2 2025, standalone revenue from operations reached ₹22,708.38 lakhs compared to ₹20,101.81 lakhs in Q1, with profit after tax of ₹2,858.76 lakhs versus ₹2,337.00 lakhs in the previous quarter. The company operates in broking and related services segment. Board reconstituted the Audit Committee and adopted several corporate policies following the equity listing. IPO proceeds of ₹66,401.85 lakhs have been utilized primarily for long-term working capital requirements, with ₹8,098.15 lakhs remaining unutilized.",
            "Sentiment": "positive",
            "PublishDate": 1760776710014,
            "Source": "earnings"
        },
        {
            "Title": "Anand Rathi Share & Stock Brokers Reports Higher Q2 EBITDA and Margin",
            "Summary": "Anand Rathi Share & Stock Brokers reported Q2 EBITDA of 932 million rupees compared to 856 million rupees in the same period last year. The company's EBITDA margin improved to 41.06% from 37.23% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1760774256051,
            "Source": "earnings"
        },
        {
            "Title": "Anand Rathi Share & Stock Brokers Reports Decline in Q2 Net Profit and Revenue",
            "Summary": "Anand Rathi Share & Stock Brokers reported a net profit of 286 million rupees for Q2, down from 331 million rupees in the same period last year. The company's revenue also decreased to 2.27 billion rupees compared to 2.3 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1760773925868,
            "Source": "earnings"
        }
    ]
}