{
    "Symbol": "ARTEMISMED",
    "ISIN": "INE025R01021",
    "News": [
        {
            "Title": "Artemis Medicare Q3 FY26 Revenue Grows 17.2% to INR 272 Cr",
            "Summary": "Artemis Medicare Services reported consolidated revenue of INR 272 crores for Q3 FY26, up 17.2% YoY. EBITDA reached INR 52 crores with 9.1% margin. Company plans INR 700 crore fundraise for expansion to 2,000+ beds by 2029.",
            "Sentiment": "positive",
            "PublishDate": 1770661634636,
            "Source": "co_actions_results"
        },
        {
            "Title": "Artemis Medicare Reports Q3FY26 Monitoring Update",
            "Summary": "Artemis Medicare Services submits Q3FY26 monitoring agency report showing ₹0.33 crore utilization from ₹330 crore preferential issue proceeds, with ₹267.73 crore remaining unutilized.",
            "Sentiment": "neutral",
            "PublishDate": 1770042208143,
            "Source": "stocks"
        },
        {
            "Title": "Artemis Medicare Board Meet on Feb 2 for Q3 Results",
            "Summary": "Artemis Medicare Services has scheduled a board meeting on February 2, 2026, to approve Q3FY26 unaudited financial results and evaluate fund raising proposals through various instruments.",
            "Sentiment": "neutral",
            "PublishDate": 1769607769430,
            "Source": "co_actions_results"
        },
        {
            "Title": "Artemis Medicare Allots 1.05L Shares Under ESOP",
            "Summary": "Artemis Medicare Services allotted 1,05,750 equity shares under its Management Stock Option Plan-2021, increasing paid-up capital to ₹15.83 crores with shares ranking pari-passu.",
            "Sentiment": "neutral",
            "PublishDate": 1765985535086,
            "Source": "co_actions_results"
        },
        {
            "Title": "Artemis Medicare Reports 13.8% Revenue Growth in Q2FY26, Plans Major Expansion with New Facilities",
            "Summary": "Artemis Medicare Services delivered consolidated revenue of INR 274.7 crores with 13.8% Y-o-Y growth and EBITDA margin of 21.2%, driven by strong performance in cardiac sciences, oncology, and international patients contributing 32% of revenues. The company is expanding aggressively with a 300-bed Raipur facility launching by March 2026, a 650-bed South Delhi hospital under binding MoU, and plans to increase Gurgaon capacity to 850-1,000 beds using additional FAR approvals.",
            "Sentiment": "positive",
            "PublishDate": 1763448143068,
            "Source": "earnings"
        },
        {
            "Title": "IFC Converts Debentures Into 1.89 Crore Artemis Medicare Shares, Reduces Promoter Stake",
            "Summary": "International Finance Corporation was allotted 1,89,62,247 equity shares of Artemis Medicare Services Limited following conversion of 33,000 Compulsorily Convertible Debentures on November 15, 2025. The allotment increased the company's paid-up share capital from 13,92,38,250 to 15,82,00,497 equity shares, reducing promoter shareholding percentage from 66.38% to 58.43%.",
            "Sentiment": "neutral",
            "PublishDate": 1763380956499,
            "Source": "corporate_action"
        },
        {
            "Title": "Artemis Medicare Allots 1.89 Crore Equity Shares to IFC Upon Debenture Conversion",
            "Summary": "Artemis Medicare Services Limited allotted 1,89,62,247 equity shares to International Finance Corporation (IFC) following the conversion of 33,000 compulsorily convertible debentures at Rs. 174.03 per share. The allotment increases the company's paid-up equity share capital from 13.92 crore to 15.82 crore shares, with the new shares to be listed and traded on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1763195304968,
            "Source": "corporate_action"
        },
        {
            "Title": "Artemis Medicare Services Reports No Fund Utilization in Q2 FY26 from Rs 330 Crore Preferential Issue",
            "Summary": "Artemis Medicare Services Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing no utilization of funds from its Rs 330 crore preferential issue of compulsory convertible debentures. The company had raised Rs 320 crore for acquisition, expansion and capital expenditure requirements, and Rs 10 crore for general corporate purposes. As of the quarter end, Rs 266 crore remains unutilized from the acquisition fund and Rs 2.06 crore from general corporate purposes. The unutilized proceeds of Rs 268.06 crore are deployed in fixed deposits across HDFC Bank, ICICI Bank, and Axis Bank with interest rates ranging from 5.75% to 8.87%. CARE Ratings Limited, the monitoring agency, reported no deviation from stated objects and confirmed all utilization is as per offer document disclosures.",
            "Sentiment": "neutral",
            "PublishDate": 1762917975728,
            "Source": "corporate_action"
        },
        {
            "Title": "Artemis Medicare Reports Strong Q2 Results, Appoints New Internal Auditor",
            "Summary": "Artemis Medicare Services Limited reported its unaudited financial results for the quarter and half year ended September 30, 2025. The company's Board of Directors approved the quarterly results and made a key management change. Mr. Prateek Rastogi, a Chartered Accountant with 19 years of experience in internal audits and risk management, was appointed as Internal Auditor effective November 12, 2025. He replaces Mr. Praveen Moon, who resigned from the position effective November 11, 2025, citing pre-occupation with other assignments. The company issued 13,30,000 equity shares to its Managing Director under the Artemis Medicare Management Stock Option Plan-2021. The financial results were subject to limited review by statutory auditors TR Chadha Co LLP, who issued an unmodified review report.",
            "Sentiment": "neutral",
            "PublishDate": 1762905643387,
            "Source": "earnings"
        },
        {
            "Title": "Artemis Hospitals Plans Multi-Year Expansion with 400+ Bed Gurugram Facility",
            "Summary": "Artemis Hospitals announced a multi-year expansion plan featuring a new 400+ bed hospital in Gurugram and regional centers across NCR. The company is enhancing its specialty mix toward oncology, cardiology, and robotic surgery while leveraging digital health and international patient services for margin expansion. The expansion is expected to drive strong FY26 growth visibility through capacity addition and improved case mix.",
            "Sentiment": "positive",
            "PublishDate": 1762872078770,
            "Source": "stock"
        },
        {
            "Title": "Artemis Medicare Reports Strong Q2 Growth with 34.6% Jump in Net Profit",
            "Summary": "Artemis Medicare delivered robust quarterly performance with consolidated net profit rising to 299.7 million rupees from 222.6 million rupees year-over-year. Revenue increased to 2.75 billion rupees compared to 2.42 billion rupees in the same period last year. EBITDA grew to 506.1 million rupees from 422.6 million rupees, while EBITDA margin improved to 18.43% from 17.51% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762869568862,
            "Source": "earnings"
        },
        {
            "Title": "Artemis Medicare Services Appoints Rudra Narayan Acharjee as Head of Investor Relations and Growth Strategy",
            "Summary": "Artemis Medicare Services Limited appointed Mr. Rudra Narayan Acharjee as Head-Investor Relations, M&A and Organization Growth Strategy, effective September 18, 2025. The Board of Directors approved the appointment based on the Nomination and Remuneration Committee's recommendation. Acharjee is a corporate finance and strategy professional with experience across healthcare, manufacturing, and banking sectors. He holds CFA and MIFA degrees from ICFAI University, Tripura, and an MBA from Regional College of Management, Odisha. He previously served as Assistant Vice President - Business Planning & Strategy at KIMS Hospitals, Hyderabad, and has worked with Narayana Health, Fortis Healthcare, Jindal Stainless Ltd., and Kajaria Ceramics Ltd. The appointment is for full-time employment.",
            "Sentiment": "positive",
            "PublishDate": 1758176792105,
            "Source": "corporate_governance"
        },
        {
            "Title": "Artemis Medicare Plans Expansion to Over 1,100 Beds by FY26 with New Hospitals in Raipur and South Delhi",
            "Summary": "Artemis Medicare announced plans for significant expansion, targeting over 1,100 beds by FY26. The company will add a 300-bed hospital in Raipur and a 550-bed hospital in South Delhi. The expansion strategy includes entering Tier-2 cities and international markets. The company reported strong Q1 FY26 results with an Average Revenue Per Occupied Bed (ARPOB) of ₹83,900 and 28% growth in Profit After Tax (PAT).",
            "Sentiment": "positive",
            "PublishDate": 1754481918070,
            "Source": "stock"
        },
        {
            "Title": "Artemis Medicare Services Reports Rs 54 Crore Utilization from Rs 330 Crore Debenture Issue",
            "Summary": "Artemis Medicare Services Limited submitted its monitoring agency report for the quarter ended June 30, 2025, detailing the utilization of proceeds from their Rs 330 crore Preferential Issue of Compulsorily Convertible Debentures. The company utilized Rs 54 crore during the quarter towards expansion purposes, in line with stated objectives. The total issue proceeds were allocated Rs 320 crore for acquisition, expansion and capital expenditure requirements, and Rs 10 crore for general corporate purposes. As of quarter-end, Rs 268.06 crore remained unutilized and was deployed in fixed deposits across HDFC Bank, ICICI Bank, and Axis Bank, earning returns between 5.75% to 7.30%. The monitoring report, issued by CARE Ratings Limited, confirmed no deviations from the disclosed objects and was reviewed by the company's Audit Committee. The implementation timeline extends to May 15, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1754398242559,
            "Source": "corporate_action"
        },
        {
            "Title": "Artemis Medicare Services Reports Q1 FY26 Results with Revenue Growth and Strategic Expansion",
            "Summary": "Artemis Medicare Services Limited reported its quarterly results for the period ended June 30, 2025. The company's standalone revenue from operations increased to ₹24,979.86 lakhs compared to ₹21,689.24 lakhs in the same quarter last year. Net profit after tax stood at ₹2,141.72 lakhs versus ₹1,691.66 lakhs in the previous year quarter. On a consolidated basis, revenue from operations reached ₹25,496.09 lakhs compared to ₹22,320.38 lakhs year-over-year, with consolidated net profit at ₹2,119.75 lakhs versus ₹1,652.43 lakhs. The company issued 13,30,000 equity shares to its Managing Director under the stock option plan. Additionally, Artemis entered into a Memorandum of Understanding with Dr. Vidyasagar Kaushalya Devi Memorial Health Centre for potential medical services agreement, paying an advance deposit of ₹54 crores. The company operates primarily in healthcare services with revenue split between India (₹18,452.87 lakhs) and international markets (₹7,043.22 lakhs) for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754395189115,
            "Source": "earnings"
        },
        {
            "Title": "Artemis Medicare Services to Close Chennai Cardiac Centre on August 15, 2025",
            "Summary": "Artemis Medicare Services Limited announced the closure of a Cardiac Centre in Chennai operated by its subsidiary, Artemis Cardiac Care Private Limited, effective August 15, 2025. The Board of Directors of the subsidiary made this decision at a meeting held on August 1, 2025. The Chennai unit contributed Rs. 153.12 lacs in turnover during FY 2024-25, representing 0.16% of the consolidated turnover of Rs. 93,691.67 lacs. The unit had a negative net worth of Rs. (114.76) lacs as of March 31, 2025, compared to the consolidated net worth of Rs. 63,048.25 lacs.",
            "Sentiment": "negative",
            "PublishDate": 1754052678046,
            "Source": "stock"
        },
        {
            "Title": "Artemis Medicare Q4 Financial Results",
            "Summary": "Artemis Medicare reported its Q4 financial results. The company's EBITDA decreased to 359 million rupees from 380 million rupees year-over-year, with EBITDA margin falling to 14.96% from 16.85%. However, consolidated net profit increased to 230 million rupees from 142 million rupees year-over-year and 207 million rupees quarter-over-quarter. Revenue grew to 2.39 billion rupees from 2.25 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747052495000,
            "Source": "result"
        },
        {
            "Title": "Artemis Medicare Reports Increase in Average Revenue per Occupied Bed",
            "Summary": "Artemis Medicare has reported an increase in their Average Gross Revenue per Occupied Bed (ARPOB). The company's ARPOB has risen to INR 80,200, up from INR 77,900 previously. This information was shared in an investor presentation, indicating a positive trend in the company's revenue generation per patient.",
            "Sentiment": "positive",
            "PublishDate": 1738755878000,
            "Source": "earnings"
        },
        {
            "Title": "Artemis Medicare Reports Improved Q3 EBITDA and Margin",
            "Summary": "Artemis Medicare has reported an increase in its Q3 EBITDA to 375 million rupees, up from 326.4 million rupees in the same quarter last year. The company's EBITDA margin also improved, rising to 16.12% from 14.92% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738742689000,
            "Source": "earnings"
        },
        {
            "Title": "Artemis Medicare Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "Artemis Medicare Services Limited has announced its financial results for the third quarter, reporting a consolidated net profit of 207 million rupees. This represents a substantial increase from the 115 million rupees reported in the same quarter of the previous year, indicating a year-over-year growth in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1738742663000,
            "Source": "earnings"
        },
        {
            "Title": "Artemis Medicare Services Reports Q2 EBITDA Growth",
            "Summary": "Artemis Medicare Services has reported improved financial performance for the second quarter. The company's EBITDA increased to 423 million rupees, up from 342 million rupees in the same period last year. Additionally, the EBITDA margin expanded to 17.50% from 15.2% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731598405000,
            "Source": "result"
        },
        {
            "Title": "Artemis Medicare Services Reports Strong Q2 Financial Results",
            "Summary": "Artemis Medicare Services has announced its Q2 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit increased to 221 million rupees, up from 135 million rupees in the same quarter last year and 165 million rupees in the previous quarter. Revenue also saw growth, reaching 2.4 billion rupees compared to 2.25 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731598340000,
            "Source": "result"
        }
    ]
}