{
    "Symbol": "ARVINDFASN",
    "ISIN": "INE955V01021",
    "News": [
        {
            "Title": "Arvind Fashions Q3FY26 Conference Call Recording",
            "Summary": "Arvind Fashions Limited makes available audio recording of post-results conference call held on January 29, 2026 to discuss Q3FY26 financial performance with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1769684766664,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arvind Fashions Grants 5,100 Stock Options to Employees",
            "Summary": "Arvind Fashions Limited grants 5,100 stock options under ESOP 2025 scheme with exercise price of ₹449.45 per share, vesting over two years starting January 2027.",
            "Sentiment": "positive",
            "PublishDate": 1769174266724,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arvind Fashions allots 7,000 equity shares under ESOS",
            "Summary": "Arvind Fashions Limited has allotted 7,000 equity shares of face value ₹4 each under its Employee Stock Option Scheme 2016 following exercise of stock options by eligible employees on January 23, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769161482092,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arvind Fashions Q3FY26 Results Call on Jan 29",
            "Summary": "Arvind Fashions Limited has scheduled a post-results conference call on January 29, 2026, at 12:30 Hours IST to discuss Q3FY26 and nine-month financial performance with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1769083878456,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arvind Fashions Completes ₹135 Cr Flipkart Stake Buy",
            "Summary": "Arvind Fashions completed acquisition of Flipkart's 31.25% stake in subsidiary Arvind Youth Brands for ₹135 crores. Stock traded 0.8% lower despite strong Q2 performance with 25% profit growth.",
            "Sentiment": "neutral",
            "PublishDate": 1766980279203,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arvind Fashions Allots 7,500 Shares Under ESOS 2016",
            "Summary": "Arvind Fashions Limited allotted 7,500 equity shares of ₹4 face value each on December 18, 2025, under its Employee Stock Option Scheme 2016 following exercise by eligible employees.",
            "Sentiment": "neutral",
            "PublishDate": 1766053485451,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arvind Fashions Grants 30,000 Stock Options to Employees",
            "Summary": "Arvind Fashions Limited has granted 30,000 stock options to eligible employees under its Employee Stock Option Scheme-2025, with an exercise price of ₹484.00 per share and vesting over four years.",
            "Sentiment": "positive",
            "PublishDate": 1765380232352,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nitesh Kanchan Appointed CEO of Arrow Brand at Arvind Fashions",
            "Summary": "Arvind Fashions Limited announced the appointment of Nitesh Kanchan as Chief Executive Officer of its Arrow menswear brand to lead growth across product innovation, digital expansion, and omni-channel retail. Kanchan brings over two decades of experience in fashion and retail, having previously served as Chief Digital Officer at Arvind Fashions and CEO of Sephora India, and will focus on strengthening Arrow's core informal wear while expanding into smart casual and lifestyle categories.",
            "Sentiment": "neutral",
            "PublishDate": 1765200229604,
            "Source": "corporate_governance"
        },
        {
            "Title": "Arvind Fashions Allots 5,000 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Arvind Fashions Limited allotted 5,000 equity shares with face value of Rs. 4 each under its Employee Stock Option Scheme 2016 following exercise of stock options by eligible employees. The allotment was completed on December 3, 2025, and affects the company's share capital structure.",
            "Sentiment": "neutral",
            "PublishDate": 1764755565705,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind Fashions Allots 21,000 Equity Shares Under Employee Stock Option Schemes",
            "Summary": "Arvind Fashions Limited allotted 21,000 equity shares of face value Rs. 4 each to eligible employees through exercise of stock options under two ESOP schemes - 10,000 shares under ESOS 2016 and 11,000 shares under ESOS 2022. The allotment affects employee shareholders and represents routine execution of the company's employee incentive programs.",
            "Sentiment": "neutral",
            "PublishDate": 1763548094397,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind Fashions Reports 11.3% Revenue Growth and 18% EBITDA Growth in Q2 FY26",
            "Summary": "Arvind Fashions Limited delivered consecutive quarter double-digit revenue growth with net sales value of INR 1,418 crores versus INR 1,273 crores in the previous year same quarter, representing 11.3% growth. EBITDA grew 18.2% to INR 200 crores from INR 170 crores, with 80 basis points margin expansion. Direct channels contributed significantly, accounting for nearly 50% of sales. Retail growth was 14% with healthy like-to-like growth of 8.3%, while online B2C grew over 50%. The company added over 36,000 square feet of retail space during the quarter. U.S. Polo continued strong performance with 21% growth driven by advertising campaigns and new store openings. Adjacent categories including footwear grew over 25%, with overall adjacent categories growing 22%. Gross margins improved by 210 basis points to nearly 53%. Inventory freshness reached all-time high of over 85%. The company implemented GST 2.0 reforms, passing benefits to consumers. PAT in Q2 was INR 37 crores versus INR 30 crores in Q2 last year, with PBT growth of nearly 31%.",
            "Sentiment": "positive",
            "PublishDate": 1762791318093,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Fashions Allots 55,000 Equity Shares Under Employee Stock Option Schemes",
            "Summary": "Arvind Fashions Limited allotted 55,000 equity shares with a face value of Rs. 4 each to eligible employees through stock option exercises. The allotment included 30,000 shares under the AFL Employee Stock Option Scheme 2016 and 25,000 shares under the AFL Employee Stock Option Scheme 2022. The shares were allotted pursuant to exercise of stock options previously granted to employees.",
            "Sentiment": "neutral",
            "PublishDate": 1762540877434,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind Fashions Chief Revenue Officer Resigns Due to Personal Reasons",
            "Summary": "Mallikarjuna Reddy Yarabolu, Chief Revenue Officer at Arvind Fashions Limited, has submitted his resignation from the company. His resignation will be effective from the close of business hours on December 31, 2025. The departure is attributed to personal reasons. Yarabolu was designated as Senior Management Personnel under SEBI regulations. In his resignation letter addressed to Managing Director CEO Amisha Jain, he thanked senior management and colleagues for their support during his tenure with the company.",
            "Sentiment": "neutral",
            "PublishDate": 1762382150783,
            "Source": "corporate_governance"
        },
        {
            "Title": "Arvind Fashions Reports Strong Q2 Performance with 26.7% Jump in Net Profit",
            "Summary": "Arvind Fashions delivered robust quarterly results with consolidated net profit rising to 375 million rupees from 296 million rupees year-over-year. Revenue increased to 14.17 billion rupees compared to 12.7 billion rupees in the same period last year. The company's EBITDA grew to 1.87 billion rupees from 1.6 billion rupees, while EBITDA margin improved to 13.21% from 12.75% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762156272429,
            "Source": "earnings"
        },
        {
            "Title": "Amisha Jain Takes Charge as MD & CEO of Arvind Fashions, Succeeding Shailesh Chaturvedi",
            "Summary": "Arvind Fashions Limited announced that Amisha Jain has taken charge as Managing Director and Chief Executive Officer, succeeding Shailesh Chaturvedi who stepped down effective September 30, 2025. The leadership transition was part of a planned succession strategy approved by the Board of Directors and announced on July 16, 2025. Jain joined the company on August 13, 2025, bringing over 25 years of experience across technology, consumer, and retail sectors. She previously held senior leadership positions at Levi Strauss & Co., Zivame, Nike India, and Arvind. Her appointment aligns with the company's strategic focus on strengthening operational excellence, brand equity, and digital transformation. Under Chaturvedi's leadership, Arvind Fashions navigated significant transformation and consolidation, positioning itself for sustainable profitability. The company operates as India's leading casual wear and denim company with a portfolio including brands like U.S. Polo Assn., Arrow, Tommy Hilfiger, Calvin Klein and Flying Machine.",
            "Sentiment": "positive",
            "PublishDate": 1759302738461,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shailesh Chaturvedi Steps Down as Managing Director and CEO of Arvind Fashions",
            "Summary": "Shailesh Chaturvedi has stepped down from his position as Managing Director and CEO of Arvind Fashions.",
            "Sentiment": "neutral",
            "PublishDate": 1759239159890,
            "Source": "corporate_governance"
        },
        {
            "Title": "Arvind Fashions Appoints Saikot Das as Chief Brand and Strategy Officer",
            "Summary": "Arvind Fashions Limited appointed Saikot Das as Chief Brand and Strategy Officer, effective August 19, 2025. Das brings over 13 years of experience in marketing and brand building, having previously served as Senior Director - Marketing & Brand Experience for South Asia, Middle East & Africa at Levi Strauss & Co., Senior Vice President – Marketing Head at Star TV Network (Star Plus), and Associate Director- Marketing at Colgate Palmolive. He holds an MBA in Sales & Marketing from Institute of Management Technology, Ghaziabad and a B.Tech. in Mechanical Engineering from National Institute of Technology Calicut. The appointment is classified as a Senior Management Personnel position with terms as per the company's employment policies.",
            "Sentiment": "positive",
            "PublishDate": 1755615112250,
            "Source": "corporate_governance"
        },
        {
            "Title": "Arvind Fashions Reports 16% Revenue Growth in Q1 FY26, Announces Leadership Transition",
            "Summary": "Arvind Fashions Limited reported strong quarterly results with revenue growth of 16% reaching Rs. 1,107 crores and EBITDA growth of 20% at Rs. 148 crores. The company announced Amisha Jain will join as new MD and CEO effective August 13, 2025, replacing Shailesh Chaturvedi who led the company for 19 years. Direct channels (retail and online B2C) now contribute nearly 60% of revenue, with retail growing 15% and like-to-like growth of 8.1%. The company added 40,000 square feet of retail space and increased advertising spend by 140 basis points. U.S. Polo Association grew over 20%, while Tommy Hilfiger and Calvin Klein delivered double-digit growth. Adjacent categories including kidswear, innerwear, and womenswear grew over 25% on average. Digital business crossed 25% share with improved profitability. PAT increased to Rs. 13 crores from Rs. 1 crore in the previous year. The company plans to open around 150 stores and targets medium-term revenue growth of 12-15%.",
            "Sentiment": "positive",
            "PublishDate": 1754292283572,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Fashions Sets Record Date for Rs 1.60 Final Dividend Payment",
            "Summary": "Arvind Fashions Limited has fixed August 12, 2025 as the record date for determining shareholder eligibility for a final dividend of Rs 1.60 per equity share for the financial year ended March 31, 2025. The dividend payment is subject to approval at the Annual General Meeting scheduled for August 26, 2025. Eligible shareholders will receive the dividend payment on or after August 31, 2025, following AGM approval.",
            "Sentiment": "positive",
            "PublishDate": 1754060766188,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind Fashions Reports 8.1% Like-To-Like Growth and 30%+ Online Sales Surge",
            "Summary": "Arvind Fashions achieved 8.1% like-to-like growth alongside a significant expansion in its digital presence, with online B2C sales rising by over 30%. The growth figures indicate strong performance across both traditional retail channels and the company's digital commerce platform.",
            "Sentiment": "positive",
            "PublishDate": 1753712872196,
            "Source": "stock"
        },
        {
            "Title": "Arvind Fashions Reports 16% Revenue Growth to ₹1,107 Crores in Q1 FY26",
            "Summary": "Arvind Fashions Limited reported revenue growth of 16% year-on-year to ₹1,107 crores in the first quarter ended June 30, 2025, compared to ₹955 crores in the same period last year. EBITDA increased by 20% to ₹148 crores from ₹123 crores, with margins improving by 50 basis points despite higher advertising spending. The company achieved strong performance across all channels, with retail channel growing approximately 15% supported by like-for-like growth of 8.1% and reduced discounting. Online direct-to-consumer business grew over 30% year-on-year, while the wholesale channel witnessed growth rebound with over 10% increase. The company added 29 new exclusive brand outlets with net square footage addition of approximately 38,000 square feet, bringing total EBO count to 987 stores. Adjacent categories showed strong growth of over 20% year-on-year. Net working capital days remained stable at 59 days with inventory turns continuing at approximately 4x. Profit after tax for continuing business increased to ₹13 crores from ₹1 crore in the previous year. The company aims for 12-15% revenue growth for the full year with plans to open approximately 150 stores through the franchise-owned franchise-operated route.",
            "Sentiment": "positive",
            "PublishDate": 1753711490232,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Fashions Projects 12-15% Revenue Growth in FY26",
            "Summary": "Arvind Fashions expects to achieve a 12-15% revenue increase in FY26. The projected growth is attributed to three key factors: expansion of its retail network, growth in related product categories, and strengthening direct sales channels.",
            "Sentiment": "positive",
            "PublishDate": 1753710981497,
            "Source": "stock"
        },
        {
            "Title": "Arvind Fashions Reports Strong Q1 Growth with Net Profit Surging to 126M Rupees",
            "Summary": "Arvind Fashions delivered robust quarterly results with revenue rising to 11.07 billion rupees from 9.55 billion rupees year-over-year. The company's consolidated net profit jumped significantly to 126 million rupees compared to 13 million rupees in the same period last year. EBITDA increased to 1.34 billion rupees from 1.15 billion rupees year-over-year, while EBITDA margin remained stable at 12.10% versus 12.1% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753708683024,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Fashions: Targets ₹500 Crore Footwear Sales, Double-Digit Growth",
            "Summary": "Arvind Fashions aims for early double-digit revenue growth and 100 bps margin improvement in FY26. The company targets ₹500 crore in footwear sales soon, with strong performance across categories. US Polo crossed ₹2,000 crore mark. The company plans higher marketing spends and expansion in adjacent segments.",
            "Sentiment": "positive",
            "PublishDate": 1747724851000,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Fashions Provides Positive Growth Guidance for FY26",
            "Summary": "Arvind Fashions has provided guidance for their future performance. The company expects higher percentage growth and improved profitability in FY26. They anticipate an uptick in revenue growth, better like-for-like growth, and higher square foot addition. For the upcoming year, the company expects growth rates to increase compared to FY25, while maintaining a focus on profitable growth. Additionally, their adjacent category is projected to grow by around 50% in the next year.",
            "Sentiment": "positive",
            "PublishDate": 1747712271000,
            "Source": "default"
        },
        {
            "Title": "Arvind Fashions Reports Q4 Net Loss of 931m Rupees",
            "Summary": "Arvind Fashions reported a consolidated net loss of 931 million rupees in Q4, compared to a profit of 243 million rupees in the same quarter last year. Revenue increased to 11.89 billion rupees from 11 billion rupees year-over-year. The company reported a deferred tax of 1.24 billion rupees. Profit before tax for Q4 was 664 million rupees, up from 536 million rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1747613542000,
            "Source": "default"
        },
        {
            "Title": "Arvind Fashions: Q4 Loss Despite Revenue Growth; Declares Dividend",
            "Summary": "Arvind Fashions reported a Q4 net loss of ₹93.15 crore, despite 8.8% YoY revenue growth to ₹1,189 crore. EBITDA rose 18% to ₹158.6 crore. The company declared a final dividend of ₹1.60 per share. ROCE improved to over 20%, up 400 bps YoY. Inventory turns remained at 4x, with net working capital days at 58.",
            "Sentiment": "neutral",
            "PublishDate": 1747483078000,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Fashions Reports Q4 Results with Mixed Performance",
            "Summary": "Arvind Fashions reported its Q4 financial results. The company's profit before tax increased to 664M rupees from 536M rupees year-over-year. EBITDA rose to 1.59B rupees from 1.35B rupees, with EBITDA margin improving to 13.4% from 12.35%. However, the company reported a consolidated net loss of 931M rupees compared to a profit of 243M rupees in the same quarter last year. Revenue increased to 11.89B rupees from 11B rupees. The company also reported a deferred tax of 1.24B rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1747480292000,
            "Source": "result"
        },
        {
            "Title": "Arvind Fashions: Q4 Loss Despite Revenue Growth",
            "Summary": "Arvind Fashions reported a Q4 standalone net loss of Rs17 crore, a 192% YoY decline, despite 13.7% YoY revenue growth to Rs150 crore. FY25 saw net profit of Rs37.8 crore, up from FY24 losses. Revenue grew 9.3% YoY to Rs665.9 crore. The company achieved ROCE over 20%, focusing on profitable growth, womenswear, innerwear, and reduced discounting.",
            "Sentiment": "neutral",
            "PublishDate": 1747479737000,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Fashions to Consider Q4 Results on May 17",
            "Summary": "Arvind Fashions Limited has announced that it will consider its fourth quarter (Q4) financial results on May 17. This indicates that the company is preparing to release its earnings report for the latest fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746794863000,
            "Source": "default"
        },
        {
            "Title": "Arvind Fashions Plans Nationwide Expansion of Club A Stores",
            "Summary": "Arvind Fashions has announced its intention to expand its Club A store network across India. Club A is likely a retail format or brand under Arvind Fashions' portfolio. This expansion strategy suggests the company is looking to increase its market presence and potentially boost sales through a wider geographical reach.",
            "Sentiment": "positive",
            "PublishDate": 1741651373000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind Fashions Plans Expansion of Club A Stores Across India",
            "Summary": "Arvind Fashions has announced its intention to expand its Club A store network throughout India. Club A is likely one of the company's retail brands, and this expansion plan suggests a strategic move to increase its market presence and potentially boost sales in the Indian fashion retail sector.",
            "Sentiment": "positive",
            "PublishDate": 1741616765000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind Fashions Ltd: Q3 Profit Surges 60%, Revenue Grows 7%",
            "Summary": "Arvind Fashions reported Q3 FY25 net profit from continuing operations up 60% YoY to ₹48 crore. Revenue grew 7% to ₹1,203 crore. EBITDA increased 15% to ₹165 crore, with margin expanding to 13.7%. Stock rose 3% following results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1738743263000,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Fashions MD Highlights Brand Scaling Strategy and Commitment to Profitable Growth",
            "Summary": "The Managing Director of Arvind Fashions has stated that the company's focus on scaling existing brands is helping them gain market share. The company plans to maintain its commitment to profitable growth and generate higher Return on Capital Employed (ROCE) moving forward.",
            "Sentiment": "positive",
            "PublishDate": 1738742230000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Arvind Fashions Reports Improved Q3 EBITDA and Margin",
            "Summary": "Arvind Fashions has reported a year-over-year increase in its Q3 EBITDA, rising from 1.43 billion rupees to 1.65 billion rupees. The company's EBITDA margin also improved, increasing from 11.45% to 13.72% compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738740882000,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Fashions Reports Q3 Revenue Growth",
            "Summary": "Arvind Fashions has reported a revenue of 12 billion rupees for the third quarter, compared to 11 billion rupees in the same period last year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738740875000,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Fashions Reports Decrease in Q3 Consolidated Net Profit",
            "Summary": "Arvind Fashions Limited has reported a consolidated net profit of 267 million rupees for the third quarter, down from 511 million rupees in the same period last year. This represents a significant year-over-year decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1738740837000,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Fashions to Consider Q3 Results",
            "Summary": "Arvind Fashions Limited has announced that it will consider its third quarter (Q3) financial results on February 5. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737982814000,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Fashions Provides Guidance on Arrow Brand Performance",
            "Summary": "Arvind Fashions has provided guidance for its Arrow brand, expecting a mid-single digit EBITDA profile with potential to exceed this target. The company also anticipates reaching its goal of 1.5 lakh square feet of retail space in the current year.",
            "Sentiment": "positive",
            "PublishDate": 1730258203000,
            "Source": "normal_news"
        },
        {
            "Title": "Arvind Fashions Expects Strong Growth from Arrow and Flying Machine Brands",
            "Summary": "During a conference call, Arvind Fashions announced that it anticipates faster growth from its Arrow and Flying Machine brands compared to its other three brands. The company has set an ambitious revenue target of ₹2000 crore for these two brands.",
            "Sentiment": "positive",
            "PublishDate": 1730258153000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind Fashions Targets EBITDA Margin Improvement",
            "Summary": "Arvind Fashions aims to increase its EBITDA margin by 100 basis points annually for the next three years. The company expects to maintain an EBITDA margin between 13% and 13.5% in the current quarter, as stated in a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1730257974000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind Fashions Reports Improved Q2 Financial Performance",
            "Summary": "Arvind Fashions has announced its Q2 financial results, showing an increase in EBITDA to 1.6 billion rupees from 1.4 billion rupees year-over-year. The company's EBITDA margin also improved to 12.75% from 11.83% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730122506000,
            "Source": "result"
        },
        {
            "Title": "Arvind Fashions Reports Q2 Revenue Growth",
            "Summary": "Arvind Fashions has reported a revenue of 12.7 billion rupees for the second quarter, compared to 11.7 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730122492000,
            "Source": "result"
        },
        {
            "Title": "Arvind Fashions Reports Q2 Profit Growth",
            "Summary": "Arvind Fashions has reported a consolidated net profit of 296 million rupees for the second quarter, showing an increase from 217 million rupees year-over-year. The profit also improved significantly from 13.2 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730122482000,
            "Source": "result"
        }
    ]
}