{
    "Symbol": "ARVIND",
    "ISIN": "INE034A01011",
    "News": [
        {
            "Title": "Arvind Limited Pays ₹8.14 Lakh Fine for Board Compliance",
            "Summary": "Arvind Limited's board addressed non-compliance with SEBI regulations during Q2 FY26, paying ₹4.07 lakh each to BSE and NSE for delayed independent director appointment.",
            "Sentiment": "neutral",
            "PublishDate": 1769760621344,
            "Source": "stocks"
        },
        {
            "Title": "Arvind Reports Q3 Net Profit Decline to ₹980M",
            "Summary": "Arvind Limited's consolidated net profit decreased to ₹980 million in Q3 from ₹1.03 billion in the same quarter last year, marking a year-on-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1769757389770,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arvind Limited Incorporates UAE Step-Down Subsidiary",
            "Summary": "Arvind Limited announces incorporation of Arvind PD International FZ-LLC in UAE through step-down subsidiary Arvind PD Composites Private Limited for fibre glass products manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1769611285198,
            "Source": "stocks"
        },
        {
            "Title": "Arvind Fashions Q3 Net Profit Drops to ₹260M",
            "Summary": "Arvind Fashions reported consolidated net profit of ₹260 million in Q3, down from ₹267 million in the same quarter previous year, marking a year-on-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1769585432046,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arvind Limited Schedules Q3FY26 Results Call Jan 30",
            "Summary": "Arvind Limited announces post-results conference call on January 30, 2026 at 15:00 Hours IST to discuss Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769245655417,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arvind Limited's Company Secretary Steps Down",
            "Summary": "Krunal Bhatt resigned as Company Secretary and Compliance Officer of Arvind Limited, effective January 12, 2026, to pursue career opportunities outside the organization.",
            "Sentiment": "neutral",
            "PublishDate": 1768221439311,
            "Source": "stocks"
        },
        {
            "Title": "Arvind Limited MD Susheel Kaul Resigns",
            "Summary": "Arvind Limited's Managing Director Susheel Kaul has resigned due to personal reasons, with Vice Chairman Punit Lalbhai set to take over responsibilities from April 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767950231304,
            "Source": "stocks"
        },
        {
            "Title": "SC Grants Bail to Amtek's Arvind Dham in ₹27,000 Cr Case",
            "Summary": "Supreme Court overturns Delhi HC decision, grants bail to former Amtek Group chairman in money laundering case linked to alleged ₹27,000 crore bank fraud involving systematic financial manipulation.",
            "Sentiment": "neutral",
            "PublishDate": 1767681631434,
            "Source": "stocks"
        },
        {
            "Title": "Arvind Limited announces Company Secretary resignation",
            "Summary": "Arvind Limited's Company Secretary & Compliance Officer Mr. Krunal Bhatt has tendered his resignation effective December 30, 2025, to pursue career opportunities outside the organization.",
            "Sentiment": "neutral",
            "PublishDate": 1767100970423,
            "Source": "stocks"
        },
        {
            "Title": "Arvind Smartspaces Gets New CEO, Targets 30-35% Growth",
            "Summary": "Priyansh Kapoor appointed as new CEO of Arvind Smartspaces with management targeting 30-35% pre-sales growth for FY26, backed by ₹3,000 crore project pipeline in H2FY26.",
            "Sentiment": "positive",
            "PublishDate": 1766757114257,
            "Source": "stocks"
        },
        {
            "Title": "Arvind Limited Announces Leadership Transition",
            "Summary": "Punit Lalbhai to lead textiles and apparel business from April 2026 as part of succession plan. Susheel Kaul to continue as MD focusing on strategic projects.",
            "Sentiment": "neutral",
            "PublishDate": 1766054843978,
            "Source": "stocks"
        },
        {
            "Title": "Arvind Smartspaces Launches ₹550 Cr Bengaluru Project",
            "Summary": "Arvind Smartspaces announces the launch of a new real estate project in Bengaluru with a total value of ₹5.50 billion, marking the company's continued expansion in the southern market.",
            "Sentiment": "positive",
            "PublishDate": 1765805426295,
            "Source": "stocks"
        },
        {
            "Title": "India Ratings Assigns IND AA/Stable Rating to Arvind Advanced Materials' INR 5,850 Million Bank Loan Facilities",
            "Summary": "India Ratings assigned IND AA/Stable/IND A1 rating to Arvind Advanced Materials Limited's bank loan facilities worth INR 5,850 million, reflecting strong strategic and operational linkages with parent company Arvind Limited. The rating is supported by the parent's healthy business profile, comfortable financial metrics, and AAML's high value-added product portfolio with EBITDA margins of 14.34%.",
            "Sentiment": "positive",
            "PublishDate": 1764936058903,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind Smartspaces Launches Premium High-Rise Project in Ahmedabad Worth Rs. 400 Crore",
            "Summary": "Arvind Smartspaces has added a new premium residential high-rise project in Ahmedabad to its portfolio. The project has a top-line revenue potential of Rs. 400 crore, expanding the company's presence in the premium residential segment.",
            "Sentiment": "positive",
            "PublishDate": 1764547008169,
            "Source": "stock"
        },
        {
            "Title": "Arvind Limited Faces Rs 6.9 Lakh Fine for Board Composition Non-Compliance",
            "Summary": "Arvind Limited received fines totaling Rs 6.9 lakh from BSE and NSE for non-compliance with board composition regulations under Regulation 17(1) of SEBI listing requirements. The company has appointed Gokul Murgesh Jayakrishna as Independent Director effective September 8, 2025, to restore compliance and stated the violation has no material impact on its financials.",
            "Sentiment": "negative",
            "PublishDate": 1764403114645,
            "Source": "corporate_governance"
        },
        {
            "Title": "Arvind Limited Grants 1.5 Lakh Stock Options to Employees Under ESOP Scheme",
            "Summary": "Arvind Limited's Nomination and Remuneration Committee approved the grant of 1,50,000 stock options to eligible employees under the Employees Stock Option Scheme-2021 through a circular resolution. The stock options are granted under Grant-November 2025 and comply with SEBI regulations, with a 3-year exercise period from the vesting date.",
            "Sentiment": "positive",
            "PublishDate": 1763991947108,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind Limited Shareholders Approve Executive Remuneration and Independent Director Appointment Through Postal Ballot",
            "Summary": "Arvind Limited announced the results of its postal ballot conducted through e-voting, with all five special resolutions being approved by shareholders with requisite majority. The resolutions included the appointment of Mr. Gokul Mrugesh Jaykrishna as an Independent Director, and approval of annual remuneration payments to three executive directors who are part of the promoter group - Chairman Mr. Sanjay Lalbhai, Vice Chairman Mr. Punit Lalbhai, and Vice Chairman Mr. Kulin Lalbhai. Additionally, shareholders approved the aggregate annual remuneration to executive directors who are promoters or members of the promoter group. The e-voting period ran from October 9 to November 7, 2025, with the resolutions deemed passed on November 7, 2025. The postal ballot notice was dated September 8, 2025, and the cut-off date for voting rights was October 3, 2025. All resolutions received over 92% approval from the votes polled, with promoter and promoter group showing 100% support across all resolutions.",
            "Sentiment": "positive",
            "PublishDate": 1762795873594,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind Ltd Adopts Multi-Pronged Strategy to Counter US Tariff Impact",
            "Summary": "Arvind Ltd reported that India faces a disadvantageous position due to US tariffs reaching 50% in the first quarter, the highest among competing markets. The garment manufacturer has implemented a strategy involving supply chain realignment, expansion into non-US markets, and cost optimization to navigate the tariff regime. Despite tariff pressures compressing margins, the company delivered a good second quarter performance attributed to marquee clients and product diversification. Vice Chairman Punit Lalbhai indicated that tariff mitigation measures are progressing well, with expected improvements in cost position through efficiencies. The company emphasized maintaining strong customer relationships while implementing structural cost savings to offset tariff impacts.",
            "Sentiment": "neutral",
            "PublishDate": 1762533359557,
            "Source": "stock"
        },
        {
            "Title": "Arvind Expects Mid-Teen Garment Volume Growth from Capacity Expansion",
            "Summary": "Arvind anticipates garment volume growth in the mid-teens range due to increased capacity. The company expects this growth trajectory as a result of its expanded manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1762502439939,
            "Source": "stock"
        },
        {
            "Title": "Arvind Expects ₹25-30 Crore EBITDA Hit from US Tariffs on Direct Business Operations",
            "Summary": "Arvind anticipates that tariffs will impact certain direct business segments in the USA. The company estimates this will result in an EBITDA impact of ₹25-30 crores for the quarter. The tariffs are expected to affect specific portions of the company's direct business operations in the US market.",
            "Sentiment": "negative",
            "PublishDate": 1762502077318,
            "Source": "stock"
        },
        {
            "Title": "Arvind Limited Reports Mixed Q2 Results with Profit Growth Amid Advanced Materials Unit Demerger",
            "Summary": "Arvind Limited announced quarterly results for the period ended September 30, 2025. The company reported revenue from operations of ₹1,801.78 crores for the quarter compared to ₹1,670.27 crores in the same period last year. Profit from continuing operations reached ₹75.93 crores versus a loss of ₹24.68 crores in the previous year quarter. The National Company Law Tribunal sanctioned the demerger of the Advanced Materials Undertaking to wholly-owned subsidiary Arvind Advanced Materials Limited, effective September 1, 2025. This business unit generated ₹293.87 crores in revenue and ₹21.52 crores in profit after tax for the quarter, now classified as discontinued operations. For the half-year period, total revenue stood at ₹3,307.02 crores compared to ₹3,063.13 crores last year. The company's operations at the Santej plant were previously affected by worker strikes but have since normalized. Earnings per share from continuing operations was ₹3.03 for the quarter. The company is monitoring potential impacts from US government tariff impositions and evaluating mitigation strategies.",
            "Sentiment": "positive",
            "PublishDate": 1762502049559,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Reports Strong Q2 Growth with Revenue Rising to 23.7B Rupees",
            "Summary": "Arvind reported quarterly revenue of 23.7 billion rupees, up from 21.9 billion rupees in the same period last year. The company's consolidated net profit increased significantly to 1.03 billion rupees compared to 597 million rupees year-over-year. EBITDA grew to 2.47 billion rupees from 2.2 billion rupees, while EBITDA margin improved to 10.42% from 10.1% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762501195599,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Fashions Expects Medium-Term Growth from GST Rate Cuts, Reports Strong Quarterly Results",
            "Summary": "Arvind Fashions Vice Chairman Kulin Lalbhai stated that the apparel sector will see gradual benefits from recent GST rate cuts rather than immediate gains. The company, which owns brands like Flying Machine, Arrow and Tommy Hilfiger, expects medium-term demand growth as fashion becomes more affordable. GST rates were reduced to 5% for items under Rs 2,500, covering 60% of Arvind Fashions' sales. The company is expanding through direct channels, with retail stores contributing 45-50% of revenue and online sales growing 50% in the quarter. Arvind Fashions plans to open 150,000 square feet of retail space and has already opened 60 new stores. The company reported quarterly revenue of Rs 1,418 crore, up 11.3% year-on-year, with EBITDA rising 18% to Rs 200 crore and net profit increasing 27% to Rs 38 crore. Return on capital employed stands at 23%, exceeding the 20% target.",
            "Sentiment": "positive",
            "PublishDate": 1762409686657,
            "Source": "stock"
        },
        {
            "Title": "Arvind Smartspaces Reports Sharp Decline in Q2 Financial Performance",
            "Summary": "Arvind Smartspaces reported consolidated net profit of 141.8 million rupees for Q2, down from 407 million rupees in the same period last year. Revenue fell to 1.45 billion rupees compared to 2.66 billion rupees year-over-year. EBITDA decreased to 295.2 million rupees from 659.7 million rupees, while EBITDA margin compressed to 21.01% from 24.84% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762215622978,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Fashions Reports 25% Profit Growth in Q2, Shares Jump 6%",
            "Summary": "Arvind Fashions reported net profit of ₹37.5 crore for the July-September quarter, marking a 25% increase from ₹30 crore in the same period last year. Revenue grew 11% to ₹1,418 crore from ₹1,273 crore. EBITDA rose 16% to ₹188 crore with operating margins expanding to 13.3% from 12.7%. The company achieved 8.3% like-to-like growth in direct channels and over 50% expansion in online B2C segment. Net working capital days stood at 60 days with stable inventory turnover. Managing Director Amisha Jain highlighted the company's focus on marquee brands, direct channel strategy, and retail expansion. Following the results announcement, shares surged to an intraday high of ₹539 and were trading up 6.1% at ₹533.50.",
            "Sentiment": "positive",
            "PublishDate": 1762158858125,
            "Source": "earnings"
        },
        {
            "Title": "Arvind SmartSpaces Partners for Rs 700 Crore Housing Project in Vadodara",
            "Summary": "Arvind SmartSpaces Ltd has formed a partnership to develop a housing project in Vadodara with estimated revenue exceeding Rs 700 crore. The joint development represents the company's entry into Vadodara's residential market through a large-scale horizontal development project. This marks the company's 23rd project in Gujarat, aligning with its expansion strategy in high-potential markets. CEO Priyansh Kapoor stated the company plans to add new projects across Gujarat, Bengaluru, and Mumbai Metropolitan Region for the remainder of the year. Arvind SmartSpaces is part of the Lalbhai Group and operates as a leading real estate developer.",
            "Sentiment": "positive",
            "PublishDate": 1761730007769,
            "Source": "stock"
        },
        {
            "Title": "Arvind Fashions Shares Drop as MD and CEO Shailesh Chaturvedi Resigns",
            "Summary": "Arvind Fashions shares declined after MD and CEO Shailesh Chaturvedi resigned citing personal reasons, effective from September 30, 2025. Chaturvedi stepped down from his positions as MD, CEO, director, and board committee member. The company has not announced a replacement. Arvind Fashions reported 16% revenue growth in the June quarter, its highest in three years, driven by marketing investments, product differentiation, and retail expansion. Margins remained steady at 12%. The company targets 12-15% revenue growth this year through stronger brand positioning and operational improvements. Shares traded 1.2% lower at ₹521.8, though the stock has gained 36.3% over six months.",
            "Sentiment": "negative",
            "PublishDate": 1759291471901,
            "Source": "corporate_governance"
        },
        {
            "Title": "Arvind Limited Inaugurates India's First Supercritical CO₂ Dyeing Machine in Partnership with H&M Group and Deven Supercriticals",
            "Summary": "Arvind Limited inaugurated India's first supercritical CO₂ dyeing machine at its Ahmedabad facility in collaboration with H&M Group and Deven Supercriticals. The technology, patented under the SUPRAUNO® brand, uses supercritical carbon dioxide instead of water for fabric dyeing. At commercial scale, it delivers up to 76% water savings, approximately 67% energy savings, and around 90% reduction in chemical usage compared to conventional dyeing methods. The three-way partnership combines Deven Supercriticals' innovation, Arvind's industrial deployment capabilities, and H&M Group's sustainability support. The Ministry of Textiles has supported the initiative, which aligns with the Government of India's vision for a sustainable textile sector. The technology can dye various fabrics including cotton, polyester, nylon, viscose, silk, linen, acrylic, and their blends while eliminating the need for salt in cotton dyeing and reducing batch times.",
            "Sentiment": "positive",
            "PublishDate": 1757422764143,
            "Source": "stock"
        },
        {
            "Title": "Arvind Limited Receives NCLT Approval for Advanced Material Undertaking Transfer to Subsidiary",
            "Summary": "Arvind Limited has received approval from the National Company Law Tribunal (NCLT) Ahmedabad Bench for its Scheme of Arrangement involving the slump sale of its Advanced Material Undertaking to wholly owned subsidiary Arvind Advanced Materials Limited. The NCLT sanctioned the scheme through an order dated August 7, 2025, which was uploaded on the tribunal's official website on August 8, 2025. The scheme will become effective once the certified copy of the NCLT order is filed with the Registrar of Companies.",
            "Sentiment": "positive",
            "PublishDate": 1754660331481,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind Executive Expects UK Free Trade Deal to Double Company Revenue",
            "Summary": "A company executive from Arvind stated that a UK free trade deal is expected to double the company's revenue. The executive expressed optimism about the potential impact of the trade agreement on the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1753785875093,
            "Source": "stock"
        },
        {
            "Title": "Arvind Limited Approves Quarterly Results and Appoints New Internal Auditor",
            "Summary": "Arvind Limited's Board of Directors approved the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The board also appointed Mr. Jigar Patel as the company's Internal Auditor effective July 29, 2025. Mr. Patel is a Chartered Accountant with over 15 years of experience in internal audit, risk management, compliance, and internal controls. He previously worked at Gujarat Tea Processors & Packers Ltd and held leadership roles with KPMG India and BDO India across various industries including FMCG, retail, industrial manufacturing, oil & gas, and chemicals.",
            "Sentiment": "neutral",
            "PublishDate": 1753777327522,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind Limited Reports Q1 FY26 Results with 10% Revenue Growth and Appoints New Internal Auditor",
            "Summary": "Arvind Limited announced quarterly results with consolidated revenue of ₹2,006 crores (10% growth) and EBITDA of ₹186 crores (14% growth) with 9.3% margin. The textile company reported profit after tax of ₹53 crores, representing 35% growth. The garmenting division achieved its highest quarterly revenue of ₹485 crores with 18% growth and produced 9.8 million pieces. Advanced Materials Division secured a ₹200 crore order for the Vande Bharat train program executable over 5 years. However, the company faced margin pressure from higher input costs, air freight expenses, and US tariff-related disruptions. The Board also appointed Mr. Jigar Patel as Internal Auditor. Management expects stronger performance in the second half with garment volumes projected to grow 14-17% in FY26 and planned capital investments of ₹450-475 crores.",
            "Sentiment": "positive",
            "PublishDate": 1753776377561,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Projects Double-Digit Growth for Garment and AMD Divisions in Second Half",
            "Summary": "Arvind expects improved performance with its garment and AMD (Advanced Materials Division) sectors projected to deliver double-digit growth in the second half. The company also anticipates margin improvements across these business segments.",
            "Sentiment": "positive",
            "PublishDate": 1753775919584,
            "Source": "stock"
        },
        {
            "Title": "Arvind Reports Strong Q1 Performance with 35% Jump in Net Profit",
            "Summary": "Arvind delivered robust Q1 results with consolidated net profit rising to 532 million rupees from 393 million rupees year-over-year, marking a 35% increase. Revenue grew to 20 billion rupees compared to 18.3 billion rupees in the same period last year. The company's EBITDA improved to 1.8 billion rupees from 1.5 billion rupees, while EBITDA margin expanded to 8.84% from 8.18% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1753775004463,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Fashions Reports Mixed Results with Standalone Loss of Rs 23 Crore Despite Consolidated Profit Growth",
            "Summary": "Arvind Fashions Ltd reported contrasting performance in the June quarter, with standalone net losses increasing fourfold to Rs 22.9 crore amid a 13.5% decline in standalone revenue to Rs 118.2 crore. However, on a consolidated basis, the company posted net profit of Rs 13 crore compared to Rs 1 crore in the previous year, with consolidated revenue jumping 16% to Rs 1,107 crore. The company's online channel grew over 30%, with its contribution increasing from 13% to 15%. Managing director Shailesh Chaturvedi attributed the consolidated revenue growth to increased marketing investments to strengthen brand awareness and footfalls, along with market share gains. The company plans to focus on its direct channel strategy to improve profitability and return on capital employed. Arvind Fashion shares closed down 0.1% at Rs 499.45 on BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1753720432185,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Expects Temporary Performance Dip, Hesitant to Provide Specific Guidance",
            "Summary": "Arvind anticipates its performance to be 'reasonably lower' compared to its normal trajectory, though this is expected to be temporary. The company beat its Q4 guidance, which was in the mid-teens. Arvind is hesitant to provide specific guidance due to ongoing discussions and uncertainty, preferring to wait until the situation becomes clearer. Temporary margin pressure is expected in the first and second quarters, but margins are anticipated to normalize three to four months into the new year. Despite these challenges, the company remains optimistic about the future, with a positive growth and demand outlook.",
            "Sentiment": "neutral",
            "PublishDate": 1747366478000,
            "Source": "default"
        },
        {
            "Title": "Arvind Ltd: Q4 Profit Jumps 48%, FY26 Guidance Delayed",
            "Summary": "Arvind Ltd reported a 48% increase in Q4 net profit to ₹155 crore. Revenue grew 7% to ₹2,220.7 crore. EBITDA margins contracted to 11%. The company delayed FY26 guidance due to market uncertainty. A final dividend of ₹3.75 per share was recommended.",
            "Sentiment": "neutral",
            "PublishDate": 1747301195000,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Limited Delays FY26 Guidance Due to Market Uncertainty",
            "Summary": "Arvind Limited has stated that due to prevailing market uncertainty, it is premature to provide financial guidance for the fiscal year 2026. The company is exercising caution in making forward-looking statements, likely due to unpredictable economic conditions or industry-specific challenges.",
            "Sentiment": "neutral",
            "PublishDate": 1747295735000,
            "Source": "default"
        },
        {
            "Title": "Arvind Reports Q4 Results and Declares Dividend",
            "Summary": "Arvind has announced its Q4 financial results and declared a dividend. The company's Q4 consolidated net profit increased to 1.5 billion rupees from 990 million rupees year-over-year. Revenue rose to 22.2 billion rupees from 20.7 billion rupees. EBITDA slightly increased to 2.45 billion rupees from 2.4 billion rupees, while EBITDA margin decreased to 11.1% from 11.7%. Additionally, Arvind declared a dividend of 3.75 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747295139000,
            "Source": "result"
        },
        {
            "Title": "Arvind Invests in Torrent Green Energy Subsidiary",
            "Summary": "Arvind Limited has executed a share subscription agreement with Torrent Green Energy's subsidiary, TUPL. Arvind will invest up to 210 million rupees for a 15.96% equity stake in TUPL.",
            "Sentiment": "positive",
            "PublishDate": 1747046928000,
            "Source": "default"
        },
        {
            "Title": "Arvind Limited Incorporates New Subsidiary",
            "Summary": "Arvind Limited has announced the incorporation of a new subsidiary named Arvind New Technologies. This move suggests the company is expanding its operations into new technological areas.",
            "Sentiment": "neutral",
            "PublishDate": 1743765605000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind Limited Projects Growth and Margin Improvement for FY 2025-26",
            "Summary": "Arvind Limited has announced its expectation to maintain growth momentum in the fiscal year 2025-26. The company aims to improve its profit margins and is targeting a Return on Capital Employed (ROCE) of over 20%. This projection indicates the company's confidence in its future performance and strategic direction.",
            "Sentiment": "positive",
            "PublishDate": 1738051206000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind Limited Reports Significant Increase in Q3 EBITDA and Margin",
            "Summary": "Arvind Limited has announced its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) has increased substantially to 5.07 billion rupees, compared to 2.16 billion rupees in the same quarter of the previous year. Additionally, the EBITDA margin has improved significantly, rising to 24.27% from 11.45% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738050219000,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Limited Reports Q3 Revenue Increase",
            "Summary": "Arvind Limited has announced its third quarter revenue results. The company reported revenue of 20.9 billion rupees, compared to 19 billion rupees in the same quarter of the previous year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738050217000,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Limited Reports Increased Q3 Consolidated Net Profit",
            "Summary": "Arvind Limited has announced its financial results for the third quarter. The company's consolidated net profit rose to 1.03 billion rupees, up from 917 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738050164000,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Ltd Projects 20% Volume Growth for H2 FY25",
            "Summary": "Arvind Limited has provided guidance for the second half of fiscal year 2025, expecting its AMD (Advanced Material Division) to perform well and achieve a volume growth of 20% on a run rate basis.",
            "Sentiment": "positive",
            "PublishDate": 1730100888000,
            "Source": "normal_news"
        },
        {
            "Title": "Arvind Ltd Expects Strong Performance in Textile Division for H2 FY25",
            "Summary": "Arvind Ltd has provided guidance for the second half of fiscal year 2025, indicating that its textile division has a robust orderbook. The company anticipates this division to perform well in H2 FY25 based on the current order situation.",
            "Sentiment": "positive",
            "PublishDate": 1730100853000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind Reports Q2 FY2024 Financial Results",
            "Summary": "Arvind Limited has announced its financial results for the second quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 2.22 billion rupees, up from 2.05 billion rupees in the same quarter last year. However, the EBITDA margin decreased to 10.15% from 10.72% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730100405000,
            "Source": "result"
        },
        {
            "Title": "Arvind Reports Q2 Revenue Growth",
            "Summary": "Arvind Limited has reported a revenue of 21.9 billion rupees for the second quarter, compared to 19.2 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730100267000,
            "Source": "result"
        },
        {
            "Title": "Arvind Reports Q2 Net Profit Decline",
            "Summary": "Arvind Limited, an Indian textile manufacturer, has reported a consolidated net profit of 597 million rupees for the second quarter, down from 800 million rupees in the same period last year. This represents a year-over-year decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1730100248000,
            "Source": "result"
        }
    ]
}