{
    "Symbol": "ARVSMART",
    "ISIN": "INE034S01021",
    "News": [
        {
            "Title": "Arvind SmartSpaces Q3 FY26 Earnings Call Feb 11",
            "Summary": "Arvind SmartSpaces announces earnings call on February 11, 2026 at 12:30 PM IST to discuss Q3 & 9M FY26 results with senior management participation including Vice Chairman and MD.",
            "Sentiment": "neutral",
            "PublishDate": 1770294310072,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ketan Patel Increases Stake in Arvind Smartspaces",
            "Summary": "Ketan Ratilal Patel acquired 2,000 shares of Arvind Smartspaces through open market purchase, increasing his total holding to 5.69% along with PAC Krishna Ketan Patel.",
            "Sentiment": "neutral",
            "PublishDate": 1769073168473,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arvind SmartSpaces Acquires New Bengaluru Project",
            "Summary": "Arvind SmartSpaces adds new residential high-rise project in Whitefield, Bengaluru with top-line potential of ₹550 crore across 4.18 acres and 4.6 lakh sq.ft. saleable area.",
            "Sentiment": "positive",
            "PublishDate": 1765805512103,
            "Source": "stocks"
        },
        {
            "Title": "Arvind SmartSpaces Grants 1 Lakh Stock Options",
            "Summary": "Arvind SmartSpaces Limited granted 1,00,000 stock options to eligible employees under Grant-January 2026 pursuant to ESOP-2016, with exercise price set at ₹587.05 per share.",
            "Sentiment": "positive",
            "PublishDate": 1765443553711,
            "Source": "stocks"
        },
        {
            "Title": "Arvind Smartspaces Acquires Premium High-Rise Project in Ahmedabad with ₹400 Crore Revenue Potential",
            "Summary": "Arvind Smartspaces purchased a new premium high-rise project in Ahmedabad's Vastrapur area featuring 3.6 lakh sq. ft. saleable area and ₹400 crore revenue potential. The company's CEO expects to add more projects in Gujarat, Bengaluru and MMR regions during the year.",
            "Sentiment": "positive",
            "PublishDate": 1764403880927,
            "Source": "stock"
        },
        {
            "Title": "Arvind SmartSpaces Reports Mixed Q2 Performance with Strong Launch Success",
            "Summary": "Arvind SmartSpaces reported quarterly results with bookings of Rs. 432 crore versus Rs. 464 crore in the previous year, though sequential growth was 147%. Revenue declined to Rs. 140 crore from Rs. 266 crore year-on-year, while EBITDA dropped to Rs. 31 crore from Rs. 83 crore. The company achieved strong success with its Arvind Everland project launch in Mankol, selling 954 units worth Rs. 400 crore, representing 82% of launched inventory. The company maintains a debt-free balance sheet with negative net debt of Rs. 32 crore and generated operating cash flows of Rs. 125 crore. Management announced plans for 4-5 project launches in the second half, targeting Rs. 3,000 crore of inventory to market. The company added two new CXO positions and entered the Vadodara market with a Rs. 700 crore project. Collections stood at Rs. 236 crore compared to Rs. 263 crore in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762774281551,
            "Source": "earnings"
        },
        {
            "Title": "Kulin Lalbhai Elevated as Chairman of Arvind SmartSpaces as Sanjay Lalbhai Steps Down",
            "Summary": "Arvind SmartSpaces Limited announced that Sanjay Lalbhai stepped down from his position as Chairman and Non-Executive Director effective November 3, 2025, as part of the company's succession planning process. Kulin Lalbhai, who was serving as Vice Chairman, has been appointed as the new Chairman of the company. Sanjay Lalbhai cited ensuring continuity in leadership and sustained organizational growth as reasons for his decision to step down. He expressed confidence in the new leadership's ability to guide the company through its next phase of growth. Kulin Lalbhai acknowledged his father's vision and mentorship in making Arvind SmartSpaces one of the fastest growing companies in the real estate space. The company, established in 2008 and built on the 120-year legacy of the Lalbhai Group, has approximately 108 million square feet of real estate development across the country with projects in Ahmedabad, Gandhinagar, Bengaluru, MMR and Pune.",
            "Sentiment": "positive",
            "PublishDate": 1762527167490,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ketan Ratilal Patel Acquires Additional Shares in Arvind Smartspaces",
            "Summary": "Ketan Ratilal Patel acquired 10,000 equity shares of Arvind Smartspaces Ltd through open market purchase on November 6, 2025. The acquisition increased his shareholding from 25,87,701 shares (5.64%) to 25,97,701 shares (5.66%) of the company's total voting capital. The shares were purchased as equity shares carrying voting rights. Arvind Smartspaces has a total equity share capital of 4,58,66,979 shares, which remained unchanged after this acquisition. The acquirer does not belong to the promoter/promoter group and is not acting in concert with any other parties.",
            "Sentiment": "neutral",
            "PublishDate": 1762505082292,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind Smart Spaces Reports 147% QoQ Growth in Bookings, Launches New Projects in Gujarat",
            "Summary": "Arvind Smart Spaces Limited announced its financial results for the quarter and half year ended September 30, 2025. The company reported bookings of Rs. 432 crores in Q2 FY26, marking a 147% quarter-on-quarter increase, while collections stood at Rs. 236 crores, up 23% QoQ. For the half year, bookings reached Rs. 607 crores and collections totaled Rs. 427 crores. Revenue from operations was Rs. 140 crores in Q2 and Rs. 242 crores for H1. The company maintains a negative net debt position of Rs. (32) crores as of September 30, 2025. Arvind Smart Spaces launched Arvind Everland at Mankol, Sanand, achieving sales bookings of 954 units worth Rs. 400 crores during the quarter, representing 82% of launched inventory. The company recently entered Vadodara with a Rs. 700 crore horizontal township project spread over 98 acres under a joint development model with 68% revenue share. Net operating cash flows increased 368% QoQ and 4% YoY to Rs. 125 crores in Q2 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1762187330444,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Smartspaces Targets Growth with ₹700-Crore Baroda Township and ₹3,124-Crore Revenue Pipeline",
            "Summary": "Arvind Smartspaces is pursuing large-scale growth through the launch of a ₹700-crore Baroda township project. The company has a development pipeline spanning Gujarat, Bengaluru, and MMR regions, with ₹3,124 crore in unrecognized revenue. The company is focusing on adding new projects and generating robust cash flow to support sustainable scalability.",
            "Sentiment": "positive",
            "PublishDate": 1762181799467,
            "Source": "stock"
        },
        {
            "Title": "Arvind Smartspaces Reports 65% Decline in Q2 Net Profit",
            "Summary": "Arvind Smartspaces reported Q2 consolidated net profit of 141.8 million rupees, down from 407 million rupees in the same quarter last year. Revenue fell to 1.45 billion rupees from 2.66 billion rupees year-over-year. EBITDA decreased to 295.2 million rupees compared to 659.7 million rupees in the previous year, while EBITDA margin contracted to 21.01% from 24.84%.",
            "Sentiment": "negative",
            "PublishDate": 1762171220673,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Smart Spaces Reports Leadership Changes and Quarterly Loss",
            "Summary": "Arvind Smart Spaces Limited announced significant board changes with Sanjay S. Lalbhai stepping down as Chairman Non-Executive Director and Kulin S. Lalbhai being elevated from Vice-Chairman to Chairman. The company also appointed Prashant Das as Independent Director for five years and Punit S. Lalbhai as Non-Executive Director, both subject to member approval. Amit Chamaria was named as Chief Financial Officer. The company reported quarterly results showing a standalone net loss of Rs. 378.45 crores compared to Rs. 42.53 crores loss in the previous year quarter. On a consolidated basis, the net profit attributable to equity holders was Rs. 345.55 crores for the quarter. The leadership transition is part of the company's succession planning process to ensure continuity and sustained growth.",
            "Sentiment": "neutral",
            "PublishDate": 1762170818059,
            "Source": "corporate_governance"
        },
        {
            "Title": "Arvind Smartspaces Launches ₹700 Crore Development Project in Vadodara",
            "Summary": "Arvind Smartspaces has launched a new development project worth ₹700 crore in Vadodara. The project represents a significant investment by the real estate company in the Gujarat city.",
            "Sentiment": "positive",
            "PublishDate": 1761716837521,
            "Source": "stock"
        },
        {
            "Title": "Arvind SmartSpaces Appoints Dharmesh Vyas as Chief Operations Officer",
            "Summary": "Arvind SmartSpaces Limited has appointed Mr. Dharmesh Vyas as Chief Operations Officer effective October 28, 2025. Vyas brings over three decades of experience in the real estate sector, having held senior leadership positions at companies including Adani Realty, Lodha Group, K Raheja Group, Tata Housing, and Ajmera Group. He has managed large-scale real estate development projects across India and internationally in Dubai, Bahrain, Kuwait, and Maldives. Vyas holds a BE Civil from COEP Pune, a PGP in Construction Management from NICMAR Pune, and a Diploma in Civil Engineering from K J Somaiya Polytechnic Mumbai. In his new role, he will oversee strategic and operational planning, project management, procurement, contracts, and project deliveries while ensuring compliance, safety and quality standards.",
            "Sentiment": "positive",
            "PublishDate": 1761650418370,
            "Source": "corporate_governance"
        },
        {
            "Title": "Arvind SmartSpaces Designates Two Chief Business Officers as Senior Management Personnel",
            "Summary": "Arvind SmartSpaces Limited designated Mr. Sharvil Shah as Chief Business Officer, West and Mr. Manoj Chellani as Chief Business Officer, South, as Senior Management Personnel effective from 22nd September, 2025. The appointments are part of an internal restructuring of senior management roles. Shah brings over 17 years of experience across Real Estate, Textile, Oil & Gas industries and has been with Arvind SmartSpaces for more than a year. He holds a Post Master of Science in Civil Engineering from Purdue University and previously worked with companies like Bechtel Corporation and BSafal. Chellani has 2 decades of experience in Real Estate, Banking & Telecom sectors and has been associated with Arvind SmartSpaces for six years. He holds an MBA from ICFAI Business School and previously held senior roles at Runwal Developers, Lodha Group, and Tech Mahindra. Both officers will be responsible for scaling business while driving overall profitability in their respective regions.",
            "Sentiment": "positive",
            "PublishDate": 1758538920225,
            "Source": "corporate_governance"
        },
        {
            "Title": "Arvind SmartSpaces Shareholders Approve All Resolutions in Postal Ballot Including New CEO Appointment and Employee Stock Option Scheme",
            "Summary": "Arvind SmartSpaces Limited announced that shareholders approved all resolutions in a postal ballot dated August 21, 2025, with results confirmed by scrutinizer Hitesh Buch on September 22, 2025. The approved resolutions include the appointment of Priyansh Kapoor as Director and subsequently as Whole-time Director & CEO of the company. Shareholders also approved the Arvind SmartSpaces Limited Employee Stock Option Scheme 2025 (ASL ESOS 2025) for both company employees and subsidiary employees. Additionally, they approved granting stock options exceeding one percent to Priyansh Kapoor under the new ESOS scheme. The voting was conducted through e-voting with a total of 78.21% voter turnout. All resolutions received over 99% approval from votes polled, with Resolution 1 receiving 99.45% approval, Resolution 2 receiving 99.45% approval, Resolution 3 receiving 99.90% approval, Resolution 4 receiving 99.96% approval, and Resolution 5 receiving 99.45% approval.",
            "Sentiment": "positive",
            "PublishDate": 1758526930957,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind SmartSpaces Appoints New CEO, Targets 30-35% Growth with Rs 3,000-4,000 Crore Launch Pipeline",
            "Summary": "Arvind SmartSpaces reported quarterly results with revenue of Rs 102 crore (up 37% year-on-year), EBITDA of Rs 24.5 crore (up 205% year-on-year), and PAT of Rs 12 crore (up 159% year-on-year). The company appointed Priyansh Kapoor as CEO and Whole-Time Director, while Kamal Singal continues as Managing Director. Bookings stood at Rs 175 crore and collections at Rs 191 crore for the quarter. The company maintains net cash position of Rs 50 crore and expects unrealized operating cash flow exceeding Rs 4,000 crore from current pipeline. Management targets 30-35% growth with planned launches worth Rs 3,000-4,000 crore across five projects in Bannerghatta, ITPL road, Pen-Khopoli, Surat Industrial Park, and Mankol. The company plans to add new projects with cumulative topline potential of Rs 5,000 crore across Ahmedabad, Bengaluru and MMR markets, with investment allocation of 40% each for Bangalore and Ahmedabad, and 20% for MMR.",
            "Sentiment": "positive",
            "PublishDate": 1754394447817,
            "Source": "earnings"
        },
        {
            "Title": "Arvind SmartSpaces Provides Audio Recording Link for Q1 FY26 Results Conference Call",
            "Summary": "Arvind SmartSpaces Limited has made available an audio recording of its conference call with analysts and investors held on July 29th, 2025, to discuss the company's Q1 FY26 results. The company provided a web link to access the audio recording and notified both BSE and NSE stock exchanges about this disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1753794528715,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Smartspaces Reports Decline in Q1FY26 Bookings",
            "Summary": "Arvind Smartspaces reported bookings of 175 units in Q1FY26, representing a decrease from 201 units recorded in Q1FY25. The company experienced a year-over-year decline of 26 units in its quarterly booking performance.",
            "Sentiment": "negative",
            "PublishDate": 1753695315153,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Smartspaces Reports Strong Q1 Growth with Revenue Rising 37% to 1.02 Billion Rupees",
            "Summary": "Arvind Smartspaces delivered robust quarterly results with revenue increasing to 1.02 billion rupees from 745 million rupees year-over-year. The company's consolidated net profit surged to 112 million rupees compared to 29 million rupees in the same period last year. EBITDA more than doubled to 215 million rupees from 92 million rupees, while EBITDA margin expanded significantly to 21.10% from 12.32% year-over-year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1753686982827,
            "Source": "earnings"
        },
        {
            "Title": "Arvind SmartSpaces Schedules Q1 FY26 Results Conference Call for July 29",
            "Summary": "Arvind SmartSpaces Limited has scheduled a conference call with investors and analysts on July 29, 2025, at 1:00 PM IST to discuss Q1 FY26 results. The call will feature key management representatives including Vice Chairman Kulin Lalbhai, Managing Director Kamal Singal, CEO Priyansh Kapoor, and Head of Business Development Vikram Rajput. The company, established in 2008 and built on the 120-year legacy of the Lalbhai Group, is a real estate development company headquartered in Ahmedabad with approximately 106 million square feet of development across India, including projects in Ahmedabad, Gandhinagar, Bengaluru, MMR and Pune.",
            "Sentiment": "neutral",
            "PublishDate": 1753339634870,
            "Source": "earnings"
        },
        {
            "Title": "Arvind SmartSpaces Appoints Priyansh Kapoor as CEO, Kamal Singal to Continue as Managing Director",
            "Summary": "Arvind SmartSpaces Limited appointed Priyansh Kapoor as Whole-time Director and CEO effective August 9, 2025. Kamal Singal will continue as Managing Director and mentor to the leadership team. Kapoor brings over 15 years of real estate experience, most recently serving as CEO for Mumbai Metropolitan Region at Godrej Properties where he managed a business portfolio with annual booking value exceeding INR 8,000 crore. The appointment is part of ASL's succession planning strategy to accelerate growth in the real estate business. Kulin Lalbhai, Vice Chairman, highlighted ASL's growth under Singal's leadership across multiple territories. Kapoor expressed gratitude for the opportunity and emphasized building on the solid foundation established by the existing team.",
            "Sentiment": "positive",
            "PublishDate": 1753158553216,
            "Source": "corporate_governance"
        },
        {
            "Title": "Arvind SmartSpaces: Multibagger Stock Aims for Rs 2,500 Crore Inventory Launch",
            "Summary": "Arvind SmartSpaces, a real estate developer, plans to launch fresh inventory worth Rs 2,500 crore by year-end. Despite a 23% YTD decline, the stock has seen a 757% return over five years. Analysts maintain a 'buy' rating with a target price of Rs 920.5.",
            "Sentiment": "positive",
            "PublishDate": 1750911642000,
            "Source": "normal_news"
        },
        {
            "Title": "Arvind SmartSpaces Ltd: Q4 Profit Up 23%, Recommends ₹6 Dividend",
            "Summary": "Arvind SmartSpaces reported a 22.6% YoY increase in Q4FY25 net profit to ₹19 crore. Revenue surged 38.8% to ₹163 crore. FY25 bookings rose 15% to ₹1,271 crore. The board recommended a final dividend of ₹6 per share for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1747752442000,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Smartspaces Reports Q4 Results and Recommends Dividend",
            "Summary": "Arvind Smartspaces has announced its Q4 financial results and recommended a dividend. The company's Q4 consolidated net profit increased to 191.5 million rupees from 155 million rupees year-over-year. Revenue rose to 1.63 billion rupees from 1.17 billion rupees in the same period. EBITDA grew to 335.9 million rupees from 313.4 million rupees, although the EBITDA margin decreased to 20.6% from 26.7%. The company has recommended a final dividend of 6 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747746861000,
            "Source": "result"
        },
        {
            "Title": "Arvind Smartspaces Launches Arvind The Park in Bengaluru, Sells 200 Plots",
            "Summary": "Arvind Smartspaces has successfully launched a new project called Arvind The Park in Devanahalli, Bengaluru. The company sold 200 plots at the launch, generating a booking value of over ₹180 crore. This indicates strong demand for the project and potentially positive revenue implications for the company.",
            "Sentiment": "positive",
            "PublishDate": 1742947981000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind SmartSpaces: Bengaluru Project Sells Out, Booking Value ₹180 Crore",
            "Summary": "Arvind SmartSpaces sold all 200 plots in its Arvind The Park residential project in Devanahalli, Bengaluru, generating over ₹180 crore in booking value. The project offers luxury amenities including an executive-level golf course and Monogram by Arvind Lounges and Resorts membership.",
            "Sentiment": "positive",
            "PublishDate": 1742908238000,
            "Source": "normal_news"
        },
        {
            "Title": "Arvind SmartSpaces Launches Arvind The Park in Bengaluru",
            "Summary": "Arvind SmartSpaces has successfully sold 200 plots at the launch of their new project, Arvind The Park, located in Devanahalli, Bengaluru. The sale generated a booking value exceeding ₹180 crore, indicating strong demand for the company's real estate offerings in the area.",
            "Sentiment": "positive",
            "PublishDate": 1742902294000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind SmartSpaces Adds New Plotted Development Project in Sanand, Ahmedabad",
            "Summary": "Arvind SmartSpaces has announced the addition of a new plotted development project in Sanand, Ahmedabad. The project has a potential top-line value of 600 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1739765978000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind Smartspaces: Q3 Profit Soars 407.87% YoY to ₹47.74 Crore",
            "Summary": "Arvind Smartspaces reported Q3 FY25 results with profit rising 407.87% YoY to ₹47.74 crore. Revenue increased 149.3% YoY to ₹210.16 crore. EPS reached ₹10.35, up 404.88% YoY. However, revenue declined 20.87% QoQ despite a 17.33% profit increase. All three analysts covering the stock maintain a 'Strong Buy' rating.",
            "Sentiment": "positive",
            "PublishDate": 1738303589000,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Smartspaces Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "Arvind Smartspaces has reported a substantial increase in both net profit and revenue for the third quarter. The consolidated net profit rose to 477.4 million rupees, up from 94 million rupees year-over-year and 406.9 million rupees quarter-over-quarter. The company's revenue also saw a significant jump, reaching 2.1 billion rupees compared to 843 million rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738197256000,
            "Source": "earnings"
        },
        {
            "Title": "Arvind SmartSpaces Reports Significant EBITDA Growth in Q3",
            "Summary": "Arvind SmartSpaces has reported a substantial increase in its Q3 EBITDA, rising to 594.4 million rupees from 199.5 million rupees in the same period last year. The company's EBITDA margin also improved, reaching 28.28% compared to 23.67% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738152442000,
            "Source": "earnings"
        },
        {
            "Title": "Arvind SmartSpaces Reports Significant Revenue Growth in Q3",
            "Summary": "Arvind SmartSpaces, a real estate development company, has reported a substantial increase in its third-quarter revenue. The company's revenue for Q3 reached 2.1 billion rupees, compared to 843 million rupees in the same period last year, representing a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738152433000,
            "Source": "earnings"
        },
        {
            "Title": "Arvind SmartSpaces Reports Significant Profit Growth in Q3",
            "Summary": "Arvind SmartSpaces has reported a substantial increase in consolidated net profit for the third quarter. The company's net profit rose to 477.4 million rupees, compared to 94 million rupees in the same quarter of the previous year, representing a year-over-year growth. Additionally, the profit showed a quarter-over-quarter increase from 406.9 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738152424000,
            "Source": "earnings"
        },
        {
            "Title": "Arvind Smartspaces to Develop Mega Industrial Park in Ahmedabad",
            "Summary": "Arvind Smartspaces has announced plans to develop a large-scale industrial park in Ahmedabad. The project will span 440 acres and has an estimated top-line potential of Rs. 1,350 crore. This development represents a significant expansion in the company's real estate portfolio and could have a substantial impact on its future revenue.",
            "Sentiment": "positive",
            "PublishDate": 1738023355000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind SmartSpaces to Develop Mega Industrial Park in Ahmedabad",
            "Summary": "Arvind SmartSpaces has announced plans to develop a large-scale industrial park in Ahmedabad. The project will span 440 acres and has an estimated top-line potential of Rs. 1,350 crore.",
            "Sentiment": "positive",
            "PublishDate": 1737976255000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind SmartSpaces Plans Expansion in MMR, Ahmedabad, and Bengaluru",
            "Summary": "The Managing Director of Arvind SmartSpaces has expressed the company's intention to expand its project portfolio in the Mumbai Metropolitan Region (MMR) and other target markets, including Ahmedabad and Bengaluru.",
            "Sentiment": "positive",
            "PublishDate": 1737692585000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind SmartSpaces Expands Business with Significant Acquisition",
            "Summary": "The Managing Director of Arvind SmartSpaces has announced a major acquisition that significantly boosts the company's business development potential. With this new acquisition, the company's cumulative new business development topline potential for the current year to date has reached Rs 2,500 crore.",
            "Sentiment": "positive",
            "PublishDate": 1737692561000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind SmartSpaces Expands into Mumbai Metropolitan Region with ₹1,500 Crore Township Project",
            "Summary": "Arvind SmartSpaces, a real estate development company, has announced its entry into the Mumbai Metropolitan Region (MMR) with a significant horizontal township project. The project is valued at ₹1,500 crore, marking a major expansion for the company. This move represents Arvind SmartSpaces' strategic entry into one of India's largest and most valuable real estate markets. The company's current market capitalization is reported to be ₹3,500 crore.",
            "Sentiment": "positive",
            "PublishDate": 1737692504000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind SmartSpaces to Consider Q3 Results on January 29",
            "Summary": "Arvind SmartSpaces has announced that it will consider its third quarter (Q3) financial results on January 29. This indicates that the company is preparing to review and potentially approve its quarterly financial performance for public disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1737468275000,
            "Source": "earnings"
        },
        {
            "Title": "Arvind SmartSpaces Approves 4 Billion Rupee Fundraising",
            "Summary": "Arvind SmartSpaces has approved a plan to raise funds up to 4 billion rupees. The company will use various methods for this fundraising, including a Qualified Institutional Placement (QIP).",
            "Sentiment": "positive",
            "PublishDate": 1730811655000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind Smartspaces: Rs 2,500 Crore Inventory Launch Target for FY24",
            "Summary": "Arvind Smartspaces aims to launch Rs 2,500 crore worth of fresh inventory in FY24, with Rs 900 crore already launched in H1. The company plans to invest Rs 1,000-1,200 crore in the next two quarters, supported by strong internal accruals and potential debt raising of Rs 300-400 crore.",
            "Sentiment": "positive",
            "PublishDate": 1730259118000,
            "Source": "normal_news"
        },
        {
            "Title": "Arvind SmartSpaces Reports Strong Q2 EBITDA Growth",
            "Summary": "Arvind SmartSpaces has announced its Q2 financial results, showing significant year-over-year improvement. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 reached 669 million rupees, compared to 339 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 25.22% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729842847000,
            "Source": "result"
        },
        {
            "Title": "Arvind SmartSpaces Reports Significant Revenue Growth in Q2",
            "Summary": "Arvind SmartSpaces, a real estate company, has reported a substantial increase in its second-quarter revenue. The company's revenue for Q2 reached 2.66 billion rupees, compared to 727 million rupees in the same period last year, representing a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1729842777000,
            "Source": "result"
        },
        {
            "Title": "Arvind SmartSpaces Reports Significant Profit Growth in Q2",
            "Summary": "Arvind SmartSpaces, a real estate development company, has reported a substantial increase in consolidated net profit for the second quarter. The company's net profit rose to 407 million rupees, up from 86 million rupees in the same period last year, representing a year-over-year growth of approximately 373%.",
            "Sentiment": "positive",
            "PublishDate": 1729842753000,
            "Source": "result"
        },
        {
            "Title": "Arvind SmartSpaces: Township Project Secures Rs 600 Crore in Bookings",
            "Summary": "<p>Arvind SmartSpaces' <span class='neutral'>Kalyangadh-based township</span>, <b>Arvind Aqua City</b>, has achieved <span class='positive'>total bookings of Rs 600 crore</span>, including <span class='positive'>Rs 500 crore since its launch</span> in late September. The project, located near <span class='neutral'>Ahmedabad</span>, features <span class='positive'>India's largest private man-made lake</span> and a mix of <span class='neutral'>plots and villas</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728547980000,
            "Source": "normal_news"
        },
        {
            "Title": "Arvind SmartSpaces Achieves Rs. 500 Crore in Bookings for Aqua City Launch",
            "Summary": "<p>Arvind SmartSpaces has reported <span class='positive'>successful</span> bookings <span class='positive'>exceeding Rs. 500 crore</span> for their newly launched project, <b>Aqua City</b>. This indicates <span class='positive'>strong initial demand</span> for the company's latest real estate development.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728546936000,
            "Source": "corporate_action"
        },
        {
            "Title": "Arvind SmartSpaces: New Bengaluru Project with Rs 600 Cr Potential",
            "Summary": "<p>Arvind SmartSpaces has signed a <span class='positive'>new</span> residential apartment project in <b>Bengaluru</b> near <b>Whitefield</b>, with <span class='positive'>4.2 lakh sq. ft. saleable area</span> and <span class='positive'>Rs 600 crore revenue potential</span>. This <span class='neutral'>joint development project</span> is the company's <span class='positive'>12th overall</span> and <span class='positive'>8th high-rise project</span> in Bangalore.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728446340000,
            "Source": "normal_news"
        },
        {
            "Title": "Arvind SmartSpaces Announces New High-Rise Project in Bengaluru",
            "Summary": "<p>Arvind SmartSpaces has added a <span class='positive'>new</span> <span class='positive'>high-rise project</span> on ITPL Road in <b>Bengaluru</b>. The project has a <span class='positive'>potential top-line value</span> of <b>Rs. 600 crore</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728445516000,
            "Source": "corporate_action"
        }
    ]
}