{
    "Symbol": "ASAHIINDIA",
    "ISIN": "INE439A01020",
    "News": [
        {
            "Title": "Asahi India Glass Approves ₹20 Billion CapEx Plan",
            "Summary": "Asahi India Glass has approved a significant capital expenditure plan worth up to ₹20 billion, marking a major investment initiative for the automotive glass manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1769762022675,
            "Source": "stocks"
        },
        {
            "Title": "Asahi India Glass Q3 Net Profit Drops 5.2% YoY",
            "Summary": "Asahi India Glass reports consolidated net profit of ₹995 million in Q3, down from ₹1.05 billion in the same quarter last year, marking a 5.2% year-on-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1769761924350,
            "Source": "co_actions_results"
        },
        {
            "Title": "Asahi India Glass Q3FY26 QIP Monitoring Report",
            "Summary": "Asahi India Glass submitted Q3FY26 monitoring agency report showing complete utilization of ₹1000 crore QIP proceeds for debt repayment and general corporate purposes as per stated objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1769761881076,
            "Source": "co_actions_results"
        },
        {
            "Title": "Asahi India Glass Board Meet Set for Jan 30, 2026",
            "Summary": "Asahi India Glass Limited has scheduled a board meeting on January 30, 2026, to consider Q3FY26 unaudited financial results. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769176036190,
            "Source": "co_actions_results"
        },
        {
            "Title": "Asahi India Glass Gets Credit Rating Upgrade",
            "Summary": "CARE Ratings upgrades Asahi India Glass's long-term bank facilities rating to CARE AA- from CARE A+, reflecting improved creditworthiness and financial stability of the glass manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1768462802041,
            "Source": "stocks"
        },
        {
            "Title": "Asahi India Glass Signs 20.8 MW Renewable Power Deal",
            "Summary": "Asahi India Glass partners with Adani Green Energy to procure 20.8 MW wind-solar hybrid power from Khavda, Gujarat project, supporting its goal to shift 70% energy consumption to renewables by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1767936269642,
            "Source": "co_actions_results"
        },
        {
            "Title": "DGTR Recommends Continuing Anti-Dumping Duties on Malaysian Clear Float Glass",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has recommended maintaining anti-dumping duties on clear float glass imports from Malaysia following a review. This recommendation affects Asahi India Glass, which operates in the glass manufacturing sector.",
            "Sentiment": "neutral",
            "PublishDate": 1762485612151,
            "Source": "stock"
        },
        {
            "Title": "Multiple Companies Release Quarterly Financial Results for September 2025",
            "Summary": "Several companies published their unaudited financial results for the second quarter and half year ended September 30, 2025. Asahi India Glass Limited submitted their results to stock exchanges NSE and BSE, which were published in Business Standard and Veer Arjun newspapers. The Ramco Cements Limited also released their consolidated unaudited statement of profit and loss for the same period. Additionally, Aditya Birla Lifestyle Brands Limited published their extract of unaudited consolidated financial results. The documents show various financial metrics and compliance with SEBI listing regulations, with companies fulfilling their disclosure requirements under Regulation 30 of SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762485137731,
            "Source": "earnings"
        },
        {
            "Title": "Asahi India Glass Reports Monitoring Agency Report for Rs 1000 Crore QIP",
            "Summary": "Asahi India Glass Limited submitted its monitoring agency report for the quarter ended September 30, 2025, related to its Qualified Institutions Placement of equity shares worth Rs 1000 crore. The report, prepared by CARE Ratings Limited, shows no deviation from stated objectives. During the quarter, the company utilized Rs 58.75 crore for term loan repayment, Rs 192 crore for working capital debt line repayment, and Rs 0.61 crore for issue-related expenses. The QIP was conducted from September 15-18, 2025, as a private placement. Unutilized proceeds were deployed in fixed deposits with RBL Bank and Yes Bank, earning returns. The company also earned Rs 0.69 crore as interest on fixed deposits during the period.",
            "Sentiment": "neutral",
            "PublishDate": 1762334523722,
            "Source": "corporate_action"
        },
        {
            "Title": "Asahi India Glass Reports Q2 Results and Raises Rs 1,000 Crores Through QIP",
            "Summary": "Asahi India Glass Limited announced its unaudited financial results for the second quarter and half year ended September 30, 2025. The Board of Directors approved the results in their meeting held on November 5, 2025. During the quarter, the company raised Rs 1,000 crores through issue and allotment of equity shares to Qualified Institutional Buyers. The National Company Law Tribunal had approved the merger of three subsidiaries - GX Glass Sales & Services Limited, AIS Distribution Services Limited and AIS Adhesives Limited with AIS Glass Solutions Limited from April 1, 2023. The company operates through three main segments: Automotive Glass, Float Glass, and Others, with segment-wise revenue and results disclosed in the financial statements.",
            "Sentiment": "neutral",
            "PublishDate": 1762329519521,
            "Source": "earnings"
        },
        {
            "Title": "Asahi India Glass Completes ₹100 Crore QIP, Allots 1.18 Crore Shares at ₹844.79 Each",
            "Summary": "Asahi India Glass Limited completed its Qualified Institutions Placement (QIP) of equity shares. The company's LTP Committee approved the allocation of 1,18,37,261 equity shares at an issue price of ₹844.79 per share, raising ₹100 crore. The QIP opened on September 15, 2025 and closed on September 18, 2025. The committee meeting was held on September 18, 2025, where resolutions were passed approving the closure of the issue, determining the allocation price, and finalizing documentation for eligible qualified institutional buyers.",
            "Sentiment": "positive",
            "PublishDate": 1758200012009,
            "Source": "corporate_action"
        },
        {
            "Title": "Asahi India Glass Launches Qualified Institutions Placement at Floor Price of ₹844.79 per Share",
            "Summary": "Asahi India Glass Limited has launched a qualified institutions placement (QIP) of equity shares with a face value of ₹1 each. The company's LTP Committee approved the preliminary placement document and set the floor price at ₹844.79 per equity share on September 15, 2025. The QIP received prior approvals from the board of directors on January 29, 2025, and shareholders through a special resolution on March 15, 2025. The company may offer a discount of up to 5% on the floor price. The trading window has been closed until September 18, 2025. A subsequent LTP Committee meeting is scheduled for September 18, 2025, to determine the final issue price for the equity shares to be allotted to qualified institutional buyers.",
            "Sentiment": "neutral",
            "PublishDate": 1757941435701,
            "Source": "corporate_action"
        },
        {
            "Title": "Asahi India Glass Reports Q1 2025 Results, Announces Leadership Changes and AGM Date",
            "Summary": "Asahi India Glass Limited announced its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 1,143.83 crores compared to Rs 1,062.86 crores in the same quarter last year. Net profit stood at Rs 53.37 crores versus Rs 76.46 crores in Q1 2024. On a consolidated basis, revenue from operations was Rs 1,228.74 crores against Rs 1,132.66 crores in the previous year, with net profit at Rs 54.79 crores compared to Rs 76.69 crores. The company announced leadership changes with Mr. Masahiro Takeda resigning as Director effective July 31, 2025, due to his retirement from AGC Inc., Japan. Mr. Kazuo Ninomiya has been appointed as Additional Director from August 1, 2025. The company also scheduled its 40th Annual General Meeting for September 10, 2025, and announced the appointment of Mr. Sundeep Kumar Parashar as Secretarial Auditor and the re-appointment of Ms. Sheetal Mehta as Independent Director for a second term.",
            "Sentiment": "neutral",
            "PublishDate": 1753864384221,
            "Source": "earnings"
        },
        {
            "Title": "Asahi India Glass Reports Mixed Q1 Results with Revenue Growth but Lower Profit",
            "Summary": "Asahi India Glass reported quarterly revenue of 12.3 billion rupees, up from 11.33 billion rupees in the same period last year. EBITDA increased to 1.92 billion rupees from 1.8 billion rupees year-over-year, though EBITDA margin declined to 15.65% from 16.02%. Consolidated net profit dropped to 560 million rupees compared to 780 million rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1753863503466,
            "Source": "earnings"
        },
        {
            "Title": "Anti-Dumping Duty on Clear Float Glass from Malaysia Extended for Asahi India Glass",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has extended the anti-dumping duty on clear float glass imported from Malaysia. This extension will be in effect until February 2026, potentially benefiting Asahi India Glass, a domestic manufacturer of glass products.",
            "Sentiment": "positive",
            "PublishDate": 1752203428000,
            "Source": "default"
        },
        {
            "Title": "Asahi India Glass Reports Q4 Profit and Revenue Growth",
            "Summary": "Asahi India Glass has reported a consolidated net profit of 924 million rupees for Q4, up from 739 million rupees in the same period last year. The company's revenue also increased to 11.8 billion rupees from 11 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747210442000,
            "Source": "result"
        },
        {
            "Title": "Asahi India Glass to Consider Q4 Results on May 14",
            "Summary": "Asahi India Glass has announced that it will consider and approve its financial results for the fourth quarter on May 14. This is a routine corporate announcement regarding the company's upcoming financial disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1746627667000,
            "Source": "default"
        },
        {
            "Title": "Asahi India Glass Begins Commercial Operations at Soniyana Facility",
            "Summary": "Asahi India Glass Limited has announced the commencement of commercial operations at its new facility in Soniyana. This development marks an expansion of the company's production capabilities, potentially increasing its market presence in the glass manufacturing sector.",
            "Sentiment": "positive",
            "PublishDate": 1742947857000,
            "Source": "corporate_action"
        },
        {
            "Title": "Asahi India Glass Commences Commercial Operations at Soniyana Facility",
            "Summary": "Asahi India Glass Limited has announced the commencement of commercial operations at its new facility in Soniyana. This development marks an expansion of the company's production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1742907428000,
            "Source": "corporate_action"
        },
        {
            "Title": "Asahi India Glass Reports Q3 EBITDA Growth",
            "Summary": "Asahi India Glass has reported its Q3 financial results. The company's EBITDA increased to 1.75 billion rupees from 1.63 billion rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 15.60% from 15.65% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738137353000,
            "Source": "earnings"
        },
        {
            "Title": "Asahi India Glass Reports Q3 Revenue Increase",
            "Summary": "Asahi India Glass has reported a revenue of 11.2 billion rupees for the third quarter, compared to 10.4 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738137337000,
            "Source": "earnings"
        },
        {
            "Title": "Asahi India Glass Reports Significant Profit Increase in Q3",
            "Summary": "Asahi India Glass has reported a substantial increase in its consolidated net profit for the third quarter. The company's net profit rose to 1.28 billion rupees, up from 634 million rupees in the same period last year, marking a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738137257000,
            "Source": "earnings"
        },
        {
            "Title": "Asahi India Glass to Consider Q3 Results",
            "Summary": "Asahi India Glass Limited has announced that it will consider its financial results for the third quarter on January 29.",
            "Sentiment": "neutral",
            "PublishDate": 1737555990000,
            "Source": "earnings"
        },
        {
            "Title": "Asahi India Glass to Sell 30% Stake in TGPEL Precision Engineering",
            "Summary": "Asahi India Glass has announced that its shareholders in TGPEL Precision Engineering have signed an agreement to sell the company's 30% stake in TGPEL. The deal is valued at 660 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1733875550000,
            "Source": "corporate_action"
        },
        {
            "Title": "Asahi India Glass to Sell 30% Stake in TGPEL Precision Engineering",
            "Summary": "Asahi India Glass has announced that its shareholders in TGPEL Precision Engineering have signed an agreement with SPR Engenious for the sale of their 30% stake in TGPEL. The deal is valued at 660 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1733840067000,
            "Source": "corporate_action"
        },
        {
            "Title": "Asahi India Glass Reports Improved Q2 EBITDA and Margin",
            "Summary": "Asahi India Glass has reported its Q2 financial results. The company's EBITDA increased to 2.12 billion rupees from 1.85 billion rupees in the same quarter last year. The EBITDA margin also improved, rising to 18.36% from 16.58% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730191343000,
            "Source": "result"
        },
        {
            "Title": "Asahi India Glass Reports Q2 Revenue Growth",
            "Summary": "Asahi India Glass, a leading glass manufacturer, has reported a revenue of 11.5 billion rupees for the second quarter, compared to 11.2 billion rupees in the same period last year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730191305000,
            "Source": "result"
        },
        {
            "Title": "Asahi India Glass Reports Increased Q2 Profit",
            "Summary": "Asahi India Glass has reported a consolidated net profit of 955 million rupees for the second quarter, up from 869 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730191277000,
            "Source": "result"
        }
    ]
}