{
    "Symbol": "ASAHISONG",
    "ISIN": "INE228I01012",
    "News": [
        {
            "Title": "Asahi Songwon Colors Appoints New Independent Director",
            "Summary": "Asahi Songwon Colors Limited successfully completed postal ballot process for appointment of Mr. Maulik Deepak Mehta as Independent Director with requisite majority through remote e-voting.",
            "Sentiment": "positive",
            "PublishDate": 1770782091992,
            "Source": "stocks"
        },
        {
            "Title": "Asahi Songwon Colors Q3FY26 Results Announced",
            "Summary": "Asahi Songwon Colors reported Q3FY26 standalone revenue of ₹7,431.02 lakhs vs ₹9,369.37 lakhs YoY. Net profit stood at ₹353.35 lakhs compared to ₹455.49 lakhs in Q3FY25.",
            "Sentiment": "negative",
            "PublishDate": 1769672661669,
            "Source": "co_actions_results"
        },
        {
            "Title": "Asahi Songwon Colors Board Meet on Jan 29, 2026",
            "Summary": "Asahi Songwon Colors Limited has scheduled a board meeting for January 29, 2026, to consider and approve Q3FY26 and nine months financial results ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768890734620,
            "Source": "co_actions_results"
        },
        {
            "Title": "Asahi Songwon Colors Reports Mixed Quarterly Performance with Declining Profits",
            "Summary": "Asahi Songwon Colors Limited reported net profit after tax of Rs 209.70 lakhs for the quarter ended September 30, 2025, compared to Rs 330.22 lakhs in the previous quarter, showing a decline in profitability. The company's total income from operations decreased to Rs 4,225.01 lakhs from Rs 4,262.37 lakhs in the previous quarter, with earnings per share dropping to Rs 1.91 from Rs 3.26.",
            "Sentiment": "negative",
            "PublishDate": 1763061344033,
            "Source": "earnings"
        },
        {
            "Title": "Asahi Songwon Colors Submits Revised Financial Results After Correcting Segment Reporting Error",
            "Summary": "Asahi Songwon Colors Limited submitted revised standalone and consolidated unaudited financial results for the quarter and half year ended September 30, 2025, after identifying a typographical error in segment reporting. The company corrected segment-wise revenue figures while confirming no changes to total revenue, profit, or other financial information. The revised results were reviewed by the audit committee and approved by the board of directors on November 11, 2025. Statutory auditors completed their limited review of the financial results as per SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762885807073,
            "Source": "earnings"
        },
        {
            "Title": "Asahi Songwon Colors Reports Quarterly Results, Appoints New Independent Director",
            "Summary": "Asahi Songwon Colors Limited's Board approved standalone and consolidated unaudited financial results for the quarter and half year ended September 30, 2025. The company appointed Mr. Maulik Deepak Mehta as Non-Executive Independent Director for a five-year term from November 11, 2025 to November 10, 2030, subject to member approval. Mr. Samveg Arvindbhai Lalbhai's designation changed from Non-Executive Independent Director to Non-Executive Non-Independent Director. For the quarter ended September 30, 2025, consolidated revenue from operations was Rs. 12,255.01 lakhs compared to Rs. 15,133.63 lakhs in the previous quarter. Consolidated profit after tax attributable to owners was Rs. 363.11 lakhs versus Rs. 417.47 lakhs in the prior quarter. The company operates in two main segments: Pigments and API (Active Pharmaceutical Ingredients).",
            "Sentiment": "neutral",
            "PublishDate": 1762849383739,
            "Source": "earnings"
        },
        {
            "Title": "Asahi Songwon Colors Reports Mixed Q1FY26 Results with Revenue Growth but Margin Decline",
            "Summary": "Asahi Songwon Colors Limited reported consolidated revenue of ₹149.88 crores for the quarter ended June 30, 2025, representing an 11.62% year-on-year increase but a 1.88% quarter-on-quarter decrease. EBITDA declined to ₹12.00 crores with margins compressing to 7.93% from 11.53% in the previous quarter and 10.75% in the same quarter last year. Net profit before exceptional items fell to ₹2.59 crores, down 40.73% year-on-year. The company's three business segments generated revenues of ₹108.19 crores from Phthalocyanine, ₹16.31 crores from AZO, and ₹26.83 crores from API. Management attributed the performance decline to subdued demand in the Blue Business (phthalocyanine pigments) during the latter half of the quarter, impacting both sales and realizations. The API business faced challenges with declining product realizations despite higher volumes, while the AZO business showed steady progress. Management expects continued challenges in the second quarter but anticipates recovery in the second half of the financial year.",
            "Sentiment": "negative",
            "PublishDate": 1754125591163,
            "Source": "earnings"
        },
        {
            "Title": "Asahi Songwon Colors MD Warns of Tough Pigment Market, Expects Sluggish Q2 Performance",
            "Summary": "Asahi Songwon Colors' Managing Director has indicated that pigment market conditions are challenging. The company anticipates sluggish business momentum for the second quarter due to these difficult market conditions.",
            "Sentiment": "negative",
            "PublishDate": 1754125271285,
            "Source": "stock"
        },
        {
            "Title": "Asahi Songwon Colors Reports Quarterly Results and Appoints New Secretarial Auditors",
            "Summary": "Asahi Songwon Colors Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported consolidated revenue of Rs. 15,133.64 lakhs compared to Rs. 13,505.17 lakhs in the same quarter last year. Profit before tax stood at Rs. 422.71 lakhs versus Rs. 603.67 lakhs in the previous year quarter. The board appointed M/s. SPANJ & Associates as Secretarial Auditors for five consecutive years from 2025-26 to 2029-30, subject to shareholder approval. SPANJ & Associates is led by Mr. Ashish Doshi and operates from offices in Ahmedabad and Mumbai, offering services in corporate legal advisory, capital markets, and regulatory compliance. The company operates in two segments - Pigments and API, with pigments contributing Rs. 12,450.22 lakhs and API contributing Rs. 2,683.41 lakhs to total revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1753780684859,
            "Source": "earnings"
        },
        {
            "Title": "Asahi Songwon Colors Reports Mixed Q1 Results with Revenue Growth but Lower Profitability",
            "Summary": "Asahi Songwon Colors reported Q1 revenue of 1.5 billion rupees compared to 1.34 billion rupees in the same period last year, showing growth. However, the company's profitability declined with EBITDA falling to 105 million rupees from 137 million rupees year-over-year. EBITDA margin compressed to 7% from 10.23% in the previous year. Consolidated net profit also decreased to 32 million rupees compared to 52 million rupees in the corresponding quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1753779821107,
            "Source": "earnings"
        },
        {
            "Title": "Asahi Songwon Colors Schedules Board Meeting for July 29 to Approve Quarterly Financial Results",
            "Summary": "Asahi Songwon Colors Limited has scheduled a Board of Directors meeting on July 29, 2025 to consider and approve the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company has also closed the trading window for designated persons from July 1, 2025 until 48 hours after the financial results are submitted to stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1753158430508,
            "Source": "corporate_action"
        },
        {
            "Title": "Asahi Songwon Colors Reports Significant Profit Increase in Q4",
            "Summary": "Asahi Songwon Colors has reported a substantial increase in consolidated net profit for the fourth quarter. The company's net profit rose to 76 million rupees, up from 22 million rupees in the same period last year, marking a year-over-year growth of approximately 245%.",
            "Sentiment": "positive",
            "PublishDate": 1746691398000,
            "Source": "result"
        },
        {
            "Title": "Asahi Songwon Colors Schedules Board Meeting for Q2 Results",
            "Summary": "<p>Asahi Songwon Colors has announced a <span class='neutral'>board meeting</span> to be held on <span class='neutral'>October 24</span> to <span class='neutral'>consider and approve</span> the company's <span class='neutral'>financial results</span> for the <b>second quarter</b> of the current <span class='neutral'>fiscal year</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728564888000,
            "Source": "corporate_action"
        }
    ]
}