{
    "Symbol": "ASAL",
    "ISIN": "INE900C01027",
    "News": [
        {
            "Title": "ASAL Q3FY26 Profit Jumps 109% to ₹746.75 Lakhs",
            "Summary": "Automotive Stampings & Assemblies reported Q3FY26 profit of ₹746.75 lakhs, up 109% YoY. Revenue grew 26% to ₹25,012.76 lakhs. Board approved re-appointment of independent director.",
            "Sentiment": "positive",
            "PublishDate": 1769608451450,
            "Source": "co_actions_results"
        },
        {
            "Title": "ASAL Board Meet Set for Jan 28 to Review Q3FY26 Results",
            "Summary": "Automotive Stampings & Assemblies Limited has scheduled a board meeting on January 28, 2026, to approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768981892654,
            "Source": "co_actions_results"
        },
        {
            "Title": "Automotive Stampings and Assemblies Reports Quarterly Financial Results",
            "Summary": "Automotive Stampings and Assemblies Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company reported revenue from operations of INR 46,227.32 lakhs for the quarter, compared to INR 39,070.48 lakhs in the same quarter last year. The company posted a profit of INR 827.87 lakhs for the quarter versus INR 827.87 lakhs in the previous year quarter. For the half year, revenue stood at INR 87,782.71 lakhs compared to INR 76,149.23 lakhs in the corresponding period last year, with profit of INR 1,677.89 lakhs. The company operates in automobile components manufacturing as a single business segment. As of September 30, 2025, the company's total current liabilities exceeded total current assets by INR 4,882.30 lakhs. The Board of Directors approved these results at their meeting held on October 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761842299952,
            "Source": "earnings"
        },
        {
            "Title": "Automotive Stampings & Assemblies Reports Growth in Q2 Financial Performance",
            "Summary": "Automotive Stampings & Assemblies reported Q2 EBITDA of 126 million rupees compared to 114 million rupees in the previous year. The company's EBITDA margin improved to 5.94% from 5.76% year-over-year. Net profit reached 44 million rupees versus 43 million rupees in the same period last year. Revenue grew to 2.12 billion rupees from 1.97 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1761812431237,
            "Source": "earnings"
        },
        {
            "Title": "Automotive Stampings and Assemblies Limited Company Secretary Resigns to Pursue New Opportunities",
            "Summary": "Automotive Stampings and Assemblies Limited announced the resignation of Mr. Saurabh Surendra Erande from his position as Company Secretary and Compliance Officer. Erande, who holds membership number A25908, resigned to explore new opportunities outside the company. The company accepted his resignation on August 13, 2025, and he was relieved from his role and responsibilities effective September 19, 2025, after closure of business hours. The company stated there are no other material reasons for the resignation beyond his decision to pursue new career opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1758283006824,
            "Source": "corporate_governance"
        },
        {
            "Title": "Automotive Stampings and Assemblies Limited Company Secretary Resigns",
            "Summary": "Mr. Saurabh Surendra Erande has resigned from his position as Company Secretary and Compliance Officer of Automotive Stampings and Assemblies Limited, effective August 13, 2025, to pursue new opportunities outside the company. The company has accepted his resignation and confirmed there are no other material reasons for his departure. Erande was designated as Key Managerial Personnel and will be relieved from his responsibilities as per company HR policy.",
            "Sentiment": "neutral",
            "PublishDate": 1755102419369,
            "Source": "corporate_governance"
        },
        {
            "Title": "Automotive Stampings and Assemblies Limited Publishes Quarterly Financial Results",
            "Summary": "Automotive Stampings and Assemblies Limited has published its unaudited financial results for the quarter ended June 30, 2025 in newspapers as per regulatory requirements. The company, which trades on BSE (scrip code: 520119) and NSE (scrip code: ASAL), published the results in 'Financial Express' and 'Loksatta' newspapers on July 26, 2025. The newspaper advertisement includes a QR code and weblink to access complete financial results on the company's website. The results are also available on stock exchange websites. This disclosure was made in compliance with Regulation 47(3) of SEBI Listing Obligations and Disclosure Requirements Regulations, 2015.",
            "Sentiment": "neutral",
            "PublishDate": 1753536948919,
            "Source": "earnings"
        },
        {
            "Title": "Automotive Stampings & Assemblies Reports Decline in Quarterly Profit and Revenue",
            "Summary": "Automotive Stampings & Assemblies reported a net profit of 25 million rupees in Q1, down from 40 million rupees in the same period last year. The company's revenue also decreased to 1.7 billion rupees from 1.9 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1753363128068,
            "Source": "earnings"
        },
        {
            "Title": "Automotive Stampings & Assemblies Reports Decline in Quarterly EBITDA and Margin",
            "Summary": "Automotive Stampings & Assemblies reported quarterly EBITDA of 108 million rupees compared to 123 million rupees in the same period last year, representing a year-over-year decline. The company's EBITDA margin also decreased to 6.21% from 6.4% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1753362739566,
            "Source": "earnings"
        },
        {
            "Title": "Automotive Stampings & Assemblies Reports Q2 Financial Results",
            "Summary": "Automotive Stampings & Assemblies has reported its Q2 financial results. The company's net profit increased to 43 million rupees, up from 39.9 million rupees year-over-year and 40 million rupees quarter-over-quarter. However, revenue decreased to 1.97 billion rupees from 2.12 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1729861924000,
            "Source": "result"
        }
    ]
}