{
    "Symbol": "ASALCBR",
    "ISIN": "INE073G01016",
    "News": [
        {
            "Title": "Associated Alcohols Plans 1 Million Case Brand Growth",
            "Summary": "Associated Alcohols & Breweries outlines strategic expansion plans for Central Province brand through geographic growth, quality maintenance, and brand promotion, while expecting stable grain prices to support margins.",
            "Sentiment": "positive",
            "PublishDate": 1770349774412,
            "Source": "stocks"
        },
        {
            "Title": "Associated Alcohols Eyes 30-35% Volume Growth in FY26",
            "Summary": "Associated Alcohols & Breweries expects FY26 revenues similar to FY25 despite Inbrew deal changes, targeting 30-35% volume growth through premiumization.",
            "Sentiment": "positive",
            "PublishDate": 1770349516364,
            "Source": "stocks"
        },
        {
            "Title": "Associated Alcohols Q3FY26 Net Profit Rises 4.64%",
            "Summary": "Associated Alcohols & Breweries reported Q3FY26 net profit of ₹2,730.06 lakhs, up 4.64% YoY. Revenue declined 20.85% to ₹26,454.39 lakhs amid mixed segment performance.",
            "Sentiment": "neutral",
            "PublishDate": 1770222537565,
            "Source": "co_actions_results"
        },
        {
            "Title": "Associated Alcohols Board Meet on Feb 4 for Q3FY26",
            "Summary": "Associated Alcohols & Breweries Limited has scheduled a board meeting on February 04, 2026, to consider and approve Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769607067107,
            "Source": "co_actions_results"
        },
        {
            "Title": "Porinju Veliyath's Firm Buys 1.05% Stake in AALB",
            "Summary": "Equity Intelligence India Private, led by prominent investor Porinju Veliyath, acquired a 1.05% stake in Associated Alcohols & Breweries during Q3, marking a strategic investment in the alcoholic beverages sector.",
            "Sentiment": "positive",
            "PublishDate": 1768796813752,
            "Source": "co_actions_results"
        },
        {
            "Title": "Associated Alcohols schedules analyst meeting",
            "Summary": "Associated Alcohols & Breweries Limited has scheduled a 1x1 virtual analyst meeting with Nippon Life India Asset Management for January 14, 2026, as per regulatory requirements under SEBI Regulation 30.",
            "Sentiment": "neutral",
            "PublishDate": 1767965458632,
            "Source": "stocks"
        },
        {
            "Title": "Associated Alcohols Launches Premium Spirits in Jharkhand",
            "Summary": "Associated Alcohols & Breweries Limited has launched its premium product portfolio in Jharkhand, including Nicobar Indian Dry Gin, Titanium Triple Distilled Vodka, and premium whiskey brands Hillfort and Central Province.",
            "Sentiment": "positive",
            "PublishDate": 1765434475313,
            "Source": "stocks"
        },
        {
            "Title": "Associated Alcohols Breweries Seeks Shareholder Approval for Power Generation Business Expansion",
            "Summary": "Associated Alcohols Breweries Limited has issued a postal ballot notice seeking shareholder approval through special resolutions to alter its Memorandum and Articles of Association to include power generation activities including solar, wind, and other renewable energy sources. The amendments are required for compliance with Madhya Pradesh Power Transmission Company Limited and Madhya Pradesh Electricity Regulatory Commission guidelines for captive power generation, with e-voting scheduled from November 29, 2025 to December 28, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1764326861182,
            "Source": "corporate_action"
        },
        {
            "Title": "Associated Alcohols Breweries Reports Q2 FY26 Results with 37% Growth in Proprietary IMFL Brands",
            "Summary": "Associated Alcohols Breweries delivered strong 37% year-on-year growth in proprietary IMFL volumes at 5.66 lakh cases, while net revenue remained flat at INR 253 crores due to business model shift from licensing to contract manufacturing with Inbrew. The company expanded into Maharashtra and Uttar Pradesh markets, commissioned its malt plant in Barwaha with INR 55 crores capex, and received approval from Mexico to launch tequila products, targeting 30-35% growth in proprietary brands going forward.",
            "Sentiment": "positive",
            "PublishDate": 1763210610304,
            "Source": "earnings"
        },
        {
            "Title": "Associated Alcohols Breweries Board Approves Amendment to Add Electricity Generation Powers",
            "Summary": "Associated Alcohols Breweries Limited's Board of Directors approved amendments to the company's Memorandum of Association and Articles of Association at a meeting held on November 8, 2025. The amendments add provisions for captive electricity generation and consumption. Specifically, the company added power to captively generate and consume electrical power in Clause III(A)(2) of the MOA, and inserted a new Clause 156(A) in the AOA to empower the company to carry on electricity generation business. The amendments are subject to approval from the company's members.",
            "Sentiment": "neutral",
            "PublishDate": 1762610655703,
            "Source": "corporate_action"
        },
        {
            "Title": "Associated Alcohols Breweries Reports No Deviation in Convertible Warrants Fund Utilization",
            "Summary": "Associated Alcohols Breweries Limited filed its quarterly statement confirming no deviation or variation in the use of funds raised through convertible warrants. The company had two warrant issues: Rs. 43.65 crores raised on March 28, 2024 (9,00,000 warrants at Rs. 485 each) intended for loans/investments in subsidiary Associated Alcohols and Breweries (Awadh) Limited for a bottling and distillery unit in Uttar Pradesh, and Rs. 18.67 crores raised on October 7, 2024 (11,00,000 warrants at Rs. 679 each) for capital needs including future expansion projects like Malt plant and UP bottling cum distillery. The first warrant issue was fully converted to equity shares on September 4, 2025, while funds from the first issue remain unutilized and kept in treasury. The company confirmed funds are being used according to original objectives stated in the offer document.",
            "Sentiment": "neutral",
            "PublishDate": 1762604065647,
            "Source": "corporate_action"
        },
        {
            "Title": "Associated Alcohols Breweries Reports CFO Change and Quarterly Results",
            "Summary": "Associated Alcohols Breweries Limited announced key leadership changes and quarterly results. Tushar Bhandari resigned from his CFO position while continuing as Whole Time Director, and Dilip Kumar Inani was appointed as the new CFO. The company reported total income of INR 25,797.51 lakhs for the quarter ended September 30, 2025, compared to INR 25,975.30 lakhs in the same quarter last year. Net profit for the quarter was INR 1,400.58 lakhs versus INR 1,531.00 lakhs in the previous year. The board also approved amendments to the company's Memorandum and Articles of Association to include captive power generation. Additionally, the company converted 9,00,000 share warrants into equity shares after receiving INR 32.74 crores, with funds designated for investments in its wholly-owned subsidiary for establishing a bottling and distillery unit in Uttar Pradesh.",
            "Sentiment": "neutral",
            "PublishDate": 1762599097885,
            "Source": "earnings"
        },
        {
            "Title": "Associated Alcohols & Breweries Reports Decline in Q2 Financial Performance",
            "Summary": "Associated Alcohols & Breweries reported Q2 net profit of 140 million rupees compared to 153 million rupees in the same period last year. Revenue decreased to 2.57 billion rupees from 2.58 billion rupees year-over-year. EBITDA fell to 240 million rupees from 249 million rupees, while EBITDA margin contracted to 9.35% from 9.66% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762598778800,
            "Source": "earnings"
        },
        {
            "Title": "Associated Alcohols Breweries Schedules Q2 FY2025-26 Earnings Conference Call",
            "Summary": "Associated Alcohols Breweries Limited has scheduled an earnings conference call for investors and analysts on November 11, 2025, at 12:00 PM IST. The call will be conducted by Monarch Networth Capital Group to discuss the company's Q2 FY2025-26 earnings update. The company management participating includes Whole-Time Directors and Chief Executive Officer Anshuman Kedia. The company has informed stock exchanges BSE and NSE about this scheduled investor interaction.",
            "Sentiment": "neutral",
            "PublishDate": 1762338715504,
            "Source": "earnings"
        },
        {
            "Title": "Associated Alcohols & Breweries to Join SDF Industries Resolution Process for Kerala Bottling Expansion",
            "Summary": "Associated Alcohols & Breweries announced it will participate in the resolution process for SDF Industries. The company aims to increase its IMFL (Indian Made Foreign Liquor) bottling capacity in Kerala through this process.",
            "Sentiment": "positive",
            "PublishDate": 1762265906537,
            "Source": "stock"
        },
        {
            "Title": "Associated Alcohols Breweries Gets Credit Rating Upgrade from Crisil",
            "Summary": "Associated Alcohols Breweries Limited received a credit rating upgrade from Crisil. The company's long-term rating was revised to Crisil A-/Positive from A-/Stable, while the short-term rating of Crisil A2 was reaffirmed. The upgrade applies to the company's total bank loan facilities worth Rs. 160 crore. The facilities include bank guarantees, cash credit, and term loans across multiple banks including IDBI Bank, Axis Bank, HDFC Bank, and Kotak Mahindra Bank. The rating letter remains valid until March 31, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1761918236277,
            "Source": "stock"
        },
        {
            "Title": "Associated Alcohols & Breweries Receives SL-1 License, Commences Malt Spirit Production at Barwaha Facility",
            "Summary": "Associated Alcohols & Breweries has received approval for an SL-1 license from the Excise Department and has begun malt spirit production at its Barwaha facility. The license approval enables the company to expand its production capabilities at this location.",
            "Sentiment": "positive",
            "PublishDate": 1759840075255,
            "Source": "stock"
        },
        {
            "Title": "Associated Alcohols & Breweries Receives 2025 Barclays Private Clients Hurun India Legacy Builder Award",
            "Summary": "Associated Alcohols & Breweries Limited, part of the Associated Kedia Group, received the '2025 Barclays Private Clients Hurun India Legacy Builder of India's Distilling Industry' award. The ceremony was held on 18th September 2025 at the Four Seasons Hotel, Worli, Mumbai, organized by Hurun India and Barclays Private Clients. The award recognizes the company's legacy, leadership, and contributions to the Indian distilling industry. Key company members who received the award include Anshuman Kedia (Whole Time Director & CEO), Anand Kedia (Promoter), and Garima Kedia (member of promoter group).",
            "Sentiment": "positive",
            "PublishDate": 1758284576587,
            "Source": "stock"
        },
        {
            "Title": "Associated Alcohols & Breweries Reports 32% EBITDA Growth in Q1 FY26 Earnings Call",
            "Summary": "Associated Alcohols & Breweries Limited held an investor conference call discussing Q1 FY 2025-26 results. The company reported net revenue of Rs. 276 crores, up 6% year-on-year, with EBITDA at Rs. 37 crores, representing 32% growth and 14% margin. PAT reached Rs. 24 crores with 9% margin. Proprietary IMFL revenue grew 21% to Rs. 41.3 crores, while volumes increased 31% to 5.67 lakh cases. The company launched Central Province vodka and refreshed Titanium vodka packaging. Management announced plans to launch Culture ready-to-drink brand in Madhya Pradesh, followed by metro expansion. The company entered Maharashtra and Uttar Pradesh markets and commissioned a new malt plant for backward integration. Raw material costs stabilized with rice and maize prices cooling off. The company secured full ethanol allocations and planned Rs. 100 crores capex for maturation projects. Management expects to launch brandy before Diwali and tequila within 2-3 months. Marketing spend currently stands at 1% of revenue, planned to increase to 5%.",
            "Sentiment": "positive",
            "PublishDate": 1755164946347,
            "Source": "earnings"
        },
        {
            "Title": "Associated Alcohols & Breweries Makes Q1 FY2025 Earnings Call Audio Recording Available",
            "Summary": "Associated Alcohols & Breweries Limited has made the audio recording of their earnings call available on their company website. The call discussed the unaudited financial results for the quarter ended June 30, 2025. The earnings call was held on August 11, 2025, and the audio recording can be accessed at https://associatedalcohols.com/earning-call-audio-recording/. The company informed both BSE Limited and National Stock Exchange of India Limited about the availability of this recording.",
            "Sentiment": "neutral",
            "PublishDate": 1754922624770,
            "Source": "earnings"
        },
        {
            "Title": "Associated Alcohols & Breweries Plans Nationwide Expansion Targeting 15-20% Annual Growth",
            "Summary": "Associated Alcohols & Breweries has announced plans for nationwide expansion with a target of achieving 15-20% yearly growth in premium Indian Made Foreign Liquor (IMFL). The company's strategy focuses on brand improvement and entering new markets including Maharashtra, Puducherry, Uttar Pradesh, Karnataka, and Goa. Additionally, the company aims to maximize its ethanol capacity to boost profits and revenue.",
            "Sentiment": "positive",
            "PublishDate": 1754664939203,
            "Source": "stock"
        },
        {
            "Title": "Associated Alcohols & Breweries Reports Strong Q1 Performance with 34% Jump in Net Profit",
            "Summary": "Associated Alcohols & Breweries reported net profit of 237 million rupees for Q1, marking a significant increase from 177 million rupees in the same period last year. Revenue grew to 2.7 billion rupees compared to 2.56 billion rupees year-over-year. The company's EBITDA rose substantially to 408 million rupees from 281 million rupees, while EBITDA margin improved to 15.08% from 11.01% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754655208699,
            "Source": "earnings"
        },
        {
            "Title": "Associated Alcohols & Breweries Approves Q1 FY26 Financial Results and Reports No Fund Utilization Deviation",
            "Summary": "Associated Alcohols & Breweries Limited's Board of Directors approved the unaudited financial results for the quarter ended June 30, 2025. The company also confirmed no deviation in the utilization of funds raised through two preferential issues of convertible warrants. The first warrant issue from March 28, 2024 raised Rs. 10.91 crores (25% of total Rs. 43.65 crores consideration) for investment in wholly-owned subsidiary Associated Alcohols and Breweries (Awadh) Limited to set up a bottling cum distillery unit in Uttar Pradesh. The second warrant issue from October 7, 2024 raised Rs. 18.67 crores (25% of total Rs. 74.69 crores consideration) for capital requirements of future expansion projects including malt plant and UP bottling cum distillery. The funds from the second issue have been substantially utilized at Rs. 18.57 crores, while the first issue funds remain unutilized and kept in treasury for their designated purpose.",
            "Sentiment": "neutral",
            "PublishDate": 1754654669961,
            "Source": "earnings"
        },
        {
            "Title": "Associated Alcohols & Breweries Reappoints Independent Director, Declares 20% Dividend at AGM",
            "Summary": "Associated Alcohols & Breweries Limited held its 36th Annual General Meeting on August 2, 2025, where shareholders adopted financial statements for the year ended March 31, 2025, and declared a dividend of Rs. 2 per equity share (20% on Rs. 10 face value). The company reappointed Ms. Apurva Pradeep Joshi as Independent Director for a second five-year term from September 12, 2025 to September 11, 2030. Other approvals included reappointment of Mr. Tushar Bhandari as Director, revised managerial remuneration limits, revised compensation for Managing Director Mr. Prasann Kumar Kedia and Whole Time Director & CEO Mr. Anshuman Kedia, appointment of K. Arun & Co. as Secretarial Auditor, and approval of cost auditors' remuneration for 2025-26. All nine resolutions were passed with requisite majority, with 54 shareholders present through video conferencing.",
            "Sentiment": "positive",
            "PublishDate": 1754320189078,
            "Source": "corporate_action"
        },
        {
            "Title": "Associated Alcohols & Breweries Conducts 36th AGM, Recommends 20% Dividend",
            "Summary": "Associated Alcohols & Breweries Limited held its 36th Annual General Meeting on August 2, 2025 via video conferencing from 12:30 PM to 1:15 PM. The company's board recommended a dividend of 20% (₹2 per share) for the financial year ended March 31, 2025. The meeting addressed ordinary business including adoption of audited financial statements and reappointment of Tushar Bhandari as director. Special business items included reappointment of independent director Apurva Pradeep Joshi, approval of revised managerial remuneration limits, and revised compensation for Managing Director Prasann Kumar Kedia and Whole Time Director Anshuman Kedia. The company also approved appointment of K. Arun & Co. as secretarial auditors and remuneration for cost auditors for 2025-26. Out of 39,107 total members, 54 attended through video conferencing. The chairman provided an overview of business operations and performance during his address to shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1754138211291,
            "Source": "corporate_action"
        },
        {
            "Title": "Associated Alcohols & Breweries Shifts to Job Work Setup with Inbrew Beverages",
            "Summary": "Associated Alcohols & Breweries has announced a change in its operational setup with Inbrew Beverages Pvt. Ltd. The company is transitioning from a franchisee model to a job work arrangement. This change suggests a shift in the business relationship between the two companies, potentially affecting their operational dynamics and revenue structures.",
            "Sentiment": "neutral",
            "PublishDate": 1752239636000,
            "Source": "default"
        },
        {
            "Title": "Associated Alcohols & Breweries Ltd: Shares Surge on Premium Whiskey Launch",
            "Summary": "Associated Alcohols & Breweries Ltd launched Hillfort, a premium blended malt whiskey, in Uttar Pradesh. The company plans to introduce additional proprietary products as part of a pan-India expansion strategy. Shares surged over 8% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1751001916000,
            "Source": "normal_news"
        },
        {
            "Title": "Associated Alcohols Launches Premium Whisky 'Hillfort' in Uttar Pradesh",
            "Summary": "Associated Alcohols has introduced a new premium whisky brand called 'Hillfort' in the Uttar Pradesh market. This launch represents the company's entry into the premium whisky segment in this state.",
            "Sentiment": "positive",
            "PublishDate": 1750983017000,
            "Source": "default"
        },
        {
            "Title": "Associated Alcohols Launches Premium Whisky 'Hillfort' in Uttar Pradesh",
            "Summary": "Associated Alcohols has introduced a new premium whisky brand called 'Hillfort' in the Uttar Pradesh market. This launch represents an expansion of the company's product portfolio in the alcoholic beverage sector.",
            "Sentiment": "positive",
            "PublishDate": 1750949076000,
            "Source": "default"
        },
        {
            "Title": "Associated Alcohols and Breweries: Ambitious ₹2,000 Crore Revenue Target by 2028",
            "Summary": "AABL aims to double revenue from ₹1,150 crore in FY24 to ₹2,000-2,100 crore in 3-4 years. Strategy includes premiumization, brand diversification, and market expansion. Plans to launch new products in vodka, RTD, brandy, and tequila categories. Targeting 50% revenue from own IMFL brands.",
            "Sentiment": "positive",
            "PublishDate": 1749050937000,
            "Source": "normal_news"
        },
        {
            "Title": "Associated Alcohols & Breweries Ltd Reports Q4 Financial Results",
            "Summary": "Associated Alcohols & Breweries Ltd has released its Q4 financial results. The company reported a consolidated net profit of 223 million rupees, which is lower compared to 814 million rupees in the same quarter last year (YoY) and 260 million rupees in the previous quarter (QoQ). Revenue for Q4 stood at 2.48 billion rupees, down from 10.96 billion rupees YoY and 3.34 billion rupees QoQ.",
            "Sentiment": "negative",
            "PublishDate": 1745799326000,
            "Source": "default"
        },
        {
            "Title": "Associated Alcohols & Breweries: Penny Stock Soars 1,625% in 10 Years",
            "Summary": "Associated Alcohols & Breweries stock price has risen from ₹8 in 2014 to ₹1,380 currently, marking a 1,625% increase over 10 years. The company reported a 71.29% increase in net sales to ₹327.02 crore and a 107.56% rise in net profit to ₹26.09 crore for the December quarter. EBITDA grew by 83.76% to ₹40.63 crore.",
            "Sentiment": "positive",
            "PublishDate": 1742288546000,
            "Source": "earnings"
        },
        {
            "Title": "Associated Alcohols & Breweries Reports Strong Q3 Financial Results",
            "Summary": "Associated Alcohols & Breweries has announced its financial results for the third quarter. The company's net profit increased significantly to 261 million rupees, compared to 126 million rupees in the same period last year. Revenue also saw substantial growth, reaching 3.34 billion rupees, up from 1.9 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737936819000,
            "Source": "earnings"
        },
        {
            "Title": "Associated Alcohols & Breweries Reports Significant Q3 EBITDA Growth",
            "Summary": "Associated Alcohols & Breweries has announced its Q3 financial results, showing a substantial increase in EBITDA from 209 million rupees to 395 million rupees year-over-year. The company's EBITDA margin also improved, rising from 10.56% to 11.83% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1737726873000,
            "Source": "earnings"
        },
        {
            "Title": "Associated Alcohols & Breweries Reports Strong Q3 Financial Results",
            "Summary": "Associated Alcohols & Breweries has announced its financial results for the third quarter. The company's net profit has more than doubled to 261 million rupees, compared to 126 million rupees in the same quarter last year. Revenue also saw significant growth, reaching 3.34 billion rupees, up from 1.9 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1737726867000,
            "Source": "earnings"
        },
        {
            "Title": "Associated Alcohols Targets 15-20% Annual Growth, Expects 20%+ Margins in Premium Segment",
            "Summary": "Associated Alcohols has announced its growth targets and margin expectations during a recent conference call. The company is aiming for a year-on-year growth of 15% to 20%. Additionally, they anticipate achieving margins of over 20% in their premium product segment.",
            "Sentiment": "positive",
            "PublishDate": 1730087093000,
            "Source": "normal_news"
        },
        {
            "Title": "Associated Alcohols & Breweries Reports Q2 EBITDA Growth",
            "Summary": "Associated Alcohols & Breweries has reported its Q2 financial results. The company's EBITDA increased to 249 million rupees from 194 million rupees in the same quarter last year. However, the EBITDA margin decreased to 9.65% from 11.35% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1729780082000,
            "Source": "result"
        },
        {
            "Title": "Associated Alcohols & Breweries Reports Q2 Profit and Revenue Growth",
            "Summary": "Associated Alcohols & Breweries has announced its Q2 financial results. The company's net profit increased to 153 million rupees, up from 135 million rupees year-over-year. Revenue also saw significant growth, reaching 2.6 billion rupees compared to 1.71 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1729780036000,
            "Source": "result"
        }
    ]
}