{
    "Symbol": "ASHAPURMIN",
    "ISIN": "INE348A01023",
    "News": [
        {
            "Title": "Ashapura Minechem Independent Director Completes Term",
            "Summary": "Ashapura Minechem Limited announces cessation of Shri Pundarik Sanyal as Independent Director effective February 8, 2026, following completion of his second term of appointment.",
            "Sentiment": "neutral",
            "PublishDate": 1770727133043,
            "Source": "stocks"
        },
        {
            "Title": "Ashapura Minechem Receives SEBI Penalty Order",
            "Summary": "Ashapura Minechem Limited received SEBI adjudication order dated February 05, 2026, imposing monetary penalty of Rs. 2 lakhs for alleged violations of LODR Regulations.",
            "Sentiment": "negative",
            "PublishDate": 1770304327644,
            "Source": "stocks"
        },
        {
            "Title": "Ashapura Minechem Q3FY26 Results & Board Changes",
            "Summary": "Ashapura Minechem reported Q3FY26 consolidated revenue of ₹960.43 crores with PBT of ₹89.31 crores. Board approved key appointments including CEO re-appointment and two new independent directors.",
            "Sentiment": "positive",
            "PublishDate": 1770303347645,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ashapura Minechem Surges on Guinea Bauxite Expansion",
            "Summary": "Ashapura Minechem's H1FY26 revenue jumped 75% to ₹2,308 crore driven by bauxite exports from Guinea. Company plans to scale exports to 15 MMT by FY28 as global demand rises.",
            "Sentiment": "positive",
            "PublishDate": 1768009060012,
            "Source": "stocks"
        },
        {
            "Title": "Ashapura Industrial Finance Acquires 40,000 Shares",
            "Summary": "Ashapura Industrial Finance Limited acquired 40,000 equity shares in open market transaction, increasing shareholding from 17.75% to 17.79% as per SEBI disclosure regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1766551846931,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ashapura Minechem Completes Bridge in Guinea",
            "Summary": "Ashapura Minechem successfully completes construction of key bridge over Konkouro River in Guinea, establishing crucial link between Boffa East mines and Boffa Port for bauxite export operations.",
            "Sentiment": "positive",
            "PublishDate": 1765792132074,
            "Source": "stocks"
        },
        {
            "Title": "Ashapura Minechem Reports 57% Revenue Growth in Q2FY26, Doubles Guinea Bauxite Exports",
            "Summary": "Ashapura Minechem delivered consolidated revenue of Rs. 952.5 crore in Q2FY26 with 57% year-on-year growth, driven by Guinea bauxite exports of 1.33 million tons—nearly double the previous year's corresponding quarter. The company targets 15 million metric tons by FY27-28 and completed a Rs. 80 crore bridge project in Guinea to access larger, higher-quality bauxite deposits while securing long-term logistics arrangements.",
            "Sentiment": "positive",
            "PublishDate": 1764065637104,
            "Source": "earnings"
        },
        {
            "Title": "Ashapura Minechem Corrects Date Error for Q2 FY2026 Earnings Conference Call",
            "Summary": "Ashapura Minechem Limited corrected an inadvertent date error in their earnings conference call invitation, changing the date from September 21, 2025 to November 21, 2025. The company will discuss operational and financial performance for Q2 FY2026 with key management participants including promoter directors and senior executives.",
            "Sentiment": "neutral",
            "PublishDate": 1763558838999,
            "Source": "earnings"
        },
        {
            "Title": "Ashapura Minechem Reports Strong Q2 Performance with 118% Net Profit Growth",
            "Summary": "Ashapura Minechem delivered robust Q2 results with consolidated net profit surging to 966 million rupees from 443 million rupees year-over-year, while revenue jumped to 9.5 billion rupees from 6 billion rupees. The company's operational efficiency improved significantly with EBITDA rising to 1.3 billion rupees and margins expanding to 13.75% from 10.61% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1763074571639,
            "Source": "earnings"
        },
        {
            "Title": "Ashapura Minechem's Chetan Shah Transitions from Executive Chairman to Non-Executive Director",
            "Summary": "Chetan Shah's term as Executive Chairman of Ashapura Minechem Limited ended on October 23, 2025. He will continue serving on the Board as Non-Executive Director from the same date. Following this change, Shah has ceased to be designated as Key Managerial Personnel under the Companies Act, 2013 and SEBI regulations. Shah is related to Mrs. Himani Shah, who serves as Non-Executive Director on the company's board.",
            "Sentiment": "neutral",
            "PublishDate": 1761656052098,
            "Source": "corporate_governance"
        },
        {
            "Title": "Income Tax Department Conducts Search at Ashapura Minechem's Registered Office",
            "Summary": "The Income Tax Department conducted a search under Section 132 of the Income-Tax Act at Ashapura Minechem's registered office from October 13-16, 2025. During the search, certain records and electronic data were seized by authorities for further examination, and statements from company officials were recorded. The company cooperated with the proceedings and stated that no violations or contraventions have been committed or alleged. Business operations remain unaffected and continue as usual. The company indicated there is no financial impact as the search was for limited verification purposes of certain documents and records.",
            "Sentiment": "neutral",
            "PublishDate": 1760630213807,
            "Source": "stock"
        },
        {
            "Title": "Ashapura Minechem to Acquire Complete Stake in UAE Subsidiary",
            "Summary": "Ashapura Minechem plans to purchase the complete stake in Ashapura Holdings (UAE) FZE. The acquisition is aimed at operational improvements and internal changes within the organization.",
            "Sentiment": "positive",
            "PublishDate": 1759333408677,
            "Source": "order&deals"
        },
        {
            "Title": "Chetan Navnitlal Shah Acquires 35,000 Additional Shares in Ashapura Minechem Through Gift",
            "Summary": "Chetan Navnitlal Shah, a promoter of Ashapura Minechem Limited, acquired 35,000 equity shares through a gift transaction on September 29, 2025. The acquisition increased his shareholding from 1,36,38,814 shares (14.28%) to 1,36,73,814 shares (14.31%) in the company. The shares were acquired at no cost through a gift arrangement. Ashapura Minechem has a total equity share capital of 9,55,26,098 shares of Rs. 2 each, and its shares are listed on both BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1759316073711,
            "Source": "corporate_action"
        },
        {
            "Title": "Ashapura Minechem's Overseas Subsidiary Signs Strategic Agreement with China Railway for Guinea Bauxite Development",
            "Summary": "Ashapura Minechem's overseas subsidiary executed a long-term Strategic Co-operation Agreement with China Railway on September 15, 2025, to jointly develop the Boffa bauxite deposit in Guinea. Under the agreement, China Railway will provide support for mining operations, local logistics, and port handling & infrastructure services. The collaboration aims to boost production capabilities while driving economic growth and improving lives of local communities in the region, with focus on sustainable development and community welfare in Guinea.",
            "Sentiment": "positive",
            "PublishDate": 1758023249223,
            "Source": "order&deals"
        },
        {
            "Title": "Ashapura Minechem Reports 89.8% Revenue Growth in Q1 FY26, Driven by Guinea Bauxite Operations",
            "Summary": "Ashapura Minechem Limited held its maiden earnings conference call to discuss Q1 FY26 performance. The company reported consolidated revenue of INR 1,355 crores, representing 89.8% year-on-year growth, primarily driven by Guinea bauxite operations which contributed 79.3% of total revenue. EBITDA grew 106.8% to INR 187.73 crores with margins expanding to 13.85%. The company exported over 2 million metric tons of bauxite in the quarter compared to 3.37 million tons for the full previous year. Guinea operations are supported by three bauxite concessions with reserves exceeding 700 million tons and iron ore reserves of over 300 million tons. The company has invested over $135 million in Guinea infrastructure including three ports with 16 million ton capacity, expandable to 27 million tons by Q1 FY27. Management targets 15 million tons of bauxite exports by FY27-28. Indian operations focus on value-added mineral products, with the company being the largest bentonite producer in India and third largest globally. The company operates across 80+ countries and employs over 2,200 people with a 12-acre R&D facility staffed by 75+ scientists.",
            "Sentiment": "positive",
            "PublishDate": 1757421087763,
            "Source": "earnings"
        },
        {
            "Title": "Ashapura Minechem Conducts Maiden Earnings Conference Call for Q1-FY2026",
            "Summary": "Ashapura Minechem Ltd. held its first earnings conference call on September 04, 2025, from 16:00 to 17:10 IST to discuss operational and financial performance for Q1-FY2026. The call lasted 1 hour 10 minutes with participation from funds, investors, and analysts. The company made the audio recording available on its website and confirmed no unpublished price sensitive information was shared during the call. This maiden earnings call represents the company's new initiative toward improved investor communication and transparency, potentially enhancing investor relations and market engagement.",
            "Sentiment": "positive",
            "PublishDate": 1756992470943,
            "Source": "earnings"
        },
        {
            "Title": "Ashapura Minechem Schedules Maiden Earnings Conference Call for Q1-FY2026 Results",
            "Summary": "Ashapura Minechem Ltd. has scheduled its maiden earnings conference call on September 4, 2025, from 4:00 p.m. to 4:45 p.m. IST to discuss the company's operational and financial performance for Q1-FY2026. The call will be led by key management participants including Chairman Mr. Chetan Shah, Promoter Group member Mr. Manan Shah, Chief Financial Officer Mr. Ashish Desai, and Company Secretary & President Corporate Affairs Mr. Sachin Polke. Access will be provided through multiple international dial-in numbers and a Diamond Pass registration link.",
            "Sentiment": "neutral",
            "PublishDate": 1756382648713,
            "Source": "stock"
        },
        {
            "Title": "Ashapura Minechem Corrects Q1 FY2026 Results, Reports 89.81% Revenue Growth",
            "Summary": "Ashapura Minechem Ltd issued a correction to their quarterly press release, rectifying typographical errors in financial figures. The corrected consolidated results for Q1 FY 2025-26 show Income from Operations of Rs. 1,355.57 crores compared to Rs. 714.15 crores in Q1 FY 2024-25, representing an increase of 89.81%. Profit Before Tax rose to Rs. 131.84 crores from Rs. 65.10 crores, marking a 102.50% increase. The company's Bauxite export business from Guinea performed strongly with record quarterly exports of 2.05 MMT, the highest in company history, compared to 3.37 MMT for the entire previous fiscal year. All Indian business verticals showed growth in both volume and revenue. The company plans to hold an investor call in the first week of September 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755514638024,
            "Source": "earnings"
        },
        {
            "Title": "ED Conducts Search at Ashapura Minechem Office and Chairman's Residence, Freezes Bank Accounts",
            "Summary": "The Directorate of Enforcement conducted searches at Ashapura Minechem Limited's Mumbai office premises and Executive Chairman's residence on August 13-14, 2025. During the operation, officials collected documents and digital records, and issued a freezing order on some of the company's bank accounts. The action is connected to previous legal proceedings related to iron ore exports in FY 2010-11, involving a Special CBI Court case and an ongoing appeal in the High Court of Karnataka. The company states it does not expect any material operational or financial impact from this event and has extended full cooperation to authorities while planning to take necessary legal measures to protect its interests.",
            "Sentiment": "negative",
            "PublishDate": 1755170955758,
            "Source": "stock"
        },
        {
            "Title": "Ashapura Minechem Reports Strong Q1 Results with 89.81% Revenue Growth, Director Resignation, and Legal Challenge Against Bank of India",
            "Summary": "Ashapura Minechem Limited announced its Q1 FY2025-26 financial results with consolidated income from operations at Rs. 1,355.57 crores, up 89.81% year-over-year, and profit before tax at Rs. 131.84 crores, representing a 97.56% increase. The company's bauxite export business from Guinea performed exceptionally well, achieving record quarterly exports of 2.05 MMT. The board accepted the resignation of Mrs. Neeta Shah as Independent Director due to other professional commitments, effective August 12, 2025. The company scheduled its 44th Annual General Meeting for September 24, 2025. Additionally, Ashapura filed a Writ Petition in the Bombay High Court challenging Bank of India's demand for Rs. 65.91 crores under a recompense clause from a 2013 Compromise Deed, citing legal and regulatory violations. The company disputes the validity of the clause and seeks to quash the recall notice while challenging BOI's continued NPA classification despite full repayment of original dues.",
            "Sentiment": "positive",
            "PublishDate": 1755012874544,
            "Source": "earnings"
        },
        {
            "Title": "Ashapura Minechem Shareholders Approve Regularization of Surekha Sathe as Independent Woman Director",
            "Summary": "Ashapura Minechem Ltd declared the results of a postal ballot conducted to seek shareholder approval for regularizing Smt. Surekha Sathe (DIN: 11109425) as a Non-Executive Independent (Woman) Director. The postal ballot notice was issued on June 27, 2025, and the results were declared on July 31, 2025, at the company's registered office. Mr. Virendra Bhatt, a practicing company secretary, served as the scrutinizer for the postal ballot process and submitted his report. The company has submitted the voting results and scrutinizer's report to stock exchanges and uploaded them on the company website.",
            "Sentiment": "neutral",
            "PublishDate": 1753970643261,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ashapura Minechem Resolves Tax Dispute, Restores ₹259.20 Crore Losses",
            "Summary": "Ashapura Minechem has resolved a tax dispute, resulting in the restoration of ₹259.20 crore in losses. The company successfully settled the matter with tax authorities, which had previously disallowed these losses. This resolution is likely to have a positive impact on the company's financial position.",
            "Sentiment": "positive",
            "PublishDate": 1752019600000,
            "Source": "default"
        },
        {
            "Title": "Ashapura Minechem Resolves Tax Dispute, Recovers ₹259.20 Crore",
            "Summary": "Ashapura Minechem has successfully resolved a tax dispute, resulting in the recovery of ₹259.20 crore in losses. The company managed to settle the issue with tax authorities, leading to this significant financial recovery. This resolution is likely to have a positive impact on the company's financial position.",
            "Sentiment": "positive",
            "PublishDate": 1751982773000,
            "Source": "default"
        },
        {
            "Title": "Ashapura Minechem Reports Q4 Results and Declares Dividend",
            "Summary": "Ashapura Minechem announced its Q4 financial results and a dividend declaration. The company's Q4 EBITDA increased to 845 million rupees from 484 million rupees year-over-year, with EBITDA margin improving to 15.21% from 10.99%. Consolidated net profit for Q4 rose to 865 million rupees from 685 million rupees year-over-year, but decreased from 1.05 billion rupees quarter-on-quarter. Q4 revenue grew to 5.65 billion rupees from 4.4 billion rupees year-over-year. The company also declared a dividend of 1 rupee per share.",
            "Sentiment": "positive",
            "PublishDate": 1748616537000,
            "Source": "result"
        },
        {
            "Title": "Ashapura Minechem Reports Strong Q3 Financial Results",
            "Summary": "Ashapura Minechem has announced its Q3 consolidated financial results. The company's net profit increased to 1.05 billion rupees, up from 563 million rupees year-over-year and 443 million rupees quarter-over-quarter. Revenue for Q3 rose to 8.65 billion rupees, compared to 7.1 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739751347000,
            "Source": "earnings"
        },
        {
            "Title": "Ashapura Minechem Reports Significant Profit Growth in Q3",
            "Summary": "Ashapura Minechem has announced its Q3 consolidated financial results. The company's net profit has increased to 1.05 billion rupees, showing substantial growth from 563 million rupees year-over-year and 443 million rupees quarter-over-quarter. Revenue for Q3 also rose to 8.65 billion rupees, up from 7.1 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739544550000,
            "Source": "earnings"
        },
        {
            "Title": "Ashapura Minechem Signs MOU with China Railway for Bauxite Development in Guinea",
            "Summary": "Ashapura Minechem has entered into a long-term Memorandum of Understanding (MOU) with China Railway. The agreement aims to jointly develop the Fako bauxite deposit located in the Kindia region of Guinea. This partnership signifies a strategic move for Ashapura Minechem to expand its bauxite mining operations in West Africa.",
            "Sentiment": "positive",
            "PublishDate": 1737333459000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ashapura Minechem Signs MOU with China Railway for Bauxite Development in Guinea",
            "Summary": "Ashapura Minechem has entered into a long-term Memorandum of Understanding (MOU) with China Railway. The agreement aims to jointly develop the Fako bauxite deposit located in the Kindia region of Guinea. This partnership signifies a strategic move for Ashapura Minechem to expand its bauxite mining operations in West Africa.",
            "Sentiment": "positive",
            "PublishDate": 1737125909000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ashapura Minechem Reports Strong Q2 EBITDA Growth",
            "Summary": "Ashapura Minechem has reported significant year-over-year improvements in its Q2 financial results. The company's EBITDA increased to 640.7 million rupees, up from 305 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 10.61% from 5.50% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1731590094000,
            "Source": "result"
        },
        {
            "Title": "Ashapura Minechem Reports Q2 Revenue Growth",
            "Summary": "Ashapura Minechem has reported a revenue of 6 billion rupees for the second quarter, compared to 5.54 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731589408000,
            "Source": "result"
        },
        {
            "Title": "Ashapura Minechem Reports Q2 Consolidated Net Profit",
            "Summary": "Ashapura Minechem has reported a consolidated net profit of 443 million rupees for the second quarter. This represents a year-over-year decrease from 593 million rupees and a quarter-over-quarter decrease from 596 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1731589347000,
            "Source": "result"
        }
    ]
}