{
    "Symbol": "ASHIMASYN",
    "ISIN": "INE440A01010",
    "News": [
        {
            "Title": "Ashima Limited Completes Postal Ballot for Director",
            "Summary": "Ashima Limited successfully conducted postal ballot through remote e-voting for redesignation of Mr. Sanjay Majmudar from independent to non-independent director, with 99.97% approval from shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1770456458270,
            "Source": "stocks"
        },
        {
            "Title": "Ashima Limited Reconstitutes Audit Committee",
            "Summary": "Ashima Limited has reconstituted its Audit Committee effective January 6, 2026, with Mr. Nilesh Mehta appointed as the new Chairman, replacing Mr. Sanjay Majmudar who continues as a member with changed category status.",
            "Sentiment": "neutral",
            "PublishDate": 1767705523251,
            "Source": "stocks"
        },
        {
            "Title": "Ashima Limited Board Approves Director Redesignation",
            "Summary": "Ashima Limited's board approved redesignation of Mr. Sanjay Majmudar from Independent to Non-Independent Director due to potential professional service engagement, effective January 6, 2026, subject to postal ballot approval.",
            "Sentiment": "neutral",
            "PublishDate": 1767686502646,
            "Source": "stocks"
        },
        {
            "Title": "Ashima Limited Reports Quarterly Results and Announces Registered Office Relocation",
            "Summary": "Ashima Limited's Board approved unaudited financial results for the quarter and half year ended September 30, 2025. The company reported revenue from operations of Rs 277 lacs for the quarter compared to Rs 370 lacs in the previous quarter. The company posted a net loss of Rs 808 lacs for the quarter versus a loss of Rs 283 lacs in the previous quarter. For the half year, revenue stood at Rs 805 lacs with a net loss of Rs 4,062 lacs. The Board also approved relocation of the company's registered office from Texcellence Complex, Khokhra to 1st Floor, Aditya, Near Khadayata Colony, Ellisbridge, Ahmedabad, effective November 30, 2025. The company operates in real estate, investment, and investment management advisory services segments.",
            "Sentiment": "negative",
            "PublishDate": 1763018077349,
            "Source": "earnings"
        },
        {
            "Title": "Ashima Limited Senior Manager (HR) Dhaval Thakkar Resigns Due to Personal Reasons",
            "Summary": "Ashima Limited announced the resignation of Mr. Dhaval Thakkar, Senior Manager (Human Resources) and designated Senior Management Personnel, effective November 12, 2025. Thakkar cited personal reasons for his departure and confirmed there are no other material reasons for his resignation. He served the Ashima Group for 1.3 years. The company disclosed this information to BSE and NSE in compliance with SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762933631984,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ashima Limited Redeems ₹24.25 Crore Worth of Non-Convertible Debentures",
            "Summary": "Ashima Limited exercised its call option for partial early redemption of unlisted, secured, unrated, redeemable, rupee-denominated non-convertible debentures (NCDs). The company redeemed ₹24.25 crore from two debenture holders - ₹12.125 crore each from Crystal Quinone Pvt Ltd and Sharanam Metrolinks LLP. The redemption was executed by reducing the paid-up value of existing NCDs rather than cancelling them. Originally, 5,500 NCDs worth ₹55 crore were issued to both holders combined, with each NCD having a face value of ₹1 lakh. After the partial redemption, ₹30.75 crore remains outstanding. The redemption date is on or before October 15, 2025. Premium on redemption will be computed and paid at the end of the NCD tenure. The remaining debentures will continue under their original terms.",
            "Sentiment": "neutral",
            "PublishDate": 1758026601371,
            "Source": "corporate_action"
        },
        {
            "Title": "Ashima Limited Reports Rs 185 Lakh Loss in Q1 FY2025-26 Despite Rs 350 Lakh Total Income",
            "Summary": "Ashima Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported total income of Rs 350 lakhs, comprising Rs 244 lakhs from operations and Rs 106 lakhs from other income. Despite this, the company posted a loss of Rs 185 lakhs for the period, with a loss before tax of Rs 12 lakhs from continuing operations. This marks a decline from the previous quarter when the company reported a profit of Rs 524 lakhs. The real estate segment generated Rs 244 lakhs in revenue with a segment result of Rs 379 lakhs, while the investment segment contributed Rs 265 lakhs to results despite no revenue. Discontinued operations from cotton textiles showed Rs 29 lakhs revenue but resulted in a Rs 73 lakh loss. The company has transitioned from textile manufacturing to focus on real estate and investment activities, with land development and construction costs of Rs 1,822 lakhs during the quarter. Earnings per share for continuing operations stood at Rs (0.10).",
            "Sentiment": "negative",
            "PublishDate": 1754983561289,
            "Source": "earnings"
        },
        {
            "Title": "Ashima Limited Allots Rs 70 Crore Non-Convertible Debentures Through Private Placement",
            "Summary": "Ashima Limited has allotted 7,000 unlisted, secured, unrated, redeemable, non-convertible debentures worth Rs 70 crores through private placement. Each debenture has a face value of Rs 1 lakh. This issuance is part of the company's previously approved fund-raising plan of up to Rs 130 crores. The debentures carry an interest rate of 7.50% per annum with annual interest payments due on March 31st. The instruments have a tenure of 9 years from the allotment date of July 31st, 2025, with subscribers having a put option after 2 years for partial or full redemption. The debentures are secured by a first charge on non-agricultural land through a registered mortgage deed. In case of payment delays, the company will pay additional interest at 1% per annum for the delay period.",
            "Sentiment": "positive",
            "PublishDate": 1753952832437,
            "Source": "corporate_action"
        },
        {
            "Title": "Ashima Limited Allots Rs 50 Crore Non-Convertible Debentures with 7.50% Interest Rate",
            "Summary": "Ashima Limited has allotted 5,000 unlisted, secured, unrated, redeemable non-convertible debentures worth Rs 50 crores through private placement. Each debenture has a face value of Rs 1 lakh with a 9-year tenure and carries an annual interest rate of 7.50%. The NCDs are secured by a first charge on non-agricultural land and offer subscribers a put option after 2 years for partial or full redemption. Interest payments are scheduled annually on March 31st, with the principal amount to be repaid at maturity. In case of payment delays, the company will pay additional interest at 1% per annum. This issuance is part of the company's broader fundraising plan of up to Rs 130 crores through NCDs in multiple tranches.",
            "Sentiment": "neutral",
            "PublishDate": 1753096253996,
            "Source": "corporate_action"
        },
        {
            "Title": "Ashima Limited's Unit Receives SEBI Registration as Portfolio Manager",
            "Summary": "A unit of Ashima Limited has been granted registration as a portfolio manager under the Securities and Exchange Board of India (SEBI) regulations. This registration allows the company's unit to offer portfolio management services to clients.",
            "Sentiment": "positive",
            "PublishDate": 1736150043000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ashima Limited Reports Increased Q2 Net Loss",
            "Summary": "Ashima Limited has reported a net loss of 119 million rupees for the second quarter, compared to a loss of 12.7 million rupees in the same period last year. This represents a significant increase in the company's losses year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731482612000,
            "Source": "result"
        }
    ]
}