{
    "Symbol": "ASHIANA",
    "ISIN": "INE365D01021",
    "News": [
        {
            "Title": "Ashiana Housing corrects record date day for dividend",
            "Summary": "Ashiana Housing Ltd issued a clarification correcting the day mentioned for the interim dividend record date for FY 2025-26 from Friday to Thursday, with no other changes to the record date details.",
            "Sentiment": "neutral",
            "PublishDate": 1770878894379,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ashiana Housing Q3FY26 Net Profit Jumps 415% YoY",
            "Summary": "Ashiana Housing reported strong Q3FY26 results with net profit rising 415% YoY to Rs 5,691 lakhs. Revenue surged 198% to Rs 34,258 lakhs while the company declared Rs 1 interim dividend.",
            "Sentiment": "positive",
            "PublishDate": 1770729951927,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ashiana Housing Converts 242 Units Worth ₹767.23 Cr",
            "Summary": "Ashiana Housing successfully converted 242 EOI units into bookings at Ashiana Aaroham project in Gurugram, crossing ₹2,000 crore milestone for current financial year.",
            "Sentiment": "positive",
            "PublishDate": 1770614786110,
            "Source": "stocks"
        },
        {
            "Title": "Ashiana Housing Q3FY26 Results Call on Feb 12",
            "Summary": "Ashiana Housing Limited has scheduled a conference call on February 12, 2026, at 4:00 PM IST to discuss Q3FY26 and nine-month financial results with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1770467462769,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ashiana Housing Acquires 8.83 Acres in Pune for Senior Living",
            "Summary": "Ashiana Housing Ltd. has acquired 8.83 acres of land in Pune, Maharashtra for developing a Senior Living project with approximately 4.50 lakh sq. ft. of saleable area.",
            "Sentiment": "positive",
            "PublishDate": 1770307556695,
            "Source": "stocks"
        },
        {
            "Title": "Ashiana Housing Board Meet Set for Feb 6, 2026",
            "Summary": "Ashiana Housing Ltd schedules board meeting on February 06, 2026 to approve Q3FY26 unaudited financial results and consider interim dividend declaration for FY2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769498667457,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ashiana Housing faces ₹24.58 lakh GST audit observations",
            "Summary": "Ashiana Housing receives GST audit observations worth ₹24.58 lakh from Jamshedpur GST Department for FY 2020-21 to 2023-24, with ₹16.60 lakh already paid and remaining amount under verification.",
            "Sentiment": "negative",
            "PublishDate": 1769001917353,
            "Source": "stocks"
        },
        {
            "Title": "Ashiana Housing Q3 sales rise sequentially",
            "Summary": "Ashiana Housing reported sequential improvement in Q3FY26 sales to ₹401.07 crore and area bookings of 5.56 lakh sq ft, though nine-month performance trails previous year due to lighter launch pipeline.",
            "Sentiment": "neutral",
            "PublishDate": 1767960599243,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ashiana Housing Q3FY26 Sales Drop 12% YoY to ₹401.07 Cr",
            "Summary": "Ashiana Housing reported area bookings of 5.56 lakh sq. ft. worth ₹401.07 crores in Q3FY26, down from ₹454.16 crores in Q3FY25. New project launches and handovers marked the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1767954356116,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ashiana Housing Faces ₹12.94L GST Demand Order",
            "Summary": "Ashiana Housing receives GST demand of ₹12,94,084 from Jaipur authorities for alleged wrong ITC availment. Company plans to contest the order through appeal process.",
            "Sentiment": "negative",
            "PublishDate": 1767341654347,
            "Source": "stocks"
        },
        {
            "Title": "Senior Living Market Reshapes Retirement Planning",
            "Summary": "India's organised senior living market projected to reach $8 billion by 2030 as rising healthcare costs and safety concerns drive demand for integrated retirement communities with predictable expenses.",
            "Sentiment": "positive",
            "PublishDate": 1767262854397,
            "Source": "stocks"
        },
        {
            "Title": "Ashiana Housing Faces ₹19.49 Lakh GST Demand",
            "Summary": "Ashiana Housing receives GST demand of ₹19.49 lakh from Haryana tax authorities for alleged wrong ITC availment and short payment under reverse charge mechanism. Company plans to contest the order.",
            "Sentiment": "negative",
            "PublishDate": 1767010820750,
            "Source": "stocks"
        },
        {
            "Title": "Ashiana Housing Gets Credit Rating Reaffirmation",
            "Summary": "CARE Edge reaffirms CARE A; Stable rating for Ashiana Housing's issuer rating and ₹454.08 crores worth of NCD issues across multiple tranches.",
            "Sentiment": "positive",
            "PublishDate": 1766756126831,
            "Source": "stocks"
        },
        {
            "Title": "Ashiana Housing Converts 92 Units Worth ₹145.34 Cr",
            "Summary": "Ashiana Housing completes conversion of 92 units in Ashiana Amaya project, Jamshedpur with sale value of ₹145.34 crores. EOI to booking conversion process started December 14, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765878646697,
            "Source": "stocks"
        },
        {
            "Title": "Ashiana Housing Receives ₹5.24 Lakh Tax Demand from Income Tax Department",
            "Summary": "The Income Tax Department, Delhi has issued a demand of ₹5,24,881 (including interest) to Ashiana Housing under sections 201(1)/201(1A) for non-deduction and non-deposit of TDS on annual lease rentals paid to UIT (Bhiwadi) for FY 2013-14. The company states no significant impact on financial or operational performance and is exploring legal avenues to contest the order while reviewing its records.",
            "Sentiment": "negative",
            "PublishDate": 1765003597975,
            "Source": "stock"
        },
        {
            "Title": "Ashiana Housing Closes Trading Window Ahead of Board Meeting on Fund Raising",
            "Summary": "Ashiana Housing has closed its trading window from December 4, 2025 for designated employees, relatives and insiders ahead of a board meeting scheduled for December 11, 2025. The board meeting will decide on raising funds through the issue of unsecured non-convertible debentures on private placement basis, with trading window reopening on December 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764857549929,
            "Source": "corporate_action"
        },
        {
            "Title": "Ashiana Housing Reports Q2 FY26 Results with INR 27.54 Crore PAT and Strong Cash Flow Generation",
            "Summary": "Ashiana Housing achieved value of area booked of INR 303.43 crores in Q2 FY26 with PAT of INR 27.54 crores, driven by better margin projects and healthy cash flow of INR 122.62 crores. The company acquired 22.7 acres in Chennai for senior living project worth INR 1,200 crores and plans to launch Ashiana Aaroham and Amaya projects in Q4, targeting INR 2,000 crores presales for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1763646541368,
            "Source": "earnings"
        },
        {
            "Title": "Ashiana Housing Reports Mixed Q2FY26 Results with 19% Decline in Bookings but Strong PAT Growth",
            "Summary": "Ashiana Housing recorded area bookings of Rs. 303.43 crores in Q2FY26, down from Rs. 430.97 crores in Q1FY26 and Rs. 672.54 crores in Q2FY25, while launching Swarang Phase 2 in Chennai. The company's PAT surged to Rs. 27.54 crores in Q2FY26 from Rs. 12.72 crores in Q1FY26, driven by higher-margin sales from Projects Advik and Tarang, plus a Rs. 18.50 crore settlement from Project Maitri dispute resolution.",
            "Sentiment": "neutral",
            "PublishDate": 1763060844569,
            "Source": "earnings"
        },
        {
            "Title": "Ashiana Housing Plans Expansion With ₹6,000 Crore Project Pipeline",
            "Summary": "Ashiana Housing has outlined growth plans with a ₹6,000 crore project pipeline spanning senior living and mid-income housing segments. The company is expanding its presence in Jaipur, Pune, and Chennai markets. The strategy emphasizes faster project execution and improved cash-flow efficiency to support high-return projects.",
            "Sentiment": "positive",
            "PublishDate": 1762960552153,
            "Source": "stock"
        },
        {
            "Title": "Ashiana Housing Reports Net Profit of Rs 1,327 Crores in Q2 FY2026",
            "Summary": "Ashiana Housing Limited announced its quarterly results for the quarter ended September 30, 2025. The company reported a net profit of Rs 1,327 crores compared to a net loss of Rs 1,238 crores in the same quarter of the previous year. Net sales income from operations stood at Rs 16,577 crores for the quarter. The Board of Directors approved the unaudited financial results in their meeting held on November 12, 2025. The company maintains security cover for its Non-Convertible Debentures totaling Rs 328.15 crores outstanding as of September 30, 2025. Cash and cash equivalents increased to Rs 40,526 crores at the end of the half-year period compared to Rs 26,795 crores in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762960292422,
            "Source": "earnings"
        },
        {
            "Title": "Ashiana Housing Reports Strong Q2 Turnaround with 275M Rupees Net Profit",
            "Summary": "Ashiana Housing reported a net profit of 275 million rupees in Q2, compared to a loss of 76 million rupees in the same period last year. The company's revenue increased significantly to 1.66 billion rupees from 544 million rupees year-over-year. EBITDA turned positive at 291 million rupees versus a loss of 117 million rupees in the previous year, with an EBITDA margin of 17.58%.",
            "Sentiment": "positive",
            "PublishDate": 1762953632250,
            "Source": "earnings"
        },
        {
            "Title": "Ashiana Housing Faces Consumer Complaint Seeking ₹54.88 Crores Compensation",
            "Summary": "Ashiana Housing has received a consumer complaint filed by residents of its Ashiana Town Beta project at the National Consumer Disputes Redressal Commission (NCDRC). The residential project in Bhiwadi, Rajasthan was constructed and delivered in three phases between 2013-2018. The complaint alleges deficiency in services and unfair trade practices, with residents seeking compensation of approximately ₹54.88 crores. The company has decided to contest the matter after taking legal advice and is preparing to file a suitable reply to the complaint. Ashiana Housing stated there would be no financial implication or impact on operations until the matter is decided by the appropriate judicial authority.",
            "Sentiment": "negative",
            "PublishDate": 1761891169306,
            "Source": "stock"
        },
        {
            "Title": "Ashiana Housing Launches Rs 350-Crore Housing Project in Jamshedpur",
            "Summary": "Ashiana Housing Ltd has launched 'Ashiana Amaya', a new housing project in Dobo, New Jamshedpur, expecting Rs 350 crore in revenue. The project spans 3.86 acres with 4.64 lakh sq ft of saleable area and will feature 230 homes priced starting at Rs 1.34 crore. The development will be completed by December 2029 under a joint venture model, funded through self-funding and customer advances. Delhi-based Ashiana Housing operates over 55 projects and specializes in real estate development including senior living projects.",
            "Sentiment": "positive",
            "PublishDate": 1760878456721,
            "Source": "stock"
        },
        {
            "Title": "Ashiana Housing Reports Q2 FY'26 Operational Results with 4.13 Lakh Sq. Ft. Area Booked",
            "Summary": "Ashiana Housing reported operational results for Q2 FY'26, with area booked at 4.13 lakh sq. ft. and sales value of INR 303.43 crores. The company booked 307 units during the quarter, compared to 407 units in Q1 FY'26 and 482 units in Q2 FY'25. The company launched Ashiana Swarang Phase-2 in Q2 FY'26, selling 16 units out of 80 total units for INR 20.19 crores. Performance declined compared to previous quarters - Q1 FY'26 recorded 5.95 lakh sq. ft. area booked with sales value of INR 430.97 crores, while Q2 FY'25 showed 7.30 lakh sq. ft. with INR 673.05 crores in sales. The company commenced handovers for Ashiana Tarang Phase IV-B and Ashiana Advik Phase-1 projects in Bhiwadi during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1760463388869,
            "Source": "stock"
        },
        {
            "Title": "Ashiana Housing Shareholders Approve Re-appointment of Three Directors for Three-Year Terms",
            "Summary": "Ashiana Housing Ltd shareholders approved the re-appointment of three key directors at the 39th Annual General Meeting held on September 25, 2025. Vishal Gupta was re-appointed as Managing Director, Ankur Gupta as Joint Managing Director, and Varun Gupta as Whole-time Director, all for three-year terms. Vishal and Ankur Gupta's appointments are effective from April 1, 2025, while Varun Gupta's term begins July 1, 2025. The three directors are brothers and bring extensive experience to the company - Vishal has been associated with the company for 28 years focusing on finance and project execution, Ankur for over 22 years with expertise in real estate and seniors housing, and Varun for 16 years handling land procurement, legal and finance matters. The re-appointments were made considering their qualifications, experience, and the company's expanding operations in a complex business environment.",
            "Sentiment": "positive",
            "PublishDate": 1758809371925,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ashiana Housing Acquires 23-Acre Chennai Land for Rs 1,200 Crore Senior Living Project",
            "Summary": "Ashiana Housing acquired 22.71 acres of land on perpetual lease from Mahindra World City Developers Ltd in Chennai to develop a senior living project featuring villas and apartments. The land is adjacent to the company's existing 'Ashiana Vatsalya' project and has a saleable area of approximately 15 lakh square feet with sales potential of Rs 1,200 crore. The company currently operates nine ongoing projects across Bhiwadi, Chennai, Jaipur, Pune, and Lavasa, and plans to expand into Bengaluru and Mumbai. Ashiana Housing reported sales bookings of Rs 430.97 crore in the first quarter, representing an 83% increase from Rs 235.32 crore in the same period last year. The company sold 5.95 lakh square feet during April-June compared to 4.42 lakh square feet in the previous year. Total property sales reached Rs 1,936.75 crore for the entire 2024-25 fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1756353103169,
            "Source": "stock"
        },
        {
            "Title": "Ashiana Housing Acquires 22.71 Acres in Chennai for Senior Living Project Worth INR 1,200 Crores",
            "Summary": "Ashiana Housing has purchased 22.71 acres of land in Chennai under a perpetual lease arrangement. The acquisition will be developed into a senior living project with a total saleable area of 15 lakh square feet and an estimated sales potential of INR 1,200 crores.",
            "Sentiment": "positive",
            "PublishDate": 1756198181969,
            "Source": "stock"
        },
        {
            "Title": "Ashiana Housing Plans ₹1,100 Cr Project Pipeline with Geographic Expansion and Premium Senior Living Focus",
            "Summary": "Ashiana Housing is targeting accelerated growth through a ₹1,100 crore project launch pipeline. The company's strategy includes geographic diversification and a focus on premium senior living communities.",
            "Sentiment": "positive",
            "PublishDate": 1755016061706,
            "Source": "stock"
        },
        {
            "Title": "Ashiana Housing Reports Q1FY26 Results with Rs 431 Crore Area Bookings and New Project Launches",
            "Summary": "Ashiana Housing reported Value of Area Booked at Rs 430.97 crores in Q1FY26 compared to Rs 574.72 crores in Q4FY25 and Rs 235.32 crores in Q1FY25. The company launched the sixth phase of Ashiana Tarang in Bhiwadi and Ashiana Aravali in Jaipur during the quarter. Total revenue increased 32% quarter-on-quarter to Rs 302.72 crores in Q1FY26 from Rs 229.48 crores in Q4FY25, driven by higher deliveries of 5.08 lakh square feet versus 4.31 lakh square feet in the previous quarter. However, profit after tax declined to Rs 12.72 crores in Q1FY26 from Rs 20.34 crores in Q4FY25, attributed to lower gross profit margins in current deliveries compared to the previous quarter. The company started handovers for Anmol Phase 2 in Gurugram and Shubham Phase 4B in Chennai. Average realization price improved to Rs 7,245 per square foot in Q1FY26 from Rs 6,774 in Q4FY25, mainly driven by bookings in Ashiana Amarah Phase 5.",
            "Sentiment": "neutral",
            "PublishDate": 1755004708826,
            "Source": "earnings"
        },
        {
            "Title": "Ashiana Housing Reports 35% Jump in Net Profit to Rs 12.77 Crore in Q1",
            "Summary": "Ashiana Housing Limited reported a net profit of Rs 12.77 crore for the quarter ended June 30, 2025, compared to a loss of Rs 5.34 crore in the same quarter last year. Total income increased to Rs 282.84 crore from Rs 108.56 crore year-on-year. The company's operating margin improved to 9.37% from 6.08% in the previous year quarter. Ashiana Housing issued 10,000 Non-Convertible Debentures worth Rs 100 crore to International Finance Corporation in July 2025 for its Ashiana Asroham project in Gurugram. The Board recommended a final dividend of Rs 1.5 per equity share for FY2025, subject to shareholder approval at the annual general meeting scheduled for September 25, 2025. The company maintains a debt-equity ratio of 0.31 and current ratio of 1.37.",
            "Sentiment": "positive",
            "PublishDate": 1754995545585,
            "Source": "earnings"
        },
        {
            "Title": "Ashiana Housing Plans ₹425 Crore Investment in Senior Living Segment for FY2025-26",
            "Summary": "Ashiana Housing Limited announced plans to invest ₹425 crore in its senior living segment for FY2025-26, including expansion into Mumbai, Pune, Bangalore, and Delhi NCR markets. The company reported ₹382 crore in bookings for FY2024-25 in this segment and aims for ₹450 crore in the current year, with senior living now accounting for over 30% of its residential portfolio. The company plans to launch five new phases in existing projects covering approximately 5.71 lakh square feet of saleable area. Currently operating nine projects across Bhiwadi, Chennai, Jaipur, Pune, and Lavasa, the company constructed approximately 5.38 lakh square feet in the senior living segment last year with an outlay of ₹213 crore.",
            "Sentiment": "positive",
            "PublishDate": 1754391638994,
            "Source": "stock"
        },
        {
            "Title": "Ashiana Housing: Targets Rs 2,000 Crore Pre-Sales Revenue for FY26",
            "Summary": "Ashiana Housing aims for Rs 2,000 crore pre-sales and Rs 1,200 crore revenue in FY26. The company plans to launch two new projects in Gurugram and Jamshedpur in Q3 or Q4 of the current fiscal year. It's shifting focus towards senior living projects and expects cumulative PAT of Rs 2,000 crore between FY24-30.",
            "Sentiment": "positive",
            "PublishDate": 1752628733000,
            "Source": "normal_news"
        },
        {
            "Title": "Ashiana Housing Allocates ₹100 Crore in Non-Convertible Debentures to IFC",
            "Summary": "Ashiana Housing has allocated ₹100 crore in Non-Convertible Debentures (NCDs) to the International Finance Corporation (IFC) through a private placement.",
            "Sentiment": "neutral",
            "PublishDate": 1752237306000,
            "Source": "default"
        },
        {
            "Title": "Ashiana Housing: Q1 Sales Surge 83% to ₹431 Crore",
            "Summary": "Ashiana Housing reported an 83% year-on-year increase in sales value to ₹430.97 crore in Q1 FY26. Area booked grew 35% to 5.95 lakh square feet. The company launched two new projects: Ashiana Tarang Phase 6 in Bhiwadi and Ashiana Aravali in Jaipur, contributing significantly to sales.",
            "Sentiment": "positive",
            "PublishDate": 1752233924000,
            "Source": "earnings"
        },
        {
            "Title": "Ashiana Housing Reports Significant Increase in Q1 Area Sales Value",
            "Summary": "Ashiana Housing has reported an area sales value of 4.31 billion rupees in the first quarter, compared to 2.35 billion rupees in the same period last year. This represents a substantial increase in the company's sales performance.",
            "Sentiment": "positive",
            "PublishDate": 1752233871000,
            "Source": "default"
        },
        {
            "Title": "Ashiana Housing Targets Land Inventory Expansion and Reports Secured Revenue",
            "Summary": "Ashiana Housing has set a target to expand its land inventory to 5-7 times its current year execution plan, according to an investor presentation. The company also reported that it has already secured revenue of Rs 4,364.29 crore over the next 3 years from the sale of units in ongoing projects.",
            "Sentiment": "positive",
            "PublishDate": 1748691392000,
            "Source": "default"
        },
        {
            "Title": "Ashiana Housing Reports Q4 Results and Declares Dividend",
            "Summary": "Ashiana Housing announced its Q4 financial results and a dividend declaration. The company reported a consolidated net profit of 203 million rupees, up from 174 million rupees year-over-year. Q4 revenue stood at 2.2 billion rupees, down from 2.89 billion rupees in the previous year. EBITDA for Q4 was 179 million rupees, compared to 203 million rupees year-over-year, with an improved EBITDA margin of 8.19% versus 7.03% in the same period last year. The company also declared a dividend of 1.5 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1748615432000,
            "Source": "result"
        },
        {
            "Title": "Ashiana Housing Ltd: Targets Rs 2,000-Crore Pre-Sales for FY26",
            "Summary": "Ashiana Housing Ltd aims for Rs 2,000 crore pre-sales in FY26, plans four new project launches with combined GDV of Rs 3,000 crore. Current GDV stands at Rs 11,000 crore. Company faces regulatory challenges in Jaipur market. Receivables from booked sales at Rs 2,100 crore as of December.",
            "Sentiment": "positive",
            "PublishDate": 1745369213000,
            "Source": "normal_news"
        },
        {
            "Title": "Ashiana Housing Reports Strong Q4 FY '25 Sales",
            "Summary": "Ashiana Housing announced its Q4 FY '25 results, reporting a value of area sold at 5.75 billion rupees. The company booked 597 units in Q4 FY '25, showing an increase from 451 units in Q3 FY '25 but a slight decrease from 628 units in Q4 FY '24.",
            "Sentiment": "positive",
            "PublishDate": 1744677384000,
            "Source": "result"
        },
        {
            "Title": "Ashiana Housing: Q4 Sales Bookings Drop 33% to Rs 575 Crore",
            "Summary": "Ashiana Housing reported a 33% decline in Q4 sales bookings to Rs 574.73 crore, down from Rs 862.54 crore in the previous year. However, annual sales bookings for FY25 increased by 8% to Rs 1,936.75 crore, marking the company's highest-ever annual sales.",
            "Sentiment": "neutral",
            "PublishDate": 1744452000000,
            "Source": "earnings"
        },
        {
            "Title": "Ashiana Housing Reports Strong Q4 FY '25 Sales Performance",
            "Summary": "Ashiana Housing announced its Q4 FY '25 sales results. The company reported a value of area sold at 5.75 billion rupees. They booked 597 units in Q4 FY '25, compared to 451 units in Q3 FY '25 and 628 units in Q4 FY '24. This indicates a significant quarter-over-quarter increase in unit bookings, though slightly lower than the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1744369352000,
            "Source": "result"
        },
        {
            "Title": "Ashiana Housing Acquires 7-Acre Land Parcel in Panvel, Maharashtra",
            "Summary": "Ashiana Housing has entered into an agreement to acquire a 7-acre land parcel located in Panvel, District Raigad, Maharashtra. This acquisition represents a strategic move by the company to expand its real estate portfolio in the region.",
            "Sentiment": "positive",
            "PublishDate": 1743984489000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ashiana Housing Acquires 7-Acre Land Parcel in Panvel, Maharashtra",
            "Summary": "Ashiana Housing has entered into an agreement to acquire a 7-acre land parcel located in Panvel, Raigad district, Maharashtra. This acquisition represents a significant expansion of the company's real estate portfolio in the region.",
            "Sentiment": "positive",
            "PublishDate": 1743835573000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ashiana Housing Converts 293 Units in Ashiana Nitara Project",
            "Summary": "Ashiana Housing has successfully converted 293 units into bookings for their project 'Ashiana Nitara'. The total sale value of these bookings amounts to INR 173.39 crores.",
            "Sentiment": "positive",
            "PublishDate": 1742885567000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ashiana Housing: Q3 Profit Plunges 60.83% YoY",
            "Summary": "Ashiana Housing reported Q3 FY25 results with profit at ₹10.89 crore, down 60.83% YoY. Revenue decreased by 27.81% to ₹133.17 crore. Compared to Q2, revenue grew 144.17% and profit increased 244.24%. EPS stood at ₹1.48, down 46.76% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1739425856000,
            "Source": "earnings"
        },
        {
            "Title": "Ashiana Housing Reports Decline in Q3 Financial Performance",
            "Summary": "Ashiana Housing has reported a significant decrease in its consolidated net profit for the third quarter. The company's net profit fell to 109 million rupees, compared to 278 million rupees in the same quarter of the previous year. This represents a year-over-year decline. Additionally, the company reported a loss of 76 million rupees compared to the previous quarter. Revenue also decreased to 1.3 billion rupees from 1.84 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1739320390000,
            "Source": "earnings"
        },
        {
            "Title": "Ashiana Housing Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Ashiana Housing has reported a significant decrease in its Q3 EBITDA, which fell to 171 million rupees from 327 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 12.86% from 17.78% in the same period last year. This indicates a substantial reduction in the company's operational profitability for the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1739284812000,
            "Source": "earnings"
        },
        {
            "Title": "Ashiana Housing Reports Q3 Financial Results",
            "Summary": "Ashiana Housing announced its Q3 financial results. The company's consolidated net profit decreased to 109 million rupees, compared to 278 million rupees in the same quarter last year. This represents a year-over-year decline. Additionally, the company reported a loss of 76 million rupees compared to the previous quarter. Q3 revenue also saw a decrease, coming in at 1.3 billion rupees, down from 1.84 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739284765000,
            "Source": "earnings"
        },
        {
            "Title": "Ashiana Housing Aims for ₹2000 Crore Pre-Sales Target",
            "Summary": "Ashiana Housing has expressed confidence in achieving pre-sales of ₹2000 crore. This statement indicates a positive outlook for the company's future sales performance and potential growth in the real estate sector.",
            "Sentiment": "positive",
            "PublishDate": 1736916037000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ashiana Housing: Luxury Home Demand Plateaus in Gurugram",
            "Summary": "Ashiana Housing reports that the demand for luxury homes in Gurugram is leveling off, indicating a potential shift in the high-end real estate market.",
            "Sentiment": "neutral",
            "PublishDate": 1736400408000,
            "Source": "normal_news"
        }
    ]
}