{
    "Symbol": "ASHOKLEY",
    "ISIN": "INE208A01029",
    "News": [
        {
            "Title": "Ashok Leyland Clarifies Media Speculation",
            "Summary": "Ashok Leyland issues regulatory clarification dismissing media speculation from Economic Times article dated February 11, 2026, stating no connection to share price movements.",
            "Sentiment": "neutral",
            "PublishDate": 1770883660516,
            "Source": "stocks"
        },
        {
            "Title": "Ashok Leyland Q3FY26 Results Call on Feb 11",
            "Summary": "Ashok Leyland schedules Q3FY26 earnings conference call for February 11, 2026 at 17:15 hrs IST, featuring MD & CEO Shenu Agarwal and CFO K M Balaji to discuss quarterly performance.",
            "Sentiment": "neutral",
            "PublishDate": 1770132521579,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ashok Leyland January Sales Jump 27% to 21,920 Units",
            "Summary": "Ashok Leyland reported strong January sales of 21,920 units, marking a 27% increase from 17,213 units in the previous year and exceeding analyst estimates of 21,010 units.",
            "Sentiment": "positive",
            "PublishDate": 1769935053120,
            "Source": "stocks"
        },
        {
            "Title": "Ashok Leyland appoints Jasmeet Bhatia as HR Head",
            "Summary": "Ashok Leyland announces appointment of Jasmeet Bhatia as President & Head HR effective January 27, 2026, replacing Raja Radhakrishnan who moves to special projects role.",
            "Sentiment": "neutral",
            "PublishDate": 1769506230063,
            "Source": "stocks"
        },
        {
            "Title": "Ashok Leyland shares surge 2.53% on high volume",
            "Summary": "Ashok Leyland shares gained 2.53% to ₹195.10 amid high trading volumes. The company reported strong financial performance with revenue growth from ₹19,454 crores in 2021 to ₹48,535 crores in 2025.",
            "Sentiment": "positive",
            "PublishDate": 1769165042768,
            "Source": "stocks"
        },
        {
            "Title": "Ashok Leyland Eyes Global Top 10 Commercial Vehicle Spot",
            "Summary": "Ashok Leyland strengthens its position with 31% domestic MHCV market share in H1 FY26, record Q2 EBITDA of ₹1,162 crore, and 45% export growth as it pursues global top 10 commercial vehicle manufacturer status.",
            "Sentiment": "positive",
            "PublishDate": 1769096528182,
            "Source": "stocks"
        },
        {
            "Title": "Ashok Leyland revives iconic Taurus, Hippo trucks",
            "Summary": "Ashok Leyland relaunched its legendary Taurus and Hippo heavy-duty truck brands on January 22, targeting India's growing infrastructure, mining and construction segments with 360 HP engines.",
            "Sentiment": "positive",
            "PublishDate": 1769085923440,
            "Source": "stocks"
        },
        {
            "Title": "UP defence corridor attracts ₹34,000 cr investment",
            "Summary": "Defence Minister Rajnath Singh announces over ₹34,000 crore investments across six nodes of Uttar Pradesh's defence corridor, highlighting the state's emergence as a major defence manufacturing hub.",
            "Sentiment": "positive",
            "PublishDate": 1767960196571,
            "Source": "stocks"
        },
        {
            "Title": "Ashok Leyland Shares Rally 2.66% on EV Plant Launch",
            "Summary": "Ashok Leyland inaugurates new electric vehicle manufacturing plant in Lucknow with 2,500 units annual capacity, shares surge 2.66% to ₹189.25 amid strong analyst support.",
            "Sentiment": "positive",
            "PublishDate": 1767945187685,
            "Source": "stocks"
        },
        {
            "Title": "Ashok Leyland surges 27% on strong Q3 performance",
            "Summary": "Commercial vehicle maker reports 24.2% YoY volume growth in Q3 FY26, driven by GST rate cuts and infrastructure demand. Company plans ₹5,000 crore battery investment over next decade.",
            "Sentiment": "positive",
            "PublishDate": 1767747876805,
            "Source": "stocks"
        },
        {
            "Title": "Ashok Leyland Block Trade Worth ₹28.08 Crores",
            "Summary": "Ashok Leyland witnessed a significant block trade on NSE involving 1,499,889 shares worth ₹28.08 crores at ₹187.22 per share, indicating institutional activity in the commercial vehicle stock.",
            "Sentiment": "neutral",
            "PublishDate": 1767598537228,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ashok Leyland Announces Senior Management Changes",
            "Summary": "Ashok Leyland restructures product development leadership with Dr. N. Saravanan focusing on strategic roadmap while Alfred Nixon Mendez takes over as Head of Product Development effective January 2, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767351339367,
            "Source": "stocks"
        },
        {
            "Title": "Ashok Leyland Shares Surge 2.3% in Fifth Straight Session",
            "Summary": "Ashok Leyland shares gained 2.3% to ₹189, extending winning streak to five sessions with 8.2% rally. Strong December sales of 21,533 units (up 27% YoY) drove investor confidence amid robust financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1767334637488,
            "Source": "stocks"
        },
        {
            "Title": "Ashok Leyland December Sales Jump 26.8% to 21,500 Units",
            "Summary": "Ashok Leyland reported strong December sales of 21,500 units, marking a 26.8% year-on-year growth from 16,957 units in December 2023, exceeding analyst estimates of 19,770 units.",
            "Sentiment": "positive",
            "PublishDate": 1767253282501,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nomura Raises Ashok Leyland Target to ₹196",
            "Summary": "Nomura maintains Buy rating on Ashok Leyland with target price increased to ₹196 from ₹174, reflecting positive outlook on the commercial vehicle manufacturer's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1766374815034,
            "Source": "stocks"
        },
        {
            "Title": "Ashok Leyland November Sales Jump 29% to 18,272 Units, Beating Estimates",
            "Summary": "Ashok Leyland reported November sales of 18,272 units, marking a 29% increase from 14,137 units in the same month last year. The commercial vehicle manufacturer's performance exceeded market estimates of 17,110 units, indicating stronger than expected demand in the segment.",
            "Sentiment": "positive",
            "PublishDate": 1764568089099,
            "Source": "stock"
        },
        {
            "Title": "Ashok Leyland Establishes New Unit in Saudi Arabia with 500,000 Riyals Investment",
            "Summary": "Ashok Leyland has launched a new operational unit in Saudi Arabia with an investment of 500,000 Riyals. This expansion represents the company's strategic move into the Saudi Arabian market, potentially opening new revenue streams and geographic diversification opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1764331402702,
            "Source": "corporate_action"
        },
        {
            "Title": "Ashok Leyland Clarifies Media Report on Subsidiary Merger",
            "Summary": "Ashok Leyland corrected a factually incorrect news report in The Hindu Business Line regarding the merger of its material subsidiary Hinduja Leyland Finance Limited (HLFL) into NDL Ventures Limited. The company clarified that HLFL's Board approved the merger scheme on November 25, 2025, subject to regulatory approvals, and proper disclosures were made to stock exchanges on November 26, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1764258764201,
            "Source": "order&deals"
        },
        {
            "Title": "Ashok Leyland Reports Record Q2 FY26 Performance with 14.2% EBITDA Growth",
            "Summary": "Ashok Leyland achieved record quarterly EBITDA of Rs. 1,162 crores (up 14.2% Y-o-Y) and revenue of Rs. 9,588 crores (up 9.3% Y-o-Y) for Q2 FY26, driven by strong performance across MHCV trucks, exports, and aftermarket businesses. The company maintains positive cash position of Rs. 1,000 crores and announced interim dividend of Re. 1 per share, while benefiting from GST rate cuts and expanding market share in both MHCV and LCV segments.",
            "Sentiment": "positive",
            "PublishDate": 1763541874030,
            "Source": "earnings"
        },
        {
            "Title": "Ashok Leyland Raises Export Volume Target to 18,000 Units for FY26",
            "Summary": "Ashok Leyland expects the second half of FY26 to outperform the first half in industry volume and growth rates. The company has increased its export volume target to 18,000 units for FY26, compared to 15,500 units last year. The company aims to achieve 25,000 units in exports over the next 2-3 years.",
            "Sentiment": "positive",
            "PublishDate": 1763004068190,
            "Source": "stock"
        },
        {
            "Title": "Ashok Leyland Reports Strong Q2 Results with EBITDA Margin Expansion to 13.07%",
            "Summary": "Ashok Leyland delivered solid quarterly performance with revenue of 95.9 billion rupees, up from 87.8 billion rupees year-over-year, though slightly below estimates of 97.5 billion rupees. Net profit remained flat at 7.7 billion rupees compared to the previous year, marginally exceeding estimates of 7.6 billion rupees. EBITDA showed strong growth to 12.46 billion rupees from 10.17 billion rupees year-over-year, surpassing estimates of 11.63 billion rupees. EBITDA margin improved significantly to 13.07% from 11.6% year-over-year, beating estimates of 12%. The company approved a dividend of 1 rupee per share. The Co-CEO expressed confidence about achieving mid-teen EBITDA targets soon, and the company maintains a cash-positive position.",
            "Sentiment": "positive",
            "PublishDate": 1762936947571,
            "Source": "stock"
        },
        {
            "Title": "Ashok Leyland Schedules Q2 Results Review for November 12",
            "Summary": "Ashok Leyland has announced that it will review its Q2 results on November 12. The company has set this date for the quarterly results review process.",
            "Sentiment": "neutral",
            "PublishDate": 1762158775203,
            "Source": "earnings"
        },
        {
            "Title": "Ashok Leyland October Sales Rise 16% to 17,820 Units, Beat Estimates",
            "Summary": "Ashok Leyland reported total sales of 17,820 units in October, representing a year-over-year increase from 15,310 units in the same period last year. The sales figure exceeded market estimates of 16,510 units.",
            "Sentiment": "positive",
            "PublishDate": 1761991700240,
            "Source": "stock"
        },
        {
            "Title": "Ashok Leyland Secures Rs. 668.76 Crore Order for 1,937 Buses from Tamil Nadu State Transport",
            "Summary": "Ashok Leyland has won an order for 1,937 buses from Tamil Nadu State Transport Undertakings valued at Rs. 668.76 crores. The order includes AIS 153 compliant BS VI diesel fueled chassis and low floor fully built buses. Delivery is scheduled in two phases: 1,701 BS VI diesel chassis and low floor fully built buses from October 2025 to March 2026, and 236 semi low floor diesel BS VI fully built buses from September 2026 to January 2027. The buses will feature iGen6 BS VI technology and are designed for town, mofussil, and SETC applications. Ashok Leyland currently has more than 21,000 buses operational in Tamil Nadu's fleet and is positioned as the world's 4th largest bus manufacturer and India's largest bus manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1760597723907,
            "Source": "order&deals"
        },
        {
            "Title": "Ashok Leyland Reports 9% Growth in September Sales at 18,800 Units",
            "Summary": "Ashok Leyland reported total sales of 18,800 units in September, representing an increase from 17,233 units sold in the same month last year. The sales figures exceeded analyst estimates of 18,400 units for the month.",
            "Sentiment": "positive",
            "PublishDate": 1759310678857,
            "Source": "stock"
        },
        {
            "Title": "Ashok Leyland Shares Hit All-Time High of Rs 142.63, Gains Over 5% in Four Sessions",
            "Summary": "Ashok Leyland's share price reached an all-time high of Rs 142.63, rising nearly 3% on Friday after gaining over 5% across four consecutive trading sessions since Monday. BoFA reiterated its 'Buy' rating following meetings with senior management, noting the company's confidence in industry growth and reaffirmation of mid-single digit volume growth guidance for medium and heavy commercial vehicles. The brokerage highlighted improving truck operator fundamentals with rising rentals and healthy utilization levels, while management clarified that initial battery business investment would be limited to Rs 300-500 crore over 12-18 months. The stock has gained 18.60% over the last 12 months with trading volume at 2.8 times its 30-day average. Of 44 analysts covering the company, 34 maintain 'buy' ratings with an average 12-month price target implying 2.6% upside.",
            "Sentiment": "positive",
            "PublishDate": 1758263164934,
            "Source": "stock"
        },
        {
            "Title": "Ashok Leyland Seeks Shareholder Approval for Two Independent Director Appointments",
            "Summary": "Ashok Leyland has issued a postal ballot notice seeking shareholder approval for the appointment of two Non-Executive Independent Directors. Ms. Geeta Mathur is proposed for a five-year term from August 25, 2025 to August 24, 2030, while Mr. Sridharan Kesavan is proposed for a three-year term from August 25, 2025 to August 24, 2028. Both candidates were appointed as Additional Directors by the Board with effect from August 25, 2025, based on recommendations from the Nomination and Remuneration Committee. Ms. Mathur is a Chartered Accountant with extensive corporate experience and currently serves on multiple company boards. Mr. Kesavan is also a Chartered Accountant who previously served as Chief Financial Officer of Ashok Leyland for 32 years before superannuating in August 2013. The e-voting period runs from September 6, 2025 to October 5, 2025, with results to be announced by October 7, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757073489868,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ashok Leyland to Participate in Bank of America 2025 Asia Pacific Conference",
            "Summary": "Ashok Leyland will participate in the Bank of America 2025 Asia Pacific Conference scheduled for September 9th and 10th, 2025, in Hong Kong at Island Shangri-la. The company will conduct hourly meetings from 10:00 to 17:00 hrs HKT with various investors and funds. The meetings will be held in physical mode, and no presentation is planned for the event.",
            "Sentiment": "neutral",
            "PublishDate": 1756977715082,
            "Source": "stock"
        },
        {
            "Title": "Ashok Leyland Plans Rs 5,000 Crore Investment in Battery Manufacturing Over Next Decade",
            "Summary": "Ashok Leyland announced a Rs 5,000 crore investment over the next 7-10 years to develop next-generation batteries for automotive and non-automotive applications, including energy storage systems. The commercial vehicle maker has partnered exclusively with China's CALB Group for battery technology. The initiative will serve both the company's own electric vehicle portfolio through subsidiary Switch and external demand across the automotive and energy storage sectors. The project will initially focus on automotive applications before expanding to energy storage systems. A Global Centre of Excellence will be established for research and development in battery materials, recycling, battery management systems, and manufacturing processes. Chairman Dheeraj Hinduja stated the partnership aims to create a localized battery supply chain to accelerate electric vehicle adoption and reduce fossil fuel dependence in India.",
            "Sentiment": "positive",
            "PublishDate": 1756718307588,
            "Source": "stock"
        },
        {
            "Title": "Ashok Leyland Plans Investment in Battery Ecosystem for Sustainable Future",
            "Summary": "Ashok Leyland announced plans to invest in battery ecosystem development as part of its sustainability strategy in India. The company is focusing on building capabilities in the battery sector to support its future operations.",
            "Sentiment": "positive",
            "PublishDate": 1756710603269,
            "Source": "stock"
        },
        {
            "Title": "Ashok Leyland Reports 5.4% Growth in August Sales, Beats Analyst Estimates",
            "Summary": "Ashok Leyland sold 15,239 units in August, representing a 5.4% increase from 14,463 units sold in the same month last year. The sales figure exceeded analyst estimates of 14,810 units by 429 units.",
            "Sentiment": "positive",
            "PublishDate": 1756705577072,
            "Source": "stock"
        },
        {
            "Title": "Ashok Leyland Appoints Two Independent Directors to Board",
            "Summary": "Ashok Leyland appointed Ms. Geeta Mathur as Additional Director Woman (Non-Executive, Independent) for a five-year term and Mr. Sridharan Kesavan as Additional Director (Non-Executive, Independent) for a three-year term, effective August 25, 2025. Both appointments are subject to shareholder approval. Ms. Mathur is a chartered accountant and serves as director on multiple company boards including JSW One Platforms Limited and Dixon Technologies (India) Limited. Mr. Kesavan is also a chartered accountant and previously served as Chief Financial Officer of Ashok Leyland for nearly 32 years before superannuating in August 2013. He led key financial initiatives including international fund-raising, investor relations, and strategic acquisitions during his tenure. Both directors are confirmed as not being debarred from holding director positions and are not related to existing company directors.",
            "Sentiment": "positive",
            "PublishDate": 1756126832217,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ashok Leyland Shares Hit 52-Week High After Record Q1 Results",
            "Summary": "Ashok Leyland shares surged 8.2% to ₹131.96, reaching a new 52-week high of ₹132.80, following the company's record first-quarter performance. The commercial vehicle manufacturer reported its highest-ever Q1 revenue of ₹8,725 crore and record volumes of 44,238 units for the quarter ended June 2025. EBITDA improved to ₹970 crore with margins expanding 50 basis points year-on-year to 11.1%, while profit after tax increased to ₹594 crore from ₹526 crore in the same period last year. The company gained market share in medium and heavy commercial vehicles from 28.9% to 30.7%, while light commercial vehicle volumes reached an all-time quarterly high of 15,566 units. Exports grew 29% to 3,011 units. Leading brokerages maintained bullish ratings with target prices ranging from ₹135 to ₹146. Ashok Leyland maintained a cash-positive position with ₹821 crore and expects mid-single-digit growth in the domestic commercial vehicle industry for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1755504903226,
            "Source": "earnings"
        },
        {
            "Title": "Ashok Leyland Shares Surge 9% on GST Rate Cut Proposal; Analysts Raise Price Targets",
            "Summary": "Ashok Leyland shares gained nearly 9% following the Central government's proposal to reduce GST rates on entry-level two-wheelers, small cars and hybrid passenger vehicles. The proposal aligns with Prime Minister Narendra Modi's Independence Day announcement on a two-tier GST structure expected by Diwali. Post quarterly results, analysts project up to 23% potential upside from the previous closing price of ₹121.96. UBS maintains a 'buy' rating with ₹150 target, citing operational discipline and margin outperformance. Goldman Sachs and Citi both rate 'buy' with ₹140 targets, while Jefferies holds at ₹120. Management expects mid-single digit growth in medium heavy commercial vehicle industry and higher growth in light commercial vehicles for FY26. Switch mobility turned profit before tax positive and is expected to be profit after tax positive by end of FY26. The company plans ₹300 crore investment in Ohm Mobility over 12 months. Of 43 analysts covering the stock, 34 have 'buy' ratings, six 'hold' and three 'sell'. The stock hit an intraday high of ₹132.9, marking its biggest single-day gain since February 2021.",
            "Sentiment": "positive",
            "PublishDate": 1755500632075,
            "Source": "stock"
        },
        {
            "Title": "Jose Maria Alapont to Retire as Non-Executive Independent Director of Ashok Leyland",
            "Summary": "Jose Maria Alapont will retire as Non-Executive Independent Director of Ashok Leyland Limited effective September 2, 2025. The Board of Directors took note of his retirement at their meeting held on August 14, 2025. Alapont has submitted a letter as required under SEBI regulations regarding his retirement from the board position.",
            "Sentiment": "neutral",
            "PublishDate": 1755160495272,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ashok Leyland Reports 13% Profit Growth in Q1 with Margin Expansion",
            "Summary": "Ashok Leyland reported a 13% year-on-year increase in net profit to Rs 593.70 crore for the first quarter of fiscal 2026, compared to Rs 525.50 crore in the same period last year. Revenue grew 1.5% to Rs 8,724.50 crore from Rs 8,598.50 crore. The company's EBITDA rose 6% to Rs 969.50 crore, while margins improved to 11.1% from 10.6%. Following the results announcement, Ashok Leyland shares surged over 3% during trading, reaching as high as Rs 124 on the NSE before settling 1.75% higher at Rs 121.83. The stock has declined 1.03% over the past 12 months but gained 10.70% year-to-date. Trading volume was 7.39 times the 30-day average.",
            "Sentiment": "positive",
            "PublishDate": 1755159044466,
            "Source": "earnings"
        },
        {
            "Title": "Ashok Leyland Reports Strong Q1 Performance with Electric Mobility Unit Achieving Positive EBITDA",
            "Summary": "Ashok Leyland delivered solid quarterly results with EBITDA rising to 9.7 billion rupees from 9.10 billion rupees year-over-year, exceeding estimates of 9.52 billion rupees. EBITDA margin improved to 11.11% from 10.59% year-over-year, though slightly below the estimated 10.8%. Net profit increased to 6 billion rupees from 5.25 billion rupees year-over-year, surpassing estimates of 5.79 billion rupees. Revenue reached 87 billion rupees compared to 86 billion rupees year-over-year, falling short of estimates of 88.20 billion rupees. The Co-Chairman highlighted the electric mobility unit's growth trajectory, noting its achievement of positive EBITDA.",
            "Sentiment": "positive",
            "PublishDate": 1755156543787,
            "Source": "earnings"
        },
        {
            "Title": "Ashok Leyland Announces Q1FY26 Results Date and Earnings Call Schedule",
            "Summary": "Ashok Leyland will announce its first quarter FY26 results on August 14, 2025, with an earnings call scheduled for 6 p.m. the same day. The company reported strong Q4FY25 performance with consolidated net profit rising 33.44% year-on-year to Rs 1,245.92 crore and total income increasing 8.84% to Rs 14,817.18 crore. The stock has declined 0.56% in the past five trading sessions and 5.20% over the last month, but has gained 10.47% in six months and 7.62% year-to-date. Shares hit a 52-week high of Rs 132.33 and a low of Rs 95.93, currently trading at Rs 119.90.",
            "Sentiment": "neutral",
            "PublishDate": 1755059678233,
            "Source": "earnings"
        },
        {
            "Title": "Ashok Leyland Receives RBI Approval for Hinduja Leyland Finance-NDL Ventures Merger",
            "Summary": "Ashok Leyland has received approval from the Reserve Bank of India for the merger of Hinduja Leyland Finance with NDL Ventures. This regulatory approval enables the consolidation of these two entities under the Ashok Leyland group structure.",
            "Sentiment": "positive",
            "PublishDate": 1754916127814,
            "Source": "corporate_action"
        },
        {
            "Title": "Ashok Leyland Submits Clean Secretarial Audit Report for Material Subsidiary Hinduja Leyland Finance",
            "Summary": "Ashok Leyland submitted the secretarial audit report for its material subsidiary Hinduja Leyland Finance Limited for the year ended March 31, 2025. The report contains no qualifications, reservations, adverse remarks, or disclaimers. The report was placed before Hinduja Leyland Finance Limited's Board at its meeting held on August 5, 2025. The submission was made to both BSE and NSE on August 8, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754660431535,
            "Source": "corporate_action"
        },
        {
            "Title": "Ashok Leyland Reports Strong July Sales Growth, Beats Estimates",
            "Summary": "Ashok Leyland sold 15,064 units in July, representing an increase from 13,928 units sold in the same month last year. The sales performance exceeded market estimates of 14,400 units for the month.",
            "Sentiment": "positive",
            "PublishDate": 1754032302246,
            "Source": "stock"
        },
        {
            "Title": "Ashok Leyland Chairman Outlines Proactive Strategy for Global Commercial Vehicle Leadership",
            "Summary": "Ashok Leyland Chairman Dheeraj G Hinduja announced the company will adopt a proactive approach to navigate emerging industry trends including electrification and supply chain challenges. The company aims to be among the world's top 10 commercial vehicle manufacturers. Hinduja highlighted that the commercial vehicle sector is undergoing transformation with accelerating electrification, alternative propulsion technologies like LNG and hydrogen moving to commercial reality, and digitalization reshaping fleet management. The company plans continued investment in R&D to accelerate rollout of electric, LNG, and hydrogen-powered vehicles, and will forge strategic alliances with technology partners and startups to integrate advanced telematics and connectivity. For international expansion, Hinduja noted growth prospects in Middle East, Africa, and ASEAN regions due to robust economic growth and rising infrastructure investment. The strategy focuses on deepening local engagement, leveraging regional manufacturing and supply chains, and positioning sustainable mobility solutions across light, medium and heavy segments in both bus and truck applications.",
            "Sentiment": "positive",
            "PublishDate": 1752992823456,
            "Source": "stock"
        },
        {
            "Title": "Ashok Leyland: Bonus Shares Credited, Stock Dips Marginally",
            "Summary": "Ashok Leyland has completed its 1:1 bonus share allotment, crediting shares to demat accounts. The company allotted 293.65 crore bonus equity shares on July 17, 2025. The stock traded down 0.89% at Rs 122.65 on BSE as of 10:52 am on the day of trading availability.",
            "Sentiment": "neutral",
            "PublishDate": 1752817078000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ashok Leyland: Shares Trade Ex-Bonus Today",
            "Summary": "Ashok Leyland shares begin trading ex-bonus on July 16, with a 1:1 bonus issue. Shareholders as of the record date will receive one bonus share for each share held, doubling their share count while maintaining the same overall value.",
            "Sentiment": "neutral",
            "PublishDate": 1752632864000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ashok Leyland: Last Day to Buy Shares for 1:1 Bonus Issue",
            "Summary": "July 11 is the last day to buy Ashok Leyland shares to qualify for the 1:1 bonus issue. The record date is July 16, and the bonus shares will be allotted on July 17, with trading starting on July 18.",
            "Sentiment": "positive",
            "PublishDate": 1752542532000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ashok Leyland: Shares Rise 3% Amid New Partnership and Bonus Issue",
            "Summary": "Ashok Leyland shares increased over 3% to Rs 253.90 on BSE, ending a two-day decline. The company announced a partnership with OKARA Roadlines and set July 16, 2025, as the record date for its 1:1 bonus share issue, with trading to commence on July 18, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1752488625000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ashok Leyland: Bonus Share Allotment Scheduled for July 17",
            "Summary": "Ashok Leyland's share price rises for the third consecutive day as investors await bonus share allotment on July 17. The company is issuing bonus shares in a 1:1 ratio, with trading of new shares to begin on July 18. The allotment committee will determine shareholder eligibility on July 16.",
            "Sentiment": "positive",
            "PublishDate": 1752124727000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ashok Leyland: Record Date Set for 1:1 Bonus Share Issue",
            "Summary": "Ashok Leyland has set July 16 as the record date for its 1:1 bonus share issue, with allotment scheduled for July 17. This follows shareholder approval and is the company's second bonus issue since 2011.",
            "Sentiment": "positive",
            "PublishDate": 1752072103000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ashok Leyland: June Vehicle Sales Rise 3%, Miss Estimates",
            "Summary": "Ashok Leyland reported total vehicle sales of 15,333 units in June, up 3% year-on-year but slightly below analyst expectations. M&HCV sales rose 3% to 9,829 units, while LCV sales increased 2% to 5,504 units. Domestic sales declined 1% to 14,184 units. The exports and domestic combined bus segment saw a 56% jump in sales to 3,172 units. Q1 total sales were up 1% at 44,238 units.",
            "Sentiment": "neutral",
            "PublishDate": 1751361502000,
            "Source": "result"
        },
        {
            "Title": "Ashok Leyland Reports 2.6% Increase in June Sales",
            "Summary": "Ashok Leyland achieved total sales of 15,333 units in June, compared to 14,940 units in the same month last year, representing a 2.6% increase. The company's performance exceeded market estimates of 15,150 units.",
            "Sentiment": "positive",
            "PublishDate": 1751359060000,
            "Source": "default"
        }
    ]
}