{
    "Symbol": "ASHOKAMET",
    "ISIN": "INE760Y01011",
    "News": [
        {
            "Title": "Ashoka Metcast Board Meet Set for Feb 13, 2026",
            "Summary": "Ashoka Metcast Limited has scheduled its board meeting for February 13, 2026, to review and approve Q3 FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770460246160,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ashoka Metcast Board Approves MOA Amendment",
            "Summary": "Ashoka Metcast Limited's board approved alteration in Memorandum of Association to include commodities trading as new business object, subject to member approval through postal ballot.",
            "Sentiment": "neutral",
            "PublishDate": 1769762481278,
            "Source": "stocks"
        },
        {
            "Title": "Ashoka Metcast Appoints Independent Director",
            "Summary": "Ashoka Metcast Limited announces appointment of Mr. Kunjan Nathbhai Rathod as Additional Independent Director with effect from December 13, 2025, for five-year term.",
            "Sentiment": "positive",
            "PublishDate": 1765610787733,
            "Source": "stocks"
        },
        {
            "Title": "Ashoka Metcast Reports Strong Quarterly Performance with 296% Profit Surge",
            "Summary": "Ashoka Metcast Limited announced its quarterly results for the period ended September 30, 2025. The company reported a standalone profit of Rs 8.72 lakhs compared to Rs 92.74 lakhs in the corresponding quarter last year. Revenue from operations stood at Rs 45.41 lakhs versus Rs 78.15 lakhs in the previous year quarter. On a consolidated basis, the company achieved a profit of Rs 296.08 lakhs for the quarter, significantly higher than Rs 348.49 lakhs in the same period last year. Consolidated revenue from operations was Rs 521.19 lakhs compared to Rs 1,433.42 lakhs in the corresponding quarter. The company operates in steel trading and chemical trading segments. The Board of Directors approved these unaudited financial results in their meeting held on November 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762894860764,
            "Source": "earnings"
        },
        {
            "Title": "Ashoka Metcast Reports 66% Drop in Quarterly Profit Despite Revenue Growth",
            "Summary": "Ashoka Metcast Limited approved its quarterly results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 41.83 lakh compared to Rs 51.57 lakh in the same quarter last year. Net profit declined to Rs 36.80 lakh from Rs 107.67 lakh in the corresponding quarter of the previous year. On a consolidated basis, revenue from operations decreased to Rs 545.39 lakh from Rs 1,125.69 lakh year-on-year, while consolidated net profit dropped to Rs 112.59 lakh from Rs 152.46 lakh. The company operates in multi-segment trading of steel and chemical activities. Basic earnings per share on consolidated basis stood at Rs 0.45 compared to Rs 0.61 in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1754911953747,
            "Source": "earnings"
        },
        {
            "Title": "Ashoka Metcast Limited Shareholders Approve Authorized Share Capital Increase Through Postal Ballot",
            "Summary": "Ashoka Metcast Limited successfully passed an ordinary resolution to increase its authorized share capital through a postal ballot conducted via remote e-voting. The voting concluded on August 6, 2025, with 99.99% of votes cast in favor of the resolution. Out of 24,996,000 total shares, 13,659,117 votes were polled (54.65% participation), with 13,657,816 votes supporting the increase and only 1,301 votes against. The promoter and promoter group, holding 13,410,000 shares, voted 100% in favor, while public non-institutional shareholders showed 99.48% support. The postal ballot was conducted under the scrutiny of Chintan K. Patel, a practicing company secretary, and the process was facilitated through Central Depository Services (India) Limited's e-voting platform.",
            "Sentiment": "positive",
            "PublishDate": 1754490662680,
            "Source": "corporate_action"
        },
        {
            "Title": "Ashoka Metcast: Profit Soars 894% in Q2 FY2025",
            "Summary": "<p>Ashoka Metcast reported a <span class='positive'>net profit</span> of Rs 3.48 crore for Q2 FY2025, <span class='positive'>up 894.29%</span> from Rs 0.35 crore in Q2 FY2024. <b>Sales increased by 142.47%</b> to Rs 14.33 crore. <span class='positive'>Operating profit margin improved</span> to 26.87% from 3.72% year-over-year.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728566700000,
            "Source": "result"
        }
    ]
}