{
    "Symbol": "ASHOKA",
    "ISIN": "INE442H01029",
    "News": [
        {
            "Title": "Ashoka Buildcon Q3 FY26 Results: Asset Sale Boosts PAT",
            "Summary": "Ashoka Buildcon reported 68% YoY growth in Q3 FY26 PAT to INR102 crores despite 18% revenue decline. Company completed INR1,814 crores BOT asset sale, reducing debt significantly.",
            "Sentiment": "positive",
            "PublishDate": 1770381438020,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ashoka Buildcon Wins ₹846.38 Cr Saudi Project",
            "Summary": "Ashoka Buildcon Limited secures approval for Diriyah II project in Saudi Arabia, partnering with BEC Arabia. Company's bid share valued at SAR 351.37 million (₹846.38 crore).",
            "Sentiment": "positive",
            "PublishDate": 1770369989879,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ashoka Buildcon Dispatches Postal Ballot Notice",
            "Summary": "Ashoka Buildcon Limited has dispatched postal ballot notice to shareholders on February 04, 2026, with remote e-voting scheduled from February 07 to March 08, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770300848102,
            "Source": "stocks"
        },
        {
            "Title": "Ashoka Buildcon Q3FY26 Earnings Call on Feb 2",
            "Summary": "Ashoka Buildcon Limited announces earnings conference call scheduled for February 2, 2026 at 2:30 PM IST to discuss Q3FY26 financial results with management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1769577065838,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ashoka Buildcon Wins ₹307.71 Cr Bridge Project",
            "Summary": "Ashoka Buildcon Limited secures Letter of Acceptance for signature bridge construction project in Daman worth ₹307.71 crores excluding GST from Public Works Department.",
            "Sentiment": "positive",
            "PublishDate": 1769082815612,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ashoka Buildcon Board Meet Set for Jan 30, 2026",
            "Summary": "Ashoka Buildcon Limited has scheduled a board meeting on January 30, 2026, to consider and approve Q3 FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768990592221,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ashoka Buildcon Gets ESG Rating of 72.2 from SES ESG",
            "Summary": "Ashoka Buildcon Limited receives an ESG rating of 72.2 from SES ESG Research Private Limited. The rating was assigned independently without company engagement, based on publicly available data.",
            "Sentiment": "neutral",
            "PublishDate": 1768372506283,
            "Source": "stocks"
        },
        {
            "Title": "Ashoka Buildcon Gets Positive Credit Rating Update",
            "Summary": "CARE Ratings reaffirms Ashoka Buildcon's AA- and A1+ credit ratings with positive implications for both long-term and short-term debt instruments, signaling improved financial outlook.",
            "Sentiment": "positive",
            "PublishDate": 1768281610662,
            "Source": "stocks"
        },
        {
            "Title": "Ashoka Buildcon Issues ₹50 Cr Commercial Papers",
            "Summary": "Ashoka Buildcon Limited has issued commercial papers worth ₹50 crore with 6.72% interest rate and 59-day tenure, maturing on February 27, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767095829241,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ashoka Buildcon Issues ₹50 Cr Commercial Papers",
            "Summary": "Ashoka Buildcon Limited has issued Commercial Papers worth ₹50 crores on December 23, 2025, with a 90-day tenure and maturity date of March 23, 2026, under its Board-approved limit of ₹300 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1766489137311,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ashoka Buildcon Wins ₹1,041.44 Cr BMC Flyover Project",
            "Summary": "Ashoka Buildcon's joint venture secures Letter of Acceptance for constructing flyover connecting J.J. Bridge and Sitaram Selam Bridge in Mumbai's E Ward, with 24-month execution timeline.",
            "Sentiment": "positive",
            "PublishDate": 1765697912463,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ashoka Buildcon Receives LoA for ₹1,815.79 Cr BMC Project",
            "Summary": "Ashoka Buildcon's joint venture with Adani Road Transport and Aakshaya Infra receives Letter of Acceptance for Mithi River Development project worth ₹1,815.79 crores from BMC.",
            "Sentiment": "positive",
            "PublishDate": 1765377502294,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ashoka Buildcon Receives Credit Rating Reaffirmation from CRISIL",
            "Summary": "CRISIL Ratings Limited reaffirmed Ashoka Buildcon's credit ratings with total bank loan facilities of Rs. 6,306 crore rated at CRISIL AA-/Negative for long-term facilities and CRISIL A1 for short-term facilities. The company also received a CRISIL ATS rating for its commercial paper program, maintaining its existing credit profile across various debt instruments.",
            "Sentiment": "neutral",
            "PublishDate": 1765284319835,
            "Source": "stock"
        },
        {
            "Title": "Ashoka Buildcon Secures ₹447.21 Crore Additional Work Order from BMC",
            "Summary": "Ashoka Buildcon has secured an additional work order worth ₹447.21 crore from BMC for the Sion-Panvel Highway flyover project. This contract award strengthens the company's infrastructure project portfolio and adds significant value to its order book.",
            "Sentiment": "positive",
            "PublishDate": 1765151621168,
            "Source": "order&deals"
        },
        {
            "Title": "Ashoka Buildcon Secures ₹447.21 Crore Additional Work Order from BMC",
            "Summary": "Ashoka Buildcon has secured an additional work order worth ₹447.21 crore from the Brihanmumbai Municipal Corporation (BMC) for the Sion-Panvel Highway Flyover Project. This extra work order represents additional revenue opportunity for the infrastructure company beyond the original project scope.",
            "Sentiment": "positive",
            "PublishDate": 1765012970825,
            "Source": "order&deals"
        },
        {
            "Title": "Ashoka Buildcon Acquires Full Control of Subsidiary ACL for Rs 667 Crores",
            "Summary": "Ashoka Buildcon Limited acquired 3,40,000 equity shares and convertible debentures in Ashoka Concessions Limited for Rs 667.10 crores on November 27, 2025, making ACL its wholly owned subsidiary. The acquisition provides complete exit to investors Macquarie SBI Infrastructure Investments and SBI Macquarie Infrastructure Trust, consolidating the company's road infrastructure portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1764301192701,
            "Source": "order&deals"
        },
        {
            "Title": "Ashoka Buildcon Suspended From NHAI Bids For One Month",
            "Summary": "Ashoka Buildcon has been suspended from participating in National Highways Authority of India (NHAI) bids for a period of one month. This suspension affects the company's ability to secure new highway construction contracts during this period, potentially impacting its business pipeline and revenue prospects.",
            "Sentiment": "negative",
            "PublishDate": 1764288424210,
            "Source": "stock"
        },
        {
            "Title": "Ashoka Buildcon Unit Sells Stakes in 5 SPVs to Maple Infrastructure for ₹18.14 Billion",
            "Summary": "Ashoka Buildcon's subsidiary has completed the sale of its stakes in five Special Purpose Vehicles (SPVs) to Maple Infrastructure in a transaction valued at ₹18.14 billion. The deal involves multiple infrastructure assets and represents a significant divestment by the construction and infrastructure company.",
            "Sentiment": "positive",
            "PublishDate": 1764202256774,
            "Source": "order&deals"
        },
        {
            "Title": "Ashoka Buildcon Reports Mixed Q2FY26 Results Amid Asset Monetization Drive",
            "Summary": "Ashoka Buildcon's standalone revenue declined 11% to INR 1,303 crores in Q2FY26 due to extended monsoons and project delays, while PAT surged 284% to INR 139 crores driven by exceptional gains from HAM asset sales. The company successfully monetized 5 HAM SPVs for INR 1,146 crores and secured new railway electrification contracts worth INR 1,039 crores, maintaining order book at INR 14,888 crores with expectations of INR 6,000-7,000 crores additional orders in H2FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1763707173291,
            "Source": "earnings"
        },
        {
            "Title": "Ashoka Buildcon Extends Deadline for Subsidiary Sale Transaction to November 30, 2025",
            "Summary": "Ashoka Buildcon Limited has extended the completion date for the sale of five highway subsidiary companies by Ashoka Concessions Limited to Maple Infrastructure Trust until November 30, 2025. The transaction involves the sale of entire share capital including repayment of shareholder loans in subsidiaries operating highway projects across Bhandara, Durg, Belgaum-Dharwad, Sambalpur-Baragarh, and Dhankuni-Kharagpur corridors.",
            "Sentiment": "neutral",
            "PublishDate": 1763704905866,
            "Source": "corporate_action"
        },
        {
            "Title": "Ashoka Buildcon Reports Sharp Decline in Q2 Financial Performance",
            "Summary": "Ashoka Buildcon's Q2 consolidated net profit dropped significantly to 781 million rupees from 4.57 billion rupees year-over-year, while revenue fell to 18.5 billion rupees from 24.9 billion rupees. The company's EBITDA declined to 5.8 billion rupees from 9.05 billion rupees, with EBITDA margin contracting to 31.60% from 36.37% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1763337238869,
            "Source": "earnings"
        },
        {
            "Title": "Ashoka Buildcon Reports 83% Drop in Net Profit Despite Margin Improvements",
            "Summary": "Infrastructure firm Ashoka Buildcon reported an 83% year-on-year decline in net profit to ₹78.06 crore with revenue falling 25.6% to ₹1,851 crore for the quarter ended September 30, 2025. The company's EBITDA dropped 35.4% to ₹585 crore while margins compressed to 31.6% from 36.3% in the prior-year period, reflecting challenges in project execution and billing.",
            "Sentiment": "negative",
            "PublishDate": 1763140174877,
            "Source": "earnings"
        },
        {
            "Title": "MMRDA Cancels Ashoka Buildcon's Creek Bridge Project Bid, Company to Be Re-Invited",
            "Summary": "MMRDA has cancelled Ashoka Buildcon's bid for the Creek Bridge Project from Kolshet to Kalher. The company will be re-invited to participate in the bidding process at a later stage.",
            "Sentiment": "neutral",
            "PublishDate": 1763127875247,
            "Source": "stock"
        },
        {
            "Title": "Ashoka Buildcon Secures Rs 539.35 Crore Railway Electrification Contract from North Western Railway",
            "Summary": "Ashoka Buildcon Limited has received a Letter of Acceptance for a railway project worth Rs 539.35 crore including GST from North Western Railway, Ajmer. The project involves upgrading existing electric traction systems from 1x25kV to 2x25kV and modifying overhead equipment for 160 kmph speed on sections of Ajmer Division covering 660.81 RKM/1200.85 TKM. The contract includes design, supply, erection, testing and commissioning work to be completed within 24 calendar months from the date of Letter of Acceptance issuance.",
            "Sentiment": "positive",
            "PublishDate": 1762574740407,
            "Source": "order&deals"
        },
        {
            "Title": "Ashoka Infraways Selected to Acquire Shree Sainath Land & Development for ₹80.52 Crore",
            "Summary": "Ashoka Infraways, a subsidiary of Ashoka Buildcon, has been selected as the successful resolution applicant for Shree Sainath Land & Development India Pvt Ltd. The acquisition involves paying ₹80.52 crore to creditors and will result in 100% ownership of the company. The transaction is subject to NCLT approval.",
            "Sentiment": "positive",
            "PublishDate": 1761760478961,
            "Source": "order&deals"
        },
        {
            "Title": "Ashoka Buildcon Acquires Investor Stake in Ashoka Concessions for ₹882.25 Crore",
            "Summary": "Ashoka Buildcon has acquired a portion of investor stake in Ashoka Concessions Ltd. for ₹882.25 crore. The company has also extended a deadline to October 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1759929819516,
            "Source": "order&deals"
        },
        {
            "Title": "Ashoka Buildcon's Subsidiary Acquires Additional Stake in Jaora-Nayagaon Toll Road Company for ₹1,666 Crores",
            "Summary": "Viva Highways Limited, a subsidiary of Ashoka Buildcon Limited, has acquired 7.46 crore equity shares of Jaora-Nayagaon Toll Road Company Private Limited (JTCL) for ₹1,666 crores. The shares were purchased from Macquarie SBI Infrastructure Investments Pte Limited and SBI Macquarie Infrastructure Trust, representing a 26% stake in JTCL. This acquisition increases Ashoka Buildcon's indirect shareholding in JTCL to 61.17% through its subsidiaries. JTCL operates a 125-250 km stretch of State Highway-31 in Madhya Pradesh under a Build Operate Transfer concession. The company reported total income of ₹265.50 crores and net worth of ₹639.89 crores in FY 2024-25. The transaction provides a complete exit to the investors and consolidates Ashoka Buildcon's control over the road infrastructure project.",
            "Sentiment": "positive",
            "PublishDate": 1759348416204,
            "Source": "order&deals"
        },
        {
            "Title": "Ashoka Buildcon Makes Timely Interest Payments on Three NCD Series",
            "Summary": "Ashoka Buildcon Limited made timely interest payments on three series of rated, listed, senior, unsecured, redeemable, non-convertible debentures (NCDs) due on September 30, 2025. The payments covered Series I, Series II, and Series III NCDs, all carrying 8.75% interest rates and listed on the Wholesale Debt Segment of BSE Limited. The company fulfilled its financial obligations as per the terms of the debt instruments.",
            "Sentiment": "positive",
            "PublishDate": 1759233899399,
            "Source": "corporate_action"
        },
        {
            "Title": "Ashoka Buildcon Completes Rs 1,146 Crore Sale of Five Road Project SPVs",
            "Summary": "Ashoka Buildcon Limited and its subsidiary Ashoka Concessions Limited have completed the sale of their entire 100% stake in five Special Purpose Vehicles to Epic Concesiones 2 Private Limited and other entities for Rs 1,146 crores. The transaction was completed on September 29, 2025, covering road projects across Punjab, Andhra Pradesh, Gujarat, Jharkhand, and Telangana. The five SPVs sold include Ashoka Kharar Ludhiana Road Limited, Ashoka Khairatunda Barwa Adda Road Limited, Ashoka Ranastalam Anandapuram Road Limited, Ashoka Ankleshwar Manubar Expressway Private Limited, and Ashoka Kandi Ramsanpalle Road Private Limited. The buyers are schemes of Infrastructure Yield Trust managed by EAAA India Alternatives Limited and are not related to Ashoka's promoter group. Additionally, six other SPVs remain pending for sale subject to completion of certain conditions. The sold SPVs had a combined turnover of Rs 409.27 crores representing 4.08% of total turnover during the last financial year.",
            "Sentiment": "positive",
            "PublishDate": 1759204346109,
            "Source": "order&deals"
        },
        {
            "Title": "Ashoka Buildcon Redeems Rs. 50 Crore Commercial Papers on Maturity Date",
            "Summary": "Ashoka Buildcon Limited successfully redeemed commercial papers worth Rs. 50 crore on September 23, 2025, the scheduled due date. The company paid the full redemption amount along with interest of Rs. 90.97 lakh. The commercial papers with ISIN INE442H14469 were fully redeemed at maturity, with 1,000 units redeemed and no outstanding amount remaining. The payment was made on time as per the original terms.",
            "Sentiment": "positive",
            "PublishDate": 1758626277910,
            "Source": "corporate_action"
        },
        {
            "Title": "Ashoka Buildcon Mutually Forecloses EPC Project in Ivory Coast Worth €18.50 Million",
            "Summary": "Ashoka Buildcon Limited and Serneke International Limited mutually decided to foreclose an EPC project for construction of 100 drinking water wells and supply and installation of drinking water supply units in 35 villages of Ivory Coast. The project had a bid price of €18.50 million. The parties executed a final closure agreement on September 19, 2025, settling the contract with no further obligations on either party. The closure was attributed to delays in granting approvals, land availability for work, and delays in approvals for drawings and designs. The company stated there is no negative financial impact from this closure.",
            "Sentiment": "neutral",
            "PublishDate": 1758280407586,
            "Source": "stock"
        },
        {
            "Title": "Ashoka Buildcon Secures ₹500 Crore Contract",
            "Summary": "Ashoka Buildcon has won a contract worth ₹500 crore. The construction and infrastructure company secured this new project, which will contribute to its order book and business operations.",
            "Sentiment": "positive",
            "PublishDate": 1755851155841,
            "Source": "stock"
        },
        {
            "Title": "Ashoka Buildcon Reports Mixed Q1 Results with 30% Revenue Decline but Improved Margins",
            "Summary": "Ashoka Buildcon Limited reported quarterly results with total standalone income declining 30% to ₹1,339 crores, while EBITDA margin improved to 11.3% from 7.6% in the previous year. Consolidated results showed total income down 22% to ₹1,937 crores, but PAT increased 44% to ₹227 crores with margin expanding to 11.7%. The company maintains an order book of ₹15,886 crores, with 65.7% from roads and railways. Management expects 10-12% revenue growth for the full year, anticipating stronger execution in the second half. The company secured new projects worth ₹2,022 crores including a USD 67 million project in Guyana. Asset monetization of BOT and HAM projects worth approximately ₹4,000 crores is expected to close by September 2025, which will reduce standalone debt from current levels to ₹500-600 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1755342235037,
            "Source": "earnings"
        },
        {
            "Title": "Ashoka Buildcon Expects EBITDA Margins of 9.5-10% in Future Quarters, Targets ₹10,000-12,000 Crores Order Inflow for FY26",
            "Summary": "Ashoka Buildcon anticipates maintaining EBITDA margin levels achieved in Q1 FY26, projecting margins of 9.5-10% in upcoming quarters. The company attributes this outlook to enhanced margins in new projects compared to older ones. The construction company has set order inflow guidance of ₹10,000-12,000 crores for FY26 and has already secured ₹2,000 crores in orders.",
            "Sentiment": "positive",
            "PublishDate": 1755055239644,
            "Source": "earnings"
        },
        {
            "Title": "Ashoka Buildcon Projects 10-12% Revenue Growth for FY26 Despite Expected Early Quarter Decline",
            "Summary": "Ashoka Buildcon expects revenue growth of 10-12% for FY26. The company anticipates negative growth in Q1-Q2 with recovery expected in Q3-Q4. The company has set Q3 revenue targets at ₹2,200-2,300 crores and Q4 targets at ₹2,600-2,700 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1755054878109,
            "Source": "stock"
        },
        {
            "Title": "Ashoka Buildcon Uploads Q1 FY26 Earnings Call Audio Recording",
            "Summary": "Ashoka Buildcon Limited has made available the audio recording of its earnings call held on August 12, 2025, discussing unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company uploaded the recording to its website at www.ashokabuildcon.com and provided a direct weblink for access. The notification was signed by Company Secretary Manoj A. Kulkarni.",
            "Sentiment": "neutral",
            "PublishDate": 1755016865033,
            "Source": "earnings"
        },
        {
            "Title": "Ashoka Buildcon Targets Strong Order Inflow with ₹14,447 Crore Order Book",
            "Summary": "Ashoka Buildcon is seeking strong order inflow with its current order book valued at ₹14,447 crore. The company is targeting projects in road construction, power transmission and distribution, and railway sectors. The company plans to implement selective bidding strategies and pursue asset sales to improve revenue, enhance profit margins, and reduce debt levels.",
            "Sentiment": "positive",
            "PublishDate": 1754929868576,
            "Source": "stock"
        },
        {
            "Title": "Ashoka Buildcon Reports Mixed Q1 Results with Improved Margins and Increased CP Limit",
            "Summary": "Ashoka Buildcon reported Q1 consolidated net profit of 2.17 billion rupees compared to 1.5 billion rupees year-over-year. The company's Q1 revenue declined to 18.87 billion rupees from 24.7 billion rupees in the previous year. EBITDA remained flat at 5.98 billion rupees year-over-year, while EBITDA margin improved significantly to 31.70% from 24.29% in the same period last year. The company has approved an increase in its commercial paper issuance limit to 3 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1754923228726,
            "Source": "earnings"
        },
        {
            "Title": "Ashoka Buildcon Extends Stake Sale Completion Date",
            "Summary": "Ashoka Buildcon has announced a delay in the completion of a stake sale. The new completion date has been set for September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1751346800000,
            "Source": "default"
        },
        {
            "Title": "Ashoka Buildcon: Secures $67 Million Road Project in Guyana",
            "Summary": "Ashoka Buildcon Ltd has signed a contract with the Government of Guyana for the East Bank–East Coast Road Linkage Project (Phase 2) valued at $67.25 million. The project will be executed over 18 months under an item rate contract model.",
            "Sentiment": "positive",
            "PublishDate": 1750322416000,
            "Source": "order&deals"
        },
        {
            "Title": "Ashoka Buildcon Secures ₹582 Crore Contract",
            "Summary": "Ashoka Buildcon has been awarded a contract valued at ₹582 crores. The news briefly mentions the company securing this significant project, but no further details about the nature of the contract or the client are provided in the given snippet.",
            "Sentiment": "positive",
            "PublishDate": 1750320380000,
            "Source": "default"
        },
        {
            "Title": "Ashoka Buildcon and Subsidiary Secure Intelligent Traffic Management Projects in Maharashtra",
            "Summary": "Ashoka Buildcon and its subsidiary have been awarded work orders for Intelligent Traffic Management System projects in Maharashtra. The projects involve implementing advanced traffic management solutions, likely aimed at improving road safety and traffic flow in the state.",
            "Sentiment": "positive",
            "PublishDate": 1750251182000,
            "Source": "default"
        },
        {
            "Title": "Ashoka Buildcon: GST Department Searches Premises, Stock Declines",
            "Summary": "Maharashtra GST Department conducted search and seizure operations at Ashoka Buildcon's office premises on June 11. The company's share price declined 2.79% to Rs 211.55, marking the lowest level since May 27. Normal operations of the firm remain unaffected.",
            "Sentiment": "negative",
            "PublishDate": 1749716673000,
            "Source": "corporate_governance"
        },
        {
            "Title": "GST Department Issues Search and Seizure Notice to Ashoka Buildcon",
            "Summary": "Ashoka Buildcon has reported that the GST Department in Maharashtra has issued a notice for search and seizure operations at the company's office premises.",
            "Sentiment": "negative",
            "PublishDate": 1749713455000,
            "Source": "default"
        },
        {
            "Title": "Ashoka Buildcon Receives Stop Work Order for NAINA Infrastructure Project",
            "Summary": "Ashoka Buildcon has been issued a stop work order by CIDCO for the ₹1,673 crore NAINA Infrastructure Project. This order comes following a decision by the Bombay High Court. No further details about the court decision or the reasons for the stop work order are provided in the given news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1749201234000,
            "Source": "default"
        },
        {
            "Title": "Ashoka Buildcon: Secures Rs 1,387 Crore ITMS Project in Maharashtra",
            "Summary": "Ashoka Buildcon and its subsidiary received Letters of Intent for a Rs 1,387.19 crore Intelligent Traffic Management System project across five regions in Maharashtra. The project has a 15-month implementation period and 10-year operation and maintenance phase.",
            "Sentiment": "positive",
            "PublishDate": 1749181099000,
            "Source": "order&deals"
        },
        {
            "Title": "Ashoka Buildcon: Secures ₹1,387 Crore Traffic Management Project in Maharashtra",
            "Summary": "Ashoka Buildcon and its subsidiary received LOIs for a 10-year Intelligent Traffic Management System project across multiple regions in Maharashtra, valued at ₹1,387.19 crore. The project covers Nagpur, Mumbai, Pune, Marathwada, and Konkan & Western Maharashtra. Final value to be determined upon official work order issuance.",
            "Sentiment": "positive",
            "PublishDate": 1749122073000,
            "Source": "order&deals"
        },
        {
            "Title": "Ashoka Buildcon Secures Projects Worth Over ₹1,387 Crore in Maharashtra",
            "Summary": "Ashoka Buildcon has obtained projects valued at over ₹1,387 crore throughout Maharashtra. The company, which operates in the construction sector, has secured these new contracts, indicating potential growth and increased business activity in the state.",
            "Sentiment": "positive",
            "PublishDate": 1749117854000,
            "Source": "default"
        },
        {
            "Title": "Ashoka Buildcon Outlines Financial Targets and Project Realizations",
            "Summary": "Ashoka Buildcon has set a target of Rs. 12,000 crore. The company plans to use Rs. 250 crore in FY25-26, with a remaining balance of Rs. 112 crores in '25, '26. They expect to realize Rs. 2,500 crore on BOT projects and Rs. 2,400 crore on HAM projects, totaling around Rs. 5,000 crore. Out of this, Rs. 1,600 crore will go to SBI Macquarie, with the balance available for automation.",
            "Sentiment": "positive",
            "PublishDate": 1748315960000,
            "Source": "default"
        },
        {
            "Title": "Ashoka Buildcon Projects Revenue Growth and Debt Reduction",
            "Summary": "Ashoka Buildcon expects to realize Rs. 10,000-12,000 crore in 2025 and 2026 from various projects in sectors including roads and railways. The company anticipates reducing its current Rs. 5,000 crore debt by Rs. 4,000 crore, with a substantial reduction expected by the second quarter due to asset monetization. While borrowings are expected to decrease, the company foresees lower interest costs in FY 2025 and 2026.",
            "Sentiment": "positive",
            "PublishDate": 1748315785000,
            "Source": "default"
        }
    ]
}