{
    "Symbol": "ASIANHOTNR",
    "ISIN": "INE363A01022",
    "News": [
        {
            "Title": "Asian Hotels VP Projects Resigns Due to Health Issues",
            "Summary": "Asian Hotels (North) Limited announces resignation of Mr. Vipin Vasudeva, Vice President - Projects and Senior Management Personnel, effective January 21, 2026, citing personal health reasons after 16 years with the company.",
            "Sentiment": "neutral",
            "PublishDate": 1770485437941,
            "Source": "stocks"
        },
        {
            "Title": "Asian Hotels Clears All Loan Defaults via Equity Issue",
            "Summary": "Asian Hotels (North) Limited successfully cleared all outstanding loan defaults with three lenders after raising ₹764.94 crore through preferential equity allotment of 2.32 crore shares.",
            "Sentiment": "positive",
            "PublishDate": 1770482256428,
            "Source": "stocks"
        },
        {
            "Title": "Asian Hotels Board Meet on Feb 13 for Q3FY26 Results",
            "Summary": "Asian Hotels (North) Limited has scheduled its board meeting for February 13, 2026, to consider and approve unaudited standalone financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770387768709,
            "Source": "co_actions_results"
        },
        {
            "Title": "Elana Holdings Acquires 39.42% Stake in Asian Hotels",
            "Summary": "Elana Holdings PTE. LTD. acquired 39.42% equity stake in Asian Hotels (North) Limited through preferential allotment of 1.68 crore shares at Rs. 330 per share, increasing its total shareholding to 54.37%.",
            "Sentiment": "positive",
            "PublishDate": 1770207380193,
            "Source": "co_actions_results"
        },
        {
            "Title": "Asian Hotels Allots 27.38 Lakh Shares at ₹330 Each",
            "Summary": "Asian Hotels (North) Limited completes preferential allotment of 27,37,500 equity shares to Elana Holding PTE Ltd at ₹330 per share, raising ₹90.34 crores and increasing paid-up capital to ₹22.19 crores.",
            "Sentiment": "positive",
            "PublishDate": 1769589220580,
            "Source": "co_actions_results"
        },
        {
            "Title": "Asian Hotels Gets Stock Exchange Nod for Preferential Issue",
            "Summary": "Asian Hotels (North) Limited receives in-principle approval from BSE and NSE for preferential issue of 2.31 crore equity shares at minimum price of ₹330 per share, subject to regulatory compliance conditions.",
            "Sentiment": "positive",
            "PublishDate": 1768841938608,
            "Source": "co_actions_results"
        },
        {
            "Title": "Asian Hotels Raises ₹300 Cr via NCDs at 12.5% Interest",
            "Summary": "Asian Hotels (North) Limited board approves issuance of 3,000 non-convertible debentures worth ₹300 crores on private placement basis with 12.5% annual coupon rate and 2-year tenure.",
            "Sentiment": "positive",
            "PublishDate": 1768581436363,
            "Source": "co_actions_results"
        },
        {
            "Title": "Asian Hotels (North) Reports ₹7.70 Billion Debt",
            "Summary": "Asian Hotels (North) Limited disclosed its total financial debt reached ₹7.70 billion as of December 31, marking a significant financial milestone for the hospitality company.",
            "Sentiment": "neutral",
            "PublishDate": 1767797700002,
            "Source": "co_actions_results"
        },
        {
            "Title": "Asian Hotels Appoints Independent Woman Director",
            "Summary": "Asian Hotels (North) Limited appointed Ms. Karishma Kaur Gill as Additional Independent Non-Executive Woman Director for one year term from December 16, 2025 to December 15, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1765897465656,
            "Source": "stocks"
        },
        {
            "Title": "Asian Hotels (North) Limited Fined Rs. 1.06 Lakh Each by BSE and NSE for Board Composition Non-Compliance",
            "Summary": "BSE and NSE imposed fines of Rs. 1,06,200 each on Asian Hotels (North) Limited for non-compliance with board composition requirements, including failure to appoint a woman director. The company stated that the fine has no material impact on its financial, operational, or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1764336535327,
            "Source": "corporate_governance"
        },
        {
            "Title": "Asian Hotels (North) Reports Net Loss of INR 5,352.72 Lakhs in Q2 FY2026 Amid Borrowing Defaults",
            "Summary": "Asian Hotels (North) Limited posted a net loss of INR 5,352.72 lakhs for the quarter ended September 30, 2025, compared to INR 2,656.28 lakhs loss in the same period last year, with the company defaulting on borrowings totaling INR 58,997.32 lakhs in principal and INR 17,327.42 lakhs in interest. The company has approved a preferential equity issue of INR 76,494.00 lakhs through an Extra-Ordinary General Meeting held on November 8, 2025, with proceeds intended for repayment of outstanding borrowings.",
            "Sentiment": "negative",
            "PublishDate": 1763173187581,
            "Source": "earnings"
        },
        {
            "Title": "Asian Hotels (North) Limited Passes Two Resolutions in Extraordinary General Meeting",
            "Summary": "Asian Hotels (North) Limited held an Extraordinary General Meeting on November 8, 2025, through video conferencing. The company passed two resolutions with requisite majority: an ordinary resolution for increase in authorized share capital and consequent amendment in capital clause of the memorandum of association, and a special resolution for issuance of equity shares on preferential basis. The meeting was attended by 71 public shareholders representing 16,03,975 shares out of 9,958 total shareholders. Both resolutions received over 99% votes in favor through remote e-voting and e-voting during the meeting. The meeting commenced at 11:30 AM and concluded at 12:11 PM.",
            "Sentiment": "neutral",
            "PublishDate": 1762614440725,
            "Source": "corporate_action"
        },
        {
            "Title": "Asian Hotels (North) Limited Signs Share Subscription Agreement with Elana Holdings for Rs 765 Crore Fundraise",
            "Summary": "Asian Hotels (North) Limited has executed a Definitive Share Subscription Agreement with Elana Holdings Pte. Ltd., Singapore. The Board of Directors approved the agreement on October 14, 2025. Under the agreement, Elana Holdings will invest as a financial investor by subscribing to 2,31,80,000 equity shares of face value Rs 10 each at Rs 330 per share (including premium of Rs 320 per share). The investor will not exercise control over the company, will not be part of the promoter group, and has no right to nominate directors. The funds raised will be used exclusively for payment of outstanding loans and defaulted interest. The parties are not related to the promoter group, and the transaction does not constitute a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1760461971366,
            "Source": "order&deals"
        },
        {
            "Title": "Asian Hotels (North) Limited Board Approves Rs. 765 Crore Preferential Issue and Authorized Capital Increase",
            "Summary": "Asian Hotels (North) Limited's Board approved increasing authorized share capital from Rs. 70 crore to Rs. 75 crore by adding 50 lakh equity shares of Rs. 10 each. The Board also approved a preferential issue of up to 2.32 crore equity shares at Rs. 330 per share to non-promoter Elana Holdings PTE. LTD, raising approximately Rs. 765 crore. Post-allotment, Elana Holdings will hold 54.37% on a fully diluted basis. An Extraordinary General Meeting is scheduled for November 8, 2025, to seek shareholder approval for these proposals. The cut-off date for determining shareholder eligibility is October 10, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760454582110,
            "Source": "corporate_action"
        },
        {
            "Title": "Asian Hotels (North) Reports Net Loss of ₹1,355.47 Lakhs for Quarter Ended June 30, 2025",
            "Summary": "Asian Hotels (North) Limited reported a net loss of ₹1,355.47 lakhs for the quarter ended June 30, 2025, compared to a net loss of ₹2,526.25 lakhs in the same quarter last year. Revenue from operations increased to ₹7,029.01 lakhs from ₹6,213.48 lakhs year-over-year. The company generated secured loans of ₹95.66 crore during the quarter but has defaulted on term loan repayments to DBS Bank assigned to M/s Star Strength, with outstanding principal of ₹24,972.24 lakhs and interest of ₹8,959.92 lakhs as of June 30, 2025. Basic and diluted earnings per share stood at negative ₹6.97. The company operates primarily in the hospitality sector and owns Hotel Hyatt Regency Delhi. Management states that operating profitability is improving and the company has completed one-time settlements with various banks and financial institutions.",
            "Sentiment": "negative",
            "PublishDate": 1755100779256,
            "Source": "earnings"
        },
        {
            "Title": "Asian Hotels (North) Limited Incorporates Wholly Owned Real Estate Subsidiary AHNL Realty Private Limited",
            "Summary": "Asian Hotels (North) Limited has incorporated a wholly owned subsidiary named AHNL Realty Private Limited on August 08, 2025, after receiving approval from the Ministry of Corporate Affairs. The new subsidiary operates in the real estate sector and will engage in purchasing, selling, developing, constructing, and dealing in residential and commercial properties. AHNL Realty has an authorized capital of Rs. 5 lakh divided into 50,000 equity shares of Rs. 10 each, with Asian Hotels acquiring 100% shareholding through cash subscription at face value. The company stated the objective is to diversify and expand current business operations to become more agile and diversified.",
            "Sentiment": "positive",
            "PublishDate": 1754664878818,
            "Source": "corporate_action"
        },
        {
            "Title": "Asian Hotels (North) Creates Real Estate Subsidiary for Business Diversification",
            "Summary": "Asian Hotels (North) has established a 100% subsidiary focused on real estate operations as part of a strategic diversification initiative. The company aims to develop new growth opportunities beyond its traditional hospitality business through this real estate venture.",
            "Sentiment": "positive",
            "PublishDate": 1753716908423,
            "Source": "stock"
        }
    ]
}