{
    "Symbol": "ASIANENE",
    "ISIN": "INE276G01015",
    "News": [
        {
            "Title": "Asian Energy Services discovers oil in Gujarat field",
            "Summary": "Asian Energy Services Limited announces oil discovery in Mevad Field, Gujarat with current production of 100 bopd and potential for 125-130 bopd. Company holds 50% participating interest in the block.",
            "Sentiment": "positive",
            "PublishDate": 1769796091947,
            "Source": "stocks"
        },
        {
            "Title": "Asian Energy Services Appoints New IR Agency",
            "Summary": "Asian Energy Services Limited has appointed Adfactors PR Private Limited as its Investor Relations and Public Relations agency effective January 31st, 2026, to strengthen investor engagement and communications.",
            "Sentiment": "positive",
            "PublishDate": 1769753504704,
            "Source": "stocks"
        },
        {
            "Title": "Asian Energy Services clarifies trading volume surge",
            "Summary": "Asian Energy Services Limited responds to stock exchange queries about recent trading volume spike, stating it's market-driven with no pending material disclosures under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768204392078,
            "Source": "stocks"
        },
        {
            "Title": "Asian Energy Services Reconstitutes Board Committees",
            "Summary": "Asian Energy Services reconstitutes Audit and Nomination & Remuneration Committees with effect from January 02, 2026, following resignation of Independent Director Mr. Brij Mohan Bansal.",
            "Sentiment": "neutral",
            "PublishDate": 1767102478055,
            "Source": "stocks"
        },
        {
            "Title": "Asian Energy Services Wins ₹54.63 Crore Seismic Data Contract from Sun Petrochemicals",
            "Summary": "Asian Energy Services Limited received a Letter of Award from Sun Petrochemicals Private Limited for acquisition and processing of 4D seismic data for Sun Petros Bhaskar Field in Gujarat, valued at ₹54.63 crore. The domestic service contract has a one-year execution timeline and represents a significant business win for the energy services company.",
            "Sentiment": "positive",
            "PublishDate": 1764832134380,
            "Source": "order&deals"
        },
        {
            "Title": "Asian Energy Services Seeks Shareholder Approval for Material Related Party Transactions and Stock Option Remuneration",
            "Summary": "Asian Energy Services Limited has issued a postal ballot notice seeking shareholder approval for material related party transactions worth INR 36,500 lakhs with Asian Global Joint Venture and INR 5,000 lakhs with Oilmax Energy Private Limited, along with stock option remuneration for non-executive directors. The company also proposes to re-allocate INR 25 crores from capital expenditure to working capital requirements from its convertible warrant proceeds of INR 157.45 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1764754208919,
            "Source": "corporate_action"
        },
        {
            "Title": "Asian Energy Services Reports Mixed Q2 Results Amid Kuiper Acquisition and Major Contract Wins",
            "Summary": "Asian Energy Services recorded revenue of INR 102 crores in Q2 FY26 with negative PAT of INR 4 crores due to one-time Kuiper acquisition costs and prolonged monsoon impact on operations. The company secured significant contracts worth INR 1,324 crores from Vedanta and Mahanadi Coalfields while maintaining robust order book of over INR 2,000 crores, positioning for strong second-half performance.",
            "Sentiment": "neutral",
            "PublishDate": 1763618383800,
            "Source": "earnings"
        },
        {
            "Title": "Asian Energy Services Secures Rs 1,324 Crore Orders, Completes Kuiper Group Acquisition",
            "Summary": "Asian Energy Services Limited secured major contracts worth Rs 459 crore from Mahanadi Coalfields and Rs 865 crore from Vedanta Limited, bringing total order book to over Rs 2,000 crore excluding taxes. The company completed acquisition of Kuiper Group for $9.25 million and filed merger plans with Oilmax Energy, while quarterly revenue stood at Rs 102 crore with EBITDA at Rs 9.1 crore including Kuiper's contribution.",
            "Sentiment": "positive",
            "PublishDate": 1763147057734,
            "Source": "stock"
        },
        {
            "Title": "Asian Energy Services Reports Mixed Q2 Results with Standalone Profit but Consolidated Loss",
            "Summary": "Asian Energy Services Limited posted standalone net profit of ₹768 lakhs for Q2 FY2026 but recorded consolidated net loss of ₹733 lakhs, with total revenue from operations at ₹6,275 lakhs standalone and ₹9,097 lakhs consolidated. The company completed acquisition of Kuiper Holdings Limited and subsidiaries for $9.38 million during the quarter and filed application for merger with Oilmax Energy Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1763145177121,
            "Source": "earnings"
        },
        {
            "Title": "Asian Energy Services Reports Sharp Decline in Q2 Financial Performance",
            "Summary": "Asian Energy Services reported Q2 net profit of 18M rupees compared to 99M rupees year-over-year, while revenue dropped to 610M rupees from 977M rupees. The company's EBITDA fell to 60M rupees from 167M rupees, with EBITDA margin declining to 9.90% from 17.08% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1763129209811,
            "Source": "earnings"
        },
        {
            "Title": "Asian Energy Services Receives Credit Rating Update from CRISIL",
            "Summary": "Asian Energy Services Limited received a credit rating update from CRISIL Ratings Limited. The company's total bank loan facilities were enhanced to Rs. 282.5 crore from Rs. 37.5 crore. CRISIL maintained the long-term banking facilities rating at CRISIL BBB/Watch Developing and assigned a short-term banking facilities rating of CRISIL A2/Watch Developing. Both ratings are placed on Rating Watch with Developing Implications.",
            "Sentiment": "neutral",
            "PublishDate": 1762284583440,
            "Source": "stock"
        },
        {
            "Title": "Asian Energy Services Secures ₹459 Crore Contract",
            "Summary": "Asian Energy Services has secured a contract worth ₹459 crore. The company's market capitalization stands at ₹1,540 crore.",
            "Sentiment": "positive",
            "PublishDate": 1762246964511,
            "Source": "stock"
        },
        {
            "Title": "Asian Energy Services Maintains Credit Rating on Rating Watch with Developing Implications",
            "Summary": "Asian Energy Services Limited announced that India Ratings Research Private Limited (Ind-Ra) has maintained the company's credit rating on Rating Watch with Developing Implications. The rating applies to bank loan facilities worth INR 1,250 million, with an instrument rating of IND BBB/Rating Watch with Developing Implications/IND A3+/Rating Watch with Developing Implications. The rating action was to maintain the existing Rating Watch status.",
            "Sentiment": "neutral",
            "PublishDate": 1761890309312,
            "Source": "stock"
        },
        {
            "Title": "Asian Energy Services Shares Fall 13% Following Board Approval of Oilmax Energy Merger",
            "Summary": "Asian Energy Services Ltd. shares dropped over 13% after the company's board approved a merger by absorption with Oilmax Energy. Under the scheme, Oilmax Energy will be dissolved and all its assets, liabilities, rights, and approvals will transfer to Asian Energy Services. Oilmax's existing 66% stake in Asian Energy will be cancelled, and Asian Energy will issue fresh shares to Oilmax shareholders based on a predetermined share-exchange ratio. The merger is expected to complete within 12 months, creating a single listed entity. Post-merger, promoter shareholding will decrease from 65% to 47%, representing a 46% equity dilution. The combined entity is projected to have revenue of ₹593 crores, EBITDA of ₹143 crores, and PAT of ₹91 crores. EPS is expected to improve by 17% from ₹8.4 to ₹9.89. Asian Energy Services shares are trading at ₹344.75, down 11% on the day and over 9% year-to-date.",
            "Sentiment": "negative",
            "PublishDate": 1757321298804,
            "Source": "corporate_action"
        },
        {
            "Title": "Asian Energy Services Reports 92% Revenue Growth in Q1FY26, Secures Rs 818 Crores in New Contracts",
            "Summary": "Asian Energy Services Limited reported strong Q1FY26 financial results with revenue from operations rising 92% year-on-year to Rs 115.4 crores, compared to Rs 60.2 crores in Q1FY25. EBITDA increased 72% to Rs 12.1 crores from Rs 7.0 crores, while profit after tax surged 173% to Rs 5.6 crores from Rs 2.1 crores. The company secured two significant contracts: a Rs 772 crores integrated service contract from Vedanta Limited to be executed over 57 months, and a Rs 46 crores seismic data acquisition and processing contract from Sun Petrochemicals in Gujarat over 12 months. The total order book stands at Rs 1,688 crores, with O&M comprising 75.2%, Infrastructure/CHP at 19.3%, and Seismic at 5.5%. The company is completing the acquisition of Kuiper Group to expand international market reach across the Middle East and Southeast Asia. Management attributed the performance to timely execution of contracts, improved resource utilization, and operational efficiencies.",
            "Sentiment": "positive",
            "PublishDate": 1755005030667,
            "Source": "earnings"
        },
        {
            "Title": "Asian Energy Services Reports 149% Jump in Q1 Net Profit to ₹563 Crores",
            "Summary": "Asian Energy Services Limited reported consolidated net profit of ₹563.23 crores for the quarter ended June 30, 2025, compared to ₹206.36 crores in the same period last year. Revenue from operations declined to ₹11,537 crores from ₹21,544 crores in the previous quarter. The company operates in two main segments: oil and gas services (₹9,224 crores revenue) and mineral and other energy services (₹2,313 crores revenue). Basic earnings per share stood at ₹1.24. The company allotted 40,734 equity shares during the quarter under employee stock options. Asian Energy Services' subsidiary ADMCC has entered into an agreement to acquire 100% of Kuiper Holdings Limited and Kuiper Group Limited, global providers of manpower solutions to the energy industry.",
            "Sentiment": "positive",
            "PublishDate": 1755000633815,
            "Source": "earnings"
        },
        {
            "Title": "Asian Energy Services Shares Surge 11.5% Following Rs 865 Crore Vedanta Contract Win",
            "Summary": "Asian Energy Services shares gained 11.5% over two days, rising 3.8% to Rs 317.85 on Tuesday after securing an Rs 865 crore Integrated Service Contract from Vedanta Limited. The 57-month contract covers field development and Operations & Maintenance services. Managing Director Kapil Garg highlighted the partnership as demonstrating trust through reliable service delivery. Despite recent gains, the stock remains down 18% year-to-date and 8.4% over 12 months, though it has risen 11% in three months. The company provides upstream oil and gas services including seismic data acquisition, production enhancement, and mining solutions. Technical indicators show the stock trading above seven of eight key moving averages, with RSI at 57.6 indicating neutral momentum.",
            "Sentiment": "positive",
            "PublishDate": 1753768072893,
            "Source": "stock"
        },
        {
            "Title": "Asian Energy Services Wins Rs 865 Crore Contract from Vedanta Limited",
            "Summary": "Asian Energy Services Limited has secured an Integrated Service Contract worth approximately Rs 865 crores from Vedanta Limited. The contract will be executed over 57 months and involves field development and Operations & Maintenance services. Managing Director Kapil Garg described this as a repeat engagement from Vedanta, highlighting the trust built through dependable service and operational excellence. The company positions itself as a leading integrated service provider to the energy and mining sectors, offering end-to-end services across the upstream value chain including seismic data acquisition, oil and gas production facility operations, and mining services.",
            "Sentiment": "positive",
            "PublishDate": 1753598945409,
            "Source": "order&deals"
        },
        {
            "Title": "Asian Energy Services Secures Rs 46 Crore Contract from Sun Petrochemicals",
            "Summary": "Asian Energy Services has been awarded a contract worth Rs 46 crores from Sun Petrochemicals. The contract is for 3D seismic data acquisition and processing in Gujarat. This represents a significant business development for Asian Energy Services in the petrochemical sector.",
            "Sentiment": "positive",
            "PublishDate": 1752711049000,
            "Source": "default"
        },
        {
            "Title": "Asian Energy Services Secures ₹46 Crore Contract from Sun Petrochemicals",
            "Summary": "Asian Energy Services has been awarded a contract worth ₹46 crore from Sun Petrochemicals. The contract is for 3D seismic data collection and processing in Gujarat. This project involves gathering and analyzing subsurface geological information, which is crucial for oil and gas exploration activities.",
            "Sentiment": "positive",
            "PublishDate": 1752678495000,
            "Source": "default"
        },
        {
            "Title": "Asian Energy Services Ltd: Strong FY25 Results and Acquisition Plans",
            "Summary": "Asian Energy Services Ltd reported 52% YoY revenue growth to ₹465.0 crores and 65% PAT growth to ₹42.2 crores for FY25. The company plans to acquire UAE-based Kuiper Group for $9.25 million. AESL targets ₹650-700 crores revenue for FY26, a 40-50% growth. A dividend of ₹1 per share is proposed, and an ESOP plan is in the works.",
            "Sentiment": "positive",
            "PublishDate": 1747630936000,
            "Source": "earnings"
        },
        {
            "Title": "Asian Energy Services Reports Q4 Results and Dividend Announcement",
            "Summary": "Asian Energy Services has announced its Q4 financial results and a dividend recommendation. The company's Q4 EBITDA increased to 308 million rupees from 249 million rupees year-over-year. However, the EBITDA margin decreased to 14.38% from 20.97% in the same period. Net profit for Q4 rose to 206 million rupees, up from 169 million rupees year-over-year and 81 million rupees quarter-on-quarter. Revenue for Q4 was reported at 2.15 billion rupees, compared to 1.2 billion rupees in the previous year. Additionally, the company has recommended a dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747401022000,
            "Source": "result"
        },
        {
            "Title": "Asian Energy Services Acquires UAE-Based Kuiper Group for $9.25 Million",
            "Summary": "Asian Energy Services has acquired Kuiper Group, a UAE-based company, for $9.25 million. This strategic acquisition aims to expand Asian Energy Services' global operations and maintenance (O&M) services across the Middle East and Southeast Asia regions.",
            "Sentiment": "positive",
            "PublishDate": 1745063872000,
            "Source": "default"
        },
        {
            "Title": "Asian Energy Services Reports Q3 EBITDA Decline",
            "Summary": "Asian Energy Services experienced a year-over-year decrease in Q3 EBITDA, dropping from 156 million rupees to 138 million rupees. The company's EBITDA margin also declined, falling from 16.42% to 15.03% compared to the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1739367252000,
            "Source": "earnings"
        },
        {
            "Title": "Asian Energy Services Reports Q3 Financial Results",
            "Summary": "Asian Energy Services has reported its financial results for the third quarter. The company's net profit stood at 81 million rupees, showing a decrease from 136 million rupees year-over-year and 99 million rupees quarter-over-quarter. The revenue for Q3 was 917 million rupees, slightly down from 948 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739367199000,
            "Source": "earnings"
        },
        {
            "Title": "Asian Energy Services to Consider Q3 Results",
            "Summary": "Asian Energy Services has announced that it will be considering its third quarter (Q3) financial results on February 12. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738756733000,
            "Source": "earnings"
        },
        {
            "Title": "Asian Energy Services Ltd: Secures ₹200 Crore Contract from Assam Gas Company",
            "Summary": "Asian Energy Services has won a ₹200 crore contract from Assam Gas Company Limited for a three-year BOOT project to design, construct, and operate a compressor station. The company expects to deploy the first compressor in Q4 of the current fiscal year, with initial revenue of ₹82 crore anticipated in the first year.",
            "Sentiment": "positive",
            "PublishDate": 1734429026000,
            "Source": "order&deals"
        },
        {
            "Title": "Asian Energy Services Secures 200 Crore Rupee Order",
            "Summary": "Asian Energy Services has won a new order worth 200 crore rupees. The company, which has a market capitalization of 1700 crore rupees, has not provided further details about the nature or scope of the order.",
            "Sentiment": "positive",
            "PublishDate": 1734425934000,
            "Source": "order&deals"
        },
        {
            "Title": "Asian Energy Services Reports Significant Profit and Revenue Growth in Q2",
            "Summary": "Asian Energy Services has reported a substantial increase in both net profit and revenue for the second quarter. The company's net profit rose to 99 million rupees, up from 6.8 million rupees year-over-year and 25 million rupees quarter-over-quarter. Revenue also saw a significant jump to 977 million rupees, more than doubling from 455 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731455977000,
            "Source": "result"
        }
    ]
}