{
    "Symbol": "ASIANTILES",
    "ISIN": "INE022I01019",
    "News": [
        {
            "Title": "Asian Granito Opens Trading Window Post Q3FY26 Results",
            "Summary": "Asian Granito India Limited announces reopening of trading window after 48 hours from Q3FY26 financial results declaration on February 4, 2026, following regulatory compliance norms.",
            "Sentiment": "neutral",
            "PublishDate": 1770228902310,
            "Source": "stocks"
        },
        {
            "Title": "Asian Granito Q3FY26 Results & Vietnam Expansion",
            "Summary": "Asian Granito India Limited reported Q3FY26 results with consolidated revenue of ₹42,393.49 lakhs and net profit of ₹1,853.55 lakhs. Board approved Vietnam market entry through WOS incorporation.",
            "Sentiment": "positive",
            "PublishDate": 1770200669511,
            "Source": "co_actions_results"
        },
        {
            "Title": "Asian Granito Q3FY26 Rights Issue Monitoring Report",
            "Summary": "Asian Granito India Limited submits Q3FY26 monitoring agency report showing INR 417.18 crore utilized from INR 422.17 crore rights issue proceeds with INR 5.00 crore remaining.",
            "Sentiment": "neutral",
            "PublishDate": 1769753030200,
            "Source": "co_actions_results"
        },
        {
            "Title": "Asian Granito CFO Mehul Shah Resigns Effective Jan 28",
            "Summary": "Asian Granito India Limited announced the resignation of Chief Financial Officer Mehul Shah, effective January 28, 2026, as he pursues alternate career opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1769599613211,
            "Source": "stocks"
        },
        {
            "Title": "Asian Granito Acquires 26% Stake in Allomex Steel",
            "Summary": "Asian Granito India has completed the acquisition of a 26% stake in Allomex Steel, making it an associate company. This strategic investment expands the company's portfolio beyond ceramic products.",
            "Sentiment": "positive",
            "PublishDate": 1767182966419,
            "Source": "co_actions_results"
        },
        {
            "Title": "Asian Granito Promoter Mukeshbhai J. Patel Buys 3L Shares",
            "Summary": "Mukeshbhai J. Patel, Managing Director of Asian Granito India Limited, acquired 3,00,000 equity shares through open market purchase, increasing promoter group holding to 10.79%.",
            "Sentiment": "positive",
            "PublishDate": 1766468247640,
            "Source": "co_actions_results"
        },
        {
            "Title": "Asian Granito India Acquires 26% Stake in Allomex Steel Private Limited",
            "Summary": "Asian Granito India Limited's board approved the acquisition of 26% equity stake in Allomex Steel Private Limited for Rs. 26,000 through a related party transaction. The acquisition aims to help the company enter steel manufacturing and building materials products to support overall growth plans and diversify its position in the building materials sector.",
            "Sentiment": "positive",
            "PublishDate": 1764757252196,
            "Source": "corporate_action"
        },
        {
            "Title": "Asian Granito Reports 8% Growth in Net Sales to Rs. 795 Crores in H1 FY26",
            "Summary": "Asian Granito India Limited reported consolidated net sales of Rs. 795 crores in H1 FY26, marking an 8% increase from Rs. 736 crores in the previous year. The company's EBITDA surged 101.8% to Rs. 61.5 crores with margins improving 360 basis points to 7.7%. Net profit turned positive at Rs. 23.2 crores compared to a loss of Rs. 1 crore in H1 FY25. For Q2 FY26, consolidated net sales reached Rs. 406.9 crores (8.2% growth), EBITDA jumped 148% to Rs. 36.7 crores with 9% margins, and net profit increased significantly to Rs. 15.6 crores from Rs. 1.2 crores. However, exports declined 17% to Rs. 64 crores in Q2 FY26. The company's composite scheme of arrangement involving demerger of tile manufacturing business became effective on July 1, 2025. Asian Granito has launched an enhanced strategic integration programme targeting Rs. 6,000 crores revenue over the next 4-6 years and appointed Bollywood actors Ranbir Kapoor and Vaani Kapoor for brand campaigns.",
            "Sentiment": "positive",
            "PublishDate": 1762971046595,
            "Source": "earnings"
        },
        {
            "Title": "Asian Granito India Reports Strong Q2 Performance, Approves Strategic Stake Disposal and Capital Increase",
            "Summary": "Asian Granito India Limited's board approved quarterly results for the quarter and half year ended September 30, 2025, showing consolidated revenue of Rs 40,692.35 lakhs for the quarter and Rs 79,516.54 lakhs for the half year. The company reported consolidated net profit of Rs 1,670.53 lakhs for the quarter and Rs 2,394.55 lakhs for the half year. The board approved disposal of 25% shareholding in AGL Proteins Private Limited, reducing the company's stake from 51% to 26%, converting it from a subsidiary to an associate company. The shares will be acquired by existing shareholder Mr. Prince Patel, who is not part of the promoter group. Additionally, the board approved increased capital contribution in Harmony Surfaces Thailand Limited, a wholly owned subsidiary incorporated in June 2024, to support business operations and international expansion. The company authorized key managerial personnel for determining materiality and making stock exchange disclosures. Asian Granito operates in tiles, marble, quartz, and bathware segments.",
            "Sentiment": "positive",
            "PublishDate": 1762943220393,
            "Source": "earnings"
        },
        {
            "Title": "Asian Granito Reports Strong Q2 Performance with EBITDA Rising to 366M Rupees",
            "Summary": "Asian Granito reported Q2 EBITDA of 366 million rupees compared to 148 million rupees in the same period last year. The company's EBITDA margin improved to 9% from 3.9% year-over-year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1762942267576,
            "Source": "earnings"
        },
        {
            "Title": "Asian Granito Reports Significant Jump in Quarterly Net Profit",
            "Summary": "Asian Granito reported consolidated net profit of 162.8 million rupees for the quarter, representing a substantial increase from 14.2 million rupees in the same period last year. The company also showed growth compared to the previous year's figure of 64.9 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1762940780901,
            "Source": "earnings"
        },
        {
            "Title": "Asian Granito Reports No Material Deviation in Rights Issue Fund Utilization for Q2 FY2026",
            "Summary": "Asian Granito India Limited submitted its monitoring agency report for Q2 FY2026 regarding the utilization of proceeds from its rights issue of INR 422.17 crore. ICRA Limited, the monitoring agency, reported no material deviation from the stated objects of the issue. The company has fully utilized INR 416.93 crore out of the total proceeds, with INR 5.06 crore remaining unutilized and invested in fixed deposits. Key utilizations include INR 173.37 crore for Future Ceramic Private Limited, INR 45.26 crore for AGL Sanitaryware Private Limited, INR 30 crore for working capital requirements, and INR 94.75 crore for general corporate purposes including INR 86.35 crore in loans and advances to subsidiary Crystal Ceramic Industries Limited for term loan repayment. The company experienced delays in several projects, with completion dates extended by 9-12 months due to factors including delayed monsoons in Morbi and delays in property identification for display centers. Shareholders have approved alterations in fund utilization objects through postal ballot resolutions.",
            "Sentiment": "neutral",
            "PublishDate": 1762920696088,
            "Source": "corporate_action"
        },
        {
            "Title": "Asian Granito India Shareholders Approve Demerger Scheme with Overwhelming Majority",
            "Summary": "Asian Granito India Limited announced voting results for its composite scheme of arrangement involving demerger between Asian Granito India Limited, Adicon Ceramica Tiles Private Limited, and Adicon Ceramics Limited. The scheme received overwhelming approval across all stakeholder categories. Equity shareholders voted 99.91% in favor (133,163,985 votes) with only 0.09% against (119,126 votes). Both secured creditors and unsecured creditors voted 100% in favor with 1,350,791,471 and 1,826,781,535 votes respectively, and zero votes against. Among public shareholders specifically, 280 shareholders representing 57,919,237 votes (99.79%) voted in favor, while 38 shareholders with 119,126 votes (0.21%) voted against. The meetings were held on September 18-19, 2025, following NCLT orders dated June 19 and July 4, 2025. Ms. Neha Lakhanpal served as the scrutinizer for the voting process.",
            "Sentiment": "positive",
            "PublishDate": 1758290624056,
            "Source": "corporate_action"
        },
        {
            "Title": "Asian Granito India Conducts NCLT-Convened Shareholder Meeting for Demerger Scheme",
            "Summary": "Asian Granito India Limited held an NCLT-convened meeting of equity shareholders on September 19, 2025, to discuss a composite scheme of arrangement involving demerger between Asian Granito India Limited, Adicon Ceramica Tiles Private Limited, and Adicon Ceramics Limited. The meeting was conducted through video conferencing from 10:30 AM to 10:47 AM IST, chaired by Mr. S.B. Gautam. Shareholders voted on the proposed demerger scheme through remote e-voting and e-voting during the meeting. The voting results will be uploaded on the company's website and notified to stock exchanges separately.",
            "Sentiment": "neutral",
            "PublishDate": 1758271542294,
            "Source": "corporate_action"
        },
        {
            "Title": "Asian Granito India Holds NCLT Creditor Meetings for Demerger Scheme",
            "Summary": "Asian Granito India Limited conducted NCLT-convened meetings of secured and unsecured creditors on September 18, 2025, to consider a composite scheme of arrangement involving demerger between Asian Granito India Limited, Adicon Ceramica Tiles Private Limited, and Adicon Ceramics Limited. The secured creditors meeting was held from 10:30 AM to 11:00 AM, while the unsecured creditors meeting took place from 11:30 AM to 12:00 PM at Ahmedabad Management Association. Both meetings were chaired by Mr. S. B. Gautam, Ex NCLT Member. Creditors voted by poll on the proposed demerger scheme resolution. The poll results will be uploaded on the company's website and notified to stock exchanges separately.",
            "Sentiment": "neutral",
            "PublishDate": 1758178858958,
            "Source": "corporate_action"
        },
        {
            "Title": "Asian Granito Reports Strong Q1 Performance with 55% EBITDA Growth and Return to Profitability",
            "Summary": "Asian Granito delivered robust quarterly results with EBITDA rising to 249 million rupees from 160.6 million rupees year-over-year. The company's EBITDA margin improved to 6.4% compared to 4.68% in the same period last year. The company returned to profitability with consolidated net profit of 75 million rupees, reversing from a loss of 18 million rupees in the previous year. Revenue grew to 3.88 billion rupees from 3.6 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1755071898375,
            "Source": "earnings"
        },
        {
            "Title": "Asian Granito India Schedules NCLT-Directed Meetings for Composite Scheme of Arrangement Involving Demerger",
            "Summary": "Asian Granito India Limited has scheduled two meetings to consider a composite scheme of arrangement involving demerger with Adicon Ceramica Tiles Private Limited and Adicon Ceramics Limited. The equity shareholders meeting will be held on September 19, 2025 at 10:30 AM via video conferencing, while the secured creditors meeting is scheduled for September 18, 2025 at 10:30 AM in physical mode at Ahmedabad Management Association. Both meetings are being conducted as per directions from the National Company Law Tribunal, Ahmedabad Bench. The company has dispatched meeting notices to all shareholders as of August 8, 2025 and to secured creditors as of March 31, 2025. Remote e-voting will be available from September 6-18, 2025 through NSDL services.",
            "Sentiment": "neutral",
            "PublishDate": 1754926309112,
            "Source": "corporate_action"
        },
        {
            "Title": "Asian Granito India Reports Fund Utilization Variations from Rs 440.96 Crore Rights Issue",
            "Summary": "Asian Granito India Limited disclosed variations in the utilization of funds raised through its Rights Issue of Rs 440.96 crores completed on May 10, 2022. The company reported changes in fund allocation across multiple objects, which were approved by shareholders through postal ballot on March 30, 2023. Key variations include reallocation of Rs 321.68 crores originally meant for AGL Surfaces Pvt. Ltd manufacturing unit setup, and Rs 94 crores from working capital for greenfield projects redirected to setting up a display center at Morbi (Rs 30 crores) and general corporate purposes (Rs 37.23 crores). The company also allocated Rs 73.80 crores for setting up stock points for trading building construction materials and Rs 5 crores for an Ahmedabad display center. ICRA Limited serves as the monitoring agency for the fund utilization. The Audit Committee and Auditors provided no comments on the variations.",
            "Sentiment": "neutral",
            "PublishDate": 1754482754714,
            "Source": "corporate_action"
        },
        {
            "Title": "Asian Granito India Submits Q1 FY2026 Rights Issue Monitoring Report",
            "Summary": "Asian Granito India Limited submitted its monitoring agency report for Q1 FY2026, detailing the utilization of proceeds from its Rights Issue worth INR 422.17 crore. ICRA Limited, serving as the monitoring agency, reported no deviation from approved objects. The company has fully utilized funds for Future Ceramics Private Limited (INR 173.37 crore) and AGL Sanitaryware Private Limited (INR 45.26 crore) manufacturing units, both now commissioned. Working capital requirements (INR 30 crore) and general corporate purposes (INR 94.75 crore) have been fully deployed. However, the Display Centre project in Ahmedabad faces implementation delays due to contractor changes, with INR 69 crore utilized but construction yet to begin. The company maintains INR 9.80 crore in unutilized proceeds, primarily invested in fixed deposits earning 7.40% returns. Several projects experienced delays ranging from 9-12 months due to monsoons and property identification issues.",
            "Sentiment": "neutral",
            "PublishDate": 1754481751610,
            "Source": "corporate_action"
        },
        {
            "Title": "Asian Granito India Receives Stock Exchange Approvals for 8.49 Crore New Equity Shares",
            "Summary": "Asian Granito India Limited has received listing and trading approvals from BSE and NSE for 8,48,66,333 equity shares of Rs. 10 each, issued under a Composite Scheme of Arrangement involving multiple ceramic industry companies. BSE granted listing approval on July 21, 2025, while NSE provided approval on July 24, 2025. Trading approval from both exchanges was received on July 28, 2025. The shares bear distinctive numbers from 147045317 to 231911649 and are listed under the symbol ASIANTILES on NSE. The scheme involves demergers, transfers, and restructuring among Asian Granito and several other companies including Affil Vitrified Private Limited, Ivanta Ceramics Industries Private Limited, Crystal Ceramic Industries Limited, and others.",
            "Sentiment": "positive",
            "PublishDate": 1753710378024,
            "Source": "corporate_action"
        },
        {
            "Title": "Asian Granito Launches AGL Proteins for Agriculture and Nutraceutical Market",
            "Summary": "Asian Granito has established a new subsidiary called AGL Proteins Pvt Ltd to enter the agriculture and nutraceutical market. This move represents a diversification of the company's business interests into new sectors.",
            "Sentiment": "positive",
            "PublishDate": 1751854485000,
            "Source": "default"
        },
        {
            "Title": "NCLT Approves Asian Granito India's Composite Arrangement Scheme",
            "Summary": "The National Company Law Tribunal (NCLT) has approved Asian Granito India's composite scheme of arrangement. This approval allows for significant structural changes within the company's organization.",
            "Sentiment": "positive",
            "PublishDate": 1749804631000,
            "Source": "default"
        },
        {
            "Title": "Asian Granito Reports Profit in Q4, Revenue Increases",
            "Summary": "Asian Granito has reported a consolidated net profit of 189 million rupees in the fourth quarter, compared to a loss of 23 million rupees in the same period last year. The company's revenue for Q4 increased to 4.72 billion rupees from 4.2 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748514095000,
            "Source": "result"
        },
        {
            "Title": "Asian Granito India Incorporates Subsidiary in Senegal",
            "Summary": "Asian Granito India has established a new subsidiary company in Senegal, expanding its international presence.",
            "Sentiment": "positive",
            "PublishDate": 1745414659000,
            "Source": "default"
        },
        {
            "Title": "Asian Granito Reports Significant EBITDA Growth in Q3",
            "Summary": "Asian Granito has reported a substantial increase in its Q3 EBITDA, rising to 159 million rupees from 15 million rupees in the same quarter last year. The company's Q3 EBITDA margin stands at 4.41%.",
            "Sentiment": "positive",
            "PublishDate": 1738920348000,
            "Source": "earnings"
        },
        {
            "Title": "Asian Granito Reports Q3 Profit Turnaround",
            "Summary": "Asian Granito has reported a consolidated net profit of 3 million rupees in Q3, compared to a loss of 62 million rupees in the same quarter last year. However, the company's revenue slightly decreased to 3.6 billion rupees from 3.7 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738920272000,
            "Source": "earnings"
        },
        {
            "Title": "Asian Granito India Forms Joint Venture with Shudh Investments and Klyn Stone",
            "Summary": "Asian Granito India has entered into a joint venture agreement with Shudh Investments and Klyn Stone. As part of this agreement, the company will acquire shares of Klyn AGL. This strategic move is likely aimed at expanding Asian Granito India's business operations or market presence.",
            "Sentiment": "positive",
            "PublishDate": 1733875604000,
            "Source": "corporate_action"
        },
        {
            "Title": "Asian Granito India Enters Joint Venture Agreement with Shudh Investments and Klyn Stone",
            "Summary": "Asian Granito India has entered into a joint venture agreement with Shudh Investments and Klyn Stone. As part of this agreement, the company will acquire shares of Klyn AGL. This move suggests a strategic partnership or expansion for Asian Granito India in the stone or tile industry.",
            "Sentiment": "positive",
            "PublishDate": 1733829131000,
            "Source": "corporate_action"
        },
        {
            "Title": "Asian Granito India Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Asian Granito India has reported a decrease in its Q2 EBITDA to 146 million rupees, down from 200 million rupees in the same quarter last year. The company's EBITDA margin also declined to 3.81% from 4.98% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731590549000,
            "Source": "result"
        },
        {
            "Title": "Asian Granito India Reports Q2 Revenue Decline",
            "Summary": "Asian Granito India has reported a revenue of 3.8 billion rupees for the second quarter, compared to 4 billion rupees in the same period last year, indicating a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1731590376000,
            "Source": "result"
        },
        {
            "Title": "Asian Granito India Reports Profit in Q2",
            "Summary": "Asian Granito India has reported a consolidated net profit of 64.9 million rupees in the second quarter, compared to a loss of 13 million rupees in the same period last year. The company also saw an improvement from the previous quarter, with profits increasing from 18.4 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1731590341000,
            "Source": "result"
        },
        {
            "Title": "Asian Granito Expands Sanitaryware Business with New Subsidiary",
            "Summary": "<p><span class='neutral'>Asian Granito's</span> subsidiary has <span class='positive'>incorporated</span> a new unit named <b>D'More Bathware</b> to <span class='positive'>expand</span> its <span class='neutral'>sanitaryware business</span>. This move indicates the company's <span class='positive'>strategic effort</span> to <span class='positive'>grow</span> and <span class='positive'>diversify</span> its operations in the <span class='neutral'>bathroom fixtures market</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728723872000,
            "Source": "corporate_action"
        }
    ]
}