{
    "Symbol": "ASIANPAINT",
    "ISIN": "INE021A01026",
    "News": [
        {
            "Title": "Asian Paints Releases Q3 FY26 Investor Call Transcript",
            "Summary": "Asian Paints has published the transcript of its investor conference held on January 27, 2026, discussing business and financial performance for Q3 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770038216443,
            "Source": "co_actions_results"
        },
        {
            "Title": "Asian Paints Gets 'Strong' ESG Rating of 62 from ERAIL",
            "Summary": "Asian Paints Limited receives an independent ESG rating of 62 from SEBI-registered ESG Risk Assessments & Insights Limited, placing the company in the 'Strong' category based on publicly available data.",
            "Sentiment": "positive",
            "PublishDate": 1769615894654,
            "Source": "stocks"
        },
        {
            "Title": "Asian Paints Confirms 18-20% PBDIT Margin Target",
            "Summary": "Asian Paints reaffirms its PBDIT margin target of 18-20% through strategic cost management and material innovations rather than relying on reduced competition or external deflation factors.",
            "Sentiment": "positive",
            "PublishDate": 1769571026855,
            "Source": "stocks"
        },
        {
            "Title": "Asian Paints Co-CEO Confident on Market Share Growth",
            "Summary": "Asian Paints Co-CEO expresses confidence in the company's ability to increase market share in the coming year, signaling optimistic outlook for business expansion.",
            "Sentiment": "positive",
            "PublishDate": 1769521329203,
            "Source": "stocks"
        },
        {
            "Title": "Asian Paints shares fall 2.13% to Rs 2,646",
            "Summary": "Asian Paints stock declined 2.13% to Rs 2,646 amid high trading volume. The company reported revenue of Rs 8,531.27 crore and net profit of Rs 979.93 crore for Q2 FY26.",
            "Sentiment": "negative",
            "PublishDate": 1769508500538,
            "Source": "stocks"
        },
        {
            "Title": "Asian Paints Q3 Preview: PAT seen up 8% YoY",
            "Summary": "Brokerages expect Asian Paints to deliver stable Q3 performance with 5% revenue growth and 8% PAT increase, driven by volume recovery and margin expansion despite pricing pressures.",
            "Sentiment": "positive",
            "PublishDate": 1769426041049,
            "Source": "co_actions_results"
        },
        {
            "Title": "Asian Paints Block Trade Worth ₹22.44 Crores",
            "Summary": "Asian Paints witnessed a significant NSE block trade worth ₹22.44 crores involving 81,093 shares at ₹2,767.70 per share, indicating institutional activity in the paint major's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1768799419045,
            "Source": "co_actions_results"
        },
        {
            "Title": "Asian Paints Dilutes Stake in UAE Joint Venture to 60%",
            "Summary": "Asian Paints reduces shareholding in Asian White Cement Holding Limited from 70% to 60% following allotment of sweat equity shares to joint venture partner RS Holdings Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1768581464116,
            "Source": "co_actions_results"
        },
        {
            "Title": "Asian Paints Promoter Group Share Transmission Filed",
            "Summary": "Shailesh Chimanlal Choksi HUF files SEBI disclosure for share transmission following demise of HUF member, maintaining 0.18% stake in Asian Paints through regulatory compliance process.",
            "Sentiment": "neutral",
            "PublishDate": 1768219306719,
            "Source": "stocks"
        },
        {
            "Title": "Asian Paints Promoter Group Share Transmission",
            "Summary": "Shailesh Chimanlal Choksi HUF reports share transmission following demise of Mr. Shailesh Chimanlal Choksi, maintaining 0.18% stake in Asian Paints under new KARTA Jigish Shailesh Choksi.",
            "Sentiment": "neutral",
            "PublishDate": 1768219247271,
            "Source": "stocks"
        },
        {
            "Title": "Asian Paints Faces Weak Q3 Demand: Morgan Stanley",
            "Summary": "Morgan Stanley reports weak to moderate demand trends for Asian Paints in Q3, with some areas in North India experiencing slow demand after Diwali festivities.",
            "Sentiment": "negative",
            "PublishDate": 1767586250029,
            "Source": "stocks"
        },
        {
            "Title": "Asian Paints Block Trade Worth ₹29.66 Crores on NSE",
            "Summary": "Asian Paints witnessed a significant block trade on NSE involving 106,751 shares valued at ₹29.66 crores, executed at ₹2,778.40 per share, indicating continued institutional interest in the paint major.",
            "Sentiment": "neutral",
            "PublishDate": 1767068207647,
            "Source": "co_actions_results"
        },
        {
            "Title": "Asian Paints Board Meet on Jan 27 for Q3FY26 Results",
            "Summary": "Asian Paints announces Board meeting on January 27, 2026, to approve Q3FY26 financial results. Trading window closed from Dec 19, 2025 to Jan 29, 2026. Investor conference scheduled same day.",
            "Sentiment": "neutral",
            "PublishDate": 1765802892038,
            "Source": "co_actions_results"
        },
        {
            "Title": "Asian Paints Maintains Strong Market Position",
            "Summary": "ICICI Securities reports no impact on Asian Paints' ground-level sales despite CEO exit, with dealers showing increased confidence in brand quality and servicing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1765789251936,
            "Source": "stocks"
        },
        {
            "Title": "ICICI Securities: Birla Opus Gains Market Share",
            "Summary": "ICICI Securities notes Birla Opus remains a solid force, gaining market shares across segments in competitive paint industry landscape.",
            "Sentiment": "positive",
            "PublishDate": 1765788973235,
            "Source": "stocks"
        },
        {
            "Title": "Asian Paints Reports Slight Demand Uptick in Channel Checks",
            "Summary": "Asian Paints has reported a slight increase in demand based on channel checks conducted by the company. The marginal improvement in demand conditions could indicate early signs of recovery in the paint and coatings sector.",
            "Sentiment": "positive",
            "PublishDate": 1765259468037,
            "Source": "stock"
        },
        {
            "Title": "Smiti Holding Files SEBI Disclosure for Share Encumbrance in Asian Paints",
            "Summary": "Smiti Holding and Trading Company Private Limited submitted regulatory disclosures to BSE regarding encumbrance of shares in Asian Paints Limited under SEBI takeover regulations. The filing relates to promoter disclosures for share pledging or encumbrance activities involving Asian Paints equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764837170759,
            "Source": "corporate_action"
        },
        {
            "Title": "Asian Paints Expects Double Digit Revenue Growth in Two Quarters",
            "Summary": "Asian Paints anticipates achieving double digit revenue growth within the next two quarters. The timeline indicates the company's outlook for improved financial performance in the near term.",
            "Sentiment": "positive",
            "PublishDate": 1764736458733,
            "Source": "stock"
        },
        {
            "Title": "Asian Paints Promoter Hiren A. Gandhi Files De-Pledging Disclosure",
            "Summary": "Hiren A. Gandhi, a promoter of Asian Paints Limited, submitted regulatory disclosures to BSE and NSE regarding de-pledging activities under SEBI takeover regulations. The filing includes detailed shareholding information of multiple promoter entities and individuals associated with the paint manufacturer.",
            "Sentiment": "neutral",
            "PublishDate": 1764304798084,
            "Source": "corporate_action"
        },
        {
            "Title": "Asian Paints Unit to Establish Second UAE Facility with AED 140M Investment",
            "Summary": "Asian Paints' subsidiary will set up a second manufacturing facility in the UAE with an investment of AED 140 million and annual production capacity of 55,800 KL. The expansion demonstrates the company's growth strategy in the Middle East market through increased manufacturing presence.",
            "Sentiment": "positive",
            "PublishDate": 1764202221717,
            "Source": "stock"
        },
        {
            "Title": "Asian Paints Surges 23% as Birla Opus Competition Moderates",
            "Summary": "Asian Paints stock rallied nearly 25% in one month as competitor Birla Opus shows moderated growth after exhausting its Rs 10,000 crore investment and reaching 50,000 dealer target, with dealers returning to previous suppliers citing lower margins. The company reported 10.9% volume growth in decorative business and analysts upgraded ratings, noting paint business relies on long-term relationships rather than short-term competitive tactics.",
            "Sentiment": "positive",
            "PublishDate": 1763098040391,
            "Source": "stock"
        },
        {
            "Title": "Asian Paints Shows Strong Q2 Performance; Expert Bullish on Commodities and Defence Sector",
            "Summary": "Market expert Anand Tandon discussed Asian Paints' impressive quarterly performance, noting double-digit growth and earnings beat that suggest a potential turnaround. He attributed this to reduced competitive pressure following management changes at rival Birla Opus, stating that competition intensity appears to have receded. On commodities, Tandon expressed bullish sentiment particularly on steel and aluminium, favoring domestic-focused players due to protection measures, while noting international steel margins remain weak. Regarding defence, he highlighted strong order books across companies but raised concerns about execution capabilities, noting dependency on imports for critical components. He cautioned that Indian defence manufacturers trade at significant premiums compared to global counterparts, suggesting investors might consider looking beyond India for better opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1763010633245,
            "Source": "stock"
        },
        {
            "Title": "Asian Paints Reports 6.7% Volume Growth in Q2FY26 Despite Extended Monsoon Impact",
            "Summary": "Asian Paints delivered 6.7% volume growth and 5.8% net sales growth in Q2FY26, overcoming extended monsoon challenges through improved consumer sentiment and early festive season demand. The company's decorative business showed broad-based growth across urban and rural centers, with all product categories contributing. Industrial segments maintained momentum with double-digit revenue growth in automotive and general industrial segments. International business recorded 9.9% revenue growth led by Nepal, Sri Lanka, and UAE operations. Gross margins improved to 43.7%, up 270 basis points year-on-year, supported by raw material deflation and operational efficiencies. PBDIT grew 21% with margins expanding to 18.5%. The company expanded its Beautiful Homes network to 73 stores and launched new product innovations including SmartCare DampSecure primer and Sparc Shyne variants. For H1FY26, net sales grew 2% with PBDIT increasing 5.9%. The company declared an interim dividend of 450% (₹4.50 per share) and maintains a positive outlook for Q3FY26, expecting support from festival and marriage seasons.",
            "Sentiment": "positive",
            "PublishDate": 1762985439007,
            "Source": "earnings"
        },
        {
            "Title": "Asian Paints Maintains Margin Guidance at 18%-20%",
            "Summary": "Asian Paints executive has confirmed that the company's margin forecast will remain in the range of 18%-20% going forward.",
            "Sentiment": "neutral",
            "PublishDate": 1762955209412,
            "Source": "stock"
        },
        {
            "Title": "Asian Paints Reports Improved Demand in Q3, Expects Stable Raw Material Costs",
            "Summary": "Asian Paints reported better demand conditions in Q3. The company expects raw material prices to remain steady, though geopolitical issues may impact pricing during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762949805751,
            "Source": "stock"
        },
        {
            "Title": "Asian Paints Delays ₹2,000 Crore Pithampur Plant Production by 3 Years",
            "Summary": "Asian Paints has postponed the commercial production at its ₹2,000 crore Pithampur plant by 3 years from the environmental clearance date. The delay will not impact the government incentives provided by Madhya Pradesh state.",
            "Sentiment": "negative",
            "PublishDate": 1762943886098,
            "Source": "stock"
        },
        {
            "Title": "Asian Paints Q2 Profit Surges 43%, Beats Estimates on Volume Growth",
            "Summary": "Asian Paints reported consolidated net profit of Rs 994 crore for the July-September quarter, up 43% from Rs 695 crore last year, exceeding Bloomberg estimates of Rs 887 crore. Revenue grew 6% to Rs 8,531 crore versus Rs 8,028 crore, also beating analyst projections. EBITDA margin expanded 220 basis points to 17.6% from 15.4%, driven by cost efficiencies. The domestic decorative business showed 11% volume growth despite prolonged monsoons, supported by marketing initiatives across urban and rural markets. International sales increased 10% to Rs 846 crore, led by South Asia, Middle East and Africa. The company declared an interim dividend of Rs 4.5 per share for fiscal 2026, with record date November 18 and payment on or after November 27. Share price jumped 5.7% following results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1762942377914,
            "Source": "earnings"
        },
        {
            "Title": "Asian Paints Reports Strong Q2 Results with Revenue Rising to 85B Rupees",
            "Summary": "Asian Paints delivered quarterly revenue of 85 billion rupees, up from 80.3 billion rupees year-over-year, surpassing estimates of 81.1 billion rupees. The decorative business segment showed robust performance with 10.9% volume growth and 6.0% revenue growth. EBITDA reached 15 billion rupees compared to 12.4 billion rupees in the previous year, exceeding the estimated 13.25 billion rupees. EBITDA margin improved to 17.62% from 15.43% year-over-year, beating the estimated 16.3%. Consolidated net profit jumped to 10 billion rupees from 6.95 billion rupees year-over-year, significantly above the estimated 8.7 billion rupees. The company declared a dividend of 4.5 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1762940825097,
            "Source": "earnings"
        },
        {
            "Title": "Asian Paints Q2 Results Preview: Flat Revenue Growth Expected Amid Monsoon Impact",
            "Summary": "Asian Paints is expected to report muted September quarter results with consolidated revenue remaining flat year-on-year and adjusted net profit rising just 1%, according to brokerage estimates. Volume growth is projected in low single digits, offset by softer pricing and downtrading in urban markets. Extended monsoons and heavy rainfall impacted demand for decorative paints, particularly affecting the anticipated second quarter recovery. Kotak Equities forecasts 4% volume growth with standalone revenue staying flat, while estimating gross margin at 41.6% and EBITDA margin at 15.7%. Nuvama Equities projects 1% revenue decline with 3% volume growth, expecting gross margin improvement to 42.5% due to lower input costs. The B2B segment is expected to show double-digit growth supported by industrial and infrastructure spending. Analysts anticipate stronger performance in the second half driven by festive demand and construction cycle recovery.",
            "Sentiment": "negative",
            "PublishDate": 1762842875007,
            "Source": "earnings"
        },
        {
            "Title": "Asian Paints Block Trade Worth Rs. 97.61 Crores Executed on NSE",
            "Summary": "Asian Paints Ltd. witnessed a block trade on the National Stock Exchange involving approximately 367,639 shares at Rs. 2,655 per share, totaling Rs. 97.61 crores. The transaction represents a significant institutional trade in the paint manufacturer's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1762756631465,
            "Source": "order&deals"
        },
        {
            "Title": "Asian Paints in Focus as Competitor CEO Quits, Oil Prices Drop, and MSCI Weight Increases",
            "Summary": "Asian Paints shares are drawing attention due to developments at competitor Birla Opus, where CEO Rakshit Hargave resigned after 18 months to join Britannia as CEO from December 15. Birla Opus reported gaining market share across most markets, expanding to over 10,000 towns and 140 depots, with combined revenues reaching double-digit market share. Crude oil prices hit a two-week low following a 5 million barrel increase in US crude stocks. Asian Paints will see increased weightage in the MSCI Standard Index, potentially generating $95 million in inflows according to Nuvama Alternative & Quantitative Research. The company will announce September quarterly results on November 12, with the board considering an interim dividend. Asian Paints shares closed 0.8% lower at ₹2,492, but have gained 6% over the past month and 8% year-to-date.",
            "Sentiment": "neutral",
            "PublishDate": 1762395992150,
            "Source": "stock"
        },
        {
            "Title": "Asian Paints Block Trade Worth Rs. 50.63 Crores Executed on NSE",
            "Summary": "Asian Paints Ltd. saw a block trade executed on the National Stock Exchange involving approximately 200,688 shares at a price of Rs. 2,523.00 per share. The total transaction value amounted to Rs. 50.63 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1761806453240,
            "Source": "order&deals"
        },
        {
            "Title": "Asian Paints Shares Surge Nearly 6% on Oil Price Drop and Festive Season Optimism",
            "Summary": "Asian Paints shares jumped up to 6% on Friday, October 17, marking the stock's biggest single-day gain since March. The rally was driven by falling oil prices following US President Donald Trump's announcement of an upcoming meeting with Russian President Vladimir Putin in Hungary to discuss ending the Ukraine war. Domestically, Managing Director and CEO Amit Syngle indicated early signs of demand recovery, noting urban center improvements and strong rural performance. The company is focusing on reviving urban demand in premium and luxury segments during the festive season. Investors are positioning ahead of quarterly earnings on November 12, 2025, when the board will also review an interim dividend declaration. ICICI Securities expects the paint industry to witness cyclical recovery and maintains an 'Add' rating on paint companies under coverage.",
            "Sentiment": "positive",
            "PublishDate": 1760683412355,
            "Source": "stock"
        },
        {
            "Title": "Asian Paints Surges Nearly 5% for Third Consecutive Day",
            "Summary": "Asian Paints shares rose 4.89% to Rs 2,527, reaching an intraday high of Rs 2,532, marking the third consecutive day of gains. The stock has gained over 8% in the past week following the commencement of commercial production at its white cement manufacturing facility in Fujairah, UAE, with an initial capacity of 2,65,000 tons per annum. Market participants are positioning ahead of the company's earnings announcement scheduled for November 12, 2025, when the board will also review an interim dividend declaration. ICICI Securities maintains an 'ADD' rating with a target price of Rs 2,650, noting sequential rises in commodity prices including crude oil (3.4%) and HDPE (0.7%) in the quarter. The company has a market capitalization of Rs 2.32 lakh crore, P/E ratio of 64.26, and P/B ratio of 11.52. Technical indicators show the stock trading above all moving averages with an RSI of 51.6.",
            "Sentiment": "positive",
            "PublishDate": 1760679878383,
            "Source": "stock"
        },
        {
            "Title": "Supreme Court Rejects Asian Paints' Plea to Stop CCI Investigation",
            "Summary": "The Supreme Court has denied Asian Paints' request to halt an ongoing Competition Commission of India (CCI) investigation. The paint manufacturer will now have to continue facing the regulatory probe.",
            "Sentiment": "negative",
            "PublishDate": 1760343448232,
            "Source": "stock"
        },
        {
            "Title": "Asian Paints Commences Commercial Production at UAE White Cement Manufacturing Facility",
            "Summary": "Asian Paints Limited has started commercial production at its white cement manufacturing facility in Fujairah, UAE, through its joint venture company Asian White Inc. FZE, effective October 12, 2025. The facility has an initial capacity of 2,65,000 tons per annum for manufacturing and exporting white cement and white cement clinker. During FY 2023-24, the company had incorporated Asian White Cement Holding Limited (AWCHL) in Dubai International Financial Centre, UAE, and Asian White Inc. FZE as a wholly owned subsidiary of AWCHL in the Fujairah Free Zone, UAE, to carry out this business.",
            "Sentiment": "positive",
            "PublishDate": 1760249270865,
            "Source": "stock"
        },
        {
            "Title": "Asian Paints Block Trade Worth Rs. 61.83 Crores Executed on NSE",
            "Summary": "Asian Paints Ltd. saw a block trade executed on the National Stock Exchange involving approximately 263,090 shares at Rs. 2,350 per share, totaling Rs. 61.83 crores. The transaction represents a significant institutional trade in the paint manufacturer's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1760075721158,
            "Source": "order&deals"
        },
        {
            "Title": "Asian Paints Schedules Board Meeting on November 12, 2025 for Q2 FY2026 Results and Interim Dividend Consideration",
            "Summary": "Asian Paints Limited will hold a Board of Directors meeting on November 12, 2025 to approve audited standalone financial results and unaudited consolidated financial results for the quarter and half-year ended September 30, 2025. The board will also consider declaring an interim dividend for the financial year ending March 31, 2026, with a record date set for November 18, 2025. The company's trading window, which has been closed since September 19, 2025, will remain closed until November 14, 2025. An investor conference is scheduled for November 12, 2025, where management will brief investors on the company's quarterly and half-yearly performance.",
            "Sentiment": "neutral",
            "PublishDate": 1759495749064,
            "Source": "corporate_action"
        },
        {
            "Title": "Smiti Holding Releases Pledge on 14 Lakh Asian Paints Shares",
            "Summary": "Smiti Holding and Trading Company Private Limited released its pledge on 14,00,000 equity shares of Asian Paints Limited on September 15, 2025. The shares were pledged to Citicorp Finance (India) Limited for loan purposes. Post-release, Smiti Holding's total shareholding in Asian Paints remains at 5,17,67,638 shares (5.40% of share capital), with 3,78,11,000 shares (3.94%) still remaining encumbered. The combined promoter and promoter group holding stands at 50,47,85,198 shares (52.63% of total share capital), with total encumbered shares at 4,88,43,727 shares (5.09%).",
            "Sentiment": "neutral",
            "PublishDate": 1758271552398,
            "Source": "corporate_action"
        },
        {
            "Title": "Asian Paints Shares Rally 15% from Lows, But CLSA Warns Competition Remains Intense",
            "Summary": "Asian Paints shares have recovered over 15% from recent 52-week lows as investors believe competitive pressure in the paints sector is easing. Fund houses like SBI Mutual Funds and ICICI Prudential Mutual Fund purchased shares in June, while brokerages including ICICI Securities and Jefferies upgraded the stock after years of bearish ratings. However, CLSA maintains an 'underperform' rating with a ₹1,927 price target, citing continued high competitive intensity and underperformance against peers across key metrics. CLSA expects new entrants Birla Opus and JSW Paints to remain aggressive in dealer sales, particularly during the festive period. Despite underperformance, Asian Paints trades at 68 times price-to-earnings, in line with its long-term average. Among 38 analysts covering the stock, 10 have 'buy' ratings, 10 have 'hold', and 18 recommend 'sell'. Shares closed 1.6% lower at ₹2,504 but remain up 9% year-to-date.",
            "Sentiment": "neutral",
            "PublishDate": 1758000958157,
            "Source": "stock"
        },
        {
            "Title": "High Court Rejects Asian Paints' Plea to Quash Antitrust Investigation",
            "Summary": "The High Court has dismissed Asian Paints' plea to quash an antitrust inquiry against the company. The paint manufacturer's legal challenge to halt the competition investigation was unsuccessful.",
            "Sentiment": "negative",
            "PublishDate": 1757895104362,
            "Source": "stock"
        },
        {
            "Title": "Smiti Holding Creates Pledge on 28 Lakh Asian Paints Shares Worth 0.29% Stake",
            "Summary": "Smiti Holding and Trading Company Private Limited has pledged 28,00,000 shares (0.29% of total share capital) of Asian Paints Limited in favor of Citicorp Finance (India) Limited for loan purposes. The pledge was created on September 10, 2025. Smiti Holding holds a total of 5,17,67,638 shares representing 5.40% of Asian Paints' share capital. Post this transaction, Smiti Holding's total encumbered shares stand at 3,92,11,000 shares (4.09% of share capital). The shares are listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1757655581888,
            "Source": "corporate_action"
        },
        {
            "Title": "High Court Rejects Asian Paints' Request to End Antitrust Investigation",
            "Summary": "The High Court has rejected Asian Paints' request to terminate an ongoing antitrust investigation into the company. The paint manufacturer's attempt to halt the regulatory probe was unsuccessful, meaning the antitrust investigation will continue.",
            "Sentiment": "negative",
            "PublishDate": 1757593680058,
            "Source": "stock"
        },
        {
            "Title": "Asian Paints Sees Rs. 25.90 Crore Block Trade on NSE",
            "Summary": "Asian Paints Ltd. witnessed a block trade worth Rs. 25.90 crores on the NSE. The transaction involved approximately 102,038 shares at a price of Rs. 2,538.70 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1757398142081,
            "Source": "order&deals"
        },
        {
            "Title": "Asian Paints Promoter Satyen A. Gandhi Pledges Additional 1 Lakh Shares to Julius Baer Capital",
            "Summary": "Satyen A. Gandhi, a promoter of Asian Paints Limited, has pledged 1,00,000 shares (0.01% of total share capital) to Julius Baer Capital (India) Pvt. Ltd. as collateral for a business loan. The pledge was created on September 3, 2025, and reported on September 6, 2025. Gandhi holds 37,25,954 shares (0.39% of total share capital) in Asian Paints. Following this transaction, his total encumbered shareholding increased to 13,91,500 shares (0.15% of total share capital), up from the previously encumbered 12,91,500 shares (0.13%). The disclosure was made in compliance with SEBI regulations regarding substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1757336341989,
            "Source": "corporate_action"
        },
        {
            "Title": "Asian Paints Extends Joint Venture Partnership with PPG Group for Additional 15 Years",
            "Summary": "Asian Paints Limited has executed Supplementary Joint Venture Agreements with PPG Group, extending their partnership for 15 years through 2041. The renewal maintains the existing 50:50 joint venture structure for both PPG Asian Paints Private Limited and Asian Paints PPG Private Limited. The joint ventures will continue serving industrial, protective, marine, packaging, automotive, and powder coatings customers in India. PPG retains management control of PPG Asian Paints Private Limited, while Asian Paints maintains control of Asian Paints PPG Private Limited. The partnership originally began in 1997 and was expanded in 2012. Asian Paints MD & CEO Amit Syngle stated the extension reflects strong collaboration and value creation, leveraging PPG's technological expertise and Asian Paints' market understanding. The company confirmed the changes have no material impact on management and control of Asian Paints Limited.",
            "Sentiment": "positive",
            "PublishDate": 1754327043976,
            "Source": "order&deals"
        },
        {
            "Title": "Asian Paints Reports 1.2% Revenue Decline in Q1 FY26 Despite Volume Growth",
            "Summary": "Asian Paints reported a 1.2% decline in net sales for Q1 FY26, with standalone revenue affected by early monsoons in June. The company achieved 3.9% volume growth in decorative business and 4.2% overall volume growth including industrial segment. Industrial business performed strongly with 8.8% growth. Gross margins remained healthy at 43.2%, while PBDIT margins stood at 19.4%. The company expanded its retail network to 1.7 lakh outlets and launched new products including Nilaya Arc premium emulsion. International business grew 8.4% in INR terms. Management noted green shoots in urban demand and expects single-digit growth going forward. Anti-dumping duty on TiO2 imports may impact raw material costs by 1.5-2.5%. The company maintained its 18-20% PBDIT margin guidance despite competitive pressures.",
            "Sentiment": "neutral",
            "PublishDate": 1754118593029,
            "Source": "earnings"
        },
        {
            "Title": "Asian Paints Co-CEO to Monitor Market Trends Before Pricing Decisions",
            "Summary": "Asian Paints Co-CEO announced plans to observe market trends for one month before making any decisions regarding pricing changes for the company's products.",
            "Sentiment": "neutral",
            "PublishDate": 1753793509797,
            "Source": "stock"
        },
        {
            "Title": "Asian Paints Co-CEO Raises Concerns About IT Sector Job Cuts Affecting Demand",
            "Summary": "Asian Paints Co-CEO has expressed concerns about the potential impact of job cuts in the IT sector on consumer demand. The executive questioned how layoffs in the technology industry might affect overall market demand for the company's products.",
            "Sentiment": "negative",
            "PublishDate": 1753793036019,
            "Source": "stock"
        },
        {
            "Title": "Asian Paints Sees Strong Competition Continuing in Q2 Despite Demand Recovery Signs",
            "Summary": "Asian Paints expects strong competition to persist in Q2. The company is observing initial signs of recovery in demand, with notable improvements specifically in urban markets.",
            "Sentiment": "neutral",
            "PublishDate": 1753791396889,
            "Source": "stock"
        }
    ]
}