{
    "Symbol": "ASKAUTOLTD",
    "ISIN": "INE491J01022",
    "News": [
        {
            "Title": "ASK Automotive Expands Braking Systems Capacity",
            "Summary": "ASK Automotive Limited announces Rs. 35 crore investment to expand Advanced Braking Systems capacity by 6 crore pieces annually through two new plants in Rajasthan, targeting Q1 FY 26-27 commissioning.",
            "Sentiment": "positive",
            "PublishDate": 1769608585097,
            "Source": "stocks"
        },
        {
            "Title": "ASK Automotive Q3FY26 Results & Board Decisions",
            "Summary": "ASK Automotive reported Q3FY26 financial results and approved re-appointment of four independent directors for second terms. Board meeting held on January 28, 2026 addressed key governance matters.",
            "Sentiment": "neutral",
            "PublishDate": 1769606515912,
            "Source": "co_actions_results"
        },
        {
            "Title": "ASK Automotive Q3FY26 Earnings Call on Jan 29, 2026",
            "Summary": "ASK Automotive Limited announces earnings call scheduled for January 29, 2026 at 5:00 PM IST to discuss Q3FY26 and nine months financial results ending December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768231057962,
            "Source": "co_actions_results"
        },
        {
            "Title": "ASK Automotive Board Meet Set for January 28, 2026",
            "Summary": "ASK Automotive Limited has scheduled a board meeting on January 28, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768215706704,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kuldip Singh Rathee Reduces Stake in ASK Automotive Limited",
            "Summary": "Kuldip Singh Rathee sold 7,885,704 shares (4.00%) of ASK Automotive Limited through open market transactions, reducing his shareholding from 34.18% to 30.18%. The transaction affects the ownership structure of the NSE-listed automotive company and represents a significant stake reduction by a major shareholder.",
            "Sentiment": "neutral",
            "PublishDate": 1764303095467,
            "Source": "stock"
        },
        {
            "Title": "ASK Automotive Promoter Sells 7.88 Crore Shares Worth ₹72.17 Crore",
            "Summary": "Kuldip Singh Rathee, Chairman and Managing Director of ASK Automotive Limited, sold 78,857,043 equity shares through open market transactions on NSE, reducing his shareholding from 34.18% to 30.18%. The share sale was conducted to achieve minimum public shareholding requirements and was valued at ₹72,16,69,497.",
            "Sentiment": "neutral",
            "PublishDate": 1764151625216,
            "Source": "corporate_action"
        },
        {
            "Title": "ASK Automotive Reports Strong Q2 Performance with 19.5% EBITDA Growth Despite Export Challenges",
            "Summary": "ASK Automotive Limited delivered robust quarterly results with revenue growth of 8.5% and EBITDA growth of 19.5% in Q2 FY26. The company achieved its highest ever absolute revenue, EBITDA and PAT for any quarter. EBITDA margin improved to 13.4%, up 124 basis points year-on-year, though aluminum price increases impacted margins by 30 basis points. All three product segments performed well - Advanced Braking Systems grew 10%, Aluminum Light Weighting Precision Solutions increased 22%, and Safety Control Cables rose 2%. Export revenue declined to Rs. 63 crore from Rs. 74 crore due to geopolitical issues affecting rare earth and magnet supplies. The company strategically reduced low-value wheel assembly business by 53.6%. ASK Automotive commissioned a 9.9 MW solar plant and is installing an additional 11.55 MW facility. Management remains optimistic about growth trajectory supported by GST 2.0 reforms and favorable macroeconomic conditions.",
            "Sentiment": "positive",
            "PublishDate": 1762284222891,
            "Source": "earnings"
        },
        {
            "Title": "ASK Automotive Wins India's Best Managed Companies 2025 Award by Deloitte",
            "Summary": "ASK Automotive Limited has been recognized as the winner of India's Best Managed Companies 2025 Award by Deloitte. The company disclosed this achievement to stock exchanges BSE and NSE, where it trades under the scrip code 544022 and symbol ASKAUTOLTD respectively.",
            "Sentiment": "positive",
            "PublishDate": 1761994215854,
            "Source": "stock"
        },
        {
            "Title": "ASK Automotive Reports Strong Q2 Performance with 16.6% Revenue Growth and Record Quarterly Profits",
            "Summary": "ASK Automotive Limited, India's largest brake shoe and advanced braking systems manufacturer for two-wheelers, reported strong quarterly results ended September 30, 2025. The company achieved 16.6% revenue growth excluding wheel assembly business, while strategically reducing wheel assembly operations by 53.6%. Consolidated revenue grew 8.5% year-on-year to Rs. 1,059 crores. The company delivered its highest quarterly EBITDA of Rs. 142 crores, up 19.5% year-on-year, with EBITDA margins improving to 13.4%. Quarterly PAT reached a record Rs. 80 crores, representing 18.6% year-on-year growth. For the half-year period, revenue grew 14.0% excluding wheel assembly, with consolidated revenue up 6.1% to Rs. 1,954 crores. Advanced Braking Systems revenue grew 10%, Aluminium Light Weighting Precision Solutions increased 22%, and Safety Control Cables rose 2% year-on-year. Export revenue was Rs. 30 crores compared to Rs. 41 crores in the same period last year. The company attributed improved margins to better economies of scale, higher capacity utilization at Karoli and new Bangalore facilities, and strategic reduction in low value-added wheel assembly business.",
            "Sentiment": "positive",
            "PublishDate": 1761849436931,
            "Source": "earnings"
        },
        {
            "Title": "ASK Automotive Reports 26% Decline in Quarterly Profit to ₹59.23 Crores",
            "Summary": "ASK Automotive Limited announced quarterly results with profit after tax declining to ₹59.23 crores compared to ₹79.31 crores in the same period last year. Total income increased to ₹967.67 crores from ₹815.58 crores year-over-year. On a consolidated basis, profit after tax was ₹90.09 crores versus ₹104.46 crores in the previous year. The company incorporated a joint venture entity, ASK GTD Control Cables Private Limited, in collaboration with T.D. Holding GMBH for manufacturing sunroof control cables and helix-cables for passenger vehicles. ASK Automotive is primarily engaged in manufacturing auto components including advanced braking systems, aluminium lightweighting precision solutions and safety control cables for the automobile industry.",
            "Sentiment": "negative",
            "PublishDate": 1761835149580,
            "Source": "earnings"
        },
        {
            "Title": "ASK Automotive Projects 14-16% Revenue Growth for FY26 with Strong EBITDA Margins",
            "Summary": "ASK Automotive has projected revenue growth of 14-16% for FY26 while maintaining EBITDA margins near 14%. The growth is expected to be driven by accelerated adoption of EV braking systems, aluminum lightweighting precision solutions, and new global joint ventures with leading OEMs. The company aims to continue outperforming industry growth and targets market share gains along with export expansion into FY27.",
            "Sentiment": "positive",
            "PublishDate": 1761834722485,
            "Source": "stock"
        },
        {
            "Title": "ASK Automotive Reports Strong Q2 Performance with 18.6% Jump in Net Profit",
            "Summary": "ASK Automotive delivered robust quarterly results with consolidated net profit rising to 798 million rupees from 672.8 million rupees year-over-year. Revenue grew to 10.54 billion rupees compared to 9.74 billion rupees in the same period last year. The company's EBITDA increased to 1.37 billion rupees from 1.16 billion rupees, while EBITDA margin improved to 13.01% from 11.99% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1761824447958,
            "Source": "earnings"
        },
        {
            "Title": "ASK Automotive Schedules Earnings Call for Q2 & H1 FY26 Results",
            "Summary": "ASK Automotive Limited will host an investor and analyst call on Friday, October 31st, 2025 at 05:00 PM IST to discuss its financial results for the quarter and half year ended September 30, 2025, covering both standalone and consolidated results. The earnings call will be led by key management including Chairman and Managing Director Kuldip Singh Rathee, Joint Managing Directors Prashant Rathee and Aman Rathee, CFO Naresh Kumar Sharma, and Chief General Manager for Investor Relations Manoj Sharma. The company has provided multiple dial-in numbers for participants including domestic and international toll-free options.",
            "Sentiment": "neutral",
            "PublishDate": 1761290804470,
            "Source": "earnings"
        },
        {
            "Title": "ASK Automotive President & Chief Marketing Officer Prashant Kumar Gupta Resigns",
            "Summary": "ASK Automotive Limited announced that Mr. Prashant Kumar Gupta has resigned from his position as President & Chief Marketing Officer, effective from the closing business hours of September 09, 2025. In his resignation letter dated August 27, 2025, Gupta cited personal reasons for his departure. The company has informed stock exchanges NSE and BSE about this leadership change.",
            "Sentiment": "neutral",
            "PublishDate": 1757410136352,
            "Source": "corporate_governance"
        },
        {
            "Title": "ASK Automotive Expects Record Two-Wheeler Sales Boost from GST 2.0 Reforms",
            "Summary": "ASK Automotive Chairman Kuldip Singh Rathee expects significant benefits from anticipated GST reforms, particularly for the two-wheeler segment which hasn't recovered to FY18-19 volume levels. The company's aftermarket business, contributing Rs 400 crore in revenue, will benefit from GST rate reduction from 28% to 18% on parts supplied to independent aftermarket. Rathee stated two-wheeler prices increased from Rs 60,000 to Rs 90,000 due to Covid and BS4-BS6 transitions, impacting demand. He anticipates surpassing highest two-wheeler numbers from 2018-19 this financial year. The GST reforms are expected to boost GDP by 100 basis points, while US tariffs may impact growth by 30-50 basis points. ASK Automotive has limited export exposure at 4.7%, with US exports around 3%. The company expects mid-teens growth with improving EBITDA margins as it phases out wheel assembly business. Excluding wheel assembly, the company grew 11.1% against industry growth of 0.7%.",
            "Sentiment": "positive",
            "PublishDate": 1756274548873,
            "Source": "stock"
        },
        {
            "Title": "ASK Automotive Reports 11.1% Revenue Growth and 183 bps EBITDA Margin Improvement in Q1 FY26",
            "Summary": "ASK Automotive delivered strong quarterly results with revenue growth of 11.1% excluding wheel assembly business, which declined 53.5% strategically. Consolidated revenue grew 3.5% year-on-year. The company achieved 19.3% EBITDA growth and 16.3% PAT growth, with EBITDA margin reaching 13.8%, an improvement of 183 basis points over Q1 FY25. Earnings per share increased to Rs. 3.35 from Rs. 2.88. All three business segments showed positive growth: Advanced Braking System (4%), Aluminum Light-weighting Precision Solutions (15%), and Safety Control Cable (6%). The new Bangalore facility commissioned in January 2025 delivered positive EBITDA and is expected to reach 60% capacity utilization by Q2 FY26. Export revenue remained flat at Rs. 33 crore due to global geopolitical uncertainties. The company maintains mid-teens revenue growth guidance for FY26 despite two-wheeler industry growing only 0.7%. Top customers include Honda Motorcycle (35%), TVS (20-21%), and Hero MotoCorp (17%). The company announced a joint venture with TD Holding for sunroof cables production and expects Rs. 450 crore CAPEX for the year.",
            "Sentiment": "positive",
            "PublishDate": 1754136501745,
            "Source": "earnings"
        },
        {
            "Title": "ASK Automotive Targets Higher Profits Through Export Growth and EV Expansion",
            "Summary": "ASK Automotive aims to increase profitability by focusing on export growth, expanding its electric vehicle segment, and offering premium products. The company projects steady EBITDA margins and expects growth in new joint venture technologies.",
            "Sentiment": "positive",
            "PublishDate": 1753798379425,
            "Source": "stock"
        },
        {
            "Title": "ASK Automotive Reports Strong Q1 Performance with Higher Profits and Margins",
            "Summary": "ASK Automotive delivered improved financial results in Q1. The company's EBITDA increased to 1.2 billion rupees from 1.02 billion rupees year-over-year, while EBITDA margin expanded to 13.49% from 11.83%. Consolidated net profit rose to 661 million rupees compared to 568 million rupees in the previous year. Revenue grew to 8.91 billion rupees from 8.62 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1753789159204,
            "Source": "earnings"
        },
        {
            "Title": "ASK Automotive Schedules Q1 FY26 Earnings Call for July 30, 2025",
            "Summary": "ASK Automotive Limited has scheduled an earnings call for investors and analysts on July 30, 2025, at 5:00 PM IST to discuss the financial results for the quarter ended June 30, 2025. The call will cover both standalone and consolidated financial results. The company will be represented by key management including Chairman and Managing Director Kuldip Singh Rathee, Whole-Time Directors Prashant Rathee and Aman Rathee, Chief Financial Officer Naresh Kumar Sharma, and Chief General Manager-Investor Relations Manoj Sharma. Multiple dial-in options are available including universal numbers for India and international toll-free numbers for various countries.",
            "Sentiment": "neutral",
            "PublishDate": 1753273136732,
            "Source": "earnings"
        },
        {
            "Title": "Ask Automotive Signs Deal with T.D. Holding GmbH for Car Component Production",
            "Summary": "Ask Automotive has entered into an agreement with T.D. Holding GmbH to manufacture and sell sunroof control and helix cables for automobiles. This partnership aims to expand Ask Automotive's product offerings in the automotive components sector.",
            "Sentiment": "positive",
            "PublishDate": 1750931853000,
            "Source": "default"
        },
        {
            "Title": "Ask Automotive: Board Approves Joint Venture with Germany's TD Holding",
            "Summary": "Ask Automotive's board approves a joint venture with Germany's TD Holding GmbH for manufacturing and selling sunroof control cables and helix cables. Ask Automotive will hold a 49% stake, investing ₹2.45 crore total, with an initial ₹49 lakh infusion. The JV marks Ask Automotive's strategic diversification into vehicle electronics and interior systems.",
            "Sentiment": "positive",
            "PublishDate": 1750857599000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ask Automotive Forms Joint Venture with T.D. Holding GmbH",
            "Summary": "Ask Automotive has entered into a joint venture agreement with T.D. Holding GmbH to produce and sell sunroof control and helix cables. Ask Automotive will have a 49% ownership stake in the joint venture, with an investment of 24.5 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1750854225000,
            "Source": "default"
        },
        {
            "Title": "ASK Automotive: Mid-Teens Growth and Margin Improvement Targeted for FY26",
            "Summary": "ASK Automotive aims for mid-teens revenue growth in FY26, expects 150 bps EBITDA margin improvement to 14%, plans ₹450 crore capex, and targets export revenue increase from ₹147 crore to ₹250 crore. The company is optimistic about two-wheeler segment recovery and has a new ₹75 crore export order in pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1747212021000,
            "Source": "earnings"
        },
        {
            "Title": "ASK Automotive: Q4 Profit Rises 21%, Declares Dividend",
            "Summary": "ASK Automotive reported a 20.5% YoY increase in Q4 net profit to ₹57.6 crore. Revenue grew 8.6% to ₹849.7 crore. EBITDA margin expanded to 12.2%. The company declared a final dividend of ₹1.50 per share for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1747143009000,
            "Source": "earnings"
        },
        {
            "Title": "ASK Automotive Reports Q4 Results and Declares Dividend",
            "Summary": "ASK Automotive announced its Q4 financial results, showing improved performance year-over-year. The company reported a consolidated net profit of 576 million rupees, up from 478 million rupees in the same quarter last year. Revenue increased to 8.5 billion rupees from 7.83 billion rupees. EBITDA rose to 1.04 billion rupees with an improved margin of 12.24%. Additionally, the company has recommended a dividend of 1.5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747139490000,
            "Source": "result"
        },
        {
            "Title": "ASK Automotive to Consider Q4 Results on May 13",
            "Summary": "ASK Automotive has announced that it will consider its fourth quarter (Q4) financial results on May 13.",
            "Sentiment": "neutral",
            "PublishDate": 1746446379000,
            "Source": "default"
        },
        {
            "Title": "ASK Automotive Limited: Share Price Hits 5% Upper Circuit on Strategic Partnership",
            "Summary": "ASK Automotive Limited's stock reached the 5% upper circuit limit after announcing a strategic partnership with Kyushu Yanagawa Seiki Co., Ltd. (Japan) for manufacturing high-pressure die-cast alloy wheels for two-wheelers. The share price rose to ₹356.50, a 5% gain from the previous close.",
            "Sentiment": "positive",
            "PublishDate": 1741062662000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ask Automotive Enters Technical Assistance Agreement with Kyushu Yanagawa Seiki",
            "Summary": "Ask Automotive has entered into an agreement with Kyushu Yanagawa Seiki, a Japanese company. Under this agreement, Kyushu Yanagawa Seiki will provide technical assistance to Ask Automotive. This collaboration suggests a potential transfer of technology or expertise from the Japanese firm to Ask Automotive, which could enhance the latter's capabilities in the automotive sector.",
            "Sentiment": "positive",
            "PublishDate": 1741047164000,
            "Source": "corporate_action"
        },
        {
            "Title": "ASK Automotive Signs Technical Assistance Agreement with Kyushu Yanagawa Seiki",
            "Summary": "ASK Automotive has entered into an agreement with Kyushu Yanagawa Seiki, a Japanese company. Under this agreement, Kyushu Yanagawa Seiki will provide technical assistance to ASK Automotive. This collaboration is likely aimed at enhancing ASK Automotive's technological capabilities or product offerings in the automotive sector.",
            "Sentiment": "positive",
            "PublishDate": 1741001849000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ask Automotive Reports Strong Q3 Financial Performance",
            "Summary": "Ask Automotive has announced its Q3 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit increased to 658.9 million rupees, up from 499 million rupees in the same quarter last year and 672.8 million rupees in the previous quarter. Revenue also saw a substantial rise, reaching 9.15 billion rupees compared to 7.6 billion rupees in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1738197275000,
            "Source": "earnings"
        },
        {
            "Title": "ASK Automotive Reports Strong Q3 EBITDA Growth",
            "Summary": "ASK Automotive has reported significant year-over-year improvements in its third quarter financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 1.11 billion rupees, up from 801 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin expanded to 12.1%, compared to 10.52% in the year-ago period, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738150386000,
            "Source": "earnings"
        },
        {
            "Title": "ASK Automotive Reports Q3 Revenue Increase",
            "Summary": "ASK Automotive has reported a revenue of 9.15 billion rupees for the third quarter, compared to 7.6 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738150376000,
            "Source": "earnings"
        },
        {
            "Title": "ASK Automotive Reports Q3 Consolidated Net Profit Increase",
            "Summary": "ASK Automotive has reported a consolidated net profit of 658.9 million rupees for the third quarter, showing an increase from 499 million rupees year-over-year and 672.8 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738150369000,
            "Source": "earnings"
        },
        {
            "Title": "ASK Automotive Launches AISIN ASK Product Range at Bharat Mobility Global Expo 2025",
            "Summary": "ASK Automotive has introduced the AISIN ASK product range at the Bharat Mobility Global Expo 2025. This launch represents a significant corporate action, showcasing the company's expansion into new product lines and potentially strengthening its market position in the automotive sector.",
            "Sentiment": "positive",
            "PublishDate": 1737188430000,
            "Source": "corporate_action"
        },
        {
            "Title": "ASK Automotive Begins Commercial Production at New Karnataka Facility",
            "Summary": "ASK Automotive has announced the commencement of commercial production at its new manufacturing facility in Karnataka. This expansion represents a significant step for the company's growth and production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1736900190000,
            "Source": "corporate_action"
        },
        {
            "Title": "ASK Automotive Commences Commercial Production at New Karnataka Facility",
            "Summary": "ASK Automotive has announced the start of commercial production at its new manufacturing facility located in Karnataka. This expansion marks a significant step in the company's growth strategy and production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1736849770000,
            "Source": "corporate_action"
        },
        {
            "Title": "ASK Automotive: New Plants to Boost Margins",
            "Summary": "ASK Automotive anticipates margin expansion as its new manufacturing facilities become operational.",
            "Sentiment": "positive",
            "PublishDate": 1730279313000,
            "Source": "normal_news"
        },
        {
            "Title": "ASK Automotive Anticipates Strong Growth in FY25",
            "Summary": "ASK Automotive expresses optimism about surpassing industry growth rates in the upcoming quarters of FY25. The company also predicts that the current growth momentum in the two-wheeler sector will persist for the remainder of the year.",
            "Sentiment": "positive",
            "PublishDate": 1730202234000,
            "Source": "normal_news"
        },
        {
            "Title": "ASK Automotive Reports Strong Q2 Financial Performance",
            "Summary": "ASK Automotive has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 1.16 billion rupees from 745 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 11.99% from 9.38% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730201377000,
            "Source": "result"
        },
        {
            "Title": "ASK Automotive Reports Q2 Revenue Growth",
            "Summary": "ASK Automotive has reported a revenue of 9.7 billion rupees for the second quarter, compared to 7.9 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730201369000,
            "Source": "result"
        },
        {
            "Title": "ASK Automotive Reports Significant Profit Growth in Q2",
            "Summary": "ASK Automotive has reported a consolidated net profit of 672.8 million rupees for the second quarter, showing a substantial increase from 412 million rupees in the same period last year. This also represents growth from 568 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730201356000,
            "Source": "result"
        }
    ]
}