{
    "Symbol": "ASMS",
    "ISIN": "INE855F01042",
    "News": [
        {
            "Title": "Bartronics India Signs MoU with Raphael Global Tech",
            "Summary": "Bartronics India Limited entered into a Memorandum of Understanding with Raphael Global Tech Private Limited to explore collaboration opportunities in agriculture, agroforestry, and climate action initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1770739335336,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bartronics India Shareholders Approve Key Resolutions",
            "Summary": "Bartronics India Limited shareholders approved five key resolutions through postal ballot including company name change, borrowing powers up to INR 250 crores, and related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1770727484170,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bartronics India Appoints Dr. Raja Krishna Murthy",
            "Summary": "Bartronics India Limited announces the appointment of Dr. Raja Krishna Murthy as Head – Agri Tech Business to drive scalable agri-tech and climate tech growth under Project Avio Agritech platform.",
            "Sentiment": "positive",
            "PublishDate": 1770605704236,
            "Source": "stocks"
        },
        {
            "Title": "Bartronics India to Launch AI Agritech App in March",
            "Summary": "Bartronics India plans to launch a voice-enabled, multilingual AI agritech app in March under Project Avio Agritech, targeting 20 million farmers over three years.",
            "Sentiment": "positive",
            "PublishDate": 1770357135513,
            "Source": "stocks"
        },
        {
            "Title": "Bartronics India Reports Q3 Net Profit Turnaround",
            "Summary": "Bartronics India achieved a net profit of ₹24 million in Q3, marking a significant turnaround from the ₹3 million loss recorded in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770015034712,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bartronics India Signs MoU with Origo Commodities",
            "Summary": "Bartronics India Limited partners with Origo Commodities to expand agri-focused business through Project Avio, targeting USD 1 billion in agri-linked business over three years across 5,000+ villages.",
            "Sentiment": "positive",
            "PublishDate": 1769678690682,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bartronics India Board Meet Set for Feb 2, 2026",
            "Summary": "Bartronics India Limited has scheduled a board meeting on February 2, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769183069094,
            "Source": "stocks"
        },
        {
            "Title": "Bartronics India Completes Due Diligence for SNN Stake",
            "Summary": "Bartronics India Limited has completed due diligence for acquiring 51% equity stake in Shree Naga Narasimha Private Limited, moving towards definitive agreements with independent valuation.",
            "Sentiment": "positive",
            "PublishDate": 1769142529803,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bartronics India Signs MOU With Origo Commodities",
            "Summary": "Bartronics India enters strategic agritech partnership with Origo Commodities through MOU, exploring potential demerger of agritech division and merger with Origo subject to due diligence completion.",
            "Sentiment": "positive",
            "PublishDate": 1768815164728,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bartronics Gets Nod for 51% Stake in Fresh Produce Firm",
            "Summary": "Bartronics India receives approval to acquire majority stake in Ayou, a fresh produce aggregator, marking entry into organized agricultural trade through Project Avio Agritech initiative.",
            "Sentiment": "positive",
            "PublishDate": 1768199544305,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bartronics India Seeks Name Change to Avio Smart Market",
            "Summary": "Bartronics India issued postal ballot notice for special resolutions including name change to Avio Smart Market Stack Limited, ₹250 crore borrowing powers, and ₹100 crore related party transaction approval.",
            "Sentiment": "neutral",
            "PublishDate": 1767864287544,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bartronics India Eyes 51% Stake in Shree Naga Narasimha",
            "Summary": "Bartronics India announces plans to explore acquisition of majority 51% stake in Shree Naga Narasimha, marking potential expansion move for the IT software company.",
            "Sentiment": "positive",
            "PublishDate": 1767628788613,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bartronics India Forms New Agritech Subsidiary",
            "Summary": "Bartronics India has established a new subsidiary called Bil Agritech Private Limited, marking the company's expansion into the agricultural technology sector.",
            "Sentiment": "positive",
            "PublishDate": 1766494681225,
            "Source": "stocks"
        },
        {
            "Title": "Bartronics India Completes Maharashtra Agritech Rollout",
            "Summary": "Bartronics India completed structured agritech rollout in Maharashtra with 10 field sessions engaging several lakh farmers, plans Uttar Pradesh expansion with multilingual app launch.",
            "Sentiment": "positive",
            "PublishDate": 1766467569938,
            "Source": "stocks"
        },
        {
            "Title": "Bartronics India Signs Agri-Supply Chain MOU",
            "Summary": "Bartronics India has entered into a memorandum of understanding with Shree Naganarasimha for agricultural produce supply chain partnership, marking a strategic collaboration in the agri-sector.",
            "Sentiment": "positive",
            "PublishDate": 1765887985514,
            "Source": "co_actions_results"
        },
        {
            "Title": "Godawari Power Expands BESS Project to 40 GWh Capacity",
            "Summary": "Godawari Power & Ispat Limited approves expansion of Battery Energy Storage System project from 10 GWh to 40 GWh with total investment of ₹1,625 crores across two phases, targeting commercial operations by Q1 FY2027-28.",
            "Sentiment": "positive",
            "PublishDate": 1765515681965,
            "Source": "stocks"
        },
        {
            "Title": "Bartronics India Incorporates BIL Agritech Subsidiary",
            "Summary": "Bartronics India receives approval for BIL Agritech Private Limited incorporation on December 22, 2025, expanding into agri-tech solutions and smart farming systems.",
            "Sentiment": "positive",
            "PublishDate": 1765377578517,
            "Source": "stocks"
        },
        {
            "Title": "Bartronics India Board Approves Agri-Tech Strategy and Health-Tech Expansion",
            "Summary": "Bartronics India's board has endorsed a strategic plan for its agriculture technology unit while also approving the company's expansion into the health technology sector. The dual strategic moves position the company to diversify its technology portfolio across agricultural and healthcare domains.",
            "Sentiment": "positive",
            "PublishDate": 1764594094975,
            "Source": "stock"
        },
        {
            "Title": "Bartronics India Seeks Shareholder Approval for New Statutory Auditor Appointment",
            "Summary": "Bartronics India Limited has issued a postal ballot notice seeking shareholder approval to appoint M/s. SVRL Co., Chartered Accountants as statutory auditor to fill the casual vacancy caused by the resignation of M/s. Brahmayya Co. on November 14, 2025. The e-voting process will remain open from November 18, 2025 to December 17, 2025, with the new auditor to hold office until the next Annual General Meeting and conduct statutory audit for the period ending March 31, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1763375461188,
            "Source": "corporate_action"
        },
        {
            "Title": "Bartronics India Reports Strong Q2 Turnaround with 40% Revenue Growth",
            "Summary": "Bartronics India delivered robust Q2FY26 results with revenue rising 40% year-on-year and quarter-on-quarter to ₹1,239.67 lakh, while net profit increased to ₹100.43 lakh from ₹44.71 lakh in Q1. The performance was driven by stronger field execution, improved productivity in financial inclusion schemes, and enhanced operational leverage, marking significant progress in the company's turnaround journey.",
            "Sentiment": "positive",
            "PublishDate": 1763356288293,
            "Source": "earnings"
        },
        {
            "Title": "Bartronics India Reports Q2 Profit, Changes Statutory Auditor",
            "Summary": "Bartronics India Limited reported net profit of INR 100.45 lakhs for Q2 FY26 and approved unaudited financial results for the quarter ended September 30, 2025. The company's board accepted the resignation of M/s. Brahmayya Co. as statutory auditors due to other professional commitments and appointed M/s. SVRL Co. as replacement auditors, subject to shareholder approval through postal ballot.",
            "Sentiment": "neutral",
            "PublishDate": 1763148059387,
            "Source": "earnings"
        },
        {
            "Title": "Bartronics India Secures 3-Year Corporate Business Correspondent Contract with Maharashtra Gramin Bank",
            "Summary": "Bartronics India has secured a purchase order from Maharashtra Gramin Bank to serve as a Corporate Business Correspondent Provider. The contract spans an initial 3-year term, with execution expected to begin within 30 days of the order.",
            "Sentiment": "positive",
            "PublishDate": 1762843369385,
            "Source": "stock"
        },
        {
            "Title": "Bartronics India Limited Empanelled as Corporate Business Correspondent for Bank of Maharashtra",
            "Summary": "Bartronics India Limited has been empanelled by Bank of Maharashtra as a Corporate Business Correspondent (CBC) Vendor for five years. This marks a milestone in their 15-year association, with Bartronics currently operating across 1,800 villages serving over 15 million people through ISO-standard-compliant processes. The company plans to expand from 1,800 to 3,000 banking touchpoints over 6-9 months, focusing on Maharashtra, Madhya Pradesh, Chhattisgarh, and Karnataka. The expansion will add 1,200 new Customer Service Points and is expected to generate additional 50 crore in revenue over five years while creating employment for 1,200 local CSP agents. Bartronics will facilitate banking services including account opening, deposits, withdrawals, fund transfers, remittances, microinsurance, and social security enrollments.",
            "Sentiment": "positive",
            "PublishDate": 1762491332602,
            "Source": "stock"
        },
        {
            "Title": "Bartronics India Partners with Bank of Maharashtra as Corporate Business Correspondent",
            "Summary": "Bartronics India Limited signed a Service Level Agreement with Bank of Maharashtra on November 4, 2025, to serve as a Corporate Business Correspondent under the bank's Financial Inclusion Programme. The partnership enables Bartronics to provide customer service points, technology infrastructure, and operational support for banking services in unbanked areas across rural, semi-urban, urban, and metro locations. The company will establish biometric-supported kiosks and non-kiosk outlets to deliver banking services to people with limited access to traditional banking. The parties are not related to promoter groups, and this does not constitute a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1762346014611,
            "Source": "stock"
        },
        {
            "Title": "Bartronics India Invests Up to ₹50 Crore in Huwel Life Sciences for Affordable Diagnostics Partnership",
            "Summary": "Bartronics India Limited announced a strategic investment of up to ₹50 crore in Huwel Life Sciences, acquiring a 15% equity stake with an option for an additional 15%. Huwel Life Sciences, led by Dr. Rachana Tripathi, operates from an ISO-certified facility in Hyderabad and has developed over 100 validated diagnostic products across TB, infectious diseases, and cancer. The company's flagship product is the Quantiplus® TB Fast Detection Kit, approved by ICMR and launched by the Union Health Minister. Under the partnership, Bartronics will handle market growth, technology support, digital outreach, and securing government and international orders. The collaboration guarantees assured revenue for Bartronics through a designated subsidiary managing business execution. Both companies plan to expand internationally, targeting emerging markets in Africa and Southeast Asia to position India as a global hub for life sciences innovation.",
            "Sentiment": "positive",
            "PublishDate": 1758777969749,
            "Source": "order&deals"
        },
        {
            "Title": "Bartronics India Approves ₹50 Crore Strategic Investment in Huwel Life Sciences and Name Change Proposal",
            "Summary": "Bartronics India Limited's Board of Directors approved a Memorandum of Understanding with Huwel Life Sciences Private Limited for a strategic equity investment of up to ₹50 crores to be made in tranches. The investment will give Bartronics up to 15% stake in Huwel's fully diluted equity share capital. The investment is subject to due diligence, definitive agreements, and regulatory approvals. The collaboration aims to support future growth, innovation, and business opportunities. The board also approved initiating steps to change the company's name, subject to shareholder and statutory approvals. Additionally, the board approved incorporating a wholly owned subsidiary in India to enhance operational efficiency and pursue new business opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1758625721340,
            "Source": "order&deals"
        },
        {
            "Title": "Bartronics India Partners With Renew Cred for Carbon Credit Opportunities",
            "Summary": "Bartronics India has entered into a non-binding memorandum of understanding with Renew Cred to explore carbon credit opportunities for 40 million farmers. The partnership aims to investigate potential carbon credit initiatives within the agricultural sector.",
            "Sentiment": "positive",
            "PublishDate": 1757408512403,
            "Source": "stock"
        },
        {
            "Title": "Bartronics India Limited Reports Quarterly Results and Office Relocation",
            "Summary": "Bartronics India Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of INR 883.31 lakhs and net profit of INR 21.35 lakhs for the quarter. The Board also approved shifting of registered and corporate offices from SV Chambers to Trendz Atria House in Hyderabad, both locations within Kavuri Hills area. Additionally, the Board acknowledged the Secretarial Audit Report for FY 2024-25. The company operates in technology solutions segment. The auditors noted emphasis matters regarding balances with debtors and implementation of Resolution Plan, including written off foreign currency assets requiring RBI approval.",
            "Sentiment": "neutral",
            "PublishDate": 1754658165336,
            "Source": "earnings"
        },
        {
            "Title": "Bartronics India Appoints Panidapu Lakshmi Naga Srinivasa Rao as Independent Director",
            "Summary": "Bartronics India Limited has appointed Mr. Panidapu Lakshmi Naga Srinivasa Rao as a Non-Executive Independent Director for a five-year term effective June 19, 2025. Mr. Rao brings global leadership experience from organizations like McKinsey & Company and Kusto Capital, and is expected to contribute to the company's strategic direction, including its expansion into the agritech sector. The company specializes in digital banking, financial inclusion, and identity management technologies and serves over 1 million customers. Mr. Rao holds educational qualifications from HHL Leipzig Graduate School of Management in Germany and Andhra University in India. He works closely with founders of fast-growing companies across sectors like fintech, infrastructure, semiconductor, and climate, advising them on growth, fundraising, and M&A. Managing Director N Vidhya sagar Reddy stated that Mr. Rao's global experience and strategic foresight are crucial as Bartronics accelerates its innovation roadmap and expands its international footprint.",
            "Sentiment": "positive",
            "PublishDate": 1753424390575,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bartronics India Appoints Panidapu Lakshmi Naga Srinivasa Rao as Independent Director",
            "Summary": "Bartronics India Limited has appointed Mr. Panidapu Lakshmi Naga Srinivasa Rao as a Non-Executive Independent Director for a five-year term effective June 19, 2025, following shareholder approval. Mr. Rao brings over 20 years of experience in engineering, management consulting, private equity, and cross-border M&A. He is the Founder and Director of TOP2 PTE. LTD., a Singapore-based strategic advisory firm that advises high-growth startups, institutional investors, and enterprises on fundraising and strategic transactions across Southeast Asia. Previously, he worked with Kusto Capital and McKinsey & Company. Mr. Rao holds an MBA from HHL Leipzig Graduate School of Management, Germany, and a Bachelor's degree in Engineering from Andhra University, India. The company confirmed that Mr. Rao is not related to any directors, key managerial personnel, or promoters of the company and has not been debarred from holding directorship by any regulatory authority.",
            "Sentiment": "positive",
            "PublishDate": 1753263421472,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bartronics India Expands Business Scope to Include Agritech, Dairy, and Ayurveda Through MOA Amendment",
            "Summary": "Bartronics India Limited shareholders approved amendments to the company's Memorandum of Association through a postal ballot on July 22, 2025. The amendments expand the company's business scope to include agritech platforms using AI, satellite imaging, and IoT sensors for farm advisory services. The company can now manufacture and distribute agricultural inputs, invest in agritech startups, facilitate carbon credit trading, and establish cold storage infrastructure. Additional activities include manufacturing Ayurveda and nutraceutical products, establishing wellness centers, and processing dairy products like milk, cheese, and ghee. The expansion also covers financial technology solutions for agriculture, digital lending platforms, and establishing Farmer Producer Organizations. The company aims to diversify revenue streams, leverage advanced technologies, and participate in carbon credit markets while strengthening agricultural value chains and promoting financial inclusion in rural areas.",
            "Sentiment": "positive",
            "PublishDate": 1753262914537,
            "Source": "corporate_action"
        },
        {
            "Title": "Bartronics Signs MOU with Ampivo Smart Technologies",
            "Summary": "Bartronics has signed a Memorandum of Understanding (MOU) with Ampivo Smart Technologies Private Ltd. No further details about the nature or purpose of the MOU were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1752479545000,
            "Source": "default"
        },
        {
            "Title": "Bartronics Cancels Cross-Border Merger with PTW Group",
            "Summary": "Bartronics has announced the cancellation of its planned cross-border merger with PTW Group. The decision was made due to regulatory complexities and structural challenges associated with the merger.",
            "Sentiment": "negative",
            "PublishDate": 1749022768000,
            "Source": "default"
        },
        {
            "Title": "Bartronics India Reports Q4 Profit of 9.3M Rupees",
            "Summary": "Bartronics India has reported its quarterly financial results. For Q4, the company posted a net profit of 9.3 million rupees, compared to a loss of 20 million rupees in the same quarter last year. However, this represents a decrease from the previous quarter's profit of 3 million rupees. The company's Q4 revenue stood at 89 million rupees, down from 124 million rupees in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1748349797000,
            "Source": "result"
        },
        {
            "Title": "Bartronics India: Shares Jump 8% on Singapore Branch Opening",
            "Summary": "Bartronics India opened a new branch office in Singapore, located at Peninsula Plaza. The company's stock price increased by 9.68% to ₹14.73 following the announcement. This expansion follows a recent MoU with Singapore-based PTW Group.",
            "Sentiment": "positive",
            "PublishDate": 1743501188000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bartronics India Signs MOU with PTW Group for Semiconductor Facility",
            "Summary": "Bartronics India has entered into a Memorandum of Understanding (MOU) with PTW Group. The collaboration aims to establish a semiconductor facility and training centre in India. This partnership could potentially boost India's semiconductor industry and enhance local expertise in this critical technology sector.",
            "Sentiment": "positive",
            "PublishDate": 1740010609000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bartronics India Promoter to Sell 6.29% Stake via Offer for Sale",
            "Summary": "Kinex India, a promoter of Bartronics India, plans to sell a 6.29% stake (1.91 crore shares) in the company through an Offer for Sale (OFS) on January 14 & 15, 2025. The floor price for the offer is set at ₹22 per share. The OFS will open for non-retail investors on January 14 and for retail investors on January 15.",
            "Sentiment": "neutral",
            "PublishDate": 1736813517000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bartronics India: Promoter Announces 6.2% Stake Sale via OFS",
            "Summary": "Bartronics India's promoter Kinex India Pvt. to sell 1.91 crore shares (6.29% stake) through an offer for sale. Floor price set at Rs 22 per share, valuing the sale at Rs 42.1 crore. OFS to be conducted over two days on NSE and BSE, with Kotak Securities as the broker.",
            "Sentiment": "neutral",
            "PublishDate": 1736773234000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bartronics India: Strategic Partnership with PTW Group to Boost Semiconductor Industry",
            "Summary": "Bartronics India signed an MoU with Singapore's PTW Group to establish semiconductor fabrication facilities, equipment production, and workforce training in India. The stock hit a 5% upper circuit at ₹24.62 following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1736320468000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bartronics India Limited Schedules Board Meeting to Approve MoU with TPW Global Singapore",
            "Summary": "Bartronics India Limited has announced a board meeting scheduled for January 8th to consider and approve a Memorandum of Understanding (MoU) with TPW Global Singapore. This meeting suggests potential collaboration or business arrangement between the two companies, which could impact Bartronics' future operations or strategic direction.",
            "Sentiment": "neutral",
            "PublishDate": 1735863432000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kinex India to Sell 6.57% Stake in Bartronics India",
            "Summary": "Kinex India has proposed to sell a 6.57% stake in Bartronics India through an offer for sale. The floor price for the offer has been set at 19 rupees per share, according to a regulatory filing.",
            "Sentiment": "neutral",
            "PublishDate": 1734482381000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bartronics India: Expands into Digital Healthcare with Strategic Investment",
            "Summary": "Bartronics India Limited acquired a 6.47% stake in Ampivo Smart Technologies for Rs 1.49 crore, expanding its presence in the digital healthcare sector. The company also partnered with Bank of India to improve financial literacy and inclusion. Bartronics' stock rose 1.83% to Rs 23.94.",
            "Sentiment": "positive",
            "PublishDate": 1729156582000,
            "Source": "normal_news"
        }
    ]
}