{
    "Symbol": "ASTERDM",
    "ISIN": "INE914M01019",
    "News": [
        {
            "Title": "Aster DM Healthcare Q3 FY26 Results Show Strong Growth",
            "Summary": "Aster DM Healthcare delivered 13% revenue growth to INR 1,186 crore in Q3 FY26, with operating EBITDA up 11% to INR 224 crore. Combined with QCIL, the platform achieved 15% revenue growth to INR 2,366 crore.",
            "Sentiment": "positive",
            "PublishDate": 1770633957554,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aster DM Healthcare Q3FY26 Results & Board Decisions",
            "Summary": "Aster DM Healthcare reports Q3FY26 results with revenue of ₹665.75 crores. Board approves ESOP Scheme 2026, loan conversion of ₹129.35 crores, and merger proceedings with Quality Care India Limited.",
            "Sentiment": "positive",
            "PublishDate": 1769780241819,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aster DM Healthcare to Acquire Remaining 20.25% Stake in MIMS",
            "Summary": "Aster DM Healthcare's Investment Committee approved acquisition of additional equity shares in material subsidiary MIMS to increase shareholding from 79.75% to 100% through cash consideration of INR 202 per share.",
            "Sentiment": "positive",
            "PublishDate": 1769664106379,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aster DM Healthcare Q3FY26 earnings call on Feb 2",
            "Summary": "Aster DM Healthcare schedules earnings conference call for February 02, 2026 at 11:00 AM IST to discuss Q3FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769495712817,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aster DM Healthcare Board Meet Set for Jan 30, 2026",
            "Summary": "Aster DM Healthcare schedules board meeting on January 30, 2026 to review Q3FY26 financial results and consider adoption of new Employee Stock Option Scheme 2026 under regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1769170408628,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aster DM Healthcare Gets NCLT Nod for Merger Meetings",
            "Summary": "NCLT Hyderabad approves meetings for Aster DM Healthcare-Quality Care India merger scheme. Shareholder and creditor meetings scheduled between Feb 27-Mar 13, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769070052688,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aster DM Healthcare Schedules Hospital Visit for Investors",
            "Summary": "Aster DM Healthcare announces hospital visit for investors and analysts at Aster Medcity Kochi and QCIL KIMS Trivandrum on January 08-09, 2026, with management interactions planned.",
            "Sentiment": "neutral",
            "PublishDate": 1767423515660,
            "Source": "stocks"
        },
        {
            "Title": "Aster DM Healthcare Acquires 11.94% Stake in Prerana",
            "Summary": "Aster DM Healthcare increases its stake in Prerana Hospital Limited to 98.92% by acquiring an additional 11.94% for ₹38.36 crores, with remaining 1.08% to be acquired by December 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767172585518,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aster DM Healthcare clarifies ₹125 cr Kerala project",
            "Summary": "Aster DM Healthcare issues clarification on December 18 media release about proposed ₹125 crore healthcare development project in Kottakkal, Kerala, stating it requires corporate approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1766244506466,
            "Source": "stocks"
        },
        {
            "Title": "Aster DM Healthcare Receives Approval to Shift Registered Office from Karnataka to Telangana",
            "Summary": "Aster DM Healthcare received approval from the Regional Director on November 18, 2025, to relocate its registered office from Karnataka to Telangana, with the new address at Ameerpet, Hyderabad. The company cited better administrative convenience, operational efficiency, business integration, and seamless scheme implementation as reasons for the relocation.",
            "Sentiment": "positive",
            "PublishDate": 1763466972552,
            "Source": "corporate_action"
        },
        {
            "Title": "Aster DM Healthcare Reports 10% Revenue Growth to ₹1,197 Cr in Q2FY26, Kerala Cluster Achieves Record Performance",
            "Summary": "Aster DM Healthcare delivered quarterly revenue growth of 10% YoY to ₹1,197 crore with operating EBITDA margins expanding 200 basis points to 22%, driven by Kerala cluster's record revenue of ₹620 crore and strong recovery in medical value travel business growing 60% QoQ. The company progressed on its merger with Quality Care India Limited after receiving no-objection letters from BSE and NSE, with the combined entity targeting 24-25% EBITDA margins post-integration while adding over 200 beds to reach 5,199 total beds.",
            "Sentiment": "positive",
            "PublishDate": 1763111470632,
            "Source": "earnings"
        },
        {
            "Title": "Aster DM Healthcare Independent Director Emmanuel David Gootam Completes First Term",
            "Summary": "Emmanuel David Gootam has completed his first term as an Independent Director of Aster DM Healthcare Limited and ceased to be a Director of the Company with effect from end of the day on November 9, 2025. He also ceased to be a Member/Chairperson of the Audit Committee, Nomination and Remuneration Committee, and Medical Excellence Committee of the Board. The company has informed the stock exchanges BSE and NSE about this completion of tenure under regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1762680383449,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aster DM Healthcare Reports 10% Revenue Growth in Q2, Kerala Cluster Shows Strong Turnaround",
            "Summary": "Aster DM Healthcare reported revenue of INR 1,197 crores for Q2, representing 10% year-on-year and 11% quarter-on-quarter growth. Operating EBITDA increased 13% year-on-year and 22% quarter-on-quarter to INR 263 crores, with margins improving to 22.0% from 21.4% in the previous year. Normalised PAT grew 14% year-on-year to INR 110 crores. The Kerala cluster delivered its highest-ever quarterly revenue of INR 620 crores with 12% quarter-on-quarter growth, driven by 13% growth in inpatient volumes and 67% surge in MVT revenues. Aster MIMS Kasaragod, a 264-bed facility, commenced operations on October 2, 2025. The company has received no-objection letters from stock exchanges for its merger with Quality Care India Ltd and will approach NCLT for approval. The transaction is expected to complete by Q1 FY27. Quality Care India Ltd reported 15% year-on-year revenue growth to INR 1,193 crores in Q2. The combined entity would operate over 10,360 beds across 38 hospitals in 27 cities, with proforma revenue of INR 2,390 crores and operating EBITDA of INR 550 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762485022788,
            "Source": "earnings"
        },
        {
            "Title": "Aster DM Healthcare Reports Board Changes and Financial Results for Quarter Ended September 2025",
            "Summary": "Aster DM Healthcare's Board approved unaudited financial results for the quarter and half-year ended September 30, 2025, with statutory auditor Deloitte Haskins & Sells issuing an unmodified opinion. The company reported a standalone net loss of INR 10.61 crores for the quarter, compared to a profit of INR 80.99 crores in the previous year quarter. On a consolidated basis, the company posted a net profit of INR 93.56 crores for the quarter. Non-Executive Director Anoop Moopen resigned effective November 6, 2025, citing other business commitments, leading to changes in committee compositions with T.J. Wilson inducted into the Nomination and Remuneration Committee. The Board approved new registered office premises in Hyderabad, Telangana, subject to Regional Director approval for shifting from Karnataka. The company deferred consideration of the Employee Stock Option Scheme 2025 for further review. During the reporting period, Aster DM acquired additional 12.99% stake in Dr. Ramesh Cardiac and Multispeciality Hospital Private Limited for INR 62.91 crores and invested INR 50.01 crores in wholly-owned subsidiary Aster DM Super Speciality Hospital (Sarjapur) Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1762482663001,
            "Source": "corporate_action"
        },
        {
            "Title": "Aster DM Healthcare Plans ₹900 Cr Capex for Expansion and Double-Digit Growth",
            "Summary": "Aster DM Healthcare has outlined plans for continued double-digit growth driven by India hospitals, GCC expansion, and digital health platforms. The company will invest ₹900 crores in capital expenditure over the next three years to add more than 1,500 beds and expand clinics and pharmacies across the GCC region. The healthcare provider is focusing on asset-light partnerships in Tier 2 and Tier 3 Indian cities, telehealth integration, and margin expansion through case-mix optimization and cost efficiency measures.",
            "Sentiment": "positive",
            "PublishDate": 1762444467067,
            "Source": "stock"
        },
        {
            "Title": "Aster DM Healthcare Reports 13.6% Growth in Q2 Net Profit to 1.1 Billion Rupees",
            "Summary": "Aster DM Healthcare reported quarterly net profit of 1.1 billion rupees compared to 968.4 million rupees in the same period last year. Revenue increased to 11.97 billion rupees from 10.86 billion rupees year-over-year. EBITDA rose to 2.5 billion rupees from 2.2 billion rupees, while EBITDA margin improved to 20.87% from 20.23% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762434132611,
            "Source": "earnings"
        },
        {
            "Title": "Aster DM Healthcare Hits Record High Following ICRA Rating Upgrade",
            "Summary": "Aster DM Healthcare shares surged 6% to reach an all-time high of ₹699.55 after ICRA upgraded the company's long-term rating to [ICRA]A+ and short-term rating to [ICRA]A1+. The upgrade was attributed to the company's expanding operational scale, robust financial profile, and strategic growth plans. The healthcare provider reported 11.9% revenue growth in FY25, driven by increased inpatient volumes and improved average revenue per occupied bed. Operating EBITDA margins improved to 19.5% in FY25 and 20% in Q1 FY26. The company benefited from proceeds of its GCC business segregation, which enhanced liquidity for dividends and expansion funding. Aster is merging with Quality Care India Ltd to form Aster DM Quality Care Ltd, expected to become one of India's top three hospital chains. The company plans to add 2,600 beds through various projects. The stock has gained 63% over the past year and 9% in the past four sessions.",
            "Sentiment": "positive",
            "PublishDate": 1759916517156,
            "Source": "stock"
        },
        {
            "Title": "Aster DM Healthcare Gets Stock Exchange Approval for Quality Care India Merger",
            "Summary": "Aster DM Healthcare has received no-objection certificates from both BSE and NSE for its proposed merger with Quality Care India. The stock exchange approvals represent a key regulatory milestone in the merger process between the two healthcare companies.",
            "Sentiment": "positive",
            "PublishDate": 1759750434110,
            "Source": "order&deals"
        },
        {
            "Title": "Aster Digital Health CEO Harsha Rajaram Resigns",
            "Summary": "Harsha Rajaram has resigned from his position as CEO of Aster Digital Health, a subsidiary of Aster DM Healthcare Ltd.",
            "Sentiment": "negative",
            "PublishDate": 1759213833867,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aster DM Healthcare Reports Strong Q1 FY26 Results with 8% Revenue Growth and 21% EBITDA Expansion",
            "Summary": "Aster DM Healthcare delivered robust quarterly results with revenue growing 8% year-on-year to INR 1,078 crores and operating EBITDA expanding 21% to INR 215 crores, achieving a 20% margin. Normalized PAT increased 22% to INR 90 crores. The Kerala cluster showed recovery with 5% revenue growth after previous quarter's 4% decline, driven by 6% sequential increase in patient volumes and 12% jump in medical value travel revenues. ARPOB registered strong 14% year-on-year growth, supported by reduced average length of stay and higher oncology contributions. The company added over 300 beds, bringing total capacity to 5,197 beds, with plans to add another 2,600 beds. The proposed merger with Quality Care India Limited progressed with shareholder approvals and Competition Commission clearance. QCIL reported 16% revenue growth to INR 1,079 crores with 19% EBITDA growth. The combined entity would operate over 10,350 beds across 38 hospitals in 27 cities. Aster Labs showed turnaround with EBITDA margins improving from 3.4% to 7.6%. The company maintained strong liquidity with INR 1,455 crores in cash and cash equivalents while gross debt remained at INR 643 crores. ROCE improved significantly from 16.5% to 20.7%.",
            "Sentiment": "positive",
            "PublishDate": 1754565680241,
            "Source": "earnings"
        },
        {
            "Title": "Aster DM Healthcare Appoints Sudeep Dey as Chief Information Officer & Chief Information Security Officer",
            "Summary": "Aster DM Healthcare Limited appointed Mr. Sudeep Dey as Chief Information Officer & Chief Information Security Officer, effective August 01, 2025, on a full-time employment basis. Dey brings over 25 years of experience in enterprise IT, business process reengineering, and AI-driven healthcare solutions. He previously served as President IT & CIO at Healthcare Global Enterprises (HCG), leading digital transformation and clinical IT innovation. His career includes leadership roles at Fortis Healthcare, Godfrey Phillips, and Oracle Financial Services. Dey holds a graduate degree in Physics from Ch. Charan Singh University and a PGDBA in Finance from Symbiosis, along with certifications from Harvard, Stanford, Johns Hopkins, and the University of Pennsylvania in AI, digital transformation, risk & compliance, and fintech. He has received top CIO awards and specializes in cybersecurity, enterprise automation, and healthcare IT innovations.",
            "Sentiment": "positive",
            "PublishDate": 1754035640848,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aster DM Targets ₹1,000 Crore EBITDA by FY27, Plans Strategic Expansion",
            "Summary": "Aster DM has set a target to achieve ₹1,000 crore EBITDA in its India business by FY27. The company expects to generate over ₹1,500 crore in free cash flow following its GCC deal. The healthcare company is expanding operations through increased bed additions and pharma retail expansion. Aster DM is also pursuing strategic mergers and acquisitions in profitable healthcare segments.",
            "Sentiment": "positive",
            "PublishDate": 1753896169519,
            "Source": "stock"
        },
        {
            "Title": "Aster DM Healthcare Reports Q1 Results, Declares INR 1 Final Dividend and Asset Transfer Deal",
            "Summary": "Aster DM Healthcare Limited reported unaudited financial results for the quarter ended June 30, 2025. The company's standalone revenue from operations increased to INR 613.04 crores compared to INR 565.62 crores in the same quarter last year. Standalone profit for the quarter was INR 80.59 crores versus INR 6,008.24 crores in the previous year quarter. On a consolidated basis, revenue from operations reached INR 1,077.87 crores compared to INR 1,001.87 crores year-on-year, with consolidated profit at INR 93.56 crores versus INR 5,152.20 crores in the prior year quarter. The Board approved a final dividend of INR 1 per equity share for financial year 2024-25, subject to shareholder approval at the 17th Annual General Meeting scheduled for September 4, 2025. The record date for dividend eligibility and voting rights is set for August 28, 2025. The company also approved the purchase of identified assets of Block D of Aster Whitefield Hospital from its wholly owned subsidiary AMHPL for a consideration not exceeding INR 80 crores. The Board amended several policies including those related to related party transactions, materiality disclosures, and insider trading.",
            "Sentiment": "positive",
            "PublishDate": 1753881872039,
            "Source": "earnings"
        },
        {
            "Title": "Aster DM Healthcare Increases Stake in Subsidiary to 70.49% and Approves 500-Bed Hospital Lease in Bengaluru",
            "Summary": "Aster DM Healthcare acquired an additional 13% stake in its subsidiary Dr. Ramesh Cardiac & Multispecialty Hospital Pvt Ltd (DRCM) for INR 63.01 crores, increasing its shareholding from 57.49% to 70.49%. The acquisition follows the exercise of put option by DRCM's promoter group under a shareholders agreement from April 2016, with completion expected within 1-2 months. DRCM, established in 1995 and based in Vijayawada, reported turnover of INR 258 crores and profit of INR 12.82 crores. Additionally, the company approved a 30-year lease agreement with KEMWELL Private Limited for a property in Yeshwanthpur, Bengaluru to establish a 500-bed super-specialty hospital. The project requires INR 580 crores investment through bank loans and internal accruals, with operations expected to begin in H2 FY 28-29. The hospital will serve the growing healthcare needs in the strategically located Yeshwanthpur corridor with metro and railway connectivity.",
            "Sentiment": "positive",
            "PublishDate": 1753855555091,
            "Source": "stock"
        },
        {
            "Title": "Aster DM Healthcare Establishes New Super-Specialty Hospital Subsidiary in Bengaluru",
            "Summary": "Aster DM Healthcare has established a new super-specialty hospital subsidiary in Bengaluru as part of its regional expansion strategy. The move represents the company's efforts to strengthen its presence in the healthcare sector through geographic expansion.",
            "Sentiment": "positive",
            "PublishDate": 1753714950545,
            "Source": "stock"
        },
        {
            "Title": "Aster DM Healthcare Incorporates New Wholly Owned Subsidiary for Super-Specialty Hospital in Bengaluru",
            "Summary": "Aster DM Healthcare Limited has incorporated a new wholly owned subsidiary named Aster DM Super-Specialty Hospital (Yeswanthpur) Private Limited in Bengaluru, Karnataka, India on July 28, 2025. The subsidiary was established with an authorized and paid-up share capital of Rs. 1,00,000, comprising 10,000 equity shares of Rs. 10 each. The entity operates in healthcare services and was incorporated to set up and operate a super-specialty hospital. Aster DM Healthcare holds 100% shareholding in the new subsidiary through cash investment by way of subscription to share capital. The subsidiary has not yet commenced business operations.",
            "Sentiment": "positive",
            "PublishDate": 1753714186776,
            "Source": "corporate_action"
        },
        {
            "Title": "Aster DM Healthcare Forms New Subsidiary Aster Sarjapur",
            "Summary": "Aster DM Healthcare has established a new subsidiary called Aster Sarjapur. The healthcare company has expanded its corporate structure through this new entity formation.",
            "Sentiment": "positive",
            "PublishDate": 1753193251466,
            "Source": "corporate_action"
        },
        {
            "Title": "Aster DM Healthcare: Q4 Profit Surge and GCC Business Separation",
            "Summary": "Aster DM Healthcare reported a Q4 FY25 net profit of Rs 85.54 crore, compared to a loss in the previous year. FY25 consolidated revenue reached Rs 4,138.46 crore, showing 12% YoY growth. The company completed the separation of its GCC business, recording a gain of Rs 5,148.09 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747800068000,
            "Source": "earnings"
        },
        {
            "Title": "Aster DM Healthcare Reports Q4 Profit and Announces Dividend",
            "Summary": "Aster DM Healthcare reported a consolidated net profit of 790.2 million rupees in Q4, compared to a loss of 240.3 million rupees in the same quarter last year. Revenue increased to 10 billion rupees from 9.74 billion rupees year-over-year. The company had an exceptional item loss of 264.2 million rupees. Profit before tax rose to 905.4 million rupees from 723.2 million rupees in the previous year. The company recommended a final dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747786928000,
            "Source": "default"
        },
        {
            "Title": "Aster DM Healthcare: Q4 Profit Turnaround with 20% EBITDA Growth",
            "Summary": "Aster DM Healthcare reported a Q4 net profit of ₹79 crore, reversing last year's loss. Revenue increased 2.7% to ₹1,000 crore. EBITDA rose 20.3% to ₹191.7 crore with margin expansion to 19.2%.",
            "Sentiment": "positive",
            "PublishDate": 1747751315000,
            "Source": "earnings"
        },
        {
            "Title": "Aster DM Healthcare Reports Q4 Results and Dividend Announcement",
            "Summary": "Aster DM Healthcare announced its Q4 financial results. The company's Q4 EBITDA increased to 1.92 billion rupees from 1.59 billion rupees year-over-year, with EBITDA margin improving to 19.2% from 16.37%. Q4 revenue rose to 10 billion rupees from 9.74 billion rupees year-over-year. The company reported a Q4 consolidated net profit of 790.2 million rupees, compared to a loss of 240.3 million rupees in the same quarter last year. There was an exceptional item loss of 264.2 million rupees. The company's board recommended a final dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747748341000,
            "Source": "result"
        },
        {
            "Title": "Aster DM Healthcare to Consider Q4 Results on May 20",
            "Summary": "Aster DM Healthcare has announced that it will consider its fourth quarter financial results on May 20. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747225910000,
            "Source": "default"
        },
        {
            "Title": "Aster DM Healthcare Signs 30-Year Lease for New Hospital in Bengaluru",
            "Summary": "Aster DM Healthcare has entered into a 30-year lease agreement with Bren for a 430-bed multi-specialty hospital on Sarjapur Road, Bengaluru. This move signifies a significant expansion of Aster DM Healthcare's presence in the city and demonstrates their long-term commitment to providing healthcare services in the region.",
            "Sentiment": "positive",
            "PublishDate": 1746586579000,
            "Source": "default"
        },
        {
            "Title": "Aster DM Healthcare Acquires 5% Stake in Quality Care India",
            "Summary": "Aster DM Healthcare has completed the acquisition of a 5% stake in Quality Care India Ltd. The transaction was structured as a share swap, with a value of approximately 849 crore rupees. No cash outflow was involved in this acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1746026595000,
            "Source": "default"
        },
        {
            "Title": "Aster DM Healthcare: Acquires 5% Stake in Quality Care India for Rs 849 Crore",
            "Summary": "Aster DM Healthcare has acquired a 5% stake in Quality Care India Ltd. for Rs 849.13 crore through a share swap deal. This acquisition is the first step towards a strategic merger between the two companies, expected to be completed this year. Aster issued 1,86,07,969 equity shares to private equity investors in exchange for 1,90,46,028 shares of Quality Care India.",
            "Sentiment": "positive",
            "PublishDate": 1746026555000,
            "Source": "corporate_action"
        },
        {
            "Title": "CCI Approves Merger of Aster DM Healthcare and Quality Care India",
            "Summary": "The Competition Commission of India (CCI) has given its approval for the merger between Aster DM Healthcare and Quality Care India Ltd. This merger will result in the creation of one of India's top three hospital chains, with a combined network of 38 hospitals and over 10,150 beds.",
            "Sentiment": "positive",
            "PublishDate": 1745063319000,
            "Source": "default"
        },
        {
            "Title": "CCI Approves Proposed Transaction Involving Aster DM Healthcare and Others",
            "Summary": "The Competition Commission of India (CCI) has given its approval for a proposed transaction involving Aster DM Healthcare, BCP Asia, Centella, and Quality Care India Limited. This regulatory clearance is a significant step in the progression of the deal, potentially impacting the healthcare sector in India.",
            "Sentiment": "neutral",
            "PublishDate": 1744762193000,
            "Source": "default"
        },
        {
            "Title": "CCI Approves Proposed Transaction Involving Aster DM Healthcare and Others",
            "Summary": "The Competition Commission of India (CCI) has approved a proposed transaction involving Aster DM Healthcare, BCP Asia, Centella, and Quality Care India Limited. This regulatory approval is a significant step in the progression of the transaction, which likely involves some form of merger, acquisition, or restructuring among these healthcare entities.",
            "Sentiment": "positive",
            "PublishDate": 1744722060000,
            "Source": "default"
        },
        {
            "Title": "Aster DM Healthcare Block Trade on NSE",
            "Summary": "A block trade of approximately 524,994 shares of Aster DM Healthcare Ltd. took place on the National Stock Exchange (NSE) at a price of Rs. 479.40 per share. The total value of the transaction amounted to Rs. 25.17 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1744171844000,
            "Source": "block_deals"
        },
        {
            "Title": "Aster DM Healthcare Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) for Aster DM Healthcare Ltd. The transaction involved approximately 1,776,151 shares, traded at a price of Rs. 455.75 per share. The total value of the block trade amounted to Rs. 80.95 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1743138005000,
            "Source": "block_deals"
        },
        {
            "Title": "Aster DM Healthcare: Ambitious Revenue Growth Plans and Strategic Merger",
            "Summary": "Aster DM Healthcare aims to double revenue to Rs 13,500 crore by FY30, focusing on 20-25% CAGR. The company is expanding key departments and merging with Quality Care India Ltd. Promoters have reduced share pledge from 99% to 41% after debt refinancing.",
            "Sentiment": "positive",
            "PublishDate": 1742010080000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aster DM Healthcare: Preferential Share Issue Approved for Non-Cash Consideration",
            "Summary": "Aster DM Healthcare received approval to issue 1.86 crore shares at a minimum price of Rs 456.33 to non-promoters on a preferential basis. The issuance is subject to CCI approval and is part of a share swap arrangement.",
            "Sentiment": "neutral",
            "PublishDate": 1741858423000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aster DM Healthcare Expects Merger Benefits and Margin Growth",
            "Summary": "Aster DM Healthcare anticipates merger benefits to materialize in early FY26. The company projects margins to reach approximately 25% within the next 3-5 years. Management expresses strong confidence in the company's growth plans, and promoters have no intention to sell their stake.",
            "Sentiment": "positive",
            "PublishDate": 1741839936000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aster DM Healthcare Promoters Significantly Reduce Pledged Shareholding",
            "Summary": "The promoters of Aster DM Healthcare have reduced their pledged shareholding from 99% to 41%, as reported by NDTV Profit. This substantial decrease in pledged shares indicates a significant improvement in the promoters' financial position or a strategic decision to reduce their leverage.",
            "Sentiment": "positive",
            "PublishDate": 1741836879000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aster DM Healthcare: Promoters Slash Share Pledge to 41% After Debt Refinancing",
            "Summary": "Aster DM Healthcare's promoters have reduced their share pledge from 99% to 41% following a debt refinancing transaction with JP Morgan, HSBC, and Barclays. The new funding allows for better loan terms and loan-to-value ratios.",
            "Sentiment": "positive",
            "PublishDate": 1741781484000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aster DM Healthcare to Invest 8.50 Billion Rupees in Kerala",
            "Summary": "Aster DM Healthcare has announced plans to invest 8.50 billion rupees in Kerala state over the next three years. This investment is expected to create more than 4,200 employment opportunities in the region.",
            "Sentiment": "positive",
            "PublishDate": 1740355737000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aster DM Healthcare to Invest 8.5 Billion Rupees in Kerala",
            "Summary": "Aster DM Healthcare has announced plans to invest 8.5 billion rupees in Kerala state over the next three years. This investment is expected to create more than 4,200 employment opportunities in the region.",
            "Sentiment": "positive",
            "PublishDate": 1740146408000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aster DM Healthcare Declares Dividend of 4 Rupees per Share",
            "Summary": "Aster DM Healthcare has announced a dividend of 4 rupees per equity share for its shareholders. This corporate action represents a distribution of profits to the company's investors.",
            "Sentiment": "positive",
            "PublishDate": 1738329339000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aster DM Healthcare Reports Improved Q3 Financial Performance",
            "Summary": "Aster DM Healthcare has announced its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 1.9 billion rupees, up from 1.5 billion rupees in the same quarter of the previous year. Additionally, the EBITDA margin improved to 18% from 15.92% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738329295000,
            "Source": "earnings"
        },
        {
            "Title": "Aster DM Healthcare Reports Q3 Financial Results",
            "Summary": "Aster DM Healthcare announced its Q3 consolidated net profit of 568 million rupees, showing a decrease from 1.8 billion rupees year-over-year. However, it increased from 968 million rupees quarter-over-quarter. The company's Q3 revenue rose to 10.5 billion rupees from 9.5 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738329224000,
            "Source": "earnings"
        }
    ]
}