{
    "Symbol": "ASTEC",
    "ISIN": "INE563J01010",
    "News": [
        {
            "Title": "Astec Lifesciences Q3 Loss Narrows to ₹157M",
            "Summary": "Astec Lifesciences reported reduced consolidated net loss of ₹157M in Q3 compared to ₹404M loss in previous year, while revenue grew 33% to ₹1.25B from ₹939M year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1769781375534,
            "Source": "co_actions_results"
        },
        {
            "Title": "ASTEC Lifesciences CFO Mugdha Amol Khare Resigns",
            "Summary": "ASTEC Lifesciences announces the resignation of Chief Financial Officer Mugdha Amol Khare from her position at the agrochemical company.",
            "Sentiment": "neutral",
            "PublishDate": 1769777623283,
            "Source": "stocks"
        },
        {
            "Title": "Astec Lifesciences Appoints Milind Bhangaonkar as GM",
            "Summary": "Astec Lifesciences Limited has appointed Mr. Milind Bhangaonkar as General Manager-Operations (Site Head) and Senior Management Personnel effective December 15, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765811203396,
            "Source": "stocks"
        },
        {
            "Title": "Astec Lifesciences Reports Reduced Net Loss Despite Revenue Decline in Q2",
            "Summary": "Astec Lifesciences reported a consolidated net loss of 244.2 million rupees in Q2, an improvement from the previous year's loss of 385.5 million rupees. However, the company's revenue declined to 737.2 million rupees compared to 985.4 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1761738842919,
            "Source": "earnings"
        },
        {
            "Title": "Astec LifeSciences Associate VP Operations Resigns",
            "Summary": "Astec LifeSciences announced the resignation of Vivek Ramchandra Thorat from his position as Associate Vice President - Operations, effective October 24, 2025. Thorat resigned to pursue opportunities outside the company. The company has accepted his resignation and relieved him from his duties. According to company policy, the notice period was 90 days, though his last working date was October 24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761320267561,
            "Source": "corporate_governance"
        },
        {
            "Title": "Astec LifeSciences Board Approves Re-appointment of Two Independent Directors and Related Party Transactions",
            "Summary": "Astec LifeSciences Limited's Board of Directors approved the re-appointment of Mr. Nandkumar Dhekne and Ms. Anjali Gupte as Non-Executive & Independent Directors for second terms of 5 years each, from December 18, 2025 to December 17, 2030. Both appointments are subject to shareholder approval. The Board also approved seeking shareholder consent for Related Party Transactions with holding company Godrej Agrovet Limited during Financial Year 2025-26, which exceed materiality thresholds. A postal ballot process will be conducted for shareholder approval on these matters, along with the appointment of Mr. Sunil Kataria as Non-Executive, Non-Independent Director. Mr. Vikas R. Chomal has been appointed as Scrutinizer for the postal ballot and e-voting process.",
            "Sentiment": "neutral",
            "PublishDate": 1759504839405,
            "Source": "corporate_governance"
        },
        {
            "Title": "Godrej Agrovet Increases Stake in Astec LifeSciences to 67.03% Through Market Purchase and Rights Issue",
            "Summary": "Godrej Agrovet Limited acquired 25,31,229 additional shares in Astec LifeSciences Limited, increasing its shareholding from 63.36% to 67.03%. The acquisition was completed through open market purchases and a rights issue on July 29, 2025. Before the transaction, Godrej Agrovet held 1,24,04,016 shares, and after the acquisition, its total holding reached 1,49,35,245 shares. The target company's equity share capital increased from Rs. 19,61,17,100 to Rs. 22,28,16,610 following the transaction. Godrej Agrovet is identified as a promoter of Astec LifeSciences, which is listed on both BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1754025531006,
            "Source": "corporate_action"
        },
        {
            "Title": "Astec Lifesciences Reports Revenue Growth Despite Continued Losses in Q1",
            "Summary": "Astec Lifesciences reported Q1 revenue of 911 million rupees, representing growth from 694 million rupees in the same period last year. The company posted a consolidated net loss of 330 million rupees, which was an improvement from the 397 million rupee loss recorded in the previous year's corresponding quarter. EBITDA loss narrowed significantly to 110 million rupees compared to a loss of 463 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1753695994027,
            "Source": "earnings"
        },
        {
            "Title": "Astec Lifesciences Files Offer Letter for Rights Issue",
            "Summary": "Astec Lifesciences has filed an offer letter for a rights issue worth ₹249.35 crore. No further details about the terms or purpose of the rights issue were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1751476409000,
            "Source": "default"
        },
        {
            "Title": "Astec LifeSciences: ₹249.35 Crore Rights Issue Announced at ₹890 per Share",
            "Summary": "Astec LifeSciences Limited has announced a rights issue of ₹249.35 crore, offering 28,01,673 equity shares at ₹890 each. The issue will be in the ratio of 1:7 for existing shareholders. The record date is set for July 4, 2025, with the issue opening on July 14 and closing on July 28, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1751293091000,
            "Source": "corporate_action"
        },
        {
            "Title": "Astec Lifesciences Approves Rights Issue of 249.35 Crores",
            "Summary": "Astec Lifesciences' board has approved a rights issue worth 249.35 crores. The issue price is set at 890 rupees per share, with a total of 28,01,673 shares to be offered.",
            "Sentiment": "positive",
            "PublishDate": 1751284056000,
            "Source": "default"
        },
        {
            "Title": "Astec Lifesciences: Board Approves ₹250 Crore Rights Issue",
            "Summary": "Astec Lifesciences' Board of Directors has approved a rights issue to raise up to ₹250 crore. The company will issue fully paid-up equity shares with a face value of ₹10. Details such as record date and entitlement ratio will be determined later. The stock surged 7.5% to ₹821.5 following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1750749848000,
            "Source": "corporate_action"
        },
        {
            "Title": "Astec Lifescience Board Meeting to Discuss Fundraising",
            "Summary": "Astec Lifescience has announced that its Board of Directors will meet on June 24 to discuss a fundraising proposal. No further details about the nature or amount of the potential fundraising were provided in the given information.",
            "Sentiment": "neutral",
            "PublishDate": 1750340411000,
            "Source": "default"
        },
        {
            "Title": "Astec Lifesciences Reports Q4 Financial Results",
            "Summary": "Astec Lifesciences has reported a consolidated net loss of 161 million rupees for the fourth quarter, compared to a loss of 9.7 million rupees in the same quarter last year. This represents a significant increase in losses. The company's revenue for Q4 stood at 1.2 billion rupees, down from 1.54 billion rupees in the previous year, indicating a decline in sales.",
            "Sentiment": "negative",
            "PublishDate": 1745453491000,
            "Source": "default"
        },
        {
            "Title": "Astec Lifesciences Reports Increased Q4 Net Loss",
            "Summary": "Astec Lifesciences reported a consolidated net loss of 161 million rupees in Q4, compared to a loss of 9.7 million rupees in the same quarter last year. The loss has also increased from 404 million rupees in the previous quarter. The company's Q4 revenue decreased to 1.2 billion rupees from 1.54 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1745411635000,
            "Source": "result"
        },
        {
            "Title": "Astec Lifesciences Reports Q3 Loss and Approves Investment in Clean Energy Venture",
            "Summary": "Astec Lifesciences reported a consolidated net loss of 404 million rupees in Q3, compared to a loss of 243 million rupees in the same quarter last year. Revenue increased to 939 million rupees from 508 million rupees year-over-year. The company approved an investment in a special purpose vehicle with Clean Max Enviro Energy, with an equity investment of up to 37.5 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1738023444000,
            "Source": "result"
        },
        {
            "Title": "Astec Lifesciences Approves Investment in Clean Energy Special Purpose Vehicle",
            "Summary": "Astec Lifesciences has approved an equity investment of up to 37.5 million rupees in a special purpose vehicle (SPV) in partnership with Clean Max Enviro Energy. This strategic move suggests the company's interest in expanding into clean energy projects or initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1737984398000,
            "Source": "corporate_action"
        },
        {
            "Title": "Astec Lifesciences Reports Increased Q3 Net Loss and Revenue",
            "Summary": "Astec Lifesciences reported a consolidated net loss of 404 million rupees for the third quarter, compared to a loss of 243 million rupees in the same period last year. The loss also increased from 385 million rupees in the previous quarter. However, the company's revenue showed significant growth, reaching 939 million rupees, up from 508 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1737980763000,
            "Source": "earnings"
        },
        {
            "Title": "Astec LifeSciences Reports Increased Q2 Net Loss",
            "Summary": "Astec LifeSciences reported a consolidated net loss of 385 million rupees in Q2, compared to a loss of 134.3 million rupees in the same quarter last year. This represents a significant increase in losses year-over-year. The company's revenue for Q2 was 985 million rupees, down from 1.11 billion rupees in the previous year, indicating a decline in sales.",
            "Sentiment": "negative",
            "PublishDate": 1729860974000,
            "Source": "result"
        },
        {
            "Title": "Astec Lifesciences Schedules Q2 Results Board Meeting",
            "Summary": "<p>Astec Lifesciences has announced a <span class='neutral'>board meeting</span> scheduled for <b>October 25</b> to <span class='neutral'>consider and approve</span> the company's <span class='neutral'>financial results</span> for the <b>second quarter</b> of the fiscal year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728472880000,
            "Source": "corporate_action"
        }
    ]
}