{
    "Symbol": "ASTRAMICRO",
    "ISIN": "INE386C01029",
    "News": [
        {
            "Title": "Astra Microwave Q3FY26 Results & CFO Change",
            "Summary": "Astra Microwave Products reports Q3FY26 standalone profit of ₹3,887.53 lakhs with revenue of ₹25,823.57 lakhs. Company appoints new CFO Srinivasarao Devathi replacing Rahul Rungta.",
            "Sentiment": "positive",
            "PublishDate": 1770888476163,
            "Source": "co_actions_results"
        },
        {
            "Title": "Astra Microwave Board Meet on Feb 12 for Q3FY26 Results",
            "Summary": "Astra Microwave Products Limited has scheduled its board meeting for February 12, 2026, to consider and approve Q3FY26 standalone and consolidated unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770185532999,
            "Source": "co_actions_results"
        },
        {
            "Title": "Astra Microwave JV wins ₹275 cr Air Force order",
            "Summary": "Astra Microwave Products' joint venture secured a ₹275.27 crore order from Indian Air Force for MiG-29 aircraft integration and LCA Mk-1A procurement, boosting the company's robust ₹1,916 crore order book.",
            "Sentiment": "positive",
            "PublishDate": 1767950806838,
            "Source": "co_actions_results"
        },
        {
            "Title": "Astra Microwave JV Secures ₹275 Crore Order",
            "Summary": "Astra Microwave Products announces that its joint venture has secured a significant order worth ₹275 crores, marking a major business development for the defense electronics company.",
            "Sentiment": "positive",
            "PublishDate": 1767924862005,
            "Source": "co_actions_results"
        },
        {
            "Title": "Astra Rafael Comsys Wins ₹275.27 Cr IAF Order",
            "Summary": "Astra Microwave's JV with Rafael secures ₹275.27 crore order from Indian Air Force for software integration on MiG-29 aircraft and LCA Mk-1A procurement.",
            "Sentiment": "positive",
            "PublishDate": 1767874819118,
            "Source": "co_actions_results"
        },
        {
            "Title": "Astra Micro Sets ₹1400-1500 Cr Revenue Target for FY27",
            "Summary": "Astra Microwave Products announces ambitious revenue projection of ₹1400-1500 crores for FY27, signaling strong growth expectations in the aerospace and defence sector.",
            "Sentiment": "positive",
            "PublishDate": 1767072555717,
            "Source": "stocks"
        },
        {
            "Title": "Astra Microwave Partners with BEL for Defence Tech",
            "Summary": "Astra Microwave Products Ltd executes MoU with Bharat Electronics Limited for collaborative design, development and manufacturing of advanced electronic modules targeting Electronic Warfare, radar systems and satellites.",
            "Sentiment": "positive",
            "PublishDate": 1766729432730,
            "Source": "co_actions_results"
        },
        {
            "Title": "Astra Microwave Secures ₹124 Cr Order from JV Partner",
            "Summary": "Astra Microwave Products receives significant order worth ₹124 crores from joint venture company Astra Rafael Comsys for supply of modules, cable assemblies and antenna for SDR.",
            "Sentiment": "positive",
            "PublishDate": 1765544496011,
            "Source": "co_actions_results"
        },
        {
            "Title": "Astra Microwave Secures ₹1.24 Billion Order",
            "Summary": "Astra Microwave Products Limited has secured a significant order worth ₹1.24 billion, marking a major business development for the aerospace and defence company.",
            "Sentiment": "positive",
            "PublishDate": 1765544293970,
            "Source": "co_actions_results"
        },
        {
            "Title": "Astra Microwave Gets Credit Rating Reaffirmation",
            "Summary": "CRISIL Ratings reaffirmed Astra Microwave Products' credit ratings with CRISIL A/Positive for long-term facilities and CRISIL A1 for short-term facilities on December 12, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765531114941,
            "Source": "stocks"
        },
        {
            "Title": "Astra Microwave Wins ₹171.38 Cr Weather Radar Order",
            "Summary": "Astra Microwave Products secures major order from Indian Meteorological Department for 6 Klystron weather radars worth ₹171.38 crores with 18-month delivery timeline and comprehensive warranty coverage.",
            "Sentiment": "positive",
            "PublishDate": 1765447743842,
            "Source": "co_actions_results"
        },
        {
            "Title": "Astra Microwave Reports Strong Q2 Performance, Announces Ambitious Growth Vision to Double Revenue in 3-4 Years",
            "Summary": "Astra Microwave delivered robust quarterly results with standalone revenue of INR 213 crores and EBITDA margin expansion to 21.7%, backed by a strong order book of INR 1,916 crores as of September 30, 2025. The company outlined an ambitious growth roadmap targeting revenue of INR 1,400-1,500 crores by FY27 and INR 2,250-2,500 crores by FY30, driven by major defense programs including QRSAM, Uttam radars, and Su-30 EW suite upgrades.",
            "Sentiment": "positive",
            "PublishDate": 1763554877980,
            "Source": "earnings"
        },
        {
            "Title": "Astra Microwave Products Renames Wholly Owned Subsidiary to Astra Defence Technologies",
            "Summary": "Astra Microwave Products Limited received approval from the Registrar of Companies to change its wholly owned subsidiary's name from Bhavyabhanu Electronics Private Limited to Astra Defence Technologies Private Limited effective November 18, 2025. The name change reflects a strategic repositioning of the subsidiary's business focus toward defense technologies.",
            "Sentiment": "neutral",
            "PublishDate": 1763447559481,
            "Source": "corporate_action"
        },
        {
            "Title": "Astra Microwave Secures Rs 240 Crore Orders in Q2, Targets Revenue Doubling by FY28",
            "Summary": "Astra Microwave received orders worth Rs 240 crore in Q2 and maintains guidance of 15% revenue growth with 22.3% Ebitda margin for FY26. The company projects doubling revenue by FY28 and tripling by FY30 through execution of QRSAM, Uttam AESA, and Virupaksha AESA projects.",
            "Sentiment": "positive",
            "PublishDate": 1763103638060,
            "Source": "stock"
        },
        {
            "Title": "Astra Microwave Products Reports Monitoring Agency Assessment for Preferential Issue Proceeds",
            "Summary": "Astra Microwave Products Limited submitted a monitoring agency report from CRISIL Ratings for the quarter ended September 30, 2025, regarding utilization of proceeds from its preferential issue of convertible warrants. The company raised Rs 173.99 crore through the preferential issue conducted from June 23-24, 2025, with Rs 43.49 crore received during the quarter ended June 30, 2025, and Rs 130.50 crore yet to be received from warrant holders. The proceeds were allocated for working capital requirements (Rs 130.50 crore) and general corporate purposes (Rs 43.49 crore). During the reported quarter, the company utilized Rs 40 crore for partial repayment of working capital demand loan from HDFC Bank and Rs 3.49 crore for general corporate purposes including vendor payments for workstation purchases, R&D power supply upgrades, oscilloscope upgrades, and electronic components for defense needs. CRISIL reported no deviation from disclosed objects and confirmed utilization was in line with the objectives mentioned in the EGM notice. Warrant holders have the option to convert warrants into equity shares within 18 months from allotment date, which is by December 29, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1763037953182,
            "Source": "corporate_action"
        },
        {
            "Title": "Astra Microwave Products Reports Mixed Q2 Results with EBITDA Growth Despite Profit Decline",
            "Summary": "Astra Microwave Products reported Q2 consolidated net profit of 240 million rupees, down from 254 million rupees in the same period last year. However, the company's Q2 EBITDA increased to 502 million rupees from 492 million rupees year-over-year, with EBITDA margin improving to 23.4% from 21.45%. For the first half of the year, revenue grew 7% compared to the company's full-year growth guidance of 18-20%.",
            "Sentiment": "neutral",
            "PublishDate": 1763021246454,
            "Source": "earnings"
        },
        {
            "Title": "Astra Microwave Products Joint Venture Secures 2.86 Billion Rupees Order",
            "Summary": "Astra Microwave Products announced that its joint venture has received an order worth 2.86 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1762129539594,
            "Source": "order&deals"
        },
        {
            "Title": "Astra Microwave Products Joint Venture Wins 2.86 Billion Rupee Order",
            "Summary": "Astra Microwave Products announced that its joint venture has secured an order valued at 2.86 billion rupees. The company specializes in microwave products and this represents a significant contract win for the joint venture entity.",
            "Sentiment": "positive",
            "PublishDate": 1761914951033,
            "Source": "order&deals"
        },
        {
            "Title": "Astra Microwave Products' Non-Material Subsidiary Astra Private Limited Struck Off by Ministry of Corporate Affairs",
            "Summary": "Astra Private Limited, formerly known as Astra Foundation (Section 8 Company), a non-material subsidiary of Astra Microwave Products Limited, has been struck off by the Ministry of Corporate Affairs. The strike-off was based on an application filed by Astra Private Limited itself, with the information received on September 26, 2025. As a result, Astra Private Limited ceases to exist as a wholly owned subsidiary of Astra Microwave Products Limited. The subsidiary had nil turnover, revenue, income, and net worth for the financial year ended March 31, 2025, contributing negligibly to the consolidated income and net worth of the parent company. Astra Foundation was originally established on July 9, 2016, as a non-profit organization under Section 8 of the Companies Act, 2013, with objectives including providing donations for education, welfare, and medical treatments for the poor and needy.",
            "Sentiment": "neutral",
            "PublishDate": 1758888272072,
            "Source": "corporate_action"
        },
        {
            "Title": "Astra Microwave Products Holds 34th AGM, Declares Rs 2.20 Dividend Per Share",
            "Summary": "Astra Microwave Products Limited conducted its 34th Annual General Meeting on September 17, 2025, via video conferencing with 76 members participating. The company declared a dividend of Rs 2.20 per equity share of face value Rs 2 each for financial year 2024-25. The AGM addressed 11 agenda items including adoption of audited financial statements, director reappointments, and several special resolutions. Key matters discussed included ratification of cost auditors' remuneration, appointment of secretarial auditors, continuation of directorship for Mr. Prakash Anand Chitrakar who will turn 75 in January 2026, increase in borrowing powers, creation of securities, and adoption of new Memorandum and Articles of Association. Management addressed shareholder queries regarding company outlook, order pipeline, borrowing power increases, plant visits, five-year roadmap, business prospects, and AI initiatives. E-voting was conducted from September 13-16, 2025, with results to be announced within 48 hours.",
            "Sentiment": "neutral",
            "PublishDate": 1758114860087,
            "Source": "corporate_action"
        },
        {
            "Title": "Astra Microwave Reports 28% Revenue Growth, Targets INR 1,300-1,400 Crore Order Inflow",
            "Summary": "Astra Microwave Products Limited reported standalone revenue of INR 197 crores for Q1 FY2026, marking a 28.1% year-over-year increase. The defense electronics company maintains a standalone order book of INR 1,891 crores as of June 30, 2025, with its joint venture ARC holding an additional INR 400+ crores in orders. The company received a significant INR 135 crore order from DRDO for ground-based radar system upgradation and secured orders for Active Array Antenna Units for the Virupaksha radar program. Management expects order inflows of INR 1,300-1,400 crores for FY2026 and targets 18-20% revenue growth while aiming to maintain or slightly improve profit margins. The company is expanding capabilities through clean room facilities for satellite assembly in Bangalore and developing indigenous software for weather data interpretation. Key ongoing programs include the Uttam radar for LCA Mk1A aircraft, shipborne radar development, and X-band seeker for missile programs, with several development milestones expected by December 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755668997249,
            "Source": "earnings"
        },
        {
            "Title": "Astra Microwave Plans Investments in Advanced Defense Systems",
            "Summary": "Astra Microwave announced plans to invest in advanced radar, electronic warfare, and communication systems. The company is leveraging Make in India defense initiatives while expanding its global presence to achieve steady growth.",
            "Sentiment": "positive",
            "PublishDate": 1755103994080,
            "Source": "stock"
        },
        {
            "Title": "Astra Microwave Products Reports Q1 2025 Results, Announces Board Changes and AGM Date",
            "Summary": "Astra Microwave Products Limited reported unaudited financial results for Q1 2025 ended June 30, 2025. The company posted standalone revenue from operations of Rs. 19,725.70 lakhs compared to Rs. 15,394.88 lakhs in the same quarter last year, with profit for the period at Rs. 1,299.62 lakhs versus Rs. 522.90 lakhs in Q1 2024. The company maintains an order book of Rs. 1,890.95 crores as of June 30, 2025, with new orders worth Rs. 137.80 crores booked during the quarter. The Board approved appointment of M/s. L.D. Reddy & Co. as Secretarial Auditors for five years from FY 2025-26 to FY 2029-30, subject to shareholder approval. Directors also approved alterations to the Memorandum and Articles of Association, pending shareholder and regulatory approvals. The 34th Annual General Meeting is scheduled for September 17, 2025, via video conferencing. The Board approved continuation of Mr. Prakash Anand Chitrakar as Non-executive Director beyond age 75, subject to shareholder approval. During the quarter, the company received Rs. 43.50 crores as upfront money for convertible warrants approved earlier.",
            "Sentiment": "positive",
            "PublishDate": 1755080395309,
            "Source": "corporate_action"
        },
        {
            "Title": "Astra Microwave Products Reports Strong Q1 Growth with Revenue Up 29% Year-on-Year",
            "Summary": "Astra Microwave Products delivered strong quarterly performance with revenue rising to 2 billion rupees from 1.55 billion rupees year-on-year. The company's EBITDA increased significantly to 410 million rupees compared to 240 million rupees in the same period last year, while EBITDA margin improved to 20.5% from 15.5%. Consolidated net profit more than doubled to 162 million rupees from 72 million rupees year-on-year, reflecting improved operational efficiency and business growth.",
            "Sentiment": "positive",
            "PublishDate": 1755078576474,
            "Source": "earnings"
        },
        {
            "Title": "Astra Microwave Products Appoints Two Independent Directors Through Postal Ballot",
            "Summary": "Astra Microwave Products Limited successfully completed a postal ballot through remote e-voting to appoint two independent directors. The company appointed Mr. Venu Raman Kumar (DIN: 00245022) and Mrs. Anuradha Mookerjee (DIN: 10174271) as independent directors through special resolutions. Both resolutions were passed with requisite majority, with over 99.95% of votes cast in favor of each appointment. The e-voting process ran from July 14, 2025 to August 12, 2025, with L. Dhanamjay Reddy serving as the scrutinizer. For the first resolution, 563 members voted in favor representing 30,341,713 shares, while 21 members voted against with 13,906 shares. For the second resolution, 561 members voted in favor with 30,341,747 shares, and 25 members voted against with 14,057 shares.",
            "Sentiment": "positive",
            "PublishDate": 1755060807878,
            "Source": "corporate_action"
        },
        {
            "Title": "Astra Microwave Secures ₹135 Crore DRDO Contract for Radar System Upgrade",
            "Summary": "Astra Microwave has secured a ₹135 crore order from DRDO for ground-based radar system upgrade. The contract represents a significant business win for the company in the defense sector.",
            "Sentiment": "positive",
            "PublishDate": 1754400709379,
            "Source": "order&deals"
        },
        {
            "Title": "Astra Microwave Expects ₹1800-2000 Crores from QRSAM Project",
            "Summary": "Astra Microwave has announced that it expects to generate revenue between ₹1800-2000 crores from the QRSAM (Quick Reaction Surface-to-Air Missile) project. This information was reported by CNBC TV18. The QRSAM project appears to be a significant business opportunity for the company, potentially contributing substantially to its future earnings.",
            "Sentiment": "positive",
            "PublishDate": 1751948106000,
            "Source": "normal_news"
        },
        {
            "Title": "Astra Microwave Products Ltd: Stellar Growth Raises Valuation Concerns",
            "Summary": "Astra Microwave Products Ltd has seen a 980% return over five years and 38% growth in 2025. The company reported record revenue of Rs 1,044 crore, up 15.5% YoY, with net profit up 27% to Rs 143 crore. Despite strong performance, analysts see limited near-term upside with an average price target implying 8.9% potential growth.",
            "Sentiment": "neutral",
            "PublishDate": 1750817490000,
            "Source": "earnings"
        },
        {
            "Title": "Astra Microwave Gets Initial Approvals for Convertible Warrants Issue",
            "Summary": "Astra Microwave has received initial approvals from the Bombay Stock Exchange (BSE) and National Stock Exchange (NSE) to issue 20.13 lakh convertible warrants. The warrants are priced at ₹864 each and will be issued on a preferential basis.",
            "Sentiment": "positive",
            "PublishDate": 1750299219000,
            "Source": "default"
        },
        {
            "Title": "Astra Microwave Products Reports Q4 and FY25 Financial Results",
            "Summary": "Astra Microwave Products announced its financial results for Q4 and FY25. In Q4, the company reported revenue of 4.1 billion rupees, up from 3.54 billion rupees year-over-year. Q4 EBITDA increased to 1.2 billion rupees from 807 million rupees, with EBITDA margin improving to 29.31% from 22.8%. Q4 consolidated net profit rose to 735 million rupees from 544 million rupees. For FY25, the company's revenue was 10.5 billion rupees, falling short of its guidance of 12 billion rupees. The company also declared a dividend of 2.20 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747905451000,
            "Source": "default"
        },
        {
            "Title": "Astra Microwave Products Ltd: Radhakishan Damani Joins Rs 174-Crore Fundraise",
            "Summary": "Astra Microwave Products Ltd approved allotment of 20.14 lakh convertible warrants at Rs 864 per share, raising Rs 174 crore. Radhakishan Damani and other key investors, including Gopikishan Damani, Atim Kabra, and Ratnabali Equity, participated in the fundraise. The company projects 15-20% revenue growth for fiscal 2026 with an order book of Rs 2,332 crore as of December 2024.",
            "Sentiment": "positive",
            "PublishDate": 1747801045000,
            "Source": "corporate_action"
        },
        {
            "Title": "Astra Microwave Products to Issue Convertible Warrants",
            "Summary": "Astra Microwave Products has announced plans to issue convertible warrants worth 1.74 billion rupees. No further details about the terms, purpose, or timeline of the warrant issuance were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1747741600000,
            "Source": "default"
        },
        {
            "Title": "Astra Microwave: Radar Maker's Orderbook Doubles, Expects Strong Growth",
            "Summary": "Astra Microwave reported an orderbook of ₹1,960 crore, more than twice its FY24 revenue. The company expects additional orders worth ₹350 crore in Q4 FY25. Management is confident of achieving ₹1,100 crore revenue for the current fiscal year and projects new orders of ₹1,300-1,500 crore in FY26. The company's EBITDA margin has improved significantly, reaching 29.1% in Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739007953000,
            "Source": "earnings"
        },
        {
            "Title": "Astra Microwave Products Reports Improved Q3 EBITDA and Margin",
            "Summary": "Astra Microwave Products has announced its Q3 financial results. The company's EBITDA increased to 762 million rupees, up from 661 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 29.47% from 28.63% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738932488000,
            "Source": "earnings"
        },
        {
            "Title": "Astra Microwave Products Reports Q3 Financial Results",
            "Summary": "Astra Microwave Products announced its Q3 consolidated financial results. The company reported a net profit of 474 million rupees, up from 434 million rupees in the same quarter last year. Revenue increased to 2.6 billion rupees from 2.3 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738932482000,
            "Source": "earnings"
        },
        {
            "Title": "Astra Microwave Products: Sees Significant Opportunities in Satellites Segment",
            "Summary": "Astra Microwave Products identifies substantial growth potential in the satellites segment, indicating a strategic focus on this area of their business.",
            "Sentiment": "positive",
            "PublishDate": 1734337112000,
            "Source": "normal_news"
        },
        {
            "Title": "Astra Microwave Products Secures Order for Software Defined Radios for SU-30 MKI Fighter Aircraft",
            "Summary": "Astra Microwave Products has received an order to supply 93 additional sets of Software Defined Radios (SDR) LRUs along with kits, SBC 2 cards, and Network Centric Operations Application. These components are intended for use in the SU-30 MKI fighter aircraft.",
            "Sentiment": "positive",
            "PublishDate": 1734075832000,
            "Source": "order&deals"
        },
        {
            "Title": "Astra Microwave Products Secures 2.6 Billion Rupee Order",
            "Summary": "Astra Microwave Products has won a significant order worth 2.6 billion rupees (approximately $31.5 million USD). This substantial contract is likely to boost the company's revenue and potentially its market position in the microwave products industry.",
            "Sentiment": "positive",
            "PublishDate": 1734075765000,
            "Source": "order&deals"
        },
        {
            "Title": "Astra Microwave Products Projects Rs 24,000-25,000 Crore Market Opportunity",
            "Summary": "Astra Microwave Products has estimated a total addressable market of Rs 24,000-25,000 crore across various sectors until FY28. The company sees key opportunities in radar programs, turnkey projects, special projects, and exports.",
            "Sentiment": "positive",
            "PublishDate": 1731468372000,
            "Source": "corporate_action"
        },
        {
            "Title": "Astra Microwave Products Aims for 70-30 Domestic-Export Revenue Split",
            "Summary": "Astra Microwave Products has announced its goal to achieve a revenue distribution of 70% domestic and 30% export over the next 2-3 years. The company also revealed that its domestic business typically generates a gross margin of 40-45%, significantly higher than the 8-10% gross margin from exports.",
            "Sentiment": "positive",
            "PublishDate": 1731468364000,
            "Source": "corporate_action"
        },
        {
            "Title": "Astra Microwave Products Forms Joint Venture for NavIC Chip Manufacturing",
            "Summary": "Astra Microwave Products has signed a joint venture agreement with Manjeera Digital Systems to manufacture NavIC chips and GNSS products. This partnership aims to produce navigation technology components, potentially strengthening Astra Microwave's position in the aerospace and defense electronics sector.",
            "Sentiment": "positive",
            "PublishDate": 1730885363000,
            "Source": "corporate_action"
        }
    ]
}