{
    "Symbol": "ASTRON",
    "ISIN": "INE646X01014",
    "News": [
        {
            "Title": "Astron Paper Board Meeting Set for Feb 13, 2026",
            "Summary": "Astron Paper & Board Mill Limited schedules board meeting on February 13, 2026 to consider Q3FY26 financial results and convene EGM for director appointment ratification and auditor appointment matters.",
            "Sentiment": "neutral",
            "PublishDate": 1770370626656,
            "Source": "co_actions_results"
        },
        {
            "Title": "Astron Paper Subsidiary Auditor Resigns Citing Compliance Issues",
            "Summary": "SNDK & Associates LLP resigned as statutory auditors of Balaram Papers Private Limited, Astron Paper's subsidiary, effective December 31, 2025, citing inadequate document provision by management.",
            "Sentiment": "negative",
            "PublishDate": 1769178664386,
            "Source": "stocks"
        },
        {
            "Title": "Astron Paper Gets Clean Chit from ICICI Bank",
            "Summary": "Astron Paper & Board Mill Limited receives confirmation from ICICI Bank that its account will not be classified as fraud, following the bank's review of company submissions.",
            "Sentiment": "positive",
            "PublishDate": 1769071369189,
            "Source": "stocks"
        },
        {
            "Title": "Astron Paper Subsidiary Clears Bank Dues, Regains Assets",
            "Summary": "Balaram Paper Private Limited, wholly-owned subsidiary of Astron Paper & Board Mill, has successfully repaid all outstanding dues to Canara Bank and regained possession of secured immovable property and assets in Gujarat.",
            "Sentiment": "positive",
            "PublishDate": 1769071086422,
            "Source": "stocks"
        },
        {
            "Title": "Astron Paper Appoints New Auditor & Director",
            "Summary": "Astron Paper & Board Mill's board approves appointment of HK Shah & Co. as statutory auditor and Jankiben Patel as independent director, subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1766479692536,
            "Source": "stocks"
        },
        {
            "Title": "Astron Paper Board Mill's Statutory Auditors SNDK Associates Resign Citing Regulatory Pressures and Documentation Issues",
            "Summary": "SNDK Associates LLP resigned as statutory auditors of Astron Paper Board Mill Limited effective November 14, 2025, citing increased regulatory obligations, time constraints, and inadequate provision of audit evidence by management. The auditors completed their limited review of quarterly and half-year results for the period ended September 30, 2025, while the company initiates steps to fill the casual vacancy in accordance with the Companies Act, 2013.",
            "Sentiment": "negative",
            "PublishDate": 1763639092974,
            "Source": "corporate_governance"
        },
        {
            "Title": "Astron Paper Board Mill Reports Quarterly Loss Amid Insolvency Proceedings and Plant Shutdown",
            "Summary": "Astron Paper Board Mill Limited reported a net loss of Rs. 475.43 lakhs for the quarter ended September 30, 2025, with zero revenue from operations as its plants remain shut down since September 2024. The company is undergoing insolvency proceedings under IBC 2016 and SARFAESI Act enforcement, with secured lenders taking symbolic possession of key assets and majority independent directors having resigned.",
            "Sentiment": "negative",
            "PublishDate": 1763371883580,
            "Source": "earnings"
        },
        {
            "Title": "Astron Paper & Board Mill Receives Possession Notice from Union Bank for Multiple Properties",
            "Summary": "Astron Paper & Board Mill Limited received a possession notice dated 17.10.2025 from Union Bank of India under the Securitisation and Reconstruction of Financial Assets and Enforcement Security Interest Act, 2002. The bank is taking possession of nine properties including factory lands, office spaces, and plots across Gujarat totaling approximately 178,000 square meters. The assets include lands in Sukhpar village, Halvad and Bhuj talukas, and offices in Ahmedabad's Ganesh Meridian complex. The company stated it is evaluating the implications and will take appropriate legal steps.",
            "Sentiment": "negative",
            "PublishDate": 1761634596509,
            "Source": "stock"
        },
        {
            "Title": "Astron Paper's Subsidiary Receives Asset Possession Notice from Canara Bank Under SARFAESI Act",
            "Summary": "Balaram Papers Private Limited, a wholly-owned subsidiary of Astron Paper & Board Mill Limited, received a possession notice dated October 11, 2025, from Canara Bank under the SARFAESI Act. The notice covers hypothecated plant and machinery along with industrial land located at Revenue Survey No. 258 in Mehsana district, Gujarat, spanning approximately 10,217 square meters. Astron Paper & Board Mill Limited is evaluating the implications of this action and will take appropriate steps based on legal advice.",
            "Sentiment": "negative",
            "PublishDate": 1760522845873,
            "Source": "stock"
        },
        {
            "Title": "Astron Paper & Board Mill Receives Possession Notice from Banking Consortium for Multiple Properties",
            "Summary": "Astron Paper & Board Mill Ltd received a possession notice dated September 23, 2025, from Union Bank of India and member banks including Axis Bank, ICICI Bank, Bank of Maharashtra, and State Bank of Mauritius under the Securitisation and Reconstruction of Financial Assets and Enforcement Security Interest Act. The notice covers six properties totaling approximately 160,015 square meters in Village Sukhpar, Taluka Halvad, District Surendranagar, including multiple land plots and factory properties. The company stated it is evaluating the implications and will take appropriate steps based on legal advice.",
            "Sentiment": "negative",
            "PublishDate": 1758715089343,
            "Source": "stock"
        },
        {
            "Title": "Astron Paper Reports Q1 FY2026 Loss of Rs 495.61 Lakhs Amid Plant Shutdowns and Director Changes",
            "Summary": "Astron Paper & Board Mill Ltd. reported a net loss of Rs 495.61 lakhs for Q1 FY2026 (ended June 30, 2025), compared to Rs 889.63 lakhs loss in the same quarter last year. Revenue from operations was Rs 127.88 lakhs versus Rs 5,814.67 lakhs in Q1 FY2025. The company's Halved plant has been shut since September 8, 2024, and the Bhuj plant remains non-operational. All bank loan accounts totaling Rs 81.85 crores have been declared NPAs. The board re-designated Mr. Karshanbhai Hirabhai Patel from Executive Director to Non-Executive Director, reconstituted board committees, and scheduled the AGM for September 30, 2025. The auditors issued a disclaimer opinion citing going concern issues, plant shutdowns, and various accounting concerns.",
            "Sentiment": "negative",
            "PublishDate": 1755092798744,
            "Source": "earnings"
        }
    ]
}