{
    "Symbol": "ASTRAL",
    "ISIN": "INE006I01046",
    "News": [
        {
            "Title": "Astral Limited Q3FY26 Results Show Mixed Performance",
            "Summary": "Astral Limited reported Q3FY26 standalone revenue of ₹13,816 million with net profit of ₹1,268 million. Consolidated revenue reached ₹15,415 million despite facing exceptional items of ₹165 million.",
            "Sentiment": "neutral",
            "PublishDate": 1770288680798,
            "Source": "co_actions_results"
        },
        {
            "Title": "Astral Limited Board Meeting Set for Feb 5, 2026",
            "Summary": "Astral Limited announces board meeting on February 5, 2026, to approve Q3 FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769605088650,
            "Source": "co_actions_results"
        },
        {
            "Title": "Astral Co-Promoter Group Buys 36,000 Shares",
            "Summary": "Astral's co-promoter group acquired 36,000 shares through open market transactions on December 30, demonstrating continued confidence in the plastic products company.",
            "Sentiment": "positive",
            "PublishDate": 1767252554803,
            "Source": "co_actions_results"
        },
        {
            "Title": "Astral Limited Allots 15,436 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Astral Limited allotted 15,436 equity shares of Rs. 1 each on November 5, 2025, following the exercise of stock options by eligible employees under the Astral Limited Employee Stock Option Scheme 2015. The newly allotted shares will have equal rights with existing equity shares. Following this allotment, the company's issued, subscribed and paid-up share capital increased from Rs. 26,86,34,727 to Rs. 26,86,50,163.",
            "Sentiment": "neutral",
            "PublishDate": 1762375618706,
            "Source": "corporate_action"
        },
        {
            "Title": "Astral Limited Completes 80% Acquisition of Nexelon Chem Private Limited",
            "Summary": "Astral Limited has completed the acquisition of 80% equity shares in Nexelon Chem Private Limited on November 5, 2025. The company entered into a Share Purchase Agreement with existing promoters and shareholders of Nexelon. Following this acquisition, Nexelon has become a subsidiary of Astral Limited. The acquisition was previously announced on August 11, 2025, and the company has now informed stock exchanges BSE and NSE about the completion of the transaction.",
            "Sentiment": "positive",
            "PublishDate": 1762367374363,
            "Source": "order&deals"
        },
        {
            "Title": "Astral Limited Reports Strong Q2 Performance with Rs. 1.50 Interim Dividend Declaration",
            "Summary": "Astral Limited's Board approved unaudited financial results for the quarter and half-year ended September 30, 2025. The company declared an interim dividend of Rs. 1.50 per share (face value Re. 1) for FY 2025-26, with record date set as November 11, 2025. On a standalone basis, the company reported net profit of Rs. 969 million for Q2 and Rs. 2,468 million for H1. Revenue from operations reached Rs. 14,161 million in Q2. On consolidated basis, revenue was Rs. 15,774 million for Q2 and Rs. 29,386 million for H1, with net profit of Rs. 1,348 million and Rs. 2,159 million respectively. The company completed acquisition of Al-Aziz Plastics Private Limited for Rs. 330 million effective April 1, 2025. Astral also acquired remaining stakes in subsidiaries - 5% in Seal IT Services Limited, UK for GBP 0.40 million and 20% in Astral Coatings Private Limited for Rs. 750 million, making both wholly-owned subsidiaries.",
            "Sentiment": "positive",
            "PublishDate": 1762353243745,
            "Source": "earnings"
        },
        {
            "Title": "Astral Reports Strong Q2 Performance with 14% Growth in Net Profit",
            "Summary": "Astral delivered robust quarterly results with consolidated net profit rising to 1.35 billion rupees from 1.18 billion rupees year-over-year. Revenue increased to 15.77 billion rupees compared to 13.7 billion rupees in the same period last year. EBITDA grew to 2.57 billion rupees from 2.1 billion rupees, while EBITDA margin improved to 16.28% from 15.33% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762341240266,
            "Source": "earnings"
        },
        {
            "Title": "Astral Begins Commercial Production at New Kanpur Manufacturing Plant",
            "Summary": "Astral has commenced commercial production at its new manufacturing plant in Kanpur from October 6, 2025. This development is part of the company's strategy to strengthen its manufacturing footprint and expand production capacity.",
            "Sentiment": "positive",
            "PublishDate": 1759747764785,
            "Source": "stock"
        },
        {
            "Title": "Astral Acquires Remaining 20% Stake in Astral Coatings for Rs. 75 Crore",
            "Summary": "Astral has acquired the remaining 20% stake in Astral Coatings for Rs. 75 crore, making it a 100% wholly-owned subsidiary. This acquisition gives Astral complete ownership and control of the coatings business.",
            "Sentiment": "positive",
            "PublishDate": 1757508997194,
            "Source": "order&deals"
        },
        {
            "Title": "Astral Limited Acquires Remaining 5% Stake in UK Subsidiary Seal IT Services for GBP 400,000",
            "Summary": "Astral Limited's Board of Directors approved the acquisition of the remaining 5% equity shares in its UK subsidiary Seal IT Services Limited for GBP 400,000 (approximately Rs. 4.75 crores). This acquisition increases Astral's ownership from 95% to 100%, making Seal IT a wholly owned subsidiary. Seal IT Services, incorporated in July 2002, operates in the manufacturing of adhesives and sealants with consolidated turnover of GBP 33.44 million in FY 2025, GBP 35.92 million in FY 2024, and GBP 35.75 million in FY 2023. The transaction is being conducted on an arm's length basis and is expected to be completed by September 30, 2025. Astral expects the acquisition to result in operational efficiency and faster decision-making processes.",
            "Sentiment": "positive",
            "PublishDate": 1756993285514,
            "Source": "corporate_action"
        },
        {
            "Title": "DGTR Recommends 5-Year Anti-Dumping Duty on PVC Resin Imports",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has recommended imposing anti-dumping duties on imports of PVC resin for a period of 5 years. This recommendation relates to Astral, which operates in the PVC and pipe manufacturing sector.",
            "Sentiment": "neutral",
            "PublishDate": 1755847555302,
            "Source": "stock"
        },
        {
            "Title": "Astral Shares Plunge 9% Following Weak Quarterly Results",
            "Summary": "Astral shares fell 9% on Tuesday following disappointing quarterly results. The company's net profit declined 33% to ₹79 crore, while EBITDA margins dropped 200 basis points to 13.6%. The core plumbing business, which contributes 70% of revenue, saw a 6% revenue decline despite resilient volumes. PVC price volatility led to inventory losses and weaker realizations, with prices declining 14% year-on-year. The polymer industry experienced weak demand during the quarter, though management indicated demand improvement starting July. This marked the stock's biggest single-day fall in three-and-a-half years, bringing year-to-date losses to 23%.",
            "Sentiment": "negative",
            "PublishDate": 1754992260727,
            "Source": "stock"
        },
        {
            "Title": "Astral Limited Acquires 80% Stake in Chemical Manufacturer NEXELON for Rs. 120 Crores",
            "Summary": "Astral Limited's Board of Directors approved the acquisition of an 80% equity stake in NEXELON CHEM PRIVATE LIMITED, a chemical manufacturing company incorporated in July 2023. The acquisition involves a cash consideration of Rs. 80,000 at par value, with total investment planned up to Rs. 120 crores over time. NEXELON operates in chemicals and chemical products manufacturing, specifically focusing on CPVC resin production, which serves as a main raw material for Astral. The company expects this vertical integration to optimize costs and improve margins substantially. The transaction is expected to complete within 2-3 months, with the capital structure to be finalized in the next 60 days. NEXELON is currently setting up its manufacturing unit and has not yet commenced revenue generation.",
            "Sentiment": "positive",
            "PublishDate": 1754911758989,
            "Source": "order&deals"
        },
        {
            "Title": "Astral Reports Decline in Q1 Profitability and Margins",
            "Summary": "Astral reported Q1 consolidated net profit of 811 million rupees, down from 1.2 billion rupees in the same period last year. The company's EBITDA fell to 1.85 billion rupees from 2.14 billion rupees year-over-year, while EBITDA margin compressed to 13.58% from 15.5%. Revenue declined slightly to 13.6 billion rupees compared to 13.84 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754909038736,
            "Source": "earnings"
        },
        {
            "Title": "Astral Limited Approves Unaudited Financial Results for First Quarter Ended June 30, 2025",
            "Summary": "Astral Limited's Board of Directors approved the unaudited standalone and consolidated financial results for the first quarter ended June 30, 2025, during a board meeting held on August 11, 2025. The board meeting commenced at 2:30 p.m. and concluded at 3:40 p.m. The company has informed BSE Limited and National Stock Exchange of India Limited about the outcome of the board meeting through a formal communication signed by Company Secretary Chintankumar Patel.",
            "Sentiment": "neutral",
            "PublishDate": 1754908897921,
            "Source": "earnings"
        },
        {
            "Title": "Astral Limited Sets August 14, 2025 Record Date for Rs. 2.25 Final Dividend",
            "Summary": "Astral Limited has fixed August 14, 2025 as the record date for determining shareholder eligibility for a final dividend of Rs. 2.25 per equity share for financial year 2024-25. The dividend represents 225% on shares with face value of Rs. 1 each. The dividend is subject to shareholder approval at the Annual General Meeting and will be paid on or after August 30, 2025, with applicable tax deductions at source.",
            "Sentiment": "positive",
            "PublishDate": 1754124554873,
            "Source": "corporate_action"
        },
        {
            "Title": "Astral Reports Q4 Results and Recommends Final Dividend",
            "Summary": "Astral has announced its Q4 results and dividend recommendation. The company's Q4 revenue increased to 16.8 billion rupees from 16.25 billion rupees year-over-year. Q4 EBITDA rose to 3.02 billion rupees from 2.92 billion rupees, with the EBITDA margin slightly improving to 17.96% from 17.94%. Additionally, Astral has recommended a final dividend of 2.25 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747827818000,
            "Source": "result"
        },
        {
            "Title": "Astral Reports Q4 Net Profit of 1.8B Rupees",
            "Summary": "Astral has announced its quarterly financial results. The company reported a consolidated net profit of 1.8 billion rupees for the latest quarter. This represents a slight year-over-year decrease from 1.82 billion rupees in the same quarter of the previous year. However, it shows a significant quarter-over-quarter increase from 1.14 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1747827794000,
            "Source": "result"
        },
        {
            "Title": "Astral Ltd: Q4 Profit Dips But Beats Estimates, Declares Dividend",
            "Summary": "Astral Ltd reported a 1.3% decline in Q4 FY25 net profit to Rs 179 crore, beating analyst estimates. Revenue rose 3.5% to Rs 1,681 crore. The company declared a final dividend of Rs 2.25 per share, with a total payout of up to Rs 60 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747827191000,
            "Source": "earnings"
        },
        {
            "Title": "PVC Resin Prices Increase in Market",
            "Summary": "Astral has reported that PVC resin prices have increased in the market. No specific details about the magnitude of the price hike or its impact on Astral's operations were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1747815673000,
            "Source": "default"
        },
        {
            "Title": "Astral to Consider Q4 Results on May 21",
            "Summary": "Astral Limited has announced that it will consider its fourth quarter (Q4) financial results on May 21. This is a standard corporate procedure where the company's board will review and potentially approve the financial statements for the last quarter of their fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1747140313000,
            "Source": "default"
        },
        {
            "Title": "Astral Limited Approves Acquisition of Al-Aziz Plastics",
            "Summary": "Astral Limited has approved the acquisition of Al-Aziz Plastics. The acquisition is valued at 330 million Indian Rupees.",
            "Sentiment": "positive",
            "PublishDate": 1744894172000,
            "Source": "default"
        },
        {
            "Title": "Astral Receives BIS Certification for OPVC Pipes",
            "Summary": "Astral has been granted a certificate from the Bureau of Indian Standards (BIS) for their Oriented Polyvinyl Chloride (OPVC) pipes used in water supply. The certification is in accordance with the Indian Standard IS 16647:2017.",
            "Sentiment": "positive",
            "PublishDate": 1743681481000,
            "Source": "corporate_action"
        },
        {
            "Title": "Astral Ltd: Q3 Profit Flat, EBITDA Grows 7%",
            "Summary": "Astral Ltd reported Q3 FY25 results with net profit up 0.4% to ₹114 crore. Revenue grew 2% to ₹1,397 crore. EBITDA increased 7% to ₹219.5 crore, with margin improving to 15.7% from 15%.",
            "Sentiment": "neutral",
            "PublishDate": 1738237336000,
            "Source": "earnings"
        },
        {
            "Title": "Astral's Ghiloth Plant Begins Dispatching SWR Fittings",
            "Summary": "Astral Limited has announced that its Ghiloth plant has commenced dispatching SWR (Drain Master) fittings. This development indicates an expansion or enhancement of the company's production capabilities for plumbing and drainage solutions.",
            "Sentiment": "positive",
            "PublishDate": 1737378725000,
            "Source": "corporate_action"
        },
        {
            "Title": "Astral Ltd: Q2 Profit Drops 17.5%, Declares Interim Dividend",
            "Summary": "Astral Ltd reported a 17.5% decline in Q2 FY25 net profit to ₹108.7 crore. Revenue remained flat at ₹1,370 crore, up 0.5% YoY. EBITDA fell 4.5% to ₹210.2 crore with margins contracting to 15.3%. The company announced an interim dividend of ₹1.50 per share.",
            "Sentiment": "negative",
            "PublishDate": 1730984062000,
            "Source": "result"
        }
    ]
}