{
    "Symbol": "ASTRAZEN",
    "ISIN": "INE203A01020",
    "News": [
        {
            "Title": "AstraZeneca Gets CDSCO Nod for Imfinzi Cancer Drug",
            "Summary": "AstraZeneca Pharma India receives regulatory approval to import and distribute Durvalumab Solution (Imfinzi) for treating advanced endometrial cancer in combination therapy.",
            "Sentiment": "positive",
            "PublishDate": 1770718776509,
            "Source": "stocks"
        },
        {
            "Title": "AstraZeneca Gets CDSCO Nod for Durvalumab Cancer Drug",
            "Summary": "AstraZeneca Pharma India receives regulatory approval for additional indication of Durvalumab (Imfinzi) to treat gastric and gastroesophageal junction adenocarcinoma in adult patients.",
            "Sentiment": "positive",
            "PublishDate": 1769866787727,
            "Source": "stocks"
        },
        {
            "Title": "AstraZeneca Pharma Director Resigns Effective Feb 2026",
            "Summary": "Ms. Sylvia Lorena Varela Ramon, Non-Executive Director at AstraZeneca Pharma India Limited, has submitted her resignation effective February 28, 2026, to pursue career opportunities outside the organization.",
            "Sentiment": "neutral",
            "PublishDate": 1769687934636,
            "Source": "stocks"
        },
        {
            "Title": "AstraZeneca Pharma Receives IT Assessment Order",
            "Summary": "AstraZeneca Pharma India receives final income tax assessment order for AY 2022-23 with ₹11.88 crore claim on transfer pricing issues. Company plans ITAT appeal.",
            "Sentiment": "negative",
            "PublishDate": 1768571081566,
            "Source": "stocks"
        },
        {
            "Title": "AstraZeneca Pharma India Appoints New Director",
            "Summary": "AstraZeneca Pharma India has appointed Aditi Dayarus Mehta as Director, bringing over 10 years of pharmaceutical industry experience from her tenure at Pfizer India to strengthen the company's leadership team.",
            "Sentiment": "positive",
            "PublishDate": 1767942919651,
            "Source": "stocks"
        },
        {
            "Title": "AstraZeneca Pharma India Appoints Two Senior Directors",
            "Summary": "AstraZeneca Pharma India Limited announces the appointment of Ms. Aditi Dayarus Mehta as Director – Oncology Business Unit and Mr. Nitin Bindal as Director - Institutional Business & Public Channels, effective January 12, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767941402377,
            "Source": "stocks"
        },
        {
            "Title": "AstraZeneca Gets CDSCO Approval for Cancer Drug Import",
            "Summary": "AstraZeneca Pharma India receives regulatory approval from CDSCO to import and distribute Datopotamab Deruxtecan for treating HR-positive, HER2-negative breast cancer patients.",
            "Sentiment": "positive",
            "PublishDate": 1765985866115,
            "Source": "stocks"
        },
        {
            "Title": "AstraZeneca Pharma India Receives Favorable Tax Order Worth Rs. 3.30 Crore",
            "Summary": "AstraZeneca Pharma India Limited received an order from the Commissioner of Income-tax (Appeals) for assessment year 2020-21, directing the deletion of an erroneous addition of Rs. 13.11 crore made by the Centralised Processing Centre. The company expects a favorable tax impact of approximately Rs. 3.30 crore from this order, which came after the company appealed against the original intimation under section 143(1) of the Income Tax Act.",
            "Sentiment": "positive",
            "PublishDate": 1764254657773,
            "Source": "stock"
        },
        {
            "Title": "AstraZeneca Pharma India's Director of Corporate Affairs Dr. Ajay Sharma to Leave Company",
            "Summary": "Dr. Ajay Sharma, Director of Corporate Affairs at AstraZeneca Pharma India, has decided to pursue his career outside the organization. The departure represents a leadership change in the company's corporate affairs function.",
            "Sentiment": "neutral",
            "PublishDate": 1763507258449,
            "Source": "corporate_governance"
        },
        {
            "Title": "AstraZeneca Pharma India Partners with Sun Pharma for Hyperkalaemia Treatment Marketing",
            "Summary": "AstraZeneca Pharma India and Sun Pharma have formed a partnership to treat hyperkalaemia, with AstraZeneca marketing SZC as Lokelma and Sun Pharma marketing it as Gimliand. AstraZeneca will receive 260 million rupees from Sun Pharma as part of this collaboration.",
            "Sentiment": "positive",
            "PublishDate": 1763422856381,
            "Source": "stock"
        },
        {
            "Title": "AstraZeneca Pharma India Company Secretary Resigns; Reports Strong Quarterly Results",
            "Summary": "AstraZeneca Pharma India announced that Company Secretary Manasa R has resigned to pursue career opportunities outside the organization, with her last working day being November 28, 2025. The company is searching for a suitable replacement. Additionally, AstraZeneca reported quarterly results showing total income from operations of Rs 5,652.6 million, net profit after tax of Rs 542.2 million, and earnings per share of Rs 21.69. The company has ceased operations at its manufacturing site and is in the process of selling assets related to the manufacturing facility, which have been classified as assets held for sale.",
            "Sentiment": "neutral",
            "PublishDate": 1762800733812,
            "Source": "corporate_governance"
        },
        {
            "Title": "AstraZeneca Pharma Reports 41% Jump in Q2 Net Profit to 542 Million Rupees",
            "Summary": "AstraZeneca Pharma delivered strong quarterly results with net profit rising to 542 million rupees from 384 million rupees year-over-year. Revenue grew significantly to 5.6 billion rupees compared to 4.08 billion rupees in the same period last year. EBITDA increased to 752 million rupees from 524 million rupees, while EBITDA margin improved to 13.45% from 12.84% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762518456522,
            "Source": "earnings"
        },
        {
            "Title": "AstraZeneca Pharma India to Launch Lokelma for Hyperkalaemia Treatment in November 2025",
            "Summary": "AstraZeneca Pharma India Limited announced the launch of Sodium Zirconium Cyclosilicate powder (Lokelma) for oral suspension in November 2025. The company received Import and Marketing Permission from the Drugs Controller General of India in March 2025. The 5g oral suspension product is indicated for treating hyperkalaemia in adult patients. The company had previously obtained regulatory approval for both 5g and 10g formulations but is launching the 5g version first.",
            "Sentiment": "positive",
            "PublishDate": 1760519447421,
            "Source": "stock"
        },
        {
            "Title": "AstraZeneca Secures Three-Year Tariff Exemption in Exchange for Medicaid Discounts",
            "Summary": "The Trump Administration has reached a drug pricing agreement with AstraZeneca. Under the deal, AstraZeneca will receive a three-year tariff exemption in exchange for providing discounts on Medicaid prescriptions.",
            "Sentiment": "positive",
            "PublishDate": 1760314578541,
            "Source": "stock"
        },
        {
            "Title": "AstraZeneca Announces Drug Pricing Agreement with Trump Administration",
            "Summary": "AstraZeneca's CEO announced plans to provide select drugs at up to 80% discount through the TrumpRx website next year. The Trump Administration has reached a drug pricing agreement with AstraZeneca that includes a three-year tariff exemption for Medicaid discounts.",
            "Sentiment": "positive",
            "PublishDate": 1760171426576,
            "Source": "global"
        },
        {
            "Title": "AstraZeneca Pharma Gets CDSCO Approval for Enhertu in Additional Cancer Indication",
            "Summary": "AstraZeneca Pharma has received approval from the Central Drugs Standard Control Organisation (CDSCO) to import and market Enhertu for an additional HER2-positive solid tumor indication. This regulatory approval expands the therapeutic use of the cancer treatment drug Enhertu beyond its existing approved indications.",
            "Sentiment": "positive",
            "PublishDate": 1759709589463,
            "Source": "stock"
        },
        {
            "Title": "AstraZeneca Pharma India Gets Approval for Additional Cancer Drug Indication",
            "Summary": "AstraZeneca Pharma India Limited received permission from the Central Drugs Standard Control Organisation to import and distribute Trastuzumab Deruxtecan (brand name: Enhertu) for an additional indication. The drug is now approved for treating adult patients with unresectable or metastatic HER2-positive solid tumors who have received prior systemic treatment and have no satisfactory alternative treatment options. The approval allows marketing of the 100mg/5mL vial formulation in India for this specific indication, subject to receipt of related statutory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1759504116828,
            "Source": "stock"
        },
        {
            "Title": "AstraZeneca Pharma India Receives Show Cause Notice for Alleged Overcharging of Symbicort Turbuhaler",
            "Summary": "AstraZeneca Pharma India Limited received a Show Cause Notice from the National Pharmaceutical Pricing Authority on September 11, 2025. The NPPA alleges the company overcharged for batches of 'Symbicort Turbuhaler' Inhalation Powder by marketing them above the notified ceiling price from April 2016 to July 2025. The quantum of claim is Rs. 60,49,79,385 plus interest, which the company disputes. AstraZeneca has been given 30 days to respond to these allegations. The company states that the expected overall financial implication cannot be determined at this stage.",
            "Sentiment": "negative",
            "PublishDate": 1757668894731,
            "Source": "stock"
        },
        {
            "Title": "AstraZeneca Pharma India Surrenders Manufacturing License as Part of Site Exit",
            "Summary": "AstraZeneca Pharma India has surrendered its manufacturing license, which was valid until December 2027, as part of its site exit strategy. The pharmaceutical company is discontinuing its manufacturing operations in India by voluntarily giving up the license ahead of its expiration date.",
            "Sentiment": "negative",
            "PublishDate": 1756815001912,
            "Source": "stock"
        },
        {
            "Title": "AstraZeneca Pharma India Reports Strong Q1 Results with 35.8% Revenue Growth Despite Manufacturing Site Closure",
            "Summary": "AstraZeneca Pharma India Limited reported total income from operations of Rs. 5,375.5 million for the quarter ended June 30, 2025, representing a 35.8% increase from Rs. 3,958.7 million in the same quarter last year. The company turned profitable with a net profit after tax of Rs. 558.3 million compared to a loss of Rs. 117.9 million in the previous year. Earnings per share improved significantly to Rs. 22.33 from a loss per share of Rs. 4.72. During the quarter, the company ceased operations at its manufacturing site and commenced plant decommissioning, with related plant and machinery now fully depreciated. The financial results were approved by the Board of Directors and reviewed by statutory auditors.",
            "Sentiment": "positive",
            "PublishDate": 1755610093844,
            "Source": "earnings"
        },
        {
            "Title": "AstraZeneca Pharma Reports Strong Q1 Performance with Revenue Growth and Return to Profitability",
            "Summary": "AstraZeneca Pharma delivered robust Q1 results with revenue rising to 5.3 billion rupees from 3.9 billion rupees in the same quarter last year. The company returned to profitability with a net profit of 558 million rupees, compared to a loss of 118 million rupees in the previous year's quarter. EBITDA more than doubled to 811 million rupees from 380 million rupees, while EBITDA margin expanded significantly to 15.4% from 9.82% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1755161323849,
            "Source": "earnings"
        },
        {
            "Title": "AstraZeneca Pharma India Plans August 2025 Launch of Eculizumab (Soliris)",
            "Summary": "AstraZeneca Pharma India has announced plans to launch Eculizumab, marketed under the brand name Soliris, in India in August 2025. The pharmaceutical company is preparing to introduce this medication to the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1754473098811,
            "Source": "stock"
        },
        {
            "Title": "AstraZeneca Pharma India Clarifies No Involvement in US Pricing Matter",
            "Summary": "AstraZeneca Pharma India has issued a clarification stating that it is not involved in US pricing news. The company has denied any material impact on its operations and stated there is no regulatory action affecting it.",
            "Sentiment": "neutral",
            "PublishDate": 1754063727761,
            "Source": "stock"
        },
        {
            "Title": "AstraZeneca Reports Stronger Q2 Sales and Profit Growth Driven by Cancer Drug Portfolio",
            "Summary": "AstraZeneca reported stronger sales and growing profits in Q2, with the growth attributed to performance of its cancer drugs. The pharmaceutical company's oncology portfolio contributed to improved financial results during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753770454858,
            "Source": "global"
        },
        {
            "Title": "AstraZeneca Pharma India Receives Permission to Import Durvalumab for Additional Indication",
            "Summary": "AstraZeneca Pharma India has been granted permission to import Durvalumab solution for an additional indication in India. This approval also allows the company to market the Durvalumab solution within the country.",
            "Sentiment": "positive",
            "PublishDate": 1752538945000,
            "Source": "default"
        },
        {
            "Title": "AstraZeneca Pharma India: CDSCO Approval for Imfinzi in Bladder Cancer Treatment",
            "Summary": "AstraZeneca Pharma India received CDSCO approval to import and market Imfinzi for muscle-invasive bladder cancer treatment. The company's Q4 net profit jumped 47.7% YoY to ₹58.2 crore, with revenue rising 25.4% to ₹480.4 crore.",
            "Sentiment": "positive",
            "PublishDate": 1752503529000,
            "Source": "corporate_action"
        },
        {
            "Title": "AstraZeneca Receives Approval for New Use of Durvalumab in India",
            "Summary": "AstraZeneca has been granted approval to import Durvalumab for a new use in India. The company is now also permitted to market Durvalumab solution within the country. This development expands the availability and potential applications of the drug in the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1752492872000,
            "Source": "default"
        },
        {
            "Title": "AstraZeneca Pharma India: Imfinzi Approved for New Cancer Treatment",
            "Summary": "AstraZeneca Pharma India received CDSCO approval for Imfinzi to be used in combination therapy for endometrial cancer. The company's Q4 net profit jumped 47.7% YoY to Rs 58.2 crore, with revenue up 25.4% to Rs 480.4 crore. EBITDA increased 74.7% to Rs 86.3 crore.",
            "Sentiment": "positive",
            "PublishDate": 1751434984000,
            "Source": "corporate_action"
        },
        {
            "Title": "AstraZeneca Pharma India Receives Import Permission for Durvalumab Solution",
            "Summary": "AstraZeneca Pharma has been granted permission to import Durvalumab solution into India. Durvalumab is likely a pharmaceutical product, though its specific use or application is not mentioned in the provided news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1751415215000,
            "Source": "default"
        },
        {
            "Title": "AstraZeneca India: CDSCO Approval for Imfinzi in Endometrial Cancer Treatment",
            "Summary": "AstraZeneca Pharma India received CDSCO approval to import Imfinzi (durvalumab) for a new indication in endometrial cancer treatment. The approval allows Imfinzi to be used in combination with carboplatin and paclitaxel as first-line treatment for adults with primary, advanced, or recurrent endometrial cancer.",
            "Sentiment": "positive",
            "PublishDate": 1751378816000,
            "Source": "corporate_action"
        },
        {
            "Title": "AstraZeneca Receives Approval to Import Durvalumab Solution in India",
            "Summary": "AstraZeneca has been granted approval to import Durvalumab solution in India. Durvalumab is a pharmaceutical product, likely a medication. This approval allows AstraZeneca to bring the product into the Indian market, potentially expanding its availability for medical use in the country.",
            "Sentiment": "positive",
            "PublishDate": 1751377602000,
            "Source": "default"
        },
        {
            "Title": "AstraZeneca: Rs 166 Crore Global Hub Established in Bengaluru for AI-Driven Healthcare",
            "Summary": "AstraZeneca has set up a new Global Hub in Bengaluru with an investment of Rs 166 crore, focusing on AI-powered healthcare solutions. The facility will accommodate 1,300 employees, including 400 new jobs, supporting R&D, global business services, IT, and digital health operations. This follows a Rs 250 crore expansion of their Chennai center in July 2024. The combined workforce in India will reach 4,000 employees.",
            "Sentiment": "positive",
            "PublishDate": 1750936720000,
            "Source": "corporate_action"
        },
        {
            "Title": "AstraZeneca Pharma India: New Managing Director Appointed",
            "Summary": "AstraZeneca Pharma India Ltd announces Praveen Rao Akkinepally as new Managing Director, effective July 1, for a three-year term. Current MD Sanjeev Kumar Panchal resigns to take a global role within AstraZeneca Group in the US.",
            "Sentiment": "neutral",
            "PublishDate": 1749473380000,
            "Source": "corporate_governance"
        },
        {
            "Title": "AstraZeneca Pharma India: Q4 Revenue and Margins Soar, Stock Surges 8%",
            "Summary": "AstraZeneca Pharma India reported a 47.7% YoY increase in Q4 net profit to ₹58.2 crore. Revenue rose 25.4% to ₹480.4 crore, while EBITDA jumped 75% to ₹86 crore. EBITDA margin improved by over 500 basis points to 17.96%. The stock is up 8.13% following the results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1748837210000,
            "Source": "earnings"
        },
        {
            "Title": "AstraZeneca Pharma India: Q4 Profit Soars 47%, Declares ₹32 Dividend",
            "Summary": "AstraZeneca Pharma India reported a 47.7% YoY increase in Q4 net profit to ₹58.2 crore. Revenue rose 25.4% to ₹480.4 crore, while EBITDA surged 74.7% to ₹86.3 crore. The company announced a final dividend of ₹32 per share for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1748618052000,
            "Source": "earnings"
        },
        {
            "Title": "AstraZeneca Pharma Reports Q4 Financial Results",
            "Summary": "AstraZeneca Pharma has reported its Q4 financial results. The company's EBITDA increased to 864 million rupees from 494 million rupees year-over-year. The EBITDA margin improved to 17.98% from 12.89% in the same period. Net profit rose to 583 million rupees from 395 million rupees year-over-year and 309 million rupees quarter-over-quarter. Revenue for Q4 increased to 4.8 billion rupees from 3.83 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748617155000,
            "Source": "result"
        },
        {
            "Title": "AstraZeneca Pharma Declares Dividend of ₹32 Per Share",
            "Summary": "AstraZeneca Pharma has announced a dividend of 32 rupees per share. No further details about the timing or nature of the dividend were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1748606648000,
            "Source": "result"
        },
        {
            "Title": "AstraZeneca Pharma India Receives Approval for Benralizumab Import",
            "Summary": "AstraZeneca Pharma India has received approval from the Government of India to import, sell, and distribute Benralizumab 30 mg/mL solution for injection.",
            "Sentiment": "positive",
            "PublishDate": 1748576662000,
            "Source": "default"
        },
        {
            "Title": "AstraZeneca Receives Approval to Import Osimertinib Tablets in India",
            "Summary": "AstraZeneca has been granted permission by the Central Drugs Standard Control Organization, Directorate General of Health Services, Government of India to import, sell, and distribute Osimertinib tablets in the country.",
            "Sentiment": "positive",
            "PublishDate": 1748498077000,
            "Source": "default"
        },
        {
            "Title": "AstraZeneca Pharma India Receives Approval for Enhertu® in HER2-Low Breast Cancer",
            "Summary": "AstraZeneca Pharma India has obtained approval to import and market Enhertu® in India for an additional indication. The drug is now approved for treating HER2-low and ultralow metastatic breast cancer, expanding its potential use in breast cancer treatment.",
            "Sentiment": "positive",
            "PublishDate": 1746691632000,
            "Source": "default"
        },
        {
            "Title": "AstraZeneca Pharma Discontinues Product for Commercial Reasons",
            "Summary": "AstraZeneca Pharma has announced the discontinuation of a product, emphasizing that the decision is based solely on commercial reasons and not due to any concerns regarding the product's efficacy or safety.",
            "Sentiment": "neutral",
            "PublishDate": 1744697348000,
            "Source": "corporate_action"
        },
        {
            "Title": "AstraZeneca Pharma Surrenders Marketing Authorization for Olaparib Tablets",
            "Summary": "AstraZeneca Pharma has voluntarily surrendered the marketing authorization for its Olaparib tablets. This action suggests a significant change in the company's product portfolio or marketing strategy for this particular medication.",
            "Sentiment": "neutral",
            "PublishDate": 1744697261000,
            "Source": "corporate_action"
        },
        {
            "Title": "AstraZeneca Pharma India Receives Approval for Additional Indication of Osimertinib Tablets",
            "Summary": "AstraZeneca Pharma India has obtained permission from the Central Drugs Standard Control Organisation (CDSCO) to import Osimertinib Tablets (Tagrisso) in 40 mg and 80 mg strengths for an additional indication. The company has been granted permission for the import, sale, and distribution of these tablets.",
            "Sentiment": "positive",
            "PublishDate": 1743984528000,
            "Source": "corporate_action"
        },
        {
            "Title": "AstraZeneca Pharma India Receives Approval for Additional Indication of Osimertinib",
            "Summary": "AstraZeneca Pharma India has obtained permission from the Central Drugs Standard Control Organisation (CDSCO) to import Osimertinib tablets (40 mg & 80 mg), marketed as Tagrisso, for an additional indication. The company has been granted permission to import, sell, and distribute these tablets in India.",
            "Sentiment": "positive",
            "PublishDate": 1743779949000,
            "Source": "corporate_action"
        },
        {
            "Title": "AstraZeneca Pharma to Discontinue Imdur Tablets",
            "Summary": "AstraZeneca Pharma has announced that it will discontinue the production and distribution of Imdur tablets, effective from April 1, 2025. Imdur is a medication used to prevent angina (chest pain) in patients with coronary artery disease.",
            "Sentiment": "neutral",
            "PublishDate": 1743150758000,
            "Source": "corporate_action"
        },
        {
            "Title": "Astrazeneca Pharma India Receives Approval to Import Durvalumab for Additional Indication",
            "Summary": "Astrazeneca Pharma India has obtained permission from the Central Drugs Standard Control Organisation, Directorate General of Health Services, Government of India to import and distribute Durvalumab Solution for Infusion (Imfinzi) in 120 mg/2.4 ml and 500 mg/10 ml strengths for an additional indication. This approval allows the company to market the product in India for the specified additional indication, subject to obtaining any other required statutory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1741565371000,
            "Source": "corporate_action"
        },
        {
            "Title": "AstraZeneca Pharma India: Approval for Importing Lung Cancer Drug Durvalumab",
            "Summary": "AstraZeneca Pharma India received approval from CDSCO to import and distribute durvalumab (Imfinzi) for treating limited-stage small cell lung cancer. The drug is approved for patients whose disease has not progressed following platinum-based chemoradiation therapy.",
            "Sentiment": "positive",
            "PublishDate": 1741351796000,
            "Source": "corporate_action"
        },
        {
            "Title": "AstraZeneca Pharma India Receives Permission for Additional Indication of Durvalumab",
            "Summary": "AstraZeneca Pharma India has received permission for marketing Durvalumab solution for infusion (IMFINZI) in India for an additional indication. The approval covers 120 mg/2.4 mL and 500 mg/10 mL formulations. The company can now proceed with marketing the drug for this new indication, subject to obtaining any other required statutory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1741350414000,
            "Source": "corporate_action"
        },
        {
            "Title": "AstraZeneca Pharma India Receives Approval for Additional Indication of Durvalumab",
            "Summary": "AstraZeneca Pharma India has obtained permission from the Central Drugs Standard Control Organisation, Directorate General of Health Services, Government of India to import, sell, and distribute Durvalumab (IMFINZI) solution for infusion in 120 mg/2.4 mL and 500 mg/10 mL formulations for an additional indication.",
            "Sentiment": "positive",
            "PublishDate": 1741350407000,
            "Source": "corporate_action"
        },
        {
            "Title": "AstraZeneca Pharma India Receives Approval for Lokelma Import and Distribution",
            "Summary": "AstraZeneca Pharma India has obtained approval from the Central Drugs Standard Control Organisation (CDSCO) to import and distribute Sodium Zirconium Cyclosilicate, marketed as Lokelma. The approval covers both 5g and 10g powder formulations for oral suspension.",
            "Sentiment": "positive",
            "PublishDate": 1741253947000,
            "Source": "corporate_action"
        }
    ]
}