{
    "Symbol": "ATALREAL",
    "ISIN": "INE0ALR01029",
    "News": [
        {
            "Title": "Atal Realtech Q3FY26 Results Show Strong Growth",
            "Summary": "Atal Realtech reported robust Q3FY26 performance with net profit rising to ₹171.24 lakhs and revenue reaching ₹2,951.20 lakhs, driven by strong works contracting segment.",
            "Sentiment": "positive",
            "PublishDate": 1770296525230,
            "Source": "co_actions_results"
        },
        {
            "Title": "Atal Realtech Seeks Shareholder Approval for ₹49.47 Crore Related Party Transaction",
            "Summary": "Atal Realtech Limited is conducting a postal ballot for shareholders to approve a related party transaction worth ₹49.47 crore with ABH Developers Private Limited for sub-contracting construction work of a Court Building at Karanja, Dist. Washim. The transaction represents approximately 51.68% of the company's annual consolidated turnover and requires approval as it crosses materiality thresholds under SEBI regulations, with e-voting scheduled from November 27 to December 26, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763990659118,
            "Source": "corporate_action"
        },
        {
            "Title": "Atal Realtech Board Approves Rs 49.47 Crore Related Party Contract with ABH Developers",
            "Summary": "Atal Realtech's Board approved a related party transaction with ABH Developers Private Limited for sub-contracting construction work of a court building valued at Rs 49,47,03,092, subject to shareholder approval through postal ballot. The company appointed M/s. Akshay R Birla Associates as scrutinizer for the postal ballot process, with ABH Developers to charge 4% royalty on the total contract value.",
            "Sentiment": "neutral",
            "PublishDate": 1763817554342,
            "Source": "corporate_action"
        },
        {
            "Title": "Atal Realtech Secures Rs 49.47 Crore Court Building Construction Subcontract",
            "Summary": "Atal Realtech has received a subcontract worth Rs 49.47 crore from ABH Developers for the construction of a court building. This contract award represents a significant business development for Atal Realtech, adding substantial value to its project pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1763507322680,
            "Source": "stock"
        },
        {
            "Title": "Atal Realtech Reports Mixed Q2 Performance with Revenue Decline and Profit Growth",
            "Summary": "Atal Realtech Limited reported revenue from operations of Rs 1,973.70 lakhs for Q2 FY2026, down from Rs 3,060.08 lakhs in the previous quarter, while profit after tax increased to Rs 108.07 lakhs from Rs 66.42 lakhs. The company operates in works contracting/government contracting and real estate business segments, with the board approving unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763055255215,
            "Source": "earnings"
        },
        {
            "Title": "Atal Realtech Limited Approves Quarterly Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Atal Realtech Limited's Board of Directors held a meeting on August 5, 2025, and approved the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025, along with the limited review report from the auditor. The board meeting was conducted at the company's registered office in Nashik and lasted from 17:30 PM to 18:15 PM. The approved financial results have been uploaded on the company's website at www.atalrealtech.com. The company is listed on NSE with symbol ATALREAL and on BSE with script code 543911.",
            "Sentiment": "neutral",
            "PublishDate": 1754655010595,
            "Source": "earnings"
        },
        {
            "Title": "Atal Realtech Limited Approves Quarterly Financial Results for June 30, 2025",
            "Summary": "Atal Realtech Limited's Board of Directors approved the company's unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The board meeting was held on August 5, 2025, at the company's registered office in Nashik, commencing at 17:30 PM and concluding at 18:15 PM. The approved results include a limited review report from auditors and have been uploaded to the company's website at www.atalrealtech.com. The approval was communicated to the National Stock Exchange of India Limited and BSE Limited as part of regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1754404731851,
            "Source": "earnings"
        }
    ]
}