{
    "Symbol": "ATAM",
    "ISIN": "INE09KD01013",
    "News": [
        {
            "Title": "Atam Valves Clears API Q1 Audit, Expects Final Certification by February 2026",
            "Summary": "Atam Valves Limited successfully completed the first audit stage (Q1 Certification) conducted by the American Petroleum Institute (API) and is addressing final procedural observations expected to conclude within 6-8 weeks. The company anticipates formal API certification by February 2026, which will unlock revenue streams from API-related business by end of FY27, while also planning expansion to manufacture valves up to 72 inches compared to current 12-inch capacity.",
            "Sentiment": "positive",
            "PublishDate": 1764849495231,
            "Source": "stock"
        },
        {
            "Title": "Atam Valves Limited Reports Q2 FY26 Results with Resilient Revenue Growth Despite Challenging Environment",
            "Summary": "Atam Valves Limited delivered resilient revenue growth and maintained steady EBITDA margins in Q2 FY26 despite challenging macro conditions, with quarterly revenue of Rs 11.40 crores and EBITDA margin of 14.03%. The industrial valve manufacturer continues to focus on API certification pursuit, product diversification, and export expansion while serving oil & gas, chemical, and infrastructure sectors.",
            "Sentiment": "neutral",
            "PublishDate": 1763382365843,
            "Source": "earnings"
        },
        {
            "Title": "Atam Valves Reports Q2 Revenue of ₹11.40 Cr with 14.03% EBITDA Margin",
            "Summary": "Atam Valves Limited announced quarterly results with revenue from operations at ₹11.40 Cr, EBITDA of ₹1.60 Cr at 14.03% margin, and PAT of ₹0.90 Cr with EPS of ₹0.78 per share. The industrial valves manufacturer maintained steady margins despite challenging macro environment and remains positioned to benefit from infrastructure investments and rising industrial demand across sectors.",
            "Sentiment": "neutral",
            "PublishDate": 1763135279512,
            "Source": "corporate_action"
        },
        {
            "Title": "Atam Valves Limited Reports Quarterly Financial Results",
            "Summary": "Atam Valves Limited published its un-audited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 1,237.13 lakhs compared to Rs 1,470.88 lakhs in the previous quarter and Rs 1,148.48 lakhs in the same quarter last year. Net profit after tax stood at Rs 123.93 lakhs, down from Rs 213.05 lakhs in the previous quarter but higher than Rs 93.08 lakhs in the corresponding quarter of the previous year. Basic and diluted earnings per share were Rs 1.08 each. The results were approved by the Board of Directors on August 11, 2025, and published in newspapers on August 13, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755074516758,
            "Source": "earnings"
        },
        {
            "Title": "Atam Valves Limited Reports 33% YoY Profit Growth in Q1 Results",
            "Summary": "Atam Valves Limited, a valve manufacturing company, reported quarterly results with revenue from operations of Rs. 1,237.13 lakhs and profit after tax of Rs. 123.93 lakhs. The company showed strong year-on-year performance with profit before tax increasing 33.1% from Rs. 124.44 lakhs to Rs. 165.63 lakhs, and profit after tax rising 33.1% from Rs. 93.08 lakhs to Rs. 123.93 lakhs. Revenue from operations grew 7.7% compared to the same quarter last year. However, quarter-on-quarter performance declined, with revenue dropping 15.9% from Rs. 1,470.88 lakhs and profit before tax falling 42.4% from Rs. 287.44 lakhs. The company operates as a single segment entity manufacturing valves, fittings, steam traps and strainers, with earnings per share of Rs. 1.08. The Board approved these unaudited financial results at a meeting held on August 1, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754908414689,
            "Source": "earnings"
        }
    ]
}