{
    "Symbol": "ATGL",
    "ISIN": "INE399L01023",
    "News": [
        {
            "Title": "Adani Total Gas Q3 FY26 Results Show Strong Growth",
            "Summary": "Adani Total Gas reported 17% revenue growth to INR1,631 crores in Q3 FY26, driven by 17% CNG volume growth and network expansion to 680 stations with 1.05 million PNG connections.",
            "Sentiment": "positive",
            "PublishDate": 1769755096670,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Total Gas Plans 10,000 EV Charging Points",
            "Summary": "Adani Total Gas announces expansion plans with 10,000 EV charging points and expects growth in CNG stations with improved performance in upcoming quarters.",
            "Sentiment": "positive",
            "PublishDate": 1769485729371,
            "Source": "stocks"
        },
        {
            "Title": "Adani Total Gas clarifies no disclosure needed on US report",
            "Summary": "Adani Total Gas Limited states that media reports about US regulator seeking measures do not trigger disclosure requirements under SEBI regulations, as the company is not party to proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1769194588644,
            "Source": "stocks"
        },
        {
            "Title": "Adani Total Gas Appoints K Jairaj as Independent Director",
            "Summary": "Adani Total Gas shareholders approve appointment of K Jairaj as Independent Director through postal ballot with 99.85% votes in favour. E-voting conducted from December 25, 2025 to January 23, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769181104624,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Total Gas Q3FY26 Profit Rises 11.4% to ₹158.65 Cr",
            "Summary": "Adani Total Gas reported consolidated net profit of ₹158.65 crores for Q3FY26, up 11.4% YoY. Revenue from operations grew 17.0% to ₹1,639.22 crores despite higher finance costs.",
            "Sentiment": "positive",
            "PublishDate": 1769086717099,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Total Gas Q3FY26 Earnings Call Set for Jan 23",
            "Summary": "Adani Total Gas Limited has scheduled an investor and analyst conference call on January 23, 2026, at 11:00 AM IST to discuss Q3FY26 financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768465674749,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Total Gas Board Meet Set for Jan 22, 2026",
            "Summary": "Adani Total Gas Limited has scheduled a board meeting on January 22, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed from January 1-25, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767725273461,
            "Source": "co_actions_results"
        },
        {
            "Title": "Adani Total Gas clarifies volume surge to BSE",
            "Summary": "Adani Total Gas responds to BSE inquiry about significant trading volume increase, attributing movement to market conditions while confirming regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1767342611226,
            "Source": "stocks"
        },
        {
            "Title": "Adani Total Gas Seeks Shareholder Approval for New Director",
            "Summary": "Adani Total Gas Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. K Jairaj as Independent Director. The e-voting period runs from December 25, 2025 to January 23, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766591747825,
            "Source": "stocks"
        },
        {
            "Title": "Adani Total Gas Appoints Interim CFO",
            "Summary": "Adani Total Gas appoints Mr. Preyash Jhaveri as Interim CFO effective December 22, 2025, following board approval and regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1766386832255,
            "Source": "stocks"
        },
        {
            "Title": "Adani Total Gas Receives ESG Rating of 73 from NSE Sustainability",
            "Summary": "NSE Sustainability Ratings & Analytics Limited independently assigned an ESG rating of 73 to Adani Total Gas for FY2025, reflecting the company's performance on Environmental, Social and Governance parameters. The rating was prepared independently by NSE Sustainability based on publicly available data without engagement from Adani Total Gas.",
            "Sentiment": "positive",
            "PublishDate": 1765291497262,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Total Gas Achieves 72/100 Score in S&P Global Sustainability Assessment",
            "Summary": "Adani Total Gas Limited scored 72 out of 100 in the 2025 S&P Global Corporate Sustainability Assessment, placing the company in the 85th percentile within the Gas Utility sector. The company has improved its CSA score by 22 points over the past three years, reflecting significant progress in ESG performance and commitment to sustainability excellence.",
            "Sentiment": "positive",
            "PublishDate": 1763650016929,
            "Source": "stock"
        },
        {
            "Title": "Adani Total Gas Clarifies Battery Storage News Not Related to Company",
            "Summary": "Adani Total Gas has stated that recent battery storage news is unrelated to their company operations.",
            "Sentiment": "neutral",
            "PublishDate": 1762963587996,
            "Source": "stock"
        },
        {
            "Title": "Adani Total Gas Reports 16% Volume Growth, Achieves AA Credit Rating Upgrade",
            "Summary": "Adani Total Gas Limited reported robust operational performance for the quarter and half-year ended September 30, 2025. The company achieved 16% overall volume growth year-on-year, with CNG volumes rising 18% in the quarter and 19% in the first half, while PNG volumes grew 11% and 9% respectively. Revenue from operations increased 19% to INR 1,569 crores in the quarter and 20% to INR 3,060 crores in the first half. EBITDA reached INR 302 crores for the quarter and INR 603 crores for the first half. The company expanded its network by adding 12 new CNG stations, bringing the total to 662 stations, and added 27,000 new home PNG connections during the quarter, surpassing 1 million consumers. Steel pipeline infrastructure increased to 14,524 kilometers across 34 geographical areas. Three major credit rating agencies - ICRA, CARE, and CRISIL - upgraded the company to AA stable rating. The e-mobility business expanded to 4,209 installed charging points across 26 states and 226 cities. Combined APM and new well gas allocation moderated to 57% in the quarter from 60% in the previous quarter. A supply chain realignment resulted in 2% CST levy instead of the earlier 15% VAT for gas supplied outside Gujarat, effective from October 1, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762206740102,
            "Source": "earnings"
        },
        {
            "Title": "Adani Total Gas Reports 16% Volume Growth in Q2FY26, Crosses 1 Million PNG Households",
            "Summary": "Adani Total Gas Limited reported combined CNG and PNG volume of 280 MMSCM for Q2FY26, marking a 16% year-on-year increase. The company expanded its CNG network to 662 stations by adding 12 new stations and crossed the milestone of 1 million PNG household connections, reaching 1.02 million homes. Revenue from operations increased 19% to INR 1,569 crores, while EBITDA stood at INR 302 crores for the quarter. For H1FY26, revenue grew 20% to INR 3,060 crores with EBITDA at INR 603 crores. The company's credit rating was upgraded to AA+ (Stable) by three rating agencies - ICRA, CRISIL, and CARE. Gas costs increased 29% due to lower APM allocation to the CNG segment being replaced by higher-priced gas. The company completed approximately 14,524 inch-km of steel pipeline network and added 147 new industrial and commercial connections. ATGL won three PNGRB Awards for safety, sustainability, and customer service excellence.",
            "Sentiment": "positive",
            "PublishDate": 1761658573196,
            "Source": "earnings"
        },
        {
            "Title": "Adani Total Gas Reports 24% Profit Growth and Appoints New Independent Director",
            "Summary": "Adani Total Gas Limited reported consolidated profit of ₹163.49 crore for the quarter ended September 30, 2025, compared to ₹109.98 crore in the same period last year. Revenue from operations increased to ₹1,576.38 crore from ₹1,318.37 crore year-over-year. For the half-year period, consolidated profit reached ₹328.73 crore versus ₹357.44 crore in the previous year. The company's Board approved the appointment of K. Jairaj as Additional Director (Non-Executive, Independent) for a 3-year term starting November 3, 2025, subject to shareholder approval within three months. Jairaj, aged 73, is a former Indian Administrative Service officer with extensive experience in infrastructure and energy sectors.",
            "Sentiment": "positive",
            "PublishDate": 1761656183789,
            "Source": "earnings"
        },
        {
            "Title": "Adani Total Gas CFO Parag Parikh Steps Down",
            "Summary": "Parag Parikh has stepped down from his position as Chief Financial Officer at Adani Total Gas.",
            "Sentiment": "neutral",
            "PublishDate": 1759246368727,
            "Source": "corporate_governance"
        },
        {
            "Title": "Adani Group Chairman Addresses Shareholders Following SEBI Dismissal of Hindenburg Allegations",
            "Summary": "Gautam Adani, Chairman of Adani Group, issued a letter to shareholders of Adani Total Gas Limited addressing the aftermath of Hindenburg's January 24, 2023 report. Adani stated that SEBI has dismissed the allegations against the group, calling it a validation of the company's transparency and governance. He highlighted the group's financial performance during this period, with portfolio EBITDA growing from ₹57,205 crores in FY23 to ₹89,806 crores in FY25, representing 57% absolute growth and 25% CAGR over two years. The group's gross block expanded from ₹4,12,318 crores to ₹6,09,133 crores, adding nearly ₹2 lakh crores. Key projects completed include India's first container transshipment port at Vizhinjam, 6 GW of renewable capacity including the Khavda project, the world's largest copper smelter complex, and 7,000 circuit kms of transmission lines with 4 GW of thermal capacity. Adani acknowledged the anxiety caused to investors, lenders, suppliers and partners during this period and committed to strengthening governance standards, accelerating innovation and sustainability, and continuing infrastructure investments.",
            "Sentiment": "positive",
            "PublishDate": 1758692652173,
            "Source": "stock"
        },
        {
            "Title": "Adani Total Gas Shares Drop 5% as Investors Book Profits After Previous Session's 19% Surge",
            "Summary": "Adani Total Gas shares declined 5% on Tuesday, reaching an intraday low of Rs 741.35 on BSE, as investors booked profits following a sharp 19% gain in the previous session. The stock was among top gainers across Adani Group on Monday, contributing to a Rs 1.7 lakh crore increase in the group's market capitalization over two trading sessions. The broader Adani Group rally followed SEBI's clean chit to Gautam Adani in the Hindenburg case. BSE sought clarification from the company regarding unusual volume and price movement, to which Adani Total Gas responded that the movement was purely due to market conditions and market driven, with management having no knowledge or control over the reasons. The company confirmed compliance with disclosure obligations under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1758608897384,
            "Source": "stock"
        },
        {
            "Title": "Adani Total Gas Sees Block Trade Worth Rs. 77.60 Crores on NSE",
            "Summary": "Adani Total Gas executed a block trade on the National Stock Exchange involving approximately 992,764 shares at a price of Rs. 781.70 per share, totaling Rs. 77.60 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1758533749022,
            "Source": "order&deals"
        },
        {
            "Title": "Adani Total Gas Reports 16% Volume Growth in Q1 FY26, Revenue Up 21% to ₹1,491 Crores",
            "Summary": "Adani Total Gas Limited delivered strong quarterly results with total volume growth of 16% to 267 MMSCM, driven primarily by CNG segment growth of 21% to 185 MMSCM. Revenue increased 21% to ₹1,491 crores while PNG volumes grew 6% to 82 MMSCM. The company reported EBITDA of ₹301 crores, profit before tax of ₹219 crores, and profit after tax of ₹162 crores. Network expansion continued with CNG stations reaching 650 outlets and steel pipeline infrastructure extending to 14,197 inch kilometers. The company added 27,000 new domestic PNG connections, bringing total domestic connections to nearly 1 million. Higher gas costs due to reduced APM gas allocation were offset by New Well Gas and HPHT gas purchases. The company entered a partnership with Jio-BP to accelerate DODO and CODO CNG station additions. CRISIL upgraded the company's ESG rating from Adequate to Strong with a score of 61.",
            "Sentiment": "positive",
            "PublishDate": 1754291052772,
            "Source": "earnings"
        },
        {
            "Title": "ATGL Reports Growth in Q1 Financial Performance",
            "Summary": "ATGL reported consolidated net profit of 1.65 billion rupees in Q1, up from 1.55 billion rupees in the previous quarter. Revenue increased to 14.98 billion rupees from 14.53 billion rupees quarter-on-quarter. EBITDA rose to 2.93 billion rupees compared to 2.66 billion rupees in the previous quarter, while EBITDA margin improved to 19.57% from 18.22%.",
            "Sentiment": "positive",
            "PublishDate": 1753704943800,
            "Source": "earnings"
        },
        {
            "Title": "Adani Total Gas: Last Day to Buy Shares for Dividend Eligibility",
            "Summary": "June 12 is the last day to buy Adani Total Gas shares to qualify for the Rs 0.25 per share final dividend for FY2025. The record date is set for June 13, with a total dividend payout of Rs 27 crore. Q4 FY2025 saw an 8.5% increase in consolidated net profit to Rs 154 crore and a 3.6% rise in revenue to Rs 1,341 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1749696386000,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Total Gas: Q4 Profit Rises 9% Amid Volume Growth",
            "Summary": "Adani Total Gas reported a 9% increase in Q4 net profit to Rs 154 crore. Revenue rose 3.6% to Rs 1,341 crore. CNG and PNG volume grew 13% year-on-year. The company recommended a dividend of Rs 0.25 per share for FY2025.",
            "Sentiment": "positive",
            "PublishDate": 1745900705000,
            "Source": "earnings"
        },
        {
            "Title": "Adani Total Gas Reports Q4 Financial Results",
            "Summary": "Adani Total Gas announced its Q4 consolidated net profit of 1.54 billion rupees, up from 1.42 billion rupees in the previous quarter. The company's revenue also increased to 14.5 billion rupees from 14 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745885438000,
            "Source": "default"
        },
        {
            "Title": "Adani Total Gas: Q4 PAT Dips 8% YoY, Revenue Up 15%; Dividend Declared",
            "Summary": "Adani Total Gas reported Q4FY25 net profit of Rs 154 crore, down 8% YoY but up 9% QoQ. Revenue increased 15% YoY to Rs 1,453 crore. Full-year FY25 profit fell 2% to Rs 654 crore, while revenue rose 12% to Rs 5,412 crore. The board recommended a dividend of Rs 0.25 per share for FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1745843581000,
            "Source": "earnings"
        },
        {
            "Title": "Adani Total Gas: Q4 Profit Rises 8.5% to ₹155 Crore",
            "Summary": "Adani Total Gas Ltd reported an 8.5% increase in Q4 net profit to ₹155 crore. Revenue rose 3.6% to ₹1,341 crore, while EBITDA grew 0.6% to ₹266.4 crore. The company benefited from expanded CNG station networks and steady demand in its city gas distribution business.",
            "Sentiment": "positive",
            "PublishDate": 1745841589000,
            "Source": "earnings"
        },
        {
            "Title": "Adani Total Gas: Q4 Profit Dips 8% Despite Revenue Surge, Dividend Declared",
            "Summary": "Adani Total Gas reported a 7.9% YoY decrease in Q4 FY25 consolidated net profit to ₹154.59 crore, despite a 15.5% increase in revenue to ₹1453.37 crore. The company's board recommended a dividend of ₹0.25 per share for FY 2024-25, subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1745841294000,
            "Source": "result"
        },
        {
            "Title": "Adani Total Gas: Q4 Results Date and Dividend Announcement Scheduled",
            "Summary": "Adani Total Gas Ltd. will announce Q4 and FY2024-25 results on April 28, 2025. The board will consider dividend recommendations. An earnings call is scheduled for April 29. Trading window for designated persons closed until 48 hours post-results.",
            "Sentiment": "neutral",
            "PublishDate": 1745645116000,
            "Source": "corporate_action"
        },
        {
            "Title": "GAIL Reduces Gas Allocation to Adani Total Gas, Impacting Profitability",
            "Summary": "Adani Total Gas has received communication from GAIL (India) Ltd indicating a 15% reduction in APM-priced domestic gas allocation starting April 16, 2025. This reduction will be replaced with higher-priced New Well Gas (NWG), which is expected to adversely impact the company's profitability.",
            "Sentiment": "negative",
            "PublishDate": 1744769405000,
            "Source": "default"
        },
        {
            "Title": "Adani Total Gas Expects Positive Impact from Increased APM Gas Allocation",
            "Summary": "Adani Total Gas Limited anticipates a positive impact on its fourth quarter performance due to an increase in the allocation of APM (Administered Pricing Mechanism) natural gas. This increase in gas allocation is expected to benefit the company's operations and financial results for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737968462000,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Total Gas: Q3 Profit Drops 20% Despite Revenue Growth",
            "Summary": "Adani Total Gas reported a 20% year-on-year decline in Q3 profit to Rs 142 crore. Revenue from operations increased by 13% to Rs 1,401 crore. Operating EBITDA fell 9% to Rs 277 crore, while operating expenses rose 21% to Rs 994 crore.",
            "Sentiment": "negative",
            "PublishDate": 1737968458000,
            "Source": "earnings"
        },
        {
            "Title": "Adani Total Gas Reports Q3 Revenue of 14 Billion Rupees",
            "Summary": "Adani Total Gas has reported quarterly revenue of 14 billion rupees for the third quarter, representing an increase from 13.2 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737968046000,
            "Source": "earnings"
        },
        {
            "Title": "Adani Total Gas Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Adani Total Gas has reported its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 2.64 billion rupees from 3.05 billion rupees in the previous quarter. Additionally, the EBITDA margin fell to 18.84% from 23.20% quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1737968043000,
            "Source": "earnings"
        },
        {
            "Title": "Adani Total Gas Reports Q3 Net Profit of 1.42 Billion Rupees",
            "Summary": "Adani Total Gas has announced its consolidated net profit for the third quarter, which stands at 1.42 billion rupees. This represents a decrease from the previous quarter's net profit of 1.86 billion rupees.",
            "Sentiment": "negative",
            "PublishDate": 1737967994000,
            "Source": "earnings"
        },
        {
            "Title": "Adani Total Gas Receives Increased APM Gas Allocation",
            "Summary": "Adani Total Gas has been informed by GAIL (India) Ltd that their allocation of APM gas will be increased by 20%, effective January 16, 2025. This upward revision is expected to have a positive impact on the company and help stabilize retail prices for end consumers.",
            "Sentiment": "positive",
            "PublishDate": 1736468178000,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Total Gas Receives Increased APM Gas Allocation",
            "Summary": "Adani Total Gas has been informed by GAIL (India) Ltd that their allocation of APM gas will be increased by 20%, effective January 16, 2025. This upward revision is expected to have a positive impact on the company and help stabilize retail prices for end consumers.",
            "Sentiment": "positive",
            "PublishDate": 1736431164000,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Total Gas: Share Price Rises 1.57% Amid Market Upturn",
            "Summary": "Adani Total Gas shares are trading at ₹815.85, up 1.57% from the previous close. The stock hit a high of ₹862.15 and a low of ₹788.4. Trading volume is 2523.10% higher than the previous session. The broader market is also positive, with Nifty up 0.9% and Sensex up 0.91%.",
            "Sentiment": "positive",
            "PublishDate": 1732859565000,
            "Source": "normal_news"
        },
        {
            "Title": "Adani Total Gas: Shares Surge 14.12% Amid Market Downturn",
            "Summary": "Adani Total Gas shares are trading at ₹792.25, up 14.12% from the previous close. The stock hit a high of ₹823.3 and a low of ₹712.4. Trading volume is 2274.97% higher than the previous session. The stock is trading above its 5, 10, 20, and 50-day SMAs but below its 100 and 300-day SMAs. FII holding increased from 12.96% in June to 13.07% in September.",
            "Sentiment": "positive",
            "PublishDate": 1732772607000,
            "Source": "normal_news"
        },
        {
            "Title": "Adani Total Gas: Shares Surge 4.64% Amid Mixed Peer Performance",
            "Summary": "Adani Total Gas shares are trading at ₹606.6, up 4.64% from the previous close. The stock has seen high trading volume, 142.27% higher than the previous session. FII holding increased from 12.96% in June to 13.07% in September.",
            "Sentiment": "positive",
            "PublishDate": 1732686211000,
            "Source": "normal_news"
        },
        {
            "Title": "Adani Total Gas: Share Price Dips 1.2% Amid Market Fluctuations",
            "Summary": "Adani Total Gas shares are trading at ₹593.55, down 1.2% from the previous close. The stock has hit a high of ₹606.5 and a low of ₹583.25 today. Trading volume is 142.27% higher than the previous session. The stock is currently in a strong downtrend according to technical analysis. FII holding increased from 12.96% in June to 13.07% in September.",
            "Sentiment": "negative",
            "PublishDate": 1732600482000,
            "Source": "normal_news"
        },
        {
            "Title": "TotalEnergies Clarifies Non-Involvement in Adani Group Indictment",
            "Summary": "TotalEnergies has issued a statement clarifying that Adani Total Gas is not targeted or involved in the facts described in a recent indictment. This appears to be in response to ongoing investigations or allegations surrounding the Adani Group.",
            "Sentiment": "neutral",
            "PublishDate": 1732525840000,
            "Source": "corporate_governance"
        },
        {
            "Title": "TotalEnergies Issues Statement on Investments in Adani Group",
            "Summary": "TotalEnergies has released a statement regarding its investments in Adani Group companies in India. The statement likely addresses the company's position and potential actions in light of recent developments or controversies surrounding the Adani Group.",
            "Sentiment": "neutral",
            "PublishDate": 1732525762000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Adani Total Gas: Share Price Rises 1.68% Amid Market Upturn",
            "Summary": "Adani Total Gas shares are trading at ₹619.7, up 1.68% from the previous close. The stock hit a high of ₹641.95 and a low of ₹617.2. Trading volume is 99.98% higher than the previous session. The stock is currently in a strong downtrend according to technical analysis.",
            "Sentiment": "neutral",
            "PublishDate": 1732513795000,
            "Source": "normal_news"
        },
        {
            "Title": "Adani Total Gas Denies Involvement in US Indictments",
            "Summary": "Adani Total Gas has issued a statement asserting that there are no allegations against the company in recent US indictments. This appears to be a response to clarify the company's position in light of potential legal or regulatory concerns.",
            "Sentiment": "neutral",
            "PublishDate": 1732178556000,
            "Source": "normal_news"
        },
        {
            "Title": "Adani Total Gas Reports Q2 Revenue Increase",
            "Summary": "Adani Total Gas Limited has reported a quarter-on-quarter increase in revenue for Q2. The company's revenue rose to 13.2 billion rupees, up from 12.4 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1729762355000,
            "Source": "result"
        },
        {
            "Title": "Adani Total Gas Reports Q2 EBITDA and Margin",
            "Summary": "Adani Total Gas has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 is 3.05 billion rupees, compared to 2.96 billion rupees in the previous quarter. The EBITDA margin for Q2 is 23.2%, down from 23.90% in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1729762340000,
            "Source": "result"
        },
        {
            "Title": "Adani Total Gas Reports Q2 Profit Increase",
            "Summary": "Adani Total Gas has reported a consolidated net profit of 1.86 billion rupees for the second quarter, up from 1.72 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1729762296000,
            "Source": "result"
        },
        {
            "Title": "Adani Total Gas Faces Reduction in Domestic Gas Allocation",
            "Summary": "Adani Total Gas has reported a reduction in their APM priced domestic gas allocation by approximately 16%, effective from October 16th. This change is based on communication received from the nodal agency.",
            "Sentiment": "negative",
            "PublishDate": 1729214652000,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Total Gas Receives Domestic Gas Allocation for CNG and PNG Supply",
            "Summary": "Adani Total Gas has been allocated domestic gas under the Administered Price Mechanism (APM) for supplying Compressed Natural Gas (CNG) for transportation and Domestic Piped Natural Gas (PNG) for household use.",
            "Sentiment": "positive",
            "PublishDate": 1729214406000,
            "Source": "corporate_action"
        }
    ]
}