{
    "Symbol": "ATL",
    "ISIN": "INE0NN701020",
    "News": [
        {
            "Title": "Allcargo Terminals Q3 FY26 Rights Issue Report",
            "Summary": "Allcargo Terminals submits monitoring agency report for Q3 FY26 regarding rights issue proceeds utilization of ₹7,959.80 lakhs with no deviations reported by CRISIL Ratings.",
            "Sentiment": "neutral",
            "PublishDate": 1770883090813,
            "Source": "co_actions_results"
        },
        {
            "Title": "Allcargo Terminals Q3FY26 Earnings Call on Feb 11",
            "Summary": "Allcargo Terminals Limited has scheduled its Q3FY26 earnings conference call for February 11, 2026 at 3:30 PM IST to discuss financial performance for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770384485169,
            "Source": "co_actions_results"
        },
        {
            "Title": "Allcargo Terminals Reports 18% Volume Growth in Dec 2025",
            "Summary": "Allcargo Terminals Limited achieved 61.2 thousand TEUs in December 2025, marking an 18% year-on-year growth and 11% month-on-month increase in CFS volumes.",
            "Sentiment": "positive",
            "PublishDate": 1767611055866,
            "Source": "stocks"
        },
        {
            "Title": "Allcargo Terminals Senior VP Retires from SMP",
            "Summary": "Allcargo Terminals announces retirement of Ms. Sumita Banerji, Senior Vice President-Business Development, from Senior Management Personnel effective December 23, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766494759089,
            "Source": "stocks"
        },
        {
            "Title": "Allcargo Terminals Reports 16% Volume Growth",
            "Summary": "Allcargo Terminals Limited achieved a 16% year-over-year increase in Container Freight Station (CFS) volumes for November 2025, demonstrating strong operational performance in the marine port services sector.",
            "Sentiment": "positive",
            "PublishDate": 1766144421067,
            "Source": "stocks"
        },
        {
            "Title": "Allcargo Terminals Reports 21% Growth in CFS Volumes for October 2025",
            "Summary": "Allcargo Terminals Limited achieved CFS volumes of 60,000 TEUs in October 2025, marking a 21% increase compared to October 2024 and 1% growth over September 2025. The operational update demonstrates strong year-over-year performance growth for the logistics company's container freight station operations.",
            "Sentiment": "positive",
            "PublishDate": 1763535289044,
            "Source": "stock"
        },
        {
            "Title": "Allcargo Terminals Reports Strong Q2 FY26 Results with 12% Volume Growth and Capacity Expansion Plans",
            "Summary": "Allcargo Terminals Limited reported strong quarterly results with total volume handled at 168,000 TEUs in Q2 FY26, representing 12% sequential growth and 7% year-over-year growth. Revenue reached INR 207 crores, up 11% quarter-over-quarter and 6% year-over-year. EBITDA excluding other income stood at INR 40 crores, showing 17% sequential growth and 24% year-over-year growth. EBITDA per TEU improved to INR 2,390, up 4% sequentially and 17% year-over-year. The company is expanding capacity from 8.3 lakh TEUs to over 13 lakh TEUs through four key projects including JNPT yard expansion, new CFS in Mundra, Chennai facility near Ennore/Kattupalli ports, and greenfield ICD in Farukhnagar. The company raised INR 38.28 crores through convertible warrants and plans a rights issue of up to INR 80 crores for expansion funding. Management expects to maintain EBITDA per TEU in the range of INR 2,200-2,300 going forward and targets capacity utilization of 80-85%.",
            "Sentiment": "positive",
            "PublishDate": 1762851484939,
            "Source": "earnings"
        },
        {
            "Title": "Allcargo Terminals Approves ₹80 Crore Rights Issue of Partially Paid Shares",
            "Summary": "Allcargo Terminals' board has approved a rights offer of 39,798,999 partially paid shares priced at ₹20 each, raising up to ₹80 crores. The record date is set for November 14, 2025, with the issue opening on November 24, 2025. This rights offering will allow existing shareholders to purchase additional shares at the specified price.",
            "Sentiment": "neutral",
            "PublishDate": 1762759531940,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Terminals Reports 47% Volume Growth and 46% Revenue Increase in Q2",
            "Summary": "Allcargo Terminals Limited reported quarterly results showing volume growth of 168,755 TEUs (47% year-over-year, 12% quarter-over-quarter) and revenue of Rs 207 crores (46% year-over-year, 11% quarter-over-quarter). EBITDA reached Rs 40 crores with a 24% year-over-year increase and 19.5% margin. Net profit stood at Rs 11 crores with marginal year-over-year decline of 0.3%. For the half-year period, the company handled 319,736 TEUs (41% year-over-year growth) with revenue of Rs 394 crores (43% year-over-year increase). The company operates as one of India's leading CFS players with a throughput capacity of 1 million TEUs across 6 CFS facilities and 1 ICD. Management highlighted expansion projects including additional 170,000 TEUs capacity at JNPT commenced in August 2025, and upcoming projects in Chennai, Farukhnagar, and Mundra with cumulative CAPEX of Rs 400 crores. The company maintains a steady market share of 13% and targets expansion to 15%.",
            "Sentiment": "positive",
            "PublishDate": 1762260785622,
            "Source": "earnings"
        },
        {
            "Title": "Allcargo Terminals Reports Strong Quarterly Performance with Revenue Growth and Profit Increase",
            "Summary": "Allcargo Terminals Limited announced its unaudited standalone and consolidated financial results for the quarter and six months ended September 30, 2025. The company's Board of Directors approved these results at their meeting held on November 4, 2025. The results include both standalone and consolidated financial statements with limited review reports from auditors. The company operates primarily in the Container Freight Stations segment. During the period, Allcargo Terminals issued 1.32 crore convertible warrants at Rs. 29 per warrant, with 25% of the issue price received at subscription. The company also completed the acquisition of a 15% equity stake in Speedy Multimodes Limited through a share swap arrangement, making it a wholly owned subsidiary. Additionally, the company acquired equity shares in Haryana Orbital Rail Corporation Limited. The Income Tax Authorities conducted search operations at various premises of the company and its subsidiary, and the company received notices under Section 158BC of the Income Tax Act requiring filing of returns. The company also received demand notices from GST authorities for Rs. 25.29 crore plus penalty, against which it has filed a writ petition and obtained an interim stay order from the Madras High Court.",
            "Sentiment": "neutral",
            "PublishDate": 1762242529834,
            "Source": "earnings"
        },
        {
            "Title": "Allcargo Terminals Reports Marginal Growth in Q2 Results",
            "Summary": "Allcargo Terminals reported consolidated net profit of 113 million rupees for Q2, compared to 112 million rupees in the same period last year. The company's revenue increased to 2.1 billion rupees from 1.95 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762242108593,
            "Source": "earnings"
        },
        {
            "Title": "Allcargo Terminals Restructures Senior Management with Regional Leadership Changes",
            "Summary": "Allcargo Terminals Limited announced changes to its senior management personnel on October 17, 2025. Rahul Acharekar ceased to be Head of Operations as he was transferred to ECU Worldwide, a promoter group company. The company also restructured regional leadership roles with Nitin Behl being designated as Regional Head – North Region & Head – Pan India Operations, expanding from his previous role as Regional Business Head for ICD-Dadri and CFS Kolkata. Debashis Sethi was promoted to Regional Head – Eastern and Southern Region from his former position as Head Business Development – Southern Region. Behl brings over 25 years of logistics experience and has been with Allcargo since 2011, while Sethi has over 15 years of supply chain experience across multiple industries and holds qualifications from IIM Ranchi and IIM Calcutta.",
            "Sentiment": "neutral",
            "PublishDate": 1760698371254,
            "Source": "corporate_governance"
        },
        {
            "Title": "Allcargo Terminals Reports 18% Growth in CFS Volumes for September 2025",
            "Summary": "Allcargo Terminals Limited reported CFS volumes of 59.7 thousand TEUs for September 2025, representing an 18% increase compared to September 2024 and a 5% rise from August 2025. The company submitted this monthly operational update to the National Stock Exchange of India and BSE Limited. The volume data shows consistent growth momentum, with September 2025 marking the highest monthly volume in the reported period spanning from September 2024 to September 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760593027988,
            "Source": "stock"
        },
        {
            "Title": "Allcargo Terminals Approves Rights Issue to Raise Up to 800 Million Rupees",
            "Summary": "Allcargo Terminals has approved a rights issue to raise up to 800 million rupees. The company's board has given approval for this fundraising initiative through the rights issue route.",
            "Sentiment": "positive",
            "PublishDate": 1759819333113,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Terminals Executes Lease Agreement for 30-Acre Chennai Land Parcel with Venkatesh Coke and Power",
            "Summary": "Allcargo Terminals Limited has executed a lease agreement with Venkatesh Coke and Power Limited for approximately 30 acres of land in Chennai for capacity expansion evaluation. The lease carries an annual rental of Rs. 9 crores with a 15% escalation every three years. The company is required to provide a security deposit equivalent to 6 months rent upon execution. The agreement follows an extension of their existing term sheet until October 31, 2025, with the lease agreement being executed on September 30, 2025. The transaction is not a related party transaction and the parties have no shareholding relationship.",
            "Sentiment": "positive",
            "PublishDate": 1759249338869,
            "Source": "order&deals"
        },
        {
            "Title": "Allcargo Terminals Presents Analyst Day 2025 with Expansion Plans and Growth Targets",
            "Summary": "Allcargo Terminals Limited submitted an investor presentation for Analyst Day 2025. The company operates 7 CFS/ICD facilities across India, handling 679k TEUs with an 80% share of India's EXIM trade. The presentation outlines expansion projects including JNPT expansion adding 170,000 TEUs capacity (commenced August 2025), a new Mundra CFS with 250,000 TEUs capacity (FY27), Chennai facility with 170,000 TEUs capacity (FY28), and Farukhnagar ICD with 120,000 TEUs capacity (FY28). The company targets growth from 680k TEUs to 1 million TEUs by FY30, with revenue projected to increase from ₹758 crores to ₹1,400 crores and EBITDA from ₹128 crores to ₹275 crores. Total cumulative CAPEX for expansion projects is ₹400+ crores. The company has invested ₹115 crores for stake acquisition in HORCL for rail connectivity. ESG initiatives include 100% carbon neutrality target by 2040, 500+ EVs and CNG trucks introduction, and 50,000+ people benefited in community development.",
            "Sentiment": "positive",
            "PublishDate": 1758799067012,
            "Source": "stock"
        },
        {
            "Title": "Allcargo Terminals Issues New ISIN for 1.32 Crore Fully Convertible Warrants to Promoters",
            "Summary": "Allcargo Terminals Limited has issued a new International Securities Identification Number (ISIN: INE0NN713017) for the allotment of 1,32,00,000 fully convertible warrants to Promoters/Promoter Group. The warrants are priced at ₹29 per warrant, comprising a face value of ₹2 and a premium of ₹27 each. The company received confirmation of the new ISIN from National Securities Depository Limited on September 15, 2025, and from Central Depository Services Limited on September 24, 2025. This follows their earlier intimation dated September 5, 2025, regarding the warrant allotment.",
            "Sentiment": "neutral",
            "PublishDate": 1758787123954,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Terminals Limited Incorporates Wholly Owned Subsidiary ATL FTWZ Private Limited",
            "Summary": "Allcargo Terminals Limited has incorporated a wholly owned subsidiary named ATL FTWZ Private Limited effective September 18, 2025. The company completed the incorporation process and disclosed this information to the National Stock Exchange of India Limited and BSE Limited. The disclosure was made in accordance with Regulation 30 of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015. The company referenced a previous letter dated August 11, 2025 regarding this matter.",
            "Sentiment": "neutral",
            "PublishDate": 1758194703309,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Terminals Reports 9% Monthly Growth in CFS Volumes for August 2025",
            "Summary": "Allcargo Terminals Limited reported CFS volumes of 56.8 thousand TEUs in August 2025, representing a 9% increase from July 2025 and a 6% increase compared to August 2024. The company submitted this monthly operational update to the National Stock Exchange of India and BSE Limited. The data shows consistent growth trajectory with volumes rising from 52.3 thousand TEUs in July 2025 to the current level.",
            "Sentiment": "positive",
            "PublishDate": 1757942225558,
            "Source": "stock"
        },
        {
            "Title": "Allcargo Terminals Allots 1.32 Crore Fully Convertible Warrants to Promoters for Rs 382.8 Crores",
            "Summary": "Allcargo Terminals Limited's Board approved the allotment of up to 1.32 crore fully convertible warrants on a preferential basis to promoters and promoter group members. The warrants are priced at Rs 29 per warrant with a premium of Rs 27, raising approximately Rs 382.8 crores. The allotment follows shareholder approval dated August 14, 2025, and stock exchange approvals from BSE and NSE on August 28, 2025. The promoters have deposited 25% of the total consideration as required. Major allottees include Shashi Kiran Janardhan Shetty (1.16 crore warrants), Arathi Shetty (5.85 lakh warrants), Adarsh Sudhakar Hegde (3.62 lakh warrants), Priya Adarsh Hegde (15,276 warrants), and The Shloka Shetty Trust (5.93 lakh warrants). Upon conversion, the promoter group's collective shareholding will increase from 65.82% to 67.52%.",
            "Sentiment": "positive",
            "PublishDate": 1757072231446,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Terminals Reports Q1 FY26 Results with 22% Growth in EBITDA per TEU",
            "Summary": "Allcargo Terminals Limited handled 1,51,100 TEUs in Q1 FY26, generating revenue of INR187 crores compared to INR190 crores in Q1 FY25. EBITDA excluding other income stood at INR35 crores versus INR30 crores in the previous year quarter. The company achieved EBITDA per TEU of INR2,292, marking 22% year-on-year growth. Net profit was INR9 crores compared to INR10 crores in Q1 FY25. The company is executing a three-year strategic plan to handle 1 million laden TEUs, with capacity expansion projects at Mundra and Farukhnagar requiring estimated capex of INR280 crores. Management announced a proposal to raise INR38 crores through fully convertible warrants to fund growth initiatives. The company operates at 85-90% capacity utilization across seven facilities with current annual capacity of 8.3 lakh TEUs, targeting expansion to 13 lakh TEUs. Market share is estimated at 12-12.5% in CFS markets across five locations including Nhava Sheva, Mundra, Chennai, Kolkata, and Dadri.",
            "Sentiment": "positive",
            "PublishDate": 1755518532651,
            "Source": "earnings"
        },
        {
            "Title": "Allcargo Terminals Receives GST Order for Rs 25.29 Crore Tax Demand with Interest and Penalty",
            "Summary": "Allcargo Terminals Limited received an order from the Commissioner of GST & Central Excise, Chennai South Commissionerate, levying tax, interest, and penalty under Section 74 of the CGST Act. The Commissioner denied the benefit of exemption under Serial No. 54(e) and 24B of Notification No. 12/2017-Central Tax (Rate) and confirmed a GST demand of Rs 25,28,98,222 along with applicable interest and penalty. The company received the order on August 11, 2025. Management believes the company has strong merits to defend its position and plans to file an appeal within statutory timelines. No provision has been considered in financial results, and the company expects no impact on operations or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1755008815484,
            "Source": "stock"
        },
        {
            "Title": "Allcargo Terminals Reports CFS Volumes of 52.3 Thousand TEUs in July 2025",
            "Summary": "Allcargo Terminals Limited reported Container Freight Station (CFS) volumes of 52.3 thousand TEUs for July 2025, compared to 48.7 thousand TEUs in June 2025. The company submitted this monthly operational update to the National Stock Exchange of India and BSE Limited. The data shows monthly volume fluctuations over the past year, with July 2024 recording 47.7 thousand TEUs and peak volumes of 54.3 thousand TEUs achieved in July 2024.",
            "Sentiment": "positive",
            "PublishDate": 1755002718951,
            "Source": "stock"
        },
        {
            "Title": "Allcargo Terminals Plans 65% Capacity Expansion to Reach 1 Million TEU by FY28",
            "Summary": "Allcargo Terminals has announced plans to increase its capacity by 65% by FY28, targeting a handling capacity of 1 million TEU (Twenty-foot Equivalent Units). The company has outlined a comprehensive growth strategy to achieve this expansion goal.",
            "Sentiment": "positive",
            "PublishDate": 1754929853455,
            "Source": "stock"
        },
        {
            "Title": "Allcargo Terminals Reports Mixed Q1 Results with Higher EBITDA but Lower Revenue",
            "Summary": "Allcargo Terminals reported Q1 EBITDA of 346 million rupees compared to 300 million rupees year-over-year, with EBITDA margin improving to 18.48% from 15.83%. However, the company's consolidated net profit declined to 91 million rupees from 93 million rupees year-over-year, while revenue decreased to 1.87 billion rupees from 1.89 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1754923084034,
            "Source": "earnings"
        },
        {
            "Title": "Allcargo Terminals Extends Chennai Land Lease Term Sheet with Venkatesh Coke and Power Until September 2025",
            "Summary": "Allcargo Terminals Limited has extended its term sheet with Venkatesh Coke and Power Limited for a proposed land lease arrangement in Chennai until September 23, 2025. The extension covers a 30-acre land parcel that the company is evaluating for capacity expansion in its Container Freight Station and Inland Container Depot business. The lease terms include an annual rental of Rs. 9 crores with a 15% escalation every three years, plus a security deposit equivalent to 6 months rent. The parties are not related to promoters or group companies, and this does not constitute a related party transaction. The extended term sheet remains valid until execution of the final lease agreement or September 23, 2025, whichever comes first.",
            "Sentiment": "neutral",
            "PublishDate": 1753447942397,
            "Source": "stock"
        },
        {
            "Title": "Allcargo Terminals Ltd: Plans Rs 38.28 Crore Fundraise via Convertible Warrants",
            "Summary": "Allcargo Terminals Ltd (ATL) plans to raise Rs 38.28 crore by issuing 1.32 crore fully convertible warrants to promoters/promoter group. The funds will support ATL's three-year expansion plans, including new CFS and ICD facilities. The company aims to increase its annual capacity from 8.3 lakh TEUs to over 13 lakh TEUs in the next three years.",
            "Sentiment": "positive",
            "PublishDate": 1752594345000,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Terminals Raises 382.8 Million Rupees Through Warrant Issuance",
            "Summary": "Allcargo Terminals has raised 382.8 million rupees by issuing warrants. No further details about the terms of the warrants or the purpose of the fundraising were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752583451000,
            "Source": "default"
        },
        {
            "Title": "Allcargo Terminals: June CFS Volumes Decline 4.5% Month-on-Month",
            "Summary": "Allcargo Terminals reported Container Freight Station volumes of 48,700 TEUs for June 2025, a 4.5% decline from May. The company is undergoing restructuring to separate international and domestic businesses, with the international business expected to be listed separately within 2-3 months.",
            "Sentiment": "neutral",
            "PublishDate": 1752237932000,
            "Source": "result"
        },
        {
            "Title": "Allcargo Terminals Reports CFS Volume for June 2025",
            "Summary": "Allcargo Terminals reported a Container Freight Station (CFS) volume of 48,700 Twenty-foot Equivalent Units (TEUs) in June 2025. This represents a slight decrease compared to the volume reported in May of the same year.",
            "Sentiment": "neutral",
            "PublishDate": 1752233064000,
            "Source": "default"
        },
        {
            "Title": "Allcargo Terminals to Review Fundraising Options on July 15",
            "Summary": "Allcargo Terminals has announced that it will review fundraising options on July 15. The company has not provided any further details about the nature or scope of the potential fundraising activities.",
            "Sentiment": "neutral",
            "PublishDate": 1752065613000,
            "Source": "default"
        },
        {
            "Title": "AllCargo Terminals Reports Q4 FY23 Financial Results",
            "Summary": "AllCargo Terminals announced its Q4 FY23 financial results. The company's EBITDA increased to 335 million rupees from 267 million rupees year-over-year, with EBITDA margin improving to 18.03% from 14.67%. However, the company reported a consolidated net loss of 18 million rupees, compared to a loss of 88 million rupees in the same quarter last year. Revenue for Q4 stood at 1.86 billion rupees, slightly up from 1.81 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1747233208000,
            "Source": "result"
        },
        {
            "Title": "Allcargo Terminals Reports 5% Increase in CFS Volumes for March 2025",
            "Summary": "Allcargo Terminals announced that its Container Freight Station (CFS) volumes for March 2025 reached 51,200 TEUs (Twenty-foot Equivalent Units), representing a 5% increase compared to February 2025.",
            "Sentiment": "positive",
            "PublishDate": 1744762217000,
            "Source": "default"
        },
        {
            "Title": "Allcargo Terminals Reports 5% Increase in CFS Volumes for March 2025",
            "Summary": "Allcargo Terminals has announced that its Container Freight Station (CFS) volumes for March 2025 reached 51,200 TEUs (Twenty-foot Equivalent Units), representing a 5% increase compared to February 2025.",
            "Sentiment": "positive",
            "PublishDate": 1744718752000,
            "Source": "result"
        },
        {
            "Title": "Allcargo Terminals Reports 10% Decline in CFS Volumes for February 2025",
            "Summary": "Allcargo Terminals has announced that its Container Freight Station (CFS) volumes for February 2025 were 48,500 TEUs (Twenty-foot Equivalent Units), representing a 10% decrease compared to January 2025.",
            "Sentiment": "negative",
            "PublishDate": 1742367143000,
            "Source": "result"
        },
        {
            "Title": "Allcargo Terminals to Acquire 15% Stake in SML",
            "Summary": "Allcargo Terminals (ATL) has signed an agreement to acquire a 15% stake in SML. As part of the deal, ATL will issue 6,364,800 equity shares at a price of 42.40 rupees each.",
            "Sentiment": "neutral",
            "PublishDate": 1741651470000,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Terminals to Acquire 15% Stake in SML",
            "Summary": "Allcargo Terminals Limited (ATL) has signed an agreement to acquire a 15% stake in SML. As part of the deal, ATL will issue 6,364,800 equity shares at a price of 42.40 rupees each.",
            "Sentiment": "neutral",
            "PublishDate": 1741610422000,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Terminals Reports Strong CFS Volume Growth in January 2025",
            "Summary": "Allcargo Terminals announced that its Container Freight Station (CFS) volumes reached 53,800 TEUs in January 2025. This represents a 4% increase compared to December 2024 and an 11% year-over-year growth versus January 2024. The company attributes this strong performance to robust export activity.",
            "Sentiment": "positive",
            "PublishDate": 1739838630000,
            "Source": "result"
        },
        {
            "Title": "Allcargo Terminals Reports Strong CFS Volume Growth in January 2025",
            "Summary": "Allcargo Terminals announced robust Container Freight Station (CFS) volumes for January 2025, reaching 53,800 TEUs. This represents a 4% increase compared to December 2024 and an 11% year-over-year growth versus January 2024. The company attributes this strong performance to increased export activity.",
            "Sentiment": "positive",
            "PublishDate": 1739792091000,
            "Source": "result"
        },
        {
            "Title": "AllCargo Terminals Reports Improved Q3 EBITDA and Margin",
            "Summary": "AllCargo Terminals has announced its Q3 financial results, showing improvement in both EBITDA and EBITDA margin compared to the same period last year. The company's EBITDA increased to 325 million rupees from 293 million rupees year-over-year. Additionally, the EBITDA margin expanded to 17.34% from 15.82% in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739196170000,
            "Source": "earnings"
        },
        {
            "Title": "AllCargo Terminals Reports Q3 FY24 Financial Results",
            "Summary": "AllCargo Terminals has announced its Q3 financial results. The company reported a consolidated net profit of 118 million rupees, down from 146 million rupees in the same quarter last year. Revenue for the quarter increased slightly to 1.87 billion rupees from 1.8 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1739196165000,
            "Source": "earnings"
        },
        {
            "Title": "Allcargo Terminals Signs Solar Power Purchase Agreement",
            "Summary": "Allcargo Terminals has entered into a Power Purchase Agreement with Amokha Green Energy to procure solar power on a group captive basis. The company has committed to consuming a minimum of 80% of 3 lakh units of electricity per year from this renewable source.",
            "Sentiment": "positive",
            "PublishDate": 1738197136000,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Terminals Signs Solar Power Purchase Agreement",
            "Summary": "Allcargo Terminals has entered into a Power Purchase Agreement with Amokha Green Energy to procure solar power on a group captive basis. The company has committed to consuming a minimum of 80% of 3 lakh units of electricity per year from this renewable source.",
            "Sentiment": "positive",
            "PublishDate": 1738161271000,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Terminals Receives Letter of Acceptance for Solar Power Procurement",
            "Summary": "Allcargo Terminals has announced that it has received a Letter of Acceptance for solar power procurement on a group captive basis. This move suggests the company is taking steps towards adopting renewable energy sources, which could potentially lead to cost savings and improved environmental sustainability for its operations.",
            "Sentiment": "positive",
            "PublishDate": 1738109737000,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Terminals Receives Letter of Acceptance for Solar Power Procurement",
            "Summary": "Allcargo Terminals has announced that it has received a Letter of Acceptance for solar power procurement on a group captive basis. This move suggests the company is taking steps towards adopting renewable energy sources for its operations.",
            "Sentiment": "positive",
            "PublishDate": 1738073197000,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Terminals Reports 8% Growth in CFS Volumes for December 2024",
            "Summary": "Allcargo Terminals announced that their Container Freight Station (CFS) volumes reached 51.7 in December 2024, representing an 8% increase compared to the previous month. The company noted that this growth aligns with overall port volume trends and marks the highest volume for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737591073000,
            "Source": "result"
        },
        {
            "Title": "Allcargo Terminals Reports Strong CFS Volume Growth in December 2024",
            "Summary": "Allcargo Terminals announced that its Container Freight Station (CFS) volumes in December 2024 reached 51.7, representing an 8% growth compared to the previous month. The company stated that volumes have rebounded in December, marking the highest level for the quarter, aligning with overall port volume trends.",
            "Sentiment": "positive",
            "PublishDate": 1737551082000,
            "Source": "result"
        },
        {
            "Title": "Allcargo Terminals Board Meeting to Consider Issuance of Shares or Securities",
            "Summary": "Allcargo Terminals has announced a board meeting scheduled for January 17th. The primary agenda of this meeting is to consider the issuance of shares or other securities. This decision could potentially impact the company's capital structure and may be of interest to current and prospective investors.",
            "Sentiment": "neutral",
            "PublishDate": 1736853554000,
            "Source": "corporate_action"
        },
        {
            "Title": "Allcargo Terminals Reports Mixed CFS Volume Performance in November 2024",
            "Summary": "Allcargo Terminals announced its Container Freight Station (CFS) volumes for November 2024. The company reported 47,700 TEUs (Twenty-foot Equivalent Units), which represents a 4% decrease compared to October 2024 but a 1% increase compared to November 2023.",
            "Sentiment": "neutral",
            "PublishDate": 1734396825000,
            "Source": "result"
        },
        {
            "Title": "Allcargo Terminals Reports Mixed CFS Volumes for November 2024",
            "Summary": "Allcargo Terminals' Container Freight Station (CFS) volumes for November 2024 were 47,700 TEUs. This represents a 4% decrease compared to October 2024, but a 1% increase compared to November 2023.",
            "Sentiment": "neutral",
            "PublishDate": 1734348307000,
            "Source": "result"
        }
    ]
}