{
    "Symbol": "ATLASCYCLE",
    "ISIN": "INE446A01025",
    "News": [
        {
            "Title": "Atlas Cycles Board Approves Land Sale Extension",
            "Summary": "Atlas Cycles (Haryana) Limited board approves extension till March 31, 2026 for execution of sale deed for 20 acres Sonepat land. Company has received ₹30 crore with another ₹30 crore due by March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768548195780,
            "Source": "stocks"
        },
        {
            "Title": "Atlas Cycles Reports Q3FY26 Loss of ₹1.50 Crore",
            "Summary": "Atlas Cycles (Haryana) Limited posted a net loss of ₹1.50 crore for Q3FY26, compared to a profit of ₹0.27 crore in Q3FY25. Revenue declined 31.11% YoY to ₹1.52 crore amid challenging market conditions.",
            "Sentiment": "negative",
            "PublishDate": 1768547722787,
            "Source": "co_actions_results"
        },
        {
            "Title": "Atlas Cycles Board Meeting Set for January 16, 2026",
            "Summary": "Atlas Cycles (Haryana) Limited announces board meeting scheduled for January 16, 2026, to review and approve Q3FY26 unaudited financial results for quarter ending December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767943284908,
            "Source": "co_actions_results"
        },
        {
            "Title": "Atlas Cycles Reports Leadership Changes and Quarterly Results",
            "Summary": "Atlas Cycles (Haryana) Limited announced unaudited financial results for the quarter and half year ended September 30, 2025, reporting a net loss of Rs 238.69 lakhs for the quarter compared to a profit of Rs 874.79 lakhs in the same period last year. The company underwent significant leadership changes as Chander Mohan Dhall resigned from his positions as Whole-time Director and Chief Financial Officer effective November 12, 2025, and was simultaneously appointed as Chief Executive Officer from November 13, 2025. Satya Prakash Dangwal was appointed as the new Chief Financial Officer. Dhall, aged 64, holds an M.Com degree and CMA qualification, and has been with Atlas Cycles since 1996 with over two decades of experience in accounts and finance. Dangwal is a commerce graduate with over 35 years of experience in accounts and finance, including 30 years with Atlas Cycles since joining in 1994.",
            "Sentiment": "neutral",
            "PublishDate": 1762951117177,
            "Source": "corporate_governance"
        },
        {
            "Title": "Atlas Cycles Extends Land Sale Deadline to January 2026",
            "Summary": "Atlas Cycles (Haryana) Limited has granted an extension to the buyer for executing the sale deed of 20 acres of land located in Sonepat, Haryana. The new deadline is January 31, 2026, following the buyer's request dated October 30, 2025. This extends the timeline beyond the previous deadline of September 5, 2025. The company has indicated it will provide further updates on any material developments regarding this land sale transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1761920428776,
            "Source": "corporate_action"
        },
        {
            "Title": "Atlas Cycles Reports Widening Losses and Revenue Decline in Q1 Results",
            "Summary": "Atlas Cycles (Haryana) Limited reported a net loss of ₹158.38 lakhs for the quarter ended June 30, 2025, significantly higher than the ₹45.74 lakhs loss in the same period last year. Revenue from operations declined to ₹198.27 lakhs from ₹238.94 lakhs year-over-year, while total income dropped to ₹213.71 lakhs from ₹471.56 lakhs. The bicycle manufacturer operates in a single reportable segment and maintained its paid-up equity share capital at ₹325.19 lakhs. Auditors issued a modified conclusion highlighting that the company has not provided for interest on overdue payments to creditors and has defaulted on Inter Corporate Loan repayment. The auditors noted that losses were understated by ₹24.75 lakhs due to non-provision of interest liability on the defaulted loan.",
            "Sentiment": "negative",
            "PublishDate": 1754915973831,
            "Source": "earnings"
        }
    ]
}