{
    "Symbol": "ATLANTAELE",
    "ISIN": "INE0Z4F01028",
    "News": [
        {
            "Title": "Atlanta Electricals gets Crisil A/Stable rating reaffirmed",
            "Summary": "Atlanta Electricals Limited receives reaffirmed Crisil A/Stable long-term and Crisil A1 short-term ratings for enhanced bank facilities of Rs. 1460 crores, up from Rs. 910 crores.",
            "Sentiment": "positive",
            "PublishDate": 1770802365099,
            "Source": "stocks"
        },
        {
            "Title": "Atlanta Electricals Wins Orders Worth ₹288 Crores",
            "Summary": "Atlanta Electricals Limited secured five orders totaling ₹288 crores from KPTCL and Datta Power Infra, boosting order book to ₹2,787 crores with execution timeline of 12 months.",
            "Sentiment": "positive",
            "PublishDate": 1769697148749,
            "Source": "co_actions_results"
        },
        {
            "Title": "Atlanta Electricals Q3 FY26 Revenue Surges 80% YoY",
            "Summary": "Atlanta Electricals reports strong Q3 FY26 results with revenue at INR472 crores, up 80% YoY, EBITDA at INR91 crores with 19.4% margin, and record order book of INR2,451 crores.",
            "Sentiment": "positive",
            "PublishDate": 1769523149530,
            "Source": "co_actions_results"
        },
        {
            "Title": "Atlanta Electricals Q3FY26: Revenue Surges 80%, EBITDA Up 120%",
            "Summary": "Atlanta Electricals reported Q3FY26 revenue of ₹472 crores (80% YoY growth) and EBITDA of ₹91 crores (120% YoY growth) with record order book of ₹2,451 crores, driven by new Vadod facility contributions.",
            "Sentiment": "positive",
            "PublishDate": 1768814525498,
            "Source": "co_actions_results"
        },
        {
            "Title": "Atlanta Electricals revises Q3FY26 earnings call link",
            "Summary": "Atlanta Electricals Limited has revised the conference call link for its January 20, 2026 earnings call due to technical issues with the original pre-registration system.",
            "Sentiment": "neutral",
            "PublishDate": 1768406750395,
            "Source": "co_actions_results"
        },
        {
            "Title": "Atlanta Electricals Secures ₹297.71 Crore Orders from Gujarat Energy Transmission Corporation",
            "Summary": "Atlanta Electricals Limited received two orders worth ₹297.71 crores from Gujarat Energy Transmission Corporation Limited for supplying 25 transformers including power transformers and auto transformers. The orders reinforce the company's position as a trusted partner in the Indian power sector and support India's power infrastructure development needs.",
            "Sentiment": "positive",
            "PublishDate": 1764150450753,
            "Source": "order&deals"
        },
        {
            "Title": "Atlanta Electricals Reports Zero Deviation in IPO Fund Utilization for Q2 FY26",
            "Summary": "Atlanta Electricals Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing no deviation from stated IPO objectives for its Rs. 400 crore public offering. The company utilized Rs. 59.37 crore toward working capital requirements while Rs. 340.63 crore remains unutilized and parked in fixed deposits and monitoring accounts.",
            "Sentiment": "neutral",
            "PublishDate": 1763205512734,
            "Source": "corporate_action"
        },
        {
            "Title": "Atlanta Electricals Approves Rs 65 Crore Capex for New Manufacturing Facility",
            "Summary": "Atlanta Electricals Limited's Board approved a capital expenditure of Rs 65 crore for setting up a new manufacturing facility dedicated to Inverter Duty Transformers. The company also approved its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The Board meeting was held on November 11, 2025, and concluded within 16 minutes. The company manufactures power and special duty transformers and went public in September 2025, listing on BSE and NSE with an IPO of 53.11 lakh equity shares at Rs 754 per share.",
            "Sentiment": "positive",
            "PublishDate": 1762895862536,
            "Source": "earnings"
        },
        {
            "Title": "Atlanta Electricals Reports Strong Q2 Growth with 12% Rise in Net Profit",
            "Summary": "Atlanta Electricals reported quarterly net profit of 302 million rupees compared to 268.7 million rupees in the same period last year. Revenue increased to 3.17 billion rupees from 2.7 billion rupees year-over-year. EBITDA rose to 555 million rupees from 419.8 million rupees, while EBITDA margin improved to 17.51% from 15.53% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762874153959,
            "Source": "earnings"
        },
        {
            "Title": "Atlanta Electricals Reports 5.1% Revenue Growth in Debut Earnings Call Post-IPO",
            "Summary": "Atlanta Electricals Limited reported quarterly results with revenue increasing 5.1% year-on-year to Rs. 315 crores from Rs. 300 crores in the previous corresponding period. EBITDA grew 17.8% with margin at 15.5%, while PAT grew 25.3% with PAT margin at 9.9%. The company completed acquisition of BTW-Atlanta Transformers India Private Limited, now renamed Atlanta Trafo Private Limited, adding 15,000 MVA capacity. Total manufacturing capacity now stands at 63,060 MVA across five facilities. Order book stands at Rs. 1,584 crores with strong execution visibility. The company received credit rating upgrade to Crisil A stable and Crisil A1. Management expects newly added facilities to contribute significantly to top line in the second half of the year. The company won a Rs. 183 crores order for 400 kV class transformers from a private customer.",
            "Sentiment": "positive",
            "PublishDate": 1761567767946,
            "Source": "earnings"
        },
        {
            "Title": "Atlanta Electricals Reports 17.8% EBITDA Growth in Q1FY26 with Rs 1,584 Cr Order Book",
            "Summary": "Atlanta Electricals Limited reported Q1FY26 consolidated revenue of Rs 315.11 crore, up 5.1% year-over-year from Rs 299.92 crore. EBITDA grew 17.8% to Rs 48.77 crore with margins expanding 170 basis points to 15.5%. Profit after tax increased 25.3% to Rs 31.14 crore with PAT margin at 9.88%. The company maintains an order book of Rs 1,584 crore as of June 2025. Atlanta Electricals completed acquisition of BTW Atlanta Transformers India Pvt. Ltd. effective August 11, 2025, adding 15,000 MVA capacity and bringing total installed capacity to 63,060 MVA across five manufacturing facilities. CRISIL upgraded the company's long-term rating to CRISIL A/Stable from CRISIL BBB+/Positive and short-term rating to CRISIL A1 from CRISIL A2. The transformer manufacturer operates facilities in Gujarat and Karnataka, having supplied 4,400 transformers totaling 94,000 MVA across India.",
            "Sentiment": "positive",
            "PublishDate": 1760720429678,
            "Source": "earnings"
        },
        {
            "Title": "Atlanta Electricals Reports Strong Q1 Performance with 25% Jump in Net Profit",
            "Summary": "Atlanta Electricals delivered robust quarterly results with net profit rising to 311 million rupees from 249 million rupees year-over-year. Revenue increased to 3.2 billion rupees compared to 3 billion rupees in the same period last year. The company's EBITDA grew significantly to 538 million rupees from 414 million rupees year-over-year, while EBITDA margin expanded to 17.1% from 13.8% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1760677662147,
            "Source": "earnings"
        },
        {
            "Title": "Atlanta Electricals Reports First Post-IPO Quarterly Results with Net Profit of Rs 44.66 Crores",
            "Summary": "Atlanta Electricals Limited reported its first quarterly results after listing, showing net profit of Rs 44.66 crores for the quarter ended June 30, 2025. Revenue from operations stood at Rs 411.49 crores. The company completed its IPO on September 29, 2025, raising Rs 687.34 crores through offering of 53.11 lakh equity shares at Rs 754 per share. The company is engaged in manufacturing power and special duty transformers. Atlanta Electricals signed an agreement to acquire 90% stake in BTW-Atlanta Transformers India Private Limited for Rs 164.42 crores on June 13, 2025, with the acquisition completed in August 2025. The company's shares are listed on BSE under scrip code 544527 and NSE under symbol ATLANTAELE.",
            "Sentiment": "positive",
            "PublishDate": 1760677643482,
            "Source": "earnings"
        },
        {
            "Title": "Atlanta Electricals Secures Rs 183.54 Crore Order from BNC Power Projects for EHV Equipment Supply",
            "Summary": "Atlanta Electricals Limited received a purchase order worth Rs 183.54 crore from BNC Power Projects Ltd. for supplying extra-high voltage equipment to the RSDCL-Pugal site. The order includes a mix of 315 MVA, 400 KV and 100 MVA, 132 KV transformers, along with a 400 KV bus reactor. The project encompasses design, manufacturing, testing and supply, with deliveries scheduled after engineering and drawing approvals. Managing Director Niral Patel described it as a marquee win that provides multi-quarter execution visibility and supports steady manufacturing run-rate, improving capacity utilization across their Anand facilities. Atlanta Electricals is a transformer manufacturer with over 30 years of experience, having supplied 4,400 transformers totaling 94,000 MVA across 19 states and three union territories.",
            "Sentiment": "positive",
            "PublishDate": 1760631940969,
            "Source": "order&deals"
        }
    ]
}