{
    "Symbol": "ATMASTCO",
    "ISIN": "INE05DH01017",
    "News": [
        {
            "Title": "Atmastco shares surge 17% on defence facility launch",
            "Summary": "Atmastco Limited's stock jumped 17% after announcing the inauguration of its new defence manufacturing facility on January 24, 2026, strengthening its defence operations despite recent revenue decline.",
            "Sentiment": "positive",
            "PublishDate": 1769065318367,
            "Source": "stocks"
        },
        {
            "Title": "ATMASTCO Partners With Russian Firm for Welding Tech",
            "Summary": "ATMASTCO Limited announces strategic partnership with Welding Technologies LLC from Russia to develop specialized welding technology in India over a 15-year period.",
            "Sentiment": "positive",
            "PublishDate": 1766060802518,
            "Source": "stocks"
        },
        {
            "Title": "Atmastco Begins Trial Production at Defence Subsidiary's New Bhilai Factory",
            "Summary": "Atmastco has commenced trial production at its subsidiary Atmastco Defence's new manufacturing facility in Bhilai. The company has a market capitalization of Rs 560 crore.",
            "Sentiment": "positive",
            "PublishDate": 1759481147279,
            "Source": "stock"
        },
        {
            "Title": "Atmastco Secures ₹36.97 Crore Purchase Orders from L&T-MHI Power Boilers",
            "Summary": "Atmastco has received purchase orders worth ₹36.97 crores from L&T-MHI Power Boilers for fabrication materials. The execution will be based on order terms. The company currently has a market capitalization of ₹500 crores.",
            "Sentiment": "positive",
            "PublishDate": 1757491330213,
            "Source": "order&deals"
        },
        {
            "Title": "Atmastco Defence Systems Manufacturing Unit Nears Completion",
            "Summary": "Atmastco has announced that its Defence Systems Manufacturing Unit is approaching completion. The company expects to begin trial production at this new facility by April 2025, marking a significant milestone in its expansion into the defense sector.",
            "Sentiment": "positive",
            "PublishDate": 1742429044000,
            "Source": "corporate_action"
        }
    ]
}