{
    "Symbol": "ATULAUTO",
    "ISIN": "INE951D01028",
    "News": [
        {
            "Title": "Atul Auto Responds to BSE Query on Volume Surge",
            "Summary": "Atul Auto clarifies to BSE that recent trading volume increase is market-driven, confirms compliance with disclosure norms under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770105677799,
            "Source": "stocks"
        },
        {
            "Title": "Atul Auto Appoints Paul Zachariah as President",
            "Summary": "Atul Auto Limited announces the appointment of Mr. Paul Zachariah as President - Sales & Marketing, effective February 02, 2026. He brings 37 years of industry experience.",
            "Sentiment": "positive",
            "PublishDate": 1770035992651,
            "Source": "stocks"
        },
        {
            "Title": "Atul Auto Reports 30% Sales Growth in January",
            "Summary": "Atul Auto achieved total sales of 3,606 units in January, marking a significant 30.09% year-on-year growth compared to 2,772 units in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1770017003894,
            "Source": "stocks"
        },
        {
            "Title": "Atul Auto Gets Credit Rating Reaffirmation from CRISIL",
            "Summary": "CRISIL reaffirmed Atul Auto's credit ratings with BBB+/Stable for long-term and A2 for short-term bank facilities worth Rs.66.04 crore, maintaining stable outlook for the three-wheeler manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1769602838091,
            "Source": "stocks"
        },
        {
            "Title": "Atul Auto Appoints BBM & Associates as Internal Auditors",
            "Summary": "Atul Auto Limited has appointed M/s. BBM & Associates, Chartered Accountants as Internal Auditors for FY26, effective January 15, 2026, following Board approval on Audit Committee recommendation.",
            "Sentiment": "neutral",
            "PublishDate": 1768471467979,
            "Source": "stocks"
        },
        {
            "Title": "Atul Auto December 2025 Sales Jump 39% to 3,602 Units",
            "Summary": "Atul Auto reported strong December 2025 sales growth with 3,602 units sold compared to 2,583 units in December 2024, marking a significant 39.45% year-on-year increase in three-wheeler vehicle sales.",
            "Sentiment": "positive",
            "PublishDate": 1767249654592,
            "Source": "stocks"
        },
        {
            "Title": "Atul Auto Independent Director Resigns Immediately",
            "Summary": "Atul Auto Limited announces immediate resignation of Independent Director Shri Ramesh Chandra Maheshwari on December 31, 2025, citing personal reasons and professional commitments.",
            "Sentiment": "neutral",
            "PublishDate": 1767186648789,
            "Source": "stocks"
        },
        {
            "Title": "Atul Auto Reports November 2025 Three-Wheeler Sales Performance",
            "Summary": "Atul Auto Limited submitted its three-wheeler vehicle sales figures for November 2025 to BSE and NSE as part of its monthly sales update disclosure. The sales data includes performance metrics for both domestic and export segments, with vehicles manufactured by subsidiary Atul Greentech Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1764571392146,
            "Source": "stock"
        },
        {
            "Title": "Atul Auto Shares Jump 14% as Quarterly Profit Surges 70% Year-on-Year",
            "Summary": "Atul Auto shares rose 14% following strong quarterly results. The commercial three-wheeler manufacturer reported consolidated net profit of Rs 9.2 crore, up 70% from Rs 5.4 crore in the same quarter last year. Revenue from operations grew 10% to Rs 200 crore compared to Rs 182 crore previously. On a sequential basis, profit after tax increased 210% from Rs 2.9 crore in the previous quarter, while revenue jumped 31% from Rs 153 crore. The company sold 9,248 units during the quarter, up from 6,929 units in the previous quarter and 8,850 units in the year-ago period. Vijay Kedia holds a 21% stake in Atul Auto, valued at Rs 286 crore, making it his largest portfolio holding. The company operates manufacturing facilities in Gujarat with annual production capacity of 1,20,000 vehicles. Despite the recent gains, shares remain below their 50-day and 200-day moving averages and have declined 17% over the past year.",
            "Sentiment": "positive",
            "PublishDate": 1762855534176,
            "Source": "earnings"
        },
        {
            "Title": "Atul Auto Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Atul Auto Limited announced its quarterly results for the period ended September 30, 2025. The company sold 8,817 three-wheelers in the quarter compared to 8,471 units in the same period last year. Total revenue from operations increased to Rs 16,572 lakhs from Rs 14,645 lakhs year-over-year. However, the company reported a net loss of Rs 264 lakhs for the quarter compared to a profit of Rs 407 lakhs in the previous year same quarter. On a consolidated basis, the company posted a net profit of Rs 827 lakhs for the quarter versus Rs 457 lakhs in the corresponding quarter last year. For the half-year period, consolidated revenue reached Rs 35,295 lakhs with net profit of Rs 1,033 lakhs. The results were approved by the Board of Directors at their meeting held on November 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762848235167,
            "Source": "earnings"
        },
        {
            "Title": "Atul Auto Reports 25% Jump in Q2 Net Profit to 119 Million Rupees",
            "Summary": "Atul Auto reported a net profit of 119 million rupees in Q2, up from 95 million rupees in the same period last year. The company's EBITDA increased to 181 million rupees from 154 million rupees year-over-year. EBITDA margin improved to 10% compared to 9.39% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762847712563,
            "Source": "earnings"
        },
        {
            "Title": "Atul Auto Reports October 2025 Three-Wheeler Sales Performance",
            "Summary": "Atul Auto Limited submitted its three-wheeler vehicle sales figures for October 2025 to stock exchanges. The company provided domestic and export sales data, with a note indicating that some figures include sales from its subsidiary Atul Greentech Private Limited. The sales update was communicated by Managing Director Neeraj J Chandra to BSE and NSE as part of regular disclosure requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1761976559407,
            "Source": "stock"
        },
        {
            "Title": "Atul Auto Reports 4.2% Increase in September Sales to 3,503 Units",
            "Summary": "Atul Auto sold 3,503 units in September, representing an increase from 3,361 units sold in the same month last year. This marks a year-over-year growth of 142 units in monthly sales volume.",
            "Sentiment": "positive",
            "PublishDate": 1759300568307,
            "Source": "stock"
        },
        {
            "Title": "Atul Auto Settles Trademark Dispute with Exxon Mobil, Pays Rs 10 Lakh Settlement",
            "Summary": "Atul Auto Limited and its subsidiary Atul Greentech Private Limited settled a trademark infringement lawsuit with Exxon Mobil Corporation through mediation at Delhi High Court. The suit was disposed of on September 18, 2025, following an agreement between both parties. Under the settlement terms, Atul Greentech agreed to stop using trademarks 'MOBILI' and 'MOBILI SWAP' for electric vehicles, withdraw its trademark application for 'Mobili' in class 12, and destroy related branding materials. The subsidiary will pay Exxon Mobil Rs 10 lakh as a one-time settlement amount for full closure of the dispute. Atul Auto's management expects no major financial impact beyond the settlement expense, as the subsidiary has already adopted new trademarks 'ATUL RIK EV', 'ATUL RIK TWIN' and 'ATUL RIK SWAP' and made necessary amendments to approval certificates.",
            "Sentiment": "neutral",
            "PublishDate": 1758290257766,
            "Source": "stock"
        },
        {
            "Title": "Atul Auto Expects Better Growth in ICE Three-Wheeler Business Driven by Export Orders and Domestic Demand",
            "Summary": "Atul Auto anticipates stronger growth in the coming months, driven by export demand and repeat orders in its Internal Combustion Engine three-wheeler business. The company's President of Finance, Jitendra V Adhia, expects better performance than the current growth rate. Atul Auto's ICE three-wheeler sales have risen 12-13% this year, with total units sold reaching 22,188 in FY25 compared to 16,439 in FY24, marking a 35% year-on-year increase. Total company sales reached 34,012 units in FY25 versus 26,039 units in the previous year. The company is shifting focus from L3 to L5 category vehicles, with L5 expansion planned for the second half after achieving stable sales volumes. While L5 profitability is currently lower, margins are expected to improve through reduced component costs and increased localization. Atul Auto is expanding its export presence across Africa, Latin America, and recently appointed a distributor in Sri Lanka.",
            "Sentiment": "positive",
            "PublishDate": 1757055419435,
            "Source": "stock"
        },
        {
            "Title": "Atul Auto Surges 14% Following GST Reduction on Three-Wheelers",
            "Summary": "Atul Auto's stock jumped over 14% to Rs 497.60 after the government reduced GST on three-wheelers from 28% to 18% as part of GST 2.0 reforms. The tax cut also applies to two-wheelers up to 350cc and four-wheelers up to 1,200cc with length under 4,000mm. Investor Vijay Kedia holds a 20.91% stake in Atul Auto through 58 lakh shares worth Rs 286 crore, making it his largest equity holding. Despite the recent surge, the stock remains down 20% year-to-date and 31% over one year. Atul Auto reported strong quarterly results with consolidated net profit rising 34% year-on-year to Rs 7 crore and revenue growing 31% to Rs 212 crore.",
            "Sentiment": "positive",
            "PublishDate": 1756980344636,
            "Source": "stock"
        },
        {
            "Title": "Atul Auto Reports 6.8% Growth in August Sales to 3,026 Units",
            "Summary": "Atul Auto reported sales of 3,026 units in August, representing an increase from 2,834 units sold in the same month last year. This reflects a year-over-year growth in monthly sales volume for the automotive company.",
            "Sentiment": "positive",
            "PublishDate": 1756708928796,
            "Source": "stock"
        },
        {
            "Title": "Atul Auto Independent Director Jaichander Swaminathan Retires After Completing Second Term",
            "Summary": "Jaichander Swaminathan has retired from his position as Independent Director of Atul Auto Limited, effective August 24, 2025. His retirement follows the completion of his second consecutive term as an Independent Director. The company acknowledged his valuable contribution and guidance during his tenure as director.",
            "Sentiment": "neutral",
            "PublishDate": 1756195818514,
            "Source": "corporate_governance"
        },
        {
            "Title": "Atul Auto Independent Director Mohan Jit Walia to Retire After Completing Second Term",
            "Summary": "Shri Mohan Jit Walia, an Independent Director of Atul Auto Limited, will retire on August 08, 2025, upon completion of his second consecutive term as Independent Director. His retirement will be effective from the close of business hours on that date. The company has acknowledged his valuable contributions and guidance during his tenure as Independent Director.",
            "Sentiment": "neutral",
            "PublishDate": 1754636782966,
            "Source": "corporate_governance"
        },
        {
            "Title": "Atul Auto Reports Strong Q1 Performance with Net Profit More Than Doubling",
            "Summary": "Atul Auto delivered robust quarterly results with consolidated net profit surging to 30 million rupees from 13 million rupees in the same period last year. Revenue grew to 1.53 billion rupees compared to 1.35 billion rupees year-over-year. The company's EBITDA increased to 100 million rupees from 76 million rupees, while EBITDA margin improved to 6.55% from 5.6% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754553228404,
            "Source": "earnings"
        },
        {
            "Title": "Atul Auto Reports 5.7% Growth in July Sales to 2,717 Units",
            "Summary": "Atul Auto recorded total sales of 2,717 units in July, representing an increase from 2,570 units in the same period last year. This reflects a year-over-year growth of approximately 5.7% in monthly sales volume.",
            "Sentiment": "positive",
            "PublishDate": 1754029352782,
            "Source": "stock"
        },
        {
            "Title": "Vijay Kedia's Atul Auto Holdings Drop Rs 71 Crore as Stock Falls 20% Year-to-Date",
            "Summary": "Vijay Kedia's portfolio has declined by Rs 71 crore from his Atul Auto holdings this year, as the stock fell over 20% year-to-date. Atul Auto, Kedia's largest single equity holding by value, dropped 39% from its 52-week high of Rs 755 to close at Rs 457.75. Kedia holds over 58 lakh shares representing a 20.91% stake worth Rs 265 crore through his name and Kedia Securities Private Limited. The three-wheeler manufacturer will announce quarterly results on August 7. Analysts note the stock trades near technical support levels with a buying range of Rs 410-460, though valuations remain stretched with a P/E ratio of 57.91 versus sector average of 19.93. The company reported strong performance in its January-March quarter with 34% growth in net profit to Rs 7 crore and 31% revenue growth to Rs 212 crore.",
            "Sentiment": "negative",
            "PublishDate": 1753678510826,
            "Source": "stock"
        },
        {
            "Title": "Atul Auto Schedules Board Meeting on August 7, 2025 for Quarterly Financial Results",
            "Summary": "Atul Auto Limited has scheduled a Board of Directors meeting on August 7, 2025 to consider and approve unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company has closed its trading window for securities until 48 hours after the announcement of these quarterly results, in accordance with insider trading regulations and the company's internal code for monitoring trading by insiders.",
            "Sentiment": "neutral",
            "PublishDate": 1753277862406,
            "Source": "corporate_action"
        },
        {
            "Title": "Atul Auto in Talks to Reduce GST on Tractors and Farm Equipment",
            "Summary": "Atul Auto is reportedly in discussions to lower the Goods and Services Tax (GST) rate from 12% to 5% for tractors and farm equipment. This potential tax reduction could have significant implications for the agricultural machinery sector.",
            "Sentiment": "positive",
            "PublishDate": 1752651960000,
            "Source": "default"
        },
        {
            "Title": "Atul Auto Reports Increase in June Sales",
            "Summary": "Atul Auto has reported sales of 2,705 units for June, showing an increase from 2,628 units in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1751359259000,
            "Source": "default"
        },
        {
            "Title": "Atul Auto Reports Increase in May Sales",
            "Summary": "Atul Auto has reported total sales of 2,502 units for May, compared to 2,331 units in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1748844838000,
            "Source": "default"
        },
        {
            "Title": "Atul Auto Reports Q4 FY2023 Financial Results",
            "Summary": "Atul Auto has released its Q4 FY2023 financial results. The company's EBITDA increased to 151 million rupees from 133 million rupees year-over-year. However, the EBITDA margin decreased to 7.16% from 8.31% in the same period. Consolidated net profit rose to 72 million rupees from 53 million rupees year-over-year and 78 million rupees quarter-over-quarter. Revenue for Q4 grew to 2.1 billion rupees from 1.6 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1746875355000,
            "Source": "result"
        },
        {
            "Title": "Atul Auto Reports Increase in April Sales",
            "Summary": "Atul Auto has reported total sales of 1,725 units in April, compared to 1,692 units in the same month last year, showing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1746144599000,
            "Source": "default"
        },
        {
            "Title": "Atul Auto Reports Increase in April Sales",
            "Summary": "Atul Auto, an Indian automotive company, reported total sales of 1,725 units in April, compared to 1,692 units in the same month last year. This represents a year-over-year increase in sales.",
            "Sentiment": "positive",
            "PublishDate": 1746086051000,
            "Source": "default"
        },
        {
            "Title": "Atul Greentech Partners with Amara Raja for EV Batteries and Chargers",
            "Summary": "Atul Greentech, a subsidiary of Atul Auto, has formed a partnership with Amara Raja to supply electric vehicle (EV) batteries and chargers. This collaboration aims to strengthen Atul Greentech's position in the electric vehicle market by leveraging Amara Raja's expertise in battery technology.",
            "Sentiment": "positive",
            "PublishDate": 1744701759000,
            "Source": "corporate_action"
        },
        {
            "Title": "Atul Auto: Targeting Pre-Covid Sales by FY26, Expanding EV Production",
            "Summary": "Atul Auto aims to surpass pre-Covid sales levels in FY26 and increase annual production to over 100,000 vehicles in 3-5 years. The company expects EV sales to grow from 25% to 30-40% of total sales in the current fiscal year, focusing on both L3 and L5 EV categories. Atul Auto offers fixed and swappable battery options for L5 EVs, with in-house manufacturing for fixed batteries and a partnership with Honda for swappable ones.",
            "Sentiment": "positive",
            "PublishDate": 1743833076000,
            "Source": "normal_news"
        },
        {
            "Title": "Atul Auto Reports 18% Year-over-Year Increase in March Sales",
            "Summary": "Atul Auto, an Indian automobile manufacturer, has reported total sales of 3,693 units for March, compared to 3,128 units in the same month last year. This represents an 18% year-over-year increase in sales volume.",
            "Sentiment": "positive",
            "PublishDate": 1743491920000,
            "Source": "result"
        },
        {
            "Title": "Atul Auto Files Winding Up Petition Against Echo Motors",
            "Summary": "Atul Auto has filed a winding up petition against Echo Motors and Automobiles with the Company Tribunal. This legal action suggests Atul Auto is seeking to dissolve Echo Motors, potentially due to unpaid debts or other financial disputes.",
            "Sentiment": "neutral",
            "PublishDate": 1741876716000,
            "Source": "corporate_action"
        },
        {
            "Title": "Atul Auto Reports 26% Increase in February Sales",
            "Summary": "Atul Auto Limited announced total sales of 2,900 units for February, compared to 2,300 units in the same month last year, representing a year-over-year increase of 26%.",
            "Sentiment": "positive",
            "PublishDate": 1740813954000,
            "Source": "result"
        },
        {
            "Title": "Atul Auto Reports Q3 EBITDA Growth",
            "Summary": "Atul Auto reported an increase in its Q3 EBITDA to 167 million rupees, up from 137 million rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 8.54% from 8.88% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739009344000,
            "Source": "earnings"
        },
        {
            "Title": "Atul Auto Reports Increased Q3 Profit and Revenue",
            "Summary": "Atul Auto has announced its Q3 financial results. The company's consolidated net profit increased to 78 million rupees from 51 million rupees year-over-year. Revenue also saw growth, rising to 1.95 billion rupees from 1.54 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739009338000,
            "Source": "earnings"
        },
        {
            "Title": "Atul Auto Reports Increase in December Sales",
            "Summary": "Atul Auto, an Indian automobile manufacturer, has reported total sales of 2,583 units in December, compared to 2,503 units in the same month of the previous year. This represents a year-over-year increase in sales.",
            "Sentiment": "positive",
            "PublishDate": 1735718053000,
            "Source": "result"
        },
        {
            "Title": "Atul Auto Reports 24.6% Increase in November Sales",
            "Summary": "Atul Auto, an Indian automobile manufacturer, has reported total sales of 2,828 units for November, compared to 2,270 units in the same month last year. This represents a year-over-year increase of 24.6% in sales volume.",
            "Sentiment": "positive",
            "PublishDate": 1733123197000,
            "Source": "result"
        },
        {
            "Title": "Atul Auto Reports Q2 Revenue Growth",
            "Summary": "Atul Auto, an Indian automotive company, has reported its second quarter revenue for the current fiscal year. The company's revenue increased to 1.64 billion rupees, up from 1.39 billion rupees in the same quarter of the previous year, representing year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731139679000,
            "Source": "result"
        },
        {
            "Title": "Atul Auto Reports Q2 EBITDA and Margin",
            "Summary": "Atul Auto announced its Q2 financial results. The company's EBITDA increased to 154 million rupees from 148 million rupees year-over-year. However, the EBITDA margin decreased to 9.39% from 10.65% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731139658000,
            "Source": "result"
        },
        {
            "Title": "Atul Auto Reports Q2 Net Profit Increase",
            "Summary": "Atul Auto Limited has reported a net profit of 95 million rupees for the second quarter, compared to 85 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731139613000,
            "Source": "result"
        },
        {
            "Title": "Atul Auto Reports Significant Increase in October Sales",
            "Summary": "Atul Auto, an automotive company, has reported total sales of 3,818 units for October, compared to 3,060 units in the same month last year. This represents a year-over-year increase of approximately 24.8%.",
            "Sentiment": "positive",
            "PublishDate": 1730452018000,
            "Source": "result"
        },
        {
            "Title": "Atul Auto Projects Strong Financial Performance for FY25",
            "Summary": "<p>Atul Auto anticipates a <span class='positive'>return on capital employed (ROCE) exceeding 30%</span> in the fiscal year 2025. The company also expects a <span class='positive'>significant earnings recovery</span> starting from <b>FY25</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728295704000,
            "Source": "normal_news"
        },
        {
            "Title": "Atul Auto Cautious on Electric 3-Wheeler Sales Due to Infrastructure Challenges",
            "Summary": "<p>Atul Auto has adopted a <span class='neutral'>cautious approach</span> to <span class='neutral'>electric 3-wheeler</span> sales. The company cites a <span class='negative'>lack of charging infrastructure</span> and <span class='negative'>standardized chargers</span> as <b>significant hurdles</b> impacting <span class='neutral'>electric vehicle</span> sales in this segment.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728295659000,
            "Source": "normal_news"
        }
    ]
}