{
    "Symbol": "ATUL",
    "ISIN": "INE100A01010",
    "News": [
        {
            "Title": "ATUL Reports 47% Jump in Q3 Consolidated Net Profit",
            "Summary": "ATUL Limited delivered strong quarterly performance with consolidated net profit rising to ₹1.60 billion in Q3 from ₹1.09 billion in the same period last year, marking a significant 47% year-on-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1769159743452,
            "Source": "co_actions_results"
        },
        {
            "Title": "Atul Ltd: Buy Rating Maintained at ₹8,500 Target",
            "Summary": "Brokerage maintains Buy rating on Atul Ltd with ₹8,500 target after facility visit, despite trimming FY27E EPS by 5% due to US export challenges and margin pressures.",
            "Sentiment": "positive",
            "PublishDate": 1767967526305,
            "Source": "stocks"
        },
        {
            "Title": "Atul Limited faces ₹16.77 cr GST demand and penalty",
            "Summary": "Atul Limited received GST demand of ₹8.33 crores and penalty of ₹8.44 crores from Joint Commissioner GST & Central Excise, Surat for alleged incorrect input tax credit availment during FY 2018-19 to 2022-23.",
            "Sentiment": "negative",
            "PublishDate": 1767257678933,
            "Source": "stocks"
        },
        {
            "Title": "Atul Limited Board Meeting Set for January 23, 2026",
            "Summary": "Atul Limited announces Board of Directors meeting on January 23, 2026 to consider Q3 FY26 financial results for quarter ending December 31, 2025. Trading window closed from January 1-25, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766747104111,
            "Source": "co_actions_results"
        },
        {
            "Title": "Atul Ltd Clarifies Volume Movement to Stock Exchanges",
            "Summary": "Atul Limited responds to BSE inquiry on volume movement, stating no pending announcements and attributing market activity to market-driven factors following recent acquisition disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1765867381180,
            "Source": "stocks"
        },
        {
            "Title": "Atul Ltd Acquires 26.30% Stake in Torrent Urja 39 Pvt Ltd",
            "Summary": "Atul Ltd announces acquisition of 26.30% equity stake in Torrent Urja 39 Pvt Ltd for ₹13.86 crores to meet regulatory requirements for captive hybrid power usage in Gujarat.",
            "Sentiment": "positive",
            "PublishDate": 1765622870685,
            "Source": "co_actions_results"
        },
        {
            "Title": "Atul Limited Shareholders Approve Appointment of Shantanu Khosla as Independent Director",
            "Summary": "Atul Limited completed a postal ballot process where shareholders unanimously approved the appointment of Shantanu Khosla as Independent Director for five consecutive years with 100% of valid votes in favor. The e-voting process concluded on November 29, 2025, with 330 members voting in favor and only 17 against, demonstrating strong shareholder support for the board appointment.",
            "Sentiment": "positive",
            "PublishDate": 1764589151146,
            "Source": "corporate_governance"
        },
        {
            "Title": "Atul Limited Appoints Shantanu Khosla as Independent Director for Five-Year Term",
            "Summary": "Atul Limited has appointed Mr. Shantanu Khosla as Additional Director and Independent Director for a five-year term effective October 17, 2025, subject to shareholder approval. The appointment was made based on the recommendation of the Nomination and Remuneration Committee. Khosla brings four decades of experience in the Fast-Moving Consumer Goods industry, having held senior positions with Procter & Gamble across multiple countries and served as Head of Procter & Gamble India for 15 years. He was the Managing Director of Crompton Greaves Consumer Electricals Ltd from 2015 to 2024 and currently serves as Non-executive Vice Chairman of the same company and Operating Partner at Advent, a private equity firm. Khosla holds a B.Tech from IIT Mumbai and a management diploma from IIM Kolkata. He has no relationships with other directors on Atul's board and holds no shares in the company.",
            "Sentiment": "positive",
            "PublishDate": 1760690337431,
            "Source": "corporate_governance"
        },
        {
            "Title": "Atul Limited Reports Strong Q2 FY2026 Results with 13.5% Revenue Growth",
            "Summary": "Atul Limited reported quarterly results for the period ended September 30, 2025. On a standalone basis, revenue from operations increased to ₹1,409.52 crore compared to ₹1,278.68 crore in the same quarter last year. Net profit after tax rose to ₹172.31 crore from ₹128.75 crore year-over-year. For the six-month period, standalone revenue grew to ₹2,714.08 crore from ₹2,486.19 crore, while net profit increased to ₹270.05 crore from ₹237.93 crore. On a consolidated basis, quarterly revenue reached ₹1,551.85 crore versus ₹1,392.83 crore in the previous year, with net profit at ₹182.37 crore compared to ₹139.53 crore. The company operates through three main segments: Life Science Chemicals, Performance and Other Chemicals, and Others. Basic earnings per share for the quarter stood at ₹58.53 on standalone basis and ₹60.88 on consolidated basis.",
            "Sentiment": "positive",
            "PublishDate": 1760689798622,
            "Source": "earnings"
        },
        {
            "Title": "Atul and Buckman Form 50:50 Joint Venture for Water Treatment Solutions in India and Sri Lanka",
            "Summary": "Atul and Buckman have established a strategic 50:50 joint venture to provide digitally-enabled water treatment solutions in India and Sri Lanka. The partnership aims to deliver next-generation water treatment technologies while supporting 'Make in India' initiatives and sustainability objectives.",
            "Sentiment": "positive",
            "PublishDate": 1754564836884,
            "Source": "order&deals"
        },
        {
            "Title": "EU Imposes Final Anti-Dumping Tariffs on Epoxy Resins from China, Taiwan, and Thailand",
            "Summary": "The European Union has set final anti-dumping tariffs on epoxy resins imported from China, Taiwan, and Thailand. This trade measure affects Atul, which operates in the chemicals sector.",
            "Sentiment": "neutral",
            "PublishDate": 1753759403149,
            "Source": "stock"
        },
        {
            "Title": "Atul Limited Publishes Unaudited Financial Results for First Quarter Ended June 30, 2025",
            "Summary": "Atul Limited published its unaudited standalone and consolidated financial results for the first quarter ended June 30, 2025 in national newspapers. The Board of Directors approved these results during a meeting held on July 18, 2025. The financial results were published in the Economic Times (English Daily) and Jai Hind (Gujarati Daily) on July 19, 2025. The company disclosed this publication to stock exchanges BSE and NSE as part of regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1753162121098,
            "Source": "earnings"
        },
        {
            "Title": "Atul Ltd: Q1 Profit Up 14%, Margin Contracts",
            "Summary": "Atul Ltd reported a 14% year-on-year increase in net profit to ₹128 crore for Q1 FY2026. Revenue rose 12% to ₹1,478 crore, while EBITDA grew 6% to ₹236 crore. However, EBITDA margin contracted to 16% from 16.9% year-on-year. The company's stock declined 2.19% following the announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1752826617000,
            "Source": "earnings"
        },
        {
            "Title": "ATUL Reports Q1 Financial Results",
            "Summary": "ATUL has reported its Q1 financial results. The company's EBITDA increased to 2.35 billion rupees from 2.23 billion rupees year-over-year. However, the EBITDA margin decreased to 15.93% from 16.89% in the same period. Revenue grew to 14.8 billion rupees from 13.2 billion rupees year-over-year. The consolidated net profit rose to 1.3 billion rupees from 1.12 billion rupees compared to the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1752825424000,
            "Source": "default"
        },
        {
            "Title": "Atul Ltd Reports 17% Increase in Consolidated Sales Volume",
            "Summary": "Atul Ltd has announced a 17% increase in its consolidated sales volume compared to the previous fiscal year 2023-24, as reported in their investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1746187495000,
            "Source": "default"
        },
        {
            "Title": "Atul Ltd: Q4 Profit Doubles, ₹25 Dividend Declared",
            "Summary": "Atul Ltd reported a 120% YoY increase in Q4 net profit to ₹130 crore, with revenue up 20% to ₹1,452 crore. EBITDA grew 51% to ₹223.4 crore, and margins improved to 15.4%. The company declared a final dividend of ₹25 per share for FY2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1745573913000,
            "Source": "earnings"
        },
        {
            "Title": "ATUL Reports Significant Increase in Q4 Consolidated Net Profit",
            "Summary": "ATUL Limited has reported a consolidated net profit of 1.27 billion rupees for the fourth quarter, compared to 584 million rupees in the same period last year, representing a substantial year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1745570446000,
            "Source": "result"
        },
        {
            "Title": "Atul Ltd. Block Trade: 104,959 Shares Sold for Rs. 57.75 Crores",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) involving Atul Ltd. Approximately 104,959 shares of the company were traded at a price of Rs. 5501.90 per share, resulting in a total transaction value of Rs. 57.75 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1741771791000,
            "Source": "block_deals"
        },
        {
            "Title": "Atul Ltd: Multibagger Stock Soars 13,720% in 16 Years",
            "Summary": "Atul Ltd's stock price has risen from ₹40.45 to ₹5,590 over 16 years, turning a ₹1 lakh investment into ₹1.38 crore. The company recently reported a 53% year-on-year increase in net profit for Q3 FY2024-25, with revenue up 24.5% and EBITDA margin improving to 16%.",
            "Sentiment": "positive",
            "PublishDate": 1740996167000,
            "Source": "earnings"
        },
        {
            "Title": "Atul Ltd: Q3 Profit Surges 53.28% YoY, Revenue Up 24.52%",
            "Summary": "Atul Ltd reported Q3 FY25 results with profit rising to ₹108.74 crore, up 53.28% YoY. Revenue increased by 24.52% YoY to ₹1416.83 crore. However, profit decreased 20.52% QoQ. EPS stood at ₹36.93, up 53.62% YoY. Analyst consensus recommends 'Hold'.",
            "Sentiment": "positive",
            "PublishDate": 1737786058000,
            "Source": "earnings"
        },
        {
            "Title": "Atul Ltd Reports Improved Q3 EBITDA and Margin",
            "Summary": "Atul Ltd has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 2.24 billion rupees from 1.52 billion rupees in the previous year. Additionally, the EBITDA margin expanded to 15.81% from 13.33% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1737709811000,
            "Source": "earnings"
        },
        {
            "Title": "Atul Ltd Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "Atul Ltd has announced its financial results for the third quarter, reporting a consolidated net profit of 1.09 billion rupees. This represents a substantial increase from the 709 million rupees reported in the same quarter of the previous year, indicating a year-over-year growth in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1737709645000,
            "Source": "earnings"
        },
        {
            "Title": "Atul Ltd Expands Liquid Epoxy Resin Capacity",
            "Summary": "Atul Limited has increased its liquid epoxy resin production capacity by 50,000 tonnes per annum (TPA). The expansion was completed with an investment of Rs. 200 crore, which was funded through the company's internal accruals.",
            "Sentiment": "positive",
            "PublishDate": 1730190598000,
            "Source": "corporate_action"
        },
        {
            "Title": "Atul Ltd Reports Strong Q2 Financial Performance",
            "Summary": "Atul Ltd has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 1.55 billion rupees to 2.43 billion rupees. Additionally, the EBITDA margin expanded from 13.00% to 17.44%.",
            "Sentiment": "positive",
            "PublishDate": 1729842932000,
            "Source": "result"
        },
        {
            "Title": "ATUL Reports Q2 Revenue Growth",
            "Summary": "ATUL, an Indian company, has reported its second quarter revenue for the current fiscal year. The company's revenue increased to 13.9 billion rupees, up from 11.9 billion rupees in the same quarter of the previous year, representing year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1729842891000,
            "Source": "result"
        },
        {
            "Title": "ATUL Reports Significant Increase in Q2 Consolidated Net Profit",
            "Summary": "ATUL Limited has reported a consolidated net profit of 1.37 billion rupees for the second quarter, compared to 903 million rupees in the same period last year, representing a substantial year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729842871000,
            "Source": "result"
        }
    ]
}