{
    "Symbol": "AUBANK",
    "ISIN": "INE949L01017",
    "News": [
        {
            "Title": "AU Small Finance Bank Gets RBI Nod for CEO Reappointment",
            "Summary": "AU Small Finance Bank receives RBI approval for Sanjay Agarwal's reappointment as MD & CEO for 3 years starting April 19, 2026, following earlier board and shareholder approvals.",
            "Sentiment": "positive",
            "PublishDate": 1770910365079,
            "Source": "stocks"
        },
        {
            "Title": "AU Small Finance Bank Sees ₹116.27 Cr Block Trade",
            "Summary": "AU Small Finance Bank witnessed a significant block trade worth ₹116.27 crores on NSE, involving approximately 1.19 million shares at ₹980.55 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769154137376,
            "Source": "co_actions_results"
        },
        {
            "Title": "Small finance banks poach talent for universal banking push",
            "Summary": "AU, Ujjivan, Suryoday, and Utkarsh Small Finance Bank are aggressively hiring senior executives from larger banks as they prepare for universal banking transition, with SFBs adding 26,736 employees in 2025.",
            "Sentiment": "positive",
            "PublishDate": 1769125513715,
            "Source": "stocks"
        },
        {
            "Title": "CITI Sets Buy Rating on AU Small Finance Bank",
            "Summary": "Citigroup initiates Buy recommendation for AU Small Finance Bank with target price of ₹1,150.00, signaling positive outlook for the small finance banking sector.",
            "Sentiment": "positive",
            "PublishDate": 1768967438950,
            "Source": "stocks"
        },
        {
            "Title": "AU Small Finance Bank Q3FY26 Results & Leadership Changes",
            "Summary": "AU Small Finance Bank reports Q3FY26 net profit of ₹667.66 crores, up 26.36% YoY, with strategic leadership restructuring including new director appointments and organizational changes.",
            "Sentiment": "positive",
            "PublishDate": 1768908966941,
            "Source": "co_actions_results"
        },
        {
            "Title": "AU Small Finance Bank auditor firm converts to LLP",
            "Summary": "AU Small Finance Bank's joint statutory auditor M S K A & Associates has converted to Limited Liability Partnership structure effective January 13, 2026, with no change to existing audit engagement.",
            "Sentiment": "neutral",
            "PublishDate": 1768570983059,
            "Source": "stocks"
        },
        {
            "Title": "AU Small Finance Bank Block Trade Worth ₹90.55 Cr",
            "Summary": "AU Small Finance Bank witnessed a significant block trade on NSE worth ₹90.55 crores involving 917,286 shares at ₹987.20 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768536579077,
            "Source": "co_actions_results"
        },
        {
            "Title": "AU Small Finance Bank Allots 2.22 Lakh Equity Shares",
            "Summary": "AU Small Finance Bank allotted 2,22,762 equity shares on January 14, 2026, following employee stock option exercises across five ESOP schemes, increasing paid-up capital to ₹7,47,40,34,800.",
            "Sentiment": "neutral",
            "PublishDate": 1768377435415,
            "Source": "co_actions_results"
        },
        {
            "Title": "AU Bank CEO: Balance sheet grew 10x in 9 years",
            "Summary": "Sanjay Agarwal highlights AU Small Finance Bank's tenfold growth over nine years despite navigating COVID-19, interest rate volatility, and NBFC sector challenges through strategic partnerships and technology adoption.",
            "Sentiment": "positive",
            "PublishDate": 1768315712540,
            "Source": "stocks"
        },
        {
            "Title": "DIIs Boost AU Small Finance Bank Stake to 32%",
            "Summary": "Domestic institutional investors increased their stake in AU Small Finance Bank from 20.13% to 31.91% by September 2025, driven by strong loan growth of 22% YoY and RBI universal banking approval.",
            "Sentiment": "positive",
            "PublishDate": 1768202302226,
            "Source": "stocks"
        },
        {
            "Title": "Small finance banks plan risk controls for 2026",
            "Summary": "Small finance banks hit by microfinance crisis are reducing unsecured lending share and increasing credit guarantee coverage to improve asset quality and prevent further deterioration.",
            "Sentiment": "neutral",
            "PublishDate": 1768179130827,
            "Source": "stocks"
        },
        {
            "Title": "AU Small Finance Bank Gets ESG Rating of 73 from NSE",
            "Summary": "AU Small Finance Bank Limited receives an ESG rating of 73 from NSE Sustainability for FY 2024-25, based on independent research and publicly available information without bank engagement.",
            "Sentiment": "positive",
            "PublishDate": 1767881068500,
            "Source": "stocks"
        },
        {
            "Title": "Small Finance Banks Lead Banking Job Creation in FY25",
            "Summary": "Small Finance Banks hired 26,736 employees in FY25, reaching a five-year high while private banks cut 7,257 jobs. SFBs' aggressive expansion driven by universal banking ambitions.",
            "Sentiment": "positive",
            "PublishDate": 1767661495790,
            "Source": "stocks"
        },
        {
            "Title": "AU Small Finance Bank Q3 Update Shows Strong Growth",
            "Summary": "AU Small Finance Bank reports robust Q3 FY26 performance with deposits rising 23.30% YoY to ₹1.38 lakh crore and advances growing 24.00% to ₹1.25 lakh crore, despite CASA ratio moderation.",
            "Sentiment": "positive",
            "PublishDate": 1767505014119,
            "Source": "co_actions_results"
        },
        {
            "Title": "AU Small Finance Bank Added to BSE Bankex Index",
            "Summary": "AU Small Finance Bank has been included in the BSE Bankex index rejig, with the addition valued at USD 10 million. The index reconstitution took effect at 3pm today.",
            "Sentiment": "positive",
            "PublishDate": 1766555746311,
            "Source": "stocks"
        },
        {
            "Title": "Au Small Finance Bank Gets Approval to Raise Foreign Investment Limit to 74%",
            "Summary": "Au Small Finance Bank received approval to increase its foreign investment limit from the current 49% to the maximum permissible limit of 74%. This regulatory approval allows the bank to attract higher foreign capital participation, potentially strengthening its funding base and growth prospects.",
            "Sentiment": "positive",
            "PublishDate": 1765322871620,
            "Source": "corporate_action"
        },
        {
            "Title": "AU Small Finance Bank Gets Credit Rating Reaffirmation from CARE Ratings",
            "Summary": "CARE Ratings reaffirmed AU Small Finance Bank's CARE AA: Stable rating for Long-Term Debt Instruments and Tier-II Bonds, and assigned the same rating to Infrastructure Bonds worth ₹1,000 crore. The bank's Short-term Instruments (Certificate of Deposits) maintained their CARE A1+ rating, reflecting the bank's position as India's largest small finance bank with consistent business growth and comfortable capitalization.",
            "Sentiment": "positive",
            "PublishDate": 1764606080953,
            "Source": "corporate_action"
        },
        {
            "Title": "AU Small Finance Bank Seeks Shareholder Approval for Board Changes and Executive Remuneration",
            "Summary": "AU Small Finance Bank has issued a postal ballot notice seeking member approval for appointment of two new independent directors, re-appointment of one independent director, and remuneration approval for Managing Director CEO Sanjay Agarwal and Whole Time Director Deputy CEO Uttam Tibrewal. The remote e-voting period runs from November 26, 2025 to December 25, 2025, with results to be declared by December 29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764083277907,
            "Source": "corporate_action"
        },
        {
            "Title": "AU Small Finance Bank Appoints New Independent Director",
            "Summary": "AU Small Finance Bank has appointed Narasinganallore Venkatesh Srinivasan as a Non-Executive Independent Director to its board. This board appointment strengthens the bank's governance structure with additional independent oversight.",
            "Sentiment": "positive",
            "PublishDate": 1763997695903,
            "Source": "corporate_governance"
        },
        {
            "Title": "AU Small Finance Bank Allots 3.11 Lakh Equity Shares Under Employee Stock Option Plans",
            "Summary": "AU Small Finance Bank's Nomination and Remuneration Committee approved allotment of 3,11,349 equity shares of face value Rs. 10 each following exercise of employee stock options across four ESOP schemes from 2016 to 2023. The bank's paid-up equity share capital will increase from Rs. 7,46,34,87,370 to Rs. 7,46,66,00,860 following this allotment.",
            "Sentiment": "neutral",
            "PublishDate": 1763986790529,
            "Source": "corporate_action"
        },
        {
            "Title": "AU Small Finance Bank Gets Rating Reaffirmation on Short-term Instruments, Tier II Bond Rating Withdrawn After Full Payment",
            "Summary": "India Ratings reaffirmed AU Small Finance Bank's IND A1+ rating on Certificate of Deposits worth INR 30 billion and withdrew the rating on Tier II bonds after the INR 5 billion instrument was paid in full. The rating agency highlighted the bank's fast-growing franchise with above-average profitability metrics and adequate capital buffers, though noted asset quality pressures in unsecured segments with gross NPA ratio increasing to 2.41%.",
            "Sentiment": "neutral",
            "PublishDate": 1763732305274,
            "Source": "corporate_action"
        },
        {
            "Title": "AU Small Finance Bank Sees Block Trade Worth Rs. 113.35 Crores on NSE",
            "Summary": "AU Small Finance Bank executed a block trade on the National Stock Exchange involving approximately 1,283,437 shares at a price of Rs. 883.20 per share. The total transaction value amounted to Rs. 113.35 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1762405523217,
            "Source": "order&deals"
        },
        {
            "Title": "AU Small Finance Bank Allots 76,959 Equity Shares Under Employee Stock Option Plans",
            "Summary": "AU Small Finance Bank has allotted 76,959 equity shares with a face value of Rs. 10 each following the exercise of Employee Stock Options across four ESOP schemes. The allotment includes 1,932 shares under ESOP 2016, 15,656 shares under ESOP 2018, 43,182 shares under ESOP 2020, and 16,189 shares under ESOP 2023. As a result of this allotment, the bank's paid-up equity share capital has increased from Rs. 7,46,27,17,780 to Rs. 7,46,34,87,370.",
            "Sentiment": "neutral",
            "PublishDate": 1761929363934,
            "Source": "corporate_action"
        },
        {
            "Title": "AU Small Finance Bank Deputy CEO Rajeev Yadav Resigns",
            "Summary": "Rajeev Yadav, Deputy CEO of AU Small Finance Bank Limited, resigned from his position on October 27, 2025, to pursue other opportunities. The bank accepted his resignation, and he was relieved from services at the close of business hours on October 31, 2025. Yadav had served with the bank for 18 months in his role as Deputy CEO and Senior Management Personnel.",
            "Sentiment": "neutral",
            "PublishDate": 1761908382205,
            "Source": "corporate_governance"
        },
        {
            "Title": "AU Small Finance Bank Sets Financial Targets: Credit Costs Under 1%, Loan Growth 2-2.5x GDP",
            "Summary": "AU Small Finance Bank has outlined its financial expectations and targets. The bank expects to maintain credit costs below 1% of average total assets for the year. It aims to achieve loan growth of 2-2.5 times nominal GDP and forecasts maintaining a cost-to-income ratio below 60%. These projections were shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1760931738700,
            "Source": "stock"
        },
        {
            "Title": "AU Small Finance Bank Targets 25% Credit Growth Through Retail Expansion and Digital Strategy",
            "Summary": "AU Small Finance Bank has outlined its growth strategy targeting 25% credit growth. The bank plans to expand into new retail segments while accelerating its digital lending capabilities. The strategy also includes strengthening CASA (Current Account Savings Account) mobilization efforts to support its growth objectives.",
            "Sentiment": "positive",
            "PublishDate": 1760718050587,
            "Source": "stock"
        },
        {
            "Title": "AU Small Finance Bank Reports Quarterly Results and Reappoints CEO for Three Years",
            "Summary": "AU Small Finance Bank announced its unaudited financial results for the quarter and half year ended September 30, 2025. The bank reported net profit of ₹1,142.73 crores for the half year and ₹571.21 crores for the quarter. Key financial metrics include gross NPAs at 2.41% of gross advances, net NPAs at 0.88% of net advances, and capital adequacy ratio at 19.42%. The bank's total income reached ₹10,412.91 crores for the half year. Additionally, the Board approved the re-appointment of Mr. Sanjay Agarwal as Managing Director & CEO for a three-year term from April 19, 2026 to April 18, 2029, subject to shareholder and RBI approval. The bank has received in-principle approval from RBI for voluntary transition to Universal Bank status.",
            "Sentiment": "positive",
            "PublishDate": 1760696852999,
            "Source": "earnings"
        },
        {
            "Title": "Au Small Finance Bank Reports Strong Growth in Deposits and Advances",
            "Summary": "Au Small Finance Bank reported a 20.8% year-over-year growth in deposits and a 22.4% increase in gross advances for Q2 FY26. The bank demonstrated solid expansion across its key business metrics during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1759709599328,
            "Source": "stock"
        },
        {
            "Title": "AU Small Finance Bank Reports Strong Growth with 20.8% Rise in Deposits",
            "Summary": "AU Small Finance Bank reported its performance for the quarter ended September 30, 2025. Total deposits increased by 20.8% year-on-year to ₹1,32,510 crores, while gross advances grew by 22.4% to ₹1,17,520 crores. The bank's CASA ratio stood at 29.4%, compared to 32.4% in the same period last year. The gross loan portfolio expanded by 17.0% year-on-year to ₹1,22,870 crores. CASA deposits grew by 9.7% to ₹38,960 crores. On a quarterly basis, total deposits increased by 3.8% and gross advances rose by 5.3%. The information is provisional and subject to review by the Audit Committee, Board of Directors, and Statutory Auditors.",
            "Sentiment": "positive",
            "PublishDate": 1759512348711,
            "Source": "earnings"
        },
        {
            "Title": "Small Finance Banks Face Microfinance Stress with One-Fifth of Loan Books at Risk",
            "Summary": "Three small finance banks - ESAF, Suryoday, and Utkarsh - are experiencing significant stress in their microfinance operations, with approximately 20% of their microloan portfolios at risk. Data from Sa-Dhan shows portfolios at risk for more than 30 days at 19.73% for ESAF, 22.76% for Suryoday, and 23.23% for Utkarsh as of June-end. All three banks maintain a high 45-55% share of unsecured microloans, contributing to deteriorating asset quality. ESAF sold ₹362 crore worth of loans to asset reconstruction companies and wrote off ₹371 crore in the June quarter. Both ESAF and Utkarsh reported losses during this period. Rating agencies have downgraded these banks, with CareEdge lowering ESAF's Tier 2 bonds to 'A-/negative' and Icra downgrading Utkarsh's subordinated debt by two notches to 'A/negative'. Utkarsh's gross NPA ratio increased to 11.4% from 9.4% in the previous quarter, while ESAF's gross NPA stood at 7.48% and Suryoday's at 8.5%. The continued asset quality deterioration and high credit costs are expected to impact profitability for the September quarter and full fiscal year.",
            "Sentiment": "negative",
            "PublishDate": 1759107431155,
            "Source": "stock"
        },
        {
            "Title": "AU Small Finance Bank Partners with Zaggle to Launch Co-branded Credit and Prepaid Cards",
            "Summary": "AU Small Finance Bank has entered into a strategic partnership with Zaggle Prepaid Ocean Services Limited to launch co-branded retail credit and prepaid cards. The partnership introduces retail credit cards with Third-Party Application Provider integration and personalized recommendation engine, focusing on smart spending, easy rewards, and tech-enabled convenience. The collaboration will also develop a commercial credit card portfolio, combining AU SFB's underwriting expertise with Zaggle's enterprise network. Additionally, the partnership includes co-branded prepaid cards for corporate clients integrated with Zaggle's Zatix platform for real-time expense management, offering tax-saving benefits across fuel, meals, and gifts through the Zaggle mobile app. Zaggle will also introduce AU SFB to its southern regional corporate network as primary banking franchise. AU SFB operates over 2,505 banking touchpoints across 21 states and 4 union territories, serving 1.16 crore customers. Zaggle has issued over 50 million prepaid cards and serves more than 3,500 corporate enterprise clients with a user base exceeding 3.3 million.",
            "Sentiment": "positive",
            "PublishDate": 1758538928562,
            "Source": "order&deals"
        },
        {
            "Title": "AU Small Finance Bank Launches AU KOSMO Credit Card with UPI Payment Feature",
            "Summary": "AU Small Finance Bank launched the AU KOSMO Credit Card in partnership with Kiwi, a Credit on UPI platform. Built on the RuPay network, the card enables credit payments via UPI at online and offline merchants without requiring a physical card. The product targets first-time credit users, young professionals, and tech-savvy consumers through digital onboarding. Key features include rewards on UPI payments, 1% fuel surcharge waiver, and no annual or renewal fees. The launch comes as UPI P2M payments reached ₹7.2 lakh crore in August, growing 26% year-over-year, while RuPay's credit card market share increased to nearly 12%. AU SFB operates over 2,500 banking touchpoints across 21 states and four union territories, with deposits of ₹1.27 lakh crore and loans of ₹1.17 lakh crore as of June 30. The card represents part of the bank's financial inclusion strategy across urban, semi-urban, and rural markets.",
            "Sentiment": "positive",
            "PublishDate": 1758181992877,
            "Source": "stock"
        },
        {
            "Title": "AU Small Finance Bank Block Trade Worth Rs. 66.30 Crores Executed on NSE",
            "Summary": "AU Small Finance Bank executed a block trade on the National Stock Exchange involving approximately 941,745 shares at Rs. 704.00 per share, totaling Rs. 66.30 crores in value.",
            "Sentiment": "neutral",
            "PublishDate": 1758084441560,
            "Source": "order&deals"
        },
        {
            "Title": "AU Small Finance Bank CFO Vimal Jain Passes Away Due to Cardiac Arrest",
            "Summary": "AU Small Finance Bank announced the death of Chief Financial Officer Vimal Jain on September 10, 2025, due to cardiac arrest. Jain had been with the bank since 2010, serving for over 15 years and playing a crucial leadership role in the Finance and Accounts function. The bank described him as a pillar of strength who contributed significantly through his vision and leadership during his tenure. AU Small Finance Bank is initiating steps for interim succession and will update regulators on further developments regarding the CFO position.",
            "Sentiment": "negative",
            "PublishDate": 1757492126990,
            "Source": "corporate_governance"
        },
        {
            "Title": "AU Small Finance Bank Shares Worth Rs. 71.09 Crores Traded in NSE Block Deal",
            "Summary": "AU Small Finance Bank executed a block trade on NSE involving approximately 1,007,817 shares at Rs. 705.35 per share, totaling Rs. 71.09 crores. The transaction represents a significant bulk trading activity for the small finance bank.",
            "Sentiment": "neutral",
            "PublishDate": 1757488516207,
            "Source": "order&deals"
        },
        {
            "Title": "Unity Bank and BharatPe Launch India's First EMI-Based Credit Card on RuPay Network",
            "Summary": "Unity Small Finance Bank and BharatPe have launched a credit card that allows customers to pay in full or convert purchases into equated monthly installments. The card operates on the RuPay network and was developed with the National Payments Corporation of India. Key features include EMI conversion for up to 12 months, rewards on EMI transactions redeemable through the BharatPe app, no joining or annual fees, and complimentary lounge access plus health check-ups. The card can be linked to UPI for payments across merchants nationwide. It targets both salaried and self-employed individuals, with applications processed digitally through the BharatPe app including onboarding, KYC verification, and credit eligibility checks.",
            "Sentiment": "positive",
            "PublishDate": 1756366786111,
            "Source": "order&deals"
        },
        {
            "Title": "AU Small Finance Bank to Launch 51 New Branches Nationwide on Independence Day",
            "Summary": "AU Small Finance Bank announced the launch of 51 new branches across India, scheduled to open on August 15, 2025. The expansion includes 30 liability branches and 21 Microfinance & Inclusive Banking branches, located in West Bengal, Gujarat, Telangana, Madhya Pradesh, Odisha, Rajasthan, and Tamil Nadu. The new branches will offer comprehensive financial services including deposits, payments, collection solutions, trade finance, insurance, investment products, and digital banking. The MFIB branches will specifically serve micro-enterprises and underserved segments. AU Small Finance Bank was the first to receive in-principle approval from the Reserve Bank of India to transition into a Universal Bank.",
            "Sentiment": "positive",
            "PublishDate": 1755181844759,
            "Source": "stock"
        },
        {
            "Title": "SMBC Asia Rising Fund Invests $7 Million in Shivalik Small Finance Bank",
            "Summary": "SMBC Asia Rising Fund, cofounded by Japan's Sumitomo Mitsui Banking Corporation, has acquired a 4.99% stake in Shivalik Small Finance Bank for $7 million. The investment values the bank at approximately ₹1,200 crore enterprise value. Existing investors including Accel, Quona, Lightspeed and Sorin Investments contributed an additional ₹40 crore, bringing the total equity raise to ₹100 crore. Shivalik, which transformed from a cooperative bank to a small finance bank in 2021, serves over 900,000 customers across 79 branches in 11 states. The funds will strengthen technology infrastructure and expand workforce in product, engineering, and operations. The capital infusion will increase the bank's capital adequacy ratio from 19% to 24% and support a targeted business growth of 35-40%. Shivalik reported revenue of ₹423 crore and crossed ₹6,700 crore in business size, with 90% of its business in secured lending.",
            "Sentiment": "positive",
            "PublishDate": 1755135302825,
            "Source": "order&deals"
        },
        {
            "Title": "AU Small Finance Bank Gets 18-Month Window to Transition to Universal Bank",
            "Summary": "The Reserve Bank of India has granted AU Small Finance Bank an 18-month period to complete its transition into a universal bank. The central bank has mandated that the 21.4% stake held by Managing Director Sanjay Agarwal, his family, and other promoters must be transferred to a non-financial holding company as the sole condition for the transition. AU Small Finance Bank was the first to apply for this transition following RBI's 2024 guidelines that provided clarity on the process. Chairman HR Khan noted that the bank has evolved from a non-banking finance company to a small finance bank and now to a universal bank, emphasizing that RBI requires experience before graduating to the next stage. The bank operates with a balance sheet larger than some small commercial banks and has invested in technology and talent to achieve universal bank scale operations.",
            "Sentiment": "positive",
            "PublishDate": 1754638003537,
            "Source": "stock"
        },
        {
            "Title": "AU Small Finance Bank Gets RBI's Initial Approval for Universal Banking License",
            "Summary": "AU Small Finance Bank has received initial approval from the Reserve Bank of India to transition into a universal bank. This approval represents a significant step in the bank's expansion plans, allowing it to offer a broader range of banking services beyond its current small finance banking operations.",
            "Sentiment": "positive",
            "PublishDate": 1754573546295,
            "Source": "stock"
        },
        {
            "Title": "AU Small Finance Bank Partners With SBI Life Insurance for Insurance Solutions",
            "Summary": "AU Small Finance Bank has entered into a partnership with SBI Life Insurance to offer comprehensive insurance solutions across India. The collaboration aims to provide wide-ranging insurance products to customers throughout the country.",
            "Sentiment": "positive",
            "PublishDate": 1754291880072,
            "Source": "order&deals"
        },
        {
            "Title": "AU Small Finance Bank Sees Block Trade Worth Rs. 52.63 Crores on NSE",
            "Summary": "AU Small Finance Bank executed a block trade on the National Stock Exchange involving approximately 705,463 shares at a price of Rs. 746.10 per share. The total transaction value amounted to Rs. 52.63 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1753943361971,
            "Source": "order&deals"
        },
        {
            "Title": "AU Small Finance Bank Designates Four Senior Executives as Senior Management Personnel",
            "Summary": "AU Small Finance Bank has categorized four senior executives as Senior Management Personnel effective July 26, 2025. The newly designated SMPs are Dhavan Shah (Head of Commercial Banking), Kapil Gupta (Head - Treasury & Financial Markets), Ankur Tripathi (Chief Information Officer), and Manoj Tibrewal (Head of Human Resources, Admin & Infra). The decision was approved by the bank's Board of Directors following recommendations from the Nomination and Remuneration Committee during their annual review of Senior Management Personnel categories. Shah and Gupta are recent hires who joined the bank in April 2025 and March 2025 respectively, bringing decades of experience from major banks including Yes Bank, HSBC, and Standard Chartered. Tripathi has been with the bank since March 2014, while Tibrewal has served since February 2009.",
            "Sentiment": "neutral",
            "PublishDate": 1753458368081,
            "Source": "corporate_governance"
        },
        {
            "Title": "AU Small Finance Bank Reports 16% PAT Growth Despite Margin Pressure and Elevated Credit Costs",
            "Summary": "AU Small Finance Bank delivered profit after tax of INR 581 crores for Q1 FY26, representing 16% year-on-year growth. The bank achieved strong deposit growth of 31% year-on-year to INR 1,27,000 crores and loan growth of 18% to INR 1,17,000 crores, despite a 23% decline in its unsecured book. Net interest margin compressed by 38 basis points to 5.4% from 5.8% in Q4, driven by reduced asset yields and lower investment yields. The bank maintained ROA at 1.5% despite margin pressure. Credit costs increased due to stress in the microfinance business, where collection efficiency dropped to 98.3% from 98.7%, and challenges in the southern mortgage portfolio. The bank revised its full-year credit cost expectation upward by 10-15 basis points to around 1% of average total assets. Management expects Q2 to be the bottom for margins and anticipates gradual improvement from Q3 onwards. The retail-secured assets segment, comprising 67% of the loan portfolio, grew 20% year-on-year, with the wheels business leading at 26% growth.",
            "Sentiment": "neutral",
            "PublishDate": 1753450838740,
            "Source": "earnings"
        },
        {
            "Title": "AU Small Finance Bank Shares Drop 7.5% on Asset Quality Concerns Despite 16% Profit Growth",
            "Summary": "AU Small Finance Bank's stock fell 7.51% to Rs 735.20, hitting its lowest level since June 6, marking the fourth consecutive session of decline. The drop occurred despite the bank reporting a 15.6% increase in net profit to Rs 581 crore in Q1FY26. Asset quality deteriorated with fresh slippages at 3.8% of loans due to stress in credit cards, microfinance, and commercial banking portfolios. Gross NPA increased to 2.47% from 2.28% quarter-on-quarter, while Net NPA rose to 0.88% from 0.74%. Provisions surged 88.6% year-on-year to Rs 533 crore. Management expects delays in MFI book recovery until the fourth quarter and anticipates credit card stress to remain elevated in the second quarter. Net Interest Income grew 6% to Rs 2,045 crore, and operating profit jumped 38% to Rs 1,312 crore. Trading volume reached 3.4 times the 30-day average. Among 34 analysts, 19 maintain 'buy' ratings, 7 recommend 'hold', and 8 suggest 'sell', with consensus price target implying 6.1% upside.",
            "Sentiment": "negative",
            "PublishDate": 1753076494312,
            "Source": "stock"
        },
        {
            "Title": "AU Small Finance Bank Shares Drop 7% Despite 16% Profit Growth on Margin Concerns",
            "Summary": "AU Small Finance Bank shares fell 7.3% to Rs 736.95 following mixed quarterly results. Net profit increased 16% to Rs 581 crore, driven by treasury gains, but core lending performance weakened. Net interest margin contracted 38 basis points to 5.4% due to rate cuts transmission. Asset quality deteriorated with gross non-performing assets ratio rising to 2.47% from 1.78% year-on-year, leading provisions to surge to Rs 533 crore from Rs 283 crore. The bank reported 38% growth in pre-provision operating profit at Rs 1,312 crore, supported by 59% jump in other income to Rs 811 crore. Gross loan portfolio expanded 18% to Rs 1.18 lakh crore while unsecured segments declined 23%. Total deposits grew 31% to Rs 1.28 lakh crore.",
            "Sentiment": "negative",
            "PublishDate": 1753074343938,
            "Source": "earnings"
        },
        {
            "Title": "AU Small Finance Bank Reports Mixed Asset Quality Results in Q1",
            "Summary": "AU Small Finance Bank's asset quality metrics showed a mixed performance in Q1. The bank's Gross Non-Performing Assets (GNPA) ratio increased to 2.47% from 2.28% quarter-on-quarter, while Net Non-Performing Assets (NNPA) ratio rose to 0.88% from 0.74% quarter-on-quarter. However, the bank's provisions decreased to 5.3 billion rupees from 6.35 billion rupees quarter-on-quarter, indicating lower provisioning requirements compared to the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1752923861019,
            "Source": "earnings"
        },
        {
            "Title": "AU Small Finance Bank Reports 16% Growth in Net Profit for Q1",
            "Summary": "AU Small Finance Bank reported a net profit of 5.8 billion rupees for Q1, representing a year-over-year increase from 5 billion rupees. The bank's revenue grew to 43.8 billion rupees compared to 37.7 billion rupees in the same period last year, marking significant growth across key financial metrics.",
            "Sentiment": "positive",
            "PublishDate": 1752923538601,
            "Source": "earnings"
        },
        {
            "Title": "AU Small Finance Bank Reports Q1 FY26 Update: Gross Advances Up 23.1%, CASA Deposits Rise 16.2%",
            "Summary": "AU Small Finance Bank has released its Q1 FY26 update, reporting significant growth in key financial metrics. The bank's gross advances increased by 23.1% year-over-year, reaching ₹1.11 lakh crore. CASA (Current Account Savings Account) deposits also saw growth, rising 16.2% year-over-year to ₹37,240 crore. However, the CASA ratio decreased to 29.2% from 32.9% in the previous year, indicating a shift in the composition of deposits.",
            "Sentiment": "positive",
            "PublishDate": 1751592999000,
            "Source": "default"
        },
        {
            "Title": "AU Small Finance Bank Reports Growth in Q1 FY26 Deposits and Loans",
            "Summary": "AU Small Finance Bank has reported its financial update for the first quarter of fiscal year 2026. The bank's deposits have increased by 31% year-over-year, while gross loans have grown by 18% compared to the same period last year. This indicates significant growth in both the bank's deposit base and lending activities.",
            "Sentiment": "positive",
            "PublishDate": 1751592749000,
            "Source": "default"
        }
    ]
}