{
    "Symbol": "AURIONPRO",
    "ISIN": "INE132H01018",
    "News": [
        {
            "Title": "Aurionpro Expands DTB Transaction Banking Partnership",
            "Summary": "Aurionpro Solutions announces expansion of multi-country transaction banking engagement with Diamond Trust Bank across Kenya, Uganda, and Tanzania using upgraded iCashpro platform.",
            "Sentiment": "positive",
            "PublishDate": 1770798254151,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aurionpro Solutions Withdraws Record Date",
            "Summary": "Aurionpro Solutions Limited has withdrawn the record date that was earlier intimated following a board meeting held on February 04, 2026, as disclosed under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770720017949,
            "Source": "stocks"
        },
        {
            "Title": "Aurionpro Solutions Projects Strong Cash Flow Performance",
            "Summary": "Aurionpro Solutions anticipates positive operating cash flow for the year, converting about 60% of EBITDA into cash, with transit margins expected to match banking software margins over time.",
            "Sentiment": "positive",
            "PublishDate": 1770349628384,
            "Source": "stocks"
        },
        {
            "Title": "Aurionpro Solutions Targets 30% Revenue Growth",
            "Summary": "Aurionpro Solutions announces ambitious growth targets of 30% revenue increase over the next few years while maintaining healthy EBITDA margins above 20%.",
            "Sentiment": "positive",
            "PublishDate": 1770349597503,
            "Source": "stocks"
        },
        {
            "Title": "Aurionpro Solutions Q3 Revenue Grows Despite Profit Dip",
            "Summary": "Aurionpro Solutions reported Q3 revenue growth to 3.7B rupees from 3.06B rupees YoY, while consolidated net profit declined to 421M rupees from 473M rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1770211820036,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aurionpro Solutions Shareholders Approve New Director",
            "Summary": "Aurionpro Solutions Limited shareholders overwhelmingly approved the appointment of Mr. Hong Guan Bernard Chew as Non-Executive Independent Director with 99.62% votes in favor through postal ballot.",
            "Sentiment": "positive",
            "PublishDate": 1770048973416,
            "Source": "stocks"
        },
        {
            "Title": "Aurionpro Solutions Wins IDBI Bank Data Center Deal",
            "Summary": "Aurionpro Solutions secures strategic data center contract with IDBI Bank for complete infrastructure upgrade while maintaining operational continuity in new partnership.",
            "Sentiment": "positive",
            "PublishDate": 1770016791387,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aurionpro Wins Mumbai Metro Platform Screen Door Order",
            "Summary": "Aurionpro Solutions secures multi-million dollar order from Titagarh Rail Systems for Platform Screen Door systems on Mumbai Metro Line 5, marking entry into safety-critical PSD solutions.",
            "Sentiment": "positive",
            "PublishDate": 1769496430266,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aurionpro Solutions Wins Vitreous Alliance Deal",
            "Summary": "Aurionpro Solutions secures partnership with Vitreous Alliance to provide secure omnichannel payment solutions featuring cloud-based, API-first architecture for enhanced transaction processing.",
            "Sentiment": "positive",
            "PublishDate": 1769143617738,
            "Source": "stocks"
        },
        {
            "Title": "Aurionpro wins major CSB Bank cash management mandate",
            "Summary": "Aurionpro Solutions secures multi-year, multi-million-dollar contract to implement next-generation cash management platform for Catholic Syrian Bank, with shares closing down 0.58% on Monday.",
            "Sentiment": "positive",
            "PublishDate": 1768809192894,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aurionpro Solutions Wins Major CSB Bank Contract",
            "Summary": "Aurionpro Solutions secures significant banking contract with CSB Bank, strengthening its position in India's banking technology sector and expanding its client portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1768798220968,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aurionpro Wins ₹150 Cr Delhi Metro AFC Contract",
            "Summary": "Aurionpro Solutions secures major contract from DMRC to implement Automated Fare Collection systems for Bhopal and Indore metro projects, valued at approximately ₹150 crore with five-year maintenance.",
            "Sentiment": "positive",
            "PublishDate": 1768208029289,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aurionpro wins ₹150 cr DMRC order for metro AFC systems",
            "Summary": "Aurionpro Solutions secures multi-year contract from DMRC to implement Automated Fare Collection systems for Bhopal and Indore Metro projects, strengthening its presence in India's metro rail network.",
            "Sentiment": "positive",
            "PublishDate": 1768203256276,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aurionpro Wins ₹150 Cr Metro AFC Systems Order",
            "Summary": "Aurionpro Solutions secures major order from DMRC for Automated Fare Collection systems implementation in Bhopal and Indore Metro projects, strengthening its smart mobility leadership position.",
            "Sentiment": "positive",
            "PublishDate": 1768198630118,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aurionpro Solutions Earnings Call Set for Feb 5",
            "Summary": "Aurionpro Solutions Limited has scheduled Q3 & 9M FY2026 earnings conference call for February 5, 2026 at 16:00 hrs IST to discuss financial performance for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767612220212,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aurionpro Solutions Wins ₹63 Cr Banking Order",
            "Summary": "Aurionpro Solutions secures major ₹63 crores contract from leading Singaporean bank to upgrade corporate lending platform for enhanced global lending operations and sustainable financing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1766462128951,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aurionpro Wins Major PSB Contract for iCashPro Platform",
            "Summary": "Aurionpro Solutions secures multi-year contract with leading Indian public sector bank for iCashPro platform implementation, covering software licensing, deployment, and maintenance services.",
            "Sentiment": "positive",
            "PublishDate": 1765946848998,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aurionpro Unveils AurionAI Banking Intelligence Platform",
            "Summary": "Aurionpro Solutions launches AurionAI, a domain-centric Enterprise AI platform for banking and financial services, featuring unified AI framework and deep banking intelligence capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1765424228616,
            "Source": "stocks"
        },
        {
            "Title": "Aurionpro Solutions Maintains ₹1,454.30 Share Price for Preferential Issue After Revised Valuation",
            "Summary": "Aurionpro Solutions obtained a revised valuation report incorporating the Price Earning Capacity Value (PECV) method as advised by stock exchanges during their review of the company's preferential equity issue proposal. The company confirmed that despite the additional valuation methodology, the issue price remains unchanged at ₹1,454.30 per equity share for the preferential allotment requiring shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1763796375624,
            "Source": "corporate_action"
        },
        {
            "Title": "Aurionpro's LexsiLabs Launches Orion-MSP AI Foundation Model for Enterprise Tabular Data",
            "Summary": "LexsiLabs, a research lab by Aurionpro Solutions, announced the launch of Orion-MSP, a tabular foundation model designed for enterprise-scale structured data predictions. The company also released TabTune, an open-source library for fine-tuning tabular foundation models. Orion-MSP uses multi-scale processing and block-sparse row-wise attention to deliver zero-shot predictions on enterprise data including transactions, customer records, and sensor telemetry. The model targets banks, insurers, and healthcare organizations that generate large volumes of structured data. Both Orion-MSP and TabTune are released under MIT license. Orion-MSP is available on HuggingFace and TabTune on GitHub. LexsiLabs operates in Mumbai, Paris, and London, focusing on AI alignment and interpretability research.",
            "Sentiment": "positive",
            "PublishDate": 1762920719835,
            "Source": "stock"
        },
        {
            "Title": "Aurionpro Solutions Reports 29% Revenue Growth in Q2FY26, Declares Second Interim Dividend",
            "Summary": "Aurionpro Solutions Limited reported strong quarterly results with revenue from operations reaching Rs. 357.67 crores in Q2FY26, representing a 29% year-over-year growth compared to Rs. 278.28 crores in Q2FY25. For the half-year period, revenue grew 29% to Rs. 694.49 crores from Rs. 539.90 crores in the previous year. The company's profit after tax increased 23% to Rs. 56 crores in Q2FY26. The Banking and Fintech segment reported 29% growth reaching Rs. 393 crores, while the Technology Innovation Group recorded 28% growth amounting to Rs. 301 crores for H1FY26. The Board declared a second interim dividend of Re. 1 per equity share (10% of face value of Rs. 10) for FY2025-26, with record date of November 10, 2025, and payment by December 3, 2025. Key operational highlights include securing major contracts with UCO Bank for AI-native cash management platform, a Rs. 250 crore contract from MMRDA for Mumbai Metro Lines 4 and 4A, and acquisition of 100% equity stake in InfraRisk SG Pte. Ltd. for USD 2 million.",
            "Sentiment": "positive",
            "PublishDate": 1762205005606,
            "Source": "earnings"
        },
        {
            "Title": "Aurionpro Secures Major Transaction Banking Deal with Indian Public Sector Bank",
            "Summary": "Aurionpro has secured a major deal in transaction banking with an Indian public sector bank. The company describes this as continuing its success in the sector.",
            "Sentiment": "positive",
            "PublishDate": 1759127958136,
            "Source": "stock"
        },
        {
            "Title": "Aurionpro Partners with DFCC Bank for AI Collaboration",
            "Summary": "Aurionpro has entered into a partnership with DFCC Bank focused on artificial intelligence initiatives. The collaboration represents a strategic alliance between the technology company and the banking institution to leverage AI capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1756701634334,
            "Source": "stock"
        },
        {
            "Title": "Aurionpro Solutions Secures Major Urban Mobility Contract for Mumbai Metro",
            "Summary": "Aurionpro Solutions has won a major urban mobility project for Mumbai Metro. The company secured this significant contract in the transportation infrastructure sector.",
            "Sentiment": "positive",
            "PublishDate": 1755064344702,
            "Source": "stock"
        },
        {
            "Title": "Aurionpro Solutions Acquires Singapore-Based Fintech InfrariskSG for $2 Million",
            "Summary": "Aurionpro Solutions Limited has approved the acquisition of 100% stake in InfrariskSG Pte Ltd, a Singapore/Melbourne-based fintech company specializing in digital lending and alternative risk scoring solutions. The acquisition will be executed through Aurionpro's wholly-owned subsidiary in Singapore and is valued at USD 2 million. The deal structure includes USD 1.2 million in upfront cash and USD 0.8 million through share swap to founders, plus earn-out payments based on performance milestones through 2028. InfrariskSG provides scalable digital platforms for end-to-end lending and alternative risk scoring to financial institutions globally. The acquisition supports Aurionpro's geographical expansion into Australia, leveraging InfrariskSG's 15+ years of experience in financial institution lending transformations. InfrariskSG reported turnover of USD 518,073 in FY 2022-23, USD 566,336 in FY 2023-24, and projected USD 636,060 for FY 2024-25. The transaction is expected to complete by end of October 2025 and does not require regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1754376142757,
            "Source": "order&deals"
        },
        {
            "Title": "Aurionpro Solutions Shares Audio Recording Link for Q1 FY26 Earnings Call",
            "Summary": "Aurionpro Solutions Limited has provided the audio recording link for their post-earnings conference call held on July 23, 2025, discussing financial results for the quarter ended June 30, 2025. The company submitted the audio link to both NSE and BSE exchanges and requested them to upload it on their websites. The earnings call recording is now available through the provided link.",
            "Sentiment": "neutral",
            "PublishDate": 1753291977285,
            "Source": "earnings"
        },
        {
            "Title": "Aurionpro Solutions Reports Quarterly Growth in Net Profit and Revenue",
            "Summary": "Aurionpro Solutions reported consolidated net profit of 513 million rupees in Q1, compared to 503 million rupees in the previous quarter, representing a quarter-on-quarter increase. The company's Q1 revenue reached 3.36 billion rupees, up from 3.3 billion rupees in the prior quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753236757051,
            "Source": "earnings"
        },
        {
            "Title": "Aurionpro Solutions Expands Digital Banking Solutions in Africa",
            "Summary": "Aurionpro Solutions has secured a major new deal in the MEA (Middle East and Africa) region, expanding its digital banking solutions in Africa. This development represents a significant growth opportunity for the company in the African market.",
            "Sentiment": "positive",
            "PublishDate": 1752039598000,
            "Source": "default"
        },
        {
            "Title": "Aurionpro Solutions Partners with UK Financial Firm for AI Credit Assessment Tool",
            "Summary": "Aurionpro Solutions has announced a partnership with a major UK financial firm to launch an advanced AI-powered credit assessment tool. The collaboration aims to introduce innovative technology in the financial sector, specifically in credit evaluation processes.",
            "Sentiment": "positive",
            "PublishDate": 1751352748000,
            "Source": "default"
        },
        {
            "Title": "Aurionpro Solutions Wins Contract for Automated Fare Collection System in Egypt",
            "Summary": "Aurionpro Solutions has secured a contract to implement an Automated Fare Collection System for public transport in Egypt. The project involves collaboration with Mastercard and marks an expansion of Aurionpro's presence in the Middle East region.",
            "Sentiment": "positive",
            "PublishDate": 1750916565000,
            "Source": "default"
        },
        {
            "Title": "Aurionpro Solutions Secures ₹20 Crore Contract in Sri Lanka",
            "Summary": "Aurionpro Solutions has announced a new client agreement in Sri Lanka. The contract is valued at ₹20 crores. No further details about the client or the nature of the agreement were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1749448319000,
            "Source": "default"
        },
        {
            "Title": "Aurionpro Solutions Ltd: Strong FY25 Results with 32.2% Revenue Growth",
            "Summary": "Aurionpro Solutions Ltd reported a 32.2% increase in revenue to ₹1,173 crore for FY25, with PAT up 31.8% to ₹188 crore. Q4FY25 revenue grew 32.4% YoY to ₹327 crore. The company enters FY26 with a record orderbook exceeding ₹1,400 crore and plans to increase investments in European capabilities, new market products, and AI integration.",
            "Sentiment": "positive",
            "PublishDate": 1747286802000,
            "Source": "earnings"
        },
        {
            "Title": "Aurionpro Solutions: Targets 30% Revenue Growth in FY26",
            "Summary": "Aurionpro Solutions expects over 30% year-on-year revenue growth in FY26, backed by a strong order pipeline of ₹1,400 crore. The company achieved ₹1,170 crore revenue in FY25, within its guided range. It plans to expand into Europe and Southeast Asia, aiming for 7-8% revenue from Europe in FY26. Margins may face pressure due to investments, but are expected to stay around 20%.",
            "Sentiment": "positive",
            "PublishDate": 1747220153000,
            "Source": "earnings"
        },
        {
            "Title": "Aurionpro Solutions Reports Q4 Results and Dividend Recommendation",
            "Summary": "Aurionpro Solutions has announced its Q4 financial results and dividend recommendation. The company's Q4 consolidated net profit increased to 503 million rupees from 473.4 million rupees in the previous quarter. Revenue rose to 3.3 billion rupees from 3.06 billion rupees. However, EBIT margin decreased to 17.23% from 18.41% quarter-over-quarter. The company has recommended a dividend of 3 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747148454000,
            "Source": "result"
        },
        {
            "Title": "Aurionpro Solutions to Acquire Fintra Software for ₹23 Crore",
            "Summary": "Aurionpro Solutions has announced its intention to purchase Fintra Software Pvt. Ltd. for ₹23 crore. Fintra Software specializes in developing software products and services for the banking and financial services industry. This acquisition is expected to strengthen Aurionpro's position in the financial technology sector.",
            "Sentiment": "positive",
            "PublishDate": 1744342643000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aurionpro Solutions: Q3 Profit Surges 33%, Order Book Exceeds ₹1,300 Crore",
            "Summary": "Aurionpro Solutions reported a 33% YoY increase in Q3 FY25 PAT to ₹48 crore, with revenue up 33% to ₹306 crore. Banking and fintech segment grew 41% in 9M FY25. The company expanded in Europe, secured metro contracts in India, and launched AI platforms. Order book surpassed ₹1,300 crore, with no immediate capital raising plans.",
            "Sentiment": "positive",
            "PublishDate": 1738061119000,
            "Source": "earnings"
        },
        {
            "Title": "Aurionpro Solutions Declares Interim Dividend",
            "Summary": "Aurionpro Solutions has announced an interim dividend of 1 rupee per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1737998788000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aurionpro Solutions Reports Improved Q3 EBIT and Margin",
            "Summary": "Aurionpro Solutions has reported a quarter-on-quarter improvement in its financial performance. The company's Q3 EBIT (Earnings Before Interest and Taxes) increased to 563.7 million rupees, up from 491 million rupees in the previous quarter. Additionally, the EBIT margin improved to 18.41% from 17.65% in the same period.",
            "Sentiment": "positive",
            "PublishDate": 1737998782000,
            "Source": "earnings"
        },
        {
            "Title": "Aurionpro Solutions Reports Q3 Revenue Growth",
            "Summary": "Aurionpro Solutions has announced its Q3 revenue, which stands at 3.06 billion rupees. This represents an increase from the previous quarter's revenue of 2.78 billion rupees, indicating quarter-over-quarter growth for the company.",
            "Sentiment": "positive",
            "PublishDate": 1737998766000,
            "Source": "earnings"
        },
        {
            "Title": "Aurionpro Solutions Reports Q3 Consolidated Net Profit of 473.4 Million Rupees",
            "Summary": "Aurionpro Solutions has announced its Q3 consolidated net profit of 473.4 million rupees, compared to 451 million rupees in the previous quarter, showing a quarter-on-quarter increase.",
            "Sentiment": "positive",
            "PublishDate": 1737998758000,
            "Source": "earnings"
        },
        {
            "Title": "Aurionpro Solutions Wins Delhi Metro Smart Transit Project",
            "Summary": "Aurionpro Solutions has secured a significant contract for the Delhi Metro project, marking a major achievement in the smart transit sector. This win demonstrates the company's growing presence and capabilities in providing advanced transit solutions for urban infrastructure projects.",
            "Sentiment": "positive",
            "PublishDate": 1735534821000,
            "Source": "order&deals"
        },
        {
            "Title": "Aurionpro Solutions: R&D Spending to Increase Over Next Three Years",
            "Summary": "Aurionpro Solutions plans to maintain EBITDA margins at 20-22% for the next 2-3 years, with excess profits directed towards increased R&D spending. The company aims to expand into new markets and expects to allocate about 10% of its revenue to R&D in FY25. CEO Ashish Rai emphasizes focus on long-term value creation over short-term profit growth.",
            "Sentiment": "positive",
            "PublishDate": 1735357879000,
            "Source": "normal_news"
        },
        {
            "Title": "Aurionpro Solutions: Expands into Europe with €10 Million Acquisition of Fenixys",
            "Summary": "Aurionpro Solutions acquires 100% stake in Paris-based Fenixys for €10 million, expanding into European and Middle East markets. Fenixys, with €8 million revenue in FY2024, specializes in advisory and MUREX services. The all-cash deal is expected to close by January 2025, requiring no regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1735001679000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aurionpro Solutions Limited: Subsidiary Launches Advanced AI Explainability Platform",
            "Summary": "Arya.ai, a subsidiary of Aurionpro Solutions Limited, has introduced AryaXAI, an AI explainability platform for critical industries. The platform features DLBacktrace, a new technique for deep learning models, which is being made open source. AryaXAI offers comprehensive explainability tools and monitoring features for AI decision-making transparency.",
            "Sentiment": "positive",
            "PublishDate": 1734513279000,
            "Source": "normal_news"
        },
        {
            "Title": "Aurionpro's Arya.ai Launches AryaXAI for Explainable AI in High-Stakes Industries",
            "Summary": "Aurionpro's subsidiary, Arya.ai, has introduced AryaXAI, a new product aimed at setting a global benchmark in explainable AI for high-stakes industries. This launch represents a significant development in the field of artificial intelligence, particularly for sectors where transparency and accountability in AI decision-making are crucial.",
            "Sentiment": "positive",
            "PublishDate": 1734501798000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aurionpro Solutions Signs Deal for iCashPro+ Transaction Banking Platform",
            "Summary": "Aurionpro Solutions has entered into an agreement with a leading bank to provide its innovative iCashPro+ transaction banking platform. This deal signifies a significant business development for the company in the financial technology sector.",
            "Sentiment": "positive",
            "PublishDate": 1733891204000,
            "Source": "order&deals"
        },
        {
            "Title": "Aurionpro Secures Another Significant Contract in Saudi Arabia",
            "Summary": "Aurionpro Solutions Limited has announced a significant new contract win in the Kingdom of Saudi Arabia, indicating continued expansion of their business operations in the region. This development suggests the company is successfully growing its presence and securing important deals in the Saudi market.",
            "Sentiment": "positive",
            "PublishDate": 1733891169000,
            "Source": "order&deals"
        },
        {
            "Title": "Aurionpro Solutions Limited: Subsidiary Launches ESG Lending Platform, Secures Major Southeast Asian Bank Deal",
            "Summary": "Integro Technologies, a subsidiary of Aurionpro Solutions Limited, has launched SmartLender ESG platform for sustainable financing. The company secured a deal with a leading Southeast Asian bank. The platform helps banks manage ESG strategies, offering digitalized checklist capabilities for green certifications and performance targets. Chartis recognized Integro Technologies as a Category Leader in five Corporate Lending Quadrants.",
            "Sentiment": "positive",
            "PublishDate": 1733381917000,
            "Source": "normal_news"
        },
        {
            "Title": "Aurionpro Solutions Launches ESG Platform and Secures Major Deal",
            "Summary": "Aurionpro Solutions has introduced Integro Smart Lender ESG, a platform designed for sustainable lending. The company has also secured a significant deal with a leading regional bank in Southeast Asia for this platform.",
            "Sentiment": "positive",
            "PublishDate": 1733375304000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aurionpro Solutions: Secures Major Chennai Metro Contract",
            "Summary": "Aurionpro Solutions has won a significant contract from Chennai Metro Rail Corporation Limited to deliver automated fare collection systems for Phase II of the Chennai Metro. The project covers Corridors 3 and 5, with Aurionpro responsible for end-to-end delivery of station-level AFC systems, including design, manufacturing, supply, installation, and maintenance.",
            "Sentiment": "positive",
            "PublishDate": 1730974548000,
            "Source": "normal_news"
        }
    ]
}