{
    "Symbol": "AUROPHARMA",
    "ISIN": "INE406A01037",
    "News": [
        {
            "Title": "Aurobindo Pharma Q3FY26 Results Show Strong Growth",
            "Summary": "Aurobindo Pharma reported consolidated revenue of ₹86,459.0 million for Q3FY26, up 8.36% YoY. Net profit reached ₹9,098.0 million with EPS of ₹15.67.",
            "Sentiment": "positive",
            "PublishDate": 1770647136081,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aurobindo Pharma Q3FY26 Earnings Call on Feb 10",
            "Summary": "Aurobindo Pharma schedules earnings call for February 10, 2026 at 8:30 AM IST to discuss Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770009483870,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aurobindo Pharma Clarifies Volume Movement",
            "Summary": "Aurobindo Pharma attributes recent trading volume surge to market-driven factors following government's MIP notification on Penicillin-G and related compounds on January 29, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769838716316,
            "Source": "stocks"
        },
        {
            "Title": "Aurobindo Pharma Sets Up Philippines Subsidiary",
            "Summary": "Aurobindo Pharma establishes wholly owned subsidiary in Philippines through Helix Healthcare B.V. with initial share capital of ₹17.00 crores to expand pharmaceutical business operations.",
            "Sentiment": "positive",
            "PublishDate": 1769169790950,
            "Source": "stocks"
        },
        {
            "Title": "Aurobindo Pharma shares decline 2.02% amid market fall",
            "Summary": "Aurobindo Pharma shares dropped 2.02% to ₹1,122.20, with the pharmaceutical company reporting revenue growth of 9.38% to ₹31,723 crores in March 2025 despite net profit declining from previous highs.",
            "Sentiment": "negative",
            "PublishDate": 1769163421424,
            "Source": "stocks"
        },
        {
            "Title": "USFDA Advair generic nod impacts Aurobindo, Cipla",
            "Summary": "Respirent Pharmaceuticals receives USFDA approval for Advair generic, potentially benefiting Aurobindo Pharma through its pending Lannett acquisition while increasing competition for Cipla's awaited approval.",
            "Sentiment": "neutral",
            "PublishDate": 1768285119325,
            "Source": "stocks"
        },
        {
            "Title": "Advair Generic Gets FDA Approval via Respirent-Lannett",
            "Summary": "Respirent and Lannett receive final FDA approval for generic Advair asthma treatment for patients aged four and older, impacting pharmaceutical market dynamics for Aurobindo Pharma and Cipla.",
            "Sentiment": "neutral",
            "PublishDate": 1768282587059,
            "Source": "stocks"
        },
        {
            "Title": "Aurobindo & Cipla Partners Get FDA Nod for Advair Generic",
            "Summary": "Respirent and Lannett receive final FDA approval for generic version of Advair, an asthma treatment for patients aged four and older, potentially benefiting Aurobindo Pharma and Cipla.",
            "Sentiment": "positive",
            "PublishDate": 1768282562409,
            "Source": "stocks"
        },
        {
            "Title": "Aurobindo's CuraTeQ Gets Health Canada Approval",
            "Summary": "CuraTeQ Biologics, Aurobindo Pharma's subsidiary, receives Notice of Compliance from Health Canada for Dyrupeg, a biosimilar cancer drug for treating neutropenia in cancer patients.",
            "Sentiment": "positive",
            "PublishDate": 1767961385398,
            "Source": "stocks"
        },
        {
            "Title": "Aurobindo's CuraTeQ gets Health Canada nod for Dyrupeg",
            "Summary": "CuraTeQ Biologics, Aurobindo Pharma's wholly owned subsidiary, received Notice of Compliance from Health Canada for biosimilar product Dyrupeg after successful regulatory review.",
            "Sentiment": "positive",
            "PublishDate": 1767958523869,
            "Source": "stocks"
        },
        {
            "Title": "Aurobindo's CuraTeQ Gets Health Canada Nod for Biosimilar",
            "Summary": "CuraTeQ Biologics, Aurobindo Pharma's subsidiary, receives Notice of Compliance from Health Canada for Dyruppeg biosimilar, expanding its global regulatory approvals after EU and UK authorizations.",
            "Sentiment": "positive",
            "PublishDate": 1767953150938,
            "Source": "stocks"
        },
        {
            "Title": "Aurobindo's Curateq Gets Health Canada Nod for Dyrupeg",
            "Summary": "Curateq Biologics, subsidiary of Aurobindo Pharma, receives Health Canada approval for Dyrupeg biosimilar, confirming compliance with safety, efficacy and quality standards.",
            "Sentiment": "positive",
            "PublishDate": 1767952546553,
            "Source": "stocks"
        },
        {
            "Title": "Aurobindo Pharma schedules investor plant visit",
            "Summary": "Aurobindo Pharma announces investor group plant visit arranged by Investec on January 13, 2026, at Vizag and Kakinada facilities from 9 AM to 5 PM IST.",
            "Sentiment": "neutral",
            "PublishDate": 1767874231226,
            "Source": "stocks"
        },
        {
            "Title": "Aurobindo Pharma Acquires Non-Oncology Business for ₹3,250 Cr",
            "Summary": "Aurobindo Pharma's subsidiary Auro Pharma acquired Khandelwal Laboratories' non-oncology prescription formulations business for ₹3,250 crores, adding 23 brands across 67 SKUs to strengthen its domestic portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1767271422950,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aurobindo Pharma Plans Solar Power Investment",
            "Summary": "Aurobindo Pharma announces plans to acquire up to 26% stake in Swarnaakshu Solar Power Private Limited, subject to state government approval by March 31, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767073959462,
            "Source": "co_actions_results"
        },
        {
            "Title": "Govt to Set Minimum Import Price for Penicillin",
            "Summary": "Government plans to establish minimum import price for penicillin to encourage local API investments under PLI scheme, potentially benefiting pharmaceutical manufacturers.",
            "Sentiment": "positive",
            "PublishDate": 1767067295185,
            "Source": "stocks"
        },
        {
            "Title": "Aurobindo Pharma shares in focus after CuraTeQ deal",
            "Summary": "Aurobindo Pharma shares under spotlight following subsidiary CuraTeQ's termination of BioFactura agreement and Helix Healthcare's acquisition of additional stake in Chinese joint venture.",
            "Sentiment": "neutral",
            "PublishDate": 1766818376731,
            "Source": "stocks"
        },
        {
            "Title": "Aurobindo Pharma Terminates Biosimilar Agreement",
            "Summary": "Aurobindo Pharma's subsidiary CuraTeQ Biologics mutually terminated its licensing agreement with BioFactura Inc USA for ustekinumab biosimilar BFI-751, citing strategic portfolio prioritisation.",
            "Sentiment": "neutral",
            "PublishDate": 1766817560107,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aurobindo Pharma to Acquire 20% Stake in China JV",
            "Summary": "Aurobindo Pharma plans to purchase an additional 20% stake in Luoxin Aurovitas Pharma, China for USD 5.125 million to boost manufacturing capacity. Deal expected to close in 3 months.",
            "Sentiment": "positive",
            "PublishDate": 1766477065412,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aurobindo Pharma Gets FDA Inspection Report",
            "Summary": "US FDA completes inspection at APL Healthcare's Unit-IV facility from December 08-17, 2025, identifies 5 procedural observations with no financial impact on operations.",
            "Sentiment": "neutral",
            "PublishDate": 1766032896369,
            "Source": "stocks"
        },
        {
            "Title": "Aurobindo Pharma Unit Receives FDA Form 483",
            "Summary": "US FDA completes inspection at Aurobindo Pharma's Unit-V of Apitoria Pharma Private Ltd, issuing Form 483 with three observations following regulatory review.",
            "Sentiment": "neutral",
            "PublishDate": 1765757317537,
            "Source": "stocks"
        },
        {
            "Title": "Aurobindo Pharma Gets FDA Form 483 with 3 Observations",
            "Summary": "US FDA completes inspection at Apitoria Pharma's Unit-V facility and issues Form 483 with three procedural observations following the regulatory review.",
            "Sentiment": "neutral",
            "PublishDate": 1765540690892,
            "Source": "stocks"
        },
        {
            "Title": "Aurobindo Pharma Plans ₹20 Billion Investment in Telangana",
            "Summary": "Aurobindo Pharma announced plans to invest ₹20 billion in Telangana over the next 2-3 years. The significant capital investment indicates the pharmaceutical company's expansion strategy in the state.",
            "Sentiment": "positive",
            "PublishDate": 1765289516928,
            "Source": "stock"
        },
        {
            "Title": "Aurobindo Pharma Faces Pen-G Price Pressure from Chinese Competition",
            "Summary": "Aurobindo Pharma is experiencing declining Pen-G prices due to increased competition from Chinese imports while simultaneously struggling to boost its own Pen-G production capacity. Macquarie maintains an Underperform rating on the stock with a target price of Rs 1,010, reflecting concerns over the company's competitive position in this segment.",
            "Sentiment": "negative",
            "PublishDate": 1764131312083,
            "Source": "stock"
        },
        {
            "Title": "Aurobindo Pharma's Bhiwadi Unit-II Receives 9 Procedural Observations from US FDA",
            "Summary": "The US FDA has completed its inspection of Aurobindo Pharma's Bhiwadi Unit-II facility, resulting in 9 procedural observations. The inspection outcome affects the pharmaceutical company's manufacturing operations and regulatory compliance status for its US market activities.",
            "Sentiment": "neutral",
            "PublishDate": 1763125094741,
            "Source": "stock"
        },
        {
            "Title": "Aurobindo Pharma's US Subsidiary Receives VAI Classification from US FDA After Inspection Closure",
            "Summary": "US FDA has classified Aurobindo Pharma's wholly owned subsidiary Apitoria Pharma's Unit-I manufacturing facility as Voluntary Action Indicated (VAI) and closed its inspection after determining that issues from a January 2022 warning letter and 5 observations from Form 483 have been adequately addressed. The VAI classification will have a positive impact on the unit's operations, marking resolution of regulatory concerns at the API manufacturing facility located in Telangana.",
            "Sentiment": "neutral",
            "PublishDate": 1763097339003,
            "Source": "stock"
        },
        {
            "Title": "Aurobindo Pharma Reports 6% Revenue Growth to ₹8,286 Crores in Q2 FY26",
            "Summary": "Aurobindo Pharma's consolidated revenues grew 6% year-on-year to ₹8,286 crores with EBITDA at ₹1,678 crores (20.3% margin) in the second quarter. The formulation business contributed 88% of total revenues at ₹7,325 crores, growing 10% year-on-year, led by strong performance in US, Europe and growth markets. US revenues stood at $417 million with 6% quarter-on-quarter growth in oral solids excluding Revlimid. European business delivered 18% year-on-year growth to ₹2,480 crores. The company launched 6 new products and received 7 final approvals during the quarter. Pen-G operations started July 1, 2025, producing around 1,050 MT at 40-50% capacity. The company expects to achieve internal margin targets of 20-21% for FY26 and remains confident about sustained growth momentum across all businesses.",
            "Sentiment": "positive",
            "PublishDate": 1762885131071,
            "Source": "earnings"
        },
        {
            "Title": "Aurobindo Pharma Targets EBITDA Breakeven at China Plant by Q3-Q4 FY'26",
            "Summary": "Aurobindo Pharma announced several financial and operational targets during a conference call. The company's China plant is targeting EBITDA breakeven by Q3-Q4 FY'26. For FY'26, Aurobindo expects EBITDA margins of 20-21% and anticipates generating over €1 billion in revenue from Europe. The company projects ongoing growth driven by multiple factors including Pen-G facility ramp-up, biosimilar portfolio launch, biologic CMO progress, injectable business enhancement, supply from China plant to Europe, new product releases, and the acquisition of Lannett in the U.S.",
            "Sentiment": "positive",
            "PublishDate": 1762484565369,
            "Source": "stock"
        },
        {
            "Title": "Aurobindo Pharma Updates on Plant Operations and Revenue Outlook",
            "Summary": "Aurobindo Pharma announced plans to increase production at its Kakinada Pen-G plant. The company expects its China plant to reach break-even in the third or fourth quarter. Revlimid sales were low in Q2, with no sales anticipated in Q3. The pharmaceutical company indicated that no major capital expenditures are expected in the near term.",
            "Sentiment": "neutral",
            "PublishDate": 1762401137158,
            "Source": "stock"
        },
        {
            "Title": "Aurobindo Pharma Reports 6.3% Revenue Growth to ₹8,286 Crores in Q2FY26",
            "Summary": "Aurobindo Pharma Limited announced quarterly results with revenue from operations increasing 6.3% year-over-year to ₹8,286 crores, driven by strong performance in US, Europe and Growth Markets. EBITDA grew 7.1% to ₹1,678 crores with a margin of 20.3%. Net profit rose 3.8% to ₹848 crores. The US formulations business generated ₹3,638 crores (43.9% of total revenue), while Europe formulations contributed ₹2,480 crores with 17.8% growth. The company filed 13 ANDAs with US FDA, received 7 final approvals, and launched 6 products during the quarter. R&D spending was ₹414 crores (5% of sales). The company maintains a strong net cash position of $170 million and generated free cash flows of $57 million before dividends and buybacks. In biosimilars, three products including trastuzumab biosimilar were approved by European Commission, and four biosimilar products including bevacizumab and trastuzumab biosimilars were approved by MHRA UK.",
            "Sentiment": "positive",
            "PublishDate": 1762362749780,
            "Source": "earnings"
        },
        {
            "Title": "Aurobindo Pharma Reports Q2 Results with ₹58.1 Billion Standalone Revenue",
            "Summary": "Aurobindo Pharma announced its quarterly results for the period ended September 30, 2025. The company reported standalone revenue from operations of ₹27,598.9 million for the quarter and ₹55,820.3 million for the half-year. Standalone profit after tax reached ₹5,813.7 million for the quarter and ₹11,405.0 million for the half-year. On a consolidated basis, the company achieved revenue of ₹82,369.6 million for the quarter and ₹1,60,287.3 million for the half-year, with consolidated profit after tax of ₹8,481.3 million for the quarter and ₹16,723.3 million for the half-year. Basic earnings per share stood at ₹10.01 for the quarter on a standalone basis and ₹14.61 on a consolidated basis. The Board of Directors approved these results at their meeting held on November 5, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762358466620,
            "Source": "earnings"
        },
        {
            "Title": "Aurobindo Pharma Announces Senior Management Changes with Two Key Departures",
            "Summary": "Aurobindo Pharma Limited has announced changes in its senior management team involving two key personnel. Dr. Mandepudi Sudhakara Reddy, Associate President of Corporate QA, resigned from his position effective November 4, 2025. He had submitted his resignation letter on August 9, 2025, citing acceptance of a new opportunity that aligns with his career aspirations. Additionally, Mr. K.P. Ravinatha Shetty, President of Operations, retired from the company on November 3, 2025, upon reaching superannuation. Both executives held senior management positions within the pharmaceutical company.",
            "Sentiment": "neutral",
            "PublishDate": 1762242069595,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aurobindo Pharma Establishes New Subsidiary in Chile Through Eugia Pharma B.V",
            "Summary": "Aurobindo Pharma Limited announced that its wholly owned stepdown subsidiary, Eugia Pharma B.V, has incorporated a new wholly owned subsidiary in Chile named Eugia Pharma Chile SpA. The new company was incorporated on October 7, 2025, with formation documents received on October 22, 2025. The subsidiary operates in the pharmaceuticals industry with the objective of expanding pharmaceutical products business in Chile. The initial share capital subscription amounts to CLP 1,000,000 (USD 1,050) divided into 100 shares with a nominal value of CLP 10,000 each, representing 100% ownership through cash consideration. No governmental or regulatory approvals were required for this incorporation.",
            "Sentiment": "positive",
            "PublishDate": 1761193889755,
            "Source": "corporate_action"
        },
        {
            "Title": "Aurobindo Pharma Establishes New Wholly Owned Subsidiary in Chile",
            "Summary": "Aurobindo Pharma has incorporated a new wholly owned subsidiary, Aurobindo Pharma Chile SpA, in Chile through its subsidiary Helix Healthcare B.V. The new company was incorporated on October 7, 2025, with an initial share capital of CLP 1,000,000 (USD 1,050) divided into 100 shares. The subsidiary operates in the pharmaceuticals industry and aims to expand Aurobindo's pharmaceutical products business in Chile. The incorporation required no governmental or regulatory approvals and represents a 100% cash subscription to the share capital.",
            "Sentiment": "positive",
            "PublishDate": 1761193482935,
            "Source": "stock"
        },
        {
            "Title": "Aurobindo Pharma Promoters Raise Rs 2,000 Crore for Real Estate and Asset Acquisitions",
            "Summary": "Aurobindo Pharma's promoter group raised Rs 2,000 crore through a two-tranche financing structure via their real estate arm, Auro Realty, to fund platform acquisitions including the Taj Banjara asset in Hyderabad. The funding comprises Rs 650 crore Series 1 with 24-month tenor at 11.75% coupon, and Rs 1,450 crore Series 2 with four-year tenor at 15.5% coupon. The debt is secured by pledged promoter entities Raidurgam Developers and Auro Realty, plus other collateral valued over Rs 2,500 crore with personal and corporate guarantees. Raidurgam Developers manages the Galaxy Tower project in Hyderabad's tech hub. Exit options for lenders include refinancing, project cash flows, and asset monetization. Aurobindo Pharma reported revenues of around Rs 31,000 crore and maintains net cash positive status.",
            "Sentiment": "neutral",
            "PublishDate": 1760401457637,
            "Source": "stock"
        },
        {
            "Title": "Aurobindo Pharma's Hyderabad Unit Faces US FDA Concerns",
            "Summary": "Aurobindo Pharma's Hyderabad manufacturing unit is facing concerns from the US FDA. The situation is being compared to Lupin's Pithampur unit, which has an 8-10% revenue share and 22 major filings.",
            "Sentiment": "negative",
            "PublishDate": 1759816745280,
            "Source": "stock"
        },
        {
            "Title": "Aurobindo Pharma Completes Internal Subsidiary Restructuring with CuraTeQ Biologics Share Transfer",
            "Summary": "Aurobindo Pharma has completed the transfer of shares of CuraTeQ Biologics s.r.o. from its wholly owned subsidiary Helix Healthcare B.V. to another wholly owned subsidiary Curateq Biologics B.V. The share transfer, which was part of a binding agreement entered into on July 29, 2025, received confirmation from Czech Republic authorities on September 30, 2025. As a result of this internal restructuring, CuraTeQ Biologics s.r.o. is now a wholly owned subsidiary of Curateq Biologics B.V. instead of Helix Healthcare B.V. The transaction was completed ahead of the November 30, 2025 deadline specified in the original agreement.",
            "Sentiment": "neutral",
            "PublishDate": 1759301854709,
            "Source": "corporate_action"
        },
        {
            "Title": "Aurobindo Pharma Establishes New Subsidiary Curateq Biologics in Malta",
            "Summary": "Aurobindo Pharma has established a new wholly owned subsidiary named Curateq Biologics in Malta. The pharmaceutical company has expanded its corporate structure through this new entity in the European nation.",
            "Sentiment": "positive",
            "PublishDate": 1758895868715,
            "Source": "stock"
        },
        {
            "Title": "Aurobindo Pharma Extends Share Transfer Deadline to November 30, 2025",
            "Summary": "Aurobindo Pharma has updated the timeline for transferring shares of CuraTeQ Biologics s.r.o. from Helix Healthcare B.V. to Curateq Biologics B.V., both wholly owned subsidiaries of the company. The share transfer, originally scheduled for completion by August 31, 2025, has been extended to November 30, 2025. The delay is due to pending receipt of an updated business register from Dutch authorities. A binding agreement for the transfer of entire shares was entered into on July 29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758888843130,
            "Source": "stock"
        },
        {
            "Title": "Aurobindo Pharma to Acquire 26% Stake in Swarnaakshu Solar Power by December 2025",
            "Summary": "Aurobindo Pharma plans to complete a 26% stake acquisition in Swarnaakshu Solar Power by December 31, 2025. The transaction is subject to state approval.",
            "Sentiment": "neutral",
            "PublishDate": 1758883251533,
            "Source": "order&deals"
        },
        {
            "Title": "Aurobindo Pharma Targets $7 Billion Osteoporosis Drug Market With Denosumab Biosimilar",
            "Summary": "Aurobindo Pharma announced successful Phase 3 clinical study results for its Denosumab biosimilar, a monoclonal antibody used to treat osteoporosis and bone metastasis from cancer. The company plans regulatory filings for the US, EU and other key markets beginning January 2026. CEO Satakarni Makkapati expects European approval by end-2026 with a 9-10 month approval window, while US approval is targeted for 2027. The global market for this drug is valued at $7 billion, with Europe representing $2.2 billion and the US accounting for $5 billion. Makkapati projects biosimilars will capture 30-50% of the innovator market from end-2025 to 2030, translating to potential biosimilar sales of $1.5-1.6 billion initially, growing to $3-4 billion by 2030 among five to six key players. However, he cautioned about competitive pressures leading to price erosion and potential market exits.",
            "Sentiment": "positive",
            "PublishDate": 1758592263079,
            "Source": "stock"
        },
        {
            "Title": "Aurobindo Pharma Unit Experiences Minor Fire, Production Temporarily Impacted",
            "Summary": "A small fire occurred at APL Healthcare Limited Unit-IV due to an electrical short circuit. The incident resulted in no casualties. Production has been temporarily affected by approximately 3% of monthly capacity. Refurbishment work is expected to be completed within a few weeks.",
            "Sentiment": "negative",
            "PublishDate": 1758268481770,
            "Source": "stock"
        },
        {
            "Title": "CuraTeQ Biologics Completes Phase 3 Study for Denosumab Biosimilar, Plans Regulatory Filings from January 2026",
            "Summary": "CuraTeQ Biologics Private Limited, a wholly owned subsidiary of Aurobindo Pharma Limited, completed a Phase 3 clinical study for its denosumab biosimilar. The study evaluated the biosimilar against Prolia (denosumab) in 446 women with postmenopausal osteoporosis across forty sites in five European countries. The study met all clinical endpoints, showing no clinically meaningful differences between the biosimilar and reference product. The primary endpoint of percentage change in Lumbar Spine Bone Mineral Density at Week 52 met the pre-defined equivalence margin of (-1.45, +1.45). The co-primary endpoint assessing serum C-terminal telopeptide from Week 0 to Week 26 was within the acceptable range of (0.80, 1.25), satisfying regulatory criteria for both US FDA and European Medicines Agency. CuraTeQ plans to submit regulatory filings for the denosumab biosimilar in the EU, US and other key regulated markets from January 2026.",
            "Sentiment": "positive",
            "PublishDate": 1758257483056,
            "Source": "stock"
        },
        {
            "Title": "Aurobindo Pharma Establishes New Wholly-Owned Subsidiary in Malaysia",
            "Summary": "Aurobindo Pharma has incorporated a new wholly-owned subsidiary named Aurobindo Pharma (Malaysia) SDN. BHD. through its existing subsidiary Helix Healthcare B.V. The Malaysian entity was incorporated on September 17, 2025, with an initial share capital of RM 400,000 (approximately USD 100,000) divided into 400,000 shares of RM 1.00 each. The subsidiary operates in the pharmaceuticals industry and aims to expand Aurobindo's pharmaceutical products business in Malaysia. The incorporation was completed through 100% cash subscription to the share capital, with no governmental or regulatory approvals required.",
            "Sentiment": "positive",
            "PublishDate": 1758110243615,
            "Source": "stock"
        },
        {
            "Title": "Aurobindo Pharma Shares Rise 6% as GTCR Nears €4.1 Billion Zentiva Acquisition",
            "Summary": "Aurobindo Pharma shares closed 6% higher on Thursday following reports that Chicago-based private equity firm GTCR is close to acquiring generic drugmaker Zentiva for €4.1 billion ($4.8 billion). GTCR has emerged as the frontrunner to buy Advent International-owned Zentiva, outbidding rival private equity firms and pharmaceutical companies. The deal has been finalized and is expected to be announced within days. Aurobindo Pharma was previously considered a leading contender for Zentiva. The company had stated in August that discussions were at an early stage and that Zentiva fit its criteria for inorganic acquisitions, while emphasizing it would not overpay for any acquisition. Advent International acquired Zentiva from Sanofi for €1.9 billion in 2018. Zentiva manufactures generic and over-the-counter medicines, operates in more than 30 countries, and employs over 5,000 people.",
            "Sentiment": "positive",
            "PublishDate": 1757587554497,
            "Source": "stock"
        },
        {
            "Title": "Aurobindo Pharma's Unit-XII Receives 8 Procedural Observations from US FDA Inspection",
            "Summary": "The US FDA completed an inspection of Aurobindo Pharma's Unit-XII facility, resulting in 8 procedural observations. The company stated that these observations will have no financial or operational impact on its business.",
            "Sentiment": "neutral",
            "PublishDate": 1757296072705,
            "Source": "stock"
        },
        {
            "Title": "Aurobindo Pharma's Unit-XII Completes US FDA Inspection with Minor Observations",
            "Summary": "Aurobindo Pharma announced that the US FDA has completed its inspection of the company's Unit-XII facility. The inspection resulted in eight procedural observations. The company stated that these observations are not expected to have any financial or operational impact on its business.",
            "Sentiment": "neutral",
            "PublishDate": 1757079064241,
            "Source": "stock"
        },
        {
            "Title": "Aurobindo Pharma Unit Receives FDA Form 483 with 5 Procedural Observations",
            "Summary": "Aurobindo Pharma announced the completion of a US FDA inspection at Unit-I of its wholly owned subsidiary. The FDA issued a Form 483 with 5 observations that are procedural in nature. No data integrity issues were reported during the inspection.",
            "Sentiment": "neutral",
            "PublishDate": 1756686528592,
            "Source": "stock"
        },
        {
            "Title": "Aurobindo Pharma Receives FDA Form 483 with 5 Procedural Observations, No Data Integrity Issues",
            "Summary": "Aurobindo Pharma announced that the US FDA has completed its inspection at Unit-I of the company's wholly owned subsidiary. The inspection resulted in a Form 483 containing 5 procedural observations. The company noted that no data integrity concerns were identified during the inspection.",
            "Sentiment": "neutral",
            "PublishDate": 1756541741215,
            "Source": "stock"
        },
        {
            "Title": "Aurobindo Pharma Subsidiary Gets UK Approval for Breast Cancer Drug, Explores Zentiva Acquisition",
            "Summary": "Aurobindo Pharma's subsidiary CuraTeQ Biologics received UK regulatory approval to market Dazublys, a trastuzumab biosimilar for treating HER2-positive breast and gastric cancers. This marks CuraTeQ's fourth biosimilar to gain UK approval, following Bevqolva, Zefylt, and Dyrupeg. The company has entered discussions for potentially acquiring Zentiva, with talks at early stages and a possible announcement within two months. Aurobindo Pharma CFO indicated the company would prefer deals with single-digit multiples and exercise caution to avoid overpayment. The company holds $140 million in assets and generates 75% of revenue from US and European markets. Shares declined 1.59% to ₹1050.4.",
            "Sentiment": "positive",
            "PublishDate": 1756192218048,
            "Source": "stock"
        }
    ]
}