{
    "Symbol": "AURUM",
    "ISIN": "INE898S01029",
    "News": [
        {
            "Title": "Aurum PropTech grants 90,000 stock options to employees",
            "Summary": "Aurum PropTech Limited's Nomination and Remuneration Committee approved the grant of 90,000 stock options to eligible employees under the Employee Stock Option Plan 2021 at an exercise price of Rs. 80 per share.",
            "Sentiment": "positive",
            "PublishDate": 1769867213452,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aurum PropTech Achieves PAT Profitability in Q3 FY26",
            "Summary": "Aurum PropTech Limited reported PAT profitability of INR 2.71 crores in Q3 FY26, marking a significant turnaround from previous quarter's loss of INR 8.41 crores, with revenue growing 39.2% to INR 104.82 crores.",
            "Sentiment": "positive",
            "PublishDate": 1769689384936,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aurum PropTech Allots 52,513 Shares Under ESOP",
            "Summary": "Aurum PropTech Limited allotted 52,513 equity shares of Rs. 5 each under its Employee Stock Option Plan 2021 on January 29, 2026, following Executive Investment Committee approval.",
            "Sentiment": "positive",
            "PublishDate": 1769681111175,
            "Source": "co_actions_results"
        },
        {
            "Title": "South Indian cities drive housing sales growth",
            "Summary": "Bengaluru, Hyderabad, and Chennai recorded 15% growth in housing sales to 1.33 lakh units in 2025, while overall eight-city sales declined 12% to 3.86 lakh units amid market recalibration.",
            "Sentiment": "positive",
            "PublishDate": 1769075511605,
            "Source": "stocks"
        },
        {
            "Title": "Aurum PropTech Building SM REIT Pipeline for Launch",
            "Summary": "Aurum PropTech management focuses on developing a comprehensive asset pipeline for its SM REIT product, targeting to become the country's largest and most scalable platform with strategic launch timing.",
            "Sentiment": "positive",
            "PublishDate": 1769049880538,
            "Source": "stocks"
        },
        {
            "Title": "Aurum PropTech Plans Short-Stay Module Expansion",
            "Summary": "Aurum PropTech reveals plans to expand its short-stay accommodation module, which currently generates ₹2.40 crores quarterly revenue, through strategic property identification based on market demand.",
            "Sentiment": "positive",
            "PublishDate": 1769049850429,
            "Source": "stocks"
        },
        {
            "Title": "Aurum PropTech Sets ₹1,000 Cr Revenue Target",
            "Summary": "Aurum PropTech expects ₹500 crores annualized revenue run rate in current quarter, targeting ₹1,000 crores within three years through organic growth from existing products and platforms.",
            "Sentiment": "positive",
            "PublishDate": 1769049779969,
            "Source": "stocks"
        },
        {
            "Title": "Aurum PropTech Reports No Deviation in Q3FY26 Proceeds",
            "Summary": "Aurum PropTech Limited confirms no deviation in use of ₹334.18 crore rights issue proceeds for Q3FY26, with ₹280.95 crore utilized and ₹58.12 crore remaining unutilized as per regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1768843967384,
            "Source": "stocks"
        },
        {
            "Title": "Aurum PropTech Q3FY26: Revenue Grows 77% to ₹124.6 Cr",
            "Summary": "Aurum PropTech achieved Q3FY26 total income of ₹124.6 crores with 77% YoY growth, turned PAT positive with ₹2.71 crores profit, and improved EBITDA margin to 6.5% from negative 2.4%.",
            "Sentiment": "positive",
            "PublishDate": 1768813124599,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aurum PropTech Establishes New Subsidiary Helloworld Living Private Limited",
            "Summary": "Aurum PropTech has incorporated a new subsidiary company named Helloworld Living Private Limited. This corporate restructuring move expands the company's organizational structure through the creation of this new entity.",
            "Sentiment": "neutral",
            "PublishDate": 1764677299378,
            "Source": "corporate_action"
        },
        {
            "Title": "Aurum PropTech Reports No Deviation in Rights Issue Proceeds Utilization for Q2 FY26",
            "Summary": "Aurum PropTech Limited's monitoring agency CARE Ratings reported no deviation from stated objects in the utilization of Rs. 343.56 crore rights issue proceeds for the quarter ended September 30, 2025. The company has received Rs. 337.16 crore out of total net proceeds of Rs. 339.07 crore, with Rs. 1.91 crore still pending from shareholders. During the quarter, the company utilized funds across four main objects: Product Development (Rs. 0.61 crore), Product Marketing (Rs. 0.62 crore), Identified Investments (Rs. 14.91 crore), and General Corporate Purposes (Rs. 0.51 crore). As of September 30, 2025, Rs. 69.37 crore remains unutilized, with Rs. 70.32 crore temporarily invested in debt mutual fund schemes. The company has obtained shareholder approvals for variations in objects and estimated amounts through special resolutions. All utilization timelines have been extended beyond the original Letter of Offer schedule, with deployment now rescheduled to fiscal years 2025-26 and 2026-27.",
            "Sentiment": "neutral",
            "PublishDate": 1762273601262,
            "Source": "corporate_action"
        },
        {
            "Title": "Aurum PropTech Reports First Profitable Quarter with 30% Revenue Growth",
            "Summary": "Aurum PropTech Limited achieved its first profitable quarter on adjusted EBITDA basis for Q2 FY2026, with revenue growing 30% year-on-year to Rs. 82.50 crores. The company improved its adjusted EBITDA margin by 700 basis points from -4% to +3% compared to the same quarter last year. The rental business reached Rs. 200 crores ARR and contributed 65% of total revenue at Rs. 54.11 crores, growing 25% year-on-year. The distribution segment generated Rs. 27.19 crores revenue, up 62% year-on-year. Aurum completed the acquisition of 100% equity in PropTiger Marketing Services for Rs. 86.45 crores through equity share swap, making REA Group a 5.5% shareholder. The company targets Rs. 500 crores ARR across all verticals by Q4 FY2026. Loss before tax improved to Rs. 6.96 crores from Rs. 12.07 crores in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1761403616850,
            "Source": "earnings"
        },
        {
            "Title": "Southern Cities Drive Housing Sales Growth Despite National Decline",
            "Summary": "Housing sales in Hyderabad, Bengaluru, and Chennai increased 47% to 38,644 units during July-September compared to 26,284 units in the same period last year. Hyderabad led with 53% growth to 17,658 units, while Bengaluru saw 18% growth to 13,124 units and Chennai more than doubled to 7,862 units. However, India's top eight housing markets experienced a 1% decline overall, falling to 95,547 units from 96,544 units, primarily due to decreased demand in Mumbai (22% decline to 23,334 units), Pune (28% decline to 12,990 units), and Delhi-NCR (21% decline to 7,961 units). Kolkata bucked the trend with 33% growth to 3,729 units, while Ahmedabad saw a 5% decline to 8,889 units. Aurum PropTech, which recently acquired PropTiger, cited stable interest rates and policy reforms like GST reduction on cement as positive factors, while noting affordability challenges in mid and entry-level segments.",
            "Sentiment": "neutral",
            "PublishDate": 1760962152689,
            "Source": "stock"
        },
        {
            "Title": "Aurum PropTech Reports No Deviation in Rights Issue Fund Utilization for Quarter Ended September 2025",
            "Summary": "Aurum PropTech Limited confirmed no deviation in the use of proceeds from its Rights Issue for the quarter ended September 30, 2025. The company raised Rs. 334.18 crore net through a rights issue with fund-raising periods from April 2022 to April 2025. The funds were allocated across four areas: Product Development (Rs. 37.5 crore), Product Marketing (Rs. 31 crore), Identified Investments (Rs. 156.70 crore), and Funding Inorganic growth initiatives and general corporate purposes (Rs. 113.87 crore). Out of total net proceeds of Rs. 339.07 crore, Rs. 267.79 crore has been utilized with Rs. 71.28 crore remaining unutilized. The company allotted 4,24,93,786 equity shares aggregating to Rs. 341.24 crore, with Rs. 1.92 crore remaining unpaid by shareholders. A surplus of Rs. 1.55 crore was reported, attributed to investment income on unutilized proceeds and interest from delayed shareholder payments. CARE Ratings Limited serves as the monitoring agency.",
            "Sentiment": "neutral",
            "PublishDate": 1760633112991,
            "Source": "corporate_action"
        },
        {
            "Title": "Aurum PropTech Divests 0.60% Stake in Integrow Asset Management, Acquires Additional 8.2% in K2V2 Technologies",
            "Summary": "Aurum PropTech Limited's board approved two strategic transactions. The company will divest a 0.60% equity stake in Integrow Asset Management Private Limited for INR 0.65619 crore to five buyers including Renaissance Value Creation Advisors LLP and individual investors. The sale agreement was executed on October 16, 2025, with completion expected within 15 days. Additionally, Aurum PropTech has temporarily suspended its majority control rights on Integrow's board from July 1, 2025, to March 31, 2026, with the option to withdraw this suspension anytime. Separately, the company approved acquiring an additional 8.2% equity stake in K2V2 Technologies Private Limited for up to INR 6.33 crore through cash consideration. This acquisition will increase Aurum PropTech's shareholding in K2V2 to 90.14%, strengthening its control over the PropTech subsidiary. K2V2 operates in software development and technology products, serving 650+ developers through its flagship product Sell.do, with a turnover of INR 26.64 crores as of March 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760626009745,
            "Source": "corporate_action"
        },
        {
            "Title": "Aurum PropTech Reports First Profitable Quarter in Q2 FY26 with 30% Revenue Growth",
            "Summary": "Aurum PropTech achieved profitability in Q2 FY26, marking its first profitable quarter. The company reported total income of ₹87.66 crores, representing 30% year-over-year growth from ₹67.61 crores. Key financial improvements included PBT margin of -8% (improvement of 993 basis points from -18%), EBITDA margin of 30% (improvement of 860 basis points from 22%), and adjusted EBITDA margin of 3% (improvement of 733 basis points from -4%). The Distribution business grew 62% year-over-year, with Sell.do closing 170+ enterprise deals and adding 1,400+ new licenses, while implementing AI-led features that improved engineering efficiency by 35%. Aurum Analytica sold 95,000+ leads with 53% year-over-year growth and expanded to 5 new cities. The Rental business demonstrated 25% year-over-year growth with ₹54 crore total income. HelloWorld operates 19,102+ beds across 250+ properties with 73% average occupancy, while NestAway achieved 4x growth in monthly revenue run-rate and launched operations in the U.A.E. The Capital business continued strategic assessment of SM-REIT supply across key micro-markets. Executive Director Onkar Shetye attributed the results to disciplined growth across all verticals and technology-driven innovation.",
            "Sentiment": "positive",
            "PublishDate": 1760620747167,
            "Source": "earnings"
        },
        {
            "Title": "Aurum PropTech Completes INR 86.45 Crore Acquisition of PropTiger Through Share Allotment",
            "Summary": "Aurum PropTech Limited has allotted 42,42,537 equity shares at INR 203.77 per share to REA India Pte Limited, Singapore, to acquire 100% stake in PropTiger Marketing Services Private Limited for INR 86.45 crore. The transaction was structured as a share swap through preferential allotment, giving REA India a 5.54% stake in Aurum post-allotment. PropTiger, incorporated in 2014, operates in the PropTech sector providing property consultancy and marketing services, with a turnover of INR 85.35 crore for the financial year ended March 31, 2025. The acquisition aims to deepen Aurum's existing proptech ecosystem. The Board approved the allotment on September 25, 2025, following shareholder approval at an Extra-Ordinary General Meeting held on August 21, 2025, and in-principle approval from BSE and NSE on September 24, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758809818563,
            "Source": "order&deals"
        },
        {
            "Title": "Aurum PropTech Retains Share Price of INR 203.77 for Preferential Issue Despite Lower DCF Valuation",
            "Summary": "Aurum PropTech Limited provided an update on its preferential issue of 42,42,537 equity shares to REA India Pte Limited, Singapore. The registered valuer issued an addendum confirming the previously determined share price of INR 203.769584 per equity share for the preferential issue. The valuer noted that using the discounted cash flow method, the company's value per share was lower than the price determined under SEBI's preferential issue pricing regulations. However, the valuer retained the original valuation from the August 18, 2025 report. The preferential issue is part of an all-stock strategic equity swap for acquiring 100% of PropTiger Marketing Services Private Limited from REA. The Board approved the transaction on July 23, 2025, and shareholders approved it at an Extraordinary General Meeting on August 21, 2025. The addendum has no impact on the special resolution already passed by shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1757919973929,
            "Source": "corporate_action"
        },
        {
            "Title": "Aurum PropTech Shareholders Approve 100% PropTiger Acquisition and Rights Issue Variation",
            "Summary": "Aurum PropTech Limited shareholders approved two key resolutions at an Extra-Ordinary General Meeting held on August 21, 2025. The first resolution approved the acquisition of a 100% stake in PropTiger Marketing Services Private Limited through a preferential issue of equity shares, receiving 99.99% approval with 38,115,870 votes in favor and only 2,494 votes against. The second resolution approved variation in the objects of a rights issue, passing with 99.99% approval receiving 1,740,038 votes in favor and 2,131 votes against. The meeting was conducted through video conferencing with 61 participants including 1 promoter group member and 60 public shareholders. Both resolutions were passed as special resolutions with the requisite majority.",
            "Sentiment": "positive",
            "PublishDate": 1756106307077,
            "Source": "corporate_action"
        },
        {
            "Title": "Aurum PropTech Issues Corrigendum for EGM on PropTiger Acquisition via Preferential Share Issue",
            "Summary": "Aurum PropTech Limited has issued a corrigendum to its Extra-Ordinary General Meeting notice scheduled for August 21, 2025. The EGM will consider the acquisition of 100% stake in PropTiger Marketing Services Private Limited through a preferential issue of equity shares. REA India Pte Limited, Singapore will be allotted 42,42,537 shares representing 5.5% post-issue shareholding. REA India is owned by REA Group Limited (ASX: REA), which is a subsidiary of News Corp (NASDAQ: NWS). The corrigendum clarifies that there will be no change in management or control, and the preferential issue does not trigger open offer obligations. The shares will be subject to lock-in periods as per SEBI regulations. A valuation report corrigendum dated August 18, 2025 by Nishant Soni & Associates has been provided. Members who have already voted can modify their votes by emailing the scrutinizer before August 20, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755535769755,
            "Source": "corporate_action"
        },
        {
            "Title": "Aurum PropTech Reports 29% Revenue Growth, Acquires PropTiger and Receives SM-REIT License",
            "Summary": "Aurum PropTech Limited reported total revenue growth of 29% year-on-year for the quarter ended June 30, 2025, with revenue from operations at INR 68.40 crores. The company achieved significant margin improvements with profit margins up 852 basis points and EBITDA margins growing 826 basis points year-on-year. EBITDA for the quarter was 28.4% compared to 17.4% in the corresponding previous year quarter. The rental segment contributed 70% of total revenue at INR 47.84 crores, growing 31% year-on-year. The company completed its rights issue, raising INR 341.29 crores across three tranches. Aurum PropTech received SM-REIT registration from SEBI through its subsidiary AMSA Investments and acquired PropTiger from REA India Pte. for a 5.5% stake. PropTiger brings 300+ developer relationships across 8 cities and a 350+ member team. REA Group, a US $20 billion Australian company majority-owned by News Corp, became a strategic shareholder subject to regulatory approvals. The company projects reaching INR 550-575 crores revenue by FY27 for operational breakeven and expects 38% CAGR growth over the next three years.",
            "Sentiment": "positive",
            "PublishDate": 1754054808904,
            "Source": "earnings"
        },
        {
            "Title": "Aurum PropTech Makes Q1 FY 2025-26 Earnings Call Recording Available Online",
            "Summary": "Aurum PropTech Limited has made the audio/video recording of their Q1 FY 2025-26 earnings call presentation available on the company's website. The earnings call was held on July 25, 2025. The company notified stock exchanges BSE and NSE about the availability of the recording, with the communication signed by Company Secretary & Compliance Officer Sonia Jain.",
            "Sentiment": "neutral",
            "PublishDate": 1753467423716,
            "Source": "earnings"
        },
        {
            "Title": "Aurum Proptech Targets EBITDA Breakeven by FY26 Through SaaS Growth and AI Scalability",
            "Summary": "Aurum Proptech has set a target to achieve EBITDA breakeven by FY26. The company plans to reach this goal through high-profit SaaS growth, platform revenue generation, and AI scalability implementation across different business areas.",
            "Sentiment": "positive",
            "PublishDate": 1753368320892,
            "Source": "stock"
        },
        {
            "Title": "Aurum PropTech Reports No Deviation in Rs 334 Crore Rights Issue Fund Utilization",
            "Summary": "Aurum PropTech Limited confirmed no deviation or variation in the use of proceeds from its Rights Issue for the quarter ended June 30, 2025. The company raised Rs 334.18 crore through the Rights Issue with objectives stated in the Letter of Offer dated April 08, 2022. The funds were allocated across four categories: Product Development (Rs 37.5 crore), Product Marketing (Rs 31 crore), Identified Investments (Rs 156.70 crore), and Funding Inorganic growth initiatives and general corporate purposes (Rs 113.87 crore). The company made a final call of Rs 30 per share and received gross proceeds of Rs 131.15 crore. As of June 30, 2025, Rs 5.33 crore in gross proceeds remains to be received. The statement was reviewed by the Audit Committee with no comments from auditors or the committee. CARE Ratings Limited serves as the monitoring agency for the fund utilization.",
            "Sentiment": "neutral",
            "PublishDate": 1753282275082,
            "Source": "corporate_action"
        },
        {
            "Title": "Aurum PropTech Reports 29% Revenue Growth in Q1 FY2026, Appoints New Auditors and Deputy CFO",
            "Summary": "Aurum PropTech Limited reported consolidated total income of ₹77 crores for Q1 FY2026, representing 29% year-on-year growth from ₹60 crores. The company showed significant margin improvements with PBT margin improving to -14% from -22.5% and EBITDA margin rising to 28.4% from 20.2%. The rental business segment grew 31% year-on-year to ₹48 crores, while the distribution business increased 36%. HelloWorld operated 17,900+ beds across 230+ properties with 77% average occupancy and achieved 50% surge in short-stay revenue. NestAway Lite recorded 1,053 bookings during the quarter with EBITDA losses narrowing from -35% to -15%. Aurum Analytica generated ₹13 crores in revenue, marking 64% year-on-year growth. The company received SEBI approval to launch AMSA SM REIT in the capital business segment. The Board approved appointment of M/s. Kirtane and Pandit as statutory auditors for five years from FY 2025-26 to FY 2029-30, M/s. Ainesh Jethwa & Associates as secretarial auditors for the same period, and elevated Shrikant Jagtap from General Manager-Finance to Deputy Chief Financial Officer. All appointments are subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1753265377324,
            "Source": "earnings"
        },
        {
            "Title": "Aurum PropTech Appoints New Auditors and Elevates Finance Executive to Deputy CFO",
            "Summary": "Aurum PropTech Limited's Board approved three key appointments subject to shareholder approval. The company reappointed M/s. Kirtane and Pandit as statutory auditors for five years from FY 2025-26 to FY 2029-30, continuing their existing relationship after completion of their tenure at the 12th Annual General Meeting. M/s. Ainesh Jethwa & Associates was appointed as secretarial auditor for the same five-year period. Additionally, Mr. Shrikant Jagtap, General Manager – Finance, was elevated to Deputy Chief Financial Officer. Jagtap is a Chartered Accountant with over 16 years of experience in finance, accounting, and compliance, having previously worked at companies including Mastek Ltd, Mumbai International Airport, and organizations within the PCCW Group and Mahindra & Mahindra Group.",
            "Sentiment": "positive",
            "PublishDate": 1753264866203,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aurum PropTech Acquires PropTiger for ₹86.45 Crore Through All-Stock Deal",
            "Summary": "Aurum PropTech Limited's Board approved the acquisition of 100% equity shares of PropTiger Marketing Services India Private Limited for ₹86.45 crore through an all-stock equity swap. The company will issue 42,42,537 equity shares with a face value of ₹5 each to REA India Pte Limited as consideration for the acquisition. PropTiger, incorporated in 2014, provides property consultancy and marketing services with a turnover of ₹100.93 crore for 2023-24. The acquisition aims to deepen Aurum's existing proptech ecosystem. REA India will hold 5.54% stake in Aurum post-allotment. The deal requires shareholder approval through an Extraordinary General Meeting scheduled for August 21, 2025, and regulatory approvals. The acquisition will be completed within 15 days of receiving all requisite approvals.",
            "Sentiment": "positive",
            "PublishDate": 1753263474462,
            "Source": "order&deals"
        },
        {
            "Title": "Aurum Proptech Reports Narrower Q1 Loss Despite Revenue Growth",
            "Summary": "Aurum Proptech reported a consolidated net loss of 94 million rupees in Q1, an improvement from the 100 million rupee loss in the same period last year. The company's revenue increased to 684 million rupees compared to 649 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753262972838,
            "Source": "earnings"
        },
        {
            "Title": "Aurum PropTech Schedules Q1 FY2026 Earnings Call for July 25, 2025",
            "Summary": "Aurum PropTech Limited has announced an earnings call scheduled for July 25, 2025, at 4:00 PM IST to discuss the company's performance for the quarter ended June 30, 2025. The one-hour call will feature management representation including the CFO, Founder and CEO of Aurum Ventures, and Executive Director. The company has notified stock exchanges BSE and NSE about the earnings call, with BSE scrip code 539289 and NSE symbol AURUM.",
            "Sentiment": "neutral",
            "PublishDate": 1753158118599,
            "Source": "earnings"
        },
        {
            "Title": "Aurum PropTech Receives SEBI Approval for AMSA Small and Medium REIT Registration",
            "Summary": "Aurum PropTech has obtained SEBI approval for AMSA Small and Medium REIT registration. This regulatory approval enables the company to proceed with its small and medium-sized Real Estate Investment Trust structure.",
            "Sentiment": "positive",
            "PublishDate": 1753014165873,
            "Source": "corporate_action"
        },
        {
            "Title": "Aurum Proptech Reports Q4 Loss, Approves Fund Raising",
            "Summary": "Aurum Proptech reported a consolidated net loss of 72 million rupees in Q4, compared to a loss of 46.5 million rupees in the same period last year. Revenue increased to 704 million rupees from 598 million rupees year-over-year. The company's board has approved fund raising of up to 6 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1745799410000,
            "Source": "default"
        },
        {
            "Title": "Aurum Proptech Approves 6 Billion Rupee Fund Raising",
            "Summary": "The board of Aurum Proptech has approved a plan to raise funds up to 6 billion rupees. This decision indicates the company's intent to secure significant capital, potentially for expansion, debt reduction, or other strategic initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1745598059000,
            "Source": "default"
        },
        {
            "Title": "Aurum Proptech Reports Q4 EBITDA Growth",
            "Summary": "Aurum Proptech's Q4 EBITDA increased to 156 million rupees from 145 million rupees year-over-year. However, the EBITDA margin decreased to 22.18% from 24.31% in the same period.",
            "Sentiment": "neutral",
            "PublishDate": 1745593573000,
            "Source": "result"
        },
        {
            "Title": "Aurum Proptech Reports Increased Q4 Loss and Revenue",
            "Summary": "Aurum Proptech's Q4 consolidated net loss widened to 72 million rupees from 46.5 million rupees in the same quarter last year. However, the company's revenue increased to 704 million rupees from 598 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1745593504000,
            "Source": "result"
        },
        {
            "Title": "Aurum Proptech to Discuss Fundraising Options in Upcoming Board Meeting",
            "Summary": "Aurum Proptech has scheduled a board meeting for April 25 to explore fundraising possibilities through the issuance of various financial instruments or securities.",
            "Sentiment": "neutral",
            "PublishDate": 1745333483000,
            "Source": "default"
        },
        {
            "Title": "Equity Intelligence India Increases Stake in Aurum Proptech",
            "Summary": "Equity Intelligence India Private Limited, a firm associated with Porinju Veliyath, has increased its stake in Aurum Proptech by 0.50% during the third quarter. Following this acquisition, Equity Intelligence India's total shareholding in Aurum Proptech now stands at 3.75%.",
            "Sentiment": "positive",
            "PublishDate": 1737505187000,
            "Source": "corporate_action"
        },
        {
            "Title": "Equity Intelligence India Increases Stake in Aurum Proptech",
            "Summary": "Equity Intelligence India Private Limited, a firm associated with Porinju Veliyath, has increased its stake in Aurum Proptech by 0.50% during the third quarter. Following this acquisition, Equity Intelligence India's total shareholding in the company now stands at 3.75%.",
            "Sentiment": "positive",
            "PublishDate": 1737468777000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aurum Proptech Reports Q3 Financial Results",
            "Summary": "Aurum Proptech announced its Q3 consolidated financial results. The company reported a net loss of 66 million rupees, an improvement from the 185 million rupees loss in the same quarter last year. Revenue increased to 646 million rupees from 573 million rupees year-over-year. EBITDA showed significant improvement, with a gain of 117 million rupees compared to a loss of 21 million rupees in the previous year. The EBITDA margin for Q3 stood at 18.04%.",
            "Sentiment": "positive",
            "PublishDate": 1737418908000,
            "Source": "earnings"
        },
        {
            "Title": "Aurum PropTech Reports Significant EBITDA Improvement in Q3",
            "Summary": "Aurum PropTech has reported a substantial improvement in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) showed a gain of 117 million rupees, compared to a loss of 21 million rupees in the same period last year. This represents a year-over-year turnaround in profitability. Additionally, the company's EBITDA margin for Q3 stood at 18.04%, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1737379616000,
            "Source": "earnings"
        },
        {
            "Title": "Aurum Proptech Reports Q3 Financial Results",
            "Summary": "Aurum Proptech has announced its Q3 financial results. The company reported a consolidated net loss of 66 million rupees, which is an improvement from the 185 million rupee loss in the same quarter last year. However, the loss has increased from 95 million rupees in the previous quarter. Revenue for Q3 stood at 646 million rupees, up from 573 million rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1737379522000,
            "Source": "earnings"
        },
        {
            "Title": "Aurum PropTech: Q2 Results Show Strong Adjusted Revenue and Improving Profitability",
            "Summary": "Aurum PropTech's Q2 results indicate strong adjusted revenue growth and continued improvement in profitability, according to a review by Dolat Capital.",
            "Sentiment": "positive",
            "PublishDate": 1729855204000,
            "Source": "result"
        },
        {
            "Title": "Aurum Proptech Reports Significant Q2 EBITDA Improvement",
            "Summary": "Aurum Proptech has reported a substantial turnaround in its Q2 financial performance. The company achieved an EBITDA profit of 109.1 million rupees, compared to a loss of 76 million rupees in the same quarter last year. Additionally, the EBITDA margin improved significantly, rising to 17.06% from -14.42% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729518040000,
            "Source": "result"
        },
        {
            "Title": "Aurum Proptech Reports Q2 Revenue Growth",
            "Summary": "Aurum Proptech has announced its Q2 revenue figures, showing an increase to 639.6 million rupees from 527.7 million rupees in the same quarter last year, representing year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1729517966000,
            "Source": "result"
        },
        {
            "Title": "Aurum Proptech Reports Q2 Financial Results",
            "Summary": "Aurum Proptech has reported its Q2 consolidated financial results. The company recorded a net loss of 95.5 million rupees, which is an improvement compared to the loss of 201 million rupees in the same quarter last year. However, the loss has slightly increased from 100.3 million rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1729517938000,
            "Source": "result"
        },
        {
            "Title": "Equity Intelligence India Increases Stake in Aurum Proptech",
            "Summary": "<p>Equity Intelligence India Private Limited has <span class='positive'>increased</span> its <span class='positive'>stake</span> in <b>Aurum Proptech</b> by <span class='neutral'>0.48%</span> during the <b>second quarter</b> of the financial year.</p>",
            "Sentiment": "positive",
            "PublishDate": 1729005157000,
            "Source": "corporate_action"
        }
    ]
}