{
    "Symbol": "AUSOMENT",
    "ISIN": "INE218C01016",
    "News": [
        {
            "Title": "AuSom Enterprise Q3FY26 Results Show Strong Growth",
            "Summary": "AuSom Enterprise reported net profit of ₹151.85 lakhs for Q3FY26 vs ₹68.48 lakhs in Q3FY25, with nine-month profit reaching ₹1,339.19 lakhs compared to ₹584.27 lakhs in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770892180628,
            "Source": "co_actions_results"
        },
        {
            "Title": "AuSom Enterprise Reports Strong Q2 Performance with 1597% Profit Surge",
            "Summary": "AuSom Enterprise Limited announced its quarterly results for the second quarter and half year ended September 30, 2025. The company reported a standalone profit of Rs 1,597.16 lakhs for the half year compared to Rs 676.93 lakhs in the previous year, representing significant growth. Revenue from operations reached Rs 59,045.28 lakhs for the half year versus Rs 86,569.42 lakhs in the prior year. The company operates in trading of commodities, bullions, gold jewellery, diamonds, derivatives, shares and securities. The results include consolidated figures incorporating its wholly owned subsidiary Amazo Solar Power Private Limited and joint ventures including Swadeshi Distributors LLP and IGR AuSom LLP. The board meeting was held on November 11, 2025, where directors approved the unaudited financial results along with the limited review report from statutory auditors.",
            "Sentiment": "positive",
            "PublishDate": 1762908698316,
            "Source": "earnings"
        },
        {
            "Title": "Ausom Enterprise Reports Mixed Q1 Results with Profit Growth Despite Revenue Decline",
            "Summary": "Ausom Enterprise reported Q1 consolidated net profit of 148 million rupees, representing a significant increase from 64 million rupees in the same period last year. However, the company's revenue declined to 4.71 billion rupees compared to 8.65 billion rupees year-over-year. The company's EBITDA improved to 124 million rupees from 46 million rupees, while EBITDA margin expanded to 2.64% from 0.53% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754564844366,
            "Source": "earnings"
        },
        {
            "Title": "Ausom Enterprise: Q3 Profit Plummets 81.82% YoY",
            "Summary": "Ausom Enterprise reported Q3 FY25 results with profit falling 81.82% YoY to ₹0.16 crore. Revenue dropped 99.9% YoY to ₹0.2 crore. Operating income declined 245.24% YoY. EPS decreased to ₹0.12, down 81.25% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1739653140000,
            "Source": "earnings"
        },
        {
            "Title": "AUSOM Enterprise Secures 50 MW Solar Power Project in Gujarat",
            "Summary": "AUSOM Enterprise has received a Letter of Intent from Gujarat Urja Vikas Nigam for the supply of a 50 MW solar photovoltaic power project. The project will be executed at a tariff of 2.54 rupees per kilowatt-hour.",
            "Sentiment": "positive",
            "PublishDate": 1731328979000,
            "Source": "corporate_action"
        }
    ]
}