{
    "Symbol": "AUTOIND",
    "ISIN": "INE718H01014",
    "News": [
        {
            "Title": "Autoline Industries Q3FY26 Revenue Jumps 34% YoY",
            "Summary": "Autoline Industries reported strong Q3FY26 results with revenue rising 34% YoY to Rs 20,899 lakhs. Nine-month revenue grew 15% to Rs 53,329 lakhs with profit surging to Rs 2,104 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770465699525,
            "Source": "co_actions_results"
        },
        {
            "Title": "Autoline Industries Allots ₹244.88 Cr Warrants",
            "Summary": "Autoline Industries Limited's board approved allotment of 32.65 lakh convertible warrants worth ₹244.88 crores to promoter Shivaji Tukaram Akhade at ₹75 per warrant on preferential basis.",
            "Sentiment": "neutral",
            "PublishDate": 1770302617760,
            "Source": "co_actions_results"
        },
        {
            "Title": "Autoline Industries EGM Approves ₹24.49 Cr Fund Raise",
            "Summary": "Autoline Industries shareholders unanimously approved both resolutions at January 2, 2026 EGM - authorised capital increase and ₹24.49 crore convertible warrants issuance on preferential basis.",
            "Sentiment": "positive",
            "PublishDate": 1766745539363,
            "Source": "co_actions_results"
        },
        {
            "Title": "Autoline Industries Launches Electric Two-Wheelers",
            "Summary": "Autoline Industries subsidiary launches OXSTARZ electric two-wheelers while commissioning 6.5MW solar power facility expected to save ₹4-5 crores annually in electricity costs.",
            "Sentiment": "positive",
            "PublishDate": 1765460774060,
            "Source": "stocks"
        },
        {
            "Title": "Autoline Industries Calls EGM to Raise Rs 24.49 Crore Through Warrant Issue",
            "Summary": "Autoline Industries scheduled an extraordinary general meeting for January 2, 2026, to approve increasing authorized share capital from Rs 46 crore to Rs 51 crore and issuing 32.65 lakh warrants at Rs 75 each to promoter Shivaji Akhade. The Rs 24.49 crore fundraising aims to meet working capital requirements and support business expansion including the new Sanand, Gujarat facility.",
            "Sentiment": "neutral",
            "PublishDate": 1765358694582,
            "Source": "corporate_action"
        },
        {
            "Title": "Autoline Industries Announces Leadership Changes and Rs. 30.25 Crore Fundraising Through Preferential Issue",
            "Summary": "Autoline Industries appointed Venugopal Rao Pendyala as Group CFO and Shivaji Akhade as CEO, while CFO Uttam Kumar Biswas resigned effective December 31, 2025. The company approved raising funds through issuance of 10,50,000 equity shares at Rs. 75 per share and 30,00,000 warrants aggregating Rs. 22.5 crores to promoters.",
            "Sentiment": "neutral",
            "PublishDate": 1764765058380,
            "Source": "corporate_governance"
        },
        {
            "Title": "Autoline Industries CEO Venugopal Rao Pendyala Resigns, Effective September 30, 2025",
            "Summary": "Venugopal Rao Pendyala resigned from his position as Chief Executive Officer of Autoline Industries Limited, with his resignation taking effect after business hours on September 30, 2025. The company submitted a revised intimation to stock exchanges including the resignation letter copy, which was inadvertently omitted from their earlier corporate announcement dated August 13, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764235980264,
            "Source": "corporate_governance"
        },
        {
            "Title": "Autoline Industries Reports 10.78% Revenue Growth in Q2FY26, Driven by Capacity Expansion",
            "Summary": "Autoline Industries achieved revenue of INR 172.79 crore in Q2FY26, marking 10.78% year-on-year growth, with EBITDA rising 11.56% to INR 16.79 crore and margins improving to 9.72%. The automotive component manufacturer's performance was supported by increased capacities at Chakan and Sanand facilities, strengthened partnerships with Tata Motors, Mahindra, and Ashok Leyland, and favorable market conditions including GST rate cuts and repo rate reductions.",
            "Sentiment": "positive",
            "PublishDate": 1764162885312,
            "Source": "stock"
        },
        {
            "Title": "Autoline Industries Receives Trading Approval for 22 Lakh Equity Shares from Warrant Conversion",
            "Summary": "Autoline Industries Limited received trading approval from NSE and BSE for 22,00,000 equity shares of Rs. 10 each issued at a premium of Rs. 92.50, converted from warrants on a preferential basis to promoters. The shares are listed and admitted for trading from November 20, 2025, with distinctive numbers from 43175402 to 45375401 and a lock-in period until July 31, 2027.",
            "Sentiment": "positive",
            "PublishDate": 1763616150348,
            "Source": "corporate_action"
        },
        {
            "Title": "Autoline Industries Appoints New Chief Business Officer and Chief Operating Officer",
            "Summary": "Autoline Industries Limited announced the appointment of two key managerial personnel during its board meeting on November 08, 2025. Mr. Mayank Sharma has been appointed as Chief Business Officer, effective November 08, 2025. The company created this new position to support expansion and development plans. Sharma was previously the Chief Operating Officer and brings over 35 years of experience in automotive components and manufacturing, having worked with organizations including Lumax Automotive Systems Ltd, Mungi Engineers Pvt. Ltd, and JBM Group. Since joining Autoline Industries in 2019, he has driven operational efficiency and business growth across multiple plants. Additionally, Mr. Kailas Thopate has been appointed as Chief Operating Officer, effective November 08, 2025, filling the position vacated by Sharma's promotion. Thopate has 30 years of experience in operations, business development, and budgeting, and holds an MBA in Finance from IIBM and a Mechanical Engineering degree from Pune University.",
            "Sentiment": "positive",
            "PublishDate": 1762611051958,
            "Source": "corporate_governance"
        },
        {
            "Title": "Autoline Industries Reports 10.78% Revenue Growth in Q2FY26, Receives Best Supplier Award from Tata Motors",
            "Summary": "Autoline Industries Limited announced its financial results for Q2FY26, reporting revenue of INR 172.78 crores, representing a 10.78% year-over-year growth driven by increased OEM customer orders for new model launches. EBITDA increased 11.56% to INR 16.79 crores with margins improving by 7 basis points to 9.72%. For the half-year period, revenue reached INR 324.29 crores with 5.73% growth, while PAT increased 55.16% to INR 16.09 crores, aided by exceptional income of INR 19.1 crores from the sale of Autoline Industrial Park Limited. The company received the Best Supplier Award from Tata Motors Passenger Vehicles Ltd. for outstanding performance in quality and delivery excellence. CEO Shivaji Akhade highlighted strong volume growth from new model launches by OEM partners including Tata Motors, Mahindra and Mahindra, and Ashok Leyland. The company anticipates partial volume recovery in H2FY26 with a robust order book across Auto Components, Tooling, and Non-Auto segments.",
            "Sentiment": "positive",
            "PublishDate": 1762610720648,
            "Source": "earnings"
        },
        {
            "Title": "Autoline Industries Signs Power Purchase Agreement with Hamsa Solar Asset Series 4",
            "Summary": "Autoline Industries Limited has entered into a power purchase agreement with Hamsa Solar Asset Series 4 Private Limited. The agreement enables the power producer to deliver electricity to Autoline Industries as a captive user. The project is scheduled to start from December 2025. Autoline Industries holds a 26% shareholding in Hamsa Solar Asset Series 4 Private Limited. The transaction involves equity shares of Rs. 10 each and falls under related party transactions conducted at arm's length.",
            "Sentiment": "positive",
            "PublishDate": 1762456249060,
            "Source": "stock"
        },
        {
            "Title": "Autoline Industries Presents Investor Summit Presentation, Targets INR 1,000 Cr Revenue by FY27",
            "Summary": "Autoline Industries Limited attended a Virtual Investor Summit on September 22, 2025, and shared its presentation with stock exchanges. The auto component manufacturer reported FY25 revenue of INR 656.93 Cr with 4.6% growth, while EBITDA increased 23% to INR 67.67 Cr with margins improving to 10.03%. The company targets scaling revenue to approximately INR 1,000 Cr by FY27 with a CAGR of 20-25%. Autoline operates 6 manufacturing facilities across India, manufactures over 3,000 components for various vehicle segments, and has strengthened relationships with OEMs including Tata Motors, Mahindra, and MG. The company commenced production at its Industry 4.0-enabled plant in Sanand, Gujarat in April 2024 and raised INR 65.72 crore including INR 22.55 crore from promoters. Recent policy developments including GST reduction on vehicles from 28% to 18% and RBI repo rate cuts are expected to boost demand.",
            "Sentiment": "positive",
            "PublishDate": 1758612781947,
            "Source": "stock"
        },
        {
            "Title": "Autoline Industries Extends Payment Deadline for ₹95.17 Cr Stake Sale",
            "Summary": "Autoline Industries has extended the payment deadline for the sale of its 44.78% stake in Autoline Industrial Parks Ltd to October 30, 2025. The total deal is valued at ₹95.17 crore, with ₹84.50 crore already received by the company.",
            "Sentiment": "neutral",
            "PublishDate": 1758185343529,
            "Source": "order&deals"
        },
        {
            "Title": "Autoline Industries CEO Venugopal Rao Pendyala Resigns; Q1FY26 Revenue Flat at ₹151.51 Cr",
            "Summary": "Autoline Industries Limited announced that CEO Venugopal Rao Pendyala has resigned to pursue opportunities outside the organization, effective September 30, 2025, completing his five-year tenure. Managing Director Shivaji Akhade will assume interim CEO responsibilities until a new CEO takes over on November 1, 2025. The company reported Q1FY26 revenue of ₹151.51 crores, up 0.50% year-over-year, while EBITDA declined to ₹13.28 crores with margins at 8.8% compared to 10.4% in the previous year. Profit before tax surged to ₹19.29 crores, including exceptional income of ₹19.1 crores from the sale of Autoline Industrial Park Limited. The company secured new business wins with Tata Motors for Tiago Tigor EV and Punch MCE programs, and MG Motor India for Windsor business. Management expects partial volume recovery in the second half of FY26 driven by deferred OEM programs and festive season demand.",
            "Sentiment": "neutral",
            "PublishDate": 1755100059509,
            "Source": "corporate_governance"
        },
        {
            "Title": "Autoline Industries Reports 146% Jump in Net Profit to ₹13.32 Crore in Q1 FY26",
            "Summary": "Autoline Industries Limited reported net profit of ₹13.32 crore for the quarter ended June 30, 2025, compared to ₹5.42 crore in the same period last year. Revenue from operations remained flat at ₹151.51 crore versus ₹150.75 crore year-on-year. The company's earnings per share increased to ₹3.08 from ₹1.39 in the previous year quarter. Exceptional items of ₹19.10 crore contributed significantly to the profit growth, primarily from profit on sale of equity share investment. The company's paid-up equity share capital increased to ₹45.37 crore from ₹38.96 crore. During the quarter, the company executed an agreement with Gujarat Industrial Development Corporation for acquisition of 98-year lease land valued at ₹11.12 crore. The auditors issued a qualified review report citing concerns over MAT credit asset of ₹5.97 crore that may not be utilized within the designated period.",
            "Sentiment": "positive",
            "PublishDate": 1755092953374,
            "Source": "earnings"
        },
        {
            "Title": "Autoline Industries: Key Promoters Increase Stakes Through Warrant Conversion",
            "Summary": "Autoline Industries Limited disclosed shareholding changes for two key promoters following warrant conversions into equity shares. Mr. Shivaji Akhade converted 11,00,000 warrants, increasing his holding from 58,49,981 shares (13.55%) to 69,49,981 shares (16.09%). Mr. Sudhir Mungase also converted 11,00,000 warrants, raising his stake from 43,23,431 shares (10.01%) to 54,23,431 shares (12.56%). Both conversions occurred through preferential allotment with intimation received on June 27, 2025. The company's total equity share capital increased from Rs. 43,17,54,010 to Rs. 45,37,54,010 following these conversions. Both individuals are part of the promoter group acting in concert with other promoters including Mr. Vilas Lande and Linc Wise Software Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1754301236769,
            "Source": "corporate_action"
        },
        {
            "Title": "Autoline Industries Expands Audit Committee with Addition of Independent Woman Director",
            "Summary": "Autoline Industries Limited has reconstituted its Audit Committee by adding Mrs. Rajashri Sai as a new Independent Woman Director. The committee now comprises four members, expanding from its previous three-member structure. The existing members - Mr. Vinayak Janardan Jadhav (Chairperson), Mr. Kishor Piraji Kharat (Member), and Mr. Shivaji Tukaram Akhade (Member) - retain their positions. The reconstitution was approved through a Board Circular Resolution and became effective immediately on July 29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753790615221,
            "Source": "corporate_governance"
        },
        {
            "Title": "Autoline Industries Secures ₹30 Crore Order from Mahindra & Mahindra",
            "Summary": "Autoline Industries has secured a significant order worth ₹30 crores from Mahindra & Mahindra (M&M) for components of the Scorpio and XUV 3XO models. This order represents a major business opportunity for Autoline Industries and strengthens its position as a supplier in the automotive industry.",
            "Sentiment": "positive",
            "PublishDate": 1738068023000,
            "Source": "order&deals"
        },
        {
            "Title": "CJ Holdings North America Files Complaint Against Autoline Industries",
            "Summary": "Autoline Industries has reported that CJ Holdings North America has filed a complaint against the company. The nature and details of the complaint are not specified in the given news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1732106787000,
            "Source": "corporate_action"
        }
    ]
}