{
    "Symbol": "AUTOAXLES",
    "ISIN": "INE449A01011",
    "News": [
        {
            "Title": "Automotive Axles Q3 Net Profit Dips to ₹388M",
            "Summary": "Automotive Axles reports Q3 net profit of ₹388 million compared to ₹395 million in the previous year, while revenue increased to ₹5.6 billion from ₹5.30 billion year-on-year.",
            "Sentiment": "neutral",
            "PublishDate": 1770216643512,
            "Source": "co_actions_results"
        },
        {
            "Title": "Automotive Axles Gets Credit Rating Reaffirmed",
            "Summary": "ICRA Limited reaffirmed Automotive Axles Limited's credit rating at [ICRA]AA-(Stable)/[ICRA]A1+ for Rs. 135.00 crore facilities across three banks on February 2, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770028070867,
            "Source": "stocks"
        },
        {
            "Title": "Automotive Axles Q3FY26 Results Call on Feb 6",
            "Summary": "Automotive Axles Limited schedules conference call for February 6, 2026 at 10:00 AM IST to discuss Q3FY26/9M FY26 financial performance with key management representatives.",
            "Sentiment": "neutral",
            "PublishDate": 1769690882782,
            "Source": "stocks"
        },
        {
            "Title": "Automotive Axles ESG Rating Improves to 71.0 in 2025",
            "Summary": "Automotive Axles Limited receives improved ESG score of 71.0 for 2025 from SES ESG Research, up from 68.8 in 2024, reflecting enhanced environmental performance and sustainability initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1767598570451,
            "Source": "stocks"
        },
        {
            "Title": "Automotive Axles CFO Ranganathan S Superannuates After 11-Year Tenure",
            "Summary": "Ranganathan S has superannuated from his position as Chief Financial Officer at Automotive Axles Limited effective November 22, 2025, after serving for 11 years. His original superannuation date was April 16, 2025, which had been extended by one year, but he chose to proceed earlier due to personal reasons.",
            "Sentiment": "neutral",
            "PublishDate": 1763793132754,
            "Source": "corporate_governance"
        },
        {
            "Title": "Automotive Axles Q2FY26 Revenue Drops 6% to ₹470 Crores Despite Market Headwinds",
            "Summary": "Automotive Axles Limited reported quarterly revenue of ₹470 crores, down 6% from the previous quarter, with half-year revenue at ₹969 crores, declining 3% year-on-year. The company achieved EBITDA margin of 12.4% compared to 11.7% in the previous quarter and 11.4% in the same period last year. The decline was attributed to product mix changes, reduced tipper sales due to monsoon season, and impact from tariffs on exports, particularly from the US market which is down 30-40%. The MHCV market did around 95,000-98,000 vehicles in the quarter. The company launched new products including a 15-meter bus axle and axles for electric vehicle applications (4x2 electric tractor trailer and 8x4 electric tipper). Automotive Axles won a silver award from Ashok Leyland for aftermarket performance, achieving 98% delivery performance. Management expects Q3 and Q4 to end strongly, potentially better than last year, supported by GST revisions and domestic consumption. The company maintains 60-70% share of business with Ashok Leyland and high double-digit share with Mahindra and Daimler. CFO Ranganathan S. announced his retirement effective November 21st after 11 years with the company.",
            "Sentiment": "neutral",
            "PublishDate": 1762242489984,
            "Source": "earnings"
        },
        {
            "Title": "Automotive Axles Expects Strong Performance in Q3 and Q5, Anticipating Better Results Than Previous Year",
            "Summary": "Automotive Axles anticipates a strong finish in Q3 and Q5, with expectations to outperform the previous year's results. The company shared these projections during conference call updates.",
            "Sentiment": "positive",
            "PublishDate": 1761987355940,
            "Source": "stock"
        },
        {
            "Title": "Automotive Axles Limited Announces Quarterly Results and CFO Departure",
            "Summary": "Automotive Axles Limited's Board of Directors approved unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported total assets of ₹13,283.69 million and total equity of ₹10,065.23 million as of September 30, 2025. Additionally, the company announced that Mr. Ranganathan S will cease to hold the position of Chief Financial Officer effective November 22, 2025, due to superannuation from his service. The Board meeting was held on October 30, 2025, and the financial results were reviewed by statutory auditors M/s SR Batliboi Associates LLP.",
            "Sentiment": "neutral",
            "PublishDate": 1761851746283,
            "Source": "earnings"
        },
        {
            "Title": "Automotive Axles Reports Mixed Q2 Results with Revenue Decline but Improved Margins",
            "Summary": "Automotive Axles reported quarterly net profit of 359.5 million rupees, nearly flat compared to 359.7 million rupees in the same period last year. Revenue declined to 4.61 billion rupees from 4.95 billion rupees year-over-year. EBITDA decreased to 482.9 million rupees from 510.9 million rupees, while EBITDA margin improved to 10.46% from 10.33% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1761831975583,
            "Source": "earnings"
        },
        {
            "Title": "Automotive Axles Reports Flat Revenue Growth But Improved Margins in Q1 FY26",
            "Summary": "Automotive Axles Limited reported revenue of INR 498 crores for Q1 FY26, remaining flat compared to the same period last year. However, the company improved its EBITDA margin from 11.2% to 11.7% and PAT margin from 6.9% to 7.3%. The company implemented a new business model consolidating sales at Automotive Axles level instead of routing through Meritor HVS India Limited, with management expecting marginal margin improvements. The overall commercial vehicle market is expected to be flat or down 4% this year, with Q2 anticipated to be softer due to inventory buildup and monsoon impact, while recovery is expected in Q3 and Q4. The company has approved INR 120 crore capex for capacity enhancement and automation, targeting to double revenue by FY30. New products including 13.5m and 15m bus axles are in prototype stage, while exports face challenges from tariff discussions and low demand in North America.",
            "Sentiment": "neutral",
            "PublishDate": 1754741236191,
            "Source": "earnings"
        },
        {
            "Title": "Automotive Axles Limited Reports Q1 Results with 4.9% Revenue Growth",
            "Summary": "Automotive Axles Limited's Board approved quarterly results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 4,893.76 million compared to Rs 4,924.67 million in the same quarter last year. Total income reached Rs 4,985.42 million versus Rs 4,988.76 million in the previous year quarter. Profit for the period stood at Rs 357.21 million, up from Rs 340.54 million in the corresponding quarter of the previous year. Earnings per share increased to Rs 23.64 from Rs 22.53 in the same quarter last year. The company operates as a manufacturer of automotive components with no subsidiary, associate, or joint venture companies. The results were reviewed by the Audit Committee and approved by the Board of Directors.",
            "Sentiment": "positive",
            "PublishDate": 1754400485126,
            "Source": "earnings"
        },
        {
            "Title": "Automotive Axles Q4 Results and Dividend Announcement",
            "Summary": "Automotive Axles has reported its Q4 financial results. The company's revenue decreased to 5.6 billion rupees from 5.72 billion rupees year-over-year. EBITDA slightly declined to 626.3 million rupees from 637.1 million rupees, while EBITDA margin improved marginally to 11.19% from 11.15%. Net profit increased to 459.3 million rupees from 441 million rupees year-over-year and 395.8 million rupees quarter-over-quarter. The company has recommended a final dividend of 30.50 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1747750391000,
            "Source": "result"
        },
        {
            "Title": "Automotive Axles Enters Services Agreement with Meritor HVS India",
            "Summary": "Automotive Axles Limited has entered into a services agreement with Meritor HVS India. This partnership likely involves the provision of automotive axle-related services or technology exchange between the two companies in the Indian market.",
            "Sentiment": "neutral",
            "PublishDate": 1743466136000,
            "Source": "corporate_action"
        },
        {
            "Title": "Automotive Axles Enters Service Agreement with Meritor HVS India",
            "Summary": "Automotive Axles Limited has announced that it has entered into a services agreement with Meritor HVS India. This agreement likely involves collaboration or provision of services between the two companies in the automotive components sector.",
            "Sentiment": "neutral",
            "PublishDate": 1743426017000,
            "Source": "corporate_action"
        },
        {
            "Title": "Automotive Axles Enters Binding MOU with Meritor HVS",
            "Summary": "Automotive Axles Limited has entered into a binding Memorandum of Understanding (MOU) with Meritor HVS. This agreement suggests a potential strategic partnership or collaboration between the two companies in the automotive components sector.",
            "Sentiment": "positive",
            "PublishDate": 1742460910000,
            "Source": "corporate_action"
        },
        {
            "Title": "Automotive Axles Reports Q3 Revenue of 5.3 Billion Rupees",
            "Summary": "Automotive Axles Limited has reported its third-quarter revenue at 5.3 billion rupees, showing a slight decrease compared to 5.4 billion rupees in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1738658408000,
            "Source": "earnings"
        },
        {
            "Title": "Automotive Axles Reports Slight Increase in Q3 Net Profit",
            "Summary": "Automotive Axles Limited has reported a net profit of 396 million rupees for the third quarter, compared to 391.5 million rupees in the same period last year. This represents a marginal year-over-year increase in the company's profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1738658385000,
            "Source": "earnings"
        },
        {
            "Title": "Automotive Axles: Shareholders Reject Affiliate Deals Worth ₹2,500 Crore",
            "Summary": "Public shareholders of Automotive Axles have voted against proposed transactions worth ₹2,500 crore with affiliate company Meritor HVS India for FY26. 79% of institutional investors and 88% of non-institutional investors opposed the resolution. Proxy advisors criticized the proposal, arguing for direct business through the listed company.",
            "Sentiment": "negative",
            "PublishDate": 1734482839000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Automotive Axles Plans New Product Launches",
            "Summary": "Automotive Axles is focusing on new product development, with plans to launch a new bus axle in mid-next year. Additional new products are expected to be introduced in the coming months, potentially increasing the company's market share to over 65%.",
            "Sentiment": "positive",
            "PublishDate": 1730776459000,
            "Source": "corporate_action"
        },
        {
            "Title": "Automotive Axles Plans INR200 Crore Investment and Expects EBITDA Growth",
            "Summary": "Automotive Axles has announced plans to invest approximately INR200 crores over the next two to three years. The company also projects a significant improvement in its EBITDA, expecting it to be 20% to 25% higher than current levels over the next three years, even if the market only grows to 450,000 vehicles.",
            "Sentiment": "positive",
            "PublishDate": 1730776304000,
            "Source": "corporate_action"
        },
        {
            "Title": "Automotive Axles Forecasts Production Increase for Q3 and Q4",
            "Summary": "Automotive Axles has provided production forecasts for the upcoming quarters. The company expects Q3 production to be between 90,000 to 95,000 units, with Q4 projected to exceed 100,000 units. However, the company anticipates a flat market for both the current and next year, as per their concall update.",
            "Sentiment": "neutral",
            "PublishDate": 1730776233000,
            "Source": "corporate_action"
        },
        {
            "Title": "Automotive Axles Reports Q2 EBITDA Decline",
            "Summary": "Automotive Axles has reported a decrease in its Q2 EBITDA, which fell to 510 million rupees from 660 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 10.33% from 11.30% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730294521000,
            "Source": "result"
        },
        {
            "Title": "Automotive Axles Reports Q2 Revenue Decline",
            "Summary": "Automotive Axles has reported a revenue of 4.9 billion rupees for the second quarter, compared to 5.8 billion rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1730294512000,
            "Source": "result"
        },
        {
            "Title": "Automotive Axles Reports Q2 Net Profit Decline",
            "Summary": "Automotive Axles has reported a net profit of 360 million rupees for the second quarter, showing a year-over-year decrease from 451 million rupees. However, there's a slight quarter-over-quarter increase from 340 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1730294495000,
            "Source": "result"
        }
    ]
}