{
    "Symbol": "AVADHSUGAR",
    "ISIN": "INE349W01017",
    "News": [
        {
            "Title": "Avadh Sugar Board Meet Set for Feb 5 for Q3 Results",
            "Summary": "Avadh Sugar & Energy Limited has scheduled its board meeting for February 5, 2026, to consider and approve unaudited financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769702602663,
            "Source": "co_actions_results"
        },
        {
            "Title": "Avadh Sugar Energy Appoints Agha Asif Beig as Chief Operating Officer",
            "Summary": "Avadh Sugar Energy Limited has appointed Mr. Agha Asif Beig as Chief Operating Officer in the Senior Management Personnel category with effect from 26th September 2025. The appointee brings over 30 years of leadership experience in managing integrated Sugar Distillery units and holds an M.Sc. (Agri) in Entomology.",
            "Sentiment": "positive",
            "PublishDate": 1764148297924,
            "Source": "corporate_governance"
        },
        {
            "Title": "Avadh Sugar & Energy Reports Q2 Net Loss of 6.6M Rupees Despite Revenue Growth",
            "Summary": "Avadh Sugar & Energy reported a net loss of 6.6 million rupees in Q2, compared to a profit of 8.3 million rupees in the same period last year. Revenue increased to 6.68 billion rupees from 6.32 billion rupees year-over-year. However, EBITDA declined significantly to 179 million rupees from 336 million rupees, while EBITDA margin compressed to 2.68% from 5.32% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762777990890,
            "Source": "earnings"
        },
        {
            "Title": "Avadh Sugar & Energy Shareholders Approve Chandra Shekhar Nopany's Appointment as Managing Director",
            "Summary": "Avadh Sugar & Energy Limited shareholders approved the appointment of Mr. Chandra Shekhar Nopany as Managing Director and Co-Chairperson through a postal ballot process. The special resolution was passed with 97.71% votes in favor, with 175 members supporting and 33 opposing the proposal. The appointment is effective from September 1, 2025, to August 31, 2030, for a five-year term. The e-voting process ran from August 14 to September 12, 2025, with 208 members participating out of 25,806 total shareholders. Mohan Ram Goenka served as the scrutinizer for the voting process.",
            "Sentiment": "positive",
            "PublishDate": 1757687223437,
            "Source": "corporate_governance"
        },
        {
            "Title": "Avadh Sugar & Energy Seeks Shareholder Approval for Managing Director Appointment via Postal Ballot",
            "Summary": "Avadh Sugar & Energy Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. Chandra Shekhar Nopany as Managing Director designated as Co-Chairperson for a five-year term from September 1, 2025 to August 31, 2030. The remote e-voting period runs from August 14, 2025 to September 12, 2025. Mr. Nopany, currently a Non-Executive Director since July 2016, will receive a monthly salary of Rs. 25 lakh plus 5% commission on net profits, subject to Companies Act limits. The 59-year-old chartered accountant brings industrial experience across sugar, tea, shipping, textiles, and fertilizers sectors. He holds directorships in eight other public companies including Chambal Fertilisers and Chemicals Limited and Sutlej Textiles and Industries Limited. The appointment requires special resolution approval from shareholders through electronic voting only.",
            "Sentiment": "neutral",
            "PublishDate": 1755092525502,
            "Source": "corporate_action"
        },
        {
            "Title": "Avadh Sugar & Energy Reports Net Loss of ₹841 Lakhs, Appoints New Managing Director",
            "Summary": "Avadh Sugar & Energy Limited reported a net loss of ₹841.38 lakhs for the quarter ended June 30, 2025, compared to a net profit of ₹868.80 lakhs in the corresponding quarter of the previous year. Revenue from operations increased to ₹71,660.81 lakhs from ₹70,799.03 lakhs year-over-year. The company's board appointed Mr. Chandra Shekhar Nopany as Managing Director and Co-Chairperson for a 5-year term starting September 1, 2025, subject to shareholder approval. Mr. Pankaj Goenka was appointed as Senior Management Personnel with immediate effect. The sugar segment generated revenue of ₹58,761.35 lakhs, while distillery operations contributed ₹16,506.77 lakhs during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754297552200,
            "Source": "earnings"
        },
        {
            "Title": "Avadh Sugar & Energy Reports Mixed Q1 Results with Revenue Growth but EBITDA Decline",
            "Summary": "Avadh Sugar & Energy reported Q1 revenue of 7.2 billion rupees, showing a slight increase from 7.1 billion rupees in the same period last year. However, the company's EBITDA declined significantly to 282 million rupees compared to 573 million rupees year-over-year. The EBITDA margin also compressed to 3.9% from 8.1% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754297120170,
            "Source": "earnings"
        },
        {
            "Title": "Avadh Sugar & Energy Reports Q1 Net Loss of 84 Million Rupees",
            "Summary": "Avadh Sugar & Energy reported a net loss of 84 million rupees in Q1, compared to a profit of 87 million rupees in the same period last year. This represents a significant year-over-year decline in financial performance for the company.",
            "Sentiment": "negative",
            "PublishDate": 1754296761309,
            "Source": "earnings"
        },
        {
            "Title": "Avadh Sugar & Energy Recommends Final Dividend",
            "Summary": "Avadh Sugar & Energy has recommended a final dividend of 10 rupees per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1747041455000,
            "Source": "result"
        },
        {
            "Title": "Avadh Sugar & Energy Reports Strong Q4 Financial Performance",
            "Summary": "Avadh Sugar & Energy has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 1.49 billion rupees from 1.21 billion rupees in the previous year. The EBITDA margin also improved, rising to 21.99% from 19.55%. Additionally, the company reported a net profit of 717 million rupees, up from 553 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747041223000,
            "Source": "result"
        },
        {
            "Title": "Avadh Sugar & Energy Reports Q3 Revenue Growth",
            "Summary": "Avadh Sugar & Energy has announced its financial results for the third quarter. The company reported revenue of 6.2 billion rupees, compared to 5.9 billion rupees in the same quarter of the previous year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1739177625000,
            "Source": "earnings"
        },
        {
            "Title": "Avadh Sugar & Energy Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Avadh Sugar & Energy has reported a significant decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 359 million rupees from 589 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin contracted to 5.83% from 9.92% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739177540000,
            "Source": "earnings"
        },
        {
            "Title": "Avadh Sugar & Energy Reports Decline in Q3 Net Profit",
            "Summary": "Avadh Sugar & Energy has reported a net profit of 67 million rupees for the third quarter, marking a significant decrease from 218 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739177486000,
            "Source": "earnings"
        },
        {
            "Title": "Avadh Sugar & Energy to Expand Rosa Unit's Sugarcane Crushing Capacity",
            "Summary": "Avadh Sugar & Energy has announced plans to increase the sugarcane crushing capacity at its Rosa unit from 5,000 TCD (Tonnes Crushed per Day) to 6,500 TCD. The company will invest 953.7 million rupees for this expansion project.",
            "Sentiment": "positive",
            "PublishDate": 1731403031000,
            "Source": "corporate_action"
        },
        {
            "Title": "Avadh Sugar & Energy Reports Decline in Q2 EBITDA",
            "Summary": "Avadh Sugar & Energy has reported a significant decrease in its Q2 EBITDA, which fell to 336 million rupees from 771 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 5.32% from 9.67% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731402909000,
            "Source": "result"
        },
        {
            "Title": "Avadh Sugar & Energy Reports Q2 Revenue Decline",
            "Summary": "Avadh Sugar & Energy has reported a revenue of 6.3 billion rupees for the second quarter, down from 8 billion rupees in the same quarter last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731402801000,
            "Source": "result"
        },
        {
            "Title": "Avadh Sugar & Energy Reports Significant Drop in Q2 Net Profit",
            "Summary": "Avadh Sugar & Energy has reported a substantial decrease in its second-quarter net profit. The company's net profit for Q2 fell to 8.3 million rupees, down from 289 million rupees in the same period last year. This represents a year-over-year decline of approximately 97%.",
            "Sentiment": "negative",
            "PublishDate": 1731402775000,
            "Source": "result"
        }
    ]
}