{
    "Symbol": "AVALON",
    "ISIN": "INE0LCL01028",
    "News": [
        {
            "Title": "Avalon Technologies Q3 FY26 Earnings Call Transcript",
            "Summary": "Avalon Technologies Limited has released the transcript of its Q3 FY26 earnings call held on February 05, 2026, for the quarter ended December 31, 2025, in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770820165109,
            "Source": "co_actions_results"
        },
        {
            "Title": "Avalon Technologies Director Bhaskar Srinivasan Resigns",
            "Summary": "Avalon Technologies announces resignation of Non-Executive Director Mr. Bhaskar Srinivasan effective February 10, 2026, citing personal priorities and professional opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1770721863327,
            "Source": "stocks"
        },
        {
            "Title": "Avalon Technologies Q3FY26 Results Show Strong Growth",
            "Summary": "Avalon Technologies reported robust Q3FY26 performance with consolidated revenue rising 48.68% YoY to ₹4,175.42 million and net profit growing 35.91% to ₹326.02 million, driven by strong EMS demand.",
            "Sentiment": "positive",
            "PublishDate": 1770213864736,
            "Source": "co_actions_results"
        },
        {
            "Title": "Avalon Technologies Gets Credit Rating Outlook Upgrade",
            "Summary": "India Ratings revises Avalon Technologies' outlook to Positive from Stable while affirming IND A-/IND A1 ratings on INR 1,415 million bank loan facilities.",
            "Sentiment": "positive",
            "PublishDate": 1769797039638,
            "Source": "stocks"
        },
        {
            "Title": "Avalon Technologies Board Meet Set for Feb 4, 2026",
            "Summary": "Avalon Technologies Limited has scheduled a board meeting on February 04, 2026, to consider and approve Q3FY26 unaudited standalone and consolidated financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769519341154,
            "Source": "co_actions_results"
        },
        {
            "Title": "Avalon Technologies Allots 24,946 ESOP Shares",
            "Summary": "Avalon Technologies allotted 24,946 equity shares to employees under ESOP exercise at ₹20 per share, increasing paid-up capital from ₹13.35 crores to ₹13.35 crores on December 24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766573803303,
            "Source": "co_actions_results"
        },
        {
            "Title": "Avalon Technologies Reports Strong Q2 FY26 Results with 39.1% YoY Revenue Growth",
            "Summary": "Avalon Technologies Limited announced its quarterly results for the quarter ended September 30, 2025. Revenue from operations grew 39.1% year-on-year to INR 382.5 crores and 18.3% quarter-on-quarter. EBITDA margin stood at 10.1% while PAT margin was 6.4%. For the half-year period, revenue increased 48.7% to INR 705.8 crores with EBITDA margin at 9.7% and PAT margin at 5.5%. The company's order book increased 25.4% year-on-year. India manufacturing, representing 81% of revenue, delivered 14.1% EBITDA and 10.9% PAT margins. The company secured AS9100D aerospace quality certification and won supplier of the year award from a railway OEM. Avalon operates in the Electronics Manufacturing Services industry with manufacturing facilities in both India and the US, serving sectors including clean energy, transportation, industrials, communication and medical devices.",
            "Sentiment": "positive",
            "PublishDate": 1762372476547,
            "Source": "earnings"
        },
        {
            "Title": "Avalon Technologies Releases Earnings Call Transcript for Quarter Ended June 30, 2025",
            "Summary": "Avalon Technologies Limited has made available the transcript of their earnings call for the quarter ended June 30, 2025. The transcript can be accessed through a link on the company's website. This follows their earlier submission of the audio recording of the same earnings call on August 06, 2025. The company submitted this information to both BSE Limited and the National Stock Exchange of India Limited on August 12, 2025, with Company Secretary & Compliance Officer Mr. Ajay Shukla handling the submission.",
            "Sentiment": "neutral",
            "PublishDate": 1755017620812,
            "Source": "earnings"
        },
        {
            "Title": "Avalon Technologies Plans Expansion Across Multiple Sectors With ₹1,790 Crore Order Book",
            "Summary": "Avalon Technologies has announced plans for significant growth backed by an order book worth ₹1,790 crore. The company is expanding into semiconductor equipment manufacturing, clean energy, electric vehicles, and aerospace sectors. The growth strategy involves implementing an India-US hybrid model, focusing on high-profit box builds, and securing long-term contracts to enhance profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754411919897,
            "Source": "stock"
        },
        {
            "Title": "Avalon Tech Reports Strong Q1 Turnaround with 142M Rupees Net Profit",
            "Summary": "Avalon Tech delivered a strong quarterly performance, reporting a net profit of 142 million rupees compared to a loss of 23 million rupees in the same period last year. Revenue increased significantly to 3.23 billion rupees from 1.99 billion rupees year-over-year. The company's EBITDA surged to 299 million rupees from 44 million rupees, while EBITDA margin expanded to 9.24% from 2.19% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754408888789,
            "Source": "earnings"
        },
        {
            "Title": "Avalon Technologies Schedules Q1 FY26 Earnings Call for August 6, 2025",
            "Summary": "Avalon Technologies Limited will host an earnings call on August 6, 2025, at 15:30 IST to discuss its quarterly financial results ended June 30, 2025. The call will follow the announcement of both standalone and consolidated unaudited financial results. Dial-in details and timings are available on the company's website. The announcement was made by Company Secretary & Compliance Officer Ajay Shukla to BSE and NSE stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1753447884263,
            "Source": "earnings"
        },
        {
            "Title": "Avalon Technologies Schedules Board Meeting to Approve Quarterly Financial Results",
            "Summary": "Avalon Technologies Limited has scheduled a Board of Directors meeting on August 5, 2025, to approve the Standalone and Consolidated Unaudited Financial Results for the Quarter Ended June 30, 2025. The meeting notice was signed by Mr. Ajay Shukla, Company Secretary & Compliance Officer, on July 25, 2025. The company is listed on BSE with scrip code 543896 and on NSE with symbol AVALON.",
            "Sentiment": "neutral",
            "PublishDate": 1753446743540,
            "Source": "corporate_action"
        },
        {
            "Title": "Avalon Tech Reports Significant Profit and Revenue Growth in Q4",
            "Summary": "Avalon Tech has announced its Q4 financial results, showing substantial year-over-year growth. The company's consolidated net profit increased to 242.8 million rupees, up from 70.6 million rupees in the same quarter last year. This also represents a quarter-over-quarter increase from 239.9 million rupees. Revenue for Q4 rose to 3.43 billion rupees, compared to 2.17 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1746576780000,
            "Source": "default"
        },
        {
            "Title": "Avalon Tech Reports Strong Q4 Financial Results",
            "Summary": "Avalon Tech has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 413.5 million rupees from 172.6 million rupees in the previous year, with EBITDA margin expanding to 12.1% from 7.96%. Revenue grew to 3.43 billion rupees from 2.17 billion rupees. Consolidated net profit rose to 242.8 million rupees, up from 70.6 million rupees year-over-year and 239.9 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1746550215000,
            "Source": "result"
        },
        {
            "Title": "Avalon Tech to Consider Q4 Results on May 6",
            "Summary": "Avalon Technologies Limited has announced that it will consider and approve its financial results for the fourth quarter on May 6.",
            "Sentiment": "neutral",
            "PublishDate": 1745845288000,
            "Source": "default"
        },
        {
            "Title": "Avalon Technologies Approves Investment in Zepco Technologies",
            "Summary": "The board of directors of Avalon Technologies has approved an investment in Zepco Technologies. This decision indicates a strategic move by Avalon Technologies to expand its portfolio or capabilities through investment in another technology company.",
            "Sentiment": "positive",
            "PublishDate": 1744284589000,
            "Source": "corporate_action"
        },
        {
            "Title": "Avalon Technologies: Upgrades Rating and Target Price on Strong Growth Outlook",
            "Summary": "Systematix has upgraded both the rating and target price for Avalon Technologies following the company's Q3 results. Avalon has increased its FY25 growth guidance to 22-24% from 16-18% previously, after reporting a 16% YoY revenue rise in 9M. The company maintains its guidance to double revenue in the next three years.",
            "Sentiment": "positive",
            "PublishDate": 1738913625000,
            "Source": "earnings"
        },
        {
            "Title": "Avalon Tech Reports Strong Q3 Financial Results",
            "Summary": "Avalon Tech has announced its Q3 consolidated financial results, showing significant year-over-year and quarter-over-quarter growth. The company's net profit increased to 239.9 million rupees, up from 65.8 million rupees in the same quarter last year and 174.8 million rupees in the previous quarter. Revenue also saw a substantial rise, reaching 2.81 billion rupees compared to 2.1 billion rupees in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1738801184000,
            "Source": "earnings"
        },
        {
            "Title": "Avalon Technologies Reports Significant Increase in Q3 EBITDA and Margin",
            "Summary": "Avalon Technologies has announced its Q3 financial results, showing substantial year-over-year improvements. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) rose to 346.3 million rupees, up from 165.5 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 12.33% from 7.72% in the previous year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738770067000,
            "Source": "earnings"
        },
        {
            "Title": "Avalon Technologies Reports Q3 Revenue Growth",
            "Summary": "Avalon Technologies has announced its Q3 revenue figures, showing a significant year-over-year increase. The company reported revenue of 2.81 billion rupees for the quarter, compared to 2.1 billion rupees in the same period last year. This represents a substantial growth in the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1738770060000,
            "Source": "earnings"
        },
        {
            "Title": "Avalon Technologies Reports Significant Profit Growth in Q3",
            "Summary": "Avalon Technologies has reported a substantial increase in consolidated net profit for the third quarter. The company's net profit rose to 239.9 million rupees, up from 65.8 million rupees in the same quarter last year. This also represents a significant increase from the previous quarter's profit of 174.8 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738770054000,
            "Source": "earnings"
        },
        {
            "Title": "Avalon Technologies to Consider Q3 Results",
            "Summary": "Avalon Technologies has announced that it will consider its third quarter (Q3) financial results on February 5. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737981431000,
            "Source": "earnings"
        },
        {
            "Title": "Avalon Technologies: Q2 Results Trigger 19% Stock Surge",
            "Summary": "Avalon Technologies' shares rose 19% after Q2 results beat expectations. Revenue increased 37% to ₹275 crore, EBITDA margin expanded to 10.9%, and net profit grew to ₹17.4 crore. Order book stands at ₹1,485 crore, up 19.4% YoY. New export plant started operations, and Suresh Veerappan appointed as new CFO.",
            "Sentiment": "positive",
            "PublishDate": 1730964202000,
            "Source": "result"
        },
        {
            "Title": "Avalon Tech Reports Strong Q2 EBITDA Growth",
            "Summary": "Avalon Tech has announced its Q2 financial results, showing significant year-over-year improvement. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 301.4 million rupees, up from 126 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 10.96% from 6.26% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1730905783000,
            "Source": "result"
        },
        {
            "Title": "Avalon Technologies Reports Mixed Q2 Financial Results",
            "Summary": "Avalon Technologies has reported its Q2 consolidated net profit at 174.8 million rupees, showing a significant year-over-year increase from 72.8 million rupees. However, the company experienced a loss of 23.1 million rupees compared to the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1730905763000,
            "Source": "result"
        },
        {
            "Title": "Avalon Technologies: Recovery and Growth Repositioning",
            "Summary": "<p><span class=\"positive\">Motilal Oswal</span> reports that <b>Avalon Technologies</b> is showing signs of <span class=\"positive\">recovery</span> and is being <span class=\"positive\">repositioned</span> for <span class=\"positive\">growth</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728455982000,
            "Source": "normal_news"
        }
    ]
}