{
    "Symbol": "AVANTEL",
    "ISIN": "INE005B01027",
    "News": [
        {
            "Title": "Avantel Secures Rs.122.58 Crore Order from NSIL",
            "Summary": "Avantel Limited receives significant purchase order worth Rs.122.58 crores from NewSpace India Limited for supply of S/X-band with Ka-band ready full motion antennas, to be executed by August 2027.",
            "Sentiment": "positive",
            "PublishDate": 1770812877319,
            "Source": "co_actions_results"
        },
        {
            "Title": "Avantel Allots 1.91 Lakh Shares Under ESOP 2023",
            "Summary": "Avantel Limited allotted 1,91,140 equity shares to employees under ESOP 2023, increasing paid-up capital from Rs.53,09,33,860 to Rs.53,13,16,140 with shares priced at Rs.50 each.",
            "Sentiment": "positive",
            "PublishDate": 1769584127493,
            "Source": "co_actions_results"
        },
        {
            "Title": "Avantel Submits Q3FY26 Rights Issue Monitoring Report",
            "Summary": "Avantel Limited submitted monitoring agency report for Q3FY26 showing Rs. 16.43 crore utilization during quarter with no deviations from rights issue objectives worth Rs. 80.91 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1769414164531,
            "Source": "co_actions_results"
        },
        {
            "Title": "Avantel Q3FY26 Results: Revenue Drops 27.3% YoY",
            "Summary": "Avantel Limited reported Q3FY26 standalone revenue of ₹5,124.52 lakhs, down 27.3% YoY from ₹7,043.83 lakhs. Net profit fell 77.7% to ₹465.74 lakhs vs ₹2,090.48 lakhs in Q3FY25.",
            "Sentiment": "negative",
            "PublishDate": 1769330606166,
            "Source": "co_actions_results"
        },
        {
            "Title": "Avantel Wins ₹11.19 Cr Order from NewSpace India",
            "Summary": "Avantel Limited secures significant contract from NewSpace India for supply, installation, and commissioning of transponders with completion deadline of July 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767845290729,
            "Source": "co_actions_results"
        },
        {
            "Title": "Avantel Secures ₹1.76 Cr Order from Bharat Electronics",
            "Summary": "Avantel Limited receives manufacturing order worth ₹1.76 crores from Bharat Electronics Limited for supply of Satcom products, to be executed by July 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767333897013,
            "Source": "co_actions_results"
        },
        {
            "Title": "Avantel Wins ₹4.16 Cr Defence Contract",
            "Summary": "Avantel Limited secures ₹4.16 crore contract for domestic services from Ministry of Defence, strengthening its position in the aerospace and defence sector.",
            "Sentiment": "positive",
            "PublishDate": 1766819023636,
            "Source": "co_actions_results"
        },
        {
            "Title": "Avantel Secures ₹13.82 Cr Railway SATCOM Order",
            "Summary": "Avantel Ltd receives significant purchase order from Centre for Railway Information Systems to supply SATCOM hub equipment, with delivery deadline set for June 2026.",
            "Sentiment": "positive",
            "PublishDate": 1765625248016,
            "Source": "co_actions_results"
        },
        {
            "Title": "Avantel Limited Secures Rs. 17.55 Crore Communication Systems Order from Bharat Electronics Limited",
            "Summary": "Avantel Limited received a purchase order worth Rs. 17.55 crores (including taxes) from Bharat Electronics Limited for supply of communication systems, with execution scheduled by March 2026. The domestic contract requires a 5% performance bank guarantee and involves no related party transactions or promoter group interests.",
            "Sentiment": "positive",
            "PublishDate": 1764049535719,
            "Source": "order&deals"
        },
        {
            "Title": "Avantel Limited Receives Rs. 8.03 Crore Purchase Order from Bharat Electronics Limited",
            "Summary": "Avantel Limited secured a purchase order worth Rs. 8.03 crores (excluding taxes) from Bharat Electronics Limited for supply of Power Amplifiers, to be executed by March 2026. The domestic order includes a 5% performance bank guarantee requirement and represents a significant business development for the electronics company.",
            "Sentiment": "positive",
            "PublishDate": 1763806625982,
            "Source": "order&deals"
        },
        {
            "Title": "Avantel Limited Receives Rs. 2.56 Crore Purchase Order from Bharat Electronics Limited",
            "Summary": "Avantel Limited announced it has received a purchase order worth Rs. 2.56 crores (excluding taxes) from Bharat Electronics Limited for the supply of Antenna Switching Units. The order was received via email on November 10, 2025, and is scheduled to be executed by March 2026. The contract includes a 5% performance bank guarantee requirement. The company confirmed that promoter/promoter group/group companies have no interest in the entity that awarded the order, and the transaction does not fall within related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1762806543622,
            "Source": "order&deals"
        },
        {
            "Title": "Three Stocks Plunge Up to 13% Following Weak Quarterly Results",
            "Summary": "Avantel, UTI AMC, and Tejas Networks declined up to 13% after reporting disappointing quarterly results. Avantel fell over 13% following a 30% decline in consolidated sales and 63% drop in EBITDA, with margins falling to 23.7% from 45.7%. UTI AMC dropped 10% in its biggest single-day fall since 2020 listing, with revenue declining 23.5% quarter-over-quarter and market share losses across key segments. Tejas Networks lost over 8.5% after reporting its third consecutive quarterly loss of ₹307 crore, caused by lower revenue, manufacturing process losses, and delayed receipt of a ₹1,526 crore 4G purchase order for 18,000 sites.",
            "Sentiment": "negative",
            "PublishDate": 1760934648090,
            "Source": "earnings"
        },
        {
            "Title": "Avantel Limited Reports Q2 FY26 Financial Results with Mixed Performance Across Segments",
            "Summary": "Avantel Limited's Board approved unaudited standalone and consolidated financial results for the second quarter and half year ended September 30, 2025. On a standalone basis, the company reported revenue from operations of Rs. 5,512.40 lakhs for Q2 FY26 compared to Rs. 7,725.08 lakhs in the same quarter last year, representing a decline. Net profit for the quarter stood at Rs. 617.02 lakhs versus Rs. 2,357.23 lakhs in the previous year. For the half year, standalone revenue was Rs. 10,696.05 lakhs against Rs. 12,890.28 lakhs in the corresponding period last year. On a consolidated basis, Q2 revenue was Rs. 5,541.83 lakhs compared to Rs. 7,742.03 lakhs in the prior year quarter, with net profit of Rs. 426.63 lakhs versus Rs. 2,289.90 lakhs. The company operates in two segments: communications and signal processing products, and healthcare services. The healthcare segment reported losses of Rs. 190.39 lakhs for the quarter. During the quarter, the company allotted 7,600 equity shares under its Employee Stock Option Plan 2023. Employee benefit expenses included Rs. 177.57 lakhs related to ESOP for the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1760767045444,
            "Source": "earnings"
        },
        {
            "Title": "Avantel Limited to Inaugurate New Manufacturing Facility in Hyderabad",
            "Summary": "Avantel Limited announced the inauguration of a new facility in E-City, Hyderabad, scheduled for October 2, 2025. The facility spans 4 acres with approximately 76,000 sq. ft. of built-up area and will focus on design, development, and manufacturing of Software Defined Radios and Radar Systems. It will also provide Assembly, Integration, and Testing facilities for Satellites, along with Ground Station as a Service capabilities. The company states this facility marks a significant milestone in their growth journey and is expected to enhance operational efficiency, foster innovation, and support their long-term business strategy.",
            "Sentiment": "positive",
            "PublishDate": 1758980776137,
            "Source": "stock"
        },
        {
            "Title": "Avantel Limited Secures Rs. 8.82 Crore Power Amplifier Order from Bharat Electronics Limited",
            "Summary": "Avantel Limited received a purchase order worth Rs. 8.82 crores (excluding taxes) from Bharat Electronics Limited for the supply of Power Amplifiers. The manufacturing order is scheduled for execution by March 2026 and requires a 3% performance bank guarantee. The contract is domestic in nature and does not involve any related party transactions or promoter group interests.",
            "Sentiment": "positive",
            "PublishDate": 1758784602345,
            "Source": "order&deals"
        },
        {
            "Title": "Avantel Limited Secures Rs. 3.95 Crore Purchase Order from Indian Navy for Satcom Systems",
            "Summary": "Avantel Limited received a purchase order worth Rs. 3.95 crores (including taxes) from Material Organisation, Indian Navy, Mumbai for the supply of Satcom Systems. The manufacturing order is scheduled for execution by September 2026 and requires a 5% performance bank guarantee. The contract is domestic in nature and does not involve any related party transactions or promoter group interests.",
            "Sentiment": "positive",
            "PublishDate": 1758782814276,
            "Source": "order&deals"
        },
        {
            "Title": "Avantel Limited Secures Rs. 19.33 Crore Purchase Order from Larsen & Toubro for Satcom Products",
            "Summary": "Avantel Limited received a purchase order worth Rs. 19.33 crores (including taxes) from Larsen & Toubro Limited for the service of Satcom products. The order was received on September 22, 2025, and is to be executed by July 2026. The contract is domestic in nature and involves service-related work. The company confirmed that promoter groups have no interest in the awarding entity and the transaction does not fall under related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1758525742505,
            "Source": "order&deals"
        },
        {
            "Title": "Avantel Limited Secures Rs. 12.51 Crore Purchase Order from Bharat Electronics Limited",
            "Summary": "Avantel Limited received a purchase order worth Rs. 12.51 crores (including taxes) from Bharat Electronics Limited for the supply of Satcom Products. The order is dated September 17, 2025, and must be executed by March 2026. The contract is domestic in nature and involves manufacturing operations. The agreement includes a 3% performance bank guarantee requirement. The company confirmed that promoter groups have no interest in the entity awarding the contract, and the transaction does not fall under related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1758168671895,
            "Source": "order&deals"
        },
        {
            "Title": "Avantel Limited Secures Rs. 1.94 Crore Maintenance Contract from Fleet Maintenance Unit",
            "Summary": "Avantel Limited has received a maintenance contract worth Rs. 1.94 crores (including taxes) from Fleet Maintenance Unit. The domestic service contract is dated September 16, 2025, and must be executed by September 19, 2027. The contract requires a 3% performance bank guarantee. The company confirmed that promoter groups have no interest in the entity awarding the contract, and it does not constitute a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1758085343577,
            "Source": "order&deals"
        },
        {
            "Title": "Avantel Limited Secures Rs. 9.92 Crore Purchase Order from Garden Reach Shipbuilders",
            "Summary": "Avantel Limited received a purchase order worth Rs. 9.92 crores (including taxes) from Garden Reach Shipbuilders Limited for the supply of Satcom Products. The order was received via mail dated September 15, 2025, and is scheduled for execution between March 15, 2026, and June 15, 2026. The domestic manufacturing contract requires a 3% performance bank guarantee. The order does not involve any related party transactions or promoter group interests.",
            "Sentiment": "positive",
            "PublishDate": 1758019515506,
            "Source": "order&deals"
        },
        {
            "Title": "Avantel Receives Amended Rs. 9.88 Crore Purchase Order from Department of Atomic Energy",
            "Summary": "Avantel has received an amended purchase order worth Rs. 9.88 crore from the Department of Atomic Energy. The order represents a contract modification from the government department.",
            "Sentiment": "positive",
            "PublishDate": 1757340135489,
            "Source": "stock"
        },
        {
            "Title": "Avantel Secures New Order Worth ₹2.84 Crore",
            "Summary": "Avantel has secured a new order valued at ₹2.84 crore. The company announced this business development, which represents new revenue opportunity for the organization.",
            "Sentiment": "positive",
            "PublishDate": 1756451714318,
            "Source": "order&deals"
        },
        {
            "Title": "Avantel Secures ₹10 Crore Order From HAL",
            "Summary": "Avantel has secured a ₹10 crore order from Hindustan Aeronautics Limited (HAL). This order represents a business development for the company.",
            "Sentiment": "positive",
            "PublishDate": 1754902714890,
            "Source": "order&deals"
        },
        {
            "Title": "Avantel Limited Reports Proper Utilization of Rs 80.91 Crore Rights Issue Proceeds",
            "Summary": "Avantel Limited submitted its monitoring agency report for the quarter ended June 30, 2025, covering the utilization of Rs 80.91 crore raised through a Rights Issue. CARE Ratings Limited, serving as the monitoring agency, confirmed that proceeds were appropriately used for stated purposes with no deviations from the offer document. The company utilized Rs 26.49 crore during the quarter: Rs 5.60 crore for new manufacturing facility vendor payments, Rs 19.94 crore for general corporate purposes (including Rs 7.34 crore for working capital reduction, Rs 3.48 crore for salaries, Rs 5.92 crore for inventory payments, and Rs 3.20 crore for administrative expenses), and Rs 0.95 crore for issue-related expenses. The remaining Rs 54.42 crore remains unutilized in the monitoring account. The Rights Issue, conducted from May 15-28, 2025, was intended to fund capital expenditure for a new manufacturing facility for electronics and aerospace applications and GSaaS infrastructure establishment.",
            "Sentiment": "positive",
            "PublishDate": 1753428109926,
            "Source": "corporate_action"
        },
        {
            "Title": "AVANTEL Reports Mixed Q1 Results with Flat Revenue Growth and Declining Profitability",
            "Summary": "AVANTEL reported Q1 financial results showing revenue of 519 million rupees compared to 518 million rupees in the same period last year, representing minimal growth. However, profitability declined significantly with EBITDA falling to 104 million rupees from 142 million rupees year-over-year. The EBITDA margin compressed to 20.14% from 27.36% in the previous year. Consolidated net profit dropped substantially to 32 million rupees from 74 million rupees compared to the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1753419146190,
            "Source": "earnings"
        },
        {
            "Title": "Avantel Limited Announces Passing of Promoter Mr. Abburi Venkateswara Rao",
            "Summary": "Avantel Limited announced the passing of Mr. Abburi Venkateswara Rao, aged 87, who was a promoter of the company holding 23,78,786 equity shares representing 0.90% of the company's total equity. Mr. Rao passed away on July 21, 2025. Following his demise, he will cease to be part of the Promoter/Promoter Group of the company. The transmission of his shareholding to the nominee is currently in process, and the shares will continue to be reflected in his name until the transmission is completed. The company's directors and employees have expressed condolences to his family.",
            "Sentiment": "negative",
            "PublishDate": 1753160575393,
            "Source": "corporate_governance"
        },
        {
            "Title": "Avantel Secures Rs 5.97 Crore Order from Goa Shipyard",
            "Summary": "Avantel has received an order worth Rs 5.97 crores from Goa Shipyard for SATCOM (Satellite Communication) equipment. The order is specifically for supplying SATCOM equipment, indicating a potential expansion or upgrade in Goa Shipyard's communication capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1751362770000,
            "Source": "default"
        },
        {
            "Title": "Avantel Secures ₹13 Crore Contract from DRDO",
            "Summary": "Avantel has been awarded a contract worth ₹13 crore from the Defence Research and Development Organisation (DRDO). The contract is likely for defense-related products or services, given DRDO's focus on military technology development.",
            "Sentiment": "positive",
            "PublishDate": 1750506604000,
            "Source": "default"
        },
        {
            "Title": "Avantel Secures ₹11 Crore Order from Mazagon Dock Shipbuilders",
            "Summary": "Avantel has received an order worth ₹11 crore from Mazagon Dock Shipbuilders. The order details and specific products or services involved are not mentioned in the provided news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1750498016000,
            "Source": "default"
        },
        {
            "Title": "Avantel's Subsidiary to Open New Medical Products Facility",
            "Summary": "Avantel has announced that its subsidiary, Imeds Global Private Ltd, will inaugurate a new facility for designing, developing, and manufacturing medical products in Visakhapatnam. The facility covers 2 acres with a 25,000 sq. ft. built-up area, including clean rooms and testing infrastructure. It is scheduled to become operational from June 15, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1749600227000,
            "Source": "default"
        },
        {
            "Title": "Avantel Subsidiary to Open New Medical Product Facility in Visakhapatnam",
            "Summary": "Avantel's subsidiary, Imeds Global Private Ltd, is opening a new facility in Visakhapatnam for designing, developing, and manufacturing medical products. The facility spans 2 acres with a 25,000 square feet construction area, featuring clean rooms and testing facilities. Operations are scheduled to begin on June 15, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1749575143000,
            "Source": "default"
        },
        {
            "Title": "Avantel Ltd: Small-Cap Stock Surges 7% on Rights Issue Announcement",
            "Summary": "Avantel Ltd plans to raise Rs. 80.90 crore through a rights issue, offering 2,02,26,100 equity shares at Rs. 40 per share. The issue opens on May 15, 2025, and closes on May 22, 2025. Eligible shareholders can receive 10 new shares for every 121 held as of the record date, May 7, 2025. Funds will be used to expand manufacturing facilities.",
            "Sentiment": "positive",
            "PublishDate": 1746435885000,
            "Source": "corporate_action"
        },
        {
            "Title": "Avantel Announces Rights Issue Details",
            "Summary": "Avantel has set the price for its rights issue at 40 rupees per rights equity share. The total size of the rights issue is 809 million rupees. The rights entitlement ratio is 10 shares for every 121 shares held by existing shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1746110416000,
            "Source": "default"
        },
        {
            "Title": "Avantel Reports Q4 Financial Results",
            "Summary": "Avantel has released its Q4 financial results, showing a decline in EBITDA and net profit but an increase in revenue compared to the same period last year. The company's EBITDA decreased to 126 million rupees from 181 million rupees, with the EBITDA margin falling to 25.6% from 43.46%. Net profit dropped to 61 million rupees from 121 million rupees. However, revenue increased to 492 million rupees from 418 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1745661209000,
            "Source": "result"
        },
        {
            "Title": "Avantel Ltd: Defence Stock Surges 13% After ISRO Subsidiary Order",
            "Summary": "Avantel Ltd received a ₹43.25 crore order from NewSpace India Limited (NSIL), ISRO's commercial arm, for 45,252 Xponder devices to enhance coastal security. The contract is to be completed by August 2025. This order follows two previous supply orders for Xponder units and a ground segment hub.",
            "Sentiment": "positive",
            "PublishDate": 1740477193000,
            "Source": "order&deals"
        },
        {
            "Title": "AVANTEL Reports Strong Q3 Financial Results",
            "Summary": "AVANTEL has announced its Q3 consolidated financial results, showing significant year-over-year growth. The company's net profit increased to 201 million rupees from 163 million rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 707 million rupees compared to 593 million rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1737183110000,
            "Source": "earnings"
        },
        {
            "Title": "Avantel: Q2 Profit Soars 42% YoY, Revenue Up 42.5%",
            "Summary": "<p>Avantel reported a <span class='positive'>42.44% increase</span> in Q2 FY25 consolidated <b>net profit</b> to Rs 22.89 crore. <b>Revenue</b> from operations <span class='positive'>jumped 42.5% YoY</span> to Rs 77.42 crore. <b>PBT</b> <span class='positive'>rose 41.89%</span> to Rs 31.50 crore. Total expenses <span class='negative'>increased by 42.71% YoY</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728127980000,
            "Source": "result"
        },
        {
            "Title": "Avantel Reports Q2 EBITDA Growth",
            "Summary": "<p>Avantel has announced its Q2 financial results. The company's <span class='positive'>EBITDA</span> (Earnings Before Interest, Taxes, Depreciation, and Amortization) <span class='positive'>increased</span> to <b>345 million rupees</b>, up from <b>250 million rupees</b> in the same quarter last year. However, the EBITDA margin slightly <span class='negative'>decreased</span> to <b>44.81%</b> from <b>45.92%</b> year-over-year.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728117395000,
            "Source": "result"
        },
        {
            "Title": "Avantel Reports Strong Q2 Revenue Growth",
            "Summary": "<p>Avantel has announced its <span class='neutral'>second quarter revenue</span> for the current fiscal year. The company reported revenue of <span class='positive'>774 million rupees</span>, showing a <b>significant increase</b> from <span class='neutral'>543 million rupees</span> in the same quarter of the previous year.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728117116000,
            "Source": "result"
        }
    ]
}