{
    "Symbol": "AVG",
    "ISIN": "INE680Z01018",
    "News": [
        {
            "Title": "AVG Logistics Appoints Rajesh Rohilla as New CFO",
            "Summary": "AVG Logistics Limited announces the appointment of chartered accountant Rajesh Rohilla as Chief Financial Officer effective January 23, 2026, bringing nearly two decades of finance leadership experience.",
            "Sentiment": "positive",
            "PublishDate": 1769150476274,
            "Source": "stocks"
        },
        {
            "Title": "AVG Logistics Forms New Liquid Logistics Partnership",
            "Summary": "AVG Logistics announces strategic partnership in liquid logistics sector, emphasizing enhanced safety protocols for chemical transportation operations.",
            "Sentiment": "positive",
            "PublishDate": 1767836310179,
            "Source": "stocks"
        },
        {
            "Title": "AVG Logistics Acquires Land in Una for Warehouse",
            "Summary": "AVG Logistics has acquired land in Tahlwial, Una, Himachal Pradesh for developing a new warehouse and ancillary unit to expand its logistics infrastructure and operational capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1767713414974,
            "Source": "stocks"
        },
        {
            "Title": "AVG Logistics Partners with Nestlé & Ashok Leyland",
            "Summary": "AVG Logistics announces strategic green supply chain partnership with Nestlé India and Ashok Leyland, deploying 50 CNG trucks to reduce CO2 emissions by 1.1 lakh kg annually while covering 2.75 lakh km monthly.",
            "Sentiment": "positive",
            "PublishDate": 1767432603974,
            "Source": "stocks"
        },
        {
            "Title": "AVG Logistics partners with Baidyanath LNG for transport",
            "Summary": "AVG Logistics signs MoU with Baidyanath LNG to accelerate LNG-powered transportation adoption across industrial sectors including steel, FMCG, and cement logistics.",
            "Sentiment": "positive",
            "PublishDate": 1766672821782,
            "Source": "co_actions_results"
        },
        {
            "Title": "AVG Logistics Promoter Pledges 6 Lakh Equity Shares as Margin Call",
            "Summary": "Asha Gupta, promoter of AVG Logistics Limited, pledged 6,00,000 equity shares (4.00% of share capital) to Shine Star Buildcap Pvt. Ltd. as margin call for credit facility obtained by the company on December 09, 2025. Post-pledge, her encumbered shareholding stands at 51,45,455 shares (34.18% of total share capital) while maintaining total holding of 54,82,500 shares (36.41%).",
            "Sentiment": "neutral",
            "PublishDate": 1765351900864,
            "Source": "corporate_action"
        },
        {
            "Title": "AVG Logistics Promoter Asha Gupta Pledges 9.67 Lakh Shares to Shine Star Buildcap",
            "Summary": "Asha Gupta, promoter of AVG Logistics Limited, pledged 9,67,157 equity shares (6.42% of share capital) to Shine Star Buildcap Pvt. Ltd. on December 5, 2025. The shares were pledged as margin call for credit facility obtained by the company, increasing total encumbered shares to 45,45,455 (30.19% of share capital).",
            "Sentiment": "neutral",
            "PublishDate": 1765177381879,
            "Source": "corporate_action"
        },
        {
            "Title": "Shine Star Build-Cap Pledges Additional Shares in AVG Logistics, Total Encumbrance Reaches 30.19%",
            "Summary": "Shine Star Build-Cap Private Limited pledged 9,67,157 equity shares (6.42% of paid-up capital) of AVG Logistics Limited on December 5, 2025. The company's total encumbered shareholding in AVG Logistics has increased to 45,45,455 shares, representing 30.19% of the total share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1765020092739,
            "Source": "corporate_action"
        },
        {
            "Title": "AVG Logistics Gets Credit Rating Upgrade to IVRBBB/Stable from Infomerics",
            "Summary": "AVG Logistics Limited received a credit rating upgrade to IVRBBB/Stable from Infomerics Valuation and Rating Limited for its bank loan facilities worth Rs. 133.66 crore, enhanced from the previous Rs. 75.85 crore. The upgrade affects the company's long-term and short-term bank facilities, reflecting improved operational and financial performance during FY2025.",
            "Sentiment": "positive",
            "PublishDate": 1764775101107,
            "Source": "stock"
        },
        {
            "Title": "AVG Logistics CFO Himanshu Sharma Resigns for Overseas Career Opportunity",
            "Summary": "Himanshu Sharma resigned from his position as Chief Financial Officer of AVG Logistics Limited on November 21, 2025, citing an overseas growth opportunity as the reason for his departure. The resignation affects the company's senior management structure as they will need to find a replacement for the key financial leadership role.",
            "Sentiment": "neutral",
            "PublishDate": 1763724531355,
            "Source": "corporate_governance"
        },
        {
            "Title": "AVG Logistics Reports ₹268 Cr Revenue in H1 FY26, Adds 77 Fleet Vehicles",
            "Summary": "AVG Logistics Limited delivered ₹268.05 Cr revenue in H1 FY26 compared to ₹261.37 Cr in H1 FY25, with EBITDA of ₹50.54 Cr and maintained margins at 18.85%. The multimodal logistics provider added 77 fleet vehicles with ₹26 Cr capex investment and expects liquid logistics business to commence from December 2025 with ISO tankers reaching Indian ports.",
            "Sentiment": "neutral",
            "PublishDate": 1763107023666,
            "Source": "earnings"
        },
        {
            "Title": "AVG Logistics Reports Q1 FY2026 Results, Appoints New Auditors and Sets AGM Date",
            "Summary": "AVG Logistics Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. On a consolidated basis, the company reported revenue from operations of Rs. 12,502.15 lakhs and profit after tax of Rs. 497.42 lakhs. On a standalone basis, revenue was Rs. 12,448.34 lakhs with profit after tax of Rs. 492.97 lakhs. The Board appointed M/s. K Vivek and Co. as Secretarial Auditor for 5 years from FY 2025-26 to FY 2029-30, and M/s. Vinay Kumar and Associates as scrutinizer for the upcoming AGM. The company scheduled its 16th Annual General Meeting for September 30, 2025, at 10:00 AM in Delhi. The record date for dividend payment of Rs. 1.2 per equity share was set as September 23, 2025, and the Register of Members will remain closed from September 24-30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755183847826,
            "Source": "earnings"
        },
        {
            "Title": "AVG Logistics Non-Executive Director Apurva Chamaria Purchases 15,000 Shares",
            "Summary": "AVG Logistics Limited disclosed that Non-Executive Director Apurva Chamaria purchased 15,000 equity shares at an average price of Rs. 247.40 per share between August 06-08, 2025. The transaction was executed in accordance with a Trading Plan submitted by Chamaria on March 18, 2025. The purchase represents a total investment of approximately Rs. 37.11 lakh by the designated person.",
            "Sentiment": "positive",
            "PublishDate": 1754663640939,
            "Source": "stock"
        },
        {
            "Title": "AVG Logistics Secures ₹20 Crore Term Loan to Enter Liquid Chemical Transportation Segment",
            "Summary": "AVG Logistics Limited has secured a ₹20 crore term loan facility from an NBFC to support working capital needs and capital expenditure for importing ISO tank containers and fleet expansion. The company is entering the liquid chemical transportation segment, which it describes as rapidly growing within the Indian logistics industry. The funding will enable AVG Logistics to integrate liquid chemical transport through ISO tank containers with rail-based logistics, targeting industries such as chemicals, oils, and other liquid commodities. Managing Director Sanjay Gupta stated this initiative will expand the company's capabilities and strengthen its role in this niche segment. AVG Logistics operates over 50 automated branches across India with a 3000+ vehicle fleet and serves clients including Nestle, HUL, ITC, TATA Steel, and Coca Cola. The company reported revenue of ₹551.52 crore, EBITDA of ₹95.57 crore, and PBT of ₹26.33 crore in FY25.",
            "Sentiment": "positive",
            "PublishDate": 1753369533939,
            "Source": "stock"
        },
        {
            "Title": "AVG Logistics Secures 1.12 Billion Rupees in Banking Facilities for FY 2025/26 CAPEX",
            "Summary": "AVG Logistics has obtained banking facilities amounting to 1.12 billion rupees to fund its capital expenditure requirements for the fiscal year 2025/26. The company expects this investment to generate approximately 1 billion rupees in annual revenue.",
            "Sentiment": "positive",
            "PublishDate": 1747212632000,
            "Source": "result"
        },
        {
            "Title": "AVG Logistics Secures Long-Term Contract with Indian Railways",
            "Summary": "AVG Logistics Ltd has been awarded a long-term contract by Indian Railways for the operation of leased Parcel Express Trains. The contract is expected to generate revenue of approximately Rs. 198 crore over a 6-year tenure, averaging about Rs. 33 crore per annum.",
            "Sentiment": "positive",
            "PublishDate": 1746403468000,
            "Source": "default"
        },
        {
            "Title": "AVG Logistics Acquires 99% Stake in Kaizen Logistics",
            "Summary": "AVG Logistics has completed the acquisition of a major stake in Kaizen Logistics. The company has acquired 99% of the shares of Kaizen Logistics, marking a significant expansion in AVG's logistics operations.",
            "Sentiment": "positive",
            "PublishDate": 1742393211000,
            "Source": "corporate_action"
        },
        {
            "Title": "AVG Logistics Serves Major Corporate Clients",
            "Summary": "AVG Logistics has announced that it provides services to several prominent corporate clients. The company's customer base includes major industrial conglomerates and consumer goods companies such as Vedanta Group, Aditya Birla Group, Reliance Industries Limited (RIL), Hindustan Zinc Ltd, Gujarat Alkalis, Meghmani Finechem, DCM, Chemfab Alkalis, JSW, Electrosteel, Hindustan Coca Cola, and Varun Beverages, among others.",
            "Sentiment": "positive",
            "PublishDate": 1735550395000,
            "Source": "normal_news"
        },
        {
            "Title": "AVG Logistics to Acquire Major Stake in Kaizen Logistics",
            "Summary": "AVG Logistics has announced its intention to acquire a major stake in Kaizen Logistics. This strategic move suggests AVG Logistics is expanding its operations and potentially strengthening its position in the logistics industry.",
            "Sentiment": "positive",
            "PublishDate": 1735550346000,
            "Source": "corporate_action"
        },
        {
            "Title": "AVG Logistics Secures Contract with Major Cement Company",
            "Summary": "AVG Logistics has announced the acquisition of a strategic contract with a leading cement company. This new business partnership is likely to boost AVG Logistics' operations and potentially increase its revenue stream in the logistics sector.",
            "Sentiment": "positive",
            "PublishDate": 1734064850000,
            "Source": "order&deals"
        },
        {
            "Title": "AVG Logistics Anticipates Revenue Boost from Major Development",
            "Summary": "AVG Logistics has announced a significant development that is expected to strengthen the company's market position. This development is projected to add approximately 90 crore rupees to the company's annual revenue over a period of three years, starting from the third quarter of fiscal year 2025.",
            "Sentiment": "positive",
            "PublishDate": 1734064841000,
            "Source": "corporate_action"
        },
        {
            "Title": "AVG Logistics Reports Strong Q2 Financial Results",
            "Summary": "AVG Logistics has announced its Q2 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 53 million rupees, up from 29 million rupees in the same quarter last year. Revenue also saw an improvement, rising to 1.3 billion rupees from 1.17 billion rupees in the previous year's Q2.",
            "Sentiment": "positive",
            "PublishDate": 1731578469000,
            "Source": "result"
        }
    ]
}