{
    "Symbol": "AVL",
    "ISIN": "INE679V01027",
    "News": [
        {
            "Title": "Aditya Vision Q3 FY26 Revenue Jumps 27.6% to ₹648.86 Cr",
            "Summary": "Aditya Vision Limited reports strong Q3 FY26 performance with revenue rising 27.6% YoY to ₹648.86 crores. Net profit grows 12.8% to ₹27.31 crores despite exceptional items impact.",
            "Sentiment": "positive",
            "PublishDate": 1769507380597,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Vision Board Meet Set for Jan 27 Q3 Results",
            "Summary": "Aditya Vision Limited announces board meeting on January 27, 2026 to consider Q3FY26 financial results. Trading window closed from January 1, 2026 until 48 hours post-results announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1768818428235,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Vision Opens 3 New Showrooms, Reaches 192 Total",
            "Summary": "Aditya Vision expands retail presence with three new showrooms in Ranchi and Kanpur, strengthening its network across key markets and bringing the total count to 192 outlets.",
            "Sentiment": "positive",
            "PublishDate": 1767165133648,
            "Source": "stocks"
        },
        {
            "Title": "Aditya Vision Limited Reports Fire Incident at Bihar Warehouse with Rs 1.30 Crore Initial Loss Assessment",
            "Summary": "Aditya Vision Limited experienced a fire incident at its warehouse in Madhubani, Bihar on December 4, 2025 around 11:00 PM, with initial damage assessment of approximately Rs 1.30 crore. The warehouse operations are temporarily disrupted while the attached store remains fully operational, with adequate insurance coverage in place and no human casualties reported.",
            "Sentiment": "negative",
            "PublishDate": 1764950286717,
            "Source": "stock"
        },
        {
            "Title": "Aditya Vision Reports 22% Revenue Growth to INR 458 Crores in Q2 FY26 Despite Weather Challenges",
            "Summary": "Aditya Vision Limited delivered robust quarterly performance with 22% year-on-year revenue growth to INR 458 crores and 4.2% increase in profit after tax to INR 13 crores, despite extended monsoons and delayed GST implementation affecting demand. The company expanded its retail footprint by 9 stores to reach 188 total outlets and maintained stable margins while benefiting from strong festive season demand and government policy initiatives including INR 10,000 direct transfers to women in Bihar.",
            "Sentiment": "positive",
            "PublishDate": 1763125938158,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Infotech Targets Growth in Security & Surveillance with AI-Based Solutions",
            "Summary": "Aditya Infotech is targeting steady growth in the security and surveillance segment through multiple strategic initiatives. The company is expanding its channel partnerships and product portfolio in AI-based solutions while strengthening its domestic distribution network. The company has a long-term focus on high-margin enterprise projects and software integration.",
            "Sentiment": "positive",
            "PublishDate": 1762960741556,
            "Source": "stock"
        },
        {
            "Title": "Aditya Vision Limited Reports Quarterly Results and Board Approvals for Key Reappointments",
            "Summary": "Aditya Vision Limited's Board of Directors approved unaudited financial results for the quarter and half year ended September 30, 2025. The company reported revenue from operations of ₹859.67 crores for the half year compared to ₹377.70 crores in the previous period. Profit for the half year was ₹16.70 crores versus ₹90.07 crores previously. The Board also approved the re-appointment of Yashovardhan Sinha as Chairman and Managing Director for five years from May 16, 2026 to May 15, 2031, and Atul Sinha as Non-Executive Independent Director for five years from November 16, 2025 to November 15, 2030. Both reappointments are subject to shareholder approval through postal ballot. The company operates in the retail electronics segment and notes that sales are seasonal in nature.",
            "Sentiment": "neutral",
            "PublishDate": 1762509307616,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Vision Reports Mixed Q2 Results with Revenue Growth and Margin Decline",
            "Summary": "Aditya Vision reported quarterly results showing revenue growth to 4.6 billion rupees from 3.75 billion rupees year-over-year. Net profit increased to 127 million rupees from 122 million rupees. EBITDA rose to 346 million rupees from 300 million rupees, though EBITDA margin declined to 7.6% from 8% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1762508883286,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Vision Limited Opens Six New Showrooms Across Bihar, Jharkhand, and Uttar Pradesh",
            "Summary": "Aditya Vision Limited has opened six new showrooms across three states. The new locations include two showrooms in Bihar (Patna areas), two in Jharkhand (Simdega and Dhanbad), and two in Uttar Pradesh (Pratapgarh and Ayodhya). These additions bring the company's total showroom count to 188 locations, with the new outlets numbered as the 183rd through 188th showrooms in their retail network.",
            "Sentiment": "positive",
            "PublishDate": 1759318424731,
            "Source": "stock"
        },
        {
            "Title": "Aditya Vision Expects 20-25% Sales Growth in Second Half of FY26 Amid Festive Season Demand",
            "Summary": "Aditya Vision Chairman and Managing Director Yashovardhan Sinha expects sales to rise 20-25% in the second half of FY26, driven by festive season demand and new GST rate cuts. The electronics retailer achieved 6% sales growth despite muted performance in the first two quarters due to unseasonal rains and lower temperatures that reduced AC sales. Demand increased from the first day of Navratra, with strong interest in ACs and larger TVs following tax reductions. The company plans to open 20-30 new stores in Jharkhand and Uttar Pradesh, adding to existing 30 and 36 stores respectively, funded through internal accruals. Sinha noted the company managed inventory prudently by stopping fresh orders in mid-May during the challenging first quarter.",
            "Sentiment": "positive",
            "PublishDate": 1758681485097,
            "Source": "stock"
        },
        {
            "Title": "Aditya Vision Targets to Exceed FY26 Growth Goal of 20-25%",
            "Summary": "Aditya Vision aims to surpass its FY26 growth target of 20-25%. The company expects increased demand driven by GST changes and anticipates a strong festive season ahead.",
            "Sentiment": "positive",
            "PublishDate": 1758520200555,
            "Source": "stock"
        },
        {
            "Title": "Nishant Prabhakar Appointed Promoter & Whole Time Director of Aditya Vision Limited",
            "Summary": "Nishant Prabhakar has been appointed as Promoter & Whole Time Director of Aditya Vision Limited. The appointment involves a share transaction where Prabhakar acquired 1,086,900 shares (0.84%) through open market purchases. Following this acquisition, his total shareholding decreased from 7,980,000 shares (6.20%) to 6,893,100 shares (5.36%) of the company's total equity capital of 128,663,050 shares. The share transaction was completed on September 3, 2025. Aditya Vision Limited is listed on BSE Ltd. and NSE Ltd.",
            "Sentiment": "neutral",
            "PublishDate": 1757064797661,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Vision Chairman Sells 5.1% Stake for ₹300 Crore Through Block Deals",
            "Summary": "Yashovardhan Sinha, Chairman and Managing Director of Aditya Vision Ltd, sold a 5.1% stake worth ₹300 crore by offloading 32.6 lakh shares each on BSE and NSE at average prices of ₹460.37 and ₹461.04 respectively. Axis Mutual Fund acquired 14 lakh shares for ₹64.4 crore, while Motilal Oswal Mutual Fund bought 8.6 lakh shares. Sinha remains the largest promoter shareholder with 32.6% stake. The Bihar-based consumer electronics retailer reported mixed quarterly results with same-store sales growth declining to -4% from +21% year-over-year, though net profit rose 4% to ₹55 crore and revenue grew 6% to ₹940 crore. The company opened four new stores and plans to add 25-30 stores to reach 182 total locations. Despite recent underperformance, all seven Bloomberg-tracked analysts maintain 'Buy' ratings with a consensus target price of ₹530. Shares closed at ₹459.40, down 6.2% for the day.",
            "Sentiment": "neutral",
            "PublishDate": 1756923196210,
            "Source": "stock"
        },
        {
            "Title": "Aditya Vision Sees Rs 213.69 Crore Block Trade on NSE",
            "Summary": "Aditya Vision executed a block trade worth Rs 213.69 crore on the National Stock Exchange. The transaction involved approximately 4,645,486 shares traded at Rs 460 per share through multiple blocks.",
            "Sentiment": "neutral",
            "PublishDate": 1756881923451,
            "Source": "order&deals"
        },
        {
            "Title": "Aditya Vision Reports 6% Revenue Growth Despite Challenging Weather Conditions in Q1 FY26",
            "Summary": "Aditya Vision Limited reported revenue of INR 940 crores for Q1 FY26, marking 6% year-on-year growth despite unusual weather conditions that impacted seasonal cooling product demand. The company faced one of the most unusual summers in 26 years with continuous rainfall and lower temperatures across core markets of Bihar, Jharkhand, and Uttar Pradesh. Despite these challenges, the company maintained EBITDA margins at 9.5% and profit after tax grew 4% to INR 55 crores. The company successfully reduced inventory by INR 150 crores and lowered short-term borrowings from INR 278 crores to INR 115 crores. Air conditioners contributed 42% of total revenue. Same-store sales growth was negative 4% compared to positive 21% in the previous year. The company operates 179 stores as of June 30, 2025, with Bihar contributing 76% of revenue, UP 13%, and Jharkhand 11%. Management remains optimistic about future quarters, citing good monsoon conditions, upcoming festive season, and Bihar's new 125 units free electricity scheme launched in August.",
            "Sentiment": "neutral",
            "PublishDate": 1754639711059,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Vision Delivers 20,483% Return Over Five Years, Brokerages Upgrade Despite Market Volatility",
            "Summary": "Aditya Vision, a Patna-based consumer electronics retailer, has delivered a 20,483% return over five years, turning Rs 1 lakh into Rs 2 crore. The company operates across Uttar Pradesh, Bihar, and Jharkhand, selling durables like air conditioners, refrigerators, and washing machines. Despite losing over 18% value in 2025, shares rallied 8% to Rs 424 following quarterly results that outperformed the broader industry. Emkay Global upgraded the stock to BUY with a target price of Rs 550, citing better margin management and inventory control. The company reported 6% revenue growth while most durable goods manufacturers saw 15-30% declines. Aditya Vision added 4 stores in the quarter, bringing total count to 182 stores, with plans to add 25-30 stores and cross 200 stores. The company holds over 50% market share in Bihar and sources 85% of products directly from over 100 brands. Same-store sales growth was negative 4% due to unseasonal rainfall, but management expects festive season recovery. Multiple brokerages maintain BUY ratings, projecting revenue/PAT growth of 17-20% over the next two years.",
            "Sentiment": "positive",
            "PublishDate": 1754367877316,
            "Source": "stock"
        },
        {
            "Title": "Aditya Vision Reports 6% Revenue Growth Despite Weather Challenges in Q1 FY26",
            "Summary": "Aditya Vision Limited reported revenue of Rs 940.2 crore for the quarter ended June 30, 2025, representing a 5.8% year-on-year increase from Rs 888.8 crore. The company faced headwinds from unseasonal rains and the coldest summer in 60+ years, which dampened cooling product demand in key markets including Bihar, Jharkhand, and Uttar Pradesh. Net profit grew 3.9% to Rs 55.2 crore compared to Rs 53.1 crore in the previous year. EBITDA increased 5.4% to Rs 89.7 crore with margins at 9.5%. The electronics retailer expanded its footprint to 179 stores by adding 4 new outlets during the quarter and remains on track to cross 200 stores in FY26. The company maintains over 50% market share in Bihar and operates across three states with 113 stores in Bihar, 30 in Jharkhand, and 36 in Uttar Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1754043566450,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Vision Reports 4% Growth in Net Profit to 552 Million Rupees",
            "Summary": "Aditya Vision reported a net profit of 552 million rupees in its quarterly results, representing an increase from 530 million rupees in the same period last year. This marks a year-over-year growth of approximately 4% in the company's net profit.",
            "Sentiment": "positive",
            "PublishDate": 1754041216434,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Vision: From SME to Mainboard, Stock Soars 22,000% in Five Years",
            "Summary": "Aditya Vision Ltd., a consumer electronics retailer, has seen its stock price rise 22,702% since June 2020. The company recently migrated from BSE SME to BSE and NSE mainboard. It opened 30 new stores in FY25, reaching 175 total, and plans to add 25-30 stores annually, focusing on Uttar Pradesh expansion. FY25 revenue increased 30% to Rs 2,260 crore, with net profit up 36% to Rs 106 crore.",
            "Sentiment": "positive",
            "PublishDate": 1750814693000,
            "Source": "normal_news"
        },
        {
            "Title": "Aditya Vision Reports Q4 Financial Results",
            "Summary": "Aditya Vision has released its Q4 financial results. The company's EBITDA increased to 431 million rupees from 376 million rupees year-over-year. However, the EBITDA margin decreased to 8.85% from 10.02% compared to the same period last year. The standalone net profit saw a significant increase, rising to 160 million rupees from 79 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1746783946000,
            "Source": "result"
        },
        {
            "Title": "Aditya Vision Reports Q4 Revenue Growth",
            "Summary": "Aditya Vision has announced its Q4 revenue, which increased to 4.86 billion rupees from 3.8 billion rupees in the same quarter last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1746783930000,
            "Source": "result"
        },
        {
            "Title": "Aditya Vision: Share Price Surges on Nuvama's 'Buy' Rating",
            "Summary": "Aditya Vision's stock hit upper circuit, rising over 7% after Nuvama initiated coverage with a 'buy' rating and a target price of Rs 672. Nuvama projects strong growth for the company, forecasting a 28% revenue CAGR, 30% Ebitda growth, and 41% PAT CAGR over FY2024-27. The growth is expected to be driven by expansion in tier-2 and below towns.",
            "Sentiment": "positive",
            "PublishDate": 1732770053000,
            "Source": "normal_news"
        },
        {
            "Title": "Aditya Vision Reports Strong Q2 Financial Results",
            "Summary": "Aditya Vision has announced its Q2 financial results, showing significant year-over-year growth. The company's net profit increased to 122 million rupees from 96 million rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 3.75 billion rupees compared to 3.1 billion rupees in the previous year's Q2.",
            "Sentiment": "positive",
            "PublishDate": 1731405063000,
            "Source": "result"
        }
    ]
}