{
    "Symbol": "AVONMORE",
    "ISIN": "INE323B01024",
    "News": [
        {
            "Title": "Avonmore Capital Reports Mixed Q2 Results with Revenue Growth Despite Weather-Related Challenges",
            "Summary": "Avonmore Capital Management Services reported consolidated revenue of Rs. 37.04 crore with profit of Rs. 6.00 crore for Q2 FY2025-26, compared to Rs. 36.64 crore revenue and Rs. 7.54 crore profit in Q1, while its green fuel joint venture faced production losses due to floods. The company has filed a revised composite scheme of arrangement with stock exchanges and expects improved performance in Q3 FY2025-26 with recovery in market conditions and operational improvements.",
            "Sentiment": "neutral",
            "PublishDate": 1763122631624,
            "Source": "earnings"
        },
        {
            "Title": "Avonmore Capital Reports Strong Q2 Results, Withdraws ₹377 Crore Preferential Issue",
            "Summary": "Avonmore Capital Management Services reported quarterly results for the period ended September 30, 2025, with standalone net profit of ₹65 lakh and consolidated net profit of ₹619 lakh. The company withdrew its proposed preferential issue of up to 3.77 crore fully convertible warrants worth ₹377 crore due to pending composite scheme approvals and to avoid capital structure changes.",
            "Sentiment": "neutral",
            "PublishDate": 1763112412399,
            "Source": "earnings"
        },
        {
            "Title": "Avonmore Capital Approves Complex Scheme Involving Demerger of Almondz Global's Broking Business and Multiple Amalgamations",
            "Summary": "Avonmore Capital & Management Services Limited's board approved a composite scheme of arrangement involving the demerger of broking business from Almondz Global Securities Limited and multiple amalgamations with group companies. The scheme includes transferring Almondz Global's broking business (stock broking, depository participant and advisory services) to Almondz Broking Services Limited, which will retain the Almondz Global Securities name. The broking business contributed 8.65% to Almondz Global's total revenue in 2024-25. Subsequently, Almondz Global's remaining non-broking business will be amalgamated with Avonmore Capital, along with five other group companies: Almondz Insolvency Resolutions Services, Almondz Finanz, Apricot Infosoft, Avonmore Developer, and Anemone Holding. The restructuring aims to comply with Securities Contract Regulations Rules that restrict stock exchange members from engaging in non-securities businesses. Post-scheme, Avonmore Capital's promoter shareholding will decrease from 58.38% to 45.40%, while public shareholding will increase to 54.60%. The scheme requires approvals from the National Company Law Tribunal, shareholders, creditors and regulatory authorities. Listing will be sought for the new broking entity.",
            "Sentiment": "neutral",
            "PublishDate": 1757592608077,
            "Source": "corporate_action"
        },
        {
            "Title": "Avonmore Capital's Joint Venture Premier Green Innovations Forms Strategic Alliance for Waste-to-Value Platform",
            "Summary": "Avonmore Capital & Management Services announced that Premier Green Innovations Private Limited, its step-down joint venture company, has formed a strategic alliance with Entity 1 Value Emission Pvt Ltd to develop waste-to-value platforms. The collaboration will use Microbial Electrochemical Cell (MECC) technology to convert agricultural and industrial waste into hydrogen, methanol, and ethyl acetate for chemical and mobility industries. The partnership involves an investment of Rs. 500 crores over 3 years to build an alternative refinery. Entity 1's first MECC reactor has been installed at PGIPL's Kangra site for trial production. The alliance aims to produce bio-hydrogen, bio-methane, acetic acid, and ethyl acetate using modular reactors sized for 0.5-100 tonnes per day. Methanol will be priced at Rs. 22 per litre. Avonmore Capital holds 8.88% directly and 40.99% indirectly through Almondz Global Securities Limited in Premier Green Innovations.",
            "Sentiment": "positive",
            "PublishDate": 1757438181174,
            "Source": "stock"
        },
        {
            "Title": "Avonmore Capital Holds EGM to Approve Issuance of 3.77 Crore Convertible Warrants",
            "Summary": "Avonmore Capital & Management Services Limited conducted an Extra Ordinary General Meeting on September 9, 2025, via video conferencing from 11:01 a.m. to 11:12 a.m. The meeting addressed the approval for issuance of up to 3,77,00,000 fully convertible warrants of Rs. 1/- each at a price of Rs. 19.85 per warrant on preferential allotment basis to promoter and promoter group members. The warrants are convertible into equity shares of face value Rs. 1/- each. Remote e-voting was conducted from September 6-8, 2025, with additional e-voting facility provided during the meeting. Mr. Govind Prasad Agrawal chaired the meeting, and Mr. Nakul Pratap Singh of NPS and Associates served as scrutinizer. Voting results and scrutinizer's report will be submitted separately.",
            "Sentiment": "neutral",
            "PublishDate": 1757403613636,
            "Source": "corporate_action"
        },
        {
            "Title": "Avonmore Capital Announces EOGM to Approve Rs 74.83 Crore Warrant Issue to Promoters",
            "Summary": "Avonmore Capital & Management Services Limited has called an Extra-Ordinary General Meeting on September 9, 2025, to seek shareholder approval for issuing up to 3.77 crore fully convertible warrants at Rs 19.85 per warrant, raising up to Rs 74.83 crore. The warrants will be allotted to promoter and promoter group entities including Navjeet Singh Sobti (2.5 crore warrants), Gurpreet Sobti (2.5 crore warrants), Innovative Money Matters Pvt Ltd (2.82 crore warrants), and Rakam Infrastructures Private Limited (45 lakh warrants). The warrants are convertible into equity shares within 18 months at a 1:1 ratio. The company plans to utilize the funds for business expansion of its NBFC operations, strategic investments in subsidiaries, working capital augmentation, and general corporate purposes. Post-conversion, promoter group shareholding will increase from 58.46% to 63.36%. The meeting will be conducted via video conference with e-voting facility available from September 6-8, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755511767989,
            "Source": "corporate_action"
        },
        {
            "Title": "Avonmore Capital Board Approves Rs. 74.83 Crore Fundraising Through Convertible Warrants",
            "Summary": "Avonmore Capital & Management Services Limited's Board of Directors has approved raising funds through the issuance of up to 3,77,00,000 fully convertible warrants at Rs. 19.85 each, totaling Rs. 74.83 crore. The warrants will be issued to promoters and promoter group entities on a preferential basis. The allottees include Innovative Money Matters Pvt Ltd (28.2 million warrants), Rakam Infrastructures Pvt Ltd (4.5 million warrants), Navjeet Singh Sobti (2.5 million warrants), and Gurpreet Sobti (2.5 million warrants). Each warrant is convertible into one equity share within 18 months from allotment date. Warrant holders must pay 25% of consideration upfront and the remaining 75% upon conversion. An Extra-Ordinary General Meeting is scheduled for September 9, 2025, to seek shareholder approval for the issuance.",
            "Sentiment": "positive",
            "PublishDate": 1755084237248,
            "Source": "corporate_action"
        },
        {
            "Title": "Innovative Money Matters Sells 25,000 Shares in Avonmore Capital, Maintains 33.13% Stake",
            "Summary": "Innovative Money Matters Private Limited sold 25,000 shares of Avonmore Capital & Management Services Limited through open market transactions. The sale reduced their shareholding from 93,479,900 shares (33.12%) to 93,404,900 shares (33.13% of total voting capital). The transaction was completed on August 7, 2025. Innovative Money Matters is classified as a promoter of Avonmore Capital, which is listed on both BSE and NSE. The target company's total equity share capital remains unchanged at 282,184,741 shares worth Rs. 282,184,741.",
            "Sentiment": "neutral",
            "PublishDate": 1754648488185,
            "Source": "corporate_action"
        },
        {
            "Title": "Navjeet Singh Sobti (HUF) Increases Stake in Avonmore Capital to 0.07%",
            "Summary": "Navjeet Singh Sobti (HUF) acquired 75,000 shares of Avonmore Capital & Management Services Ltd through open market transactions. The acquisition increased their holding from 140,000 shares (0.05%) to 215,000 shares (0.07%) of the company's total share capital. The transaction was completed on August 7, 2025. Avonmore Capital has a total equity share capital of 282,184,741 shares valued at Rs. 282,184,741. The company's shares are listed on both BSE and NSE. Navjeet Singh Sobti (HUF) belongs to the promoter/promoter group category.",
            "Sentiment": "neutral",
            "PublishDate": 1754648030987,
            "Source": "corporate_action"
        },
        {
            "Title": "Avonmore Capital Schedules Board Meeting to Consider Fund Raising Through Equity Shares or Convertible Warrants",
            "Summary": "Avonmore Capital & Management Services Limited has scheduled a Board of Directors meeting for August 13, 2025, to consider raising funds through equity shares or convertible warrants via preferential allotment. The board will also discuss convening an Extraordinary General Meeting to seek shareholder approval for the fund raising proposal. The company has closed its trading window for designated persons and insiders until 48 hours after the board meeting outcome is declared to stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1754571009905,
            "Source": "corporate_action"
        },
        {
            "Title": "Navjeet Singh Sobti (HUF) Acquires 0.05% Stake in Avonmore Capital & Management Services",
            "Summary": "Navjeet Singh Sobti (HUF) acquired 140,000 shares of Avonmore Capital & Management Services Ltd through open market purchase. The acquisition represents 0.05% of the company's total share capital and voting rights. Prior to this transaction, Navjeet Singh Sobti (HUF) held no shares in the company. The shares were purchased on August 6, 2025, and the disclosure was submitted to BSE, NSE, and the company. Avonmore Capital has a total equity share capital of 282,184,741 shares valued at Rs. 282,184,741. The acquirer belongs to the promoter/promoter group category.",
            "Sentiment": "neutral",
            "PublishDate": 1754562922719,
            "Source": "corporate_action"
        },
        {
            "Title": "Avonmore Capital Acquires 20.85% Stake in Step-Down Subsidiary Almondz Global Infra-Consultant",
            "Summary": "Avonmore Capital & Management Services Limited acquired a 20.85% stake in Almondz Global Infra-Consultant Limited through allotment of 33,19,318 equity shares at Rs. 45.19 per share on August 1, 2025. The acquisition was executed through conversion of outstanding loan into equity share capital. Almondz Global Infra-Consultant is a step-down subsidiary operating in infrastructure advisory services, providing consultancy in roads, bridges, highways, smart cities, water management, and other infrastructure sectors. The company reported turnover of Rs. 11,482.96 lacs for 2024-25, showing growth from Rs. 7,337.23 lacs in 2023-24 and Rs. 4,015.31 lacs in 2022-23. This investment aligns with Avonmore Capital's rights issue completed in January 2025, which was specifically intended for investing in this step-down subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1754044849988,
            "Source": "order&deals"
        },
        {
            "Title": "Avonmore Capital Submits Q1 FY26 Consolidated Financial Results to Stock Exchanges",
            "Summary": "Avonmore Capital & Management Services Limited has submitted copies of its consolidated unaudited financial results for the quarter ended June 30, 2025, to BSE and NSE. The submission was made through a letter dated August 1, 2025, signed by Company Secretary Sonal, in compliance with SEBI listing regulations. The company provided the financial results as published in newspapers to both stock exchanges for their records.",
            "Sentiment": "neutral",
            "PublishDate": 1754028117906,
            "Source": "earnings"
        },
        {
            "Title": "Avonmore Capital Approves Quarterly Results and Appoints New Secretarial Auditor",
            "Summary": "Avonmore Capital & Management Services Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025. The board also appointed M/s Neeraj Gupta & Associates Company Secretaries as the company's Secretarial Auditor for a five-year term from April 1, 2025 to March 31, 2030, subject to shareholder approval at the Annual General Meeting. The firm, founded in June 2001 in Delhi, provides professional services to various corporate clients. The board meeting was held on July 31, 2025, commencing at 12:00 p.m. and concluding at 13:55 p.m. The financial results will be published in newspapers and made available on stock exchange websites and the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1753951664556,
            "Source": "corporate_action"
        }
    ]
}