{
    "Symbol": "AVPINFRA",
    "ISIN": "INE0R9401019",
    "News": [
        {
            "Title": "AVP Infracon Secures ₹33.34 Crore Work Order from Reliance",
            "Summary": "AVP Infracon has received a work order valued at ₹33.34 crore from Reliance for infrastructure development at the Mapedu Multi-Modal Logistics Park. The project involves infrastructure work, though specific details about the scope or timeline were not provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1750689424000,
            "Source": "default"
        },
        {
            "Title": "AVP INFRACON Reports Strong H2 Financial Results",
            "Summary": "AVP INFRACON has announced its financial results for the second half of the fiscal year. The company's net profit increased to 203 million rupees, up from 111 million rupees in the same period last year. Revenue also saw significant growth, reaching 2 billion rupees compared to 878 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1745908284000,
            "Source": "result"
        },
        {
            "Title": "AVP Infracon Secures 21 Crore Rupee Contract for Cold Storage and Warehouse Construction",
            "Summary": "AVP Infracon has been awarded a contract worth 21 crore rupees for the construction of a cold storage and warehouse facility in Trichy. The company, with a market capitalization of 399 crore rupees, is listed as an SME (Small and Medium Enterprise) on the stock exchange.",
            "Sentiment": "positive",
            "PublishDate": 1742268761000,
            "Source": "order&deals"
        },
        {
            "Title": "AVP Infracon Secures 331.9 Million Rupee Sub-Contract",
            "Summary": "AVP Infracon has been awarded a sub-contract from CDR & Co Constructions. The contract is for a part of work valued at 331.9 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1732022274000,
            "Source": "corporate_action"
        },
        {
            "Title": "AVP Infracon: SME Stock Surges 120% in 8 Months Post-Listing",
            "Summary": "AVP Infracon's stock hit a lifetime high of ₹174.15, up 120% from its March listing price. The company reported a 63% YoY revenue increase to ₹109.22 crore and a 75% YoY profit rise to ₹12.76 crore in H1 FY25. It secured new contracts worth ₹128.25 crore and has an order book of ₹300 crore.",
            "Sentiment": "positive",
            "PublishDate": 1731306853000,
            "Source": "normal_news"
        }
    ]
}