{
    "Symbol": "AVROIND",
    "ISIN": "INE652Z01017",
    "News": [
        {
            "Title": "Avro India EGM Approves Key Resolutions",
            "Summary": "Avro India Limited shareholders approve appointment of woman independent director and remuneration increases for key executives at EGM held February 04, 2026. All four special resolutions passed with requisite majority.",
            "Sentiment": "positive",
            "PublishDate": 1770273402336,
            "Source": "stocks"
        },
        {
            "Title": "Avro India launches India's largest plastic recycling hub",
            "Summary": "Avro India commissioned India's largest flexible plastic recycling plant with ₹25 crore capex, offering 500 MTPM capacity and recycled pellets 40% cheaper than conventional plastic.",
            "Sentiment": "positive",
            "PublishDate": 1767934613377,
            "Source": "stocks"
        },
        {
            "Title": "Avro India Launches India's Largest Flexible Plastic Unit",
            "Summary": "Avro India Limited launches India's largest flexible plastic recycling facility with 500 MTPM capacity through subsidiary AVRO Recycling Limited, investing ₹25.00 crores with plans for additional ₹30.00 crores by FY 2027.",
            "Sentiment": "positive",
            "PublishDate": 1767863900298,
            "Source": "stocks"
        },
        {
            "Title": "Avro India Independent Director Richa Kathuria Resigns",
            "Summary": "Richa Kathuria (formerly Richa Kalra) resigned as Independent Director of Avro India Limited effective December 20, 2025, citing pre-occupation as the reason for her departure.",
            "Sentiment": "neutral",
            "PublishDate": 1766250064448,
            "Source": "stocks"
        },
        {
            "Title": "Avro India Reports Mixed Quarterly Performance with 15.7% Profit Decline",
            "Summary": "Avro India Limited's Board approved unaudited financial results for the quarter and half year ended September 30, 2025, showing standalone profit of Rs. 122.08 lacs for the quarter compared to Rs. 148.92 lacs in the previous year. The company incorporated a wholly-owned subsidiary named Avro Recycling Limited in May 2025, marking its first consolidated financial results under IndAS requirements.",
            "Sentiment": "negative",
            "PublishDate": 1763173810359,
            "Source": "earnings"
        },
        {
            "Title": "Avro Recycling Limited Achieves Technology Breakthrough in Rigid Plastic Recycling",
            "Summary": "Avro Recycling Limited, a wholly owned subsidiary of Avro India Limited, has successfully implemented technology to recycle rigid plastic by separating multiple blended polymers in quality and color. The company expects this technology breakthrough to enhance revenue and profitability while strengthening its recycling division. Avro India Limited trades on NSE under symbol AVROIND and on BSE with scrip code 543512.",
            "Sentiment": "positive",
            "PublishDate": 1761993121290,
            "Source": "stock"
        },
        {
            "Title": "Avro India Commissions Large-Scale Plastic Recycling Washing Line",
            "Summary": "Avro India Limited has successfully commissioned one of India's largest washing lines for plastic scrap recycling technology. The company completed trial runs and expects commercial production to begin in the first week of November 2025. The new facility is anticipated to increase both production quantity and quality, which the company expects will boost revenue and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1761983100181,
            "Source": "stock"
        },
        {
            "Title": "Avro India Expands Operations with 50 New Distributors and Advanced Manufacturing Technology",
            "Summary": "Avro India Limited announced multiple operational developments in a business update. The company onboarded 50 distributors across different states over four months to strengthen its nationwide presence. It commissioned a 450 MT Injection Moulding machine to increase production of plastic cabinets, which are experiencing strong customer demand. The company also introduced advanced upcycling technology that converts mixed-colour polymers into high-quality feedstock, expected to improve pricing and profit margins. Avro India stated its focus remains on expanding market reach, enhancing product quality, and building a more sustainable plastics ecosystem through innovation and operational excellence.",
            "Sentiment": "positive",
            "PublishDate": 1759318417935,
            "Source": "stock"
        },
        {
            "Title": "Avro India Expands Production Capacity with Rs 27 Lakh Investment in New Injection Moulding Machine",
            "Summary": "Avro India Limited has purchased an Injection Moulding Machine to increase its production capacity from 42,00,000 pieces per annum to 44,00,000 pieces per annum. The company invested Rs 27,09,180 for this capacity expansion, funded through internal accruals and finance. The machine was purchased on September 12, 2025, and the capacity addition is expected to be completed by September 2025. The expansion aims to help the company service multiple product ranges.",
            "Sentiment": "positive",
            "PublishDate": 1758563024385,
            "Source": "stock"
        },
        {
            "Title": "Avro India Limited Reports 33% Jump in Quarterly Profit to ₹105.46 Lakhs",
            "Summary": "Avro India Limited reported a net profit of ₹105.46 lakhs for the quarter ended June 30, 2025, compared to ₹65.93 lakhs in the same quarter last year. Revenue from operations increased to ₹2,166.81 lakhs from ₹1,671.77 lakhs year-over-year. The company's total income rose to ₹2,325.35 lakhs, while total expenses increased to ₹2,181.89 lakhs. Basic earnings per share stood at ₹0.79 compared to ₹0.65 in the corresponding quarter. The company incorporated a wholly-owned subsidiary, AVRO Recycling Limited, on May 14, 2025. Other income for the quarter included commission income of ₹81.19 lakhs. The company operates in manufacturing and trading of plastic products, plastic granules LLDPE and scraps of plastics. No investor complaints were received during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1755002390554,
            "Source": "earnings"
        },
        {
            "Title": "Avro India: Stock Hits All-Time High and Upper Circuit",
            "Summary": "Avro India's stock has reached an all-time high and hit the upper circuit limit on the stock exchange.",
            "Sentiment": "positive",
            "PublishDate": 1736230289000,
            "Source": "normal_news"
        }
    ]
}