{
    "Symbol": "AVTNPL",
    "ISIN": "INE488D01021",
    "News": [
        {
            "Title": "AVT Natural Products Q3FY26 Results & Dividend",
            "Summary": "AVT Natural Products reported Q3FY26 results with revenue of Rs. 19,115.67 lakhs and net profit of Rs. 1,595.88 lakhs. Board declared 35% interim dividend of Re. 0.35 per share.",
            "Sentiment": "positive",
            "PublishDate": 1770819764065,
            "Source": "co_actions_results"
        },
        {
            "Title": "AVT Natural Products Board Meet on Feb 11, 2026",
            "Summary": "AVT Natural Products Limited has scheduled a board meeting for February 11, 2026, to consider Q3FY26 unaudited financial results and interim dividend recommendation.",
            "Sentiment": "neutral",
            "PublishDate": 1770134375398,
            "Source": "co_actions_results"
        },
        {
            "Title": "AVT Natural Products Reports 67% Jump in Q2 Net Profit to ₹924.77 Crores",
            "Summary": "AVT Natural Products Limited reported unaudited financial results for the quarter and half year ended September 30, 2025. The company's net profit after tax increased to ₹924.77 crores in Q2 compared to ₹401.79 crores in the same quarter last year. Revenue from operations rose to ₹15,128.71 crores versus ₹11,084.24 crores year-on-year. For the half year, net profit reached ₹1,860.41 crores compared to ₹648.15 crores in the previous year, while revenue grew to ₹27,619.76 crores from ₹21,005.50 crores. The company operates in solvent extracted products as its primary business segment. Earnings per share for the quarter stood at ₹0.61 compared to ₹0.26 in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1763022005599,
            "Source": "earnings"
        },
        {
            "Title": "AVT Natural Products Reports Strong Q2 Performance with Net Profit Doubling",
            "Summary": "AVT Natural Products delivered robust quarterly results with consolidated net profit rising to 133 million rupees from 63 million rupees year-over-year. The company's EBITDA increased to 149 million rupees compared to 80 million rupees in the same period last year. EBITDA margin improved to 9.3% from 6.6% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1763020327248,
            "Source": "earnings"
        },
        {
            "Title": "AVT Natural Products Independent Director A D Bopana Retires After Completing Second Term",
            "Summary": "A D Bopana retired as Independent Director of AVT Natural Products Limited on August 25, 2025, after completing his second consecutive five-year term. Following his retirement, he ceased to be a member of the Audit Committee, Stakeholders' Relationship Committee, and Risk Management Committee. The company reconstituted all three committees with effect from August 26, 2025. The Audit Committee is now chaired by M.M Venkatachalam with three other members. The Stakeholders' Relationship Committee is chaired by Ajit Thomas, while the Risk Management Committee is led by Kavitha Vijay as Chairperson.",
            "Sentiment": "neutral",
            "PublishDate": 1756126349042,
            "Source": "corporate_governance"
        },
        {
            "Title": "AVT Natural Products Seeks Shareholder Approval for Independent Director Re-appointment",
            "Summary": "AVT Natural Products Limited has issued a postal ballot notice seeking shareholder approval for the re-appointment of Mrs. Kavitha Vijay as an Independent Director for a second five-year term from September 23, 2025 to September 22, 2030. Mrs. Kavitha Vijay, who holds DIN 01047261, was initially appointed as an Independent Director at the 34th Annual General Meeting on September 23, 2020. She is the Senior Partner of Universal Legal, a full-service law firm based in Chennai, with over 20 years of experience in corporate law, mergers, acquisitions, and private equity investments. The e-voting period runs from August 20, 2025 at 9:00 AM to September 18, 2025 at 5:00 PM. The Board of Directors, upon recommendations from the Nomination and Remuneration Committee, has recommended her continuance as Non-Executive Independent Director. Mrs. Vijay received sitting fees of Rs. 3.25 lakhs during financial year 2024-2025 and attended all 5 board meetings. She also holds directorships in several other companies including A.V. Thomas and Company Limited, Neelamalai Agro Industries Limited, and Saksoft Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1755604973226,
            "Source": "corporate_action"
        },
        {
            "Title": "AVT Natural Products Appoints K Nandakumar as CEO, Reports Q1 2025-26 Results",
            "Summary": "AVT Natural Products Limited appointed K Nandakumar as Chief Executive Officer effective September 1, 2025. Nandakumar brings over two decades of experience across multiple industries, holding a Mechanical Engineering degree from Bangalore University and completing the Executive Management Program at IIM Bangalore. He previously worked with global brands including Philips, GE, 3M, Honeywell, and Sundaram Industries, most recently serving as CEO at TVS Rubbers. The company also approved unaudited financial results for the quarter ended June 30, 2025, showing standalone revenue from operations of Rs 12,491.05 lakhs compared to Rs 9,921.26 lakhs in the same quarter last year. Net profit after tax increased to Rs 935.62 lakhs from Rs 446.34 lakhs year-over-year. The board re-appointed Mrs. Kavitha Vijay as Independent Director for a second five-year term and reconstituted various committees including Audit, Stakeholders' Relationship, and Risk Management committees.",
            "Sentiment": "positive",
            "PublishDate": 1755065940204,
            "Source": "corporate_governance"
        },
        {
            "Title": "AVT Natural Products Reports Strong Q1 Growth with Revenue Up 30% and Net Profit Doubling",
            "Summary": "AVT Natural Products reported quarterly revenue of 1.3 billion rupees compared to 1 billion rupees in the same period last year. The company's consolidated net profit reached 121 million rupees, significantly higher than 59 million rupees recorded in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1755065475970,
            "Source": "earnings"
        },
        {
            "Title": "AVT Natural Products Reports Q4 Financial Results",
            "Summary": "AVT Natural Products has announced its Q4 financial results. The company's EBITDA increased to 246 million rupees from 159 million rupees year-over-year. The EBITDA margin improved to 15.67% from 12.67% in the same period last year. Revenue rose to 1.57 billion rupees from 1.25 billion rupees year-over-year. The consolidated net profit for Q4 reached 144 million rupees, up from 110 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748420412000,
            "Source": "result"
        },
        {
            "Title": "AVT Natural Products Reports Decline in Q3 EBITDA and Margin",
            "Summary": "AVT Natural Products has reported a decrease in its third-quarter EBITDA, which fell to 299 million rupees from 358 million rupees in the same period last year. The company's EBITDA margin also declined, dropping to 17.30% from 23.24% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739349795000,
            "Source": "earnings"
        },
        {
            "Title": "AVT Natural Products Reports Q3 Financial Results",
            "Summary": "AVT Natural Products announced its Q3 financial results. The company's consolidated net profit decreased slightly to 216 million rupees from 224 million rupees year-over-year. However, revenue increased to 1.7 billion rupees from 1.5 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739349793000,
            "Source": "earnings"
        },
        {
            "Title": "AVT Natural Products Reports Significant Decline in Q2 EBITDA",
            "Summary": "AVT Natural Products has reported a substantial decrease in its Q2 EBITDA, falling from 166 million rupees in the previous year to 80 million rupees in the current quarter. The company's EBITDA margin also declined from 12.27% to 6.6% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731398970000,
            "Source": "result"
        },
        {
            "Title": "AVT Natural Products Reports Q2 Revenue Decline",
            "Summary": "AVT Natural Products has reported a revenue of 1.2 billion rupees for the second quarter, down from 1.35 billion rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731398933000,
            "Source": "result"
        },
        {
            "Title": "AVT Natural Products Reports Q2 Profit Decline",
            "Summary": "AVT Natural Products has reported a consolidated net profit of 63 million rupees for the second quarter, down from 116 million rupees in the same period last year, representing a significant year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731398886000,
            "Source": "result"
        }
    ]
}