{
    "Symbol": "AWFIS",
    "ISIN": "INE108V01019",
    "News": [
        {
            "Title": "Awfis Allots 31,450 Shares Under ESOP Scheme",
            "Summary": "Awfis Space Solutions allotted 31,450 equity shares to employees under EDSOP 2015, raising Rs. 44.66 lakh and increasing paid-up capital to Rs. 71.54 crore with 7.15 crore total shares.",
            "Sentiment": "neutral",
            "PublishDate": 1770807492210,
            "Source": "co_actions_results"
        },
        {
            "Title": "Awfis Q3FY26 Revenue Grows 20% to Rs.382 Crores",
            "Summary": "Awfis Space Solutions reports strong Q3FY26 performance with revenue up 20% YoY to Rs.382 crores and EBITDA rising 30% to Rs.139 crores, driven by robust co-working segment growth.",
            "Sentiment": "positive",
            "PublishDate": 1770370597039,
            "Source": "co_actions_results"
        },
        {
            "Title": "Awfis Space Solutions Q3FY26 Earnings Call Feb 2",
            "Summary": "Awfis Space Solutions announces earnings conference call scheduled for February 02, 2026 at 5:30 PM IST to discuss Q3FY26 financial performance for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769580883921,
            "Source": "co_actions_results"
        },
        {
            "Title": "Awfis shareholders approve D&B business transfer",
            "Summary": "Awfis Space Solutions shareholders overwhelmingly approved the sale and transfer of Design and Build Business to wholly owned subsidiary ATPL with 99.9975% votes in favour through postal ballot.",
            "Sentiment": "positive",
            "PublishDate": 1769173233216,
            "Source": "co_actions_results"
        },
        {
            "Title": "Awfis Achieves Three WELL Accolades Simultaneously",
            "Summary": "Awfis Space Solutions becomes India's first coworking brand to achieve WELL Health-Safety Rating, WELL Equity Rating across 35 locations, and WELL Coworking Rating for 15 centres.",
            "Sentiment": "positive",
            "PublishDate": 1768981472610,
            "Source": "stocks"
        },
        {
            "Title": "Awfis Grants 10,000 ESOPs Under 2024 Scheme",
            "Summary": "Awfis Space Solutions grants 10,000 employee stock options at ₹345.73 per option with 30% discount to market price. Options vest over four years with 25% annual vesting.",
            "Sentiment": "positive",
            "PublishDate": 1767616389040,
            "Source": "co_actions_results"
        },
        {
            "Title": "Awfis CFO Ravi Dugar Resigns, Sumit Rochlani Appointed",
            "Summary": "Awfis Space Solutions announces CFO transition with Ravi Dugar's resignation effective February 2, 2026, and appointment of Chartered Accountant Sumit Rochlani as new CFO from February 3, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767614522782,
            "Source": "stocks"
        },
        {
            "Title": "Invesco MF reduces stake in Awfis by 2.25%",
            "Summary": "Invesco Mutual Fund disclosed reduction of shareholding in Awfis Space Solutions to 2.71% from previous disclosure, representing a decrease of 2.25% under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1766554125965,
            "Source": "stocks"
        },
        {
            "Title": "Awfis Space Solutions Issues Postal Ballot Notice",
            "Summary": "Awfis Space Solutions issues postal ballot notice for shareholder approval on design and build business transfer to subsidiary Awfis Transform Private Limited for ₹265.91 million consideration.",
            "Sentiment": "neutral",
            "PublishDate": 1766469397314,
            "Source": "co_actions_results"
        },
        {
            "Title": "Awfis Partners with Anarock for Office Space Report",
            "Summary": "Awfis Space Solutions collaborates with Anarock to release 'India Rising' report, identifying eight key drivers for managed office space growth in India's evolving commercial real estate market.",
            "Sentiment": "positive",
            "PublishDate": 1765946875575,
            "Source": "stocks"
        },
        {
            "Title": "Awfis Space Solutions Launches Fully-Owned Subsidiary Awfis Transform Private Limited",
            "Summary": "Awfis Space Solutions has established a new 100% owned subsidiary called Awfis Transform Private Limited. The move represents a corporate expansion initiative by the workspace solutions company through the creation of a wholly-owned entity.",
            "Sentiment": "positive",
            "PublishDate": 1764768884684,
            "Source": "corporate_action"
        },
        {
            "Title": "HDFC Mutual Fund Increases Stake in Awfis Space Solutions to 9.42%",
            "Summary": "HDFC Mutual Fund increased its shareholding in Awfis Space Solutions by 2.11% to reach 9.42% of the company's paid-up equity share capital as of November 26, 2025. The acquisition was made through open market purchases, with the fund's total holding rising from 52,27,786 shares to 67,39,242 shares in the workspace solutions company.",
            "Sentiment": "neutral",
            "PublishDate": 1764331712002,
            "Source": "stock"
        },
        {
            "Title": "Awfis Space Solutions Grants 71,770 Employee Stock Options Under ESOP Scheme 2024",
            "Summary": "Awfis Space Solutions' Nomination and Remuneration Committee approved the grant of 71,770 employee stock options at Rs. 389.69 per option, representing approximately 28.62% discount to market price. The options will vest over four years with 25% vesting annually and are convertible into equal number of equity shares with face value of Rs. 10 each.",
            "Sentiment": "positive",
            "PublishDate": 1763985040128,
            "Source": "corporate_action"
        },
        {
            "Title": "Awfis Space Solutions Reports Strong Q2 FY26 Growth with 26% Revenue Rise and Premium Portfolio Expansion",
            "Summary": "Awfis Space Solutions delivered robust quarterly results with revenue growing 26% year-on-year to INR 367 crores and EBITDA increasing 32% to INR 132 crores, while expanding its premium workspace portfolio to 26 centers including 21 Gold and 5 Elite centers. The company added 14,000 new seats during the quarter, bringing total operational capacity to 147,000 seats across 247 centers, with strong traction from GCCs and enterprise clients driving 61% occupancy from large corporates and MNCs.",
            "Sentiment": "positive",
            "PublishDate": 1763370124702,
            "Source": "earnings"
        },
        {
            "Title": "Awfis Space Solutions Reports Full Utilization of Rs. 128 Crore IPO Proceeds",
            "Summary": "Awfis Space Solutions Limited has utilized Rs. 126.45 crore out of its Rs. 128 crore IPO proceeds according to its monitoring agency report for the quarter ended September 30, 2025. The company deployed Rs. 42.03 crore for funding capital expenditure towards establishment of new centers, Rs. 54.37 crore for working capital requirements, Rs. 20.63 crore for general corporate purposes, and Rs. 9.38 crore for issue-related expenses. The monitoring agency CARE Ratings Limited reported no deviations from the stated objectives. Rs. 1.59 crore remains in the public issue account for pending issue-related expenses, while Rs. 7.35 crore of unutilized proceeds are kept in the public issue account. The company's IPO was conducted from May 22-27, 2024, in the flexible workspace solutions sector.",
            "Sentiment": "positive",
            "PublishDate": 1762986985104,
            "Source": "stock"
        },
        {
            "Title": "Awfis CMD Clarifies Debt Position and Expansion Strategy Amid Market Concerns",
            "Summary": "Awfis Space Solutions CMD Amit Ramani addressed market concerns about the company's financial position and growth plans. The company's debt decreased to 21 crores from 28 crores year-on-year, while profitability grew 49% and EBITDA increased 44%. Ramani clarified that confusion arose from a one-time sale of the facility management business being counted as recurring profit. The company's premiumization strategy includes 21 gold centres and 5 elite centres out of 26 total locations. Capital expenditure for the first half was around 100 crores, aligned with 200-crore annual guidance. The lease mix remains 65% managed and 35% straight lease. Enterprise expansion includes 10 GCC clients operating in elite centres, with 5,000 seats added for Fortune 100 companies. The design and build vertical was transferred to a 100% subsidiary without cash involvement to enable focused growth and partnerships.",
            "Sentiment": "positive",
            "PublishDate": 1762937241597,
            "Source": "stock"
        },
        {
            "Title": "Awfis Space Solutions Targets 40% Revenue CAGR with Expansion to 150 Centers",
            "Summary": "Awfis Space Solutions has provided guidance for 40% revenue compound annual growth rate (CAGR) as part of its expansion strategy. The company projects FY26 revenue of ₹1,234 crores, representing 28% year-over-year growth, with occupancy rates reaching 86%. The workspace solutions provider plans to operate 150 centers across 20 cities and expand its managed office vertical to 2.5 million square feet by FY27. The company's growth strategy focuses on leveraging the enterprise segment and penetrating tier-II cities through asset-light expansion, aiming to achieve profitability through operational leverage.",
            "Sentiment": "positive",
            "PublishDate": 1762875933038,
            "Source": "stock"
        },
        {
            "Title": "Awfis Reports 59% Profit Decline to Rs 16 Crore in September Quarter",
            "Summary": "Awfis Space Solutions reported a 59% decline in consolidated profit to Rs 15.97 crore in the September quarter, compared to Rs 38.67 crore in the year-ago period. The previous year's profit included an exceptional gain of Rs 24 crore, creating a high base effect. Total income grew to Rs 392.97 crore from Rs 301.95 crore in the corresponding period last year. The recently listed company provides flexible managed office spaces by taking space from property owners and sub-leasing to enterprises. As of September 30, 2025, Awfis operates 247 centres with 1,70,000 seats across 8.4 million sq ft area.",
            "Sentiment": "negative",
            "PublishDate": 1762872170575,
            "Source": "earnings"
        },
        {
            "Title": "Awfis Space Solutions Reports Strong Q2 FY26 Performance with 28% Revenue Growth",
            "Summary": "Awfis Space Solutions Limited reported revenue from operations of Rs. 702 crores for H1 FY26, representing 28% year-over-year growth. The company's operating EBITDA grew 44% to Rs. 259 crores with a margin of 36.9%. Profit after tax increased 49% to Rs. 26 crores for the half-year period. For Q2 FY26 specifically, revenue reached Rs. 367 crores (26% YoY growth) with operating EBITDA of Rs. 132 crores at 36.1% margin. The company operates India's largest flexible workspace network with 247 centers and 170,000 seats across 18 cities, serving approximately 3,400 active clients. Awfis added 35,000 seats year-over-year and maintains a 74% blended occupancy rate. The company focuses on expanding its premium workspace offerings with 21 Gold and 5 Elite centers located in Grade A developments.",
            "Sentiment": "positive",
            "PublishDate": 1762858334297,
            "Source": "earnings"
        },
        {
            "Title": "Awfis Space Solutions Reports Mixed Q2 Results with Revenue Growth but Lower Net Profit",
            "Summary": "Awfis Space Solutions reported quarterly results showing net profit of 150.5 million rupees compared to 377 million rupees in the same period last year. Revenue increased to 3.65 billion rupees from 2.91 billion rupees year-over-year. EBITDA rose to 1.31 billion rupees from 991 million rupees, while EBITDA margin improved to 35.87% from 34.02% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762857858954,
            "Source": "earnings"
        },
        {
            "Title": "QRG Investments Divests 3.4% Stake in Awfis for Rs 141 Crore",
            "Summary": "QRG Investments and Holdings sold 24.07 lakh equity shares representing a 3.37% stake in co-workspace solutions platform Awfis Space Solutions for Rs 140.89 crore at Rs 585.14 per share. The transaction reduced QRG's shareholding from 4.11% to 0.75%. QRG Investments is a promoter of Havells India. HSBC Mutual Fund purchased 5.21 lakh shares (1.28% stake) in Awfis for Rs 585 per share, valued at Rs 53.72 crore. Awfis shares declined 1.87% to close at Rs 575.90 on NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1760495354543,
            "Source": "order&deals"
        },
        {
            "Title": "Awfis Space Solutions Expands Mumbai Operations with New Centre in Powai",
            "Summary": "Awfis Space Solutions has opened a new center at Supreme Business Park in Hiranandani Gardens, Powai, expanding its Mumbai operations.",
            "Sentiment": "positive",
            "PublishDate": 1759730136807,
            "Source": "stock"
        },
        {
            "Title": "Awfis Space Solutions Appoints New Company Secretary and Establishes Wholly Owned Subsidiary",
            "Summary": "Awfis Space Solutions Limited announced leadership changes in its compliance function and corporate expansion plans. Mr. Amit Kumar resigned as Company Secretary and Compliance Officer effective September 29, 2025, citing pursuit of better career opportunities. Ms. Shweta Gupta, a Fellow Company Secretary with over 14 years of experience in corporate secretarial, legal, M&A, and compliance functions, was appointed as his replacement effective September 30, 2025. The company also approved the incorporation of a new wholly owned subsidiary with authorized share capital of up to INR 50 lakhs. The subsidiary will operate in the service sector, focusing on design, build, and execution of commercial and residential projects, interior fit-outs, MEP services, engineering solutions, consultancy services, and software solutions related to construction management.",
            "Sentiment": "neutral",
            "PublishDate": 1758865634644,
            "Source": "corporate_governance"
        },
        {
            "Title": "Awfis Space Solutions Completes 67,000 Sq. Ft. Innovation Hub for eBay in Bengaluru",
            "Summary": "Awfis Space Solutions has completed construction of an approximately 67,000 square foot innovation hub for eBay at Embassy Tech Village in Bengaluru. The project represents a significant workspace delivery by Awfis for the e-commerce company.",
            "Sentiment": "positive",
            "PublishDate": 1758002979714,
            "Source": "order&deals"
        },
        {
            "Title": "Awfis Launches First Gold Centre at Eleven West By Panchshil in Pune",
            "Summary": "Awfis has launched its first Gold Centre at Eleven West By Panchshil in Pune. This represents the company's expansion of its premium workspace offerings in the city.",
            "Sentiment": "positive",
            "PublishDate": 1757405712441,
            "Source": "stock"
        },
        {
            "Title": "Awfis Space Solutions Reports Strong Q1 Performance with 30% Revenue Growth and Margin Expansion",
            "Summary": "Awfis Space Solutions delivered robust quarterly results with revenue growing 30% year-on-year to INR 335 crores. EBITDA increased 60% to INR 127 crores with margins expanding 710 basis points to 37.8%. The company added 6,065 operational seats, bringing total capacity to 140,186 seats across 220 centers. Coworking and Allied Services segment grew 49% to INR 276 crores, while construction fit-out projects generated INR 58 crores. The company signed contracts for 15,000 new seats and has 18,000 seats scheduled for occupancy in Q2 and Q3, representing locked-in revenue of INR 463 crores. Exit month occupancy stood at 73%, with centers operational over 12 months achieving 84% occupancy. The company maintains strong liquidity with gross debt of INR 7 crores and debt-to-equity ratio of 0.02. Management guided for similar seat addition targets as the previous year of approximately 40,000 seats for the full year.",
            "Sentiment": "positive",
            "PublishDate": 1755520800297,
            "Source": "earnings"
        },
        {
            "Title": "Awfis Plans Expansion to 400 Locations and 250,000 Seats by FY28",
            "Summary": "Awfis has announced expansion plans to reach 400 locations and 250,000 seats by FY28. The company's growth strategy focuses on an asset-light model, targeting more enterprise clients, and implementing technology-driven services to boost profitability in the flexible workspace market.",
            "Sentiment": "positive",
            "PublishDate": 1754923279025,
            "Source": "stock"
        },
        {
            "Title": "Awfis Space Solutions Reports Strong Q1 Growth with Revenue Up 30% and Profit Surging 256%",
            "Summary": "Awfis Space Solutions delivered robust quarterly results with revenue rising to 3.35 billion rupees from 2.58 billion rupees year-over-year. The company's consolidated net profit jumped significantly to 99.8 million rupees compared to 28 million rupees in the same period last year. EBITDA increased to 1.27 billion rupees from 791 million rupees, while EBITDA margin expanded to 37.82% from 30.69% year-over-year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754907904706,
            "Source": "earnings"
        },
        {
            "Title": "Awfis Space Solutions: Kacholia-Backed Stock Turns Multibagger Post-Listing",
            "Summary": "Awfis Space Solutions Ltd., backed by investor Ashish Kacholia, has rallied over 200% since its listing on May 30, 2024. The company expects 30% revenue growth this financial year, having sold 53,000 seats in FY2025. Analysts maintain a 'buy' rating with a target price of Rs 935.",
            "Sentiment": "positive",
            "PublishDate": 1750222381000,
            "Source": "normal_news"
        },
        {
            "Title": "Awfis Space Solutions: Projects 30% Revenue Growth for FY26",
            "Summary": "Awfis Space Solutions expects 30% revenue growth in FY26. The company sold 53,000 seats in FY25, up from 37,000 in FY24. Current live seats total 135,000, with visibility for an additional 30,000 seats. Blended occupancy is at 73%, with mature centers reaching 84% after 12 months. The company anticipates margin improvement as the portfolio includes more mature centers.",
            "Sentiment": "positive",
            "PublishDate": 1748911882000,
            "Source": "earnings"
        },
        {
            "Title": "Awfis Space Solutions Secures 800 Million Rupee Term Loan",
            "Summary": "Awfis Space Solutions has announced that it has been sanctioned a rupee term loan facility of 800 million rupees (equivalent to approximately $9.6 million USD).",
            "Sentiment": "positive",
            "PublishDate": 1748869617000,
            "Source": "default"
        },
        {
            "Title": "Awfis Space Solutions: Nine-fold Jump in Q4 Profit, Revenue Up 46%",
            "Summary": "Awfis Space Solutions reported a 46% YoY increase in Q4 operating revenue to Rs 339 crore. Net profit surged over nine-fold to Rs 11.3 crore. For FY25, revenue rose 42% to Rs 1,207 crore with a net profit of Rs 68 crore. The company operates 208 active centers across 18 cities. Sumit Lakhani has been elevated to CEO.",
            "Sentiment": "positive",
            "PublishDate": 1748314665000,
            "Source": "earnings"
        },
        {
            "Title": "Awfis Space Solutions Reports Strong Q4 Financial Performance",
            "Summary": "Awfis Space Solutions announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 1.15 billion rupees from 668 million rupees in the previous year. The EBITDA margin improved to 34.01% from 28.85%. Revenue grew to 3.4 billion rupees from 2.32 billion rupees. Net profit rose to 113 million rupees from 12 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1748252404000,
            "Source": "result"
        },
        {
            "Title": "Awfis Space Solutions Expands Client Base and Plans Metro Growth",
            "Summary": "Awfis Space Solutions has acquired new clients and is planning to expand its operations across metropolitan cities in India. The company, which operates in the coworking space sector, is looking to capitalize on the growing demand for flexible workspace solutions.",
            "Sentiment": "positive",
            "PublishDate": 1747112026000,
            "Source": "default"
        },
        {
            "Title": "Awfis Space Solutions Partners with ECOS for Premium Corporate Transportation",
            "Summary": "Awfis Space Solutions has entered into a partnership with ECOS (India) Mobility & Hospitality Limited to introduce premium corporate transportation services. This collaboration aims to enhance the range of services offered by Awfis, potentially providing high-quality transportation options for their corporate clients.",
            "Sentiment": "positive",
            "PublishDate": 1744870600000,
            "Source": "default"
        },
        {
            "Title": "Tax Authority Orders Provisional Attachment of Awfis Space Solutions' Bank Accounts",
            "Summary": "The tax authority has issued an order for the provisional attachment of Awfis Space Solutions' bank accounts. However, the company has stated that this order will not have any financial impact on their operations.",
            "Sentiment": "neutral",
            "PublishDate": 1740010602000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tax Authority Orders Provisional Attachment of Awfis Space Solutions' Bank Accounts",
            "Summary": "The tax authority has ordered a provisional attachment of Awfis Space Solutions' bank accounts. However, the company has stated that this order will have no financial impact on their operations.",
            "Sentiment": "neutral",
            "PublishDate": 1739963975000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Awfis Space Solutions Reports Profitable Q3 FY2024",
            "Summary": "Awfis Space Solutions has announced its Q3 financial results, showing a significant turnaround. The company reported a consolidated net profit of 152 million rupees, compared to a loss of 63 million rupees in the same quarter last year. Revenue for Q3 increased to 3.2 billion rupees from 2.2 billion rupees year-over-year. The company also showed sequential growth, with profit increasing from 387 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739320398000,
            "Source": "earnings"
        },
        {
            "Title": "Awfis Space Solutions Reports Strong Q3 EBITDA Growth",
            "Summary": "Awfis Space Solutions, a company in the workspace solutions sector, has reported significant year-over-year growth in its Q3 EBITDA. The company's EBITDA increased to 1.07 billion rupees from 674 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin improved to 33.74% from 30.54% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739284162000,
            "Source": "earnings"
        },
        {
            "Title": "Awfis Space Solutions Reports Profitable Q3 FY2024",
            "Summary": "Awfis Space Solutions has reported a significant turnaround in its financial performance for the third quarter. The company posted a consolidated net profit of 152 million rupees, compared to a loss of 63 million rupees in the same quarter last year. This also represents a substantial improvement from the previous quarter's profit of 387 million rupees. Revenue for Q3 increased to 3.2 billion rupees, up from 2.2 billion rupees in the corresponding period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739284074000,
            "Source": "earnings"
        },
        {
            "Title": "Awfis Space Solutions: Ashish Kacholia Reduces Stake in Q3",
            "Summary": "Renowned investor Ashish Kacholia has reduced his position in small-cap stock Awfis Space Solutions during Q3FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1736846226000,
            "Source": "normal_news"
        },
        {
            "Title": "Awfis Space Solutions Expands to Lucknow",
            "Summary": "Awfis Space Solutions, a workspace solutions provider, has announced its expansion into Lucknow. The company is introducing integrated workspace solutions to cater to the city's growing business community. This move aims to provide flexible and modern office spaces to meet the evolving needs of businesses in Lucknow.",
            "Sentiment": "positive",
            "PublishDate": 1736842290000,
            "Source": "corporate_action"
        },
        {
            "Title": "Awfis Space Pre-IPO Investors to Sell 12.2% Stake in Block Deal",
            "Summary": "A block deal of Rs 583 crore has been launched for Awfis Space shares. Pre-IPO investors Bisque Ltd, Link Investment, and Peak XV Partners are set to sell up to 12.2% stake in the company. The floor price is set at INR 680 per equity share, representing a 5.2% discount. IIFL will broker the deal.",
            "Sentiment": "neutral",
            "PublishDate": 1733875542000,
            "Source": "block_deals"
        },
        {
            "Title": "Pre-IPO Investors to Sell Stake in Awfis Space Solutions",
            "Summary": "A block deal of Rs 583 crore has been launched for Awfis Space Solutions. Pre-IPO investors including Bisque Ltd, Link Investment, and Peak XV Partners are set to sell up to 12.2% stake in the company. The floor price is set at INR 680 per equity share, representing a 5.2% discount. IIFL will broker the deal.",
            "Sentiment": "neutral",
            "PublishDate": 1733840975000,
            "Source": "block_deals"
        },
        {
            "Title": "Awfis Space Solutions: Insider Trading Violation by Senior VP",
            "Summary": "Awfis Space Solutions reported an insider trading violation by VP of Sales Anindita Seal Sarkar, who purchased 25 shares without approval on September 30, 2024. The Audit Committee will decide on actions. The company's share price was up 1.01% at ₹728 on November 28.",
            "Sentiment": "neutral",
            "PublishDate": 1732775005000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Awfis Space Solutions: IIFL Initiates Coverage with 'Buy' Rating",
            "Summary": "IIFL Securities initiates coverage on Awfis Space Solutions with a 'buy' rating and a target price of Rs 920, implying 45% upside. Awfis plans to double seat capacity by fiscal 2027, adding 40,000-50,000 seats annually. The company's managed aggregation model and industry tailwinds support growth projections.",
            "Sentiment": "positive",
            "PublishDate": 1732515684000,
            "Source": "normal_news"
        },
        {
            "Title": "Awfis Space Solutions: NSE Contract Revenue to Impact FY25 and FY26",
            "Summary": "Awfis Space Solutions has secured a contract with NSE to design, build, and manage 1.65 lakh sq ft office space at BKC, Mumbai. The contract will be executed in two phases, with revenue impact starting Q4 FY25 and a larger impact in FY26. This deal is expected to contribute to the company's 30% revenue growth guidance for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1732327765000,
            "Source": "order&deals"
        },
        {
            "Title": "Awfis Space Solutions: Major Deal with NSE for Mumbai Office Space",
            "Summary": "Awfis Space Solutions has partnered with NSE to design, build, and manage 1.65 lakh sq. ft. of office space at Adani Inspire in Mumbai's Bandra-Kurla Complex. The deal covers two floors in a prime commercial hub. Awfis already operates a coworking center in the same building.",
            "Sentiment": "positive",
            "PublishDate": 1731394191000,
            "Source": "normal_news"
        },
        {
            "Title": "Awfis Secures Contract for NSE's New Office Space in Mumbai",
            "Summary": "Awfis, a workspace solutions provider, has won a mandate to design, build, and manage over 165,000 square feet of new office space for the National Stock Exchange (NSE) in Bandra Kurla Complex (BKC), Mumbai.",
            "Sentiment": "positive",
            "PublishDate": 1731385756000,
            "Source": "corporate_action"
        },
        {
            "Title": "Awfis Space Reports Strong Q2 Financial Performance",
            "Summary": "Awfis Space, a company likely in the real estate or office space sector, has reported significant year-over-year improvements in its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased from 598 million rupees to 991 million rupees. Additionally, the EBITDA margin improved from 28.81% to 34.01%.",
            "Sentiment": "positive",
            "PublishDate": 1731328650000,
            "Source": "result"
        }
    ]
}