{
    "Symbol": "AWHCL",
    "ISIN": "INE01BK01022",
    "News": [
        {
            "Title": "Antony Waste Schedules Q3 FY26 Earnings Call",
            "Summary": "Antony Waste Handling Cell Limited announces earnings call on February 02, 2026 at 2:00 PM IST to discuss Q3 & 9MFY26 operational and financial performance under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769498552572,
            "Source": "stocks"
        },
        {
            "Title": "Antony Waste Board Meet Set for Jan 30 for Q3 Results",
            "Summary": "Antony Waste Handling Cell Limited has scheduled its board meeting for January 30, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768831068063,
            "Source": "co_actions_results"
        },
        {
            "Title": "Antony Waste Subsidiary Forms Mumbai Eco Solutions SPV",
            "Summary": "Antony Waste Handling Cell's subsidiary has incorporated Mumbai Eco Solutions as a special purpose vehicle for BMC collection and transportation projects in Mumbai.",
            "Sentiment": "positive",
            "PublishDate": 1767143895759,
            "Source": "stocks"
        },
        {
            "Title": "Antony Waste subsidiary incorporates Mumbai Eco SPV",
            "Summary": "Antony Waste's subsidiary AG Enviro incorporates Mumbai Eco Solutions as SPV for two BMC waste collection projects with ₹51,000 investment and 51% controlling stake.",
            "Sentiment": "positive",
            "PublishDate": 1767090791924,
            "Source": "stocks"
        },
        {
            "Title": "Anthony Waste Secures ₹1,300 Cr BMC Contracts",
            "Summary": "Anthony Waste Handling Cell expands BMC operations from 2 to 7 wards with seven-year contracts worth ₹1,300 crore, while diversifying revenue streams beyond municipal work.",
            "Sentiment": "positive",
            "PublishDate": 1766910000675,
            "Source": "stocks"
        },
        {
            "Title": "Antony Waste Subsidiary Wins ₹330 Cr TMC Contract",
            "Summary": "Antony Waste Handling Cell's subsidiary secures 10-year waste processing contract from Thane Municipal Corporation for 600-800 TPD facility at Bhiwandi on DBOT basis.",
            "Sentiment": "positive",
            "PublishDate": 1766409876047,
            "Source": "co_actions_results"
        },
        {
            "Title": "Antony Waste Unit Wins ₹329 Crore Contract",
            "Summary": "Antony Waste Handling Cell announces that one of its units has secured a significant contract worth approximately ₹329 crores, marking a major business development for the waste management company.",
            "Sentiment": "positive",
            "PublishDate": 1766409781689,
            "Source": "co_actions_results"
        },
        {
            "Title": "NCLT Mumbai Approves AG Enviro Merger",
            "Summary": "National Company Law Tribunal Mumbai has granted approval for AG Enviro's merger with Antony Waste Handling Cell, marking a significant corporate development.",
            "Sentiment": "positive",
            "PublishDate": 1766069169709,
            "Source": "co_actions_results"
        },
        {
            "Title": "Antony Waste Q3FY26: 19% Growth in Waste Management",
            "Summary": "Antony Waste reports strong Q3FY26 performance with 19% YoY growth in waste tonnage to 1.42 million tonnes, 9% core revenue growth, and completion of AG Enviro merger effective December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765967089558,
            "Source": "co_actions_results"
        },
        {
            "Title": "Antony Waste Handling Cell Reports 16% Revenue Growth, Secures Rs 3,200 Crore Andhra Pradesh Waste-to-Energy Projects",
            "Summary": "Antony Waste Handling Cell Limited reported operating revenue of Rs 233 crores for Q2 FY26, marking 16% year-on-year growth. The company's Collection and Transportation business grew 14% to Rs 161 crores, while Processing segment recorded 22% growth reaching Rs 72 crores. EBITDA stood at Rs 57 crores with 18% growth and 22% margin. The company secured two new Waste-to-Energy projects in Andhra Pradesh valued at Rs 3,200 crores over 20 years. Total tonnage handled reached 1.27 million tons in the quarter, up 6% year-on-year. The PCMC Waste-to-Energy plant generated over 41 million green units and avoided 2,347 tons of CO2 emissions. Net debt stands at Rs 343 crores with debt-to-equity ratio of 0.4x. The company's order book position is around Rs 12,500 crores. Construction of the Andhra Pradesh projects is expected to begin in Q4 FY26 following financial closure by end of current calendar year.",
            "Sentiment": "positive",
            "PublishDate": 1762751200114,
            "Source": "earnings"
        },
        {
            "Title": "Antony Waste Handling Cell Reports 16% Revenue Growth in Q2FY26",
            "Summary": "Antony Waste Handling Cell Limited reported total operating revenue of ₹233 crore for Q2FY26, marking a 16% year-on-year growth. EBITDA reached ₹57 crore with an 18% year-on-year increase and margin of 21.6%. The company sold 40,081 tonnes of Refuse Derived Fuel (RDF) and 3,251 tonnes of compost during the quarter. For H1FY26, total sales reached 95,820 tonnes of RDF and 9,858 tonnes of compost. Key subsidiary Antony Lara Enviro Solutions secured two 15MW Waste-to-Energy projects in Andhra Pradesh valued at around ₹3,200 crore for a 20-year concession period. The National Company Law Tribunal has admitted the Joint Company Scheme Petition for the proposed merger between AG Enviro and the holding company. Chairman Managing Director Jose Jacob attributed the performance to operational efficiencies and enhanced throughput driven by higher volumes and escalated contracts.",
            "Sentiment": "positive",
            "PublishDate": 1762153139090,
            "Source": "earnings"
        },
        {
            "Title": "Antony Waste Handling Cell Reports Quarterly Results with Outstanding Municipal Receivables",
            "Summary": "Antony Waste Handling Cell Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company has significant outstanding receivables from municipal corporations totaling ₹3,766.00 lakhs in trade receivables and ₹497.53 lakhs in other current financial assets. Of the trade receivables, ₹1,500.00 lakhs is under dispute with one municipal authority, with the matter currently pending before the Supreme Court. The company received a favorable ruling from the Bombay High Court, but the municipal corporation has appealed the decision. Management believes these receivables are recoverable based on legal advice and ongoing discussions with municipal authorities. The Income Tax Department conducted searches in October 2021, resulting in demand orders for multiple assessment years primarily related to expense disallowances. The company has filed appeals against these orders. During the quarter, the company issued 6,770 equity shares under its ESOP scheme. The Board has approved a merger scheme with subsidiary AG Enviro Infra Projects Private Limited, with final hearing scheduled for November 27, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761921300387,
            "Source": "earnings"
        },
        {
            "Title": "Antony Waste Handling Cell Reports Strong Q2 Growth with Revenue Up 18% and Net Profit Rising 13%",
            "Summary": "Antony Waste Handling Cell delivered robust quarterly performance with consolidated net profit increasing to 137 million rupees from 121 million rupees year-over-year. Revenue grew significantly to 2.6 billion rupees compared to 2.2 billion rupees in the same period last year. EBITDA rose to 499 million rupees from 426 million rupees, while EBITDA margin improved slightly to 19.38% from 19.3% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1761914110238,
            "Source": "earnings"
        },
        {
            "Title": "Antony Waste Handling Cell Reports 13% Revenue Growth and Secures ₹3,200 Crore Waste-to-Energy Projects",
            "Summary": "Antony Waste Handling Cell Limited reported strong operational performance with core operating revenue increasing 13% year-on-year. The company managed 1.27 million tonnes of waste during the quarter, marking 5.9% growth, with Collection & Transportation operations growing 10.4% to 0.54 million tonnes and Processing operations rising 2.7% to 0.73 million tonnes. For the first half, total tonnage reached 2.60 million tonnes, up 8.9% year-on-year. The company sold 40,081 tonnes of Refuse Derived Fuel and 3,251 tonnes of compost during the quarter. Subsidiary Antony Lara Enviro Solutions secured two 15 MW Waste-to-Energy projects in Andhra Pradesh valued at ₹3,200 crore over 20 years, leading to incorporation of two Special Purpose Vehicles. The National Company Law Tribunal admitted the merger petition for AG Enviro Infra Projects with Antony Waste Handling Cell, with final hearing scheduled for November 27, 2025. Material subsidiary AG Enviro Infra Projects received a Rating Watch with Developing Implications from CARE Ratings due to the ongoing merger process.",
            "Sentiment": "positive",
            "PublishDate": 1760609837844,
            "Source": "stock"
        },
        {
            "Title": "Antony Waste Handling Cell Creates New Subsidiary for Waste-to-Energy Project",
            "Summary": "Antony Waste Handling Cell has established a new subsidiary called Kurnool Renew Energy Private Limited for a waste-to-energy project. Antony Lara Enviro Solutions holds a 73% stake in the newly created entity.",
            "Sentiment": "positive",
            "PublishDate": 1756885574967,
            "Source": "stock"
        },
        {
            "Title": "Antony Waste Establishes Kadapa Renew Energy Subsidiary for 15 MW Waste-to-Energy Project",
            "Summary": "Antony Waste has incorporated a step-down subsidiary called Kadapa Renew Energy to develop a 15 MW waste-to-energy project in Andhra Pradesh. This move represents the company's expansion into renewable energy generation through waste management infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1756820188144,
            "Source": "stock"
        },
        {
            "Title": "Antony Waste Handling Cell Reports 13% Revenue Growth in Q1 FY26 Earnings",
            "Summary": "Antony Waste Handling Cell Limited reported total operating revenue of Rs. 224 crores in Q1 FY26, representing 13% year-over-year growth. The municipal solid waste management company's revenue breakdown showed MSW Collection & Transportation at Rs. 151 crores (60% of revenue, +11% YoY) and Processing at Rs. 72 crores (28% of revenue, +17% YoY). EBITDA reached Rs. 62 crores (+12% YoY) with a 24% margin, while PAT stood at Rs. 23 crores (+8% YoY). The company handled 1.33 million tons of total waste (+13% YoY) and achieved 84% PLF at its PCMC Waste-to-Energy Plant, generating 25 million units of power. Management expects 8-10% revenue growth for FY27 based on existing contracts and provided EBITDA margin guidance of 23-23.5% for the next 2-3 quarters. The company faces a legal issue with Kanjurmarg landfill where the Supreme Court has stayed a Bombay High Court order, though management believes long-term revenue visibility remains strong.",
            "Sentiment": "positive",
            "PublishDate": 1755524050927,
            "Source": "earnings"
        },
        {
            "Title": "Antony Waste Subsidiary Secures ₹3,200 Crore Waste-to-Energy Projects in Andhra Pradesh",
            "Summary": "Antony Lara Enviro Solutions Private Limited, a material subsidiary of Antony Waste Handling Cell Limited, has secured two 15 MW Waste-to-Energy plant contracts in Kadapa and Kurnool clusters of Andhra Pradesh. The New & Renewable Energy Development Corporation of Andhra Pradesh Limited awarded these projects, each valued at ₹1,600 crore with a combined value of ₹3,200 crore over a 20-year concession period. The projects have a construction timeline of 24 months from concession agreement signing, Power Purchase Agreement execution, or land transfer. The generated power will be purchased by Andhra Pradesh Southern Power Distribution Company Limited at ₹8.10 per unit. The facilities will include Material Recovery Facilities for processing municipal solid waste and high-efficiency incineration units for renewable electricity generation. These projects mark Antony Group's entry into Southern India and will expand the company's clean energy portfolio to 44 MW once operational.",
            "Sentiment": "positive",
            "PublishDate": 1755055910856,
            "Source": "order&deals"
        },
        {
            "Title": "Antony Waste Handling Cell Provides ₹17 Crore Corporate Guarantee for Subsidiary's Bank Credit Facilities",
            "Summary": "Antony Waste Handling Cell Limited has extended a corporate guarantee of ₹17 crore to The Federal Bank Limited on behalf of its material subsidiary, Antony Lara Enviro Solutions Private Limited. The guarantee covers various credit facilities being availed by the subsidiary company. The company stated that promoter/promoter group/group companies have no interest in this transaction and the guarantee is provided at arm's length. The guarantee creates a contingent liability for Antony Waste Handling Cell, with potential impact only if the subsidiary fails to meet its repayment obligations to the lender.",
            "Sentiment": "neutral",
            "PublishDate": 1754914902748,
            "Source": "stock"
        },
        {
            "Title": "Antony Waste Reports 13% Revenue Growth to ₹224 Crore in Q1FY26",
            "Summary": "Antony Waste Handling Cell Limited reported total operating revenue of ₹224 crore for Q1FY26, marking a 13% year-on-year growth. EBITDA increased 12% to ₹62 crore with margins improving to 24%. The company achieved record resource recovery with refuse-derived fuel sales surging 62% to 55,500 tonnes and compost sales growing 10% to 6,600 tonnes. The waste-to-energy plant operated at 84% plant load factor. A key development was the commercial launch of the Extended Producer Responsibility initiative, with the company monetizing 20% of its first-year allocation of over 94,400 metric tonnes. PAT stood at ₹23 crore, up 8% year-on-year. Chairman Jose Jacob attributed the growth to enhanced operational efficiency, higher tipping fees, and steady contributions from fixed shifts and household fees.",
            "Sentiment": "positive",
            "PublishDate": 1754891468591,
            "Source": "earnings"
        },
        {
            "Title": "Antony Waste Handling Cell Reports Net Profit of ₹2,295.72 Lakhs in Q1 FY26",
            "Summary": "Antony Waste Handling Cell Limited reported quarterly results for the period ended June 30, 2025. The company achieved consolidated revenue from operations of ₹24,733.64 lakhs compared to ₹22,697.19 lakhs in the same quarter last year. Net profit for the quarter stood at ₹2,295.72 lakhs versus ₹2,129.57 lakhs in the previous year quarter. Basic earnings per share was ₹6.27 compared to ₹6.17 in the corresponding quarter. The company faces ongoing challenges with trade receivables of ₹3,766.00 lakhs from municipal corporations that are overdue, including ₹1,500.00 lakhs under dispute at the Supreme Court. Additionally, the company is dealing with Income Tax Department demand orders following searches conducted in October 2021. The board has approved a merger scheme with wholly-owned subsidiary AG Enviro Infra Projects Private Limited, subject to regulatory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1754665631602,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Court Stays Bombay High Court Order on Kanjurmarg Landfill De-notification for Antony Waste Subsidiary",
            "Summary": "The Supreme Court of India has stayed a Bombay High Court order that revoked the de-notification of 120 hectares at the Kanjurmarg landfill. The stay follows a Special Leave Petition filed by Antony Lara Enviro Solutions Private Limited, a material subsidiary of Antony Waste Handling Cell Limited, along with the Government of Maharashtra and Brihanmumbai Municipal Corporation. The High Court's order had revoked the 2009 de-notification of the land, restoring its status as 'protected forest' and directing BMC to implement this within three months while permitting ongoing waste disposal during this period. The site handles nearly 90% of Mumbai's solid waste, and the High Court's order presented significant operational challenges for the company.",
            "Sentiment": "positive",
            "PublishDate": 1754331714088,
            "Source": "stock"
        },
        {
            "Title": "Antony Waste Handling Cell Schedules Q1FY26 Earnings Call for August 11",
            "Summary": "Antony Waste Handling Cell Limited has scheduled an earnings call on August 11, 2025, at 3:00 pm IST to discuss Q1FY26 operational and financial performance. The call will feature Chairman and Managing Director Jose Jacob, Group President Mahendra A, and Group CFO Subramanian NG. The company will provide access numbers for participants from multiple countries including India, USA, UK, Singapore, and Hong Kong. Transcript and audio recordings will be made available on the company website following the call.",
            "Sentiment": "neutral",
            "PublishDate": 1753712443724,
            "Source": "earnings"
        },
        {
            "Title": "Antony Waste Handling Cell Reports 11% Revenue Increase in Q1",
            "Summary": "Antony Waste Handling Cell has reported an 11% year-over-year increase in its core operating revenue for the first quarter. The company's performance shows positive growth in its waste management operations.",
            "Sentiment": "positive",
            "PublishDate": 1752556743000,
            "Source": "default"
        },
        {
            "Title": "NCLT Mumbai Approves Merger of AG Enviro Infra Projects with Antony Waste",
            "Summary": "Antony Waste has announced that the National Company Law Tribunal (NCLT), Mumbai Bench, has approved the merger plan to absorb AG Enviro Infra Projects Pvt. Ltd. This corporate action represents a significant development for the company, potentially consolidating its operations and market position.",
            "Sentiment": "positive",
            "PublishDate": 1749486696000,
            "Source": "default"
        },
        {
            "Title": "Antony Waste Handling Cell Reports Q4 Financial Results",
            "Summary": "Antony Waste Handling Cell has reported its quarterly financial results. The company's consolidated net profit for Q4 was 400 million rupees, compared to 275 million rupees in the same quarter last year and 158 million rupees in the previous quarter. Revenue for Q4 was 2.4 billion rupees, up from 2.1 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1748559798000,
            "Source": "default"
        },
        {
            "Title": "Antony Waste Handling Cell Reports Q4 Financial Results",
            "Summary": "Antony Waste Handling Cell has reported its Q4 consolidated net profit at 400 million rupees, compared to 275 million rupees year-over-year and 158 million rupees quarter-over-quarter. The company's Q4 revenue stands at 2.4 billion rupees, up from 2.1 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1748520858000,
            "Source": "result"
        },
        {
            "Title": "Bombay High Court Orders Release of 196 Million Rupees to Antony Waste Handling Cell",
            "Summary": "The Bombay High Court has issued an order for the release of 196 million rupees to Antony Waste Handling Cell. This decision appears to be related to a legal matter involving the company, though specific details about the case or the reason for the fund release are not provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1744700228000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Antony Waste Handling Cell Reports 7% YoY Increase in MSW Processing",
            "Summary": "Antony Waste Handling Cell has reported managing approximately 0.87 million tonnes of Municipal Solid Waste (MSW) at its processing facilities. This represents a year-over-year increase of about 7% and a significant 30% growth compared to the previous period.",
            "Sentiment": "positive",
            "PublishDate": 1744700192000,
            "Source": "result"
        },
        {
            "Title": "Antony Waste Handling Cell Reports 20% YoY Increase in Q4FY25 Tonnage",
            "Summary": "Antony Waste Handling Cell has announced that its total tonnage for the fourth quarter of fiscal year 2025 reached 1.36 million tonnes, representing a significant year-over-year increase of approximately 20%.",
            "Sentiment": "positive",
            "PublishDate": 1744700137000,
            "Source": "result"
        },
        {
            "Title": "Antony Waste Handling Cell: Targets 20-25% Revenue Growth, 22-23% EBITDA Margin",
            "Summary": "CFO NG Iyer announces Antony Waste Handling Cell's aim for 20-25% CAGR in revenue over 3-5 years, with 22-23% EBITDA margin. Company has Rs 8,500 crore project pipeline, focuses on waste management and energy generation. Net debt at Rs 390 crore with 0.6x debt-to-equity ratio.",
            "Sentiment": "positive",
            "PublishDate": 1743568739000,
            "Source": "normal_news"
        },
        {
            "Title": "Antony Waste Handling Cell Approves Merger with AG Enviro Infra",
            "Summary": "The Board of Directors of Antony Waste Handling Cell has approved the merger of AG Enviro Infra with the company. This strategic move is aimed at optimizing the group structure and strengthening operational synergies within the organization.",
            "Sentiment": "positive",
            "PublishDate": 1743120761000,
            "Source": "corporate_action"
        },
        {
            "Title": "Antony Waste Handling Cell Approves Merger with AG Enviro Infra",
            "Summary": "The board of Antony Waste Handling Cell has approved the merger of AG Enviro Infra with the company. This merger is aimed at optimizing the group structure and strengthening operational synergies within the organization.",
            "Sentiment": "positive",
            "PublishDate": 1743077467000,
            "Source": "corporate_action"
        },
        {
            "Title": "Antony Waste Handling Cell Reports Improved Q3 EBITDA and Margin",
            "Summary": "Antony Waste Handling Cell has announced its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 520 million rupees, up from 441 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin improved to 21.42% from 20.33% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739533036000,
            "Source": "earnings"
        },
        {
            "Title": "Antony Waste Handling Cell Reports Q3 Financial Results",
            "Summary": "Antony Waste Handling Cell has announced its Q3 financial results. The company's consolidated net profit increased to 158 million rupees from 128 million rupees year-over-year. Revenue also saw growth, rising to 2.43 billion rupees from 2.17 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739533027000,
            "Source": "earnings"
        },
        {
            "Title": "BMC to Introduce Solid Waste Management User Charges",
            "Summary": "The Brihanmumbai Municipal Corporation (BMC) plans to implement user charges for solid waste management. This initiative is expected to generate revenue that will be used to improve and enhance the city's waste management systems.",
            "Sentiment": "positive",
            "PublishDate": 1738649574000,
            "Source": "corporate_action"
        },
        {
            "Title": "Antony Waste Handling Cell to Consider Q3 Results",
            "Summary": "Antony Waste Handling Cell has announced that it will consider its third quarter financial results on February 14. This indicates the company is preparing to disclose its performance for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737638558000,
            "Source": "earnings"
        },
        {
            "Title": "Antony Waste Handling Cell Reports 3.2% Increase in Q3FY25 Total Tonnage",
            "Summary": "Antony Waste Handling Cell has announced that its total tonnage for the third quarter of fiscal year 2025 reached 1.18 million tonnes, representing a year-over-year increase of 3.2%.",
            "Sentiment": "positive",
            "PublishDate": 1736985834000,
            "Source": "result"
        },
        {
            "Title": "Antony Waste Handling Cell Reports 3.2% Increase in Q3FY25 Total Tonnage",
            "Summary": "Antony Waste Handling Cell has announced that its total tonnage for the third quarter of fiscal year 2025 reached 1.18 million tonnes, representing a year-over-year increase of 3.2%.",
            "Sentiment": "positive",
            "PublishDate": 1736948546000,
            "Source": "result"
        },
        {
            "Title": "Antony Waste Handling Cell Ltd Reports Q2 Financial Results",
            "Summary": "Antony Waste Handling Cell Ltd has released its Q2 financial results. The company's consolidated net profit decreased to 120 million rupees, compared to 276 million rupees year-over-year and 175 million rupees quarter-over-quarter. Revenue for Q2 was 2.21 billion rupees, slightly down from 2.24 billion rupees year-over-year and 2.26 billion rupees quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1731284231000,
            "Source": "result"
        },
        {
            "Title": "Antony Waste Handling Cell Subsidiary Secures Rs 68 Crore Contract",
            "Summary": "A subsidiary of Antony Waste Handling Cell has been awarded a contract worth Rs 68 crore. The specifics of the contract, including its duration and scope, are not provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1729750240000,
            "Source": "corporate_action"
        },
        {
            "Title": "Antony Waste Handling Cell to Review Q2 Results",
            "Summary": "Antony Waste Handling Cell has scheduled a meeting to consider and approve its financial results for the second quarter on November 9.",
            "Sentiment": "neutral",
            "PublishDate": 1729602134000,
            "Source": "result"
        },
        {
            "Title": "Antony Waste Handling: Q2 Performance Shows Steady Growth",
            "Summary": "Antony Waste Handling Cell reported consistent performance in Q2 & H1 FY25. Q2 saw record 0.49 million tonnes in C&T operations, with total managed volume up 4% YoY. H1 FY25 showed 6.8% YoY increase in MSW volume. Subsidiary secured Rs 908-crore C&T contract from NMMC. PCMC Waste-to-Energy plant achieved 71% PLF since October 7 commissioning.",
            "Sentiment": "positive",
            "PublishDate": 1729060740000,
            "Source": "result"
        },
        {
            "Title": "Antony Waste Reports 4% Increase in Collection & Transportation Volume",
            "Summary": "Antony Waste Handling Cell Limited has announced that its Collection & Transportation (C&T) and Processing volume reached 1.19 million tonnes, representing a 4.0% year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729057426000,
            "Source": "result"
        },
        {
            "Title": "Antony Waste Handling Cell Reports Record C&T Operation",
            "Summary": "Antony Waste Handling Cell has announced that its Collection and Transportation (C&T) operation has handled a record-breaking total of approximately 0.49 tonnes.",
            "Sentiment": "positive",
            "PublishDate": 1729057405000,
            "Source": "normal_news"
        },
        {
            "Title": "Antony Waste Handling Cell: Shares Surge 9% on Rs 908 Crore Contract Win",
            "Summary": "<p><span class='positive'>Antony Waste Handling Cell's</span> subsidiary, <b>AG Enviro Infra Projects</b>, secured a <span class='positive'>Rs 908 crore contract</span> from <b>Navi Mumbai Municipal Corporation</b> for waste collection and transportation over 9 years. The company's shares <span class='positive'>rose 8.99%</span> to Rs 761.85 on NSE following the announcement.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728277569000,
            "Source": "normal_news"
        },
        {
            "Title": "Antony Waste Handling Cell Secures 908 Crore Rupee Contract",
            "Summary": "<p><span class=\"positive\">Antony Waste Handling Cell</span> has <span class=\"positive\">won</span> a <b>significant order</b> valued at <span class=\"positive\">908 crore rupees</span>. This contract represents a <b>major business development</b> for the company, potentially <span class=\"positive\">boosting</span> its revenue and market position in the waste management sector.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728198656000,
            "Source": "corporate_action"
        }
    ]
}