{
    "Symbol": "AWL",
    "ISIN": "INE699H01024",
    "News": [
        {
            "Title": "AWL Agri Business Q3 Net Profit Drops to ₹2.7B",
            "Summary": "AWL Agri Business reported consolidated net profit of ₹2.70 billion for Q3, marking a decline from ₹4.10 billion in the same quarter previous year, representing a year-on-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1770098234589,
            "Source": "co_actions_results"
        },
        {
            "Title": "AWL Agri Business Q3FY26 earnings call on Feb 3",
            "Summary": "AWL Agri Business Limited schedules earnings conference call for February 3, 2026 at 17:30 hrs IST to discuss Q3FY26 financial results with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1769687132683,
            "Source": "co_actions_results"
        },
        {
            "Title": "AWL Agri Business Files Strike-Off for Subsidiary",
            "Summary": "AWL Agri Business Limited has filed an application to strike off its wholly owned subsidiary AWL Edible Oils and Foods Private Limited from RoC records on January 27, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769509186699,
            "Source": "co_actions_results"
        },
        {
            "Title": "AWL Agri Business Shareholders Approve 11 Resolutions",
            "Summary": "AWL Agri Business Limited shareholders approved all 11 resolutions through postal ballot, including key appointments of Shrikant Kanhere as MD & CEO and Saumin Sheth as COO, with voting concluding January 16, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768915036202,
            "Source": "stocks"
        },
        {
            "Title": "AWL Agri Q3: Food & FMCG recover but industry essentials dampen growth",
            "Summary": "AWL Agri Business reports low single-digit volume growth in Q3FY26, driven by edible oil and Food & FMCG segments, while Industry Essentials declined 7% YoY due to weak castor sales.",
            "Sentiment": "neutral",
            "PublishDate": 1767621832174,
            "Source": "co_actions_results"
        },
        {
            "Title": "AWL Agri Business faces ₹1.77 lakh GST penalty",
            "Summary": "AWL Agri Business Limited receives GST penalty order of ₹1,76,763 from Maharashtra tax authorities for input tax credit reversal violations. Company plans to appeal the decision.",
            "Sentiment": "negative",
            "PublishDate": 1767186263791,
            "Source": "stocks"
        },
        {
            "Title": "AWL Agri Business faces ₹1.30 lakh CGST penalty",
            "Summary": "AWL Agri Business Limited receives penalty order of ₹1,29,830 from CGST authority for disallowing Input Tax Credit under Section 74 of CGST Act 2017. Company plans to appeal the order.",
            "Sentiment": "negative",
            "PublishDate": 1767100103407,
            "Source": "stocks"
        },
        {
            "Title": "AWL Agri Business Launches Pakko Gujarati Campaign",
            "Summary": "AWL Agri Business unveils 'Pakko Gujarati' campaign with Fortune Cottonlite festive pack for Uttarayan. Campaign features cultural icons including Siddharth Randeria, Apara Mehta, and Tiku Talsania.",
            "Sentiment": "positive",
            "PublishDate": 1767000874871,
            "Source": "stocks"
        },
        {
            "Title": "AWL Agri Business Seeks Shareholder Approval for Key Appointments",
            "Summary": "AWL Agri Business Limited has issued a postal ballot notice seeking shareholder approval for 11 resolutions, including appointment of new Managing Director and COO, re-appointment of independent directors, and adoption of amended Articles of Association following change in control.",
            "Sentiment": "neutral",
            "PublishDate": 1765977063870,
            "Source": "stocks"
        },
        {
            "Title": "AWL Agri Business faces ₹35.02 lakh UP GST penalty",
            "Summary": "AWL Agri Business Limited receives second GST penalty order of ₹35.02 lakh from Uttar Pradesh tax authorities for ITC disallowance and reconciliation differences. Company plans to appeal.",
            "Sentiment": "negative",
            "PublishDate": 1765517257803,
            "Source": "stocks"
        },
        {
            "Title": "AWL Agri Business Applies for Reclassification of Multiple Adani Group Entities from Promoter to Public Category",
            "Summary": "AWL Agri Business Limited has applied to NSE and BSE on 27 November 2025 for reclassification of numerous Adani group entities including Adani Enterprises Limited, Adani Commodities LLP, and other subsidiaries from promoter and promoter group category to public category. The reclassification application covers entities across various sectors including aerospace, agriculture, airports, cement, mining, and aviation fuel services under Regulation 31A of Listing Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764257233089,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Wilmar Sees Rs. 440.56 Crore Block Trade on NSE",
            "Summary": "Adani Wilmar executed a block trade worth Rs. 440.56 crores involving approximately 16,093,673 shares at Rs. 273.75 per share on NSE. The transaction represents a significant trading activity for the company's shares in the block deal segment.",
            "Sentiment": "neutral",
            "PublishDate": 1764042575283,
            "Source": "order&deals"
        },
        {
            "Title": "Adani Group Completely Exits AWL Agri Business After Selling Remaining 7% Stake",
            "Summary": "Adani Commodities LLP sold its remaining 90,977,502 equity shares representing 7% of AWL Agri Business through a bulk deal, completing Adani Group's full exit from the company. AWL's Board approved the reclassification of Adani Group entities from promoter/promoter group category to public shareholders category and amended Articles of Association.",
            "Sentiment": "neutral",
            "PublishDate": 1763970686039,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Group Exits AWL Agribusiness, Seeks Reclassification from Promoter to Public Category",
            "Summary": "Adani Commodities LLP sold 90,977,502 equity shares representing 7% of AWL Agribusiness Limited through a bulk deal, with Adani Group no longer holding any equity shares in the company. Adani Group entities have requested reclassification from promoter and promoter group categories to public category, confirming they no longer exercise control or hold special rights in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1763748830722,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Wilmar Sees Multiple Block Trades Worth Rs. 294.09 Crores on NSE",
            "Summary": "Adani Wilmar witnessed three separate block trades on NSE totaling Rs. 294.09 crores, involving approximately 10.7 million shares at prices ranging from Rs. 274.55 to Rs. 275.00. The largest transaction was worth Rs. 156.16 crores for 5,684,578 shares, indicating significant institutional or bulk investor activity in the stock.",
            "Sentiment": "neutral",
            "PublishDate": 1763697125537,
            "Source": "order&deals"
        },
        {
            "Title": "Adani Commodities Plans To Sell 7% Stake In AWL Agri Business Through Block Deal Worth ₹2,501 Crore",
            "Summary": "Adani Commodities LLP is planning to sell up to 7% stake in AWL Agri Business through block deals with a floor price of ₹275 per share. The transaction has an offer size of ₹2,501 crore, representing a significant stake sale in the agricultural business company.",
            "Sentiment": "neutral",
            "PublishDate": 1763650517394,
            "Source": "corporate_action"
        },
        {
            "Title": "AWL Agribusiness Submits IPO Proceeds Monitoring Report for Quarter Ended September 30, 2025",
            "Summary": "AWL Agribusiness Limited (formerly Adani Wilmar Limited) filed its quarterly monitoring agency report through HDFC Bank for IPO proceeds utilization covering the quarter ended September 30, 2025. The company had raised Rs. 36,000 million through its IPO and has fully utilized the funds across capital expenditure, debt repayment, strategic acquisitions, and general corporate purposes, with previous timeline extensions approved by the Board for strategic acquisition deployment.",
            "Sentiment": "neutral",
            "PublishDate": 1763119792210,
            "Source": "corporate_action"
        },
        {
            "Title": "Wilmar International to Acquire 13% Stake in AWL Agri Business for ₹4,650 Crore",
            "Summary": "Wilmar International is set to acquire a 13% stake in AWL Agri Business for ₹4,650 crore. This acquisition represents a significant investment by Wilmar International in the agricultural business sector.",
            "Sentiment": "positive",
            "PublishDate": 1762915855460,
            "Source": "order&deals"
        },
        {
            "Title": "Competition Commission Approves AWL Agri Business-Lence Deal",
            "Summary": "The Competition Commission has approved a deal between AWL Agri Business and Lence. The regulatory clearance allows the transaction to proceed.",
            "Sentiment": "positive",
            "PublishDate": 1762867565854,
            "Source": "order&deals"
        },
        {
            "Title": "AWL Agri Business Reports Mixed Q2 Performance with 7% Sequential Volume Growth",
            "Summary": "AWL Agri Business Limited delivered 1.68 million tonnes volume in Q2, showing 7% sequential growth and 2% year-on-year growth. EBITDA reached INR 600 crores versus INR 572 crores in Q1, representing 7% sequential growth but 9% year-on-year decline. Consolidated PAT stood at INR 245 crores against INR 238 crores last quarter. For H1, the company recorded 3.26 million tonnes volume against 3.31 million tonnes last year, with EBITDA at INR 1,200 crores versus INR 1,300 crores previously. The company maintained gross margins above INR 11,000 per tonne and EBITDA above INR 3,500 per tonne. Edible oil segment faced challenges from Nepal imports under SAFTA agreement, which now accounts for 12% of India's soya imports at 0% duty versus 16.5% for domestic players. Alternative channels grew 35% with quick commerce expanding 86%. Food and FMCG segment saw 10% volume decline but delivered positive PBT of INR 56 crores. Management expects H2 improvement driven by festival season demand and GST reduction from 18% to 5% on various food products.",
            "Sentiment": "neutral",
            "PublishDate": 1762515782368,
            "Source": "earnings"
        },
        {
            "Title": "AWL Agri Business Provides Growth Guidance Across Food and Edible Oil Segments",
            "Summary": "AWL Agri Business shared guidance during a conference call covering multiple business segments. For the Food & FMCG segment, the company expects to remain EBITDA positive, though margins may face pressure from growth investments, with meaningful bottom line contribution anticipated by FY28. The company targets maintaining gross margins of INR 11,000 per ton and EBITDA of INR 3,500 per ton. For H2 FY26, AWL expects 5-6% volume growth in edible oils. The company aims to achieve close to INR 10,000 crores in food business revenue by FY27.",
            "Sentiment": "positive",
            "PublishDate": 1762400039531,
            "Source": "stock"
        },
        {
            "Title": "AWL Agri Business Announces Leadership Restructuring with New MD & CEO",
            "Summary": "AWL Agri Business Limited (formerly Adani Wilmar Limited) announced significant leadership changes effective November 4, 2025. Shrikant Kanhere has been appointed as Managing Director and CEO for a three-year term, transitioning from his role as Deputy CEO & CFO. Angshu Mallick, who served as MD & CEO, has been redesignated as Executive Deputy Chairman until March 31, 2027. Saumin Sheth has been appointed as Whole Time Director and Chief Operating Officer for three years. Pankaj Goyal has been named Interim Chief Financial Officer, replacing Kanhere in the CFO role. Additionally, Kuok Khoon Hong's designation changed from Non-Executive Vice Chairman to Non-Executive Director. The appointments of Kanhere and Sheth are subject to shareholder approval. The company operates 24 manufacturing facilities across 11 states and serves over 123 million households through its Fortune brand.",
            "Sentiment": "positive",
            "PublishDate": 1762155467619,
            "Source": "corporate_governance"
        },
        {
            "Title": "AWL Agri Business Reports Mixed Q2 Results with Revenue Growth but Lower Profit",
            "Summary": "AWL Agri Business (Adani Wilmar) reported quarterly results showing revenue growth to 176 billion rupees from 145 billion rupees year-over-year. However, consolidated net profit declined to 2.44 billion rupees from 3.1 billion rupees in the same period last year. EBITDA increased to 6.88 billion rupees from 5.6 billion rupees year-over-year, while EBITDA margin remained relatively stable at 3.91% compared to 3.93% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762151272746,
            "Source": "earnings"
        },
        {
            "Title": "Government Lifts Export Ban on De-Oiled Rice Bran",
            "Summary": "The government has removed the ban on exports of de-oiled rice bran. This development relates to AWL Agri Business, which operates in the agricultural sector.",
            "Sentiment": "positive",
            "PublishDate": 1759469389814,
            "Source": "sectoral"
        },
        {
            "Title": "AWL Agri Business Signs MoU to Lead National Mustard Model Farm Initiative",
            "Summary": "AWL Agri Business Limited has signed a Memorandum of Understanding with the Solvent Extractors' Association of India (SEA) and Solidaridad Regional Expertise Centre to lead the Regenerative Mustard Mission. The two-year agreement, effective from September 2025 to August 2027, will establish 3,000 mustard model farms across nine districts in Rajasthan, Madhya Pradesh, and Haryana, scaling up from existing 1,500 farms. The initiative aims to benefit 20,000 farmers through demonstration plots, field schools, and digital advisory platforms, targeting a 30% increase in smallholder productivity and income. The project focuses on regenerative agriculture practices, satellite-based monitoring, soil health management, and climate-resilient techniques to bridge the yield gap in mustard cultivation and support India's self-reliance in edible oil production.",
            "Sentiment": "positive",
            "PublishDate": 1758731922887,
            "Source": "stock"
        },
        {
            "Title": "AWL Agri Business Receives Chinese Regulatory Approval for Equity Sale to Lence Pte",
            "Summary": "AWL Agri Business Limited received approval from China's State Administration for Market Regulation for the sale of equity shares by Adani Commodities LLP to Lence Pte Ltd. The transaction involves the sale of 11% to 20% of AWL's equity shares, with the final number to be determined by Lence. The deal is priced at INR 275 per share and involves between 142,964,647 to 259,935,721 equity shares. The transaction was originally agreed upon in July 2025 through a share purchase agreement and remains subject to other conditions precedent outlined in the agreement.",
            "Sentiment": "positive",
            "PublishDate": 1758111506497,
            "Source": "order&deals"
        },
        {
            "Title": "AWL Agri Business Receives German Approval for ₹275 Per Share Sale to Lence Pte Ltd",
            "Summary": "AWL Agri Business has obtained approval from Germany for the sale of its shares at ₹275 per share to Lence Pte Ltd. The transaction involves the transfer of ownership to the Singapore-based entity following regulatory clearance from German authorities.",
            "Sentiment": "positive",
            "PublishDate": 1756806416710,
            "Source": "order&deals"
        },
        {
            "Title": "Adani Commodities Sells 10.42% Stake in AWL Agri Business Through Block Deal",
            "Summary": "Adani Commodities LLP sold 13,54,82,400 equity shares of AWL Agri Business Limited through a block deal on July 18, 2025. The transaction reduced Adani Commodities' shareholding from 30.42% to 20.00% of the company's total equity. The sale represents 10.42% of AWL Agri Business's total share capital. Adani Commodities is a promoter of AWL Agri Business Limited, which was formerly known as Adani Wilmar Limited. The company's shares are listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1753098784534,
            "Source": "order&deals"
        },
        {
            "Title": "AWL Agri Business: Record Q1 Revenue Drives 6% Stock Surge",
            "Summary": "AWL Agri Business reported its highest-ever quarterly revenue of Rs 17,059 crore in Q1FY26, up 21% YoY, driven by strong performance in the edible oil segment. However, net profit declined 24% to Rs 236 crore. The company expanded its retail reach by 18% YoY and saw 75% volume growth in Quick Commerce.",
            "Sentiment": "positive",
            "PublishDate": 1752729459000,
            "Source": "earnings"
        },
        {
            "Title": "AWL Agri Business Projects Revenue Growth in Food & FMCG Segment",
            "Summary": "AWL Agri Business has announced revenue projections for its Food & FMCG segment, expecting it to reach ₹7,000 crore by FY26 and ₹10,000 crore by FY27. The company also anticipates a quarterly EBITDA of ₹375-400 crore for its Edible Oil division. These projections were shared during a company concall.",
            "Sentiment": "positive",
            "PublishDate": 1752636617000,
            "Source": "default"
        },
        {
            "Title": "AWL Agri Business: Q1 Profits Fall Despite Revenue Growth",
            "Summary": "AWL Agri Business Ltd. reported Q1 results with net sales up 20.5% to ₹17,058 crore, driven by higher edible oil prices. However, net profit declined 24% to ₹236 crore due to increased expenses. EBITDA fell 41.5% to ₹366 crore, with margins contracting to 2.15%. The company faced challenges including muted consumer demand and strategic consolidation of rice operations. Quick commerce sales grew 75%, while the stock has declined 20% in 2025.",
            "Sentiment": "negative",
            "PublishDate": 1752570601000,
            "Source": "earnings"
        },
        {
            "Title": "AWL Agri Business Reports Volume Decrease in Q1",
            "Summary": "AWL Agri Business has reported a decrease in volume for the first quarter, which is contrary to the management's forecast of 7-9% growth for FY26. The exact percentage of decrease or specific volume figures are not provided in the given news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1752570224000,
            "Source": "default"
        },
        {
            "Title": "AWL Agri Business Expects Benefits from Edible Oil Duty Cut and Palm Oil Price Stabilization",
            "Summary": "AWL Agri Business anticipates that the reduction in duty on crude edible oils will be advantageous for local refiners. The company also predicts that the stabilization of palm oil prices will contribute to volume growth in the near future.",
            "Sentiment": "positive",
            "PublishDate": 1752569865000,
            "Source": "default"
        },
        {
            "Title": "AWL Agri Business Reports Q1 Financial Results",
            "Summary": "AWL Agri Business has released its Q1 financial results. The company's EBITDA decreased to 3.66 billion rupees from 6.2 billion rupees year-over-year. The EBITDA margin fell to 2.14% from 4.37% in the same period last year. Revenue increased to 171 billion rupees from 141.6 billion rupees year-over-year. The consolidated net profit declined to 2.36 billion rupees from 3.13 billion rupees compared to the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1752569351000,
            "Source": "result"
        },
        {
            "Title": "AWL Agri Business Reports 21% Revenue Growth in Q1 FY26",
            "Summary": "AWL Agri Business Limited achieved a 21% year-on-year revenue increase in Q1 FY26, despite a 4% volume decline. Edible oil sales drove revenue growth, comprising 60% of volume. The quick commerce segment saw over 75% growth, while alternate channel revenue exceeded ₹3,900 crore. Industry Essentials revenue surpassed ₹2,000 crore with 9% volume growth. The Food and FMCG segment experienced a 2% revenue decline, excluding G2G business. GD Foods, a recent acquisition, demonstrated high single-digit revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1751593933000,
            "Source": "earnings"
        },
        {
            "Title": "AWL Agri Business Reports Mixed Q1 Results with Revenue Growth Despite Volume Decline",
            "Summary": "AWL Agri Business Ltd has reported mixed results for Q1. The company's branded exports volume increased by 22% year-over-year, with revenue exceeding 3 billion rupees. Quick commerce sales showed significant growth, rising by 75% compared to the same period last year. However, the Food & FMCG segment experienced a 2% revenue drop, and edible oils volume declined by 2% due to pressure in palm oil sales. Despite a 4% yearly drop in overall volumes, the company's revenue climbed 21% year-over-year, attributed to increased edible oil prices.",
            "Sentiment": "neutral",
            "PublishDate": 1751554149000,
            "Source": "default"
        },
        {
            "Title": "AWL Agri Business: ICICI Securities Maintains 'Buy' Rating with 34% Upside Potential",
            "Summary": "AWL Agri Business is expanding its distribution reach and investing in flanker brands to regain market share. The company increased its direct outlet reach to 0.86 million outlets and rural coverage to 50,000 towns. Volumes in the south region grew by 25% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1746181992000,
            "Source": "normal_news"
        },
        {
            "Title": "Awl Agri Business Reports Strong Q4 Financial Results",
            "Summary": "Awl Agri Business has announced its Q4 consolidated financial results. The company's net profit increased to 1.9 billion rupees, up from 1.58 billion rupees year-over-year. However, this represents a decrease from the previous quarter's 4.1 billion rupees. Revenue for Q4 rose significantly to 182 billion rupees, compared to 132.4 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1745885429000,
            "Source": "default"
        },
        {
            "Title": "AWL Agri Business Plans Significant Expansion of Retail Outlets",
            "Summary": "AWL Agri Business has announced plans to increase its direct outlet reach by over 1.5 times by FY26. This expansion strategy is specifically targeted at their branded basmati rice business. The company aims to surpass competitors' retail reach through this initiative.",
            "Sentiment": "positive",
            "PublishDate": 1745849221000,
            "Source": "default"
        },
        {
            "Title": "AWL Agri Business: Q4 Profit Surges 21%, Revenue Up 38%",
            "Summary": "AWL Agri Business reported a 21% increase in Q4 FY2024-25 net profit to Rs 190.28 crore. Revenue rose 37.9% to Rs 18,229.6 crore. EBITDA grew 25.6% to Rs 448 crore, though margins declined slightly. The company achieved 9% volume growth in Q4 despite raw material price pressures.",
            "Sentiment": "positive",
            "PublishDate": 1745848654000,
            "Source": "earnings"
        },
        {
            "Title": "AWL Agri Business Q4 Financial Results",
            "Summary": "AWL Agri Business reported its Q4 financial results. EBITDA increased to 4.5B rupees from 3.57B year-over-year, while EBITDA margin decreased to 2.46% from 2.7%. Consolidated net profit rose to 1.9B rupees from 1.58B year-over-year, but decreased from 4.1B quarter-over-quarter. Revenue grew significantly to 182B rupees from 132.4B year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1745845461000,
            "Source": "result"
        },
        {
            "Title": "Adani Wilmar to Change Name to AWL Agri Business",
            "Summary": "Adani Wilmar Limited has announced that it will change its name to AWL Agri Business, effective April 16. This corporate rebranding initiative likely reflects a strategic shift or expansion in the company's focus within the agricultural and food processing sectors.",
            "Sentiment": "neutral",
            "PublishDate": 1744123323000,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Wilmar: Acquisition of GD Foods' Tops Brand Boosts Shares",
            "Summary": "Adani Wilmar signed an agreement to acquire GD Foods Manufacturing India, owner of the Tops brand. The acquisition will be in phases, with 80% shares acquired initially and the rest over three years. This move aligns with Adani Wilmar's strategy to expand its value-added food products portfolio. The deal is expected to close in two phases, with the first part completing within 60 days.",
            "Sentiment": "positive",
            "PublishDate": 1741154901000,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Wilmar to Acquire 80% Stake in G.D. Foods",
            "Summary": "Adani Wilmar has executed a Share Purchase Agreement (SPA) to acquire G.D. Foods. The first tranche of the acquisition is valued at 6.03 billion rupees for an 80% share in the company.",
            "Sentiment": "positive",
            "PublishDate": 1741093862000,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Wilmar Aims for 10% Sales Volume Growth in FY26",
            "Summary": "An executive from Adani Wilmar has stated that the company plans to return to a sales volume growth model of approximately 10% in the fiscal year 2026. This indicates the company's strategic outlook for future expansion and market performance.",
            "Sentiment": "positive",
            "PublishDate": 1738741623000,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Wilmar Reports Improved Q3 EBITDA and Margin",
            "Summary": "Adani Wilmar has announced its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 7.91 billion rupees, up from 5.04 billion rupees in the same quarter last year. Additionally, the EBITDA margin improved to 4.69% from 3.90% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1737963572000,
            "Source": "earnings"
        },
        {
            "Title": "Adani Wilmar Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "Adani Wilmar, a consumer goods company, has announced its financial results for the third quarter. The company's consolidated net profit has more than doubled, reaching 4.1 billion rupees compared to 2 billion rupees in the same period last year. This substantial year-over-year growth indicates strong performance and profitability for the company.",
            "Sentiment": "positive",
            "PublishDate": 1737963504000,
            "Source": "earnings"
        },
        {
            "Title": "Adani Wilmar Launches New Food Processing Plant in Gohana",
            "Summary": "Adani Wilmar has announced the commencement of operations at its new food processing plant located in Gohana. This development marks an expansion of the company's production capabilities in the food processing sector.",
            "Sentiment": "positive",
            "PublishDate": 1737630577000,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Wilmar: Share Price Plummets 9% Amid Ongoing Offer for Sale",
            "Summary": "Adani Wilmar's share price dropped over 9% in morning trading, opening at ₹271.05 and falling to ₹267.45. The decline coincides with an ongoing offer for sale, with one promoter exercising the Oversubscription Option.",
            "Sentiment": "negative",
            "PublishDate": 1736743198000,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Wilmar Announces Oversubscription Option in Offer for Sale",
            "Summary": "Adani Wilmar has announced its intention to exercise an oversubscription option in its Offer for Sale (OFS). Adani Commodities will offer an over-subscription option for 1.51% in Adani Wilmar. The aggregate number of offer shares has been increased to 195.1 million, with the selling shareholder now offering up to 15.01% stake in the company via the OFS.",
            "Sentiment": "neutral",
            "PublishDate": 1736513216000,
            "Source": "corporate_action"
        }
    ]
}