{
    "Symbol": "AXISCADES",
    "ISIN": "INE555B01013",
    "News": [
        {
            "Title": "AXISCADES Subsidiary Wins Rs. 80 Crore HAL Order",
            "Summary": "AXISCADES Technologies' subsidiary Mistral Solutions secured a multi-year order worth Rs. 80 crores from Hindustan Aeronautics Limited for supplying Mission Computer and Smart Display Units.",
            "Sentiment": "positive",
            "PublishDate": 1770608358502,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jupiter Capital pledges AXISCADES shares to lenders",
            "Summary": "Jupiter Capital Private Limited pledged 3.40 lakh AXISCADES Technologies shares to Aditya Birla Capital and Tata Capital as security, disclosed under SEBI takeover regulations on January 27, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769509846370,
            "Source": "co_actions_results"
        },
        {
            "Title": "AXISCADES Partners with OGMA for Global MRO Services",
            "Summary": "AXISCADES Technologies Limited announces strategic partnership with OGMA of Portugal (Embraer Company) for aerospace and defence MRO services, targeting India, UAE, and MENA regions.",
            "Sentiment": "positive",
            "PublishDate": 1769483840353,
            "Source": "co_actions_results"
        },
        {
            "Title": "AxisCades Clarifies Volume Surge Market-Driven",
            "Summary": "AxisCades Technologies responds to BSE surveillance query on trading volume increase, stating no undisclosed material events and attributing surge to market forces.",
            "Sentiment": "neutral",
            "PublishDate": 1769173163914,
            "Source": "stocks"
        },
        {
            "Title": "AXISCADES Subsidiary Wins $1M Audio Testing Contract",
            "Summary": "AXISCADES Technologies' subsidiary Mistral Solutions secured a multi-year international contract worth $1 million for audio product testing services at its newly established Acoustic Lab facility.",
            "Sentiment": "positive",
            "PublishDate": 1769138342123,
            "Source": "co_actions_results"
        },
        {
            "Title": "AXISCADES Gets ESG Score of 70/100 from SES ESG Research",
            "Summary": "AXISCADES Technologies receives medium-category ESG rating of 70/100 from SEBI-registered SES ESG Research, based on FY25 disclosures and public data without company engagement.",
            "Sentiment": "positive",
            "PublishDate": 1768910673702,
            "Source": "stocks"
        },
        {
            "Title": "AXISCADES Subsidiary Wins ₹100 Cr LLTR Ashwini Contract",
            "Summary": "Mistral Solutions secured ₹100 crore contract from DRDO-BEL's LLTR Ashwini programme for signal processing units, supporting India's defence indigenisation with two-year execution timeline.",
            "Sentiment": "positive",
            "PublishDate": 1768794380585,
            "Source": "co_actions_results"
        },
        {
            "Title": "AXISCADES Wins Tax Case as Karnataka High Court Quashes IT Notices",
            "Summary": "Karnataka High Court quashed Income Tax Department notices against AXISCADES subsidiary, resolving litigation over capital loss admissibility for FY 2014-15 that began in July 2023.",
            "Sentiment": "positive",
            "PublishDate": 1767876609131,
            "Source": "stocks"
        },
        {
            "Title": "Jupiter Capital pledges 1.4L AXISCADES shares",
            "Summary": "Jupiter Capital Private Limited pledged 1,40,000 AXISCADES Technologies shares to Aditya Birla Capital and released 60,000 shares from Tata Capital pledge as security arrangements.",
            "Sentiment": "neutral",
            "PublishDate": 1767349931600,
            "Source": "stocks"
        },
        {
            "Title": "AXISCADES Technologies Allots 800 Equity Shares Under Employee Stock Option Plan",
            "Summary": "AXISCADES Technologies Limited allotted 800 equity shares of Rs. 5 face value each to one eligible grantee under the YAXISCADES ESOP 2018-Series 2 scheme. The allotment increased the company's paid-up share capital from Rs. 21,25,82,945 to Rs. 21,25,86,945, with total equity shares rising to 4,25,17,389.",
            "Sentiment": "neutral",
            "PublishDate": 1763642768108,
            "Source": "corporate_action"
        },
        {
            "Title": "AXISCADES Reports Strong Q2 FY26 Results, Launches Power 930 Initiative Targeting Rs. 9,000 Crores by 2030",
            "Summary": "AXISCADES Technologies delivered robust quarterly results with consolidated revenue of Rs. 299 crores (13% YoY growth), EBITDA of Rs. 47 crores (41.5% YoY increase), and PAT of Rs. 23 crores (89% YoY growth). The company launched its ambitious Power 930 initiative targeting Rs. 9,000 crores revenue by 2030, with plans for 40% annual growth in core aerospace, defense, and ESAI segments over FY26-27, followed by 70% growth acceleration through new manufacturing facilities.",
            "Sentiment": "positive",
            "PublishDate": 1763622755674,
            "Source": "earnings"
        },
        {
            "Title": "Altera Corporation Expands Strategic Partnership with AXISCADES for Defense Applications",
            "Summary": "Altera Corporation, the world's largest pure-play FPGA solutions provider, has signed an agreement to expand its strategic partnership with AXISCADES Technologies Limited for Mission-Critical Defense Applications Development. The partnership expansion affects both companies' defense sector operations and strengthens their collaborative relationship in developing critical defense technology solutions.",
            "Sentiment": "positive",
            "PublishDate": 1763450786323,
            "Source": "order&deals"
        },
        {
            "Title": "AXISCADES Technologies Shares Rally 5% on Strong Q2 Results",
            "Summary": "AXISCADES Technologies shares surged 5% to ₹1,557.50 following robust Q2FY26 results showing 13% revenue growth to ₹299 crores and 88.9% jump in profit after tax to ₹23 crores. The aerospace and defense company reported strong segment performance with defense revenues growing 37% and aerospace advancing 16%, while announcing ambitious Power930 initiative targeting ₹9,000 crore revenues by FY2030.",
            "Sentiment": "positive",
            "PublishDate": 1763105068636,
            "Source": "earnings"
        },
        {
            "Title": "Axiscades Technologies Unveils 'Power930' Strategy Targeting ₹9,000 Cr Revenue by FY30",
            "Summary": "Axiscades Technologies announced its 'Power930' multi-year growth strategy targeting ₹9,000 crore revenue by FY30. The company aims for 40% year-over-year growth in FY26-27, accelerating to 70% by FY28. The strategy involves pivoting from services to a product and solutions model, with EBITDA per employee already up 47% year-over-year. Infrastructure expansion includes the Aero-Land and Devanahalli Atmanirbhar Complex. The company has formed strategic alliances with MBDA, Indra, and CILAS to strengthen its defense pipeline. Management expressed confidence in delivering sustained margin expansion and achieving global leadership in aerospace and defense sectors.",
            "Sentiment": "positive",
            "PublishDate": 1762965566884,
            "Source": "stock"
        },
        {
            "Title": "AXISCADES TECH Reports Strong Q2 Performance with 42% Profit Growth and Secures Land for Defense Complex",
            "Summary": "AXISCADES TECH delivered robust quarterly results with consolidated net profit rising to 231 million rupees from 123 million rupees year-over-year. Revenue increased to 2.99 billion rupees compared to 2.6 billion rupees in the same period last year. EBITDA grew significantly to 471 million rupees from 332.8 million rupees, while EBITDA margin expanded to 15.74% from 12.59%. Additionally, the company received provisional land allotment for establishing a defense and engineering complex in Telangana.",
            "Sentiment": "positive",
            "PublishDate": 1762963556554,
            "Source": "earnings"
        },
        {
            "Title": "AXISCADES Technologies Allots 18,936 Equity Shares Under Employee Stock Option Plan",
            "Summary": "AXISCADES Technologies Limited has allotted 18,936 equity shares of Rs. 5 face value each to 3 eligible employees under the YAXISCADES ESOP 2018-Series 1 scheme. The Nomination and Remuneration Committee approved the allotment on November 6, 2025. Following this allotment, the company's paid-up share capital increased from Rs. 21,24,88,265 (comprising 4,24,97,653 equity shares) to Rs. 21,25,82,945 (comprising 4,25,16,589 equity shares). The exercise price was Rs. 52.65 for 1,912 shares and Rs. 17 for 17,024 shares, with corresponding premiums of Rs. 47.65 and Rs. 12 respectively. The newly allotted shares will rank pari-passu with existing equity shares of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1762491710996,
            "Source": "corporate_action"
        },
        {
            "Title": "Axiscades Technologies Strengthens Partnership With MBDA For Make In India Defense Initiatives",
            "Summary": "Axiscades Technologies has enhanced its collaboration with MBDA, a European missile systems company, to support Make In India initiatives. The company has opened a larger testing facility in Bengaluru and plans to establish a specialized system integration centre and missile complex in Hyderabad.",
            "Sentiment": "positive",
            "PublishDate": 1762422761199,
            "Source": "order&deals"
        },
        {
            "Title": "AXISCADES Partners with Electronic Bird Control to Deploy Falcon-Inspired Drones in India",
            "Summary": "AXISCADES Aerospace Technologies Limited and French drone company Electronic Bird Control signed a strategic MoU to bring the E-Raptor drone to the Indian market for military and civilian applications. The E-Raptor is a biomimetic drone designed to resemble a falcon, offering stealth, agility, and performance for surveillance and bird control operations across defense reconnaissance, airport safety, and wildlife management. AXISCADES plans to localize E-Raptor drone production in India under the Make in India initiative. The partnership aims to support India's defense modernization and enhance surveillance and safety standards. AXISCADES is a defense technology solutions provider with over 3,000 professionals across 17 global locations, while Electronic Bird Control, founded in 2019, specializes in bio-mimetic drone development.",
            "Sentiment": "positive",
            "PublishDate": 1762402777697,
            "Source": "order&deals"
        },
        {
            "Title": "AXISCADES Technologies Partners with CILAS S.A. for Counter-Drone Technology Development",
            "Summary": "AXISCADES Technologies has formed a new partnership with CILAS S.A. to develop advanced counter-drone technologies for Indian Forces. The collaboration includes a joint project focused on developing a vehicle-mounted laser weapon system.",
            "Sentiment": "positive",
            "PublishDate": 1761892953167,
            "Source": "order&deals"
        },
        {
            "Title": "AXISCADES Technologies Wins ₹7.99 Crore Indian Army Contract for Counter Drone Systems",
            "Summary": "AXISCADES Technologies has secured a ₹7.99 crore contract from the Indian Army to supply portable counter drone systems. The company is scheduled to complete delivery within 12 months of the contract award.",
            "Sentiment": "positive",
            "PublishDate": 1759136437017,
            "Source": "stock"
        },
        {
            "Title": "AXISCADES Technologies Wins Fifth Consecutive Bombardier Diamond Supplier Award",
            "Summary": "AXISCADES Technologies Limited received the Bombardier Diamond Supplier Award for the fifth consecutive year in the Indirect Goods and Services - Engineering Services category. The award was presented at a ceremony held on September 15th in Montreal, Canada, recognizing the company's operational performance in quality and delivery. The recognition represents the highest level of acknowledgment among Bombardier's global suppliers. AXISCADES' partnership with Bombardier spans over a decade, covering aerospace engineering and advanced engineering services. Deputy CEO and President of Aerospace KP Mohanakrishnan highlighted the company's commitment to excellence and their goal to become a $1 billion company. AXISCADES operates across 17 locations globally with over 3,000 professionals, providing end-to-end technology solutions in Aerospace, Defence, Electronics, Semiconductors, and AI domains.",
            "Sentiment": "positive",
            "PublishDate": 1758772983953,
            "Source": "stock"
        },
        {
            "Title": "Axiscades Tech Subsidiary Secures $1M Pilot Contracts with Global Hyperscalers",
            "Summary": "Axiscades Technologies announced that its subsidiary Mistral Solutions won new orders in electronics, semiconductor and AI divisions. The company secured pilot contracts worth $1 million with two global hyperscalers for developing production line testing equipment and audio product test apparatus. To support these projects, Axiscades is building infrastructure in Bengaluru including an Acoustic Lab and 3D printed PCB prototype facility, plus establishing a front-end engineering team in the United States. The company also recently secured $1.2 million in pilot orders for aircraft cabin interior solutions from aerospace clients. Axiscades shares initially surged 5% but later gave up most gains, closing up 0.6% at ₹1,377.",
            "Sentiment": "positive",
            "PublishDate": 1756960260119,
            "Source": "stock"
        },
        {
            "Title": "AXISCADES Tech Launches New Electronics, Semiconductor, And AI Division",
            "Summary": "AXISCADES Tech has launched a new division focused on electronics, semiconductor, and artificial intelligence. The launch is attributed to achievements made by Mistral Solutions.",
            "Sentiment": "positive",
            "PublishDate": 1756954852506,
            "Source": "stock"
        },
        {
            "Title": "AXISCADES Technologies Secures $1.2 Million Aircraft Cabin Interiors Pilot Orders",
            "Summary": "AXISCADES Technologies Limited announced it secured two pilot orders worth $1.2 million for aircraft cabin interiors design, development, and retrofit solutions. The contracts were awarded by a leading aerospace original equipment manufacturer and an aircraft cabin interior company operating in Europe and the United States. The projects will cover cabin design, seating systems, electrical wiring, retrofit solutions, and technical documentation. This marks AXISCADES' expansion into cabin interiors, building on over two decades of expertise in aero-structures. The company views this diversification as strengthening its end-to-end engineering services and positioning it to capitalize on the growing aircraft interiors market driven by modernization requirements and passenger experience improvements. Company shares ended at ₹1,285.00, up ₹39.20 or 3.15%.",
            "Sentiment": "positive",
            "PublishDate": 1756748633180,
            "Source": "stock"
        },
        {
            "Title": "AXISCADES Enters Aircraft Cabin Interiors Market to Boost Aerospace Growth",
            "Summary": "AXISCADES has entered the aircraft cabin interiors segment as part of its aerospace growth strategy. This move represents the company's expansion into a new area within the aerospace industry.",
            "Sentiment": "positive",
            "PublishDate": 1756745767554,
            "Source": "stock"
        },
        {
            "Title": "AXISCADES Subsidiary Secures Su-30MKI Modernization Contract Worth Potential Rs 150 Crores",
            "Summary": "AXISCADES Technologies announced that its subsidiary Mistral Solutions has secured a development contract from CASDIC for Electronic Control Units in the Su-30MKI 'Super-30' modernization program. The Bengaluru-based defense technology company will initially develop 10 Electronic Control Units for the aircraft's cooling system during the prototype development phase. This contract is expected to lead to a production order for approximately 600 units valued at Rs 150 crores over five years. CEO C. Manikandan stated the order reflects AXISCADES' capability to design and deliver advanced indigenous technologies for combat requirements. AXISCADES operates as an end-to-end technology and solutions provider in aerospace, defense, and electronics domains, employing over 3,000 professionals across 17 global locations. The company's shares were trading at ₹1,270, up by ₹24.20 or 1.94% on the NSE.",
            "Sentiment": "positive",
            "PublishDate": 1756713987123,
            "Source": "order&deals"
        },
        {
            "Title": "Axiscades Tech Secures ₹150 Crore Order",
            "Summary": "Axiscades Tech has received an order worth ₹150 crore. The company announced this development, though specific details about the nature of the order, client, or timeline were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1756699873114,
            "Source": "order&deals"
        },
        {
            "Title": "AXISCADES Technologies CEO Alfonso Martinez Resigns, Takes International Role; Dr. Sampath Ravinarayanan Becomes Chairman & MD",
            "Summary": "AXISCADES Technologies Limited announced leadership changes effective August 22-23, 2025. Alfonso Martinez Fernandez resigned as Chief Executive Officer & Managing Director to assume the role of Head of International Business and Global Operations and Managing Director & CEO of AXISCADES GmbH. Dr. Sampath Ravinarayanan has been re-designated from Chairman and Whole Time Director to Chairman and Managing Director. Martinez cited the company's goal to become a $1 billion revenue company by 2030 and the need for international expansion as reasons for the transition. With over 25 years of leadership experience in engineering, aerospace, defense, and technology services, Martinez will focus on strengthening the group's international business across North America, Europe, the UK, and Asia-Pacific. The company must fill the board vacancy within three months per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1755885910209,
            "Source": "corporate_governance"
        },
        {
            "Title": "AXISCADES Technologies Reports 9% Revenue Growth, Sets Ambitious Rs 9,000 Crore Target by 2030",
            "Summary": "AXISCADES Technologies reported quarterly revenue of Rs 244 crores, up 9% year-on-year, with EBITDA at Rs 34 crores maintaining 14% margins. The company announced three major strategic initiatives: targeting over 40% year-on-year growth with an order book of Rs 1,260 crores for FY26 and Rs 1,827 crores for FY27; launching 'Power 930' plan to reach Rs 9,000 crores ($1 billion) revenue by 2030; and forming global partnerships with MBDA for missile activities and Indra for radar systems. Core business segments grew 17% year-on-year to Rs 182 crores, driven by ESAI (34% growth), defense (23% growth), and aerospace (8% growth). The company secured new engagements with Amazon and Apple in the ESAI segment, while defense order book includes Rs 540 crores for current year delivery. Management expects revenue acceleration in H2 FY26 with defense order execution and projects 25% overall growth for FY26 including 300 basis points EBITDA margin improvement.",
            "Sentiment": "positive",
            "PublishDate": 1755497308271,
            "Source": "earnings"
        },
        {
            "Title": "Axiscades Tech Targets 40%+ Growth in Defense, Aerospace Sectors; Projects 25% Revenue Growth for FY26",
            "Summary": "Axiscades Tech announced growth targets exceeding 40% annually in its key sectors including defense, aerospace, and ESAI. The company has projected 25% total revenue growth for FY26 and plans to enhance EBITDA margins by 300 basis points. These projections were shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1754883516891,
            "Source": "stock"
        },
        {
            "Title": "AXISCADES Targets ₹9,000 Crore Revenue by FY30 with Defense and Aerospace Focus",
            "Summary": "AXISCADES has announced ambitious growth plans targeting ₹9,000 crore in revenue by FY30. The company aims to achieve over 40% annual growth through expansion in defense, aerospace, and ESAI sectors. Additionally, AXISCADES plans to increase its EBITDA by 300 basis points in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1754583321781,
            "Source": "stock"
        },
        {
            "Title": "AXISCADES Technologies Reports Q1 FY26 Results, Appoints New Executive Chairman",
            "Summary": "AXISCADES Technologies Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of ₹24,370.57 lakhs compared to ₹22,350.66 lakhs in the same quarter last year, and profit after tax of ₹2,086.00 lakhs versus ₹1,677.23 lakhs in the previous year quarter. On a standalone basis, total income was ₹10,896.59 lakhs with profit after tax of ₹655.83 lakhs. The Board approved the appointment of Dr. Sampath Ravinarayanan as Whole Time Director designated as Executive Chairman for a 5-year term, subject to shareholder approval. The company operates in two business segments: Technology Services and Solutions, and Defence. Other key decisions included appointing Protiviti India Member Private Limited as Internal Auditor for FY 2025-26 and M/s BMP & Co. LLP as Secretarial Auditor for five consecutive years from FY 2025-26 to FY 2029-30. The Board also gave in-principle approval for incorporating a subsidiary in UAE and reconstituted the Stakeholders Relationship Committee.",
            "Sentiment": "positive",
            "PublishDate": 1754579891467,
            "Source": "earnings"
        },
        {
            "Title": "AXISCADES Tech Wins ₹223.95 Crore Indian Army Contract for Tank Transporter Trailers",
            "Summary": "AXISCADES Tech has secured a ₹223.95 crore contract from the Indian Army to supply 212 next-generation 50-ton tank transporter trailers. The contract is part of the Atmanirbhar Bharat Initiative, India's self-reliance program.",
            "Sentiment": "positive",
            "PublishDate": 1754276185025,
            "Source": "order&deals"
        },
        {
            "Title": "AXISCADES Tech Secures Defense Electronics Contracts Worth ₹600 Crore",
            "Summary": "AXISCADES Tech has won defense electronics contracts valued at approximately ₹600 crore. The contracts cover key projects in airborne, naval, and radar systems.",
            "Sentiment": "positive",
            "PublishDate": 1753839701328,
            "Source": "order&deals"
        },
        {
            "Title": "AXISCADES Technologies Secures ₹600 Crore Defence Electronics Orders Across Multiple Programs",
            "Summary": "AXISCADES Technologies Limited has secured strategic defence electronics orders worth approximately ₹600 crore across airborne, naval, and radar programs from premier Defence laboratories in India. The orders will be executed over the next 3 to 5 years and include critical components for the VIRUPAKSHA AESA Radar Program for Su-30 MKI fighter aircraft upgrades, TR Modules for S-Band Surveillance Radars, Digital Beam Forming units for Long-range Battle Management Radar (LRBMR) with detection range exceeding 500 km, Homing Receiver for Electric Heavy Weight Torpedo systems, and production-scale delivery of sonar sub-systems for submarines. The company will develop and supply advanced sub-systems for sophisticated indigenous platforms being developed by Defence agencies including DRDOs and Defence PSUs. CTO C. Manikandan stated that these partnerships reflect the company's core strength in high-performance Radar, Sonar, and Signal Processing electronics, contributing to indigenous platforms that will define India's Defence preparedness.",
            "Sentiment": "positive",
            "PublishDate": 1753808651298,
            "Source": "stock"
        },
        {
            "Title": "Axiscades Technologies Forms Strategic Alliance with Aldoria",
            "Summary": "Axiscades Technologies has formed a strategic alliance with Aldoria to enhance India's space security capabilities. The partnership aims to contribute to the country's space sector development.",
            "Sentiment": "positive",
            "PublishDate": 1750335950000,
            "Source": "default"
        },
        {
            "Title": "Axiscades and MBDA Expand Strategic Partnership for Defense Manufacturing in India",
            "Summary": "Axiscades and MBDA have expanded their strategic partnership to boost 'Make in India' defense manufacturing. The companies aim to enhance their collaboration in the defense sector, focusing on manufacturing within India.",
            "Sentiment": "positive",
            "PublishDate": 1750288966000,
            "Source": "default"
        },
        {
            "Title": "AXISCADES Tech Partners with Indra for Defense Manufacturing in India",
            "Summary": "Indra has expressed interest in acquiring defense-related goods and services from AXISCADES Tech. These will be supplied through AXISCADES' design, development, production, and supply chain facility. The partnership aims to enhance the manufacturing of advanced systems in India.",
            "Sentiment": "positive",
            "PublishDate": 1750126102000,
            "Source": "default"
        },
        {
            "Title": "Axiscades Technologies Ltd: Signs MoU with European Defence Company for Make in India Initiative",
            "Summary": "Axiscades Technologies Ltd signed an MoU with Europe-based Indra for strategic alliance. Indra will acquire defence-related products and services from Axiscades. They plan to jointly develop products for Indian and global markets. The agreement includes manufacturing Indra's solutions like TACAN antennas and countermeasure systems in India.",
            "Sentiment": "positive",
            "PublishDate": 1750117637000,
            "Source": "corporate_action"
        },
        {
            "Title": "Axiscades Technologies: Ambitious Billion-Dollar Revenue Target by 2030",
            "Summary": "Axiscades Technologies aims for Rs 9,000-crore revenue by 2030, shifting to 80-20 product-to-service ratio. FY26 projections include 50% increase in adjusted Ebitda margin and top line growth to Rs 1,500 crore. The company plans significant infrastructure investments in Bangalore and Hyderabad for defence manufacturing and integration testing.",
            "Sentiment": "positive",
            "PublishDate": 1748755045000,
            "Source": "normal_news"
        },
        {
            "Title": "Axiscades Tech Reports Q4 Results and Approves Merger Plan",
            "Summary": "Axiscades Tech announced its Q4 consolidated net profit of 308 million rupees, compared to 67.1 million rupees year-over-year and 146 million rupees quarter-over-quarter. Q4 revenue was reported at 2.7 billion rupees, up from 2.56 billion rupees year-over-year. The company also approved a merger plan of Add Solution GmbH with Axiscades GmbH.",
            "Sentiment": "positive",
            "PublishDate": 1748304319000,
            "Source": "default"
        },
        {
            "Title": "AXISCADES Technologies Reports Q4 Results and Approves Merger Plan",
            "Summary": "AXISCADES Technologies has reported its Q4 financial results. The company's EBITDA increased to 355 million rupees from 325 million rupees year-over-year, with EBITDA margin improving to 13.23% from 12.71%. Consolidated net profit rose to 308 million rupees from 67.1 million rupees year-over-year and 146 million rupees quarter-over-quarter. Revenue for Q4 was 2.7 billion rupees, up from 2.56 billion rupees in the previous year. Additionally, the company has approved a merger plan of ADD Solution GmbH with AXISCADES GMB.",
            "Sentiment": "positive",
            "PublishDate": 1748267513000,
            "Source": "default"
        },
        {
            "Title": "AXISCADES Technologies Appoints New CEO for European Unit",
            "Summary": "AXISCADES Technologies has announced the appointment of Anurag Sharma as the CEO of ADD-SOLUTION, the company's European unit. This leadership change is expected to strengthen the company's presence and operations in the European market.",
            "Sentiment": "positive",
            "PublishDate": 1745470054000,
            "Source": "default"
        },
        {
            "Title": "AXISCADES Technologies: New Leadership Appointments to Drive Strategic Growth",
            "Summary": "AXISCADES Technologies Limited appoints KP Mohanakrishnan as Deputy CEO & President - Aerospace and D Murali Krishnan as Chief Operating Officer & President - ESAI. The company aims to transition from a service-based model to a technology-driven product company.",
            "Sentiment": "positive",
            "PublishDate": 1744359688000,
            "Source": "corporate_governance"
        },
        {
            "Title": "AXISCADES Technologies Limited: Subsidiary Launches Advanced Radar Module",
            "Summary": "Mistral Solutions, a subsidiary of AXISCADES Technologies Limited, has released the DCP1000 Module, a new radar data capture and playback solution for mmWave radar applications. The module uses Lattice Semiconductor's CertusPro-NX FPGA technology. AXISCADES Technologies Limited's stock rose 5% to ₹963.40 on the NSE.",
            "Sentiment": "positive",
            "PublishDate": 1742540283000,
            "Source": "normal_news"
        },
        {
            "Title": "AXISCADES Tech Subsidiary Unveils Advanced Radar Module",
            "Summary": "AXISCADES Technology's subsidiary, Mistral, has introduced the DCP1000 module, a new radar data capture and playback module for mmWave radar applications. The module is based on Lattice CertusPro-NX FPGA technology, positioning it as a cutting-edge solution in the field of radar technology.",
            "Sentiment": "positive",
            "PublishDate": 1742527036000,
            "Source": "corporate_action"
        },
        {
            "Title": "AXISCADES Subsidiary Mistral Forms Strategic Alliance with Altera for Aerospace & Defense Computing",
            "Summary": "AXISCADES has announced that its subsidiary, Mistral, has entered into a strategic alliance with Altera. This partnership aims to revolutionize high-performance computing in the aerospace and defense sectors. The collaboration is expected to leverage both companies' expertise to develop advanced computing solutions for these critical industries.",
            "Sentiment": "positive",
            "PublishDate": 1741242298000,
            "Source": "corporate_action"
        },
        {
            "Title": "AXISCADES and MBDA to Establish Test Bench Centre of Excellence in Bangalore",
            "Summary": "AXISCADES Technologies and MBDA have announced a strategic engagement to set up a Centre of Excellence for test benches in Bangalore. This collaboration aims to enhance technological capabilities and potentially boost the aerospace and defense sectors in India.",
            "Sentiment": "positive",
            "PublishDate": 1739154255000,
            "Source": "corporate_action"
        },
        {
            "Title": "AXISCADES Tech Reports Improved Q3 EBITDA and Margin",
            "Summary": "AXISCADES Tech has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 404 million rupees from 305.9 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 14.74% from 13.21% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738340193000,
            "Source": "earnings"
        },
        {
            "Title": "AXISCADES Technologies Reports Q3 Revenue Growth",
            "Summary": "AXISCADES Technologies has reported a revenue of 2.74 billion rupees for the third quarter, compared to 2.3 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738340155000,
            "Source": "earnings"
        }
    ]
}