{
    "Symbol": "AXISBANK",
    "ISIN": "INE238A01034",
    "News": [
        {
            "Title": "Axis Bank clarifies CreditAccess Grameen acquisition reports",
            "Summary": "Axis Bank issues regulatory clarification stating no material disclosure required regarding reported CreditAccess Grameen acquisition talks, emphasizing routine evaluation of strategic opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1770222633859,
            "Source": "co_actions_results"
        },
        {
            "Title": "Axis Bank Block Trade Worth Rs. 29.05 Crores on NSE",
            "Summary": "Axis Bank witnessed a significant block trade on NSE involving 211,761 shares valued at Rs. 29.05 crores, executed at Rs. 1372.00 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769755332172,
            "Source": "co_actions_results"
        },
        {
            "Title": "Axis Bank allots 91,454 shares under ESOP scheme",
            "Summary": "Axis Bank Limited has allotted 91,454 equity shares on January 28, 2026, pursuant to exercise of stock options under its ESOP/RSU scheme, increasing paid-up share capital to Rs. 6,210,918,354.",
            "Sentiment": "neutral",
            "PublishDate": 1769614630677,
            "Source": "co_actions_results"
        },
        {
            "Title": "Axis Bank Q3 FY26 Results: Net Profit Rises 3.0%",
            "Summary": "Axis Bank reports Q3 FY26 net profit of ₹6,489.57 crores, up 3.0% YoY. Total income grows 4.3% to ₹38,500.06 crores with EPS at ₹20.91.",
            "Sentiment": "positive",
            "PublishDate": 1769594743821,
            "Source": "co_actions_results"
        },
        {
            "Title": "Axis Bank Block Trade Worth Rs. 25.68 Crores on NSE",
            "Summary": "Axis Bank executed a significant block trade on NSE involving 189,781 shares valued at Rs. 25.68 crores at Rs. 1353.10 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769572146008,
            "Source": "co_actions_results"
        },
        {
            "Title": "Axis Bank Becomes Third-Largest Private Lender",
            "Summary": "Axis Bank shares surged 5% on Tuesday, overtaking Kotak Mahindra Bank in market capitalisation to become the third-largest private sector lender following strong quarterly earnings performance.",
            "Sentiment": "positive",
            "PublishDate": 1769516746602,
            "Source": "co_actions_results"
        },
        {
            "Title": "Axis Bank Re-appoints Subrat Mohanty as Executive Director",
            "Summary": "Axis Bank's board approves re-appointment of Subrat Mohanty as Whole-Time Director for three years from August 2026 to August 2029, subject to RBI and shareholder approval. Sudipto Nag appointed as new Chief Credit Officer.",
            "Sentiment": "positive",
            "PublishDate": 1769511143149,
            "Source": "stocks"
        },
        {
            "Title": "Axis Bank Forecasts Deposit-Credit Growth Alignment",
            "Summary": "Axis Bank predicts deposit growth will align with credit growth in the next 15 to 18 months, contingent on continued RBI liquidity support measures.",
            "Sentiment": "neutral",
            "PublishDate": 1769485140349,
            "Source": "stocks"
        },
        {
            "Title": "Axis Bank Sets Retail Book Target at 58-60%",
            "Summary": "Axis Bank aims to achieve 58% to 60% retail book balance and 23% to 25% wholesale composition, with retail growth expected to increase going forward.",
            "Sentiment": "positive",
            "PublishDate": 1769484187860,
            "Source": "stocks"
        },
        {
            "Title": "Axis Bank Q3: PAT may fall 8% YoY amid margin pressure",
            "Summary": "Axis Bank expected to report mixed Q3 performance with 4% YoY NII growth but 8% PAT decline. Loan growth recovering at 14% YoY while NIMs under pressure from portfolio mix changes.",
            "Sentiment": "neutral",
            "PublishDate": 1769320448928,
            "Source": "co_actions_results"
        },
        {
            "Title": "Axis Bank Halts Finance Unit Stake Sale Process",
            "Summary": "Axis Bank has temporarily suspended the sale process of its stake in Axis Finance, according to sources cited by Reuters, marking a pause in the bank's divestment plans.",
            "Sentiment": "neutral",
            "PublishDate": 1769179219998,
            "Source": "co_actions_results"
        },
        {
            "Title": "Axis Bank Allots 59,522 Shares Under ESOP Scheme",
            "Summary": "Axis Bank has allotted 59,522 equity shares worth ₹1.19 lakh under its ESOP/RSU scheme, increasing paid-up capital to ₹621.07 crores with total outstanding shares reaching 3.11 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1768915220335,
            "Source": "co_actions_results"
        },
        {
            "Title": "Axis Bank CEO flags deposit stress at Davos 2026",
            "Summary": "Axis Bank CEO Amitabh Chaudhry warns deposit mobilisation will remain challenging despite faster credit growth, calls for RBI liquidity support at World Economic Forum.",
            "Sentiment": "neutral",
            "PublishDate": 1768834087428,
            "Source": "stocks"
        },
        {
            "Title": "Axis Bank Appoints Two New Directors via Postal Ballot",
            "Summary": "Axis Bank shareholders approve appointment of Neeraj Gambhir as Executive Director and Malavika R. Harita as Independent Director through postal ballot with overwhelming majority support.",
            "Sentiment": "positive",
            "PublishDate": 1768830956415,
            "Source": "co_actions_results"
        },
        {
            "Title": "Axis Bank Sees ₹62.80 Cr NSE Block Trade",
            "Summary": "Axis Bank witnessed a significant block trade on NSE worth ₹62.80 crores involving approximately 481,818 shares at ₹1,303.40 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768811792938,
            "Source": "co_actions_results"
        },
        {
            "Title": "Axis Bank Q3FY26 Earnings Call Set for January 26",
            "Summary": "Axis Bank announces earnings call scheduled for January 26, 2026 at 6:20 PM IST to discuss Q3FY26 unaudited financial results with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1768562990357,
            "Source": "co_actions_results"
        },
        {
            "Title": "Axis Bank Allots 88,198 Shares Under ESOP Scheme",
            "Summary": "Axis Bank has allotted 88,198 equity shares on January 13, 2026, pursuant to exercise of stock options under its ESOP/RSU scheme, increasing paid-up share capital to ₹6,210.62 million.",
            "Sentiment": "neutral",
            "PublishDate": 1768307018080,
            "Source": "co_actions_results"
        },
        {
            "Title": "Axis Bank Q3 FY26 Results Schedule Announced",
            "Summary": "Axis Bank has declared its schedule for announcing third quarter financial year 2025-26 earnings as the quarterly results season begins for listed companies.",
            "Sentiment": "neutral",
            "PublishDate": 1767935225101,
            "Source": "co_actions_results"
        },
        {
            "Title": "Axis Bank Board Meet on Jan 26 for Q3FY26 Results",
            "Summary": "Axis Bank has scheduled its Board of Directors meeting for January 26, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed for designated persons from January 1-28, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767874135486,
            "Source": "co_actions_results"
        },
        {
            "Title": "Axis Bank Allots 1.39 Lakh Shares Under ESOP Scheme",
            "Summary": "Axis Bank has allotted 1,38,572 equity shares on January 6, 2026, pursuant to exercise of stock options under its ESOP/RSU scheme, increasing paid-up capital to ₹621.04 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1767698837019,
            "Source": "co_actions_results"
        },
        {
            "Title": "Axis Bank Q3 Updates: Deposits Surge 15% YoY to ₹12.6 Lakh Cr",
            "Summary": "Axis Bank reports strong Q3 provisional figures with deposits growing 15.00% YoY to ₹12.60 lakh crore and gross advances up 14.10% YoY to ₹11.70 lakh crore, demonstrating robust growth momentum.",
            "Sentiment": "positive",
            "PublishDate": 1767621791260,
            "Source": "co_actions_results"
        },
        {
            "Title": "Axis Bank Updates Global Medium Term Notes Programme",
            "Summary": "Axis Bank has updated its Global Medium Term Notes Programme with a new Offering Circular dated December 26, 2025, listed on India INX, NSE IX, and SGX exchanges for potential debt instrument issuances.",
            "Sentiment": "neutral",
            "PublishDate": 1766754862974,
            "Source": "co_actions_results"
        },
        {
            "Title": "Axis Bank Allots 5.02 Lakh Shares Under ESOP Scheme",
            "Summary": "Axis Bank allotted 5,02,455 equity shares on December 23, 2025, under its ESOP/RSU scheme, increasing paid-up share capital from ₹620.90 crores to ₹621.00 crores following employee stock option exercises.",
            "Sentiment": "neutral",
            "PublishDate": 1766496788185,
            "Source": "co_actions_results"
        },
        {
            "Title": "Axis Bank Allots 2.46 Lakh Shares Under ESOP Scheme",
            "Summary": "Axis Bank allotted 2,45,902 equity shares on December 16, 2025, under its ESOP/RSU scheme, increasing paid-up share capital to ₹620.90 crores with total equity shares reaching 31.04 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1765896854568,
            "Source": "co_actions_results"
        },
        {
            "Title": "Axis Bank Sees ₹76.02 Cr NSE Block Trade at ₹1,222.50",
            "Summary": "Axis Bank witnessed a significant block trade on NSE worth ₹76.02 crores involving approximately 621,871 shares executed at ₹1,222.50 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1765877224017,
            "Source": "co_actions_results"
        },
        {
            "Title": "Axis Bank Earns ₹3,174 Cr Insurance Commissions",
            "Summary": "Axis Bank reported insurance commission income of ₹3,174 crores in FY25, representing 9% of the bank's profit before tax, highlighting diversified revenue streams beyond traditional banking.",
            "Sentiment": "positive",
            "PublishDate": 1765864761395,
            "Source": "co_actions_results"
        },
        {
            "Title": "Axis Bank Sees ₹63.30 Cr NSE Block Trade",
            "Summary": "Axis Bank witnessed a significant block trade on NSE worth ₹63.30 crores involving approximately 501,833 shares at ₹1,261.30 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1765857254167,
            "Source": "co_actions_results"
        },
        {
            "Title": "Citi Maintains Neutral Rating on Axis Bank at ₹1,285",
            "Summary": "Citi Research maintains its Neutral rating on Axis Bank with a target price of ₹1,285, reflecting a measured outlook on the private sector lender's prospects.",
            "Sentiment": "neutral",
            "PublishDate": 1765856666504,
            "Source": "stocks"
        },
        {
            "Title": "Axis Bank Allots 2.11 Lakh Equity Shares Under ESOP Scheme",
            "Summary": "Axis Bank allotted 2,11,428 equity shares of Rs. 2 each following exercise of stock options under its ESOP/RSU scheme. The bank's paid-up share capital increased from Rs. 6,208,062,368 to Rs. 6,208,485,224, with total equity shares rising to 3,104,242,612.",
            "Sentiment": "neutral",
            "PublishDate": 1765293970837,
            "Source": "corporate_action"
        },
        {
            "Title": "Axis Bank Allots 1.89 Lakh Equity Shares Under ESOP Scheme",
            "Summary": "Axis Bank allotted 1,89,534 equity shares of Rs. 2 each following the exercise of stock options under its ESOP/RSU scheme. The bank's paid-up share capital increased from Rs. 620.77 crore to Rs. 620.81 crore, with total equity shares rising to 31.04 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1764680139547,
            "Source": "corporate_action"
        },
        {
            "Title": "Axis Bank Shares Worth Rs. 138.54 Crores Traded in NSE Block Deal",
            "Summary": "Axis Bank witnessed a block trade on NSE involving 1,095,166 shares at Rs. 1,265 per share, totaling Rs. 138.54 crores. The large-volume transaction indicates significant institutional or bulk investor activity in the private sector bank's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1764662330946,
            "Source": "order&deals"
        },
        {
            "Title": "Axis Bank Shares Worth Rs. 16.68 Crores Traded in NSE Block Deal",
            "Summary": "Axis Bank executed a block trade on NSE involving 129,981 shares at Rs. 1,283.60 per share, totaling Rs. 16.68 crores. The transaction represents a significant institutional trade in the private sector bank's shares at the specified price level.",
            "Sentiment": "neutral",
            "PublishDate": 1764565994202,
            "Source": "order&deals"
        },
        {
            "Title": "Axis Bank Reports Strong Double-Digit Growth in October Card Spending",
            "Summary": "Axis Bank experienced solid demand and strong double-digit growth in key categories for card spending during October. The growth indicates robust consumer activity in important spending segments for the bank's credit card business.",
            "Sentiment": "positive",
            "PublishDate": 1764219688862,
            "Source": "stock"
        },
        {
            "Title": "Axis Bank Announces Senior Management Changes with New Chief Risk Officer Appointment",
            "Summary": "Axis Bank has appointed Anand Viswanathan as Chief Risk Officer effective January 1, 2026, while Amit Talgeri will depart after completing his term. The leadership transition affects the bank's senior management structure and risk oversight functions.",
            "Sentiment": "neutral",
            "PublishDate": 1764161956911,
            "Source": "corporate_governance"
        },
        {
            "Title": "Axis Bank Raises Rs. 5,000 Crore Through 10-Year Non-Convertible Debentures at 7.27% Coupon",
            "Summary": "Axis Bank allotted 5,00,000 non-convertible debentures worth Rs. 5,000 crore with a 7.27% annual coupon rate and 10-year maturity through private placement. The debentures received AAA ratings from CRISIL, ICRA, and India Ratings, and will be listed on BSE and NSE with redemption scheduled for November 26, 2035.",
            "Sentiment": "positive",
            "PublishDate": 1764144785862,
            "Source": "corporate_action"
        },
        {
            "Title": "Axis Bank Allots 1.61 Lakh Equity Shares Under Employee Stock Option Plan",
            "Summary": "Axis Bank allotted 1,61,807 equity shares of Rs. 2 each following the exercise of stock options under its ESOP/RSU scheme. The bank's paid-up share capital increased from Rs. 6,207,359,686 to Rs. 6,207,683,300, with total equity shares rising to 3,103,841,650.",
            "Sentiment": "neutral",
            "PublishDate": 1764080414486,
            "Source": "corporate_action"
        },
        {
            "Title": "Axis Bank Plans ₹5,000 Crore Fundraise Through Long-Term Debentures",
            "Summary": "Axis Bank announced plans to raise ₹5,000 crore through long-term debenture issuance, structured with a base size of ₹2,000 crore and a green shoe option of ₹3,000 crore. The debt fundraising initiative will provide the bank with additional capital resources for its operations and growth requirements.",
            "Sentiment": "positive",
            "PublishDate": 1763718677917,
            "Source": "corporate_action"
        },
        {
            "Title": "Axis Bank Shares Worth Rs. 167.75 Crores Traded in NSE Block Deal",
            "Summary": "Axis Bank witnessed a block trade on NSE involving 1,308,891 shares valued at Rs. 167.75 crores at a price of Rs. 1281.60 per share. The large block transaction indicates significant institutional activity in the bank's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1763713776682,
            "Source": "order&deals"
        },
        {
            "Title": "Axis Bank Discontinues Payment Services for Digital Gold Products",
            "Summary": "Axis Bank has stopped offering payment services for digital gold products on its platform. This decision affects customers who were using the bank's platform to purchase digital gold investments.",
            "Sentiment": "neutral",
            "PublishDate": 1763695925926,
            "Source": "stock"
        },
        {
            "Title": "Axis Bank Allots 1.64 Lakh Equity Shares Under ESOP Scheme",
            "Summary": "Axis Bank allotted 1,64,286 equity shares of Rs. 2 each following the exercise of stock options under its ESOP and RSU scheme. The bank's paid-up share capital increased from Rs. 6,207,031,114 to Rs. 6,207,359,686, with total equity shares rising to 3,103,679,843.",
            "Sentiment": "neutral",
            "PublishDate": 1763478177791,
            "Source": "corporate_action"
        },
        {
            "Title": "Axis Bank Shares Worth Rs. 106.28 Crores Traded in NSE Block Deal",
            "Summary": "Axis Bank witnessed a block trade on NSE involving 845,222 shares valued at Rs. 106.28 crores at a price of Rs. 1257.40 per share. The transaction represents a significant institutional trading activity for the private sector bank.",
            "Sentiment": "neutral",
            "PublishDate": 1763440588678,
            "Source": "order&deals"
        },
        {
            "Title": "Axis Bank Allots 1.67 Lakh Equity Shares Under ESOP Scheme",
            "Summary": "Axis Bank allotted 1,67,367 equity shares of Rs. 2 each on November 11, 2025, following the exercise of stock options under its ESOP/RSU Scheme. The allotment increased the bank's paid-up share capital from Rs. 6,206,696,380 to Rs. 6,207,031,114, with the total number of equity shares rising from 3,103,348,190 to 3,103,515,557 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1762914422908,
            "Source": "corporate_action"
        },
        {
            "Title": "Axis Bank Allots 1.53 Lakh Equity Shares Under ESOP/RSU Scheme",
            "Summary": "Axis Bank allotted 1,53,657 equity shares of Rs. 2 each on November 4, 2025, following the exercise of stock options under its ESOP/RSU scheme. The allotment increased the bank's paid-up share capital from Rs. 6,206,389,066 to Rs. 6,206,696,380, with the total number of equity shares rising from 3,103,194,533 to 3,103,348,190 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1762275192973,
            "Source": "corporate_action"
        },
        {
            "Title": "Axis Bank Shares Worth Rs. 121.45 Crores Traded in NSE Block Deal",
            "Summary": "Axis Bank executed a block trade on the National Stock Exchange involving approximately 979,254 shares at a price of Rs. 1240.20 per share. The total transaction value amounted to Rs. 121.45 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1761713554727,
            "Source": "order&deals"
        },
        {
            "Title": "Axis Bank Puts ₹511-Crore Lavasa Corp Debt on Sale",
            "Summary": "Axis Bank has put Lavasa Corp's debt worth ₹511 crore up for sale.",
            "Sentiment": "neutral",
            "PublishDate": 1761611838364,
            "Source": "stock"
        },
        {
            "Title": "RBI Approves Neeraj Gambhir as Executive Director of Axis Bank for Three-Year Term",
            "Summary": "The Reserve Bank of India has approved the appointment of Neeraj Gambhir as Executive Director of Axis Bank Limited for a three-year term, effective October 20, 2025. Axis Bank's Board of Directors had previously approved Gambhir's appointment as a Whole-time Director with the designation of Executive Director, with the appointment contingent on RBI approval. Gambhir holds DIN number 00257375.",
            "Sentiment": "positive",
            "PublishDate": 1760968557495,
            "Source": "corporate_governance"
        },
        {
            "Title": "Axis Bank Projects 300 Basis Points Growth Lead Over Industry, Maintains NIM Guidance at 3.8%",
            "Summary": "Axis Bank expects its advances to grow 300 basis points ahead of the industry over the next 3-5 years. The bank stated it does not require equity capital for expansion or security purposes. Axis Bank anticipates margins will hit their lowest point in Q3 FY26, assuming no further rate cuts occur. The bank maintains its net interest margin guidance of 3.8%.",
            "Sentiment": "positive",
            "PublishDate": 1760585713281,
            "Source": "stock"
        },
        {
            "Title": "Axis Bank Reports 26% Decline in Q2 Net Profit Despite Revenue Growth",
            "Summary": "Axis Bank reported a net profit of 50.9 billion rupees for Q2, down from 69.18 billion rupees year-over-year, falling short of the estimated 56.92 billion rupees. Revenue increased to 309.7 billion rupees from 304.2 billion rupees compared to the same period last year. The bank's asset quality showed improvement with Gross NPA declining to 1.46% from 1.57% quarter-over-quarter, while Net NPA decreased slightly to 0.44% from 0.45% in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1760573283657,
            "Source": "earnings"
        },
        {
            "Title": "Axis Bank Targets Double-Digit Growth Through Digital Innovation and Payment Services",
            "Summary": "Axis Bank has set a goal to achieve steady double-digit growth in both deposits and loans. The bank plans to leverage digital innovation and payment services as key drivers to boost revenue and improve return on equity.",
            "Sentiment": "positive",
            "PublishDate": 1760547134832,
            "Source": "stock"
        },
        {
            "Title": "Axis Bank Reports Strong Quarter Performance; Subsidiary May Face Upper Layer NBFC Classification",
            "Summary": "Axis Bank reported strong momentum in advances and deposits for the September quarter. The bank's subsidiary Axis Finance could be classified as an Upper Layer NBFC under RBI's regulatory framework when it crosses certain thresholds, though no specific timeline was provided. Net Interest Income rose 1% quarter-on-quarter and 2% year-on-year, with Net Interest Margin at 3.73%. Overall advances grew 12% year-on-year and 5% quarter-on-quarter, with retail loans up 6% and corporate loans rising 20% year-on-year. The bank made a one-time standard asset provision of ₹1,231 crore following RBI's annual inspection related to two discontinued crop loan products. Net slippages decreased to ₹280 crore from ₹1,861 crore in the previous quarter. Management emphasized focus on deposit growth, credit growth, asset quality, and cost efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1760546370249,
            "Source": "earnings"
        }
    ]
}