{
    "Symbol": "AXITA",
    "ISIN": "INE02EZ01022",
    "News": [
        {
            "Title": "Axita Cotton Shareholders Approve Bonus Share Issue",
            "Summary": "Axita Cotton Limited shareholders approved 1:10 bonus share issuance through postal ballot with 99.98% votes in favour. The resolution received overwhelming support from 365 members.",
            "Sentiment": "positive",
            "PublishDate": 1770467746701,
            "Source": "co_actions_results"
        },
        {
            "Title": "Axita Cotton Announces 1:10 Bonus Issue for Feb 2026",
            "Summary": "Axita Cotton Limited sets February 13, 2026 as record date for 1:10 bonus issue. Shareholders will receive 1 bonus share for every 10 existing shares held, utilizing ₹3.47 crore from free reserves.",
            "Sentiment": "positive",
            "PublishDate": 1768110830770,
            "Source": "co_actions_results"
        },
        {
            "Title": "Axita Cotton Initiates E-Voting for 1:10 Bonus Issue",
            "Summary": "Axita Cotton Limited commences postal ballot e-voting from January 8, 2026 for shareholder approval of 1:10 bonus share issuance with February 13 record date.",
            "Sentiment": "positive",
            "PublishDate": 1767614931834,
            "Source": "co_actions_results"
        },
        {
            "Title": "Axita Cotton Limited Reports Quarterly Financial Results for September 2025",
            "Summary": "Axita Cotton Limited submitted its unaudited standalone financial results for the quarter and half year ended September 30, 2025, showing total income of Rs. 24.86 lakhs for the quarter. The company also completed disinvestment from its subsidiary KPR Sports and Media Private Limited on June 27, 2025, which ceased to be a subsidiary from that date.",
            "Sentiment": "neutral",
            "PublishDate": 1763141313932,
            "Source": "earnings"
        },
        {
            "Title": "Axita Cotton Reports Quarterly Results and Statutory Auditor Resignation",
            "Summary": "Axita Cotton Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of Rs. 15,669.73 lakhs and net profit after tax of Rs. 132.92 lakhs, compared to a loss of Rs. 185.03 lakhs in the previous quarter. On a standalone basis, the company achieved net profit of Rs. 161.18 lakhs versus a loss of Rs. 185.70 lakhs in the prior quarter. Basic earnings per share stood at Rs. 0.04 for consolidated results and Rs. 0.05 for standalone results. The Board also accepted the resignation of statutory auditors M/s Mistry & Shah LLP, effective August 11, 2025. The auditors cited internal strategic realignment and a decision to restrict assurance services as reasons for resignation, stating it was not related to any company-specific issues. Additionally, the company completed the disinvestment of 55% equity in subsidiary KPR Sports and Media Services Private Limited on June 27, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754920712570,
            "Source": "earnings"
        },
        {
            "Title": "Axita Cotton Limited Gets Exchange Approval for Promoter Reclassification to Public Category",
            "Summary": "Axita Cotton Limited received approval from BSE and NSE on July 24, 2025, for reclassification of seven shareholders from Promoter/Promoter Group category to Public category. The reclassified shareholders include Krunalbhai Girishkumar Patel (holding 5,333 shares representing 0.0015% of total equity), Dineshkumar Sitarambhai Patel, Rekhaben Dineshkumar Patel, Hit Dineshkumar Patel, Nathalal B Patel, Patel Champaben, and Kanaiyalal N Patel (all holding zero shares). The company had initially applied for this reclassification on November 30, 2024. Post-reclassification, the promoter holding decreased from 41.93% to 41.92%, while public holding increased from 58.07% to 58.08%. The approval was granted under Regulation 31A of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015.",
            "Sentiment": "neutral",
            "PublishDate": 1753364357951,
            "Source": "corporate_action"
        },
        {
            "Title": "Axita Cotton Reports Q4 Financial Results",
            "Summary": "Axita Cotton has reported its Q4 financial results. The company experienced an EBITDA loss of 26 million rupees, compared to a gain of 72.3 million rupees in the same quarter last year. The net loss for Q4 was 19 million rupees, compared to 49.5 million rupees year-over-year, and 12 million rupees quarter-over-quarter. Q4 revenue was 1.4 billion rupees, down from 2.21 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1748265498000,
            "Source": "result"
        },
        {
            "Title": "Axita Cotton Reports Significant Drop in Q2 EBITDA",
            "Summary": "Axita Cotton's Q2 EBITDA has decreased from 65 million rupees to 10 million rupees year-over-year. The company's EBITDA margin has also declined from 1.68% to 0.80% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731599218000,
            "Source": "result"
        },
        {
            "Title": "AXITA COTTON Reports Significant Decline in Q2 Profits",
            "Summary": "AXITA COTTON has reported a substantial decrease in its Q2 net profit, which fell to 6.3 million rupees from 65 million rupees year-over-year. This also represents a decline from 35 million rupees in the previous quarter. The company's Q2 revenue also dropped significantly to 1.3 billion rupees from 3.89 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731599165000,
            "Source": "result"
        }
    ]
}