{
    "Symbol": "AYMSYNTEX",
    "ISIN": "INE193B01039",
    "News": [
        {
            "Title": "AYM Syntex Board Meet Set for Feb 13 to Review Q3 Results",
            "Summary": "AYM Syntex Limited has scheduled a board meeting on February 13, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770299356603,
            "Source": "co_actions_results"
        },
        {
            "Title": "AYM Syntex Appoints Vineet Adlakha as President",
            "Summary": "AYM Syntex Limited announces the appointment of Mr. Vineet Adlakha as President & Unit Head (Palghar) effective January 5, 2026. Adlakha brings over 30 years of textile industry experience.",
            "Sentiment": "positive",
            "PublishDate": 1767622943794,
            "Source": "stocks"
        },
        {
            "Title": "AYM Syntex Appoints Kulbhushan Agrawal as President-Marketing (Palghar)",
            "Summary": "AYM Syntex Limited appointed Mr. Kulbhushan Agrawal as President-Marketing (Palghar), a senior management position, effective December 1, 2025. Agrawal brings over 24 years of international experience in sales and supply chain management, having worked with leading organizations including Welspun Group, Meril Life Sciences, and Aditya Birla Group.",
            "Sentiment": "positive",
            "PublishDate": 1764597101299,
            "Source": "corporate_governance"
        },
        {
            "Title": "AYM Syntex Reports No Deviation in Rs 141.76 Crore Preferential Issue Fund Utilization",
            "Summary": "AYM Syntex Limited submitted its monitoring agency report for the quarter ended September 30, 2025, regarding its preferential issue of Rs 141.76 crore. Care Ratings Limited, serving as the monitoring agency, reported no deviation from the stated objectives of the fund utilization. The company incurred capital expenditure of Rs 21.05 crore during the quarter. The preferential issue proceeds are parked in cash credit accounts, with Rs 4.43 crore remaining unutilized. The funds were allocated for repayment of debt (Rs 24 crore), reduction in working capital borrowings (Rs 25 crore), and capital expenditure (Rs 59 crore). The company has planned capacity expansion for its IDY and BCF capacity at a total cost of Rs 100 crore, expected to be completed in 1-1.5 years.",
            "Sentiment": "neutral",
            "PublishDate": 1762783571725,
            "Source": "corporate_action"
        },
        {
            "Title": "AYM Syntex Reports No Deviation in Preferential Issue Fund Utilization for September Quarter",
            "Summary": "AYM Syntex Limited submitted its statement of deviation or variation for funds raised through preferential issue of equity shares for the quarter ended September 30, 2025. The company reported no deviation in fund utilization, with 24.00 crores allocated and utilized for repayment of debt and working capital borrowings as originally planned. The statement was reviewed by the Audit Committee at its meeting held on November 8, 2025, and filed with BSE and NSE as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1762605349058,
            "Source": "corporate_action"
        },
        {
            "Title": "AYM Syntex Reports Loss in Latest Quarterly Results",
            "Summary": "AYM Syntex Limited announced its quarterly results for the period ended September 30, 2025. The company reported a loss before tax of Rs 611 lakhs for the half-year period, compared to a profit of Rs 959 lakhs in the previous corresponding period. Revenue from operations stood at Rs 14,830 lakhs for the half-year. The company's total assets were Rs 1,07,729 lakhs as of September 30, 2025, compared to Rs 1,03,083 lakhs as of March 31, 2025. During the period, the company allotted equity shares under employee stock option schemes and utilized proceeds from earlier equity issuances for debt repayment and capital expenditure. The Board also approved a merger scheme with Mandawewala Enterprises Limited, which has received no adverse observations from stock exchanges.",
            "Sentiment": "negative",
            "PublishDate": 1762601225129,
            "Source": "earnings"
        },
        {
            "Title": "AYM Syntex Updates Merger Scheme Following Registered Office Address Changes",
            "Summary": "AYM Syntex Limited has updated its Scheme of Amalgamation with Mandawewala Enterprises Limited after completing the registered office relocation process for both companies. The Merger Committee and Board of Directors approved consequential amendments to reflect new registered office addresses and Corporate Identification Numbers. Both companies now have their registered addresses at Trade World, Kamala Mills Compound, Lower Parel, Mumbai. Mandawewala Enterprises holds approximately 62.80% stake in AYM Syntex as of December 31, 2024, with 3,67,34,927 equity shares. AYM Syntex is a specialty synthetic yarns manufacturer listed on BSE and NSE. The updated scheme will be available on the company's website, with all other contents remaining unchanged except for the specified modifications.",
            "Sentiment": "neutral",
            "PublishDate": 1760695019392,
            "Source": "corporate_action"
        },
        {
            "Title": "AYM Syntex Establishes US Subsidiary to Expand Textile Trading Operations",
            "Summary": "AYM Syntex has incorporated a wholly owned subsidiary called Innovative Yarns LLC in Delaware, USA. The subsidiary will focus on expanding the trading of yarns, fibres and textile products. AYM Syntex will hold 100% stake in the new entity.",
            "Sentiment": "positive",
            "PublishDate": 1757515139283,
            "Source": "stock"
        },
        {
            "Title": "AYM Syntex Appoints James Robert McCallum as Independent Director for Five-Year Term",
            "Summary": "AYM Syntex Limited appointed Mr. James Robert McCallum as an Additional Director in the capacity of Non-Executive and Independent Director for a five-year term from July 26, 2025 to July 25, 2030. The appointment was approved by the Board of Directors based on the recommendation of the Nomination and Remuneration Committee and is subject to shareholder approval at the upcoming Annual General Meeting. McCallum is a graduate of Leeds Metropolitan University with a BA (Hons.) in Business and has over four decades of experience in the textile and flooring industry. He has held senior leadership roles including Director of Operations European Denim division at Burlington Industries, President of Lees Carpets, President of The Mohawk Group, and President of Milliken Floor Covering. He also served for 23 years on the management committee and board of the Carpet and Rug Institute as Vice Chairman and Chairman. McCallum is not related to any other Director of the Company and is not debarred from holding the office of director by any regulatory authority.",
            "Sentiment": "positive",
            "PublishDate": 1753528836072,
            "Source": "corporate_governance"
        },
        {
            "Title": "AYM Syntex Reports Quarterly Results and Appoints Independent Director",
            "Summary": "AYM Syntex Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of ₹32,648 lakhs compared to ₹36,062 lakhs in the previous quarter and ₹34,719 lakhs in the same quarter last year. The company posted a net loss of ₹355 lakhs for the quarter, compared to a profit of ₹203 lakhs in the previous quarter and ₹227 lakhs in the corresponding quarter of the previous year. Earnings per share stood at -₹0.61 for the quarter. Additionally, the board appointed Mr. James Robert McCallum as an Additional Director in the capacity of Non-Executive and Independent Director for a five-year term from July 26, 2025 to July 25, 2030, subject to shareholder approval. McCallum is a graduate of Leeds Metropolitan University with over four decades of experience in the textile and flooring industry, having held senior positions at Burlington Industries, Interface Inc., and Milliken.",
            "Sentiment": "negative",
            "PublishDate": 1753526084811,
            "Source": "earnings"
        },
        {
            "Title": "AYM Sintex Reports Decline in Q4 EBITDA and Margin",
            "Summary": "AYM Sintex has reported a significant decrease in its Q4 EBITDA, which fell to 109 million rupees from 255 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 3.01% from 6.81% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1746876362000,
            "Source": "result"
        },
        {
            "Title": "AYM Sintex Reports Q4 FY2023 Financial Results",
            "Summary": "AYM Sintex has reported its Q4 financial results. The company's net profit decreased to 20 million rupees, down from 194 million rupees year-over-year and 34 million rupees quarter-over-quarter. Revenue for Q4 was 3.6 billion rupees, slightly lower than the 3.7 billion rupees reported in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1746876200000,
            "Source": "result"
        },
        {
            "Title": "AYM Syntex Reports Q3 EBITDA Growth",
            "Summary": "AYM Syntex has reported its Q3 financial results. The company's EBITDA increased to 289 million rupees, up from 254 million rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 7.66% from 7.68% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738852410000,
            "Source": "earnings"
        },
        {
            "Title": "AYM Syntex Reports Profit in Q3 FY2024, Revenue Increases",
            "Summary": "AYM Syntex has reported a consolidated net profit of 34 million rupees in the third quarter, compared to a loss of 9 million rupees in the same period last year. The company's revenue for Q3 increased to 3.78 billion rupees from 3.32 billion rupees year-over-year, showing a significant improvement in financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1738852404000,
            "Source": "earnings"
        },
        {
            "Title": "Mukul Mahavir Agrawal Acquires 3.93% Stake in AYM Syntex",
            "Summary": "Investor Mukul Mahavir Agrawal has emerged as a significant shareholder in AYM Syntex, holding a 3.93% stake in the company during the third quarter. This development indicates a notable investment in the company by a prominent individual investor.",
            "Sentiment": "neutral",
            "PublishDate": 1737101813000,
            "Source": "corporate_governance"
        },
        {
            "Title": "AYM Syntex Reports Improved Q2 Financial Performance",
            "Summary": "AYM Syntex has announced its Q2 financial results, showing significant improvement in both EBITDA and EBITDA margin compared to the same period last year. The company's EBITDA increased from 213 million rupees to 331 million rupees year-over-year. Additionally, the EBITDA margin improved from 6.39% to 8.19% in the same period.",
            "Sentiment": "positive",
            "PublishDate": 1730196122000,
            "Source": "result"
        },
        {
            "Title": "AYM Syntex Reports Profit in Q2 FY2024",
            "Summary": "AYM Syntex has reported a net profit of 39 million rupees in the second quarter, compared to a loss of 49 million rupees in the same period last year. The company's revenue increased to 4 billion rupees from 3 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730196049000,
            "Source": "result"
        }
    ]
}