{
    "Symbol": "AZAD",
    "ISIN": "INE02IJ01035",
    "News": [
        {
            "Title": "Azad Engineering Q3FY26 Earnings Call on Feb 14",
            "Summary": "Azad Engineering Limited announces earnings conference call scheduled for February 14, 2026 at 11:00 AM IST to discuss Q3FY26 unaudited financial results with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1770790505293,
            "Source": "co_actions_results"
        },
        {
            "Title": "Azad Engineering Auditor Firm Converts to LLP",
            "Summary": "Azad Engineering's statutory auditor M S K A & Associates has converted from partnership to Limited Liability Partnership effective January 13, 2026, with no change in audit engagement.",
            "Sentiment": "neutral",
            "PublishDate": 1769090133238,
            "Source": "stocks"
        },
        {
            "Title": "Azad Engineering Appoints New Company Secretary and Compliance Officer",
            "Summary": "Azad Engineering Limited appointed Mr. Praneeth Abhishek Gunda as Company Secretary and Key Managerial Personnel effective November 29, 2025, following board approval based on the Nomination and Remuneration Committee's recommendation. The appointment fills a key compliance role, with Gunda bringing over 13 years of corporate secretarial and legal experience from previous positions at Cohance Lifesciences Limited, KSK Energy Ventures Limited, and MedRC Edutech Limited.",
            "Sentiment": "positive",
            "PublishDate": 1764404939620,
            "Source": "corporate_governance"
        },
        {
            "Title": "Azad Engineering's Company Secretary Ful Kumar Gautam Resigns Due to Personal Reasons",
            "Summary": "Ful Kumar Gautam has resigned from his position as Company Secretary and Compliance Officer at Azad Engineering Limited with immediate effect due to personal reasons, as communicated via email on November 28, 2025. The resignation affects a key managerial personnel position at the company, with Azad Engineering informing stock exchanges BSE and NSE as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1764336180231,
            "Source": "corporate_governance"
        },
        {
            "Title": "Azad Engineering Signs Partnership Agreement with Pratt And Whitney Canada",
            "Summary": "Azad Engineering has entered into an agreement with Pratt And Whitney Canada to enhance its aerospace manufacturing capabilities. The partnership is expected to strengthen the company's position in the aerospace sector through improved manufacturing processes.",
            "Sentiment": "positive",
            "PublishDate": 1763507206488,
            "Source": "order&deals"
        },
        {
            "Title": "Azad Engineering Reports Record Q2 FY26 Performance with 28% Revenue Growth",
            "Summary": "Azad Engineering Limited delivered its best quarterly and half-yearly performance with Q2 FY26 revenues reaching INR 143 crores, up 28.1% year-on-year. EBITDA margins improved to 36% from 35.7% in Q2 FY25, while PAT margin increased to 23.1% from 18.9%. Half-yearly revenue stood at INR 277 crores compared to INR 210 crores in H1 FY25. The company inaugurated a new lean manufacturing facility for Siemens at its Hyderabad plant for highly engineered rotating and stationary airfoils. Mitsubishi awarded Phase 2 contract, bringing combined contract value to INR 1,387 crores over 5 years. The company signed its first MOU with Safran Aircraft Engines for critical rotating engine components for strategic defence platforms. Energy and Oil & Gas segment contributed 81% of revenues at INR 117 crores, while Aerospace and Defence segment grew 34% year-on-year contributing 16.9% of revenues. The company maintains revenue growth guidance of 25-30% for the year.",
            "Sentiment": "positive",
            "PublishDate": 1762585223296,
            "Source": "earnings"
        },
        {
            "Title": "Azad Engineering Reports 60% Jump in Q2 Net Profit to ₹33 Crore",
            "Summary": "Azad Engineering reported a 60% year-on-year increase in net profit to ₹33 crore for Q2FY26, compared to ₹20.5 crore in the previous year. Revenue grew 30.6% to ₹145.6 crore from ₹111.5 crore, while EBITDA increased 32.1% to ₹53.2 crore with margins at 36.5%. The Energy & Oil & Gas segment contributed ₹226.1 crore in H1FY26, accounting for 35.7% of total revenue, while Aerospace & Defence recorded ₹47.1 crore, representing 30.3% of revenue. Exports formed 34% of the revenue mix at ₹260.4 crore in H1FY26. The company's orderbook strengthened with the Phase 2 Mitsubishi contract valued at ₹13,870 million. Management expects 25% to 30% topline growth for the year. Shares closed at ₹1,695.95, down 0.16% on BSE.",
            "Sentiment": "positive",
            "PublishDate": 1761996935208,
            "Source": "earnings"
        },
        {
            "Title": "Azad Engineering Reports Strong Q2 Performance with Revenue Growth to ₹1.4 Billion",
            "Summary": "Azad Engineering reported Q2 revenue of ₹1.4 billion compared to ₹1.1 billion in the same quarter last year. The company's EBITDA increased to ₹514 million from ₹398 million year-over-year. EBITDA margin improved to 36.02% versus 35.73% in the corresponding period last year.",
            "Sentiment": "positive",
            "PublishDate": 1761985215669,
            "Source": "earnings"
        },
        {
            "Title": "Azad Engineering Secures $73.47 Million Long-Term Contract with Mitsubishi Heavy Industries",
            "Summary": "Azad Engineering has signed a long-term contract worth $73.47 million (approximately 651 crores INR) with Mitsubishi Heavy Industries. The agreement represents a significant business development for the engineering company.",
            "Sentiment": "positive",
            "PublishDate": 1759104674993,
            "Source": "order&deals"
        },
        {
            "Title": "AZAD Engineering Signs $73.47 Million Contract with Mitsubishi Heavy Industries",
            "Summary": "AZAD Engineering Limited signed a Long Term Contract & Price Agreement with Mitsubishi Heavy Industries Limited, Japan, valued at USD 73.47 million (INR 651 crores) for supplying highly engineered rotating and stationary airfoils for advanced gas and thermal power turbine engines. This Phase 2 contract is incremental to a previous contract signed on November 3, 2024, bringing the combined contract value to USD 156.36 million (INR 1,387 crores). The international contract will be executed over 5 years to meet global demand in the power generation industry. The parties have no shareholding relationship and the contract does not fall within related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1758889380529,
            "Source": "order&deals"
        },
        {
            "Title": "Azad Engineering Opens New Manufacturing Facility in Hyderabad for Siemens Energy Components",
            "Summary": "Azad Engineering has opened a new lean manufacturing facility in Tunikibollaram, Hyderabad. The facility is designed to meet Siemens Energy's global engine component requirements.",
            "Sentiment": "positive",
            "PublishDate": 1758184219036,
            "Source": "stock"
        },
        {
            "Title": "Azad Engineering Reports 36.7% Revenue Growth in Q1, Guides for 25-30% FY26 Growth",
            "Summary": "Azad Engineering delivered standalone revenues of INR 135 crores in Q1, up 36.7% year-over-year and 80% quarter-over-quarter. EBITDA margin improved to 36.1% from 33.6% in the previous year, while PAT margin rose to 22.3% from 17.4%. The company maintains a strong order book of over INR 6,000 crores across energy (INR 3,400 crores), aerospace & defense (INR 1,700 crores), and oil & gas (INR 850 crores) segments. Management has guided for 25-30% revenue growth in FY26 with EBITDA margins expected to remain in the 33-35% range. The company inaugurated two dedicated lean factories and plans to establish 8 facilities over the next 12-18 months with a capex plan of INR 450 crores for FY26. Growth was primarily driven by the operationalization of the GLISPS plant, and the company is transitioning from component manufacturing to assemblies and subassemblies. Two acquired subsidiaries have reached EBITDA neutrality and are expected to contribute to growth from FY26.",
            "Sentiment": "positive",
            "PublishDate": 1754982671531,
            "Source": "earnings"
        },
        {
            "Title": "Azad Engineering Reports No Deviation in QIP Fund Utilization for Quarter Ended June 30, 2025",
            "Summary": "Azad Engineering Limited submitted its monitoring agency report for the utilization of proceeds from its ₹700 crore Qualified Institutional Placement (QIP) conducted in February-March 2025. Care Ratings Limited, serving as the monitoring agency, reported no deviation from the disclosed objects for the quarter ended June 30, 2025. The company utilized ₹202.83 crores during the quarter across three categories: ₹76.64 crores for capital expenditure funding, ₹76.41 crores for general corporate purposes, and ₹4.70 crores for issue expenses. The remaining ₹497.17 crores is maintained in fixed deposits with HDFC Bank, ICICI Bank, and Yes Bank, along with balances in monitoring agency and escrow accounts. The Audit Committee reviewed the report on August 04, 2025. All utilization was conducted as per the offer document disclosures, with necessary government approvals obtained and no major deviations observed from previous monitoring reports.",
            "Sentiment": "neutral",
            "PublishDate": 1754465007791,
            "Source": "corporate_action"
        },
        {
            "Title": "Azad Engineering Maintains 25-30% Revenue Growth Outlook for FY26",
            "Summary": "Azad Engineering has maintained its revenue growth outlook at 25-30% for FY26. The company expects EBITDA margins to be in the range of 33-35%, which will depend on product and segment mix. Depreciation is anticipated at Rs. 48 crore for FY26. The company indicated stronger growth possibilities once new facilities begin operations.",
            "Sentiment": "positive",
            "PublishDate": 1754450724827,
            "Source": "stock"
        },
        {
            "Title": "Azad Engineering Reports 75% Jump in Quarterly Profit to ₹299.94 Million",
            "Summary": "Azad Engineering Limited reported standalone profit of ₹299.94 million for the quarter ended June 30, 2025, compared to ₹171.30 million in the same quarter last year. Revenue from operations increased to ₹1,345.12 million from ₹984.09 million year-on-year. On a consolidated basis, profit reached ₹294.32 million versus ₹171.23 million in the prior year quarter, while consolidated revenue grew to ₹1,370.92 million from ₹984.09 million. The company's earnings per share improved to ₹4.64 from ₹2.90 on a standalone basis. The results include two subsidiaries - Azad VTC Private Limited and Azad Prime Private Limited - which became subsidiaries in the first quarter of the previous financial year. The company operates primarily in manufacturing high precision and OEM components.",
            "Sentiment": "positive",
            "PublishDate": 1754313406530,
            "Source": "earnings"
        },
        {
            "Title": "Azad Engineering Gets Credit Rating Upgrade from CARE",
            "Summary": "Azad Engineering Limited received an upgraded credit rating from CARE. The company's long-term bank facilities of 145 crore were upgraded to CARE A; Stable from CARE A-; Stable. Additionally, its long-term/short-term bank facilities of 35 crore were assigned CARE A; Stable / CARE A2+ ratings.",
            "Sentiment": "positive",
            "PublishDate": 1753426329857,
            "Source": "stock"
        },
        {
            "Title": "Azad Engineering: Nomura Acquires Rs 66 Crore Stake in Block Deal",
            "Summary": "Nomura bought over 4.10 lakh shares of Azad Engineering at Rs 1,616.85 per share, an 8% discount to the previous closing price. The block deal was executed on Friday through Nomura India Investment Fund. Azad Engineering's stock fell by 5% following the transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1749275444000,
            "Source": "block_deals"
        },
        {
            "Title": "Azad Engineering: Shares Plunge 8% Following ₹780 Crore Block Deal",
            "Summary": "Azad Engineering shares fell 8% after a block deal involving 48 lakh shares (7.4% of equity) at ₹1,640 per share, totaling ₹780 crore. The stock is currently trading 6.38% lower at ₹1,641.70 and has declined 10% in 2025.",
            "Sentiment": "negative",
            "PublishDate": 1749198221000,
            "Source": "block_deals"
        },
        {
            "Title": "Azad Engineering Provides Long-Term Guidance and Growth Projections",
            "Summary": "Azad Engineering has announced its long-term debt guidance, aiming for a debt position of 1.5 times EBITDA. The company plans to offer more detailed financial performance guidance in upcoming quarters. Additionally, Azad Engineering expressed confidence in achieving over 30% revenue growth in FY26, citing a strong order pipeline, operational readiness, and strategic focus as supporting factors.",
            "Sentiment": "positive",
            "PublishDate": 1748316074000,
            "Source": "default"
        },
        {
            "Title": "Azad Engineering: Q4 Profit Surges 69%, Revenue Up 37%",
            "Summary": "Azad Engineering reported Q4 FY24 results with revenue rising 36.9% to Rs 126.9 crore and net profit growing 69% to Rs 25.2 crore year-over-year. EBITDA increased 45.8% to Rs 45.5 crore with margins expanding to 35.9%. The company achieved its highest-ever annual and quarterly revenue figures, surpassing its FY25 revenue growth guidance of 25-30% by achieving 33% growth for the full fiscal.",
            "Sentiment": "positive",
            "PublishDate": 1748233038000,
            "Source": "earnings"
        },
        {
            "Title": "Azad Engineering Reports Q4 Financial Results",
            "Summary": "Azad Engineering has reported its latest quarterly financial results. The company's Q4 net profit increased to 260 million rupees, compared to 149.3 million rupees in the same quarter last year and 243 million rupees in the previous quarter. Revenue for Q4 rose to 1.25 billion rupees from 927.98 million rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748223269000,
            "Source": "default"
        },
        {
            "Title": "Azad Engineering: Q4 Results Surpass Guidance with Strong Revenue Growth",
            "Summary": "Azad Engineering reported Q4 FY25 consolidated results with revenue up 36.9% YoY to Rs 126.9 crore, EBITDA up 45.8% to Rs 45.5 crore, and net profit up 69% to Rs 25.2 crore. The company exceeded its FY25 revenue guidance, achieving 33% growth. Export contribution increased to 91.9% of total revenue. The company raised Rs 700 crore through QIP in February 2025 for capex and expansion.",
            "Sentiment": "positive",
            "PublishDate": 1748162856000,
            "Source": "earnings"
        },
        {
            "Title": "Azad Engineering Reports Strong Q4 Financial Performance",
            "Summary": "Azad Engineering has announced its Q4 financial results. The company's EBITDA increased to 454 million rupees from 313.6 million rupees year-over-year. The EBITDA margin improved to 36.47% from 33.79% in the same period. Net profit rose to 260 million rupees from 149.3 million rupees year-over-year and 243 million rupees quarter-over-quarter. Revenue for Q4 reached 1.25 billion rupees, up from 927.98 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748004895000,
            "Source": "result"
        },
        {
            "Title": "Azad Engineering Ltd.: Q4 and FY25 Results Announcement Scheduled",
            "Summary": "Azad Engineering Ltd. will announce Q4 and FY25 results on May 23, 2025, at 3:30 p.m. The trading window is closed for designated persons until 48 hours after the results declaration. Q3 FY25 saw a 41.15% YoY increase in consolidated net profit to Rs 23.72 crore, with total income growing 16.6% YoY to Rs 125.56 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1747826483000,
            "Source": "corporate_action"
        },
        {
            "Title": "Azad Engineering Signs 5-Year Strategic Supply Contract Amendment with Baker Hughes Unit",
            "Summary": "Azad Engineering has signed a 5-year strategic supply contract amendment with Nuovo Pignone SRL, a unit of Baker Hughes. The agreement extends and likely modifies an existing supply arrangement between the two companies, though specific details about the nature of the supplies or the contract's value are not provided in the given information.",
            "Sentiment": "positive",
            "PublishDate": 1747668268000,
            "Source": "default"
        },
        {
            "Title": "Azad Engineering: $54 Million Contract with GE Vernova for Power Industry Airfoils",
            "Summary": "Azad Engineering secured a $53.5 million, six-year contract with GE Vernova's Steam Power Services to supply airfoils for nuclear and thermal power industries through 2030. This follows the inauguration of a new manufacturing facility and strengthens their existing partnership.",
            "Sentiment": "positive",
            "PublishDate": 1746416332000,
            "Source": "order&deals"
        },
        {
            "Title": "Azad Engineering Signs $53.5M Supply Agreement with GE Steam Power",
            "Summary": "Azad Engineering has entered into a long-term supply agreement worth $53.5 million (approximately ₹452.5 crore) with GE Steam Power GmbH. The agreement involves the manufacture and global supply of complex rotating and stationary airfoils used in advanced nuclear, industrial, and thermal power systems.",
            "Sentiment": "positive",
            "PublishDate": 1746411791000,
            "Source": "default"
        },
        {
            "Title": "Azad Engineering: $54 Million Deal with GE Vernova for Power Industry Airfoils",
            "Summary": "Azad Engineering signed a $53.5 million agreement with GE Vernova's Steam Power Services to supply airfoils for nuclear and thermal power industries until 2030. This follows the inauguration of Azad's new 7,600 sq m manufacturing facility.",
            "Sentiment": "positive",
            "PublishDate": 1746364428000,
            "Source": "order&deals"
        },
        {
            "Title": "Azad Engineering Inaugurates Lean Manufacturing Facility for Mitsubishi in Hyderabad",
            "Summary": "Azad Engineering has inaugurated a new lean manufacturing facility in Hyderabad. This facility is specifically designed for Mitsubishi, indicating a potential partnership or contract between the two companies. The implementation of lean manufacturing principles suggests that Azad Engineering is focusing on efficiency and waste reduction in its production processes.",
            "Sentiment": "positive",
            "PublishDate": 1741824363000,
            "Source": "corporate_action"
        },
        {
            "Title": "Azad Engineering Inaugurates New Lean Manufacturing Facility for Mitsubishi in Hyderabad",
            "Summary": "Azad Engineering has inaugurated a new lean manufacturing facility in Hyderabad. This facility is specifically designed for Mitsubishi, indicating a potential partnership or contract between the two companies. The implementation of lean manufacturing principles suggests an effort to improve efficiency and reduce waste in the production process.",
            "Sentiment": "positive",
            "PublishDate": 1741781272000,
            "Source": "corporate_action"
        },
        {
            "Title": "Azad Engineering: Potential Beneficiary of US Tariffs on Other Countries",
            "Summary": "Azad Engineering expects to benefit from global tariff tensions, citing India's competitive advantage. The company anticipates 25-30% growth in FY2025 and recently raised ₹700 crore through a QIP. Executive Director Vishnu Malpani states that India is 20-25% more competitive than China and 30-35% more competitive globally.",
            "Sentiment": "positive",
            "PublishDate": 1741150051000,
            "Source": "normal_news"
        },
        {
            "Title": "Azad Engineering Completes Qualified Institutions Placement",
            "Summary": "Azad Engineering has successfully completed a Qualified Institutions Placement (QIP), allocating 5.5 million shares at a price of 1,280 rupees per share. This placement allows the company to raise capital by issuing shares to qualified institutional buyers.",
            "Sentiment": "positive",
            "PublishDate": 1741047129000,
            "Source": "corporate_action"
        },
        {
            "Title": "Azad Engineering Completes Qualified Institutions Placement",
            "Summary": "Azad Engineering has successfully completed its Qualified Institutions Placement (QIP). The company allocated 5.5 million shares at a price of 1,280 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1741008997000,
            "Source": "corporate_action"
        },
        {
            "Title": "Azad Engineering: QIP Launch to Raise ₹700 Crore at ₹1,280 Per Share",
            "Summary": "Azad Engineering has launched a qualified institutional placement (QIP) to raise approximately ₹700 crore. The issue price is set at ₹1,280 per share, representing a 1.8% discount to SEBI's floor price and a 5.6% discount to the last closing price. The company aims to dilute 8.5% equity, with a 60-day lock-in period for further share sales post-QIP.",
            "Sentiment": "neutral",
            "PublishDate": 1740547316000,
            "Source": "corporate_action"
        },
        {
            "Title": "Azad Engineering Signs Long-Term Deal with Rolls-Royce for Aircraft Engine Components",
            "Summary": "Azad Engineering has entered into a long-term agreement with Rolls-Royce Plc, London-UK to manufacture civil aircraft engine components. The deal involves Azad producing super critical complex machined parts in India for the duration of the engine program.",
            "Sentiment": "positive",
            "PublishDate": 1738801082000,
            "Source": "order&deals"
        },
        {
            "Title": "Azad Engineering Signs Long-Term Deal with Rolls-Royce for Aircraft Engine Components",
            "Summary": "Azad Engineering has entered into a long-term agreement with Rolls-Royce plc, London-UK to manufacture civil aircraft engine components in India. The deal involves the production of super critical complex machined parts for the entire lifespan of the engine program.",
            "Sentiment": "positive",
            "PublishDate": 1738763489000,
            "Source": "order&deals"
        },
        {
            "Title": "Azad Engineering Signs Long-Term Deal with Rolls-Royce for Aircraft Engine Components",
            "Summary": "Azad Engineering has entered into a long-term agreement with Rolls-Royce PLC, London-UK to manufacture civil aircraft engine components in India. The deal involves the production of super critical complex machined parts for the entire lifespan of the engine program.",
            "Sentiment": "positive",
            "PublishDate": 1738763445000,
            "Source": "order&deals"
        },
        {
            "Title": "Azad Engineering Reports Strong Q3 Financial Performance",
            "Summary": "Azad Engineering has announced its financial results for the third quarter, showing significant year-over-year growth. The company's net profit increased to 243 million rupees, up from 168 million rupees in the same period last year. Revenue also saw a substantial rise, reaching 1.19 billion rupees compared to 892 million rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1738714855000,
            "Source": "earnings"
        },
        {
            "Title": "Azad Engineering Reports Q3 EBITDA Growth",
            "Summary": "Azad Engineering has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 426 million rupees, up from 328 million rupees in the same quarter of the previous year. However, the EBITDA margin slightly decreased to 35.92% from 36.77% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738676468000,
            "Source": "earnings"
        },
        {
            "Title": "Azad Engineering Reports Strong Q3 Financial Results",
            "Summary": "Azad Engineering has announced its financial results for the third quarter. The company's net profit increased to 243 million rupees, up from 168 million rupees in the same quarter last year. Revenue also saw significant growth, reaching 1.19 billion rupees compared to 892 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738676462000,
            "Source": "earnings"
        },
        {
            "Title": "Azad Engineering Ltd: Q3 Results Announcement Date Set",
            "Summary": "Azad Engineering Ltd. will announce Q3 results on February 4, 2025, at 3:30 PM. The board meeting will be held in Hyderabad to approve standalone and consolidated unaudited financial results for the quarter ended December 31, 2024. Trading window for designated persons closed from January 1 until 48 hours post-result declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1738576655000,
            "Source": "corporate_action"
        },
        {
            "Title": "Azad Engineering Signs Major Contract with Siemens Energy",
            "Summary": "Azad Engineering has entered into a long-term contract and price agreement with Siemens Energy Global GmbH for the manufacturing and supply of mission-critical components. The current phase of this contract is valued at 8.11 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738197159000,
            "Source": "order&deals"
        },
        {
            "Title": "Azad Engineering Signs Major Contract with Siemens Energy Global",
            "Summary": "Azad Engineering has entered into a long-term contract and price agreement with Siemens Energy Global GmbH for the manufacturing and supply of mission-critical components. The current phase of this contract is valued at 8.11 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738155752000,
            "Source": "order&deals"
        },
        {
            "Title": "Azad Engineering to Consider Q3 Results",
            "Summary": "Azad Engineering has announced that it will consider its third quarter (Q3) financial results on February 4. This indicates the company is preparing to release its latest quarterly earnings report, which will provide insight into its financial performance for the most recent three-month period.",
            "Sentiment": "neutral",
            "PublishDate": 1738068352000,
            "Source": "earnings"
        },
        {
            "Title": "Azad Engineering Secures Purchase Order from BHEL for Advanced Turbine Components",
            "Summary": "Azad Engineering has received a purchase order from Bharat Heavy Electricals Limited (BHEL) for the supply of advanced, high-complex rotating airfoils for supercritical turbines. This order signifies Azad Engineering's capability to manufacture sophisticated components for power generation equipment and strengthens its position in the engineering sector.",
            "Sentiment": "positive",
            "PublishDate": 1738033280000,
            "Source": "order&deals"
        },
        {
            "Title": "Azad Engineering Signs Long-Term Supply Agreement with GE Vernova",
            "Summary": "Azad Engineering has entered into a long-term supply agreement with GE Vernova International LLC, USA. The current phase of the contract is valued at $112 million (approximately INR 960 crore). This agreement represents a significant business deal for Azad Engineering, potentially boosting its revenue and market position in the engineering sector.",
            "Sentiment": "positive",
            "PublishDate": 1736985851000,
            "Source": "order&deals"
        },
        {
            "Title": "Azad Engineering Signs $112M Supply Agreement with GE Vernova",
            "Summary": "Azad Engineering has entered into a long-term supply agreement with GE Vernova International LLC, USA. The current phase of this contract is valued at $112 million. This agreement represents a significant business deal for Azad Engineering, potentially boosting its revenue and expanding its international presence in the engineering supply chain.",
            "Sentiment": "positive",
            "PublishDate": 1736943585000,
            "Source": "order&deals"
        },
        {
            "Title": "Azad Engineering Approves Fund Raising of Up to 10 Billion Rupees",
            "Summary": "Azad Engineering has approved a plan to raise funds up to 10 billion rupees (approximately $120 million USD). This decision indicates the company's intent to secure significant capital, potentially for expansion, debt reduction, or other strategic initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1736122146000,
            "Source": "corporate_action"
        },
        {
            "Title": "Azad Engineering Approves Fund Raising of Up to 10 Billion Rupees",
            "Summary": "Azad Engineering has approved a plan to raise funds up to 10 billion rupees (approximately $120 million USD). This significant fund-raising initiative suggests the company is preparing for expansion, investment in new projects, or strengthening its financial position.",
            "Sentiment": "positive",
            "PublishDate": 1735914347000,
            "Source": "corporate_action"
        },
        {
            "Title": "Azad Engineering: Board to Consider Fundraising Options on Jan. 3",
            "Summary": "Azad Engineering's board will meet on Jan. 3, 2025, to discuss raising funds through various means including equity shares and convertible instruments. The board will also consider an employee stock option scheme and the appointment of new directors.",
            "Sentiment": "neutral",
            "PublishDate": 1735222056000,
            "Source": "corporate_action"
        }
    ]
}