{
    "Symbol": "BAFNAPH",
    "ISIN": "INE878I01022",
    "News": [
        {
            "Title": "Bafna Pharmaceuticals Q3 FY26 Results Show Strong Growth",
            "Summary": "Bafna Pharmaceuticals reported Q3 FY26 revenue of ₹3,828.58 lakhs, up 15.36% YoY, with net profit of ₹183.69 lakhs versus ₹94.77 lakhs in Q3 FY25, marking 93.87% growth.",
            "Sentiment": "positive",
            "PublishDate": 1770813491985,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bafna Pharmaceuticals Gets Credit Rating Outlook Upgrade",
            "Summary": "ICRA Limited revised Bafna Pharmaceuticals' credit rating outlook from Stable to Positive while reaffirming BB+ long-term rating on Rs. 50.00 crores bank facilities.",
            "Sentiment": "positive",
            "PublishDate": 1769176753378,
            "Source": "stocks"
        },
        {
            "Title": "Bafna Pharmaceuticals Reports Strong Q2 Performance with Revenue Growth and Improved Profitability",
            "Summary": "Bafna Pharmaceuticals Limited reported its unaudited financial results for the quarter and half year ended September 30, 2025. The company achieved revenue from operations of INR 3,546.82 lakhs for Q2 2025, compared to INR 3,462.40 lakhs in Q2 2024. Net profit for the quarter stood at INR 312.49 lakhs versus INR 338.89 lakhs in the previous year quarter. For the half year period, revenue reached INR 7,009.22 lakhs with net profit of INR 651.38 lakhs. The company's total assets increased to INR 16,068.27 lakhs as of September 30, 2025, up from INR 13,215.84 lakhs in the previous year. Earnings per share for Q2 2025 was INR 1.32. The auditors noted outstanding foreign currency receivables of INR 213 lakhs beyond RBI stipulated time periods and an income tax refund adjustment of INR 45.17 lakhs under legal proceedings.",
            "Sentiment": "positive",
            "PublishDate": 1762891779847,
            "Source": "earnings"
        },
        {
            "Title": "Bafna Pharmaceuticals Appoints New Independent Director, Re-appoints Two Others",
            "Summary": "Bafna Pharmaceuticals Limited shareholders approved the appointment of Mr. Navin Kumar as Non-Executive Independent Director for a one-year term effective June 23, 2025, at their 30th Annual General Meeting held on September 19, 2025. The meeting also approved the re-appointment of Mr. Palamadai Krishnan Sundaresan and Mrs. Ravichandran Chitra as Non-Executive Independent Directors for second terms of five years each, effective September 19, 2025 and November 12, 2025 respectively. Mr. Kumar is a Chartered Accountant with over 13 years of experience in corporate finance, taxation, and auditing. Mr. Sundaresan is a Cost & Management Accountant and Company Secretary with over 40 years of multi-industry experience. Mrs. Chitra holds a Bachelor's degree in Commerce and brings over three decades of experience in Human Resource Management. All three directors are confirmed as not being debarred from holding office by any regulatory authority.",
            "Sentiment": "neutral",
            "PublishDate": 1758287402485,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bafna Pharmaceuticals Re-appoints Two Independent Directors and CEO for Five-Year Terms",
            "Summary": "Bafna Pharmaceuticals Limited's Board of Directors approved the re-appointment of Mrs. Ravichandran Chitra and Mr. Palamadai Krishnan Sundaresan as Non-Executive Independent Directors for second terms of five years each, effective November 12, 2025 and September 19, 2025 respectively, subject to shareholder approval. The Board also re-appointed Mr. Bafna Mahaveer Chand as Chief Executive Officer for a further five-year term effective September 10, 2025. Mrs. Chitra brings over three decades of experience in Human Resource Management and related fields, while Mr. Sundaresan is a qualified CMA and CS with over 40 years of multi-industry experience. Mr. Chand, a Chemistry graduate with over four decades in the pharmaceutical industry, has led the company to establish a DSIR-approved R&D centre, secure UK-MHRA accreditation, and win multiple national and international awards for quality and excellence.",
            "Sentiment": "positive",
            "PublishDate": 1755005171619,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bafna Pharmaceuticals Reports Q1 Results, Schedules 30th AGM for September",
            "Summary": "Bafna Pharmaceuticals Limited approved its unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of ₹3,462.40 lakhs compared to ₹3,328.63 lakhs in the same quarter last year. Net profit for the quarter was ₹338.89 lakhs versus a loss of ₹72.36 lakhs in the corresponding previous quarter. The company scheduled its 30th Annual General Meeting for September 19, 2025, to be held through video conferencing. Book closure dates are set from September 13-19, 2025, with the cut-off date for voting eligibility being September 12, 2025. The board also reconstituted the Nomination & Remuneration Committee with Mr. Navin Kumar as Chairman, Mrs. Ravichandran Chitra and Mrs. Akila Chintalapati Raju as members. The company achieved the prescribed Minimum Public Shareholding as of April 2, 2025, and completed the sale of assets from its Madhavaram manufacturing unit during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754998853222,
            "Source": "earnings"
        }
    ]
}