{
    "Symbol": "BAGFILMS",
    "ISIN": "INE116D01028",
    "News": [
        {
            "Title": "B.A.G. Films Reports Strong Q3 FY26 Performance",
            "Summary": "B.A.G. Films and Media Limited delivered impressive Q3 FY26 results with standalone revenue of ₹1,319.02 lakhs and net profit of ₹216.33 lakhs, marking significant growth over previous periods.",
            "Sentiment": "positive",
            "PublishDate": 1770908268667,
            "Source": "co_actions_results"
        },
        {
            "Title": "BAG Films Board Meet Set for Feb 12 for Q3FY26 Results",
            "Summary": "B.A.G. Films and Media Limited has scheduled its board meeting for February 12, 2026, to consider and approve unaudited financial results for Q3FY26. Trading window remains closed until February 14, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769881006645,
            "Source": "co_actions_results"
        },
        {
            "Title": "B.A.G. Films Approves ₹16.50 Cr Warrant Issue",
            "Summary": "B.A.G. Films and Media Limited board approves preferential issue of 2 crore fully convertible warrants at ₹8.25 each to promoter group entity Skyline Tele Media Services Limited.",
            "Sentiment": "positive",
            "PublishDate": 1768310445153,
            "Source": "co_actions_results"
        },
        {
            "Title": "B.A.G. Films Board Approves ₹16.50 Cr Warrant Issue",
            "Summary": "B.A.G. Films and Media Limited's board approved raising ₹16.50 crores through preferential allotment of 2 crore fully convertible warrants to promoter group entity Skyline Tele Media Services Limited at ₹8.25 per warrant.",
            "Sentiment": "positive",
            "PublishDate": 1768309820546,
            "Source": "co_actions_results"
        },
        {
            "Title": "BAG Films Board to Meet on Fund Raising Proposal",
            "Summary": "B.A.G. Films and Media Limited has scheduled a board meeting for January 13, 2026, to consider and approve a fund raising proposal through securities issuance, including preferential issue options.",
            "Sentiment": "neutral",
            "PublishDate": 1767613632695,
            "Source": "stocks"
        },
        {
            "Title": "Abundantia Capital VCC Acquires 5.2% Stake in B.A.G. Convergence Limited",
            "Summary": "Abundantia Capital VCC-Abundantia Capital II acquired 1,104,000 shares representing 5.2% voting rights in B.A.G. Convergence Limited through a public issue dated October 8, 2025. The acquisition brings Abundantia Capital's total holding from zero to 5.2% in the company, with B.A.G. Convergence maintaining its total equity share capital at 21,218,800 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764310039083,
            "Source": "corporate_action"
        },
        {
            "Title": "B.A.G. Films and Media Limited Reports Quarterly Results for September 2025",
            "Summary": "B.A.G. Films and Media Limited announced its unaudited financial results for the quarter and six months ended September 30, 2025. The Board of Directors approved both standalone and consolidated results during a meeting held on November 12, 2025. The company operates across six business segments: Audio-Visual Production and Distribution, Leasing, FM Radio, Podcast, Television Broadcasting, and Content Syndication. The consolidated results include subsidiaries with total income of Rs. 6,121.09 lakhs and profit before tax of Rs. 168.61 lakhs for the six-month period. The results were reviewed by Joy Mukherjee Associates, Chartered Accountants, and have been submitted to BSE and NSE stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1762996881107,
            "Source": "earnings"
        },
        {
            "Title": "B.A.G. Films and Media Limited Schedules 32nd AGM for September 11, 2025",
            "Summary": "B.A.G. Films and Media Limited has announced its 32nd Annual General Meeting scheduled for September 11, 2025, at 4:00 PM IST through video conferencing. The company reported standalone revenue of Rs. 3,814.28 lakhs for FY 2024-25 compared to Rs. 3,595.08 lakhs in the previous year. Consolidated total income increased to Rs. 13,996.31 lakhs from Rs. 13,357.99 lakhs. The company achieved consolidated profit after tax of Rs. 999.03 lakhs, marking a 47.53% improvement from the previous year's Rs. 677.13 lakhs. The AGM agenda includes ordinary business items such as adoption of audited financial statements and director re-appointment, along with special business including secretarial auditor appointment and approval of material related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1755089003565,
            "Source": "corporate_action"
        },
        {
            "Title": "B.A.G. Films and Media Reports 96% Jump in Standalone Profit for Q1 FY2026",
            "Summary": "B.A.G. Films and Media Limited reported standalone profit of Rs 78.99 lakh for the quarter ended June 30, 2025, compared to Rs 40.37 lakh in the same period last year. Revenue from operations increased to Rs 937.01 lakh from Rs 907.06 lakh year-on-year. On a consolidated basis, the company posted profit of Rs 224.62 lakh versus Rs 158.24 lakh in the previous year quarter, with consolidated revenue rising to Rs 3,146.70 lakh from Rs 2,847.55 lakh. Basic earnings per share improved to Rs 0.04 from Rs 0.02 on standalone basis and to Rs 0.11 from Rs 0.08 on consolidated basis. The Board meeting was held on August 12, 2025, to approve these unaudited financial results. The company's subsidiaries include E24 Glamour Limited, News24 Broadcast India Limited, and Skyline Radio Network Limited.",
            "Sentiment": "positive",
            "PublishDate": 1755015366433,
            "Source": "earnings"
        }
    ]
}