{
    "Symbol": "BAHETI",
    "ISIN": "INE029Q01017",
    "News": [
        {
            "Title": "Baheti Recycling Industries Reports Strong H1 Growth with 33% Jump in Net Profit",
            "Summary": "Baheti Recycling Industries posted net profit of 93 million rupees in H1 compared to 70 million rupees in the same period last year, marking significant growth. The company's revenue also increased to 3.1 billion rupees from 2.6 billion rupees year-over-year, demonstrating strong operational performance across key financial metrics.",
            "Sentiment": "positive",
            "PublishDate": 1763135328556,
            "Source": "earnings"
        },
        {
            "Title": "Baheti Recycling Industries Secures Rs 50 Crore Order from ArcelorMittal Nippon Steel India",
            "Summary": "Baheti Recycling Industries received an order from ArcelorMittal Nippon Steel India to deliver 1720 MT of aluminium deoxidants valued at approximately Rs 50 crores. The supply is scheduled from September 25 to December 25. The deal is expected to boost the company's half-yearly revenues by approximately 20%.",
            "Sentiment": "positive",
            "PublishDate": 1758531468865,
            "Source": "stock"
        },
        {
            "Title": "Baheti Recycling Industries Plans 1.2 MW Solar Plant in Gujarat",
            "Summary": "Baheti Recycling Industries announced plans to construct a 1.2 MW solar power plant in Gujarat. The project requires an investment of 35.1 million rupees and operations are scheduled to commence in Q1 FY27.",
            "Sentiment": "positive",
            "PublishDate": 1753108861298,
            "Source": "stock"
        },
        {
            "Title": "Baheti Recycling Industries: SME Stock Secures ₹121 Crore Order from Minda Corporation",
            "Summary": "Baheti Recycling Industries, an SME company, has signed an MOU with Minda Corporation Limited to supply 4,368 MT of Aluminium Alloy Ingots in FY 2025-26, valued at approximately ₹121 crores. The stock surged 9% in intraday trading following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1747034687000,
            "Source": "order&deals"
        },
        {
            "Title": "Baheti Recycling Industries Secures ₹121 Crore Order",
            "Summary": "Baheti Recycling Industries, a company with a market capitalization of ₹480 crore, has received an order worth ₹121 crores. This order represents a significant business opportunity for the small and medium enterprise (SME).",
            "Sentiment": "positive",
            "PublishDate": 1747029997000,
            "Source": "default"
        }
    ]
}