{
    "Symbol": "BAIDFIN",
    "ISIN": "INE020D01022",
    "News": [
        {
            "Title": "Baid Finserv Q3FY26 Net Profit Rises 0.42% to ₹475.06 Lakhs",
            "Summary": "Baid Finserv Limited reported net profit of ₹475.06 lakhs for Q3FY26, up 0.42% YoY. Revenue from operations grew 15.40% to ₹2,462.88 lakhs, driven by strong interest income performance.",
            "Sentiment": "positive",
            "PublishDate": 1770714831220,
            "Source": "co_actions_results"
        },
        {
            "Title": "Baid Finserv Reports Zero Physical Share Transfers",
            "Summary": "Baid Finserv Limited reported no physical share transfer requests received or processed during December 7, 2025 to January 6, 2026 under SEBI's special re-lodgement window.",
            "Sentiment": "neutral",
            "PublishDate": 1767780249982,
            "Source": "stocks"
        },
        {
            "Title": "Baid Finserv Files SEBI Report for Rights Issue Exemption",
            "Summary": "Baid Finserv Limited has submitted a report under SEBI Takeover Regulations claiming exemption for acquisition through Rights Issue, with associated payment of ₹1,77,005.90 to SEBI.",
            "Sentiment": "neutral",
            "PublishDate": 1767173899583,
            "Source": "co_actions_results"
        },
        {
            "Title": "Baid Finserv Fined ₹23,600 by BSE and NSE",
            "Summary": "Baid Finserv Limited receives penalty notices from BSE and NSE for non-compliance with Regulation 29 of SEBI Listing Regulations, with each exchange imposing a fine of ₹11,800.",
            "Sentiment": "negative",
            "PublishDate": 1765883049016,
            "Source": "stocks"
        },
        {
            "Title": "Baid Finserv Raises INR 30.02 Crore Through Rights Issue, Corrects Oversubscription Data",
            "Summary": "Baid Finserv Limited successfully completed its INR 30.02 crore rights issue that was 1.07 times oversubscribed, structured as a 1:4 issue at INR 10 per share, with the company correcting an earlier error that misstated oversubscription as 107.84 times. The capital raise increased the company's equity share capital from 12,00,68,300 to 15,00,85,375 shares, with promoter shareholding rising from 36.25% to 45.71%, and proceeds will be used for business expansion, debt repayment, and general corporate purposes.",
            "Sentiment": "positive",
            "PublishDate": 1765361435468,
            "Source": "corporate_action"
        },
        {
            "Title": "Baid Finserv Limited Announces Rights Issue of ₹3,001.71 Lakhs",
            "Summary": "Baid Finserv Limited has announced a rights issue of up to 3,00,17,075 equity shares at ₹10 per share (face value ₹2) for ₹3,001.71 lakhs, offering 1 rights share for every 4 existing shares held. The company published pre-issue advertisements in Financial Express and Business Remedies newspapers, with the record date set as November 17, 2025 for eligible shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1763622129725,
            "Source": "corporate_action"
        },
        {
            "Title": "Baid Finserv Reports Q2 Results and Completes Rs 30 Crore Rights Issue",
            "Summary": "Baid Finserv Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported a profit of Rs 13.45 crore for the period from continuing operations. The Board approved these results at their meeting on November 13, 2025. Additionally, the company completed a rights issue of 3,00,17,075 equity shares at Rs 10 per share (including premium of Rs 8), raising Rs 30.02 crore. The rights issue was offered to existing shareholders in a 1:4 ratio with November 17, 2025 as the record date. The company also paid a final dividend of Rs 0.10 per share for FY 2024-25, totaling Rs 1.20 crore. Baid Finserv operates as an NBFC providing car loans, commercial vehicle loans, MSME loans, and loans against property.",
            "Sentiment": "positive",
            "PublishDate": 1763038224273,
            "Source": "earnings"
        },
        {
            "Title": "Baid Finserv Approves Rights Issue of 3 Crore Shares at Rs 10 Each",
            "Summary": "Baid Finserv Limited's Rights Issue Committee approved the issuance of 3,00,17,075 equity shares with a face value of Rs 2 each at a price of Rs 10 per share, including a premium of Rs 8. The rights issue will raise up to Rs 30.02 crore assuming full subscription. The entitlement ratio is set at 1:4, meaning eligible shareholders will receive 1 rights share for every 4 existing shares held. The record date is November 17, 2025, with the issue opening on November 25, 2025 and closing on December 3, 2025. Post-issue, the company's outstanding equity shares will increase from 12,00,68,300 to 15,00,85,375 shares. The company received in-principle approval from NSE and BSE for the proposed rights issue.",
            "Sentiment": "neutral",
            "PublishDate": 1762876379936,
            "Source": "corporate_action"
        },
        {
            "Title": "Baid Finserv Schedules Rights Issue Committee Meeting to Finalize Rs 35 Crore Equity Offering Terms",
            "Summary": "Baid Finserv Limited has scheduled a Rights Issue Committee meeting for November 11, 2025, to determine the terms and conditions of its rights issue of equity shares. The Board had previously approved issuing fully paid-up equity shares for an amount not exceeding Rs 35 crores to existing eligible equity shareholders. The committee will consider the rights entitlement ratio, issue price, record date, and approve the Letter of Offer to be filed with stock exchanges and SEBI. The company's trading window for directors and key personnel remains closed from October 1, 2025, until 48 hours after the declaration of unaudited financial results for the quarter and half year ended September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762597244743,
            "Source": "corporate_action"
        },
        {
            "Title": "Baid Finserv Declares Final Dividend of Rs. 0.10 Per Share for FY 2024-25",
            "Summary": "Baid Finserv Limited announced a final dividend of Rs. 0.10 per equity share for Financial Year 2024-25. The dividend, representing 5% of the Rs. 2 face value equity shares, was approved by shareholders at the company's 34th Annual General Meeting held on September 12, 2025. The meeting was conducted through video conferencing and concluded within 41 minutes. The dividend declaration follows the Board of Directors' recommendation.",
            "Sentiment": "positive",
            "PublishDate": 1757935267358,
            "Source": "corporate_action"
        },
        {
            "Title": "Baid Finserv Re-appoints Aman Baid as Whole Time Director for Three Years",
            "Summary": "Baid Finserv Limited shareholders approved the re-appointment of Mr. Aman Baid as Whole Time Director for a three-year term from June 01, 2026 to May 31, 2029. The decision was made at the company's 34th Annual General Meeting held on September 12, 2025. Mr. Aman Baid, who holds DIN 03100575, is the grandson of Chairman and Managing Director Mr. Panna Lal Baid and son of Non-Executive Director Mrs. Alpana Baid. He joined the company in 2013 and has been involved in setting up distribution points, evaluating new products, and formulating credit policies. He holds a post-graduate degree in FMB from SP Jain School of Global Management and is responsible for developing long-term strategic direction and overseeing day-to-day operations.",
            "Sentiment": "positive",
            "PublishDate": 1757934851404,
            "Source": "corporate_governance"
        },
        {
            "Title": "Baid Finserv Postpones Rights Issue Committee Meeting Pending Stock Exchange Approvals",
            "Summary": "Baid Finserv Limited postponed its Rights Issue Committee meeting that was scheduled for September 15, 2025. The meeting was intended to decide on terms and conditions of the rights issue, including rights entitlement ratio, issue price, and record date. The postponement occurred because approvals from BSE Limited and National Stock Exchange of India are still under process. The company will communicate a revised meeting date once the required approvals are received. The rights issue was previously approved by the Board of Directors in their meeting held on September 8, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757930927466,
            "Source": "corporate_action"
        },
        {
            "Title": "Baid Finserv Schedules Rights Issue Committee Meeting to Finalize Terms",
            "Summary": "Baid Finserv Limited has scheduled a Rights Issue Committee meeting for September 15, 2025, to determine key terms of its rights issue including entitlement ratio, issue price, and record date. The meeting will also approve the Letter of Offer for filing with stock exchanges and SEBI. The Board of Directors previously approved the issuance of fully paid-up equity shares on rights issue basis to existing eligible equity shareholders. The committee meeting will be held at the company's registered office in Jaipur.",
            "Sentiment": "neutral",
            "PublishDate": 1757591814762,
            "Source": "corporate_action"
        },
        {
            "Title": "Baid Finserv Limited Approves Rs. 35 Crore Rights Issue to Existing Shareholders",
            "Summary": "Baid Finserv Limited's Board of Directors approved a rights issue of fully paid-up equity shares for an amount not exceeding Rs. 35 crore to existing eligible shareholders. The board constituted a Rights Issue Committee to determine the terms and conditions including rights entitlement ratio, issue price, record date, and timing of payments. The Rights Issue Committee subsequently approved the Draft Letter of Offer for the rights issue, which will be filed with BSE and NSE for in-principle approvals. The equity shares have a face value of Rs. 2 each. The company also submitted an investor presentation on their unaudited financial results for the quarter ended June 30, 2025. The trading window for company insiders will open from September 11, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1757336421809,
            "Source": "corporate_action"
        },
        {
            "Title": "Baid Finserv Sets Record Date for Rs 0.10 Final Dividend, Approves Key Board Changes",
            "Summary": "Baid Finserv Limited has set September 5, 2025 as the record date for determining shareholder eligibility for a final dividend of Rs 0.10 per equity share for FY 2024-25, subject to approval at the AGM on September 12, 2025. The Board approved quarterly results for the period ended June 30, 2025, showing revenue from operations of Rs 2,378.30 lakhs and net profit of Rs 401.61 lakhs. The company reported earnings per share of Rs 0.33 for the quarter. Key board decisions include the re-appointment of Aman Baid as Whole Time Director for three years from June 1, 2026 to May 31, 2029, and the appointment of ABSM & Associates as new statutory auditors for five years, replacing Khilnani & Associates. The dividend payment will be made within 30 days of declaration at the AGM, subject to tax deduction at source.",
            "Sentiment": "positive",
            "PublishDate": 1754568889358,
            "Source": "corporate_action"
        },
        {
            "Title": "Baid Finserv Reports Strong Q1 Performance, Approves Key Board Changes and Dividend",
            "Summary": "Baid Finserv Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing revenue from operations of Rs. 2,378.30 lakhs compared to Rs. 1,888.02 lakhs in the same quarter last year. Net profit increased to Rs. 401.61 lakhs from Rs. 311.89 lakhs year-over-year. The Board approved the re-appointment of Mr. Aman Baid as Whole Time Director for three years from June 1, 2026 to May 31, 2029, subject to shareholder approval. The company appointed M/s. ABSM & Associates as new Statutory Auditors for five years, replacing M/s Khilnani & Associates. The Board recommended a final dividend of Rs. 0.10 per equity share for FY 2024-25 and scheduled the 34th Annual General Meeting for September 12, 2025. The record date for dividend entitlement is set as September 5, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754567492039,
            "Source": "corporate_governance"
        }
    ]
}