{
    "Symbol": "BAJAJHLDNG",
    "ISIN": "INE118A01012",
    "News": [
        {
            "Title": "Bajaj Holdings Q3 Net Profit Surges 114% to ₹1.8B",
            "Summary": "Bajaj Holdings & Investment reports strong Q3 performance with net profit jumping 114% to ₹1.8 billion and revenue rising 134% to ₹2.81 billion year-on-year, demonstrating robust growth.",
            "Sentiment": "positive",
            "PublishDate": 1770200498507,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Finserv completes ₹21,390-cr Allianz buyout",
            "Summary": "Bajaj Finserv completed acquisition of Allianz SE's 23% stake in insurance subsidiaries for ₹21,390 crore on January 8, ending 24-year JV and raising group ownership to 97%.",
            "Sentiment": "positive",
            "PublishDate": 1767875041939,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Holdings Board Meet Set for Feb 4 for Q3 Results",
            "Summary": "Bajaj Holdings & Investment Limited has scheduled its board meeting for February 4, 2026, to consider Q3FY26 financial results. Trading window closed from January 1-February 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767788749062,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Holdings & Investment Executes ₹116.73 Crore Block Trade on NSE",
            "Summary": "Bajaj Holdings & Investment Ltd. completed a block trade worth ₹116.73 crores involving approximately 105,253 shares at ₹11,090 per share on the NSE. The transaction represents a significant institutional trade in the company's shares at the specified price point.",
            "Sentiment": "neutral",
            "PublishDate": 1764909894294,
            "Source": "order&deals"
        },
        {
            "Title": "Bajaj Holdings Reports 66% Jump in H1 FY26 Profit to ₹5,046 Crore, Pays ₹65 Per Share Interim Dividend",
            "Summary": "Bajaj Holdings & Investment Ltd reported consolidated profit after tax of ₹5,046 crore for H1 FY26 versus ₹3,047 crore in H1 FY25, boosted by ₹1,522 crore profit from sale of Bajaj Finserv shares and strong performance across automobile and financial services businesses. The company declared and paid an interim dividend of ₹65 per equity share (650%) amounting to ₹723 crore, while progressing towards acquiring Allianz's 26% stake in two insurance companies.",
            "Sentiment": "positive",
            "PublishDate": 1763618024280,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Holdings Reports Strong Q2 Results, Sells Bajaj Finserv Stake for ₹1,995 Crore",
            "Summary": "Bajaj Holdings Investment Limited reported consolidated profit after tax of ₹1,559 crore in Q2 versus ₹1,436 crore in the previous year. For the half year, consolidated profit reached ₹5,046 crore compared to ₹3,047 crore. The company sold 1.04 crore equity shares of associate Bajaj Finserv Limited for ₹2,002 crore through a block deal, generating net profit of ₹1,983 crore. Standalone profit after tax was ₹2,181 crore for Q2 and ₹4,217 crore for the half year. The Board declared an interim dividend of ₹65 per equity share (650%), amounting to ₹723 crore, which was paid in October. The company is applying to Reserve Bank of India for re-categorization as an Unregistered Core Investment Company and has been realigning its investment portfolio accordingly.",
            "Sentiment": "positive",
            "PublishDate": 1762864068938,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Holdings & Investment Executes ₹62.42 Crore Block Trade on NSE",
            "Summary": "Bajaj Holdings & Investment Ltd. completed a block trade worth ₹62.42 crores on the National Stock Exchange. The transaction involved approximately 52,461 shares at a price of ₹11,898 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1759464884089,
            "Source": "order&deals"
        },
        {
            "Title": "Bajaj Holdings & Investment Limited Amends Code for Fair Disclosure of Price Sensitive Information",
            "Summary": "Bajaj Holdings & Investment Limited's Board of Directors approved amendments to the company's Code of Practices and Procedures for Fair Disclosure of Unpublished Price Sensitive Information on September 16, 2025. The amended code establishes principles for determining legitimate purposes for sharing unpublished price sensitive information, including sharing with auditors, regulatory authorities, legal advisors, and other business partners in the ordinary course of business. Key provisions include maintaining a structured digital database of persons with whom such information is shared, ensuring prompt public disclosure of price-sensitive information, and appointing the Compliance Officer as Chief Investor Relations Officer. The code requires recipients of unpublished price sensitive information to be treated as insiders under SEBI regulations and mandates confidentiality agreements. The updated policy is available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1758023673193,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bajaj Holdings Announces Rs 65 Interim Dividend with September 22 Record Date",
            "Summary": "Bajaj Holdings and Investment Ltd. declared an interim dividend of Rs 65 per share for financial year 2026. The company set September 22 as the record date for dividend eligibility. Shareholders on record as of this date will be entitled to receive the dividend payment.",
            "Sentiment": "positive",
            "PublishDate": 1758003404802,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Holdings & Investment Shareholders Approve All Resolutions at 80th AGM",
            "Summary": "Bajaj Holdings & Investment Limited held its 80th Annual General Meeting on August 6, 2025, where all six proposed resolutions were passed with overwhelming majority. The approved resolutions included adoption of audited financial statements for the year ended March 31, 2025, declaration of final dividend of Rs. 28 per equity share, re-appointment of directors Niraj Ramkrishna Bajaj and Rajivnayan Rahulkumar Bajaj who retired by rotation, appointment of Khandelwal Jain & Co. as statutory auditors from 80th AGM till 83rd AGM, and appointment of DVD & Associates as secretarial auditor for five consecutive years. The meeting had 75,217 total shareholders on record date with 102 shareholders present either in person or through proxy. Remote e-voting was available from August 2-5, 2025, with additional e-voting facility provided during the AGM for members who had not voted remotely.",
            "Sentiment": "positive",
            "PublishDate": 1754573218534,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Holdings Reports ₹2,036 Crore Standalone Profit in Q1 FY26, Driven by Bajaj Finserv Stake Sale",
            "Summary": "Bajaj Holdings & Investment Limited reported standalone profit after tax of ₹2,036 crore for the quarter ended June 30, 2025, compared to ₹66 crore in the same period last year. The significant increase was primarily driven by an exceptional gain of ₹1,983 crore from the sale of 1.04 crore equity shares of associate company Bajaj Finserv Limited through a block deal for ₹2,002.21 crore. Consolidated profit after tax reached ₹3,487 crore versus ₹1,610 crore in Q1 FY25. The company's total income increased to ₹308 crore from ₹139 crore year-on-year. BHIL is transitioning from an Investment and Credit Company to an Unregistered Core Investment Company as per RBI guidelines. The company's investment portfolio had a market value of ₹234,603 crore as of June 30, 2025, with a Net Asset Value of ₹21,080 per share. Bajaj Finserv continues to remain an associate of BHIL despite the partial stake sale.",
            "Sentiment": "positive",
            "PublishDate": 1754477345345,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Holdings & Investment Reports 30x Jump in Quarterly Net Profit to 20.4 Billion Rupees",
            "Summary": "Bajaj Holdings & Investment reported quarterly net profit of 20.4 billion rupees compared to 659.7 million rupees in the same period last year. Revenue increased to 2.95 billion rupees from 1.26 billion rupees year-over-year. The company recorded an exceptional item of 19.8 billion rupees during the quarter. Profit before exceptional items and tax stood at 2.6 billion rupees versus 896 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754476742164,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Holdings & Investment's Company Secretary Sriram Subbramaniam Resigns to Pursue Career Opportunities",
            "Summary": "Sriram Subbramaniam has resigned from his positions as Company Secretary, Compliance Officer, and Nodal Officer at Bajaj Holdings & Investment Limited. He submitted his resignation letter on April 30, 2025, and will be relieved from his responsibilities effective July 25, 2025. Subbramaniam cited pursuing alternate career opportunities outside the organization as the reason for his departure. The company is currently in the process of identifying and hiring a suitable replacement for these positions and will inform stock exchanges once the vacancy is filled.",
            "Sentiment": "neutral",
            "PublishDate": 1753452392479,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bajaj Holdings: Last Day to Qualify for Rs 28 Per Share Dividend",
            "Summary": "June 26 is the last day to buy Bajaj Holdings shares to qualify for the Rs 28 per share final dividend for FY2025. The record date is June 27, with a total dividend payout of Rs 311 crore. The company recently sold 0.65% stake in Bajaj Finserv for Rs 2,002.21 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1750917979000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Holdings & Investment Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 107,160 shares of Bajaj Holdings & Investment Ltd. occurred on the National Stock Exchange (NSE) for Rs. 152.41 crores. The trade was executed at a price of Rs. 14,223.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1749713894000,
            "Source": "block_details"
        },
        {
            "Title": "Bajaj Holdings & Investment Announces Q4 Results and Dividend",
            "Summary": "Bajaj Holdings & Investment has declared a dividend of 28 rupees per share. The company reported consolidated net profit of 17 billion rupees for Q4, compared to 27 billion rupees in the same quarter last year. The share of profits from associates increased to 16.1 billion rupees from 15.5 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1748591771000,
            "Source": "result"
        },
        {
            "Title": "Bajaj Holdings & Investment Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 26,256 shares of Bajaj Holdings & Investment Ltd. was executed on the National Stock Exchange (NSE) at a price of Rs. 10,587.50 per share. The total value of the transaction amounted to Rs. 27.80 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1744172724000,
            "Source": "block_deals"
        },
        {
            "Title": "Bajaj Holdings & Investment Reports Q3 Financial Results",
            "Summary": "Bajaj Holdings & Investment has announced its Q3 financial results. The company reported a net profit of 840 million rupees, up from 656 million rupees in the same quarter last year. However, this represents a significant decrease from the previous quarter's 10.5 billion rupees. Revenue for Q3 stood at 1.2 billion rupees, an increase from 1.01 billion rupees in the year-ago period.",
            "Sentiment": "neutral",
            "PublishDate": 1738284289000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Holdings & Investment Reports Q3 Profit and Revenue Growth",
            "Summary": "Bajaj Holdings & Investment has reported a significant increase in its Q3 net profit, rising to 840 million rupees from 656 million rupees year-over-year. However, this represents a decrease from the previous quarter's 10.5 billion rupees. The company's Q3 revenue also saw growth, reaching 1.2 billion rupees compared to 1.01 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738237341000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Holdings & Investment Ltd: Stock Surges 5.34% Amid Market Rally",
            "Summary": "Bajaj Holdings & Investment Ltd shares rose 5.34% in morning trade, reaching an intraday high of Rs 11,423.05. The company reported Q2 FY25 consolidated net sales of Rs 292.80 crore, up 97.69% QoQ and 21.97% YoY. Net profit stood at Rs 1,436.36 crore, a 3.67% increase YoY.",
            "Sentiment": "positive",
            "PublishDate": 1737520206000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings & Investment Ltd: Stock Trades Marginally Higher",
            "Summary": "Bajaj Holdings & Investment Ltd stock traded at Rs 10,835.95 on BSE, up 0.14% from the previous close. The company has a market value of Rs 120,597.09 crore. Promoters held 51.46% stake as of December 31, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1737440078000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings & Investment Ltd: Stock Rises 1.22% Amid Market Gains",
            "Summary": "Bajaj Holdings & Investment Ltd shares increased by 1.22% during Monday's trading session, reaching an intraday high of Rs 10,929.00. The stock opened at Rs 10,716.00. The Nifty50 and BSE Sensex were also trading higher at the time of reporting.",
            "Sentiment": "positive",
            "PublishDate": 1737347712000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings & Investment Ltd: Stock Fluctuates Amid Mixed Market Signals",
            "Summary": "Bajaj Holdings & Investment Ltd's stock price varied between Rs 10,769.00 and Rs 11,199.60 during Friday's trading session. The company reported consolidated sales of Rs 292.80 crore for Q2 FY2025, a 97.69% increase from the previous quarter. Net profit stood at Rs 1,436.36 crore, up 3.67% year-over-year. The MACD signaled a bearish bias on the counter.",
            "Sentiment": "neutral",
            "PublishDate": 1737101971000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings & Investment Ltd: Stock Rises 1.36% Amid Sensex Gains",
            "Summary": "Bajaj Holdings & Investment Ltd shares increased by 1.36% to Rs 10,993.90 during Thursday's trading session. The stock opened at Rs 11,099.90 and fluctuated between Rs 11,099.90 and Rs 10,772.05. The company has a market capitalization of Rs 122,066.17 crore.",
            "Sentiment": "positive",
            "PublishDate": 1737015517000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings & Investment Ltd: Stock Rises 1.95% Amid Nifty Gains",
            "Summary": "Bajaj Holdings & Investment Ltd shares increased by 1.95% during Wednesday's trading session. The stock opened at Rs 11,090.00 and fluctuated between Rs 11,090.00 and Rs 10,725.15. The company reported consolidated net sales of Rs 292.80 crore for Q2 FY2025, up 97.69% quarter-on-quarter and 21.97% year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1736916627000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings & Investment Ltd: Share Price Rises 2.22% Amid Market Gains",
            "Summary": "Bajaj Holdings & Investment Ltd's share price increased 2.22% to Rs 10,539.25 during Tuesday's trade. The stock hit a high of Rs 10,561.15 and a low of Rs 10,314.90. The company reported consolidated sales of Rs 292.80 crore for Q2 FY2025, up 97.69% QoQ and 21.97% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1736837241000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings & Investment Ltd: Share Price Fluctuates Amid Market Gains",
            "Summary": "Bajaj Holdings & Investment Ltd's share price decreased 1.12% to Rs 11,039.10 during Friday's trade. The stock hit a high of Rs 11,309.85 and a low of Rs 10,937.25. The company reported consolidated sales of Rs 292.80 crore for Q2 FY2025, up 97.69% QoQ and 21.97% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1736491644000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings & Investment Ltd: Shares Rise 0.36% in Thursday Trading",
            "Summary": "Bajaj Holdings & Investment Ltd shares increased by 0.36% to Rs 11,324.00 during Thursday's trading session. The company's market cap stood at Rs 125,785.04 crore on the BSE. For Q2 FY2025, the company reported consolidated sales of Rs 292.80 crore, up 21.97% YoY, and a net profit of Rs 1,436.36 crore, up 3.67% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1736404647000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings & Investment Ltd: Stock Surges 3.3% in Morning Trade",
            "Summary": "Bajaj Holdings & Investment Ltd stock rose 3.3% to Rs 11,475.45 around 10:00 AM IST on Wednesday. The company reported consolidated sales of Rs 292.8 crore for Q2 FY2025, up 97.69% QoQ and 21.97% YoY. Net profit for the quarter was Rs 1,436.36 crore.",
            "Sentiment": "positive",
            "PublishDate": 1736310606000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings & Investment Ltd: Stock Trades at Rs 11,859.40, Up 0.23%",
            "Summary": "Bajaj Holdings & Investment Ltd shares traded at Rs 11,859.40 on BSE, up 0.23% from the previous close. The company has a market value of Rs 132,083.14 crore. Promoters held 51.46% stake as of September 30, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1735884786000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings & Investment Ltd: Stock Rises 0.47% Amid Positive Market Sentiment",
            "Summary": "Bajaj Holdings & Investment Ltd shares increased by 0.47% during Thursday's trading session. The stock opened at Rs 11,871.75 and reached an intraday high of Rs 12,015.65. The broader market was also positive, with the Nifty50 up 204.65 points and the BSE Sensex up 668.75 points.",
            "Sentiment": "positive",
            "PublishDate": 1735798627000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings & Investment Ltd: Stock Surges 3.2% in Early Trading",
            "Summary": "Bajaj Holdings & Investment Ltd's stock price increased by 3.2% to Rs 11,665.80 in early trading on Monday. The company's stock has gained 52.07% over the past year, outperforming the Sensex's 11.28% gain. Trading volume was 1,879 shares, with a P/E ratio of 17.23.",
            "Sentiment": "positive",
            "PublishDate": 1735533005000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings & Investment Ltd: Stock Trades Marginally Higher as Sensex Rises",
            "Summary": "Bajaj Holdings & Investment Ltd stock traded at Rs 11,125.25 on BSE, up 0.06% from the previous close. The company's market value stood at Rs 123,816.81 crore. The stock's P/E ratio was 16.72, with a price-to-book value of 1.70 and ROE at 13.39%.",
            "Sentiment": "neutral",
            "PublishDate": 1735021008000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings & Investment Ltd: Stock Fluctuates Amid Market Volatility",
            "Summary": "Bajaj Holdings & Investment Ltd's stock price varied between Rs 10513.20 and Rs 11133.05 during Thursday's trading session. The company reported consolidated sales of Rs 292.80 crore for Q2 FY2025, up 97.69% QoQ and 21.97% YoY. Net profit stood at Rs 1436.36 crore, a 3.67% increase YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1734597437000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings & Investment Ltd: Shares Rise Amid Market Decline",
            "Summary": "Bajaj Holdings & Investment Ltd shares increased by 0.35% to Rs 10966.55 on Tuesday, despite overall market decline. The stock saw a trading volume of 454 shares with a value of Rs 0.51 crore. The company reported consolidated sales of Rs 292.8 crore for Q2 FY2025, a 97.69% increase from the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1734411938000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings & Investment Ltd: Stock Trades at Rs 11,113.65, Up 0.19%",
            "Summary": "Bajaj Holdings & Investment Ltd stock traded at Rs 11,113.65 on BSE, up 0.19% from the previous close. The company has a market value of Rs 123,310.43 crore. Promoters held 51.46% stake as of September 30, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1734329813000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings & Investment: Stock Dips 1.3% Amid Market Decline",
            "Summary": "Bajaj Holdings & Investment Ltd. shares fell 1.3% in Friday's trading session, opening at Rs 11,350 and reaching an intraday low of Rs 11,085. The broader market also declined, with Nifty50 down 191 points and Sensex down 590.44 points.",
            "Sentiment": "negative",
            "PublishDate": 1734070033000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings & Investment: Stock Rises Amid Market Dip",
            "Summary": "Bajaj Holdings & Investment Ltd. shares rose 1.85% to Rs 11,356.10 despite Sensex falling. The stock hit an intraday high of Rs 11,460.30. Promoters hold 51.46% stake, while FII and MF ownerships are at 10.88% and 5.4% respectively.",
            "Sentiment": "positive",
            "PublishDate": 1733982682000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings & Investment Ltd.: Shares Rise 0.7% Amid Strong Q2 Performance",
            "Summary": "Bajaj Holdings & Investment Ltd. shares increased 0.7% in Wednesday's trading. The company reported Q2 FY2025 consolidated net sales of Rs 292.80 crore, up 97.69% quarter-on-quarter and 21.97% year-on-year. Net profit for the quarter stood at Rs 1436.36 crore, a 3.67% increase from the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1733905752000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Holdings & Investment Ltd: Stock Rises 1.88% in Monday Trading",
            "Summary": "Bajaj Holdings & Investment Ltd stock rose 1.88% to Rs 10,876.00 in Monday's trade. The company reported consolidated sales of Rs 292.80 crore for Q2 FY2025, up 97.69% QoQ and 21.97% YoY. Net profit stood at Rs 1,436.36 crore, up 3.67% YoY. The MACD signaled a bullish bias on the counter.",
            "Sentiment": "positive",
            "PublishDate": 1733724202000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings & Investment Ltd: Stock Rises 0.49% Amid Market Fluctuations",
            "Summary": "Bajaj Holdings & Investment Ltd stock traded at Rs 10,623.05 on BSE, up 0.49% from previous close. The stock has a market value of Rs 118,227.65 crore. Promoters hold 51.46% stake, while FPIs and DIIs own 10.89% and 5.4% respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1733297086000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings & Investment Ltd: Stock Rises 2.06% in Morning Trade",
            "Summary": "Bajaj Holdings & Investment Ltd shares traded 2.06% higher at Rs 10,613.60 around 10:50 AM IST. The stock has gained 44.65% in the last year, outperforming the Sensex's 20.66% gain. Trading volume was 458 shares, with a P/E ratio of 15.93.",
            "Sentiment": "positive",
            "PublishDate": 1733203267000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings and Investment Acquires Shares of Mphasis",
            "Summary": "Bajaj Holdings and Investment has acquired shares of Mphasis worth 289.1 million rupees. This acquisition represents a significant investment in the IT services company by Bajaj Holdings.",
            "Sentiment": "neutral",
            "PublishDate": 1732713458000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Holdings & Investment Ltd: Stock Dips 1.54% Amid Market Fluctuations",
            "Summary": "Bajaj Holdings & Investment Ltd stock fell 1.54% to Rs 10,315.30 during intraday trading. The stock experienced a gap down start and traded with a turnover of Rs 1.94 crore. It hit an intraday high of Rs 10,490.15 and a low of Rs 10,183.00.",
            "Sentiment": "neutral",
            "PublishDate": 1732696082000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings & Investment Ltd: Stock Declines Amid Market Downturn",
            "Summary": "Bajaj Holdings & Investment Ltd shares fell 1.41% to Rs 10,447.00 as the Sensex dropped 227.01 points. Trading volume was 638 shares with a turnover of Rs 0.68 crore. The stock's P/E ratio stands at 15.71, with a price-to-book value of 1.70.",
            "Sentiment": "neutral",
            "PublishDate": 1732608123000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings & Investment Ltd: Stock Rises 0.59% in Monday Trading",
            "Summary": "Bajaj Holdings & Investment Ltd shares increased 0.59% to Rs 10,529.95 during Monday's trading session. The company's market cap stood at Rs 117,120.84 crore on the BSE. For Q2 FY2025, the company reported consolidated sales of Rs 292.80 crore, up 21.97% YoY, and net profit of Rs 1,436.36 crore, up 3.67% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1732523633000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings & Investment Ltd: Stock Rises 0.96% in Friday Trading",
            "Summary": "Bajaj Holdings & Investment Ltd shares increased by 0.96% to Rs 10,515.70 during Friday's trading session. The company's market cap on BSE was Rs 117,032.92 crore. For Q2 FY2025, the company reported consolidated sales of Rs 292.80 crore, up 21.97% YoY, and a net profit of Rs 1,436.36 crore, up 3.67% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1732254027000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings: Stock Rises Amid Market Decline",
            "Summary": "Bajaj Holdings & Investment Ltd. shares rose 0.96% to Rs 10,753.80 in Monday's trade, despite overall market decline. The stock hit an intraday high of Rs 10,982.90 and low of Rs 10,687.80. It has gained 4.96% in the past month, outperforming the BSE Sensex.",
            "Sentiment": "positive",
            "PublishDate": 1731916219000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings: Stock Dips Amid Sensex Decline",
            "Summary": "Bajaj Holdings & Investment Ltd. stock price decreased by 0.42% to Rs 10,539.95 during Thursday's trade as Sensex dropped 742.02 points. The stock hit a high of Rs 10,651.45 and a low of Rs 10,415.00. Trading volume was low with a turnover of Rs 0.58 crore on BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1730962731000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Holdings: Marginal Gain Amid Market Fluctuations",
            "Summary": "Bajaj Holdings & Investment Ltd. shares traded at Rs 10,597.25 on BSE, up 0.02% from the previous close. The stock's market value stood at Rs 117,563.79 crore. Promoters held 51.46% stake, while FIIs and DIIs owned 10.89% and 5.4% respectively, as of September 30, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1730877158000,
            "Source": "normal_news"
        }
    ]
}