{
    "Symbol": "BAJAJHCARE",
    "ISIN": "INE411U01027",
    "News": [
        {
            "Title": "Bajaj Healthcare Q3FY26: Revenue Jumps 31% to ₹1,612.2 Mn",
            "Summary": "Bajaj Healthcare reports strong Q3FY26 results with 31% revenue growth driven by API exports surge of 109.8%. EBITDA rises 34.6% to ₹323.3 million with improved margins.",
            "Sentiment": "positive",
            "PublishDate": 1768579934725,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Healthcare Reappoints Sajankumar Bajaj as CMD",
            "Summary": "Bajaj Healthcare Limited has reappointed Sajankumar Bajaj as Chairman and Managing Director, continuing his leadership role at the pharmaceutical company.",
            "Sentiment": "positive",
            "PublishDate": 1768572162509,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Healthcare Q3 profit rises 34% YoY on strong revenue",
            "Summary": "Bajaj Healthcare reported Q3 net profit of ₹15.67 crores, up 34% YoY, with revenue growing 31% to ₹161.22 crores. EBITDA surged 42% to ₹30.70 crores with margin expansion to 19.03%.",
            "Sentiment": "positive",
            "PublishDate": 1768568974890,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Healthcare Q3FY26 Revenue Jumps 31% to ₹16,122 cr",
            "Summary": "Bajaj Healthcare reported strong Q3FY26 results with revenue rising 31.3% YoY to ₹16,122.27 crores and net profit growing 7.6% to ₹1,567.38 crores. Board approved key leadership reappointments.",
            "Sentiment": "positive",
            "PublishDate": 1768568460463,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Healthcare Q3FY26 Revenue Jumps 31% to ₹16,122 Cr",
            "Summary": "Bajaj Healthcare reported strong Q3FY26 results with revenue rising 31% YoY to ₹16,122.27 crores. Net profit from continuing operations reached ₹1,610.09 crores, up 7.6% YoY. Board approved key leadership reappointments.",
            "Sentiment": "positive",
            "PublishDate": 1768567959898,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Healthcare Appoints New Independent Director",
            "Summary": "Bajaj Healthcare Limited has appointed Mr. Umeshkumar Laxmidas Bhavsar as Additional Director (Non-Executive Independent Director) for a five-year term effective January 13, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768309063397,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Healthcare Appoints Independent Director",
            "Summary": "Bajaj Healthcare Limited has appointed Mrs. Purnima Dhanraj Amin as Additional Director (Non-Executive Independent Director) for a five-year term from January 05, 2026 to January 04, 2031, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1767611898698,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Healthcare Gets CDSCO Nod for Drug Trial",
            "Summary": "Bajaj Healthcare Limited receives regulatory approval from Central Drugs Standard Control Organisation to conduct clinical trials and bioequivalence study for Suvorexant tablets on December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767190488458,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Healthcare Promoter Acquires Additional Shares",
            "Summary": "Anil Champala Jain, Managing Director and promoter group member of Bajaj Healthcare, acquired 2,000 equity shares through open market purchase on December 10, 2025, increasing his total shareholding.",
            "Sentiment": "neutral",
            "PublishDate": 1765607728550,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Healthcare Shares Investor Presentation for Analyst Meeting",
            "Summary": "Bajaj Healthcare Limited submitted an investor presentation to stock exchanges for its upcoming analyst/institutional investor meeting scheduled for December 08-09, 2025. The presentation covers the company's operations spanning API manufacturing, formulations, alkaloid processing, and CDMO business across multiple facilities with presence in 60+ countries.",
            "Sentiment": "neutral",
            "PublishDate": 1765162111062,
            "Source": "stock"
        },
        {
            "Title": "Gujarat High Court Quashes GST Demand Order Against Bajaj Healthcare",
            "Summary": "The Gujarat High Court quashed a GST demand order that was passed against Bajaj Healthcare by Joint Commissioner, Vadodara-II on October 29, 2024. The company successfully challenged the demand order through a writ petition, with the court ruling in their favor on December 6, 2025, resulting in no financial impact on the company's operations.",
            "Sentiment": "positive",
            "PublishDate": 1765028089130,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Healthcare Appoints Shreekumar Shankarnarayan Nair as Chief Operating Officer",
            "Summary": "Bajaj Healthcare has approved the appointment of Shreekumar Shankarnarayan Nair as Chief Operating Officer. The new COO brings over 40 years of pharmaceutical industry leadership experience from senior roles at Alembic and Glenmark.",
            "Sentiment": "positive",
            "PublishDate": 1764288451742,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bajaj Healthcare Appoints Former TRAI Chairman as Independent Director",
            "Summary": "Bajaj Healthcare Limited appointed Mr. Parsotambhai Devsibhai Vaghela, a retired IAS officer and former Chairman of TRAI, as Additional Non-Executive Independent Director for a five-year term from November 21, 2025 to November 20, 2030. The appointment is subject to shareholder approval and strengthens the company's board with regulatory and public administration expertise.",
            "Sentiment": "positive",
            "PublishDate": 1763732260400,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bajaj Healthcare Reports Q2 FY26 Results with Revenue of ₹1,470 Crores",
            "Summary": "Bajaj Healthcare Limited announced its quarterly results for the quarter and half year ended September 30, 2025. The company reported revenue from operations of ₹1,470.49 crores for the quarter, compared to ₹1,483.63 crores in the previous quarter and ₹1,300.89 crores in the same quarter last year. For the half year period, revenue reached ₹2,967.51 crores versus ₹2,053.59 crores in the previous year. The company posted a profit after tax of ₹1,110.92 crores for the quarter from total operations, with basic earnings per share of ₹3.53. The results include discontinued operations showing a loss of ₹133.94 crores for the quarter. The company operates in pharmaceuticals products including formulations and active pharmaceutical ingredients. The Board meeting was held on October 17, 2025, and the results were reviewed by statutory auditors Walker Chandiok & Co. LLP.",
            "Sentiment": "neutral",
            "PublishDate": 1760708817980,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Healthcare Receives Approval for Phase III Trials of Insomnia Drug Suvorexant",
            "Summary": "Bajaj Healthcare received approval from CDSCO's Subject Expert Committee to conduct Phase III clinical trials of Suvorexant Tablets in India for treating insomnia in adults. The company is the first in India to secure regulatory clearance for this drug, which will be tested in tablet strengths of 5 mg, 10 mg, 15 mg, and 20 mg. The trials will assess efficacy, safety, and tolerability before regulatory submission. Upon successful completion, Bajaj Healthcare plans to seek marketing authorization and move toward commercial launch. Managing Director Anil Jain expressed confidence in the company's R&D infrastructure and manufacturing capabilities to deliver CNS solutions. Bajaj Healthcare shares closed at ₹482.60, up 0.62%.",
            "Sentiment": "positive",
            "PublishDate": 1759583163846,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Healthcare Sets Record Date for Final Dividend Payment",
            "Summary": "Bajaj Healthcare Limited has fixed September 19, 2025 as the record date to determine shareholder eligibility for final dividend payment for FY 2024-25. The company proposes a final dividend of ₹1 per equity share (20%) subject to approval at the Annual General Meeting. The company's paid-up capital stands at ₹15,79,16,260. Shareholders holding equity shares on the record date will be eligible for the dividend payment if approved by shareholders at the meeting.",
            "Sentiment": "positive",
            "PublishDate": 1757591072693,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Healthcare Sets Record Date for Final Dividend Payment",
            "Summary": "Bajaj Healthcare Limited has set September 19, 2025 as the record date for determining shareholder eligibility for final dividend payment. The company proposes a final dividend of ₹1 per equity share (20%) for FY 2024-25, subject to shareholder approval at the upcoming Annual General Meeting. The company's paid-up capital stands at ₹15.79 crore. Shareholders holding equity shares on the record date will be eligible for the dividend payment if approved.",
            "Sentiment": "positive",
            "PublishDate": 1757396893968,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Healthcare Appoints Sandeep Shah as Additional Non-Executive Director",
            "Summary": "Bajaj Healthcare Limited appointed Mr. Sandeep Shah as an Additional Director in the Non-Executive Non-Independent category effective August 18, 2025. The appointment was approved by the board through a resolution passed by circulation, based on the recommendation of the Nomination & Remuneration Committee, and is subject to shareholder approval. Mr. Shah is a Commerce graduate with over 23 years of experience in Registrar and Share Transfer services, having worked with organizations including Karvy Consultants Private Limited and Par Computer Sciences (International) Limited. He also has more than 16 years of experience with a PCS firm handling Company Secretarial work. Mr. Shah confirmed he has not been debarred from holding directorship by SEBI or other authorities, and he is not related to any existing directors of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1755514200944,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bajaj Healthcare Appoints Gopalakrishnan Kesavan as Independent Director for Five-Year Term",
            "Summary": "Bajaj Healthcare Limited appointed Mr. Gopalakrishnan Kesavan as an Additional Director in the Non-Executive Independent Director category for a five-year term from August 18, 2025 to August 17, 2030. The appointment was approved by the Board of Directors based on the Nomination & Remuneration Committee's recommendation and is subject to shareholder approval. Kesavan holds a B.Sc. in Biology and Chemistry from Kerala University and a Diploma in Management Studies from Mumbai University. He has extensive pharmaceutical industry experience, having worked at Johnson & Johnson, Glenmark Pharmaceuticals, Concept Pharmaceuticals, and DWD Pharmaceuticals in various marketing and sales leadership roles. He also founded Nithyasha Healthcare, a Mumbai-based pharma marketing company that was later acquired. Kesavan confirmed he meets independence criteria under the Companies Act, 2013 and has not been debarred from holding director positions. He is not related to any existing directors of the company.",
            "Sentiment": "positive",
            "PublishDate": 1755513393895,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bajaj Healthcare Projects Strong FY26 Growth Driven by Export API Surge and EU Approvals",
            "Summary": "Bajaj Healthcare expects strong growth in FY26 following a 68% increase in export API business. The company's growth strategy includes expanded CDMO operations and new EU approvals. The company is focusing on value-added pipeline development through backward integration and advancing regulatory progress in CNS and nutraceuticals segments.",
            "Sentiment": "positive",
            "PublishDate": 1753723269082,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Healthcare Reports 66% Jump in Q1 Net Profit Despite Margin Decline",
            "Summary": "Bajaj Healthcare reported quarterly results showing net profit increased to 118 million rupees from 71 million rupees year-over-year, representing a 66% growth. Revenue rose to 1.48 billion rupees from 1.32 billion rupees in the same period last year. However, EBITDA remained flat at 245 million rupees compared to the previous year, while EBITDA margin compressed to 16.47% from 18.53% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1753708183642,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Healthcare Board Approves Quarterly Financial Results",
            "Summary": "Bajaj Healthcare Limited's Board of Directors approved the unaudited standalone financial results for the quarter ended June 30, 2025, along with the Limited Review Report from statutory auditors Walker Chandiok & Co. LLP. The board meeting was held on July 28, 2025, commencing at 4:40 p.m. and concluding at 5:18 p.m. The company has informed both the National Stock Exchange of India Limited and BSE Limited about the outcome of the board meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1753708035046,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Healthcare Reports Q4 Profit and Recommends Dividend",
            "Summary": "Bajaj Healthcare reported a net profit of 111.8 million rupees in Q4, compared to a loss of 299.2 million rupees in the same quarter last year. The company's revenue increased to 1.54 billion rupees from 1.34 billion rupees year-over-year. Compared to the previous quarter, the profit was 117.2 million rupees. The company has recommended a final dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748304293000,
            "Source": "default"
        },
        {
            "Title": "Bajaj Healthcare Reports Q4 Results and Announces Dividend",
            "Summary": "Bajaj Healthcare announced its Q4 financial results and dividend. The company's Q4 revenue increased to 1.54 billion rupees from 1.34 billion rupees year-over-year. Q4 EBITDA decreased to 117.6 million rupees from 160.3 million rupees year-over-year, with EBITDA margin falling to 7.61% from 11.97%. The company reported a Q4 net profit of 111.8 million rupees, compared to a loss of 299.2 million rupees in the same quarter last year. Sequentially, profit increased from 117.2 million rupees in the previous quarter. The company also recommended a final dividend of 1 rupee per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1748270882000,
            "Source": "result"
        },
        {
            "Title": "Bajaj Healthcare Appoints Rohan Parekh as Chief Financial Officer",
            "Summary": "Bajaj Healthcare has approved the appointment of Rohan Parekh as the company's new Chief Financial Officer. This decision represents a significant change in the company's financial leadership.",
            "Sentiment": "neutral",
            "PublishDate": 1744287725000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bajaj Healthcare Acquires Genrx Pharmvtm and Considers Bonus Share Issue",
            "Summary": "Bajaj Healthcare has expanded its manufacturing capabilities by acquiring Genrx Pharmvtm for ₹10.85 crore in cash, gaining 100% control of the target entity. The company's board is scheduled to meet on April 16 to consider a proposal for issuing bonus shares.",
            "Sentiment": "positive",
            "PublishDate": 1744071095000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Healthcare Acquires Genrx Pharmaceuticals for ₹10.85 Crore",
            "Summary": "Bajaj Healthcare has expanded its manufacturing capabilities by acquiring Genrx Pharmaceuticals. The acquisition is valued at ₹10.85 crore and will be paid in cash. This transaction gives Bajaj Healthcare 100% control over Genrx Pharmaceuticals, strengthening its position in the pharmaceutical industry.",
            "Sentiment": "positive",
            "PublishDate": 1744028297000,
            "Source": "corporate_action"
        },
        {
            "Title": "CFO Resignation at Bajaj Healthcare",
            "Summary": "Bajaj Healthcare has announced that Dayashankar Patel has resigned from his position as Chief Financial Officer (CFO) of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1743639187000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bajaj Healthcare CFO Dayashankar Patel Resigns",
            "Summary": "Bajaj Healthcare Limited has announced that Dayashankar Patel has resigned from his position as Chief Financial Officer (CFO) of the company. No further details about the reason for resignation or a potential successor were provided in the brief statement.",
            "Sentiment": "neutral",
            "PublishDate": 1743595568000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bajaj Healthcare Receives Approval for Phase III Clinical Trials of Cenobamate Tablets",
            "Summary": "Bajaj Healthcare has obtained approval from the Subject Expert Committee (SEC) of the Central Drugs Standard Control Organisation (CDSCO) to conduct Phase III clinical trials for Cenobamate tablets. This marks a significant step forward in the company's drug development process for this particular medication.",
            "Sentiment": "positive",
            "PublishDate": 1742365636000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Healthcare Reports Significant Profit Growth in Q3",
            "Summary": "Bajaj Healthcare has reported a substantial increase in its Q3 net profit from continuing operations, rising to 150 million rupees compared to 55 million rupees in the same quarter last year. This represents a year-over-year growth of 172.7%. The company also saw an improvement from the previous quarter, where the profit was 83 million rupees. Revenue for Q3 increased to 1.23 billion rupees from 1.1 billion rupees in the previous year, showing a growth of 11.8%.",
            "Sentiment": "positive",
            "PublishDate": 1739320478000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Healthcare: Swings to Profit in Q3, Revenue Up 13%",
            "Summary": "Bajaj Healthcare reported a net profit of ₹11.7 crore in Q3 FY25, compared to a loss of ₹2.2 crore last year. Revenue increased by 13.1% to ₹122.8 crore. EBITDA rose 10.7% to ₹21.7 crore, with a margin of 17.7%. Despite positive results, shares ended 4.47% lower at ₹595.60 on BSE.",
            "Sentiment": "positive",
            "PublishDate": 1739278874000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Healthcare Reports Q3 EBITDA Growth",
            "Summary": "Bajaj Healthcare announced its Q3 financial results. The company's EBITDA increased to 216 million rupees from 196 million rupees year-over-year. However, the EBITDA margin slightly decreased to 17.62% from 18.01% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739278460000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Healthcare Receives DCGI Approval for Pimavanserin Manufacturing",
            "Summary": "Bajaj Healthcare has obtained approval from the Drug Controller General of India (DCGI) to manufacture both the Active Pharmaceutical Ingredient (API) and drug formulation of Pimavanserin, a 34 mg capsule. This approval allows the company to produce both the raw material and the finished pharmaceutical product.",
            "Sentiment": "positive",
            "PublishDate": 1738208523000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Healthcare Secures Contract for Magnesium L Threonate in India",
            "Summary": "Bajaj Healthcare has obtained a new contract for the manufacturing, marketing, and selling of Magnesium L Threonate (Magtein®️) in the Indian market. This development expands the company's product portfolio and potentially strengthens its position in the pharmaceutical sector.",
            "Sentiment": "positive",
            "PublishDate": 1737073190000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Healthcare Secures Contract for Magnesium L Threonate in India",
            "Summary": "Bajaj Healthcare has obtained a new contract for the manufacturing, marketing, and selling of Magnesium L Threonate (MAGTEIN®) in the Indian market. This development expands the company's product portfolio and potentially strengthens its position in the pharmaceutical sector.",
            "Sentiment": "positive",
            "PublishDate": 1737035172000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Healthcare: Secures New CDMO Contracts, Stock Hits 52-Week High",
            "Summary": "Bajaj Healthcare has secured new CDMO contracts with UK and EU-based companies for 15 additional APIs, following a similar deal in February 2024. The company's stock hit a 52-week high of ₹466.30 on the BSE. The new pipeline includes off-patent generic APIs and patented molecules. Bajaj Healthcare has also received TGA approval, enabling CDMO deals in Australia, New Zealand, and South Africa.",
            "Sentiment": "positive",
            "PublishDate": 1733823343000,
            "Source": "order&deals"
        },
        {
            "Title": "Bajaj Healthcare Secures CDMO Contracts for 15 New APIs with UK/EU Companies",
            "Summary": "Bajaj Healthcare has entered into Contract Development and Manufacturing Organization (CDMO) agreements with companies based in the UK and EU. These contracts cover 15 new Active Pharmaceutical Ingredients (APIs), including both off-patent generic APIs and APIs still under patent protection.",
            "Sentiment": "positive",
            "PublishDate": 1733788646000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Healthcare Secures CDMO Contracts for 15 New APIs",
            "Summary": "Bajaj Healthcare has entered into Contract Development and Manufacturing Organization (CDMO) agreements with companies based in the UK and EU. The contracts cover 15 new Active Pharmaceutical Ingredients (APIs), including a mix of off-patent generic APIs and APIs still under patent protection. This move signifies an expansion of Bajaj Healthcare's product portfolio and potential growth in its international business.",
            "Sentiment": "positive",
            "PublishDate": 1733745173000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Healthcare's Vadodara API Manufacturing Site Receives TGA Australia Approval",
            "Summary": "Bajaj Healthcare's API manufacturing facility in Vadodara has received approval from the Therapeutic Goods Administration (TGA) of Australia. The company notes that this site has already been approved by the US FDA and the European Union. Bajaj Healthcare considers this approval a significant milestone in their goal to become a global supplier of Active Pharmaceutical Ingredients (APIs).",
            "Sentiment": "positive",
            "PublishDate": 1733702914000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Healthcare Achieves Major Milestone in Global API Supply Vision",
            "Summary": "Bajaj Healthcare has announced a significant achievement for one of its sites, marking a major milestone in the company's goal to become a global supplier of Active Pharmaceutical Ingredients (APIs). This development is seen as an important step in expanding the company's presence in the international pharmaceutical market.",
            "Sentiment": "positive",
            "PublishDate": 1733487318000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Healthcare's Vadodara API Site Receives TGA Australia Approval",
            "Summary": "Bajaj Healthcare's Active Pharmaceutical Ingredient (API) manufacturing site in Vadodara has received approval from the Therapeutic Goods Administration (TGA) of Australia. The company noted that this site had previously obtained approvals from the U.S. Food and Drug Administration (USFDA) and the European Union (EU).",
            "Sentiment": "positive",
            "PublishDate": 1733487279000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Healthcare Reports Q2 EBITDA Growth",
            "Summary": "Bajaj Healthcare announced its Q2 financial results. The company's EBITDA increased to 245 million rupees from 189 million rupees year-over-year. However, the EBITDA margin slightly decreased to 18.43% from 18.71% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731603354000,
            "Source": "result"
        },
        {
            "Title": "Bajaj Healthcare Reports Profit in Q2 FY2024",
            "Summary": "Bajaj Healthcare has reported a net profit of 95 million rupees in Q2 FY2024, compared to a loss of 35 million rupees in the same quarter last year. The company's revenue increased to 1.3 billion rupees from 1.02 billion rupees year-over-year. Sequentially, the net profit improved from 71 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731603270000,
            "Source": "result"
        }
    ]
}