{
    "Symbol": "BAJAJFINSV",
    "ISIN": "INE918I01026",
    "News": [
        {
            "Title": "Bajaj Finserv Reports January 2026 Insurance Business Update",
            "Summary": "Bajaj General Insurance achieves Rs 1,821.05 crore gross premium in January 2026, while Bajaj Life Insurance reports Rs 1,190.97 crore new business premium for the month.",
            "Sentiment": "positive",
            "PublishDate": 1770471190472,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Finserv Q3 Net Profit Flat at ₹22.3B",
            "Summary": "Bajaj Finserv reports consolidated net profit of ₹22.3 billion for Q3, unchanged from previous year, falling short of analyst estimates of ₹24 billion.",
            "Sentiment": "neutral",
            "PublishDate": 1770191347759,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Finserv Block Trade Worth Rs. 76.79 Crores",
            "Summary": "Bajaj Finserv executed a significant block trade on NSE involving 400,816 shares at Rs. 1915.90 per share, totaling Rs. 76.79 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1769502405564,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Finserv Q3FY26 Results Call on Feb 5",
            "Summary": "Bajaj Finserv has scheduled a conference call for February 5, 2026, at 10:00 AM IST to discuss Q3FY26 financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769168776443,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Finserv Completes BFDL Acquisition",
            "Summary": "Bajaj Finserv acquired remaining 50% stake in BFDL from Allianz SE for ₹12.50 crores, gaining full ownership and terminating joint venture agreement effective January 16, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768568917839,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Finserv Completes ₹21,390 Cr Insurance Deal",
            "Summary": "Bajaj Finserv acquired Allianz's 23% stake in insurance subsidiaries for ₹21,390 crores, ending 24-year JV. Group ownership rises to 97% in largest Indian insurance sector deal.",
            "Sentiment": "positive",
            "PublishDate": 1767944500217,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Finserv completes Allianz stake acquisition",
            "Summary": "Bajaj Finserv and promoter group acquire 97% stake in insurance JVs from Allianz SE, ending two-decade partnership. Transaction valued at specific share prices with buyback planned for remaining 3%.",
            "Sentiment": "positive",
            "PublishDate": 1767932741573,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Group Completes ₹21,390 Cr Allianz Buyout",
            "Summary": "Bajaj Group successfully completes acquisition of 23% stake in insurance companies from Allianz SE for ₹21,390.00 crores, marking a significant consolidation move in the insurance sector.",
            "Sentiment": "positive",
            "PublishDate": 1767878916634,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Finserv Board Meet Set for Feb 4 for Q3 Results",
            "Summary": "Bajaj Finserv Limited has scheduled its board meeting for February 4, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed from January 1-February 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767782552878,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Finserv Block Trade Worth ₹17.05 Crores",
            "Summary": "Bajaj Finserv witnessed a significant NSE block trade involving 85,785 shares valued at ₹17.05 crores, executed at ₹1,988.00 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767076185693,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Finserv Reports Insurance Subsidiaries' Premium Collection Data for November 2025",
            "Summary": "Bajaj Finserv disclosed premium collection figures for its insurance subsidiaries, with Bajaj General Insurance reporting Rs 3,999.38 crore gross direct premium for November 2025 and Rs 17,463.85 crore up to November 2025. Bajaj Life Insurance recorded total new business premium of Rs 1,086.57 crore for November 2025 and Rs 8,549.14 crore for the April-November 2025 period across individual and group segments.",
            "Sentiment": "neutral",
            "PublishDate": 1765204003428,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Finserv Reports 19% Growth in H1 FY26 PAT, Completes Insurance Company Name Changes",
            "Summary": "Bajaj Finserv achieved consolidated revenue of ₹72,854 crore (12% growth) and profit after tax of ₹5,033 crore (19% growth) for H1 FY26, with strong performance across finance and insurance subsidiaries. The company completed regulatory approvals for acquiring Allianz's 26% stake and renamed its insurance subsidiaries to Bajaj General Insurance Ltd. and Bajaj Life Insurance Ltd., moving toward 100% Bajaj ownership.",
            "Sentiment": "positive",
            "PublishDate": 1763475529806,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Finserv Targets Health Unit Breakeven by FY28, Aims for 10% Term Protection Market Share",
            "Summary": "Bajaj Finserv expects its health business unit to reach breakeven by FY28. The company plans to reduce GST input tax credit effects for Bajaj Life Insurance over the next two quarters. Bajaj Finserv aims to capture 10% market share in the term protection business within 2-3 years. The company did not provide specific margin guidance for Bajaj Life Insurance beyond current improvements related to GST impact.",
            "Sentiment": "positive",
            "PublishDate": 1762918697511,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Finserv Stock Drops 6% Despite 8% Profit Growth on Lending Arm's Cautious Outlook",
            "Summary": "Bajaj Finserv reported consolidated net profit of ₹2,244.10 crore for the second quarter, an 8% increase from ₹2,087 crore in the same period last year. Despite the profit growth, the stock fell over 6% to ₹1,992.9 due to concerns about its lending arm Bajaj Finance. Bajaj Finance posted 22% year-on-year profit growth to ₹4,876 crore but moderated its growth forecast for FY26 by about 2 percentage points from earlier projections of 24-25%, citing elevated credit costs. The stock dropped 7% to ₹1,009.1. Both companies were among the biggest NSE losers, falling over 6% each while the broader market gained 0.5%. Bajaj Allianz General Insurance showed net profit growth of 5% to ₹517 crore with gross written premium rising 9% to ₹6,413 crore, though underwriting losses widened to ₹92 crore from ₹48 crore due to higher acquisition costs.",
            "Sentiment": "negative",
            "PublishDate": 1762908242604,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Finserv Insurance Units Report Combined Premiums of 30.45 Billion Rupees in October",
            "Summary": "Bajaj General Insurance reported gross premium collections of 19.10 billion rupees in October. Bajaj Life Insurance recorded total premium of 11.35 billion rupees during the same period. Both companies are part of Bajaj Finserv.",
            "Sentiment": "neutral",
            "PublishDate": 1762866601834,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Finserv Reports Q2 Net Profit Growth to 22B Rupees, Revenue Rises to 374B Rupees",
            "Summary": "Bajaj Finserv reported quarterly consolidated net profit of 22 billion rupees compared to 21 billion rupees in the same period last year. The company's revenue increased to 374 billion rupees from 337 billion rupees year-over-year. Additionally, Bajaj Life, the company's life insurance subsidiary, recorded a 50% increase in new business value.",
            "Sentiment": "positive",
            "PublishDate": 1762849439390,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Finserv Schedules Conference Call for Q2 FY26 Financial Results",
            "Summary": "Bajaj Finserv Limited will hold a conference call for analysts and institutional investors on Tuesday, November 11, 2025, at 5:00 p.m. IST to discuss the company's financial results for the quarter and half year ended September 30, 2025. The call is being organized by JM Financial Institutional Securities Limited and will feature key executives including S Sreenivasan (President-Insurance and Special Projects), Ramandeep Singh Sahni (CFO), and managing directors and CEOs from various Bajaj subsidiaries including Bajaj General Insurance, Bajaj Life Insurance, Bajaj Finserv Direct, Bajaj Finserv Health, and Bajaj Finserv Asset Management. Multiple dial-in numbers are provided for different regions including India, USA, UK, Singapore, and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1762206279234,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Finserv Reports September 2025 Insurance Subsidiaries Performance Data",
            "Summary": "Bajaj Finserv Limited disclosed the monthly business performance of its unlisted insurance subsidiaries for September 2025. Bajaj General Insurance Limited reported gross direct premium underwritten of Rs. 2,218.77 crore for September 2025 and Rs. 11,554.35 crore up to September 2025. Bajaj Life Insurance Limited recorded total new business of Rs. 1,374.58 crore for September 2025 and Rs. 6,327.17 crore for the April-September 2025 period. The life insurance new business included individual single premium of Rs. 65.73 crore, individual non-single premium of Rs. 694.11 crore, group single premium of Rs. 596.68 crore, and group yearly renewable premium of Rs. 18.06 crore for September 2025. The information was submitted to IRDAI and respective insurance councils, with the data being provisional and subject to limited review by statutory auditors.",
            "Sentiment": "neutral",
            "PublishDate": 1760172057237,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Finserv Rebrands Insurance Units After Acquiring Full Ownership from Allianz",
            "Summary": "Bajaj Finserv announced the rebranding of its insurance businesses to Bajaj General Insurance and Bajaj Life Insurance, dropping the Allianz name. The rebranding follows the execution of a Share Purchase Agreement to acquire Allianz SE's 26% stake in the joint ventures, increasing Bajaj Group's ownership to 100% from 74%. The company launched a new campaign '100% Bajaj. Made in India. Made for India. Made by India' and received all regulatory approvals from the Registrar of Companies, Competition Commission of India, and Insurance Regulatory Development Authority of India. The share acquisition is expected to complete in the coming months, making both insurance entities wholly owned by Bajaj Group. Upon completion of at least 6.1% acquisition, the joint venture agreements with Allianz will terminate and Allianz will be reclassified from Promoter to Investor. Bajaj Finserv reported consolidated revenue of over ₹1,33,822 crore for FY2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1759864135422,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Allianz General Insurance Reports 31.4% Growth in September Premiums",
            "Summary": "Bajaj Allianz General Insurance reported premiums of Rs 22.19 billion in September, marking a 31.4% increase compared to the same period in the previous year. The growth demonstrates strong performance for the insurance subsidiary of Bajaj Finserv.",
            "Sentiment": "positive",
            "PublishDate": 1759829717563,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Finserv Block Trade Worth Rs. 20.06 Crores Executed on NSE",
            "Summary": "Bajaj Finserv Ltd. saw a block trade executed on the National Stock Exchange involving approximately 100,280 shares at a price of Rs. 2000.70 per share, totaling Rs. 20.06 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1759127944460,
            "Source": "order&deals"
        },
        {
            "Title": "Bajaj Finserv Reports August 2025 Insurance Performance Metrics",
            "Summary": "Bajaj Finserv reported its August 2025 performance with gross direct premiums of Rs. 2,063 crore for general insurance and total new business premiums of Rs. 1,484.88 crore for life insurance.",
            "Sentiment": "neutral",
            "PublishDate": 1757511041886,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Finserv Establishes New Subsidiary for Alternative Investment Business",
            "Summary": "Bajaj Finserv has incorporated a wholly owned subsidiary named 'Bajaj Alternate Investment Management Ltd.' to focus on alternative investment business operations.",
            "Sentiment": "positive",
            "PublishDate": 1756484686516,
            "Source": "stock"
        },
        {
            "Title": "AHPI Urges Bajaj Allianz General to Reinstate Delisted Hospitals Before Withdrawing Advisory",
            "Summary": "The Association of Healthcare Providers India (AHPI) has urged Bajaj Allianz General Insurance to reinstate delisted hospitals before withdrawing its September 1 advisory. The request relates to hospitals that were previously removed from the insurer's network.",
            "Sentiment": "neutral",
            "PublishDate": 1756438064502,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Finserv Incorporates New US Technology Services Subsidiary",
            "Summary": "Bajaj Finserv Limited announced the incorporation of Bajaj Technology Services Inc., a new step-down subsidiary in Delaware, USA, effective August 19, 2025. The subsidiary was incorporated by Bajaj Finserv Direct Limited with an initial share capital subscription of $1,000, representing 100% ownership. The new entity will provide technology services to clients in the USA and operates in the software services industry. The incorporation received approval from the Secretary of State of Delaware, Division of Corporation, USA. The transaction does not fall under related party transactions, and promoter groups have no interest in the new entity.",
            "Sentiment": "neutral",
            "PublishDate": 1756226974576,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Finserv Incorporates Wholly Owned Subsidiary Bajaj AIF Trustee Limited",
            "Summary": "Bajaj Finserv Limited has incorporated a wholly owned subsidiary named Bajaj AIF Trustee Limited on August 25, 2025, in India. The new entity operates in the alternative investment industry and will act as a trustee for the proposed alternative investment business under Bajaj Finserv. The subsidiary was established through a cash consideration of Rs. 10 lakh for 1,00,000 equity shares with a face value of Rs. 10 each. Bajaj Finserv holds 100% equity shareholding in the new company. No governmental or regulatory approvals were required for the incorporation.",
            "Sentiment": "neutral",
            "PublishDate": 1756208149709,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Allianz Denies Cashless Service Issues Amid Potential Regulatory Investigation",
            "Summary": "Bajaj Allianz has stated that no hospital has denied cashless service to its customers. The Association of Healthcare Providers India (AHPI) may request a Competition Commission of India (CCI) investigation into alleged cartel behavior among health insurers. Bajaj Allianz has scheduled a discussion with AHPI regarding cashless treatment on August 27.",
            "Sentiment": "neutral",
            "PublishDate": 1756187457644,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Finserv Reports July 2025 Insurance Business Updates for Subsidiaries",
            "Summary": "Bajaj Finserv Limited disclosed monthly business performance data for July 2025 from its two insurance subsidiaries. Bajaj Allianz General Insurance reported gross direct premium underwritten of Rs. 2,101.80 crore for July 2025 and Rs. 7,272.40 crore up to July 2025. Bajaj Allianz Life Insurance recorded total new business of Rs. 1,151.66 crore for July 2025 and Rs. 3,467.72 crore for the April-July 2025 period. The life insurance segment breakdown included individual single premium (Rs. 71.14 crore), individual non-single premium (Rs. 580.74 crore), group single premium (Rs. 447.63 crore), and group yearly renewable premium (Rs. 52.15 crore) for July 2025. The company noted that the information is provisional and subject to limited review by statutory auditors.",
            "Sentiment": "neutral",
            "PublishDate": 1754651714487,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Finserv Outlines Growth Strategy with 2029 Vision Across Multiple Business Segments",
            "Summary": "Bajaj Finserv has outlined a multi-pronged growth strategy spanning finance, insurance, and technology ecosystems. The company has achieved highs during the fiscal year and has established a vision extending to 2029 across its various business segments.",
            "Sentiment": "positive",
            "PublishDate": 1754063379236,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Finserv Reports Strong Q1 FY2026 Performance with 30% PAT Growth",
            "Summary": "Bajaj Finserv Limited reported consolidated revenue of $4,075 million for Q1 FY2026, representing 13% growth compared to $3,618 million in Q1 FY2025. The company achieved profit after tax of $321 million, marking 30% growth from $246 million in the previous year quarter. The company's consolidated net worth increased to $8,649 million from $7,279 million year-on-year. Key subsidiaries showed mixed performance: Bajaj Allianz General Insurance reported 9% GWP growth to $598 million with combined ratio at 103.6%, while Bajaj Allianz Life Insurance saw RWRP decline 3% to $144 million but VNB growth of 39%. Bajaj Finance achieved 25% AUM growth to $50,741 million with PAT growth of 22%, though loan losses remained elevated. Bajaj Housing Finance reported 24% AUM growth to $13,841 million with 21% PAT increase. The company has received regulatory approvals from Competition Commission of India and IRDAI for acquiring 26% stake from Allianz SE in both insurance subsidiaries.",
            "Sentiment": "positive",
            "PublishDate": 1754056401057,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Finserv Reports Record Quarterly PAT of ₹2,789 Crores, Up 30% in Q1 FY26",
            "Summary": "Bajaj Finserv Limited released its Q1 FY26 earnings conference call transcript discussing financial results for the quarter ended June 30, 2025. The company achieved consolidated total income growth of 13% to ₹35,451 crores and profit after tax growth of 30% to ₹2,789 crores, marking an all-time high quarterly PAT. BAGIC reported 9% GWP growth to ₹5,202 crores with PAT up 15% to ₹660 crores and ROE at 21.4%. BALIC showed 9% GWP growth to ₹5,479 crores with PAT surging 76% to ₹171 crores and value of new business increasing 39% to ₹145 crores. The company received regulatory approvals for acquiring Allianz's 26% stake in both insurance subsidiaries, with the initial 6.1% stake acquisition required within 6 months. Bajaj Finance recorded 21% growth in net total income to ₹12,610 crores with PAT up 22% to ₹4,765 crores. Bajaj Housing Finance achieved 24% AUM growth with PAT rising 21% to ₹583 crores. The AMC business reached ₹25,011 crores AUM, up 107% year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1754045708023,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Finserv Schedules Investor Roadshow in Hong Kong and Singapore",
            "Summary": "Bajaj Finserv Limited will conduct investor meetings in Hong Kong and Singapore from August 4-6, 2025. The non-deal roadshow is organized by Nomura and will involve in-person interactions with institutional investors and funds. The Hong Kong meeting is scheduled for August 4, while Singapore meetings will take place on August 5-6. The company noted that discussions will focus on publicly available information only. The schedule confirmation was received on short notice, prompting the late intimation to stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1753976975978,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Finserv Outlines Growth Expectations Across Insurance and Finance Subsidiaries",
            "Summary": "Bajaj Finserv shared updates on its subsidiaries during a conference call. For Bajaj Allianz Life Insurance Company (BALIC), management expects growth to improve significantly in the second half, without providing specific targets. For Bajaj Allianz General Insurance Company (BAGIC), management aims to maintain a combined ratio close to 100%. For Bajaj Finance, the company expects to disburse over 50 million new loans and add 14-16 million new customers in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1753672987940,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Finserv Makes Audio Recording of Quarterly Earnings Call Available Online",
            "Summary": "Bajaj Finserv held an earnings conference call on July 25, 2025, to discuss financial results for the quarter ended June 30, 2025. The call was conducted at 6:30 p.m. IST. The company has made the audio recording of the conference call available on its website. The presentation materials were previously shared with stock exchanges on July 25, 2025. Company Secretary Uma Shende signed the communication to NSE and BSE exchanges on July 26, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753530532589,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Finserv Targets Growth Through Digital Insurance and Cross-Selling as AUM Nears ₹3 Lakh Crore",
            "Summary": "Bajaj Finserv is pursuing growth through digital insurance expansion, leveraging strong credit trends and cross-selling opportunities. The company's assets under management (AUM) is approaching ₹3 lakh crore. The group is positioned for long-term return on equity (ROE) growth across its NBFC, life insurance, and general insurance business segments.",
            "Sentiment": "positive",
            "PublishDate": 1753457933632,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Finserv Holds 18th AGM; Announces Leadership Changes at Bajaj Finance",
            "Summary": "Bajaj Finserv Limited conducted its 18th Annual General Meeting on July 25, 2025, with 374 members in attendance. Chairman and Managing Director Sanjiv Bajaj chaired the meeting held at Hotel Hyatt Regency, Pune. The company announced significant leadership changes at subsidiary Bajaj Finance Limited, where Anup Saha resigned as Managing Director effective July 21, 2025. Rajeev Jain has been re-designated as Vice Chairman and Managing Director of Bajaj Finance, taking on operating responsibilities in addition to his existing duties. The meeting also acknowledged the passing of Madhur Bajaj on April 11, 2025, who served as a non-executive director since May 2007. Five ordinary resolutions were presented for approval, including adoption of financial statements for the year ended March 31, 2025, declaration of ₹1 dividend per equity share, director re-appointment, and auditor appointments. The chairman addressed members on macro economy, investment opportunities, insurance prospects, and the company's first quarter performance for FY2026.",
            "Sentiment": "neutral",
            "PublishDate": 1753454312897,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bajaj Finserv Reports Record Quarterly Profit of ₹2,789 Crore, Up 30% Year-on-Year",
            "Summary": "Bajaj Finserv Limited reported an all-time high quarterly consolidated profit after tax of ₹2,789 crore for the quarter ended June 30, 2025, representing a 30% increase from ₹2,138 crore in the same period last year. Consolidated total income grew 13% to ₹35,451 crore. The company's major subsidiaries showed strong performance: Bajaj Finance recorded 20% growth in consolidated profit after tax to ₹4,699 crore, Bajaj Allianz General Insurance saw 15% profit growth to ₹660 crore, and Bajaj Allianz Life Insurance achieved 39% growth in net value of new business to ₹145 crore. Bajaj Finance's assets under management increased 25% to ₹4,41,450 crore, while maintaining a capital adequacy ratio of 21.96%. The company has received regulatory approvals from Competition Commission of India and Insurance Regulatory and Development Authority of India for acquiring Allianz SE's 26% stake in its insurance subsidiaries, with the acquisition timeline extending to October 2026.",
            "Sentiment": "positive",
            "PublishDate": 1753426345452,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Finserv Reports Q1 Revenue Growth to 345 Billion Rupees",
            "Summary": "Bajaj Finserv reported quarterly revenue of 345 billion rupees compared to 315 billion rupees in the same period last year, representing year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1753425754042,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Finserv Reports 31% Jump in Q1 Consolidated Net Profit to 27.9 Billion Rupees",
            "Summary": "Bajaj Finserv reported consolidated net profit of 27.9 billion rupees for Q1, representing a significant increase from 21.3 billion rupees in the same period last year. This marks a year-on-year growth of approximately 31% in the financial services company's quarterly earnings.",
            "Sentiment": "positive",
            "PublishDate": 1753425717211,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Finserv to Announce Q1 Results on July 25, Trading Window Closed",
            "Summary": "Bajaj Finserv will announce its first quarter financial results for the period ended June 30, 2025, on Friday, July 25. The Board of Directors will consider and approve unaudited standalone and consolidated financial results. The company has closed its trading window from July 1 to July 27 for designated persons and immediate relatives. An earnings call is scheduled for July 25 at 6:30 p.m. IST for analysts and institutional investors. In the previous quarter (Q4 FY25), the company reported 14% year-on-year growth in consolidated profit after tax at Rs 2,417 crore and total revenue of Rs 36,596 crore. Bajaj Finserv shares have gained 1.22% in the past five trading sessions, 3% in the past month, and 30.49% year-to-date. The stock was trading 0.86% up at Rs 2,057.20 on the NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1753263016641,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Finserv: Share Price Dips Despite Positive Outlook and Expansion Plans",
            "Summary": "Bajaj Finserv's shares fell over 1% despite positive analyst commentary and announced plans to expand customer base to 250 million in four years. JM Financial revised target price to Rs 2,250, maintaining a 'buy' rating. Insurance subsidiaries to undergo rebranding after Allianz SE's exit.",
            "Sentiment": "neutral",
            "PublishDate": 1751429723000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Finserv: Last Day to Buy Shares for Rs 1 Dividend",
            "Summary": "June 26 is the last day to purchase Bajaj Finserv shares to qualify for the announced Rs 1 per share dividend. The record date is set for June 27, and due to T+1 settlement, shares must be owned by June 26 to be eligible.",
            "Sentiment": "neutral",
            "PublishDate": 1750914270000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Finserv: Former Kotak Fund Manager Appointed as Group President for Investments",
            "Summary": "Bajaj Finserv has appointed Lakshmi Iyer as Group President – Investments, effective 1 August 2025. Iyer, with 27 years of financial services experience, previously served as CEO of investments and strategy at Kotak Alternate Asset Managers.",
            "Sentiment": "positive",
            "PublishDate": 1749543452000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bajaj Finserv Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 341,188 shares of Bajaj Finserv Ltd. was executed on the National Stock Exchange (NSE) at a price of Rs. 2014.10 per share. The total value of the transaction amounted to Rs. 68.72 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1749461226000,
            "Source": "block_details"
        },
        {
            "Title": "Bajaj Finserv: Promoters Plan Rs 4,750 Crore Stake Sale via Block Deal",
            "Summary": "Bajaj Holdings & Investment Ltd and Jamnalal Sons Private Ltd plan to sell 1.6% stake in Bajaj Finserv through a block deal valued at Rs 4,750 crore. The deal may be upsized by an additional Rs 1,078 crore. The floor price is set at Rs 1,880 per share, with Kotak Securities likely to broker the transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1749179618000,
            "Source": "block_deals"
        },
        {
            "Title": "Bajaj Finserv Promoter Entity Plans Large Block Deal",
            "Summary": "An Indian promoter entity, likely Bajaj Holdings, is planning to sell shares of Bajaj Finserv in a block deal. The sale is expected to be valued at ₹4,500 crore, with shares offered at a 2-3% discount from the current market price.",
            "Sentiment": "neutral",
            "PublishDate": 1749128079000,
            "Source": "default"
        },
        {
            "Title": "Bajaj Finserv: Promoters Plan Rs 5,800-Crore Stake Sale",
            "Summary": "Bajaj Finserv's promoter entities, Bajaj Holdings and Investments Ltd. and Jamnalal Sons Pvt., plan to sell up to 1.94% stake (3.1 crore shares) via block deals on Friday. The floor price is set at Rs 1,880 per share, a 3.3% discount to the last closing price.",
            "Sentiment": "neutral",
            "PublishDate": 1749128031000,
            "Source": "block_deals"
        },
        {
            "Title": "Bajaj Finserv: Founding Firms to Sell 1.6% Stake for $554 Million",
            "Summary": "Founding firms of Bajaj Finserv, including Jamnalal Sons and Bajaj Holdings and Investment, plan to sell at least 1.58% stake (25.3 million shares) for 47.5 billion rupees ($554 million). The floor price is set at 1,880 rupees per share, with an option to sell an additional 0.36% stake.",
            "Sentiment": "neutral",
            "PublishDate": 1749127334000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Finserv: Q4 Profit and Revenue Rise 14% YoY",
            "Summary": "Bajaj Finserv reported a 14% YoY increase in both Q4 net profit (Rs 2,417 crore) and revenue (Rs 36,595 crore). FY25 net profit rose 9% to Rs 8,872 crore, with revenue up 21% to Rs 1,33,821 crore. The company declared a dividend of Re 1 per share for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1745984545000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Finserv Reports Strong Q4 Results and Declares Dividend",
            "Summary": "Bajaj Finserv announced its Q4 financial results, showing significant year-over-year growth. The consolidated net profit increased to 24.2 billion rupees from 21.2 billion rupees in the previous year. Revenue also rose to 366 billion rupees from 320 billion rupees. The company has declared a dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1745972698000,
            "Source": "default"
        }
    ]
}