{
    "Symbol": "BAJAJHFL",
    "ISIN": "INE377Y01014",
    "News": [
        {
            "Title": "Bajaj Housing Finance Q3 FY26 Results Show Strong Growth",
            "Summary": "Bajaj Housing Finance reports 23% YoY AUM growth to Rs. 1.33 lakh crore and 21% PAT growth to Rs. 665 crore in Q3 FY26, while expanding Sambhav loans business targeting Rs. 600+ crore monthly disbursements.",
            "Sentiment": "positive",
            "PublishDate": 1770470741389,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Housing Finance Appoints New Independent Director",
            "Summary": "Bajaj Housing Finance Limited's Board approved the appointment of Shri Ajay Kumar Choudhary as Additional Director (Independent) for five years, effective 1 March 2026, subject to member approval.",
            "Sentiment": "positive",
            "PublishDate": 1770032548116,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Housing Finance Allots ₹500 Cr NCDs at 7.25%",
            "Summary": "Bajaj Housing Finance Limited successfully allotted 50,000 secured non-convertible debentures worth ₹500 crores on private placement basis with 7.25% annual coupon rate and 3-year tenure.",
            "Sentiment": "positive",
            "PublishDate": 1769061584944,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Housing Finance Gets ESG Rating of 67",
            "Summary": "Bajaj Housing Finance Limited receives an ESG rating of 67 from ESG Risk Assessments and Insights Limited. The rating was assigned independently without company engagement, based on publicly available data.",
            "Sentiment": "neutral",
            "PublishDate": 1768807206944,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Housing Finance Q3FY26 Earnings Call on Feb 2",
            "Summary": "Bajaj Housing Finance Limited announces conference call scheduled for February 2, 2026 at 6:15 PM IST to discuss Q3FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768393733142,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Housing Finance Allots ₹508.50 Cr NCDs",
            "Summary": "Bajaj Housing Finance Limited successfully allotted 50,000 secured NCDs worth ₹508.50 crores on private placement basis with 7.10% annual coupon rate and 1008-day residual tenure.",
            "Sentiment": "positive",
            "PublishDate": 1768202082112,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Housing Finance Shares Rise on Strong Q3FY26 Update",
            "Summary": "Bajaj Housing Finance shares gained 0.65% to ₹97.26 following robust Q3FY26 business update showing 31.5% disbursement growth and 23% AUM expansion to ₹1.33 lakh crore.",
            "Sentiment": "positive",
            "PublishDate": 1767440941790,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Housing Finance Presents Investor Day Presentation Outlining Growth Strategy and Performance Metrics",
            "Summary": "Bajaj Housing Finance conducted an investor/analyst group meeting in Mumbai, sharing a comprehensive presentation covering industry landscape, company overview, and strategic priorities. The presentation highlighted the company's AUM growth of 24% reaching ₹1,26,749 crores, market share expansion from 1.0% to 1.6%, and outlined medium-term guidance including 21-23% AUM growth with targets for 5% market share in incremental home loan originations.",
            "Sentiment": "positive",
            "PublishDate": 1764909841893,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Housing Finance to Sell 166.6 Million Equity Shares for Minimum Public Shareholding Compliance",
            "Summary": "Bajaj Housing Finance plans to sell 166.6 million equity shares to meet minimum public shareholding requirements. The selling period is scheduled from December 2, 2025, to February 28, 2026, affecting existing shareholders and potential investors.",
            "Sentiment": "neutral",
            "PublishDate": 1764583544017,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Housing Finance Allots Rs 504.48 Crore NCDs on Private Placement Basis",
            "Summary": "Bajaj Housing Finance Limited has allotted 50,000 secured redeemable non-convertible debentures (NCDs) with a face value of Rs 1,00,000 each, totaling Rs 504.48 crore through private placement. The NCDs carry a coupon rate of 7.10% per annum with annual interest payments starting October 16, 2025, and will mature on October 16, 2028. The debentures are proposed to be listed on the Wholesale Debt Market Segment of BSE Limited. The NCDs are secured by a first pari-passu charge on book debts and loan receivables, with security cover equivalent to 1.00 times the aggregate outstanding value of debentures. The allotment was approved by the company's Debenture Allotment Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1763021918150,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Housing Finance Reports 24% AUM Growth Despite Competitive Pressures in Q2 FY26",
            "Summary": "Bajaj Housing Finance delivered stable quarterly results with AUM growing 24% year-on-year to INR 1,26,749 crores as of September 30. PAT increased 18% with annualized ROA at 2.3% and ROE at 12.2%. Asset quality improved with GNPA at 0.26% and NNPA at 0.12%, while annualized credit cost stood at 18 bps. The company expanded to 176 locations with 220 branches. Cost of funds improved 50 bps year-on-year to 7.4%, though gross spread remained flat at 1.9%. Disbursements grew 32% to INR 15,914 crores. Management noted heightened competition from PSU banks in the prime home loan segment, with BT-out rates rising to 21-22% from 15-16% last year. The company maintained its medium-term guidance despite competitive pressures, with home loans comprising 55% of portfolio, LAP at 10%, LRD at 21%, and developer finance at 12%. Operating efficiency improved with opex to NTI at 19.6% versus 20.5% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762946339540,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Housing Finance Reports 19% Growth in Half-Year Profit, AUM Crosses ₹1.26 Lakh Crore",
            "Summary": "Bajaj Housing Finance reported its highest-ever half-yearly profit after tax of ₹1,226 crore for H1 FY26, representing 19% growth compared to ₹1,028 crore in H1 FY25. Assets under Management grew 24% to ₹1,26,749 crore as of September 30, 2025, up from ₹1,02,569 crore in the previous year. Net interest income increased 34% to ₹1,843 crore, while net total income grew 24% to ₹2,110 crore. The company maintains healthy asset quality with Gross NPA at 0.26% and Net NPA at 0.12%. Operating expenses to net total income improved to 20.3% from 20.7%. The company operates across 176 locations through 220 branches spanning 21 states and union territories. For FY26, the company has reassessed its guidance to AUM growth of 21-23%, ROA of 2.0-2.2%, and ROE of 11-12%. The company's Sambhav Home Loans business for near prime and affordable housing is performing well and currently operates across 67 urban locations and 72 tier IV/rural locations.",
            "Sentiment": "positive",
            "PublishDate": 1762803152900,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Housing Finance Reduces AUM Growth Guidance for FY26",
            "Summary": "Bajaj Housing Finance has revised its Assets Under Management (AUM) growth guidance downward to 21-23% from the previously projected 24-26% for FY26. This represents a reduction of approximately 3 percentage points from the company's earlier growth expectations.",
            "Sentiment": "negative",
            "PublishDate": 1762489546271,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Housing Finance Sets Medium-Term Financial Targets and Guidance",
            "Summary": "Bajaj Housing Finance has announced several medium-term financial targets during a conference call. The company set its Gross Non-Performing Assets (GNPA) guidance between 40-60 basis points with credit costs projected at 20-25 basis points. The housing finance company targets an operating expenses to net income ratio of 14-15% over the next 3-4 years and aims to achieve a gearing ratio of 7-7.5 times within 2-2.5 years. The company indicated that its capital raising plans for FY25 have contributed to a reduced return on equity.",
            "Sentiment": "neutral",
            "PublishDate": 1762486859465,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Housing Finance Targets 24% AUM Growth with Branch Expansion Plans",
            "Summary": "Bajaj Housing Finance has provided guidance for 24% year-over-year Assets Under Management (AUM) growth while maintaining asset quality with Gross Non-Performing Assets (GNPA) at 0.26%. The company aims to sustain a 2.3% Return on Assets (ROA) through digital onboarding initiatives, cost efficiency measures targeting operational expenses to net total income ratio below 20%, and a diversified portfolio spanning home loans, loan against property, and developer finance. The housing finance company plans to expand its branch network to 250 branches by FY27 and increase its retail book share to above 55%.",
            "Sentiment": "positive",
            "PublishDate": 1762438379074,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Housing Finance Reports Higher Quarterly Profit and Revenue",
            "Summary": "Bajaj Housing Finance reported a net profit of 6.43 billion rupees compared to 5.46 billion rupees in the same quarter last year. The company's revenue increased to 27.55 billion rupees from 24.1 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762424029612,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Housing Finance Raises ₹1,000 Crore Through Private Placement of NCDs",
            "Summary": "Bajaj Housing Finance Limited allotted 100,000 secured redeemable non-convertible debentures worth ₹1,000.0927 crore through private placement. The NCDs carry a face value of ₹100,000 each with a tenure of 837 days and offer a coupon rate of 6.95% per annum with annual interest payments. The debentures mature on January 28, 2028, with the first interest payment scheduled for January 28, 2026. The NCDs are secured by a first pari-passu charge on book debts and loan receivables equivalent to 1.00 times the aggregate outstanding value. The debentures are proposed to be listed on the Wholesale Debt Market Segment of BSE Limited under ISIN INE377Y07615.",
            "Sentiment": "neutral",
            "PublishDate": 1760337248774,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Housing Finance Reports 32% Growth in Gross Disbursements for Q2 FY26",
            "Summary": "Bajaj Housing Finance Limited reported strong quarterly performance with gross disbursements rising to ₹15,900 crore in Q2 FY26 compared to ₹12,014 crore in Q2 FY25. The company's assets under management grew 24% to ₹1,26,740 crore as of September 30, 2025, versus ₹1,02,569 crore in the previous year. AUM increased by ₹6,320 crore during the quarter. Loan assets reached ₹1,13,050 crore as of September 30, 2025, up from ₹89,878 crore a year earlier. The figures are provisional and subject to statutory auditor review.",
            "Sentiment": "positive",
            "PublishDate": 1759494184085,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Housing Finance Raises ₹1,000 Crore Through Private Placement of NCDs",
            "Summary": "Bajaj Housing Finance Limited allotted 100,000 secured redeemable non-convertible debentures worth ₹1,000.0861 crore through private placement. Each NCD has a face value of ₹100,000 with a tenure of 1,126 days, maturing on October 16, 2028. The debentures carry a coupon rate of 7.10% per annum with annual interest payments starting October 16, 2025. The NCDs are secured by a first pari-passu charge on book debts and loan receivables equivalent to 1.00 times the aggregate outstanding value of debentures. The debentures are proposed to be listed on the Wholesale Debt Market Segment of BSE Limited under ISIN INE377Y07607.",
            "Sentiment": "positive",
            "PublishDate": 1758006782553,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Housing Finance Completes Full Utilization of Rs 3,560 Crore IPO Proceeds",
            "Summary": "Bajaj Housing Finance Limited has fully utilized the net proceeds of Rs 3,560 crore from its Initial Public Offer conducted in September 2024. The monitoring agency report by CARE Ratings Limited for the quarter ended June 30, 2025, confirms that 100% of the net proceeds have been deployed according to the stated objectives. The company utilized Rs 3,499.55 crore for augmenting capital base to meet future business requirements towards onward lending, and Rs 60.45 crore for share issue expenses. The IPO had a total size of Rs 6,560 crore, comprising Rs 3,560 crore fresh issue and Rs 3,000 crore offer for sale. The company completed the utilization ahead of the March 31, 2025 timeline mentioned in the offer document, with actual completion by December 31, 2024. No deviations from the original plan were reported, and all proceeds were used as disclosed in the prospectus.",
            "Sentiment": "positive",
            "PublishDate": 1753349818244,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Housing Finance Projects 24-26% AUM Growth in Medium Term",
            "Summary": "Bajaj Housing Finance has forecasted Assets Under Management (AUM) growth of 24-26% in the medium term and 21-23% for FY26. The company anticipates Gross Non-Performing Assets (GNPA) levels of 40-60 basis points in the medium term and 35-40 basis points for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1753270503945,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Housing Finance Reports 24% AUM Growth and 21% PAT Increase in Q1 FY26",
            "Summary": "Bajaj Housing Finance Limited reported Assets Under Management (AUM) growth of 24% reaching ₹1,20,420 crore in Q1 FY26, driven by moderation in real estate market and competitive pricing pressures. Profit After Tax grew 21% to ₹583 crore with Return on Assets maintained at 2.3%. The company's asset quality remained healthy with Gross NPA at 0.30% and Net NPA at 0.13%, while annualized credit cost stood at 0.16%. Net Interest Income increased 33% to ₹887 crore. The diversified portfolio comprises 55.8% home loans, 20.4% lease rental discounting, 11.9% loan against property, and 10.5% developer finance. Cost of funds reduced by 21 basis points to 7.7% on sequential basis. The company operates across 21 states/UTs with 217 branches covering 175 locations. Management has moderated FY26 AUM growth guidance to 21-23% from medium-term target of 24-26% due to competitive market conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1753269860754,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Housing Finance Reports Slight Increase in NPAs",
            "Summary": "Bajaj Housing Finance's gross non-performing assets (NPA) increased to 0.30% from 0.28% year-over-year, while net NPAs rose to 0.13% from 0.11% year-over-year in their quarterly results. The increases represent marginal deterioration in asset quality metrics for the housing finance company.",
            "Sentiment": "negative",
            "PublishDate": 1753267174095,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Housing Finance Reports 21% Growth in Net Profit for Q1",
            "Summary": "Bajaj Housing Finance reported net profit of 5.83 billion rupees for Q1, representing a year-over-year increase from 4.83 billion rupees. The company's revenue grew to 26.2 billion rupees compared to 22 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1753265898234,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Housing Finance Plans ₹1001 Crore NCD Issuance",
            "Summary": "Bajaj Housing Finance has announced plans to raise ₹1001 crores through the issuance of Non-Convertible Debentures (NCDs). This move indicates the company's intention to secure additional funding, potentially for business expansion or refinancing existing debt.",
            "Sentiment": "neutral",
            "PublishDate": 1752131236000,
            "Source": "default"
        },
        {
            "Title": "Bajaj Housing Finance Reports Strong Q1 FY26 Growth",
            "Summary": "Bajaj Housing Finance demonstrated robust performance in Q1 FY26, with assets under management (AUM) increasing by 24% year-over-year to ₹1.20 lakh crore. Loan assets grew to ₹1.06 lakh crore from ₹85,283 crore in the previous year. The company's gross disbursements rose by 22% year-over-year, reaching ₹14,640 crore for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1751547972000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Housing Finance Reports Strong Q1 FY26 Performance",
            "Summary": "Bajaj Housing Finance has reported its financial performance for the first quarter of fiscal year 2026. The company achieved disbursements of 146.40 billion rupees during this period. Additionally, Bajaj Housing Finance's Assets Under Management (AUM) grew by 24% to reach 1.20 trillion rupees as of June 30. This growth indicates a positive trend in the company's financial operations and market position.",
            "Sentiment": "positive",
            "PublishDate": 1751546211000,
            "Source": "default"
        },
        {
            "Title": "Bajaj Housing Finance to Raise Up to ₹1005 Crore via Non-Convertible Debentures",
            "Summary": "Bajaj Housing Finance has announced plans to raise up to ₹1005 crore through the issuance of Non-Convertible Debentures (NCDs). This move indicates the company's intention to secure additional funding, potentially for business expansion or refinancing existing debt.",
            "Sentiment": "positive",
            "PublishDate": 1751356275000,
            "Source": "default"
        },
        {
            "Title": "Bajaj Housing Finance to Issue NCDs Worth ₹3,500 Crore",
            "Summary": "Bajaj Housing Finance's Board has approved the issuance of Non-Convertible Debentures (NCDs) valued at ₹3,500 crore through private placement. This decision indicates a significant financial move by the company to raise capital.",
            "Sentiment": "positive",
            "PublishDate": 1749709743000,
            "Source": "default"
        },
        {
            "Title": "Bajaj Housing Finance to Raise ₹835 Crore via NCD Issuance",
            "Summary": "Bajaj Housing Finance has announced plans to raise ₹835 crore through the issuance of Non-Convertible Debentures (NCDs). This move is likely aimed at securing funds for the company's operations or expansion.",
            "Sentiment": "neutral",
            "PublishDate": 1748246511000,
            "Source": "default"
        },
        {
            "Title": "Bajaj Housing Finance to Raise ₹1000 Crore via NCDs",
            "Summary": "Bajaj Housing Finance has announced plans to raise ₹1000 crore through the issuance of Non-Convertible Debentures (NCDs). This move is likely aimed at expanding the company's capital base or funding its lending operations.",
            "Sentiment": "positive",
            "PublishDate": 1746168170000,
            "Source": "default"
        },
        {
            "Title": "Bajaj Housing Finance: Analysts Predict Further Downside Post Q4 Results",
            "Summary": "Majority of analysts have a 'sell' recommendation on Bajaj Housing Finance after Q4 results. HSBC cut EPS estimates, citing AUM growth pressure, NIM compression, and credit cost normalization. Price targets range from ₹82 to ₹166, with most below current trading price. Q4 saw 31% NII growth and 54% net profit increase year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1745461904000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Housing Finance Reports Strong Q4 Financial Results",
            "Summary": "Bajaj Housing Finance announced its Q4 financial results, showing significant year-over-year growth. Net profit increased to 5.87 billion rupees from 3.81 billion rupees last year. Revenue rose to 25.1 billion rupees from 19.9 billion rupees. The company maintained a stable Gross Non-Performing Asset (GNPA) ratio at 0.29% quarter-over-quarter, while the Net Non-Performing Asset (NNPA) ratio improved slightly to 0.11% from 0.13% in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745453503000,
            "Source": "default"
        },
        {
            "Title": "Bajaj Housing Finance Reports Stable Q4 Asset Quality",
            "Summary": "Bajaj Housing Finance's Q4 results show stable asset quality. The Gross Non-Performing Assets (GNPA) remained unchanged at 0.29% quarter-on-quarter, while Net Non-Performing Assets (NNPA) slightly improved to 0.11% from 0.13% in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1745420879000,
            "Source": "result"
        },
        {
            "Title": "Bajaj Housing Finance Reports Strong Q4 Financial Results",
            "Summary": "Bajaj Housing Finance has announced its Q4 financial results, showing significant year-over-year growth. The company's revenue increased to 25.1 billion rupees from 19.9 billion rupees in the previous year. Net profit also saw a substantial rise, reaching 5.87 billion rupees compared to 3.81 billion rupees year-over-year and 5.48 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745410293000,
            "Source": "result"
        },
        {
            "Title": "Bajaj Housing Finance: Q4 Profit Soars 53% YoY",
            "Summary": "Bajaj Housing Finance reported a 53% year-over-year increase in net profit to ₹587 crore for Q4. Net Interest Income (NII) also grew by 24% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1745407662000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Housing Finance: Q4 Results Awaited, Focus on Core Income and Asset Quality",
            "Summary": "Bajaj Housing Finance to report Q4 results today. Gross disbursements reached ₹14,250 crore, up from ₹11,393 crore last year. AUM grew 26% to ₹1.14 lakh crore. Loan assets at ₹99,500 crore. Shareholder lock-in period ended recently. Market anticipates clarity on Net Interest Income and asset quality.",
            "Sentiment": "neutral",
            "PublishDate": 1745373084000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Housing Finance: Q4 Results Date and Earnings Call Announced",
            "Summary": "Bajaj Housing Finance will release Q4 and FY2025 results on April 23, 2025. Board meeting and earnings call scheduled for the same day. Trading window closed from April 1 to April 25, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1745232954000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Housing Finance: 64% of Outstanding Equity Now Eligible for Trading",
            "Summary": "Bajaj Housing Finance's one-year shareholder lock-in ends on April 15, making 529.1 crore shares (64% of outstanding equity) eligible for trading. The company's Q4 disbursements and loans grew by 25%, with AUM reaching ₹1.14 lakh crore. Promoters hold 88.75% stake as of Q3 FY24.",
            "Sentiment": "neutral",
            "PublishDate": 1744679257000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Housing Finance: Strong Q4 FY25 Growth with 26% AUM Increase",
            "Summary": "Bajaj Housing Finance reported Q4 FY25 gross disbursements of Rs 14,250 crore, up from Rs 11,393 crore YoY. AUM rose 26% to Rs 1,14,680 crore. Loan assets increased to Rs 99,500 crore. Shareholder lock-in period expires in April, with 64% of equity becoming eligible for trading.",
            "Sentiment": "positive",
            "PublishDate": 1743994825000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Housing Finance Reports Strong Growth in AUM and Disbursements",
            "Summary": "Bajaj Housing Finance has announced significant growth in its financial performance. The company's Assets Under Management (AUM) increased by 26% year-over-year as of March 31, 2025. Additionally, in the fourth quarter, Bajaj Housing Finance reported gross disbursements of approximately 142.50 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1743984523000,
            "Source": "result"
        },
        {
            "Title": "Bajaj Housing Finance Reports Strong Growth in Q4 FY2025",
            "Summary": "Bajaj Housing Finance has announced significant growth in its financial performance for the quarter ending March 31, 2025. The company's Assets Under Management (AUM) grew by 26% year-over-year. Additionally, Bajaj Housing Finance reported gross disbursements of approximately 142.50 billion rupees in the fourth quarter.",
            "Sentiment": "positive",
            "PublishDate": 1743780131000,
            "Source": "result"
        },
        {
            "Title": "Bajaj Housing Finance: Q4 FY25 Results Show 26% AUM Growth and Surge in Disbursements",
            "Summary": "Bajaj Housing Finance reported strong Q4 FY25 results with gross disbursements reaching ₹14,250 crore, up from ₹11,393 crore last year. AUM grew 26% to ₹1,14,680 crore, and loan assets increased to ₹99,500 crore as of March 31, 2025. The company noted these figures are provisional and subject to auditor review.",
            "Sentiment": "positive",
            "PublishDate": 1743775504000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Housing Finance: Shares Surge 10% on NSE Index Rebalancing",
            "Summary": "Bajaj Housing Finance shares jumped 10% due to inclusion in Nifty Next 50 index, with expected inflows of up to $17 million. The stock will start trading on the Nifty Junior index from March 28. April will see the end of shareholder lock-in period, with 64% of outstanding equity becoming eligible for trading.",
            "Sentiment": "positive",
            "PublishDate": 1743069761000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Housing Finance: FTSE Inclusion to Bring $50M Inflow",
            "Summary": "Bajaj Housing Finance shares will receive inflows up to $50 million on March 21 due to FTSE rebalancing. The stock is among 14 added to the FTSE India Index. On April 15, a one-year shareholder lock-in period ends, making 64% of outstanding equity eligible for trading. Analysts are divided on the stock's outlook.",
            "Sentiment": "neutral",
            "PublishDate": 1742504450000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Housing Finance: Lock-in Period Ending, CEO Transition Looms",
            "Summary": "Bajaj Housing Finance shares up 6% as April 15 lock-in period end approaches. 529 crore shares (64% of equity) will become eligible for trading. Parent company Bajaj Finance faces CEO transition as Rajeev Jain's term ends March 31. Board to decide on his future role soon.",
            "Sentiment": "neutral",
            "PublishDate": 1742362699000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Housing Finance: HSBC Cuts Price Target, Predicts Further 15% Drop",
            "Summary": "HSBC maintains 'reduce' rating on Bajaj Housing Finance, lowering price target to ₹90 from ₹110. The stock has already fallen 44% from its post-listing high. Q3 results show 25% increase in Net Interest Income and net profit. HSBC expects slower EPS growth due to pressure on AUM growth, margins, and credit costs. 50% of analysts covering the stock have a 'sell' rating.",
            "Sentiment": "negative",
            "PublishDate": 1738031437000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Housing Finance Reports Strong Q3 Financial Results",
            "Summary": "Bajaj Housing Finance has announced its financial results for the third quarter. The company's net profit increased to 5.5 billion rupees, up from 4.4 billion rupees in the same quarter last year and 5.45 billion rupees in the previous quarter. Revenue also saw significant growth, reaching 24.5 billion rupees compared to 19.46 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738023448000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Housing Finance: Q3 Profit Soars 25% to ₹548 Crore",
            "Summary": "Bajaj Housing Finance reported a 25% increase in net profit to ₹548.02 crore for Q3 FY2024-25. Net Interest Income also rose by 25% to ₹2,321.9 crore compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1737980701000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Housing Finance Reports Strong Q3 Financial Results",
            "Summary": "Bajaj Housing Finance has announced its financial results for the third quarter. The company reported a net profit of 5.5 billion rupees, showing a significant increase from 4.4 billion rupees in the same quarter last year. The quarter-on-quarter comparison also shows growth from 5.45 billion rupees. Revenue for Q3 stood at 24.5 billion rupees, up from 19.46 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1737980639000,
            "Source": "earnings"
        }
    ]
}