{
    "Symbol": "BAJAJELEC",
    "ISIN": "INE193E01025",
    "News": [
        {
            "Title": "Bajaj Electricals Q3FY26 Results & Major Announcements",
            "Summary": "Bajaj Electricals reports Q3FY26 financial results with revenue of Rs. 105,091 lakhs, announces new independent director appointment, and sells office properties for Rs. 26.53 crore aggregate consideration.",
            "Sentiment": "neutral",
            "PublishDate": 1770628726319,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Electricals grants 2,228 stock options to employees",
            "Summary": "Bajaj Electricals Limited approved grant of 2,228 stock options under Performance Stock Option Plan 2023 to 2 eligible employees on February 9, 2026, with exercise price at Rs.2/- per share.",
            "Sentiment": "neutral",
            "PublishDate": 1770613439102,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Electricals Launches New Secura Wires Line",
            "Summary": "Bajaj Electricals introduces new 'Bajaj Secura Wires' product line targeting local market with high-quality wiring solutions featuring 99.9% copper purity and advanced insulation technology.",
            "Sentiment": "positive",
            "PublishDate": 1770109457587,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Electricals Board Meet Set for Feb 9, 2026",
            "Summary": "Bajaj Electricals Limited has scheduled a board meeting on February 9, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769523587996,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Electricals Enters Wires Business Segment",
            "Summary": "Bajaj Electricals announces entry into wires business under its Lighting Solutions segment to capitalize on growing market demand and expand operations for sustainable growth.",
            "Sentiment": "positive",
            "PublishDate": 1768850930775,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Electricals Faces ₹936.38 Lakh GST Demand",
            "Summary": "Bajaj Electricals receives GST assessment order from Tamil Nadu authorities demanding ₹936.38 lakh for alleged short payment of tax liability for FY 2018-19, including disallowed input tax credits.",
            "Sentiment": "negative",
            "PublishDate": 1767201273541,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Electricals GST Appeal Rejected by Authority",
            "Summary": "Bajaj Electricals receives adverse order as appellate authority upholds ₹61.18 lakh GST demand including penalties. Company evaluating further legal options including tribunal appeal.",
            "Sentiment": "negative",
            "PublishDate": 1767077066262,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Electricals Faces ₹237.90 Lakh GST Demand",
            "Summary": "Bajaj Electricals receives GST demand order of ₹237.90 lakhs from West Bengal authorities for alleged short payment of tax liability during FY 2021-22. Company evaluating legal options including appeal.",
            "Sentiment": "negative",
            "PublishDate": 1766764830426,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Electricals Enters Solar Solutions Business",
            "Summary": "Bajaj Electricals announces entry into solar solutions as a new line of business under its Lighting Solutions segment, marking strategic expansion into renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1765971757120,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Electricals Wins GST Appeal, Penalty Reduced from Rs. 8.55 Lakh to Rs. 0.01 Lakh",
            "Summary": "Bajaj Electricals received a favorable order from GST authorities reducing a penalty from Rs. 8.55 lakh to Rs. 0.01 lakh, originally imposed due to e-way bill mismatch issues. The company is now seeking a refund of Rs. 8.54 lakh and states there is no impact on its financial operations or other activities.",
            "Sentiment": "positive",
            "PublishDate": 1764008953321,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Electricals Allots 18,301 Equity Shares Under Employee Stock Option Plans",
            "Summary": "Bajaj Electricals' Stakeholders Relationship Committee approved allotment of 18,301 equity shares of Rs. 2 each to 16 employees under ESOP 2015 and PSOP 2023 plans. Post-allotment, the company's total issued and paid-up capital stands at 11,53,88,440 equity shares amounting to Rs. 23,07,76,880.",
            "Sentiment": "neutral",
            "PublishDate": 1763982438004,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Electricals Reports Mixed Q2 FY26 Results; Lighting Solutions Delivers Strong Performance",
            "Summary": "Bajaj Electricals reported mixed results for Q2 FY26, with Consumer Products revenue declining 4% due to GST reform uncertainties, extended monsoons, and high channel inventory affecting summer products like TPW fans and air coolers. However, Lighting Solutions delivered strong performance with 9.6% revenue growth and EBIT margins of 7.9%, up from 6% year-on-year. Non-seasonal products including mixers, irons, and water heaters registered combined single-digit growth, while ceiling fans grew double-digit. The company launched switchgears in August 2025 with encouraging initial response from channel partners. CFO E.C. Prasad announced his resignation to pursue external opportunities after joining in November 2019. The Board has approved acquisition of Morphy Richards brand as part of dual brand strategy. Management remains cautiously optimistic about future quarters, citing IMD forecasts of strong winters and expects the acquisition to be value accretive from day one.",
            "Sentiment": "neutral",
            "PublishDate": 1762421860811,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Electricals Reports Mixed Q2 FY26 Results with 1% Revenue Decline",
            "Summary": "Bajaj Electricals reported revenue of INR 1,107 crores for the second quarter ended September 30, 2025, representing a 1% decline compared to the same period last year. The Consumer Products segment declined 4.1% year-on-year due to drops in fans and coolers, while the Lighting Solutions segment grew 9.6% driven by both B2C and B2B lighting. Gross margins improved by 140 basis points due to value engineering and sourcing efficiencies. The company's profit after tax decreased 23.6% to INR 10 crores. General Trade registered 5% growth mainly due to 20% growth in Consumer Lighting, while exports witnessed 28% growth. The company maintains a strong balance sheet with surplus investments of approximately INR 432 crores. During the quarter, Bajaj launched 26 new consumer products and 144 new consumer lighting products.",
            "Sentiment": "neutral",
            "PublishDate": 1761903419420,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Electricals Reports Mixed Q2 Results with CFO Resignation Announced",
            "Summary": "Bajaj Electricals reported quarterly consolidated net profit of 99 million rupees, down from 129 million rupees year-over-year. Revenue declined to 11 billion rupees from 11.2 billion rupees in the same period last year. However, EBITDA improved to 619 million rupees from 516 million rupees year-over-year, with EBITDA margin expanding to 5.6% from 4.61%. The company announced that CFO E C Prasad will resign effective January 26, 2026.",
            "Sentiment": "negative",
            "PublishDate": 1761898833019,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Electricals Grants 5,610 Stock Options to 5 Employees Under Performance Plan",
            "Summary": "Bajaj Electricals Limited's Nomination and Remuneration Committee approved the grant of 5,610 stock options under the Performance Stock Option Plan 2023 to 5 eligible employees on October 31, 2025. The options cover 5,610 fully paid-up equity shares of Rs. 2 each. The exercise price is set at the face value of Rs. 2 per equity share. The exercise period is two years from the respective vesting date. The plan complies with SEBI regulations for share-based employee benefits.",
            "Sentiment": "neutral",
            "PublishDate": 1761887482833,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Electricals Partners with TIH Foundation at IIT Bombay for Smart Lighting Solutions",
            "Summary": "Bajaj Electricals Limited has entered into a strategic collaboration with the TIH Foundation for IoT & IoE at IIT Bombay to co-develop smart lighting solutions under the 'Smart Streetlight Control' project. The partnership combines Bajaj's expertise in large-scale lighting deployments with TIH's research capabilities in electronics, network communication, and AI/ML technologies. The first phase will focus on developing AI-based lighting solutions for energy optimization, efficiency and reliability. The Memorandum of Understanding was signed at Bajaj's R&D Center with participation from senior leadership including Rajesh Naik (COO Bajaj Lighting Solutions), Anand Joshi (CTO & Head – R&D), and Kiran Shesh (CEO, TIH). The collaboration aims to advance India's Smart City vision while supporting Digital India and Make in India initiatives. Bajaj Electricals reported a turnover of INR 4,641 crores in FY 24-25 and operates through 18 branch offices, 600+ distributors, and approximately 2 lakh retail outlets across India.",
            "Sentiment": "positive",
            "PublishDate": 1760587556179,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Electricals Wins GST Appeal, Rs 60.93 Lakh Demand Dropped in Full",
            "Summary": "Bajaj Electricals Limited received a favorable Appeal Order from the GST Authority that dropped the full demand of Rs. 60.93 lakh, including a penalty of Rs. 5.54 lakh. The demand was originally issued by the Assistant Commissioner, CGST Division–I, Jaipur, Rajasthan for alleged short payment of tax. The company had previously filed an appeal against the original order in March 2024. The Joint Commissioner of CGST Division, Jaipur issued the appeal order dropping the entire demand. The company stated there is no impact on its financial operations or other activities from this resolution.",
            "Sentiment": "positive",
            "PublishDate": 1758736100482,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Electricals Board Approves INR 146 Crore Acquisition of Morphy Richards Brand",
            "Summary": "Bajaj Electricals Limited's Board of Directors approved the acquisition of the 'Morphy Richards' brand and related intellectual property rights in India, Nepal, Bhutan, Bangladesh, the Maldives, and Sri Lanka for INR 146 crore. The acquisition is from Glen Electric Limited, part of the Glen Dimplex Group, Ireland. The transaction is subject to negotiation and execution of definitive agreements between the parties and receipt of necessary statutory and regulatory approvals. The consideration amount is exclusive of any taxes or duties payable in the territory.",
            "Sentiment": "positive",
            "PublishDate": 1758633358220,
            "Source": "order&deals"
        },
        {
            "Title": "Bajaj Electricals Q1FY26 Results: Weather Disruptions Impact Seasonal Products, Lighting Solutions Achieves Record Margins",
            "Summary": "Bajaj Electricals reported mixed quarterly results with significant weather-related disruptions affecting seasonal products. The company experienced a 45% decline in coolers and double-digit decline in fans due to early and unseasonal rain in May that cut the summer season short. However, non-seasonal products showed high single-digit growth, and the Lighting Solutions vertical delivered standout performance with the highest-ever EBIT margin of 10.6% since becoming a separate vertical in 2022. The company achieved an overall EBIT of 2.5% at the company level. Bajaj Electricals announced entry into switchgear products under its Lighting Solutions vertical, targeting 10-15% contribution from this segment. The company also received in-principle approval for restructuring its loss-making Nirlep business. Management noted that brand investments increased to 4% versus approximately 3% in the previous year, and the B2B lighting segment has an order book of Rs. 210 crores. The company plans capital expenditure of Rs. 140 crores focused on new product development and is evaluating a new factory.",
            "Sentiment": "neutral",
            "PublishDate": 1755002633527,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Electricals Shareholders Approve Nirav Nayan Bajaj's Appointment as Non-Executive Director",
            "Summary": "Bajaj Electricals Limited shareholders approved the appointment of Nirav Nayan Bajaj as a Non-Executive Director at the 86th Annual General Meeting held on August 7, 2025. The appointment is effective from May 12, 2025, and Bajaj will be liable to retire by rotation. The Board of Directors had initially approved his appointment on May 12, 2025, based on recommendations from the Nomination and Remuneration Committee, subject to shareholder approval. Nirav Bajaj is a Mechanical Engineer from Brunel University with an MBA from Harvard Business School. He previously worked at Bain & Company and Roland Berger before joining Hercules Hoist Ltd. in 2014. He joined Mukand Limited in August 2019 and serves as a Board Member on several group companies including Mukand Sumi Special Steel Limited, Consolidated Swift Industries Limited, Bajaj Vitality Private Limited, Indef Manufacturing Limited and Hospet Steels Limited. The company disclosed that Nirav Bajaj is not related to any existing Directors.",
            "Sentiment": "positive",
            "PublishDate": 1754589749353,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bajaj Electricals Launches 'Switchgear' Product Range Under Lighting Solutions Segment",
            "Summary": "Bajaj Electricals launched a new product range called 'Switchgear' under its Lighting Solutions segment on August 7, 2025. The range includes Miniature Circuit Breakers (MCB), Residual Current Circuit Breakers (RCCB), Isolators, Changeover Switches and Distribution boards (DBs) under the brand name BAJAJ SECURA. The products are designed for the domestic market and target both residential and commercial segments, particularly tier 2 and tier 3 markets. The switchgear range features fast-tripping mechanism, shock-proof terminals, and silver-copper contacts for enhanced safety and reliability. According to COO Rajesh Naik, this launch represents a strategic extension of the company's lighting solutions business, building on Bajaj's 80-year legacy in the lighting industry.",
            "Sentiment": "positive",
            "PublishDate": 1754561866842,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Electricals Reports Q1 Results, Appoints Senior Management Personnel, and Explores Strategic Options for Nirlep Business",
            "Summary": "Bajaj Electricals Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported net sales of Rs 105,923 lakhs and a net profit of Rs 893 lakhs for the quarter. The Consumer Products segment generated revenue of Rs 80,700 lakhs while Lighting Solutions contributed Rs 25,759 lakhs. The Board designated Milind Korgaonkar, the existing Chief Information Officer, as Senior Management Personnel. The company approved changing its registered office from 45/47, Veer Nariman Road to Mulla House 51, Mahatma Gandhi Road, both in Mumbai. Additionally, the Board authorized a comprehensive review of the Nirlep cookware and pressure cooker business, including exploration of strategic alternatives such as discontinuation, sale, or hive-off of the business unit which operates two manufacturing units in Chhatrapati Sambhajinagar, Maharashtra.",
            "Sentiment": "neutral",
            "PublishDate": 1754553866123,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Electricals Reports Decline in Q1 Financial Performance, Plans Strategic Review of Nirlep Business",
            "Summary": "Bajaj Electricals reported weaker quarterly results with EBITDA falling to 333 million rupees from 754 million rupees year-over-year, while EBITDA margin compressed to 3.13% from 6.53%. Revenue declined to 10.6 billion rupees compared to 11.5 billion rupees in the previous year. Consolidated net profit dropped significantly to 9 million rupees from 281 million rupees year-over-year. The company announced plans to evaluate its Nirlep business and explore strategic choices for the division.",
            "Sentiment": "negative",
            "PublishDate": 1754553236414,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Electricals Faces Rs 398 Lakh GST Demand Including Penalty from West Bengal Authority",
            "Summary": "Bajaj Electricals Limited received an adverse order from the GST Authority in West Bengal directing the company to pay Rs 398 lakh, which includes a penalty of Rs 17.83 lakh. The order relates to disallowance of ITC Credit and was received on July 29, 2025. The company's management is evaluating legal options, including filing an appeal before the Tribunal against the order. The company stated there is no impact on its financial operations or other activities due to this matter.",
            "Sentiment": "negative",
            "PublishDate": 1753868494982,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Electricals Schedules Q1FY26 Earnings Call for August 7, 2025",
            "Summary": "Bajaj Electricals Limited will host an earnings call on August 7, 2025, at 4:30 PM IST to discuss its unaudited financial results for the quarter ended June 30, 2025. The call is organized by Ambit Capital Private Limited and will be moderated by Dhruv Jain from Ambit Capital's Institutional Equities division. Company representatives participating include Chairman Shekhar Bajaj, MD & CEO Sanjay Sachdeva, and CFO EC Prasad. The teleconference will be accessible through multiple dial-in numbers including domestic and international toll-free options for Singapore, Hong Kong, USA, and UK participants.",
            "Sentiment": "neutral",
            "PublishDate": 1753794618488,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Electricals: Analysts Predict Strong Growth Amid Cost Optimization",
            "Summary": "Bajaj Electricals' stock rose 24% in a month after Q4 FY25 results. The company expects double-digit operating margin in the next three years, driven by product premiumization and cost optimization. A new UAE subsidiary aims to boost exports. Analysts revised revenue CAGR to 11.5% for FY25-27. However, increased advertising expenses and EPR provisions may challenge profitability goals.",
            "Sentiment": "positive",
            "PublishDate": 1750117874000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Electricals: Q4 Profit Soars, Revenue Up 6.5%",
            "Summary": "Bajaj Electricals reported a two-fold increase in Q4 FY25 consolidated net profit to Rs 5,905 crore. Revenue rose 6.5% to Rs 1,265.47 crore. Consumer Products segment grew 8.38%. The board approved a 150% dividend of Rs 3 per share.",
            "Sentiment": "positive",
            "PublishDate": 1747042051000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Electricals Announces Fundraising and Dividend",
            "Summary": "Bajaj Electricals has announced a fundraising of Rs 500 crores through the issuance of NCDs. The company has also increased its borrowing limit from Rs 1500 crores to Rs 3000 crores. Additionally, Bajaj Electricals has declared a dividend of Rs 3 per share.",
            "Sentiment": "positive",
            "PublishDate": 1747037769000,
            "Source": "result"
        },
        {
            "Title": "Bajaj Electricals Reports Strong Q4 FY2023 Results",
            "Summary": "Bajaj Electricals announced its Q4 financial results, showing significant year-over-year improvements. The company's revenue increased to 12.7 billion rupees from 12 billion rupees. EBITDA rose to 930 million rupees from 497 million rupees, with the EBITDA margin expanding to 7.35% from 4.19%. Consolidated net profit for Q4 grew to 590 million rupees, up from 290 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747037431000,
            "Source": "result"
        },
        {
            "Title": "Bajaj Electricals to Discuss Q4 Results and Fundraising",
            "Summary": "Bajaj Electricals has announced a board meeting scheduled for May 12th. The agenda includes discussing the company's fourth-quarter results and potential fundraising plans.",
            "Sentiment": "neutral",
            "PublishDate": 1746167845000,
            "Source": "default"
        },
        {
            "Title": "Bajaj Electricals: Shares Surge on SEAK Partnership for Tunnel Lighting",
            "Summary": "Bajaj Electricals shares rose 8.05% after announcing a three-year exclusive collaboration with SEAK for tunnel lighting projects in India. The partnership aims to deliver intelligent, energy-efficient lighting solutions for infrastructure projects.",
            "Sentiment": "positive",
            "PublishDate": 1744798122000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Electricals Enters Exclusive 3-Year Collaboration with SEAK S.R.O. for Advanced Lighting Control Products",
            "Summary": "Bajaj Electricals has entered into an exclusive three-year collaboration agreement with SEAK S.R.O. to supply advanced lighting control products for tunnel projects in India. The partnership may potentially extend to other regions as well. This collaboration aims to enhance Bajaj Electricals' offerings in the specialized lighting control sector for infrastructure projects.",
            "Sentiment": "positive",
            "PublishDate": 1744794666000,
            "Source": "default"
        },
        {
            "Title": "Bajaj Electricals: Sanjay Sachdeva Appointed as New MD and CEO",
            "Summary": "Bajaj Electricals Ltd. has appointed Sanjay Sachdeva as Managing Director and CEO for a three-year term starting April 15. Sachdeva, with over 33 years of experience at Unilever, replaces Shekhar Bajaj as key managerial personnel. The company also designated Anand Joshi, the current CTO, as senior management personnel.",
            "Sentiment": "positive",
            "PublishDate": 1743162823000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bajaj Electricals Plans Manufacturing Expansion in India and UAE",
            "Summary": "Bajaj Electricals has announced plans to explore setting up a new manufacturing unit in India with a capital expenditure of 3 billion rupees. Additionally, the company intends to form a wholly-owned subsidiary in the United Arab Emirates.",
            "Sentiment": "positive",
            "PublishDate": 1742377037000,
            "Source": "corporate_action"
        },
        {
            "Title": "Appellate Authority Rules in Favor of Bajaj Electricals, Drops 110.5 Million Rupees Demand",
            "Summary": "The Appellate Authority has ruled in favor of Bajaj Electricals, resulting in the dismissal of a 110.5 million rupees demand against the company. This decision represents a positive outcome for Bajaj Electricals in a legal or regulatory matter.",
            "Sentiment": "positive",
            "PublishDate": 1741776341000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bajaj Electricals: Elevated Brand Spending Impacts Margin Growth",
            "Summary": "Bajaj Electricals is focusing on premiumizing its portfolio and launching more high-end products. However, this strategy requires continued high brand spending, which may slow margin improvement. The company faces challenges in alternate channels and potential price erosion in professional lighting, leading to lowered revenue estimates.",
            "Sentiment": "neutral",
            "PublishDate": 1738727686000,
            "Source": "normal_news"
        },
        {
            "Title": "Bajaj Electricals: Q3 Profit Dips 10.7%, Revenue Rises 5%",
            "Summary": "Bajaj Electricals reported a 10.7% decrease in Q3 consolidated net profit to Rs 33.36 crore. Revenue from operations increased by 5% to Rs 1,289.72 crore. Consumer Products segment saw 8.54% growth, while Lighting Solutions declined by 7.47%.",
            "Sentiment": "neutral",
            "PublishDate": 1738659686000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Electricals Reports Improved Q3 EBITDA and Margin",
            "Summary": "Bajaj Electricals has announced its Q3 financial results, showing significant improvement in both EBITDA and EBITDA margin. The company's EBITDA increased to 874 million rupees from 576 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 6.78% from 4.69% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738656108000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Electricals Reports 5.7% Year-on-Year Revenue Growth in Q3",
            "Summary": "Bajaj Electricals has announced its financial results for the third quarter, reporting revenue of 12.9 billion rupees. This represents a 5.7% increase compared to the same period last year when the company recorded revenue of 12.2 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738655806000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Electricals Reports Q3 Consolidated Net Profit of 334 Million Rupees",
            "Summary": "Bajaj Electricals has announced its financial results for the third quarter. The company reported a consolidated net profit of 334 million rupees, which represents a decrease from the 374 million rupees reported in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1738655779000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Electricals Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Bajaj Electricals has reported a decrease in its Q2 EBITDA, which fell to 516 million rupees from 753 million rupees in the same quarter last year. The company's EBITDA margin also declined, dropping to 4.61% from 6.76% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730966570000,
            "Source": "result"
        },
        {
            "Title": "Bajaj Electricals Reports Slight Increase in Q2 Revenue",
            "Summary": "Bajaj Electricals has announced its second quarter revenue for the current fiscal year. The company reported revenue of 11.2 billion rupees, compared to 11.1 billion rupees in the same quarter of the previous year, showing a marginal year-over-year increase.",
            "Sentiment": "neutral",
            "PublishDate": 1730966427000,
            "Source": "result"
        },
        {
            "Title": "Bajaj Electricals Reports Significant Drop in Q2 Profit",
            "Summary": "Bajaj Electricals has reported a consolidated net profit of 129 million rupees for the second quarter, marking a substantial decrease from 317 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730966398000,
            "Source": "result"
        }
    ]
}