{
    "Symbol": "BAJAJ-AUTO",
    "ISIN": "INE917I01010",
    "News": [
        {
            "Title": "Bajaj Auto Launches WEGO P9018 Electric Three-Wheeler",
            "Summary": "Bajaj Auto introduces WEGO P9018 electric three-wheeler with India's highest range of 296 km and 17.7 kWh battery, priced at Rs.4,41,247 ex-showroom pan India for enhanced last-mile mobility.",
            "Sentiment": "positive",
            "PublishDate": 1770629240199,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Auto Q3 FY26 Record Performance",
            "Summary": "Bajaj Auto delivers record quarterly performance with revenue crossing INR15,000 crores for first time, EBITDA at INR3,100+ crores and PAT exceeding INR2,500 crores, driven by strong growth across all business segments.",
            "Sentiment": "positive",
            "PublishDate": 1770378699116,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Auto Updates CFO Email ID Under Regulation 30",
            "Summary": "Bajaj Auto Limited has informed stock exchanges about the change in official email ID of Chief Financial Officer Mr. Dinesh Thapar as per SEBI Regulation 30 compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1770181955193,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Auto Block Trade Worth ₹98.50 Crores on NSE",
            "Summary": "Bajaj Auto witnessed a significant block trade on NSE involving 102,040 shares valued at ₹98.50 crores, executed at ₹9,653 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1770101403480,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Auto Block Trade Worth Rs. 29.50 Crores",
            "Summary": "Bajaj Auto witnessed a significant NSE block trade worth Rs. 29.50 crores involving approximately 30,691 shares at Rs. 9,612.50 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1770098492087,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Auto Reports Strong 25% Sales Growth in January",
            "Summary": "Bajaj Auto delivered 477,422 units in January, marking a significant 25.30% increase from 381,040 units in the previous year, surpassing analyst estimates of 437,600 units.",
            "Sentiment": "positive",
            "PublishDate": 1770090176676,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Auto Nigerian Sales at 50% of Peak Levels",
            "Summary": "Bajaj Auto's CFO reports that the company's sales in Nigeria currently remain at 50% of their highest market levels, indicating ongoing challenges in one of their key international markets.",
            "Sentiment": "neutral",
            "PublishDate": 1769777405859,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Auto Subsidiary Lists ₹500 Cr Debentures",
            "Summary": "Bajaj Auto Credit Limited, wholly owned subsidiary of Bajaj Auto, has listed ₹500 crore worth of non-convertible debentures on NSE with 8% coupon rate and 2030 maturity dates.",
            "Sentiment": "neutral",
            "PublishDate": 1769776949028,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Auto Invests ₹120M in Clean Max Godavari",
            "Summary": "Bajaj Auto approves strategic investment of up to ₹120 million in Clean Max Godavari, marking the company's expansion into renewable energy sector partnerships.",
            "Sentiment": "positive",
            "PublishDate": 1769776197051,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Auto Q3FY26: Record Revenue & Profit Growth",
            "Summary": "Bajaj Auto reported record Q3FY26 results with revenue up 19% YoY to ₹15,220.33 crore and profit after tax rising 19% to ₹2,502.81 crore, driven by strong domestic and export performance.",
            "Sentiment": "positive",
            "PublishDate": 1769772285714,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Auto Subsidiary Reports Strong Turnaround",
            "Summary": "Bajaj Mobility AG achieves EUR 1,193 million restructuring gain despite 46% revenue decline, with EBITDA improving to EUR 874 million and equity turning positive at EUR 385 million.",
            "Sentiment": "positive",
            "PublishDate": 1769669315751,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Auto Block Trade Worth ₹113.64 Crores on NSE",
            "Summary": "Bajaj Auto witnessed a significant block trade on NSE involving 121,841 shares valued at ₹113.64 crores, executed at ₹9,326.50 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768888304618,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Auto Sees ₹18.98 Cr NSE Block Trade at ₹9,420",
            "Summary": "Bajaj Auto witnessed a significant block trade on NSE worth ₹18.98 crores involving approximately 20,150 shares at ₹9,420.00 per share, indicating institutional interest in the automobile major.",
            "Sentiment": "neutral",
            "PublishDate": 1768806238131,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Auto Launches Chetak C25 E-Scooter at ₹91,399",
            "Summary": "Bajaj Auto unveils new Chetak C25 electric scooter with 113 km range and 2.5 kWh battery, targeting number one position in domestic and export markets as company holds 21% market share.",
            "Sentiment": "positive",
            "PublishDate": 1768413972181,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Auto Q3FY26 Results Call on Jan 30, 2026",
            "Summary": "Bajaj Auto Limited has scheduled a conference call for analysts and institutional investors on January 30, 2026, at 06:15 PM IST to discuss Q3 FY26 results, as per Regulation 30 compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1768384144027,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Auto Cuts 500 Jobs in Efficiency Drive",
            "Summary": "Bajaj Auto reduces workforce by 500 employees, primarily in middle management, as part of cost reduction and structural streamlining program. Company reports 46% revenue decline to EUR 1 billion.",
            "Sentiment": "negative",
            "PublishDate": 1768373451449,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Mobility AG Cuts 500 Jobs Amid 46% Revenue Drop",
            "Summary": "Bajaj Mobility AG undergoes restructuring as revenue falls 46% to over EUR 1 billion, motorcycle sales drop 28% to 209,704 units, and company implements 500 job cuts for operational efficiency.",
            "Sentiment": "negative",
            "PublishDate": 1768369316910,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Auto Breaks Triangle Pattern, Hits Fresh Highs",
            "Summary": "Bajaj Auto breaks out from triangle pattern to reach record highs in January 2026. Technical analysts suggest potential upside target above ₹10,000 levels for short-term traders in coming weeks.",
            "Sentiment": "positive",
            "PublishDate": 1768175969076,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Group Acquires 23% Stake from Allianz",
            "Summary": "Bajaj Group completes ₹21,390.00 crore acquisition of 23% stake in insurance units from Allianz SE, ending 24-year joint venture and gaining complete control of subsidiaries.",
            "Sentiment": "positive",
            "PublishDate": 1767931591263,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Group Completes ₹21,390 Cr Insurance Acquisition",
            "Summary": "Bajaj Group successfully acquired 23% stake each in Bajaj General Insurance and Bajaj Life Insurance from Allianz SE for ₹21,390 crore, increasing ownership from 74% to 97%.",
            "Sentiment": "positive",
            "PublishDate": 1767931501597,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Auto Board Meeting Set for January 30, 2026",
            "Summary": "Bajaj Auto Limited has scheduled a board meeting on January 30, 2026, to consider Q3 FY26 unaudited financial results. Trading window closed from January 1 to February 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767854856383,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Auto Sees ₹30.45 Cr NSE Block Trade",
            "Summary": "Bajaj Auto witnessed a significant block trade on NSE worth ₹30.45 crores involving approximately 31,020 shares at ₹9,816.00 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767844783897,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Auto hits 52-week high on strong December sales",
            "Summary": "Bajaj Auto shares surged 3% to ₹9,783.50 after December sales rose 14.4% YoY. Emkay upgraded to 'Buy' with ₹11,100 target, citing strong export momentum and attractive risk-reward profile.",
            "Sentiment": "positive",
            "PublishDate": 1767680253001,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Auto: Venezuela Exports Under 1% of Total",
            "Summary": "Bajaj Auto clarifies that Venezuela accounts for less than 1% of total exports despite political crisis. Company's overall exports grew 19% in April-December FY26 period.",
            "Sentiment": "neutral",
            "PublishDate": 1767578700549,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Auto shares drop 3% despite strong export growth",
            "Summary": "Bajaj Auto shares fell 3% to ₹9,311 as domestic 2-wheeler sales grew modestly by 3% in December, while exports surged 24% and total sales increased 14% to 3.69 lakh units.",
            "Sentiment": "neutral",
            "PublishDate": 1767334695392,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Auto Reports 14% Growth in December 2025 Sales",
            "Summary": "Bajaj Auto's total sales reached 3.69 lakh units in December 2025, marking 14% YoY growth. Exports surged 25% while domestic sales grew 4%, driven by strong performance in both two-wheelers and commercial vehicles.",
            "Sentiment": "positive",
            "PublishDate": 1767324822822,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Auto Reclaims Key Moving Averages Post Decline",
            "Summary": "Bajaj Auto rebounds after testing 100-day moving average, with experts suggesting potential targets above ₹9,900 in 2-4 months following recent technical recovery.",
            "Sentiment": "positive",
            "PublishDate": 1767051388548,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Auto Receives ₹17.74 Lakh GST Penalty Order",
            "Summary": "Bajaj Auto disclosed receiving a penalty order of ₹17.74 lakh from Pune tax authorities for excess input tax credit claimed in FY 2021-22. The company plans to appeal the order with no material financial impact expected.",
            "Sentiment": "negative",
            "PublishDate": 1766828599041,
            "Source": "stocks"
        },
        {
            "Title": "Auto Wrap: Kawasaki, Bajaj refresh two-wheelers",
            "Summary": "Kawasaki launched updated 2026 Ninja 650 and Versys 650 with E20-compliant engines. Bajaj Auto introduced refreshed Pulsar 150 with full-LED lighting. Renault and Mahindra teased 2026 launches.",
            "Sentiment": "neutral",
            "PublishDate": 1766822825594,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Auto Allots 2.4L Shares Under ESOP Scheme",
            "Summary": "Bajaj Auto Limited allotted 2,40,230 equity shares to its ESOP Trust on December 12, 2025, covering grants from April 2021 and April 2022 with varying exercise prices.",
            "Sentiment": "neutral",
            "PublishDate": 1765535561674,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Auto Receives Customs Order for Rs 76.10 Lakh Duty Demand on Li-ion Battery Imports",
            "Summary": "Bajaj Auto received a customs order demanding differential duty of Rs 76.10 lakh plus interest and penalty for alleged mis-classification of Li-ion battery imports, denying notification benefits. The company disputes the classification and plans to file an appeal, stating the order will not have major financial implications on operations.",
            "Sentiment": "negative",
            "PublishDate": 1765355845355,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Auto Credit Limited Redeems Rs. 490 Crores Commercial Paper",
            "Summary": "Bajaj Auto Credit Limited (BACL), a wholly owned subsidiary of Bajaj Auto Limited, has redeemed commercial paper worth Rs. 490 crores on the due date of December 5, 2025. The redemption involves 9,800 commercial paper units with ISIN NE18UV14026, completing the full repayment as scheduled.",
            "Sentiment": "neutral",
            "PublishDate": 1764956246356,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Auto Reverses Appointment of Aditya Makharia as Chief Product Officer",
            "Summary": "Bajaj Auto informed stock exchanges that Aditya Makharia will not be part of Senior Management Personnel effective from 01 January 2026, reversing their earlier announcement from 07 November 2025 regarding his appointment as Chief Product Officer. The company has updated this change in compliance with SEBI listing regulations and made the information available on their website.",
            "Sentiment": "neutral",
            "PublishDate": 1764763345308,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bajaj Auto Receives Rs 34.74 Crore Tax Demand Over Spare Parts Classification",
            "Summary": "Bajaj Auto received a tax demand of Rs 34.74 crore along with a penalty of Rs 3.47 crore from Deputy Commissioner, Rudrapur under CGST Act for alleged misclassification of spare parts supplied by the company. The company disputes the demand citing strong legal grounds based on decades of proper classification practices and plans to pursue appropriate legal remedies, stating no material impact on operations.",
            "Sentiment": "negative",
            "PublishDate": 1764658350091,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Auto Credit Issues Rs. 500 Crore Non-Convertible Debentures on Private Placement",
            "Summary": "Bajaj Auto Credit Limited, a wholly owned subsidiary of Bajaj Auto Limited, allotted 50,000 secured non-convertible debentures worth Rs. 500 crore with face value of Rs. 1 lakh each on private placement basis. The NCDs were listed on National Stock Exchange on December 1, 2025, following approval by the Debenture Issuance and Allotment Committee on November 27, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764656415570,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Auto November Sales Rise 7.5% to 4.53 Lakh Units, Beating Estimates",
            "Summary": "Bajaj Auto reported November sales of 4,53,273 units, marking a 7.5% increase from 4,21,640 units in the same month last year. The automaker's performance exceeded market estimates of 4,50,050 units, indicating stronger than expected demand for its vehicles.",
            "Sentiment": "positive",
            "PublishDate": 1764560088863,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Auto Limited Files November 2025 Sales Data with Stock Exchanges",
            "Summary": "Bajaj Auto Limited submitted its November 2025 sales figures to BSE and NSE as part of regulatory compliance requirements. The filing was made by Company Secretary Rajiv Gandhi to fulfill disclosure obligations under SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764559829510,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Auto Clarifies Recent Trading Volume Surge to BSE",
            "Summary": "Bajaj Auto responded to BSE's inquiry about significant increase in equity share trading volumes, stating no unpublished price-sensitive information exists for disclosure. The company attributed the volume movement to market-driven factors and confirmed recent press release about Riki 3-Wheeler E-Rickshaw launch on 26 November 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764322894093,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Auto Launches Riki E-Rickshaw Series to Enter Electric Three-Wheeler Segment",
            "Summary": "Bajaj Auto launched its Riki e-rickshaw series with two models - P4005 priced at INR 1,90,890 and C4005 at INR 2,00,876, featuring 149km and 164km range respectively with monocoque chassis and hydraulic brakes. The launch extends Bajaj's three-wheeler business into the rapidly growing e-rickshaw category that adds over 45,000 vehicles monthly, initially expanding to 100+ towns across UP, Bihar, MP, Chhattisgarh and Assam.",
            "Sentiment": "positive",
            "PublishDate": 1764145689017,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Auto Acquires Full Control of Pierer Bajaj AG and 74.9% Stake in KTM",
            "Summary": "Bajaj Auto has completed the purchase of 100% ownership in Pierer Bajaj AG and acquired approximately 74.9% stake in PMAG/KTM. The entities will be renamed to Bajaj Auto International Holdings AG and Bajaj Mobility AG effective November 18, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763523769053,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Auto Credit Limited Redeems Rs. 500 Crore Commercial Paper",
            "Summary": "Bajaj Auto Credit Limited (BACL), a wholly owned subsidiary of Bajaj Auto Limited, has redeemed commercial paper worth Rs. 500 crores on November 17, 2025, on its scheduled maturity date. The redemption involves 10,000 commercial paper units with ISIN INE18UV14034, completing the full repayment of the instrument originally issued in August 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763462594544,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Auto Reports Record Q2 FY26 Results with Revenue Crossing Rs 15,000 Crores",
            "Summary": "Bajaj Auto achieved multiple all-time highs in Q2 FY26 with revenue of nearly Rs 15,000 crores (14% growth), EBITDA crossing Rs 3,000 crores at 20.5% margin, and PAT at Rs 2,500 crores. The company benefited from GST rate cuts and festive demand across all business units including exports (24% volume growth), domestic motorcycles, three-wheelers, and electric vehicles contributing 18% of domestic revenue.",
            "Sentiment": "positive",
            "PublishDate": 1763112192909,
            "Source": "earnings"
        },
        {
            "Title": "EU Commission Clears Bajaj Auto's Acquisition of PIERER Mobility Control",
            "Summary": "The European Commission has decided not to initiate an in-depth investigation under the Foreign Subsidies Regulation, allowing Bajaj Auto International Holdings B.V. to proceed with acquiring control of PIERER Mobility AG. Bajaj Auto International Holdings B.V., a wholly owned subsidiary of Bajaj Auto Limited, can now acquire Pierer Industrie AG's 50.1% stake in Pierer Bajaj AG, making it the sole owner. This acquisition gives indirect control over PIERER Mobility AG, the parent company of KTM, through Pierer Bajaj AG's 74.9% holding. The call option agreement was originally entered into on May 22, 2025, with completion possible by the end of May 2026. All regulatory requirements for the takeover have now been met, and the closing of the change of control is expected in the coming weeks.",
            "Sentiment": "positive",
            "PublishDate": 1762803789518,
            "Source": "order&deals"
        },
        {
            "Title": "Bajaj Auto Targets 15-20% Export Growth and 100,000+ Quarterly Three-Wheeler Sales",
            "Summary": "Bajaj Auto expects to achieve 15-20% growth in exports and aims to sell over 100,000 three-wheelers each quarter. The company has set these targets as part of its business expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1762745275204,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Auto Forecasts 6-8% Medium-Term Growth for Motorcycle Industry",
            "Summary": "Bajaj Auto expects the motorcycle industry to grow by 6-8% in the medium term. This outlook was shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1762744118161,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Auto Reports Strong Q2 Results with 24% Jump in Net Profit",
            "Summary": "Bajaj Auto delivered quarterly results that exceeded analyst expectations across key metrics. Net profit reached 24.8 billion rupees, up from 20.05 billion rupees year-over-year, surpassing the estimated 24.5 billion rupees. Revenue grew to 149.22 billion rupees from 131.27 billion rupees, beating the forecast of 147.7 billion rupees. EBITDA increased to 30.52 billion rupees from 26.52 billion rupees, above the projected 29.9 billion rupees. EBITDA margin improved to 20.45% from 20.2%, exceeding the estimated 20.1%.",
            "Sentiment": "positive",
            "PublishDate": 1762733513983,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Auto Appoints Two Senior Management Personnel in Key Technology and Product Roles",
            "Summary": "Bajaj Auto Limited has announced two senior management appointments. Vijay Jerome has been appointed as Chief Digital Information Officer with immediate effect. Jerome brings over two decades of global technology leadership experience, having previously served as Senior Vice President at H&M Group, Vice President of IT at Pernod Ricard, and held senior technology roles at Mondelez International for 14 years. Additionally, Aditya Makharia has been appointed as Chief Product Officer, effective from January 18, 2026. Makharia has extensive experience in automotive, electronics, and manufacturing sectors, previously serving as Vice President and Country Head of India Business at Visteon Corporation and spending over 16 years at Texas Instruments in various global leadership roles. Both appointments are part of the company's senior management team.",
            "Sentiment": "positive",
            "PublishDate": 1762567980361,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bajaj Auto Plans Three New Two-Wheeler Model Launches",
            "Summary": "Bajaj Auto will launch three new two-wheeler models between December and May, according to a company executive.",
            "Sentiment": "positive",
            "PublishDate": 1762523360794,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Auto COO Credits GST Reductions for Q2 Performance Boost",
            "Summary": "Bajaj Auto's Chief Operating Officer stated that GST reductions contributed positively to the company's quarterly performance.",
            "Sentiment": "positive",
            "PublishDate": 1762521021602,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Auto Reports 53% Jump in Q2 Net Profit to Rs 2,122 Crore",
            "Summary": "Bajaj Auto reported a 53% year-on-year increase in consolidated net profit to Rs 2,122 crore compared to Rs 1,385 crore in the same quarter last year. Revenue from operations rose 19% to Rs 15,735 crore from Rs 13,247 crore, setting a new company record above Rs 15,000 crore. The company attributed the revenue growth to a richer vehicle mix and record spare parts sales. Standalone EBITDA crossed Rs 3,000 crore for the first time with margins at 20.5%, while standalone PAT reached a new high of Rs 2,480 crore, up 24% from Rs 2,005 crore. The company noted that strong performance across businesses offset disruptions from rare earth magnet constraints that affected its electric vehicle segment. On a sequential basis, consolidated PAT declined 4% from Rs 2,210 crore, while revenue increased 20% from Rs 13,133 crore.",
            "Sentiment": "positive",
            "PublishDate": 1762517511268,
            "Source": "earnings"
        }
    ]
}