{
    "Symbol": "BAJAJHIND",
    "ISIN": "INE306A01021",
    "News": [
        {
            "Title": "Bajaj Hindusthan Sugar Approves Debt Restructuring Plan",
            "Summary": "Board approves comprehensive debt restructuring under RBI framework, including conversion of Rs. 2,939.97 crores YTM into equity and CCPS, with Rs. 3,215.31 crores OCD restructuring.",
            "Sentiment": "positive",
            "PublishDate": 1770905993871,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Hindusthan Sugar Q3FY26 Results",
            "Summary": "Bajaj Hindusthan Sugar reports Q3FY26 results with standalone revenue of ₹1,368.20 crore and net profit of ₹15.06 crore, marking recovery from previous quarter losses.",
            "Sentiment": "positive",
            "PublishDate": 1770885341366,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Hindusthan Sugar Board Meet on Feb 12, 2026",
            "Summary": "Bajaj Hindusthan Sugar Limited schedules board meeting on February 12, 2026 to approve Q3 FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770124580037,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Hindusthan Sugar Reports Wider Q2 Loss Despite Flat Revenue",
            "Summary": "Bajaj Hindusthan Sugar reported Q2 revenue of 11.6 billion rupees, unchanged from the previous year. The company's consolidated net loss widened to 1.05 billion rupees compared to a loss of 750 million rupees in the same period last year. EBITDA turned negative with a loss of 539 million rupees versus a gain of 10 million rupees in the prior year quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762934563310,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Resources Acquires 6.03 Million Shares in Bajaj Hindusthan Sugar",
            "Summary": "Bajaj Resources Limited acquired 60,27,469 equity shares of Bajaj Hindusthan Sugar Limited through an inter-se transfer from Anand Engineering Limited via off-market trade. The acquisition was completed at Rs. 15.66 per share. Following this transaction, Bajaj Resources' shareholding in Bajaj Hindusthan Sugar increased from 6.42% to 6.89% of the total share capital. The shares were credited to the account on March 11, 2022. The acquisition was made under exemption provisions of SEBI regulations, and required disclosures were filed with stock exchanges on March 2, 2022.",
            "Sentiment": "neutral",
            "PublishDate": 1761886814256,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Hindusthan Sugar Reports Net Loss of Rs 168.57 Crore in Q1 FY2026",
            "Summary": "Bajaj Hindusthan Sugar Limited reported a net loss of Rs 168.57 crore for the quarter ended June 30, 2025, compared to a net loss of Rs 45.17 crore in the previous quarter. Revenue from operations declined to Rs 1,379.52 crore from Rs 1,545.78 crore in the preceding quarter. The company received Rs 630.80 crore from the buyback of shares in Lalitpur Power Generation Company Limited, which was used to pay overdue Optionally Convertible Debentures. Post this payment, the company's debt accounts with lenders have been classified as standard and regular. The company has not recognized YTM liability of Rs 180.82 crore and coupon interest of Rs 20.04 crore for the quarter, as the final resolution plan is still under discussion with lenders. The UP Excise Department has issued a demand of Rs 46.54 crore for Export Pass Fee, which the company has challenged in court. The company operates integrated sugar businesses with cane crushing capacity of 1,36,000 TCD, distillery capacity of 800 KLD, and cogeneration capacity of 449 MW.",
            "Sentiment": "negative",
            "PublishDate": 1754986609191,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Hindusthan Sugar Reports Wider Quarterly Loss and Revenue Decline",
            "Summary": "Bajaj Hindusthan Sugar reported a consolidated net loss of 1.7 billion rupees in its quarterly results, significantly higher than the previous year's loss of 665 million rupees. The company's revenue declined to 12.5 billion rupees compared to 13.9 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1754984738443,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Hindusthan Sugar Receives 6.31 Billion Rupees from LPGCL Buyback",
            "Summary": "Bajaj Hindusthan Sugar has received 6.31 billion rupees from a buyback conducted by Lalitpur Power Generation Company Limited (LPGCL). The news indicates a significant financial transaction between the two companies, with Bajaj Hindusthan Sugar benefiting from the buyback.",
            "Sentiment": "positive",
            "PublishDate": 1751377650000,
            "Source": "default"
        },
        {
            "Title": "Bajaj Hindusthan Sugar Plans Share Buyback Worth ₹630.80 Crore",
            "Summary": "Bajaj Hindusthan Sugar has announced plans to offer shares for buyback from its group company. The total value of the shares to be offered for buyback is ₹630.80 crore. No further details about the specific group company or the terms of the buyback were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1751288796000,
            "Source": "default"
        },
        {
            "Title": "Bajaj Hindusthan Sugar Reports Q4 Financial Results",
            "Summary": "Bajaj Hindusthan Sugar has released its Q4 financial results. The company's revenue decreased to 15.5 billion rupees from 18.7 billion rupees year-over-year. However, EBITDA increased to 2.86 billion rupees from 1.7 billion rupees, with the EBITDA margin improving to 18.4% from 9.1%. The consolidated net profit rose to 2.2 billion rupees from 906 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1748508668000,
            "Source": "result"
        },
        {
            "Title": "Bajaj Hindusthan Sugar Lenders Sign Inter Creditor Agreement",
            "Summary": "Lenders of Bajaj Hindusthan Sugar Limited (BHSL) have signed an Inter Creditor Agreement (ICA) on April 28, 2025. This agreement typically indicates a coordinated approach among creditors to address the company's financial situation.",
            "Sentiment": "neutral",
            "PublishDate": 1746158951000,
            "Source": "default"
        },
        {
            "Title": "Bajaj Hindusthan Sugar: Q3 FY25 Reports ₹101.96 Crore Loss",
            "Summary": "Bajaj Hindusthan Sugar reported a loss of ₹101.96 crore in Q3 FY25, with revenue decreasing by 15.22% YoY. Operating income fell 47.81% QoQ and 244.16% YoY. EPS declined to ₹-0.81, down 576.47% YoY. The company's market cap stands at ₹3064.07 crore.",
            "Sentiment": "negative",
            "PublishDate": 1739425740000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Hindusthan Sugar Reports Q3 Revenue Decline",
            "Summary": "Bajaj Hindusthan Sugar has reported a decrease in its third-quarter revenue. The company's revenue for Q3 stood at 14.7 billion rupees, compared to 17 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1739345530000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Hindusthan Sugar Reports Q3 Net Loss of 1 Billion Rupees",
            "Summary": "Bajaj Hindusthan Sugar has reported a consolidated net loss of 1 billion rupees for the third quarter, compared to a profit of 203 million rupees in the same period last year. This represents a significant downturn in the company's financial performance year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739345487000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Hindusthan Sugar Reports Q2 EBITDA Improvement",
            "Summary": "Bajaj Hindusthan Sugar has reported a significant turnaround in its Q2 EBITDA performance. The company posted an EBITDA gain of 1 million rupees, compared to a loss of 553 million rupees in the same quarter of the previous year. This represents a positive shift in the company's operational profitability.",
            "Sentiment": "positive",
            "PublishDate": 1731051453000,
            "Source": "result"
        },
        {
            "Title": "Bajaj Hindusthan Sugar Reports Q2 Revenue Growth",
            "Summary": "Bajaj Hindusthan Sugar has reported a revenue of 11.6 billion rupees for the second quarter, compared to 11.3 billion rupees in the same period last year, showing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731051351000,
            "Source": "result"
        },
        {
            "Title": "Bajaj Hindusthan Sugar Reports Reduced Q2 Loss",
            "Summary": "Bajaj Hindusthan Sugar has reported a consolidated net loss of 750 million rupees for the second quarter, showing an improvement from the 1.23 billion rupee loss in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731051307000,
            "Source": "result"
        },
        {
            "Title": "Bajaj Hindusthan Sugar: JV Termination and Q4 Results",
            "Summary": "<p>Bajaj Hindusthan Sugar <span class='negative'>terminated</span> its joint venture with EverEnviro Resource Management for biocompressed natural projects due to <span class='negative'>timeline failures</span>. The company also reported a <span class='negative'>31% decline</span> in Q4 <b>net profit</b> to Rs 90.56 crore, with <b>total income</b> <span class='negative'>falling</span> to Rs 1,874.77 crore.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728303019000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Hindusthan Sugar Terminates Joint Venture Agreement",
            "Summary": "<p>Bajaj Hindusthan Sugar has issued a <span class='negative'>notice terminating</span> its <span class='neutral'>joint venture agreement</span> with Everenviro Resource and Unique One. This action signifies a <b>significant change</b> in the company's <span class='neutral'>business relationships</span> and <span class='neutral'>strategic partnerships</span>.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728294212000,
            "Source": "corporate_action"
        }
    ]
}