{
    "Symbol": "BAJAJCON",
    "ISIN": "INE933K01021",
    "News": [
        {
            "Title": "Bajaj Consumer Q3 Results Drive Stock to 52-Week High",
            "Summary": "Bajaj Consumer Care surged to new 52-week high of Rs. 305.80 after reporting 83% YoY jump in Q3 FY26 net profit to Rs. 46.37 crore. ICICI Securities sees 82% upside with Rs. 450 target price.",
            "Sentiment": "positive",
            "PublishDate": 1769348637140,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nippon India & BNP Paribas Invest ₹86 Cr in Two Stocks",
            "Summary": "Nippon India Small Cap Fund acquired 15.9 lakh shares of Landmark Cars for ₹57.4 cr, while BNP Paribas invested ₹28.31 cr in 10.02 lakh shares of Bajaj Consumer Care, showcasing institutional confidence.",
            "Sentiment": "positive",
            "PublishDate": 1769152872939,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Consumer Care Plans Strategic Innovation",
            "Summary": "Bajaj Consumer Care announces calibrated innovation strategy for specific opportunity areas, with comprehensive portfolio strategy clarity expected within next 2-3 quarters during management concall.",
            "Sentiment": "neutral",
            "PublishDate": 1769051287875,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Consumer Care Expects Copra Price Relief",
            "Summary": "Management anticipates further easing of copra prices due to good crop yields, while other input costs expected to remain stable in range-bound territory.",
            "Sentiment": "positive",
            "PublishDate": 1769051259116,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Consumer Care Plans 10% Annual Coverage Expansion",
            "Summary": "Bajaj Consumer Care announces strategic expansion plan targeting 10% annual growth in direct coverage over next 4-5 years, with Aarohan GTM exercise progressing across states.",
            "Sentiment": "positive",
            "PublishDate": 1769051233230,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Consumer Care Q3FY26 Results Show Strong Growth",
            "Summary": "Bajaj Consumer Care reported robust Q3FY26 performance with revenue rising 25.11% YoY to ₹28,687.14 lakhs and net profit surging 72.95% to ₹4,760.20 lakhs, driven by strong demand across product categories.",
            "Sentiment": "positive",
            "PublishDate": 1768993648183,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Consumer Care Receives GST Tax Order Worth ₹27.21L",
            "Summary": "Bajaj Consumer Care receives tax demand order of ₹24.74 lakh with ₹2.47 lakh penalty from Ambala tax authorities for GST credit disallowance. Company plans to contest at appellate level.",
            "Sentiment": "negative",
            "PublishDate": 1767096969103,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Consumer Care Gets ₹51.75L Tax Order from Bihar",
            "Summary": "Bajaj Consumer Care received tax demand of ₹51.75 lakh with ₹5.17 lakh penalty and ₹34.93 lakh interest from Bihar State Tax authorities for GST credit disallowance. Company to contest at appellate level.",
            "Sentiment": "negative",
            "PublishDate": 1766576851545,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Consumer Care Reports 7.2% Revenue Growth and 500 bps EBITDA Margin Expansion in Q2 FY26",
            "Summary": "Bajaj Consumer Care delivered standalone sales of INR 241.6 crores with 7.2% Y-o-Y growth and EBITDA margin of 20.5%, marking a 500 basis point improvement driven by strategic pricing, portfolio mix changes, and productivity actions. The company's ADHO brand achieved double-digit revenue growth while general trade channel recovered with 5% growth, though rural business remains weak and international business declined 26% due to distributor transition issues.",
            "Sentiment": "positive",
            "PublishDate": 1763108697520,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Consumer Care Discloses Related Party Transactions for Six-Month Period",
            "Summary": "Bajaj Consumer Care Limited filed its related party transactions disclosure for the six months from April 1, 2025 to September 30, 2025. The disclosure includes various transactions with related entities including royalty expenses of ₹247.75 lakhs with Bajaj Resources Private Limited, rent payments totaling ₹24.97 lakhs for Mumbai and regional offices, and sales of goods worth ₹156.95 lakhs to wholly owned subsidiary Bajaj Corp International FZE. Other transactions include sales to Bajaj Bangladesh Limited (₹15.26 lakhs), corporate social responsibility expenses of ₹86.42 lakhs with Kamalnayan Jamnalal Bajaj Foundation, and remuneration payments to key management personnel including CEO Jaideep Nandi and Company Secretary Vivek Mishra. The company also disclosed director sitting fees paid to independent directors.",
            "Sentiment": "neutral",
            "PublishDate": 1762810689952,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Consumer Care Grants 5 Lakh Stock Options to Employees Under RSU Plan",
            "Summary": "Bajaj Consumer Care's Nomination, Remuneration & Corporate Governance Committee approved the grant of 5,00,000 stock options to eligible employees under the Employee Restricted Stock Unit Plan 2018. Each option represents one equity share with a face value of Re. 1/- and an exercise price of Re. 1/-. The options will vest over 4 years from the grant date, with employees having a maximum of 3 years from vesting to exercise their options. The scheme complies with SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1762806558144,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Consumer Care Reports Strong Q2 Performance with 30% Jump in Net Profit",
            "Summary": "Bajaj Consumer Care delivered robust quarterly results with net profit rising to 430.2 million rupees from 331.5 million rupees year-over-year. Revenue increased to 2.45 billion rupees compared to 2.29 billion rupees in the same period last year. EBITDA grew significantly to 487.2 million rupees from 338.7 million rupees, while EBITDA margin expanded to 19.86% from 14.81% year-over-year, indicating improved operational efficiency and profitability across the business.",
            "Sentiment": "positive",
            "PublishDate": 1762773010125,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Consumer Care Receives Tax Demand Order of Rs. 65,657 from Tamil Nadu Tax Authority",
            "Summary": "Bajaj Consumer Care received an order from the Deputy Commercial Tax Officer in Erode, Tamil Nadu, demanding tax under Section 129(3) of the CGST Act, 2017. The order relates to goods being dispatched from an unregistered place with a declared tax value of Rs. 0, resulting in a penalty of Rs. 65,657 under Section 129(3) read with Section 122(2) of the CGST Act, 2017. The order was passed due to vehicle detention. The company states there is no impact on its financial, operational or other activities due to the alleged tax demand. The company is in the process of contesting the order at the higher appellate level.",
            "Sentiment": "neutral",
            "PublishDate": 1761998986837,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Consumer Care Completes INR 186.6 Crore Share Buyback Program",
            "Summary": "Bajaj Consumer Care Limited has successfully completed its share buyback program, purchasing 64,34,482 equity shares at INR 290 per share for a total amount of INR 186.6 crores. The buyback was conducted through the tender offer route from September 11-17, 2025, with the record date set as September 5, 2025. The company received 16,979 valid bids for 3,00,83,488 equity shares, representing approximately 4.69 times oversubscription. Major participants included Nippon Life India Trustee (15.42 lakh shares accepted) and HDFC Small Cap Fund (7.79 lakh shares accepted). The buyback excluded promoters and promoter group members. Settlement was completed on September 24, 2025, with share extinguishment to be completed by October 6, 2025. Post-buyback, the company's paid-up share capital will reduce from INR 137.05 crores to INR 130.62 crores. The company has published post-buyback public announcements in Financial Express, Jansatta, and Dainik Navjyoti newspapers.",
            "Sentiment": "neutral",
            "PublishDate": 1758810248267,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Consumer Care Reports 3.2% Revenue Growth with Improved Margins in Q1 Results",
            "Summary": "Bajaj Consumer Care Limited reported standalone revenue of INR 244.5 crores, up 3.2% year-on-year, with EBITDA growing 11.6% to INR 42.8 crores and PAT increasing 2.8% to INR 39.0 crores. Consolidated revenue reached INR 259.5 crores, growing 7.4% year-on-year, driven by the inclusion of acquired subsidiary Vishal Personal Care Limited. The company's flagship Almond Drop Hair Oil grew 4% while Bajaj 100% Pure Coconut Oil delivered over 20% growth. Gross margins improved to 56.6% on standalone basis, up 140 basis points year-on-year. General Trade registered growth after a gap with strong urban performance, while Modern Trade and E-Commerce both grew over 20%. However, rural markets remained sluggish and international business faced double-digit decline due to external headwinds. The company expanded its Project Aarohan initiative and completed the acquisition of Vishal Personal Care Limited as a wholly-owned subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1754905903343,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Consumer Care Reports Q1 FY26 Results, Advances Share Buyback and Subsidiary Acquisition Plans",
            "Summary": "Bajaj Consumer Care Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. On standalone basis, the company reported revenue from operations of ₹25,169.42 lakh compared to ₹24,117.84 lakh in the corresponding quarter of the previous year. Net profit stood at ₹3,903.72 lakh versus ₹3,798.16 lakh in the same period last year. Earnings per share was ₹2.85 compared to ₹2.66 in the previous year's quarter. On consolidated basis, revenue from operations was ₹26,669.39 lakh against ₹24,593.52 lakh, with net profit of ₹3,792.73 lakh compared to ₹3,712.12 lakh. The company completed acquisition of the remaining 51% stake in Vishal Personal Care Limited on May 16, 2025, for ₹6,209.57 lakh, making it a wholly-owned subsidiary. The Board had previously approved a share buyback of 6,434,482 equity shares at ₹290 per share for an aggregate amount not exceeding ₹18,660 lakh, subject to shareholder approval. The scheme of arrangement with Vishal Personal Care Limited will be filed with NCLT only after completion of the buyback process.",
            "Sentiment": "positive",
            "PublishDate": 1754903634746,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Consumer Care Announces Share Buyback Worth INR 18,660 Crore at INR 290 Per Share",
            "Summary": "Bajaj Consumer Care has announced a buyback of up to 64,34,482 equity shares at INR 290 per share, totaling INR 18,660 crore. The buyback represents 4.69% of total equity shares and 23.70%-24.88% of paid-up capital and free reserves based on March 2025 financial statements. The company is seeking shareholder approval through postal ballot with e-voting from July 31 to August 29, 2025. Results will be announced by August 31, 2025. The buyback excludes promoters and promoter group members, with 15% reserved for small shareholders. The offer price represents a premium of 66.50% over three-month volume weighted average price and 20.63% over closing price on July 18, 2025. The company will fund the buyback through free reserves and internal accruals, not borrowed funds. The buyback aims to return surplus cash to shareholders and improve return on equity.",
            "Sentiment": "positive",
            "PublishDate": 1753805107483,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Consumer Care Approves ₹18,660 Lakh Share Buyback and Subsidiary Demerger",
            "Summary": "Bajaj Consumer Care Limited has approved a share buyback of up to 6,434,482 equity shares representing 4.69% of total paid-up capital at ₹290 per share, with total size not exceeding ₹18,660 lakhs. The buyback will be conducted through tender offer route on proportionate basis and requires shareholder approval via postal ballot. Promoters will not participate in the buyback. The company also approved a demerger scheme to transfer the manufacturing and distribution business of wholly-owned subsidiary Vishal Personal Care Limited into Bajaj Consumer Care Limited. The demerged business had turnover of ₹5,251.6 lakhs, constituting 99.23% of the subsidiary's total turnover and 5.57% of Bajaj Consumer Care's standalone turnover. The demerger aims to achieve integration synergies, better supervision, efficient resource utilization and enhanced shareholder value. No equity shares will be issued and no change in shareholding pattern will occur.",
            "Sentiment": "positive",
            "PublishDate": 1753353565742,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Consumer Care Stock Declines Ahead of Second Consecutive Buyback Proposal",
            "Summary": "Bajaj Consumer Care shares fell 1.14% to ₹239.78 ahead of a board meeting scheduled for July 24 to consider a share buyback proposal. This marks the second consecutive year the company is considering a buyback, following a ₹166.49 crore buyback in July 2024 executed at ₹290 per share via tender offer route. The stock continues trading below the previous buyback price. The record date for the proposed buyback is expected to be announced during the meeting. Share buyback frequency has declined since October following new regulations that shifted tax burden from companies to shareholders. Despite the daily decline, the stock has gained 18% over the past month.",
            "Sentiment": "neutral",
            "PublishDate": 1753341783519,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Consumer Care Board to Consider Second Share Buyback Within a Year",
            "Summary": "Bajaj Consumer Care Ltd. board will meet on Thursday, July 24, to consider a second share buyback within a year. The company previously repurchased shares from the market in July 2024. The stock was trading 4% higher at Rs 250.29 as of 12:40 p.m.",
            "Sentiment": "positive",
            "PublishDate": 1753082637471,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Consumer Care Ltd: New MD Appointment Sparks 20% Stock Rally",
            "Summary": "Bajaj Consumer Care shares jumped 20% on June 24, ending an eight-day losing streak. The rally follows the appointment of Naveen Pandey as the new Managing Director, replacing Jaideep Nandi. The company recently reported a 13% YoY decrease in Q1 net profit to ₹31 crore, while revenue rose 4% to ₹250.5 crore.",
            "Sentiment": "positive",
            "PublishDate": 1750752564000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bajaj Consumer Care: Q4 Margins Contract, Price Hikes Implemented",
            "Summary": "Bajaj Consumer Care's Q4 FY25 gross margin contracted 90bps YoY to 54.9% due to raw material inflation. The company implemented two price hikes in Q4 and another in April to offset copra inflation. EBITDA margin contracted 190bps. The company plans to increase A&P spending to support new product development.",
            "Sentiment": "neutral",
            "PublishDate": 1746509378000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Consumer Care: Q4 Profit Drops 13%, Revenue Rises 4%",
            "Summary": "Bajaj Consumer Care reported a 13% decrease in Q4 net profit to ₹31 crore. Revenue rose 4% to ₹250.5 crore. EBITDA declined 8.3% to ₹32 crore, with margin contracting 180 basis points to 12.7%.",
            "Sentiment": "negative",
            "PublishDate": 1746437851000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Consumer Care to Acquire 51% Stake in Vishal Personal Care",
            "Summary": "Bajaj Consumer Care has announced plans to acquire a 51% stake in Vishal Personal Care. The acquisition is expected to be completed in the first quarter of the fiscal year 2026 (Q1 FY26). This move represents a significant corporate action for Bajaj Consumer Care, potentially expanding its presence in the personal care product market.",
            "Sentiment": "positive",
            "PublishDate": 1746437530000,
            "Source": "default"
        },
        {
            "Title": "Bajaj Consumer Care Q4 Financial Results",
            "Summary": "Bajaj Consumer Care reported its Q4 financial results. Revenue increased to 2.44 billion rupees from 2.36 billion rupees year-over-year. However, EBITDA decreased to 328 million rupees from 363 million rupees, with EBITDA margin falling to 13.47% from 15.37%. Net profit also declined to 315 million rupees from 373 million rupees compared to the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1746436554000,
            "Source": "result"
        },
        {
            "Title": "Bajaj Consumer Care to Acquire Vishal Personal Care",
            "Summary": "Bajaj Consumer Care has announced its intention to acquire 100% of Vishal Personal Care. The estimated cash consideration for this acquisition is 1.20 billion rupees. This move represents a significant corporate action that could potentially expand Bajaj Consumer Care's market presence in the personal care sector.",
            "Sentiment": "positive",
            "PublishDate": 1739751277000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Consumer Care: Q3 Profit Plunges 30.37% Amid Rising Costs",
            "Summary": "Bajaj Consumer Care reported Q3 FY25 results with revenue down 1.97% YoY to ₹234.42 crore and profit falling 30.37% YoY to ₹25.31 crore. Operating income decreased 29.47% YoY. Selling, general & administrative expenses surged 148.18% YoY. EPS declined to ₹1.82, down 28.63% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1739653114000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Consumer Care: Acquires Vishal Personal Care for ₹120 Crore",
            "Summary": "Bajaj Consumer Care Ltd. is acquiring Hyderabad-based Vishal Personal Care Pvt. Ltd. for ₹120 crore, gaining access to the Banjara's brand of hair and skincare products. The acquisition will be completed in two tranches, initially acquiring 49% stake followed by the remaining 51%. This strategic move aims to strengthen Bajaj's presence in southern markets and expand its product portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1739612806000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Consumer Care to Acquire Vishal Personal Care",
            "Summary": "Bajaj Consumer Care has announced its intention to acquire 100% of Vishal Personal Care. The estimated cash consideration for this acquisition is 1.20 billion Indian Rupees.",
            "Sentiment": "positive",
            "PublishDate": 1739530988000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Consumer Care: Q3 Profit Drops 30%, Acquires Vishal Personal Care",
            "Summary": "Bajaj Consumer Care reported a 30.3% YoY decline in Q3 net profit to ₹25.3 crore. Revenue fell 6.3% to ₹234.4 crore. EBITDA decreased 44.4% to ₹26.1 crore. The company approved 100% acquisition of Vishal Personal Care in two tranches.",
            "Sentiment": "negative",
            "PublishDate": 1739529662000,
            "Source": "result"
        },
        {
            "Title": "Bajaj Consumer Care Reports Q3 Revenue Decline",
            "Summary": "Bajaj Consumer Care has reported a decrease in revenue for the third quarter. The company's revenue for Q3 stood at 2.2 billion rupees, down from 2.36 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1739527149000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Consumer Care Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Bajaj Consumer Care has reported a decrease in its third quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 284 million rupees from 373 million rupees in the same period last year. Additionally, the EBITDA margin decreased to 12.37% from 15.80% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739527145000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Consumer Care Reports Decline in Q3 Net Profit",
            "Summary": "Bajaj Consumer Care has reported a net profit of 275 million rupees for the third quarter, down from 376 million rupees in the same period last year. This represents a significant year-over-year decrease in the company's quarterly earnings.",
            "Sentiment": "negative",
            "PublishDate": 1739527078000,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Consumer Care to Consider Q3 Results on February 12",
            "Summary": "Bajaj Consumer Care has announced that it will review and consider its financial results for the third quarter on February 12. This indicates the company is preparing to disclose its performance for the latest financial period to shareholders and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1738680245000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Consumer: Q2 Performance Disappoints, Recovery Crucial",
            "Summary": "Bajaj Consumer's Q2 results show weak core performance. ICICI Securities highlights the need for demand recovery to meet growth targets.",
            "Sentiment": "negative",
            "PublishDate": 1731475264000,
            "Source": "result"
        },
        {
            "Title": "Bajaj Consumer Care Reports Q2 Financial Results",
            "Summary": "Bajaj Consumer Care announced its Q2 financial results. The company's EBITDA decreased to 338.7 million rupees from 377 million rupees year-over-year. The EBITDA margin also declined to 14.81% from 16.28% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731315432000,
            "Source": "result"
        },
        {
            "Title": "Bajaj Consumer Care Reports Q2 Revenue",
            "Summary": "Bajaj Consumer Care announced its second quarter revenue of 2.3 billion rupees, compared to 2.32 billion rupees in the same quarter last year, indicating a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1731315232000,
            "Source": "result"
        },
        {
            "Title": "Bajaj Consumer Care Reports Q2 Net Profit Decline",
            "Summary": "Bajaj Consumer Care has reported a net profit of 332 million rupees for the second quarter, down from 384 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731315210000,
            "Source": "result"
        }
    ]
}