{
    "Symbol": "BAJAJINDEF",
    "ISIN": "INE0O9T01021",
    "News": [
        {
            "Title": "Indef Manufacturing Board Meet on Feb 10 for Q3FY26",
            "Summary": "Indef Manufacturing Limited schedules board meeting on February 10, 2026 to consider Q3FY26 unaudited financial results. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770204586849,
            "Source": "co_actions_results"
        },
        {
            "Title": "INDEF Manufacturing Reports Mixed Q2 Results with Revenue Growth and Profit Decline",
            "Summary": "INDEF Manufacturing announced its Q2 consolidated results showing net profit of 63 million rupees compared to 113 million rupees in the same quarter last year, representing a decline. However, the company's revenue increased to 493 million rupees from 428 million rupees year-over-year, indicating growth in top-line performance despite lower profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1762963103765,
            "Source": "earnings"
        },
        {
            "Title": "Indef Manufacturing Completes Rs 5.08 Crore Acquisition of 80% Stake in Daedalus Lift & Access Equipments",
            "Summary": "Indef Manufacturing Limited has completed the acquisition of 80% equity shares in Daedalus Lift & Access Equipments Private Limited for Rs 5.08 crore, making Daedalus a subsidiary. The acquisition involved purchasing 1,600,229 equity shares at Rs 31.73 each, with Rs 30 lakh kept as retention money for one year to cover potential claims. Daedalus operates in Mobile Elevating Work Platforms and Material Handling sector, with a turnover of Rs 6.71 crore and a loss after tax of Rs 1.90 crore in FY 2024-25. The company was established in 2017 and has shown revenue growth from Rs 2.78 crore in FY 2022-23 to Rs 6.71 crore in FY 2024-25. The acquisition aligns with Indef's strategy to strengthen its presence in the material handling and access equipment segment and expand its market reach.",
            "Sentiment": "positive",
            "PublishDate": 1757425360880,
            "Source": "order&deals"
        },
        {
            "Title": "Indef Manufacturing Appoints Vandan Shah as Director, Re-appoints Shekhar Bajaj at Annual General Meeting",
            "Summary": "Indef Manufacturing Limited shareholders approved two key board appointments at their 3rd Annual General Meeting held on August 12, 2025. Mr. Vandan Sitaram Shah was appointed as a Non-Executive, Non-Independent Director effective May 27, 2025. Shah brings 39 years of manufacturing experience as Owner and Executive Chairman of Sipra Engineers Pvt. Ltd., an aluminium die-casting company serving automotive and industrial sectors globally. He previously served as Independent Director on boards of Hind Rectifiers Ltd. and Hercules Hoists Ltd. Separately, Shri Shekhar Bajaj was re-appointed as Non-Executive, Non-Independent Director upon retirement by rotation. Bajaj serves as Chairman of Bajaj Electricals Limited, Hercules Hoists Limited and Bajaj Holding & Investment Limited, and has been a director of Indef Manufacturing since September 12, 2022. Both directors are liable to retire by rotation and are not related to any other directors on the board.",
            "Sentiment": "positive",
            "PublishDate": 1755100611005,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indef Manufacturing Reports Q1 FY26 Financial Results with Revenue of Rs 3,812.76 Lakhs",
            "Summary": "Indef Manufacturing Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs 3,812.76 lakhs compared to Rs 3,813.89 lakhs in the same quarter last year. Profit for the period stood at Rs 586.46 lakhs versus Rs 572.66 lakhs in the previous year quarter. Total income from operations was Rs 4,345.13 lakhs. On a consolidated basis, revenue from operations was Rs 3,970.51 lakhs with profit of Rs 565.21 lakhs. The consolidated results include one subsidiary, Consolidated Swift Industries Limited. Basic and diluted earnings per share was Rs 1.83 for standalone and Rs 1.77 for consolidated results. The company operates in a single segment of Material Handling Equipment.",
            "Sentiment": "neutral",
            "PublishDate": 1755004517707,
            "Source": "earnings"
        },
        {
            "Title": "Indef Manufacturing Executes Agreement to Acquire 80% Stake in Daedalus Lift & Access Equipments for Rs 5.07 Crores",
            "Summary": "Indef Manufacturing Limited has executed a Share Purchase Agreement to acquire 80% equity shares in Daedalus Lift & Access Equipments Private Limited for Rs 5.07 crores through cash consideration. Daedalus operates in the Mobile Elevating Work Platforms (MEWP) and Material Handling sector, with a turnover of Rs 6.71 crores and a loss after tax of Rs 1.90 crores in F.Y. 2024-25. The company, established in 2017 and based in Pune, has shown revenue growth from Rs 2.78 crores in F.Y. 2022-23 to Rs 6.71 crores in F.Y. 2024-25. The acquisition aligns with Indef's strategic objective to strengthen its presence in the material handling and access equipment segment, complement its product portfolio, and expand market reach. The transaction is expected to be completed by October 30, 2025, and falls within board-approved limits. This is not a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1754051076104,
            "Source": "order&deals"
        },
        {
            "Title": "Indef Manufacturing to Acquire 80% Stake in Daedalus Lift & Access Equipments for Rs. 5.07 Crores",
            "Summary": "Indef Manufacturing Limited's board has approved the acquisition of 80% equity shares in Daedalus Lift & Access Equipments Private Limited for Rs. 5.07 crores through a Share Purchase Agreement. Daedalus operates in the Mobile Elevating Work Platforms and Material Handling sector, with a turnover of Rs. 6.71 crores and a loss after tax of Rs. 1.90 crores in F.Y. 2024-25. The acquisition is strategic, aimed at widening Indef's product portfolio, and will make Daedalus a subsidiary. The transaction is not a related party deal, with completion expected by October 30, 2025. Daedalus, established in 2017 and based in Pune, has shown revenue growth from Rs. 2.78 crores in F.Y. 2022-23 to Rs. 6.71 crores in F.Y. 2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1753870010584,
            "Source": "order&deals"
        },
        {
            "Title": "Indef Manufacturing Limited Issues Corrigendum for 3rd AGM Notice and Annual Report FY 2024-25",
            "Summary": "Indef Manufacturing Limited has issued a corrigendum to address omissions in its 3rd Annual General Meeting notice and Annual Report for FY 2024-25. The company disclosed the incorporation of a wholly owned subsidiary, Consolidated Swift Industries Limited, on September 6, 2024, which was inadvertently missed from the original annual report. The corrigendum also reclassifies the appointment of secretarial auditors from ordinary business to special business in the AGM agenda. Additionally, Form AOC-1 detailing subsidiary financial performance has been added to the updated report. The company clarified that these omissions do not impact the financial statements for the year ended March 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753629650012,
            "Source": "corporate_action"
        }
    ]
}