{
    "Symbol": "BAJEL",
    "ISIN": "INE0KQN01018",
    "News": [
        {
            "Title": "Bajel Projects Wins ₹100-200 Cr EPC Order",
            "Summary": "Bajel Projects secures major EPC contract for 765kV Mandsaur substation extension project valued between ₹100 crore to ₹200 crore with completion timeline of 18-30 months.",
            "Sentiment": "positive",
            "PublishDate": 1770360188607,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajel Projects Board Meet Set for Feb 5, 2026",
            "Summary": "Bajel Projects Limited has scheduled a board meeting on February 05, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769684858983,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajel Projects Reports 4% Revenue Growth in H1 FY26 with Improved EBITDA Margins",
            "Summary": "Bajel Projects Limited achieved revenue growth of 4% to ₹1,221 crores in H1 FY26 driven by strong project execution, with EBITDA margin expanding to 4.4% from 3.4% in the previous year. The power infrastructure company maintains an unexecuted order book of ₹23,375 crores and has outlined its RAASTA 2030 strategic roadmap targeting double-digit revenue growth and high single-digit EBITDA margins.",
            "Sentiment": "positive",
            "PublishDate": 1763139982026,
            "Source": "earnings"
        },
        {
            "Title": "Bajel Projects Reports Loss in Q2 FY26, Defers Fund Raising Plans",
            "Summary": "Bajel Projects Limited reported a net loss for the quarter ended September 30, 2025, and decided to defer its proposal to raise funds through securities issuance after board deliberations. The company, engaged in power transmission and distribution business, has ongoing arbitration proceedings against two customers for recovery of outstanding balances worth INR 4,930 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1763137952130,
            "Source": "stock"
        },
        {
            "Title": "Bajel Projects Targets Multi-Year Growth With ₹8,000+ Cr Order Book",
            "Summary": "Bajel Projects has outlined its growth strategy for power transmission and EPC business with an order book exceeding ₹8,000 crores providing execution visibility for the next 3 years. The company is expanding its solar EPC portfolio and entering high-voltage substation projects while targeting over 20% revenue growth and improved working capital efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1763137224972,
            "Source": "stock"
        },
        {
            "Title": "Bajel Projects Grants 2.02 Lakh Stock Options Under ESOP 2024 Scheme",
            "Summary": "Bajel Projects Limited's Nomination and Remuneration Committee approved the grant of 2,02,000 stock options to eligible employees under the Employee Stock Option Plan 2024, with an exercise price of ₹115.56 per option. The options will vest between 1-5 years from grant date and can be exercised within 7 years of first vesting, potentially converting to equity shares of ₹2 face value each.",
            "Sentiment": "positive",
            "PublishDate": 1763122287281,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajel Projects Limited Publishes Business Responsibility and Sustainability Report for FY 2024-25",
            "Summary": "Bajel Projects Limited submitted its Business Responsibility and Sustainability Report (BRSR) for the financial year ended March 31, 2025, to BSE and NSE. The company, which operates in power transmission, distribution, monopoles, and international EPC services, reported total turnover of ₹2,59,823.65 lakhs with 2.49% from exports. The report covers 1,406 employees and 6,391 workers across operations. Key highlights include zero complaints on corruption/bribery, 100% board coverage under training programs, implementation of Zero Liquid Discharge at manufacturing facility, and zero work-related injuries for employees. The company achieved 30% procurement from MSMEs and benefited 1,900 people from marginalized groups through CSR projects. Bajel received a penalty of ₹5 lakhs from Maharashtra Pollution Control Board and was required to submit fresh bank guarantee of ₹10 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1761796250377,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajel Projects Reports 19% Revenue Growth in Q1 FY2026 with ₹3,612 Crore Order Book",
            "Summary": "Bajel Projects Limited, a power transmission and distribution infrastructure company, reported revenue from operations of ₹608 crore for Q1 FY2026, marking 19% year-over-year growth. The company's EBITDA increased 33% to ₹25 crore with margins improving to 4.0% from 3.6% in the previous year. However, profit before tax declined 40% to ₹4 crore. The company maintains a total order book of ₹3,612 crore as of June 30, 2025, with 92% from power transmission and 8% from power distribution segments. During the quarter, Bajel commissioned 3 projects, constructed 2,288 circuit kilometers of high-tension lines and 9,027 circuit kilometers of low-tension lines, and installed 4,495 distribution transformers. The company achieved record quarterly production of 36,978 poles at its manufacturing facility. Bajel has launched its RAASTA 2030 strategy focusing on high-voltage segments, international expansion, margin improvement, and digitization initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1756210130587,
            "Source": "earnings"
        },
        {
            "Title": "Bajel Projects Shareholders Approve Sudarshan Sampathkumar as Independent Director for Five-Year Term",
            "Summary": "Bajel Projects Limited shareholders approved the appointment of Sudarshan Sampathkumar as Non-Executive Independent Director for a five-year term from May 22, 2025 to May 21, 2030. The approval was granted at the company's 3rd Annual General Meeting held on August 14, 2025. Sampathkumar's designation changed from Additional Non-Executive Independent Director to Non-Executive Independent Director. He brings over 35 years of experience in advisory, consulting and private equity, having previously served as Partner & Managing Director at Bain & Company and held leadership roles at Accenture. He currently serves on boards of Bajaj Electricals, Profectus Capital and Techfab Industries. Sampathkumar holds an MBA from IIM Ahmedabad and a Bachelor of Engineering from Indian Institute of Science, Bangalore.",
            "Sentiment": "positive",
            "PublishDate": 1755517788270,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bajel Projects Reports 19% Revenue Growth in Q1 FY2025-26 Despite 40% Profit Decline",
            "Summary": "Bajel Projects Limited, a Bajaj Group company, reported revenue from operations of Rs. 608 crores for Q1 FY2025-26, representing 19% growth compared to Rs. 512 crores in the same quarter last year. EBITDA increased 33% to Rs. 25 crores from Rs. 19 crores, with EBITDA margin improving to 4% from 3.6%. However, profit before tax declined 40% to Rs. 4.45 crores from Rs. 7.46 crores, and net profit dropped 40% to Rs. 3.32 crores from Rs. 5.52 crores. The company successfully executed transmission line projects in Raichur, Jeypore-Jagdalpur, and Gurgaon during the quarter. MD & CEO Rajesh Ganesh noted ongoing finance cost pressures while emphasizing the company's focus on project execution and efficiency enhancement.",
            "Sentiment": "neutral",
            "PublishDate": 1754882271086,
            "Source": "earnings"
        },
        {
            "Title": "Bajel Projects Reports Mixed Q1 Results with Higher Revenue but Lower Net Profit",
            "Summary": "Bajel Projects reported quarterly results showing revenue growth to 6.1 billion rupees from 5.12 billion rupees year-over-year. EBITDA increased significantly to 166 million rupees from 71 million rupees, with EBITDA margin improving to 2.72% from 1.39%. However, net profit declined to 33 million rupees compared to 55 million rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1754658498298,
            "Source": "earnings"
        },
        {
            "Title": "Bajel Projects to Expand Galvanization Capacity with ₹170 Crore Investment",
            "Summary": "Bajel Projects has announced plans to triple its galvanization capacity at its Ranjangaon facility. The company will invest ₹170 crore to achieve this expansion. The investment is aimed at increasing the company's production capabilities in galvanization, which is a process used to protect steel from corrosion.",
            "Sentiment": "positive",
            "PublishDate": 1752019610000,
            "Source": "default"
        },
        {
            "Title": "Bajel Projects to Expand Galvanization Capacity with ₹170 Crore Investment",
            "Summary": "Bajel Projects has announced plans to triple its galvanization capacity at its Ranjangaon plant. The company will invest ₹170 crore for this expansion project. This move indicates a significant scaling up of Bajel Projects' manufacturing capabilities in the galvanization sector.",
            "Sentiment": "positive",
            "PublishDate": 1751979767000,
            "Source": "default"
        },
        {
            "Title": "Bajel Projects Limited: ₹170 Crore Investment to Triple Galvanisation Capacity",
            "Summary": "Bajel Projects Limited plans to increase its galvanisation capacity from 40,500 MT to 110,000 MT per annum at its Ranjangaon facility. The expansion, costing ₹170 crore, will be implemented between Q4 FY26 and Q4 FY27. The company also recently secured a 'mega' power order for a 400 kV transmission line project.",
            "Sentiment": "positive",
            "PublishDate": 1751975877000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajel Projects: Secures ₹400 Crore Transmission Line Project",
            "Summary": "Bajel Projects Ltd. has won a 'mega' order for a 400 kV transmission line project valued between ₹300-400 crore. The project involves constructing a 99km transmission line for the REZ Phase IV in Bikaner Complex, to be completed in 18 months. This follows a recent ₹100-200 crore contract for substation development.",
            "Sentiment": "positive",
            "PublishDate": 1751527116000,
            "Source": "order&deals"
        },
        {
            "Title": "Bajel Projects Secures Major Order Worth 300-400 Crore Rupees",
            "Summary": "Bajel Projects has received a significant order valued between 300 and 400 crore rupees. The news indicates a substantial business development for the company, potentially boosting its project portfolio and revenue.",
            "Sentiment": "positive",
            "PublishDate": 1751524675000,
            "Source": "default"
        },
        {
            "Title": "Bajel Projects Secures Large Substation Order in India",
            "Summary": "Bajel Projects has obtained a significant order for a substation project in India. The order is valued between 1 to 2 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1750810088000,
            "Source": "default"
        },
        {
            "Title": "Bajel Projects: Secures ₹100-200 Crore Substation Development Contract",
            "Summary": "Bajel Projects Limited has won a large contract valued between ₹100-200 crore from a leading private company in the energy and power transmission sector. The project involves developing a 400 kV gas insulated substation and a 765 kV air insulated substation extension, including supply of equipment and related services.",
            "Sentiment": "positive",
            "PublishDate": 1750771411000,
            "Source": "order&deals"
        },
        {
            "Title": "BAJEL Projects Secures Major Substation Order in India",
            "Summary": "BAJEL Projects has secured a significant order for a substation project in India. The order is valued between 1 to 2 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1750768265000,
            "Source": "default"
        },
        {
            "Title": "Bajel Projects Secures Ultra-Mega Order from Powergrid Corporation of India",
            "Summary": "Bajel Projects has received an ultra-mega order from Powergrid Corporation of India. The company defines ultra-mega orders as those valued at ₹4 billion and above.",
            "Sentiment": "positive",
            "PublishDate": 1750636697000,
            "Source": "default"
        },
        {
            "Title": "Bajel Projects: Secures Ultra-Mega Power Transmission Order from PowerGrid",
            "Summary": "Bajel Projects Limited has won a major power transmission order from PowerGrid Corporation of India Limited through its SPV MEL Power Transmission Limited. The 'Ultra-Mega' category order, valued at ₹400 crore or above, involves constructing a 138 km 400 kV double-circuit transmission line from Mahan to Rewa in Madhya Pradesh, including substation extension work. The EPC project has a 29-month execution timeline.",
            "Sentiment": "positive",
            "PublishDate": 1750500516000,
            "Source": "order&deals"
        },
        {
            "Title": "Bajel Projects Secures ₹4 Billion+ Order from Powergrid Corporation of India",
            "Summary": "Bajel Projects has obtained a significant order valued at over ₹4 billion from Powergrid Corporation of India. The company has classified this as an Ultra-Mega Order, indicating its substantial size and importance.",
            "Sentiment": "positive",
            "PublishDate": 1750491916000,
            "Source": "default"
        },
        {
            "Title": "Bajel Projects Reports Improved Q4 EBITDA and Margin",
            "Summary": "Bajel Projects has reported its latest quarterly results. The company's Q4 EBITDA increased to 207 million rupees, up from 78 million rupees in the same quarter of the previous year. The Q4 EBITDA margin also improved, rising to 2.59% from 1.6% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747901604000,
            "Source": "result"
        },
        {
            "Title": "BAJEL PROJECTS Reports Q4 Financial Results",
            "Summary": "BAJEL PROJECTS has announced its Q4 financial results. The company reported a net profit of 48 million rupees, compared to 71 million rupees in the same quarter last year, indicating a year-over-year decrease. Revenue for Q4 increased to 8 billion rupees from 4.9 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747901525000,
            "Source": "result"
        },
        {
            "Title": "Bajel Projects Secures Major Order Worth Over 400 Crore",
            "Summary": "Bajel Projects has announced securing an ultra mega order valued at 400 crore rupees or above. This significant contract represents a major business development for the company and is likely to have a substantial impact on its operations and financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1744359083000,
            "Source": "order&deals"
        },
        {
            "Title": "Bajel Projects Appoints New Chief Financial Officer",
            "Summary": "Bajel Projects has announced the appointment of Nitesh Bhandari as their new Chief Financial Officer (CFO). This change in leadership within the company's financial department represents a significant corporate governance decision.",
            "Sentiment": "neutral",
            "PublishDate": 1743767731000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bajel Projects Secures Large Order Worth 100-200 Crore Rupees",
            "Summary": "Bajel Projects has announced winning a significant order valued between 100 and 200 crore rupees. This order represents a substantial business opportunity for the company and could potentially boost its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1742880879000,
            "Source": "order&deals"
        },
        {
            "Title": "Bajel Projects Reports Mixed Q3 Financial Results",
            "Summary": "Bajel Projects has announced its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 146 million rupees, up from 91 million rupees in the same quarter last year. However, the EBITDA margin decreased to 2.35% from 3.32% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738825309000,
            "Source": "earnings"
        },
        {
            "Title": "Bajel Projects Reports Q3 Financial Results",
            "Summary": "Bajel Projects announced its Q3 financial results. The company reported a net profit of 15 million rupees, down from 34 million rupees in the same quarter last year. However, revenue increased significantly to 6.22 billion rupees from 2.75 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738825260000,
            "Source": "earnings"
        },
        {
            "Title": "Bajel Projects Secures 765kV Transmission Line Construction Contract",
            "Summary": "Bajel Projects has been awarded a contract for the supply of goods and services related to the construction of a new 765kV transmission line. This order represents a significant project in the power transmission infrastructure sector, potentially boosting the company's order book and revenue prospects.",
            "Sentiment": "positive",
            "PublishDate": 1738043469000,
            "Source": "order&deals"
        },
        {
            "Title": "Bajel Projects to Consider Q3 Results",
            "Summary": "Bajel Projects has announced that it will consider its third quarter (Q3) financial results on February 6. This indicates the company is preparing to review and potentially release its quarterly earnings report.",
            "Sentiment": "neutral",
            "PublishDate": 1737981533000,
            "Source": "earnings"
        },
        {
            "Title": "Bajel Projects Awarded Contract by Adani Energy Solutions Limited",
            "Summary": "Bajel Projects has been awarded a contract by Adani Energy Solutions Limited for 400kV transmission lines. This contract represents a significant business opportunity for Bajel Projects in the energy infrastructure sector.",
            "Sentiment": "positive",
            "PublishDate": 1736813463000,
            "Source": "order&deals"
        },
        {
            "Title": "Bajel Projects Awarded Contract by Adani Energy Solutions for 400kV Transmission Lines",
            "Summary": "Bajel Projects has announced that it has been awarded a contract by Adani Energy Solutions Limited. The contract involves the construction of 400kV transmission lines. This represents a significant project for Bajel Projects in the energy infrastructure sector.",
            "Sentiment": "positive",
            "PublishDate": 1736776864000,
            "Source": "order&deals"
        },
        {
            "Title": "Bajel Projects Awarded EPC Contract for New Solapur Substation",
            "Summary": "Bajel Projects has been awarded a contract for the Engineering, Procurement, and Construction (EPC) of a new 400/220kV substation in Solapur. This project involves establishing a high-voltage electrical substation, which is crucial for power distribution and transmission infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1734048748000,
            "Source": "order&deals"
        },
        {
            "Title": "Bajel Projects Awarded EPC Contract for New Solapur Substation",
            "Summary": "Bajel Projects has been awarded a contract for the Engineering, Procurement, and Construction (EPC) of a new 400/220kV substation in Solapur. This project involves the establishment of a high-voltage electrical substation, which is crucial for power distribution and transmission in the region.",
            "Sentiment": "positive",
            "PublishDate": 1734003336000,
            "Source": "order&deals"
        },
        {
            "Title": "Bajel Projects Reports Significant Revenue Growth in Q2",
            "Summary": "Bajel Projects has announced its Q2 revenue, showing a substantial increase from 2 billion rupees to 6.6 billion rupees year-over-year. This represents a 230% growth in revenue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1731571703000,
            "Source": "result"
        },
        {
            "Title": "Bajel Projects Reports Profit in Q2 FY2024",
            "Summary": "Bajel Projects has reported a net profit of 37 million rupees in the second quarter, compared to a loss of 44 million rupees in the same period last year. This represents a significant turnaround in the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1731571651000,
            "Source": "result"
        }
    ]
}