{
    "Symbol": "BAJFINANCE",
    "ISIN": "INE296A01032",
    "News": [
        {
            "Title": "Bajaj Finance Allots Rs 500 Crore NCDs at 7.31% Coupon",
            "Summary": "Bajaj Finance allotted 50,000 secured redeemable non-convertible debentures worth Rs 500 crore on private placement basis with 7.31% annual coupon rate and 729-day tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1770881513701,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Finance Block Trade Worth Rs. 119.86 Crores",
            "Summary": "Bajaj Finance executed a significant NSE block trade valued at Rs. 119.86 crores, involving approximately 1,255,506 shares at Rs. 954.70 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1770178646083,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Finance Revises FY26 AUM Growth to 21-22%",
            "Summary": "Bajaj Finance adjusts FY26 AUM growth forecast to 21-22% due to slower MSME business and ending two-wheeler financing. FY27 guidance to be shared with Q4 results.",
            "Sentiment": "neutral",
            "PublishDate": 1770176063291,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Finance Optimistic on Credit Cost Outlook for FY27",
            "Summary": "Bajaj Finance executive expresses optimism about the company's credit cost outlook as it approaches FY27, signaling positive expectations for future financial performance and risk management.",
            "Sentiment": "positive",
            "PublishDate": 1770124395758,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Finance Q3 Net Profit Drops 6.1% to ₹39.8B",
            "Summary": "Bajaj Finance reports Q3 consolidated net profit of ₹39.8 billion, down from ₹42.4 billion YoY, missing estimates of ₹53 billion. Revenue grew 18.3% to ₹186.6 billion.",
            "Sentiment": "negative",
            "PublishDate": 1770119125523,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Housing Finance Q3 Net Profit Rises 20% YoY",
            "Summary": "Bajaj Housing Finance reported Q3 net profit of ₹6.6 billion, up from ₹5.5 billion year-on-year. Revenue increased to ₹28.9 billion from ₹24.5 billion in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1770028544776,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Finance Block Trade Worth Rs. 15.76 Crores",
            "Summary": "Bajaj Finance Ltd. witnessed a significant NSE block trade worth Rs. 15.76 crores involving approximately 176,373 shares at Rs. 893.35 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1770018996826,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Finance Allots Rs 5,120 Crore NCDs",
            "Summary": "Bajaj Finance successfully allots 5,120,000 secured redeemable non-convertible debentures worth Rs 5,120 crore on private placement basis with 7.65% annual coupon rate and 10-year tenure.",
            "Sentiment": "positive",
            "PublishDate": 1769498701343,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Finance Block Trade Worth Rs. 68.57 Crores",
            "Summary": "Bajaj Finance executed a significant NSE block trade involving 741,649 shares at Rs. 924.55 per share, totaling Rs. 68.57 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1769489185601,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Finance Block Trade Worth Rs. 56.58 Crores",
            "Summary": "Bajaj Finance witnessed a significant NSE block trade worth Rs. 56.58 crores involving 613,659 shares at Rs. 921.95 per share, indicating substantial institutional activity in the stock.",
            "Sentiment": "neutral",
            "PublishDate": 1769489162812,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Housing Finance hits worst week in two months",
            "Summary": "Bajaj Housing Finance shares declined 4.5% this week, marking worst performance since early December. Stock now trades just above ₹70 IPO price after falling 53% from post-listing highs of ₹188.50.",
            "Sentiment": "negative",
            "PublishDate": 1769165363319,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Finance AMC reshuffles portfolio in January",
            "Summary": "BFAMC's flexi cap fund AUM rose to ₹6,316 crore while large cap fund declined to ₹1,558.63 crore. Combined 23 exits and 13 new entries across both funds during January rebalancing.",
            "Sentiment": "neutral",
            "PublishDate": 1769079434134,
            "Source": "mutualfunds"
        },
        {
            "Title": "Bajaj Finance shares climb 2% amid market selloff",
            "Summary": "Bajaj Finance stock gained over 2% on Monday, reaching an intraday high of ₹971.85 despite broader market weakness. The stock reclaimed its 200-day moving average during the trading session.",
            "Sentiment": "positive",
            "PublishDate": 1768839305002,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Finance Q3FY26 earnings call set for Feb 3",
            "Summary": "Bajaj Finance Limited has scheduled its Q3FY26 earnings conference call for February 3, 2026, at 6:00 PM IST to discuss financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768391036396,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bernstein Maintains Underperform on Bajaj Finance",
            "Summary": "Bernstein continues its 'Underperform' rating on Bajaj Finance with a price target of ₹750.00, reflecting cautious outlook on the financial services company's prospects.",
            "Sentiment": "negative",
            "PublishDate": 1768275991409,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Housing raises ₹509 cr via NCDs at 7.10%",
            "Summary": "Bajaj Housing Finance successfully raised ₹509 crore through non-convertible debentures at 7.10% coupon rate. The bonds will mature in October 2028, supporting the company's growth trajectory.",
            "Sentiment": "positive",
            "PublishDate": 1768264990363,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bernstein Downgrades Bajaj Finance on Growth Concerns",
            "Summary": "Bernstein turns negative on Bajaj Finance, expecting EPS growth to decelerate below 20% in coming years with earnings guidance likely to be revised downward over the medium term.",
            "Sentiment": "negative",
            "PublishDate": 1768204746528,
            "Source": "stocks"
        },
        {
            "Title": "Bernstein Downgrades Bajaj Finance with ₹750 Target",
            "Summary": "Bernstein assigns 'Underperform' rating to Bajaj Finance with target price of ₹750 per share, indicating 21% downside from current market price of ₹950.",
            "Sentiment": "negative",
            "PublishDate": 1768204463841,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Housing Finance Shares Drop 47% from Peak",
            "Summary": "Bajaj Housing Finance shares extended losses for third consecutive session, closing 1.02% lower at ₹94.91. Stock has corrected sharply from record high of ₹180 after strong market debut.",
            "Sentiment": "negative",
            "PublishDate": 1767934524085,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Finance Board Meet Set for Feb 3 for Q3 Results",
            "Summary": "Bajaj Finance Limited has scheduled its board meeting for February 3, 2026, to consider Q3FY26 financial results. Trading window closed from January 1-5, 2026 for designated persons.",
            "Sentiment": "neutral",
            "PublishDate": 1767786094799,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Finance Receives ESG Rating of 70",
            "Summary": "Bajaj Finance Limited has been assigned an ESG rating of 70 by ESG Risk Assessments and Insights Limited as part of their annual assessment process. The rating was prepared independently based on publicly available data.",
            "Sentiment": "neutral",
            "PublishDate": 1767709724608,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Finance Block Trade Worth ₹20.18 Crores",
            "Summary": "Bajaj Finance witnessed a significant block trade on NSE involving 206,438 shares at ₹977.75 per share, totaling ₹20.18 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1767693348177,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Housing Finance Block Trade Worth ₹25.42 Cr",
            "Summary": "Bajaj Housing Finance executed a significant block trade on NSE worth ₹25.42 crores involving approximately 26.20 lakh shares at ₹97.01 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1767684202622,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Finance Block Trade Worth ₹16.22 Crores",
            "Summary": "Bajaj Finance executed NSE block trade involving 165,810 shares at ₹978.10 per share, totaling ₹16.22 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1767682597799,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Finance Block Trade Worth ₹16.26 Crores",
            "Summary": "Bajaj Finance executed a significant block trade on NSE involving 164,770 shares at ₹986.55 per share, totaling ₹16.26 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1767586589749,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Finance Deposits Rise to ₹71,000 Crore",
            "Summary": "Bajaj Finance reports deposit growth to approximately ₹71,000 crore by December 31, 2024, marking an increase from ₹68,797 crore in the previous year, reflecting strong customer confidence.",
            "Sentiment": "positive",
            "PublishDate": 1767584295569,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Finance Customer Base Grows to 115.40 Million",
            "Summary": "Bajaj Finance expanded its customer base to 115.40 million by December 31, 2025, adding 4.76 million customers in Q3 FY26, representing 18.84% year-over-year growth from 97.12 million customers.",
            "Sentiment": "positive",
            "PublishDate": 1767584229802,
            "Source": "stocks"
        },
        {
            "Title": "Bajaj Finance Shares Drop Despite Strong Q3 Growth",
            "Summary": "Bajaj Finance shares fell 0.84% to ₹982.10 despite reporting 22% AUM growth to ₹4.86 lakh crore and strong customer expansion in Q3FY26, with moderate trading activity showing selling pressure.",
            "Sentiment": "neutral",
            "PublishDate": 1767445101287,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bajaj Finance Sells Bajaj Housing Finance Shares for Rs 15.88 Billion",
            "Summary": "Bajaj Finance has completed the sale of shares in Bajaj Housing Finance, generating proceeds of Rs 15.88 billion from the transaction. The divestment represents a significant capital-raising move that affects both Bajaj Finance's portfolio composition and provides substantial liquidity to the company.",
            "Sentiment": "neutral",
            "PublishDate": 1764675943409,
            "Source": "order&deals"
        },
        {
            "Title": "Bajaj Finance Reports 24% AUM Growth to ₹4.6 Lakh Crores, Revises FY26 Growth Guidance to 22-23%",
            "Summary": "Bajaj Finance delivered strong quarterly results with 24% AUM growth reaching ₹4,62,261 crores and added 4.13 million new customers, expanding franchise to 110.64 million customers. The company revised its FY26 AUM growth guidance downward to 22-23% from earlier 24-25% due to risk actions in MSME business and expects credit costs at upper end of 1.85-1.95% range.",
            "Sentiment": "negative",
            "PublishDate": 1763061189649,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Finance Reports 23% Jump in H1 FY26 Profit to ₹9,713 Crore",
            "Summary": "Bajaj Finance delivered consolidated profit after tax of ₹9,713 crore for H1 FY26, marking a 23% increase from ₹7,926 crore in H1 FY25. Assets under management grew 24% to ₹4,62,261 crore. The company booked 25.66 million new loans during the period, up 24% year-on-year. Net interest income rose 22% to ₹21,012 crore. Customer franchise expanded 20% to 110.64 million. The company achieved strong festive season performance with 27% increase in loan volumes and 29% rise in disbursed value. Gross NPA stood at 1.24% and Net NPA at 0.60%. Capital adequacy ratio was 21.23%. The company operates across 4,039 locations and has 78.29 million net users on its Bajaj Finserv App. Bajaj Finance is implementing its BFL 3.0 strategy with AI capabilities expected to be deployed over the next 12-18 months.",
            "Sentiment": "positive",
            "PublishDate": 1762986886338,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Finance Allots Rs 1,859.30 Crore Non-Convertible Debentures on Private Placement",
            "Summary": "Bajaj Finance Limited has allotted 1,83,500 secured redeemable non-convertible debentures (NCDs) worth Rs 1,859.30 crore through private placement. Each debenture has a face value of Rs 1 lakh and carries an interest rate of 7.37% per annum. The debentures are proposed to be listed on stock exchanges and have a maturity period with coupon payments scheduled annually starting September 27, 2026, through September 27, 2030. The debentures are secured by a first pari-passu charge on book debts and loan receivables, with security cover of at least 1.00 times the aggregate outstanding value.",
            "Sentiment": "neutral",
            "PublishDate": 1762933570191,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Finance Sees Block Trade Worth Rs. 62.07 Crores on NSE",
            "Summary": "Bajaj Finance Ltd. witnessed a block trade on the National Stock Exchange involving approximately 615,511 shares at a price of Rs. 1008.50 per share, totaling Rs. 62.07 crores in value.",
            "Sentiment": "neutral",
            "PublishDate": 1762836684033,
            "Source": "order&deals"
        },
        {
            "Title": "Bajaj Finance Shares Drop 7% on Reduced AUM Growth Guidance and Asset Quality Concerns",
            "Summary": "Bajaj Finance shares fell over 7% after the company revised its assets under management growth guidance to 22-23% from 24-25% for the fiscal year. The company reported deteriorating asset quality with gross non-performing loans rising to 1.24% from 1.03% in the previous quarter, while net NPAs increased to 0.60% from 0.50%. Credit costs remained elevated and are expected to stay at the higher end of the 1.85%-1.95% guidance range. The MSME business was reduced by 25% and is projected to grow modestly by 10-12% in FY26. Despite these challenges, consolidated profit rose 22% year-on-year to Rs 4,875 crore in the July-September quarter, while net interest income jumped 22% to Rs 10,785 crore. Managing Director Rajeev Jain noted consumer leverage remains a concern, though the company expects significant improvement in credit costs by FY27.",
            "Sentiment": "negative",
            "PublishDate": 1762835724266,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Finance Announces Key Leadership Changes with Three Senior Management Appointments",
            "Summary": "Bajaj Finance has made three significant leadership appointments. Jennifer Fernandes has been elevated from Deputy Chief Human Resources Officer to Chief Human Resources Officer. She has been with the company since 2015 and previously served as Deputy CHRO since May 2023, during which time she helped scale the company headcount from 37,000 to 65,000 employees. Manish Jain has been promoted from Senior President-Capital Markets to Deputy CEO while retaining his role as Managing Director of Bajaj Financial Securities Limited. In his new position, he will oversee Loan against Securities, Commercial Lending and Deposits businesses, reporting to Vice-Chairman Managing Director Rajeev Jain. Additionally, Neelesh Sarda has been re-appointed as Chief Compliance Officer for a three-year term starting February 1, 2026, subject to regulatory approvals. All appointments were approved by the Board of Directors based on recommendations from the Nomination and Remuneration Committee and are in line with the company's succession framework.",
            "Sentiment": "positive",
            "PublishDate": 1762795846659,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bajaj Finance Targets 26-28% AUM Growth, Adds 41 Lakh Customers in Q2FY26",
            "Summary": "Bajaj Finance has provided guidance for sustained 26-28% Assets Under Management (AUM) growth, focusing on consumer, SME, and commercial segments. The company added 41 lakh new customers in Q2FY26, bringing its total customer base to 87 million. The company is expanding its digital ecosystem through Bajaj Pay, app marketplace, and AI-based credit engines. Bajaj Finance targets maintaining Return on Assets (RoA) of 3.6-3.8% and Return on Equity (RoE) above 20%. The company plans a ₹20,000 crore capital infusion over three years and is strengthening rural penetration and merchant financing to drive long-term growth.",
            "Sentiment": "positive",
            "PublishDate": 1762784141277,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Finance Gold Loan Business Expected to Grow 33% to 160 Billion Rupees",
            "Summary": "Bajaj Finance executive forecasts the company's gold loan business will reach 160 billion rupees by year-end, representing growth from the current 120 billion rupees. This projection indicates a 33% increase in the gold loan portfolio size.",
            "Sentiment": "positive",
            "PublishDate": 1762782804997,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Finance Reduces AUM Growth Target for FY26 to 22-23%",
            "Summary": "Bajaj Finance has revised its Assets Under Management (AUM) growth target for FY26, lowering it to 22-23%. A company executive announced this adjustment to the previously set growth expectations.",
            "Sentiment": "negative",
            "PublishDate": 1762781057513,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Finance Reports Strong Q2 Results with Net Profit Rising to 48.75B Rupees",
            "Summary": "Bajaj Finance reported quarterly results showing net interest income of 107.85 billion rupees compared to 88.38 billion rupees in the previous period, nearly matching estimates of 107.86 billion rupees. Consolidated net profit reached 48.75 billion rupees versus 40 billion rupees year-over-year, slightly below the estimated 48.86 billion rupees. Revenue grew to 201.8 billion rupees from 170.9 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762775042590,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Finance Expected to Report 23% Profit Growth in Quarterly Results",
            "Summary": "Bajaj Finance is expected to report strong quarterly performance with profit and net interest income projected to grow around 23% year-on-year. The non-banking finance company's assets under management are estimated to have expanded about 24% YoY and 4-5% QoQ to nearly Rs 4.6 lakh crore, driven by growth across consumer, SME, and commercial lending segments. Analysts expect net interest income growth of 23-24% YoY, supported by higher volumes and moderate improvement in spreads to 8.5% from 8.4% in the previous quarter. Margins are projected to remain stable at around 9.5-9.6%, while credit costs are expected to stay around 2% of AUM. Asset quality metrics are forecast to remain robust with gross and net stage 3 ratios holding at 1% and 0.5% respectively. The company's pre-provision operating profit is likely to see 7% sequential growth, reflecting steady performance across lending verticals.",
            "Sentiment": "positive",
            "PublishDate": 1762682659453,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Housing Finance Reports 18% YoY Jump in Net Profit to Rs 643 Crore in Q2",
            "Summary": "Bajaj Housing Finance reported a net profit of Rs 643 crore for the September quarter, marking an 18% increase from Rs 546 crore in the same period last year. Revenue grew 14% to Rs 2,755 crore compared to Rs 2,410 crore year-on-year. Net interest income surged 34% to Rs 956 crore from Rs 713 crore, while net interest margins remained flat at 4% sequentially but declined 10 basis points from the previous year. Assets Under Management expanded 24% to Rs 2.27 lakh crore from Rs 1.02 lakh crore year-on-year. Home loans grew 19% and loans against property increased 29%. The company's cost of funds reduced by 34 basis points sequentially due to policy rate transmission. Digital penetration reached 94% for e-agreements and 93% for online customer onboarding. The liquidity coverage ratio stood at 176% against the regulatory requirement of 100%.",
            "Sentiment": "positive",
            "PublishDate": 1762428308879,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Housing Finance Shares Fall Ahead of September Quarter Results",
            "Summary": "Bajaj Housing Finance shares traded 0.5% lower at ₹109 ahead of its September quarter results announcement. The company reported gross disbursements of ₹15,900 crore for the quarter, up from ₹12,014 crore in the same quarter last year. Assets Under Management increased 24% year-on-year to ₹1,26,740 crore from ₹1,02,569 crore, with quarterly AUM growth of ₹6,320 crore. Loan assets rose to ₹1,13,050 crore compared to ₹89,878 crore in the base quarter. The stock has declined 15% in 2025 and corrected nearly 40% from its post-listing high of over ₹180. The company had one of the most successful listings of 2024, debuting at over 100% premium to its ₹70 issue price. Investors await clarity on core income, asset quality trends, and full-year guidance.",
            "Sentiment": "negative",
            "PublishDate": 1762404686203,
            "Source": "earnings"
        },
        {
            "Title": "Bajaj Finance Reports 27% Surge in Festive Season Loan Volume with Strong Financial Inclusion Growth",
            "Summary": "Bajaj Finance disbursed approximately 63 lakh loans from September 22 to October 26, 2025, representing a 27% increase in volume and 29% increase in value compared to the same period last year. The company acquired 23 lakh new customers during this festive period, with 52% being first-time borrowers from the formal financial system. Chairman Sanjiv Bajaj attributed the growth to government GST reforms and personal income tax changes that boosted consumer purchasing power. The company observed a premiumization trend, with consumers upgrading to higher-quality products despite average loan ticket sizes decreasing by 6%. TV financing showed particular strength, with loans for 40-inch and above screens accounting for 71% of total TV financing compared to 67% last year. Bajaj Finance operates through 239,000 active distribution points across 4,200 locations and serves 110 million customers through its digital platforms.",
            "Sentiment": "positive",
            "PublishDate": 1762237437737,
            "Source": "stock"
        },
        {
            "Title": "Bajaj Finance Senior Executive Moves to Bajaj Finserv in Intra-Group Transfer",
            "Summary": "Anupam Sirbhaiya, President Chief Human Resources and Administration Officer at Bajaj Finance Limited, has moved to Bajaj Finserv Limited as Group Chief-Human Resources Officer effective November 1, 2025. This transition is part of the company's succession framework and represents an intra-group movement. Sirbhaiya ceased to be a Senior Management Personnel of Bajaj Finance Limited from the same date.",
            "Sentiment": "neutral",
            "PublishDate": 1762001091909,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bajaj Finance Reports Strong Q3 FY25 Results with 18% PAT Growth and Multiple Corporate Actions",
            "Summary": "Bajaj Finance Limited reported consolidated profit after tax of ₹4,308 crore for Q3 FY25, marking an 18% increase from ₹3,639 crore in Q3 FY24. The company achieved highest ever new loans booked at 12.06 million and quarterly customer franchise increase of 5.03 million, bringing total customer base to 97.12 million. Consolidated assets under management grew 28% to ₹398,043 crore. The company completed several corporate actions including allotment of 1,50,000 secured NCDs worth ₹1,501.67 crore, equity share allotments under ESOP schemes, and leadership changes with Rajeev Jain elevated to Vice Chairman and Anup Kumar Saha appointed as Managing Director effective April 1, 2025. Bajaj Finance also entered strategic partnership with Bharti Airtel and acquired 7% stake in RMBS Development Company Limited. The company maintains strong credit ratings of AAA/Stable across major rating agencies and reported gross NPA of 1.41% and net NPA of 0.61% as of December 31, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1761640812778,
            "Source": "corporate_action"
        },
        {
            "Title": "Bharti Airtel and Bajaj Finance Form Strategic Partnership for Digital Financial Services Platform",
            "Summary": "Bharti Airtel and Bajaj Finance announced a strategic partnership to create one of India's largest digital platforms for financial services. The partnership combines Airtel's 370 million customer base and 12 lakh+ distribution network with Bajaj Finance's 27 product lines and 5,000+ branches. Airtel will offer Bajaj Finance's retail financial products through the Airtel Thanks App and later through its nationwide store network. Initially, four products including Gold Loan, Business Loan, co-branded Insta EMI Card, and Personal Loan will be available by March, with plans to expand to 10 financial products within the calendar year. The Airtel-Bajaj Finserv Insta EMI card will provide access to flexible EMI options at over 1.5 lakh partner stores across 4,000+ cities.",
            "Sentiment": "positive",
            "PublishDate": 1761630687636,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Finance Sees Block Trade Worth Rs. 94.29 Crores on NSE",
            "Summary": "Bajaj Finance Ltd. witnessed a block trade on the National Stock Exchange worth Rs. 94.29 crores. The transaction involved approximately 863,783 shares executed at a price of Rs. 1,091.60 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1761297145250,
            "Source": "order&deals"
        },
        {
            "Title": "Bajaj Finance Schedules Conference Call for Quarter Ended September 30, 2025",
            "Summary": "Bajaj Finance Limited will hold a conference call on November 10, 2025, at 6:30 PM IST to discuss financial results for the quarter ended September 30, 2025. The call will be hosted by Anuj Singla from J.P. Morgan and will feature company participants including Vice Chairman and Managing Director Rajeev Jain, Chief Operating Officer and Chief Financial Officer Sandeep Jain, and the senior management team. The company has provided dial-in numbers for domestic and international participants, with toll-free access available for USA, UK, Singapore, and Hong Kong. A live webcast will also be available for participants.",
            "Sentiment": "neutral",
            "PublishDate": 1761220959125,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajaj Finance Sees Block Trade Worth Rs. 107.65 Crores on NSE",
            "Summary": "Bajaj Finance Ltd. witnessed a block trade on the National Stock Exchange involving approximately 1,004,367 shares at a price of Rs. 1,071.85 per share. The total transaction value amounted to Rs. 107.65 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1760593065823,
            "Source": "order&deals"
        },
        {
            "Title": "Bajaj Finance Sees Block Trade Worth Rs. 171.64 Crores on NSE",
            "Summary": "Bajaj Finance Ltd. witnessed a block trade on the National Stock Exchange involving approximately 1,670,471 shares at a price of Rs. 1,027.50 per share. The total transaction value amounted to Rs. 171.64 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1760335393902,
            "Source": "order&deals"
        }
    ]
}