{
    "Symbol": "BALAJEE",
    "ISIN": "INE0S2G01011",
    "News": [
        {
            "Title": "Shree Tirupati Balajee Board Meet on Feb 13, 2026",
            "Summary": "Shree Tirupati Balajee Agro Trading schedules board meeting for February 13, 2026 to approve Q3FY26 financial results and statutory auditor review reports for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770222667275,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shree Tirupati Balajee Agro Trading Faces Exchange Fines for Delayed Annual Report Submission",
            "Summary": "Shree Tirupati Balajee Agro Trading Company Limited received fines from NSE and BSE for non-submission of its annual report within prescribed timelines under SEBI regulations for the financial year ended March 31, 2025. The company's Board of Directors acknowledged the delay and expressed regret during their November 10, 2025 meeting. The Board emphasized the importance of adhering to statutory timelines and directed management to strengthen internal control mechanisms to prevent future occurrences. Additionally, the company submitted its monitoring agency report for the quarter ended September 30, 2025, regarding utilization of IPO proceeds worth Rs. 122.42 crore. The monitoring agency noted that while fund utilization was as per the offer document, the General Corporate Purpose allocation constituted 26% of gross proceeds, exceeding the prescribed 25% threshold under SEBI regulations.",
            "Sentiment": "negative",
            "PublishDate": 1762822615757,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shree Tirupati Balajee Agro Trading Reports Q2 FY26 Results",
            "Summary": "Shree Tirupati Balajee Agro Trading Company Limited announced its unaudited financial results for the second quarter and half year ended September 30, 2025. On a standalone basis, the company reported a profit of ₹169.75 lakhs for Q2 compared to ₹346.65 lakhs in the same quarter last year. For the half year, standalone profit was ₹411.06 lakhs versus ₹516.40 lakhs in the previous year. On a consolidated basis, Q2 profit was ₹169.42 lakhs compared to ₹635.92 lakhs last year, while half-year consolidated profit reached ₹805.33 lakhs against ₹1,698.74 lakhs in the prior period. The company's board meeting was held on November 10, 2025, where these results were discussed and approved. The board also noted communications from BSE and NSE dated October 30, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762821800803,
            "Source": "earnings"
        },
        {
            "Title": "Shree Tirupati Balajee Agro Trading Approves Captive Power Generation Provisions",
            "Summary": "Shree Tirupati Balajee Agro Trading Company Limited's members approved alterations to the company's Memorandum and Articles of Association at their 24th Annual General Meeting held on September 26, 2025. The approved changes add provisions for setting up facilities to generate electricity and power for captive consumption from both conventional sources like thermal, hydel, and nuclear, as well as non-conventional sources including solar, wind, and geo-thermal. The alterations specify that any conventional and non-conventional power generation established by the company will be used for captive generation and consumption by the company itself.",
            "Sentiment": "neutral",
            "PublishDate": 1758975506998,
            "Source": "corporate_action"
        },
        {
            "Title": "Shree Tirupati Balajee Agro Trading Reports Q1 FY2026 Financial Results",
            "Summary": "Shree Tirupati Balajee Agro Trading Company Limited announced its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of ₹7,706.16 lakhs compared to ₹8,912.90 lakhs in the same quarter last year. Net profit stood at ₹392.91 lakhs versus ₹374.61 lakhs in the previous year quarter. On a consolidated basis, revenue from operations was ₹12,540.60 lakhs against ₹14,352.33 lakhs in the corresponding quarter of the previous year. Consolidated net profit attributable to owners was ₹513.82 lakhs compared to ₹549.59 lakhs in the same period last year. The company's earnings per share on a standalone basis was ₹0.42 for the quarter. The Board of Directors approved these results at their meeting held on August 14, 2025. The company has fully utilized its IPO proceeds of ₹12,182.44 lakhs across various purposes including debt repayment, working capital funding, and general corporate purposes, with only ₹60.06 lakhs remaining unutilized for issue-related expenses.",
            "Sentiment": "neutral",
            "PublishDate": 1755187390867,
            "Source": "earnings"
        },
        {
            "Title": "Shree Tirupati Balajee Agro Trading Reports Q3 Financial Results",
            "Summary": "Shree Tirupati Balajee Agro Trading has announced its Q3 consolidated financial results. The company reported a net profit of 81 million rupees, up from 48 million rupees in the same quarter last year. However, revenue decreased to 1.43 billion rupees from 1.57 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1739751451000,
            "Source": "earnings"
        },
        {
            "Title": "Shree Tirupati Balajee Agro Trading Co Reports Q2 Financial Results",
            "Summary": "Shree Tirupati Balajee Agro Trading Co has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 is 167.6 million rupees, compared to 214 million rupees in the same quarter last year, showing a year-over-year decrease. The EBITDA margin has also declined from 18.56% in the previous year to 10.77% in the current quarter.",
            "Sentiment": "negative",
            "PublishDate": 1731596188000,
            "Source": "result"
        },
        {
            "Title": "Shree Tirupati Balajee Agro Trading Co Reports Q2 Revenue Growth",
            "Summary": "Shree Tirupati Balajee Agro Trading Co has announced its Q2 revenue, which stands at 1.6 billion rupees. This represents an increase from 1.15 billion rupees in the same quarter of the previous year, indicating year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731596027000,
            "Source": "result"
        },
        {
            "Title": "Shree Tirupati Balajee Agro Trading Co Reports Q2 Financial Results",
            "Summary": "Shree Tirupati Balajee Agro Trading Co announced its Q2 consolidated net profit of 71 million rupees, showing a decrease from 94.6 million rupees year-over-year, but an increase from 65 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1731595960000,
            "Source": "result"
        }
    ]
}