{
    "Symbol": "BALAJITELE",
    "ISIN": "INE794B01026",
    "News": [
        {
            "Title": "Balaji Telefilms Launches Hoonur Talent Management",
            "Summary": "Balaji Telefilms announces launch of Hoonur, a dedicated talent management vertical under its digital division, led by Mohammed Nagman Lateef with 11 years industry experience.",
            "Sentiment": "positive",
            "PublishDate": 1770355484361,
            "Source": "stocks"
        },
        {
            "Title": "Balaji Telefilms Partners Netflix for Lock Upp Return",
            "Summary": "Balaji Telefilms announces strategic partnership with Netflix to bring back the popular reality show Lock Upp, marking a significant collaboration between the production house and streaming giant.",
            "Sentiment": "positive",
            "PublishDate": 1770134490150,
            "Source": "stocks"
        },
        {
            "Title": "Balaji Telefilms Board Meet Set for Feb 13, 2026",
            "Summary": "Balaji Telefilms Limited has scheduled a board meeting for February 13, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769599682977,
            "Source": "co_actions_results"
        },
        {
            "Title": "Balaji Telefilms Head of Digital Originals Resigns",
            "Summary": "Ms. Aparna Ramachandran stepped down from her position as Head of Digital Originals at Balaji Telefilms Limited effective January 27, 2026, to pursue other career opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1769596918866,
            "Source": "stocks"
        },
        {
            "Title": "Balaji Telefilms Launches KUTINGG Mobile Platform",
            "Summary": "Balaji Telefilms introduces KUTINGG, a new mobile entertainment platform offering daily original content including family dramas and non-fiction shows for enhanced viewer engagement.",
            "Sentiment": "positive",
            "PublishDate": 1768901812683,
            "Source": "stocks"
        },
        {
            "Title": "Balaji Telefilms Allots 17.5 Lakh Shares Under ESOP",
            "Summary": "Balaji Telefilms Limited has allotted 17,50,000 equity shares to employees under its ESOP Scheme 2023, increasing paid-up capital to ₹24.35 crores with 12.17 crore total shares outstanding.",
            "Sentiment": "positive",
            "PublishDate": 1768842526374,
            "Source": "co_actions_results"
        },
        {
            "Title": "Balaji Telefilms Appoints Pankaj Chaturvedi as Director",
            "Summary": "Balaji Telefilms Limited has appointed Mr. Pankaj Baikunthnath Chaturvedi as Additional Director (Non-Executive Independent Director) for a five-year term starting December 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767110780815,
            "Source": "stocks"
        },
        {
            "Title": "Balaji Telefilms Allots 2.75 Lakh Equity Shares Under ESOP Schemes",
            "Summary": "Balaji Telefilms allotted 2,75,000 equity shares of Rs. 2 each to eligible employees under its ESOP schemes from 2017 and 2023, with exercise prices of Rs. 65.33 and Rs. 55.28 per share. The allotment increased the company's paid-up share capital to Rs. 23,99,69,688 comprising 11,99,84,844 equity shares, with the new shares ranking pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764671208209,
            "Source": "corporate_action"
        },
        {
            "Title": "Balaji Telefilms Fined Rs. 1.55 Lakh Each by BSE and NSE for Regulatory Non-Compliance",
            "Summary": "Balaji Telefilms received fines totaling Rs. 1.55 lakh each from BSE and NSE plus GST for violating SEBI Regulation 17(1) regarding delayed appointment of an Independent Director. The company disclosed that the penalty was imposed for non-compliance with listing obligations related to replacing a retiring Independent Director, with no significant operational impact expected beyond the penalty amount.",
            "Sentiment": "negative",
            "PublishDate": 1764401809453,
            "Source": "corporate_governance"
        },
        {
            "Title": "Balaji Telefilms' Astrology App Clocks 250K Downloads in 24 Hours, Tops iOS Charts",
            "Summary": "Balaji Telefilms launched BalajiAstroGuide which achieved 250,000 downloads within 24 hours and reached the top of iOS Free App Lifestyle charts, with traffic spikes 2-3x higher than projected benchmarks. The company expects the astrology and spiritual wellness app to become a meaningful contributor to digital revenue over the next 12-18 months, strengthening diversification beyond traditional media.",
            "Sentiment": "positive",
            "PublishDate": 1764139226443,
            "Source": "stock"
        },
        {
            "Title": "Balaji Telefilms Reports Revenue Drop to INR 48.8 Crores in Q2 FY26, Posts Loss of INR 4.9 Crores",
            "Summary": "Balaji Telefilms' quarterly revenue declined to INR 48.8 crores from INR 144 crores in the same quarter last year, with the company posting a loss after tax of INR 4.9 crores due to three mature TV series ending during the quarter. The company maintains strong cash reserves of INR 137 crores and has an order book of approximately INR 300 crores for its digital B2B business, with management expecting recovery from the next financial year through upcoming movie releases and digital content partnerships.",
            "Sentiment": "negative",
            "PublishDate": 1763536479205,
            "Source": "earnings"
        },
        {
            "Title": "Balaji Telefilms Rebrands Astrology App to BalajiAstroGuide",
            "Summary": "Balaji Telefilms announced the rebranding of its premium astrology application from AstroVani by Balaji to BalajiAstroGuide, effective immediately across digital platforms including Google Play Store with iOS launch to follow. The company made this change to address user confusion caused by third-party platforms using similar names and to strengthen brand recognition in the spirituality-tech ecosystem.",
            "Sentiment": "positive",
            "PublishDate": 1763535297546,
            "Source": "stock"
        },
        {
            "Title": "Balaji Telefilms Reports Net Loss of ₹442.75 Lacs in Quarterly Results",
            "Summary": "Balaji Telefilms Limited reported a net loss of ₹442.75 lacs for the quarter ended September 30, 2025, compared to a profit of ₹774.05 lacs in the same period last year, with total income declining to ₹498.05 lacs from ₹4,442.22 lacs. The company's earnings per share turned negative at ₹0.37 per share, reflecting deteriorating financial performance that affects shareholders and investors.",
            "Sentiment": "negative",
            "PublishDate": 1763194940433,
            "Source": "earnings"
        },
        {
            "Title": "Balaji Telefilms Reports Rs 48.8 Cr Revenue in Q2FY26, Launches New Digital Platforms",
            "Summary": "Balaji Telefilms posted consolidated revenue of Rs 48.8 crores for Q2FY26 with a loss after tax of Rs 4.97 crores, while launching new digital initiatives including AstroVani astrology app and Kutting OTT platform. The company secured a long-term creative partnership with Netflix and maintains strong cash reserves of Rs 137 crores, positioning for growth across television, movies, and digital segments.",
            "Sentiment": "negative",
            "PublishDate": 1763060132934,
            "Source": "earnings"
        },
        {
            "Title": "Balaji Telefilms Launches Astrovani Premium Astrology App",
            "Summary": "Balaji Telefilms has launched Astrovani, which the company describes as India's first premium astrology application. The app offers daily horoscopes, live consultations, and focuses on providing a reliable user experience for astrology services.",
            "Sentiment": "positive",
            "PublishDate": 1762756626036,
            "Source": "stock"
        },
        {
            "Title": "Balaji Telefilms Launches Balaji Studio to Support Independent Content Creators",
            "Summary": "Balaji Telefilms Ltd unveiled Balaji Studio, a new vertical designed as a content engine for India's TV and digital entertainment. The studio operates as a collaborative platform aimed at attracting and empowering emerging independent talents by providing them with infrastructure and support for creating content for OTT and television audiences. Founder Joint Managing Director Ektaa R Kapoor described it as a declaration that the future of Indian entertainment is open to those who dare to dream big and disrupt norms. Chief Revenue Officer Nitin Burman highlighted that the studio blends creative freedom with strategic focus, providing creators with structure, scalability, and audience reach. The initiative focuses on building partnerships across the ecosystem, working with technology platforms, industry stakeholders and brands to unlock new monetization opportunities while keeping audience engagement central to creative decisions.",
            "Sentiment": "positive",
            "PublishDate": 1762465412099,
            "Source": "stock"
        },
        {
            "Title": "Balaji Telefilms Allots 86,100 Equity Shares Under ESOP Scheme 2023",
            "Summary": "Balaji Telefilms Limited has allotted 86,100 equity shares of Rs. 2 each under its Employee Stock Option Plan (ESOP) Scheme 2023. The Nomination and Remuneration Committee approved the allotment on November 5, 2025. Following this allotment, the company's paid-up equity share capital increased from Rs. 23,92,47,488 comprising 119,623,744 shares to Rs. 23,94,19,688 comprising 119,709,844 shares. The exercise price for these stock options was Rs. 55.28 per share with a premium of Rs. 53.28 per share. The stock options were originally granted on November 9, 2023. The newly allotted equity shares will rank pari-passu with existing equity shares including dividend and other rights.",
            "Sentiment": "neutral",
            "PublishDate": 1762360891048,
            "Source": "corporate_action"
        },
        {
            "Title": "Balaji Telefilms Partners with Story TV to Enter Micro Drama Market",
            "Summary": "Balaji Telefilms has formed a partnership with Story TV to enter the micro drama sector. The collaboration aims to disrupt the existing micro drama market through their combined efforts.",
            "Sentiment": "positive",
            "PublishDate": 1759730565454,
            "Source": "stock"
        },
        {
            "Title": "Balaji Telefilms Shareholders Approve Key Appointments at 31st AGM",
            "Summary": "Balaji Telefilms held its 31st Annual General Meeting on September 29, 2025, via video conferencing. Shareholders approved the reappointment of Dr. Archana Hingorani as an Independent Director for a second five-year term, effective August 28, 2025. Dr. Hingorani holds degrees from University of Mumbai and University of Pittsburgh, with over 30 years of experience in financial services and alternative asset management. She currently serves as Managing Partner at Siana Capital and Visiting Distinguished Professor at University of Pittsburgh. Shareholders also approved the appointment of AVS & Associates as Secretarial Auditors for five consecutive financial years, effective April 01, 2025. AVS & Associates is a peer-reviewed firm specializing in company law, securities laws, mergers and acquisitions, and secretarial audits. The AGM ran from 3:30 p.m. to 4:47 p.m. IST.",
            "Sentiment": "neutral",
            "PublishDate": 1759243791604,
            "Source": "corporate_governance"
        },
        {
            "Title": "Balaji Telefilms Launches Family-Oriented Mobile App 'Kutingg'",
            "Summary": "Balaji Telefilms has introduced a new mobile application called 'Kutingg' designed for family audiences. The app offers engaging fiction content, non-fiction programming, and quick entertainment snippets targeted at mobile users.",
            "Sentiment": "positive",
            "PublishDate": 1757401182928,
            "Source": "stock"
        },
        {
            "Title": "Balaji Telefilms Reports Loss in Q1 FY2026, OTT Platform Discontinued",
            "Summary": "Balaji Telefilms Limited reported a standalone net loss of ₹525.86 lakhs for the quarter ended June 30, 2025, compared to a profit of ₹85.11 lakhs in the same quarter last year. Revenue from operations declined to ₹7,283.18 lakhs from ₹14,916.99 lakhs year-over-year. On a consolidated basis, the company posted a loss of ₹594.55 lakhs versus a loss of ₹222.18 lakhs in the corresponding quarter. The company's OTT application was discontinued on July 25, 2025, following directives from the Ministry of Information & Broadcasting to intermediaries. Management assessed that this discontinuation does not impact the recoverability of related assets worth ₹694 lakhs. The company operates through three segments: Commissioned Programs (₹4,994.55 lakhs revenue), Digital (₹2,914.62 lakhs), and Films (₹139.77 lakhs). Basic earnings per share stood at negative ₹0.44 for the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1755013602230,
            "Source": "earnings"
        },
        {
            "Title": "Balaji Telefilms' ALTT Platform Disabled by Distribution Platforms Following Government Order",
            "Summary": "The Ministry of Information and Broadcasting has ordered distribution platforms to disable public access to certain OTT platforms, including ALTT, which is operated by Balaji Telefilms Limited. The action was taken due to allegations that these platforms host obscene content. Balaji Telefilms received the order on July 25, 2025, and disclosed that ALTT operates as a Subscription based Video on Demand (SVOD) platform. The company's management believes this development will not have any significant impact on the company's operations.",
            "Sentiment": "negative",
            "PublishDate": 1753452425760,
            "Source": "stock"
        },
        {
            "Title": "NCLT Approves Arrangement Scheme Between Balaji Telefilms and Subsidiary",
            "Summary": "The National Company Law Tribunal (NCLT) has sanctioned an arrangement scheme between Balaji Telefilms and its fully owned subsidiary. No further details about the nature of the arrangement or the subsidiary involved were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1749622077000,
            "Source": "default"
        },
        {
            "Title": "Balaji Telefilms Reports Increased Net Loss in Q3",
            "Summary": "Balaji Telefilms, an Indian entertainment company, has reported a significant increase in net loss for the third quarter. The consolidated net loss expanded to 118 million rupees, compared to a loss of 0.7 million rupees in the same period last year. Additionally, the company's revenue declined from 1.38 billion rupees to 932 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739320373000,
            "Source": "earnings"
        },
        {
            "Title": "Balaji Telefilms Reports Increased Net Loss in Q3",
            "Summary": "Balaji Telefilms, an Indian entertainment company, has reported a significant increase in net loss for the third quarter. The consolidated net loss expanded to 118 million rupees, compared to a loss of 0.7 million rupees in the same period last year. Additionally, the company's revenue decreased from 1.38 billion rupees to 932 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739287586000,
            "Source": "earnings"
        },
        {
            "Title": "Balaji Telefilms Launches New Series 'Power of Paanch' on Disney+ Hotstar",
            "Summary": "Balaji Telefilms has announced the launch of a new series titled 'Power of Paanch' on the streaming platform Disney+ Hotstar. The series, described as a tale of friendship and beyond, is set to premiere on January 17.",
            "Sentiment": "positive",
            "PublishDate": 1735885283000,
            "Source": "corporate_action"
        },
        {
            "Title": "Balaji Telefilms: Ekta Kapoor Invests Rs 25 Crore in Preferential Share Issue",
            "Summary": "Balaji Telefilms raised Rs 130.6 crore through a preferential issue of shares at Rs 73.17 each. Promoter Ekta Kapoor invested Rs 25 crore, increasing her stake to 18.3%. The company will seek shareholder approval for the allotment on Jan. 11.",
            "Sentiment": "positive",
            "PublishDate": 1734616373000,
            "Source": "corporate_action"
        },
        {
            "Title": "Balaji Telefilms Approves Equity Share Issuance Worth Up to 1.31 Billion Rupees",
            "Summary": "Balaji Telefilms has approved the issuance of equity shares worth up to 1.31 billion rupees. The company, which currently has a market capitalization of 900 crore rupees, is taking this step as a corporate action to raise capital.",
            "Sentiment": "positive",
            "PublishDate": 1734601208000,
            "Source": "corporate_action"
        },
        {
            "Title": "Balaji Telefilms to Consider Fund Raising in Upcoming Board Meeting",
            "Summary": "Balaji Telefilms has announced a board meeting scheduled for December 19 to discuss and consider potential fund raising options for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1734348457000,
            "Source": "corporate_action"
        },
        {
            "Title": "Balaji Telefilms: 'Sabarmati Report' Crosses ₹20 Crore, Gains Political Support",
            "Summary": "Balaji Telefilms' film 'The Sabarmati Report' has collected ₹20 crore at the box office. It received tax-free status in six states and praise from high-profile political figures, including Prime Minister Modi. The film's success highlights its potential to spark national discourse on sensitive political topics.",
            "Sentiment": "positive",
            "PublishDate": 1732621245000,
            "Source": "normal_news"
        },
        {
            "Title": "Balaji Telefilms Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Balaji Telefilms has reported a decrease in its Q2 EBITDA, which fell to 118 million rupees from 184 million rupees in the same quarter last year. The company's EBITDA margin also declined, dropping to 8.18% from 9.23% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731599192000,
            "Source": "result"
        },
        {
            "Title": "Balaji Telefilms Reports Q2 Revenue Decline",
            "Summary": "Balaji Telefilms, an Indian media and entertainment company, has reported a revenue of 1.4 billion rupees for the second quarter, down from 2 billion rupees in the same period last year. This represents a significant year-over-year decrease in revenue.",
            "Sentiment": "negative",
            "PublishDate": 1731599050000,
            "Source": "result"
        },
        {
            "Title": "Balaji Telefilms Reports Q2 Profit Decline",
            "Summary": "Balaji Telefilms has reported a consolidated net profit of 56.5 million rupees for the second quarter, showing a year-over-year decrease from 118 million rupees. However, the profit has increased from 6.9 million rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1731598993000,
            "Source": "result"
        },
        {
            "Title": "Balaji Telefilms: Zero Returns Despite Stock Split and Dividends",
            "Summary": "Balaji Telefilms, led by Ekta Kapoor, has given zero returns in the past year despite a 1:5 stock split and 25 dividend payouts historically. The stock is down 17.9% year-over-year, trading at Rs 60.79. Reliance Industries is the largest public shareholder with a 24.82% stake. The company's board meeting is scheduled for November 14, 2024, to consider Q2 FY25 results.",
            "Sentiment": "negative",
            "PublishDate": 1731088604000,
            "Source": "normal_news"
        }
    ]
}