{
    "Symbol": "BALAMINES",
    "ISIN": "INE050E01027",
    "News": [
        {
            "Title": "Balaji Amines Q3 Net Profit Drops to ₹314M",
            "Summary": "Balaji Amines reported consolidated net profit of ₹314 million in Q3, down from ₹332 million in the same quarter last year, marking a year-on-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1769674665929,
            "Source": "co_actions_results"
        },
        {
            "Title": "Balaji Amines shares surge 13% on ₹258-cr subsidy news",
            "Summary": "Balaji Amines stock jumps 13% after Maharashtra government approves ₹258-crore industrial promotion subsidy under mega project scheme with 7-year validity period starting January 2024.",
            "Sentiment": "positive",
            "PublishDate": 1767796451037,
            "Source": "stocks"
        },
        {
            "Title": "Balaji Amines Promoter Pledges Shares Worth ₹1.93%",
            "Summary": "Balaji Amines promoter Ande Srinivas Reddy pledged 6,25,000 shares (1.93% stake) to HDFC Bank on December 30, 2025, as security for credit facilities to support principal business activities.",
            "Sentiment": "neutral",
            "PublishDate": 1767349412367,
            "Source": "co_actions_results"
        },
        {
            "Title": "Balaji Amines Promoters Pledge 6.25L Shares to HDFC",
            "Summary": "Promoters Dundurapu Ram Reddy and Vandana Reddy pledged 6,25,000 shares (1.93% stake) to HDFC Bank on December 30, 2025, as security for credit facilities to be utilized by subsidiary Balaji Speciality Chemicals Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1767347214746,
            "Source": "stocks"
        },
        {
            "Title": "Balaji Amines Promoter Pledges Shares Worth ₹1.16%",
            "Summary": "Promoter Gaddam Hemanth Reddy pledged 3,75,000 shares (1.16% stake) to HDFC Bank as security for credit facilities to support principal business activities on December 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767337308689,
            "Source": "stocks"
        },
        {
            "Title": "Balaji Amines Receives Court Summons for Alleged Drug and Cosmetics Act Violations",
            "Summary": "Balaji Amines Limited and all its Directors have been summoned by the Court of Honourable Additional Principal Judge, Ahmedabad to appear on December 4, 2025, for alleged violations under multiple sections of the Drugs and Cosmetics Act, 1940. The company states there is no material impact on its financials, operations or other activities from this legal action.",
            "Sentiment": "negative",
            "PublishDate": 1763993569349,
            "Source": "stock"
        },
        {
            "Title": "Balaji Amines Reports Q2 FY26 Results with 19% EBITDA Margin Despite Revenue Decline",
            "Summary": "Balaji Amines Limited reported Q2 FY26 revenue of INR 341 crores compared to INR 358 crores in Q1 FY26, while EBITDA improved to INR 67 crores with margins rising to 19% from 17% in the previous quarter. The company expects gradual improvement with new capacity commissioning including DME plant at Unit 4 and N-Methyl Morpholine projects during FY 2025-26, while subsidiary Balaji Specialty Chemicals progresses on its INR 750 crores expansion plan.",
            "Sentiment": "neutral",
            "PublishDate": 1763461285896,
            "Source": "earnings"
        },
        {
            "Title": "Balaji Amines Reports Q2FY26 Results with Stable Revenue and Margin Improvement",
            "Summary": "Balaji Amines Limited reported consolidated revenue of Rs. 341 crore for Q2FY26, compared to Rs. 358 crore in Q1FY26. EBITDA stood at Rs. 67 crore versus Rs. 64 crore in Q1FY26, with EBITDA margin improving to 19% from 17% in the previous quarter. PAT was Rs. 37.10 crore compared to Rs. 36.53 crore in Q1FY26. Total volumes remained stable at 26,165 MT for Q2FY26 against 26,348 MT in Q2FY25. The company operates as a zero-debt entity on standalone basis. Several expansion projects are underway including DME plant, N-Methyl Morpholine facility, and improved Acetonitrile plant expected to be commissioned during FY2025-26 and FY2026-27. The subsidiary Balaji Speciality Chemicals has received Mega Project status from Maharashtra government for Rs. 750 crore expansion.",
            "Sentiment": "neutral",
            "PublishDate": 1762930329311,
            "Source": "earnings"
        },
        {
            "Title": "Balaji Amines Reports Mixed Q2 Results with Revenue and Profit Decline",
            "Summary": "Balaji Amines reported Q2 consolidated net profit of 346 million rupees, down from 410 million rupees in the same period last year. Revenue decreased to 3.4 billion rupees from 3.5 billion rupees year-over-year. However, EBITDA margin improved slightly to 17.56% from 17.49%, while absolute EBITDA declined to 598 million rupees from 607 million rupees compared to the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762783711162,
            "Source": "earnings"
        },
        {
            "Title": "Balaji Amines Maintains Rs 3,000 Crore Revenue Target Despite Industry Slowdown",
            "Summary": "Balaji Amines reaffirmed its revenue target of Rs 3,000 crore by FY27 despite facing industry demand slowdown. Managing Director D Ram Reddy reported marginal growth last quarter with increased volumes this quarter, expecting 10-12% volume growth going forward. The company maintained EBITDA margins despite challenges including Chinese dumping and tariff volatility. For Q1 FY26, consolidated revenue declined 7% to Rs 358 crore from Rs 385 crore year-ago, while net profit dropped significantly to Rs 36.53 crore from Rs 445.55 crore in the previous year. The company has applied for anti-dumping protection on some products and expects two upcoming plants to support growth targets from FY27. US clients have agreed to share tariff burden, with the company potentially reducing prices by 2-3% while customers absorb remaining tariff costs. Shares closed 2.66% lower at Rs 1,523.4 on NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1754465733889,
            "Source": "stock"
        },
        {
            "Title": "Balaji Amines Plans ₹750 Crore Specialty Chemical Expansion with 45% Capacity Increase",
            "Summary": "Balaji Amines has outlined a multi-year growth strategy involving a ₹750 crore specialty expansion and a 45% capacity surge. The company is implementing a tech-driven product mix shift and targets scaling up operations by FY27. The growth plan focuses on high-demand import substitutes, green energy initiatives, and expanding global exports.",
            "Sentiment": "positive",
            "PublishDate": 1754405339179,
            "Source": "stock"
        },
        {
            "Title": "Balaji Amines Reports Q1FY26 Results with Revenue Growth Despite Margin Pressure",
            "Summary": "Balaji Amines Limited reported consolidated revenue of ₹367 crore for Q1FY26, up 2% from ₹361 crore in Q4FY25, though down 7% year-on-year from ₹393 crore in Q1FY25. Total volumes increased to 27,570 MT from 25,871 MT in the previous quarter. However, EBITDA declined to ₹64 crore with margins compressing to 17% from 19% in both Q4FY25 and Q1FY25. PAT dropped 10% quarter-on-quarter to ₹37 crore, with diluted EPS at ₹11.73 per share. The company is progressing on multiple expansion projects including Dimethyl Ether (DME) plant expected to be commissioned in FY2025-26, N-Methyl Morpholine facility, and an upgraded Acetonitrile plant for FY2026-27. Subsidiary Balaji Speciality Chemicals received Mega Project status from Maharashtra government for its ₹750 crore expansion covering products like Hydrogen Cyanide and EDTA, with commissioning planned for FY2026-27. The company commissioned an 8 MW DC solar power plant in April 2025 and maintains zero debt status on standalone basis.",
            "Sentiment": "neutral",
            "PublishDate": 1754402478735,
            "Source": "earnings"
        },
        {
            "Title": "Balaji Amines Reports Q1 FY26 Results with Standalone Profit of Rs 398 Crore",
            "Summary": "Balaji Amines Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 3,193.79 crore and profit after tax of Rs 397.99 crore, with basic earnings per share of Rs 12.28. The consolidated results showed revenue from operations of Rs 3,583.41 crore and profit after tax attributable to owners of Rs 379.99 crore, with basic earnings per share of Rs 11.73. The company operates through two main segments: Amines & Speciality Chemicals and Hotel Division. The results were reviewed by M. Anandam & Co., Chartered Accountants, who provided unmodified opinions on both standalone and consolidated financial statements.",
            "Sentiment": "neutral",
            "PublishDate": 1754146133654,
            "Source": "earnings"
        },
        {
            "Title": "Balaji Amines to Start Commercial Production of Isopropylamine",
            "Summary": "Balaji Amines has announced that it will commence commercial production of Isopropylamine on June 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1751287316000,
            "Source": "default"
        },
        {
            "Title": "Balaji Amines Receives Approval for Isopropylamine Manufacturing",
            "Summary": "Balaji Amines has received approval to begin manufacturing Isopropylamine. The company is expected to start trial and commercial production soon.",
            "Sentiment": "positive",
            "PublishDate": 1750852478000,
            "Source": "default"
        },
        {
            "Title": "Balaji Amines: Q4 Results Show Revenue and Margin Decline",
            "Summary": "Balaji Amines reported a 15% decline in Q4 FY25 revenue to ₹353 crore. EBITDA fell 39% to ₹59.7 crore, with margin contracting to 16.9%. PAT decreased 44% to ₹40.4 crore. For FY25, PAT declined 32% to ₹158 crore. The company's stock fell up to 7% following the results announcement.",
            "Sentiment": "negative",
            "PublishDate": 1748496207000,
            "Source": "earnings"
        },
        {
            "Title": "Balaji Amines Q4 Results and Dividend Announcement",
            "Summary": "Balaji Amines has reported its quarterly results and dividend decision. The company recommended a final dividend of 11 rupees per equity share. For Q4, the consolidated net profit was 401 million rupees, down from 680 million rupees year-over-year but up from 332 million rupees quarter-over-quarter. Revenue for Q4 was 3.5 billion rupees, decreased from 4.1 billion rupees year-over-year. EBITDA for Q4 was 597 million rupees, down from 977 million rupees year-over-year, with EBITDA margin at 16.92%, compared to 23.6% in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1748444437000,
            "Source": "result"
        },
        {
            "Title": "Balaji Amines Commissions 6 MW AC Solar Power Plant",
            "Summary": "Balaji Amines has successfully commissioned a 6 MW AC solar power plant. This development indicates the company's investment in renewable energy sources, potentially aimed at reducing operational costs and improving environmental sustainability.",
            "Sentiment": "positive",
            "PublishDate": 1743684204000,
            "Source": "corporate_action"
        },
        {
            "Title": "Anti-Dumping Investigation Initiated on Ethylene Diamine Imports",
            "Summary": "An anti-dumping investigation has been initiated concerning imports of Ethylene Diamine originating from or exported by China PR, European Union, Kingdom of Saudi Arabia, and Taiwan. This investigation may impact Balaji Amines, a potential domestic producer of the chemical.",
            "Sentiment": "neutral",
            "PublishDate": 1743045840000,
            "Source": "corporate_action"
        },
        {
            "Title": "Balaji Amines Reports Decline in Q3 FY24 Financial Results",
            "Summary": "Balaji Amines has reported its financial results for the third quarter. The company's consolidated net profit decreased to 332 million rupees from 494 million rupees in the same quarter last year. Revenue also declined to 3.13 billion rupees from 3.8 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739405811000,
            "Source": "earnings"
        },
        {
            "Title": "Balaji Amines Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Balaji Amines has reported a decrease in its third-quarter EBITDA, which fell to 457 million rupees from 742 million rupees in the same period last year. The company's EBITDA margin also declined, dropping to 14.62% from 19.36% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739369990000,
            "Source": "earnings"
        },
        {
            "Title": "Balaji Amines Reports Decline in Q3 Financial Results",
            "Summary": "Balaji Amines has reported a decrease in both net profit and revenue for the third quarter compared to the same period last year. The consolidated net profit fell to 332 million rupees from 494 million rupees, while revenue declined to 3.13 billion rupees from 3.8 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739369982000,
            "Source": "earnings"
        },
        {
            "Title": "Balaji Amines to Consider Q3 Results on February 12",
            "Summary": "Balaji Amines Limited has announced that it will consider its third quarter (Q3) financial results on February 12. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738759656000,
            "Source": "earnings"
        },
        {
            "Title": "Balaji Amines: Targets Rs 3,000-Crore Revenue in Two Years Amid Expansions",
            "Summary": "Balaji Amines aims to achieve Rs 2,800-3,000 crore revenue in two years with 18-22% EBITDA margins. The company is expanding its dimethylamine and dimethyl ether production, and plans for its subsidiary Balaji Speciality Chemicals. Most expansions will be funded through internal accruals, with potential borrowing for Balaji Speciality Chemicals.",
            "Sentiment": "positive",
            "PublishDate": 1732940857000,
            "Source": "normal_news"
        },
        {
            "Title": "Balaji Amines Reports Improved Q2 Financial Performance",
            "Summary": "Balaji Amines has announced its Q2 financial results, showing an increase in EBITDA to 607 million rupees, up from 538 million rupees in the same quarter last year. The company's EBITDA margin also improved, rising to 17.49% from 14.13% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731591553000,
            "Source": "result"
        },
        {
            "Title": "Balaji Amines Reports Q2 FY2024 Financial Results",
            "Summary": "Balaji Amines has announced its Q2 FY2024 financial results. The company's consolidated net profit increased to 410 million rupees, up from 341 million rupees year-over-year. However, revenue decreased to 3.5 billion rupees from 3.8 billion rupees in the same period last year. Compared to the previous quarter, net profit decreased slightly from 433 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1731591502000,
            "Source": "result"
        }
    ]
}