{
    "Symbol": "BALKRISIND",
    "ISIN": "INE787D01026",
    "News": [
        {
            "Title": "Balkrishna Industries Block Trade Worth Rs. 20.43 Cr",
            "Summary": "Balkrishna Industries witnessed a significant NSE block trade worth Rs. 20.43 crores involving approximately 81,979 shares at Rs. 2492.60 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1770090708852,
            "Source": "co_actions_results"
        },
        {
            "Title": "Balkrishna Industries Q3 EBITDA Rises to 6.4B Rupees",
            "Summary": "Balkrishna Industries reports Q3 EBITDA of 6.4 billion rupees, up from 6 billion rupees year-over-year, while EBITDA margin remains stable at 23.46%.",
            "Sentiment": "positive",
            "PublishDate": 1769612333241,
            "Source": "co_actions_results"
        },
        {
            "Title": "BIL Discloses Q3 FY26 Commercial Paper Usage",
            "Summary": "Balkrishna Industries Limited filed regulatory disclosure for commercial paper proceeds usage during Q3 FY26, confirming compliance with SEBI listing requirements for two commercial paper issues.",
            "Sentiment": "neutral",
            "PublishDate": 1769609028626,
            "Source": "stocks"
        },
        {
            "Title": "Balkrishna Industries Board Meet on Jan 28 for Q3 Results",
            "Summary": "Balkrishna Industries has scheduled a board meeting on January 28, 2026, to consider Q3FY26 unaudited financial results and declare the 3rd interim dividend for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1769080381030,
            "Source": "co_actions_results"
        },
        {
            "Title": "Balkrishna Industries Plans Singapore Investor Meet",
            "Summary": "Balkrishna Industries has scheduled investor interactions in Singapore for February 5-6, 2026, organized by JM Financial. The meetings will focus on publicly available information only.",
            "Sentiment": "neutral",
            "PublishDate": 1768552494910,
            "Source": "stocks"
        },
        {
            "Title": "BKT Responds to IIAS Vote Against CEO Reappointment",
            "Summary": "Balkrishna Industries defends Chairman Arvind Poddar's reappointment proposal after proxy advisor IIAS recommends voting against resolution citing uncapped expense reimbursements and commission structure concerns.",
            "Sentiment": "neutral",
            "PublishDate": 1767966098402,
            "Source": "stocks"
        },
        {
            "Title": "BKT Clarifies Chairman's Travel Expense Limit",
            "Summary": "Balkrishna Industries sets ₹2 crore annual cap on Chairman's family travel reimbursements, responds to proxy advisor concerns ahead of postal ballot voting.",
            "Sentiment": "neutral",
            "PublishDate": 1767966003007,
            "Source": "stocks"
        },
        {
            "Title": "Balkrishna Industries Issues Postal Ballot Notice",
            "Summary": "Balkrishna Industries issues postal ballot notice for director appointments including CMD re-appointment. E-voting scheduled from December 24, 2025 to January 22, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766148045608,
            "Source": "stocks"
        },
        {
            "Title": "Balkrishna Industries Sees Rs. 58.71 Crore Block Trade on NSE",
            "Summary": "Balkrishna Industries executed a block trade worth Rs. 58.71 crores involving 242,471 shares at Rs. 2,421.50 per share on the NSE. The transaction represents a significant institutional or bulk investor activity in the tire manufacturer's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1764745250518,
            "Source": "order&deals"
        },
        {
            "Title": "Balkrishna Industries Q2 Results: US Tariff Hike to 50% Severely Impacts Sales, Company Maintains Long-term Growth Vision",
            "Summary": "Balkrishna Industries reported Q2 volumes of 70,252 MT, declining 4% year-on-year, with standalone revenue at INR 2,360 crores including a realized forex loss of INR 68 crores on sales. The company faced severe impact from US import duties increasing to 50%, affecting approximately 10% of last year's sales volume, leading to halted shipments to US markets. EBITDA for the quarter stood at INR 500 crores with 21.5% margin, impacted by lower American sales, higher India sales, and inventory creation for EU Deforestation Regulation compliance. The company declared a second interim dividend of INR 4 per share and spent approximately INR 1,737 crores on capex in H1. Management expects full-year capex of INR 2,000-2,200 crores and maintains its long-term vision of achieving INR 23,000 crores revenue by 2030. BKT received excellence recognition from Caterpillar for the fourth consecutive year and inaugurated a vehicle testing facility at NATRAX. The company remains optimistic about trade agreement resolution between India and US while strengthening market positions in India and Europe.",
            "Sentiment": "neutral",
            "PublishDate": 1762334131787,
            "Source": "earnings"
        },
        {
            "Title": "Balkrishna Industries Plans TBR Tire Production Launch, Targets Rs 5,000 Cr Revenue by 2030",
            "Summary": "Balkrishna Industries will begin pilot production of TBR (Truck and Bus Radial) tires in Q4, with full commercial production planned for the second half of the next fiscal year. The company has decided against providing short-term guidance citing global volatility. Balkrishna Industries has set a long-term revenue target of Rs 5,000 crore by 2030, aiming to capture a 7-8% market share.",
            "Sentiment": "positive",
            "PublishDate": 1762140530211,
            "Source": "stock"
        },
        {
            "Title": "Balkrishna Industries Plans Capacity Expansion to 4.25 Lakh MTPA",
            "Summary": "Balkrishna Industries plans to expand its total achievable tire capacity to approximately 4.25 lakh MTPA through ongoing capital expenditure and debottlenecking initiatives. The company aims to maintain self-reliance in carbon black production to strengthen sourcing security. The expansion strategy includes diversification across agriculture, OTR, industrial, and mining segments. The company targets consolidating global market share while sustaining profitability through efficiency gains and cost optimization measures.",
            "Sentiment": "positive",
            "PublishDate": 1761917821908,
            "Source": "stock"
        },
        {
            "Title": "Balkrishna Industries Reports Q2FY26 Revenue Decline, Announces Rs 23,000 Crore Growth Target by 2030",
            "Summary": "Balkrishna Industries reported Q2FY26 revenue of Rs 2,320 crore, down 6% year-on-year, with sales volume declining 4% to 70,252 MT. EBITDA fell 19% to Rs 500 crore with margins contracting to 21.5% from 25.1%. Net profit dropped 24% to Rs 265 crore. For H1FY26, revenue was Rs 5,079 crore (down 2%) with net profit declining 33% to Rs 552 crore. The company announced ambitious growth plans targeting Rs 23,000 crore revenue by FY30, representing 2.2x growth with 17% CAGR over 5 years. The strategy includes Rs 3,500 crore capex over 3 years for carbon black expansion, rubber tracks, and new tire categories. BKT plans to achieve 8% global market share in off-highway tires and enter new segments including premium passenger car radial tires (Q4FY26) and commercial vehicle radial tires (Q3FY27). The company will expand carbon black capacity from 200,000 MTPA to 360,000 MTPA by early 2026. BKT declared an interim dividend of Rs 4 per equity share for Q2FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1761917172263,
            "Source": "earnings"
        },
        {
            "Title": "Balkrishna Industries Reports Decline in Q2 Profitability, Announces Rs 4 Dividend",
            "Summary": "Balkrishna Industries reported Q2 EBITDA of Rs 5.12 billion compared to Rs 5.8 billion in the previous year, with EBITDA margin declining to 21.39% from 23.96%. Consolidated net profit fell to Rs 2.7 billion from Rs 3.46 billion year-over-year. Revenue decreased slightly to Rs 23.9 billion from Rs 24.2 billion. The company declared a dividend of Rs 4 per share.",
            "Sentiment": "negative",
            "PublishDate": 1761912899195,
            "Source": "earnings"
        },
        {
            "Title": "Balkrishna Industries Schedules Earnings Conference Call for Q2 & H1FY26 Results",
            "Summary": "Balkrishna Industries Limited has announced an earnings conference call scheduled for November 1, 2025, at 10:00 AM IST to discuss operational and financial performance for Q2 & H1FY26. The call will be represented by Joint MD Mr. Rajiv Poddar along with the senior management team. The company has provided local and toll-free access numbers for participants across multiple countries including India, USA, UK, Singapore, Hong Kong, and Australia, with pre-registration required through a provided link.",
            "Sentiment": "neutral",
            "PublishDate": 1761556765884,
            "Source": "earnings"
        },
        {
            "Title": "Balkrishna Industries Sets Record Date for Second Interim Dividend",
            "Summary": "Balkrishna Industries Limited has announced November 7, 2025 as the record date for payment of its second interim dividend for financial year 2025-26. The dividend will be paid to equity shareholders whose names appear on the company's Register of Members on the specified record date. The announcement was made through a communication to BSE and National Stock Exchange of India.",
            "Sentiment": "positive",
            "PublishDate": 1761290675980,
            "Source": "corporate_action"
        },
        {
            "Title": "Balkrishna Industries Block Trade Worth Rs. 34.25 Crores on NSE",
            "Summary": "Balkrishna Industries Ltd. executed a block trade on the National Stock Exchange worth Rs. 34.25 crores. The transaction involved approximately 150,479 shares at a price of Rs. 2,275.90 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1756706224615,
            "Source": "order&deals"
        },
        {
            "Title": "Balkrishna Industries Reports Q1 FY26 Results with 23.8% EBITDA Margin Amid US Tariff Challenges",
            "Summary": "Balkrishna Industries achieved sales volume of 80,664 metric tons in Q1 FY26, marginally lower than the previous year. Stand-alone revenue stood at INR 2,759 crores with EBITDA of INR 655 crores at 23.8% margin. Profit after tax declined approximately 40% to INR 287 crores, primarily due to mark-to-market losses of INR 154 crores. The company faced tariff-related disruptions in the US market, with current tariffs at 10% where customers bear 60% and the company absorbs 40%. India business contributed 35% to sales volumes with 14.4% year-on-year growth. The company declared an interim dividend of INR 4 per equity share. Management maintained EBITDA margin guidance of 24-25% and confirmed capex plans for OTR, Carbon Black, PCR and CVR segments are on schedule.",
            "Sentiment": "neutral",
            "PublishDate": 1754046161463,
            "Source": "earnings"
        },
        {
            "Title": "Balkrishna Industries Expands into PCR/TBR Segments, Tests New Production Lines",
            "Summary": "Balkrishna Industries plans to introduce passenger car radial (PCR) and commercial vehicle segments in India, focusing on premium products in its new PCR/TBR range. The company is currently testing rubber track production. Additionally, an advanced carbon black product with 30,000 tonnes capacity remains in trial stage, with production ramp-up expected by year-end.",
            "Sentiment": "positive",
            "PublishDate": 1753760253477,
            "Source": "stock"
        },
        {
            "Title": "Balkrishna Industries Maintains EBITDA Margin Guidance at 24-25% Amid Business Expansion",
            "Summary": "Balkrishna Industries has maintained its EBITDA margin guidance at 24-25% despite pursuing new business lines and market expansion efforts. The company stated it is too early to provide volume predictions for FY26 and expects raw material prices to remain steady in the short term.",
            "Sentiment": "neutral",
            "PublishDate": 1753759850274,
            "Source": "stock"
        },
        {
            "Title": "Balkrishna Industries Reports 43% Drop in Q1 Net Profit Despite Revenue Growth",
            "Summary": "Balkrishna Industries reported Q1 consolidated net profit of 2.8 billion rupees, down from 4.89 billion rupees in the same period last year. Revenue increased to 27.6 billion rupees from 27.14 billion rupees year-over-year. EBITDA declined to 5 billion rupees from 6.6 billion rupees, while margins compressed to 18.33% from 24.45% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1753662265899,
            "Source": "earnings"
        },
        {
            "Title": "Balkrishna Industries Reports Q1 Results with Revenue Growth Despite Volume Decline, Announces Expansion Plans",
            "Summary": "Balkrishna Industries reported Q1FY26 results showing revenue growth of 1% year-on-year to Rs. 2,759 crores despite a 3% decline in sales volume to 80,664 MT. EBITDA fell 8% to Rs. 655 crores with margins contracting to 23.8% from 26.0% in the previous year. Net profit dropped significantly by 40% to Rs. 287 crores, impacted by mark-to-market losses of Rs. 154 crores due to forex rate fluctuations. The company declared a first interim dividend of Rs. 4 per equity share. Balkrishna outlined ambitious growth plans targeting 2.2x revenue growth to Rs. 23,000 crores by FY30, driven by expansion in OHT segments, carbon black capacity increase from 200,000 MTPA to 360,000 MTPA, and entry into new tire categories including commercial vehicle radial tires and premium passenger car radial tires for the Indian market. The company plans Rs. 3,500 crores in growth capex over the next three years and aims to achieve 8% global market share in the OHT segment.",
            "Sentiment": "neutral",
            "PublishDate": 1753531593711,
            "Source": "earnings"
        },
        {
            "Title": "Balkrishna Industries Reports 43% Drop in Q1 Net Profit, Declares Rs 4 Dividend",
            "Summary": "Balkrishna Industries reported a consolidated net profit of Rs 2.8 billion for Q1, down from Rs 4.89 billion in the same period last year, representing a 43% decline. Revenue showed marginal growth to Rs 27.6 billion compared to Rs 27.14 billion year-over-year. The company declared a dividend of Rs 4 per share.",
            "Sentiment": "negative",
            "PublishDate": 1753527190872,
            "Source": "corporate_action"
        },
        {
            "Title": "Balkrishna Industries Reports Q1 FY26 Results with Rs 2,752 Crores Revenue and Declares Rs 4 Interim Dividend",
            "Summary": "Balkrishna Industries Limited reported consolidated revenue of Rs 2,752.38 crores and net profit of Rs 288.30 crores for the quarter ended June 30, 2025. The company's standalone revenue stood at Rs 2,760.46 crores with a net profit of Rs 287.17 crores. The Board declared an interim dividend of Rs 4 per equity share (200% on face value of Rs 2), with payment to be made within 30 days to shareholders as on record date July 31, 2025. The cash outgo for the interim dividend will be Rs 77.32 crores. The company's earnings per share on consolidated basis was Rs 14.91 for the quarter. The results were approved by the Board of Directors in their meeting held on July 26, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753526058362,
            "Source": "earnings"
        },
        {
            "Title": "Balkrishna Industries Sets July 31, 2025 as Record Date for Potential 1st Interim Dividend",
            "Summary": "Balkrishna Industries Limited has fixed July 31, 2025 as the record date to determine shareholder eligibility for the potential 1st Interim Dividend for financial year 2025-26. The Board Meeting to decide on the dividend declaration will be held on July 26, 2025. If declared, the interim dividend will be credited or dispatched within 30 days from the declaration date to eligible shareholders as per the Companies Act, 2013 provisions.",
            "Sentiment": "neutral",
            "PublishDate": 1753158808176,
            "Source": "corporate_action"
        },
        {
            "Title": "Balkrishna Industries Schedules Q1 FY26 Earnings Conference Call for July 28",
            "Summary": "Balkrishna Industries Limited has scheduled an earnings conference call on Monday, July 28th, 2025 at 11:00 AM IST to discuss operational and financial performance for Q1 FY26. The call will be represented by Mr. Rajiv Poddar, Joint MD, along with the senior management team. The company has provided pre-registration details and multiple access numbers including international dial-in options for USA, UK, Singapore, and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1753155458520,
            "Source": "earnings"
        },
        {
            "Title": "Balkrishna Industries Block Trade on NSE",
            "Summary": "A block trade of approximately 500,048 shares of Balkrishna Industries Ltd. occurred on the National Stock Exchange (NSE) at a price of Rs. 2665.50 per share. The total value of the transaction was Rs. 133.29 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1752558179000,
            "Source": "block_details"
        },
        {
            "Title": "Balkrishna Industries: Tyre Expansion Raises Margin Concerns",
            "Summary": "Balkrishna Industries shares fell 8% after announcing entry into passenger car and truck tyre segments, with a Rs 3,500 crore investment plan over five years. Q4 results missed estimates, with net profit down 24.7%. Analysts express caution over the strategic shift, citing potential margin pressure and execution risks.",
            "Sentiment": "negative",
            "PublishDate": 1748238766000,
            "Source": "corporate_action"
        },
        {
            "Title": "Balkrishna Industries: Q4 Results Disappoint as Margins Contract",
            "Summary": "Balkrishna Industries' Q4 standalone revenue rose 2.8% YoY to Rs 2,746.6 crore, but EBITDA fell 9.6% to Rs 602 crore. EBITDA margin contracted to 21.9% from 24.9% last year. Net profit dropped 24.7% to Rs 362 crore, missing analyst estimates. Share price tumbled 10% following the results.",
            "Sentiment": "negative",
            "PublishDate": 1748232164000,
            "Source": "earnings"
        },
        {
            "Title": "Balkrishna Industries: Q4 Profit Drops 25% Despite Revenue Growth",
            "Summary": "Balkrishna Industries reported a 25% decrease in Q4FY25 net profit to ₹362 crore, despite a 5% revenue increase to ₹2,838 crore. FY25 net profit rose 13% to ₹1,628 crore. The company announced a ₹4 per share final dividend and plans ₹3,500 crore capex over three years for expansion at Bhuj, including new tyre production facilities.",
            "Sentiment": "neutral",
            "PublishDate": 1748020348000,
            "Source": "earnings"
        },
        {
            "Title": "Balkrishna Industries Q4 Results and Dividend Announcement",
            "Summary": "Balkrishna Industries reported its Q4 financial results. The company's consolidated net profit decreased to 3.7 billion rupees from 4.87 billion rupees year-over-year. Revenue increased to 27.5 billion rupees from 26.82 billion rupees year-over-year. EBITDA declined to 6.14 billion rupees from 6.8 billion rupees, with EBITDA margin decreasing to 22.31% from 25.4% year-over-year. The company has recommended a dividend of 4 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1748007789000,
            "Source": "result"
        },
        {
            "Title": "Balkrishna Industries: Q3 Revenue Meets Estimates with 11% YoY Growth",
            "Summary": "Balkrishna Industries reported Q3 FY25 revenue of Rs 25.72 billion, aligning with estimates of Rs 25.25 billion. This represents an 11% year-over-year increase and a 4.3% quarter-over-quarter growth.",
            "Sentiment": "positive",
            "PublishDate": 1738035238000,
            "Source": "earnings"
        },
        {
            "Title": "Balkrishna Industries Reports Strong Q3 Financial Performance",
            "Summary": "Balkrishna Industries Ltd has announced its Q3 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's net profit increased to 4.39 billion rupees, up from 3 billion rupees in the same quarter last year and 3.49 billion rupees in the previous quarter. Revenue also saw a rise, reaching 25.60 billion rupees compared to 22.74 billion rupees year-over-year and 24.19 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737936756000,
            "Source": "earnings"
        },
        {
            "Title": "Balkrishna Industries: Q3 Profit Soars 47%, Declares Interim Dividend",
            "Summary": "Balkrishna Industries reported a 47% YoY increase in Q3 FY24-25 net profit to ₹449.5 crore. Revenue grew 12.6% YoY to ₹2,560.3 crore. EBITDA rose 11.1% to ₹600.7 crore. The company declared an interim dividend of ₹4 per share.",
            "Sentiment": "positive",
            "PublishDate": 1737811521000,
            "Source": "earnings"
        },
        {
            "Title": "Balkrishna Industries Ltd: Large Block Trade on NSE",
            "Summary": "A significant block trade occurred for Balkrishna Industries Ltd on the National Stock Exchange (NSE). Approximately 190,121 shares were traded at a price of Rs. 2,735.00 per share, amounting to a total transaction value of Rs. 52.00 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1732860389000,
            "Source": "block_deals"
        },
        {
            "Title": "Balkrishna Industries Reports Improved Q2 Financial Performance",
            "Summary": "Balkrishna Industries has announced its Q2 financial results, showing an increase in EBITDA to 5.8 billion rupees from 5.3 billion rupees year-over-year. The company's EBITDA margin also improved, rising to 23.96% from 23.64% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1729860207000,
            "Source": "result"
        },
        {
            "Title": "Balkrishna Industries Reports Q2 FY24 Financial Results",
            "Summary": "Balkrishna Industries has announced its Q2 financial results. The company reported a consolidated net profit of 3.46 billion rupees, slightly down from 3.5 billion rupees year-over-year, but down significantly from 4.9 billion rupees quarter-over-quarter. Revenue for Q2 increased to 24.2 billion rupees, up from 22.5 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1729860047000,
            "Source": "result"
        },
        {
            "Title": "Balkrishna Industries Declares Second Interim Dividend",
            "Summary": "Balkrishna Industries has announced a second interim dividend of 4 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1729859919000,
            "Source": "corporate_action"
        }
    ]
}