{
    "Symbol": "BALMLAWRIE",
    "ISIN": "INE164A01016",
    "News": [
        {
            "Title": "Balmer Lawrie Q3FY26 Results: Net Income Rises 2.02%",
            "Summary": "Balmer Lawrie & Co. Ltd. reported Q3FY26 net income of Rs. 660.55 crore, up 2.02% QoQ. PBT increased 5.65% to Rs. 69.20 crore while net profit grew 4.66% to Rs. 50.74 crore for quarter ended December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1770385153942,
            "Source": "co_actions_results"
        },
        {
            "Title": "Balmer Lawrie Amends Related Party Transactions Policy",
            "Summary": "Balmer Lawrie & Co. Ltd. board approved amendments to its Related Party Transactions Policy under Regulation 23(1) of SEBI Listing Regulations during its February 6, 2026 meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1770384006916,
            "Source": "stocks"
        },
        {
            "Title": "Balmer Lawrie Board Meet Set for Feb 6 to Review Q3 Results",
            "Summary": "Balmer Lawrie & Co. Ltd. has scheduled its board meeting for February 6, 2026, to approve Q3FY26 unaudited financial results. Trading window remains closed until 48 hours post-declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1769523416420,
            "Source": "co_actions_results"
        },
        {
            "Title": "Balmer Lawrie Announces Senior Management Designation Changes",
            "Summary": "Balmer Lawrie & Co. Ltd. disclosed changes in senior management designations effective October 15, 2025, with Ashok Kumar Gupta's role changing from Chief Operating Officer (Travel) to Chief Operating Officer Travel & Vacations and Thiyagarajan S moving from Vice President Vacations to Head (Vacations). Both appointments carry a term of 1.29 years as part of the company's organizational restructuring in its travel and vacation business segments.",
            "Sentiment": "neutral",
            "PublishDate": 1764599025864,
            "Source": "corporate_governance"
        },
        {
            "Title": "Balmer Lawrie Government Nominee Director Rajeev Kumar Steps Down",
            "Summary": "Shri Rajeev Kumar ceased his role as Non-Executive Director and Government Nominee Director at Balmer Lawrie & Company Limited effective November 17, 2025, following withdrawal of nomination by the Ministry of Petroleum and Natural Gas. The Board of Directors noted and recorded this cessation through a Resolution by Circulation on the same date.",
            "Sentiment": "neutral",
            "PublishDate": 1763383103508,
            "Source": "corporate_governance"
        },
        {
            "Title": "Balmer Lawrie Reports Mixed Q2 Results with Revenue Decline but Improved Margins",
            "Summary": "Balmer Lawrie & Investments reported Q2 consolidated net profit of 368.8 million rupees, down from 404.7 million rupees year-over-year. Revenue decreased slightly to 6.39 billion rupees from 6.41 billion rupees in the same period last year. However, EBITDA improved to 286.7 million rupees compared to 256.3 million rupees year-over-year, with EBITDA margin expanding to 4.49% from 4%.",
            "Sentiment": "neutral",
            "PublishDate": 1762863368373,
            "Source": "earnings"
        },
        {
            "Title": "Balmer Lawrie Appoints Statutory and Branch Auditors for Financial Year 2025-26",
            "Summary": "Balmer Lawrie Co. Ltd.'s Board of Directors approved the appointment of statutory and branch auditors for the financial year 2025-26, as designated by the Comptroller and Auditor General of India (C&AG). M/s. B Chhawchharia & Co. was appointed as statutory auditors, while three firms were designated as branch auditors for different regions: M/s. D R Mohnot & Co. for the Western Region, M/s. G C Daga & Co. for the Southern Region, and M/s. SNR Company for the Northern Region. The appointments are effective from November 6, 2025, for conducting audits during the financial year 2025-26. The Board meeting was held on November 6, 2025, commencing at 5:00 p.m. and concluding at 8:40 p.m.",
            "Sentiment": "neutral",
            "PublishDate": 1762484018723,
            "Source": "corporate_governance"
        },
        {
            "Title": "Balmer Lawrie Reports Decline in Q2 Financial Performance",
            "Summary": "Balmer Lawrie & Co reported consolidated net profit of 566 million rupees for Q2, down from 625 million rupees in the same quarter last year. Revenue decreased to 6.35 billion rupees from 6.4 billion rupees year-over-year. EBITDA fell to 675 million rupees compared to 701 million rupees in the previous year's corresponding quarter. The company's EBITDA margin compressed to 10.62% from 10.97% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762445944844,
            "Source": "earnings"
        },
        {
            "Title": "Balmer Lawrie Announces Senior Management Changes in Industrial Packaging Division",
            "Summary": "Balmer Lawrie & Co. Ltd. announced senior management changes effective March 1, 2026. N V Balaji will cease to be Chief Operating Officer (Industrial Packaging) due to superannuation. J Suresh Antony will be promoted from Vice President (Manufacturing) - IP Chitoor to Head (Industrial Packaging) and will join the senior management team. Antony is a mechanical engineer with over 31 years of experience in machine operations and process optimization, serving at Balmer Lawrie since 1997. The Board of Directors approved these changes at their meeting on November 6, 2025, following recommendations from the Nomination and Remuneration Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1762445907424,
            "Source": "corporate_governance"
        },
        {
            "Title": "Balmer Lawrie Confirms Exit from Refinery and Oil Field Services Business by FY 2026-27",
            "Summary": "Balmer Lawrie & Co. Ltd. has confirmed plans to gradually exit its refinery and oil field services business by the end of Financial Year 2026-27, following board approval in May 2025 for the closure of its Strategic Business Unit: Refinery and Oil Field Services (SBU:ROFS). The Board of Directors approved the closure decision on May 15, 2025, after completion of ongoing projects. The company had previously informed stock exchanges about this decision through multiple filings on BSE and NSE on May 15-16, 2025. All existing contracts will be completed before closure, and the company stated no negotiations were required for this decision. The announcement came in response to BSE's inquiry about a news article regarding the business exit plans.",
            "Sentiment": "neutral",
            "PublishDate": 1758889372307,
            "Source": "stock"
        },
        {
            "Title": "Balmer Lawrie Appoints Five New Directors Including Government Nominees and Independent Directors",
            "Summary": "Balmer Lawrie & Co. Ltd. announced the appointment of five new directors approved at its 108th Annual General Meeting held on September 23, 2025. The appointments include Amit Bansal as Government Nominee Director for a short-term period from October 25, 2024 to December 31, 2024, with his nomination subsequently withdrawn by the Administrative Ministry on December 30, 2024. Harishkumar Madhusudan Joshi and Dr. Vandana Minda Heda were appointed as Non-Executive Independent Directors effective March 31, 2025, for one-year terms. Rajeev Kumar was appointed as Government Nominee Director from July 1, 2025 to June 18, 2028. Romon Sebastian Louis was appointed as Director (Service Businesses) for five years starting August 22, 2025, with a salary scale of Rs. 1,60,000-2,90,000. All appointees have been confirmed as not being debarred from holding director positions by regulatory authorities.",
            "Sentiment": "neutral",
            "PublishDate": 1758804991462,
            "Source": "corporate_governance"
        },
        {
            "Title": "Balmer Lawrie Discloses BSE and NSE Fines for Board Composition Non-Compliance",
            "Summary": "Balmer Lawrie & Co. Ltd. disclosed that BSE and NSE imposed fines on the company for non-compliance with board composition regulations 17(1) and 19(1) for the quarter ended June 30, 2025. The company's Board of Directors noted that as a Central Public Sector Enterprise under the Ministry of Petroleum & Natural Gas, board appointments are controlled by the President of India, making the non-compliance due to factors beyond the company's control. The board clarified that while fines were imposed regarding Regulation 19(2), the Chairperson of the Nomination and Remuneration Committee was an Independent Director, which was compliant during the review period. The company has made representations to the stock exchanges seeking waiver of the fines.",
            "Sentiment": "negative",
            "PublishDate": 1757938658702,
            "Source": "corporate_governance"
        },
        {
            "Title": "Balmer Lawrie Promotes Rajesh Raghavan to Head of Logistics Infrastructure",
            "Summary": "Balmer Lawrie & Co. Ltd. announced a senior management change involving Rajesh Raghavan's promotion from Vice President (Operations) to Head (Logistics Infrastructure). The designation change took effect from September 2, 2025, with an appointment term of 6.75 years until May 2032 when Raghavan reaches age 60. The position became vacant following Romon Sebastian Louis's appointment from Executive Director (Logistics Infrastructure & Cold Chain) to Director (Service Business). In his new role, Raghavan will oversee the entire Logistics Infrastructure business, including Warehousing & Distribution and Container Freight Stations.",
            "Sentiment": "neutral",
            "PublishDate": 1756994655017,
            "Source": "corporate_governance"
        },
        {
            "Title": "Balmer Lawrie Announces Leadership Changes with New Director Appointment and Charge Removal",
            "Summary": "Balmer Lawrie & Co. Ltd. made several leadership changes effective August 22, 2025. The company removed the additional charge of Director (Service Businesses) from Mr. Adhip Nath Palchaudhuri, Chairman & Managing Director, following the appointment of a regular incumbent. Mr. Romon Sebastian Louis was appointed as Executive Director in the designation of Director (Service Businesses), subject to shareholder approval. Louis, who has been with the company for nearly three decades since 1998, previously served as Executive Director (Logistics Infrastructure & Cold Chain). His appointment resulted in a change to the company's senior management structure. The Ministry of Petroleum and Natural Gas nominated Louis for a five-year term. The company also revised its 108th AGM notice and annual report for Financial Year 2024-25 to reflect these directorate changes, and reopened its trading window on August 23, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755955281842,
            "Source": "corporate_governance"
        },
        {
            "Title": "Balmer Lawrie Cancels Two Major Projects Due to Unfavorable Business Environment",
            "Summary": "Balmer Lawrie & Co. Ltd. has cancelled two significant projects following board decisions made on August 6, 2025. The company cancelled its project to set up a 200 KLPD Grain Based Ethanol Plant in Andhra Pradesh due to unfavorable changes in the business environment affecting the risk-reward scenario. Additionally, the board approved surrendering the CAPEX for setting up a Free Trade Warehousing Zone in the Special Economic Zone of Jawaharlal Nehru Port Authority on approximately 15 acres of land. The warehousing project was deemed unattractive from an investment perspective due to a significant decline in Internal Rate of Return. The company plans to explore alternate possibilities for both cancelled projects.",
            "Sentiment": "negative",
            "PublishDate": 1754482820511,
            "Source": "stock"
        },
        {
            "Title": "Balmer Lawrie Reports Strong Q1 Performance with Higher Profits and Margins",
            "Summary": "Balmer Lawrie & Co delivered improved quarterly results with consolidated net profit rising to 689 million rupees from 638 million rupees year-over-year. Revenue increased to 6.8 billion rupees compared to 6.38 billion rupees in the same period last year. The company's EBITDA grew significantly to 832 million rupees from 639 million rupees, while EBITDA margin expanded to 12.22% from 10.02% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1754479878458,
            "Source": "earnings"
        },
        {
            "Title": "Balmer Lawrie & Co Reports Q4 Financial Results",
            "Summary": "Balmer Lawrie & Co has released its Q4 financial results. The company's EBITDA increased to 946 million rupees from 915 million rupees year-over-year. The EBITDA margin slightly decreased to 15.6% from 15.8% year-over-year. Consolidated net profit rose to 752 million rupees from 738 million rupees year-over-year. Revenue increased to 6.1 billion rupees from 5.8 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747361759000,
            "Source": "result"
        },
        {
            "Title": "Balmer Lawrie & Co. to Consider Q4 Results on May 15",
            "Summary": "Balmer Lawrie & Co. has announced that it will consider and approve its fourth quarter (Q4) financial results on May 15. This is a routine corporate announcement regarding the company's upcoming earnings release.",
            "Sentiment": "neutral",
            "PublishDate": 1745849518000,
            "Source": "default"
        },
        {
            "Title": "Balmer Lawrie & Investments Reports Slight Increase in Q3 Net Profit and Revenue",
            "Summary": "Balmer Lawrie & Investments has reported its financial results for the third quarter. The company's net profit increased to 19 million rupees from 18 million rupees in the same quarter last year. Revenue also saw growth, rising to 29 million rupees from 26 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739449355000,
            "Source": "earnings"
        },
        {
            "Title": "Balmer Lawrie & Co Reports Improved Q3 EBITDA and Margin",
            "Summary": "Balmer Lawrie & Co has reported an increase in its Q3 EBITDA to 839 million rupees, up from 735 million rupees in the same quarter last year. The company's EBITDA margin also improved to 13.31% from 12.58% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739192479000,
            "Source": "earnings"
        },
        {
            "Title": "Balmer Lawrie & Co Reports Q3 Financial Results",
            "Summary": "Balmer Lawrie & Co has announced its Q3 financial results. The company's consolidated net profit slightly decreased to 644 million rupees from 666 million rupees year-over-year. However, revenue increased to 6.3 billion rupees from 5.85 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739192474000,
            "Source": "earnings"
        },
        {
            "Title": "Balmer Lawrie Issues Undertaking to Power Finance Corp for Subsidiary Debt",
            "Summary": "Balmer Lawrie has issued an undertaking to Power Finance Corporation, agreeing to infuse funds for debt servicing by its subsidiary. The company has provided a shortfall undertaking to the lender of its subsidiary for up to 765 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1737559363000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Balmer Lawrie to Consider Q3 Results on February 10",
            "Summary": "Balmer Lawrie & Co. Ltd. has announced that it will be considering its financial results for the third quarter on February 10. This indicates that the company is preparing to release its earnings report for the latest financial period.",
            "Sentiment": "neutral",
            "PublishDate": 1737468354000,
            "Source": "earnings"
        },
        {
            "Title": "Balmer Lawrie Announces 10 Million Rupees Equity Funding to NAPTAPGO",
            "Summary": "Balmer Lawrie and Co. has announced an equity funding of 10 million rupees to NAPTAPGO. This investment decision represents a significant corporate action by the company, potentially aimed at expanding its business interests or strengthening its market position.",
            "Sentiment": "neutral",
            "PublishDate": 1735829607000,
            "Source": "corporate_action"
        },
        {
            "Title": "Balmer Lawrie Enters Rail Logistics Sector",
            "Summary": "Balmer Lawrie and Company has expanded its operations into the rail logistics sector by signing an agreement with GATX India. This move marks the company's entry into a new business segment, potentially diversifying its revenue streams and expanding its service offerings in the logistics industry.",
            "Sentiment": "positive",
            "PublishDate": 1731328769000,
            "Source": "corporate_action"
        },
        {
            "Title": "Balmer Lawrie & Co Reports Q2 Financial Results",
            "Summary": "Balmer Lawrie & Co announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 was 701 million rupees, compared to 749 million rupees in the same quarter last year. The EBITDA margin decreased to 10.97% from 12.79% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730811503000,
            "Source": "result"
        },
        {
            "Title": "Balmer Lawrie & Co Reports Q2 Revenue Growth",
            "Summary": "Balmer Lawrie & Co has reported a revenue of 6.4 billion rupees for the second quarter, compared to 5.9 million rupees in the same period last year, indicating significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730811493000,
            "Source": "result"
        },
        {
            "Title": "Balmer Lawrie & Co Reports Q2 Financial Results",
            "Summary": "Balmer Lawrie & Co announced its Q2 consolidated net profit of 625 million rupees, compared to 638 million rupees in the same quarter last year and 638 million rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1730811465000,
            "Source": "result"
        }
    ]
}