{
    "Symbol": "BALPHARMA",
    "ISIN": "INE083D01012",
    "News": [
        {
            "Title": "Bal Pharma Q3FY26 Net Profit Surges 181.84% YoY",
            "Summary": "Bal Pharma Limited reported strong Q3FY26 results with net profit jumping 181.84% YoY to ₹194.62 lakhs. Revenue from operations grew 20.03% to ₹8,749.48 lakhs, driven by improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1770816699357,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bal Pharma Limited Reports Quarterly Results and Appoints New Independent Director",
            "Summary": "Bal Pharma Limited's Board approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company reported standalone revenue from operations of Rs 7,470.00 lakhs for the quarter, with a net profit of Rs 80.18 lakhs. For the half year, revenue stood at Rs 13,908.84 lakhs with net profit of Rs 175.68 lakhs. The Board also appointed Dr. Bheekamchand Mukesh as an additional Non-executive Independent Director. Dr. Mukesh brings 35 years of experience in pharmaceutical research, development and commercialization. The statutory auditors issued an unmodified opinion on the financial results.",
            "Sentiment": "positive",
            "PublishDate": 1762956133784,
            "Source": "earnings"
        },
        {
            "Title": "Bal Pharma Defers Subsidiary Merger Decision Due to Inadequate Data",
            "Summary": "Bal Pharma Limited has deferred its decision on the proposed merger of its subsidiary Lifezen Healthcare Pvt Ltd with the company. The Board of Directors considered the merger proposal during their meeting but decided to postpone the matter due to inadequate data. The board has instructed management to re-present the proposal with all necessary details to enable an informed decision. The company had previously notified exchanges about including this merger proposal among the agenda items for the board meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1762518893117,
            "Source": "corporate_action"
        },
        {
            "Title": "Bal Pharma Sets September 18, 2025 as Record Date for Dividend Payment",
            "Summary": "Bal Pharma Limited's Board of Directors has fixed September 18, 2025 as the record date for dividend payment for the financial year ended March 31, 2025. The dividend payment is subject to shareholder approval at the company's 38th Annual General Meeting scheduled for September 25, 2025. The board decision was made at their meeting held on August 11, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755002747523,
            "Source": "corporate_action"
        },
        {
            "Title": "Bal Pharma Limited Approves Q1 FY2026 Results and Employee Stock Option Plan",
            "Summary": "Bal Pharma Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹6,563.51 lakhs and net profit of ₹32.31 lakhs for the quarter. On a consolidated basis, revenue from operations was ₹6,587.09 lakhs with net profit of ₹20.85 lakhs. The Board scheduled the 38th Annual General Meeting for September 25, 2025, and decided to close the register of members from September 19-25, 2025. Additionally, the Board approved an Employee Stock Option Plan-2025, subject to shareholder approval at the upcoming AGM. The company's statutory auditors issued an unmodified opinion on the quarterly results.",
            "Sentiment": "neutral",
            "PublishDate": 1754918882480,
            "Source": "earnings"
        },
        {
            "Title": "Bal Pharma Schedules Board Meeting to Discuss Quarterly Results and Subsidiary Merger",
            "Summary": "Bal Pharma Ltd has scheduled a Board of Directors meeting for August 11, 2025, to consider several key matters. The board will review unaudited standalone and consolidated financial results for the quarter ended June 30, 2025, and discuss convening the 38th Annual General Meeting along with book closure dates. Additionally, the meeting will address approval of a draft Employee Stock Option Plan-2025 and consider the merger of subsidiary Lifezen Healthcare Pvt Ltd with Bal Pharma Ltd. The company has implemented a trading window closure for designated persons and employees from June 1, 2025, to August 14, 2025, which extends 48 hours after the declaration of quarterly financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1753789045113,
            "Source": "corporate_action"
        }
    ]
}