{
    "Symbol": "BALRAMCHIN",
    "ISIN": "INE119A01028",
    "News": [
        {
            "Title": "Balrampur Chini Mills Q3 FY26 Results Show Strong Growth",
            "Summary": "Balrampur Chini Mills reported Q3 FY26 net profit of ₹10,666.36 lakhs vs ₹6,273.10 lakhs in Q3 FY25, with revenue from operations at ₹145,411.80 lakhs. Nine-month profit reached ₹19,570.36 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770721141723,
            "Source": "co_actions_results"
        },
        {
            "Title": "Balrampur Chini Mills Gets ESG Rating Upgrade to B+",
            "Summary": "Balrampur Chini Mills Limited receives improved ESG rating of 70.9 (Grade B+) from SES ESG Research, up from previous rating of 70.2, reflecting enhanced sustainability performance.",
            "Sentiment": "positive",
            "PublishDate": 1767960511925,
            "Source": "stocks"
        },
        {
            "Title": "Balrampur Chini Mills withholds dividends over KYC",
            "Summary": "Balrampur Chini Mills Limited has withheld dividend payments to shareholders who have not updated their KYC documents or bank details, following SEBI's mandatory electronic payment requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1765462402994,
            "Source": "co_actions_results"
        },
        {
            "Title": "Balrampur Chini Mills Grants 33,765 Employee Stock Appreciation Rights Under ESAR 2023 Plan",
            "Summary": "Balrampur Chini Mills Limited granted 33,765 Employee Stock Appreciation Rights (ESARs) at ₹2,447 per ESAR under its ESAR 2023 plan, with a 4-year vesting and exercise period. The grant affects eligible employees and represents the company's employee compensation strategy through equity-linked benefits.",
            "Sentiment": "neutral",
            "PublishDate": 1764677838522,
            "Source": "corporate_action"
        },
        {
            "Title": "Balrampur Chini Mills Reports Healthy Q2 Performance Despite Seasonal Weakness, Declares INR 3.50 Interim Dividend",
            "Summary": "Balrampur Chini Mills delivered improved volumes and realizations in Q2 FY26 supported by upward power tariff revisions, with the Board declaring an interim dividend of INR 3.50 per share totaling INR 70.7 crore. The company expects 7-8% increase in cane crushing and continues progress on its INR 2,800 crore PLA project with INR 1,093 crore invested so far, targeting commercial production by October with market development through imported PLA trading.",
            "Sentiment": "positive",
            "PublishDate": 1763208787691,
            "Source": "earnings"
        },
        {
            "Title": "Balrampur Chini Mills Reports Strong Q2 Performance with 28.7% Revenue Growth",
            "Summary": "Balrampur Chini Mills Limited reported quarterly results for the period ended September 30, 2025. The company's total income from operations increased to ₹1,670.76 crores compared to ₹1,297.95 crores in the corresponding quarter of the previous year. Net profit after tax rose to ₹45.95 crores from a loss of ₹3.50 crores in the same quarter last year. For the six-month period, total income reached ₹3,213.04 crores versus ₹2,719.55 crores in the previous year, with net profit after tax at ₹89.04 crores compared to ₹61.13 crores. The company's earnings per share for the quarter stood at ₹2.28 compared to negative ₹0.17 in the previous year. The Board of Directors declared an interim dividend of ₹3.50 per equity share. The company noted that sugar being a seasonal industry means quarterly performance varies and may not represent annual performance.",
            "Sentiment": "positive",
            "PublishDate": 1762981655757,
            "Source": "earnings"
        },
        {
            "Title": "Balrampur Chini Mills Uploads Q2 H1 FY26 Earnings Conference Call Recording",
            "Summary": "Balrampur Chini Mills Limited has uploaded the audio recording of its earnings conference call held on November 12, 2025, discussing Q2 H1 FY26 financial results. The recording is available on the company's website at https://chini.com/investors/concall-transcript/. The company notified stock exchanges BSE and NSE about the availability of this earnings call recording.",
            "Sentiment": "neutral",
            "PublishDate": 1762980714413,
            "Source": "earnings"
        },
        {
            "Title": "Balrampur Chini Mills Plans Diversified Growth Strategy with Ethanol and Green Energy Focus",
            "Summary": "Balrampur Chini Mills has outlined a diversified growth strategy targeting FY26 revenue of ₹5,430 crores, representing 9% year-over-year growth. The company plans to increase its distillery capacity to 1,050 KLPD by FY27 and is investing in bio-CNG and green methanol pilot projects. The company aims to shift its revenue mix to achieve 40% contribution from distillery operations by FY27. The strategy focuses on sustainable energy transition, sugar efficiency improvements, and development of value-added byproducts across ethanol and green energy segments.",
            "Sentiment": "positive",
            "PublishDate": 1762875873050,
            "Source": "stock"
        },
        {
            "Title": "Balrampur Chini Mills Reports Mixed Q2 Results with Revenue Growth and Profit Decline",
            "Summary": "Balrampur Chini Mills reported quarterly results showing consolidated net profit of 539 million rupees compared to 672 million rupees in the same period last year. Revenue increased to 16 billion rupees from 12.98 billion rupees year-over-year. EBITDA rose significantly to 1.20 billion rupees from 491 million rupees, with EBITDA margin improving to 7.21% from 3.78%. The company approved a dividend of 3.5 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1762851964487,
            "Source": "earnings"
        },
        {
            "Title": "Balrampur Chini Mills Partners with CIPET Ahmedabad for Bioeconomy Awareness Initiative",
            "Summary": "Balrampur Chini Mills collaborated with CIPET Ahmedabad to host 'Bioyug on Wheels', an initiative aimed at promoting bioeconomy awareness and sustainable innovation.",
            "Sentiment": "positive",
            "PublishDate": 1756732673469,
            "Source": "stock"
        },
        {
            "Title": "Balrampur Chini Mills Reports Mixed Q1 Results with 65% Drop in Sugar Production Despite Revenue Growth",
            "Summary": "Balrampur Chini Mills released its quarterly earnings results showing contrasting performance across segments. While revenues increased in both Sugar and Distillery segments due to higher volumes and realizations, sugar production dropped 65% following a 66% decline in sugarcane crushing operations during the shorter crushing season. The company's sugar recovery rate declined to 11.28% from 11.72% in the previous year, though management expects improvement over the next two years. The company continues progress on its Rs. 2,850 crore PLA (Polylactic Acid) project, having spent Rs. 927 crore so far, with commissioning targeted for October 2026. Management has engaged with 175+ customers for PLA, serving 50+ clients with 30+ ongoing trials. India's sugar production for 2025-26 is expected to reach 35 million tonnes, up 18% from the previous year, with the company anticipating ethanol price increases due to surplus sugar production.",
            "Sentiment": "neutral",
            "PublishDate": 1755601697202,
            "Source": "earnings"
        },
        {
            "Title": "Balrampur Chini Targets Profit Growth Through Ethanol Expansion and Operational Improvements",
            "Summary": "Balrampur Chini has outlined its strategy for continued profit growth focusing on ethanol expansion, improved sugar recovery, and cost management initiatives. The company has provided a strong forecast for FY26, supported by favorable policy environment and planned capacity improvements.",
            "Sentiment": "positive",
            "PublishDate": 1755016055751,
            "Source": "stock"
        },
        {
            "Title": "Balrampur Chini Mills Submits Updated Investor Presentation for June 2025",
            "Summary": "Balrampur Chini Mills Limited submitted an updated investor presentation to stock exchanges. The company operates 5 sugar units, 10 distillery units, and 10 co-generation units with aggregate cane crushing capacity of 80,000 TCD and saleable co-generation capacity of 175.7 MW. For FY25, the company reported revenue of Rs. 5,415 crores, EBITDA of Rs. 704 crores, and PAT of Rs. 344 crores. The company is implementing India's first industrial Poly Lactic Acid (PLA) plant with 250 TPD capacity, having spent approximately Rs. 927 crores on the project till July 2025. The presentation covers company operations, diversification into bioplastics, financial performance over 5 years, ESG initiatives, and global sugar sector overview.",
            "Sentiment": "neutral",
            "PublishDate": 1755013581569,
            "Source": "stock"
        },
        {
            "Title": "Balrampur Chini Mills Reports Quarterly Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Balrampur Chini Mills Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of ₹1,542.27 crores and profit after tax of ₹43.09 crores, with basic earnings per share of ₹2.13. On a consolidated basis, revenue from operations was ₹1,542.27 crores with profit after tax of ₹51.57 crores and basic earnings per share of ₹2.55. The company operates across four segments: Sugar (₹1,167.63 crores revenue), Distillery (₹461.47 crores), Polylactic Acid (₹0.26 crores), and Others (₹2.49 crores). The company faces a legal challenge regarding export pass fees on ethanol dispatched outside Uttar Pradesh, with a demand of ₹21.81 crores raised for one distillery unit. The Allahabad High Court granted interim relief allowing ethanol dispatch without payment of export pass fees pending final order. The company maintains that sugar being a seasonal industry means quarterly performance varies and is not representative of annual performance.",
            "Sentiment": "neutral",
            "PublishDate": 1754992025658,
            "Source": "earnings"
        },
        {
            "Title": "Balrampur Chini Mills Reports Mixed Q1 Results with Revenue Growth but Lower Profitability",
            "Summary": "Balrampur Chini Mills reported quarterly consolidated net profit of 516 million rupees, down from 702 million rupees in the same period last year. Revenue increased to 15.4 billion rupees compared to 14.2 billion rupees year-over-year. EBITDA declined to 1.34 billion rupees from 1.66 billion rupees, while EBITDA margin compressed to 8.7% from 11.69% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754989751313,
            "Source": "earnings"
        },
        {
            "Title": "Balrampur Chini Mills Faces ₹218.1 Million Charges Due to UP Fee Restoration",
            "Summary": "Balrampur Chini Mills is facing charges of ₹218.1 million as the Uttar Pradesh government has reinstated import and export fees on denatured alcohol. This decision directly impacts the company's financial obligations.",
            "Sentiment": "negative",
            "PublishDate": 1752670349000,
            "Source": "default"
        },
        {
            "Title": "Balrampur Chini Mills Launches India's First PLA Biopolymer Brand",
            "Summary": "Balrampur Chini Mills has introduced 'Balrampur Bioyug', which is claimed to be India's first PLA (Polylactic Acid) biopolymer brand. PLA is a biodegradable and biocompatible material derived from renewable resources. This launch represents a significant step in the company's diversification into eco-friendly products.",
            "Sentiment": "positive",
            "PublishDate": 1748338409000,
            "Source": "default"
        },
        {
            "Title": "Balrampur Chini Mills Discusses Business Strategies and Market Conditions",
            "Summary": "Balrampur Chini Mills provided updates on various aspects of its business during a conference call. The company is targeting applications for compostable bioplastics where the impact on final product prices will be minimal. Approvals for compostability and FSSAI are in progress. The government did not revise prices for juice and B-heavy ethanol despite FRP revision, making sugar diversion for ethanol unattractive. The net capex for the PLA plant is Rs 1,750 crores after a 50% government subsidy. The company expects to liquidate its entire inventory by November and anticipates a closing stock of 5.2 million tonnes as of October 25th, which is considered tight. The PLA project is expected to generate a 35% EBITDA margin.",
            "Sentiment": "neutral",
            "PublishDate": 1747625561000,
            "Source": "default"
        },
        {
            "Title": "Balrampur Chini Mills Q4 Results and Dividend Announcement",
            "Summary": "Balrampur Chini Mills has reported its Q4 financial results and announced a dividend. The company's Q4 consolidated net profit increased to 2.3 billion rupees from 2.03 billion rupees year-over-year. Revenue rose to 15 billion rupees from 14.34 billion rupees in the same period. EBITDA for Q4 was 3.65 billion rupees, up from 3.45 billion rupees, with EBITDA margin improving slightly to 24.29% from 24.03%. The company has recommended a dividend of 3 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747319911000,
            "Source": "result"
        },
        {
            "Title": "Balrampur Chini Mills to Consider Q4 Results on May 15",
            "Summary": "Balrampur Chini Mills has announced that it will consider its fourth quarter financial results on May 15. This indicates that the company is preparing to release its earnings report for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1746705028000,
            "Source": "default"
        },
        {
            "Title": "Yogi Adityanath Inaugurates India's First PLA Biopolymer Plant by Balrampur Chini Mills",
            "Summary": "Uttar Pradesh Chief Minister Yogi Adityanath has laid the foundation for India's first PLA (Polylactic Acid) biopolymer plant, to be built by Balrampur Chini Mills Limited. The project involves a capital expenditure of Rs. 2,850 crore and will have an annual production capacity of 80,000 tonnes. This initiative marks a significant step towards sustainable bio-manufacturing in India.",
            "Sentiment": "positive",
            "PublishDate": 1740355705000,
            "Source": "corporate_action"
        },
        {
            "Title": "Balrampur Chini Mills Increases Plant Capacity and Investment",
            "Summary": "Balrampur Chini Mills has announced an increase in their plant capacity from 75,000 TPA to 80,000 TPA. This expansion comes with a higher investment, which was determined after detailed engineering. The company expects to achieve lower conversion costs despite the increased capacity.",
            "Sentiment": "positive",
            "PublishDate": 1738920749000,
            "Source": "corporate_action"
        },
        {
            "Title": "Balrampur Chini Mills Expands PLA Project Capacity",
            "Summary": "Balrampur Chini Mills has approved an increase in the capacity of its PLA (Polylactic Acid) project from 75,000 TPA to 80,000 TPA. This expansion comes with a revised capital expenditure of ₹2,000 crores for the project.",
            "Sentiment": "positive",
            "PublishDate": 1738920739000,
            "Source": "corporate_action"
        },
        {
            "Title": "Balrampur Chini Mills Increases Capacity of PLA Project",
            "Summary": "Balrampur Chini Mills has announced that its board has approved an increase in the capacity of its Polylactic Acid (PLA) project. The project's capacity has been optimized from the initially planned 75,000 tonnes per annum to 80,000 tonnes per annum.",
            "Sentiment": "positive",
            "PublishDate": 1738920730000,
            "Source": "corporate_action"
        },
        {
            "Title": "Balrampur Chini Mills Reports Improved Q3 EBITDA and Margin",
            "Summary": "Balrampur Chini Mills has announced its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 1.23 billion rupees, up from 1.13 billion rupees in the same quarter last year. Additionally, the EBITDA margin improved to 10.38% from 9.22% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738919524000,
            "Source": "earnings"
        },
        {
            "Title": "Balrampur Chini Mills Reports Q3 Revenue Decline",
            "Summary": "Balrampur Chini Mills, a prominent sugar manufacturer, has reported its third-quarter revenue figures. The company's revenue for Q3 stood at 11.9 billion rupees, showing a slight decrease compared to the 12.3 billion rupees reported in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1738919501000,
            "Source": "earnings"
        },
        {
            "Title": "Balrampur Chini Mills Reports Decline in Q3 Net Profit",
            "Summary": "Balrampur Chini Mills, a prominent sugar manufacturer, has reported a consolidated net profit of 705 million rupees for the third quarter, down from 910 million rupees in the same period last year. This represents a year-over-year decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1738919469000,
            "Source": "earnings"
        },
        {
            "Title": "Balrampur Chini Mills: Top Pick After Ethanol Price Hike",
            "Summary": "Systematix identifies Balrampur Chini Mills as a top stock pick in the sugar sector following a government-announced price hike for C-Heavy molasses-based ethanol. The price increase is expected to benefit distilleries using this feedstock. However, prices for B-Heavy molasses and sugarcane juice-based ethanol remain unchanged, potentially pressuring margins for those producers. The government's new ethanol tender shows preference for C-Heavy molasses and grain-based ethanol, signaling a shift in the industry.",
            "Sentiment": "positive",
            "PublishDate": 1738208578000,
            "Source": "normal_news"
        },
        {
            "Title": "Balrampur Chini Mills to Consider Q3 Results on February 7",
            "Summary": "Balrampur Chini Mills has announced that it will consider its third quarter (Q3) financial results on February 7. This indicates that the company is preparing to disclose its performance for the most recent fiscal quarter, which is a standard practice for publicly traded companies.",
            "Sentiment": "neutral",
            "PublishDate": 1738159558000,
            "Source": "earnings"
        },
        {
            "Title": "InCred Bullish on Grain-Based Ethanol for Balrampur Chini",
            "Summary": "InCred has reiterated its bullish stance on grain-based ethanol for Balrampur Chini Mills. The company has been allocated 90% ethanol for the Ethanol Supply Year 2026 (ESY26). InCred's positive outlook is supported by strong order inflow from Oil Marketing Companies (OMCs).",
            "Sentiment": "positive",
            "PublishDate": 1736220806000,
            "Source": "normal_news"
        },
        {
            "Title": "Potential Ethanol Price Increase for Balrampur Chini Mills",
            "Summary": "According to CNBC Awaaz, Balrampur Chini Mills' ethanol price could potentially increase by approximately 1-1.5 rupees per liter, falling short of the company's demand for a 2-2.5 rupees per liter increase. This news impacts the sugar-based ethanol sector and Balrampur Chini Mills' pricing strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1734511381000,
            "Source": "normal_news"
        },
        {
            "Title": "Balrampur Chini Mills Reports Q2 Revenue Decline",
            "Summary": "Balrampur Chini Mills, a sugar manufacturing company, has reported its second quarter revenue for the current fiscal year. The company's revenue stood at 12.98 billion rupees, showing a decrease from 15.3 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1731317990000,
            "Source": "result"
        },
        {
            "Title": "Balrampur Chini Mills Reports Significant Drop in Q2 EBITDA",
            "Summary": "Balrampur Chini Mills experienced a substantial decline in its Q2 EBITDA, which fell to 491 million rupees from 1.6 billion rupees year-over-year. The company's EBITDA margin also decreased significantly, dropping to 3.78% from 10.71% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731317971000,
            "Source": "result"
        },
        {
            "Title": "Balrampur Chini Mills Reports Q2 Profit Decline",
            "Summary": "Balrampur Chini Mills, a sugar manufacturing company, has reported a consolidated net profit of 672 million rupees for the second quarter, down from 1.7 billion rupees in the same period last year. This represents a significant year-over-year decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1731317906000,
            "Source": "result"
        },
        {
            "Title": "Balrampur Chini Mills to Consider Q2 Results on November 11",
            "Summary": "Balrampur Chini Mills has announced that it will consider and approve its financial results for the second quarter on November 11.",
            "Sentiment": "neutral",
            "PublishDate": 1730213811000,
            "Source": "corporate_action"
        },
        {
            "Title": "Balrampur Chini Mills Ltd Block Trade",
            "Summary": "A significant block trade occurred for Balrampur Chini Mills Ltd on the NSE. Approximately 1,022,847 shares were traded at a price of Rs. 641.40 per share, totaling Rs. 65.61 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1729154083000,
            "Source": "block_deals"
        },
        {
            "Title": "Balrampur Chini: Bioplastic Plant to Launch in 2026 with ₹1,800 Crore Revenue Potential",
            "Summary": "<p>Balrampur Chini plans to <span class='positive'>commission</span> a <span class='positive'>bioplastic plant</span> in <b>2026</b>, with an <span class='positive'>estimated revenue potential</span> of <b>₹1,800 crore</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727932480000,
            "Source": "normal_news"
        },
        {
            "Title": "Balrampur Chini: Bioplastic Plant Set for 2026 Launch with ₹1,800 Crore Revenue Potential",
            "Summary": "<p>Balrampur Chini Mills plans to <span class='positive'>commission</span> a <span class='positive'>bioplastic plant</span> in <b>2026</b>, with an <span class='positive'>estimated revenue potential</span> of <b>₹1,800 crore</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727932480000,
            "Source": "corporate_action"
        }
    ]
}