{
    "Symbol": "BALUFORGE",
    "ISIN": "INE011E01029",
    "News": [
        {
            "Title": "Balu Forge Q3 FY26: Revenue up 21.6% to Rs 3,111 Mn",
            "Summary": "Balu Forge Industries reports Q3 FY26 revenue of Rs 3,111 Mn (21.6% YoY growth) with EBITDA of Rs 845 Mn. Company operationalizes precision machining facilities and artillery shell production line.",
            "Sentiment": "positive",
            "PublishDate": 1770908615167,
            "Source": "co_actions_results"
        },
        {
            "Title": "Balu Forge Allots 10 Lakh Equity Shares on Warrant Conversion",
            "Summary": "Balu Forge Industries completes allotment of 10,00,000 equity shares at Rs. 360 per share to Ebisu Global Opportunities Fund Limited upon conversion of convertible warrants, raising Rs. 27 crores.",
            "Sentiment": "positive",
            "PublishDate": 1770784360080,
            "Source": "co_actions_results"
        },
        {
            "Title": "Balu Forge Gets Credit Rating Upgrade from ICRA",
            "Summary": "ICRA Limited assigns [ICRA]A-(Stable) and [ICRA]A2+ ratings to Balu Forge Industries' bank facilities worth Rs. 231.00 crore, representing an upgrade from existing ratings.",
            "Sentiment": "positive",
            "PublishDate": 1770700022587,
            "Source": "stocks"
        },
        {
            "Title": "Balu Forge Gets Credit Rating Upgrade from ICRA",
            "Summary": "Balu Forge Industries receives upgraded credit ratings from ICRA Limited for Rs. 25.00 crore working capital facilities, marking improvement from previous ratings assigned in November 2025.",
            "Sentiment": "positive",
            "PublishDate": 1770020876411,
            "Source": "stocks"
        },
        {
            "Title": "Balu Forge Joins NATO Supply Chain for Defence Parts",
            "Summary": "Balu Forge Industries has joined the NATO supply chain to provide high-precision defence parts to member states, strengthening India's position in global defence manufacturing sector.",
            "Sentiment": "positive",
            "PublishDate": 1769662733960,
            "Source": "stocks"
        },
        {
            "Title": "Balu Forge's Defence Pivot Drives 34.5% Revenue Growth",
            "Summary": "Balu Forge Industries transforms from auto components to defence manufacturing with automated shell production line and targets 40-45% revenue growth in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1769424266642,
            "Source": "stocks"
        },
        {
            "Title": "Balu Forge rallies 13% after I-T search concludes",
            "Summary": "Balu Forge shares surged 13.16% to ₹499.40 after Income Tax Department searches concluded with no incriminating documents found. The Ashish Kacholia portfolio stock snapped a 9-day losing streak.",
            "Sentiment": "positive",
            "PublishDate": 1768290262437,
            "Source": "stocks"
        },
        {
            "Title": "Balu Forge shares surge 13% after IT search ends",
            "Summary": "Balu Forge Industries shares rebounded 13% intraday after the company clarified that the Income Tax Department search concluded with no incriminating documents found, providing relief to investors.",
            "Sentiment": "positive",
            "PublishDate": 1768288000556,
            "Source": "stocks"
        },
        {
            "Title": "Balu Forge Surges 13% After IT Search Concludes",
            "Summary": "Balu Forge Industries jumped 13% to ₹498.95 after announcing that the Income Tax Department's search concluded on January 13 with no incriminating documents found or seized, boosting investor confidence.",
            "Sentiment": "positive",
            "PublishDate": 1768287210092,
            "Source": "stocks"
        },
        {
            "Title": "Balu Forge shares surge 10% after I-T probe ends",
            "Summary": "Balu Forge Industries shares jumped 10% on Tuesday, snapping an eight-day losing streak after the company announced conclusion of income tax department probe with no incriminating documents found.",
            "Sentiment": "positive",
            "PublishDate": 1768279440979,
            "Source": "stocks"
        },
        {
            "Title": "Balu Forge: IT Dept Search Finds No Evidence",
            "Summary": "Income Tax Department conducted searches at Balu Forge Industries' offices and factories but found no evidence of irregularities. Company operations continue normally without disruption.",
            "Sentiment": "neutral",
            "PublishDate": 1768276627049,
            "Source": "stocks"
        },
        {
            "Title": "Balu Forge shares hit lower circuit, extend fall",
            "Summary": "Balu Forge Industries shares hit lower circuit with 20% decline to ₹465.30, marking fifth consecutive session of losses. Q2 profit rose 35.5% to ₹65 crore despite stock weakness.",
            "Sentiment": "negative",
            "PublishDate": 1767765391603,
            "Source": "stocks"
        },
        {
            "Title": "Balu Forge Allots 10 Lakh Shares via Warrant Conversion",
            "Summary": "Balu Forge Industries completes allotment of 10 lakh equity shares at ₹360 per share through convertible warrant conversion by Krisharya Trust, raising ₹36 crores on December 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767094392828,
            "Source": "co_actions_results"
        },
        {
            "Title": "Balu Forge Promoter Acquires Additional Shares",
            "Summary": "Jaspalsingh Prehladsingh Chandock, promoter of Balu Forge Industries, acquired 9,000 additional shares through open market purchase on December 29, 2025, increasing his shareholding to 53.04%.",
            "Sentiment": "positive",
            "PublishDate": 1766744778267,
            "Source": "stocks"
        },
        {
            "Title": "Balu Forge Launches 100% Make-in-India Automated Empty Shell Production Line",
            "Summary": "Balu Forge Industries commenced operations of its indigenously built empty shell production line at its Belgaum facility with annual capacity of 360,000 shells, featuring near 100% automation powered by FANUC Robotics. The unmanned forging line serves large calibre ammunition projectiles for the defence industry and supports the government's Atmanirbhar Bharat mission, with plans for phased expansion of additional high-precision production lines.",
            "Sentiment": "positive",
            "PublishDate": 1765345024783,
            "Source": "stock"
        },
        {
            "Title": "Balu Forge Industries Receives Credit Rating Reiteration from CRISIL",
            "Summary": "CRISIL Ratings Limited has reiterated its credit ratings on Balu Forge Industries Limited's bank facilities totaling Rs. 76 Crore, with ratings of CRISIL BBB and CRISIL A2. The rating rationale was published on CRISIL's website on 27th November, 2025, confirming the company's existing credit assessment for its banking arrangements.",
            "Sentiment": "neutral",
            "PublishDate": 1764437734894,
            "Source": "stock"
        },
        {
            "Title": "Balu Forge Industries Reports Strong Q2FY26 Results with 34.4% Revenue Growth",
            "Summary": "Balu Forge Industries Limited announced quarterly results for September 30, 2025, with consolidated revenue from operations reaching Rs. 2,995 million, up 34.4% year-on-year, and PAT of Rs. 650 million, reflecting a 35.5% increase. The precision engineering and manufacturing company also reported EBITDA of Rs. 828 million with a margin of 27.6%, while continuing expansion of its Hattargi facility with integrated forging and machining capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1763174978390,
            "Source": "earnings"
        },
        {
            "Title": "Balu Forge Launches New Precision Machining Unit in Karnataka",
            "Summary": "Balu Forge has commenced operations at its new precision machining facility in Belgaum, Karnataka. The unit is equipped with advanced 7-axis and 11-axis CNC machines and is expected to add 12,000 tons of machining capacity annually to the company's operations.",
            "Sentiment": "positive",
            "PublishDate": 1759818975836,
            "Source": "stock"
        },
        {
            "Title": "Balu Forge Industries Announces Final Dividend of Rs 0.15 Per Share",
            "Summary": "Balu Forge Industries has declared a final dividend of Rs 0.15 per share with September 19, 2025 as the record date. Investors must purchase shares before this date to be eligible for the dividend payout. The company is backed by investor Ashish Kacholia, who holds 18,65,933 shares representing a 1.64% stake as of June 30, 2025. Balu Forge Industries manufactures fully finished and semi-finished forged crankshafts and components for New Emission Regulations and New Energy Vehicles. The stock closed 1% higher at Rs 677.45 on BSE on Wednesday.",
            "Sentiment": "positive",
            "PublishDate": 1758162785239,
            "Source": "corporate_action"
        },
        {
            "Title": "Balu Forge Industries Sets Record Date for Final Dividend Subject to AGM Approval",
            "Summary": "Balu Forge Industries Limited's Board of Directors has fixed September 19, 2025 as the record date for determining shareholder eligibility for the final dividend for financial year 2024-25. The dividend is subject to approval at the Annual General Meeting scheduled for September 29, 2025. If approved by shareholders, the dividend will be paid within the statutory time limit from the approval date. The decision was made at a board meeting held on September 4, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1756990302011,
            "Source": "corporate_action"
        },
        {
            "Title": "Balu Forge Industries Reconstitutes Board Committees with New Independent Director",
            "Summary": "Balu Forge Industries Limited has reconstituted three key Board committees by appointing Mr. Roop Lal Meena (DIN: 10938270) as a Non-Executive Independent Director and member. The reconstitution affects the Audit Committee, Nomination and Remuneration Committee, and Stakeholders Relationship Committee. The Audit Committee now comprises five members with Raghvendra Raj Mehta as Chairperson, while the Nomination and Remuneration Committee has four members led by Radhey Shyam Soni as Chairperson. The Stakeholders Relationship Committee also consists of four members with Raghvendra Raj Mehta serving as Chairperson. All changes took effect immediately following the Board meeting held on August 07, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754581953416,
            "Source": "corporate_governance"
        },
        {
            "Title": "Balu Forge Industries Reports Zero Deviation in Preferential Issue Fund Utilization for June 2025 Quarter",
            "Summary": "Balu Forge Industries Limited submitted its Statement of Deviation or Variation for preferential issue proceeds utilization for the quarter ended June 30, 2025. The monitoring agency report by Infomerics Valuation and Rating Limited shows zero deviation from stated objectives. The company raised Rs. 137.70 crores through preferential issue of equity shares and convertible warrants at Rs. 183.60 per share. Out of total proceeds, Rs. 135.05 crores has been utilized, with Rs. 101.04 crores spent on working capital requirements (primarily raw materials like forged crankshafts and counterweights) and Rs. 34.02 crores on general corporate purposes. Rs. 2.64 crores remains unutilized and is held in Axis Bank account. The company also has a separate larger preferential issue of Rs. 496.80 crores, of which Rs. 297.00 crores has been received and Rs. 255.10 crores utilized across plant & machinery purchases, working capital, and general corporate purposes. The Audit Committee and Board reviewed the reports on August 07, 2025, confirming compliance with offer document objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1754581158708,
            "Source": "corporate_action"
        },
        {
            "Title": "Balu Forge Industries Reports Strong Q1 Growth with 67% Jump in Net Profit",
            "Summary": "Balu Forge Industries delivered robust quarterly performance with consolidated net profit rising to 570 million rupees from 342 million rupees year-over-year. Revenue increased to 2.3 billion rupees compared to 1.75 billion rupees in the same period last year. The company's EBITDA grew to 723 million rupees from 432 million rupees, while EBITDA margin expanded to 30.99% from 24.64% year-over-year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754577885608,
            "Source": "earnings"
        },
        {
            "Title": "Balu Forge Industries: Stock Stalls After 720% IPO Rally, Analysts Remain Optimistic",
            "Summary": "Balu Forge Industries' stock has corrected 31% from its September peak after a 720% rally from its IPO price. Despite the correction, analysts remain optimistic about its long-term prospects. The company reported a 123% YoY increase in Q4FY25 net profit and a 67% rise in revenue. Analysts recommend buying on dips with price targets ranging from Rs 710 to Rs 940.",
            "Sentiment": "positive",
            "PublishDate": 1752562451000,
            "Source": "earnings"
        },
        {
            "Title": "Balu Forge Industries Acquires 40% Stake in Swan Balu Heavy Industries",
            "Summary": "Balu Forge Industries has acquired a 40% share in Swan Balu Heavy Industries Pvt Ltd. This acquisition is part of an initiative focused on the defense and aerospace sectors.",
            "Sentiment": "positive",
            "PublishDate": 1750689016000,
            "Source": "default"
        },
        {
            "Title": "Balu Forge Industries Reports Strong Q4 Financial Results",
            "Summary": "Balu Forge Industries has announced its Q4 consolidated financial results. The company's net profit increased significantly to 627 million rupees, up from 281 million rupees year-over-year and 590 million rupees quarter-over-quarter. Revenue also saw substantial growth, reaching 2.7 billion rupees compared to 1.6 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747267815000,
            "Source": "default"
        },
        {
            "Title": "Balu Forge Industries: Q4 Profit Surges 123%, Revenue Up 63%",
            "Summary": "Balu Forge Industries reported a 123% YoY increase in Q4FY25 net profit to Rs 63 crore. Revenue jumped 63% to Rs 270 crore. EBITDA rose 118% to Rs 75 crore with margin expanding to 27.8%. FY25 revenue grew 65% to Rs 924 crore, while net profit increased 118% to Rs 204 crore. The company improved its debt position and working capital efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1747238173000,
            "Source": "earnings"
        },
        {
            "Title": "Balu Forge Industries Reports Strong Q4 Financial Performance",
            "Summary": "Balu Forge Industries has announced its Q4 financial results, showing significant year-over-year growth. The company's EBITDA increased to 750 million rupees from 343.9 million rupees in the previous year, with EBITDA margin improving to 27.81% from 21.33%. Consolidated net profit rose to 627 million rupees from 281 million rupees year-over-year and 590 million rupees quarter-over-quarter. Revenue for Q4 reached 2.7 billion rupees, up from 1.6 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747230160000,
            "Source": "result"
        },
        {
            "Title": "Balu Forge: Promoter Increases Stake Amid Market Downturn",
            "Summary": "A promoter of Balu Forge has increased their stake in the company through a preferential share allotment, despite the current sharp decline in the Indian stock market.",
            "Sentiment": "positive",
            "PublishDate": 1744017697000,
            "Source": "corporate_action"
        },
        {
            "Title": "Balu Forge Industries Reports Strong Q3 Financial Results",
            "Summary": "Balu Forge Industries has announced its Q3 consolidated financial results. The company's net profit increased significantly to 590 million rupees, compared to 255 million rupees in the same quarter last year and 480 million rupees in the previous quarter. Revenue also saw substantial growth, reaching 2.6 billion rupees, up from 1.47 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1739146404000,
            "Source": "earnings"
        },
        {
            "Title": "Balu Forge Industries: Q3 Net Profit Soars 134%, Strategic Expansion Announced",
            "Summary": "Balu Forge Industries reported a 134% YoY increase in Q3FY25 net profit to ₹59 crore. Revenue rose 74% to ₹256 crore, and EBITDA grew 107% to ₹68 crore. The company signed an MoU with Swan Energy Limited to form an SPV for expansion into defense, aerospace, railways, and nuclear sectors.",
            "Sentiment": "positive",
            "PublishDate": 1739088538000,
            "Source": "earnings"
        },
        {
            "Title": "Balu Forge Industries Reports Strong Q3 Financial Performance",
            "Summary": "Balu Forge Industries has announced its Q3 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit for Q3 reached 590 million rupees, up from 255 million rupees in the same quarter last year and 480 million rupees in the previous quarter. Revenue for Q3 stood at 2.6 billion rupees, compared to 1.47 billion rupees in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1738933154000,
            "Source": "earnings"
        },
        {
            "Title": "Balu Forge Industries: Stock Rises on CAPEX Expansion Buzz",
            "Summary": "Balu Forge Industries, a multibagger stock in Ashish Kacholia's portfolio, saw over 4% increase in intraday trading on December 10, amid rumors of capital expenditure expansion.",
            "Sentiment": "positive",
            "PublishDate": 1733810664000,
            "Source": "normal_news"
        },
        {
            "Title": "Balu Forge Industries: FIIs Increase Stake, Q2 Profit Soars 107%",
            "Summary": "FIIs raised their stake in Balu Forge Industries by 1.92% to 10.43% in Q2FY25. The company reported a 107% YoY increase in Q2 net profit to ₹48 crore, with revenue growing 60% to ₹223 crore. EBITDA margins expanded by 763 bps to 29.3%. Ashish Kacholia reduced his stake to 1.82% from 2.14%.",
            "Sentiment": "positive",
            "PublishDate": 1731662130000,
            "Source": "result"
        },
        {
            "Title": "Balu Forge Reports Improved Cash Flow in H1FY25",
            "Summary": "Balu Forge Industries has reported a significant improvement in its cash flow from operations for the first half of fiscal year 2025. The company has turned cash flow positive with a surplus of 500 million rupees, compared to a deficit of 1,654 million rupees in the same period last year (H1FY24). This improvement is attributed to revenue growth and enhanced management of accounts receivable.",
            "Sentiment": "positive",
            "PublishDate": 1729524445000,
            "Source": "result"
        },
        {
            "Title": "Balu Forge Industries Reports Strong Q2 Financial Performance",
            "Summary": "Balu Forge Industries has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 301.3 million rupees to 652.2 million rupees. Additionally, the EBITDA margin expanded from 21.64% to 29.26%, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1729521821000,
            "Source": "result"
        },
        {
            "Title": "Balu Forge Industries Reports Strong Q2 Revenue Growth",
            "Summary": "Balu Forge Industries has announced its Q2 revenue figures, showing a significant year-over-year increase. The company reported revenue of 2.23 billion rupees for the second quarter, compared to 1.4 billion rupees in the same period last year. This represents a substantial growth in the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1729521812000,
            "Source": "result"
        },
        {
            "Title": "Balu Forge Industries Reports Significant Profit Growth in Q2",
            "Summary": "Balu Forge Industries has announced its Q2 consolidated net profit, which stands at 481.4 million rupees. This represents a substantial year-over-year increase from 233 million rupees in the same quarter last year. Additionally, it shows a quarter-over-quarter growth from 341.7 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1729521805000,
            "Source": "result"
        },
        {
            "Title": "Balu Forge Industries: Q2 Results Date Announced, Stock Surges",
            "Summary": "Balu Forge Industries to declare Q2 results on October 21, 2024. Stock price rallied 6.75% to Rs 854.80 intraday. Company's YTD gain is 207.80%. Ashish Kacholia holds 1.82% stake in the company.",
            "Sentiment": "positive",
            "PublishDate": 1729243208000,
            "Source": "normal_news"
        }
    ]
}