{
    "Symbol": "BANARBEADS",
    "ISIN": "INE655B01011",
    "News": [
        {
            "Title": "Banaras Beads Forfeits 38,700 Shares Worth ₹193,500",
            "Summary": "Banaras Beads Limited forfeited 38,700 partly paid-up equity shares belonging to 387 shareholders after non-payment of allotment money and premium totaling ₹1,025,275 by December 25, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1770032311654,
            "Source": "co_actions_results"
        },
        {
            "Title": "Banaras Beads Q3FY26 Net Profit Rises 15.88%",
            "Summary": "Banaras Beads Limited reported net profit of Rs 57.90 lakh for Q3FY26, up 15.88% YoY. Revenue from operations increased 34.67% to Rs 772.48 lakh despite US buyer order delays due to tariff concerns.",
            "Sentiment": "positive",
            "PublishDate": 1769674307660,
            "Source": "co_actions_results"
        },
        {
            "Title": "Banaras Beads Board Meet Set for Jan 29 Q3 Results",
            "Summary": "Banaras Beads Limited has scheduled a board meeting on January 29, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768546811175,
            "Source": "co_actions_results"
        },
        {
            "Title": "Banaras Beads Limited Issues Second Final Forfeiture Notice to Partly Paid-up Shareholders",
            "Summary": "Banaras Beads Limited's Board of Directors decided to send a Second Final Reminder cum Forfeiture Notice to 403 shareholders holding 40,300 partly paid-up equity shares with face value of Rs. 10 each, giving them until December 25, 2025 to pay outstanding amounts. The shares, originally allotted in 1995 during a public issue, will be forfeited without further notice if payment is not received by the deadline, affecting shareholders who have outstanding dues comprising face value and share premium amounts.",
            "Sentiment": "negative",
            "PublishDate": 1765259455047,
            "Source": "corporate_action"
        },
        {
            "Title": "Banaras Beads Limited Reports Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "Banaras Beads Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company reported revenue from operations of Rs 355.33 lakhs for the quarter, with total income of Rs 398.87 lakhs. The company posted a profit of Rs 64.6 lakhs for the quarter compared to Rs 192.85 lakhs in the previous period. For the half year, revenue stood at Rs 1156.32 lakhs with total income of Rs 1355.37 lakhs, generating a profit of Rs 308.81 lakhs. The company noted that US-based buyers have held orders due to increased tariffs by the US Government, though no orders have been cancelled. Due to this situation, quarterly turnover and profit decreased. The company is engaged in negotiations with US-based buyers and expects turnover to match or exceed last year's levels by year-end. The results were reviewed by the audit committee and approved by the board. The company's main business involves export of glass beads, handicrafts and related items.",
            "Sentiment": "neutral",
            "PublishDate": 1761841040591,
            "Source": "earnings"
        },
        {
            "Title": "Banaras Beads Limited Acquires 1670 Sq. Meter Property in Varanasi for Rs 6.73 Crore",
            "Summary": "Banaras Beads Limited has executed a purchase deed for property and land measuring 1670 square meters at Village Karnadandi, Varanasi with Varanasi Development Authority (VDA). The total consideration paid amounts to Rs 6.73 crore. The company has secured a loan of Rs 7.56 crore from HDFC Bank for five years at 7.75% annual interest, with Rs 5.29 crore allocated for land purchase and Rs 2.27 crore for construction. The purchased property has been mortgaged in favor of HDFC Bank as security. The land is located near the company's other property and will be used for future expansion plans and warehouse development.",
            "Sentiment": "positive",
            "PublishDate": 1759302754684,
            "Source": "stock"
        },
        {
            "Title": "Banaras Beads Limited Acquires 1680 Sq. Meter Property in Varanasi for Rs. 6.77 Crore",
            "Summary": "Banaras Beads Limited purchased a 1680 square meter property at Village Karnadandi, Varanasi for Rs. 6,76,85,731 from Varanasi Development Authority through an open bid process. The company secured a loan of Rs. 7,56,00,000 from HDFC Bank at 7.75% annual interest for five years, with Rs. 5,28,90,000 allocated for land purchase and Rs. 2,27,10,000 for construction. HDFC Bank has disbursed Rs. 5,28,90,000, and the purchased property will be mortgaged in favor of the bank. The property is located near the company's existing land and will be used for future expansion plans and warehouse development. Payment to VDA has been completed, though the sale deed will be executed later.",
            "Sentiment": "positive",
            "PublishDate": 1758282577443,
            "Source": "stock"
        },
        {
            "Title": "Banaras Beads Limited Confirms Appointment of Mrs. Jayanti Mathur as Non-Executive Director",
            "Summary": "Banaras Beads Limited confirmed the appointment of Mrs. Jayanti Mathur as Non-Executive Director at their 45th Annual General Meeting held on August 7, 2025. Mrs. Mathur was initially appointed on May 29, 2025, and the appointment has now been confirmed by members. She holds a Post Graduate degree in Commerce (Marketing) from Banaras Hindu University and has over ten years of experience in Marketing, Finance, Management, decoration and designing. Mrs. Mathur is not related to any existing director of the company and is not debarred from holding directorial positions by SEBI or any other regulatory authority.",
            "Sentiment": "neutral",
            "PublishDate": 1754898471098,
            "Source": "corporate_governance"
        },
        {
            "Title": "Banaras Beads Limited Submits Unaudited Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Banaras Beads Limited submitted its unaudited financial results for the quarter ended June 30, 2025, to BSE Limited and National Stock Exchange. The results were reviewed by the Audit Committee and approved by the Board of Directors in a meeting held on July 31, 2025, from 11:30 AM to 1:20 PM. The company also submitted a Limited Review Report from its statutory auditors, who made no qualifications or adverse remarks in their report. The submission includes statements on deviation or variation, outstanding default on loans, related party transactions, and impact of audit qualifications.",
            "Sentiment": "neutral",
            "PublishDate": 1753950047752,
            "Source": "earnings"
        }
    ]
}