{
    "Symbol": "BANARISUG",
    "ISIN": "INE459A01010",
    "News": [
        {
            "Title": "Bannari Amman Sugars Q3 Net Profit Surges 68%",
            "Summary": "Bannari Amman Sugars reported a strong Q3 standalone net profit of 484 million rupees, marking a significant 68% increase from 288 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1770367505273,
            "Source": "co_actions_results"
        },
        {
            "Title": "B Saravanan submits rectified disclosure for Bannari Amman",
            "Summary": "B Saravanan files revised disclosure under SEBI Regulation 29(1) for acquisition of 4,900 shares in Bannari Amman Sugars Limited, increasing individual holding to 1.44% while maintaining PAC holding at 58.70%.",
            "Sentiment": "neutral",
            "PublishDate": 1765801381453,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bannari Amman Sugars Reports Strong Q2 Performance with 180% Jump in Net Profit",
            "Summary": "Bannari Amman Sugars Limited reported net profit of ₹42.70 crores for the quarter ended September 30, 2025, compared to ₹15.25 crores in the previous quarter, marking a significant increase. Revenue from operations rose to ₹571.65 crores from ₹418.62 crores in the prior quarter. For the half-year period, net profit reached ₹57.95 crores versus ₹40.70 crores in the same period last year. The company operates across four segments: Sugar (₹596.18 crores revenue), Power (₹150.13 crores), Distillery (₹69.45 crores), and Granite Products (₹4.93 crores). The Board of Directors approved these unaudited financial results in their meeting held on November 7, 2025. Earnings per share for the quarter stood at ₹34.05 compared to ₹12.16 in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762514008647,
            "Source": "earnings"
        },
        {
            "Title": "Bannari Amman Sugars Appoints Sowmya Sitaram as Independent Woman Director",
            "Summary": "Bannari Amman Sugars Limited has appointed Smt. Sowmya Sitaram (DIN: 11254035) as Non-Executive Woman Independent Director for a five-year term from September 11, 2025 to September 10, 2030. The appointment was approved by shareholders through postal ballot with requisite majority. Sitaram is a practicing lawyer in Coimbatore with over 37 years of legal experience, serving as legal advisor for various banks, Asset Reconstruction Companies, and other organizations. She handles civil disputes including money suits, mortgage suits, and specific performance suits, and attends legal matters for Sri Kanchi Kamakoti Medical Trust. She is not related to any existing Director or Key Managerial Personnel of the company.",
            "Sentiment": "positive",
            "PublishDate": 1761319956038,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bannari Amman Sugars Seeks Shareholder Approval for Woman Independent Director Appointment",
            "Summary": "Bannari Amman Sugars Limited is conducting a postal ballot to seek shareholder approval for appointing Smt. Sowmya Sitaram as a Non-Executive Woman Independent Director. The appointment is for a five-year term from September 11, 2025 to September 10, 2030. Smt. Sowmya Sitaram is a practicing lawyer from Coimbatore with over 37 years of legal experience and serves as legal advisor to various banks and companies. The remote e-voting period runs from September 24, 2025 at 9:00 AM to October 23, 2025 at 5:00 PM, with results to be announced by October 25, 2025. The Board of Directors appointed her as an Additional Director based on the Nomination and Remuneration Committee's recommendation, and she meets the independence criteria under regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1758535759841,
            "Source": "corporate_action"
        },
        {
            "Title": "Arisinfra and Merusri Developers Launch ₹250+ Crore Villa Project in Bengaluru",
            "Summary": "Arisinfra and Merusri Developers have launched Merusri Sunscape, a new villa community on Bengaluru's IVC Road. The project spans approximately 275,000 square feet with 235,000 square feet available for sale. The development is projected to have a gross development value exceeding ₹250 crore.",
            "Sentiment": "positive",
            "PublishDate": 1756179482454,
            "Source": "stock"
        },
        {
            "Title": "Bannari Amman Spinning Mills Allots ₹15 Crore Convertible Warrants to Promoter Entity",
            "Summary": "Bannari Amman Spinning Mills has allotted 41.66 lakh convertible equity warrants valued at ₹15 crore on a preferential basis to Murugan Enterprise Pvt Ltd, which is a promoter entity of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1755862183320,
            "Source": "corporate_action"
        },
        {
            "Title": "Bannari Amman Sugars Reports 137% Jump in Q1 Net Profit to 152M Rupees",
            "Summary": "Bannari Amman Sugars reported quarterly net profit of 152 million rupees compared to 64 million rupees in the same period last year. Revenue increased to 4.2 billion rupees from 4 billion rupees year-over-year. EBITDA rose to 366 million rupees from 291 million rupees, while EBITDA margin improved to 8.73% from 7.2% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754484780782,
            "Source": "earnings"
        },
        {
            "Title": "Bannari Amman Sugars Schedules Board Meeting for August 6 to Approve Quarterly Financial Results",
            "Summary": "Bannari Amman Sugars Limited has scheduled a Board of Directors meeting on August 6, 2025, to consider and approve the unaudited financial results for the quarter ended June 30, 2025. The company has implemented a trading window closure from July 1, 2025, to August 8, 2025. The announcement was made through a communication to NSE and BSE exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1753261700886,
            "Source": "earnings"
        },
        {
            "Title": "Bannari Amman Sugars Reports Q4 Results and Dividend Recommendation",
            "Summary": "Bannari Amman Sugars announced its Q4 financial results and dividend recommendation. The company's Q4 revenue increased to 4.94 billion rupees from 4.21 billion rupees year-over-year. EBITDA rose to 530.2 million rupees from 510 million rupees, though the EBITDA margin decreased to 10.74% from 12.11%. Net profit for Q4 increased to 351.6 million rupees, up from 218 million rupees year-over-year and 288.1 million rupees quarter-over-quarter. The company has recommended a dividend of 12.50 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748432889000,
            "Source": "result"
        },
        {
            "Title": "Bannari Amman Sugars Reports Significant Decline in Q3 Profit and Revenue",
            "Summary": "Bannari Amman Sugars has reported a substantial decrease in both net profit and revenue for the third quarter. The company's net profit fell to 288 million rupees from 681 million rupees in the same period last year. Similarly, revenue dropped to 4.2 billion rupees from 7.68 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738628063000,
            "Source": "earnings"
        },
        {
            "Title": "Bannari Amman Sugars Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Bannari Amman Sugars has reported a significant decrease in its Q3 EBITDA, which fell to 614 million rupees from 1.19 billion rupees in the same quarter last year. The company's EBITDA margin also declined, dropping to 14.57% from 15.55% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738586883000,
            "Source": "earnings"
        },
        {
            "Title": "Bannari Amman Sugars Reports Significant Decline in Q3 Profit and Revenue",
            "Summary": "Bannari Amman Sugars has reported a substantial decrease in both net profit and revenue for the third quarter. The company's net profit fell to 288 million rupees from 681 million rupees in the same period last year. Revenue also declined significantly, dropping to 4.2 billion rupees from 7.68 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738586876000,
            "Source": "earnings"
        },
        {
            "Title": "Bannari Amman Sugars Reports Q2 Financial Results",
            "Summary": "Bannari Amman Sugars has reported its Q2 financial results. The company's EBITDA for Q2 is 674 million rupees, down from 923.8 million rupees in the same quarter last year. The EBITDA margin has also decreased to 14.23% from 15.39% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731594526000,
            "Source": "result"
        },
        {
            "Title": "Bannari Amman Sugars Reports Significant Profit Increase in Q2",
            "Summary": "Bannari Amman Sugars has reported a substantial year-over-year increase in net profit for the second quarter, rising from 488 million rupees to 3,423 million rupees. However, the company's revenue decreased from 6 billion rupees to 4.7 billion rupees compared to the same period last year. Quarter-over-quarter, the net profit increased from 64 million rupees to 3,423 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1731594467000,
            "Source": "result"
        }
    ]
}