{
    "Symbol": "BANCOINDIA",
    "ISIN": "INE213C01025",
    "News": [
        {
            "Title": "Banco Products Q3FY26 Results: Net Profit Rises 77%",
            "Summary": "Banco Products reported consolidated net profit of Rs 8,583 lakhs for Q3FY26, up 177% YoY. Revenue from operations reached Rs 78,183 lakhs with strong performance across segments.",
            "Sentiment": "positive",
            "PublishDate": 1770896887200,
            "Source": "co_actions_results"
        },
        {
            "Title": "Banco Products Board Meet on Feb 12 for Q3FY26 Results",
            "Summary": "Banco Products (India) Limited has scheduled a board meeting on February 12, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769496633109,
            "Source": "co_actions_results"
        },
        {
            "Title": "Banco Products' NRF Opens New Warehouse in Italy",
            "Summary": "Banco Products' subsidiary NRF opens a new 11,465 sq meter warehouse in Quarrata, Italy, expanding capacity by 9,000 sq meters to meet growing customer demand in Q1 2026.",
            "Sentiment": "positive",
            "PublishDate": 1766402075979,
            "Source": "stocks"
        },
        {
            "Title": "Banco Products Declares Rs. 7 Per Share Interim Dividend with Record Date November 19, 2025",
            "Summary": "Banco Products (India) Limited declared an interim dividend of Rs. 7 per equity share (350%) for FY 2025-26, payable to shareholders holding shares as on November 19, 2025. The company communicated detailed tax deduction procedures to shareholders, requiring submission of relevant documents by the record date to determine applicable TDS rates on dividend payments.",
            "Sentiment": "positive",
            "PublishDate": 1763192307338,
            "Source": "corporate_action"
        },
        {
            "Title": "Banco Products Reports Mixed Q2 Results with Revenue Growth and EBITDA Decline",
            "Summary": "Banco Products reported Q2 consolidated net profit of 1.39 billion rupees, unchanged from the previous year. Revenue increased to 10.31 billion rupees from 8.88 billion rupees year-over-year. However, EBITDA declined to 1.49 billion rupees from 2.06 billion rupees, while EBITDA margin compressed to 14.47% from 23.15% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1763037088134,
            "Source": "earnings"
        },
        {
            "Title": "Banco Products Confirms Fire at NRF France S.A.S. Warehouse",
            "Summary": "Banco Products has confirmed a fire incident at the NRF France S.A.S. warehouse facility.",
            "Sentiment": "negative",
            "PublishDate": 1756439503080,
            "Source": "stock"
        },
        {
            "Title": "Banco Products Board Approves Quarterly Results and Auditor Appointments, Sets AGM Date",
            "Summary": "Banco Products (India) Limited's Board of Directors approved standalone and consolidated unaudited financial results for the quarter ended June 30, 2025. The company reported standalone net profit of Rs. 2,779 lakhs and consolidated net profit of Rs. 6,867 lakhs for the quarter. The board appointed M/s. J. J. Gandhi & Co. as Secretarial Auditor for five consecutive years from 2025-26 to 2029-30, and M/s. Y. S. Thakar & Co. as Cost Auditor for 2025-26, both subject to shareholder approval. The 64th Annual General Meeting was scheduled for September 19, 2025, at 11:00 AM via video conference, with September 12, 2025 set as the cut-off date for e-voting eligibility. The company operates primarily in the automobile ancillary business.",
            "Sentiment": "positive",
            "PublishDate": 1754656625897,
            "Source": "corporate_action"
        },
        {
            "Title": "Banco Products Reports 60% Jump in Quarterly Net Profit to 1.1 Billion Rupees",
            "Summary": "Banco Products reported consolidated net profit of 1.1 billion rupees in Q1, representing a significant increase from 687 million rupees in the same period last year. The company's revenue also grew to 9.6 billion rupees compared to 7.97 billion rupees year-over-year, marking strong financial performance across both profitability and top-line growth.",
            "Sentiment": "positive",
            "PublishDate": 1754653606248,
            "Source": "earnings"
        },
        {
            "Title": "Banco Products Reports Improved Q4 EBITDA and Margin",
            "Summary": "Banco Products has reported its Q4 financial results. The company's EBITDA increased to 2.14 billion rupees, up from 1.14 billion rupees in the same quarter of the previous year. The EBITDA margin also improved, rising to 24.68% from 15.9% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747493734000,
            "Source": "result"
        },
        {
            "Title": "Banco Products Reports Significant Increase in Q4 Profit and Revenue",
            "Summary": "Banco Products has announced its Q4 financial results. The company's consolidated net profit rose to 1.54 billion rupees, up from 682 million rupees in the same quarter last year. Revenue also increased to 8.68 billion rupees from 7.2 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747493729000,
            "Source": "result"
        },
        {
            "Title": "Banco Products' Unit NRF Enters Asset Deal with Alanko",
            "Summary": "Banco Products (India)'s subsidiary NRF has entered into an asset deal with Alanko for its turbocharger business. The deal is valued at 2.08 million euros.",
            "Sentiment": "positive",
            "PublishDate": 1746104369000,
            "Source": "default"
        },
        {
            "Title": "Banco Products' Subsidiary NRF Opens New Office in Turkey",
            "Summary": "Banco Products (India) Limited's subsidiary, Nederlandse Radiateuren Fabriek B.V. (NRF), has announced the opening of a new office and legal entity in Istanbul, Turkey. This expansion represents a strategic move to strengthen NRF's presence in the Turkish market.",
            "Sentiment": "positive",
            "PublishDate": 1745540031000,
            "Source": "default"
        },
        {
            "Title": "Banco Products' Subsidiary NRF Opens New Office in Turkey",
            "Summary": "Banco Products (India) Limited has announced that its subsidiary, Nederlandse Radiateuren Fabriek B.V. (NRF), has opened a new office and established a legal entity in Istanbul, Turkey. This expansion marks NRF's strategic move to strengthen its presence in the Turkish market.",
            "Sentiment": "positive",
            "PublishDate": 1745511162000,
            "Source": "default"
        },
        {
            "Title": "Banco Products' Subsidiary NRF Establishes New Entity in Romania",
            "Summary": "Nederlandse Radiateuren Fabriek B.V. (NRF), a subsidiary of Banco Products (India), has incorporated a wholly owned subsidiary named NRF Romania S.r.l. The new entity is in the auto/automotive components sector.",
            "Sentiment": "neutral",
            "PublishDate": 1744848324000,
            "Source": "default"
        },
        {
            "Title": "Banco Products' Subsidiary NRF Establishes New Entity in Romania",
            "Summary": "Nederlandse Radiateuren Fabriek B.V. (NRF), a subsidiary of Banco Products (India), has incorporated a wholly owned subsidiary named NRF Romania S.R.L. The new entity is in the auto/automotive components sector.",
            "Sentiment": "positive",
            "PublishDate": 1744819525000,
            "Source": "default"
        },
        {
            "Title": "Banco Products India CFO and Whole-Time Director Resigns",
            "Summary": "Banco Products India Limited has announced the resignation of its Whole-Time Director and Chief Financial Officer (CFO). This change in key leadership positions is significant for the company's corporate governance structure.",
            "Sentiment": "neutral",
            "PublishDate": 1743839617000,
            "Source": "corporate_governance"
        },
        {
            "Title": "NRF Expands Production Capacity with New Factory in Poland",
            "Summary": "Banco Products has announced that NRF, likely a subsidiary or affiliated company, has expanded its production capacity by opening a new factory in Poland. The new facility covers an area of 11,900 square meters.",
            "Sentiment": "positive",
            "PublishDate": 1743574665000,
            "Source": "corporate_action"
        },
        {
            "Title": "Banco Products: Announces 550% Interim Dividend and Bonus Share Issuance",
            "Summary": "Banco Products has declared an interim dividend of ₹11 per share (550%) with a record date of February 14, 2025. The company also announced a 1:1 bonus share issuance on December 30, 2024. The dividend payout is scheduled for February 25, 2025, or later.",
            "Sentiment": "positive",
            "PublishDate": 1739085128000,
            "Source": "corporate_action"
        },
        {
            "Title": "Banco Products Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Banco Products experienced a significant decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 583 million rupees from 891 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin dropped to 9.22% from 15.75% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739019706000,
            "Source": "earnings"
        },
        {
            "Title": "Banco Products Reports Decline in Q3 Profit",
            "Summary": "Banco Products has reported its financial results for the third quarter. The company's consolidated net profit decreased to 309 million rupees from 683 million rupees in the same period last year. However, revenue increased to 6.33 billion rupees from 5.65 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739019690000,
            "Source": "earnings"
        },
        {
            "Title": "Banco Products (India): Last Day to Buy for 1:1 Bonus Share Eligibility",
            "Summary": "December 29 is the final day to purchase Banco Products shares to qualify for the 1:1 bonus share issuance. The record date is set for December 30, 2024. This is the company's first bonus issue since 2007.",
            "Sentiment": "positive",
            "PublishDate": 1735265527000,
            "Source": "corporate_action"
        },
        {
            "Title": "Banco Products Announces Record Date for 1:1 Bonus Share Issue",
            "Summary": "Banco Products has set December 30 as the record date to determine eligible shareholders for a bonus issue of shares in a 1:1 ratio. This means that for every existing share held, shareholders will receive one additional share.",
            "Sentiment": "positive",
            "PublishDate": 1734778328000,
            "Source": "corporate_action"
        },
        {
            "Title": "Banco Products: 1:1 Bonus Shares Announced, Q2 Profit Doubles",
            "Summary": "Banco Products (India) Limited has declared a 1:1 bonus share issue and reported a 110% increase in Q2FY25 net profit to Rs 138.70 crore. The record date for bonus shares will be announced later, with the estimated credit date before January 12, 2025. Q2 revenue rose to Rs 888.81 crore from Rs 717.91 crore year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1731941577000,
            "Source": "corporate_action"
        },
        {
            "Title": "Banco Products Reports Strong Q2 Financial Performance",
            "Summary": "Banco Products has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 1.2 billion rupees to 2.1 billion rupees. Additionally, the EBITDA margin expanded from 16.83% to 22.56%.",
            "Sentiment": "positive",
            "PublishDate": 1731501311000,
            "Source": "result"
        },
        {
            "Title": "Banco Products Reports Q2 Revenue Increase",
            "Summary": "Banco Products has reported a significant increase in its second quarter revenue. The company's revenue for Q2 reached 9.1 billion rupees, up from 7.28 billion rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731501123000,
            "Source": "result"
        },
        {
            "Title": "Banco Products Reports Significant Profit Increase in Q2",
            "Summary": "Banco Products has announced its Q2 consolidated net profit of 13.9 billion rupees, showing a substantial increase from 661 million rupees year-over-year and 687 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731501066000,
            "Source": "result"
        }
    ]
}