{
    "Symbol": "BANDHANBNK",
    "ISIN": "INE545U01014",
    "News": [
        {
            "Title": "RBI Approves ICICI Prudential's 9.95% Stake in Bandhan Bank",
            "Summary": "Reserve Bank of India grants approval to ICICI Prudential Asset Management Company Limited and ICICI Bank group entities to acquire up to 9.95% shareholding in Bandhan Bank Limited.",
            "Sentiment": "positive",
            "PublishDate": 1770821223431,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bandhan Bank cuts savings account minimum balance",
            "Summary": "Bandhan Bank reduces Monthly Average Balance requirement for Standard Savings Account from ₹5,000 to ₹2,000 effective February 1, 2026, offering relief to customers.",
            "Sentiment": "positive",
            "PublishDate": 1769510372991,
            "Source": "stocks"
        },
        {
            "Title": "Bandhan Bank shares surge 6% despite 52% profit drop",
            "Summary": "Bandhan Bank shares jumped 6% to Rs 151.25 after Q3 FY26 results showed 52% YoY profit decline to Rs 205.59 crore, but improved asset quality and deposits growth attracted brokerage upgrades with target prices up to Rs 190.",
            "Sentiment": "positive",
            "PublishDate": 1769152451670,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bandhan Bank Sets 15-17% CAGR Growth Target",
            "Summary": "Bandhan Bank announces ambitious growth guidance with 15-17% CAGR for advances over next 2-3 years, expecting deposit growth to outpace lending expansion during concall update.",
            "Sentiment": "positive",
            "PublishDate": 1769138001190,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bandhan Bank Sets Credit Cost Guidance for FY27",
            "Summary": "Bandhan Bank maintains overall credit cost guidance of 1.6-1.7% by FY27 end, with EEB segment targeted at 2.5-3%. Bank provides strategic outlook on risk management parameters.",
            "Sentiment": "neutral",
            "PublishDate": 1769137956205,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bandhan Bank Board Approves Executive Director Reappointment",
            "Summary": "Bandhan Bank's Board approved the re-appointment of Ratan Kumar Kesh as Executive Director and COO for 3 years from March 31, 2026, and authorized postal ballot for six special business items including ESOP amendments.",
            "Sentiment": "positive",
            "PublishDate": 1769086936257,
            "Source": "stocks"
        },
        {
            "Title": "Bandhan Bank Q3 FY26: PAT jumps 84% QoQ to ₹206 cr",
            "Summary": "Bandhan Bank reported Q3 FY26 PAT of ₹206 crore, up 84% QoQ. GNPA improved to 3.33% from 5.02% QoQ. Deposits grew 11% YoY to ₹1.57 lakh crore while advances rose 10% YoY to ₹1.45 lakh crore.",
            "Sentiment": "positive",
            "PublishDate": 1769077786077,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bandhan Bank Q3FY26 earnings call set for Jan 22",
            "Summary": "Bandhan Bank schedules earnings conference call on January 22, 2026 at 5:00 PM IST to discuss Q3FY26 and 9MFY26 financial performance with analysts and institutional investors.",
            "Sentiment": "neutral",
            "PublishDate": 1768576161609,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bandhan Bank CAE Navin Sharma Resigns, Last Day April 13",
            "Summary": "Bandhan Bank's Chief Audit Executive Navin Sharma has resigned citing personal reasons. His last working day will be April 13, 2026, as per the bank's regulatory disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1768396188862,
            "Source": "stocks"
        },
        {
            "Title": "Bandhan Bank Board Meet on Jan 22 for Q3FY26 Results",
            "Summary": "Bandhan Bank has scheduled its board meeting for January 22, 2026, to consider and approve unaudited financial results for Q3 and nine months ended December 31, 2025. Trading window remains closed until 48 hours post-declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1768314801347,
            "Source": "co_actions_results"
        },
        {
            "Title": "Macquarie Downgrades Bandhan Bank to Underperform",
            "Summary": "Macquarie Securities has downgraded Bandhan Bank from Outperform to Underperform rating while reducing the target price to ₹130.00 per share.",
            "Sentiment": "negative",
            "PublishDate": 1768190047779,
            "Source": "stocks"
        },
        {
            "Title": "Bandhan Bank shares surge 3.9% on Q3 business update",
            "Summary": "Bandhan Bank shares rose 3.9% to ₹150.05 after reporting 10% YoY loan growth to ₹1.45L cr and 11.1% deposit growth to ₹1.57L cr in Q3, with improved collection efficiency at 98.1%.",
            "Sentiment": "positive",
            "PublishDate": 1767500069161,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bandhan Bank Sells ₹6,872 Cr Bad Loan Portfolio",
            "Summary": "Bandhan Bank offloaded NPAs worth ₹3,165 cr and written-off loans of ₹3,707 cr to ARCs for total consideration of ₹901.72 cr. Transactions completed through Swiss Challenge Method and auction process.",
            "Sentiment": "positive",
            "PublishDate": 1767026002931,
            "Source": "stocks"
        },
        {
            "Title": "Bandhan Bank Sells ₹3,212 Cr Bad Loans to ARCIL",
            "Summary": "Bandhan Bank has sold ₹3,212 crore worth of bad microfinance loans to Asset Reconstruction Company (India) Limited (ARCIL) as part of its asset quality management strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1766979110584,
            "Source": "stocks"
        },
        {
            "Title": "Bandhan Bank offloads ₹6,872 cr bad loans to ARCs",
            "Summary": "Bandhan Bank sold ₹6,872 crore unsecured NPA and written-off portfolios to ARCIL and Phoenix ARC for ₹901.72 crore total consideration through competitive bidding processes.",
            "Sentiment": "positive",
            "PublishDate": 1766967947833,
            "Source": "co_actions_results"
        },
        {
            "Title": "RBI Approves Ratan Kumar Kesh's Return to Bandhan Bank",
            "Summary": "Reserve Bank of India has given approval for Ratan Kumar Kesh's return as Executive Director at Bandhan Bank, marking a significant leadership development for the banking institution.",
            "Sentiment": "positive",
            "PublishDate": 1766757206362,
            "Source": "stocks"
        },
        {
            "Title": "Bandhan Bank faces ₹3 cr GST demand from Gujarat",
            "Summary": "Bandhan Bank receives GST demand order of ₹2.99 crores from Gujarat Deputy Commissioner for alleged excess input tax credit and non-payment issues for FY 2021-22.",
            "Sentiment": "negative",
            "PublishDate": 1766754924604,
            "Source": "stocks"
        },
        {
            "Title": "Bandhan Bank Approves Sale of NPAs and Written-off Portfolios Worth ₹32.12 Billion",
            "Summary": "Bandhan Bank has approved the sale of its non-performing assets (NPAs) and written-off loan portfolios with a principal outstanding amount of ₹32.12 billion rupees. The bank will use the Swiss Challenge Method for conducting this NPA sale process.",
            "Sentiment": "neutral",
            "PublishDate": 1764288432713,
            "Source": "corporate_action"
        },
        {
            "Title": "Bandhan Bank's Head of Internal Vigilance P Ramaswamy Steps Down",
            "Summary": "P Ramaswamy has stepped down from his position as Head of Internal Vigilance at Bandhan Bank. The departure affects the bank's internal oversight structure, though the reasons for the resignation were not disclosed.",
            "Sentiment": "neutral",
            "PublishDate": 1764073882842,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bandhan Bank Seeks Shareholder Approval for Two Director Appointments via Postal Ballot",
            "Summary": "Bandhan Bank has issued a postal ballot notice seeking shareholder approval for two director appointments. The bank proposes to appoint Avijit Mukerji as a Non-Executive Non-Independent Director, nominated by promoter Bandhan Financial Holdings Limited. Mukerji is a Chartered Accountant with over three decades of experience in audit and assurance, formerly a partner at PricewaterhouseCoopers India. The second proposal involves appointing Gauri Prosad Sarma as an Independent Director for a three-year term. Sarma brings 37 years of banking experience, having served as Chief General Manager at Punjab National Bank with expertise in digital banking and fintech. The remote e-voting period runs from November 12, 2025, to December 11, 2025, with results to be announced by December 13, 2025. Both appointments are effective from their respective dates in 2025, with the cut-off date for eligible voters set as November 7, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762912598652,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bandhan Bank Reports Q2FY26 Net Profit of Rs 112 Crore, Faces Margin Pressure from Rate Cuts",
            "Summary": "Bandhan Bank reported a net profit of Rs 112 crore for Q2FY26, down from Rs 937 crore in Q2FY25. Net Interest Margin compressed to 5.8% from 6.4% in the previous quarter, primarily due to a 75 basis point repo rate cut impact and 200 basis point MCLR reduction. Gross advances stood at Rs 1.40 lakh crore with 7% YoY growth, while deposits grew 11% YoY to Rs 1.58 lakh crore. The Emerging Entrepreneur Business (EEB) portfolio declined 13% YoY to Rs 51,733 crore. Gross and net NPA ratios remained stable at 5% and 1.4% respectively. Credit costs improved marginally to 3.4% from 3.5% in Q1FY26. The bank undertook technical write-offs of Rs 865 crore during the quarter. Capital Adequacy Ratio stands at 18.6% with Tier I capital at 17.8%. Management expects margin improvement from Q4 onwards as term deposit repricing benefits flow through.",
            "Sentiment": "negative",
            "PublishDate": 1762453092954,
            "Source": "earnings"
        },
        {
            "Title": "Bandhan Bank Shares Rise Despite 88% Profit Drop in Q2 Results",
            "Summary": "Bandhan Bank's share price gained 1.43% following the release of its second quarter results. The bank reported a significant 88% decline in standalone net profit to Rs 112 crore compared to Rs 937 crore in the same period last year. Asset quality showed mixed signals with gross NPA ratio rising to 5.02% from 4.96% in the previous quarter, while gross NPA in absolute terms increased to Rs 7,015.13 crore from Rs 6,622.64 crore. Net NPA ratio expanded to 1.37% from 1.36% quarter-on-quarter. On the positive side, total deposits grew 10.9% year-on-year to Rs 15.81 lakh crore, with retail deposits up 16% to Rs 1.12 lakh crore. The wholesale banking segment represents 29.2% of the total loan book, followed by housing and EEB group at 23.6% each. The stock has declined 13.58% over the past 12 months.",
            "Sentiment": "neutral",
            "PublishDate": 1762146060500,
            "Source": "earnings"
        },
        {
            "Title": "Bandhan Bank Shares Drop 6% as Net Profit Plunges 88% in Q2",
            "Summary": "Bandhan Bank shares declined 5.9% to Rs 160.40 following weak quarterly results. The bank reported net profit of Rs 110 crore, down 88.1% year-on-year and 69.9% sequentially. Net interest income fell to Rs 2,590 crore, declining 11.8% YoY and 6.1% QoQ. Total net revenue dropped to Rs 3,140 crore, down 11.5% YoY and 10.0% QoQ. Operating profit decreased to Rs 1,310 crore, falling 29.4% YoY and 21.5% sequentially. Asset quality deteriorated with gross NPA ratio rising to 5%, up 34 bps YoY. Net interest margin compressed to 5.8%, down 152 bps YoY. Return on assets fell to 0.2% while return on equity dropped to 1.8%. On the positive side, gross advances grew 7.2% YoY to Rs 1,40,040 crore, total deposits increased 10.9% YoY to Rs 1,58,070 crore, and the secured book share improved to 54.9%.",
            "Sentiment": "negative",
            "PublishDate": 1761888047354,
            "Source": "earnings"
        },
        {
            "Title": "Bandhan Bank Targets ₹1.4 Lakh Cr Loan Book and 1%+ ROA by FY27",
            "Summary": "Bandhan Bank has outlined its strategic plans for FY26 and beyond, targeting a loan book of ₹1.4 lakh crore with 10-12% AUM growth. The bank aims to maintain a 54.9% secured loan mix while keeping GNPA at 5%. Key focus areas include geographical diversification beyond the eastern region, digital customer onboarding, and retail deposit growth of 16% year-on-year. The bank plans to achieve a return on assets (ROA) of over 1% by FY27.",
            "Sentiment": "positive",
            "PublishDate": 1761835279417,
            "Source": "stock"
        },
        {
            "Title": "Bandhan Bank Reports 88% Decline in Q2 Net Profit to 1.12 Billion Rupees",
            "Summary": "Bandhan Bank reported Q2 net profit of 1.12 billion rupees, down from 9.37 billion rupees year-over-year. Revenue declined to 53.54 billion rupees from 55 billion rupees in the same period last year. The bank's asset quality showed mixed trends with gross non-performing assets (GNPA) rising to 5.02% from 4.96% quarter-over-quarter, while net non-performing assets (NNPA) increased marginally to 1.37% from 1.36%. Provisions stood at 11.53 billion rupees compared to 11.46 billion rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1761823721908,
            "Source": "earnings"
        },
        {
            "Title": "Bandhan Bank Schedules Earnings Call for Q2FY26 and H1FY26 Results on October 30, 2025",
            "Summary": "Bandhan Bank has scheduled an earnings call with analysts and investors to discuss the company's performance for Q2FY26 and H1FY26 ended September 30, 2025. The call is set to take place on Thursday, October 30, 2025, at 17:00 hrs IST. The bank has provided multiple dial-in numbers for different countries and regions, along with online access through DiamondPass registration. Participants are advised to dial in 10 minutes prior to the scheduled time.",
            "Sentiment": "neutral",
            "PublishDate": 1760794622581,
            "Source": "earnings"
        },
        {
            "Title": "Bandhan Bank Schedules Board Meeting on October 30, 2025 for Q2 Financial Results",
            "Summary": "Bandhan Bank Limited has scheduled a Board of Directors meeting on October 30, 2025, to consider and approve the Unaudited Financial Results for the quarter and half-year ended September 30, 2025. The trading window for designated persons, their immediate relatives, auditors, and connected persons remains closed from October 1, 2025 until 48 hours after the results declaration. The bank will also host an earnings call with analysts and investors on October 30, 2025 to discuss quarterly performance, with details to be provided later.",
            "Sentiment": "neutral",
            "PublishDate": 1760360767582,
            "Source": "corporate_action"
        },
        {
            "Title": "Bandhan Bank Reports 7% Loan Growth and 11% Deposit Rise in Q2",
            "Summary": "Bandhan Bank reported steady growth in its quarterly results with loans and advances reaching ₹1.40 lakh crore, up 7.2% year-on-year and 4.8% quarter-on-quarter. Total deposits increased 10.9% year-on-year to ₹1.58 lakh crore. Retail term deposits surged 39% year-on-year to ₹68,539 crore, while CASA deposits declined 6.5% year-on-year to ₹44,214 crore. The retail-to-total deposit ratio improved to 71.4% from 68.2% in the previous quarter. The bank's collection efficiency improved marginally to 98.0% from 97.9% in the previous quarter. The Liquidity Coverage Ratio stood at approximately 152.68%. Bandhan Bank shares closed at ₹165.90, gaining 1.50% on the trading day.",
            "Sentiment": "positive",
            "PublishDate": 1759596913817,
            "Source": "stock"
        },
        {
            "Title": "Bandhan Bank Appoints Avijit Mukerji as Non-Executive Director, Recommends Re-appointment of Ratan Kumar Kesh",
            "Summary": "Bandhan Bank's Board of Directors approved the appointment of Avijit Mukerji as Additional Non-Executive Non-Independent Director, effective September 25, 2025. Mukerji is a nominee of Bandhan Financial Holdings Limited, the bank's promoter, and his appointment requires shareholder approval within three months. The board also recommended the re-appointment of Ratan Kumar Kesh as Whole-time Director and Chief Operating Officer for a further period of 3 years, effective March 31, 2026, subject to RBI and shareholder approvals. Mukerji is a Chartered Accountant with over three decades of audit experience and is founder of TatvaSutra Solutions LLP. Kesh has 27 years of banking experience and served as Interim MD&CEO of Bandhan Bank from July to October 2024. Both directors are not related to other board members and face no regulatory disqualifications.",
            "Sentiment": "neutral",
            "PublishDate": 1758815358568,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bandhan Bank Sells YES Bank Stake to Sumitomo Mitsui Banking Corporation",
            "Summary": "Bandhan Bank Limited sold 15,39,34,975 equity shares of YES Bank Limited to SUMITOMO MITSUI BANKING CORPORATION at Rs. 21.50 per share on September 17, 2025. The transaction reduced Bandhan Bank's shareholding in YES Bank from 0.70% to 0.21%. The sale represents a continuation of Bandhan Bank's divestment in YES Bank, following a previous disclosure dated May 09, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758108623114,
            "Source": "order&deals"
        },
        {
            "Title": "Bandhan Bank Targets 15-17% Loan Growth Over Next Three Years Despite Industry Slowdown",
            "Summary": "Bandhan Bank aims to achieve 15-17% credit growth CAGR over the next three years, significantly outpacing the industry's loan growth which has declined from 20% to 9.8% over the past five quarters. The bank's secured portfolio expanded 27% year-on-year, driven by housing finance, retail, and commercial banking, while its microfinance segment contracted 15%. CFO Rajeev Mantri expects sequential recovery in the microfinance business from Q3 FY26, with moderate 5% growth projected this year. Bandhan Bank is accelerating its shift toward secured lending, with secured assets increasing from 42% of the loan book in March 2024 to 52% by June 2025, expected to reach another 5-6 percentage points higher by FY27-end. Net interest margins are expected to soften in the near term due to repo rate cuts and portfolio shifts toward secured assets, though deposit rate cuts and lower slippages in the second half should support recovery.",
            "Sentiment": "positive",
            "PublishDate": 1756894079979,
            "Source": "stock"
        },
        {
            "Title": "Bandhan Bank Q1 FY26 Results: Profit Falls 65% YoY to ₹372 Crores Amid EEB Segment Challenges",
            "Summary": "Bandhan Bank reported a net profit of ₹372 crores for Q1 FY26, down 65% from ₹1,063 crores in Q1 FY25, though up 17% sequentially from ₹318 crores in Q4 FY25. The bank's gross advances stood at ₹1.34 lakh crores with 6% YoY growth, while total deposits grew 16% YoY to ₹1.55 lakh crores. The EEB (microfinance) portfolio declined 15% YoY to ₹52,812 crores due to industry guardrails implementation, while the non-EEB portfolio grew 27% YoY and now accounts for 60% of total advances. Net interest income fell 8% YoY to ₹2,757 crores with NIM at 6.4%, down from 6.7% in Q4 FY25. Gross NPA stood at 5.0% and Net NPA at 1.4%. The bank undertook technical write-offs of ₹1,047 crores during the quarter. Capital adequacy ratio remained strong at 19.4% with Tier I capital at 18.6%. ROA was 0.8% and ROE was 6% on an annualized basis. The secured loan portfolio grew 29% YoY and now constitutes 52% of total advances. Management expects EEB segment challenges to persist until Q2 FY26 with gradual recovery in the second half.",
            "Sentiment": "negative",
            "PublishDate": 1753449758632,
            "Source": "earnings"
        },
        {
            "Title": "Bandhan Bank Plans 15-16% Loan Growth Through Secured Lending Shift",
            "Summary": "Bandhan Bank is targeting 15-16% loan book growth in FY26 and FY27, with a strategic shift toward secured lending. The bank's secured loan portfolio has increased from 48-50% to 52%. Microfinance segment growth is expected to moderate to 8-10% in FY26, down from previous aggressive expansion. The bank maintains its full-year credit cost guidance of 2.5%, expecting 3% in Q2 and potentially tapering to 2% by Q4. Net interest margins face pressure from rising funding costs, though the bank implemented rate hikes of 25 basis points last quarter and 75 basis points from July. Bandhan Bank reported a 65% year-on-year profit decline to Rs 372 crore in Q1FY26 from Rs 1,063 crore in Q1FY25, while total income rose 2% to Rs 6,201.5 crore. New regulatory guidelines from April 1 have impacted industry growth, though delinquencies and slippages have improved.",
            "Sentiment": "neutral",
            "PublishDate": 1753149722083,
            "Source": "stock"
        },
        {
            "Title": "Bandhan Bank Reports 65% Decline in Q1 Net Profit to 3.7 Billion Rupees",
            "Summary": "Bandhan Bank reported a net profit of 3.7 billion rupees for Q1, representing a significant decline from 10.63 billion rupees in the same period last year. The result exceeded analyst estimates of 3.4 billion rupees. Revenue decreased to 54.7 billion rupees from 55.36 billion rupees year-over-year. Asset quality showed deterioration with gross non-performing assets (GNPA) rising to 4.96% from 4.71% in the previous quarter, while net non-performing assets (NNPA) increased to 1.36% from 1.28% quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1753057607549,
            "Source": "earnings"
        },
        {
            "Title": "Bandhan Bank Reports 11.43% Quarterly Decline in Slippages",
            "Summary": "Bandhan Bank reported an 11.43% drop in slippages compared to the previous quarter. This indicates a reduction in the bank's non-performing assets moving from standard to sub-standard category during the reporting period.",
            "Sentiment": "positive",
            "PublishDate": 1752908325315,
            "Source": "stock"
        },
        {
            "Title": "Bandhan Bank Q1 Results: Net Profit Declines, Asset Quality Deteriorates",
            "Summary": "Bandhan Bank reported its Q1 results with a net profit of 3.7 billion rupees, down from 10.63 billion rupees year-over-year, but slightly above the estimated 3.4 billion rupees. Revenue decreased to 54.7 billion rupees from 55.36 billion rupees in the same period last year. Provisions stood at 11.46 billion rupees, down from 12.6 billion rupees quarter-on-quarter. The bank's asset quality worsened, with Gross Non-Performing Assets (GNPA) rising to 4.96% from 4.71% in the previous quarter, and Net Non-Performing Assets (NNPA) increasing to 1.36% from 1.28%.",
            "Sentiment": "negative",
            "PublishDate": 1752838933000,
            "Source": "result"
        },
        {
            "Title": "Bandhan Bank: Q1 Profit Beats Estimates Despite Asset Quality Decline",
            "Summary": "Bandhan Bank reported Q1 net profit of ₹372 crore, exceeding estimates but down 65% YoY. NII at ₹2,757.2 crore, down 7.7% YoY. Asset quality weakened with Gross NPA ratio rising to 4.96% from 4.71% QoQ. Slippages moderated to ₹1,550 crore from ₹1,750 crore in Q4FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1752835954000,
            "Source": "earnings"
        },
        {
            "Title": "Bandhan Bank: Q1FY26 Results Announcement Scheduled for July 18",
            "Summary": "Bandhan Bank to announce Q1FY26 results on July 18, 2025. Board meeting in Kolkata to review and approve unaudited financial results. Earnings call scheduled for 5 p.m. IST on the same day. Trading window closed from July 1 to prevent insider trading.",
            "Sentiment": "neutral",
            "PublishDate": 1752657150000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bandhan Bank: Q1 Deposits Rise 16% YoY, Loan Growth Slows",
            "Summary": "Bandhan Bank reported 16.1% YoY growth in total deposits to ₹1.55 lakh crore in Q1 FY26. Loans grew 6.4% YoY but fell 2.5% QoQ. CASA deposits dropped, reducing the CASA ratio to 27.06%. Liquidity coverage ratio remained strong at 178.28%.",
            "Sentiment": "neutral",
            "PublishDate": 1751562151000,
            "Source": "result"
        },
        {
            "Title": "Bandhan Bank Reports Mixed Financial Performance in Latest Quarter",
            "Summary": "Bandhan Bank has reported a mixed financial performance in its latest quarter. The bank's loans and advances increased by 6.4% year-over-year to ₹1.34 lakh crore, but decreased by 2.5% quarter-over-quarter. On the other hand, total deposits showed growth both annually and quarterly, rising by 16.1% year-over-year and 2.3% quarter-over-quarter to reach ₹1.55 lakh crore.",
            "Sentiment": "neutral",
            "PublishDate": 1751561066000,
            "Source": "default"
        },
        {
            "Title": "Bandhan Bank: Suraksha Home Loan Offers Up to 90% Property Cost Coverage",
            "Summary": "Bandhan Bank's Suraksha home loan provides financing for up to 90% of property cost with interest rates ranging from 8.66% to 12.83% per annum. The loan is available to both salaried and self-employed individuals aged 21-75 years. Flexible repayment terms are offered, and the application process involves document submission and verification.",
            "Sentiment": "neutral",
            "PublishDate": 1748308850000,
            "Source": "normal_news"
        },
        {
            "Title": "Bandhan Bank: CEO Forecasts Strong Profit Growth from Q3",
            "Summary": "Bandhan Bank's CEO Partha Pratim Sengupta expects significant quarterly profit growth from Q3 FY26, citing reduced microfinance slippages. The bank is diversifying its portfolio, with secured loans increasing to 50.5% in FY25. Despite potential NII pressure in Q1 and Q2 due to RBI rate cuts, the bank anticipates mitigation by Q3 through deposit cost rationalization.",
            "Sentiment": "positive",
            "PublishDate": 1746245634000,
            "Source": "earnings"
        },
        {
            "Title": "Bandhan Bank: MFI Stress to Impact NIMs in H1 FY25",
            "Summary": "Bandhan Bank expects stress in the microfinance sector to persist in H1 FY25, affecting net interest margins. The bank is shifting from unsecured to secured loans, with the secured book now at 50.5%. NIMs are expected to moderate from the current 6.7%. Slippages may normalize to 1.5-2.0% from Q3. The bank plans to grow in retail and housing loans to offset potential impacts.",
            "Sentiment": "neutral",
            "PublishDate": 1746178574000,
            "Source": "earnings"
        },
        {
            "Title": "Bandhan Bank: Q4 Results Prompt Mixed Analyst Reactions",
            "Summary": "Bandhan Bank's Q4 results led to mixed analyst reactions. Jefferies cut earnings estimates but maintained a 'Buy' rating, raising the target price to ₹195. Nomura kept a neutral stance with a ₹165 target. The bank reported a 3.6% YoY drop in NII to ₹2,756 crore, with operating profit falling 14.5%. Management warned of high credit costs until September 2025. Despite challenges, the bank declared a dividend of ₹1.5 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1746158317000,
            "Source": "earnings"
        },
        {
            "Title": "Bandhan Bank Reports Strong Q4 Results, Recommends Dividend",
            "Summary": "Bandhan Bank's Q4 net profit surged to 3.18 billion rupees, surpassing estimates. Interest earned increased to 54.34 billion rupees. Provisions decreased to 12.6 billion rupees. GNPA slightly increased to 4.71%, while NNPA remained stable at 1.28%. The bank recommended a dividend of 1.50 rupees per equity share and reported 12% YoY growth in deposits, reaching 1.51 lakh crore rupees as of March 2025.",
            "Sentiment": "positive",
            "PublishDate": 1746144834000,
            "Source": "default"
        },
        {
            "Title": "Bandhan Bank: Q4 Net Profit Surges Six-Fold Despite Asset Quality Concerns",
            "Summary": "Bandhan Bank reported a six-fold increase in Q4 net profit to Rs 312 crore, driven by lower provisions. However, asset quality deteriorated with NPA ratio rising to 4.71%. The bank's gross advances grew 10% YoY, with secured advances rising 32%. The share of unsecured micro loans decreased to 26.3% of the portfolio.",
            "Sentiment": "neutral",
            "PublishDate": 1746015195000,
            "Source": "earnings"
        },
        {
            "Title": "Bandhan Bank Reports Q4 Results and Dividend",
            "Summary": "Bandhan Bank announced its Q4 results and financial updates. Deposits grew 12% YoY to Rs. 1.51 lakh crore as of March 2025. The bank recommended a dividend of 1.50 rupees per equity share. Q4 GNPA stood at 4.71% (vs 4.68% QoQ) and NNPA at 1.28% (unchanged QoQ). Provisions for Q4 were 12.6B rupees, down from 13.76B rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746013499000,
            "Source": "default"
        },
        {
            "Title": "Bandhan Bank Reports Strong Q4 Profit Growth",
            "Summary": "Bandhan Bank has announced its Q4 financial results. The bank's interest earned increased to 54.34 billion rupees from 51.89 billion rupees year-over-year. Net profit for Q4 rose significantly to 3.18 billion rupees, compared to 546.3 million rupees in the same period last year. This exceeds the estimated profit of 2.4 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1746013461000,
            "Source": "result"
        },
        {
            "Title": "Bandhan Bank: Declares 15% Dividend Amid Deposit Growth",
            "Summary": "Bandhan Bank's Q4 net interest income fell 4% YoY to ₹2,756 crore. Profit after tax was ₹318 crore. Board proposed ₹1.5 per share dividend. FY25 saw 10% growth in advances to ₹1.37 lakh crore and 12% growth in deposits to ₹1.51 lakh crore. Net interest margin at 6.7%, provision coverage ratio at 86.5%.",
            "Sentiment": "neutral",
            "PublishDate": 1746009258000,
            "Source": "earnings"
        },
        {
            "Title": "Bandhan Bank: Q4 Results and Dividend Announcement Scheduled for April 30",
            "Summary": "Bandhan Bank will announce Q4 and FY 2024-25 results on April 30. The Board will consider recommending a dividend. An earnings call is scheduled for 4 pm on the same day. The trading window for insiders is closed until 48 hours after the results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1745833627000,
            "Source": "corporate_action"
        }
    ]
}