{
    "Symbol": "BANG",
    "ISIN": "INE863I01016",
    "News": [
        {
            "Title": "Bang Overseas Reports Mixed Financial Results for Quarter Ended September 2025",
            "Summary": "Bang Overseas Limited announced unaudited financial results for the quarter and half year ended September 30, 2025, showing standalone revenue from operations of Rs. 4,730.27 lakhs for the quarter with consolidated revenue of Rs. 4,810.10 lakhs. The company's Board of Directors approved the results during a meeting held on November 14, 2025, with the financial statements prepared in accordance with Indian Accounting Standards and reviewed by statutory auditors Bharat Gupta & Co.",
            "Sentiment": "neutral",
            "PublishDate": 1763134806670,
            "Source": "earnings"
        },
        {
            "Title": "Bang Overseas Limited Appoints Omkar Govind Jadhav Sangeeta as Company Secretary and Compliance Officer",
            "Summary": "Bang Overseas Limited has appointed Mr. Omkar Govind Jadhav Sangeeta as Company Secretary, Key Managerial Personnel, and Compliance Officer effective October 18, 2025. The appointment was approved by the Board of Directors during their meeting on October 18, 2025, which concluded at 11:50 A.M. Mr. Jadhav holds membership number A76360 and is an Associate Member of the Institute of Company Secretaries of India. He is a Law graduate and holds a Post Graduate degree in Commerce with specialization in Business Management from University of Mumbai. He is not related to any Director of the company. The company trades on BSE with scrip code 532946 and on NSE with symbol BANG.",
            "Sentiment": "neutral",
            "PublishDate": 1760770470160,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bang Overseas Limited Shareholders Approve Appointment of Independent Director",
            "Summary": "Bang Overseas Limited held its 1st Extraordinary General Meeting on August 25, 2025, where shareholders approved the appointment of Mr. Mahesh Ramesh Bhagwat as an Independent Director. The special resolution received overwhelming support with 99.9999% votes in favor, with 6,881,081 votes for and only 6 votes against. The meeting was conducted through e-voting and video conferencing, with 17 promoter group members and 59 public shareholders attending virtually. Out of 13,560,000 total shares, 6,881,087 votes were polled, representing 50.7455% of outstanding shares. The scrutinizer Sonam Jain oversaw the voting process, and the meeting lasted 20 minutes from 11:00 AM to 11:20 AM.",
            "Sentiment": "positive",
            "PublishDate": 1756122871339,
            "Source": "corporate_action"
        },
        {
            "Title": "Bang Overseas Limited Reports Q1 2025 Financial Results with Mixed Performance",
            "Summary": "Bang Overseas Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs. 4,780.93 lakhs compared to Rs. 4,180.52 lakhs in the same quarter last year. Standalone profit for the period was Rs. 115.02 lakhs versus a loss of Rs. 467.64 lakhs in the previous year quarter. On a consolidated basis, the company achieved revenue of Rs. 4,855.87 lakhs and profit of Rs. 169.20 lakhs for the current quarter. Basic earnings per share improved to Rs. 0.85 for standalone and Rs. 1.25 for consolidated results. The company operates primarily in manufacturing and trading of textile products. The consolidated results include subsidiaries Vedanta Creations Limited and Bang HK Limited, with subsidiary companies contributing a net profit of Rs. 54.18 lakhs for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1755077567182,
            "Source": "earnings"
        }
    ]
}