{
    "Symbol": "BANKINDIA",
    "ISIN": "INE084A01016",
    "News": [
        {
            "Title": "RBI Governor Proposes Lifting VRR Limit",
            "Summary": "Reserve Bank of India Governor proposes removing the existing 2.5 trillion INR ceiling on the Voluntary Retention Route, potentially expanding foreign investment access in Indian markets.",
            "Sentiment": "positive",
            "PublishDate": 1770354184931,
            "Source": "stocks"
        },
        {
            "Title": "RBI Governor Proposes Higher MSME Loan Limits",
            "Summary": "Reserve Bank of India Governor suggests increasing unsecured loan limits for Micro, Small and Medium Enterprises to ₹2 million to enhance credit accessibility for small businesses.",
            "Sentiment": "positive",
            "PublishDate": 1770354133645,
            "Source": "stocks"
        },
        {
            "Title": "RBI Governor Forecasts CPI at 4% in Q1, 4.2% in Q2",
            "Summary": "Reserve Bank of India Governor provides inflation outlook with Consumer Price Index projected at 4.00% for Q1 and 4.20% for Q2, indicating monetary policy expectations for upcoming quarters.",
            "Sentiment": "neutral",
            "PublishDate": 1770353467880,
            "Source": "stocks"
        },
        {
            "Title": "RBI Governor Forecasts 4% CPI Inflation in Q1 FY27",
            "Summary": "Reserve Bank of India Governor provides forward guidance on consumer price inflation trajectory, projecting CPI inflation to reach 4% target in the first quarter of fiscal year 2027.",
            "Sentiment": "neutral",
            "PublishDate": 1770353415927,
            "Source": "stocks"
        },
        {
            "Title": "RBI Governor Projects CPI Inflation At 3.2% In Q4 FY26",
            "Summary": "Reserve Bank of India Governor announces inflation projection of 3.2% for the fourth quarter of fiscal year 2026, indicating monetary policy outlook for the Indian economy.",
            "Sentiment": "neutral",
            "PublishDate": 1770353335975,
            "Source": "stocks"
        },
        {
            "Title": "RBI Revises FY26 Inflation Forecast to 2.1%",
            "Summary": "Reserve Bank of India Governor updates Consumer Price Index inflation projection for FY26 to 2.1%, marking an upward revision from the previous estimate of 2.0%.",
            "Sentiment": "neutral",
            "PublishDate": 1770353309120,
            "Source": "stocks"
        },
        {
            "Title": "RBI Revises GDP Growth Estimates for Q1, Q2",
            "Summary": "Reserve Bank of India Governor announces revised GDP growth figures of 6.9% for Q1 and 7% for Q2, reflecting updated economic assessments for the Indian economy.",
            "Sentiment": "positive",
            "PublishDate": 1770353106314,
            "Source": "stocks"
        },
        {
            "Title": "RBI Sets Marginal Standing Facility Rate at 5.50%",
            "Summary": "Reserve Bank of India Governor announces the Marginal Standing Facility rate at 5.50%, providing clarity on the central bank's monetary policy stance for financial institutions.",
            "Sentiment": "neutral",
            "PublishDate": 1770352824462,
            "Source": "stocks"
        },
        {
            "Title": "Indian Banks Seek RBI Liquidity Rule Relaxation",
            "Summary": "Indian lenders have approached the Reserve Bank of India requesting relaxation of liquidity rules to unlock funds parked for short-term financial stress requirements, aiming to free up capital for growth initiatives.",
            "Sentiment": "neutral",
            "PublishDate": 1770194850983,
            "Source": "stocks"
        },
        {
            "Title": "Bank of India Redeems Rs 750 Crore AT1 Bonds",
            "Summary": "Bank of India exercised call option to fully redeem 9.04% Additional Tier I Bonds Series VI worth Rs 750 crores on January 28, 2026, paying principal plus Rs 56.10 crore broken period interest.",
            "Sentiment": "neutral",
            "PublishDate": 1769608918139,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of India Q3FY26 Results Show Strong Growth",
            "Summary": "Bank of India reported robust Q3FY26 performance with 13.63% YoY growth in global advances to Rs.7,40,314 crore and 7% increase in net profit to Rs.2,705 crore, while maintaining improved asset quality.",
            "Sentiment": "positive",
            "PublishDate": 1769601416963,
            "Source": "co_actions_results"
        },
        {
            "Title": "India bond yields hit 11-month high on supply concerns",
            "Summary": "India's benchmark 10-year bond yield surged to 6.7194%, highest since March 4, driven by heavy state borrowing of 398 billion rupees and tight liquidity despite RBI's $23 billion injection plan.",
            "Sentiment": "negative",
            "PublishDate": 1769518164454,
            "Source": "stocks"
        },
        {
            "Title": "Bank of India Appoints New Company Secretary",
            "Summary": "Bank of India announces appointment of Smt. Usha Ramsinghani as Company Secretary effective 28.01.2026, replacing Shri Rajesh V. Upadhya who has been transferred to Zonal Audit Office, Hyderabad.",
            "Sentiment": "neutral",
            "PublishDate": 1769515085644,
            "Source": "stocks"
        },
        {
            "Title": "PSU banks offer compelling value in BFSI space",
            "Summary": "Bank of India Mutual Fund CIO Alok Singh highlights PSU banks as attractive investment opportunities, citing cheap valuations and improving efficiency amid BFSI sector growth prospects.",
            "Sentiment": "positive",
            "PublishDate": 1769405746974,
            "Source": "mutualfunds"
        },
        {
            "Title": "Banks Closed Today: Fourth Saturday Holiday",
            "Summary": "Bank branches remain closed today, January 24, as it falls on the fourth Saturday of the month, observed as a weekly holiday under RBI norms across the country.",
            "Sentiment": "neutral",
            "PublishDate": 1769224417719,
            "Source": "finance_general"
        },
        {
            "Title": "RBI Announces Third Liquidity Tranche as Rupee Hits Low",
            "Summary": "RBI unveils ₹50,000 crore OMO purchases and ₹25,000 crore VRR operation as rupee touches record low of 91.97 against dollar amid FII outflows worth ₹36,587 crore in 2025.",
            "Sentiment": "negative",
            "PublishDate": 1769181649977,
            "Source": "currency"
        },
        {
            "Title": "Central Bank Plans Ops Continuity During Strike",
            "Summary": "Central Bank of India prepares to maintain smooth operations as union announces one-day strike scheduled for January 27, 2026, ensuring minimal disruption to banking services.",
            "Sentiment": "neutral",
            "PublishDate": 1769175614969,
            "Source": "stocks"
        },
        {
            "Title": "Banks Closed Jan 26 for Republic Day Holiday",
            "Summary": "All banks across India will remain closed on January 26 for Republic Day, creating a three-day weekend. ATMs and digital banking services will continue operating normally during the closure.",
            "Sentiment": "neutral",
            "PublishDate": 1769175587811,
            "Source": "stocks"
        },
        {
            "Title": "RBI injects ₹1.25 trillion to ease cash crunch",
            "Summary": "Reserve Bank announces multiple liquidity measures including 90-day repo operations, USD swaps, and government securities purchases to address tightening banking system conditions over coming weeks.",
            "Sentiment": "positive",
            "PublishDate": 1769172101338,
            "Source": "stocks"
        },
        {
            "Title": "RBI dollar sales hit $43.2bn amid rupee volatility",
            "Summary": "Reserve Bank of India's net dollar sales reached $43.2 billion till November, exceeding FY25 levels by 28% as rupee remains volatile against USD amid challenging balance of payments.",
            "Sentiment": "negative",
            "PublishDate": 1769076442971,
            "Source": "currency"
        },
        {
            "Title": "India to remain fastest-growing major economy: RBI",
            "Summary": "RBI's January bulletin projects India's GDP growth at 7.4% for 2025-26, maintaining its position as the world's fastest-growing major economy despite global geopolitical tensions and trade uncertainties.",
            "Sentiment": "positive",
            "PublishDate": 1769043840451,
            "Source": "stocks"
        },
        {
            "Title": "RBI sells $9.7bn in Nov to support rupee amid decline",
            "Summary": "Reserve Bank of India net sold $9.7 billion in November, down from $11.8 billion in October, as rupee depreciated 0.7%. Real effective exchange rate dropped to 94.20 in December from 96.17 in November.",
            "Sentiment": "negative",
            "PublishDate": 1769043318336,
            "Source": "currency"
        },
        {
            "Title": "Bank of India Q3FY26 Results: Net Profit Grows 7.47%",
            "Summary": "Bank of India reported Q3FY26 net profit of ₹2,705 crores, up 7.47% YoY. Global business crossed ₹16 lakh crores milestone with advances growing 13.63% YoY. GNPA ratio improved to 2.26%.",
            "Sentiment": "positive",
            "PublishDate": 1768994975015,
            "Source": "co_actions_results"
        },
        {
            "Title": "RBI conducts USD/INR swaps across multiple maturities",
            "Summary": "Reserve Bank of India executed buy-sell USD/INR foreign exchange swaps for spot over June, July, August and October maturities to manage liquidity amid rupee pressure.",
            "Sentiment": "neutral",
            "PublishDate": 1768983917918,
            "Source": "currency"
        },
        {
            "Title": "India bonds gain on RBI buying hopes",
            "Summary": "Indian government bonds rose early Wednesday as traders expect RBI secondary market purchases and additional open market operations. The benchmark 10-year bond yield dipped to 6.6658% from 6.6722%.",
            "Sentiment": "positive",
            "PublishDate": 1768972544423,
            "Source": "stocks"
        },
        {
            "Title": "RBI tightens PSL norms, mandates auditor certification",
            "Summary": "Reserve Bank of India strengthens priority sector lending compliance by requiring external auditor certificates from intermediary lenders to prevent duplicate claims by multiple banks.",
            "Sentiment": "neutral",
            "PublishDate": 1768870887204,
            "Source": "stocks"
        },
        {
            "Title": "RBI Governor Urges UCBs to Strengthen Governance",
            "Summary": "RBI Governor Sanjay Malhotra emphasized strong governance standards for urban cooperative banks at Mumbai meeting, highlighting their role in financial inclusion and need for robust risk management practices.",
            "Sentiment": "neutral",
            "PublishDate": 1768843469061,
            "Source": "stocks"
        },
        {
            "Title": "Axis Bank CEO warns on deposit-credit growth gap",
            "Summary": "Axis Bank's CEO Amitabh Chaudhry highlights the unsustainable divergence between deposit growth at 10-12% and expected credit growth of 15-17%, calling for enhanced RBI liquidity support to maintain banking system stability.",
            "Sentiment": "negative",
            "PublishDate": 1768842674672,
            "Source": "stocks"
        },
        {
            "Title": "Central Bank of India Sets Record Date for Third Dividend",
            "Summary": "Central Bank of India announces record date of January 23, 2026 for third interim dividend of ₹0.20 per share (2% on face value of ₹10) for FY26, with shares trading at ₹38.34.",
            "Sentiment": "positive",
            "PublishDate": 1768835179168,
            "Source": "co_actions_results"
        },
        {
            "Title": "RBI Proposes BRICS Digital Currency Linkage Plan",
            "Summary": "India's central bank recommends connecting BRICS digital currencies for cross-border payments at 2026 summit, potentially reducing US dollar dependence amid rising geopolitical tensions.",
            "Sentiment": "neutral",
            "PublishDate": 1768804160936,
            "Source": "currency"
        },
        {
            "Title": "RBI flags PSL gaps at HDFC, ICICI banks",
            "Summary": "Reserve Bank directs HDFC Bank to provision ₹500 crore and ICICI Bank ₹1,283 crore for priority sector lending compliance issues in agriculture portfolios following supervisory reviews.",
            "Sentiment": "negative",
            "PublishDate": 1768794997025,
            "Source": "stocks"
        },
        {
            "Title": "Bank of India Q3FY26 Earnings Call Set for Jan 21",
            "Summary": "Bank of India has scheduled an earnings call with analysts and investors on January 21, 2026, at 6:30 PM to discuss its unaudited financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768568319065,
            "Source": "co_actions_results"
        },
        {
            "Title": "Central Bank of India Q3 Interest Income Rises 6.24% YoY",
            "Summary": "Central Bank of India reports Q3 interest earned of ₹90.30 billion, up from ₹85.00 billion year-on-year, showing 6.24% growth alongside previous strong profit performance.",
            "Sentiment": "positive",
            "PublishDate": 1768552000702,
            "Source": "co_actions_results"
        },
        {
            "Title": "RBI strengthens customer grievance redressal norms",
            "Summary": "Reserve Bank of India issues new guidelines to strengthen internal grievance mechanisms for banks and NBFCs, mandating review processes before complaint rejection and enhanced internal ombudsman roles.",
            "Sentiment": "positive",
            "PublishDate": 1768438175345,
            "Source": "stocks"
        },
        {
            "Title": "RBI tightens forex risk norms, aligns with global standards",
            "Summary": "RBI issues new banking rules for calculating capital charges on foreign exchange risk, requiring continuous computation at consolidated and standalone levels. Changes effective April 1, 2027.",
            "Sentiment": "neutral",
            "PublishDate": 1768403278918,
            "Source": "stocks"
        },
        {
            "Title": "RBI gives nod to Sumitomo Mitsui Banking for WOS",
            "Summary": "Reserve Bank of India grants in-principle approval to Sumitomo Mitsui Banking Corporation to set up wholly-owned subsidiary through conversion of existing branches in India.",
            "Sentiment": "positive",
            "PublishDate": 1768393078251,
            "Source": "stocks"
        },
        {
            "Title": "RBI's ECL Framework to Transform Banking Risk Management",
            "Summary": "Reserve Bank of India introduces Expected Credit Loss framework from April 2027, replacing incurred-loss model with forward-looking provisioning approach aligned to global IFRS 9 standards.",
            "Sentiment": "neutral",
            "PublishDate": 1768382444992,
            "Source": "stocks"
        },
        {
            "Title": "RBI proposes new norms for urban co-op bank licences",
            "Summary": "RBI's working group suggests ₹300 crore minimum capital and 12% capital adequacy ratio for new urban cooperative banking licences after two-decade pause. 1,457 UCBs currently operate with 82 under restrictions.",
            "Sentiment": "neutral",
            "PublishDate": 1768350927025,
            "Source": "stocks"
        },
        {
            "Title": "RBI's $10bn forex swap draws $29.9bn in bids",
            "Summary": "Reserve Bank of India's 3-year dollar-rupee swap attracted nearly three times the notified amount in bids, with cutoff premium rising to 728 paise amid rupee pressure.",
            "Sentiment": "neutral",
            "PublishDate": 1768350869163,
            "Source": "currency"
        },
        {
            "Title": "RBI Expected to Hold Repo Rate at 5.25% in February",
            "Summary": "Reserve Bank of India likely to maintain current interest rates as inflation shows upward trend with December CPI at 1.33%. Central bank may focus on liquidity support through open market operations.",
            "Sentiment": "neutral",
            "PublishDate": 1768350840755,
            "Source": "stocks"
        },
        {
            "Title": "RBI: UPI User Base Could Reach 1 Billion Users",
            "Summary": "RBI Deputy Governor T Rabi Sankar announced UPI's potential growth from 400 million to 1 billion users. Digital payment transactions surged from ₹2,071 crore in FY18 to ₹22,831 crore in FY25 with 41% CAGR.",
            "Sentiment": "positive",
            "PublishDate": 1768315931529,
            "Source": "stocks"
        },
        {
            "Title": "RBI Governor Outlines Economic Vision In Exclusive Q&A",
            "Summary": "Governor Sanjay Malhotra discusses inflation targeting, rupee policy, and central bank independence in comprehensive interview covering India's economic outlook and monetary policy framework.",
            "Sentiment": "neutral",
            "PublishDate": 1768305566447,
            "Source": "stocks"
        },
        {
            "Title": "RBI Governor Defends Central Bank Independence",
            "Summary": "RBI Governor Sanjay Malhotra emphasizes importance of central bank autonomy amid US Federal Reserve turmoil and criminal probe against Chair Jerome Powell.",
            "Sentiment": "neutral",
            "PublishDate": 1768305506138,
            "Source": "stocks"
        },
        {
            "Title": "RBI Governor Emphasizes Consumer Satisfaction Priority",
            "Summary": "Governor Sanjay Malhotra highlights citizen satisfaction as RBI's ultimate success benchmark, announcing digital reforms and streamlined processes for banking services and grievance redressal.",
            "Sentiment": "positive",
            "PublishDate": 1768305449374,
            "Source": "stocks"
        },
        {
            "Title": "RBI Governor Explains India's Low Inflation Drivers",
            "Summary": "RBI Governor Sanjay Malhotra outlines three key factors behind India's sustained low inflation: softer food prices due to base effects, flexible inflation targeting regime, and supply-side actions.",
            "Sentiment": "neutral",
            "PublishDate": 1768305421963,
            "Source": "stocks"
        },
        {
            "Title": "RBI Buys ₹5 Lakh Crore Bonds to Control Rates",
            "Summary": "Reserve Bank of India purchased government securities worth over ₹5 lakh crore through open market operations since April 2025 to maintain adequate liquidity and control lending rates in the financial system.",
            "Sentiment": "neutral",
            "PublishDate": 1768286886121,
            "Source": "stocks"
        },
        {
            "Title": "India's Goldilocks Economy Shows Policy Harmony",
            "Summary": "India maintains low inflation with rapid growth as monetary-fiscal policy coordination contrasts sharply with US institutional tensions between Fed and White House.",
            "Sentiment": "positive",
            "PublishDate": 1768268347878,
            "Source": "stocks"
        },
        {
            "Title": "Banks Open Today Despite Lohri Celebrations",
            "Summary": "All public and private banks across India remain operational on January 13, 2026, despite Lohri celebrations in northern regions. RBI calendar confirms no bank holiday scheduled for the festival.",
            "Sentiment": "neutral",
            "PublishDate": 1768267734705,
            "Source": "stocks"
        },
        {
            "Title": "RBI injects ₹50,000 cr via OMO amid strong demand",
            "Summary": "Reserve Bank conducts open market operations with participants bidding ₹1.22 lakh crore against ₹50,000 crore offered. Another ₹50,000 crore OMO scheduled for January 22.",
            "Sentiment": "positive",
            "PublishDate": 1768265015664,
            "Source": "stocks"
        },
        {
            "Title": "RBI Bars Residents From Guaranteeing NRI Credit",
            "Summary": "Reserve Bank of India introduces new FEMA regulations prohibiting resident Indians from issuing credit guarantees to non-resident Indians, with specific exemptions for authorized dealer banks.",
            "Sentiment": "neutral",
            "PublishDate": 1768229182967,
            "Source": "stocks"
        }
    ]
}