{
    "Symbol": "BANKBARODA",
    "ISIN": "INE028A01039",
    "News": [
        {
            "Title": "Bank of Baroda alerts on Feb 12 bank strike notice",
            "Summary": "Bank of Baroda informs stock exchanges about potential strike by banking unions AIBEA, AIBOA and BEFI on February 12, 2026, which may affect branch operations.",
            "Sentiment": "negative",
            "PublishDate": 1770636636556,
            "Source": "stocks"
        },
        {
            "Title": "Bank of Baroda Gets RBI Nod for Primary Dealer Unit",
            "Summary": "Bank of Baroda receives RBI approval to establish a fully-owned subsidiary for standalone primary dealer business with capital infusion of up to ₹2000 crores under specified conditions.",
            "Sentiment": "positive",
            "PublishDate": 1770361333930,
            "Source": "stocks"
        },
        {
            "Title": "Bank of Baroda Approves Rs 15,000 Cr Bond Issue",
            "Summary": "Bank of Baroda's board approved raising up to Rs 15,000 crores through long-term bonds for infrastructure and affordable housing financing during FY 2025-26 and beyond.",
            "Sentiment": "positive",
            "PublishDate": 1769773595750,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Baroda Q3FY26 Results: Net Profit Up 4.5% YoY",
            "Summary": "Bank of Baroda reported net profit of ₹5,055 crore for Q3FY26, up 4.5% YoY. Operating profit stood at ₹7,377 crore with improved asset quality as GNPA ratio declined to 2.04%.",
            "Sentiment": "positive",
            "PublishDate": 1769773286278,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Baroda plans $500M offshore bond issue",
            "Summary": "Bank of Baroda is preparing to raise $500 million through US dollar bonds under its $4 billion medium-term note programme, inviting bids for joint lead managers to access overseas investors.",
            "Sentiment": "neutral",
            "PublishDate": 1769420492479,
            "Source": "stocks"
        },
        {
            "Title": "Bank of Baroda alerts on Jan 27 union strike",
            "Summary": "Bank of Baroda informs exchanges about United Forum of Bank Unions strike scheduled for January 27, 2026, warning of potential disruptions to branch operations while taking steps to ensure smooth functioning.",
            "Sentiment": "neutral",
            "PublishDate": 1769181413785,
            "Source": "stocks"
        },
        {
            "Title": "Bank of Baroda partners with IIFCL for infra finance",
            "Summary": "Bank of Baroda signs pact with IIFCL for joint lending and loan syndication across diverse infrastructure projects, leveraging nationwide presence for innovative financing solutions.",
            "Sentiment": "positive",
            "PublishDate": 1769004980682,
            "Source": "stocks"
        },
        {
            "Title": "Bank of Baroda Re-designates Two Key Officers",
            "Summary": "Bank of Baroda announces re-designation of Chief Risk Officer and Chief Group Compliance Officer with updated nomenclature effective January 20, 2026, with no changes to roles or responsibilities.",
            "Sentiment": "neutral",
            "PublishDate": 1768914628970,
            "Source": "stocks"
        },
        {
            "Title": "Bank of Baroda Board Meet on Jan 30 for Bond Raising",
            "Summary": "Bank of Baroda has scheduled a board meeting on January 30, 2026, to consider and approve raising long-term bonds for financing infrastructure and affordable housing projects.",
            "Sentiment": "neutral",
            "PublishDate": 1768805666261,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Baroda Board Meeting Set for January 30, 2025",
            "Summary": "Bank of Baroda announces board meeting on January 30, 2025, to approve Q3 FY26 unaudited financial results. Trading window to reopen February 2, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768803079724,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Baroda keeps overnight MCLR steady at 7.80%",
            "Summary": "Bank of Baroda maintains overnight MCLR at 7.80% from January 12, 2026, with mixed rate adjustments across tenures. Six-month rate drops to 8.50% while other rates remain stable.",
            "Sentiment": "neutral",
            "PublishDate": 1767966580074,
            "Source": "stocks"
        },
        {
            "Title": "Bank of Baroda Gets RBI Nod for License Transfer",
            "Summary": "Bank of Baroda receives initial RBI approval to transfer its Primary Dealer license to a fully owned subsidiary, with additional regulatory clearances still pending.",
            "Sentiment": "positive",
            "PublishDate": 1767953385924,
            "Source": "stocks"
        },
        {
            "Title": "Bank of Baroda Gets RBI Nod for PD Transfer",
            "Summary": "Bank of Baroda receives RBI in-principle approval to transfer Primary Dealer authorization to wholly owned subsidiary for standalone business operations.",
            "Sentiment": "positive",
            "PublishDate": 1767953194865,
            "Source": "stocks"
        },
        {
            "Title": "Bank Of Baroda Q3 FY26: Strong Domestic Growth Performance",
            "Summary": "Bank of Baroda reports robust Q3 FY26 domestic performance with deposits rising 11.13% YoY to ₹13.07 trillion, advances up 13.54% YoY to ₹10.96 trillion, and retail advances jumping 17.30% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1767508704028,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Baroda Global Business Grows 12.22% YoY",
            "Summary": "Bank of Baroda reports strong growth with Global Business reaching ₹28.91 trillion, Global Advances up 14.57% to ₹13.44 trillion, and Global Deposits growing 10.25% to ₹15.47 trillion as of December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767504350149,
            "Source": "stocks"
        },
        {
            "Title": "Bank of Baroda Gets AAA/AA+ Rating Reaffirmation",
            "Summary": "CRISIL reaffirmed Bank of Baroda's debt instrument ratings at AAA/AA+ Stable, covering bonds worth over ₹50,000 crores. The ratings reflect strong government support and established market position.",
            "Sentiment": "positive",
            "PublishDate": 1767359361563,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank Of Baroda Receives $29.4 Million From Liquidator",
            "Summary": "Bank Of Baroda has received $29.4 million from a liquidator, marking a significant recovery for the public sector banking institution.",
            "Sentiment": "positive",
            "PublishDate": 1766155753461,
            "Source": "stocks"
        },
        {
            "Title": "Bank of Baroda Revises MCLR Rates Effective Dec 12",
            "Summary": "Bank of Baroda announces revision in Marginal Cost of Funds Based Lending Rate (MCLR) across various tenors effective December 12, 2025, as communicated to stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1765384431570,
            "Source": "stocks"
        },
        {
            "Title": "Bank Of Baroda Subscribes ₹10 Cr For 50% Stake In IDPIC",
            "Summary": "Bank Of Baroda subscribes to 1 crore equity shares worth ₹10 crores for 50% stake in Indian Digital Payment Intelligence Corporation, a Section 8 company focused on fraud detection.",
            "Sentiment": "positive",
            "PublishDate": 1765377048679,
            "Source": "stocks"
        },
        {
            "Title": "Bank Of Baroda Gets RBI Approval For Major Stake In Digital Payment Intelligence Firm",
            "Summary": "Bank Of Baroda has received Reserve Bank of India consent to acquire over 30% ownership in a new Indian digital payment intelligence company. This regulatory approval enables the bank to hold a significant stake in the fintech venture, positioning it in the digital payments intelligence sector.",
            "Sentiment": "positive",
            "PublishDate": 1765366404528,
            "Source": "stock"
        },
        {
            "Title": "Bank of Baroda Reduces Lending Rate by 25 Basis Points",
            "Summary": "Bank of Baroda has reduced its Baroda Repo Based Lending Rate (BRLLR) by 25 basis points from 8.15% to 7.90% effective December 6, 2025. The rate cut affects the bank's lending operations and borrowing costs for customers.",
            "Sentiment": "positive",
            "PublishDate": 1764926084094,
            "Source": "stock"
        },
        {
            "Title": "Bank of Baroda Announces Senior Management Changes in Stressed Asset Management Division",
            "Summary": "Bank of Baroda appointed Mr. Sharma Rakesh Kumar as CGM (OSD) in Stressed Asset Management and changed Mr. Dinesh Pant's designation to CGM, Stressed Asset Management, both effective December 1, 2025. The changes involve key positions in the bank's stressed asset management division, with Mr. Sharma bringing over 35 years of banking experience to his new role.",
            "Sentiment": "neutral",
            "PublishDate": 1764595332521,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bank of Baroda Appoints 5 Chartered Accountant Firms as Statutory Central Auditors for FY2025-26",
            "Summary": "Bank of Baroda has appointed 5 Chartered Accountant firms as Statutory Central Auditors for FY2025-26, retaining 3 continuing firms and appointing 2 new firms. The new appointments replace M/s Khandelwal Jain & Co. and M/s S Venkatram Co LLP, whose terms have been completed.",
            "Sentiment": "neutral",
            "PublishDate": 1764240244951,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bank of Baroda Sanctions Rs 5,636 Crore in Agricultural Loans Through Special Outreach",
            "Summary": "Bank of Baroda sanctioned Rs 5,636 crore in agricultural loans through a special outreach program. This initiative affects farmers and agricultural borrowers by providing substantial credit access for farming activities.",
            "Sentiment": "positive",
            "PublishDate": 1764214446564,
            "Source": "stock"
        },
        {
            "Title": "Moody's Affirms Bank of Baroda's Baa3 Rating, Upgrades Baseline Credit Assessment to ba1",
            "Summary": "Moody's affirmed Bank of Baroda's Baa3 ratings while upgrading its Baseline Credit Assessment by one notch to ba1, reflecting improved asset quality and capitalization under the updated Banks methodology. The affirmation reflects expectations of very high probability of support from the Government of India, resulting in one-notch uplift to its Baa3 ratings from its ba1 BCA.",
            "Sentiment": "positive",
            "PublishDate": 1763466048345,
            "Source": "corporate_action"
        },
        {
            "Title": "Bank of Baroda Shares Hit Record High Following Strong Quarterly Results and Analyst Upgrades",
            "Summary": "Bank of Baroda shares surged 5% to reach an all-time high of ₹292.75 following the release of its July-September quarter results. Multiple brokerages upgraded their ratings and price targets, with HSBC maintaining 'Buy' and raising target to ₹340, while Nomura and Investec both upgraded to 'Buy' with targets of ₹320 and ₹325 respectively. The bank reported a 5 basis-point increase in net interest margin to 2.96%, defying expectations of decline. Net interest income grew 2.7% year-on-year to ₹11,954 crore, aided by income-tax refunds worth ₹750 crore. However, pre-provision operating profit declined 20.1% due to higher expenses. Provisions dropped significantly by 49% year-on-year to ₹883 crore, leading to improved asset quality. Profit after tax fell 8.2% year-on-year to ₹4,809 crore but grew 6% sequentially. Return on assets improved to 1.07%. Analysts highlighted broad-based loan growth and steady asset quality as key positives, though fee income remained flat despite 12% loan growth and CASA ratio declined 90 basis points sequentially.",
            "Sentiment": "positive",
            "PublishDate": 1762145651274,
            "Source": "stock"
        },
        {
            "Title": "Bank Of Baroda Reports Mixed Q2 Results With Revenue Growth But Lower Profit",
            "Summary": "Bank Of Baroda reported quarterly net profit of 48.09 billion rupees compared to 52.37 billion rupees in the same period last year, representing a decline. Revenue increased to 315.1 billion rupees from 302.78 billion rupees year-over-year. The bank's asset quality showed improvement with Gross Non-Performing Assets (GNPA) ratio decreasing to 2.16% from 2.28% quarter-over-quarter, while Net Non-Performing Assets (NNPA) ratio improved to 0.57% from 0.60% quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762128858337,
            "Source": "earnings"
        },
        {
            "Title": "Bank of Baroda Reports Decline in Fresh Slippages and Provisions",
            "Summary": "Bank of Baroda reported fresh slippages of 26.7 billion rupees in Q2, down from 34.76 billion rupees in the previous quarter. The bank's provisions and contingencies also decreased to 12.3 billion rupees in Q2 compared to 19.7 billion rupees in the prior quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761923873835,
            "Source": "earnings"
        },
        {
            "Title": "Bank of Baroda Reports Mixed Q2 Results with Revenue Growth but Lower Profit",
            "Summary": "Bank of Baroda reported Q2 net profit of 48.09 billion rupees, down from 52.37 billion rupees in the same quarter last year. Revenue increased to 315.1 billion rupees compared to 302.78 billion rupees year-over-year. The bank's asset quality improved with Gross Non-Performing Assets (GNPA) declining to 2.16% from 2.28% quarter-over-quarter, while Net Non-Performing Assets (NNPA) decreased to 0.57% from 0.60% quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1761910128898,
            "Source": "earnings"
        },
        {
            "Title": "Bank Of Baroda Australia Branch Secures AUD 125 Million Syndicated Term Loan",
            "Summary": "Bank Of Baroda's Australia branch has completed borrowing AUD 125 million through a syndicated term loan facility. The loan has a tenure of one year.",
            "Sentiment": "neutral",
            "PublishDate": 1761824877687,
            "Source": "stock"
        },
        {
            "Title": "Bank of Baroda Reduces MCLR Rates for Select Tenors",
            "Summary": "Bank of Baroda has reviewed its Marginal Cost of Funds Based Lending Rate (MCLR) effective October 12, 2025. The bank reduced MCLR for one month tenor from 7.95% to 7.90%, six month tenor from 8.65% to 8.60%, and one year tenor from 8.80% to 8.75%. The overnight and three month MCLR rates remain unchanged at 7.85% and 8.20% respectively.",
            "Sentiment": "positive",
            "PublishDate": 1760100773005,
            "Source": "stock"
        },
        {
            "Title": "Bank Of Baroda Reports 10.47% Growth In Global Business To ₹27.79 Trillion",
            "Summary": "Bank Of Baroda achieved a 10.47% yearly increase in global business, reaching ₹27.79 trillion by September 2025. The bank's worldwide deposits grew 9.28% year-over-year to ₹15.00 trillion as of September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1759720212945,
            "Source": "stock"
        },
        {
            "Title": "Bank of Baroda Extends Executive Director Sanjay Mudaliar's Term Until 2028",
            "Summary": "The Central Government has extended the term of office for Sanjay Vinayak Mudaliar as Executive Director of Bank of Baroda. His current term was set to end on December 31, 2025, but has now been extended until his superannuation on July 31, 2028, or until further orders, whichever comes first. The extension was notified by the Central Government on September 15, 2025, under the Banking Companies (Acquisition and Transfer of Undertakings) Act, 1970.",
            "Sentiment": "neutral",
            "PublishDate": 1758024867501,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bank of Baroda Extends Executive Director Lalit Tyagi's Term by Three Years",
            "Summary": "The Central Government has extended Shri Lalit Tyagi's term as Executive Director of Bank of Baroda for three years beyond his current term ending on November 20, 2025. The extension was granted under the Banking Companies (Acquisition and Transfer of Undertakings) Act, 1970, and will continue until further orders. The notification was dated September 15, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758024492498,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bank of Baroda Reduces Overnight and Three-Month MCLR Rates",
            "Summary": "Bank of Baroda reduced its overnight marginal cost of funds-based lending rate (MCLR) by 10 basis points to 7.85% effective September 12. The bank also cut its three-month MCLR by 15 basis points to 8.20%. The one-month and six-month MCLR rates remained unchanged at 7.95% and 8.65% respectively. The one-year MCLR, which serves as a key benchmark for home and auto loans, was maintained at 8.80%. MCLR is the minimum interest rate below which banks cannot lend and directly affects borrowing costs for floating-rate loans.",
            "Sentiment": "positive",
            "PublishDate": 1757504769423,
            "Source": "stock"
        },
        {
            "Title": "Bank of Baroda Appoints Gopalan V as Head of Mid Corporate Division",
            "Summary": "Bank of Baroda announced the appointment of Mr. Gopalan V as Head, Mid Corporate, BCC Mumbai. The appointment was effective August 16, 2025. Gopalan holds a Bachelor's degree in Mathematics, Master's degree in Arts, and CAIIB certification. He brings over 33 years of experience within the bank to his new role as Senior Management Personnel.",
            "Sentiment": "neutral",
            "PublishDate": 1755350184314,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bank of Baroda Launches International UPI Services on bob e-Pay App",
            "Summary": "Bank of Baroda has expanded its UPI app bob e-Pay with three new international features for cross-border payments. The UPI Global Acceptance service allows customers to make QR code payments in eight countries including UAE, USA, Singapore, and France, with transactions showing amounts in both local and Indian currencies. The Foreign Inward Remittance feature enables real-time money transfers from Singapore residents to Bank of Baroda customers in India, converting Singapore Dollars to Indian Rupees. NRI customers can now link their NRE or NRO accounts to send and receive money through the app using domestic mobile numbers. All international transactions have daily and per-transaction limits of ₹1 lakh. The bob e-Pay app serves over 1.3 million registered users and is available to both customers and non-customers.",
            "Sentiment": "positive",
            "PublishDate": 1754994942592,
            "Source": "stock"
        },
        {
            "Title": "Bank of Baroda Reduces MCLR Rates Across All Tenors Effective August 12, 2025",
            "Summary": "Bank of Baroda has revised its Marginal Cost of Funds Based Lending Rate (MCLR) effective August 12, 2025, with rates decreasing across all tenors. The overnight and one-month MCLR rates were reduced to 7.95% from 8.10% and 8.30% respectively. The three-month tenor decreased to 8.35% from 8.50%, six-month tenor to 8.65% from 8.75%, and one-year tenor to 8.80% from 8.90%. The bank communicated this revision to stock exchanges BSE and NSE through an official notification.",
            "Sentiment": "positive",
            "PublishDate": 1754922516304,
            "Source": "stock"
        },
        {
            "Title": "Bank of Baroda Announces Senior Management Personnel Change",
            "Summary": "Bank of Baroda has disclosed changes in its Senior Management Personnel. Mr. Grover Sanjay Kumar, who holds the position of CGM, MID Corporate, BCC in Mumbai, has been assigned on deputation to the bank's domestic subsidiary. The change was ordered on August 2, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754143432324,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bank of Baroda Maintains 11-13% Credit Growth Guidance Despite Q1 Challenges",
            "Summary": "Bank of Baroda has maintained its credit growth guidance of 11-13% for FY26, with growth expected to be driven by retail and MSME segments. The bank reported overall advances growth of 12.6% year-on-year in Q1, led by an 18% rise in the RAM segment. Corporate lending growth slowed to 2.5% due to seasonal factors, though management expects around 10% growth for the full year. Q1 slippages increased by Rs 500 crore above the typical Rs 2,800-2,900 crore quarterly run rate, primarily due to one international account that entered resolution process. Excluding this account, the slippage ratio was 0.99% and credit cost was 0.47%. For Q1FY26 results, net profit rose 1.9% to Rs 4,541 crore while Net Interest Income declined 1.4% to Rs 11,435 crore. GNPA ratio improved to 2.28% from 2.88% year-on-year, and NNPA ratio decreased to 0.6% from 0.69%.",
            "Sentiment": "neutral",
            "PublishDate": 1753837237141,
            "Source": "earnings"
        },
        {
            "Title": "Bank of Baroda and Canara Bank Shed ₹54,000 Crore Corporate Loans to Protect Margins",
            "Summary": "Bank of Baroda and Canara Bank collectively reduced their corporate loan portfolios by ₹54,000 crore in the June quarter to safeguard net interest margins. The loans, primarily extended to public sector undertakings, faced repricing pressure following a 100 basis points repo rate cut since February. Bank of Baroda's corporate loan book declined 10% quarter-on-quarter to ₹3.7 lakh crore, with NBFC loans falling 11.6%. The bank shed ₹42,000 crore in corporate loans and ₹15,000 crore in NBFC loans. Canara Bank reduced NBFC loans by ₹12,000 crore, including exposure to a large central PSU. Both banks chose to let go of business rather than accept lower pricing that would compromise already stressed margins. Canara Bank's net interest margin contracted to 2.55% from 2.73% in the March quarter, while Bank of Baroda's NIM fell to 2.91% from 2.98%. Corporate bond issuances reached a four-year high of ₹3.27 lakh crore in the June quarter as companies sought alternative funding at lower rates.",
            "Sentiment": "neutral",
            "PublishDate": 1753663282654,
            "Source": "stock"
        },
        {
            "Title": "Bank of Baroda Reports 1.8% Growth in Q1 Net Profit to 45.4 Billion Rupees",
            "Summary": "Bank of Baroda posted a net profit of 45.4 billion rupees in Q1, up from 44.58 billion rupees in the same period last year. Interest income increased to 311 billion rupees from 296.29 billion rupees year-over-year. The bank's asset quality showed some deterioration with gross non-performing assets (GNPA) rising to 2.28% from 2.26% in the previous quarter, while net non-performing assets (NNPA) increased to 0.60% from 0.58%. Provisions climbed to 17.3 billion rupees from 15.5 billion rupees quarter-on-quarter, and fresh slippages rose to 34.76 billion rupees from 29 billion rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1753662641271,
            "Source": "earnings"
        },
        {
            "Title": "Bank Of Baroda Reports Corporate Lending Slowdown But Maintains Growth Targets",
            "Summary": "Bank of Baroda experienced a slowdown in corporate lending during the June quarter, with its corporate book at Rs 3.7 lakh crore - up 4% year-on-year but down over 10% sequentially. The bank attributes this decline to companies accessing cheaper bond market rates and ongoing corporate deleveraging. Despite this, the bank expects 9-10% growth in corporate lending for the current financial year and maintains its overall credit growth guidance of 11-13%. Retail lending remains strong with 17.5% year-on-year growth to Rs 2.61 lakh crore, while MSME loans grew 13.1% to Rs 1.35 lakh crore. The bank expects MSME loan growth of 18-19% for the year. Net interest income fell over 1% to Rs 11,435 crore, with net interest margin declining to 2.91% from 2.98% in the prior quarter. Provisions jumped 95% year-on-year to Rs 1,967 crore due to a Rs 500 crore international account being classified as NPA. Gross NPAs remained stable at 2.28% as of June-end. The bank expects NIM pressure to persist until September quarter but anticipates improvement thereafter, targeting 2.8-3% NIM by end of FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1753455854160,
            "Source": "earnings"
        },
        {
            "Title": "Bank of Baroda Targets 6-8% Credit Growth in Retail and RAM Segments",
            "Summary": "Bank of Baroda expects steady credit growth of 6-8% in its retail and RAM (Retail, Agriculture, and MSME) areas. The bank is focusing on expanding domestic loans through digital initiatives, MSME lending, and retail segment growth. This expansion strategy is backed by the bank's strong capital position and asset quality.",
            "Sentiment": "positive",
            "PublishDate": 1753449853477,
            "Source": "stock"
        },
        {
            "Title": "Bank Of Baroda Targets 9-10% Growth In Corporate Loans",
            "Summary": "Bank of Baroda's executive has set a target of achieving 9-10% growth in corporate loans for the year. This growth target indicates the bank's strategic focus on expanding its corporate lending portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1753446318008,
            "Source": "stock"
        },
        {
            "Title": "Bank of Baroda Appoints New Government Nominee Director",
            "Summary": "Bank of Baroda appointed Shri Ashish Madhaorao More as Government of India Nominee Director on its Board, replacing Shri M P Tangirala, effective July 24, 2025. The appointment was made through a Central Government notification under the Banking Companies (Acquisition and Transfer of Undertakings) Act, 1970. Shri More is a Joint Secretary in the Ministry of Finance, Department of Financial Services, and a senior IAS officer from the AGMUT cadre with an allotment year of 2005. He holds a Bachelor of Arts degree from Nagpur University and has extensive experience in administrative roles across Central Government, Union Territories and States, including positions as Deputy Commissioner, Director (Finance) in Delhi Jal Board, and Private Secretary to the Minister of Railways.",
            "Sentiment": "neutral",
            "PublishDate": 1753443126867,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bank of Baroda Reports Mixed Q1 Results with Higher Profit but Increased Slippages",
            "Summary": "Bank of Baroda reported quarterly net profit of 45.4 billion rupees, up from 44.58 billion rupees year-over-year. Interest earned increased to 311 billion rupees from 296.29 billion rupees compared to the same period last year. However, fresh slippages rose to 34.76 billion rupees from 29 billion rupees quarter-over-quarter. Asset quality metrics showed slight deterioration with GNPA increasing to 2.28% from 2.26% and NNPA rising to 0.60% from 0.58% on a quarterly basis. Provisions also increased to 17.3 billion rupees from 15.5 billion rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1753442264993,
            "Source": "earnings"
        },
        {
            "Title": "Bank of Baroda Board Approves Q1 FY2025-26 Financial Results",
            "Summary": "Bank of Baroda's Board of Directors approved unaudited standalone and consolidated financial results for Q1 FY2025-26 during a meeting held on July 25, 2025. The results cover the quarter ended June 30, 2025, and include segment reporting and relevant financial documents. The board meeting ran from 12:00 noon to 4:25 p.m. The bank has submitted the financial results, press release, security cover certificate, and statement of utilization of issue proceeds to stock exchanges BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1753442246747,
            "Source": "earnings"
        },
        {
            "Title": "Bank Of Baroda To Announce Q1 FY26 Results On July 25",
            "Summary": "Bank of Baroda will announce its financial results for the first quarter of FY26 ending June 30, 2025, on Friday, July 25. The Board of Directors will meet at the bank's corporate office in Mumbai to consider and approve unaudited standalone and consolidated financial results. An analyst conference is scheduled for the same day at 6 p.m., featuring management discussion and Q&A session with key executives including MD & CEO Debadatta Chand and CFO IVL Sridhar. The bank's trading window has been closed since July 1 and will reopen on July 28. In the previous quarter ended March 2025, the bank reported a 3.3% year-on-year rise in standalone net profit to Rs 5,048 crore, while net interest income declined 7% to Rs 11,020 crore. The bank's asset quality improved with gross non-performing assets ratio easing to 2.26%. Bank of Baroda shares have declined 3.09% in the last five trading sessions but gained 5.19% over six months, with the stock trading at Rs 241.15.",
            "Sentiment": "neutral",
            "PublishDate": 1753253942246,
            "Source": "earnings"
        },
        {
            "Title": "Bank of Baroda Schedules Media and Analyst Meetings for Quarterly Results Discussion",
            "Summary": "Bank of Baroda has scheduled meetings to discuss its quarterly financial results ended June 30, 2025. A Media Meet will be held on July 25, 2025 at 5:00 PM via Zoom, followed by an Analysts' Meet at 6:00 PM. The analyst session will feature a management discussion and Q&A on the bank's financial results, with key spokespersons including Managing Director & CEO Debadatta Chand, Executive Directors Sanjay Vinayak Mudaliar, Lalit Tyagi, Beena Vaheed, and Lal Singh, along with Chief Financial Officer IVL Sridhar. The meetings will cover both standalone and consolidated financial results for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1753098767888,
            "Source": "earnings"
        }
    ]
}