{
    "Symbol": "BANSALWIRE",
    "ISIN": "INE0B9K01025",
    "News": [
        {
            "Title": "Bansal Wire Gets GST Tax Relief of ₹63.53 Lakh",
            "Summary": "Bansal Wire Industries receives favorable GST appeal order, reducing tax liability from ₹63,52,999 to nil for FY 2018-19. Company confirms no financial impact and reaffirms strong compliance framework.",
            "Sentiment": "positive",
            "PublishDate": 1770728303425,
            "Source": "stocks"
        },
        {
            "Title": "Anand Rathi Sets ₹360 Target for Bansal Wire Industries",
            "Summary": "Anand Rathi maintains BUY rating on Bansal Wire Industries with ₹360 target price, citing expansion plans to boost capacity by 24% to 0.77 million tonnes over next 2-3 years despite trimmed earnings estimates.",
            "Sentiment": "positive",
            "PublishDate": 1768977870375,
            "Source": "stocks"
        },
        {
            "Title": "Bansal Wire Q3 Net Profit Up 3.8%, Faces ₹203 Cr GST Notice",
            "Summary": "Bansal Wire Industries reported Q3 net profit growth of 3.8% to ₹43.2 crore with strong EBITDA expansion, while contesting a ₹202.77 crore GST notice for FY21 related to e-way bills and tax credits.",
            "Sentiment": "neutral",
            "PublishDate": 1768829318797,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bansal Wire Q3 EBITDA Jumps 18.3% to ₹852 Cr",
            "Summary": "Bansal Wire Industries Q3 EBITDA surged 18.3% YoY to ₹852 crores with margin expansion to 8.28% from 7.79%, showing strong operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1768827539858,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bansal Wire Industries Q3FY26 Earnings Call Jan 20",
            "Summary": "Bansal Wire Industries announces earnings call on January 20, 2026 at 12:00 PM IST to discuss Q3FY26 financial results and performance for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768391151062,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bansal Wire Board Meet Set for Jan 19 for Q3FY26 Results",
            "Summary": "Bansal Wire Industries has scheduled its board meeting for January 19, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window remains closed until January 21, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768300883812,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bansal Wire stock drops 5% as lock-in period ends",
            "Summary": "Bansal Wire Industries shares fell 5.2% after lock-in expiry made ₹945 crore worth shares tradable. Despite volatility, Q2FY26 revenue grew 28% to ₹1,055 crore with strong operational scale.",
            "Sentiment": "neutral",
            "PublishDate": 1767941796597,
            "Source": "stocks"
        },
        {
            "Title": "Bansal Wire Industries: 20% equity unlocks today",
            "Summary": "Around 31.3 million shares worth ₹945 crore become eligible for trading as six-month lock-in period expires for India's largest stainless steel wire manufacturer.",
            "Sentiment": "neutral",
            "PublishDate": 1767937505049,
            "Source": "stocks"
        },
        {
            "Title": "Bansal Wire shares in focus as 20% equity unlocks",
            "Summary": "31.3 million shares of Bansal Wire Industries become eligible for trading after lock-in expiry, while company reports record Q3 sales volume of 121,702 MT, surpassing previous peak.",
            "Sentiment": "neutral",
            "PublishDate": 1767933918527,
            "Source": "stocks"
        },
        {
            "Title": "Bansal Wire GST Liability Cut by 94% to ₹39.88 Lacs",
            "Summary": "Bansal Wire Industries receives revised GST order reducing tax liability from ₹669.72 lacs to ₹39.88 lacs for FY 2023-24, though company plans to file appeal for further clarification on assessment aspects.",
            "Sentiment": "positive",
            "PublishDate": 1767882247397,
            "Source": "stocks"
        },
        {
            "Title": "Bansal Wire Industries Q3FY26 Sales Volume Jumps 31.70%",
            "Summary": "Bansal Wire Industries reported strong operational performance in Q3FY26 with sales volume reaching 121,702 MT, marking a significant 31.70% year-over-year increase from the previous year period.",
            "Sentiment": "positive",
            "PublishDate": 1767357392163,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bansal Wire Industries Q3FY26 Sales Volume Up 31.70% YoY",
            "Summary": "Bansal Wire Industries achieved record Q3FY26 sales volume of 121,702 MT, marking 31.70% YoY growth. Company launched IHT Wire with 9,000 tonnes capacity, targeting automotive sector for suspension springs.",
            "Sentiment": "positive",
            "PublishDate": 1767263066757,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bansal Wire Gets GST Show Cause Notice for ₹6.70 Cr",
            "Summary": "Bansal Wire Industries receives GST show cause notice for FY24 demanding ₹6.70 crores in tax, penalty and interest. Company calls notice untenable with no merit.",
            "Sentiment": "negative",
            "PublishDate": 1766401687491,
            "Source": "stocks"
        },
        {
            "Title": "Bansal Wire Gets GST Show Cause Notice Worth ₹9.88 Cr",
            "Summary": "Bansal Wire Industries receives GST show cause notice for ₹9.88 crores covering tax, interest and penalty for FY 2022-23. Company calls notice untenable and expects no material impact.",
            "Sentiment": "negative",
            "PublishDate": 1765451009685,
            "Source": "stocks"
        },
        {
            "Title": "Bansal Wire Industries Gets Major Tax Relief as SGST Authority Reduces Liability by 95%",
            "Summary": "SGST Authority significantly reduced Bansal Wire Industries' tax liability from ₹202.77 crores to ₹10 million, representing a substantial decrease in the company's tax burden. The company plans to appeal for further review of the remaining tax liability despite the major reduction already granted.",
            "Sentiment": "positive",
            "PublishDate": 1765269192576,
            "Source": "stock"
        },
        {
            "Title": "Bansal Wire GST Liability Slashed by 99% to ₹92.90 Lakh After Authority Review",
            "Summary": "Bansal Wire reported a massive reduction in its GST demand liability from ₹99.62 crore to ₹92.90 lakh following a review by tax authorities. The significant decrease in tax obligation represents a major financial relief for the company, reducing its liability by approximately 99%.",
            "Sentiment": "positive",
            "PublishDate": 1765013259902,
            "Source": "stock"
        },
        {
            "Title": "Bansal Wire Industries Receives Show Cause Notice for Rs 2.03 Billion Tax and Penalty",
            "Summary": "Bansal Wire Industries has received a show cause notice regarding tax and penalty matters. The total amount for tax, interest, and penalty stands at Rs 2.03 billion.",
            "Sentiment": "negative",
            "PublishDate": 1764719933351,
            "Source": "stock"
        },
        {
            "Title": "Bansal Wire Industries Achieves Significant Tax Liability Reduction",
            "Summary": "Bansal Wire Industries successfully reduced its tax liability from 450.9 million rupees to 6.9 million rupees, representing a substantial decrease of over 98%. The company plans to file an appeal seeking further review of the remaining tax obligation.",
            "Sentiment": "positive",
            "PublishDate": 1763422530500,
            "Source": "stock"
        },
        {
            "Title": "Bansal Wire Industries Gets Tax Liability Reduced from Rs 126.9 Crore to Rs 6.4 Crore in GST Case",
            "Summary": "Bansal Wire Industries Limited received a revised GST assessment order that significantly reduced its tax liability from Rs 126.93 crore to Rs 6.35 crore for financial year 2018-19. The revised amount includes tax of Rs 19.37 lakh, interest of Rs 24.78 lakh, and penalty of Rs 19.37 lakh. The case involves alleged violations related to E-way bill issues, availment of blocked and excess Input Tax Credit, and non-payment of tax on sale of RODTEP license. Despite the reduction, the company plans to file an appeal with the appropriate appellate authority as it believes certain aspects of the assessment require further review. The company states there is no material impact on its financial, operational, or other activities.",
            "Sentiment": "positive",
            "PublishDate": 1762605519912,
            "Source": "stock"
        },
        {
            "Title": "Bansal Wire Industries Reports 27% Revenue Growth in Q2 FY26, Achieves Highest Ever Volume and EBITDA",
            "Summary": "Bansal Wire Industries Limited reported revenue of Rs 1,055 crores for Q2 FY26, representing 27% year-on-year growth. The company achieved its highest ever quarterly volume at 1.14 lakh tons compared to 1.04 lakh tons in Q1 FY26. EBITDA increased 20% year-on-year to Rs 81.58 crores, while PAT stood at Rs 38.3 crores, down 4.3% due to higher subsidization. Cash profit rose 17% to Rs 56 crores. For the first half of FY26, revenue grew 21% to Rs 1,994 crores with EBITDA at Rs 156 crores, up 19.7%. The company generated approximately Rs 150 crores of free cash flow from operations in the first half. Bansal Wire received two sample approvals from major tire companies for steel cord products and expects commercialization by mid-next year. The company penetrated the B2C segment, contributing 5% of total revenue with better margins than B2B segment. Total installed capacity stands at 6.18 lakh tons with 74% capacity utilization. The company targets 30-40% volume growth and over 20% EBITDA growth for the year, aiming for 25% ROC by 2027 and Rs 600 crores positive cash flow over this year and next combined.",
            "Sentiment": "positive",
            "PublishDate": 1762567963442,
            "Source": "earnings"
        },
        {
            "Title": "Bansal Wire Industries Receives GST Show Cause Notice Worth ₹99.6 Crore",
            "Summary": "Bansal Wire Industries Limited received a Show Cause Notice from Joint Commissioner, SGST, Corporate Circle, Ghaziabad for financial year 2021-22. The notice pertains to issues involving availment of blocked and excess Input Tax Credit and non-payment of tax on sale of RODTEP license under Section 74 of SGST/CGST Act, 2017. The total claim includes tax of ₹36.39 crore, interest of ₹26.83 crore, and penalty of ₹36.39 crore. The company believes the notice is untenable and without merit, stating it expects no material financial impact given the expected reduction in penalty and settlement process. The company will file an appropriate response within prescribed timelines.",
            "Sentiment": "negative",
            "PublishDate": 1762486390418,
            "Source": "stock"
        },
        {
            "Title": "Bansal Wire Industries Shares Hit 52-Week Low, Down Over 40% from Peak",
            "Summary": "Bansal Wire Industries Limited shares declined 1.85% to ₹302.30 on Thursday, hitting a 52-week low of ₹299.00 during intraday trading. The stock opened higher at ₹311.75 but lost ground throughout the session following quarterly results released the previous trading day. The specialty wire manufacturer's shares have fallen over 40% from their 52-week high of ₹503.95 recorded on December 9, 2024. Trading volume reached 0.76 lakh shares worth ₹2.31 crore, with delivery-based transactions accounting for 67.19% of volumes. The company's market capitalization stands at ₹4,732.69 crore with free float market cap at ₹1,040.55 crore. The stock operates with 37.45% annualized volatility and trades with balanced buy-sell quantities of around 28,000 shares each.",
            "Sentiment": "negative",
            "PublishDate": 1762414210017,
            "Source": "stock"
        },
        {
            "Title": "Bansal Wire Reports Mixed Q2 Results with Revenue Growth but Lower Profit",
            "Summary": "Bansal Wire reported quarterly revenue of 10.55 billion rupees, up from 8.25 billion rupees year-over-year. EBITDA increased to 768 million rupees from 639 million rupees, though EBITDA margin declined to 7.3% from 7.74%. Consolidated net profit decreased to 383 million rupees compared to 396 million rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1762241104669,
            "Source": "earnings"
        },
        {
            "Title": "Bansal Wire Industries Launches New IBT Wire Product for Automotive Components",
            "Summary": "Bansal Wire Industries Limited has introduced a new product called 'Induction Hardened And Tempered (IBT) Wire' specifically designed for automotive components. The product is scheduled to launch on October 8, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1759911263528,
            "Source": "stock"
        },
        {
            "Title": "Bansal Wire Industries Reports Fire Incident at Dadri Plant, Operations Partially Disrupted",
            "Summary": "Bansal Wire Industries experienced a fire incident at the C Shed of their plant in Dadri, Uttar Pradesh on October 02, 2025 at around 8:15 P.M. The fire has been brought under control, but operations at the C Shed are temporarily disrupted. Operations in the A and B Sheds continue to run smoothly without issues. No injuries or casualties were reported. The company is currently assessing the extent of damage and loss, with a detailed assessment underway. The damage is covered under insurance and the incident has been reported to the insurance company. The company stated this is not likely to have a material impact on profitability. Efforts are ongoing to restore the affected portion of the plant to regular functioning.",
            "Sentiment": "negative",
            "PublishDate": 1759492439885,
            "Source": "stock"
        },
        {
            "Title": "Bansal Wire Industries Reports 45.9% Volume Growth to 114,609MT",
            "Summary": "Bansal Wire Industries reported total volume of 114,609 metric tons compared to 78,577 metric tons in the previous year, representing a significant increase in production volumes.",
            "Sentiment": "positive",
            "PublishDate": 1759312873902,
            "Source": "stock"
        },
        {
            "Title": "Bansal Wire Industries Reports Record Q1 Sales Volume of 104,000 Tons, Generates Strong Cash Flow",
            "Summary": "Bansal Wire Industries achieved its highest quarterly sales volume of 104,000 tons in Q1 FY26 at 74% capacity utilization. Revenue grew 15% year-on-year to INR 939 crores, while EBITDA increased 20% to INR 75 crores and net profit rose 24% to INR 39 crores. The company generated strong operating cash flow of INR 97 crores compared to negative INR 150 crores in the previous year, driven by improved working capital management and inventory optimization. Management targets 30% volume growth for the full year and plans INR 700-750 crores capex over two years, primarily for the INR 600 crores Sanand backward integration project. The company is developing specialty wire products including hose wire, IHT wire, and steel cord, with customer approvals expected by FY27. Export revenue was INR 72 crores, representing 7.5% of total revenue. Management indicated margins may decline temporarily in FY26-27 to capture market share, with recovery expected from FY28 as backward integration and specialty products become operational.",
            "Sentiment": "positive",
            "PublishDate": 1753428099825,
            "Source": "earnings"
        },
        {
            "Title": "Bansal Wire Industries Completes Full Utilization of IPO Proceeds Worth Rs 7,450 Million",
            "Summary": "Bansal Wire Industries Limited has fully utilized all proceeds from its IPO worth Rs 7,450 million. CRISIL Ratings Limited, serving as the monitoring agency, issued its final monitoring report for the quarter ended June 30, 2025, confirming complete deployment of funds across designated objectives. The company utilized Rs 4,526.83 million for repayment of outstanding borrowings, Rs 937.08 million for subsidiary debt repayment, Rs 600 million for working capital requirements, Rs 906.64 million for general corporate purposes, and Rs 479.45 million for issue expenses. All fund utilizations were completed by December 31, 2024, with only Rs 0.03 million utilized during the June 2025 quarter for ordinary business expenses. The monitoring agency reported no deviations from the original objects stated in the offer document and confirmed all utilizations were in compliance with regulatory requirements.",
            "Sentiment": "positive",
            "PublishDate": 1753427594600,
            "Source": "corporate_action"
        },
        {
            "Title": "Bansal Wire Industries Reports Strong Q2 Results, Appoints New Auditors and Dissolves IPO Committee",
            "Summary": "Bansal Wire Industries Limited held a board meeting on July 21, 2025, approving quarterly financial results for the quarter ended June 30, 2025. The steel wire manufacturer reported standalone revenue from operations of Rs. 9,079.60 million compared to Rs. 6,766.08 million in the same quarter last year, with profit after tax of Rs. 302.79 million versus Rs. 259.55 million. On a consolidated basis, revenue reached Rs. 9,390.07 million with profit after tax of Rs. 392.79 million. The board appointed new auditors including M/s Ranjit Tripathi & Associates as Secretarial Auditors for five years (2025-26 to 2029-30), M/s Ashish & Associates as Cost Auditors, and M/s S N Garg & Co as Internal Auditors for Financial Year 2025-26. The company also dissolved its IPO Committee, which was originally constituted in August 2023 to oversee the initial public offering process.",
            "Sentiment": "positive",
            "PublishDate": 1753160902302,
            "Source": "earnings"
        },
        {
            "Title": "Bansal Wire Industries Approves Q1 2025 Results and Key Auditor Appointments",
            "Summary": "Bansal Wire Industries' Board approved unaudited financial results for the quarter ended June 30, 2025, showing standalone revenue of Rs. 9,079.60 million and profit after tax of Rs. 302.79 million. On a consolidated basis, revenue reached Rs. 9,390.07 million with profit after tax of Rs. 392.79 million. The Board appointed new auditors across three categories: Ranjit Tripathi & Associates as Secretarial Auditors for FY 2025-26 to 2029-30, Ashish & Associates as Cost Auditors for FY 2025-26, and S N Garg & Co as Internal Auditors for FY 2025-26. The company also dissolved its IPO Committee, which was originally constituted on August 25, 2023. The steel wire manufacturer operates with two wholly-owned subsidiaries and completed its IPO listing in July 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1753158409746,
            "Source": "corporate_action"
        },
        {
            "Title": "Bansal Wire Announces ₹650 Crore Investment Plan for Sanand Facility and Production Expansion",
            "Summary": "Bansal Wire has launched a comprehensive growth strategy involving a ₹650 crore investment in its Sanand facility. The plan focuses on expanding specialty wire operations, pursuing import substitution opportunities, and increasing production capacity at its Dadri plant. The company positions this initiative as part of its sustainable growth objectives.",
            "Sentiment": "positive",
            "PublishDate": 1753109705122,
            "Source": "stock"
        },
        {
            "Title": "Bansal Wire Industries Reports Strong Q1 Growth with Revenue Up 14.5% and Net Profit Rising 24.8%",
            "Summary": "Bansal Wire Industries delivered robust quarterly performance with consolidated net profit increasing to 393 million rupees from 315 million rupees year-over-year. Revenue grew significantly to 9.39 billion rupees compared to 8.2 billion rupees in the same period last year. The company's EBITDA improved to 718 million rupees from 610 million rupees, while EBITDA margin expanded to 7.65% from 7.47% year-over-year, indicating enhanced operational efficiency alongside top-line growth.",
            "Sentiment": "positive",
            "PublishDate": 1753097477899,
            "Source": "earnings"
        },
        {
            "Title": "Bansal Wire Announces Growth Targets for FY26",
            "Summary": "Bansal Wire has confirmed its volume growth target of 25-30% for FY26. The company expects 20-25% of its revenue to come from value-added products by the end of fiscal year 2026. Additionally, Bansal Wire anticipates a 10% EBITDA growth by FY26.",
            "Sentiment": "positive",
            "PublishDate": 1752214973000,
            "Source": "default"
        },
        {
            "Title": "Bansal Wire Industries Receives GST Show Cause Notice",
            "Summary": "Bansal Wire Industries has been issued a show cause notice related to GST interest and penalties. The total amount involved is 395 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1750940577000,
            "Source": "default"
        },
        {
            "Title": "Bansal Wire Industries: Volume Growth Focus May Lead to 15-20% Margin Drop in FY26",
            "Summary": "Bansal Wire Industries aims for 20-25% annual growth in FY26, focusing on volume expansion despite an expected 15-20% margin decline. The company plans to shift focus towards stainless steel and low-carbon products, maintaining a cost-plus model for raw material pricing. Export slowdown hasn't significantly impacted the company, with exports comprising only 10-15% of total revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1750207499000,
            "Source": "normal_news"
        },
        {
            "Title": "Bansal Wire Industries: Q4 Profit Soars 41% to ₹33 Crore",
            "Summary": "Bansal Wire Industries reported a 41% year-on-year increase in Q4 consolidated profit after tax to ₹33 crore. Revenues surged 33% to ₹940 crore. The company's stock is currently trading 1.14% lower at ₹398, having fallen 14% in 2025.",
            "Sentiment": "positive",
            "PublishDate": 1747726865000,
            "Source": "earnings"
        },
        {
            "Title": "Bansal Wire Reports Q4 Financial Results",
            "Summary": "Bansal Wire has announced its Q4 financial results. The company's EBITDA increased to 719 million rupees from 457 million rupees year-over-year. The EBITDA margin improved to 7.76% from 6.4% in the same period. Revenue grew to 9.4 billion rupees from 7.1 billion rupees year-over-year. The consolidated net profit rose to 331 million rupees from 234 million rupees compared to the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747721694000,
            "Source": "result"
        },
        {
            "Title": "Bansal Wire Industries: Subsidiary Secures Land for New Manufacturing Facility in Gujarat",
            "Summary": "BWI Steel Private Ltd, a wholly-owned subsidiary of Bansal Wire Industries Ltd, has been allotted a 170,000 square meter industrial plot in the Sanand-II Industrial Estate by the Gujarat Industrial Development Corporation (GIDC).",
            "Sentiment": "positive",
            "PublishDate": 1742293134000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bansal Wire Industries Launches Specialty Wire Production",
            "Summary": "Bansal Wire Industries has announced the commencement of production in its specialty wire vertical. The market size for these specialty wire products is estimated to be approximately 450,000 tons per annum.",
            "Sentiment": "positive",
            "PublishDate": 1733702965000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bansal Wire Industries Launches Specialty Wire Production",
            "Summary": "Bansal Wire Industries has announced the commencement of production in its specialty wire vertical. The market size for these specialty wire products is estimated to be 450,000 tons per annum, indicating a significant potential for growth in this segment.",
            "Sentiment": "positive",
            "PublishDate": 1733484903000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bansal Wire Reports Strong Q2 Financial Performance",
            "Summary": "Bansal Wire has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 365 million rupees to 639 million rupees. Additionally, the EBITDA margin improved from 6.05% to 7.74%.",
            "Sentiment": "positive",
            "PublishDate": 1731327564000,
            "Source": "result"
        },
        {
            "Title": "Bansal Wire Reports Strong Q2 Financial Results",
            "Summary": "Bansal Wire has announced its Q2 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit increased to 396 million rupees, up from 182 million rupees in the same quarter last year and 302 million rupees in the previous quarter. Revenue also saw substantial growth, reaching 8.25 billion rupees compared to 6 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731327479000,
            "Source": "result"
        },
        {
            "Title": "Bansal Wire Industries Signs Agreement with Adfactors PR",
            "Summary": "Bansal Wire Industries has entered into an agreement with Adfactors PR. The nature and details of the agreement are not specified in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1729077813000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bansal Wire Industries Incorporates New Steel Subsidiary",
            "Summary": "<p>Bansal Wire Industries has incorporated a <span class='positive'>wholly owned subsidiary</span> named <b>BWI Steel Private Ltd</b>. The new entity will <span class='neutral'>operate</span> in the <span class='neutral'>iron and steel industry</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728048712000,
            "Source": "corporate_action"
        }
    ]
}