{
    "Symbol": "BANSWRAS",
    "ISIN": "INE629D01020",
    "News": [
        {
            "Title": "Banswara Syntex Board Meet Set for Feb 10, 2026",
            "Summary": "Banswara Syntex Limited has scheduled its board meeting for February 10, 2026, to review and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770217817041,
            "Source": "co_actions_results"
        },
        {
            "Title": "Banswara Syntex Limited Approves Leadership Changes Through Postal Ballot",
            "Summary": "Banswara Syntex Limited shareholders approved two special resolutions through postal ballot voting that concluded on October 29, 2025. The company changed the designation of Ravindrakumar Toshniwal from Managing Director to Vice-Chairman effective August 7, 2025, with the position now liable to retire by rotation. Simultaneously, Shaleen Toshniwal's designation was changed from Joint Managing Director to Managing Director effective the same date, with this position not liable to retire by rotation. Both resolutions received overwhelming shareholder support with approximately 99.88% votes in favor. The voting process was conducted through remote e-voting facilitated by Central Depository Services (India) Limited, with voting rights determined based on shareholding as of September 26, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761838024952,
            "Source": "corporate_governance"
        },
        {
            "Title": "Banswara Syntex Reports Mixed Q1 FY26 Results with 12.7% Revenue Growth but Posts Net Loss",
            "Summary": "Banswara Syntex Limited reported total income of INR309.6 crores for Q1 FY26, representing a 12.7% year-on-year increase. However, the company posted a net loss of INR1.4 crores despite EBITDA rising marginally to INR21.9 crores. The garment division showed strong performance with 42% revenue growth to INR75 crores and 78% capacity utilization. Fabric division revenue grew 4% to INR117 crores, while yarn division revenue increased 10% with sales volume up 13% to 51 lakh kgs. The company faced temporary labor shortages in the yarn division during the quarter, leading to reduced capacity utilization at 70%. Management expects sequential improvement in coming quarters and maintains targets of INR1,550 crores revenue and 12% EBITDA for the full year. The company plans capex of INR100 crores for the current year and expects benefits from the India-UK free trade agreement.",
            "Sentiment": "neutral",
            "PublishDate": 1755076379112,
            "Source": "earnings"
        },
        {
            "Title": "Banswara Syntex Reports 12.7% Revenue Growth to Rs 309.6 Crore in Q1 FY26 Despite Net Loss",
            "Summary": "Banswara Syntex Limited reported total income of Rs 309.6 crore in Q1 FY26, marking a 12.7% year-on-year growth. EBITDA stood at Rs 21.9 crore with a margin of 7.1%. The company posted a net loss of Rs 1.4 crore, attributed to unforeseen operational challenges. The Yarn division recorded 10% revenue growth to Rs 110 crore with 13% increase in sales volume, though capacity utilization remained below optimal due to labor shortages. Fabric revenue grew modestly by 4% to Rs 117 crore with flat volumes and 70% capacity utilization. Garments emerged as the strongest performer with 42% revenue growth to Rs 75 crore and 29% volume increase, driven by export momentum and improved capacity utilization to 78%. Vice-Chairman Ravindra Kumar Toshniwal noted that while the textile industry faced uneven demand trends, the company expects gradual normalization in coming quarters with better order visibility and seasonal demand support.",
            "Sentiment": "neutral",
            "PublishDate": 1754554579368,
            "Source": "earnings"
        },
        {
            "Title": "Banswara Syntex Announces Leadership Changes: Ravindrakumar Toshniwal Moves to Vice-Chairman, Shaleen Toshniwal Promoted to Managing Director",
            "Summary": "Banswara Syntex Ltd announced significant leadership changes effective August 7, 2025. Ravindrakumar Toshniwal will transition from Managing Director to Vice-Chairman, while Shaleen Toshniwal has been promoted from Joint Managing Director to Managing Director. Both executives will retain their existing terms and remuneration until December 31, 2026, as previously approved by shareholders. The company's board also approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. A postal ballot notice will be sent to shareholders seeking approval for these designation changes. Ravindrakumar Toshniwal, 62, holds a B.Tech from IIT Mumbai and has 37 years of textile industry experience. Shaleen Toshniwal, 48, is a business management graduate from Bentley College with 21 years of textile industry experience, overseeing readymade garments, thermal power operations, and HR strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1754482897413,
            "Source": "corporate_governance"
        },
        {
            "Title": "Banswara Syntex Q4 Results and Dividend Announcement",
            "Summary": "Banswara Syntex reported its Q4 financial results and announced a dividend. The company's Q4 EBITDA increased to 254 million rupees from 220 million rupees year-over-year, with EBITDA margin improving to 7.48% from 6.42%. Q4 net profit decreased to 59 million rupees from 85 million rupees year-over-year and 101 million rupees quarter-on-quarter. Q4 revenue remained stable at 3.4 billion rupees compared to the same period last year. The company has recommended a dividend of 1 rupee per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747316793000,
            "Source": "result"
        },
        {
            "Title": "Banswara Syntex Reports Q2 Financial Results",
            "Summary": "Banswara Syntex has released its Q2 financial results. The company's EBITDA for the quarter was 255 million rupees, compared to 274 million rupees in the same quarter last year. The EBITDA margin decreased to 7.45% from 8.69% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730796952000,
            "Source": "result"
        },
        {
            "Title": "Banswara Syntex Reports Q2 Financial Results",
            "Summary": "Banswara Syntex has reported its Q2 financial results. The company's net profit decreased to 51 million rupees from 86 million rupees year-over-year. However, revenue increased to 3.42 billion rupees from 3.16 billion rupees compared to the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730796822000,
            "Source": "result"
        }
    ]
}