{
    "Symbol": "BASF",
    "ISIN": "INE373A01013",
    "News": [
        {
            "Title": "BASF India Gets NSE Nod for Agricultural Unit Demerger",
            "Summary": "BASF India Limited receives no-objection letter from NSE for scheme of arrangement to demerge Agricultural Solutions Business to wholly owned subsidiary BASF Agricultural Solutions India Limited.",
            "Sentiment": "positive",
            "PublishDate": 1770089936805,
            "Source": "co_actions_results"
        },
        {
            "Title": "ASF Group Secures ₹1,250 Cr from Alpha Alternatives",
            "Summary": "ASF Group raises ₹1,250 crore from Alpha Alternatives to fund its 50-acre office campus in Gurugram's Vatsal Valley, with ₹450 crore already received and remaining funds expected within six months.",
            "Sentiment": "positive",
            "PublishDate": 1769084647908,
            "Source": "co_actions_results"
        },
        {
            "Title": "BASF India Conducts Postal Ballot for Director Appointment",
            "Summary": "BASF India Limited is conducting a postal ballot through remote e-voting from December 1-30, 2025, to seek shareholder approval for appointing Andrew George Postlethwaite as Non-Executive Non-Independent Director effective December 1, 2025. The appointment fills a casual vacancy caused by the resignation of Marcelo Rocha Lu, with results to be announced by January 2, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1764152549733,
            "Source": "corporate_action"
        },
        {
            "Title": "BASF India Reports 5% Sales Decline and 27% Profit Drop in H1 FY26",
            "Summary": "BASF India's consolidated sales fell 4% to Rs 7,920 crores in the six months ending September 2025, with profit before tax declining 27% due to higher input costs and unfavorable product mix. The company is proceeding with the demerger of its agricultural solutions business and a global coatings business transaction with Carlyle, while expanding capacity in performance materials including Cellesto and engineering plastics.",
            "Sentiment": "negative",
            "PublishDate": 1763719311073,
            "Source": "earnings"
        },
        {
            "Title": "BASF India Reports 4% Revenue Decline in H1 FY26, Plans Agricultural Solutions De-merger",
            "Summary": "BASF India's consolidated revenue dropped 4% to Rs 7,920 crores in Apr-Sep 2025 from Rs 8,215 crores in the previous year, with profit before tax declining 27% to Rs 331 crores due to higher input costs and product mix challenges. The company announced plans to de-merge its Agricultural Solutions business to unlock shareholder value and revealed that BASF globally reached a binding agreement with Carlyle to divest its coatings business for €7.7 billion, which may impact its Indian coatings subsidiary.",
            "Sentiment": "negative",
            "PublishDate": 1763547796484,
            "Source": "stock"
        },
        {
            "Title": "BASF India Reports 16% Drop in Net Profit to ₹107 Crore in September Quarter",
            "Summary": "BASF India's net profit declined 16.4% to ₹107 crore in the September quarter due to lower revenue of ₹404.5 crore and reduced EBITDA of ₹16.3 crore. The chemical maker announced plans for a 12.21 MW wind-solar hybrid captive power plant with Clean Max Enviro Energy Solutions to supply renewable energy to its Gujarat manufacturing sites.",
            "Sentiment": "negative",
            "PublishDate": 1763112727948,
            "Source": "earnings"
        },
        {
            "Title": "BASF India Acquires 26% Stake in Clean Max Amalfi for Renewable Energy Supply",
            "Summary": "BASF India has signed a share purchase agreement to acquire a 26% stake in Clean Max Amalfi. The acquisition is aimed at securing renewable power supply for the company's Dahej and Panoli manufacturing plants.",
            "Sentiment": "positive",
            "PublishDate": 1762858413843,
            "Source": "stock"
        },
        {
            "Title": "BASF and Carlyle Agree €7.7 Billion Deal for Global Coatings Business",
            "Summary": "BASF and Carlyle, partnering with Qatar Investment Authority, have entered a binding agreement for BASF's automotive OEM coatings, automotive refinish coatings, and surface treatment businesses valued at €7.7 billion globally. The transaction is expected to close in Q2 2026, subject to regulatory approvals. BASF will retain a 40% equity stake in the new standalone company and receive approximately €5.8 billion in pre-tax cash proceeds. In India, the automotive coatings business was transferred to BASF India Coatings Private Limited, a wholly owned subsidiary of BASF India Limited, effective January 1, 2025. The Indian coatings business generated sales of Rs. 479.6 crore as of March 31, 2025, representing 3.1% of consolidated sales. BASF India Limited will evaluate the impact of this global transaction on its operations and subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1760105828158,
            "Source": "order&deals"
        },
        {
            "Title": "BASF and Carlyle Complete Deal to Create New Global Coatings Business",
            "Summary": "BASF and Carlyle have finalized their agreement to establish a new global standalone coatings business. The deal represents a strategic partnership between the chemical company and the investment firm to create an independent entity focused on coatings operations.",
            "Sentiment": "positive",
            "PublishDate": 1760105446192,
            "Source": "global"
        },
        {
            "Title": "BASF India Submits Updated Shareholding Pattern for Quarter Ended June 30, 2025",
            "Summary": "BASF India Limited submitted its updated shareholding pattern for the quarter ended June 30, 2025. The company's shareholding structure shows Promoter & Promoter Group holding 73.33% (31,743,220 shares) through 2 shareholders, while Public shareholders hold 26.67% (11,542,420 shares) across 64,778 shareholders. The total share capital consists of 43,285,640 equity shares of Rs. 10 each. Foreign ownership utilization stands at 77.73% against approved limits of 100%. The company noted that 682 fully paid-up equity shares from Rights Issues in 1995 and 1996 are held in abeyance due to pending legal disputes.",
            "Sentiment": "neutral",
            "PublishDate": 1754982643959,
            "Source": "corporate_action"
        },
        {
            "Title": "BASF India Acquires 26% Stake in Clean Max Amalfi for INR 65.93 Million to Secure Renewable Power",
            "Summary": "BASF India Limited's Board of Directors approved the acquisition of a 26% equity stake in Clean Max Amalfi Private Limited for up to INR 65.93 million. The acquisition is designed to procure approximately 28,854 MWh of renewable power from solar and wind sources for BASF's manufacturing facilities in Dahej and Panoli through the Group Captive Power Generation Mechanism. Clean Max Amalfi is a Special Purpose Vehicle created by Clean Max Enviro Energy Solutions Private Limited. The transaction will operate under Gujarat's renewable energy policy and the Electricity Act 2003. Completion of the deal depends on signing definitive agreements including a Shareholders' Agreement and a 25-year Power Purchase Agreement, along with obtaining necessary approvals and meeting other specified conditions.",
            "Sentiment": "positive",
            "PublishDate": 1753867279003,
            "Source": "order&deals"
        },
        {
            "Title": "BASF India Reports 33% Decline in Q1 Net Profit to 1.47 Billion Rupees",
            "Summary": "BASF India's net profit dropped to 1.47 billion rupees in Q1 compared to 2.2 billion rupees in the same period last year, representing a year-over-year decline of approximately 33%.",
            "Sentiment": "negative",
            "PublishDate": 1753865625206,
            "Source": "earnings"
        },
        {
            "Title": "BASF India Launches Two New Agro Chemical Products for Rice Growers",
            "Summary": "BASF India has introduced two new agro chemical products, Valexio and Mibelya, aimed at supporting Indian rice farmers. These products are designed to help growers achieve better and higher quality yields in rice cultivation.",
            "Sentiment": "positive",
            "PublishDate": 1748408434000,
            "Source": "default"
        },
        {
            "Title": "BASF Reports Significant Drop in Q4 EBITDA",
            "Summary": "BASF experienced a substantial decline in its fourth quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 6.32 billion rupees from 24.4 billion rupees in the same quarter of the previous year. Additionally, the EBITDA margin decreased to 1.98% from 7.25% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1747215179000,
            "Source": "result"
        },
        {
            "Title": "BASF India Approves Demerger of Agricultural Solutions Division",
            "Summary": "The Board of Directors of BASF India has approved the demerger of its Agricultural Solutions division. This corporate action suggests a significant restructuring within the company, potentially aimed at streamlining operations or focusing on core business areas.",
            "Sentiment": "neutral",
            "PublishDate": 1747214706000,
            "Source": "default"
        },
        {
            "Title": "BASF India Reports Q4 Revenue Decline",
            "Summary": "BASF India's fourth quarter revenue decreased to 31 billion rupees from 33.3 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1747214094000,
            "Source": "result"
        },
        {
            "Title": "BASF India Reports Significant Drop in Q4 Net Profit",
            "Summary": "BASF India's fourth-quarter net profit decreased to 471 million rupees from 1.6 billion rupees in the same period last year, marking a substantial year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1747214077000,
            "Source": "result"
        },
        {
            "Title": "BASF to Consider Q4 Results on May 14",
            "Summary": "BASF, a global chemical company, has announced that it will consider its fourth quarter results on May 14. This indicates the company is preparing to review and potentially approve its financial performance for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1743163977000,
            "Source": "corporate_governance"
        },
        {
            "Title": "BASF to Enhance CELLASTO® Production Capacity in India",
            "Summary": "BASF is taking steps to strengthen its CELLASTO® product line's position in India by increasing production capacity. This move suggests a growing demand for CELLASTO® products in the Indian market and BASF's commitment to meeting this demand through local manufacturing expansion.",
            "Sentiment": "positive",
            "PublishDate": 1740387894000,
            "Source": "corporate_action"
        },
        {
            "Title": "BASF India Reports Q3 Results and Plans Closure of Turbo Tube Dryer Unit",
            "Summary": "BASF India announced its Q3 financial results, reporting a net profit of 1.04 billion rupees, down from 1.4 billion rupees year-over-year. Revenue increased to 37 billion rupees from 33.3 billion rupees in the same period last year. The company also revealed plans to close its Turbo Tube Dryer unit at the Dahej manufacturing site by the first half of 2025, citing that the technology no longer meets current Indian market standards.",
            "Sentiment": "neutral",
            "PublishDate": 1738714764000,
            "Source": "earnings"
        },
        {
            "Title": "BASF India to Close Turbo Tube Dryer Unit by First Half of 2025",
            "Summary": "BASF India has announced plans to shut down its Turbo Tube Dryer unit. The company expects the closure process to be completed by the first half of 2025. This decision likely reflects strategic restructuring or optimization efforts within the company's operations.",
            "Sentiment": "neutral",
            "PublishDate": 1738680283000,
            "Source": "corporate_action"
        },
        {
            "Title": "BASF India to Close Turbo Tube Dryer Unit at Dahej Manufacturing Site",
            "Summary": "BASF India has announced the closure of its Turbo Tube Dryer unit at the company's manufacturing site in Dahej. The decision to shut down this unit was made due to the technology no longer meeting current Indian market standards.",
            "Sentiment": "negative",
            "PublishDate": 1738680273000,
            "Source": "corporate_action"
        },
        {
            "Title": "BASF India Reports Decline in Q3 EBITDA and Margin",
            "Summary": "BASF India has reported a decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 1.70 billion rupees from 2.12 billion rupees in the same quarter of the previous year. Additionally, the EBITDA margin declined to 4.59% from 6.47% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738678350000,
            "Source": "earnings"
        },
        {
            "Title": "BASF India Reports Mixed Q3 Financial Results",
            "Summary": "BASF India has announced its Q3 financial results. The company's net profit decreased to 1.04 billion rupees from 1.4 billion rupees in the same quarter last year. However, revenue increased to 37 billion rupees from 33.3 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738678344000,
            "Source": "earnings"
        },
        {
            "Title": "BASF India Transfers Coatings Business to Subsidiary",
            "Summary": "BASF India has completed the transfer of its coatings business to its wholly owned subsidiary, BASF India Coatings Pvt Ltd, for a consideration of Rs 182 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1735900024000,
            "Source": "corporate_action"
        },
        {
            "Title": "BASF India: Board Approves Demerger of Agricultural Solutions Business",
            "Summary": "BASF India's board has approved the demerger of its agricultural solutions business into a separate legal entity. The move aims to enhance operational flexibility and create value. The agricultural solutions segment generated sales of Rs 2,006 crore, representing 14.57% of total revenues for FY 2024. This aligns with BASF SE's global strategy announced last year. The company's share price rose up to 7.6% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1734669075000,
            "Source": "corporate_action"
        },
        {
            "Title": "BASF India Approves Demerger of Agricultural Solutions Business",
            "Summary": "BASF India has received in-principle approval for the demerger of its Agricultural Solutions business into a separate listed entity. This corporate action will result in the creation of a new, independent company focused on agricultural solutions, while allowing BASF India to concentrate on its core chemical business.",
            "Sentiment": "neutral",
            "PublishDate": 1734609486000,
            "Source": "corporate_action"
        },
        {
            "Title": "BASF India Reports Decline in Q2 EBITDA and Margin",
            "Summary": "BASF India's Q2 EBITDA decreased to 2.09 billion rupees from 2.3 billion rupees year-over-year. The company's EBITDA margin also declined to 4.73% from 6.31% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731401041000,
            "Source": "result"
        },
        {
            "Title": "BASF India Reports Q2 Revenue Growth",
            "Summary": "BASF India has announced its second quarter revenue of 42.5 billion rupees, compared to 37 billion rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731400924000,
            "Source": "result"
        },
        {
            "Title": "BASF Expects Lower End of Annual Adjusted EBITDA Forecast",
            "Summary": "BASF Global has announced that it anticipates reaching the lower end of its full-year adjusted EBITDA forecast range. This suggests that the company's financial performance may be at the conservative end of its previously projected estimates.",
            "Sentiment": "neutral",
            "PublishDate": 1730268087000,
            "Source": "result"
        }
    ]
}