{
    "Symbol": "BASML",
    "ISIN": "INE186H01022",
    "News": [
        {
            "Title": "Bannari Amman Board Meet Set for Feb 14, 2026",
            "Summary": "Bannari Amman Spinning Mills schedules board meeting on February 14, 2026, to consider Q3 FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769166940339,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bannari Amman Appoints New Independent Director",
            "Summary": "Bannari Amman Spinning Mills successfully appointed Sri R Shanmugavelayutham as Independent Director through postal ballot with 99.92% approval from shareholders on December 18, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766141575621,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bannari Amman Spinning Mills Seeks Shareholder Approval for Independent Director Appointment",
            "Summary": "Bannari Amman Spinning Mills has issued a postal ballot notice seeking shareholder approval for appointing Sri R Shanmugavelayutham (DIN 01205640) as an Independent Director for a five-year term from November 14, 2025 to November 13, 2030. The 76-year-old appointee, a National Defence Academy graduate and former Indian Army officer, was initially appointed as Additional Director by the Board and requires special resolution approval within three months due to his age exceeding 75 years.",
            "Sentiment": "neutral",
            "PublishDate": 1763469701552,
            "Source": "corporate_action"
        },
        {
            "Title": "Bannari Amman Spinning Mills Reports Strong Q2 Performance and Appoints New Independent Director",
            "Summary": "Bannari Amman Spinning Mills posted quarterly profit of Rs 602.09 lakhs from continuing operations and appointed Sri R Shanmugavelayutham as Independent Director for five years. The company also allotted 41.66 lakh convertible equity warrants to promoter group at Rs 36 per warrant, raising Rs 375 lakhs towards minimum consideration.",
            "Sentiment": "positive",
            "PublishDate": 1763141017531,
            "Source": "corporate_action"
        },
        {
            "Title": "Bannari Amman Spinning Mills Returns to Profitability with Rs 5.03 Crore PAT in Q1 FY2026",
            "Summary": "Bannari Amman Spinning Mills reported a profit after tax of Rs 5.03 crore compared to a loss of Rs 32.30 crore in the same quarter last year. Revenue grew marginally by 0.7% to Rs 217.39 crore, while EBITDA margin improved significantly to 11.1% from 6.9% in the previous year. The company completed a rights issue raising Rs 407.15 crore through 1,50,79,504 equity shares at Rs 27 per share. Cost management was effective with material costs declining 21.2% and finance costs reducing 8.7%. The company approved a 9.74 MW solar power project with commissioning expected by October 2025, having paid Rs 16 crore as advance. The company is in the process of selling its garment unit at Palladam and land at SIPCOT, Perundurai, with the sale pending lender approvals.",
            "Sentiment": "positive",
            "PublishDate": 1754914820097,
            "Source": "earnings"
        },
        {
            "Title": "Bannari Amman Spinning Mills Approves Warrant Issuance to Promoters via Postal Ballot",
            "Summary": "Bannari Amman Spinning Mills Limited successfully passed a special resolution through remote e-voting to issue warrants convertible into equity shares to promoters and promoter group on a preferential basis. The postal ballot concluded on July 31, 2025, with the resolution receiving requisite majority approval. Out of 79,921,375 total shares, 39,685,386 votes were polled (49.66% voting turnout). The promoter and promoter group voted unanimously in favor with 39,602,346 votes (100% approval), while public non-institutions showed 83.29% support with 69,107 votes in favor and 13,863 against. Public institutions also voted entirely in favor with 70 votes. The company has 25,683 shareholders on record as of June 30, 2025. The scrutinizer R Dhanasekaran issued the report confirming the voting results.",
            "Sentiment": "positive",
            "PublishDate": 1754033947457,
            "Source": "corporate_action"
        },
        {
            "Title": "Bannari Amman Spinning Mills Reports Q4 Profit and Improved EBITDA",
            "Summary": "Bannari Amman Spinning Mills has reported its Q4 financial results. The company's EBITDA improved to a gain of 211 million rupees, compared to a loss of 91 million rupees in the same quarter last year. The EBITDA margin for Q4 was 9.35%. The company's consolidated net profit for Q4 was 18 million rupees, a turnaround from a loss of 107 million rupees in the previous year. However, Q4 revenue decreased to 2.25 billion rupees from 2.5 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747820980000,
            "Source": "result"
        },
        {
            "Title": "Bannari Amman Spinning Mills: Board Approves ₹40.71 Crore Rights Issue",
            "Summary": "Bannari Amman Spinning Mills Ltd's board has approved a rights issue of 1.50 crore equity shares at ₹27 per share, totaling ₹40.71 crore. The rights issue is set to open on May 13, 2025, and close on May 26, 2025. This move aims to strengthen the company's capital base and support future growth initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1745517051000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bannari Amman Spinning Mills Announces Rights Issue Terms",
            "Summary": "Bannari Amman Spinning Mills' board has approved the terms for a rights issue. The company will offer shares at 27 rupees per share, with a rights entitlement ratio of 10 shares for every 43 shares held by existing shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1745506315000,
            "Source": "default"
        },
        {
            "Title": "Bannari Amman Spinning Mills to Consider Fundraising",
            "Summary": "Bannari Amman Spinning Mills has announced a board meeting scheduled for November 14 to discuss and potentially approve raising funds for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1730808709000,
            "Source": "corporate_action"
        }
    ]
}