{
    "Symbol": "BATAINDIA",
    "ISIN": "INE176A01028",
    "News": [
        {
            "Title": "Bata India Q3FY26 Profit Rises 13.5% to ₹661 Crore",
            "Summary": "Bata India reported consolidated profit of ₹661.02 million for Q3FY26, up 13.5% YoY, with revenue at ₹9,446.81 million. Nine-month profit declined 53.6% to ₹1,319.96 million.",
            "Sentiment": "positive",
            "PublishDate": 1770690931233,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bata India Board Meet on Feb 9 for Q3FY26 Results",
            "Summary": "Bata India Limited has scheduled a board meeting on February 9, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769613670055,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bata India board clears VRS for Hosur unit workers",
            "Summary": "Bata India's board approved VRS for eligible workers at Hosur unit on January 8. Company reported 73.26% decline in Q2 net profit to ₹13.9 crore amid GST transition challenges.",
            "Sentiment": "neutral",
            "PublishDate": 1767868305346,
            "Source": "stocks"
        },
        {
            "Title": "Bata India Faces ₹23.95 Lakh GST Penalty for FY22",
            "Summary": "Bata India receives GST demand order and penalty from Chandigarh Commercial Tax Officer for alleged ITC violations in FY 2021-22. Company confident of defending case.",
            "Sentiment": "negative",
            "PublishDate": 1767097348851,
            "Source": "stocks"
        },
        {
            "Title": "Supreme Court Rejects Bata, Liberty Appeal in Crocs Design Infringement Case",
            "Summary": "The Supreme Court rejected petitions from Bata India, Liberty Shoes, and other footwear manufacturers challenging the Delhi High Court's July 2025 ruling that allowed Crocs Inc. USA's passing off suits to proceed. The case involves allegations that Indian companies copied Crocs' distinctive foam clog designs, with defendants arguing this creates a dual monopoly over features protected under both design and trademark laws.",
            "Sentiment": "negative",
            "PublishDate": 1763129435536,
            "Source": "stock"
        },
        {
            "Title": "Bata India Reports 4% Revenue Decline in Q2 FY26 Due to GST Transition and Distribution Disruption",
            "Summary": "Bata India Limited reported revenue of INR 8,000 million for Q2 FY26, marking a 4% year-on-year decline. The company attributed this drop to two major disruptions: GST rate transition from 12% to 5% on footwear and operational issues at their largest distribution center in Jamalpur covering 40% of inventory. Management estimates the company would have achieved flat revenue growth without these disruptions. Gross margins declined by 150 basis points compared to the previous year, though improved 190 basis points sequentially from Q1. EBITDA margins fell by 220 basis points, partly due to doubled advertising and promotional spending to 3.5% from 1.5% previously. The company continued its transformation initiatives including zero-based merchandising expansion to cities like Gurgaon and Mumbai, inventory decluttering with double-digit reduction, and franchise network growth approaching 700 stores from under 100 four years ago. Product portfolio shows 40% below INR 1,000, 40% between INR 1,000-2,500, and 20% above INR 2,500. Management reported improved consumer response post-September 22 when new GST rates became effective and expects structural benefits from the rate reduction on lower-priced products.",
            "Sentiment": "neutral",
            "PublishDate": 1762465788196,
            "Source": "earnings"
        },
        {
            "Title": "Bata India Receives GST Penalty Demand of Rs 29.69 Lakh for ITC Claims",
            "Summary": "Bata India Limited received a demand order from the Office of the Deputy Commissioner, Bengaluru, Karnataka under the CGST Act, 2017 for Financial Year 2022-23. The order imposes a penalty of Rs 29,69,527 in addition to demand for tax and interest, relating to Input Tax Credit (ITC) claims not in accordance with applicable laws. The order was passed on November 5, 2025. The company believes it has a good case to defend the matters before appropriate authorities without any material financial impact.",
            "Sentiment": "negative",
            "PublishDate": 1762456675438,
            "Source": "stock"
        },
        {
            "Title": "Mirae Asset Mutual Fund Increases Stake in Bata India to 9.78%",
            "Summary": "Mirae Asset Mutual Fund acquired 529,281 shares of Bata India through open market transactions on October 30, 2025. The acquisition increased the fund's shareholding from 9.37% to 9.78% in the footwear company. Before the transaction, Mirae Asset held 12,044,603 shares carrying voting rights, and after the acquisition, this increased to 12,573,884 shares. The disclosure was made under SEBI regulations for substantial acquisition of shares and takeovers. Bata India's shares are listed on the National Stock Exchange.",
            "Sentiment": "neutral",
            "PublishDate": 1761921700664,
            "Source": "corporate_action"
        },
        {
            "Title": "Bata India Reports 4.3% Revenue Decline in Q2 with Increased Marketing Investment",
            "Summary": "Bata India Limited reported revenue from operations of INR 8,013 million, down 4.3% year-over-year in its quarterly results. The company's gross margin decreased by 155 basis points to INR 4,439 million, while EBITDA margin fell 221 basis points to 20.7% and PAT margin dropped 351 basis points to 2.7%. The company significantly increased marketing investments to 3.5% of turnover compared to 1.5% in the previous year. Bata recorded an exceptional cost of INR 83 million related to Voluntary Retirement Scheme (VRS) at its Batanagar unit. The company expanded its franchise network to 661 doors and added 413 net KROs, reaching 1,478 total KROs across 1,635 towns. Inventory decreased 12.7% to INR 7,215 million with improved stock turns of 2.18. Digital channels showed growth with Bata.com up 25% year-over-year and omnichannel contributing 3.8% of retail turnover.",
            "Sentiment": "negative",
            "PublishDate": 1761838966828,
            "Source": "earnings"
        },
        {
            "Title": "Bata India Plans 2,000 Stores by FY26 with 200 Annual Franchise Additions",
            "Summary": "Bata India targets crossing 2,000 stores by end-FY26 through franchise network expansion of 200 stores annually. The company reports inventory decluttering has boosted stock turns 1.9 times, while digital sales are growing 25 percent year-over-year. Premium portfolios including Hush Puppies and Power are delivering higher average selling prices and supporting profitability recovery. Marketing spend has doubled and GST benefit pass-through is strengthening brand equity.",
            "Sentiment": "positive",
            "PublishDate": 1761838507775,
            "Source": "stock"
        },
        {
            "Title": "Bata India Targets ₹4,500+ Crore Quarterly Revenue by FY27 Through Store Expansion and Premium Strategy",
            "Summary": "Bata India aims to achieve a quarterly revenue run-rate exceeding ₹4,500 crore by FY27. The company plans to add 900 new franchise stores and expand its premium brand mix. Bata expects GST 2.0 normalization and EBITDA margin recovery to 22% as consumer demand rebounds.",
            "Sentiment": "positive",
            "PublishDate": 1761582358788,
            "Source": "stock"
        },
        {
            "Title": "Bata India Reports 73% Drop in Net Profit for Q2 Results",
            "Summary": "Bata India's consolidated net profit fell 73% to Rs 23.8 crore in the second quarter compared to Rs 51.98 crore in the same period last year. Revenue declined 4.3% to Rs 801 crore from Rs 837 crore year-over-year. The company's EBITDA dropped 16.7% to Rs 145 crore, while EBITDA margin contracted to 18.1% from 20.8% in the previous year. The footwear company has missed top line estimates for consecutive quarters, with the second quarter falling short by 110%. In the previous quarter, the company had reported a 70% drop in consolidated net profit to Rs 52 crore compared to Rs 174 crore in the corresponding period.",
            "Sentiment": "negative",
            "PublishDate": 1761572827617,
            "Source": "earnings"
        },
        {
            "Title": "Bata India Q2 Revenue Drops to Rs 8,013 Million as GST 2.0 Transition Impacts Demand",
            "Summary": "Bata India reported quarterly revenue of Rs 8,013 million compared to Rs 8,371 million in Q2FY25, attributed to deferred purchases by channel partners and customers following GST rate rationalization announcements. EBITDA declined to Rs 1,664 million from Rs 1,918 million in Q2FY25 due to lower gross margins from higher markdowns and increased marketing investments. The company incurred exceptional expenditure of Rs 83 million for voluntary retirement scheme at one factory. Business was also temporarily impacted by warehouse disruption in July 2025. Premium brands Hush Puppies and Power showed robust growth, with Victoria Ballerina campaign helping gain 1% additional sales mix and Power Easy Slide collection achieving highest weekly contribution. The company added 30 franchise stores and expanded Zero Base Merchandising Project to 200 stores. Management noted positive recovery signs during festive season post September 22 and remains cautiously optimistic about recovery for the balance of the year.",
            "Sentiment": "neutral",
            "PublishDate": 1761569722925,
            "Source": "earnings"
        },
        {
            "Title": "Bata India Reports Q2 FY26 Results with VRS Expenses as Exceptional Items",
            "Summary": "Bata India Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company reported revenue from operations of Rs. 8,371.44 million for the quarter. The results included exceptional items totaling Rs. 130.47 million related to voluntary retirement schemes (VRS) at two manufacturing units - Rs. 47.78 million for additional expenses from a previously implemented scheme and Rs. 82.69 million for a new VRS at another unit. The company operates in a single business segment of Footwear and Accessories. The consolidated results include Bata India Limited as the holding company along with subsidiaries Bata Properties Limited and Way Finders Brands Limited. The Board of Directors approved these results at their meeting held on October 27, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761568477744,
            "Source": "earnings"
        },
        {
            "Title": "Bata India Schedules Board Meeting for October 27 to Review Q2 Earnings",
            "Summary": "Bata India has scheduled a board meeting for October 27 to review its quarterly earnings results. The meeting will focus on examining the company's financial performance for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1759317244136,
            "Source": "earnings"
        },
        {
            "Title": "Bata India Plans 1,000 Stores in 2-3 Years, Eyes Tier-3 to Tier-5 Towns Amid GST Cut Benefits",
            "Summary": "Bata India is targeting expansion in tier-3 to tier-5 towns where urbanization is driving demand for better retail experiences. The company plans to grow its franchise network from 650 stores to 1,000 stores over the next 2-3 years. E-commerce has become the fastest-growing business channel with double-digit contribution to revenue. Bata expects to benefit from the GST reduction on footwear priced up to ₹2,500, which decreased from 12% to 5%. Around 80% of Bata's portfolio falls under ₹2,500, with nearly 40% priced below ₹1,000. The company will pass tax benefits to consumers to make footwear more affordable and drive higher sales volumes. The festive season is expected to see increased demand, particularly for products under ₹1,000. Bata India has a market capitalization of ₹15,921 crore, with shares trading at ₹1,239.20 and declining 13% over the last year.",
            "Sentiment": "positive",
            "PublishDate": 1757053093815,
            "Source": "stock"
        },
        {
            "Title": "Bata India Block Trade Worth Rs. 30.32 Crores Executed on NSE",
            "Summary": "Bata India Ltd. saw a block trade executed on the National Stock Exchange involving approximately 246,027 shares at a price of Rs. 1,232.50 per share. The total transaction value amounted to Rs. 30.32 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1756961831901,
            "Source": "order&deals"
        },
        {
            "Title": "GST Cut On Footwear Below Rs 1,000 Expected To Boost Industry Recovery",
            "Summary": "Prime Minister Narendra Modi announced GST reforms in his Independence Day speech that could reduce the tax rate on footwear priced below Rs 1,000 from 12% to 5%. Bata India CEO Gunjan Shah welcomed the announcement, stating it would boost consumption and aid recovery in the sub-Rs 1,000 segment, which comprises 80-85% of the footwear industry. The GST rate increase from 5% to 12% three years ago significantly impacted industry volumes, with Bata's sub-Rs 1,000 category contribution dropping from 47% to 37% of sales. The proposed GST reforms aim to reduce the current five-slab structure to three slabs: 5%, 18%, and 40%. Shah emphasized the reforms are needed for middle-class and mass-market consumers facing pressure post-Covid. Bata India shares traded 1.06% lower at Rs 1,129.70 on the NSE, while the company reported double-digit contribution from online sales through its omnichannel strategy.",
            "Sentiment": "positive",
            "PublishDate": 1755763013668,
            "Source": "stock"
        },
        {
            "Title": "Bata India Reports Flat Revenue Growth at Rs 942 Crores in Q1 FY26, Margins Under Pressure",
            "Summary": "Bata India Limited reported flat revenue growth of -0.3% at Rs 942 crores for Q1 FY26. The company faced margin pressure with gross margins declining by 133 basis points and EBITDA margins at 22.9%. PAT margin stood at 5.5%, down 112 basis points year-on-year. The company continued its Zero Base Merchandising initiative across 200 stores (up 50 stores in the quarter) and expanded value proposition offerings with new price points showing improved checkout rates. Floatz portfolio maintained 30% growth momentum while Hush Puppies expanded to 150 exclusive brand outlets. Total inventory decreased 16% year-on-year despite sequential build-up for the upcoming season. The company added 20 franchise stores during the quarter, reaching 644 total franchise outlets. Management cited stress in the mass segment and sluggishness in multi-brand outlets as key challenges. Two exceptional items impacted results: VRS costs for factory workers and a base year land realization of Rs 134 crores.",
            "Sentiment": "negative",
            "PublishDate": 1755505937240,
            "Source": "earnings"
        },
        {
            "Title": "Bata India Faces Sustained Decline with 15 Consecutive Quarters of Revenue Misses",
            "Summary": "Bata India is experiencing significant operational and financial challenges, with the stock declining 9% in one month, 19% year-to-date, and 20% over one year. The company has missed revenue estimates for 15 consecutive quarters, with the most recent quarter falling short by 4% and previous quarters missing by as much as 7.4%. Revenue growth has remained below 3% for nine quarters, often turning negative, while competitors Campus and Metro have posted growth rates of 11.5% and 10% respectively in recent quarters. The company's total borrowings increased from Rs. 1,094 crores in March 2022 to Rs. 1,446 crores in March 2025, while Return on Capital Employed declined from 20% in March 2023 to 15% in March 2025. Despite trading at a PE ratio of 67x, analyst sentiment remains overwhelmingly negative with 11 analysts issuing 'Sell' ratings, 7 recommending 'Hold', and only 2 maintaining 'Buy' ratings. The company faces challenges from intensifying competition, failure to capture premium market segments, weak online presence, and lagging retail experience.",
            "Sentiment": "negative",
            "PublishDate": 1755315163663,
            "Source": "stock"
        },
        {
            "Title": "Bata India Reports Q1 FY26 Results with 5.5% Revenue Growth and Strategic Store Expansion",
            "Summary": "Bata India Limited reported revenue from operations of INR 9,418 million for Q1 FY26, representing 5.5% growth year-over-year. The company achieved profit after tax of INR 5,035 million with gross margin of 22.9%, down 112 basis points compared to the previous year. EBITDA margin improved by 157 basis points year-over-year. The company expanded its retail footprint to 1,978 stores as of June 2025, adding 20 franchise stores during the quarter. Key operational improvements included inventory reduction to 0.78X, line reduction to 0.67X, and availability improvement of 450 basis points. The company launched 36 new concept stores and expanded its digital presence with eCommerce contributing approximately 4% of retail turnover. Bata added 319 Key Retail Outlets (KROs) over the previous year, reaching 1,480 KROs total. The company reported exceptional costs of INR 48 million related to Voluntary Retirement Scheme in Q1 FY26. Net Promoter Score improved to 81, up 600 basis points year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1755161939594,
            "Source": "earnings"
        },
        {
            "Title": "Bata India Reports Q1 Financial Results and Appoints New Chief Internal Auditor",
            "Summary": "Bata India Limited announced its unaudited financial results for the quarter ended June 30, 2025. The Board of Directors approved both standalone and consolidated results on August 11, 2025. For the quarter, the company reported standalone revenue from operations of Rs. 9,418.43 million and profit for the period of Rs. 517.00 million, with earnings per share of Rs. 4.02. The consolidated results showed revenue from operations of Rs. 9,418.54 million and profit of Rs. 519.99 million. The company also incurred an exceptional expense of Rs. 47.78 million related to a voluntary retirement scheme at one manufacturing unit. Additionally, the Board appointed Mr. Sidharth Vijayvergia as Chief Internal Auditor effective August 11, 2025. Mr. Vijayvergia is a Chartered Financial Analyst with over 17 years of experience in investigations, fraud risk management, and retail operations.",
            "Sentiment": "neutral",
            "PublishDate": 1754918859688,
            "Source": "earnings"
        },
        {
            "Title": "Bata India Announces Senior Management Changes with Distribution Head Resignation",
            "Summary": "Bata India Limited announced changes in its senior management personnel. Amit Kumar Gupta, Global Head – Distribution, has resigned to pursue career opportunities outside Bata Group, with his resignation effective September 8, 2025. Ashish Arora, who serves as AVP - Institutional & Distribution Business, will be appointed as Senior Management Personnel (Functional Head) on or before September 8, 2025. Arora has been with Bata India for over six years, holding key leadership roles across Sales and Business Development. He has been instrumental in driving company growth in Modern Trade, Distribution and Institutional business, leading the launch of the Key Accounts vertical and expanding distribution in high-potential regions.",
            "Sentiment": "neutral",
            "PublishDate": 1753792937533,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bata India Schedules Board Meeting on August 11, 2025 to Approve Quarterly Financial Results",
            "Summary": "Bata India Limited has scheduled a Board of Directors meeting for August 11, 2025, to consider and approve the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company has notified stock exchanges BSE, NSE, and Calcutta Stock Exchange about the board meeting as required under SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1753160383956,
            "Source": "corporate_action"
        },
        {
            "Title": "Bata India: Analysts Predict Potential 20% Stock Decline Amid Weak Sales",
            "Summary": "Goldman Sachs maintains 'Sell' rating on Bata India with ₹1,100 price target. Q4 profit missed expectations due to weak gross margins. Nuvama Institutional Equities reiterates 'Reduce' rating, lowering price target to ₹1,011. Company plans to scale up Zero Base Merchandising initiative and expand franchise stores. Revenue and profit estimates for FY26 and FY27 have been cut.",
            "Sentiment": "negative",
            "PublishDate": 1748923061000,
            "Source": "earnings"
        },
        {
            "Title": "Bata India: Q4 Profit Declines 28%, Share Price Slumps",
            "Summary": "Bata India's Q4 consolidated net profit fell 27.9% to Rs 45.9 crore. Revenue declined 1.2% to Rs 788 crore. EBITDA dropped 2% to Rs 178 crore with margin contraction. The company declared a final dividend of Rs 9 per share. Share price fell 2.37% in early trade.",
            "Sentiment": "negative",
            "PublishDate": 1748492562000,
            "Source": "earnings"
        },
        {
            "Title": "Bata India Ltd: Q4 Profit Drops 28%, Announces ₹9 Final Dividend",
            "Summary": "Bata India reported a 27.7% YoY decline in Q4 net profit to ₹46 crore. Revenue slightly decreased by 1.2% to ₹788.2 crore. EBITDA fell 26.4% YoY to ₹53.8 crore. The company expanded its retail presence to 1,962 stores and reduced inventory by 15%. A final dividend of ₹9 per share was proposed.",
            "Sentiment": "negative",
            "PublishDate": 1748439804000,
            "Source": "earnings"
        },
        {
            "Title": "Bata India Announces Q4 Results and Dividend",
            "Summary": "Bata India has recommended a dividend of 9 rupees per equity share. The company reported Q4 EBITDA of 1.76 billion rupees, compared to 1.79 billion rupees in the same quarter last year. The Q4 EBITDA margin was 22.33%, down from 22.49% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748436889000,
            "Source": "result"
        },
        {
            "Title": "Bata India Reports Q4 Financial Results",
            "Summary": "Bata India has reported its Q4 financial results. The company's net profit for the quarter was 436 million rupees, compared to 602 million rupees year-over-year and 582 million rupees quarter-over-quarter. Revenue for Q4 was 7.9 billion rupees, compared to 7.98 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1748436789000,
            "Source": "result"
        },
        {
            "Title": "Bata India Reports Improved Q3 EBITDA and Margin",
            "Summary": "Bata India has announced its Q3 financial results, showing an improvement in both EBITDA and EBITDA margin. The company's EBITDA increased to 1.99 billion rupees from 1.82 billion rupees year-over-year. The EBITDA margin also improved, rising to 21.71% from 20.12% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739196199000,
            "Source": "earnings"
        },
        {
            "Title": "Bata India Reports Q3 Financial Results",
            "Summary": "Bata India has announced its financial results for the third quarter. The company's net profit increased slightly to 587 million rupees, compared to 580 million rupees in the same period last year. Revenue also saw a modest growth, rising to 9.19 billion rupees from 9.03 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739196188000,
            "Source": "earnings"
        },
        {
            "Title": "Bata India: Share Price Rises 1.56% Amid Market Upturn",
            "Summary": "Bata India shares are trading at ₹1382.9, up 1.56% from the previous close. The stock has outperformed the Nifty, which is up 0.85%. Trading volume is 49.63% lower than the previous session. The stock is showing signs of a trend reversal after a strong downtrend.",
            "Sentiment": "positive",
            "PublishDate": 1732859977000,
            "Source": "normal_news"
        },
        {
            "Title": "Bata India: Share Price Dips Slightly Amid Market Downturn",
            "Summary": "Bata India shares are trading at ₹1368.6, down 0.07% as of 28 Nov 2024. The stock has ranged between ₹1364.35 and ₹1383.25. Nifty and Sensex are down 0.82% and 0.77% respectively. Trading volume is 38.86% lower than the previous session. The stock shows mixed technical indicators and has a median 1-year target price of ₹1401.00.",
            "Sentiment": "neutral",
            "PublishDate": 1732772205000,
            "Source": "normal_news"
        },
        {
            "Title": "Bata India: Share Price Dips Slightly Amid Mixed Market",
            "Summary": "Bata India shares are trading at ₹1363.35, down 0.18% on November 27, 2024. The stock has seen increased trading volume, up 174.36% from the previous session. Technical analysis suggests a potential trend reversal after a strong downtrend. Institutional holdings have increased, with MF holding at 14.16% and FII holding at 8.81% as of September quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1732685944000,
            "Source": "normal_news"
        },
        {
            "Title": "Bata India: Stock Rises 1.91% Amid Market Upturn",
            "Summary": "Bata India shares are trading at ₹1328.55, up 1.91% from the previous close. The stock has hit a high of ₹1329.05 and a low of ₹1304.05 today. The broader market is also positive, with Nifty up 1.82% and Sensex up 1.69%. Trading volume is 43.86% lower than the previous session.",
            "Sentiment": "positive",
            "PublishDate": 1732513940000,
            "Source": "normal_news"
        },
        {
            "Title": "Bata India: Share Price Rises Amid Market Uptrend",
            "Summary": "Bata India's share price increased by 0.62% to ₹1289.8 on November 22, 2024. The stock is trading below short and long-term moving averages. Trading volume is 67.93% lower than the previous session. The company has a ROE of 17.71% and ROA of 7.93%. Mutual fund and FII holdings have increased since the June quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1732257252000,
            "Source": "normal_news"
        },
        {
            "Title": "Bata India Optimistic About Consumption Recovery",
            "Summary": "Bata India has expressed optimism regarding consumption recovery in the upcoming quarters, citing momentum from the festive season.",
            "Sentiment": "positive",
            "PublishDate": 1730728504000,
            "Source": "normal_news"
        },
        {
            "Title": "Bata India Reports Q2 EBITDA and Margin Decline",
            "Summary": "Bata India's Q2 EBITDA decreased to 1.75 billion rupees from 1.8 billion rupees year-over-year. The company's EBITDA margin also declined to 20.91% from 22.22% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730727840000,
            "Source": "result"
        },
        {
            "Title": "Bata India Reports Q2 FY2024 Financial Results",
            "Summary": "Bata India announced its Q2 financial results. The company's net profit increased to 523 million rupees, up from 345 million rupees year-over-year, but down from 1.7 billion rupees quarter-over-quarter. Revenue for Q2 was 8.37 billion rupees, slightly higher than the 8.19 billion rupees reported in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730727763000,
            "Source": "result"
        },
        {
            "Title": "Bata India: Stock Dips 1.23% Amid Market Downturn",
            "Summary": "Bata India shares are trading at ₹1340.15, down 1.23% from the previous close. The stock has hit a high of ₹1360.9 and a low of ₹1340.15 today. Trading volume is 4.85% lower than the previous session. The company has a ROE of 17.71% and a P/E of 52.86. Mutual fund holding decreased to 12.84% while FII holding increased to 8.81% in the September quarter.",
            "Sentiment": "negative",
            "PublishDate": 1730698467000,
            "Source": "normal_news"
        }
    ]
}