{
    "Symbol": "BAYERCROP",
    "ISIN": "INE462A01022",
    "News": [
        {
            "Title": "Bayer CropScience wins customs penalty appeal",
            "Summary": "Bayer CropScience Limited successfully overturned a ₹100 million customs penalty through appellate tribunal, with CESTAT setting aside the original order and quashing all demands.",
            "Sentiment": "positive",
            "PublishDate": 1769083592980,
            "Source": "stocks"
        },
        {
            "Title": "Bayer CropScience Receives Revised GST Order with Reduced Penalty",
            "Summary": "Bayer CropScience received a revised order from the Additional Commissioner of Central Tax, GST Commissionerate, Belagavi, Karnataka, reducing the penalty from INR 74 million to INR 31 million. The order relates to GST on Outward Supply for Financial Year 2017-18, and the company is considering exercising its right to appeal the revised order.",
            "Sentiment": "positive",
            "PublishDate": 1764425599991,
            "Source": "stock"
        },
        {
            "Title": "Bayer Crop Science Targets High Single-Digit Revenue Growth with 100 Basis Points Margin Expansion",
            "Summary": "Bayer Crop Science Limited reported 3% revenue growth in the first half driven by strong corn seeds performance despite challenging weather conditions in Q2, with management outlining a strategic framework targeting high single-digit to low double-digit revenue growth over the next 3-5 years. The company expects 100 basis points margin improvement from FY25 base, supported by corn portfolio doubling, new product launches including BICOTA and EtcioStar, and operational efficiency measures including go-to-market optimization in eastern regions.",
            "Sentiment": "positive",
            "PublishDate": 1764337966825,
            "Source": "stock"
        },
        {
            "Title": "Bayer CropScience Presents Strategic Framework and Financial Results at Investor Meet",
            "Summary": "Bayer CropScience held an investor meeting presenting its 5-year strategic framework focused on corn market leadership, rice portfolio scaling, and digital transformation initiatives. The company reported revenue of ₹54,734 million with earnings per share of ₹169, while outlining plans to strengthen market position through new product launches and enhanced go-to-market strategies.",
            "Sentiment": "positive",
            "PublishDate": 1764067141042,
            "Source": "stock"
        },
        {
            "Title": "Bayer Cropscience Declares Rs. 90 Interim Dividend, Reports Mixed Q2 Results",
            "Summary": "Bayer Cropscience announced an interim dividend of Rs. 90 per share. The company reported Q2 EBITDA of Rs. 2.05 billion compared to Rs. 1.8 billion year-over-year, with EBITDA margin improving to 13.22% from 10.58%. Net profit increased to Rs. 1.53 billion from Rs. 1.36 billion year-over-year. However, Q2 revenue declined to Rs. 15.5 billion from Rs. 17.4 billion in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1762516499666,
            "Source": "corporate_action"
        },
        {
            "Title": "Bayer CropScience Receives Rs. 37.41 Million GST Penalty from Central Tax Authority",
            "Summary": "Bayer CropScience Ltd has received a penalty order of Rs. 37.41 million from the Office of the Commissioner of Central Tax, Guntur, Andhra Pradesh. The penalty relates to GST on Outward Supply for Financial Year 2018-19. The company received the order on October 21, 2025, and stated that it is currently appealable with plans to assess exercising their right to appeal.",
            "Sentiment": "negative",
            "PublishDate": 1761126479610,
            "Source": "stock"
        },
        {
            "Title": "Bayer CropScience CEO Cautious on FY26 Outlook Despite India Market Potential",
            "Summary": "Bayer CropScience CEO Simon-Thorsten Wiebusch expressed cautious optimism about FY26 outlook, citing above-average monsoons and India's untapped agricultural market potential. The year started strong with early monsoon boosting first quarter performance, but rainfall has since been inconsistent and erratic. Wiebusch noted that September will determine kharif season success, while Rabi outlook appears positive with well-filled dams and stable commodity prices for farmers. He emphasized India's significant growth potential as an under-penetrated market compared to other countries. However, he cautioned that external factors beyond traditional monsoon patterns increasingly influence sector performance. Regarding industry concerns about gross margin pressure from glyphosate pricing, Wiebusch indicated the worst may be over, suggesting the company has hit bottom in terms of gross margins on the chemical side. He acknowledged that external factors like industrial overcapacity in China could still impact the Indian market.",
            "Sentiment": "neutral",
            "PublishDate": 1756881955410,
            "Source": "stock"
        },
        {
            "Title": "Bayer CropScience Reports Strong Q1 Growth with Revenue Rising to 19 Billion Rupees",
            "Summary": "Bayer CropScience delivered robust quarterly performance with revenue increasing to 19 billion rupees from 16.3 billion rupees in the previous year. Net profit grew to 2.8 billion rupees compared to 2.5 billion rupees year-over-year. EBITDA rose to 3.48 billion rupees from 3.14 billion rupees, though EBITDA margin declined slightly to 18.2% from 19.3% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1754470483900,
            "Source": "earnings"
        },
        {
            "Title": "Bayer CropScience Ltd: Shares Surge 13% on Strong Q4 Earnings",
            "Summary": "Bayer CropScience Ltd reported a 49.27% increase in Q4 net profit to ₹143 crore, with revenue up 32.1% to ₹1,046.4 crore. EBITDA rose 75.4% to ₹170.8 crore, and margins expanded to 16.3%. The board recommended a final dividend of ₹35 per share.",
            "Sentiment": "positive",
            "PublishDate": 1748325619000,
            "Source": "earnings"
        },
        {
            "Title": "Bayer CropScience: Q4 Profit Surges 49%, Declares Rs 35 Dividend",
            "Summary": "Bayer CropScience reported a 49% YoY increase in Q4FY25 PAT to Rs 143.30 crore. Revenue from operations rose to Rs 1,046.4 crore. The board recommended a dividend of Rs 35 per share. For FY 2024-25, revenue increased to Rs 5473.4 crore. The company faced challenges including unpredictable monsoons and higher input costs.",
            "Sentiment": "positive",
            "PublishDate": 1748325613000,
            "Source": "result"
        },
        {
            "Title": "Bayer Cropscience Reports Q4 Profit and Revenue Growth, Announces Dividend",
            "Summary": "Bayer Cropscience reported a Q4 net profit of 1.4 billion rupees, up from 960 million rupees year-over-year and 342 million rupees quarter-over-quarter. Q4 revenue increased to 10.5 billion rupees from 7.92 billion rupees year-over-year. The company has recommended a final dividend of 35 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1748304339000,
            "Source": "default"
        },
        {
            "Title": "Bayer CropScience Recommends Final Dividend",
            "Summary": "Bayer CropScience has recommended a final dividend of 35 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1748266441000,
            "Source": "result"
        },
        {
            "Title": "Bayer CropScience Reports Q4 Financial Results",
            "Summary": "Bayer CropScience has announced its financial results for the fourth quarter. The company's net profit increased to 1.4 billion rupees, up from 960 million rupees year-over-year and 342 million rupees quarter-over-quarter. Revenue for Q4 rose to 10.5 billion rupees, compared to 7.92 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748265603000,
            "Source": "result"
        },
        {
            "Title": "Bayer Cropscience Reports Q3 Financial Results",
            "Summary": "Bayer Cropscience has announced its financial results for the third quarter. The company reported a net profit of 342 million rupees, which is a significant decrease from 931 million rupees in the same quarter of the previous year. However, revenue increased to 10.6 billion rupees from 9.55 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739320468000,
            "Source": "earnings"
        },
        {
            "Title": "Bayer CropScience Reports Significant Decline in Q3 EBITDA",
            "Summary": "Bayer CropScience has reported a substantial decrease in its Q3 EBITDA, which fell to 197 million rupees from 1.28 billion rupees in the same quarter last year. The company's EBITDA margin also dropped significantly, declining to 1.86% from 13.39% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739280845000,
            "Source": "earnings"
        },
        {
            "Title": "Bayer CropScience Reports Significant Decline in Q3 Net Profit",
            "Summary": "Bayer CropScience has reported its financial results for the third quarter. The company's net profit decreased to 342 million rupees from 931 million rupees in the same period last year, marking a substantial year-over-year decline. However, revenue showed growth, increasing to 10.6 billion rupees from 9.55 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1739280838000,
            "Source": "earnings"
        },
        {
            "Title": "Bayer CropScience: Rs.90 Interim Dividend, Record Date Revised",
            "Summary": "Bayer CropScience declares Rs.90 per share interim dividend. Record date revised to November 28, 2024, due to a trading holiday. Dividend to be paid on December 11, 2024. Company reports 38.85% decline in Q2 net profit to Rs 136.3 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1732075462000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bayer CropScience Declares Interim Dividend",
            "Summary": "Bayer CropScience has announced an interim dividend of 90 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1731501858000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bayer CropScience Reports Decline in Q2 EBITDA",
            "Summary": "Bayer CropScience's Q2 EBITDA decreased to 1.8 billion rupees from 3 billion rupees year-over-year. The company's EBITDA margin also fell to 10.58% from 18.85% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731501795000,
            "Source": "result"
        },
        {
            "Title": "Bayer CropScience Reports Q2 Revenue Increase",
            "Summary": "Bayer CropScience has announced its Q2 revenue, which has risen to 17.4 billion rupees from 16 billion rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731501669000,
            "Source": "result"
        },
        {
            "Title": "Bayer CropScience Reports Q2 Net Profit Decline",
            "Summary": "Bayer CropScience's Q2 standalone net profit decreased to 1.36 billion rupees, down from 2.2 billion rupees year-over-year. The profit also declined sequentially from 2.5 billion rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1731501606000,
            "Source": "result"
        }
    ]
}