{
    "Symbol": "BBL",
    "ISIN": "INE464A01036",
    "News": [
        {
            "Title": "Bharat Bijlee Q3 FY26 Results: Revenue Up 10.62%",
            "Summary": "Bharat Bijlee Limited reported Q3 FY26 revenue of ₹568.37 crores, up 10.62% YoY. Net profit declined 39.24% to ₹24.68 crores due to higher expenses.",
            "Sentiment": "neutral",
            "PublishDate": 1770648375582,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharat Bijlee Shareholders Approve Borrowing Limit Increase and Asset Charge Creation",
            "Summary": "Bharat Bijlee Limited shareholders approved two special resolutions through postal ballot voting concluded on November 27, 2025, including increasing the company's borrowing limits under Section 180(1)(c) and creating charges on movable securities for borrowings under Section 180(1)(a) of the Companies Act, 2013. Both resolutions passed with 99.52% votes in favor, with 54,52,719 shares participating in the voting process out of 58,99,204 total shares held by 44,562 shareholders as of the cut-off date.",
            "Sentiment": "positive",
            "PublishDate": 1764319337009,
            "Source": "corporate_action"
        },
        {
            "Title": "Bharat Bijlee Seeks Shareholder Approval to Increase Borrowing Limit to ₹1,500 Crores",
            "Summary": "Bharat Bijlee Limited has issued a postal ballot notice seeking shareholder approval for two special resolutions. The company proposes to increase its borrowing limit from ₹650 crores to ₹1,500 crores under Section 180(1)(c) of the Companies Act, 2013. Additionally, it seeks approval to create charges on movable and other securities up to ₹1,500 crores to secure these borrowings under Section 180(1)(a). The company states this increase is needed to address higher non-fund based bank facilities requirements, including bank guarantees for business operations and planned substantial expansion of transformer manufacturing capacity. The remote e-voting period runs from October 29, 2025 to November 27, 2025, with results to be declared by November 29, 2025. The cut-off date for voting eligibility is October 24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761562917739,
            "Source": "corporate_action"
        },
        {
            "Title": "Bharat Bijlee Reports Strong Q2 Growth with Revenue Up 20% to 4.73B Rupees",
            "Summary": "Bharat Bijlee delivered strong quarterly performance with revenue rising to 4.73 billion rupees from 3.94 billion rupees year-over-year. Net profit increased significantly to 282 million rupees compared to 188 million rupees in the same period last year. EBITDA grew to 348 million rupees from 217 million rupees, while EBITDA margin improved to 7.35% from 5.5% year-over-year, indicating enhanced operational efficiency alongside revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1760602818216,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Bijlee Approves ₹65 Crore Investment to Expand Transformer Capacity by 7,000 MVA at Airoli Plant",
            "Summary": "Bharat Bijlee has approved a ₹65 crore investment to increase transformer capacity at its Airoli plant by 7,000 MVA. This expansion will bring the total capacity expansion to 17,000 MVA at the facility.",
            "Sentiment": "positive",
            "PublishDate": 1756104792845,
            "Source": "stock"
        },
        {
            "Title": "Bharat Bijlee Sets September 4, 2025 as Record Date for Dividend Payment",
            "Summary": "Bharat Bijlee Limited's Board of Directors has fixed September 4, 2025 as the record date for dividend payment on equity shares for Financial Year 2024-2025. The decision was made during a board meeting held on July 23, 2025. The company has notified both BSE and NSE about this record date determination.",
            "Sentiment": "positive",
            "PublishDate": 1753284081691,
            "Source": "corporate_action"
        },
        {
            "Title": "Bharat Bijlee Shares Drop 7% Following Mixed Quarterly Results",
            "Summary": "Bharat Bijlee shares fell 7% following the release of quarterly results. The transformer manufacturer reported revenue growth of 24% year-on-year to ₹465 crore, but revenue declined 25% sequentially from the March quarter. EBITDA increased 14.4% year-on-year to ₹33.7 crore but dropped over 45% sequentially. EBITDA margin contracted to 7.3% from 7.9% year-on-year and fell nearly 300 basis points sequentially. Net profit grew 16.7% year-on-year to ₹28 crore but declined 44% from the March quarter. The stock closed 6.5% lower at ₹3,060 and has declined 20% in 2025, though it had gained nearly 20% in the previous month.",
            "Sentiment": "negative",
            "PublishDate": 1753272081451,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Bijlee Reports 17% Growth in Net Profit for Q1",
            "Summary": "Bharat Bijlee reported quarterly net profit of 280 million rupees compared to 239 million rupees in the same period last year. Revenue increased to 4.6 billion rupees from 3.74 billion rupees year-over-year. EBITDA rose to 336 million rupees from 294 million rupees, though EBITDA margin declined to 7.23% from 7.9% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753259340301,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Bijlee Reports Q4 Results and Recommends Dividend",
            "Summary": "Bharat Bijlee has announced its Q4 financial results and dividend recommendation. The company's Q4 revenue increased to 6.19 billion rupees from 5.87 billion rupees year-over-year. Q4 EBITDA rose to 633.9 million rupees from 617.5 million rupees, although the EBITDA margin decreased slightly to 10.24% from 10.51%. Net profit for Q4 improved to 503.1 million rupees, up from 485 million rupees in the previous year and 406.2 million rupees in the previous quarter. The company has recommended a dividend of 35 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747399559000,
            "Source": "result"
        },
        {
            "Title": "Bharat Bijlee Reports Improved Q3 EBITDA and Margin",
            "Summary": "Bharat Bijlee has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 530 million rupees from 389 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 10.31% from 9.20% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738661906000,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Bijlee Reports Q3 Revenue Growth",
            "Summary": "Bharat Bijlee has announced its third quarter revenue results. The company reported revenue of 5.1 billion rupees, compared to 4.2 billion rupees in the same quarter of the previous year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738661895000,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Bijlee Reports 37% Increase in Q3 Net Profit",
            "Summary": "Bharat Bijlee, an Indian engineering company, has announced its financial results for the third quarter. The company reported a net profit of 406 million rupees, compared to 297 million rupees in the same period last year, representing a year-over-year increase of approximately 37%.",
            "Sentiment": "positive",
            "PublishDate": 1738661821000,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Bijlee Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Bharat Bijlee, an Indian engineering company, has reported a significant decrease in its Q2 EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the current fiscal year. The EBITDA dropped to 220 million rupees from 384 million rupees in the same quarter of the previous year. Additionally, the company's EBITDA margin contracted to 5.58% from 9.17% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731054185000,
            "Source": "result"
        },
        {
            "Title": "Bharat Bijlee Reports Q2 Revenue Decline",
            "Summary": "Bharat Bijlee, an Indian engineering company, has reported its second-quarter revenue for the current fiscal year. The company's revenue stood at 4 billion rupees, down from 4.19 billion rupees in the same quarter of the previous year, indicating a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731054049000,
            "Source": "result"
        },
        {
            "Title": "Bharat Bijlee Reports Q2 Net Profit Decline",
            "Summary": "Bharat Bijlee, an Indian company, has reported a net profit of 188 million rupees for the second quarter, down from 279 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731054030000,
            "Source": "result"
        }
    ]
}