{
    "Symbol": "BBOX",
    "ISIN": "INE676A01027",
    "News": [
        {
            "Title": "Black Box Subsidiary Acquires 2S for Rs. 275 Crores",
            "Summary": "Black Box Limited's step-down subsidiary Black Box Do Brasil has entered into a definitive agreement to acquire Brazilian IT solutions integrator 2S Inovações Tecnológicas for Rs. 275 Crores.",
            "Sentiment": "positive",
            "PublishDate": 1770865434412,
            "Source": "co_actions_results"
        },
        {
            "Title": "Black Box Ltd Allots 8,179 Shares to Manish Agarwal",
            "Summary": "Black Box Limited allotted 8,179 equity shares to Manish Agarwal at Rs. 417 per share through warrant conversion, raising Rs. 34.11 lakh. The allotment increases paid-up capital to Rs. 34.10 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1770832179282,
            "Source": "co_actions_results"
        },
        {
            "Title": "Black Box Board Meeting Set for February 11, 2026",
            "Summary": "Black Box Limited schedules board meeting on February 11, 2026, to consider and approve Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770356442824,
            "Source": "co_actions_results"
        },
        {
            "Title": "Black Box Auditor Firm Converts to LLP Structure",
            "Summary": "Black Box Limited announces statutory auditor M S K A & Associates has converted to LLP structure while continuing audit services for remaining tenure period.",
            "Sentiment": "neutral",
            "PublishDate": 1768569804456,
            "Source": "stocks"
        },
        {
            "Title": "Black Box Limited Allots 1.29 Lakh Equity Shares",
            "Summary": "Black Box Limited allotted 1,29,499 equity shares to Ushma Mehta following warrant conversion at ₹417 per share, raising ₹5.40 crores and increasing paid-up capital to ₹34.10 crores.",
            "Sentiment": "positive",
            "PublishDate": 1767937088762,
            "Source": "co_actions_results"
        },
        {
            "Title": "BlackBox Limited Allots 1,27,901 Equity Shares Following Warrant Conversion by Ushma Mehta",
            "Summary": "BlackBox Limited allotted 1,27,901 equity shares at Rs. 417 per share to Ushma Mehta following conversion of convertible warrants, raising Rs. 5.33 crore. The allotment increases the company's paid-up capital from Rs. 34.03 crore to Rs. 34.06 crore, with 72,14,155 warrants still outstanding for conversion.",
            "Sentiment": "neutral",
            "PublishDate": 1764309340302,
            "Source": "corporate_action"
        },
        {
            "Title": "Black Box Limited Reports 14% Sequential Revenue Growth in Q2 FY26, Secures Strategic Wind River Partnership",
            "Summary": "Black Box Limited achieved revenue of INR 1,585 crore in Q2 FY26 with 14% quarter-on-quarter growth and secured a strategic partnership with Wind River expected to generate INR 1,350 crore over 5 years. The company maintains strong order booking momentum with backlog at $555 million and remains confident of achieving $1 billion full-year order booking target, expecting H2 FY26 to outperform H1.",
            "Sentiment": "positive",
            "PublishDate": 1763466337521,
            "Source": "earnings"
        },
        {
            "Title": "Black Box Projects EBITDA Margins of 9-9.5% for FY'26, Eyes 10% in FY'27",
            "Summary": "Black Box forecasts EBITDA margins between 9-9.5% for FY'26 with potential rise to 10% in FY'27, while expecting sequential quarterly growth of 12-15% for FY'26. The company anticipates a stronger second half of FY'26 driven by healthy order book and improved regional pipeline visibility.",
            "Sentiment": "positive",
            "PublishDate": 1763092606854,
            "Source": "earnings"
        },
        {
            "Title": "BlackBox Limited Reports No Deviation in Rs 386.36 Crore Warrant Issue Proceeds Utilization",
            "Summary": "BlackBox Limited's monitoring agency CARE Ratings reported no deviation from stated objectives in the utilization of proceeds from the company's Rs 386.36 crore warrant issue for the quarter ended September 30, 2025. The company had originally planned to raise Rs 410 crore through 98.32 lakh warrants but received Rs 386.36 crore due to undersubscription, with 92.65 lakh warrants allotted at Rs 417 each. The company revised its fund allocation through a special resolution in March 2025, allocating Rs 241.36 crore for subsidiary investments, Rs 45 crore for general corporate purposes, and Rs 100 crore for working capital requirements. As of September 30, 2025, Rs 153.34 crore was received and Rs 141.22 crore was utilized, with Rs 223.02 crore remaining unutilized. The unutilized funds of Rs 223.80 crore were deployed in fixed deposits with IDBI Bank and Bank of Maharashtra, earning returns between 4.20% to 4.50%. Working capital utilization included vendor payments of Rs 6.42 crore, employee salary payments of Rs 11.22 crore, and statutory payments of Rs 2.79 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1763027164987,
            "Source": "corporate_action"
        },
        {
            "Title": "BlackBox Limited Reports Q2 Results and Allots 47,962 Equity Shares Through Warrant Conversion",
            "Summary": "BlackBox Limited's Board approved unaudited financial results for the quarter and half-year ended September 30, 2025. The company allotted 47,962 equity shares of Rs. 2 each at a premium of Rs. 415 per share to Ushma Mehta through conversion of convertible warrants, raising Rs. 2 crores. This increased the company's paid-up capital from Rs. 34.02 crores to Rs. 34.03 crores. The company has 73,42,056 warrants outstanding for conversion. Consolidated revenue from operations was Rs. 1,587.25 crores for Q2 compared to Rs. 1,396.64 crores in the previous year quarter. Net profit for Q2 was Rs. 55.85 crores versus Rs. 50.28 crores in the corresponding quarter last year. The company faces delays in foreign exchange compliance with outstanding amounts of Rs. 33.24 crores in import payments and Rs. 8.09 crores in export proceeds repatriation beyond stipulated timelines.",
            "Sentiment": "positive",
            "PublishDate": 1762949321823,
            "Source": "earnings"
        },
        {
            "Title": "Black Box Reports Higher Q2 Profit and Revenue with Improved Margins",
            "Summary": "Black Box reported consolidated net profit of 556.5 million rupees for Q2, up from 511.4 million rupees in the same period last year. Revenue increased to 15.85 billion rupees from 14.97 billion rupees year-over-year. EBITDA rose to 1.43 billion rupees compared to 1.33 billion rupees previously. The company's EBITDA margin improved to 9.05% from 8.86% in the prior year period.",
            "Sentiment": "positive",
            "PublishDate": 1762947179014,
            "Source": "earnings"
        },
        {
            "Title": "Black Box Partners With Wind River for Edge and Cloud Innovation, Targets Rs. 1,350 Crore Revenue Over Five Years",
            "Summary": "Black Box has formed a partnership with Wind River to focus on global edge and cloud innovation initiatives. The company has set a revenue target of approximately Rs. 1,350 crore over a five-year period through this collaboration.",
            "Sentiment": "positive",
            "PublishDate": 1759460716461,
            "Source": "order&deals"
        },
        {
            "Title": "Black Box Reports Mixed Q1 Results with Profit Growth Despite Revenue Decline",
            "Summary": "Black Box reported Q1 consolidated net profit of 474 million rupees, up from 371 million rupees year-over-year. However, the company's revenue declined to 13.87 billion rupees from 14.23 billion rupees in the same period last year. EBITDA decreased to 1.05 billion rupees from 1.19 billion rupees year-over-year, while EBITDA margin compressed to 7.56% from 8.34% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1755103935707,
            "Source": "earnings"
        },
        {
            "Title": "BlackBox Limited Approves Quarterly Results and Sets 39th AGM Date for September 16, 2025",
            "Summary": "BlackBox Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, and scheduled the 39th Annual General Meeting for September 16, 2025. The company reported standalone revenue of Rs. 75.99 crores and net profit of Rs. 1.16 crores for the quarter. The Board recommended a final dividend of Rs. 1 per equity share for FY2024-25, with record date set as August 29, 2025. Additionally, the company allotted 1,03,950 equity shares under ESOP and 84,189 equity shares through warrant conversion to non-promoters Ushma Mehta and Ava Vaidya for Rs. 3.51 crores. The Board also approved re-appointments of Deepak Kumar Bansal as Executive Director & CFO and Neha Nagpal as Independent Director, along with appointment of M/s. Makarand M. Joshi & Co. as Secretarial Auditors for a 5-year term.",
            "Sentiment": "positive",
            "PublishDate": 1755103816054,
            "Source": "corporate_action"
        },
        {
            "Title": "Black Box Announces Estimated Growth Projections for FY26",
            "Summary": "Black Box has released estimated growth projections for the fiscal year 2026. The company anticipates EBITDA growth of 14%-22% year-over-year, and PAT growth of 29%-39% year-over-year. Additionally, Black Box has provided an estimated revenue guidance of Rs. 6,750 – 7,000 crore for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1748400224000,
            "Source": "default"
        },
        {
            "Title": "Black Box Targets Double-Digit EBITDA Margin by FY27",
            "Summary": "According to an investor presentation, Black Box plans to continue focusing on quality of revenue to improve its EBITDA margin in FY26. The company is aiming to achieve a double-digit EBITDA margin by the end of FY27.",
            "Sentiment": "positive",
            "PublishDate": 1748399978000,
            "Source": "default"
        },
        {
            "Title": "Black Box Recommends Final Dividend of 1 Rupee per Share",
            "Summary": "Black Box has recommended a final dividend of 1 rupee per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1748347169000,
            "Source": "result"
        },
        {
            "Title": "Black Box Reports Q4 Financial Results",
            "Summary": "Black Box has released its Q4 financial results. The company's EBITDA increased to 1.47 billion rupees from 1.25 billion rupees year-over-year. EBITDA margin improved to 9.54% from 8.44%. Revenue rose to 15.45 billion rupees from 14.80 billion rupees. Consolidated net profit grew to 604.7 million rupees from 409 million rupees year-over-year and 560.8 million rupees quarter-over-quarter. The company reported an exceptional loss item of 163 million rupees compared to 89.7 million rupees in the previous year. Profit before tax (PBT) increased to 740.8 million rupees from 558.6 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748347162000,
            "Source": "result"
        },
        {
            "Title": "Black Box Reports Record Q4 Order Wins of INR 1,550 Crore",
            "Summary": "Black Box has announced its strongest quarterly performance for the fiscal year 2025, with order wins totaling INR 1,550 crore in the fourth quarter. This achievement marks a significant milestone for the company, indicating robust growth and potentially improved financial outlook.",
            "Sentiment": "positive",
            "PublishDate": 1745473259000,
            "Source": "default"
        },
        {
            "Title": "Black Box Reports Improved Q3 EBITDA and Margin",
            "Summary": "Black Box has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 1.14 billion rupees to 1.43 billion rupees. Additionally, the EBITDA margin expanded from 6.89% to 9.52%, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739262691000,
            "Source": "earnings"
        },
        {
            "Title": "Black Box Reports Q3 Revenue Decline",
            "Summary": "Black Box, a technology company, has reported its third-quarter revenue. The company's revenue for Q3 stood at 15 billion rupees, showing a year-over-year decrease from 16.5 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1739262682000,
            "Source": "earnings"
        },
        {
            "Title": "Black Box Reports Increased Q3 Consolidated Net Profit",
            "Summary": "Black Box has reported a consolidated net profit of 561 million rupees for the third quarter, showing a significant increase from 408 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739262637000,
            "Source": "earnings"
        },
        {
            "Title": "Black Box Secures ₹250 Crore Order from Hyperscaler Customer",
            "Summary": "Black Box has won orders worth ₹250 crore from a long-term hyperscaler customer. The company continues to strengthen its position in powering next-generation digital infrastructure with order wins across various industry verticals.",
            "Sentiment": "positive",
            "PublishDate": 1738210511000,
            "Source": "order&deals"
        },
        {
            "Title": "Black Box Ltd Invests in Digital Infrastructure Innovation",
            "Summary": "Black Box Ltd is investing in innovation delivery, focusing on developing new digital infrastructure solutions. The company's key areas of investment include cloud computing, cyber security, and artificial intelligence, as revealed in a recent conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1731382043000,
            "Source": "corporate_action"
        },
        {
            "Title": "Black Box Ltd Aims for 10% Operating Margin and Large Deal Pipeline",
            "Summary": "Black Box Ltd has announced expectations for improved performance, targeting a sustainable 10% operating margin. The company anticipates converting large deals in their pipeline into substantial order books, which is expected to drive revenue growth starting from fiscal year 2026.",
            "Sentiment": "positive",
            "PublishDate": 1731381877000,
            "Source": "normal_news"
        },
        {
            "Title": "Black Box Ltd Expects Project Backlog Growth",
            "Summary": "Black Box Ltd anticipates an increase in its project backlog due to various revenue growth initiatives, particularly focusing on the expanding digital infrastructure spending in India. This information was shared during a company conference call.",
            "Sentiment": "positive",
            "PublishDate": 1731381746000,
            "Source": "normal_news"
        },
        {
            "Title": "Black Box Reports Strong Q2 EBITDA Growth",
            "Summary": "Black Box has announced its Q2 financial results, showing significant improvement in EBITDA and EBITDA margin. The company's EBITDA increased to 1.32 billion rupees from 986 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 8.9% from 6.27% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731146520000,
            "Source": "result"
        },
        {
            "Title": "Black Box Reports Q2 FY2024 Financial Results",
            "Summary": "Black Box, a technology company, has announced its financial results for the second quarter. The company reported a consolidated net profit of 511 million rupees, up from 320 million rupees in the same quarter last year. However, revenue decreased to 14.9 billion rupees from 15.7 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731146512000,
            "Source": "result"
        }
    ]
}