{
    "Symbol": "BBTC",
    "ISIN": "INE050A01025",
    "News": [
        {
            "Title": "Bombay Burmah Trading Corporation Terminates MSTC Limited Agreement Following Failed Online Bidding",
            "Summary": "Bombay Burmah Trading Corporation has ended its agreement with MSTC Limited after an unsuccessful online bidding process. The company states that this termination will not have any significant impact on its business plans or operations.",
            "Sentiment": "neutral",
            "PublishDate": 1763451873790,
            "Source": "corporate_action"
        },
        {
            "Title": "Bombay Burmah Trading Corporation Receives Credit Rating Assignments and Affirmations from Crisil and India Ratings",
            "Summary": "Crisil assigned AA-/Stable long-term and A1 short-term ratings to Bombay Burmah Trading Corporation's Rs 117 crore bank loan facilities, while India Ratings affirmed the company's existing ratings at IND AA-/Stable/IND A1 for bank facilities and IND A1 for commercial paper. The ratings reflect sustained improvement in the company's consolidated liquidity and credit profile, supported by substantial debt reduction through asset monetization and consistent dividend income from subsidiary Britannia Industries Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1763174670099,
            "Source": "earnings"
        },
        {
            "Title": "Bombay Burmah Trading Schedules Q2 Results Review for November 14",
            "Summary": "Bombay Burmah Trading will consider its Q2 results on November 14. The company has scheduled this date for reviewing its quarterly financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1762532143583,
            "Source": "earnings"
        },
        {
            "Title": "Bombay Burmah Trading Corporation Seeks Shareholder Approval for Independent Woman Director Appointment",
            "Summary": "The Bombay Burmah Trading Corporation Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Ms. Rukhshana Jina Mistry as a Non-Executive Independent Woman Director. Ms. Mistry, a Chartered Accountant with over 32 years of experience, was appointed as Additional Director by the Board with effect from August 26, 2025. The proposed appointment is for a five-year term from August 26, 2025 to August 25, 2030. She currently serves as Independent Director on boards of Sterling And Wilson Renewable Energy Ltd, Allied Blenders & Distillers Ltd, and Afcons Infrastructure Ltd. The e-voting period runs from September 9 to October 8, 2025, with results to be declared by October 10, 2025. The cut-off date for determining eligible shareholders is September 5, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757336636232,
            "Source": "corporate_action"
        },
        {
            "Title": "Bombay Burmah Trading Corporation Appoints Rukhshana Jina Mistry as Independent Woman Director",
            "Summary": "The Bombay Burmah Trading Corporation Limited appointed Ms. Rukhshana Jina Mistry as an Additional Director in the category of Non-Executive Independent Woman Director for a five-year term from August 26, 2025 to August 25, 2030. The appointment was approved by the Board of Directors based on the Nomination and Remuneration Committee's recommendation and is subject to shareholder approval through postal ballot. Ms. Mistry is a Chartered Accountant with over 32 years of experience in accounting, auditing, taxation, and company law. She currently serves as an Independent Director on boards of Sterling And Wilson Renewable Energy Ltd, Allied Blenders & Distillers Ltd, and Afcons Infrastructure Ltd. She also holds directorships in various foreign subsidiaries of Sterling And Wilson group and serves on multiple board committees including Audit, Nomination and Remuneration, Stakeholder Relationship, and Risk Management Committees. Ms. Mistry is not related to any existing directors of the corporation and is not debarred from holding directorship positions.",
            "Sentiment": "positive",
            "PublishDate": 1756042385573,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bombay Burmah Trading Corp Reports Mixed Q1 Results with Revenue Growth and Margin Decline",
            "Summary": "Bombay Burmah Trading Corp reported Q1 consolidated net profit of 2.41 billion rupees, up from 2.2 billion rupees year-over-year. Revenue increased to 47 billion rupees from 43.3 billion rupees in the same period last year. However, EBITDA declined to 7.24 billion rupees from 7.35 billion rupees year-over-year, while EBITDA margin compressed to 15.37% from 16.98% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754987491634,
            "Source": "earnings"
        },
        {
            "Title": "Bombay Burmah Trading Corporation Partners with MSTC Ltd for Property Sales Through E-Auction Platform",
            "Summary": "The Bombay Burmah Trading Corporation Limited has entered into an agreement with MSTC Ltd. to engage them as a selling agent for the sale of immovable properties and land through MSTC's e-auction website www.mstcecommerce.com. The agreement was executed on August 7th, 2025. The company disclosed that MSTC Ltd. has no shareholding in the corporation and is not related to the promoter/promoter group. The transaction does not fall within related party transactions. The partnership aims to facilitate property sales through MSTC's digital auction platform.",
            "Sentiment": "neutral",
            "PublishDate": 1754576093641,
            "Source": "stock"
        },
        {
            "Title": "Bombay Burmah Trading Corp Partners with MSTC as Selling Agent",
            "Summary": "Bombay Burmah Trading Corp has formed a partnership with MSTC, engaging them as a selling agent through a new agreement. The partnership establishes MSTC in a sales representation role for Bombay Burmah Trading Corp.",
            "Sentiment": "positive",
            "PublishDate": 1754575169332,
            "Source": "order&deals"
        },
        {
            "Title": "Bombay Burmah Trading Corp Reports Q4 Financial Results",
            "Summary": "Bombay Burmah Trading Corp has released its Q4 financial results. The company's EBITDA increased to 8 billion rupees from 7.6 billion rupees year-over-year. However, the EBITDA margin decreased to 17.75% from 18.33% in the same period. The consolidated net profit rose to 3.1 billion rupees from 2.8 billion rupees, while revenue grew to 45.2 billion rupees from 41.62 billion rupees compared to the previous year's quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747319573000,
            "Source": "result"
        },
        {
            "Title": "Bombay Burmah Trading Corp to Consider Q4 Results on May 15",
            "Summary": "Bombay Burmah Trading Corporation has announced that it will consider its fourth quarter financial results on May 15. This is a standard corporate procedure where the company's board will review and approve the financial statements for the last quarter of their fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1746793120000,
            "Source": "default"
        },
        {
            "Title": "Bombay Burmah Trading Corporation: Penny Stock Skyrockets 23,218% in 22 Years",
            "Summary": "Bombay Burmah Trading Corporation's stock price has risen from ₹7.60 in 2003 to ₹1,772 in 2025, a 23,218% increase. The company recently declared a second interim dividend of ₹4 per share for FY25, with a record date of March 27. The company also sold land in Kanyakumari District for ₹36.47 crore.",
            "Sentiment": "positive",
            "PublishDate": 1742711852000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bombay Burmah Trading Corporation Approves Interim Dividend",
            "Summary": "Bombay Burmah Trading Corporation has approved an interim dividend of 4 rupees per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1742546781000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bombay Burmah Trading Corporation Completes Land Sale in Tamil Nadu",
            "Summary": "Bombay Burmah Trading Corporation has successfully completed a land sale transaction in Tamil Nadu, India. The sale was valued at 36.47 crore rupees (approximately $4.4 million USD).",
            "Sentiment": "positive",
            "PublishDate": 1742262384000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bombay Burmah Trading Corp Approves Land Sale in Tamil Nadu",
            "Summary": "The board of Bombay Burmah Trading Corporation has approved the sale of land located in Tamil Nadu to Annai Group. This decision represents a significant corporate action involving the company's real estate assets.",
            "Sentiment": "neutral",
            "PublishDate": 1742202815000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bombay Burmah Trading Corp Reports Q3 Financial Results and Dividend",
            "Summary": "Bombay Burmah Trading Corp announced its Q3 consolidated net profit of 3.4 billion rupees, down from 3.9 billion rupees year-over-year but up from 2.5 billion rupees quarter-over-quarter. Q3 revenue increased to 45.5 billion rupees from 43.4 billion rupees year-over-year. The company also declared a dividend of 13 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1739405762000,
            "Source": "earnings"
        },
        {
            "Title": "Bombay Burmah Trading Corporation Declares Dividend",
            "Summary": "Bombay Burmah Trading Corporation has announced a dividend of 13 rupees per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1739368817000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bombay Burmah Trading Corp Reports Improved Q3 EBITDA and Margin",
            "Summary": "Bombay Burmah Trading Corporation has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 8.7 billion rupees, up from 8 billion rupees in the same quarter last year. Additionally, the EBITDA margin improved to 18.66% from 18.43% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739368775000,
            "Source": "earnings"
        },
        {
            "Title": "Bombay Burmah Trading Corp Reports Q3 Financial Results",
            "Summary": "Bombay Burmah Trading Corp announced its Q3 consolidated net profit of 3.4 billion rupees, compared to 3.9 billion rupees year-over-year and 2.5 billion rupees quarter-over-quarter. The company's Q3 revenue increased to 45.5 billion rupees from 43.4 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739368694000,
            "Source": "earnings"
        },
        {
            "Title": "Bombay Burmah Trading Corp Settles Regulatory Violation Case with SEBI",
            "Summary": "Bombay Burmah Trading Corporation and 17 other entities have reached a settlement with the Securities and Exchange Board of India (SEBI) regarding violations of acquisition and takeover regulations. The specific details of the violations or the settlement terms are not provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1736727731000,
            "Source": "corporate_governance"
        },
        {
            "Title": "SEBI Settlement with Bombay Burmah Trading Corp and Others",
            "Summary": "The Securities and Exchange Board of India (SEBI) has reached a settlement with Bombay Burmah Trading Corporation and 17 other entities regarding violations of acquisitions and takeovers regulations. The specifics of the violations and the terms of the settlement are not provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1736508443000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bombay Burmah Sells Phase 3 Land in Tamil Nadu",
            "Summary": "Bombay Burmah Trading Corporation has executed a sale deed for approximately 13.91 acres of Phase 3 land in Tamil Nadu. The transaction is valued at 13.05 crore rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1736474104000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bombay Burmah Trading Corp Reports Q2 Financial Results",
            "Summary": "Bombay Burmah Trading Corp has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 is 7.2 billion rupees, compared to 8.6 billion rupees in the same quarter last year. The EBITDA margin has decreased from 19.26% to 15.54% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731597623000,
            "Source": "result"
        },
        {
            "Title": "Bombay Burmah Trading Corp Reports Q2 Revenue Increase",
            "Summary": "Bombay Burmah Trading Corporation has reported its second-quarter revenue for the current fiscal year. The company's revenue reached 47.6 billion rupees, showing an increase from 45 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1731597391000,
            "Source": "result"
        },
        {
            "Title": "Bombay Burmah Trading Corp Reports Strong Q2 Profit Growth",
            "Summary": "Bombay Burmah Trading Corporation has reported a consolidated net profit of 2.5 billion rupees for the second quarter, showing significant year-over-year growth from 1.22 billion rupees. The company also improved its performance quarter-over-quarter, with profits increasing from 2.2 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731597338000,
            "Source": "result"
        }
    ]
}