{
    "Symbol": "BBTCL",
    "ISIN": "INE01EE01011",
    "News": [
        {
            "Title": "B&B Triplewall Board Meet Set for Feb 14, 2026",
            "Summary": "B&B Triplewall Containers has scheduled a board meeting for February 14, 2026, to consider Q3FY26 unaudited financial results. Trading window remains closed until February 16, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770382068147,
            "Source": "co_actions_results"
        },
        {
            "Title": "BB Triplewall Containers Reports Loss of Rs 426.36 Lakhs in Q2 FY2025",
            "Summary": "BB Triplewall Containers Limited posted a net loss of Rs 426.36 lakhs for the quarter ended September 30, 2025, compared to a profit of Rs 361.22 lakhs in the same period last year. The company's revenue from operations declined to Rs 7,529.98 lakhs from Rs 8,221.78 lakhs year-over-year, reflecting challenging operating conditions for the packaging company.",
            "Sentiment": "negative",
            "PublishDate": 1763138394790,
            "Source": "earnings"
        },
        {
            "Title": "B&B Triplewall Containers Reports Strong Q1 Performance with 246.86 Lakh Profit",
            "Summary": "B&B Triplewall Containers Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported a standalone profit after tax of Rs. 246.86 lakhs, compared to Rs. 310.80 lakhs in the same quarter last year. Revenue from operations increased to Rs. 14,928.14 lakhs from Rs. 10,432.45 lakhs year-over-year. On a consolidated basis, the company posted a profit of Rs. 173.91 lakhs versus Rs. 249.61 lakhs in the previous year quarter. The Board also approved the 14th Annual General Meeting scheduled for September 30, 2025, recommended a final dividend of 1.5% per preference share, and appointed new internal and secretarial auditors. The company operates in a single business segment and has a subsidiary, B and B Colour Cartons Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1755177109460,
            "Source": "earnings"
        },
        {
            "Title": "B&B Triplewall Containers Schedules Board Meeting to Consider Dividend Declaration",
            "Summary": "B&B Triplewall Containers Limited has scheduled a board meeting for August 14, 2025, to consider the recommendation or declaration of dividend for the financial year 2024-25. The company notified stock exchanges BSE and NSE about the meeting agenda. Ravi Agarwal, Whole-Time Director & CFO, signed the intimation notice.",
            "Sentiment": "neutral",
            "PublishDate": 1754910811674,
            "Source": "corporate_action"
        }
    ]
}