{
    "Symbol": "BCG",
    "ISIN": "INE425B01027",
    "News": [
        {
            "Title": "Brightcom Group clarifies price movement to exchanges",
            "Summary": "Brightcom Group Limited responds to stock exchange inquiry regarding significant price movement, confirming compliance with SEBI LODR regulations and stating no undisclosed price-sensitive information exists.",
            "Sentiment": "neutral",
            "PublishDate": 1770913262830,
            "Source": "stocks"
        },
        {
            "Title": "Brightcom Group January 2026 Business Update",
            "Summary": "Brightcom Group reports continued operations across programmatic advertising, appoints CFO and COO, receives industry recognition as needle-moving leader, and maintains regulatory compliance for January 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769850370116,
            "Source": "stocks"
        },
        {
            "Title": "Brightcom Group Board Meet Set for Feb 14, 2026",
            "Summary": "Brightcom Group Limited has scheduled a board meeting on February 14, 2026, to consider Q3 FY25-26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769839820110,
            "Source": "co_actions_results"
        },
        {
            "Title": "Brightcom's OMS Featured as Key Player in Industry Report",
            "Summary": "Brightcom Group's subsidiary OMS recognized as 'needle-moving player' in Jounce Media's 2025 industry report, showing 4.9% supply coverage growth in December 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767800734299,
            "Source": "stocks"
        },
        {
            "Title": "Brightcom Group Shares AdTech Business Presentation",
            "Summary": "Brightcom Group releases comprehensive presentation detailing its AdTech business model, operations across 52 global markets, and technology platforms serving over 5,000 advertisers and publishers.",
            "Sentiment": "positive",
            "PublishDate": 1767597104364,
            "Source": "stocks"
        },
        {
            "Title": "Brightcom Group Completes Regulation 76 Compliance",
            "Summary": "Brightcom Group Limited confirms completion of SEBI Regulation 76 compliance for Q1FY26 and Q2FY26, with exchanges expected to cancel proposed Z group movement by December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766465403877,
            "Source": "stocks"
        },
        {
            "Title": "Brightcom Group Reports Strong FY26 Start & Growth",
            "Summary": "Brightcom Group announces strong operational momentum in early FY2026, with 6-8% growth in digital advertising segments and performance tracking towards FY23 record levels.",
            "Sentiment": "positive",
            "PublishDate": 1766113587768,
            "Source": "stocks"
        },
        {
            "Title": "Brightcom Group Withdraws Share Face Value Proposal",
            "Summary": "Brightcom Group Limited withdraws special resolution to alter equity share face value from ₹2 to ₹10 after considering shareholder representations, ahead of upcoming AGM.",
            "Sentiment": "neutral",
            "PublishDate": 1765769780199,
            "Source": "stocks"
        },
        {
            "Title": "Brightcom Group Reports Q2FY26 Results with Revenue of Rs 1,644 Cr, Expands into Defence AI",
            "Summary": "Brightcom Group posted quarterly revenue of Rs 1,644 crores and half-year revenue of Rs 3,099 crores for Q2FY26, while establishing BrightcomDefence as a wholly-owned subsidiary focusing on AI battlefield intelligence and swarm drone management. The AdTech company, serving Fortune 500 clients including Amazon, Visa, Samsung, and Microsoft across 30 countries, is positioning itself at the intersection of digital advertising and defence AI innovation with strategic priorities for FY26-27 including prototype development and technology platform enhancement.",
            "Sentiment": "positive",
            "PublishDate": 1765129439226,
            "Source": "stock"
        },
        {
            "Title": "Brightcom Group Partners With Human Security To Enhance Digital Fraud Prevention",
            "Summary": "Brightcom Group has entered into a partnership with Human Security, Inc. to strengthen digital fraud prevention capabilities. The collaboration aims to improve trust in digital advertising content through enhanced security measures.",
            "Sentiment": "positive",
            "PublishDate": 1764128260117,
            "Source": "order&deals"
        },
        {
            "Title": "Brightcom Group's OMS Unit Partners with Dailymotion Advertising for Global Video Marketing",
            "Summary": "Brightcom Group's wholly owned subsidiary Online Media Solutions has formed a strategic partnership with Dailymotion Advertising to combine premium global audience reach with advanced monetization technology. The partnership, which went live in October 2025, has shown strong early traction and is expected to enhance holiday quarter performance for both companies.",
            "Sentiment": "positive",
            "PublishDate": 1763605241325,
            "Source": "stock"
        },
        {
            "Title": "Brightcom Group Reports Strong Q2 Performance with ₹1,644 Crores Revenue and Launches Defence Subsidiary",
            "Summary": "Brightcom Group Limited reported quarterly consolidated revenue of ₹1,644 crores and profit after tax of ₹233 crores for Q2 FY2025-26, alongside half-year revenue of ₹3,099 crores and PAT of ₹443.9 crores. The company successfully incorporated Brightcom Defence Private Limited as a wholly owned subsidiary and launched its official website, expanding into UAV intelligence systems and defence technologies while strengthening global partnerships across Asia, Americas, and Europe.",
            "Sentiment": "positive",
            "PublishDate": 1763173499281,
            "Source": "earnings"
        },
        {
            "Title": "Brightcom Group Forms Defence Subsidiary and Implements Fund Centralization Strategy",
            "Summary": "Brightcom Group Limited approved the formation of a wholly owned subsidiary, Brightcom Defence Private Limited, to diversify into Defence and Aerospace technologies. The subsidiary will focus on AI-driven command, control and communication systems, decision-support platforms, and autonomous intelligence applications, headquartered in Hyderabad with an initial team of 25-30 specialists expanding to 100 personnel within a year. The Board also approved a centralization mechanism for managing subsidiary funds to improve liquidity visibility, enhance capital efficiency, and support strategic investments. Additionally, the company withdrew three fundraising resolutions from the upcoming Annual General Meeting and ratified an MoU with Project DYNAMO for humanitarian disaster response operations. The Board reviewed H1 FY2025-26 performance, noting continued stability in global AdTech operations with strong advertiser and publisher relationships, while the digital advertising market in key regions showed moderate growth of 6-8%.",
            "Sentiment": "positive",
            "PublishDate": 1760118508733,
            "Source": "corporate_action"
        },
        {
            "Title": "Brightcom Group Partners with Project Dynamo for Defense Systems Agreement",
            "Summary": "Brightcom Group has signed an agreement with Project Dynamo focused on enhancing disaster readiness and civilian strength through high-quality defense systems. The partnership aims to strengthen preparedness capabilities and civilian infrastructure using defense technology solutions.",
            "Sentiment": "positive",
            "PublishDate": 1760062014094,
            "Source": "stock"
        },
        {
            "Title": "SEBI Fines Two Brightcom Group Directors Rs 35 Lakh for Accounting Irregularities",
            "Summary": "SEBI imposed fines of Rs 30 lakh and Rs 5 lakh on two non-executive independent directors of Brightcom Group, Allam Raghunath and Subrato Saha, for irregularities in the company's financial statements from FY15 to FY20. The accounting irregularities artificially inflated profits by Rs 1,280.06 crore during FY 2018-19 and 2019-20, enabling the promoter group to sell shares at inflated prices. The violations included wrongly capitalizing research expenditure and failing to recognize impairment losses on subsidiary investments. Raghunath also submitted false independence declarations starting from FY 2015-16. SEBI rejected the directors' defense arguments, stating their gross negligence deprived investors of accurate financial information and interfered with market price discovery mechanisms.",
            "Sentiment": "negative",
            "PublishDate": 1759758852926,
            "Source": "corporate_governance"
        },
        {
            "Title": "Brightcom Group Postpones AGM to Seek Shareholder Approval for Defence Vertical Expansion",
            "Summary": "Brightcom Group Limited's Board of Directors reviewed progress in their defence vertical during a meeting on 25th September 2025. Key developments include the appointment of a domain advisor, signing an MoU with CQT Weapon Systems (Michigan-based defence manufacturer) for collaboration on tactical hardware and AI-enabled systems, and presentation of a UAV portfolio including mission-ready drones for reconnaissance, strike, and surveillance applications along with a proprietary defence intelligence platform. The Board determined that shareholder approval would be required under the Companies Act, 2013 and SEBI (LODR) Regulations, 2015. Consequently, the company postponed its AGM scheduled for 28th September 2025 to present these matters to shareholders in a consolidated view. A revised AGM date will be announced with proper notice to shareholders. The defence portfolio includes the Maestro OS AI-powered operating system and various UAV platforms including RAVEN, HELIX Series, THUNDERBOLT, TIBURON, and MINI TIBURON designed for military ISR, tactical strikes, and reconnaissance missions.",
            "Sentiment": "positive",
            "PublishDate": 1758819074235,
            "Source": "stock"
        },
        {
            "Title": "Brightcom Group Schedules Board Meeting to Review Defence Division and Strategic Opportunities",
            "Summary": "Brightcom Group will hold a Board Meeting on September 25, 2025. The meeting agenda includes reviewing the progress of the company's Defence division, exploring strategic partnerships, and evaluating merger and acquisition opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1758721683792,
            "Source": "corporate_action"
        },
        {
            "Title": "Brightcom Partners With US Defence Manufacturer CQT Weapon Systems",
            "Summary": "Brightcom has entered into a partnership with CQT Weapon Systems, a US-based defence manufacturer, to develop advanced defence solutions. The collaboration aims to combine both companies' capabilities in the defence sector.",
            "Sentiment": "positive",
            "PublishDate": 1757474090741,
            "Source": "stock"
        },
        {
            "Title": "Brightcom Group Appoints Padma Shri Winner Dr. Prahlada Ramarao as Defense Division Advisor",
            "Summary": "Brightcom Group Limited announced that Dr. Prahlada Ramarao, a Padma Shri award recipient and defense scientist known as the Father of the Akash Missile, will advise Chairman & Managing Director M. Suresh Kumar Reddy. Dr. Ramarao led major missile projects including Akash, BrahMos, Prithvi, Agni, and Nag during his tenure as Director of Defence Research and Development Laboratory and Distinguished Scientist at DRDO. He served as Vice Chancellor of Defence Institute of Advanced Technology and holds multiple fellowships from scientific academies. Dr. Ramarao expressed his commitment to helping Brightcom harness its data and digital infrastructure capabilities to support national security objectives. The Chairman highlighted that Dr. Ramarao's mentorship will provide invaluable guidance for Brightcom Defence division as the company aims to contribute to India's defense capabilities through advanced technology solutions.",
            "Sentiment": "positive",
            "PublishDate": 1755405274573,
            "Source": "corporate_governance"
        },
        {
            "Title": "Brightcom Group Restricts Quarterly Conference Calls to Registered Shareholders Only",
            "Summary": "Brightcom Group Limited announced a policy change restricting its quarterly conference calls to registered shareholders only. The company's scheduled conference call on August 17, 2025 at 3:00 p.m. (IST) will be exclusively for registered shareholders to discuss Q1 results for the quarter ended June 30, 2025. Going forward, all quarterly interactions will be termed 'Shareholder Conference Call' instead of 'Investor Conference Call' and will provide access exclusively to registered shareholders. Non-shareholders have been requested to disregard the access link for the upcoming call.",
            "Sentiment": "neutral",
            "PublishDate": 1755355628782,
            "Source": "corporate_governance"
        },
        {
            "Title": "Brightcom Group Reports 23% Revenue Growth in Q1 FY2025-26, Launches Defence Division",
            "Summary": "Brightcom Group Limited reported consolidated revenue of ₹1456 crores for Q1 FY2025-26, representing a 23.14% year-over-year increase. The company's profit after tax grew 32.6% to ₹210.86 crores, with trailing twelve months earnings per share at ₹3.77. The Board approved the establishment of Brightcom Defence, a new division focused on aerospace intelligence and autonomous aerial defence software. The defence unit will target AI-powered UAV flight systems, real-time threat detection, coordinated drone swarms, and mission simulation engines. The company also outlined plans to restructure into four divisions: Advertising, Software Services, Defence, and Next Generation Technologies covering AI, ML, and Quantum Computing. During the quarter, Brightcom shares resumed trading on BSE and NSE on July 14, 2025, and the company achieved improved global rankings in Pixalate's Seller Trust Index across multiple countries.",
            "Sentiment": "positive",
            "PublishDate": 1755193076942,
            "Source": "earnings"
        },
        {
            "Title": "Brightcom Group's Subsidiary OMS Ranks #1 in DataBeat's Scaling Supply-Side Platforms Report",
            "Summary": "Brightcom Group Limited announced that its subsidiary Online Media Solutions (OMS) has been ranked #1 among Scaling Supply-Side Platforms in DataBeat's latest Sellers Report. The ranking is based on the number of new direct publisher relationships established via ads.txt during the reporting period. OMS recorded 1,169 new direct publisher connections in a single month, placing it at the top of the Scaling SSP category. The company attributes this recognition to its strategic focus on transparent relationships, smarter monetization, and streamlined processes that drive adoption among publishers globally. This milestone demonstrates OMS's growing impact in the global programmatic advertising ecosystem and strengthens Brightcom Group's market position in competitive segments.",
            "Sentiment": "positive",
            "PublishDate": 1754967808986,
            "Source": "stock"
        },
        {
            "Title": "Brightcom Group Appoints Vidyashankar Ramakrishnan as Chief of Staff to CMD",
            "Summary": "Brightcom Group Limited appointed Mr. Vidyashankar Ramakrishnan as Chief of Staff to the Chairman & Managing Director, effective August 7, 2025, for a three-year term. The 52-year-old executive will report directly to the CMD and handle decision-making facilitation, project management, communication coordination, operational efficiency improvements, problem-solving, and executive support. Ramakrishnan brings over 22 years of leadership experience across telecom, IT services, BFSI, retail and FMCG sectors, including roles at Tata Teleservices where he managed a ₹600-700 crore revenue portfolio, and Reliance Communications where he led service delivery improvements. He holds a PGDBA in Finance, Marketing & IT from ICFAI Business School and has received multiple awards for outstanding contributions. His remuneration will be as per the company's remuneration policy.",
            "Sentiment": "positive",
            "PublishDate": 1754549389705,
            "Source": "corporate_governance"
        },
        {
            "Title": "Brightcom Group Launches New Division for Defense Technologies",
            "Summary": "Brightcom Group Limited announced the launch of a dedicated division focused on aerospace intelligence and autonomous aerial defense software. The initiative leverages the company's expertise in artificial intelligence, machine learning, and real-time data processing to expand into the defense sector while maintaining its core digital marketing and advertising businesses. Chairman and Managing Director Suresh Reddy stated this represents an important milestone, with the proposal to be discussed at an upcoming board meeting. The division will develop AI-powered autonomous flight systems for UAVs, real-time threat detection algorithms, swarm coordination frameworks, cybersecurity architectures for aerial platforms, and simulation engines for mission planning. The global market for such technologies is projected to surpass USD 25 billion in the coming decade. Brightcom has a 27-year legacy in digital marketing, serves clients including Coca-Cola, Samsung, and Unilever, and has consolidated more than 10 companies globally with over USD 100 million in private equity funding.",
            "Sentiment": "positive",
            "PublishDate": 1754017549825,
            "Source": "stock"
        },
        {
            "Title": "Brightcom Group: Detailed Plan for Share Re-listing on BSE and NSE",
            "Summary": "Brightcom Group has outlined the process for re-listing its shares on BSE and NSE after a seven-month suspension. The company has fulfilled compliance requirements, updated financials, and paid penalties. Re-listing will involve a Special Pre-Opening Session (SPOS) with specific timelines for order entry, matching, and price discovery. Trading will resume with a price band of 85% lower to 50% higher than the last traded price.",
            "Sentiment": "neutral",
            "PublishDate": 1735515228000,
            "Source": "corporate_action"
        },
        {
            "Title": "Brightcom Group: Trading Suspension Revocation in Final Stages",
            "Summary": "Brightcom Group reports that the revocation of its trading suspension on NSE is in final stages, with a follow-up meeting scheduled with BSE. The company has paid required penalties and uploaded compliance certificates. Next steps include exchanges reviewing submissions, reconciling payments, and conducting a site visit before issuing a revocation circular. No specific timeline provided for the site visit or trading resumption.",
            "Sentiment": "neutral",
            "PublishDate": 1734915810000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Brightcom Group: Shares Growth Outlook, Suspension Revocation Uncertain",
            "Summary": "Brightcom Group anticipates significant growth over 2-3 years through organic and inorganic routes, expanding in US, Europe, and EMEA. The company has resolved NSE queries and paid fees to exchanges but awaits BSE directives for trading suspension revocation. No specific timeline provided for suspension lift or FY2024 audit completion.",
            "Sentiment": "neutral",
            "PublishDate": 1734304239000,
            "Source": "normal_news"
        },
        {
            "Title": "Brightcom Group: AGM Date Set, Trading Suspension Update Provided",
            "Summary": "Brightcom Group has set its AGM for FY2024 on January 31, 2025. The company assures that the trading suspension revocation process is progressing, with applications in place at both exchanges. They are confident of meeting compliance requirements to avoid permanent suspension. Q1 FY2025 results will be declared on December 12, 2024. The company plans to meet exchanges next week to address outstanding issues and pay penalties.",
            "Sentiment": "neutral",
            "PublishDate": 1733701813000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Brightcom Group: Q1 FY25 Results Released Amid Trading Suspension",
            "Summary": "Brightcom Group reported Q1 FY25 results with consolidated revenue of ₹1,182 crore and net profit of ₹159.5 crore. The company appointed two new independent directors. Trading suspension revocation timeline remains unclear, with the next SAT hearing scheduled for December 4.",
            "Sentiment": "neutral",
            "PublishDate": 1733101112000,
            "Source": "earnings"
        },
        {
            "Title": "Brightcom Group: Stock Surges 4.92% Amid Market Rally",
            "Summary": "Brightcom Group shares are trading at ₹8.11, up 4.92% from the previous close. The stock has hit a high and low of ₹8.11 during the day. Nifty and Sensex are up 1.82% and 1.68% respectively. The company has a ROE of 22.30% and ROA of 19.82%, with a P/E of 1.78.",
            "Sentiment": "positive",
            "PublishDate": 1732513667000,
            "Source": "normal_news"
        },
        {
            "Title": "Brightcom Group: Trading Suspension Revocation May Progress After Q1 FY25 Results",
            "Summary": "Brightcom Group expects trading suspension revocation to advance after Q1 FY25 results release on November 30, 2024. The company aims for full trading resumption before December 14, 2024. SAT appeal hearing scheduled for December 4. Recent AGM held with all proposals passed.",
            "Sentiment": "neutral",
            "PublishDate": 1732491832000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Brightcom Group: Q4 FY24 Results and AGM Dates Announced",
            "Summary": "Brightcom Group will declare Q4 FY24 results on November 17, hold investor conference call on November 19, and conduct AGM for FY23 on November 21. The company is awaiting exchange approval for revocation of trading suspension.",
            "Sentiment": "neutral",
            "PublishDate": 1731282853000,
            "Source": "corporate_action"
        },
        {
            "Title": "Brightcom Group: Suspension Revocation Application Imminent",
            "Summary": "<p>Brightcom Group plans to file for <span class='neutral'>trading suspension revocation</span> after releasing its latest <span class='neutral'>shareholding pattern</span>. The company aims to send out <b>AGM notice</b> for FY2023 within 10 days. Trading has been <span class='negative'>suspended for four months</span>, affecting over 6.5 lakh <span class='negative'>small shareholders</span>. The company reports <span class='positive'>meeting NSE obligations</span> and <span class='positive'>maintaining business initiatives</span> despite challenges.</p><br/>",
            "Sentiment": "neutral",
            "PublishDate": 1728861964000,
            "Source": "normal_news"
        },
        {
            "Title": "Brightcom Group Anticipates 15% Revenue Growth from New Service Contracts",
            "Summary": "<p>Brightcom Group has <span class='positive'>accelerated</span> negotiations for <b>two new service contracts</b>, which are expected to <span class='positive'>contribute</span> to a <span class='positive'>15% increase in revenue</span> by the second quarter of 2025. The company is <span class='positive'>actively pursuing</span> these opportunities to <span class='positive'>enhance</span> its financial performance.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728198743000,
            "Source": "corporate_action"
        }
    ]
}