{
    "Symbol": "BCLIND",
    "ISIN": "INE412G01024",
    "News": [
        {
            "Title": "BCL Industries Q3FY26 Earnings Call on Feb 11",
            "Summary": "BCL Industries Limited has scheduled an earnings call for February 11, 2026, at 4:00 PM to discuss Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770386354950,
            "Source": "co_actions_results"
        },
        {
            "Title": "BCL Industries to Acquire Remaining 25% Stake in Svaksha Distillery for INR 55 Crores",
            "Summary": "BCL Industries' Board approved acquiring an additional 25% stake in subsidiary Svaksha Distillery Limited for approximately INR 55 crores, making it a wholly owned subsidiary. The acquisition involves purchasing 14,98,632 equity shares from promoter-related entities and is expected to strengthen BCL's position in India's grain-based ethanol sector.",
            "Sentiment": "positive",
            "PublishDate": 1764834557329,
            "Source": "corporate_action"
        },
        {
            "Title": "BCL Industries Reports 10% Revenue Growth in H1 FY26 Despite Lower Ethanol Allocations",
            "Summary": "BCL Industries achieved consolidated revenue of INR 1,544 crores in H1 FY26 compared to INR 1,409 crores last year, with EBITDA growing 11% to INR 125 crores and PAT increasing 20% to INR 65 crores. The company faces challenges from lower ethanol allocations from oil marketing companies and has put its Goyal Distillery expansion project on hold while focusing on increasing ENA sales and launching premium IMIL products.",
            "Sentiment": "neutral",
            "PublishDate": 1763461016332,
            "Source": "earnings"
        },
        {
            "Title": "BCL Industries Submits Investor Presentation on Q2 FY26 Results, Reports Revenue Growth and Capacity Expansion Plans",
            "Summary": "BCL Industries Limited submitted an investor presentation to stock exchanges regarding its unaudited financial results for the quarter ended September 30, 2025. The company reported consolidated revenue of Rs 748 crore in Q2 FY26 compared to Rs 721 crore in Q2 FY25, with EBITDA of Rs 57 crore and EBITDA margin of 7.6%. For H1 FY26, revenue reached Rs 1,544 crore versus Rs 1,409 crore in H1 FY25, with PAT of Rs 65 crore. The company operates distillery plants with 700 KLPD capacity and is expanding with a 150 KLPD ethanol unit at Bathinda expected to be commissioned by Q4 FY26. BCL acquired Goyal Distillery Pvt Ltd in Haryana, which will add 250 KLPD ethanol capacity. The company has completed its 75 KLPD biodiesel plant and is exiting the edible oil business as planned. BCL produces ethanol from maize and FCI rice, with both plants running at full capacity due to strong demand for ENA and ethanol.",
            "Sentiment": "positive",
            "PublishDate": 1763035919426,
            "Source": "stock"
        },
        {
            "Title": "BCL Industries Reports Marginal Net Profit Growth Amid Revenue Decline in Q2",
            "Summary": "BCL Industries reported a net profit of 212 million rupees in Q2, representing a slight increase from 210 million rupees in the same period last year. However, the company's revenue declined to 4.76 billion rupees compared to 5.3 billion rupees year-over-year, indicating mixed financial performance with profit growth offset by lower sales.",
            "Sentiment": "neutral",
            "PublishDate": 1762942281312,
            "Source": "earnings"
        },
        {
            "Title": "BCL Industries Secures 107,000 KL Ethanol Allocation from OMCs for FY 2025-26",
            "Summary": "BCL Industries has secured an ethanol allocation of 107,000 kiloliters from Oil Marketing Companies (OMCs) for the fiscal year 2025-26. This allocation represents a supply agreement for ethanol delivery to the oil marketing companies during the specified period.",
            "Sentiment": "positive",
            "PublishDate": 1761713969438,
            "Source": "stock"
        },
        {
            "Title": "BCL Industries Receives 50,077 International Renewable Energy Certificates for Biomass Power Plant",
            "Summary": "BCL Industries Limited received 50,077 International Renewable Energy Certificates (I-RECs) for renewable power generated at its 10 MW captive power plant in Bathinda, Punjab, during January to September 2025. The facility operates a 60 TPH biomass-fired boiler using paddy straw as primary fuel. The certificates were issued under the I-REC Standard, administered by Evident Ev Limited and facilitated through International Carbon Exchange (ICX) Pvt Ltd. The company will continue receiving I-REC certificates on a pro-rata basis for future renewable power generation. The certification validates electricity production from renewable biomass sources, contributing to reduced carbon emissions and prevention of stubble burning.",
            "Sentiment": "positive",
            "PublishDate": 1760417516022,
            "Source": "stock"
        },
        {
            "Title": "BCL Industries Reports 25% Revenue Growth to Rs 823 Crores in Q1 FY26, Exits Edible Oil Business",
            "Summary": "BCL Industries delivered total revenue of Rs 823 crores for Q1 FY26, marking a 25% year-on-year increase. The distillery segment drove growth with ethanol volumes rising 11% to 55,461 KL and ENA volumes up 37% to 7,960 KL. EBITDA stood at Rs 56 crores with distillery contributing Rs 53 crores, while consolidated PAT reached Rs 33 crores, up 32%. The company is executing a strategic exit from low-margin edible oil operations, having shut down oil mill, solvent, rice mills, vanaspati, and packaged oil segments during Q2. BCL operates with 700 KLPD installed capacity and has a 150 KLPD expansion in Bhatinda progressing for year-end commissioning. The company's wholly owned subsidiary Goyal Distillery has regulatory clearances for a 250 KLPD ethanol plant. FCI rice procurement resumed at Rs 22.5 per kg, providing feedstock stability. The company plans to enter the IMFL market in 2026 and expects to complete edible oil stock liquidation by Q3 FY26. Consolidated debt stands at approximately Rs 450 crores.",
            "Sentiment": "positive",
            "PublishDate": 1755519846422,
            "Source": "earnings"
        },
        {
            "Title": "BCL Industries Reports Q1FY26 Results with 25% Revenue Growth and Capacity Expansion Plans",
            "Summary": "BCL Industries Limited reported quarterly results with total revenue of Rs 823 crore, representing 25% year-over-year growth from Rs 660 crore in Q1FY25. EBITDA remained flat at Rs 56 crore with margin declining to 6.8% from 8.5% in the previous year. Profit after tax increased 32% to Rs 33 crore. The company operates distillery facilities with 700 KLPD capacity across two locations - Sangat Distillery (400 KLPD) in Punjab and Svaksha Distillery (300 KLPD) in West Bengal. BCL is expanding capacity to 1,100 KLPD through projects in Haryana and Bathinda, including a 150 KLPD ethanol expansion at Bathinda targeted for December 2025 commissioning. The company has exited the edible oil business as planned, shutting down oil mill, solvent extraction, rice mill, vanaspati, and packaged units in July 2025. A 75 KLPD biodiesel plant is under trial and expected to be commissioned in Q2FY26. BCL produces ethanol from maize and FCI rice, with both plants running at full capacity. The company sold 4,36,480 boxes of country liquor in Q1FY26 and supplies ENA to major bottlers including Pernod Ricard, Amrut, and Diageo.",
            "Sentiment": "positive",
            "PublishDate": 1755082497912,
            "Source": "earnings"
        },
        {
            "Title": "BCL Industries Approves Quarterly Results and Sets AGM Date for September 2025",
            "Summary": "BCL Industries Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025, during a meeting held on August 12, 2025. The board also approved the notice and agenda for the 49th Annual General Meeting scheduled for September 25, 2025, to be conducted through video conferencing. Additionally, the board approved the cost audit report for financial year 2024-25, fixed September 19, 2025 as the record date for dividend payment for financial year 2024-25, and approved shifting the registered office from Hazi Rattan Link Road, Bathinda to the company's Bathinda distillery unit. The board meeting lasted from 12:30 PM to 1:40 PM.",
            "Sentiment": "neutral",
            "PublishDate": 1754987922007,
            "Source": "earnings"
        },
        {
            "Title": "BCL Industries Reports Mixed Q1 Results with Revenue Growth but Lower EBITDA",
            "Summary": "BCL Industries reported quarterly results showing net profit increased to 222 million rupees from 170 million rupees year-over-year. Revenue grew to 5.9 billion rupees compared to 4.7 billion rupees in the same period last year. However, EBITDA declined to 302 million rupees from 334 million rupees year-over-year, with EBITDA margin compressing to 5.15% from 7.07% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754986710528,
            "Source": "earnings"
        },
        {
            "Title": "BCL Industries Secures 59 Lakh Litre ENA Supply Contract from Ganganagar Sugar Mills",
            "Summary": "BCL Industries has received a new supply order for 59 lakh litres of Extra Neutral Alcohol (ENA) from Ganganagar Sugar Mills, located in Rajasthan. This represents a significant supply contract for the company in the alcohol manufacturing sector.",
            "Sentiment": "positive",
            "PublishDate": 1753253499665,
            "Source": "order&deals"
        },
        {
            "Title": "BCL Industries Increases Stake in Pioneer Industries",
            "Summary": "BCL Industries has approved the acquisition of shares in Pioneer Industries. This move will increase BCL Industries' stake in Pioneer Industries from 4.36% to 19.57%.",
            "Sentiment": "positive",
            "PublishDate": 1749642588000,
            "Source": "default"
        },
        {
            "Title": "BCL Industries Reports Q4 EBITDA Decline",
            "Summary": "BCL Industries has reported its Q4 EBITDA as 298 million rupees, down from 364 million rupees in the same quarter of the previous year. The company's Q4 EBITDA margin also decreased to 5.57% from 7.75% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748514431000,
            "Source": "result"
        },
        {
            "Title": "BCL Industries Reports Q4 Financial Results",
            "Summary": "BCL Industries has announced its financial results for the fourth quarter. The company reported a net profit of 193 million rupees, compared to 213 million rupees in the same quarter of the previous year. Revenue for the quarter increased to 5.4 billion rupees from 4.7 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1748513790000,
            "Source": "result"
        },
        {
            "Title": "BCL Industries: Promoter Increases Stake in Ethanol Blending Company",
            "Summary": "Kushal Mittal, a promoter of BCL Industries, has increased his stake in the company by 0.13%, purchasing 3.74 lakh equity shares over three days. The company's total market capitalization stands at ₹1,152.02 crore as of March 24.",
            "Sentiment": "positive",
            "PublishDate": 1742832320000,
            "Source": "corporate_action"
        },
        {
            "Title": "BCL Industries: Small-Cap Stock Surges 19% on Order Win",
            "Summary": "BCL Industries' stock price increased by 5% on March 7, following an order win announcement. The stock has gained 19% over four consecutive trading sessions.",
            "Sentiment": "positive",
            "PublishDate": 1741332042000,
            "Source": "order&deals"
        },
        {
            "Title": "BCL Industries: Promoter Increases Stake in Brewery Company",
            "Summary": "BCL Industries' stock rose over 5% after the company promoter increased their stake through open market purchases.",
            "Sentiment": "positive",
            "PublishDate": 1741158489000,
            "Source": "corporate_action"
        },
        {
            "Title": "BCL Industries: Promoter Increases Stake Amid Stock Price Decline",
            "Summary": "BCL Industries shares rose 5.43% to ₹37.05 on BSE despite weak market trends. Promoter Kushal Mittal acquired 156,826 additional shares, increasing his stake to 16.27%. The stock has declined 21% in the past month and 28% year-to-date.",
            "Sentiment": "neutral",
            "PublishDate": 1741066543000,
            "Source": "corporate_action"
        },
        {
            "Title": "BCL Industries: Secures ₹134.87 Crore Ethanol Supply Order",
            "Summary": "BCL Industries and its subsidiary Svaksha Distillery received an additional order to supply 23,054 KL of ethanol to oil marketing companies, valued at ₹134.87 crore. This order is in addition to an existing 18,2485 KL order from October 2024. The company's stock rose 7.64% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1739961796000,
            "Source": "order&deals"
        },
        {
            "Title": "BCL Industries and Subsidiary Allocated Additional Ethanol Capacity",
            "Summary": "BCL Industries and its subsidiary have been allocated an additional 23,054 KL of ethanol production capacity. This increase in allocation suggests potential growth in the company's ethanol business segment.",
            "Sentiment": "positive",
            "PublishDate": 1739959153000,
            "Source": "corporate_action"
        },
        {
            "Title": "BCL Industries and Subsidiary Participate in OMC Tender for Ethanol Supply",
            "Summary": "BCL Industries and its subsidiary have participated in a tender process organized by Oil Marketing Companies (OMCs) for the supply of ethanol. This move indicates the company's involvement in the biofuel sector and its efforts to secure potential contracts for ethanol supply.",
            "Sentiment": "neutral",
            "PublishDate": 1739959106000,
            "Source": "corporate_action"
        },
        {
            "Title": "BCL Industries: Q3 Profit Drops 37.3% Despite Revenue Growth",
            "Summary": "BCL Industries reported Q3 FY25 results with revenue up 18.22% YoY to ₹761.53 crore, but profit fell 37.3% YoY to ₹19.2 crore. EPS decreased to ₹0.65, down 45.83% YoY. Operating income declined 22.67% YoY, indicating efficiency challenges.",
            "Sentiment": "negative",
            "PublishDate": 1739566416000,
            "Source": "earnings"
        },
        {
            "Title": "BCL Industries Reports Decline in Q3 EBITDA and Margin",
            "Summary": "BCL Industries has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter stood at 465 million rupees, down from 546 million rupees in the same quarter last year. The EBITDA margin also decreased to 6.10% from 8.48% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739432639000,
            "Source": "earnings"
        },
        {
            "Title": "BCL Industries Reports Q3 Revenue Increase",
            "Summary": "BCL Industries has announced its third quarter revenue results. The company reported revenue of 7.6 billion rupees, compared to 6.4 billion rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1739432587000,
            "Source": "earnings"
        },
        {
            "Title": "BCL Industries Reports Q3 Consolidated Net Profit of 192 Million Rupees",
            "Summary": "BCL Industries has announced its third quarter consolidated net profit of 192 million rupees, which represents a decrease from the 306 million rupees reported in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1739432505000,
            "Source": "earnings"
        },
        {
            "Title": "BCL Industries: Subsidiary Expands Renewable Energy Capabilities",
            "Summary": "BCL Industries' subsidiary, Svaksha Distillery Limited, received approval to establish a 75 KLPD bio-diesel plant and oil extraction unit in Kharagpur, with an estimated cost of ₹150 crore. The company also secured environmental clearance for a 150 KLPD ethanol plant in Bathinda. Another 75 KLPD bio-diesel plant is under construction in Bathinda.",
            "Sentiment": "positive",
            "PublishDate": 1734512369000,
            "Source": "corporate_action"
        },
        {
            "Title": "BCL Industries Receives Environmental Clearance for New Ethanol Plant",
            "Summary": "BCL Industries has obtained Environmental Clearance (EC) to establish a new 150 KLPD (Kilo Liters Per Day) ethanol manufacturing plant at its Bathinda distillery. This approval allows the company to expand its ethanol production capacity.",
            "Sentiment": "positive",
            "PublishDate": 1734422106000,
            "Source": "corporate_action"
        },
        {
            "Title": "BCL Industries to Establish Bio-Diesel and Oil Extraction Plant in Kharagpur",
            "Summary": "BCL Industries has received consent to establish a 75 KLPD bio-diesel plant along with an oil extraction plant at its Kharagpur unit. The estimated project cost for this new facility is 150 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1734422012000,
            "Source": "corporate_action"
        },
        {
            "Title": "BCL Industries Secures Contract for 60 Lakh Litres of ENA Supply",
            "Summary": "BCL Industries has received a Letter of Acceptance for supplying 60 lakh litres of Extra Neutral Alcohol (ENA) from its Bathinda, Punjab distillery. This contract represents a significant order for the company's distillery operations.",
            "Sentiment": "positive",
            "PublishDate": 1732692981000,
            "Source": "order&deals"
        },
        {
            "Title": "BCL Industries: Ethanol Expansion Drives 3.5% Stock Rise",
            "Summary": "BCL Industries' stock rose 3.5% to Rs 59.63 after reporting strong Q2 FY25 results. Sales increased 55.2% to Rs 746.13 million, with net income up 51.9% to Rs 29.87 million. The company expanded its ethanol production capacity to 700 KLPD and received an increased allocation of 18250 litres for the Ethanol Blended Petrol Program in 2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1730959849000,
            "Source": "normal_news"
        },
        {
            "Title": "BCL Industries: Q2 Profit Soars 50%, Revenue Up 55%",
            "Summary": "BCL Industries reported Q2FY25 consolidated net profit of Rs 30 Cr, up 50% YoY. Revenue surged 55% to Rs 746 Cr. EBITDA rose 16% to Rs 57 Cr. The company secured 18.25 Cr litres ethanol allocation for ESY 24-25, 17% higher than previous year. BCL is acquiring Goyal Distillery to add 250 KLPD capacity, potentially increasing total capacity to 1100 KLPD.",
            "Sentiment": "positive",
            "PublishDate": 1730259078000,
            "Source": "result"
        },
        {
            "Title": "BCL Industries Expects Full Capacity Utilization of 700 KLPD Distillery in FY 24-25",
            "Summary": "BCL Industries anticipates achieving full capacity utilization of its 700 KLPD (Kilo Liters Per Day) distillery in the fiscal year 2024-2025. The company projects revenues exceeding Rs 1,750 crores from its distillery operations, as stated in their investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1730257926000,
            "Source": "corporate_action"
        },
        {
            "Title": "BCL Industries: Small-Cap Stock Surges 7% Post Q2 Results",
            "Summary": "BCL Industries shares, priced below ₹100, jumped up to 7% in intraday trading following the release of their Q2 results.",
            "Sentiment": "positive",
            "PublishDate": 1730195607000,
            "Source": "result"
        },
        {
            "Title": "BCL Industries Reports Q2 EBITDA Growth",
            "Summary": "BCL Industries has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 356 million rupees, up from 294 million rupees in the same quarter last year. However, the EBITDA margin decreased to 6.70% from 8.04% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730188909000,
            "Source": "result"
        },
        {
            "Title": "BCL Industries Reports Strong Q2 Revenue Growth",
            "Summary": "BCL Industries has announced its Q2 revenue, which stands at 5.3 billion rupees, showing a significant increase from 3.6 billion rupees in the same quarter last year. This represents a year-over-year growth in revenue.",
            "Sentiment": "positive",
            "PublishDate": 1730188883000,
            "Source": "result"
        },
        {
            "Title": "BCL Industries Reports Significant Profit Increase in Q2",
            "Summary": "BCL Industries has reported a net profit of 210 million rupees for the second quarter, compared to 128.3 million rupees in the same period last year, representing a substantial year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730188878000,
            "Source": "result"
        },
        {
            "Title": "BCL Industries: Ethanol Procurement Boost and Strategic Acquisition",
            "Summary": "BCL Industries secured approval for 18.25 crore litres of ethanol for ESY 2024-25, a 17% increase from the previous year. The company also acquired Goyal Distillery Private Ltd., planning to set up a 250 KLPD grain-based bio-ethanol plant and a biogas facility.",
            "Sentiment": "positive",
            "PublishDate": 1729673365000,
            "Source": "normal_news"
        },
        {
            "Title": "BCL Industries Receives Higher Ethanol Allocation",
            "Summary": "BCL Industries has received an ethanol allocation that is approximately 17% higher than their previous allocation. This increase is attributed to the company's recent expansion of production capacity by an additional 100 KLPD (Kilo Liters Per Day).",
            "Sentiment": "positive",
            "PublishDate": 1729668258000,
            "Source": "corporate_action"
        },
        {
            "Title": "BCL Industries Allocated Increased Ethanol Quantity for ESY 24-25",
            "Summary": "BCL Industries has been allocated 18.25 crore litres of ethanol for the Ethanol Supply Year (ESY) 2024-25, an increase from 16.94 crore litres allocated for ESY 2023-24.",
            "Sentiment": "positive",
            "PublishDate": 1729668212000,
            "Source": "corporate_action"
        },
        {
            "Title": "BCL Industries to Acquire Goyal Distillery, Expanding Ethanol Production",
            "Summary": "<p>BCL Industries is set to <span class='positive'>acquire</span> Goyal Distillery Pvt Ltd. This <span class='positive'>acquisition</span> will enable the <span class='positive'>establishment</span> of a <b>250 KLPD</b> grain-based ethanol plant, <span class='positive'>significantly increasing</span> the company's production capacity from <b>700 KLPD</b> to <b>1,100 KLPD</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727973181000,
            "Source": "corporate_action"
        }
    ]
}