{
    "Symbol": "BCONCEPTS",
    "ISIN": "INE977Y01011",
    "News": [
        {
            "Title": "Brand Concepts Schedules Q3 & 9M FY26 Earnings Call",
            "Summary": "Brand Concepts Limited announces post-earnings conference call for Q3 & 9M FY26 scheduled for February 16, 2026 at 01:00 PM IST with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1770831731736,
            "Source": "co_actions_results"
        },
        {
            "Title": "Brand Concepts Limited Allots 6.10 Lakh Warrants to Promoter Group for Rs. 19.99 Crores",
            "Summary": "Brand Concepts Limited has allotted 6,10,000 convertible warrants to promoter Prateek Maheshwari at Rs. 327.80 per warrant, raising Rs. 4.99 crores upfront with remaining 75% payable upon conversion. The warrants can be converted into equity shares within 18 months, potentially increasing Maheshwari's shareholding from 11.08% to 15.24% on a fully diluted basis.",
            "Sentiment": "neutral",
            "PublishDate": 1764764247637,
            "Source": "corporate_action"
        },
        {
            "Title": "Brand Concepts Limited Receives Stock Exchange Approval for Rs. 19.99 Crore Warrant Issue",
            "Summary": "NSE and BSE granted in-principle approval to Brand Concepts Limited for issuing 6,10,000 convertible warrants to its promoter group at Rs. 327.80 per warrant, raising Rs. 19,99,58,000. The preferential warrant issue will allow conversion into equity shares and strengthen the company's capital structure through promoter participation.",
            "Sentiment": "positive",
            "PublishDate": 1763553093945,
            "Source": "corporate_action"
        },
        {
            "Title": "Brand Concepts Limited Extends Juicy Couture Licensing Agreement by 5 Years and Expands into Apparel",
            "Summary": "Brand Concepts Limited has amended its licensing agreement with ABG Juicy Couture LLC, extending the tenure by 5 years to create a 10-year long-term arrangement. The amendment includes expansion into new product categories, particularly apparel, enabling the company to broaden and diversify its Juicy Couture brand offerings in the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1763113562401,
            "Source": "stock"
        },
        {
            "Title": "Brand Concepts Reports 26% Revenue Growth and 33% EBITDA Jump in Q2 FY26",
            "Summary": "Brand Concepts Limited announced its highest-ever topline and EBITDA performance for Q2 FY26, with revenue growing 26% year-on-year and EBITDA increasing 33%. The company reported 33% sequential quarter growth from the preceding quarter. E-commerce marketplace operations surged 63% while overall e-commerce grew 23%. Large format retail also delivered strong growth aided by business development activities and point-of-sales expansion. The company invested INR 35 crores in hard luggage manufacturing and new warehouse facilities. Brand Concepts opened five new Bagline stores in premium locations including Aerocity Delhi, Oberoi Mall Mumbai, Mumbai Airport, and Bangalore Airport. The company signed Superdry brand in partnership with Reliance, marking their first collaboration. Juicy Couture generated INR 5 crores in sales during H1 after launching in April. Tommy Hilfiger showed 39% growth while UCB grew 30%, though Aeropostale saw a decline during the quarter. The company targets 20% revenue growth for the entire year and expects to maintain EBITDA margins between 10-11%. Manufacturing capacity reached 20,000+ units monthly, ahead of the planned 25,000 unit optimum capacity. Management indicated focus on consolidating existing brands rather than acquiring new ones.",
            "Sentiment": "positive",
            "PublishDate": 1762762321952,
            "Source": "earnings"
        },
        {
            "Title": "Brand Concepts Reports 26% Revenue Growth in Q2H1FY26 with Strong E-commerce Performance",
            "Summary": "Brand Concepts Limited reported revenue growth of 26% year-over-year for Q2H1FY26, reaching Rs 976.2 crore. The company achieved its highest-ever topline and EBITDA, with EBITDA growing 33% and gross margins expanding by 286 basis points driven by in-house manufacturing efficiencies. E-commerce marketplace business surged 63% year-over-year while overall e-commerce grew 23%. The company opened 5 new Bagline stores in premium locations including Aerocity Delhi, Oberoi Mall Mumbai, and Mumbai Airport. Brand Concepts invested Rs 30.58 crore in hard luggage manufacturing and Rs 4.56 crore in a new warehouse facility. The company operates licensed brands including Tommy Hilfiger, United Colors of Benetton, Juicy Couture, Superdry, Off-White, and Aeropostale, alongside own brands Sugarush and The Vertical. Net margins were impacted by investments in future growth including team expansion, marketing spends for new brand launches, and capacity building initiatives. The company faces challenges from intense competition with over Rs 600 crore capital infusion across major players in the travel gear segment.",
            "Sentiment": "positive",
            "PublishDate": 1762515319946,
            "Source": "stock"
        },
        {
            "Title": "Brand Concepts Limited Reports Q2 FY26 Results with Revenue Growth and New Manufacturing Facility",
            "Summary": "Brand Concepts Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company reported net sales of Rs. 9,761.90 lakhs for the quarter compared to Rs. 7,169.17 lakhs in the previous year quarter. For the half year, net sales reached Rs. 17,394.17 lakhs versus Rs. 16,931.24 lakhs in the corresponding previous period. The company posted a net profit of Rs. 250.53 lakhs for the quarter against a loss of Rs. 168.00 lakhs in the same quarter last year. For the half year, net profit stood at Rs. 92.75 lakhs compared to Rs. 52.04 lakhs previously. The company commenced commercial production at its new manufacturing facility located at Vikram Udyog Puri, Ujjain, Madhya Pradesh, effective July 16, 2025. The plant spans 8 acres with an initial installed capacity exceeding 3 lakh units per annum, dedicated to producing premium luggage, polycarbonate, and ABS/PC products. The Board meeting was held on November 6, 2025, to approve these results.",
            "Sentiment": "positive",
            "PublishDate": 1762485059189,
            "Source": "earnings"
        },
        {
            "Title": "Brand Concepts Limited Approves Issuance of 6.1 Lakh Warrants to Promoters",
            "Summary": "Brand Concepts Limited held an Extra-Ordinary General Meeting on October 16, 2025, via video conferencing from 11:30 AM to 11:40 AM. The meeting addressed the issuance of 6,10,000 warrants convertible into equity shares to members of the promoter/promoter group on a preferential basis. The meeting had 32 shareholders present, including 3 from the promoter group and 29 public shareholders, out of a total of 12,108 shareholders as of the cut-off date. Four directors attended the meeting along with Company Secretary Swati Gupta and Secretarial Auditor Manju Mundra. The business was transacted through e-voting, with detailed results to be disclosed separately based on the scrutinizer report.",
            "Sentiment": "neutral",
            "PublishDate": 1760597240725,
            "Source": "corporate_action"
        },
        {
            "Title": "Brand Concepts Signs Exclusive License Deal with Reliance Brands for Superdry Products in India",
            "Summary": "Brand Concepts has entered into an exclusive licensing agreement with Reliance Brands to expand Superdry travel gear and handbags in the Indian market. The partnership will allow Brand Concepts to distribute these specific Superdry product categories through Reliance Brands' retail network.",
            "Sentiment": "positive",
            "PublishDate": 1759144860325,
            "Source": "order&deals"
        },
        {
            "Title": "Brand Concepts Ltd Approves Rs. 19.99 Crore Warrant Issue to Managing Director",
            "Summary": "Brand Concepts Ltd's board approved raising Rs. 19.99 crore through issuance of 6,10,000 convertible warrants to Managing Director Prateek Maheshwari at Rs. 327.80 per warrant. Each warrant converts to one equity share of Rs. 10 face value within 18 months of allotment. The preferential allotment requires 25% payment upfront with balance 75% payable within 18 months. Post-conversion, Maheshwari's shareholding will increase from 11.08% to 15.24%. The proposal is subject to shareholder and regulatory approvals, with an EGM scheduled for October 16, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758631317868,
            "Source": "corporate_action"
        },
        {
            "Title": "Brand Concepts Ltd Schedules Board Meeting to Consider Warrant Fundraising",
            "Summary": "Brand Concepts Ltd has scheduled a Board of Directors meeting for September 23, 2025, to consider raising funds through the issue of warrants convertible into equity shares on a preferential basis to promoter/promoter group. The proposal requires shareholder approval at an Extraordinary General Meeting. The company has announced a trading window closure for all directors, key managerial personnel, promoters, designated employees, insiders and their immediate relatives from September 19 to September 25, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758198577820,
            "Source": "corporate_action"
        },
        {
            "Title": "Brand Concepts Limited Reports Losses in Q1 FY26 Despite Growth in Select Segments",
            "Summary": "Brand Concepts Limited reported losses for Q1 FY26 with an EBITDA margin of 4%. The luggage segment declined 30% year-over-year to ₹22.29 crores, while small leather goods grew 24%, women's handbags surged 155%, and backpacks increased over 50%. The company faced margin pressures from competitive pricing, with institutional business declining by ₹10 crores. Management reduced luggage pricing from ₹23,500 to ₹18,000 offline, acknowledging the lower pricing environment as the 'new normal'. The company launched Juicy Couture brand, signed Off-White luxury brand franchise agreement, and opened new airport stores in Bangalore and Mumbai. Brand Concepts commenced full production at its hard luggage manufacturing facility in July 2025, operating at 50-60% of 25,000 units monthly capacity. Management targets 20% revenue growth for FY26 and expects to return to growth trajectory from Q2 onwards, aiming for 10% EBITDA margin by Q3/Q4 FY26.",
            "Sentiment": "negative",
            "PublishDate": 1755500968509,
            "Source": "earnings"
        },
        {
            "Title": "Brand Concepts Limited Reports Q1 FY26 Results with Revenue of Rs 722.6 Million",
            "Summary": "Brand Concepts Limited reported total revenue of Rs 722.6 million for Q1 FY26, down 6.3% year-over-year. The company's adjusted EBITDA margin declined to 5.5% from 11.4% in the previous year quarter. Revenue from operations fell 6.8% to Rs 716.9 million, while the company reported a net loss of Rs 27.2 million compared to a profit of Rs 17.6 million in Q1 FY25. Key developments included signing an exclusive distribution agreement for Off-White brand in India, launching Juicy Couture with advertising campaigns, and opening new stores in marquee locations. The company's manufacturing unit completed trials and commenced production in July. Management attributed lower performance to sluggish demand in the luggage category and pricing pressures, but implemented price adjustments in June that began showing positive momentum. The company operates through multiple channels including online (39% contribution), modern trade (30%), traditional trade (22%), and manufacturing division (10%). Brand Concepts holds licenses for Tommy Hilfiger, United Colors of Benetton, Juicy Couture, Off-White, and Aeropostale, while also operating own brands Sugarush and The Vertical.",
            "Sentiment": "negative",
            "PublishDate": 1755161265604,
            "Source": "earnings"
        },
        {
            "Title": "Brand Concepts Opens New Bagline Store at Mumbai Airport",
            "Summary": "Brand Concepts has opened a new Bagline store at Mumbai Airport, expanding its retail presence in the airport retail segment.",
            "Sentiment": "positive",
            "PublishDate": 1755089228826,
            "Source": "stock"
        },
        {
            "Title": "Brand Concepts Limited Opens New 'Bagline' Store at Oberoi Mall Mumbai",
            "Summary": "Brand Concepts Limited has opened a new store named 'Bagline' at F-38, Oberoi Mall, Goregoan East, Mumbai, Maharashtra. The company describes this opening as part of its strategic expansion efforts to enhance customer accessibility and services. Brand Concepts Limited trades on NSE under symbol BCONCEPTS and on BSE with scrip code 543442.",
            "Sentiment": "positive",
            "PublishDate": 1755089030119,
            "Source": "stock"
        },
        {
            "Title": "Brand Concepts Ltd Reports Net Loss of Rs 271.59 Lacs in Q1 Results",
            "Summary": "Brand Concepts Ltd approved its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported a standalone net loss of Rs 271.59 lacs compared to a net profit of Rs 155.74 lacs in the previous quarter and Rs 176.22 lacs in the same quarter last year. Total revenue decreased to Rs 7,225.92 lacs from Rs 7,274.01 lacs in the previous quarter. Total expenses increased to Rs 7,531.14 lacs from Rs 7,129.85 lacs in the previous quarter. The company's earnings per share turned negative at Rs (2.19) for the quarter. The results reflect the impact of a merger scheme between IFF Overseas Private Limited and Brand Concepts Limited, which was approved by NCLT with a retrospective date of April 01, 2024. The consolidated results mirror the standalone performance with identical figures.",
            "Sentiment": "negative",
            "PublishDate": 1755080206283,
            "Source": "earnings"
        },
        {
            "Title": "Brand Concepts Limited Submits Revised Financial Results Following BSE Observations on Board Meeting Outcome",
            "Summary": "Brand Concepts Limited submitted revised financial results addressing discrepancies identified by BSE regarding their Board Meeting outcome from August 1, 2025. The revision includes a declaration of unmodified opinion as required under SEBI regulations. The Board approved revised audited financial statements pursuant to the merger scheme of IFF Overseas Private Limited with Brand Concepts Limited, which was approved by the National Company Law Tribunal Indore Bench on May 9, 2025. The company's net revenue from operations was ₹2,919.18 lakhs for the year, with net profit after tax of ₹523.33 lakhs. The statutory auditors Fadnis & Gupte LLP issued audit reports with unmodified opinions on both standalone and consolidated financial results. The merger accounting treatment was applied using the pooling of interest method with an appointed date of April 1, 2024, and previous year figures were restated accordingly.",
            "Sentiment": "neutral",
            "PublishDate": 1754983583615,
            "Source": "corporate_action"
        },
        {
            "Title": "Brand Concepts Limited Schedules Q1 FY26 Post-Earnings Conference Call",
            "Summary": "Brand Concepts Limited has scheduled a post-earnings investors conference call for Q1 FY26 on Thursday, August 14, 2025, at 2:00 PM. The call will be conducted by senior management, with Mr. Abhinav Kumar, Whole Time Director & CFO, representing the management team. The conference call will be held via Zoom and requires prior registration through a provided link. KAPTIFY Consulting will coordinate the call, which will be recorded in line with SEBI regulations. Details are also available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1754913128196,
            "Source": "earnings"
        },
        {
            "Title": "Brand Concepts Limited Approves Revised Financial Statements Following NCLT-Sanctioned Merger",
            "Summary": "Brand Concepts Limited's Board approved revised audited financial statements following the merger with IFF Overseas Private Limited, sanctioned by the National Company Law Tribunal, Indore Bench on May 9, 2025. The merger became effective from April 1, 2024, with all assets, liabilities, rights and obligations of IFF Overseas transferred to Brand Concepts using the pooling of interest method. For the year ended March 31, 2025, Brand Concepts reported net sales of ₹2,919.18 lakhs compared to ₹2,901.49 lakhs in the previous year. Net profit after tax stood at ₹523.33 lakhs versus ₹1,212.67 lakhs in the prior year. The company's total assets increased to ₹27,327.76 lakhs from ₹19,430.38 lakhs. Basic earnings per share was ₹4.22 compared to ₹10.04 in the previous year. The revised financial statements incorporate the impact of the business combination and include restated figures for the preceding year as required under accounting standards.",
            "Sentiment": "neutral",
            "PublishDate": 1754046677030,
            "Source": "corporate_action"
        },
        {
            "Title": "Brand Concepts Limited Opens Four New BAGLINE Retail Stores Across India",
            "Summary": "Brand Concepts Limited has opened four new retail stores under the BAGLINE brand across India. The new locations include stores in Surat at Roongta Estella near VNSG University, Bangalore at Kempe Gowda International Airport's departure terminal, New Delhi at World Mark 1 in Aerocity, and Nagpur at Poonam Mall. The company stated this strategic expansion aims to enhance customer accessibility, strengthen market presence, and provide superior service across key regions as part of its growth trajectory.",
            "Sentiment": "positive",
            "PublishDate": 1753544830220,
            "Source": "stock"
        },
        {
            "Title": "Brand Concepts Limited Schedules Board Meeting to Approve Restated Financial Statements Post-Merger",
            "Summary": "Brand Concepts Limited has scheduled a Board of Directors meeting on August 1, 2025, to consider and approve restated audited financial statements. The restatement follows the merger of IFF Overseas Private Limited with Brand Concepts Limited, which was approved by the National Company Law Tribunal Indore Bench on May 9, 2025. The restatement will comply with the Companies Act 2013, SEBI Regulations, and Indian Accounting Standards. The restated financial statements will be reviewed by the Audit Committee before Board consideration.",
            "Sentiment": "neutral",
            "PublishDate": 1753426924409,
            "Source": "corporate_action"
        },
        {
            "Title": "Brand Concepts Begins Production at New Ujjain Facility",
            "Summary": "Brand Concepts has commenced production at its newly established facility in Ujjain. The company has expanded its manufacturing capabilities with this new plant.",
            "Sentiment": "positive",
            "PublishDate": 1752752623000,
            "Source": "default"
        },
        {
            "Title": "Brand Concepts Reports Q4 Financial Results",
            "Summary": "Brand Concepts has released its Q4 financial results. The company's EBITDA increased to 69 million rupees from 52 million rupees year-over-year, with EBITDA margin improving to 10.39% from 8.93%. However, consolidated net profit decreased to 14 million rupees from 18 million rupees in the same period last year. Revenue showed growth, rising to 659 million rupees from 581 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747310518000,
            "Source": "result"
        },
        {
            "Title": "Brand Concepts Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Brand Concepts has reported a decrease in its third quarter EBITDA, which fell to 71 million rupees from 76 million rupees in the same period last year. The company's EBITDA margin also declined, dropping to 10.54% from 11.62% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739174087000,
            "Source": "earnings"
        },
        {
            "Title": "Brand Concepts Reports Decline in Q3 Net Profit",
            "Summary": "Brand Concepts has reported its financial results for the third quarter. The company's consolidated net profit decreased to 18 million rupees from 30 million rupees in the same period last year. However, revenue slightly increased to 666 million rupees from 655 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739174003000,
            "Source": "earnings"
        },
        {
            "Title": "Brand Concepts Ltd: Indian Luggage Market Poised for Growth Amid Challenges",
            "Summary": "Brand Concepts Ltd reports significant growth with retail sales reaching ₹500 crore. The company's revenue increased by 45% from ₹172 crore in FY 2022-23 to ₹250 crore in FY2023-24. Tommy Hilfiger contributes 90% of retail revenue. The Indian luggage market is expected to generate ₹1,504 crore by 2024, growing at 5.01% CAGR from 2024-2029. However, the industry faces challenges including increased competition and lower average selling prices in the economy segment.",
            "Sentiment": "positive",
            "PublishDate": 1733930172000,
            "Source": "earnings"
        }
    ]
}