{
    "Symbol": "BDL",
    "ISIN": "INE171Z01026",
    "News": [
        {
            "Title": "BDL Extends Additional Charge for Director Production",
            "Summary": "Bharat Dynamics Limited announces extension of additional charge of Director (Production) to Shri D. V. Srinivas Rao for three months from January 1, 2026, as approved by the Appointment Committee of Cabinet.",
            "Sentiment": "neutral",
            "PublishDate": 1770873459358,
            "Source": "stocks"
        },
        {
            "Title": "Bharat Dynamics Q3FY26 Results & Interim Dividend",
            "Summary": "Bharat Dynamics reported Q3FY26 net profit of ₹7,292.20 lakhs with total income of ₹66,380.29 lakhs. Board declared interim dividend of ₹4.50 per share with record date February 9, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769852332377,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharat Dynamics shares decline 2.12% on Friday",
            "Summary": "Bharat Dynamics shares fell 2.12% to ₹1,420.50 amid broader market weakness. The company reported strong FY25 performance with 41.2% sales growth and scheduled board meeting for Q3 results.",
            "Sentiment": "negative",
            "PublishDate": 1769164824120,
            "Source": "stocks"
        },
        {
            "Title": "BDL Board Meet on Jan 31 for Q3FY26 Results & Dividend",
            "Summary": "Bharat Dynamics Limited announces board meeting scheduled for January 31, 2026 to consider Q3FY26 unaudited financial results and potential interim dividend declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1769085192974,
            "Source": "co_actions_results"
        },
        {
            "Title": "India Plans ₹10,000 Crore Missile Agreement With Russia During Putin's Visit",
            "Summary": "India is planning a ₹10,000 crore missile agreement with Russia during President Putin's visit, representing a major defence initiative. This significant defence deal affects India's military procurement strategy and strengthens bilateral defence cooperation between the two nations.",
            "Sentiment": "positive",
            "PublishDate": 1764749758388,
            "Source": "stock"
        },
        {
            "Title": "Bharat Dynamics Projects ₹36,000 Crore Order Book By FY26",
            "Summary": "Bharat Dynamics projects its order book to reach ₹36,000 crore by FY26 while targeting 20-25% yearly growth across all divisions. The defense company plans to double its revenue within the next 2-3 years as part of its expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1764737280226,
            "Source": "order&deals"
        },
        {
            "Title": "Coal India Fined Rs 5.42 Lakh by BSE for Board Composition Non-Compliance",
            "Summary": "Coal India Limited received a fine of Rs 5,42,800 from BSE for non-compliance with Regulation 17(1) of SEBI LODR regarding board composition for the quarter ended September 30, 2025. The company states the non-compliance was beyond management control as board appointments are made by the President of India, and has requested penalty waiver from the exchange.",
            "Sentiment": "negative",
            "PublishDate": 1764340955928,
            "Source": "corporate_governance"
        },
        {
            "Title": "BDL Shares Surge 7% on Strong Q2 Results and Rs 2,100 Crore Defence Contract Win",
            "Summary": "Bharat Dynamics Ltd shares jumped 7.2% to Rs 1,628.60 following robust quarterly earnings with PAT rising 76.2% to Rs 216 crore and revenue doubling to Rs 1,147 crore. The company also secured a Rs 2,095.70 crore contract from the Ministry of Defence for supplying Invar Anti-Tank Missiles to the Indian Army over three years.",
            "Sentiment": "positive",
            "PublishDate": 1763098542889,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Dynamics Secures Rs 2,095.70 Crore Defense Contract for Anti-Tank Missiles",
            "Summary": "Bharat Dynamics Limited signed a contract worth Rs 2,095.70 crore with the Ministry of Defence for supply of Invar Anti-tank missiles to the Indian Army. The defense contractor disclosed this significant order award as part of regulatory compliance requirements.",
            "Sentiment": "positive",
            "PublishDate": 1763047481305,
            "Source": "order&deals"
        },
        {
            "Title": "Bharat Dynamics General Manager M. Dayakar Reddy Retires Upon Superannuation",
            "Summary": "Bharat Dynamics Limited announced that Shri M. Dayakar Reddy, General Manager (M, RTSD), retired on October 31, 2025 after office hours upon reaching superannuation age. The company, which is a Government of India enterprise under the Ministry of Defence, communicated this senior management personnel change to stock exchanges NSE and BSE as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1761913304833,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bharat Dynamics Shares Rise 3% on ₹79,000 Crore Defence Procurement Approval",
            "Summary": "Bharat Dynamics shares opened 3% higher following the Defence Acquisition Council's approval of procurement proposals worth ₹79,000 crore for Indian armed forces equipment. The company is expected to receive significant orders from this approval, including nearly ₹2,000 crore for the Nag Missile System (Tracked) Mk-II for the Indian Army and ₹500-1,000 crore for Advanced Light Weight Torpedoes. Defence analyst Jyoti Gupta from Nirmal Bang expects the company's September quarter results to exceed expectations, anticipating revenue growth potentially higher than the projected 33%. New orders are expected to reflect in revenue from the fourth quarter onwards.",
            "Sentiment": "positive",
            "PublishDate": 1761286765755,
            "Source": "stock"
        },
        {
            "Title": "Bharat Dynamics Plans Rs 12 Billion Investment in Andhra Pradesh Missile Unit",
            "Summary": "Bharat Dynamics is planning to invest up to Rs 12 billion in a missile manufacturing unit in Andhra Pradesh. The investment proposal may be reviewed by the cabinet in their next meeting.",
            "Sentiment": "positive",
            "PublishDate": 1759743520927,
            "Source": "stock"
        },
        {
            "Title": "Bharat Dynamics Reports Strong Q1 Performance with Profit More Than Doubling",
            "Summary": "Bharat Dynamics Ltd. reported consolidated net profit of Rs 18 crore in the June quarter, more than doubling from Rs 7 crore in the same period last year. The defence firm's revenue increased 29.7% to Rs 247.92 crore compared to Rs 191.16 crore in the previous year. However, the company posted an Ebitda loss of Rs 45.4 crore, which was an improvement from the Rs 52.3 crore loss in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1754999055774,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Dynamics Reports ₹1,835 Crore Quarterly Profit, Revenue Rises to ₹24,793 Crore",
            "Summary": "Bharat Dynamics Limited announced its quarterly results with a profit of ₹1,834.98 crore compared to ₹721.63 crore in the same quarter last year. Total revenue increased to ₹24,792.90 crore from ₹19,116.95 crore year-over-year. Sales income from operations grew to ₹23,109.26 crore from ₹18,777.73 crore. Earnings per share stood at ₹0.50 versus ₹0.20 in the previous year quarter. The Board recommended a final dividend of ₹0.65 per equity share for the financial year 2024-25, subject to shareholder approval. The company maintains inventories worth ₹8,331.44 lakh that are non-moving for more than 5 years, backed by advances of ₹36,234.42 lakh from customers.",
            "Sentiment": "positive",
            "PublishDate": 1754995658222,
            "Source": "earnings"
        },
        {
            "Title": "Philippine Officials Consider Additional BrahMos Missile Purchases",
            "Summary": "Philippine officials have indicated interest in purchasing additional BrahMos missiles. The announcement suggests potential expansion of the country's missile defense capabilities through further procurement of the BrahMos missile system.",
            "Sentiment": "positive",
            "PublishDate": 1754538482838,
            "Source": "stock"
        },
        {
            "Title": "BDL Expects Large BrahMos Missile Orders from Indian Air Force and Navy",
            "Summary": "Bharat Dynamics Limited (BDL) anticipates receiving substantial orders for BrahMos supersonic cruise missiles from the Indian Air Force and Navy. The orders are expected to be significant in size for the defense manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1754382444914,
            "Source": "stock"
        },
        {
            "Title": "Bharat Dynamics Schedules Board Meeting on August 12 to Approve Quarterly Financial Results",
            "Summary": "Bharat Dynamics Limited has scheduled a Board of Directors meeting for August 12, 2025, to consider and approve unaudited financial results for the quarter ended June 30, 2025. The company has implemented a trading window closure for dealing in BDL securities from July 1, 2025, until 48 hours after the declaration of the quarterly results. This closure applies to all connected persons under the company's code of Prohibition of Insider Trading.",
            "Sentiment": "neutral",
            "PublishDate": 1753962277509,
            "Source": "corporate_action"
        },
        {
            "Title": "Bharat Dynamics Secures ₹809 Crore ATGM Supply Order from Armoured Vehicles Nigam",
            "Summary": "Bharat Dynamics won a ₹809 crore order from Armoured Vehicles Nigam for ATGM supply, to be executed over three years. The company did not disclose order details citing national security confidentiality. Motilal Oswal initiated coverage with a neutral rating and ₹1,900 price target, appreciating the business model but noting fair valuations. In quarterly results, net profit declined 5.5% to ₹272.7 crore while revenue increased to ₹1,777 crore from ₹854 crore year-on-year. EBITDA fell 5.5% to ₹299 crore with margins contracting to 16.83% from 37.04%. Shares traded 2.02% lower at ₹1,662.8, down 8% over the past month but up 47.13% year-to-date.",
            "Sentiment": "neutral",
            "PublishDate": 1753435623427,
            "Source": "stock"
        },
        {
            "Title": "BDL Secures ₹809 Crore Order",
            "Summary": "BDL has secured an order worth ₹809 crore. No additional details about the nature of the order, timeline, or client were provided.",
            "Sentiment": "positive",
            "PublishDate": 1753428142604,
            "Source": "order&deals"
        },
        {
            "Title": "India Successfully Tests Akash Prime Missile System in Ladakh",
            "Summary": "India's Defence Minister announced the successful destruction of two high-speed aerial unmanned targets in Ladakh using the Akash Prime missile system on July 16. The test demonstrates the effectiveness of India's indigenous air defense capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1752744941000,
            "Source": "default"
        },
        {
            "Title": "Bharat Dynamics: Motilal Oswal Initiates Coverage with 'Neutral' Rating",
            "Summary": "Bharat Dynamics, focused on advanced guided missiles and underwater weapons, has an order book of ~Rs 227 billion and a prospect pipeline of Rs 500 billion. Recent revenue impacts from supply chain disruptions are beginning to resolve.",
            "Sentiment": "neutral",
            "PublishDate": 1752123834000,
            "Source": "normal_news"
        },
        {
            "Title": "Bharat Dynamics Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 405,836 shares of Bharat Dynamics Ltd. occurred on the National Stock Exchange (NSE) for Rs. 81.12 crores. The trade was executed at a price of Rs. 1998.90 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1751609235000,
            "Source": "block_details"
        },
        {
            "Title": "Brazil Expresses Interest in Defence Partnership with India",
            "Summary": "According to the External Affairs Ministry, Brazil has shown interest in forming a defence partnership with India. The country is specifically eyeing India's Akash Air Defence System and Garuda Artillery Guns. This indicates a potential collaboration between the two nations in the defence sector.",
            "Sentiment": "positive",
            "PublishDate": 1751340830000,
            "Source": "default"
        },
        {
            "Title": "Indian Navy Plans Proposals for Minesweepers and QRSAM Systems",
            "Summary": "The Indian Navy is planning to propose the acquisition of minesweepers valued at ₹40,000 crore and Quick Reaction Surface-to-Air Missile (QRSAM) systems worth ₹30,000 crore. Bharat Dynamics Limited (BDL) is likely to be involved in these potential defense contracts.",
            "Sentiment": "positive",
            "PublishDate": 1750929856000,
            "Source": "default"
        },
        {
            "Title": "Indian Army to Receive ₹30,000 Crore QRSAM Air Defence Missile Systems",
            "Summary": "The Indian Army is set to receive Quick Reaction Surface to Air Missile (QRSAM) air defence systems worth ₹30,000 crore. This information was reported by ANI (Asian News International). The QRSAM systems are designed to enhance the army's air defence capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1749525711000,
            "Source": "default"
        },
        {
            "Title": "Indian Army to Receive ₹300 Billion QRASM Air Defense System",
            "Summary": "The Indian Army is set to acquire a new Quick Reaction Surface-to-Air Missile System (QRASM) valued at ₹300 billion. According to ANI, this new air defense missile system is expected to significantly enhance the army's capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1749487026000,
            "Source": "default"
        },
        {
            "Title": "Bharat Dynamics: Defence Stock Soars 1613% in Five Years",
            "Summary": "Bharat Dynamics Ltd, a defence PSU, has seen a 1613% return over five years and 77% year-to-date. Q4 results show 6% fall in net profit, but doubled revenue. Order book stands at Rs 18,852 crore with Rs 20,000 crore pipeline expected. Analysts largely bullish with 5 out of 10 recommending 'buy'.",
            "Sentiment": "positive",
            "PublishDate": 1749171826000,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Dynamics: Q4 Results Below Expectations, Outlook Remains Positive",
            "Summary": "Bharat Dynamics reported 108% YoY revenue growth to Rs 17.8 bn in Q4 FY25. Ebitda declined to Rs 2.9 bn from Rs 3.2 bn in Q4 FY24. Ebitda margin fell to 16.8% from 37% due to higher raw material costs and other expenses. Nirmal Bang maintains 'Hold' rating.",
            "Sentiment": "neutral",
            "PublishDate": 1748514593000,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Dynamics: Nuvama Raises Price Target by 36% Despite Mixed Q4 Results",
            "Summary": "Nuvama Institutional Equities maintains 'Buy' rating on Bharat Dynamics, raising price target to ₹2,250. Q4 revenue doubled to ₹1,777 crore, but EBITDA and net profit fell 5.5%. FY25 order inflows at ₹6,700 crore, with ₹22,800 crore order backlog. Brokerage expects 60% revenue CAGR for FY25-27E, citing eased supply chain disruptions and strong execution momentum.",
            "Sentiment": "positive",
            "PublishDate": 1748413596000,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Dynamics: Q4 Profit Dips, Margins Contract Despite Revenue Surge",
            "Summary": "Bharat Dynamics Ltd.'s Q4 net profit fell 6% to Rs 272.77 crore, despite a 112.2% revenue increase to Rs 1,800.54 crore. EBITDA rose 4% to Rs 322.53 crore, but margins narrowed to 17.9% from 36.6%. Share price dropped over 6% following the results.",
            "Sentiment": "negative",
            "PublishDate": 1748407838000,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Dynamics Ltd: Q4 Profit Dips 5.5% YoY, Revenue Doubles",
            "Summary": "Bharat Dynamics Ltd reported a 5.5% YoY decline in Q4 FY25 PAT to Rs 272.77 crore. Revenue doubled to Rs 1,776.97 crore. Final dividend of Rs 0.65 per share recommended. Stock closed 2.7% higher at Rs 1,959.80 on BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1748403717000,
            "Source": "result"
        },
        {
            "Title": "Bharat Dynamics Reports Q4 Financial Results",
            "Summary": "Bharat Dynamics has reported its Q4 financial results. The company's net profit for the quarter was 2.73 billion rupees, compared to 2.89 billion rupees year-over-year and 1.47 billion rupees quarter-over-quarter. Revenue for Q4 was 17.77 billion rupees, up from 8.54 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1748390450000,
            "Source": "default"
        },
        {
            "Title": "Bharat Dynamics: Q4 Profit Dips 6%, Revenue Surges 112%",
            "Summary": "Bharat Dynamics reported a 6% decrease in Q4 FY25 net profit to Rs 272.77 crore, despite revenue more than doubling to Rs 1,800.54 crore. EBITDA rose 4% to Rs 322.53 crore, but margin narrowed to 17.9%. The company declared a dividend of Rs 0.65 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1748348964000,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Dynamics Reports Q4 Financial Results",
            "Summary": "Bharat Dynamics has released its Q4 financial results. The company's revenue increased to 17.77 billion rupees from 8.54 billion rupees in the same quarter last year. However, EBITDA decreased to 2.99 billion rupees from 3.16 billion rupees year-over-year. The EBITDA margin also declined to 16.82% from 37.04% in the previous year. Net profit for Q4 was 2.73 billion rupees, down from 2.89 billion rupees year-over-year, but up from 1.47 billion rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748346735000,
            "Source": "result"
        },
        {
            "Title": "Bharat Dynamics Awaits Finalization of Anti-Tank Missile Contract",
            "Summary": "Bharat Dynamics is awaiting final vetting of the contract value for the procurement of 500 anti-tank guided missiles for T-90 tanks. Additionally, the government is preparing an order worth Rs 2,000-3,000 crore to purchase Invar missiles from the company.",
            "Sentiment": "positive",
            "PublishDate": 1748319541000,
            "Source": "default"
        },
        {
            "Title": "Bharat Dynamics Ltd: Q4 Results Date and Dividend Announcement Scheduled",
            "Summary": "Bharat Dynamics Ltd. will announce Q4 and FY25 results on May 27, 2025. The Board will also consider final dividend recommendation. Trading window for insiders is closed from April 1 until 48 hours after results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1747979692000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Armed Forces Successfully Use Akash Missile System",
            "Summary": "The Made in India Akash surface-to-air missile air defence system has been effectively utilized by the Indian Armed Forces to counter Pakistani attacks, according to ANI (Asian News International).",
            "Sentiment": "positive",
            "PublishDate": 1746768632000,
            "Source": "default"
        },
        {
            "Title": "Bharat Dynamics: Revenue Soars 40% in FY25, Exports Hit Record High",
            "Summary": "Bharat Dynamics reported a 40% revenue growth to ₹3,300 crore for FY25, with exports contributing ₹1,200 crore, a 640% increase from the previous year. The company secured orders worth ₹6,668 crore, with an order book of ₹22,700 crore as of April 1, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1743587142000,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Dynamics Reports Significant Revenue Growth in FY 2024-25",
            "Summary": "Bharat Dynamics Limited has announced a substantial increase in turnover for the fiscal year 2024-25. The company achieved a turnover of over Rs. 3,300 crore, compared to Rs. 2,369 crore in the previous year, representing a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1743586358000,
            "Source": "result"
        },
        {
            "Title": "BDL Secures Major Order Worth 4,362 Crore Rupees",
            "Summary": "Bharat Dynamics Limited (BDL) has won a significant order valued at 4,362 crore rupees. This substantial contract represents a major business development for the company, potentially boosting its financial outlook and market position.",
            "Sentiment": "positive",
            "PublishDate": 1742975743000,
            "Source": "order&deals"
        },
        {
            "Title": "Bharat Dynamics Limited: Shares Surge on ₹54,000 Crore Defence Acquisition Approval",
            "Summary": "BDL shares rose 2.56% to ₹1,278.90 after Defence Acquisition Council approved proposals worth over ₹54,000 crore, including procurement of Varunastra Torpedoes. The stock hit an intraday high of ₹1,317.65, as investors anticipate BDL's significant role in these new defence contracts.",
            "Sentiment": "positive",
            "PublishDate": 1742538928000,
            "Source": "normal_news"
        },
        {
            "Title": "Bharat Dynamics: Shares Surge Ahead of Key Defence Acquisition Council Meeting",
            "Summary": "Bharat Dynamics shares have risen 3% today, marking an 11% gain over three days. The Defence Acquisition Council is expected to consider proposals for Brahmos Cruise Missiles, Astra air-to-air missiles, and Varunastra torpedoes. Bharat Dynamics manufactures Varunastra Torpedoes.",
            "Sentiment": "positive",
            "PublishDate": 1742462759000,
            "Source": "normal_news"
        },
        {
            "Title": "Bharat Dynamics Expected to Secure $200 Million Missile Deal with Philippines",
            "Summary": "The Indian government anticipates that Bharat Dynamics Limited will finalize a $200 million missile deal with the Philippines this year. This potential agreement signifies a notable expansion of India's defense exports and strengthens diplomatic ties between the two nations.",
            "Sentiment": "positive",
            "PublishDate": 1739427944000,
            "Source": "order&deals"
        },
        {
            "Title": "France to Acquire Pinaka Multi Barrel Rocket Launcher from India",
            "Summary": "The Indian Foreign Ministry has announced that France is set to acquire the Pinaka Multi Barrel Rocket Launcher system from India. This acquisition is being hailed as a significant milestone in the defense relationship between India and France, potentially strengthening their strategic partnership in the defense sector.",
            "Sentiment": "positive",
            "PublishDate": 1739352918000,
            "Source": "order&deals"
        },
        {
            "Title": "Bharat Dynamics Reports Significant Revenue Growth in Q3",
            "Summary": "Bharat Dynamics Limited has reported a substantial increase in its third-quarter revenue. The company's revenue for Q3 reached 8.3 billion rupees, compared to 6 billion rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738821293000,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Dynamics Reports Mixed Q3 Financial Results",
            "Summary": "Bharat Dynamics Limited has reported its third quarter financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 1.27 billion rupees, up from 1.18 billion rupees in the same quarter of the previous year. However, the EBITDA margin decreased to 15.25% from 19.74% year-over-year, indicating a decline in profitability despite higher earnings.",
            "Sentiment": "neutral",
            "PublishDate": 1738821267000,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Dynamics Reports Q3 Net Profit Increase",
            "Summary": "Bharat Dynamics Limited has reported a net profit of 1.47 billion rupees for the third quarter, showing an increase from 1.35 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738821260000,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Dynamics Ltd: Stock Recovers 32% from Recent Lows",
            "Summary": "Bharat Dynamics Ltd (BDL) stock has rebounded 32% from its November 2024 low of Rs 917. It's now trading above key moving averages with potential targets of Rs 1,405 and Rs 1,520. The stock is currently at Rs 1,216, down 5% today.",
            "Sentiment": "positive",
            "PublishDate": 1737531870000,
            "Source": "normal_news"
        },
        {
            "Title": "Bharat Dynamics Ltd: Defence PSU Stock Surges 17% in Three Sessions",
            "Summary": "Bharat Dynamics Ltd shares have gained 17% over three sessions, rising 5% on January 20. The company recently secured a ₹2,960 crore order for medium range surface-to-air missiles. Elara Securities suggests supply chain issues have been resolved through indigenization. The company's order book stands at ₹18,852 crore, with a ₹20,000 crore pipeline for the next 2-3 years. Despite the stock halving from its peak, retail investors have maintained their positions.",
            "Sentiment": "positive",
            "PublishDate": 1737357095000,
            "Source": "normal_news"
        },
        {
            "Title": "Bharat Dynamics Secures Major Contract with Ministry of Defence",
            "Summary": "The Ministry of Defence has signed a contract with Bharat Dynamics Limited for the supply of Medium Range Surface to Air Missiles (MRSAM) for the Indian Navy. The contract is valued at approximately ₹2,960 crore.",
            "Sentiment": "positive",
            "PublishDate": 1737010620000,
            "Source": "order&deals"
        }
    ]
}