{
    "Symbol": "BEDMUTHA",
    "ISIN": "INE844K01012",
    "News": [
        {
            "Title": "Bedmutha Industries Reports Q3 FY26 Loss",
            "Summary": "Bedmutha Industries Limited posted a net loss of ₹382.58 lakhs for Q3 FY26 compared to profit of ₹210.46 lakhs in Q3 FY25. Revenue grew 30.44% to ₹35,683.51 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1770748702251,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bedmutha Industries CS Madhvendra Singh Resigns",
            "Summary": "Bedmutha Industries announces resignation of Company Secretary & Compliance Officer Madhvendra Pratap Singh effective January 31, 2026, to pursue external opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1767627800676,
            "Source": "stocks"
        },
        {
            "Title": "Bedmutha Industries Reports Loss in Q2 FY26 Despite Revenue Growth",
            "Summary": "Bedmutha Industries Limited reported a net loss of Rs. 92.85 lakhs for the quarter ended September 30, 2025, compared to a profit of Rs. 1,059.46 lakhs in the same quarter last year. Revenue from operations increased to Rs. 36,367.27 lakhs from Rs. 25,146.72 lakhs year-on-year. For the half-year period, the company posted a loss of Rs. 426.35 lakhs versus a profit of Rs. 2,060.50 lakhs in the previous year. The company operates in steel and copper segments, with copper contributing Rs. 24,510.23 lakhs and steel contributing Rs. 11,857.03 lakhs to quarterly revenue. Total expenses rose to Rs. 36,543.84 lakhs from Rs. 25,866.20 lakhs in the corresponding quarter. The Board of Directors approved these unaudited financial results in a meeting held on November 12, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762962683614,
            "Source": "earnings"
        },
        {
            "Title": "Bedmutha Industries Reports Loss of Rs 333.50 Lakhs in June 2025 Quarter",
            "Summary": "Bedmutha Industries Limited reported a net loss of Rs 333.50 lakhs for the quarter ended June 30, 2025, compared to a profit of Rs 1,001.04 lakhs in the same quarter last year. Revenue from operations increased to Rs 31,059.95 lakhs from Rs 24,257.58 lakhs year-over-year. The company operates primarily in steel and copper segments, with steel revenue at Rs 10,053.49 lakhs and copper at Rs 21,006.46 lakhs. Total expenses rose to Rs 31,471.17 lakhs, exceeding total income of Rs 31,137.67 lakhs. Basic earnings per share declined to negative Rs 1.03 from positive Rs 3.10 in the previous year quarter. The company has one associate, Ashoka Precon Pvt. Ltd., contributing Rs 3.15 lakhs to consolidated results.",
            "Sentiment": "negative",
            "PublishDate": 1754573060513,
            "Source": "earnings"
        },
        {
            "Title": "Bedmutha Industries Reports Q4 Financial Results",
            "Summary": "Bedmutha Industries has released its Q4 financial results. The company's EBITDA increased to 101 million rupees from 77.8 million rupees year-over-year. The EBITDA margin improved to 3.59% from 3.39% in the same period. Net profit for Q4 was 21 million rupees, down from 68 million rupees year-over-year but unchanged quarter-over-quarter. Revenue for Q4 rose to 2.8 billion rupees from 2.3 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1748008426000,
            "Source": "result"
        },
        {
            "Title": "Bedmutha Industries Reports Mixed Q3 Financial Results",
            "Summary": "Bedmutha Industries has announced its Q3 financial results. The company reported a net profit of 21 million rupees, which is lower compared to 63 million rupees in the same quarter last year (YoY) and 106 million rupees in the previous quarter (QoQ). However, the company's revenue increased to 2.7 billion rupees from 1.92 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739405749000,
            "Source": "earnings"
        },
        {
            "Title": "Bedmutha Industries Reports Q3 Financial Results",
            "Summary": "Bedmutha Industries has announced its financial results for the third quarter. The company reported a net profit of 21 million rupees, which is lower compared to 63 million rupees in the same quarter last year and 106 million rupees in the previous quarter. However, the company's revenue increased to 2.7 billion rupees from 1.92 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739371770000,
            "Source": "earnings"
        },
        {
            "Title": "Bedmutha Industries Reports Decline in Q2 EBITDA",
            "Summary": "Bedmutha Industries has reported a decrease in its Q2 EBITDA, which fell to 68 million rupees from 85 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 2.70% from 4.27% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731330676000,
            "Source": "result"
        },
        {
            "Title": "Bedmutha Industries Reports Strong Q2 Financial Results",
            "Summary": "Bedmutha Industries has announced its Q2 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's net profit increased to 106 million rupees, up from 37 million rupees in the same quarter last year and 100 million rupees in the previous quarter. Revenue also saw a substantial rise, reaching 2.5 billion rupees compared to 1.9 billion rupees in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1731330588000,
            "Source": "result"
        }
    ]
}