{
    "Symbol": "BEL",
    "ISIN": "INE263A01024",
    "News": [
        {
            "Title": "BEL Wins ₹581 Crore Defense Contract",
            "Summary": "Bharat Electronics Limited secures significant new order worth ₹581 crore, strengthening its position in the defense electronics sector and boosting order book.",
            "Sentiment": "positive",
            "PublishDate": 1770371868242,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharat Electronics Maintains FY26 EBITDA Target at 27%",
            "Summary": "Bharat Electronics keeps its FY26 EBITDA margin target at 27% despite higher Q3 margins, expecting less favorable product mix in Q4. R&D spending to exceed INR1,700 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1769660316611,
            "Source": "stocks"
        },
        {
            "Title": "Bharat Electronics Targets 15%+ FY26 Growth",
            "Summary": "Bharat Electronics maintains ambitious FY26 revenue growth target of over 15% while expecting order inflow to exceed INR 27,000 crore, signaling strong business momentum.",
            "Sentiment": "positive",
            "PublishDate": 1769660287552,
            "Source": "stocks"
        },
        {
            "Title": "Bharat Electronics Order Book at ₹730.2 Billion",
            "Summary": "Bharat Electronics reported a substantial order book of ₹730.20 billion at the end of the period, reflecting strong business momentum and robust demand for the company's defense and electronics solutions.",
            "Sentiment": "positive",
            "PublishDate": 1769589776234,
            "Source": "stocks"
        },
        {
            "Title": "Bharat Electronics Q3 Net Profit Jumps 22% to ₹16B",
            "Summary": "Bharat Electronics reported consolidated net profit of ₹16 billion in Q3, marking 22% YoY growth and exceeding analyst estimates of ₹14 billion.",
            "Sentiment": "positive",
            "PublishDate": 1769589731695,
            "Source": "co_actions_results"
        },
        {
            "Title": "India Plans ₹150 Billion Airport Infrastructure Upgrade",
            "Summary": "Airport Authority of India announces massive ₹150 billion investment by 2028 to modernize airport systems and air traffic control technology, with potential opportunities for Bharat Electronics.",
            "Sentiment": "positive",
            "PublishDate": 1769578961462,
            "Source": "stocks"
        },
        {
            "Title": "Singapore Govt Invests ₹3,040 Cr in Bharat Electronics",
            "Summary": "Government of Singapore acquires 1% stake in defence PSU Bharat Electronics for ₹3,040 crore in Q3 FY26. Stock delivers 58% returns over past year with strong order book of ₹75,600 crore.",
            "Sentiment": "positive",
            "PublishDate": 1769505293306,
            "Source": "co_actions_results"
        },
        {
            "Title": "BEL Q3FY26 Preview: Strong Order Book to Drive Growth",
            "Summary": "Bharat Electronics expected to report 16.2% revenue growth to Rs 6,703.6 crore in Q3FY26, with net profit projected to rise 12.3% despite slight margin pressure from strong order book execution.",
            "Sentiment": "positive",
            "PublishDate": 1769482341366,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharat Electronics Wins ₹610 Cr Defense Orders",
            "Summary": "Bharat Electronics secures significant orders worth ₹610 crore across multiple defense segments including communication equipment, medical electronics, thermal imagers, jammers, spare parts, and services.",
            "Sentiment": "positive",
            "PublishDate": 1769147037038,
            "Source": "co_actions_results"
        },
        {
            "Title": "BEL Schedules Q3FY26 Results Conference Call",
            "Summary": "Bharat Electronics Limited announces conference call on January 28, 2026 at 4:00 PM to discuss Q3FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768997030585,
            "Source": "co_actions_results"
        },
        {
            "Title": "BEL Sees ₹25.31 Cr Block Trade on NSE at ₹413.80",
            "Summary": "Bharat Electronics Ltd recorded a significant block trade worth ₹25.31 crores on NSE involving 611,732 shares at ₹413.80 per share, indicating substantial institutional activity in the defense electronics stock.",
            "Sentiment": "neutral",
            "PublishDate": 1768881838588,
            "Source": "co_actions_results"
        },
        {
            "Title": "BEL Reports Strong Order Book of ₹74,453 Crores",
            "Summary": "Bharat Electronics maintains robust order pipeline with ₹14,750 crore orders received till October 2025, targeting ₹27,000 crore annual inflow guidance for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1767970387948,
            "Source": "stocks"
        },
        {
            "Title": "BEL Share Price Target: Expert Analysis & Strategy",
            "Summary": "Market expert Kunal Bothra shares insights on Bharat Electronics Ltd (BEL), which has gained over 5% in two weeks and outperformed PSU defence peers. Analysis covers BUY, SELL or HOLD strategy for short-term investors.",
            "Sentiment": "positive",
            "PublishDate": 1767951370121,
            "Source": "stocks"
        },
        {
            "Title": "BEL Gains 2% After Securing ₹596 Cr Defence Order",
            "Summary": "Bharat Electronics Ltd secured fresh orders worth ₹596 crore for drone detection systems and communication terminals, boosting its order book to over ₹75,600 crore and driving shares up 2%.",
            "Sentiment": "positive",
            "PublishDate": 1767944696183,
            "Source": "co_actions_results"
        },
        {
            "Title": "BEL Wins ₹596 Cr Orders, Q2 Profit Jumps 18%",
            "Summary": "Bharat Electronics secures additional orders worth ₹596 crore for defence equipment including drone systems and communication terminals, while Q2 net profit rises 18% to ₹1,286 crore with revenue growth of 26%.",
            "Sentiment": "positive",
            "PublishDate": 1767935438091,
            "Source": "co_actions_results"
        },
        {
            "Title": "BEL secures Rs 569 cr defence orders, shares surge 48%",
            "Summary": "Bharat Electronics Limited announced additional orders worth Rs 569 crore for drone detection systems and communication equipment, adding to its growing order book amid strong Q2 FY26 performance.",
            "Sentiment": "positive",
            "PublishDate": 1767934025476,
            "Source": "co_actions_results"
        },
        {
            "Title": "BEL Secures ₹596 Crore Defense Order",
            "Summary": "Bharat Electronics Limited (BEL) announced securing a significant defense contract worth ₹596 crores, strengthening its order book and reinforcing its position in the defense electronics sector.",
            "Sentiment": "positive",
            "PublishDate": 1767924702057,
            "Source": "co_actions_results"
        },
        {
            "Title": "BEL Secures Fresh Orders Worth ₹596 Crore",
            "Summary": "Bharat Electronics Limited announces new orders worth ₹596 crore for drone detection systems, mobile communication terminals, software solutions, and other defense equipment since January 1, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767879131586,
            "Source": "co_actions_results"
        },
        {
            "Title": "BEL Wins ₹596 Crore Defense Order Contract",
            "Summary": "Bharat Electronics Limited secures significant defense contract worth ₹5.96 billion, strengthening its position in India's defense manufacturing sector and boosting order book.",
            "Sentiment": "positive",
            "PublishDate": 1767879002493,
            "Source": "co_actions_results"
        },
        {
            "Title": "BEL Board Meeting Set for Jan 28 to Review Q3FY26 Results",
            "Summary": "Bharat Electronics Limited has scheduled its Board of Directors meeting for January 28, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1767778767395,
            "Source": "co_actions_results"
        },
        {
            "Title": "BEL Secures Additional Orders Worth ₹569 Crore",
            "Summary": "Bharat Electronics Limited wins fresh orders worth ₹569 crore for communication equipment, medical electronics, and fire detection systems, adding to its robust order book.",
            "Sentiment": "positive",
            "PublishDate": 1767260664121,
            "Source": "co_actions_results"
        },
        {
            "Title": "BEL Shares in Focus After ₹569 Crore Defence Orders",
            "Summary": "Bharat Electronics Limited shares expected to be in focus after securing additional orders worth ₹569 crore since December 12, covering radars, communication equipment, and fire control systems.",
            "Sentiment": "positive",
            "PublishDate": 1767003077574,
            "Source": "co_actions_results"
        },
        {
            "Title": "BEL Secures Orders Worth ₹776 Crores",
            "Summary": "Bharat Electronics Limited announces additional orders worth ₹776 crores since last disclosure on November 14, 2025, including indigenous counter-drone systems and communication equipment.",
            "Sentiment": "positive",
            "PublishDate": 1765535234572,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharat Electronics Gets ESG Rating of 65 from NSE",
            "Summary": "Bharat Electronics Limited receives an ESG rating of 65 from NSE Sustainability Ratings and Analytics Limited, a SEBI-registered ESG Rating Provider, marking a significant milestone in the company's sustainability journey.",
            "Sentiment": "positive",
            "PublishDate": 1765383978706,
            "Source": "stocks"
        },
        {
            "Title": "BEL and Safran Electronics & Defence Form Joint Venture for HAMMER Weapon Production in India",
            "Summary": "Bharat Electronics Limited (BEL) and Safran Electronics & Defence have signed a joint venture cooperation agreement to produce HAMMER smart precision guided air-to-ground weapons in India. This partnership establishes local manufacturing capabilities for advanced defense weaponry systems in the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1764029009833,
            "Source": "order&deals"
        },
        {
            "Title": "Bharat Electronics Secures ₹871 Crore Defence Orders, Reports Strong Quarterly Growth",
            "Summary": "Bharat Electronics received additional defence orders worth ₹871 crore for fire control systems, thermal imagers, and other equipment, adding to its ₹74,453 crore order book. The company reported quarterly revenue growth of 26% to ₹5,764 crore and net profit increase of 18% to ₹1,286 crore, both exceeding analyst estimates.",
            "Sentiment": "positive",
            "PublishDate": 1763106104645,
            "Source": "order&deals"
        },
        {
            "Title": "Bharat Electronics Secures ₹792 Crore Defence Orders",
            "Summary": "Bharat Electronics has secured orders worth ₹792 crore for defence network upgrades, radio communication systems, radars, and drones.",
            "Sentiment": "positive",
            "PublishDate": 1762765852257,
            "Source": "order&deals"
        },
        {
            "Title": "Bharat Electronics Recovers From Early Losses After Securing Rs 6,650-Crore NTPC Order",
            "Summary": "Bharat Electronics Ltd. shares recovered from opening losses after the company received orders worth Rs 6,650 crore from NTPC Ltd. for engineering, procurement, and construction work in Odisha. The stock opened down 0.86% at Rs 405.30 but turned positive, trading 0.35% higher at Rs 410.30, breaking a three-day declining streak. The company reported strong quarterly results with net profit rising 26% to Rs 1,287.77 crore, beating analyst estimates of Rs 1,085 crore. Revenue increased 25.78% to Rs 5,792.09 crore while EBITDA grew 21.58% to Rs 1,702.17 crore. The stock has gained 36.61% over 12 months and 39.91% year-to-date. Trading volume was 3.69 times the 30-day average. Of 32 analysts covering the stock, 26 maintain buy ratings with an average price target implying 13.9% upside.",
            "Sentiment": "positive",
            "PublishDate": 1762494015962,
            "Source": "stock"
        },
        {
            "Title": "Bharat Electronics Reports Strong Q2 Performance with 15.92% Revenue Growth",
            "Summary": "Bharat Electronics Limited reported revenue from operations of INR 10,180 crores for H1 FY26, marking a 15.92% increase from INR 8,782 crores in the same period last year. Profit before tax rose 21.5% to INR 3,023 crores, while profit after tax increased 20.77% to INR 2,255 crores. EBITDA margin improved to 30.15% from 27.26% in the previous year. The company's order book stands at INR 75,600 crores as of the conference date, with new orders worth INR 14,750 crores acquired during the financial year. Management confirmed guidance of 15% plus revenue growth and 27% plus EBITDA margins. The company expects the QRSAM order before March and has received emergency procurement orders worth INR 1,350 crores, with another INR 2,000 crores in pipeline. BEL is investing INR 1,400 crores in a Defense System Integration Complex in Andhra Pradesh for manufacturing QRSAM and other strategic systems. The company maintains equal focus across Army, Navy, and Air Force segments and targets export revenue to reach 10% of total turnover in the long term.",
            "Sentiment": "positive",
            "PublishDate": 1762286209671,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Electronics Shares Drop Despite 26% Profit Jump in Q2 Results",
            "Summary": "Bharat Electronics Ltd. shares fell 2% to Rs 416.40 despite reporting strong quarterly results. The defence PSU posted a 26% increase in net profit to Rs 1,287.77 crore, beating analyst estimates of Rs 1,085 crore. Revenue grew 25.78% to Rs 5,792.09 crore, while EBITDA rose 21.58% to Rs 1,702.17 crore. Morgan Stanley maintained its bullish stance, citing the company's robust order book and strategic shift towards high-margin defence products. Jefferies called the results an all-around beat, highlighting BEL's position as market leader in domestic defence electronics. The stock has gained 43.82% year-to-date. Of 32 analysts tracking the company, 27 have buy ratings with a consensus target price implying 11.2% upside.",
            "Sentiment": "positive",
            "PublishDate": 1762145170322,
            "Source": "earnings"
        },
        {
            "Title": "BEL Sets Revenue Growth Target Above 15% with EBITDA Margin Over 27%",
            "Summary": "BEL has confirmed its revenue growth target exceeding 15% and EBITDA margin target over 27%. The company expects order inflow to reach ₹57,000 crore, which includes ₹27,000 crore excluding QRSAM orders.",
            "Sentiment": "positive",
            "PublishDate": 1761992084425,
            "Source": "stock"
        },
        {
            "Title": "Bharat Electronics Reports Strong Q2 Performance with Revenue Growth and Record Order Book",
            "Summary": "Bharat Electronics reported Q2 revenue of 57.6 billion rupees, up from 45.8 billion rupees year-over-year, exceeding estimates of 52.58 billion rupees. The company's Q2 EBITDA reached 16.95 billion rupees compared to 13.9 billion rupees in the previous year, surpassing estimates of 14.41 billion rupees. However, EBITDA margin declined to 29.41% from 30.29% year-over-year, falling short of the estimated 30.3%. Q2 net profit increased to 12.9 billion rupees from 10.9 billion rupees year-over-year, beating estimates of 11.18 billion rupees. The company's order book reached 744.53 billion rupees as of October 1st.",
            "Sentiment": "positive",
            "PublishDate": 1761896174781,
            "Source": "stock"
        },
        {
            "Title": "Bharat Electronics Secures ₹732 Crore Orders for Defense Technology Solutions",
            "Summary": "Bharat Electronics has secured orders worth ₹732 crore across multiple defense technology segments. The orders cover software defined radios, tank subsystems, communication equipment, and cyber security solutions.",
            "Sentiment": "positive",
            "PublishDate": 1761820770216,
            "Source": "order&deals"
        },
        {
            "Title": "Bharat Electronics Announces Q2 Results Date for October 31",
            "Summary": "Bharat Electronics Ltd. (BEL) will announce its second quarter and half-year results on October 31. The defense electronics manufacturer will hold a board meeting to approve unaudited financial results for the period ended September 30. An earnings call is scheduled for 4 p.m. the same day with Chairman and Managing Director Manoj Jain and Director Finance Damodar Bhattad S. The trading window for designated persons has been closed since October 1 and will remain closed until 48 hours after results declaration. In the previous quarter, BEL reported consolidated net profit of Rs 969.05 crore, up 22.5% year-on-year, with total income of Rs 4,603.06 crore, growing 3.5% year-on-year. BEL shares closed 1.44% lower at Rs 407.60, having gained 38.69% year-to-date and over 43% in the past year.",
            "Sentiment": "neutral",
            "PublishDate": 1761733836044,
            "Source": "earnings"
        },
        {
            "Title": "Indian Army Signs Agreement for Homegrown Software Defined Radios from DRDO and BEL",
            "Summary": "The Indian Army has signed an agreement for software defined radios that are domestically developed by DRDO and manufactured by BEL. These represent the first homegrown software defined radios for the Indian Army.",
            "Sentiment": "positive",
            "PublishDate": 1761642698034,
            "Source": "order&deals"
        },
        {
            "Title": "Bharat Electronics Limited Receives ESG Rating of 73.8 from CARE Ratings",
            "Summary": "Bharat Electronics Limited announced that CARE Ratings Limited has assigned an ESG (Environmental, Social, and Governance) rating of 73.8 to the company. The rating was published by the rating agency on October 27, 2025. The company informed stock exchanges NSE and BSE about this development as part of regulatory disclosure requirements.",
            "Sentiment": "positive",
            "PublishDate": 1761636615971,
            "Source": "stock"
        },
        {
            "Title": "BEL Secures Rs. 633 Crore Defense Equipment Order from Cochin Shipyard Limited",
            "Summary": "Bharat Electronics Limited (BEL) has secured an order worth Rs. 633 crore from Cochin Shipyard Limited for defense equipment. The order represents a significant contract win for BEL in the defense sector.",
            "Sentiment": "positive",
            "PublishDate": 1761135388536,
            "Source": "order&deals"
        },
        {
            "Title": "Bharat Electronics Gets Andhra Pradesh Approval for Rs 2,500 Crore Defence Manufacturing Complex",
            "Summary": "The Andhra Pradesh government has approved Bharat Electronics Ltd.'s proposal to establish an integrated defence manufacturing complex in Gorantla, Sri Sathya Sai district. The project involves a total investment of Rs 2,500 crore, split into two phases - Rs 1,400 crore in the first phase and Rs 1,100 crore in the second. The state government has allotted 914 acres of land and will provide a capital subsidy of up to 45% on capital expenditure under the Andhra Pradesh Industrial Development Policy 2024-29, to be released over 15 years based on achieving investment and operational milestones. Bharat Electronics aims to complete both phases by March 2029. The complex will cater to multiple segments of the defence and aerospace sector. Separately, Bharat Electronics has secured orders worth Rs 644 crore between July 30 and September 1, including data centres, ship fire control systems, tank navigation systems, communication equipment, and electronic voting machines.",
            "Sentiment": "positive",
            "PublishDate": 1760550936672,
            "Source": "stock"
        },
        {
            "Title": "Bharat Electronics Limited Secures Orders Worth Rs. 592 Crore",
            "Summary": "Bharat Electronics Limited (BEL), a Navratna Defence Public Sector Undertaking, has secured additional orders worth Rs. 592 Crore since its last disclosure on September 29, 2025. The major orders include tank subsystems and overhauling, communication equipment, combat management system, ship data network, train collision avoidance system (Kavach), laser dazzler, jammers, upgrades, spares, and services. The company announced this development through a press release dated October 15, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760532116822,
            "Source": "stock"
        },
        {
            "Title": "BEL Secures ₹3000 Crore Order From Indian Air Force",
            "Summary": "BEL has secured a ₹3000 crore order from the Indian Air Force. This represents a significant contract win for the defense electronics company.",
            "Sentiment": "positive",
            "PublishDate": 1760519464367,
            "Source": "order&deals"
        },
        {
            "Title": "BEL Schedules Q2 Financial Results Review for October 31",
            "Summary": "BEL has announced plans to review its Q2 financial results on October 31. The company will be examining its quarterly performance during this scheduled review.",
            "Sentiment": "neutral",
            "PublishDate": 1759819706116,
            "Source": "earnings"
        },
        {
            "Title": "BEL Shares Rise 2% After Goldman Sachs Initiates Buy Rating with Rs 455 Target",
            "Summary": "Bharat Electronics Ltd (BEL) shares gained 2% to Rs 414 following Goldman Sachs initiating coverage with a Buy rating and price target of Rs 455, indicating 12% upside potential. The stock has risen nearly 5% over four consecutive sessions. Goldman Sachs highlighted BEL's strong positioning in order execution and diversified platform exposure, making it relatively insulated from defence spending declines. The company is expected to benefit from projects like QRSAM and Project Kusha, plus increased government focus on defence electronics under TPCR-25. BEL's average annual order inflow is estimated at Rs 31,700 crore through FY28E, with order book expected to reach Rs 92,700 crore by FY28E. The company recently announced additional orders worth Rs 1,092 crore for EW systems upgrades, defence network upgrades, and communication equipment. BEL reported 25% YoY growth in standalone profit to Rs 969.13 crore and 5.2% revenue growth to Rs 4,416.83 crore in quarterly results. Shares have gained 44% over six months.",
            "Sentiment": "positive",
            "PublishDate": 1759480744604,
            "Source": "stock"
        },
        {
            "Title": "Bharat Electronics Block Trade Worth Rs. 61.86 Crores on NSE",
            "Summary": "Bharat Electronics Ltd. witnessed a block trade on NSE involving approximately 1,523,825 shares at Rs. 405.95 per share, totaling Rs. 61.86 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1759309452557,
            "Source": "order&deals"
        },
        {
            "Title": "Bharat Electronics Secures ₹1,092 Crore Defence Orders, Reports Mixed Quarterly Results",
            "Summary": "Bharat Electronics Limited (BEL) announced additional orders worth ₹1,092 crore covering Electronic Warfare system upgrades, defence network upgrades, tank sub-systems, TR modules, communication equipment, electronic voting machines, and spares and services. The company's quarterly revenue increased 5.2% to ₹4,417 crore, missing estimates of ₹4,812 crore. However, EBITDA rose 32.2% to ₹1,240.4 crore, exceeding the ₹1,178 crore estimate. EBITDA margin expanded to 28.1% from 22.3% previously, beating the expected 24.5%. BEL's order book stands at ₹71,650 crore, with order inflows of ₹7,348 crore representing 27% of the full-year guidance of ₹27,000 crore. Shares closed at ₹400.05, up 1.05%.",
            "Sentiment": "positive",
            "PublishDate": 1759151954217,
            "Source": "stock"
        },
        {
            "Title": "BEL Secures Orders Worth ₹1,092 Crore",
            "Summary": "Bharat Electronics Limited (BEL) has secured new orders valued at ₹1,092 crore. The announcement indicates the company has won contracts totaling this amount, though specific details about the nature of the orders, timeline, or clients were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1759148851131,
            "Source": "order&deals"
        },
        {
            "Title": "Bharat Electronics Shares Rise on Rs 30,000-Crore Army Missile Defense Contract",
            "Summary": "Bharat Electronics shares gained 2.85% to Rs 407.2 following reports that the Indian Army issued a Rs 30,000-crore tender for missile defense systems. The army will acquire five to six regiments of 'Anant Shastra' surface-to-air missiles for air defense along borders with Pakistan and China. The missile, developed by Defence Research and Development Organisation, will be co-produced by BEL and Bharat Dynamics. Motilal Oswal analysts noted the order enhances BEL's order book to over Rs 1 lakh crore, with execution starting from fiscal 2027. The brokerage set a target price of Rs 490, indicating 24% upside potential. BEL shares have risen 38% over 12 months and year-to-date. Of 28 analysts tracking the stock, 24 recommend 'buy', two suggest 'hold', and three advise 'sell'.",
            "Sentiment": "positive",
            "PublishDate": 1759121624690,
            "Source": "stock"
        },
        {
            "Title": "BEL Secures Additional Orders Worth Rs. 712 Crore",
            "Summary": "Bharat Electronics Limited (BEL), a Navratna Defence Public Sector Undertaking, has secured additional orders worth Rs. 712 crore since September 1, 2025. The major orders include IT Infrastructure & Cyber Security Solutions, ESM Systems, Block Chain Solution Platform, Communication Equipment, Spares, and Services. The company announced this development through a press release dated September 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758022042991,
            "Source": "stock"
        },
        {
            "Title": "Bharat Electronics Announces Final Dividend Payment of Rs 0.9 Per Share for FY25",
            "Summary": "Bharat Electronics Ltd. (BEL) will pay a final dividend of Rs 0.9 per equity share (90% of face value) for FY25 to eligible shareholders on September 23. The dividend was declared at the company's 71st Annual General Meeting held on August 28, with August 14 set as the record date. BEL reported strong Q1FY26 results with consolidated net profit rising 22.5% year-on-year to Rs 969.05 crore, while total income increased 3.5% to Rs 4,603.06 crore. The company had previously declared an interim dividend of Rs 1.5 per share with a March 11, 2025 record date. BEL shares were trading 0.37% higher at Rs 389.50 and have gained 4.05% over the last five trading sessions.",
            "Sentiment": "positive",
            "PublishDate": 1757567156755,
            "Source": "corporate_action"
        },
        {
            "Title": "Bharat Electronics Sets September 23 as Payment Date for Final Dividend of ₹0.90 Per Share",
            "Summary": "Bharat Electronics Limited announced that the final dividend of ₹0.90 (90%) per equity share for financial year 2024-25 will be paid on September 23, 2025. The dividend was declared at the company's 71st Annual General Meeting held on August 28, 2025, and will be distributed to eligible shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1757420706841,
            "Source": "corporate_action"
        },
        {
            "Title": "BEL Secures Orders Worth Rs. 644 Crore",
            "Summary": "BEL has received orders valued at Rs. 644 crore.",
            "Sentiment": "positive",
            "PublishDate": 1756726341905,
            "Source": "order&deals"
        }
    ]
}