{
    "Symbol": "BELLACASA",
    "ISIN": "INE344T01014",
    "News": [
        {
            "Title": "Bella Casa Fashion Responds to NSE, BSE Fine",
            "Summary": "Bella Casa Fashion & Retail Limited addresses regulatory fine of ₹1.41 lakh imposed by NSE and ₹1.49 lakh by BSE for non-compliance with director age regulations, seeking waiver.",
            "Sentiment": "negative",
            "PublishDate": 1770480725861,
            "Source": "stocks"
        },
        {
            "Title": "Bella Casa Fashion Q3FY26 Net Profit Rises 26.9%",
            "Summary": "Bella Casa Fashion & Retail reported Q3FY26 net profit of ₹445.44 lakhs, up 26.9% YoY. Revenue grew 11.2% to ₹8,981.08 lakhs despite sequential decline from Q2FY26.",
            "Sentiment": "positive",
            "PublishDate": 1770466935324,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bella Casa Fashion Retail Fined Rs. 2.90 Lakh by BSE and NSE for Director Age Compliance Violation",
            "Summary": "Bella Casa Fashion Retail Limited received fines totaling Rs. 2,90,280 from BSE (Rs. 1,48,680) and NSE (Rs. 1,41,600) for non-compliance with SEBI regulations regarding appointment of a Non-Executive Director who has attained seventy-five years of age. The company states that shareholders had already approved the director's appointment through special resolution in their Annual General Meeting held on September 16, 2025, and is requesting waiver of the fines from both exchanges.",
            "Sentiment": "negative",
            "PublishDate": 1764401339352,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bella Casa Fashion Retail Reports 20% Sales Growth and 40% Profit Jump in H1 FY26",
            "Summary": "Bella Casa Fashion Retail Limited reported strong financial performance for the first half of FY26, with sales reaching Rs. 215.9 crores and profits of Rs. 11.1 crores, representing growth of 20% and 40% year-on-year respectively. The company generated Rs. 41 crores in free cash flow from operations and invested Rs. 51 crores in capital expenditure to double capacity over the next few years. The company maintains a strong balance sheet with negligible net debt of Rs. 6 crores and achieved a ROCE of 19%. Operationally, capacity utilization stood at 70% during the quarter, while inventory levels reached multi-year lows due to a shift to Just-in-Time operations. The company has completed its strategic shift away from Home Furnishing to focus on the Apparel business, targeting growth through deeper client penetration, new client onboarding, and expansion into new domestic and international markets.",
            "Sentiment": "positive",
            "PublishDate": 1762610692711,
            "Source": "earnings"
        },
        {
            "Title": "Bella Casa Fashion & Retail Reports 39% Jump in Q2 Net Profit to 64M Rupees",
            "Summary": "Bella Casa Fashion & Retail reported net profit of 64 million rupees for Q2, up from 46 million rupees in the same period last year. Revenue increased to 1.26 billion rupees from 1.07 billion rupees year-over-year. EBITDA rose to 104.3 million rupees compared to 88.9 million rupees previously. However, EBITDA margin declined slightly to 8.28% from 8.33% in the prior year period.",
            "Sentiment": "positive",
            "PublishDate": 1762604586604,
            "Source": "earnings"
        },
        {
            "Title": "Bella Casa Fashion & Retail Reports 18.3% Revenue Growth and 31.5% Profit Surge in Latest Quarter",
            "Summary": "Bella Casa Fashion & Retail Limited reported total income of Rs 8,757.75 lakhs for the quarter ended June 30, 2025, representing an 18.3% increase compared to the same quarter previous year. Net profit before tax reached Rs 629.94 lakhs, marking a 31.5% year-on-year growth. Net profit after tax stood at Rs 470.09 lakhs. The company's earnings per share was Rs 2.91 for the quarter. While total income decreased slightly from the previous quarter's Rs 9,067.14 lakhs, profit before tax improved from Rs 524.91 lakhs. The Jaipur-based fashion and retail company is listed on BSE and NSE with equity share capital of Rs 1,338.75 lakhs. The results were approved by the Board of Directors on August 07, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754746470885,
            "Source": "earnings"
        },
        {
            "Title": "Bella Casa Fashion & Retail Approves Quarterly Results and Sets AGM Date for September 16",
            "Summary": "Bella Casa Fashion & Retail Ltd's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025. The company reappointed M/s. Ranjan Mehta & Associates Chartered Accountants as Internal Auditor for Financial Year 2025-26. The Board approved the Director's Report, Corporate Governance Report and Management Discussion and Analysis Report for the year ended March 31, 2025. The 29th Annual General Meeting has been scheduled for September 16, 2025 at 1:00 PM through video conferencing. The company will close its register of members from September 10-16, 2025, with September 9, 2025 set as the record date for dividend entitlement. E-voting will be available from September 13-15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754581236284,
            "Source": "corporate_action"
        },
        {
            "Title": "Bella Casa Fashion & Retail Approves Quarterly Results and Schedules 29th AGM for September 16",
            "Summary": "Bella Casa Fashion & Retail Ltd's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025, during a meeting held on August 7, 2025. The company reappointed M/s. Ranjan Mehta & Associates Chartered Accountants as internal auditors for FY 2025-26 and approved various annual reports including Director's Report and Corporate Governance Report for the year ended March 31, 2025. The 29th Annual General Meeting is scheduled for September 16, 2025, at 1:00 PM through video conferencing. The company set September 9, 2025, as the record date for dividend entitlement and announced closure of share transfer books from September 10-16, 2025. E-voting will be available from September 13-15, 2025, for shareholders holding shares as of the cut-off date.",
            "Sentiment": "neutral",
            "PublishDate": 1754580432192,
            "Source": "earnings"
        },
        {
            "Title": "Bella Casa Fashion & Retail Reports 42% Jump in Q1 Net Profit",
            "Summary": "Bella Casa Fashion & Retail reported a net profit of 47 million rupees in Q1, representing a significant increase from 33 million rupees in the same period last year. The company's revenue also grew to 899 million rupees compared to 739 million rupees year-over-year, indicating strong operational performance across both profitability and top-line growth.",
            "Sentiment": "positive",
            "PublishDate": 1754579092086,
            "Source": "earnings"
        },
        {
            "Title": "Bella Casa Fashion & Retail to Acquire Land in Jaipur",
            "Summary": "Bella Casa Fashion & Retail has announced plans to purchase 1,934 square meters of land in the Sitapura Industrial Area of Jaipur. The company states that this acquisition is intended to support its future growth plans.",
            "Sentiment": "positive",
            "PublishDate": 1752248312000,
            "Source": "default"
        }
    ]
}