{
    "Symbol": "BELRISE",
    "ISIN": "INE894V01022",
    "News": [
        {
            "Title": "Belrise Industries Forms UK Subsidiary for Aerospace",
            "Summary": "Belrise Industries Limited announces incorporation of step-down wholly-owned subsidiary Belrise UK Holdings Limited in London on February 6, 2026, focusing on air and spacecraft manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1770476355045,
            "Source": "co_actions_results"
        },
        {
            "Title": "Belrise Industries Q3 FY26 Results & Merger Approval",
            "Summary": "Belrise Industries reports 8% revenue growth to INR23,405 million in Q3 FY26, with 26% jump in adjusted PAT to INR1,268 million. Board approves merger of promoter entities Badve Autocomps and Eximius Infra Tech.",
            "Sentiment": "positive",
            "PublishDate": 1770455100487,
            "Source": "co_actions_results"
        },
        {
            "Title": "Belrise Industries Q3FY26 Earnings Call on Feb 2",
            "Summary": "Belrise Industries Limited schedules earnings conference call for February 2, 2026 at 9:30 AM IST to discuss Q3FY26 results with analysts and investors following board meeting on January 31, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769524794020,
            "Source": "co_actions_results"
        },
        {
            "Title": "Belrise Industries Acquires Euro 350K Aerospace Assets",
            "Summary": "Belrise Industries Limited acquired aerospace equipment worth Euro 350,000 through subsidiaries via French court liquidation process to expand into aerospace and defence sector partnerships.",
            "Sentiment": "positive",
            "PublishDate": 1769102713130,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBI Mutual Fund acquires 5.76% stake in Belrise Industries",
            "Summary": "SBI Mutual Fund acquired 5,12,92,092 shares of Belrise Industries on December 23, 2025, representing 5.76% of the company's paid-up share capital through market purchase.",
            "Sentiment": "neutral",
            "PublishDate": 1766732596153,
            "Source": "co_actions_results"
        },
        {
            "Title": "Belrise Industries Promoter Group Sells 6.56% Stake",
            "Summary": "Sumedh Tools Private Limited, part of Belrise Industries' promoter group, sold 5.83 crore equity shares representing 6.56% stake through block deal on December 23, 2025. Sale part of stake rationalisation.",
            "Sentiment": "neutral",
            "PublishDate": 1766477300077,
            "Source": "co_actions_results"
        },
        {
            "Title": "Belrise Industries Corrects Strategic Agreement Date",
            "Summary": "Belrise Industries clarifies that its strategic agreement with Israel's Plasan Sasa was signed on December 22, 2025, not December 18 as previously reported, for ATEMM defense platforms.",
            "Sentiment": "neutral",
            "PublishDate": 1766421867588,
            "Source": "co_actions_results"
        },
        {
            "Title": "Belrise Industries Forms French Defense Subsidiary",
            "Summary": "Belrise Industries incorporates step-down wholly-owned subsidiary Belrise SDM in France with €100,000 share capital for defense, aerospace and related technology activities.",
            "Sentiment": "positive",
            "PublishDate": 1765870597061,
            "Source": "co_actions_results"
        },
        {
            "Title": "Belrise Industries Announces Leadership Transition",
            "Summary": "Belrise Industries announces superannuation of CHRO Lalitendru Samanta on December 20, 2025, with Vaibhav Joshi taking over as interim CHRO from December 21, 2025. Joshi brings 27 years of HR experience.",
            "Sentiment": "neutral",
            "PublishDate": 1765797403972,
            "Source": "stocks"
        },
        {
            "Title": "Belrise Industries Reports Record Quarterly PAT of INR 1,330 Million, Wins Multiple New Orders Across Segments",
            "Summary": "Belrise Industries achieved record quarterly results with PAT reaching INR 1,330 million and total revenue of INR 23,535 million (up 14% year-on-year), driven by strong demand across automotive segments and benefits from GST 2.0. The company secured significant new orders including chassis and BIW components for a leading two-wheeler OEM's EV platform, 37 BIW parts for an Indian passenger vehicle OEM's SUV platform, and expanded into solar structures and defense segments as a single-source supplier.",
            "Sentiment": "positive",
            "PublishDate": 1763467729882,
            "Source": "earnings"
        },
        {
            "Title": "Belrise Industries Reports No Deviations in IPO Fund Utilization for September Quarter",
            "Summary": "Belrise Industries submitted its quarterly IPO fund utilization report showing no deviations from stated objectives, with Rs 15,960.21 million used for debt repayment and Rs 2,532.03 million deployed for general corporate purposes during the September 2025 quarter. The company's monitoring agency CRISIL confirmed proper utilization of proceeds from the Rs 21,500 million IPO that was listed in May 2025, with Rs 956.13 million remaining unutilized and parked in bank accounts.",
            "Sentiment": "neutral",
            "PublishDate": 1763173163028,
            "Source": "stock"
        },
        {
            "Title": "Bellrise Industries Reports 20% Revenue Growth, Targets 25% CAGR Through Specialty Compounds Expansion",
            "Summary": "Bellrise Industries reported Q2FY26 revenue of ₹324 crores, marking a 20% year-on-year increase. The company has set an ambitious target of achieving 25% compound annual growth rate over the next three years through expansion in high-margin specialty compounds and engineering plastics. Bellrise is commissioning a new manufacturing unit in Gujarat with 20,000 tonnes capacity and exploring export opportunities in European Union and Latin American markets. The company's growth strategy focuses on margin expansion through automation and development of sustainable materials portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1762876519877,
            "Source": "stock"
        },
        {
            "Title": "Belrise Industries Reports Q2 FY26 Results and Approves Subsidiary Merger Scheme",
            "Summary": "Belrise Industries announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported standalone revenue from operations of Rs. 1,802.02 million for the quarter, with profit after tax of Rs. 1,225.63 million. For the half-year period, standalone revenue reached Rs. 3,539.99 million with profit after tax of Rs. 2,253.91 million. The Board also approved a scheme of amalgamation between H One India Private Limited, its wholly-owned subsidiary, and Belrise Industries Limited. The company incorporated a new wholly-owned subsidiary, Belrise Defence and Aerospace Private Limited, in August 2025. Earnings per share for the quarter stood at Rs. 1.50 on a face value of Rs. 5 per share.",
            "Sentiment": "positive",
            "PublishDate": 1762869392785,
            "Source": "earnings"
        },
        {
            "Title": "Belrise Industries Reports Higher Q2 EBITDA and Margin Growth",
            "Summary": "Belrise Industries reported Q2 EBITDA of 2.96 billion rupees compared to 2.4 billion rupees in the same period last year. The company's EBITDA margin improved to 12.59% from 11.76% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762868365274,
            "Source": "earnings"
        },
        {
            "Title": "Belrise Industries Reports 77% Jump in Quarterly Net Profit to 1.3 Billion Rupees",
            "Summary": "Belrise Industries reported consolidated net profit of 1.3 billion rupees for the quarter, compared to 733 million rupees in the same period last year. The company's revenue increased to 23.5 billion rupees from 20.7 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762867589513,
            "Source": "earnings"
        },
        {
            "Title": "Belrise Industries Schedules Earnings Conference Call for November 12, 2025",
            "Summary": "Belrise Industries Limited has announced an earnings conference call with analysts and investors scheduled for November 12, 2025 at 3:30 PM IST. The call follows the company's board meeting on November 11, 2025 to consider standalone and consolidated financial results for the quarter and half year ended September 30, 2025. Key participants include Managing Director Shrikant Badve, General Manager Sumedh Badve, Chief Financial Officer Rahul Ganu, and Chief Marketing Officer Sunil Kulkarni. The company has provided access numbers for multiple countries and requires pre-registration for participation.",
            "Sentiment": "neutral",
            "PublishDate": 1762281906454,
            "Source": "corporate_action"
        },
        {
            "Title": "Belrise Industries Shareholders Approve Re-appointment of Two Directors for Five-Year Terms",
            "Summary": "Belrise Industries Limited shareholders approved the re-appointment of two key directors at their 29th Annual General Meeting held on September 23, 2025. Mr. Ashok Vishnu Tagare was re-appointed as Non-Executive Director, while Mrs. Supriya Shrikant Badve was re-appointed as Whole-time Director (designated as Executive Director) for a five-year term from March 14, 2026 to March 13, 2031. Mr. Tagare holds a mechanical engineering degree and has over 32 years of experience in industrial engineering, drawing and designing across various companies. Mrs. Supriya Badve, aged 55, holds a master's degree in science and has over 16 years of experience in management and finance. She is responsible for overall business management and has received multiple industry awards including business endeavour recognition and best industrialist award. Mrs. Badve is the spouse of Mr. Shrikant Shankar Badve, who serves as Managing Director of the company.",
            "Sentiment": "positive",
            "PublishDate": 1758738308318,
            "Source": "corporate_governance"
        },
        {
            "Title": "Belrise Industries Founder Shrikant Badve Joins India's Billionaire Club as Stock Hits Record High",
            "Summary": "Shrikant Badve, founder and managing director of Belrise Industries, has become a billionaire as the company's shares reached an all-time high of Rs 162.70, representing an 81% increase from its May issue price of Rs 90. Badve's 59.56% stake of 53 crore shares is valued at Rs 8,623 crore. The stock rose 5.6% on Tuesday and has gained 11% for the week. Badve founded Belrise Group in 1988 with three workers, which now employs over 8,000 people across 17+ manufacturing units with annual turnover exceeding Rs 7,000 crore. The company specializes in automotive components for various vehicle types and holds a 24% market share in India's two-wheeler metal components segment, ranking among the top three players.",
            "Sentiment": "positive",
            "PublishDate": 1758612895169,
            "Source": "stock"
        },
        {
            "Title": "Belrise Industries Anticipates Strong Demand Recovery from Proposed GST Reforms",
            "Summary": "Automotive component manufacturer Belrise Industries expects significant demand recovery following proposed GST reforms, particularly benefiting the automotive sector. Promoter Sumedh Badve stated that lower prices from GST rate reductions will benefit Original Equipment Manufacturers and customers, describing it as a 'positive demand booster' for automotive growth. The GST Council is expected to decide on reducing tax rates on over 150 items, moving goods from 12% and 18% slabs to 5% or zero GST to boost consumption. Badve noted the changes would drive volume growth while margins remain stable. The company has limited US exposure, reducing concerns about Trump tariffs, and exports to Europe, South America, Africa, and Southeast Asia with robust demand continuing. Badve mentioned that improving India-China relations could ease raw material issues for auto component manufacturers and drive EV growth further. Belrise Industries shares traded at Rs 136.75, down 0.62% on the NSE.",
            "Sentiment": "positive",
            "PublishDate": 1756872214797,
            "Source": "stock"
        },
        {
            "Title": "Belrise Industries Incorporates Wholly-Owned Subsidiary for Defence and Aerospace Business",
            "Summary": "Belrise Industries Limited has incorporated a wholly-owned subsidiary named Belrise Defence & Aerospace Private Limited on August 28, 2025, with CIN U32900MH2025PTC455551. The board approved the incorporation on August 11, 2025. The subsidiary will operate in the defence, space, aerospace and allied industry, focusing on engineering and technologies involving mechanical, optical, electrical, electronic, software and other technologies. The business aligns with Belrise Industries' main line of business. The company will hold 100% shareholding in the subsidiary through cash consideration for share subscription.",
            "Sentiment": "positive",
            "PublishDate": 1756383087264,
            "Source": "corporate_action"
        },
        {
            "Title": "Belrise Industries Reports 27% Revenue Growth in Q1 with Strong Performance Across Key Metrics",
            "Summary": "Belrise Industries Limited submitted its quarterly Key Performance Indicators showing revenue from operations of ₹22,622.08 million, representing a 27.02% growth compared to ₹17,809.71 million in the same quarter last year. The company achieved an EBITDA of ₹2,805.21 million with a margin of 12.40%, while profit after tax increased to ₹1,116.80 million from ₹715.58 million, resulting in a PAT margin of 4.94%. The company's revenue breakdown shows 2-wheelers contributing 64.11% of total revenue, while India operations account for 76.64% and international operations 23.36%. Return on Average Equity stood at 10.20% and Return on Average Capital Employed at 14.91%. The company currently operates 18 manufacturing plants compared to 15 in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755522410361,
            "Source": "stock"
        },
        {
            "Title": "Belrise Industries Sets August 22 Record Date for ₹0.55 Final Dividend",
            "Summary": "Belrise Industries has set August 22, 2025 as the record date for determining shareholder eligibility for a final dividend of ₹0.55 per equity share for the financial year ended March 31, 2025. The dividend represents 11% on equity shares of ₹5 each and requires approval at the Annual General Meeting scheduled for September 23, 2025. If approved by shareholders, the dividend payment will be made on September 28, 2025, subject to tax deduction at source. The dividend will be paid to beneficial owners holding dematerialized shares and members holding physical shares as per records at the close of business on the record date.",
            "Sentiment": "positive",
            "PublishDate": 1755082516395,
            "Source": "corporate_action"
        },
        {
            "Title": "Belrise Industries Makes Earnings Call Audio Recording Available for Quarter Ended June 30, 2025",
            "Summary": "Belrise Industries Limited announced that the audio recording of its earnings call discussing unaudited financial results for the quarter ended June 30, 2025 is now available. The earnings call was conducted on August 12, 2025, and the recording can be accessed through the company's website under the 'Investor Relations' section at https://belriseindustries.com. The company trades under scrip code 544405 with ISIN INE894V01022.",
            "Sentiment": "neutral",
            "PublishDate": 1755012941359,
            "Source": "earnings"
        },
        {
            "Title": "Belrise Industries Approves Incorporation of Wholly-Owned Subsidiary in Defence and Aerospace Sector",
            "Summary": "Belrise Industries Limited's Board of Directors approved the incorporation of a wholly-owned subsidiary in India on August 11, 2025. The subsidiary will operate in defence, space, aerospace and allied industries, focusing on engineering and technologies involving mechanical, optical, electrical, electronic, software and other related technologies. The proposed subsidiary will have an authorized and paid-up share capital of Rs. 15 lakh, divided into 1.5 lakh equity shares of Rs. 10 each. Belrise Industries will hold 100% shareholding through cash consideration. The incorporation is subject to approval from the Ministry of Corporate Affairs and other relevant regulatory authorities. The subsidiary's business activities align with Belrise Industries' main line of business.",
            "Sentiment": "positive",
            "PublishDate": 1754937952295,
            "Source": "corporate_action"
        },
        {
            "Title": "Belrise Industries Reports Strong Q1 FY2026 Results with 56% Profit Growth, Incorporates New Subsidiary",
            "Summary": "Belrise Industries Limited reported robust Q1 FY2026 financial results with consolidated revenue growing 27% to Rs. 22,622.08 crore and net profit surging 56.1% to Rs. 1,116.80 crore. Standalone revenue increased 26.2% to Rs. 17,979.47 crore with net profit rising 55.8% to Rs. 1,025.28 crore. EPS improved to Rs. 1.50 on consolidated basis from Rs. 1.00 in the previous year. The Board approved incorporation of a new wholly-owned subsidiary in India and appointed M/s Makarand Lele & Co. as Secretarial Auditor for a 5-year term subject to shareholder approval. The company also approved re-appointment of Mrs. Supriya Shrikant Badve as Whole Time Director for 5 years and material related party transactions with Badve Autocomps Private Limited. The automotive components company set August 22, 2025 as record date for dividend payment and scheduled its 29th AGM for September 23, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754931793758,
            "Source": "earnings"
        },
        {
            "Title": "Belrise Industries Recommends Rs. 0.55 Final Dividend for FY2025",
            "Summary": "Belrise Industries Limited's Board of Directors has recommended a final dividend of Rs. 0.55 per equity share for the financial year ending March 31, 2025. The dividend recommendation is subject to shareholder approval at the upcoming Annual General Meeting. The company has set August 22, 2025 as the record date for dividend eligibility. The Board also adopted amendments to the Policy on Code of Conduct for Prevention of Insider Trading during their meeting held on July 25, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753439869371,
            "Source": "corporate_action"
        },
        {
            "Title": "Belrise Industries: Shares Hit Record High on Jefferies' Bullish Outlook",
            "Summary": "Belrise Industries' shares surged 16.4% to Rs 119.2 in four days, reaching a record high. Jefferies initiated coverage with a 'Buy' rating and Rs 135 price target, citing strong growth prospects in two-wheeler components, expansion in four-wheeler segment, and expected deleveraging.",
            "Sentiment": "positive",
            "PublishDate": 1752222654000,
            "Source": "normal_news"
        },
        {
            "Title": "Belrise Industries: Share Price Dips After Two-Day Rally",
            "Summary": "Belrise Industries Ltd. shares fell nearly 2% on Thursday, ending a two-day rally that saw a 13% surge. The recent rally was sparked by Jefferies initiating coverage with a 'buy' rating and a Rs 135 price target. Belrise holds a 24% market share in key two-wheeler metal components and aims to expand into the four-wheeler segment.",
            "Sentiment": "neutral",
            "PublishDate": 1752124482000,
            "Source": "normal_news"
        },
        {
            "Title": "Belrise Industries: Mid-Teen Growth Target and Margin Stability for FY26",
            "Summary": "Belrise Industries aims for mid-teen growth in FY26 through organic scale-up and acquisitions. Plans include launching three new products to increase two-wheeler content per vehicle by 45-50%. The company is expanding its four-wheeler business post H-ONE India acquisition. Post-IPO debt reduced to under ₹1,000 crore. Q4FY25 margins at 12.1%, expected to remain stable.",
            "Sentiment": "positive",
            "PublishDate": 1750069206000,
            "Source": "normal_news"
        },
        {
            "Title": "Belrise Industries: Q4 Profit Soars 574%, Shares Jump 7%",
            "Summary": "Belrise Industries reported a 574% increase in Q4 net profit to Rs 110.02 crore, with revenue up 49% to Rs 2,274 crore. EBITDA rose 54.4% to Rs 276 crore, and operating margin expanded to 12.13%. The company's shares surged 6.9% to Rs 108.98 on the BSE following the earnings announcement.",
            "Sentiment": "positive",
            "PublishDate": 1750055960000,
            "Source": "earnings"
        },
        {
            "Title": "Belrise Industries Reports Improved Q4 EBITDA and Margin",
            "Summary": "Belrise Industries announced its Q4 financial results. The company reported an EBITDA of ₹2.76 billion, up from ₹1.79 billion in the same quarter of the previous year. The EBITDA margin for Q4 improved to 12.13%, compared to 11.71% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1750045756000,
            "Source": "result"
        },
        {
            "Title": "Belrise Industries Reports Significant Growth in Q4 Revenue and Profit",
            "Summary": "Belrise Industries has announced its Q4 financial results. The company's revenue increased to 22.7 billion rupees from 15.3 billion rupees in the same quarter last year. The consolidated net profit rose to 1.1 billion rupees from 163 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1750045674000,
            "Source": "result"
        },
        {
            "Title": "Belrise Industries: IPO Listing Day Raises Questions on Stock Delivery",
            "Summary": "Belrise Industries, an auto components company, listed on stock exchanges on May 28, 2025. The IPO closed 8.23% higher on the listing day. The company raised Rs 2,150 crore through a fresh issue that was subscribed 43.74 times. Trading activity on the listing day has prompted scrutiny of the trades.",
            "Sentiment": "neutral",
            "PublishDate": 1748488637000,
            "Source": "corporate_action"
        }
    ]
}