{
    "Symbol": "BEML",
    "ISIN": "INE258A01024",
    "News": [
        {
            "Title": "BEML Independent Director Bipin Kumar Gupta Steps Down",
            "Summary": "BEML Limited announces cessation of Shri Bipin Kumar Gupta as Independent Director effective 10.02.2026, completing his term as per Government of India appointment order from 2023.",
            "Sentiment": "neutral",
            "PublishDate": 1770721791793,
            "Source": "stocks"
        },
        {
            "Title": "BEML Reports Q3 FY26 Order Book and Financial Position",
            "Summary": "BEML Limited disclosed its order book position of ₹16,349 crores as on December 31, 2025, along with inventory reduction to ₹2,543.37 crores and increased borrowings of ₹930.83 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1770369116461,
            "Source": "stocks"
        },
        {
            "Title": "BEML Reports Q3 Net Loss of ₹227 Million",
            "Summary": "BEML posted a net loss of ₹227 million in Q3, marking a significant reversal from the ₹248 million profit recorded in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1770367905344,
            "Source": "co_actions_results"
        },
        {
            "Title": "BEML Board Meet on Feb 6 for Q3FY26 Results & Dividend",
            "Summary": "BEML Limited has scheduled a board meeting on February 6, 2026, to consider Q3FY26 unaudited financial results and declare first interim dividend for FY 2025-26. Record date set for February 9, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769774287982,
            "Source": "co_actions_results"
        },
        {
            "Title": "BEML announces senior management promotions",
            "Summary": "BEML Limited notifies stock exchanges about designation changes in senior management, with Shri Shekhar K promoted from Chief Manager to Executive Director among other appointments.",
            "Sentiment": "positive",
            "PublishDate": 1769512182006,
            "Source": "stocks"
        },
        {
            "Title": "BEML Secures ₹110 Cr Defence Order for Engines",
            "Summary": "BEML Ltd has secured a significant ₹110 crore order from the Ministry of Defence for engine supply, strengthening its position in the defence manufacturing sector.",
            "Sentiment": "positive",
            "PublishDate": 1765877720153,
            "Source": "co_actions_results"
        },
        {
            "Title": "BEML Shares Investor Meet Presentation & Audio",
            "Summary": "BEML Limited conducted an investor meet on December 12, 2025, hosted by Elara Capital in Mumbai. The company shared presentation materials and audio recordings with stock exchanges under regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1765542214641,
            "Source": "stocks"
        },
        {
            "Title": "BEML Signs MOU With Sagarmala Finance Corporation For Maritime Manufacturing Financial Support",
            "Summary": "BEML has entered into a Memorandum of Understanding with Sagarmala Finance Corporation to enhance financial assistance for local maritime manufacturing operations. The partnership aims to strengthen funding support for domestic maritime sector development and manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1764922070994,
            "Source": "stock"
        },
        {
            "Title": "BEML Partners With HD Korea Shipbuilding And HD Hyundai Samho For Maritime Crane Manufacturing In India",
            "Summary": "BEML has signed an agreement with HD Korea Shipbuilding and HD Hyundai Samho Heavy Industries to develop next-generation maritime cranes in India. The partnership includes comprehensive support and training components to establish advanced crane manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1764921470672,
            "Source": "order&deals"
        },
        {
            "Title": "BEML Secures ₹157 Crore Order for Switch Rail Grinding Machines from Loram Rail Maintenance",
            "Summary": "BEML has secured a ₹157 crore order from Loram Rail Maintenance to manufacture switch rail grinding machines for Indian Railways. This order strengthens BEML's position in the railway equipment manufacturing sector and adds significant value to its order book.",
            "Sentiment": "positive",
            "PublishDate": 1764835080840,
            "Source": "order&deals"
        },
        {
            "Title": "BEML Secures ₹414 Crore Additional Order from Bangalore Metro for Phase II Trainsets",
            "Summary": "BEML has secured an additional order worth ₹414 crores from Bangalore Metro Rail Corporation for Phase II trainsets as part of its regular business operations. The order strengthens BEML's position in the metro rail segment and adds to its order book for urban transportation projects.",
            "Sentiment": "positive",
            "PublishDate": 1764746078240,
            "Source": "order&deals"
        },
        {
            "Title": "BEML Faces Delays in Vande Bharat Sleeper Train Launch Due to Required Modifications",
            "Summary": "BEML is experiencing delays in launching its Vande Bharat sleeper trains as the trainsets are being sent back to Bengaluru for necessary modifications. The delay affects BEML's timeline for deploying the sleeper variant of the high-speed train service.",
            "Sentiment": "negative",
            "PublishDate": 1763528666869,
            "Source": "stock"
        },
        {
            "Title": "BEML Signs Agreement for Real-Time Automatic Cargo Evacuation System",
            "Summary": "BEML has entered into an agreement with APMB, DMRC, and UTIPL to develop a real-time automatic cargo evacuation system. The partnership involves multiple organizations including metro rail corporation and could enhance BEML's technology capabilities in automated systems.",
            "Sentiment": "positive",
            "PublishDate": 1763127817875,
            "Source": "stock"
        }
    ]
}