{
    "Symbol": "BEPL",
    "ISIN": "INE922A01025",
    "News": [
        {
            "Title": "Bhansali Engineering Board Meet on Feb 14 for Q3 Results",
            "Summary": "Bhansali Engineering Polymers schedules board meeting on February 14, 2026 to consider Q3FY26 unaudited financial results and potential third interim dividend declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1770015320492,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bhansali Engineering Polymers Declares 100% Interim Dividend, Reports Quarterly Results",
            "Summary": "Bhansali Engineering Polymers Limited's Board of Directors approved unaudited financial results for the quarter and half-year ended September 30, 2025. The company declared a second interim dividend of Re. 1 per equity share (100% of face value) for financial year 2025-26, with November 6, 2025 set as the record date and payment scheduled by November 28, 2025. Including the first interim dividend of Re. 1 per share declared in August 2025, total interim dividends declared amount to 200% (Re. 2 per share). The company operates in highly specialized engineering thermoplastics segment. Both standalone and consolidated results were reviewed by statutory auditors and approved by the Board.",
            "Sentiment": "positive",
            "PublishDate": 1761853918540,
            "Source": "corporate_action"
        },
        {
            "Title": "Bhansali Engineering Polymers Reports Mixed Q2 Results with Higher Profit Margins",
            "Summary": "Bhansali Engineering Polymers reported Q2 EBITDA of 491 million rupees compared to 530 million rupees in the same period last year, representing a decline. However, the company's EBITDA margin improved to 15.10% from 14.45% year-over-year. Net profit showed strong growth, rising to 546 million rupees from 469 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1761808778416,
            "Source": "earnings"
        },
        {
            "Title": "Bhansali Engineering Polymers Schedules Board Meeting for October 30, 2025 to Approve Q2 Results and Consider Interim Dividend",
            "Summary": "Bhansali Engineering Polymers Limited has scheduled a Board of Directors meeting for October 30, 2025, to approve unaudited financial results for the quarter and half year ended September 30, 2025. The board will also consider declaring a second interim dividend for Financial Year 2025-26. The company's trading window for designated persons and their immediate relatives has been closed since October 1, 2025, and will reopen on November 2, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760431123733,
            "Source": "corporate_action"
        },
        {
            "Title": "Bhansali Engineering Polymers Reports Q1 Results, Declares Interim Dividend and Approves Rs 200 Crore Capacity Expansion",
            "Summary": "Bhansali Engineering Polymers Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs 30,790.88 lakhs and net profit of Rs 4,673.16 lakhs, with earnings per share of Rs 1.88. On a consolidated basis, net profit was Rs 4,589.16 lakhs with EPS of Rs 1.84. The Board declared an interim dividend of Re 1 per equity share for financial year 2025-26, with record date set as August 20, 2025, and payment by August 29, 2025. The company scheduled its 41st Annual General Meeting for September 20, 2025. Additionally, the Board approved a project to enhance ABS production capacity from 75,000 TPA to 100,000 TPA at plants in Abu Road, Rajasthan and Satnoor, Madhya Pradesh, with an estimated investment of Rs 200 crores to be completed by September 2026.",
            "Sentiment": "positive",
            "PublishDate": 1755080160417,
            "Source": "corporate_action"
        },
        {
            "Title": "Bhansali Engineering Polymers Reports Decline in Q1 Financial Performance",
            "Summary": "Bhansali Engineering Polymers reported quarterly results showing a decline across key financial metrics. Net profit decreased to 467 million rupees from 531 million rupees in the same period last year. Revenue fell to 3.6 billion rupees compared to 4.01 billion rupees year-over-year. EBITDA dropped to 526 million rupees from 616 million rupees, while EBITDA margin compressed to 17.1% from 18.11% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1755073911131,
            "Source": "earnings"
        },
        {
            "Title": "Bhansali Engineering Polymers Q4 Financial Results",
            "Summary": "Bhansali Engineering Polymers reported its Q4 financial results. The company's EBITDA decreased to 482 million rupees from 510 million rupees year-over-year, with EBITDA margin declining to 13.9% from 15.9%. Net profit slightly decreased to 392 million rupees from 413 million rupees. However, revenue increased to 3.45 billion rupees from 3.21 billion rupees compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1745663396000,
            "Source": "result"
        },
        {
            "Title": "Bhansali Engineering Polymers: Q3 Profit Up 1.54% YoY, Revenue Rises 18.5%",
            "Summary": "Bhansali Engineering Polymers reported Q3 FY25 results with profit at ₹40.84 crore, up 1.54% YoY, and revenue at ₹345.84 crore, up 18.5% YoY. However, both profit and revenue declined compared to the previous quarter. EPS increased to ₹1.64, up 1.23% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1737093497000,
            "Source": "earnings"
        },
        {
            "Title": "Bhansali Engineering Polymers Reports Q3 Revenue Growth",
            "Summary": "Bhansali Engineering Polymers has reported a revenue of 3.5 billion rupees for the third quarter, compared to 2.9 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1737014554000,
            "Source": "earnings"
        },
        {
            "Title": "BHANSALI ENGINEERING POLYMERS Reports Q3 Financial Results",
            "Summary": "BHANSALI ENGINEERING POLYMERS has reported its Q3 financial results. The company's EBITDA for the quarter stands at 517.2 million rupees, compared to 468.6 million rupees in the same quarter last year, showing a year-over-year increase. However, the EBITDA margin has decreased to 14.95% from 16.06% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737014535000,
            "Source": "earnings"
        },
        {
            "Title": "Bhansali Engineering Polymers Reports Q3 Net Profit of 406 Million Rupees",
            "Summary": "Bhansali Engineering Polymers has announced its financial results for the third quarter. The company reported a net profit of 406 million rupees, compared to 400.6 million rupees in the same period last year, indicating a slight year-over-year increase.",
            "Sentiment": "neutral",
            "PublishDate": 1737014477000,
            "Source": "earnings"
        },
        {
            "Title": "Bhansali Engineering Polymers to Consider Q3 Results on January 16",
            "Summary": "Bhansali Engineering Polymers has announced that it will consider its third quarter (Q3) financial results on January 16. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1736340518000,
            "Source": "earnings"
        },
        {
            "Title": "Bhansali Engineering Polymers: 100% Dividend Declared Amid Q2 Profit Dip",
            "Summary": "Bhansali Engineering Polymers Ltd (BEPL) reported a 3.92% decline in Q2 net profit to Rs 48.22 crore. The company declared a 2nd interim dividend of Rs 1 per share (100%) for FY 2024-25, with October 31, 2024, set as the record date. Payment is expected by November 8, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1729528013000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bhansali Engineering Polymers Announces Second Interim Dividend",
            "Summary": "Bhansali Engineering Polymers has declared a second interim dividend of 1 rupee per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1729521995000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bhansali Engineering Polymers Reports Q2 Financial Results",
            "Summary": "Bhansali Engineering Polymers has announced its Q2 financial results. The company's EBITDA for the quarter stood at 530.3 million rupees, compared to 575 million rupees in the same quarter last year. The EBITDA margin decreased to 14.45% from 18.31% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1729521987000,
            "Source": "result"
        },
        {
            "Title": "Bhansali Engineering Polymers Reports Q2 Revenue Growth",
            "Summary": "Bhansali Engineering Polymers has announced its second quarter revenue for the current fiscal year. The company reported revenue of 3.67 billion rupees, compared to 3.14 billion rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729521980000,
            "Source": "result"
        },
        {
            "Title": "BHANSALI ENGINEERING POLYMERS Reports Q2 Net Profit",
            "Summary": "BHANSALI ENGINEERING POLYMERS has reported a net profit of 469.5 million rupees for the second quarter. This represents a slight decrease from 480 million rupees year-over-year, but an improvement from 531 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1729521945000,
            "Source": "result"
        },
        {
            "Title": "Bhansali Engineering Polymers Schedules Q2 Results Meeting",
            "Summary": "<p><span class=\"neutral\">Bhansali Engineering Polymers</span> has announced a <b>board meeting</b> on <span class=\"neutral\">October 21</span> to <span class=\"neutral\">consider and approve</span> the <b>financial results</b> for the <span class=\"neutral\">second quarter</span> of the current fiscal year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728477739000,
            "Source": "corporate_action"
        }
    ]
}