{
    "Symbol": "BERGEPAINT",
    "ISIN": "INE463A01038",
    "News": [
        {
            "Title": "Berger Paints Targets Double-Digit Volume Growth",
            "Summary": "Berger Paints expects to achieve double-digit volume growth in FY26 and FY27, indicating strong business expansion plans for the upcoming fiscal years.",
            "Sentiment": "positive",
            "PublishDate": 1770359317422,
            "Source": "stocks"
        },
        {
            "Title": "Berger Paints Q3FY26 Results: Revenue Up 0.4% YoY",
            "Summary": "Berger Paints reported Q3FY26 standalone revenue of Rs. 2,595.01 crores, up 0.4% YoY. Net profit declined 2.5% to Rs. 298.37 crores. Company achieved 8.5% volume growth despite challenging market conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1770287413387,
            "Source": "co_actions_results"
        },
        {
            "Title": "Berger Paints Starts Production at Hindupur Facility",
            "Summary": "Berger Paints India has commenced production operations at its new manufacturing facility in Hindupur, aimed at reducing overall production costs and enhancing operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1770213947837,
            "Source": "stocks"
        },
        {
            "Title": "Gaurang Shah picks Berger Paints with Rs 630 target",
            "Summary": "Market expert Gaurang Shah recommends Berger Paints as a strong mid-cap buy opportunity with Rs 630 target, citing solid fundamentals and attractive paint sector prospects despite crude oil volatility.",
            "Sentiment": "positive",
            "PublishDate": 1768840555107,
            "Source": "stocks"
        },
        {
            "Title": "Berger Paints Receives ESG Score of 64 for FY25",
            "Summary": "NSE Sustainability Ratings & Analytics Limited assigned Berger Paints India Limited an ESG score of 64 for financial year 2025, as disclosed under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1767950780989,
            "Source": "stocks"
        },
        {
            "Title": "Berger Paints Board Meet on Feb 5 for Q3FY26 Results",
            "Summary": "Berger Paints India Limited has scheduled a board meeting on February 5, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767358372187,
            "Source": "co_actions_results"
        },
        {
            "Title": "Berger Paints Fined ₹91,362 by Tax Authorities",
            "Summary": "Berger Paints India Limited disclosed a penalty of ₹40,000 plus tax and interest totaling ₹91,362 imposed by DGSTO-6 Bengaluru for FY 2021-22 violations related to outward liability and input tax credit.",
            "Sentiment": "negative",
            "PublishDate": 1767185663795,
            "Source": "stocks"
        },
        {
            "Title": "U.K. Paints Acquires 14.48% Berger Paints Stake",
            "Summary": "U.K. Paints (India) Private Limited acquired 16.88 crore equity shares (14.48% stake) in Berger Paints through amalgamation scheme, increasing its shareholding from 50.09% to 64.57%.",
            "Sentiment": "neutral",
            "PublishDate": 1766383256895,
            "Source": "co_actions_results"
        },
        {
            "Title": "Berger Paints Reports High Single-Digit Volume Growth But Muted Value Growth in Q2FY26",
            "Summary": "Berger Paints India Limited delivered high single-digit volume growth of 8.8% in Q2FY26 despite extended monsoon and flooding across key markets including Andhra Pradesh, Kerala, West Bengal, North-East, Gujarat, and Maharashtra. However, value growth remained muted at 1.6% due to mix dynamics with higher contribution from tile adhesives, admix and putty, and lower sales of high-value products like exterior emulsions. The company's gross margin remained stable at 39.6%, while PBDIT margin moderated due to subdued value growth resulting in lower operating leverage and higher brand building spends. Total income from operations reached ₹2,872.4 crores compared to ₹2,830.7 crores in the previous year. The decorative business saw marginal shift from premium/luxury to economy emulsions, while Construction Chemicals registered robust growth. The company continues expanding its retail network with over 1,600 outlets and has installed over 5,500 tinting machines toward its FY26 target of 10,000. Management expects demand revival post-Diwali supported by improving weather conditions and release of pent-up demand.",
            "Sentiment": "neutral",
            "PublishDate": 1762259472577,
            "Source": "earnings"
        },
        {
            "Title": "Berger Paints India Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Berger Paints India reported Q2 consolidated net profit of 2.06 billion rupees, down from 2.69 billion rupees in the same period last year. Revenue increased to 28.27 billion rupees from 27.74 billion rupees year-over-year. EBITDA declined to 3.52 billion rupees from 4.3 billion rupees, while EBITDA margin compressed to 12.46% from 15.65% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762251526108,
            "Source": "earnings"
        },
        {
            "Title": "Berger Paints India VP & Group Head Manufacturing Rajesh Kumar Tiwari Passes Away",
            "Summary": "Berger Paints India Limited announced the death of Mr. Rajesh Kumar Tiwari, VP & Group Head Manufacturing, on September 13, 2025. Tiwari was a member of the Core Management Team and served as a Designated Person of the company. The company described his death as sudden and untimely, stating it will be an irreparable loss. The Chairman, Vice Chairman, MD & CEO, Board Members and employees have expressed condolences to his family.",
            "Sentiment": "negative",
            "PublishDate": 1757827403424,
            "Source": "corporate_governance"
        },
        {
            "Title": "Berger Paints Targets Rs 20,000 Crore Revenue by 2030",
            "Summary": "Berger Paints India, the country's second-largest paint manufacturer, announced its goal to achieve Rs 20,000 crore turnover by 2030. CEO Abhijit Roy reported the company achieved over 7% volume growth and improved operating profit despite economic slowdown and increased competition. The company currently holds 20% market share in the organised paint segment and has secured the third position in construction chemicals and waterproofing segment. Berger maintains leadership in protective coatings and general industrial segments. The company plans to focus on innovation, digitalisation, and network expansion in urban markets across decorative paints, construction chemicals, and industrial segments. Despite rising costs of some raw materials, Berger will not increase product prices as softer prices of other components balance the impact. Roy stated the takeover of Akzo Nobel's coating business by JSW will not impact them.",
            "Sentiment": "positive",
            "PublishDate": 1755016144491,
            "Source": "stock"
        },
        {
            "Title": "Berger Paints India Submits Earnings Call Transcript for Quarter Ended June 30, 2025",
            "Summary": "Berger Paints India Limited has submitted the transcript of its earnings conference call for the quarter ended June 30, 2025 to stock exchanges including BSE, NSE, and Calcutta Stock Exchange. The earnings call was conducted following a Board of Directors meeting held on August 5, 2025. The transcript has been made available on the company's website and can be accessed through their investor relations section. The submission was signed by Arunito Ganguly, Vice President & Company Secretary, on August 7, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754553962113,
            "Source": "earnings"
        },
        {
            "Title": "Berger Paints Reports Growing Urban Demand, Expects Infrastructure Spending Boost",
            "Summary": "Berger Paints is experiencing increasing demand in urban markets. The company anticipates receiving a boost from government infrastructure spending later this year.",
            "Sentiment": "positive",
            "PublishDate": 1754387507718,
            "Source": "stock"
        },
        {
            "Title": "Berger Paints Q1 Revenue Rises to 32B Rupees, Net Profit Declines Year-on-Year",
            "Summary": "Berger Paints India reported Q1 revenue of 32 billion rupees compared to 30.9 billion rupees in the same period last year. The company's EBITDA increased to 5.3 billion rupees from 5.2 billion rupees year-on-year, though EBITDA margin compressed to 16.5% from 17%. Consolidated net profit declined to 3.15 billion rupees versus 3.54 billion rupees in the previous year's corresponding quarter. The company reported a volume value gap of 3.6% for the quarter, which improved from 7% in the last fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1754385339121,
            "Source": "earnings"
        },
        {
            "Title": "Berger Paints Receives Tax Order Worth ₹3.32 Lakh from Patna Tax Authorities",
            "Summary": "Berger Paints India Limited disclosed receiving a tax order dated July 30, 2025, from the Assistant Commissioner of CGST and Central Excise, Patna-I. The order relates to a show cause notice issued for FY 2018-19 regarding an alleged dispute over lower tax liability discharged. The total amount involved is ₹3.32 lakh, comprising ₹1.66 lakh in tax and ₹1.66 lakh in penalty. The company stated there is no material impact on its financial operations or other activities and is currently evaluating the order.",
            "Sentiment": "neutral",
            "PublishDate": 1754047592426,
            "Source": "stock"
        },
        {
            "Title": "Berger Paints Opens Special Window for Physical Share Transfer Re-lodgement",
            "Summary": "Berger Paints India Limited has announced the opening of a special window for re-lodgement of transfer requests for physical shares, following SEBI circular dated July 2, 2025. The window is available from July 7, 2025 to January 6, 2026, for transfer deeds that were lodged prior to April 1, 2019 and were rejected or returned due to document deficiencies. Shareholders can submit required documents to the company's Registrar and Transfer Agent, CB Management Services (P) Ltd. All re-lodged shares will be processed through transfer-cum-demat mode and issued only in dematerialized form. The company will not accept transfer requests submitted after January 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1753425251813,
            "Source": "corporate_action"
        },
        {
            "Title": "Berger Paints India: Housing Recovery May Boost Paint Demand",
            "Summary": "Berger Paints India's CEO Abhijit Roy expects recent monetary easing and tax reliefs to support housing demand, potentially boosting paint consumption. The RBI's rate cut and CRR reduction may make housing finance cheaper, although the impact on paint demand may be delayed. Berger Paints has grown market share through improved execution and distribution strategy, including significant expansion of tinting machines.",
            "Sentiment": "positive",
            "PublishDate": 1749450937000,
            "Source": "normal_news"
        },
        {
            "Title": "Berger Paints Reports Increase as Government Infrastructure Capex Rises",
            "Summary": "Berger Paints has reported a significant increase in its performance. This comes as the government has ramped up its capital expenditure for infrastructure by 60% year-over-year in April.",
            "Sentiment": "positive",
            "PublishDate": 1749199300000,
            "Source": "default"
        },
        {
            "Title": "Berger Paints India Limited: Steady Margins Expected, Focus on Premium Products",
            "Summary": "Berger Paints anticipates maintaining FY26 operating margins at 15-17%. Q4 margins improved to 15.8%. The company targets high single to low double-digit volume growth for the current year. To retain market share, Berger is focusing on premium and innovative products like heat-reflective coatings.",
            "Sentiment": "positive",
            "PublishDate": 1747295024000,
            "Source": "earnings"
        },
        {
            "Title": "Berger Paints India Ltd: Q4 Volume Growth at 7.4%, CEO Optimistic on Future Demand",
            "Summary": "Berger Paints reported 7.4% volume growth in Q4. Net profit rose 18% YoY to ₹263 crore. Revenue grew 7% to ₹2,704 crore. EBITDA increased 22% to ₹427.7 crore. The company will pay a dividend of ₹3.80 per share. CEO remains optimistic about future demand despite tough market conditions.",
            "Sentiment": "positive",
            "PublishDate": 1747216334000,
            "Source": "earnings"
        },
        {
            "Title": "Berger Paints India Reports 20% Increase in Operating Margin",
            "Summary": "Berger Paints India has announced a significant improvement in its financial performance. The company's operating margin has increased by 20%, marking its highest gross margin in the last 12 quarters. This indicates strong profitability and efficient cost management by the company.",
            "Sentiment": "positive",
            "PublishDate": 1747213475000,
            "Source": "default"
        },
        {
            "Title": "Berger Paints India Reports Strong Q4 FY23 Results",
            "Summary": "Berger Paints India announced its Q4 FY23 financial results. The company reported revenue of 27 billion rupees, up from 25.2 billion rupees year-over-year. EBITDA increased to 4.3 billion rupees from 3.51 billion rupees, with EBITDA margin improving to 15.83% from 13.92%. Consolidated net profit rose to 2.6 billion rupees from 2.22 billion rupees. The company also declared a dividend of 3.8 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747213440000,
            "Source": "result"
        },
        {
            "Title": "Berger Paints: Expects Growth and Margin Expansion in Q4FY25",
            "Summary": "Berger Paints anticipates high single-digit volume growth and mid-single-digit value growth in Q4FY25. The company expects slight improvement in EBITDA margins from Q3FY25's 15.9%. Lower raw material costs may contribute to margin gains. Berger remains confident despite new competition from Birla Opus Paints.",
            "Sentiment": "positive",
            "PublishDate": 1742281069000,
            "Source": "earnings"
        },
        {
            "Title": "Berger Paints India Reports Q3 Financial Results",
            "Summary": "Berger Paints India has released its Q3 financial results. The company's consolidated net profit for the quarter stood at 2.95 billion rupees, compared to 3 billion rupees in the same quarter last year and 2.7 billion rupees in the previous quarter. Revenue for Q3 was reported at 29.75 billion rupees, up from 28.8 billion rupees in the corresponding period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739320488000,
            "Source": "earnings"
        },
        {
            "Title": "Berger Paints India Ltd: Q3 Profit and EBITDA Flat, Revenue Up 3%",
            "Summary": "Berger Paints India Ltd reported Q3 net profit down 1.6% YoY to ₹295 crore. Revenue increased 3.2% YoY to ₹2,975 crore. EBITDA declined 1.7% YoY to ₹471.8 crore, with margin contracting to 15.9% from 16.7% a year ago.",
            "Sentiment": "neutral",
            "PublishDate": 1739275310000,
            "Source": "earnings"
        },
        {
            "Title": "Berger Paints: Chairman Emphasizes Sustainable Growth, Cautious on Acquisitions",
            "Summary": "Berger Paints' Chairman Rishma Kaur states focus on sustainable growth and innovation while maintaining a cautious approach to acquisitions. The company aims to double turnover to Rs 20,000 crore by 2030, plans Rs 2,000 crore investment in three new projects, and expects recovery from recent value loss.",
            "Sentiment": "neutral",
            "PublishDate": 1739196809000,
            "Source": "normal_news"
        },
        {
            "Title": "Berger Paints India Denies Material Information on Akzonobel's India Stake Buy Report",
            "Summary": "Berger Paints India has stated that it has no material information to disclose regarding a report suggesting Akzonobel's potential acquisition of a stake in the company's India operations. This statement appears to be in response to market speculation or a news report about a possible corporate action involving Akzonobel and Berger Paints India.",
            "Sentiment": "neutral",
            "PublishDate": 1736295384000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Berger Paints India Denies Information on AkzoNobel's India Stake Purchase",
            "Summary": "Berger Paints India has stated that it has no material information to disclose regarding reports of AkzoNobel purchasing a stake in its India operations. The company's statement suggests that it is unaware of or cannot confirm any such transaction at this time.",
            "Sentiment": "neutral",
            "PublishDate": 1736251039000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Berger Paints Expects 8-9% Volume Growth in Second Half",
            "Summary": "Berger Paints has announced that it anticipates a volume growth of 8-9% in the second half of the fiscal year, as reported by CNBCTV18. This projection suggests a positive outlook for the company's performance in the coming months.",
            "Sentiment": "positive",
            "PublishDate": 1733458381000,
            "Source": "earnings"
        },
        {
            "Title": "Berger Paints Management Expects Improved Q4 Performance",
            "Summary": "According to a report on CNBCTV18, the management of Berger Paints has stated that they anticipate the fourth quarter (Q4) performance to be better than the third quarter (Q3). This suggests a positive outlook for the company's near-term financial results.",
            "Sentiment": "positive",
            "PublishDate": 1733458372000,
            "Source": "earnings"
        },
        {
            "Title": "Berger Paints: Q2 Results Fall Short of Expectations",
            "Summary": "ICICI Securities maintains 'Reduce' rating on Berger Paints following Q2 results that did not meet expectations.",
            "Sentiment": "negative",
            "PublishDate": 1730868076000,
            "Source": "result"
        },
        {
            "Title": "Berger Paints Expands Product Range in Construction Chemicals",
            "Summary": "Berger Paints is expanding its product range in the construction, chemical, and waterproofing segment. This expansion requires additional manpower, indicating potential growth and investment in this area of their business.",
            "Sentiment": "positive",
            "PublishDate": 1730864118000,
            "Source": "corporate_action"
        },
        {
            "Title": "Berger Paints Aims to Boost Gross Margins Through Product Differentiation",
            "Summary": "During a recent conference call, Berger Paints announced its strategy to improve gross margins by focusing on the development and successful launch of differentiated products. This approach suggests the company is prioritizing innovation and product uniqueness to enhance its market position and financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1730864112000,
            "Source": "corporate_action"
        },
        {
            "Title": "Berger Paints Forecasts Improved Volume Growth for Q3 and Q4",
            "Summary": "Berger Paints anticipates an improvement in volume growth for the third and fourth quarters. The company targets 7%-10% volume growth in Q3 and expects to achieve double-digit volume growth in Q4, as stated in their recent conference call.",
            "Sentiment": "positive",
            "PublishDate": 1730864099000,
            "Source": "corporate_action"
        },
        {
            "Title": "Berger Paints Expects Strong Growth in Nepal and Bolix, Improved Profitability in Q3",
            "Summary": "Berger Paints anticipates robust double-digit sales and profit growth in their Nepal and Bolix operations for Q3. The company also expects to see improved profitability due to a decrease in raw material prices during the same quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730864093000,
            "Source": "result"
        },
        {
            "Title": "Berger Paints Anticipates Improved Performance in Second Half",
            "Summary": "Berger Paints has expressed optimism about its financial performance for the latter half of the year, projecting better revenue and profitability compared to the first half.",
            "Sentiment": "positive",
            "PublishDate": 1730807959000,
            "Source": "normal_news"
        },
        {
            "Title": "Berger Paints India Reports Q2 Financial Results",
            "Summary": "Berger Paints India has released its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 is 4.3 billion rupees, compared to 4.7 billion rupees in the same quarter last year. The EBITDA margin has decreased from 17.12% to 15.65% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730805455000,
            "Source": "result"
        },
        {
            "Title": "Berger Paints India Reports Flat Q2 Revenue",
            "Summary": "Berger Paints India has reported quarterly revenue of 27.7 billion rupees, which remains unchanged compared to the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730805445000,
            "Source": "result"
        },
        {
            "Title": "Berger Paints India Reports Q2 Financial Results",
            "Summary": "Berger Paints India has announced its consolidated net profit for the second quarter. The company reported a net profit of 2.7 billion rupees, which is a decrease from 2.9 billion rupees year-over-year (YoY) but an increase from 3.5 billion rupees quarter-over-quarter (QoQ).",
            "Sentiment": "neutral",
            "PublishDate": 1730805434000,
            "Source": "result"
        }
    ]
}