{
    "Symbol": "BETA",
    "ISIN": "INE351Y01019",
    "News": [
        {
            "Title": "Beta Drugs Acquires 66% Stake in Nivian Lifesciences",
            "Summary": "Beta Drugs announces ₹69.4 crore acquisition of 66.09% stake in IVF specialist Nivian Lifesciences, marking entry into women's health segment. Stock jumps 4% on announcement.",
            "Sentiment": "positive",
            "PublishDate": 1768211194633,
            "Source": "co_actions_results"
        },
        {
            "Title": "Beta Drugs to Acquire 66.09% Stake in Nivian Life",
            "Summary": "Beta Drugs announces acquisition of majority 66.09% stake in Nivian Life Sciences for ₹694 million, marking significant expansion in pharmaceutical sector through strategic investment.",
            "Sentiment": "positive",
            "PublishDate": 1767963461859,
            "Source": "co_actions_results"
        },
        {
            "Title": "Beta Drugs Receives Approval to Migrate from SME Platform to Main Board Listing",
            "Summary": "Beta Drugs has received approval to list its equity shares on the main board after migrating from the SME Emerge platform. This migration represents a significant milestone for the company, allowing it to access broader investor base and enhanced market visibility.",
            "Sentiment": "positive",
            "PublishDate": 1763696224670,
            "Source": "stock"
        },
        {
            "Title": "Beta Drugs Gains Access to Mexico's Oncology Market",
            "Summary": "Beta Drugs has completed the COFEPRIS approval process for its oncology formulation and API manufacturing plants. This regulatory approval grants the company access to Mexico's oncology market, valued at USD 1.3 billion.",
            "Sentiment": "positive",
            "PublishDate": 1746416310000,
            "Source": "default"
        },
        {
            "Title": "Beta Drugs: Healthquad Fund II Invests Rs 117 Crore for Minority Stake",
            "Summary": "Healthquad Fund II, a Singapore-based investment fund, has acquired a minority stake in Beta Drugs by investing Rs 117 crore. Beta Drugs plans to use the funds to accelerate growth and aims to become one of the top five oncology companies in India within five years. The company currently offers various cancer treatments and operates in 46 countries.",
            "Sentiment": "positive",
            "PublishDate": 1732720730000,
            "Source": "corporate_action"
        },
        {
            "Title": "Beta Drugs to Consider Fund Raising via Preferential Allotment",
            "Summary": "Beta Drugs has scheduled a board meeting on October 19 to evaluate a proposal for raising funds through preferential allotment to non-promoters.",
            "Sentiment": "neutral",
            "PublishDate": 1729078884000,
            "Source": "corporate_action"
        }
    ]
}