{
    "Symbol": "BFINVEST",
    "ISIN": "INE878K01010",
    "News": [
        {
            "Title": "BF Investment faces ferrous casting restrictions",
            "Summary": "BF Investment Limited discloses impact of shareholders agreement executed by related party Bharat Forge Limited on February 2, 2026, imposing non-compete restrictions on ferrous casting business in India.",
            "Sentiment": "neutral",
            "PublishDate": 1770116604785,
            "Source": "stocks"
        },
        {
            "Title": "BF Investments Reports Decline in Q2 Net Profit and Revenue",
            "Summary": "BF Investments reported a net profit of 456 million rupees for Q2, down from 493 million rupees in the same period last year. The company's total revenue also decreased to 637 million rupees compared to 745 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762933150357,
            "Source": "earnings"
        },
        {
            "Title": "BF Investment Limited Reports Strong Q1 FY26 Results with Significant Fair Value Gains",
            "Summary": "BF Investment Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. On standalone basis, the company reported total income of Rs 109.27 million compared to Rs 77.23 million in the same quarter last year, driven by interest income of Rs 73.88 million and net gain on fair value changes of Rs 20.37 million. Profit after tax increased to Rs 72.39 million from Rs 62.25 million year-over-year. Earnings per share stood at Rs 1.92 versus Rs 1.65 in the previous year. The company recorded substantial other comprehensive income of Rs 1,905.45 million, primarily due to changes in fair value of investments worth Rs 2,223.40 million. On consolidated basis, profit after tax reached Rs 384.38 million compared to Rs 1,826.11 million in the prior year quarter, with earnings per share of Rs 10.20. The company's consolidated results include share of net profit from associates of Rs 416.11 million. BF Investment operates as an investment company focusing on earning income through dividends, interest and gains on investments held in group companies.",
            "Sentiment": "positive",
            "PublishDate": 1755078369503,
            "Source": "earnings"
        },
        {
            "Title": "Authum Investment Executes Rs 1,330 Crore Block Trade on BSE",
            "Summary": "Authum Investment completed a block trade worth Rs 1,330.31 crore on the BSE. The transaction involved approximately 5.83 million shares priced at Rs 2,280 per share at market open.",
            "Sentiment": "neutral",
            "PublishDate": 1753415944635,
            "Source": "order&deals"
        },
        {
            "Title": "BF Investments Reports Increased Q4 Net Profit and Total Income",
            "Summary": "BF Investments has reported its quarterly results. The company's Q4 net profit increased to 309 million rupees from 221 million rupees in the same quarter last year. Total income for Q4 rose to 452 million rupees from 333 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748513405000,
            "Source": "result"
        },
        {
            "Title": "BF Investment Reports Q2 Financial Results",
            "Summary": "BF Investment has announced its Q2 financial results. The company reported a net profit of 493 million rupees, down from 515 million rupees in the same quarter last year. However, revenue increased to 745 million rupees from 699 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730368490000,
            "Source": "result"
        }
    ]
}