{
    "Symbol": "BFUTILITIE",
    "ISIN": "INE243D01012",
    "News": [
        {
            "Title": "BF Utilities Q1FY26 Net Profit Jumps 21.7% to ₹96.6 Cr",
            "Summary": "BF Utilities reported Q1FY26 consolidated net profit of ₹96.6 crores, up 21.7% YoY. Revenue grew 7.2% to ₹217.8 crores with EBITDA margin expanding to 79.5%.",
            "Sentiment": "positive",
            "PublishDate": 1765870293882,
            "Source": "co_actions_results"
        },
        {
            "Title": "BF Utilities Limited Submits Business Responsibility and Sustainability Report for FY 2024-25",
            "Summary": "BF Utilities Limited filed its Business Responsibility and Sustainability Report (BRSR) for financial year 2024-25 with stock exchanges, marking the wind power company's initial year of ESG adoption. The company reported a turnover of Rs. 416,822,018 and paid-up capital of Rs. 188,338,140, while facing regulatory penalties of Rs. 42,24,400 from NSE and BSE for delayed filing of quarterly results.",
            "Sentiment": "neutral",
            "PublishDate": 1764239695761,
            "Source": "corporate_action"
        },
        {
            "Title": "BF Utilities Reports Mixed Q2 Results with Profit Drop and Ongoing Arbitration Concerns",
            "Summary": "BF Utilities Limited reported quarterly results for the period ended September 30, 2025. Revenue from operations declined to Rs 797.15 lakhs from Rs 1,373.72 lakhs in the same quarter last year. Net profit dropped significantly to Rs 178.77 lakhs compared to a loss of Rs 97.07 lakhs in the previous year quarter. For the half-year period, the company posted a profit of Rs 820.89 lakhs versus a loss of Rs 1,653.08 lakhs in the corresponding period last year. The company operates in two segments: Wind Mills and Infrastructure. The company faces a significant arbitration claim where claimants are seeking damages of Rs 500 crores plus 18% IRR from the date of investment, along with additional claims of Rs 70.90 crores related to share acquisitions. The company and other promoters have denied the alleged breaches and plan to contest the claims. The auditors have issued a qualified review report citing concerns about potential material impacts from the arbitration proceedings and impairment issues related to subsidiary investments.",
            "Sentiment": "negative",
            "PublishDate": 1762930767900,
            "Source": "earnings"
        },
        {
            "Title": "BF Utilities Reports Strong Q2 Turnaround with ₹18M Net Profit",
            "Summary": "BF Utilities posted a net profit of ₹18 million in Q2, marking a significant turnaround from a loss of ₹9.8 million in the same period last year. The company's EBITDA more than doubled to ₹17 million from ₹8 million year-over-year. EBITDA margin expanded substantially to 20.95% compared to 8.8% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762930348994,
            "Source": "earnings"
        },
        {
            "Title": "BF Utilities Reports Strong Financial Performance Despite Adverse Audit Opinion and Ongoing Arbitration",
            "Summary": "BF Utilities Limited announced consolidated financial results for the quarter and year ended March 31, 2025, showing total revenue of Rs. 98,853.48 lakhs and profit after tax of Rs. 33,784.74 lakhs for the year. However, the company received an adverse audit opinion from G.D. Apte & Co. due to multiple issues including classification disputes regarding equity shares in step-down subsidiary NECE, an ongoing arbitration claim of Rs. 500 crores plus 18% interest from AIRRO Mauritius Holdings V and Soinfra Enterprises, and concerns over a 14-year outstanding advance of Rs. 3,700 lakhs to NECE. The Board also approved the re-appointment of Mr. Amit B. Kalyani as Non-Executive Director and addressed non-compliance penalties from stock exchanges for delayed submission of quarterly results. The company's toll operations subsidiary NHDL concluded operations in September 2024 after the concession agreement ended.",
            "Sentiment": "negative",
            "PublishDate": 1761887469936,
            "Source": "earnings"
        },
        {
            "Title": "BF Utilities Receives Statement of Claim from AIRRO Holdings in Arbitration Dispute",
            "Summary": "BF Utilities Limited has received a Statement of Claim from AIRRO (Mauritius) Holdings V and others, seeking damages and other reliefs under a Shareholders' Agreement dated December 24, 2010. The company plans to contest these claims and defend its position before the Singapore International Arbitration Centre (SIAC). This represents a development in ongoing litigation that was previously disclosed on August 13, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1759232276952,
            "Source": "stock"
        },
        {
            "Title": "BF Utilities Reports 63% Decline in Net Profit and 31% Drop in Revenue",
            "Summary": "BF Utilities reported a net profit of 64 million rupees compared to 175 million rupees in the same quarter last year, representing a significant decline. The company's total revenue also decreased to 173 million rupees from 250 million rupees year-over-year. The results show substantial declines in both profitability and revenue performance.",
            "Sentiment": "negative",
            "PublishDate": 1755084442243,
            "Source": "earnings"
        },
        {
            "Title": "BF Utilities Reports Strong Q1 FY26 Results with 3,532% Profit Surge Despite Auditor Concerns",
            "Summary": "BF Utilities Limited reported quarterly results for the quarter ended June 30, 2025, showing revenue from operations of Rs 576.57 lakhs and profit after tax of Rs 642.12 lakhs, compared to Rs 7.07 lakhs in the same quarter last year. The company operates in two segments: Wind Mills (Rs 682.46 lakhs revenue) and Infrastructure (Rs 1,042.88 lakhs revenue). However, auditors issued a qualified review report citing concerns over a Rs 3,700 lakhs interest-free advance to subsidiary NECE outstanding for over fifteen years without adequate impairment provision. The company faces ongoing arbitration proceedings at Singapore International Arbitration Centre initiated by AIRRO (Mauritius) Holdings V regarding exit provisions from subsidiary NECE under a 2010 shareholders' agreement. Additionally, three of four subsidiaries have not submitted their quarterly results, delaying consolidated financial statements. The toll operations of subsidiary Nandi Highway Developers Limited concluded in September 2024 after the concession agreement expired.",
            "Sentiment": "neutral",
            "PublishDate": 1755084256299,
            "Source": "earnings"
        },
        {
            "Title": "BF Utilities Shareholders Approve Appointment of Madan Umakant Takale as Non-Executive Director",
            "Summary": "BF Utilities Limited successfully completed a postal ballot process for the appointment of Mr. Madan Umakant Takale as a Non-Executive, Non-Independent Director. The remote e-voting period ran from July 4, 2025 to August 2, 2025. Out of 51,548 total shareholders on record, 194 members participated in the voting process, casting 20,321,341 votes. The resolution passed with overwhelming support, receiving 99.42% votes in favor (20,202,622 votes) and only 0.58% against (118,719 votes). The scrutinizer Mr. Sridhar Mudaliar confirmed the voting process was conducted fairly and transparently. The company dispatched postal ballot notices via email to eligible shareholders and published newspaper advertisements to inform members about the voting process.",
            "Sentiment": "positive",
            "PublishDate": 1754306942698,
            "Source": "corporate_action"
        },
        {
            "Title": "BF Utilities Appoints Madan Umakant Takale as Non-Executive Director",
            "Summary": "BF Utilities Limited appointed Mr. Madan Umakant Takale as a Non-Executive, Non-Independent Director effective May 29, 2025. The appointment was approved by shareholders through a postal ballot with e-voting conducted from July 4 to August 2, 2025. Mr. Takale is a Mechanical Engineer with over 40 years of experience in forging and automotive industries. He holds an MS in Industrial and Systems Engineering from Columbia University and an MBA from Western Carolina University, with six years of experience in the U.S. automotive industry. He is not related to any other Director or Key Managerial Personnel on the company's Board and is not debarred from holding directorship by any regulatory authority.",
            "Sentiment": "positive",
            "PublishDate": 1754306371818,
            "Source": "corporate_governance"
        },
        {
            "Title": "BF Utilities Conducts Postal Ballot for Director Appointment",
            "Summary": "BF Utilities Limited conducted a postal ballot through electronic voting to seek shareholder approval for the appointment of Mr. Madan Umakant Takale as a Non-Executive, Non-Independent Director. The e-voting process ran from July 04, 2025 to August 02, 2025, with National Securities Depository Limited providing the e-voting facility. M/s. SVD & Associates was appointed as scrutinizer for the voting process. The voting rights were determined based on shareholding as of June 27, 2025. Results will be declared by August 05, 2025 and will be available on the company's website and NSDL's portal.",
            "Sentiment": "neutral",
            "PublishDate": 1754136541258,
            "Source": "corporate_governance"
        },
        {
            "Title": "BF Utilities Reports Promoter Demat Account Freeze Following Delayed Financial Results",
            "Summary": "BF Utilities has disclosed that its promoter's demat account has been frozen due to delays in submitting financial results. The freeze action appears to be a consequence of the company's failure to meet regulatory deadlines for financial reporting requirements.",
            "Sentiment": "negative",
            "PublishDate": 1753701417559,
            "Source": "corporate_governance"
        },
        {
            "Title": "BF Utilities Reports Decline in Q3 Revenue",
            "Summary": "BF Utilities has reported a decrease in its third-quarter revenue. The company's revenue for Q3 stood at 2.1 billion rupees, compared to 2.42 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1744178116000,
            "Source": "earnings"
        },
        {
            "Title": "BF Utilities Reports Q3 Financial Results",
            "Summary": "BF Utilities has announced its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q3 is 1.23 billion rupees, compared to 1.49 billion rupees in the same quarter last year. Despite the year-over-year decrease in EBITDA, the company's EBITDA margin has improved to 73% from 61% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1744178027000,
            "Source": "earnings"
        },
        {
            "Title": "BF Utilities Reports Q4 FY2023 Consolidated Net Profit",
            "Summary": "BF Utilities has reported a consolidated net profit of 347 million rupees for the fourth quarter, compared to 373 million rupees in the same period last year, indicating a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1744177871000,
            "Source": "earnings"
        },
        {
            "Title": "BF Utilities Reports Q3 Financial Results",
            "Summary": "BF Utilities has reported its financial results for the third quarter. The company's consolidated net loss has slightly improved to 6 million rupees, compared to a loss of 7 million rupees in the same period last year. Revenue for Q3 has increased to 18 million rupees from 14 million rupees year-over-year, showing a 28.57% growth.",
            "Sentiment": "neutral",
            "PublishDate": 1739441563000,
            "Source": "earnings"
        },
        {
            "Title": "BF Utilities: Q2 Profit Dips 7.81% Despite Revenue Growth",
            "Summary": "BF Utilities reported Q2 FY25 results with revenue up 1.34% YoY to ₹221.34 crore, but profit down 7.81% to ₹39.13 crore. Operating income increased 12.31% YoY. EPS stood at ₹10.39. Quarterly revenue grew 12.1% and profit 5.84% compared to Q1.",
            "Sentiment": "neutral",
            "PublishDate": 1735278560000,
            "Source": "earnings"
        },
        {
            "Title": "BF Utilities Reports Improved Q2 Financial Performance",
            "Summary": "BF Utilities has announced its Q2 financial results, showing an increase in EBITDA to 1.67 billion rupees from 1.49 billion rupees year-over-year. The company's EBITDA margin also improved, rising to 75.62% from 68.33% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1735196589000,
            "Source": "earnings"
        },
        {
            "Title": "BF Utilities Reports Q2 FY24 Consolidated Net Profit",
            "Summary": "BF Utilities has announced its Q2 FY24 consolidated net profit of 391 million rupees, compared to 424 million rupees in the same quarter last year, indicating a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1735196357000,
            "Source": "earnings"
        },
        {
            "Title": "BF Utilities Reports Decline in Q2 EBITDA and Margin",
            "Summary": "BF Utilities has reported a decrease in its second quarter EBITDA, which fell to 8 million rupees from 11 million rupees in the same period last year. The company's EBITDA margin also declined to 8.86% from 11.08% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730363145000,
            "Source": "result"
        },
        {
            "Title": "BF Utilities Reports Q2 Net Loss",
            "Summary": "BF Utilities has reported a net loss of 9.7 million rupees in Q2, compared to a profit of 15 million rupees in the same quarter last year. The company's revenue for Q2 decreased to 89 million rupees from 103 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730363060000,
            "Source": "result"
        }
    ]
}