{
    "Symbol": "BHAGYANGR",
    "ISIN": "INE458B01036",
    "News": [
        {
            "Title": "Bhagyanagar India Holds Investor Meeting Call",
            "Summary": "Bhagyanagar India Limited conducted its investor meeting and earnings call on January 31, 2026, with audio and video recordings now available on the company website for stakeholder access.",
            "Sentiment": "neutral",
            "PublishDate": 1769861234702,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bhagyanagar India Gets NCLT Approval for Scheme",
            "Summary": "Bhagyanagar India Limited receives NCLT order for composite scheme of arrangement involving amalgamation with subsidiary and demerger into new entity Tieramet Limited.",
            "Sentiment": "positive",
            "PublishDate": 1769755154145,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bhagyanagar India's Subsidiary Gets BBB+ Credit Rating",
            "Summary": "Acuite Ratings assigns 'ACUITE BBB+' with Stable outlook to Bhagyanagar Copper Private Limited, wholly owned subsidiary of Bhagyanagar India Limited.",
            "Sentiment": "positive",
            "PublishDate": 1769692810058,
            "Source": "stocks"
        },
        {
            "Title": "Bhagyanagar India Board Meet on Jan 30 for Q3FY26",
            "Summary": "Bhagyanagar India Limited has scheduled a board meeting on January 30, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769509129245,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bhagyanagar India explains delayed MD resignation filing",
            "Summary": "Bhagyanagar India Limited disclosed additional details to stock exchanges regarding the delayed disclosure of Managing Director Narender Surana's resignation, citing facility disruption as cause.",
            "Sentiment": "neutral",
            "PublishDate": 1767955602306,
            "Source": "stocks"
        },
        {
            "Title": "Bhagyanagar India Limited Company Secretary Resigns",
            "Summary": "Janaki Rama Lakshmana Rao Kanukollu resigned from his position as Company Secretary and Compliance Officer at Bhagyanagar India Limited effective November 20, 2025. The resignation affects the company's compliance and secretarial functions, with the company accepting his resignation citing professional goals and personal circumstances.",
            "Sentiment": "neutral",
            "PublishDate": 1763640042994,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bhagyanagar India Reports Strong H1 Performance with Revenue Up 37% and EBITDA Doubling",
            "Summary": "Bhagyanagar India Limited achieved revenue growth from ₹777 crores to ₹1,065 crores in the first half, with EBITDA nearly doubling from ₹14.83 crores to ₹41.39 crores and PAT rising from ₹7 crores to ₹25 crores. The copper products manufacturer is targeting ₹5,000 crores turnover in 7-8 years through value-added products expansion and plans corporate restructuring to separate copper assets into a distinct listed entity within 12 months.",
            "Sentiment": "positive",
            "PublishDate": 1763357747026,
            "Source": "earnings"
        },
        {
            "Title": "Bhagyanagar India Limited Reports Strong Q2 Performance with Revenue Growth and Profit Surge",
            "Summary": "Bhagyanagar India Limited announced its unaudited financial results for the second quarter and half year ended September 30, 2025. On a standalone basis, the company reported total income of Rs 824.39 lakhs for Q2 2025 compared to Rs 332.37 lakhs in Q2 2024. Profit after tax increased significantly to Rs 122.58 lakhs in Q2 2025 from Rs 40.28 lakhs in the same period last year. On a consolidated basis, revenue from operations reached Rs 58,037.08 lakhs in Q2 2025 versus Rs 40,801.90 lakhs in Q2 2024. Consolidated profit after tax jumped to Rs 1,127.23 lakhs in Q2 2025 from Rs 372.93 lakhs in Q2 2024. The company's earnings per share on a consolidated basis improved to Rs 1.76 for Q2 2025 compared to Rs 0.58 in the previous year quarter. The Board of Directors approved these results at their meeting held on October 25, 2025. The company also filed a Composite Scheme of Arrangement involving its subsidiary companies during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761387968009,
            "Source": "earnings"
        },
        {
            "Title": "Bhagyanagar India Limited Appoints New Company Secretary and Compliance Officer",
            "Summary": "Bhagyanagar India Limited appointed Mr. Janaki Rama Lakshmana Rao Kanukollu as Company Secretary and Compliance Officer effective October 14, 2025. The appointment was made by the Board of Directors based on recommendations from the Nomination and Remuneration Committee. Mr. Kanukollu is an Associate Member of the Institute of Company Secretaries of India with membership number ACS 33703. He holds LLB and LLM degrees with specialization in International Laws and brings 30 years of experience in secretarial, legal and corporate laws. He has been authorized to determine materiality of events for stock exchange disclosures.",
            "Sentiment": "neutral",
            "PublishDate": 1760438005542,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bhagyanagar India Limited Approves Composite Scheme for Copper Business Restructuring",
            "Summary": "Bhagyanagar India Limited's Board approved a Composite Scheme of Arrangement on September 20, 2025, involving the amalgamation of wholly-owned subsidiary Bhagyanagar Copper Private Limited and subsequent demerger of the copper division to Tieramet Limited. The scheme has an appointed date of April 1, 2025. Bhagyanagar Copper Private Limited reported total assets of Rs 48,966.07 lakhs and turnover of Rs 1,62,032.78 lakhs for FY ended March 31, 2025, while Bhagyanagar India Limited had assets of Rs 17,755.80 lakhs and turnover of Rs 527.73 lakhs. The company plans to seek listing of Tieramet Limited's equity shares on NSE and BSE. Shareholders of Bhagyanagar India Limited will receive shares in Tieramet Limited at a 1:1 ratio. The scheme aims to reorganize corporate structure, unlock shareholder value, improve operational efficiency, and create a focused entity for copper manufacturing business. The arrangement requires approvals from stock exchanges, shareholders, creditors, regulatory authorities, and the National Company Law Tribunal.",
            "Sentiment": "positive",
            "PublishDate": 1758375197958,
            "Source": "corporate_action"
        },
        {
            "Title": "Bhagyanagar India Limited Schedules Board Meeting for Composite Scheme of Arrangement",
            "Summary": "Bhagyanagar India Limited has scheduled a board meeting for September 20, 2025, to consider and approve a Composite Scheme of Arrangement involving merger/demerger with its wholly owned subsidiaries. The company has announced that the trading window for designated persons and their immediate relatives will be closed from September 18, 2025, until the closing hours of September 23, 2025. Trading will resume on September 24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758111897452,
            "Source": "corporate_action"
        },
        {
            "Title": "Bhagyanagar India Limited Incorporates Wholly Owned Subsidiary TIERAMET LIMITED",
            "Summary": "Bhagyanagar India Limited has incorporated a new wholly owned subsidiary named TIERAMET LIMITED. The subsidiary was incorporated on August 29, 2025, with an authorized capital of Rs. 1,00,000. TIERAMET LIMITED will focus on manufacturing and processing copper and copper-based products for industrial applications including electrical and telecommunications sectors, and will also operate in the renewable energy sector developing clean energy systems and technologies. The subsidiary has yet to commence business operations and obtain certificate of commencement of business. The company holds 100% shareholding through cash subscription to the share capital.",
            "Sentiment": "positive",
            "PublishDate": 1758111074850,
            "Source": "corporate_action"
        },
        {
            "Title": "Bhagyanagar India Limited Approves Director Re-appointments and Secretarial Auditor Appointment",
            "Summary": "Bhagyanagar India Limited's Board approved the re-appointment of Sanjana Jain as Independent Director for a second five-year term from September 30, 2025 to September 29, 2030, and Naresh Chand Bhardwaj as Whole-time Director for three years from June 23, 2026 to June 22, 2029 at Rs. 85,000 monthly remuneration. The Board also recommended appointing M/s Rakhi Agarwal, Practicing Company Secretaries, as Secretarial Auditor for five consecutive financial years from 2025-26 to 2029-30. Additionally, the Board approved changes to the company's Memorandum of Association object clause to include provisions for amalgamation, merger, demerger, and joint ventures. All appointments and changes are subject to shareholder approval at the 40th Annual General Meeting scheduled for September 30, 2025 via video conferencing. The record date for determining eligible voting members is September 23, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1756971130122,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bhagyanagar India Limited Company Secretary Ritika Tandon Resigns",
            "Summary": "Ritika Tandon has resigned from her position as Company Secretary and Compliance Officer of Bhagyanagar India Limited, effective from the close of business hours on July 30, 2025. The company has accepted her resignation. In her resignation letter dated July 3, 2025, Tandon cited professional goals and personal circumstances as reasons for her decision. She also resigned from her position as Nodal Officer at the company's subsidiary, Bhagyanagar Copper Private Limited. Tandon expressed gratitude to the Board and management and committed to ensuring a smooth transition during the handover process.",
            "Sentiment": "neutral",
            "PublishDate": 1753878070566,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bhagyanagar India Reports Strong Q1 Results, Board Approves Corporate Restructuring Plans",
            "Summary": "Bhagyanagar India Limited approved its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 185.09 lakhs compared to Rs 141.19 lakhs in the same quarter last year, with net profit increasing to Rs 83.30 lakhs from Rs 2.01 lakhs. On a consolidated basis, revenue from operations reached Rs 48,560.29 lakhs versus Rs 36,920.66 lakhs in the previous year, with consolidated profit rising to Rs 757.17 lakhs from Rs 172.51 lakhs. The Board also resolved to evaluate multiple strategies for corporate restructuring and authorized its Executive Committee to identify suitable options. The statutory auditors issued an unmodified opinion on the financial results.",
            "Sentiment": "positive",
            "PublishDate": 1753166911319,
            "Source": "earnings"
        },
        {
            "Title": "Bhagyanagar India Acquires Majority Stake in Crescentia Technology",
            "Summary": "Bhagyanagar India has acquired a 51% stake in Crescentia Technology, marking its expansion into the solar sector. This strategic move indicates Bhagyanagar India's intention to diversify its business portfolio and enter the growing renewable energy market.",
            "Sentiment": "positive",
            "PublishDate": 1741427942000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bhagyanagar India Secures 53 MW Solar Power Project Contract",
            "Summary": "Bhagyanagar India has been awarded a Letter of Acceptance (LOA) for the development of a 53 MW (AC) solar power project. The contract is valued at 245 crore rupees. The company's current market capitalization is reported to be 250 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1740468425000,
            "Source": "order&deals"
        },
        {
            "Title": "Bhagyanagar India Secures Major Order Worth 230 Crore Rupees",
            "Summary": "Bhagyanagar India has won a significant order valued at 230 crore rupees. This new order is expected to boost the company's annual revenue by 15%, indicating a substantial impact on the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1738827543000,
            "Source": "order&deals"
        }
    ]
}