{
    "Symbol": "BHAGCHEM",
    "ISIN": "INE414D01027",
    "News": [
        {
            "Title": "Bhagiradha Chemicals Q3FY26 Results & CFO Change",
            "Summary": "Bhagiradha Chemicals reports Q3FY26 standalone revenue of ₹11,392.19 lakhs with net profit of ₹482.79 lakhs. Company appoints Ranjit Kumar Kilaru as new CFO from March 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770719463807,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bhagiradha Chemicals Board Meet on Feb 10, 2026",
            "Summary": "Bhagiradha Chemicals & Industries Limited has scheduled a board meeting on February 10, 2026, to consider Q3FY26 unaudited financial results. Trading window closed from January 01, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769758831406,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bhagiradha Chemicals Clarifies Volume Surge to BSE",
            "Summary": "Bhagiradha Chemicals & Industries responds to BSE inquiry about recent trading volume spike, stating compliance with disclosure norms and attributing surge to market forces.",
            "Sentiment": "neutral",
            "PublishDate": 1766132585451,
            "Source": "stocks"
        },
        {
            "Title": "Bhagiradha Chemicals Reports 23% Revenue Growth in H1FY26 Despite Margin Pressures",
            "Summary": "Bhagiradha Chemicals and Industries Limited reported revenue from operations of Rs. 263.9 crores in H1FY26, representing 23% year-over-year growth driven by close to double-digit volume growth and improved price realizations. The company achieved EBITDA of Rs. 24.0 crores, up 11% from the previous year, supported by better operating efficiency. However, PAT declined to Rs. 9.5 crores from Rs. 11.1 crores in H1FY25, primarily due to elevated finance costs from increased working capital utilization. Gross margins were impacted by higher raw material costs and clearance of low-margin inventory. The company launched a new herbicide product and commissioned a 4MW solar plant. Phase 1 of the Rs. 800 crore expansion plan in subsidiary Bheema Fine Chemicals has been implemented at a cost of Rs. 429 crores, with structured production ramp-up planned over the next six months. Management indicated that pricing pressures have largely bottomed out and average realizations are beginning to improve.",
            "Sentiment": "positive",
            "PublishDate": 1762906197400,
            "Source": "earnings"
        },
        {
            "Title": "Bhagiradha Chemicals Outlines Growth Strategy Through Capacity Expansion and R&D Enhancement",
            "Summary": "Bhagiradha Chemicals has outlined its growth strategy focusing on capacity expansion at Ongole and development of new agrochemical molecules. The company is strengthening its R&D pipeline to enter the global off-patent market while diversifying its product mix toward high-value intermediates and formulations. The strategy emphasizes operational efficiency, import substitution, and backward integration to enhance margins and export competitiveness.",
            "Sentiment": "positive",
            "PublishDate": 1762872090909,
            "Source": "stock"
        },
        {
            "Title": "Bhagiradha Chemicals Fully Utilizes Rs 341.18 Crore Preferential Issue Proceeds",
            "Summary": "Bhagiradha Chemicals and Industries Limited announced that 100% of its preferential issue proceeds amounting to Rs 341.18 crore have been fully utilized as of June 30, 2025. The funds were raised through fully convertible warrants allotted on November 17, 2023, with additional amounts received in May 2024 (Rs 203.60 crore) and January 2025 (Rs 52.28 crore). The company completed allotment of 2,56,14,250 equity shares during the previous financial year. The Board approved concluding the Monitoring Agency oversight from the quarter ended September 30, 2025 onwards, as the purpose for which the proceeds were raised has been achieved. The funds were used for objects approved by shareholders, including capital expenditure for setting up a new manufacturing unit under wholly owned subsidiary Bheema Fine Chemicals Private Limited in Karnataka and working capital requirements.",
            "Sentiment": "positive",
            "PublishDate": 1762790916985,
            "Source": "corporate_action"
        },
        {
            "Title": "Bhagiradha Chemicals Reports Mixed Q2 Results with Revenue Growth and Profit Decline",
            "Summary": "Bhagiradha Chemicals reported quarterly consolidated net profit of 55 million rupees compared to 54 million rupees in the same period last year. Revenue increased to 1.4 billion rupees from 1.04 billion rupees year-over-year. However, EBITDA declined significantly to 15.5 million rupees from 97.1 million rupees in the previous year. EBITDA margin improved to 10.75% from 9.36% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1762772144755,
            "Source": "earnings"
        },
        {
            "Title": "Bhagiratha Chemicals Appoints Venkat Sai as Additional Director at Subsidiary",
            "Summary": "Bhagiratha Chemicals and Industries Limited announced that its wholly owned subsidiary, Bheema Fine Chemicals Private Limited, appointed Mr. Venkat Sai (DIN: 08976504) as an Additional Director in the capacity of Whole Time Director with effect from November 04, 2025. Mr. Venkat Sai brings over 35 years of experience in the agrochemical industry, having previously served as a Board Member and Executive Committee Lead at Nichino India. He has expertise in operational excellence, strategic planning, market intelligence, and has been responsible for B2B partnerships, product development, marketing, demand generation, and regulatory affairs. The company confirmed that Mr. Venkat Sai is not related to any director of the company or its subsidiary and has not been debarred from holding directorship by SEBI or other authorities.",
            "Sentiment": "positive",
            "PublishDate": 1762246432820,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bhagiradha Chemicals Extends Rs. 215 Crore Corporate Guarantee for Subsidiary's Bank Credit Facilities",
            "Summary": "Bhagiradha Chemicals and Industries Limited has provided a corporate guarantee of Rs. 215 crores for its wholly owned subsidiary, Bheema Fine Chemicals Private Limited, to secure credit limits from three banks. The guarantee covers facilities from Axis Bank (Rs. 105 crores for working capital and term loans), ICICI Bank (Rs. 40 crores), and RBL Bank (Rs. 70 crores). The promoter group has no interest in this transaction, which is conducted on an arm's length basis. The guarantee will be recorded as a contingent liability in the company's books, with no other impact on the listed entity.",
            "Sentiment": "neutral",
            "PublishDate": 1760536552144,
            "Source": "stock"
        },
        {
            "Title": "Bhagiradha Chemicals Reports 11% Revenue Growth Despite 25% EBITDA Decline in Q1 Results",
            "Summary": "Bhagiradha Chemicals and Industries Limited reported revenue of Rs. 123.8 crores for the quarter ended June 30, 2025, marking an 11% year-over-year increase from Rs. 111.4 crores. However, EBITDA declined 25% to Rs. 9.0 crores from Rs. 12.0 crores, with margins contracting to 7.3% from 10.8%. PAT fell 30% to Rs. 4.0 crores from Rs. 5.7 crores. The agrochemical manufacturer attributed revenue growth to strong volume recovery despite pricing pressures, while margin compression resulted from raw material cost pressures and higher finance costs. The company operates with 97% export revenue and 3% domestic sales. Management indicated that Phase I of their capacity expansion is expected to be operational by September 2025, with a total investment of over Rs. 800 crores for greenfield expansion. The company is targeting 5x revenue growth over 6-7 years through backward integration, new product development, and contract manufacturing initiatives.",
            "Sentiment": "neutral",
            "PublishDate": 1755529621484,
            "Source": "earnings"
        },
        {
            "Title": "Bhagiradha Chemicals Reports 14.6% Revenue Growth in Q1 FY26, Converts ₹367.53 Crore Subsidiary Loan to Equity",
            "Summary": "Bhagiradha Chemicals and Industries Limited reported standalone revenue from operations of ₹12,377.78 lakhs for the quarter ended June 30, 2025, compared to ₹11,077.76 lakhs in the same period last year. Net profit increased to ₹828.73 lakhs from ₹723.15 lakhs year-over-year. The company converted a loan of ₹36,753 lakhs extended to its subsidiary Bheema Fine Chemicals Private Limited into equity share capital, receiving 4,08,36,237 equity shares at ₹90 per share. The company adopted a reduced corporate tax rate of 22% effective April 1, 2025, resulting in a deferred tax liability reduction of ₹307.75 lakhs. On a consolidated basis, the company reported revenue of ₹12,377.78 lakhs and net profit of ₹397.91 lakhs. The board confirmed no deviation in the use of proceeds from the preferential issue of convertible warrants totaling ₹341.18 crores raised across multiple tranches.",
            "Sentiment": "positive",
            "PublishDate": 1754995463858,
            "Source": "earnings"
        },
        {
            "Title": "Bhagiradha Chemicals Gets Exchange Approval for Promoter Group Reclassification",
            "Summary": "Bhagiradha Chemicals and Industries Limited received no-objection letters from BSE and NSE for reclassifying three individuals from 'Promoter Group' to 'Public' category. The reclassification affects T Kalyan Chakravarthi (125,000 shares, 0.10%), Potini Vijaya Lakshmi (31,740 shares, 0.02%), and Ramalakshmi Tulasi Padmavathy Kolli (33,000 shares, 0.03%), totaling 189,740 shares representing 0.15% of total shareholding. Both exchanges granted approval on August 07, 2025, following the company's application submitted on May 29, 2025. The company must ensure compliance with subsequent disclosure requirements related to this reclassification.",
            "Sentiment": "neutral",
            "PublishDate": 1754564056005,
            "Source": "corporate_action"
        },
        {
            "Title": "Bhagiradha Chemicals Reports Q4 Financial Results",
            "Summary": "Bhagiradha Chemicals has reported its Q4 financial results. The company's EBITDA for Q4 was 72 million rupees, down from 140 million rupees in the same quarter last year. The EBITDA margin decreased to 5.90% from 12.64% year-over-year. Net profit for Q4 was 52 million rupees, compared to 81 million rupees in the previous year and 71 million rupees in the previous quarter. Q4 revenue increased to 1.2 billion rupees from 1.1 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748434664000,
            "Source": "result"
        },
        {
            "Title": "Bhagiradha Chemicals Reports Strong Q3 Financial Results",
            "Summary": "Bhagiradha Chemicals has announced its financial results for the third quarter. The company's net profit increased to 71 million rupees, up from 37 million rupees in the same quarter last year. Revenue also saw significant growth, reaching 1 billion rupees compared to 744 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739492309000,
            "Source": "earnings"
        },
        {
            "Title": "Bhagiradha Chemicals Reports Mixed Q3 Results",
            "Summary": "Bhagiradha Chemicals has reported its Q3 financial results. The company's EBITDA increased to 93 million rupees from 81.6 million rupees in the same quarter last year. However, the EBITDA margin decreased to 9.06% from 10.97% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739443787000,
            "Source": "earnings"
        },
        {
            "Title": "Bhagiradha Chemicals Reports Strong Q3 Financial Results",
            "Summary": "Bhagiradha Chemicals has announced its financial results for the third quarter. The company's net profit increased to 71 million rupees, up from 37 million rupees in the same period last year. Revenue also saw significant growth, reaching 1 billion rupees compared to 744 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739443784000,
            "Source": "earnings"
        },
        {
            "Title": "Bhagiradha Chemicals Announces Major Expansion Plan",
            "Summary": "Bhagiradha Chemicals has unveiled plans for a significant expansion project worth over Rs 800 crore. The phased expansion includes greenfield capacity, backward integration, and the introduction of new products. The company expects an asset turnover of 1.5x and improved profit margins. The expansion is scheduled to begin in March 2024 and continue through the fiscal year 2027.",
            "Sentiment": "positive",
            "PublishDate": 1731555637000,
            "Source": "corporate_action"
        }
    ]
}