{
    "Symbol": "BHAGERIA",
    "ISIN": "INE354C01027",
    "News": [
        {
            "Title": "Bhageria Industries Q3 Revenue Jumps 39.5% YoY",
            "Summary": "Bhageria Industries reports Q3 revenue of ₹2.4 billion, up from ₹1.72 billion YoY, though net profit declined to ₹120 million from ₹129 million in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1770038850688,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bhageria Industries Board Meet Set for Feb 2, 2026",
            "Summary": "Bhageria Industries Limited has scheduled a board meeting on February 2, 2026, to consider and approve Q3 FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769156428078,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bhageria Industries Faces ₹2.92 Cr GST Demand Order",
            "Summary": "Bhageria Industries receives GST demand order totaling ₹2.92 crores from CGST authorities for ITC-related violations spanning FY 2018-19 to FY 2024-25. Company plans to file appeal.",
            "Sentiment": "negative",
            "PublishDate": 1767100133746,
            "Source": "stocks"
        },
        {
            "Title": "Bhageria Industries Liquidates Wholly Owned Subsidiary in Bahrain",
            "Summary": "Bhageria Industries Limited has completed the liquidation of its wholly owned subsidiary Bhageria Industries Holding Company W.L.L. in Bahrain with effect from November 20, 2025. The company closed the subsidiary to streamline its international structure and reduce compliance burden, as its branch office operations were deemed sufficient for the solar EPC project in Bahrain.",
            "Sentiment": "neutral",
            "PublishDate": 1764321407086,
            "Source": "corporate_action"
        },
        {
            "Title": "Bhageria Industries Reports 55.6% Revenue Growth in Q2 FY26, Expands into Plasticizers Segment",
            "Summary": "Bhageria Industries delivered strong quarterly results with total income rising 55.6% year-on-year to Rs. 260.2 crores in Q2 FY26. Net profit surged 80% to Rs. 11.47 crores, while EBITDA increased 47% to Rs. 24.75 crores. For the first half of FY26, total income grew 48% to Rs. 369.99 crores with net profit jumping 83% to Rs. 22.36 crores. The company announced entry into the plasticizers segment with commercial production starting by December 2025, targeting applications in PVC cables, flooring, and automotive components. The company is expanding H-ACID capacity from 400 to 500 metric tons per month with a Rs. 5 crore investment, expected to generate Rs. 50-75 crores additional annual revenue. Current plant utilization stands at 95-97% across facilities. The company operates in specialty chemicals manufacturing with focus on dyes, intermediates, performance chemicals, and renewable energy. Export markets remain strong with healthy demand from Southeast Asia and Europe, while the US represents a smaller portion of sales.",
            "Sentiment": "positive",
            "PublishDate": 1761837198342,
            "Source": "earnings"
        },
        {
            "Title": "Bhageria Industries Reports 89% Jump in Net Profit for H1 FY26 on Strong Revenue Growth",
            "Summary": "Bhageria Industries announced its unaudited results showing net profit surged 83.28% to ₹22.36 crore for H1 FY26, while total income rose 48.24% to ₹369.99 crore. The diversified chemical manufacturer's net profit margin improved to 6.04% from 4.89% in the previous period. For Q2 FY26, net profit increased 79.68% to ₹11.47 crore on total income of ₹206.02 crore, up 55.59% year-on-year. The company is expanding H-Acid capacity from 400 MT/M to 500 MT/M at Tarapur, expected to generate ₹50-55 crore in annual revenue. Bhageria has launched production of plasticizers and ethoxylates at Tarapur, entering the polymer additives market for PVC, cable, flooring, footwear and automotive components. CARE Ratings reaffirmed the company's credit rating at CARE A; Stable / CARE A1 for bank facilities totaling ₹91 crore. Chairman Suresh Bhageria attributed the performance to operational efficiency and improved product mix.",
            "Sentiment": "positive",
            "PublishDate": 1760946023094,
            "Source": "earnings"
        },
        {
            "Title": "Bhageria Industries Reports 82% Jump in Q2 Net Profit to 122 Million Rupees",
            "Summary": "Bhageria Industries reported Q2 net profit of 122 million rupees compared to 67 million rupees in the same period last year, marking an 82% increase. Revenue grew to 2.05 billion rupees from 1.29 billion rupees year-over-year, representing a 59% rise. EBITDA increased to 235 million rupees from 136 million rupees, while EBITDA margin improved to 11.48% from 10.54% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1760918859686,
            "Source": "earnings"
        },
        {
            "Title": "Bhageria Industries Reports Strong Q2 Performance with 58% Revenue Growth",
            "Summary": "Bhageria Industries Limited announced its quarterly results for the quarter ended September 30, 2025. The company reported standalone revenue from operations of Rs 20,475.47 lakhs compared to Rs 12,937.03 lakhs in the same quarter last year, representing significant growth. Net profit for the quarter stood at Rs 1,218.55 lakhs versus Rs 672.69 lakhs in the previous year. On a consolidated basis, revenue reached Rs 20,438.51 lakhs with net profit of Rs 1,147.29 lakhs. The company operates across four segments: Chemicals (including organic and inorganic chemicals), Solar Power, Pharma, and Others (trading and EPC in solar). The Board of Directors approved these unaudited financial results at their meeting held on October 18, 2025, following review by the Audit Committee.",
            "Sentiment": "positive",
            "PublishDate": 1760773905940,
            "Source": "earnings"
        },
        {
            "Title": "SAT Adjourns Bhageria Industries' Appeal Against SEBI Order to January 2026",
            "Summary": "The Securities Appellate Tribunal has adjourned the hearing of an application filed by Bhageria Industries Limited's promoters and directors challenging a SEBI adjudication order dated March 31, 2023. The matter is now scheduled for final disposal on January 8-9, 2026. The SEBI order remains stayed until the final hearing. This follows a previous adjournment from October 13, 2025, with the company having previously communicated an earlier adjournment in April 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760591771432,
            "Source": "stock"
        },
        {
            "Title": "Bhageria Industries Receives Approval for New Plasticizers and Ethoxylates Production",
            "Summary": "Bhageria Industries has introduced new plasticizers and ethoxylates products and received approval to begin commercial production on October 8, 2025. The company is expanding its product portfolio with these new chemical offerings.",
            "Sentiment": "positive",
            "PublishDate": 1759926154576,
            "Source": "stock"
        },
        {
            "Title": "Bhageria Industries Plans Capacity Expansion to 500 MT/M with ₹5 Crore Investment",
            "Summary": "Bhageria Industries Ltd announced plans to expand its production capacity from 400 MT/M to 500 MT/M. The company operates at approximately 95% capacity utilization. The expansion is expected to generate additional revenue of ₹50-55 crores and requires an investment of approximately ₹5 crores, which will be funded through internal accruals.",
            "Sentiment": "positive",
            "PublishDate": 1759737869472,
            "Source": "stock"
        },
        {
            "Title": "SAT Adjourns Bhageria Industries Promoters' Challenge Against SEBI Order to October 2025",
            "Summary": "The Securities Appellate Tribunal has adjourned the hearing on Bhageria Industries Limited promoters' and directors' legal challenge against a SEBI adjudication order dated March 31, 2023. The matter is now scheduled for final disposal on October 13, 2025. The SEBI order remains stayed until the hearing date. This represents another postponement, as the matter was previously adjourned from April 24, 2025 to August 5, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754395148824,
            "Source": "stock"
        },
        {
            "Title": "Bhageria Industries Reports Q1 FY26 Results and Approves Subsidiary Closure",
            "Summary": "Bhageria Industries Limited announced its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs. 15,800.38 lakhs compared to Rs. 11,252.50 lakhs in the same quarter last year. Profit for the period stood at Rs. 1,199.04 lakhs versus Rs. 608.84 lakhs in the previous year quarter. Basic earnings per share increased to Rs. 2.75 from Rs. 1.40. On a consolidated basis, revenue from operations was Rs. 15,748.37 lakhs and profit for the period was Rs. 1,088.26 lakhs. The Board also approved the closure of its foreign wholly-owned subsidiary, Bhageria Industries Holding Company W.L.L., which has nil revenue and a net worth of 567 BHD as of March 31, 2025. The closure is expected to be completed by December 31, 2025, aimed at streamlining the company's international structure and reducing compliance burden as the branch office is operationally sufficient.",
            "Sentiment": "positive",
            "PublishDate": 1754117589644,
            "Source": "earnings"
        },
        {
            "Title": "Bhageria Industries to Acquire Office Space for ₹138 Million",
            "Summary": "Bhageria Industries has announced plans to acquire office space for expansion purposes. The company intends to spend ₹138 million on this acquisition, which is aimed at supporting its growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1749208870000,
            "Source": "default"
        },
        {
            "Title": "Bhageria Industries Reports Q4 Financial Results",
            "Summary": "Bhageria Industries has announced its quarterly financial results. The company's net profit for Q4 increased to 165 million rupees, compared to 71.8 million rupees in the same quarter last year. Revenue for Q4 slightly increased to 1.84 billion rupees from 1.83 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747613517000,
            "Source": "default"
        },
        {
            "Title": "Bhageria Industries Reports Q4 Results and Recommends Dividend",
            "Summary": "Bhageria Industries has announced its Q4 financial results and recommended a final dividend. The company's Q4 EBITDA increased to 305 million rupees from 151 million rupees year-over-year, with the EBITDA margin improving to 16.61% from 8.24%. Net profit for Q4 rose to 165 million rupees from 71.8 million rupees in the previous year. Revenue slightly increased to 1.84 billion rupees from 1.83 billion rupees. The company has recommended a final dividend of Rs. 1.50 per share.",
            "Sentiment": "positive",
            "PublishDate": 1747481038000,
            "Source": "result"
        },
        {
            "Title": "Bhageria Industries to Consider Q4 Results on May 17",
            "Summary": "Bhageria Industries has announced that it will consider its fourth quarter (Q4) financial results on May 17. This is a routine corporate announcement regarding the company's upcoming earnings report.",
            "Sentiment": "neutral",
            "PublishDate": 1746863375000,
            "Source": "default"
        },
        {
            "Title": "Bhageria Industries Approves Rs. 140 Crore Fund Infusion for Solar Power Project",
            "Summary": "Bhageria Industries has approved a fund infusion of Rs. 140 crore into its Rahuri Cleantech unit. The funds will be used for solar photovoltaic power generating stations with a total capacity of 32 MW(AC) under the Mukhyamantri Saur Krushi Vahini Yojana 2.0 scheme.",
            "Sentiment": "positive",
            "PublishDate": 1738550393000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bhageria Industries Reports Strong Q3 Financial Results",
            "Summary": "Bhageria Industries has announced its Q3 financial results, showing significant year-over-year growth. The company's net profit increased to 129 million rupees, up from 83 million rupees in the same quarter last year. Revenue also saw substantial growth, reaching 1.7 billion rupees compared to 1.1 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1738542310000,
            "Source": "earnings"
        },
        {
            "Title": "Bhageria Industries Reports Strong Q3 Financial Results",
            "Summary": "Bhageria Industries has announced its financial results for the third quarter. The company's net profit increased to 129 million rupees, up from 83 million rupees in the same period last year. Revenue also saw significant growth, reaching 1.7 billion rupees compared to 1.1 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738518072000,
            "Source": "earnings"
        },
        {
            "Title": "Bhageria Industries Reports Strong Q2 Results and Solar Investment Plans",
            "Summary": "Bhageria Industries has announced its Q2 financial results, showing significant year-over-year and quarter-over-quarter growth. The company reported a net profit of 67 million rupees, up from 28 million rupees in the same quarter last year and 60.8 million rupees in the previous quarter. Revenue for Q2 increased to 1.29 billion rupees from 1.02 billion rupees year-over-year. Additionally, the company has revealed plans to invest in the solar business through power purchase agreements.",
            "Sentiment": "positive",
            "PublishDate": 1730160616000,
            "Source": "result"
        },
        {
            "Title": "Bhageria Industries Reports Improved Q2 EBITDA and Margin",
            "Summary": "Bhageria Industries has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 136 million rupees, up from 83.8 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 10.54% from 8.17% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730120879000,
            "Source": "result"
        },
        {
            "Title": "Bhageria Industries Reports Q2 Revenue Growth",
            "Summary": "Bhageria Industries has announced its Q2 revenue figures. The company reported revenue of 1.29 billion rupees, compared to 1.02 billion rupees in the same quarter last year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730120869000,
            "Source": "result"
        },
        {
            "Title": "Bhageria Industries Reports Q2 Net Profit Increase",
            "Summary": "Bhageria Industries has reported a net profit of 67 million rupees for the second quarter, showing significant growth compared to both the previous year (28 million rupees) and the previous quarter (60.8 million rupees).",
            "Sentiment": "positive",
            "PublishDate": 1730120859000,
            "Source": "result"
        },
        {
            "Title": "Bhageria Industries Secures 32 MW Solar Power Project",
            "Summary": "<p><span class=\"positive\">Bhageria Industries</span> has received a <span class=\"positive\">Letter of Award (LOA)</span> for <b>developing solar photovoltaic power generating stations</b> with a capacity of <span class=\"neutral\">32 MW(AC)</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728990590000,
            "Source": "corporate_action"
        }
    ]
}