{
    "Symbol": "BHANDARI",
    "ISIN": "INE474E01029",
    "News": [
        {
            "Title": "Bhandari Hosiery Rights Issue Committee Approves DLOF",
            "Summary": "Bhandari Hosiery Exports Rights Issue Committee approves Draft Letter of Offer for ₹49.30 crore rights issue and authorizes stock exchange submission for in-principle approval.",
            "Sentiment": "positive",
            "PublishDate": 1767353133769,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bhandari Hosiery Exports Reports Q2 FY26 Results with Net Profit of Rs 206.52 Lakhs",
            "Summary": "Bhandari Hosiery Exports Limited announced unaudited financial results for the quarter and half-year ended September 30, 2025, reporting a net profit of Rs 206.52 lakhs for Q2 and Rs 358.82 lakhs for H1 FY26. The textile company's board approved the quarterly results along with asset-liability statements and cash flow statements, with total revenue reaching Rs 6,837.02 lakhs for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1763118457214,
            "Source": "earnings"
        },
        {
            "Title": "Bhandari Hosiery Exports Reports 13.4% Rise in Net Profit for Quarter Ended June 2025",
            "Summary": "Bhandari Hosiery Exports Limited reported net profit of Rs 161.90 lacs for the quarter ended June 30, 2025, compared to Rs 142.71 lacs in the same quarter last year. Revenue from operations increased to Rs 6,290.67 lacs from Rs 5,805.86 lacs year-over-year. Total revenue reached Rs 6,296.95 lacs versus Rs 5,805.86 lacs in the corresponding quarter. The company's earnings per share stood at Rs 0.07. The Board of Directors approved these unaudited financial results during their meeting on August 14, 2025. The company operates primarily in the textiles segment and has no subsidiary or associate companies. Statutory auditors Raj Gupta & Co provided a limited review report on the quarterly results.",
            "Sentiment": "positive",
            "PublishDate": 1755169399133,
            "Source": "earnings"
        },
        {
            "Title": "Bhandari Hosiery Exports: Dividend Revised Upward to Rs.0.02 per Share",
            "Summary": "<p>Shareholders of <span class=\"neutral\">Bhandari Hosiery Exports</span> <span class=\"positive\">approved</span> a <b>revised final dividend</b> of <span class=\"positive\">Rs.0.02 per equity share</span> at the <b>Annual General Meeting</b> on September 30, 2024. This is an <span class=\"positive\">increase</span> from the Rs.0.01 per share initially recommended by the Board on May 28, 2024.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728536460000,
            "Source": "corporate_action"
        }
    ]
}