{
    "Symbol": "BHARATGEAR",
    "ISIN": "INE561C01019",
    "News": [
        {
            "Title": "Bharat Gears Q3FY26 Results: Profit Jumps to ₹256.84 Lakhs",
            "Summary": "Bharat Gears Limited reported a profit of ₹256.84 lakhs for Q3FY26, marking a significant turnaround from a loss of ₹1029.49 lakhs in Q3FY25, with revenue rising 33.29% to ₹18934.82 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770717131988,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharat Gears Board Meet on Feb 10 for Q3FY26 Results",
            "Summary": "Bharat Gears Limited has scheduled its board meeting for February 10, 2026, to consider Q3FY26 unaudited financial results. Trading window closes till February 12, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769513313405,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharat Gears Board Resolves Chairman Citizenship Issue",
            "Summary": "Bharat Gears Limited's board determines that Chairman and Managing Director Surinder Paul Kanwar will continue in his role as his citizenship status remains unchanged pending Central Government direction.",
            "Sentiment": "neutral",
            "PublishDate": 1769156274004,
            "Source": "stocks"
        },
        {
            "Title": "Bharat Gears Chairman Faces Citizenship Status Inquiry from Ministry of Corporate Affairs",
            "Summary": "Bharat Gears Limited's Chairman and Managing Director Surinder Paul Kanwar is responding to questions about his citizenship status raised in an anonymous letter and a subsequent inquiry from the Regional Director's office of the Ministry of Corporate Affairs. The Board has decided to obtain an independent legal opinion on the matter while Kanwar maintains he holds only a valid Indian passport and has provided required details to authorities.",
            "Sentiment": "negative",
            "PublishDate": 1763139854432,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bharat Gears Reports Strong Q2 Performance with 722% Profit Surge",
            "Summary": "Bharat Gears Limited posted a net profit of ₹722.21 lakhs for the quarter ended September 30, 2025, marking a significant increase from ₹56.64 lakhs in the previous quarter, with revenue from operations reaching ₹20,670.40 lakhs. The automotive gears manufacturer's Board approved these unaudited financial results at their November 14, 2025 meeting, showing improved operational performance across key metrics including earnings per share of ₹4.70.",
            "Sentiment": "positive",
            "PublishDate": 1763137908701,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Gears Limited Receives Anonymous Letter Questioning Chairman's Citizenship Status",
            "Summary": "Bharat Gears Limited disclosed that an anonymous, unsigned and undated letter was received on November 3, 2025 by certain Board members, raising issues regarding the citizenship status of Chairman and Managing Director Surender Paul Kanwar. The company is assessing the veracity of the letter's contents and obtaining independent legal opinion on its legality. The company has committed to provide updates on any material developments in the matter.",
            "Sentiment": "negative",
            "PublishDate": 1762479891607,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bharat Gears Limited Appoints Three New Independent Directors, Two Directors Complete Terms",
            "Summary": "Bharat Gears Limited appointed three new Non-Executive Independent Directors at their Annual General Meeting held on July 30, 2025. The new appointees are Mr. Satya Prakash Mangal, a practicing Chartered Accountant and founding partner of M/s Satya Prakash Mangal & Company; Mr. Bharat Dev Singh Kanwar, who has extensive experience in the automotive industry including roles at Dana India and Spicer India; and Mr. Nagar Venkatraman Srinivasan, a mechanical engineering graduate with 56 years of experience who previously worked with the company for 33 years. All three directors were appointed for a five-year term effective July 30, 2025. Simultaneously, Mr. Virendra Kumar Pargal and Mr. Rakesh Chopra ceased to be Non-Executive Independent Directors due to completion of two consecutive five-year terms. The Board acknowledged their valuable contributions and guidance during their tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1753880370429,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bharat Gears Reverses Decision, Includes Late Dr. Raunaq Singh in Promoter Group Category Following NSE Guidance",
            "Summary": "Bharat Gears Limited has reversed its earlier decision to remove Late Dr. Raunaq Singh from the Promoter Category and has now included him under the 'Promoter Group Category' following guidance from the National Stock Exchange. The company's Board initially approved removing Dr. Raunaq Singh's name from the Promoter Category in January 2025, citing his demise on September 30, 2002, and moved his 907 equity shares to the Public Category. However, NSE advised that the name cannot be shifted from Promoter Category to Public Category until the 907 equity shares are transmitted to the ultimate beneficial owner. The Board ratified this inclusion in its July 29, 2025 meeting and resolved that the shares will remain under the Promoter Group Category until transmitted to the ultimate beneficial owner. The company has sought clarification from NSE regarding the treatment of these shares when they are transferred to the IEPF Authority, as the last dividend was declared in 2019 and will remain unclaimed for seven consecutive years until 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1753781941753,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bharat Gears Reports Quarterly Loss of ₹180.79 Lakhs Despite Revenue Growth",
            "Summary": "Bharat Gears Limited reported a net loss of ₹180.79 lakhs for the quarter ended June 30, 2025, compared to a profit of ₹171.33 lakhs in the same quarter last year. Revenue from operations increased to ₹17,979.79 lakhs from ₹16,600.7 lakhs year-over-year. The company's total expenses rose to ₹16,872.46 lakhs. Employee benefits expense was ₹3,002.74 lakhs while finance costs stood at ₹586.26 lakhs. The company recorded a loss before tax of ₹242.80 lakhs. Basic and diluted earnings per share was negative ₹1.18. The Board of Directors approved these unaudited financial results on July 29, 2025. The company is primarily engaged in the automotive gears business.",
            "Sentiment": "negative",
            "PublishDate": 1753780673639,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Gears Temporarily Closes Mumbra Plant",
            "Summary": "Bharat Gears Limited has announced that manufacturing operations at its Mumbra plant will be temporarily suspended. The company has not provided specific details about the duration of the closure or the reasons behind this decision.",
            "Sentiment": "negative",
            "PublishDate": 1730119298000,
            "Source": "corporate_action"
        }
    ]
}