{
    "Symbol": "BHARATSE",
    "ISIN": "INE415D01024",
    "News": [
        {
            "Title": "Bharat Seats seeks approval for Rs 2400 crore RPT",
            "Summary": "Bharat Seats Limited has issued a postal ballot notice seeking shareholder approval for material related party transactions worth up to Rs 2400 crores with Maruti Suzuki India Limited for FY 2025-26 and subsequent years.",
            "Sentiment": "neutral",
            "PublishDate": 1770723255412,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharat Seats Q3 Net Profit Jumps 30% to ₹99M",
            "Summary": "Bharat Seats reported a strong 30% year-on-year growth in Q3 net profit, rising to ₹99 million from ₹76 million in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770103745644,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharat Seats Reports Quarterly Results and Appoints New Senior Management Personnel",
            "Summary": "Bharat Seats Limited approved its unaudited financial results for the quarter and six months ended September 30, 2025. The company reported total income of Rs. 46,129.81 lakhs for the quarter and Rs. 88,942.60 lakhs for the six-month period. Net profit for the quarter was Rs. 1,990.17 lakhs and Rs. 1,907.77 lakhs for the six months. The company appointed Mr. Bhaskar Kumar, AVP-Purchase SCM, as Senior Management Personnel effective November 5, 2025. Kumar brings over 31 years of experience from various organizations including Osna Electronics, Autometers Alliance, Siemens VDO Automotive, Minda Corporation, Talbros Automotive Components, and Sandhar Technologies Limited. The auditor's review report contained no qualifications or adverse remarks.",
            "Sentiment": "positive",
            "PublishDate": 1762382934404,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Seats Reports 39% Jump in Q2 Net Profit to 99M Rupees",
            "Summary": "Bharat Seats posted a net profit of 99 million rupees in Q2, up from 71 million rupees in the same period last year, marking a 39% increase. Revenue surged 58% to 4.59 billion rupees compared to 2.9 billion rupees year-over-year. EBITDA rose to 226.4 million rupees from 176.5 million rupees previously. However, EBITDA margin compressed to 4.94% from 6.07% in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1762330915705,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Seats Limited Reports Strong Quarterly Results, Appoints New Senior Management Personnel and Creates CSR Trust",
            "Summary": "Bharat Seats Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing revenue from operations of Rs. 42,706.14 lakhs compared to Rs. 29,885.02 lakhs in the same quarter last year. The company reported a profit of Rs. 917.59 lakhs for the quarter versus Rs. 661.47 lakhs in the previous year's corresponding quarter. Basic and diluted earnings per share stood at Rs. 1.46. The Board appointed Mr. Suman Yadav, Sr. Vice President Operations, as Senior Management Personnel effective July 29, 2025. Yadav brings over 28 years of experience across various organizations including Jay Bharat Maruti, Goetze India, and Hindware Ltd. The company also approved the creation of a CSR Trust jointly with associate group company NDR Auto Components Limited for undertaking CSR activities. The auditor's review report contained no qualifications or adverse remarks, though it highlighted an ongoing Income Tax Department search matter from an earlier year with demand orders totaling Rs. 2,243.72 lakhs excluding penalties, against which the company has filed appeals.",
            "Sentiment": "positive",
            "PublishDate": 1753776455808,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Seats Reports Strong Q1 Revenue Growth Despite Margin Decline",
            "Summary": "Bharat Seats reported quarterly results showing revenue of 4.3 billion rupees compared to 3 billion rupees in the same period last year. Net profit increased to 92 million rupees from 66 million rupees year-over-year. EBITDA rose to 217 million rupees from 165 million rupees, though EBITDA margin declined to 5.1% from 5.53% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753775913769,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Seats Ltd: Q4 Profit Surges 42.5%, Revenue Up 41.4%",
            "Summary": "Bharat Seats reported Q4 profit of ₹11.4 crore, up 42.5% YoY. Revenue increased 41.4% to ₹393 crore. EBITDA rose 34% to ₹23 crore. Company recommends dividend of ₹1.10 per share. Maruti Suzuki and Suzuki Motor Corp each hold 14.81% stake.",
            "Sentiment": "positive",
            "PublishDate": 1746606220000,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Seats Reports Q4 Financial Results",
            "Summary": "Bharat Seats has announced its Q4 financial results. The company's EBITDA increased to 227 million rupees from 171 million rupees year-over-year. However, the EBITDA margin decreased to 5.78% from 6.16%. Revenue grew to 3.93 billion rupees from 2.78 billion rupees. Net profit rose to 114 million rupees from 81 million rupees compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1746604372000,
            "Source": "result"
        },
        {
            "Title": "Bharat Seats: Bonus Share Announcement and Q2 Results",
            "Summary": "Bharat Seats Ltd., promoted by Maruti Suzuki, announced a 1:1 bonus share issue, its first in 17 years. The company also reported flat Q2 net profit at ₹7 crore, with revenue up 1.7% YoY to ₹291 crore. EBITDA grew 4.7% YoY to ₹17.8 crore. The stock is up 2.9% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1730792538000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bharat Seats Reports Q2 EBITDA and Margin Growth",
            "Summary": "Bharat Seats has announced its Q2 financial results. The company's EBITDA increased to 176.6 million rupees from 169.5 million rupees year-over-year. The EBITDA margin also improved, rising to 6.08% from 5.93% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730791956000,
            "Source": "result"
        },
        {
            "Title": "Bharat Seats: Board to Consider Bonus Share Issue",
            "Summary": "Bharat Seats announced its board will consider issuing bonus shares in a meeting scheduled for November 5, 2024. The board will also approve Q2 results ended September 2024 in the same meeting. The company previously issued bonus shares in a 1:1 ratio in 2007.",
            "Sentiment": "positive",
            "PublishDate": 1730190745000,
            "Source": "corporate_action"
        }
    ]
}