{
    "Symbol": "BHARTIHEXA",
    "ISIN": "INE343G01021",
    "News": [
        {
            "Title": "Bharti Hexacom Q3 FY26 Results Show Strong Growth",
            "Summary": "Bharti Hexacom reported Q3 FY26 revenues of Rs 23,598 Mn (up 4.8% YoY) with EBITDA at Rs 12,820 Mn and improved margins at 54.3%. Mobile ARPU increased to Rs 253 while data traffic grew 29.8% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1770288730722,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharti Hexacom Q3FY26 Earnings Call Set for Feb 6",
            "Summary": "Bharti Hexacom Limited has scheduled its Q3FY26 earnings call for February 6, 2026, to discuss audited financial results for the third quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769521025580,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharti Hexacom shares decline 2.01% on Friday",
            "Summary": "Bharti Hexacom shares fell 2.01% to ₹1,591.90 in Friday's trading session, making it among the top losers on the Nifty Midcap 150 index amid broader market weakness.",
            "Sentiment": "negative",
            "PublishDate": 1769158526650,
            "Source": "stocks"
        },
        {
            "Title": "Bharti Hexacom Updates KMP List with New CFO Details",
            "Summary": "Bharti Hexacom formally updates Key Managerial Personnel list following Karthikeyan Velu's appointment as CFO effective January 1, 2026, providing contact details to stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1766062051288,
            "Source": "stocks"
        },
        {
            "Title": "Bharti Airtel Reports Strong Q2 Performance with Rs. 52,000 Crores Revenue, Expands 5G Network",
            "Summary": "Bharti Airtel delivered consolidated revenues of Rs. 52,000 crores for the quarter ended September 30, 2025, with an annualized run rate exceeding Rs. 200,000 crores. India revenues excluding Indus reached Rs. 34,900 crores with EBITDA margin of 51.5%. The company added 1.4 million revenue-earning customers and 5.1 million smartphone data users, with ARPU at Rs. 256. The mobile segment now has 167 million 5G users, with 5G sites handling over 40% of total network traffic. Broadband business added 951,000 net customers, while FWA customer base crossed 2.3 million. Airtel Business reported revenues of Rs. 5,275 crores, growing 4.3% sequentially. The company announced a partnership with Google to establish data centers in Vishakhapatnam, aiming to expand capacity four-fold to over 1 gigawatt. Operating free cash flow was Rs. 10,750 crores with capex at Rs. 7,200 crores. India net debt to EBITDA stands at 1.32. The Supreme Court's recent AGR order allows comprehensive assessment and reconciliation of dues, which Airtel plans to pursue with the government.",
            "Sentiment": "positive",
            "PublishDate": 1762860575926,
            "Source": "earnings"
        },
        {
            "Title": "Bharti Hexacom Reports Strong Q2 Results with 66% Jump in Net Profit",
            "Summary": "Bharti Hexacom delivered robust quarterly performance with net profit rising to 4.21 billion rupees from 2.53 billion rupees year-over-year. Revenue grew to 23.17 billion rupees compared to 20.98 billion rupees in the same period last year. EBITDA increased to 12 billion rupees from 10 billion rupees, while EBITDA margin expanded to 52.13% from 47.76% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1762167674945,
            "Source": "earnings"
        },
        {
            "Title": "Bharti Hexacom Unlocks ₹17,500 Crore Worth of Shares as Lock-in Period Ends",
            "Summary": "Bharti Hexacom, a unit of Bharti Airtel, saw its shareholder lock-in period end on Monday, October 13. This unlocks 10 crore shares, representing 20% of the company's outstanding equity, worth ₹17,510 crore based on Friday's closing price. The shares are now eligible for trading, though this doesn't guarantee they will be sold in the open market. Bharti Hexacom debuted in April 2024 at ₹570 per share and has gained 207% from its IPO price. Promoters hold a 70% stake in the company based on June quarter shareholding patterns.",
            "Sentiment": "neutral",
            "PublishDate": 1760318377696,
            "Source": "stock"
        },
        {
            "Title": "Bharti Hexacom Reports Strong Q1 FY2026 Performance with 47.7% EBITDA Margin",
            "Summary": "Bharti Hexacom delivered steady quarterly results with revenue of 2,263 Crores and EBITDAaL of 1,079 Crores, achieving a margin of 47.7% that improved by 110 basis points sequentially. The company added 17,000 mobile customers and 54,000 homes customers, with smartphone customer additions of 283,000. ARPU reached 246, benefiting from continued mix improvement and one extra day in the quarter. The home business showed strong momentum with sustained net additions. Operating free cash generation was robust at 854 Crores. The balance sheet remains strong with net debt at 2,806 Crores and net debt to EBITDAaL ratio of 0.7 times. While ARPU, customers, and EBITDA margins improved, reported revenue declined due to reduced roaming revenue. The company continues leveraging Airtel's partnerships, including the recent Perplexity AI offering and anti-spam solutions that have identified 2.5 billion spam calls since launch.",
            "Sentiment": "positive",
            "PublishDate": 1754920739967,
            "Source": "earnings"
        },
        {
            "Title": "Bharti Hexacom Reports Strong Q1 Results with 18.4% Revenue Growth and Improved Margins",
            "Summary": "Bharti Hexacom announced quarterly results for the period ended June 30, 2025, showing total revenues of Rs 2,263 crore, up 18.4% year-over-year from Rs 1,911 crore. EBITDA increased to Rs 1,217 crore with margins expanding to 53.8% from 47.7% in the previous year. Mobile services revenues grew 17.8% driven by tariff improvements and strong smartphone data customer additions. The company added 1.6 million smartphone data customers year-over-year, with mobile ARPU increasing to Rs 246 from Rs 205. Homes and Office business achieved 38% revenue growth with 54,000 net customer additions. Net income before exceptional items reached Rs 392 crore compared to Rs 193 crore in the corresponding quarter last year. The company's customer base stands at 28.65 million with mobile data traffic growing 23.8% to 1,824 PBs. Net debt to EBITDA ratio improved to 1.30 times from 2.07 times year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754393798806,
            "Source": "earnings"
        },
        {
            "Title": "Bharti Hexacom: Q4 Net Profit Soars 2-Fold to Rs 468 Crore",
            "Summary": "Bharti Hexacom reported a 110% YoY increase in Q4 FY25 PAT to Rs 468.4 crore. Revenue rose 22.5% to Rs 2,289 crore, driven by tariff hikes and premium offerings. Mobile ARPU improved to Rs 242 from Rs 204 a year ago. For FY25, PAT nearly tripled to Rs 1,493.6 crore, with annual revenue up 20.5% to Rs 8,548 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747190937000,
            "Source": "earnings"
        },
        {
            "Title": "Bharti Hexacom Reports Strong Q4 FY23 Results",
            "Summary": "Bharti Hexacom announced its Q4 FY23 results, showing significant year-over-year growth. Net profit increased to 4.7 billion rupees from 2.22 billion rupees in the previous year. Revenue rose to 22.89 billion rupees from 18.68 billion rupees. The company's mobile ARPU (Average Revenue Per User) improved to 242 rupees. Additionally, Bharti Hexacom has recommended a final dividend of 10 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747181911000,
            "Source": "default"
        },
        {
            "Title": "Bharti Hexacom: Q4 Profit Doubles, Declares ₹10 Dividend",
            "Summary": "Bharti Hexacom's Q4FY25 net profit jumped 110.4% YoY to ₹468.4 crore. Revenue increased 22.5% to ₹2,289 crore. EBITDA rose 33% to ₹1,167.8 crore. Customer base grew 3.4% to 28.58 million. Board recommended a final dividend of ₹10 per share.",
            "Sentiment": "positive",
            "PublishDate": 1747139688000,
            "Source": "earnings"
        },
        {
            "Title": "Bharti Hexacom Reports Increased Q4 Mobile ARPU",
            "Summary": "Bharti Hexacom, a telecommunications company, has reported an increase in its fourth quarter mobile Average Revenue Per User (ARPU) to 242 rupees. This indicates a positive trend in the company's revenue generation from its mobile services.",
            "Sentiment": "positive",
            "PublishDate": 1747138831000,
            "Source": "default"
        },
        {
            "Title": "Bharti Hexacom Announces Final Dividend",
            "Summary": "Bharti Hexacom has recommended a final dividend of 10 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1747136921000,
            "Source": "result"
        },
        {
            "Title": "Bharti Hexacom Reports Strong Q4 Financial Results",
            "Summary": "Bharti Hexacom has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 11.7 billion rupees from 8.8 billion rupees in the previous year, with the EBITDA margin rising to 51.02% from 46.99%. Net profit saw a substantial increase to 4.7 billion rupees, up from 2.22 billion rupees year-over-year and 2.6 billion rupees quarter-over-quarter. Revenue also grew to 22.89 billion rupees from 18.68 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747136778000,
            "Source": "result"
        },
        {
            "Title": "Bharti Hexacom: Share Price Hits 52-Week High on Spectrum Acquisition Deal",
            "Summary": "Bharti Hexacom's share price reached a 52-week high after announcing an agreement to acquire 400 MHz spectrum in the 26 GHz band from Adani Data Networks Limited across six states. The stock opened at ₹1665.95 and reached an intraday high of ₹1695.45 on the BSE, representing a gain of over 2%.",
            "Sentiment": "positive",
            "PublishDate": 1745391492000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bharti Hexacom Halts Sale of Infrastructure Business to Indus Towers",
            "Summary": "Bharti Hexacom has put on hold the sale of its infrastructure business to Indus Towers. This decision comes after Telecommunications Consultants India Ltd (TCIL) requested Bharti Hexacom to initiate a fresh process for the sale. In response, Bharti Hexacom has agreed to undertake a new exercise in consultation with TCIL.",
            "Sentiment": "neutral",
            "PublishDate": 1744330008000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bharti Hexacom Halts Infrastructure Sale to Indus Towers",
            "Summary": "Bharti Hexacom has announced that it has put the sale of its infrastructure business to Indus Towers on hold. This decision comes after Telecommunications Consultants India Ltd (TCIL) requested Bharti Hexacom to initiate a fresh process for the sale. In response, Bharti Hexacom has stated that it will undertake a new exercise in consultation with TCIL to proceed with the sale.",
            "Sentiment": "neutral",
            "PublishDate": 1744213916000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bharti Hexacom: High Court Dismisses Rs 55 Crore Tax Demand",
            "Summary": "Rajasthan High Court ruled in favor of Bharti Hexacom, dismissing a Rs 54.6 crore tax demand. The court upheld CESTAT's earlier decision allowing the company to avail CENVAT credit on excise duty for tower parts and shelters.",
            "Sentiment": "positive",
            "PublishDate": 1743848984000,
            "Source": "order&deals"
        },
        {
            "Title": "Bharti Hexacom: Motilal Oswal Initiates Buy Rating with 21% Upside",
            "Summary": "Motilal Oswal initiates coverage on Bharti Hexacom with a buy rating and a target price of ₹1,625, implying a 21% upside. The stock has gained 136% since its April 2024 listing. Analysts cite the company's strong growth prospects in under-penetrated markets, potential for faster ARPU growth, and expected leadership in revenue market share by FY25 end.",
            "Sentiment": "positive",
            "PublishDate": 1741505173000,
            "Source": "normal_news"
        },
        {
            "Title": "Bharti Hexacom: Q3 Profit and Revenue Surge Over 20% YoY",
            "Summary": "Bharti Hexacom reported a 23% YoY increase in Q3 net profit to Rs 261 crore, with revenue up 25% YoY to Rs 2,251 crore. Mobile services revenue grew 25.5% YoY. EBITDA reached Rs 1,194 crore with a 53% margin. Net customer additions were 44,000, driven by FTTH and FWA growth.",
            "Sentiment": "positive",
            "PublishDate": 1738901036000,
            "Source": "earnings"
        },
        {
            "Title": "Bharti Hexacom: Q3 Profit Surges 23% YoY, Revenue Up 25%",
            "Summary": "Bharti Hexacom reported Q3FY25 net profit of Rs 261 crore, up 23% YoY. Revenue rose 25% to Rs 2,251 crore. EBITDA margin improved to 53%, up 516 bps YoY. Mobile ARPU increased to Rs 241. The company added 1.9 million smartphone data customers YoY.",
            "Sentiment": "positive",
            "PublishDate": 1738843599000,
            "Source": "earnings"
        },
        {
            "Title": "Bharti Hexacom to Consider Q3 Results on February 5",
            "Summary": "Bharti Hexacom has announced that it will consider its financial results for the third quarter on February 5. This indicates that the company is preparing to release its earnings report for the latest fiscal period.",
            "Sentiment": "neutral",
            "PublishDate": 1737558137000,
            "Source": "earnings"
        },
        {
            "Title": "Bharti Hexacom Ltd Block Trade on NSE",
            "Summary": "A block trade of approximately 141,696 shares of Bharti Hexacom Ltd was executed on the National Stock Exchange (NSE) at a price of Rs. 1,481.90 per share. The total value of the transaction amounted to Rs. 21.00 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1736150283000,
            "Source": "block_deals"
        },
        {
            "Title": "FTSE Rebalancing: Bharti Hexacom Expected to See $36 Million Inflow",
            "Summary": "Bharti Hexacom is set to experience significant inflows of approximately $36 million (Rs 3.06 billion) due to the FTSE index rebalancing scheduled for today at 3 PM.",
            "Sentiment": "positive",
            "PublishDate": 1734671219000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bharti Hexacom Reports Strong Q2 EBITDA Growth",
            "Summary": "Bharti Hexacom has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 10 billion rupees, up from 8.25 billion rupees in the same quarter last year. The EBITDA margin also improved slightly to 47.76% from 47.51% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730115550000,
            "Source": "result"
        },
        {
            "Title": "Bharti Hexacom Reports Profit in Q2 FY2024",
            "Summary": "Bharti Hexacom, a telecommunications company, has reported a net profit of 2.5 billion rupees in Q2 FY2024, compared to a loss of 1.84 billion rupees in the same quarter last year. The company's revenue increased to 20.98 billion rupees from 17.4 billion rupees year-over-year. Compared to the previous quarter, the net profit improved from 5.1 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1730115344000,
            "Source": "result"
        }
    ]
}