{
    "Symbol": "BHARTIARTL",
    "ISIN": "INE397D01024",
    "News": [
        {
            "Title": "Airtel Launches AI-Powered OTP Fraud Protection",
            "Summary": "Bharti Airtel unveils innovative AI-powered Fraud Alert system to protect customers from OTP-related banking frauds through real-time detection and intervention during risky calls.",
            "Sentiment": "positive",
            "PublishDate": 1770789217451,
            "Source": "stocks"
        },
        {
            "Title": "Bharti Airtel Seeks DoT Clarity on AGR Dues Case",
            "Summary": "Bharti Airtel management confirms sending multiple letters to Department of Telecommunications seeking clarity on AGR dues case during recent conference call, awaiting official response from regulatory authorities.",
            "Sentiment": "neutral",
            "PublishDate": 1770370448080,
            "Source": "stocks"
        },
        {
            "Title": "Bharti Airtel Targets 1 GW Data Centre Capacity",
            "Summary": "Bharti Airtel announces stepped-up data centre investment under Nxtra subsidiary, targeting 1 GW capacity expansion over next 3-4 years during management concall.",
            "Sentiment": "positive",
            "PublishDate": 1770369865643,
            "Source": "stocks"
        },
        {
            "Title": "Bharti Airtel Block Trade Worth Rs. 203.74 Crores",
            "Summary": "Bharti Airtel witnessed a significant block trade on NSE involving 1,020,648 shares valued at Rs. 203.74 crores, executed at Rs. 1996.20 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1770354260745,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharti Airtel Q3 Net Profit Drops to ₹66.3B",
            "Summary": "Bharti Airtel reported Q3 consolidated net profit of ₹66.30 billion, declining from ₹68.00 billion in the previous quarter and missing analyst estimates of ₹72.00 billion.",
            "Sentiment": "negative",
            "PublishDate": 1770289686018,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharti Airtel Block Trade Worth Rs. 52.75 Crores",
            "Summary": "Bharti Airtel witnessed a significant NSE block trade involving 262,918 shares valued at Rs. 52.75 crores, executed at Rs. 2006.40 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1770267227527,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharti Airtel Sees Rs 15.10 Cr Block Trade on NSE",
            "Summary": "Bharti Airtel witnessed a significant block trade worth Rs 15.10 crores on NSE involving 75,142 shares at Rs 2009.00 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1770266986780,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharti Airtel Faces Rs 6.99 Lakh DoT Penalty",
            "Summary": "Bharti Airtel receives penalty notice from Department of Telecommunications for alleged subscriber verification norm violations during September 2025 audit. Company opts to pay penalty without contest.",
            "Sentiment": "negative",
            "PublishDate": 1770205048844,
            "Source": "stocks"
        },
        {
            "Title": "Bharti Airtel Receives Rs 1.11 Lakh DoT Penalty",
            "Summary": "Bharti Airtel received a penalty notice of Rs 1,11,000 from DoT for alleged subscriber verification norms violation. The company has decided to pay the penalty without contesting it.",
            "Sentiment": "negative",
            "PublishDate": 1769846133608,
            "Source": "stocks"
        },
        {
            "Title": "Airtel Partners Adobe for Free Premium Access",
            "Summary": "Bharti Airtel announces global-first partnership with Adobe to provide free Adobe Express Premium access worth ₹4,000 to its 360 million customers across India for one year.",
            "Sentiment": "positive",
            "PublishDate": 1769661023167,
            "Source": "stocks"
        },
        {
            "Title": "Bharti Airtel Block Trade Worth Rs. 70.21 Crores",
            "Summary": "Bharti Airtel witnessed a significant block trade on NSE involving 359,355 shares valued at Rs. 70.21 crores, executed at Rs. 1953.70 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1769587751904,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharti Airtel shares drop 0.76% despite strong growth",
            "Summary": "Bharti Airtel shares declined 0.76% to Rs 1,969.60 amid high trading volume. The telecom giant reported strong financial performance with revenue growing to Rs 172,985.20 crore in 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769506757970,
            "Source": "stocks"
        },
        {
            "Title": "Bharti Airtel Block Trade Worth Rs. 42.39 Crores",
            "Summary": "Bharti Airtel witnessed a significant block trade on NSE involving 215,466 shares at Rs. 1967.20 per share, totaling Rs. 42.39 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1769505651738,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharti Airtel Receives Rs 1.11 Lakh DoT Penalty",
            "Summary": "Bharti Airtel received a penalty notice of Rs 1,11,000 from Department of Telecommunications for alleged violation of subscriber verification norms during October 2025 CAF audit.",
            "Sentiment": "negative",
            "PublishDate": 1769189293459,
            "Source": "stocks"
        },
        {
            "Title": "Mittal calls for tariff hikes to reach ₹300 ARPU",
            "Summary": "Bharti Enterprises Chairman Sunil Mittal warns ₹200 pricing unsustainable, advocates 15-17% tariff increase to reach ₹300 ARPU target. Emphasizes need for robust telecom infrastructure funding.",
            "Sentiment": "neutral",
            "PublishDate": 1769084615252,
            "Source": "stocks"
        },
        {
            "Title": "Bharti Airtel Opens 100th Retail Store in Gujarat",
            "Summary": "Bharti Airtel inaugurated its 100th retail store in Gujarat at Tragad, Ahmedabad, expanding its presence across 34 districts in the state with comprehensive digital services.",
            "Sentiment": "positive",
            "PublishDate": 1769063918550,
            "Source": "stocks"
        },
        {
            "Title": "Bharti Airtel Expands Network with 5,250+ Sites in WB",
            "Summary": "Bharti Airtel strengthens mobile connectivity across West Bengal by installing over 5,250 new network sites, including enhanced coverage on Vidyasagar Setu bridge for seamless voice and data services.",
            "Sentiment": "positive",
            "PublishDate": 1768981722478,
            "Source": "stocks"
        },
        {
            "Title": "Morgan Stanley Maintains Overweight on Bharti Airtel",
            "Summary": "Morgan Stanley continues its 'Overweight' rating on Bharti Airtel with a target price of ₹2,435.00, indicating positive analyst sentiment for the telecommunications major.",
            "Sentiment": "positive",
            "PublishDate": 1768967461798,
            "Source": "stocks"
        },
        {
            "Title": "Bharti Airtel Penalized ₹2.06 Lakh by DoT",
            "Summary": "Bharti Airtel receives penalty notice of ₹2.06 lakh from Department of Telecommunications for alleged subscriber verification norm violations during November 2025 audit. Company opts to pay penalty without contesting.",
            "Sentiment": "negative",
            "PublishDate": 1768890767376,
            "Source": "stocks"
        },
        {
            "Title": "Bharti Airtel Block Trade Worth ₹101.40 Crores",
            "Summary": "Bharti Airtel witnessed a significant NSE block trade of ₹101.40 crores involving 506,204 shares at ₹2,003.20 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768884702636,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharti Airtel NSE Block Trade Worth ₹40.36 Crores",
            "Summary": "Bharti Airtel executed a significant block trade on NSE involving 200,027 shares at ₹2,017.60 per share, totaling ₹40.36 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1768806182448,
            "Source": "co_actions_results"
        },
        {
            "Title": "Airtel Expands 5G Network with 2,400+ Sites in MP & CG",
            "Summary": "Bharti Airtel deployed over 2,400 new 5G sites across Madhya Pradesh and Chhattisgarh in the last 12 months, enhancing coverage for 36 million customers across 87 districts with faster speeds and improved connectivity.",
            "Sentiment": "positive",
            "PublishDate": 1768801960070,
            "Source": "stocks"
        },
        {
            "Title": "Bharti Airtel Block Trade Worth ₹27.17 Crores",
            "Summary": "Bharti Airtel witnessed a significant NSE block trade involving 134,445 shares at ₹2,020.70 per share, totaling ₹27.17 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1768535803854,
            "Source": "co_actions_results"
        },
        {
            "Title": "Airtel, Tata Seek Collective AGR Relief After Vodafone Deal",
            "Summary": "Bharti Airtel and two Tata Group units are considering collective representation to government seeking equitable treatment on AGR liabilities following 10-year debt holiday granted to Vodafone Idea.",
            "Sentiment": "neutral",
            "PublishDate": 1768531715381,
            "Source": "stocks"
        },
        {
            "Title": "Bharti Airtel Block Trade Worth ₹405.82 Crores",
            "Summary": "Bharti Airtel witnessed a significant block trade on NSE involving 19.93 lakh shares valued at ₹405.82 crores at ₹2,035.80 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768277008197,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharti Airtel Penalized ₹1.20 Lakh by DoT",
            "Summary": "Bharti Airtel receives penalty notice from Department of Telecommunications for alleged subscriber verification norms violation during September 2025 CAF audit. Company opts to pay penalty without contesting.",
            "Sentiment": "negative",
            "PublishDate": 1768229318920,
            "Source": "stocks"
        },
        {
            "Title": "Jefferies Hikes Bharti Airtel Target on Jio IPO Catalyst",
            "Summary": "Jefferies raises Bharti Airtel target to ₹2,760 citing Jio's 2026 IPO as re-rating catalyst. Expects 15% tariff hikes and higher sector allocation to benefit Bharti alongside improved fundamentals.",
            "Sentiment": "positive",
            "PublishDate": 1767838245115,
            "Source": "stocks"
        },
        {
            "Title": "Bharti Airtel Sees ₹15.98 Cr NSE Block Trade",
            "Summary": "Bharti Airtel witnessed another NSE block trade worth ₹15.98 crores involving 76,602 shares at ₹2,086.70 per share, showing continued institutional activity in the telecom stock.",
            "Sentiment": "neutral",
            "PublishDate": 1767759899456,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharti Airtel Block Trade Worth ₹1,001.92 Crores",
            "Summary": "Bharti Airtel witnessed a significant NSE block trade worth ₹1,001.92 crores involving 4,763,547 shares at ₹2,103.30 per share, indicating substantial institutional activity in the telecom major.",
            "Sentiment": "neutral",
            "PublishDate": 1767681343192,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharti Airtel Adds 1.22M Mobile Subscribers",
            "Summary": "Bharti Airtel reported a net addition of 1.22 million mobile subscribers in November, demonstrating continued growth in its wireless customer base across India.",
            "Sentiment": "positive",
            "PublishDate": 1767597521584,
            "Source": "stocks"
        },
        {
            "Title": "Bharti Airtel Receives ₹1.25 Lakh DoT Penalty Notice",
            "Summary": "Bharti Airtel disclosed receiving a penalty notice of ₹1.25 lakh from DoT for alleged violation of subscriber verification norms during July 2025 CAF audit. Company opts to pay penalty without contest.",
            "Sentiment": "negative",
            "PublishDate": 1767335587011,
            "Source": "stocks"
        },
        {
            "Title": "Bharti Airtel Receives DoT Penalty Notices Worth ₹3.62L",
            "Summary": "Bharti Airtel disclosed receiving two penalty notices from DoT totaling ₹3.62 lakh for alleged subscriber verification norm violations in Bihar and Madhya Pradesh circles during September-October 2025.",
            "Sentiment": "negative",
            "PublishDate": 1767163111480,
            "Source": "stocks"
        },
        {
            "Title": "Bharti Airtel Penalized ₹6.99 Lakh by DoT",
            "Summary": "Bharti Airtel receives penalty notice from Department of Telecommunications for alleged violation of subscriber verification norms during August 2025 CAF audit in Andhra Pradesh LSA.",
            "Sentiment": "negative",
            "PublishDate": 1767079587298,
            "Source": "stocks"
        },
        {
            "Title": "Bharti Airtel Launches Cartoon Network Classics Channel",
            "Summary": "Bharti Airtel officially launches 'Airtel Cartoon Network Classics' channel in partnership with Warner Bros. Discovery, offering ad-free classic cartoons at ₹59 monthly on Channel 445.",
            "Sentiment": "positive",
            "PublishDate": 1766991898320,
            "Source": "stocks"
        },
        {
            "Title": "Bharti Airtel Receives ₹1.16 Lakh Penalty Notice",
            "Summary": "DoT Kerala LSA imposes penalty on Bharti Airtel for alleged subscriber verification norm violations during October 2025 CAF audit. Company disagrees with order and plans appropriate action.",
            "Sentiment": "negative",
            "PublishDate": 1766574868990,
            "Source": "stocks"
        },
        {
            "Title": "Avendus cuts Bharti Airtel to Reduce, target ₹1,700",
            "Summary": "Avendus Securities downgrades Bharti Airtel to Reduce rating with a target price of ₹1,700, indicating potential downside from current levels for the telecom major.",
            "Sentiment": "negative",
            "PublishDate": 1766375067254,
            "Source": "stocks"
        },
        {
            "Title": "Bharti Airtel-Singtel Revise Shareholders' Agreement",
            "Summary": "Bharti Airtel and Singtel amended their shareholders' agreement on December 18, 2025, with Singtel relinquishing several key reserved rights to align with contemporary governance standards.",
            "Sentiment": "neutral",
            "PublishDate": 1766067541448,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharti Airtel Announces Call Payment on Partly Paid Shares",
            "Summary": "Bharti Airtel's board approves first and final call of ₹401.25 per share on 392.29 million partly paid-up equity shares with record date set for February 6, 2026. Proceeds will be used for debt repayment and general corporate purposes.",
            "Sentiment": "positive",
            "PublishDate": 1766063532821,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharti Airtel Issues Postal Ballot Notice for Leadership",
            "Summary": "Bharti Airtel sends postal ballot notice to shareholders seeking approval for appointment of Shashwat Sharma as MD & CEO and Gopal Vittal as Executive Vice Chairman, with remote e-voting from January 3 to February 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766062115479,
            "Source": "stocks"
        },
        {
            "Title": "Bharti Airtel Records ₹46.95 Cr NSE Block Trade",
            "Summary": "Bharti Airtel witnessed another significant block trade on NSE worth ₹46.95 crores involving 224,644 shares at ₹2,089.80 per share, showing continued institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1766040588137,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharti Airtel Receives ₹2.09 Lakh DoT Penalty",
            "Summary": "Bharti Airtel received a penalty notice of ₹2.09 lakh from DoT Karnataka for alleged subscriber verification norm violations during October 2025 CAF audit. Company opts to pay penalty without contest.",
            "Sentiment": "negative",
            "PublishDate": 1765897236483,
            "Source": "stocks"
        },
        {
            "Title": "Morgan Stanley Upgrades Bharti Airtel to Overweight",
            "Summary": "Morgan Stanley has upgraded Bharti Airtel to 'Overweight' rating with a price target of ₹2,435.00, signaling positive outlook for the telecom major.",
            "Sentiment": "positive",
            "PublishDate": 1765856771232,
            "Source": "stocks"
        },
        {
            "Title": "Bharti Airtel Faces ₹1.82 Cr Stamp Duty Penalty",
            "Summary": "Bharti Airtel receives demand notice from Maharashtra stamp authorities for alleged short levy of stamp duty on 2014 power agreement, with penalty of ₹1.82 crores imposed.",
            "Sentiment": "negative",
            "PublishDate": 1765386328850,
            "Source": "stocks"
        },
        {
            "Title": "Bharti Airtel Receives Rs 6.99 Lakh Penalty for Subscriber Verification Violations",
            "Summary": "The Department of Telecommunications imposed a penalty of Rs 6,99,000 on Bharti Airtel for alleged violations of subscriber verification norms during a Customer Application Form Audit conducted for July 2025. The company has decided not to contest the penalty and will pay the amount, with the financial impact limited to the penalty levied.",
            "Sentiment": "negative",
            "PublishDate": 1765212145014,
            "Source": "stock"
        },
        {
            "Title": "Bharti Airtel Receives Rs 1.24 Lakh Penalty for Subscriber Verification Violations",
            "Summary": "The Department of Telecommunications imposed a penalty of Rs 1,24,000 on Bharti Airtel for alleged violations of subscriber verification norms during a Customer Application Form Audit conducted for July 2025. The company has decided not to contest the penalty and will pay the amount, with the financial impact limited to the penalty levied.",
            "Sentiment": "negative",
            "PublishDate": 1764915784611,
            "Source": "stock"
        },
        {
            "Title": "Bharti Airtel Receives Rs 1.25 Lakh Penalty from DoT for Subscriber Verification Violations",
            "Summary": "The Department of Telecommunications imposed a penalty of Rs 1,25,000 on Bharti Airtel for alleged violations of subscriber verification norms during a sample Customer Application Form Audit conducted for June 2025. The company has decided not to contest the penalty and will pay the amount, with the financial impact limited to the penalty levied.",
            "Sentiment": "negative",
            "PublishDate": 1764756439678,
            "Source": "stock"
        },
        {
            "Title": "Bharti Airtel Establishes New Subsidiary 'Nxtra Vizag Ltd' for Data Centre Expansion",
            "Summary": "Bharti Airtel has launched a new step-down unit called 'Nxtra Vizag Ltd' as part of its data centre business expansion strategy. The new subsidiary is designed to support the company's growing data centre operations and infrastructure development.",
            "Sentiment": "positive",
            "PublishDate": 1764403371665,
            "Source": "corporate_action"
        },
        {
            "Title": "Bharti Airtel Promoter Group Entity Sells 0.56% Stake Through Market Transaction",
            "Summary": "Indian Continent Investment Limited, a promoter group entity of Bharti Airtel, sold 34.30 million shares representing 0.56% shareholding through market transactions on November 26, 2025. The sale reduced the entity's total holding in Bharti Airtel from 1.48% to 0.92%, with no change in the company's total share capital as it was a market transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1764312199410,
            "Source": "corporate_action"
        },
        {
            "Title": "Bharti Airtel Receives Rs 1.07 Lakh Penalty for Subscriber Verification Violations",
            "Summary": "The Department of Telecommunications imposed a penalty of Rs 1,07,000 on Bharti Airtel for alleged violations of subscriber verification norms during a Customer Application Form Audit conducted for September 2025. The company has decided not to contest the penalty and will proceed with payment, with the financial impact limited to the penalty amount.",
            "Sentiment": "negative",
            "PublishDate": 1764260252343,
            "Source": "stock"
        },
        {
            "Title": "Indian Continent Investment Limited Sells 0.56% Stake in Bharti Airtel for Rs. 7,200 Crore",
            "Summary": "Indian Continent Investment Limited, a promoter group member of Bharti Airtel, sold 34.30 million shares (0.56% shareholding) through market transaction for Rs. 7,200 crore. The transaction received strong interest from marquee domestic and international long-only investors, with placements majorly allocated to long-only investors including both new and existing Airtel shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1764161886152,
            "Source": "order&deals"
        }
    ]
}