{
    "Symbol": "BHARATFORG",
    "ISIN": "INE465A01025",
    "News": [
        {
            "Title": "Bharat Forge Q3FY26 Results: Profit Dips 16.7% YoY",
            "Summary": "Bharat Forge reported Q3FY26 standalone net profit of ₹2,880.41 million, down 16.7% YoY. Revenue declined 0.6% to ₹20,836.60 million. Board declared ₹2 interim dividend per share.",
            "Sentiment": "negative",
            "PublishDate": 1770906304730,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharat Forge clarifies AMCA fighter jet participation",
            "Summary": "Bharat Forge addresses material price movement on February 4, 2026, clarifying its participation in AMCA fighter jet programme following media reports about defence contractor selection.",
            "Sentiment": "neutral",
            "PublishDate": 1770210721057,
            "Source": "stocks"
        },
        {
            "Title": "Bharat Forge Signs ₹300 Crore JS Auto Deal",
            "Summary": "Bharat Forge announces agreement with PI Opportunities Fund for 23% stake acquisition in JS Auto worth ₹300 crores, with completion expected by March 31, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770021436676,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharat Forge Invests Rs 1,100.45 Million in Subsidiary",
            "Summary": "Bharat Forge Limited announces Rs 1,100.45 million capital infusion into wholly owned German subsidiary Bharat Forge Global Holding GmbH, maintaining 100% shareholding control.",
            "Sentiment": "positive",
            "PublishDate": 1769745774795,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharat Forge Wins ₹300 Cr Defence Contracts",
            "Summary": "Bharat Forge secures ₹300 crore defence contracts under Emergency Procurement-VI framework for indigenous unmanned systems. Stock gains 18.34% in six months, trading 0.73% higher.",
            "Sentiment": "positive",
            "PublishDate": 1768549340410,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharat Forge Secures ₹300 Cr Defense Contracts",
            "Summary": "Bharat Forge wins ₹300 crore contracts for indigenous unmanned systems under emergency procurement, strengthening its defense sector presence and contributing to India's self-reliance initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1768549249975,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharat Forge Defence Revenue Surges to ₹1,772 Cr",
            "Summary": "Bharat Forge's defence segment revenue jumped from ₹410 cr in FY23 to ₹1,772 cr in FY25, backed by ₹11,000 cr order book including major carbine contract from Ministry of Defence.",
            "Sentiment": "positive",
            "PublishDate": 1768107533596,
            "Source": "stocks"
        },
        {
            "Title": "Bharat Forge partners with Germany's Agile Robots",
            "Summary": "Bharat Forge signed MoU with Germany-based Agile Robots to explore AI-driven robotics and automation solutions across automotive, healthcare, and industrial sectors.",
            "Sentiment": "positive",
            "PublishDate": 1767942506213,
            "Source": "stocks"
        },
        {
            "Title": "Bharat Forge Partners with Agile Robots for AI",
            "Summary": "Bharat Forge announces partnership agreement with Agile Robots for AI automation solutions, marking expansion into advanced manufacturing technologies.",
            "Sentiment": "positive",
            "PublishDate": 1767875522779,
            "Source": "stocks"
        },
        {
            "Title": "Bharat Forge Partners with Agile Robots for AI Automation",
            "Summary": "Bharat Forge signs MoU with Germany-based Agile Robots to co-develop AI-driven robotic solutions for automotive, healthcare, and consumer electronics industries in India and Southeast Asia.",
            "Sentiment": "positive",
            "PublishDate": 1767875187343,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharat Forge Records ₹58.80 Cr NSE Block Trade",
            "Summary": "Bharat Forge witnessed another significant block trade on NSE worth ₹58.80 crores involving 401,505 shares at ₹1,464.50 per share, indicating continued institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767855208830,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharat Forge Completes Tranche I Solar Investment",
            "Summary": "Bharat Forge's subsidiary JS Auto Cast Foundry completes acquisition of 31.57% stake in Sunsafe Solarpark Twenty-Three Private Limited for ₹25.77 crores as part of renewable energy expansion.",
            "Sentiment": "positive",
            "PublishDate": 1767703301022,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharat Forge: Class 8 Orders Jump 108% in December",
            "Summary": "North American Class 8 net orders reached 42,200 units in December, marking the highest level since October 2022 with significant month-over-month and year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1767672479778,
            "Source": "stocks"
        },
        {
            "Title": "Defence Emerges as Key Theme Amid Global Tensions",
            "Summary": "Market expert Gurmeet Chadha highlights defence as the decade's defining theme as India signs ₹4,666 crore defence contracts including carbines from Bharat Forge and heavy torpedoes.",
            "Sentiment": "positive",
            "PublishDate": 1767580058010,
            "Source": "stocks"
        },
        {
            "Title": "Bharat Forge Secures ₹1,662cr Defence Contract",
            "Summary": "Bharat Forge wins largest small arms contract worth ₹1,661.9 crore for CQB carbines, pushing defence order book to ₹11,000 crore. Management expects qualitatively better 2026 driven by defence portfolio maturation.",
            "Sentiment": "positive",
            "PublishDate": 1767339567253,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharat Forge Eyes Defense Growth Opportunities",
            "Summary": "Bharat Forge provides strong guidance for its defense vertical with significant export opportunities identified in the defense segment.",
            "Sentiment": "positive",
            "PublishDate": 1767164079493,
            "Source": "stocks"
        },
        {
            "Title": "Bharat Forge shares in focus after ₹1,662 cr defence deal",
            "Summary": "Bharat Forge secured its largest small arms contract worth ₹1,661.90 crores for supplying 255,128 CQB carbines to Indian Army. Shares closed 0.70% higher at ₹1,454.90.",
            "Sentiment": "positive",
            "PublishDate": 1767084149752,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharat Forge Denies Russia Meeting Claims",
            "Summary": "Bharat Forge clarifies no company representative has visited Russia since 2021, denying involvement in any recent meetings amid ongoing scrutiny of corporate activities.",
            "Sentiment": "neutral",
            "PublishDate": 1765375924527,
            "Source": "stocks"
        },
        {
            "Title": "Bharat Forge Denies Russian Meeting Involvement, Says No Representatives Visited Since 2021",
            "Summary": "Bharat Forge has denied any involvement in rare meetings in Russia and stated that no company representative has visited the country since 2021. The clarification addresses speculation about the company's potential connections or business activities in Russia.",
            "Sentiment": "negative",
            "PublishDate": 1765339306124,
            "Source": "stock"
        },
        {
            "Title": "Bharat Forge Reports Q2 FY26 Results with 7.5% Revenue Decline Amid North American Market Challenges",
            "Summary": "Bharat Forge's standalone revenues dropped 7.5% sequentially to INR 1,947 crores in Q2 FY26, primarily due to rapid degrowth in North American CV market and inventory destocking, with CV exports to North America down 48% quarter-on-quarter and 67% year-on-year. The company maintained EBITDA margins at 28% despite challenges, secured new business worth INR 1,582 crores across segments, and announced plans to raise up to INR 2,000 crores for organic and inorganic growth in India while expecting similar performance in Q3 with potential recovery in Q4.",
            "Sentiment": "neutral",
            "PublishDate": 1763129970203,
            "Source": "earnings"
        },
        {
            "Title": "ICICI Securities Raises Bharat Forge Target Price Following Strong Defence Performance",
            "Summary": "Bharat Forge reported standalone net sales of Rs 19.5 billion, declining 13% year-over-year and 7.5% quarter-over-quarter, falling 5% below brokerage estimates. Total tonnage reached approximately 56.5kt, down 12% year-over-year and 9% quarter-over-quarter. The company's standalone EBITDA margin improved to 28.3%, gaining 50 basis points year-over-year and 110 basis points quarter-over-quarter, exceeding brokerage estimates by 200 basis points. The margin improvement was driven by favorable product mix from value-added business and effective cost management. ICICI Securities increased the target price based on strong defence segment growth and improved business outlook.",
            "Sentiment": "positive",
            "PublishDate": 1762935783256,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Forge Projects Strong Aerospace Growth and Mixed Analyst Ratings",
            "Summary": "Bharat Forge expects aerospace revenue to grow from ₹250 crore last year to over ₹350 crore this year, with similar growth rates anticipated for the next 3-4 years. JS Auto anticipates improved sales and EBITDA in H2, with the defense sector expected to gain momentum as execution enhances. The company expects similar performance for Q2 and Q3 FY26, with potential improvement in Q4. Defense business ATAGS work is set to begin in 6-9 months and increase gradually. Analyst ratings are mixed, with target prices ranging from ₹1050 (Jefferies U-P) to ₹1553 (Nomura Neutral), while INCRED maintains a Hold rating at ₹1209 and CLSA gives an U-P rating at ₹1180.",
            "Sentiment": "positive",
            "PublishDate": 1762918018695,
            "Source": "stock"
        },
        {
            "Title": "Bharat Forge Reports 23% Profit Growth But Faces Brokerage Caution Over Execution Delays",
            "Summary": "Bharat Forge reported strong quarterly results with profit rising 23% to Rs 299.20 crore compared to Rs 243.59 crore in the previous quarter. The company secured new orders worth Rs 1,582 crore in the first half, including Rs 559 crore in defence, bringing its defence order book to Rs 9,467 crore. Indian manufacturing operations generated revenues of Rs 2,746 crore and Ebitda of Rs 676 crore. Despite the strong performance, brokerages remain cautious while raising price targets. Jefferies maintained an 'underperform' rating but increased target price to Rs 1,050 from Rs 950, citing delayed defence order execution with a large guns order now taking three years instead of two. CLSA kept an 'underperform' rating while raising target to Rs 1,180 from Rs 1,010, noting export revenue decline but improved subsidiary execution. JPMorgan maintained neutral stance with Rs 255 target, highlighting North American and European export headwinds offset by margin expansion across overseas and India subsidiaries.",
            "Sentiment": "neutral",
            "PublishDate": 1762912900272,
            "Source": "earnings"
        },
        {
            "Title": "Kalyani Strategic Systems Secures ₹2,500+ Million Defense Contracts for Underwater Systems",
            "Summary": "Kalyani Strategic Systems, associated with Bharat Forge, has received contracts worth over ₹2,500 million from the Indian Ministry of Defence for underwater systems. The contracts have a delivery deadline of November 2026.",
            "Sentiment": "positive",
            "PublishDate": 1762857864175,
            "Source": "order&deals"
        },
        {
            "Title": "Bharat Forge Reports Full Utilization of Rs 1,650 Crore QIP Proceeds",
            "Summary": "Bharat Forge Limited has fully utilized the Rs 1,650 crore raised through its Qualified Institutional Placement (QIP) issued in December 2024. ICRA Limited, serving as the monitoring agency, reported no material deviation from the stated objectives for the quarter ended September 30, 2025. The proceeds were deployed across three main areas: Rs 1,029.604 crore for repayment of outstanding borrowings by certain subsidiaries, Rs 550.039 crore for the acquisition of equity shares in AAM India Manufacturing Corporation Private Limited including associated costs, and Rs 42.225 crore for general corporate purposes. The actual net proceeds of Rs 1,621.868 crore were slightly higher than the estimated Rs 1,619.144 crore due to lower actual offer-related expenditure. All objects have been completed with no delays reported in implementation.",
            "Sentiment": "positive",
            "PublishDate": 1762857819437,
            "Source": "corporate_action"
        },
        {
            "Title": "Bharat Forge Expects Growth in India Business and Defence to Offset US Export Decline",
            "Summary": "Bharat Forge reports decreasing exports to North America due to challenging demand conditions expected in H2 FY26. The company anticipates growth in India's industrial business, non-US exports, and defence sector to compensate for the decline in US exports.",
            "Sentiment": "neutral",
            "PublishDate": 1762846357043,
            "Source": "stock"
        },
        {
            "Title": "Bharat Forge Reports Q2 Revenue Decline to Rs 19.5B, Board Approves Rs 20B Fundraising",
            "Summary": "Bharat Forge reported Q2 revenue of Rs 19.5 billion, down from Rs 22.5 billion year-over-year, missing estimates of Rs 22.46 billion. EBITDA came in at Rs 5.5 billion versus Rs 6.25 billion in the previous year, though it exceeded estimates of Rs 5.23 billion. EBITDA margin improved to 28.30% from 27.84% year-over-year, surpassing the estimated 25%. Net profit declined to Rs 3.1 billion from Rs 3.6 billion year-over-year, slightly above estimates of Rs 3.04 billion. The company's board approved raising funds up to Rs 20 billion.",
            "Sentiment": "negative",
            "PublishDate": 1762845224708,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Forge Explores Fundraising Through Loans and Debentures",
            "Summary": "Bharat Forge plans to explore fundraising options through loans and debentures.",
            "Sentiment": "neutral",
            "PublishDate": 1762345585410,
            "Source": "stock"
        },
        {
            "Title": "Bharat Forge Schedules Analyst Conference Call to Discuss Q2 and H1 FY26 Financial Results",
            "Summary": "Bharat Forge Limited has organized an analyst and investor conference call scheduled for November 11, 2025, from 3:30 PM to 4:30 PM IST to discuss the company's financial results for the quarter and half-year ended September 30, 2025. The conference call will feature senior management including Vice Chairman Joint Managing Director Amit Kalyani, Executive Director Subodh Tandale, Sr. VP CFO Kedar Dixit, and VP-Finance Virendra Kale. The company has provided multiple access numbers for participants from India, USA, UK, Hong Kong, and Singapore, with participants requested to dial-in at least 15 minutes in advance.",
            "Sentiment": "neutral",
            "PublishDate": 1762294883628,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Forge Secures Contract to Supply 60% of Indian Army's 4.25 Lakh Carbines Order",
            "Summary": "Bharat Forge has been awarded a contract to supply 60% of 4.25 lakh carbines for the Indian Army as part of a major indigenous weapons procurement deal. This represents approximately 2.55 lakh carbines that the company will manufacture and deliver to the Indian Army.",
            "Sentiment": "positive",
            "PublishDate": 1761151731871,
            "Source": "order&deals"
        },
        {
            "Title": "Bharat Forge Expands Aerospace Partnership with Rolls-Royce for Pearl 10X Engine Fan Blades",
            "Summary": "Bharat Forge has expanded its strategic partnership with Rolls-Royce to produce fan blades for Pearl 10X engines. The contract was finalized at Rolls-Royce's Dahlewitz facility. This represents a significant expansion of Bharat Forge's participation in aerospace component manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1760605726790,
            "Source": "order&deals"
        },
        {
            "Title": "Bharat Forge Receives Rs 1.54 Crore IGST Demand Order from Customs Authority",
            "Summary": "Bharat Forge Limited has received a duty demand order from the Office of the Commissioner of Customs (Imports) for Rs 1,53,78,375 in IGST demand along with equivalent penalty and applicable interest, plus an additional fine of Rs 1,00,00,000 under the Customs Act, 1962. The order relates to alleged short payment of IGST on reimported goods. The company received the order dated September 30, 2025 on October 13, 2025, and is exploring options to challenge it. Bharat Forge states that this order will not have a material impact on its financial, operational, or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1760359123236,
            "Source": "stock"
        },
        {
            "Title": "Bharat Forge Faces Confirmed Assessment Order from Pune Cantonment Board",
            "Summary": "The Pune District Court has confirmed an assessment order issued by the Pune Cantonment Board against Bharat Forge. The company is considering legal options moving forward in response to this court decision.",
            "Sentiment": "negative",
            "PublishDate": 1759843630913,
            "Source": "stock"
        },
        {
            "Title": "Bharat Forge Partners With BEML And Data Patterns For AMCA Project",
            "Summary": "Bharat Forge has entered into a partnership with BEML and Data Patterns to support the AMCA project. The collaboration involves three companies working together on this aerospace initiative.",
            "Sentiment": "positive",
            "PublishDate": 1758891585632,
            "Source": "order&deals"
        },
        {
            "Title": "US Imposes 25% Tariffs on Heavy Truck Imports",
            "Summary": "The United States has imposed 25% tariffs on heavy truck imports. This development relates to Bharat Forge, though the specific impact on the company is not detailed in the available information.",
            "Sentiment": "negative",
            "PublishDate": 1758858305760,
            "Source": "stock"
        },
        {
            "Title": "Bharat Forge Sees Rs. 31.64 Crore Block Trade on NSE",
            "Summary": "Bharat Forge Ltd. witnessed a block trade worth Rs. 31.64 crores on the NSE. The transaction involved approximately 250,719 shares at a price of Rs. 1,262.10 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1758608875196,
            "Source": "order&deals"
        },
        {
            "Title": "Bharat Forge Partners with Windracers for UAV Operations in India",
            "Summary": "Bharat Forge and Windracers signed a strategic memorandum of understanding to advance UAV operations in India, announced at DSEI UK 2025. The partnership leverages the UK-India Free Trade Agreement to promote aerospace technology transfer and innovation between both countries, supporting the India-UK Vision 2035 objectives.",
            "Sentiment": "positive",
            "PublishDate": 1757895110319,
            "Source": "stock"
        },
        {
            "Title": "Bharat Forge Subsidiary Signs Artillery Spare Parts Supply Contract with UAE",
            "Summary": "Kalyani Strategic Systems Limited, a wholly owned subsidiary of Bharat Forge Limited, signed an agreement with MP3 International, a GRADEONE subsidiary, for supplying artillery system critical spare parts to the UAE. Under the contract, Kalyani Strategic Systems will supply large calibre 155mm barrels for howitzers to the UAE. The agreement was signed by Khalifa Al Ali, CEO of MP3 International, and Neelesh Tungar, CEO of Kalyani Strategic Systems Limited. This marks the first contract of its kind for a critical defence component between an Emirati and Indian company. The contract aims to strengthen defence cooperation between UAE and India while serving markets in Southeast Asia and MENA regions.",
            "Sentiment": "positive",
            "PublishDate": 1757597681997,
            "Source": "order&deals"
        },
        {
            "Title": "Bharat Forge Partners with UK's Windracers for UAV Operations in India",
            "Summary": "Bharat Forge Limited signed a Memorandum of Understanding with UK-based Windracers Limited to collaborate on deployment, localisation and application of Windracers ULTRA Unmanned Aerial Vehicle across India. The partnership was announced at DSEI UK 2025 in London with an initial two-year term. The collaboration aims to address requirements across Indian military and civil sectors, including Carrier On Board Delivery operations for the Indian Navy and critical logistics for Indian Army and Air Force. Windracers ULTRA can carry up to 150kg over distances up to 1,000km and is designed for endurance missions of six to seven hours. The partnership builds on the UK-India Free Trade Agreement and aligns with India-UK Vision 2035 goals for aerospace technology transfer and innovation.",
            "Sentiment": "positive",
            "PublishDate": 1757593652814,
            "Source": "stock"
        },
        {
            "Title": "Bharat Forge Reports 14% Decline in Class 8 Truck Orders in August",
            "Summary": "Bharat Forge experienced a 14% year-over-year decline in Class 8 truck orders during August. The company expects a 15% decrease for the 2025 cycle, signaling weak demand conditions in the commercial vehicle segment.",
            "Sentiment": "negative",
            "PublishDate": 1757045140413,
            "Source": "stock"
        },
        {
            "Title": "Bharat Forge Subsidiary Acquires 950 Acres in Andhra Pradesh for Defence Manufacturing Complex",
            "Summary": "Bharat Forge's step-down subsidiary Agneyastra Energetics Limited signed an agreement with Andhra Pradesh Industrial Infrastructure Corporation Ltd to purchase 949.65 acres of land in Madakasira, Anantapur district. The land will be used to develop a defence energetics manufacturing complex featuring a high explosives manufacturing plant, ammunition filling plant, and gun propellant facility, with provisions for future expansion into energetics for rockets, missile systems, space launch vehicles, and advanced energetics. Agneyastra Energetics was incorporated through Kalyani Strategic Systems Limited, a wholly-owned subsidiary of Bharat Forge. In its quarterly results, Bharat Forge's standalone revenue declined 10% year-on-year to ₹2,105 crore due to lower exports. EBITDA fell 12.4% to ₹571 crore with margins narrowing to 27.1% from 27.9% in the previous year. Shares closed at ₹1,129.80, down 0.51%.",
            "Sentiment": "neutral",
            "PublishDate": 1756989960711,
            "Source": "stock"
        },
        {
            "Title": "Bharat Forge's Step-Down Subsidiary Acquires 949.65-Acre Land in Andhra Pradesh for Defence Manufacturing Complex",
            "Summary": "Agneyastra Energetics Limited, a step-down subsidiary of Bharat Forge Limited, has entered into an agreement with Andhra Pradesh Industrial Infrastructure Corporation Ltd. to purchase approximately 949.65 acres of land in Madakasira, Anantapur District. The land will be used to develop an End-to-End Defence Energetics Manufacturing Complex, which will include a High Explosives Manufacturing plant, ammunition filling plant, gun propellant facility, and provisions for future expansion into energetics for rockets, missile systems, space launch vehicles, and advanced energetics. Agneyastra was incorporated through Kalyani Strategic Systems Limited, a wholly owned subsidiary of Bharat Forge Limited. The acquisition aligns with the company's growth objectives and expansion plans in the defence sector.",
            "Sentiment": "positive",
            "PublishDate": 1756987121414,
            "Source": "stock"
        },
        {
            "Title": "Morgan Stanley Warns of 30% EBITDA Hit for Bharat Forge Due to US Tariff Escalation",
            "Summary": "The Trump administration implemented an additional 25% tariff on Indian exports to the US, bringing total tariffs to 50%. Morgan Stanley analyzed the impact on Indian auto sector companies, noting that the US represents 38% of Bharat Forge's standalone revenue and 10% of Balkrishna Industries' topline. Both companies previously faced 10% tariffs during the June quarter and managed partial cost pass-through to customers. The tariff escalation now subjects 30% of Bharat Forge's standalone revenue and 10% of Balkrishna Industries' revenue to the 50% tariff rate. Morgan Stanley estimates this could result in an EBITDA impact of nearly 30% for Bharat Forge and around 10% for Balkrishna Industries. Bharat Forge shares closed 0.23% higher at ₹1,124.50, while Balkrishna Industries ended 0.16% lower at ₹2,320.40.",
            "Sentiment": "negative",
            "PublishDate": 1756438909395,
            "Source": "stock"
        },
        {
            "Title": "Bharat Forge Sees Block Trade Worth Rs. 57.44 Crores on NSE",
            "Summary": "Bharat Forge executed a block trade on the National Stock Exchange involving approximately 502,651 shares at a price of Rs. 1,142.80 per share. The total transaction value amounted to Rs. 57.44 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1755840310247,
            "Source": "order&deals"
        },
        {
            "Title": "Bharat Forge Sees Block Trade Worth Rs. 71.19 Crores on NSE",
            "Summary": "Bharat Forge executed a block trade on the National Stock Exchange involving approximately 611,064 shares at Rs. 1,165.00 per share, totaling Rs. 71.19 crores. The transaction represents a significant institutional trade in the company's shares.",
            "Sentiment": "neutral",
            "PublishDate": 1755752660747,
            "Source": "order&deals"
        },
        {
            "Title": "Bharat Forge Q1 FY26 Revenue Drops 2.7% to Rs 2,105 Crores Amid Tariff Uncertainties",
            "Summary": "Bharat Forge reported standalone revenue of Rs 2,105 crores for Q1 FY26, down 2.7% from the previous period. Standalone EBITDA fell 6.5% to Rs 588 crores due to low utilization and different product mix. The company absorbed Rs 14 crores in tariff-related expenses during the quarter. Consolidated revenue increased 1.5% to Rs 3,909 crores with EBITDA of Rs 682 crores (17.4% margin). The company secured new business worth Rs 850 crores across its segments. Management cited tariff uncertainties, pause in emission norms, and seasonality in aerospace business as factors affecting performance. US aluminum operations showed improvement with second consecutive quarter of positive EBITDA at 6.1% margins. The company expects Q2 to be weaker driven by US exports, with second half anticipated to be better than first half. American Axle acquisition is expected to add Rs 1,000 crores to consolidated revenue for the year, consolidating from Q2 FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1754918872826,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Forge Reports 63% Jump in Quarterly Profit Despite Revenue Decline",
            "Summary": "Auto components maker Bharat Forge reported a 63% increase in consolidated net profit to Rs 284 crore for the June quarter, compared to Rs 174 crore in the same period last year. However, total income declined to Rs 3,958 crore from Rs 4,158 crore in the year-ago period. The company's shares were trading 1.48% lower at Rs 1,144.20 on BSE following the results announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1754492462214,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Forge Transfers Defence Business to Subsidiary for ₹4,533 Million",
            "Summary": "Bharat Forge Limited has entered into a Business Transfer Agreement with its wholly-owned subsidiary, Kalyani Strategic Systems Limited, to transfer its Defence Business assets and obligations for Rs. 4,533 million. The transfer was approved by the company's Investment Committee (Defence Business) as part of an internal restructuring initiative. The companies have also entered into an Intellectual Property Rights Licensing Agreement. This follows an earlier intimation dated June 30, 2025 regarding the transition of Defence Business to KSSL.",
            "Sentiment": "neutral",
            "PublishDate": 1754485615057,
            "Source": "corporate_action"
        },
        {
            "Title": "Bharat Forge Signs Business Transfer Agreement with KSSL Worth 4.5 Billion Rupees",
            "Summary": "Bharat Forge has entered into an agreement to transfer its business operations to KSSL for a transaction value of 4.5 billion rupees. The deal represents a significant business restructuring move for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1754484773793,
            "Source": "order&deals"
        },
        {
            "Title": "Bharat Forge Stock Falls as Management Warns of Challenging Year Ahead",
            "Summary": "Bharat Forge shares declined 1.8% to ₹1,139.9 following management's warning that the current financial year would be a challenging period. The company reported quarterly results with standalone revenue falling 10% to ₹2,105 crore, missing the ₹2,173 crore estimate. EBITDA dropped 12.4% to ₹571 crore, below the ₹616 crore projection, while EBITDA margin compressed to 27.1% from 27.9% previously. Management expressed caution about US export business due to tariff announcements and regulatory changes to emission norms in North America. The company expects new defense orders and plans concrete steps for European Steel Manufacturing footprint review by year-end. US and Europe operations showed meaningful improvement and generated cash profit. The stock has declined 11% over the past month.",
            "Sentiment": "negative",
            "PublishDate": 1754468231057,
            "Source": "earnings"
        }
    ]
}