{
    "Symbol": "BHARATWIRE",
    "ISIN": "INE316L01019",
    "News": [
        {
            "Title": "Bharat Wire Ropes Q3FY26 Net Profit Rises 22.61%",
            "Summary": "Bharat Wire Ropes reported Q3FY26 net profit of ₹1,824.86 lakhs, up 22.61% YoY. Revenue declined 11.72% to ₹14,281.80 lakhs. Nine-month profit grew 8.11% to ₹5,599.19 lakhs with stable revenue.",
            "Sentiment": "positive",
            "PublishDate": 1770038506073,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharat Wire Ropes Board Meet on Feb 2 for Q3FY26 Results",
            "Summary": "Bharat Wire Ropes Limited announces 137th Board Meeting scheduled for February 02, 2026 to consider Q3FY26 unaudited financial results. Trading window closed from January 01, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769177602484,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharat Wire Ropes Reports 8.1% Revenue Growth in Q2 FY26 with Strong Margin Expansion",
            "Summary": "Bharat Wire Ropes Limited posted revenue of INR 1,646 million in Q2 FY26, up 8.1% year-on-year, with EBITDA margins improving to 23.33% from 22.08% in the previous year. The steel wire rope manufacturer strengthened its market position through domestic market focus and competitive pricing, with US sales rising to 13% from 8% despite initial tariff concerns.",
            "Sentiment": "positive",
            "PublishDate": 1763098428762,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Wire Reports Strong Q2 Performance with 17% Net Profit Growth",
            "Summary": "Bharat Wire delivered solid quarterly results with net profit rising to 221 million rupees from 189 million rupees year-over-year. Revenue increased to 1.65 billion rupees compared to 1.5 billion rupees in the same period last year. EBITDA grew to 384 million rupees from 337 million rupees, while EBITDA margin improved to 23.35% from 22.14% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762957191981,
            "Source": "earnings"
        },
        {
            "Title": "Alpana Dangi Discloses Share Disposal in Bharat Wire Ropes Limited",
            "Summary": "Alpana Dangi has made a disclosure under SEBI regulations regarding disposal of shares in Bharat Wire Ropes Limited. The disposal was conducted through open market transactions on November 3, 2025. The company's equity share capital consists of 6,85,84,648 equity shares with a face value of Rs. 10 each, totaling Rs. 68,58,46,480. The total diluted share capital after the disposal stands at 6,96,05,870 equity shares valued at Rs. 69,60,58,700. The disposed shares are ordinary equity shares with face value of Rs. 10 each and do not carry any special rights. The disclosure was made to BSE Limited and National Stock Exchange of India Limited where the company's shares are listed.",
            "Sentiment": "neutral",
            "PublishDate": 1762283825565,
            "Source": "corporate_action"
        },
        {
            "Title": "Authum Investment Infrastructure Acquires Additional Stake in Target Company Through Open Market Purchase",
            "Summary": "Authum Investment Infrastructure Limited disclosed a substantial acquisition of shares under SEBI takeover regulations. The company acquired equity shares through open market transactions on November 3, 2025. Following the acquisition, Authum's total holding increased to 1,26,98,136 equity shares, representing 18.51% of the total share capital and 18.24% of the diluted voting capital. The acquired shares are ordinary equity shares with a face value of Rs. 10 each. The target company has an equity share capital of 6,85,84,648 shares valued at Rs. 68,58,46,480, with total diluted share capital of 6,96,05,870 shares worth Rs. 69,60,58,700.",
            "Sentiment": "neutral",
            "PublishDate": 1762274651766,
            "Source": "corporate_action"
        },
        {
            "Title": "Bharat Wire Ropes Shares Surge 20% on CCPS Transaction with Lloyds Metals",
            "Summary": "Bharat Wire Ropes Ltd. shares hit a 20% upper circuit, reaching ₹206.74, marking the first such gain since February 2020. The surge followed the company's announcement of assigning a call option of Compulsorily Convertible Preference Shares (CCPS) to Lloyds Metals and Energy Ltd. Lloyds Metals purchased 9,895 unlisted CCPS from Union Bank of India and 4,674 unlisted CCPS from Central Bank of India through off-market transactions. These CCPS were originally allotted to a consortium of banks in 2020-2021 for loan conversion worth ₹382.66 crore under a resolution plan. The company stated that this acquisition does not change its total paid-up capital at this stage. Trading volume reached nearly 90 lakh shares, significantly above the 20-day average of 46,231 shares. The steel wire products manufacturer has a market capitalization exceeding ₹1,400 crore.",
            "Sentiment": "positive",
            "PublishDate": 1761541754586,
            "Source": "stock"
        },
        {
            "Title": "Bharat Wire Ropes: Lloyds Metals Acquires CCPS from Banks",
            "Summary": "Bharat Wire Ropes Limited announced that Lloyds Metals and Energy Limited has purchased 14,569 unlisted Compulsorily Convertible Preference Shares (CCPS) from two banks - 9,895 shares from Union Bank of India and 4,674 shares from Central Bank of India through off-market transactions. The promoters had assigned call options of these CCPS to Lloyds Metals. The company noted that 38,266 unlisted CCPS were originally allotted to a consortium of banks in FY 2020-21 for conversion of loans worth Rs 382.66 crores under a resolution plan. The acquisition does not change the company's total paid-up capital at this stage.",
            "Sentiment": "neutral",
            "PublishDate": 1761309249879,
            "Source": "corporate_action"
        },
        {
            "Title": "Bharat Wire Ropes Reports Revenue Growth Despite Margin Pressure from Global Uncertainties",
            "Summary": "Bharat Wire Ropes Limited, one of India's largest steel wire rope manufacturers, submitted its investor presentation showing mixed financial performance. The company reported revenue of ₹6,193 crores in FY25 compared to ₹6,218 crores in FY24, while Q1 FY26 revenue reached ₹1,417 crores with 6.1% year-over-year growth. However, EBITDA margins declined to 21.36% in FY25 from 26.39% in FY24, and PAT margins dropped to 11.69% from 15.49%. The margin pressure stems from global geopolitical tensions and potential trade restrictions affecting pricing and volume. The company operates with 72,000 MTPA manufacturing capacity across two plants, exports to over 55 countries, and employs over 1,000 people. BWR reduced total debt from ₹1,817 crores in FY23 to ₹1,311 crores in FY25 while improving net worth from ₹5,602 crores to ₹7,366 crores. The company maintains focus on value-added products, cost optimization, and operational efficiency to navigate market challenges.",
            "Sentiment": "neutral",
            "PublishDate": 1755069780070,
            "Source": "stock"
        },
        {
            "Title": "Bharat Wire Reports Mixed Q1 Results with Revenue Growth but Lower Profitability",
            "Summary": "Bharat Wire reported Q1 revenue of 1.4 billion rupees, up from 1.33 billion rupees in the same period last year. However, the company's profitability declined with net profit falling to 156 million rupees from 180 million rupees year-over-year. EBITDA decreased to 301 million rupees from 325.9 million rupees, while EBITDA margin compressed to 21.26% from 24.42% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1754918995877,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Wire Ropes Q4 Financial Results",
            "Summary": "Bharat Wire Ropes reported its Q4 financial results. The company's EBITDA was 371 million rupees, compared to 374 million rupees year-over-year. The EBITDA margin decreased to 21.59% from 25.39% year-over-year. Net profit for Q4 was 206 million rupees, down from 218 million rupees year-over-year but up from 149 million rupees quarter-over-quarter. Q4 revenue increased to 1.7 billion rupees from 1.5 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747661802000,
            "Source": "result"
        },
        {
            "Title": "Bharat Wire Reports Decline in Q3 Net Profit",
            "Summary": "Bharat Wire has reported its financial results for the third quarter. The company's net profit decreased to 149 million rupees from 264 million rupees in the same period last year. However, revenue showed a slight increase, rising to 1.62 billion rupees from 1.57 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738627893000,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Wire Reports Decline in Q3 Net Profit Despite Revenue Growth",
            "Summary": "Bharat Wire has reported its Q3 financial results. The company's net profit decreased to 149 million rupees from 264 million rupees in the same quarter last year, marking a significant year-over-year decline. However, revenue showed a slight increase, rising to 1.62 billion rupees from 1.57 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1738593333000,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Wire Reports Q2 EBITDA Decline",
            "Summary": "Bharat Wire has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 is 337 million rupees, down from 416 million rupees in the same quarter last year. The EBITDA margin has also decreased to 22.14% from 26.17% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730120512000,
            "Source": "result"
        },
        {
            "Title": "Bharat Wire Reports Q2 Financial Results",
            "Summary": "Bharat Wire has announced its Q2 financial results. The company reported a net profit of 189 million rupees, which is lower compared to 244 million rupees in the same quarter last year (YoY) and 181 million rupees in the previous quarter (QoQ). The Q2 revenue stood at 1.52 billion rupees, slightly higher than the 1.5 billion rupees reported in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730120453000,
            "Source": "result"
        }
    ]
}