{
    "Symbol": "BHEL",
    "ISIN": "INE257A01026",
    "News": [
        {
            "Title": "BHEL Secures ₹2800 Cr Syngas Plant Contract",
            "Summary": "Bharat Heavy Electricals Limited receives Letter of Acceptance from BCGCL for Syngas Purification Plant worth approximately ₹2800 crores at Lakhanpur, Odisha facility.",
            "Sentiment": "positive",
            "PublishDate": 1770739825810,
            "Source": "co_actions_results"
        },
        {
            "Title": "BHEL Wins Major Power Contract Worth ₹1200-1500 Cr",
            "Summary": "Bharat Heavy Electricals secures significant BTG package contract from Hindalco Industries for 2 X 150 MW power generation equipment with 35-37 month completion timeline.",
            "Sentiment": "positive",
            "PublishDate": 1770190597074,
            "Source": "co_actions_results"
        },
        {
            "Title": "BHEL Appoints Shri Asit Gopal as Part-time Director",
            "Summary": "Bharat Heavy Electricals Limited appointed Shri Asit Gopal, Special Secretary & Financial Advisor, as Part-time Official Director on the Board effective February 3, 2026, following Ministry of Heavy Industries approval.",
            "Sentiment": "neutral",
            "PublishDate": 1770127056748,
            "Source": "stocks"
        },
        {
            "Title": "BHEL Executive Director (CFP) Superannuates",
            "Summary": "Bharat Heavy Electricals announces superannuation of Executive Director (CFP) Shri Alok Kumar Singhal from company services on 24th January, 2026 under regulatory disclosure requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1769312030907,
            "Source": "stocks"
        },
        {
            "Title": "BHEL Shares Drop 4.9% Despite Strong Q3 Results",
            "Summary": "Bharat Heavy Electricals shares fell 4.9% to ₹250.20 amid weak market sentiment, despite posting strong Q3 numbers. Margin pressures from project completion weighed on investor confidence.",
            "Sentiment": "negative",
            "PublishDate": 1768961252039,
            "Source": "co_actions_results"
        },
        {
            "Title": "BHEL Gets Hold Rating with ₹245 Target Price",
            "Summary": "Prabhudas Lilladher maintains Hold rating on BHEL with revised target price of ₹245, citing slower execution pace despite strong order backlog and recent NTPC contract win.",
            "Sentiment": "neutral",
            "PublishDate": 1768895278325,
            "Source": "stocks"
        },
        {
            "Title": "CLSA Upgrades BHEL to Under-Perform, Sets ₹195 Target",
            "Summary": "CLSA has issued an Under-Perform rating on Bharat Heavy Electricals Limited (BHEL) with a target price of ₹195 per share, indicating a bearish outlook on the power equipment manufacturer's stock performance.",
            "Sentiment": "negative",
            "PublishDate": 1768881088017,
            "Source": "stocks"
        },
        {
            "Title": "Macquarie Upgrades BHEL with ₹205 Target Price",
            "Summary": "Macquarie upgrades Bharat Heavy Electricals Limited (BHEL) with an upward revision and sets target price at ₹205 per share, reflecting positive analyst sentiment on the power equipment manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1768881062184,
            "Source": "stocks"
        },
        {
            "Title": "Investec maintains 73% downside target on BHEL stock",
            "Summary": "Investec continues bearish stance on BHEL with ₹70 price target, citing execution challenges and supply chain concerns despite Q3 results. Nine of 19 analysts maintain sell ratings.",
            "Sentiment": "negative",
            "PublishDate": 1768880216514,
            "Source": "co_actions_results"
        },
        {
            "Title": "BHEL Projects Timeline: Losses to End by H2 FY26",
            "Summary": "Nuvama reports BHEL's loss-making older projects will conclude by H2 FY26, with most new projects becoming operational by March 2026, though gross margins face near-term pressure.",
            "Sentiment": "neutral",
            "PublishDate": 1768811043292,
            "Source": "stocks"
        },
        {
            "Title": "BHEL Closes Varanasi Plant Investment Scheme",
            "Summary": "Bharat Heavy Electricals Limited's Board approves closure of capital investment scheme for new plant at Karkhiyaon, Varanasi, citing current business landscape considerations.",
            "Sentiment": "neutral",
            "PublishDate": 1768804334416,
            "Source": "stocks"
        },
        {
            "Title": "BHEL Board Approves Early Closure of Varanasi Plant",
            "Summary": "Bharat Heavy Electricals Limited's board has approved the early closure of its Varanasi plant scheme, with production operations set to be relocated to other facilities due to the current business landscape.",
            "Sentiment": "neutral",
            "PublishDate": 1768804310390,
            "Source": "stocks"
        },
        {
            "Title": "BHEL Q3 Results: Other Income Boosts Profit Growth",
            "Summary": "BHEL's Q3 net profit rose to ₹390 crores with revenue at ₹8,473 crores. Other income doubled to ₹219 crores, while EBITDA margins expanded to 6.4%. Board approves closure of Varanasi plant project.",
            "Sentiment": "positive",
            "PublishDate": 1768803767296,
            "Source": "co_actions_results"
        },
        {
            "Title": "BHEL Q3 Net Profit Triples to ₹382 Crore, Revenue Up 16%",
            "Summary": "Bharat Heavy Electricals reports Q3 net profit of ₹382 crore vs ₹125 crore YoY, marking 206% growth with revenue rising 16% to ₹8,473 crore on improved execution.",
            "Sentiment": "positive",
            "PublishDate": 1768803637366,
            "Source": "co_actions_results"
        },
        {
            "Title": "BHEL Begins Supply of Traction Transformers for Vande Bharat",
            "Summary": "Bharat Heavy Electricals commences supply of semi-high-speed underslung traction transformers for Vande Bharat Sleeper Train project from Jhansi plant, strengthening its position in rail propulsion segment.",
            "Sentiment": "positive",
            "PublishDate": 1768458817999,
            "Source": "stocks"
        },
        {
            "Title": "BHEL Stock Falls on China Competition Fears",
            "Summary": "BHEL shares dropped 14% intraday on January 8 following reports of potential Chinese equipment maker entry, though analysts believe market reaction may be overdone given strong order book of ₹2.2 trillion.",
            "Sentiment": "neutral",
            "PublishDate": 1768211252759,
            "Source": "stocks"
        },
        {
            "Title": "BHEL Shares Drop 6% Amid China Competition Concerns",
            "Summary": "Bharat Heavy Electricals shares fell 5.97% to ₹258.30, extending three-session decline to 15% on reports of potential Chinese firm restrictions being lifted for government contracts.",
            "Sentiment": "negative",
            "PublishDate": 1768195020953,
            "Source": "stocks"
        },
        {
            "Title": "BHEL shares tumble 15% on China policy concerns",
            "Summary": "Bharat Heavy Electricals shares fell 15% in two sessions amid reports India may ease restrictions on Chinese firms bidding for government contracts, raising competition concerns for power equipment makers.",
            "Sentiment": "negative",
            "PublishDate": 1768191802524,
            "Source": "stocks"
        },
        {
            "Title": "India Considers Lifting Chinese Firm Contract Ban",
            "Summary": "The Centre is reportedly considering rolling back a five-year ban on Chinese companies from bidding for government contracts, potentially impacting defence PSU stocks including BHEL.",
            "Sentiment": "neutral",
            "PublishDate": 1768154077420,
            "Source": "stocks"
        },
        {
            "Title": "BHEL Q3 FY26 Results Date Announced for January",
            "Summary": "Bharat Heavy Electricals Limited (BHEL) has announced its board meeting schedule for declaring Q3 FY26 financial results during the ongoing earnings season in January 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768043257041,
            "Source": "co_actions_results"
        },
        {
            "Title": "BHEL Begins Supply of Traction Converters for Vande Bharat",
            "Summary": "Bharat Heavy Electricals Limited has commenced supply of semi-high-speed underslung traction converters for Vande Bharat sleeper trains, marking a significant milestone in India's railway modernization efforts.",
            "Sentiment": "positive",
            "PublishDate": 1767958339891,
            "Source": "stocks"
        },
        {
            "Title": "BHEL jumps 5% on ₹5,400 cr coal gasification order",
            "Summary": "Bharat Heavy Electricals Limited secured a major ₹5,400 crore order from BCGCL for coal gasification plant in Odisha. Stock surged 5% to ₹285 per share following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1767945403553,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chinese firms unlikely to challenge Indian power giants",
            "Summary": "Former BHEL CMD K. Ravi Kumar states that potential removal of five-year-old restrictions on Chinese firms bidding for government contracts won't alter competitive dynamics in India's power sector.",
            "Sentiment": "neutral",
            "PublishDate": 1767941925341,
            "Source": "stocks"
        },
        {
            "Title": "BHEL Shares Rise 5% Amid Policy Uncertainty",
            "Summary": "BHEL shares surged nearly 5% to ₹284.10 as brokerages assess potential easing of Chinese firm restrictions. UBS maintains 'buy' rating with ₹375 target following ₹54 billion order win.",
            "Sentiment": "positive",
            "PublishDate": 1767940439568,
            "Source": "stocks"
        },
        {
            "Title": "BHEL Shares Rally 5% After China Policy Concerns",
            "Summary": "Bharat Heavy Electricals shares rebounded 4.8% to ₹285.50 after hitting lower circuit on reports of easing Chinese firm restrictions. Mixed analyst views on potential policy impact.",
            "Sentiment": "neutral",
            "PublishDate": 1767940206570,
            "Source": "stocks"
        },
        {
            "Title": "BHEL shares rise 4.8% amid China policy debate",
            "Summary": "Analysts divided on impact of potential China restrictions rollback on BHEL. JM Financial sees benefits from lower costs, while Jefferies flags competitive risks for the power equipment maker.",
            "Sentiment": "neutral",
            "PublishDate": 1767939769406,
            "Source": "stocks"
        },
        {
            "Title": "BHEL Shares Rebound 3% After Sharp Selloff",
            "Summary": "Bharat Heavy Electricals shares recovered over 3% in early trade following Thursday's 9% decline, supported by UBS initiating a 'Buy' rating with ₹375 target price after major order win.",
            "Sentiment": "positive",
            "PublishDate": 1767938397115,
            "Source": "stocks"
        },
        {
            "Title": "BHEL gains on ₹5,400 cr order from Coal India JV",
            "Summary": "Bharat Heavy Electricals shares rose after securing a major coal gasification project order worth ₹5,400 crores from its joint venture with Coal India in Odisha, marking first commercial use of proprietary technology.",
            "Sentiment": "positive",
            "PublishDate": 1767938267949,
            "Source": "co_actions_results"
        },
        {
            "Title": "BHEL Gets UBS 'Buy' Call After Major Order Win",
            "Summary": "UBS issues 'Buy' rating for BHEL with ₹375 target price after company secures ₹5,400-crore coal gasification order, seeing 35% upside despite recent selloff on policy concerns.",
            "Sentiment": "positive",
            "PublishDate": 1767937697461,
            "Source": "co_actions_results"
        },
        {
            "Title": "BHEL secures ₹5,400 cr order from JV with CIL",
            "Summary": "Bharat Heavy Electricals Limited wins major coal gasification project order and commences supply of traction converters for Vande Bharat Sleeper trains, marking strategic expansion.",
            "Sentiment": "positive",
            "PublishDate": 1767933891892,
            "Source": "co_actions_results"
        },
        {
            "Title": "BHEL At Risk As Chinese Power Equipment Curbs May Ease",
            "Summary": "Brokerages warn BHEL faces highest risk while L&T remains relatively insulated as government considers easing five-year-old restrictions on Chinese power equipment suppliers amid supply shortages and rising costs.",
            "Sentiment": "negative",
            "PublishDate": 1767933830353,
            "Source": "stocks"
        },
        {
            "Title": "UBS Sets BHEL Buy Rating with ₹375 Target Price",
            "Summary": "UBS maintains a Buy recommendation on Bharat Heavy Electricals Limited (BHEL) with a target price of ₹375, indicating positive analyst sentiment for the power equipment manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1767930595928,
            "Source": "stocks"
        },
        {
            "Title": "BHEL Secures Major ₹5,400 Crore Order Win",
            "Summary": "Bharat Heavy Electricals Limited announces receipt of significant order worth approximately ₹5,400 crores, marking a substantial business development for the public sector engineering company.",
            "Sentiment": "positive",
            "PublishDate": 1767924768990,
            "Source": "co_actions_results"
        },
        {
            "Title": "BHEL Wins Major Contract Worth ₹5,400 Crores",
            "Summary": "Bharat Heavy Electricals Limited secures significant contract valued at approximately ₹5,400 crores, marking a major business development for the state-owned engineering company.",
            "Sentiment": "positive",
            "PublishDate": 1767876317245,
            "Source": "co_actions_results"
        },
        {
            "Title": "BHEL Block Trade: ₹63.76 Cr Deal on NSE",
            "Summary": "Bharat Heavy Electricals executed a significant block trade worth ₹63.76 crores on NSE, involving 2,404,328 shares at ₹265.20 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767865789382,
            "Source": "co_actions_results"
        },
        {
            "Title": "BHEL Begins Vande Bharat Sleeper Train Component Supply",
            "Summary": "BHEL commenced supply of semi-high-speed underslung traction converters for Vande Bharat sleeper trains from Bengaluru plant. Components dispatched to Kolkata for final assembly.",
            "Sentiment": "positive",
            "PublishDate": 1767853480467,
            "Source": "stocks"
        },
        {
            "Title": "BHEL Sees ₹25.27 Cr NSE Block Trade at ₹295.35",
            "Summary": "Bharat Heavy Electricals executed a significant block trade worth ₹25.27 crores involving 855,579 shares at ₹295.35 per share on NSE, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767690281005,
            "Source": "co_actions_results"
        },
        {
            "Title": "BHEL Board Meeting Set for January 19, 2026 for Q3 Results",
            "Summary": "Bharat Heavy Electricals Limited has scheduled its board meeting for January 19, 2026, to approve unaudited financial results for the quarter ended December 31, 2025, with trading window closure until January 21.",
            "Sentiment": "neutral",
            "PublishDate": 1767679441964,
            "Source": "co_actions_results"
        },
        {
            "Title": "BHEL Gets Major Tax Relief from Telangana Govt",
            "Summary": "Bharat Heavy Electricals Limited receives significant relief as Telangana Commercial Tax Department drops ₹183.77 crore GST demand for FY22, with only ₹1.43 crore residual amount remaining.",
            "Sentiment": "positive",
            "PublishDate": 1767338020878,
            "Source": "stocks"
        },
        {
            "Title": "BHEL Changes Registrar Agent to Bigshare Services",
            "Summary": "Bharat Heavy Electricals Limited transitions its registrar and share transfer agent services from Alankit Assignments to Bigshare Services Private Limited effective January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767244998486,
            "Source": "stocks"
        },
        {
            "Title": "BHEL Receives GST Demand Order Worth ₹42.75 Lakhs",
            "Summary": "Bharat Heavy Electricals receives GST demand order from Gujarat authorities for ₹12.95 lakhs with interest and penalty, totaling ₹42.75 lakhs over input tax credit dispute.",
            "Sentiment": "negative",
            "PublishDate": 1766575712569,
            "Source": "stocks"
        },
        {
            "Title": "BHEL Appoints Navin Kaul as Head of Power Marketing",
            "Summary": "Bharat Heavy Electricals Limited announces senior management change with Navin Kaul's appointment as Head of Power Sector-Marketing for PS-BGI division, effective December 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765819282570,
            "Source": "stocks"
        },
        {
            "Title": "BHEL Appoints New Head of Fabrication Plant",
            "Summary": "Bharat Heavy Electricals Limited announces appointment of Shri Sunil Kumar Somani as General Manager and Head of Fabrication, Stamping & Insulator Plant at Jagdishpur facility effective December 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765790112941,
            "Source": "stocks"
        },
        {
            "Title": "BHEL Promotes 16 Senior Officials to Executive Director",
            "Summary": "Bharat Heavy Electricals Limited announces promotion of 16 senior management personnel to Executive Director positions effective December 10, 2025, strengthening its leadership structure.",
            "Sentiment": "positive",
            "PublishDate": 1765386295716,
            "Source": "stocks"
        },
        {
            "Title": "Rajesh Pratap Singh Sisodia Appointed as Director (P & P) at NLC India",
            "Summary": "Rajesh Pratap Singh Sisodia has assumed charge as Director (Projects & Planning) at NLC India. The appointment brings his experience from leading various technical divisions and serving as Executive Director at BHEL to the state-owned mining and power company.",
            "Sentiment": "neutral",
            "PublishDate": 1764719955590,
            "Source": "corporate_governance"
        },
        {
            "Title": "BHEL Fined Rs 5.42 Lakh by BSE and NSE for Board Composition Non-Compliance",
            "Summary": "Bharat Heavy Electricals Limited received fines of Rs 5,42,800 each from BSE and NSE for failing to maintain 50% independent directors on its board during the quarter ending September 2025. The government company plans to seek waiver of the penalties and is working with the Government of India for appointment of requisite independent directors to ensure regulatory compliance.",
            "Sentiment": "negative",
            "PublishDate": 1764331382930,
            "Source": "corporate_governance"
        },
        {
            "Title": "BHEL Seeks Shareholder Approval to Amend Articles for Enhanced Joint Venture Powers",
            "Summary": "Bharat Heavy Electricals Limited has issued a postal ballot notice seeking shareholder approval through special resolution to amend Article 69 of its Articles of Association, removing specific investment limits for establishing joint ventures and subsidiaries. The amendment aims to align with BHEL's Maharatna status granted in 2013, replacing the current Navratna-based restrictions with broader powers subject to government guidelines, with e-voting scheduled from November 19 to December 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763448465280,
            "Source": "corporate_action"
        },
        {
            "Title": "Hitachi Energy India Transfers HVDC Project Responsibilities to AESL Projects Ltd",
            "Summary": "Hitachi Energy India has signed an agreement to transfer its High Voltage Direct Current (HVDC) project responsibilities to AESL Projects Ltd. The transfer aims to ensure uninterrupted execution of the contract.",
            "Sentiment": "neutral",
            "PublishDate": 1763345328179,
            "Source": "order&deals"
        },
        {
            "Title": "BHEL Wins Rs 6,650 Crore Power Project Contract from NTPC",
            "Summary": "Bharat Heavy Electricals Limited (BHEL) received a Notification of Award from NTPC Limited for a 1x800MW Darlipali Supercritical Thermal Power Project Stage-II contract. The EPC package, valued at over Rs 6,650 crore excluding GST, covers design, engineering, equipment supply, erection, commissioning and civil works for the project located in Sundargarh district, Odisha. The contract was awarded through international competitive bidding and must be completed within 48 months from the notification date. Both BHEL and NTPC are Central Public Sector Enterprises.",
            "Sentiment": "positive",
            "PublishDate": 1762492157984,
            "Source": "order&deals"
        },
        {
            "Title": "BHEL Reports Mixed Financial Results with Revenue Growth but Net Loss",
            "Summary": "Bharat Heavy Electricals Limited (BHEL) published its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported revenue of ₹7,511.80 crore for the quarter compared to ₹6,564.10 crore in the same period last year. However, BHEL recorded a net loss of ₹115.42 crore for the quarter versus a loss of ₹148.17 crore in the previous year. For the half-year period, revenue increased to ₹12,069.02 crore from ₹8,339.48 crore, while the net loss widened to ₹136.84 crore compared to ₹168.40 crore loss in the corresponding period. The company's paid-up equity share capital remained unchanged at ₹696.41 crore. BHEL operates joint ventures including BHEL-GE Gas Turbine Services, Raichur Power Corporation, NTPC-BHEL Power Projects, Power Plant Performance Improvements, and Bharat Coal Gasification and Chemicals Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1761849851244,
            "Source": "earnings"
        }
    ]
}