{
    "Symbol": "BIGBLOC",
    "ISIN": "INE412U01025",
    "News": [
        {
            "Title": "Bigbloc Construction Eyes Positive Growth Trajectory",
            "Summary": "Bigbloc Construction management expresses confidence in maintaining positive momentum and delivering improved performance in upcoming quarters, citing improving demand conditions as a key driver.",
            "Sentiment": "positive",
            "PublishDate": 1769049241330,
            "Source": "stocks"
        },
        {
            "Title": "BIGBLOC Construction Reports Strong Q3 Growth",
            "Summary": "BIGBLOC Construction Limited delivered impressive Q3 performance with consolidated net profit rising 50% YoY to ₹4.50 million and revenue growing 28.17% YoY to ₹728.00 million, demonstrating strong operational momentum.",
            "Sentiment": "positive",
            "PublishDate": 1768916374017,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bigbloc Construction Q3 FY26 Earnings Call Jan 21",
            "Summary": "Bigbloc Construction Limited has scheduled an earnings conference call on January 21, 2026, at 3:30 PM IST to discuss Q3 and 9M FY2026 financial results with analysts and institutional investors.",
            "Sentiment": "neutral",
            "PublishDate": 1768543304806,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bigbloc Construction H1FY26 Investor Presentation",
            "Summary": "Bigbloc Construction presents H1FY26 results showing revenue of ₹1,237 million with focus on AАC blocks manufacturing capacity of 13 lakh CBM per annum and expansion plans for central and southern India markets.",
            "Sentiment": "neutral",
            "PublishDate": 1766053219012,
            "Source": "stocks"
        },
        {
            "Title": "Bigbloc Construction Wins Order from L&T",
            "Summary": "Bigbloc Construction Limited announced securing a purchase order from Larsen & Toubro Limited for Autoclaved Aerated Concrete (AAC) blocks, marking a significant business development for the company.",
            "Sentiment": "positive",
            "PublishDate": 1766050184685,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bigbloc Construction Merges Subsidiary Starbigloc Building Material Into Bigbloc Building Elements",
            "Summary": "Bigbloc Construction announced the merger of its subsidiary Starbigloc Building Material Ltd into Bigbloc Building Elements Pvt Ltd, with both company boards approving the transaction. The merger is scheduled to become effective on April 1, 2025, representing a corporate restructuring move within the construction materials group.",
            "Sentiment": "positive",
            "PublishDate": 1764145411885,
            "Source": "corporate_action"
        },
        {
            "Title": "Bigbloc Construction's Subsidiary Commissions 0.7 MW Rooftop Solar Facility",
            "Summary": "Bigbloc Construction Limited's subsidiary Starbigbloc Building Material Limited has successfully commissioned a 0.7 MW rooftop solar installation and commenced operations. The facility is expected to reduce grid electricity dependence and lower long-term power costs while enhancing operational efficiency and supporting renewable energy objectives.",
            "Sentiment": "positive",
            "PublishDate": 1763727808523,
            "Source": "stock"
        },
        {
            "Title": "Bigbloc Construction Reports 30.3% Revenue Growth in Q2 FY26 Earnings Call",
            "Summary": "Bigbloc Construction Limited held an earnings conference call on November 10, 2025, to discuss Q2 and H1 FY26 results. The company reported consolidated revenue of Rs. 673 million for Q2 FY26, representing 30.3% year-over-year growth and 19.5% sequential growth. Sales volume increased 43.7% year-over-year to 198,555 cubic meters. For H1 FY26, revenue reached Rs. 1,237 million, up 19.8% from the previous year. EBITDA for Q2 was Rs. 19 million with a 2.8% margin, while H1 EBITDA was Rs. 32 million with a 2.6% margin. Overall capacity utilization improved to 62% in Q2 from 53% in the previous quarter. The company's joint venture SIAM Cement BigBloc Construction Technologies saw AAC wall panel utilization increase to 43% from 36%. CFO Mohit Saboo noted that business conditions showed gradual improvement despite prolonged monsoon impacts, with demand recovery toward quarter-end. The company plans to commission a construction chemicals facility at Umargaon in H2 FY26 and is developing a new plant in Madhya Pradesh. Star BigBloc plant achieved 90% capacity utilization in Q2. Logistics costs range from 12% to 20% of turnover depending on region.",
            "Sentiment": "positive",
            "PublishDate": 1763015630702,
            "Source": "earnings"
        },
        {
            "Title": "Bigbloc Construction Reports Quarterly Loss Despite Revenue Growth",
            "Summary": "Bigbloc Construction reported a consolidated net loss of 11.8 million rupees in Q2, compared to a profit of 21.3 million rupees in the same period last year. The company's quarterly revenue increased to 673 million rupees from 516.5 million rupees year-over-year, representing growth despite the shift to losses.",
            "Sentiment": "negative",
            "PublishDate": 1762599437430,
            "Source": "earnings"
        },
        {
            "Title": "Bigbloc Construction Plans Merger of Subsidiary Companies",
            "Summary": "Bigbloc Construction has announced plans to merge Starbigbloc Building Material Ltd into Bigbloc Building Elements Private Ltd. The merger is currently pending required approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1760522017555,
            "Source": "corporate_action"
        },
        {
            "Title": "Bigbloc Construction Promoter Group Member Acquires 75,000 Shares",
            "Summary": "Madhu Narayan Saboo, a promoter group member of Bigbloc Construction Limited, acquired 75,000 equity shares from the open market on September 22, 2025. The acquisition was disclosed under SEBI regulations for substantial acquisition of shares, with the disclosure submitted by Director & CFO Mohit Narayan Saboo.",
            "Sentiment": "positive",
            "PublishDate": 1758612382518,
            "Source": "corporate_action"
        },
        {
            "Title": "Bigbloc Construction Schedules Non-Deal Roadshow with 26 Financial Institutions in Mumbai",
            "Summary": "Bigbloc Construction Limited will conduct a non-deal roadshow on September 9, 2025, in Mumbai, organized by Churchgate Partners. The company will interact with investors and brokers in a group setting through a physical meeting. Twenty-six financial institutions are scheduled to participate, including Arihant Capital, Avendus Wealth Management, BOB Capital Markets, Emkay Investment Managers, and Investec, among others. Company officials will reference publicly available documents during discussions and will not share unpublished price-sensitive information. The event date and time are subject to change due to potential scheduling conflicts.",
            "Sentiment": "neutral",
            "PublishDate": 1756981222032,
            "Source": "stock"
        },
        {
            "Title": "Bigbloc Construction Promoter Group Member Acquires 18,756 Shares",
            "Summary": "Narayan Sitaram Saboo(HUF), a member of the promoter group of Bigbloc Construction Limited, acquired 18,756 equity shares from the open market on September 3, 2025. The acquisition was disclosed under SEBI regulations for substantial acquisition of shares. The disclosure was submitted by Mohit Narayan Saboo, Director & CFO of Bigbloc Construction Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1756966355844,
            "Source": "corporate_action"
        },
        {
            "Title": "Bigbloc Construction Reports 9.3% Revenue Growth Despite Low EBITDA Margins in Q1 FY26",
            "Summary": "Bigbloc Construction Limited, a manufacturer of AAC blocks, wall panels, and construction chemicals, reported Q1 FY26 revenue of Rs. 564 million, up 9.3% year-on-year. Sales volume increased 25.3% to 167,835 cubic meters. However, EBITDA margin remained low at 2.3% with overall capacity utilization at 53%. The company operates four manufacturing facilities and is scaling up AAC wall panels production while preparing to start construction chemicals manufacturing at its Umargaon facility. Management expects improved performance from Q2 FY26 as construction activity picks up post-monsoon, targeting 70%+ capacity utilization and 15-18% EBITDA margins within two quarters. The company aims to double revenues to Rs. 450-500 crores over the next 2-3 years. Renewable energy contribution increased to 26% of total power requirements. The real estate sector slowdown and increased competition are impacting demand and pricing pressure.",
            "Sentiment": "neutral",
            "PublishDate": 1755503338992,
            "Source": "earnings"
        },
        {
            "Title": "BIGBLOC Construction Reports Loss in Quarter Ended June 30, 2025",
            "Summary": "BIGBLOC Construction Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported a standalone net loss of Rs 179.69 lakhs compared to a loss of Rs 57.72 lakhs in the same quarter last year. Revenue from operations increased to Rs 1,877.19 lakhs from Rs 1,611.81 lakhs year-over-year. On a consolidated basis, the company posted a net loss of Rs 496.18 lakhs versus a profit of Rs 303.31 lakhs in the corresponding quarter of the previous year. Consolidated revenue declined to Rs 5,635.54 lakhs from Rs 5,157.01 lakhs. The company's capacity utilization was around 50% for the standalone entity and 53% on a consolidated basis during the quarter. The auditor noted that the company has not provided for post-employment benefits under defined benefit plans, which deviates from accounting standards.",
            "Sentiment": "negative",
            "PublishDate": 1754904470886,
            "Source": "earnings"
        },
        {
            "Title": "BIGBLOC Construction Reports Q1 Net Loss Despite Revenue Growth",
            "Summary": "BIGBLOC Construction reported mixed quarterly results with revenue increasing to 563 million rupees from 516 million rupees year-over-year. However, the company posted a consolidated net loss of 32 million rupees compared to a profit of 44 million rupees in the same period last year. EBITDA declined significantly to 13 million rupees from 96 million rupees, while EBITDA margin compressed to 2.3% from 18.7% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1754903730536,
            "Source": "earnings"
        },
        {
            "Title": "Bigbloc Construction Re-appoints Samiksha Rajesh Nandwani as Independent Director",
            "Summary": "Bigbloc Construction Limited has re-appointed Ms. Samiksha Rajesh Nandwani as an Independent Director effective August 6, 2025. The re-appointment is for a second term of five years, subject to shareholder approval at the next general meeting or within three months from the appointment date. Nandwani holds a Bachelor's degree in Business Administration with specialization in marketing. The board meeting regarding this decision was held on August 6, 2025, lasting from 11:00 A.M. to 11:20 A.M. She is not debarred from holding directorship by any regulatory authority.",
            "Sentiment": "neutral",
            "PublishDate": 1754460290848,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bigbloc Construction's Subsidiary Receives IPO Approval",
            "Summary": "Starbigbloc Building Material, a subsidiary of Bigbloc Construction, has obtained approval for its Initial Public Offering (IPO) proposal.",
            "Sentiment": "positive",
            "PublishDate": 1750059653000,
            "Source": "default"
        },
        {
            "Title": "BigBloc Construction Reports Q4 Financial Results",
            "Summary": "BigBloc Construction has released its Q4 financial results. The company's EBITDA decreased to 57.5 million rupees from 125.5 million rupees year-over-year. The EBITDA margin fell to 8.9% from 18.47% in the same period last year. Revenue for Q4 was 645.9 million rupees, down from 680 million rupees year-over-year. The consolidated net profit for Q4 was 9.74 million rupees, compared to 87 million rupees year-over-year and 21.8 million rupees quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1748620984000,
            "Source": "result"
        },
        {
            "Title": "Bigbloc Construction: Penny Stock Surges 2300% in Five Years",
            "Summary": "Bigbloc Construction's share price has risen from ₹2.80 in April 2020 to ₹67 on NSE, marking a 2,293% increase over five years. The company recently approved a 1:1 bonus share issue and an increase in authorized share capital. For FY24, Bigbloc reported a consolidated net profit of ₹30.69 crore and revenue of ₹243.22 crore, up 21.55% year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1744952405000,
            "Source": "corporate_action"
        },
        {
            "Title": "BigBloc Construction's Subsidiary Acquires Land in Madhya Pradesh for New Facility",
            "Summary": "A subsidiary of BigBloc Construction has acquired a land parcel in Madhya Pradesh with the intention of establishing a new manufacturing facility. This move suggests an expansion of the company's operations and potential growth in production capacity.",
            "Sentiment": "positive",
            "PublishDate": 1739924264000,
            "Source": "corporate_action"
        },
        {
            "Title": "BigBloc Construction Subsidiary Acquires Land in Madhya Pradesh for New Facility",
            "Summary": "BigBloc Construction's subsidiary has acquired a land parcel in Madhya Pradesh to establish a new manufacturing facility. This move suggests an expansion of the company's operations and potential increase in production capacity.",
            "Sentiment": "positive",
            "PublishDate": 1739894013000,
            "Source": "corporate_action"
        },
        {
            "Title": "BigBloc Construction Acquires Land for Business Expansion",
            "Summary": "BigBloc Construction has announced the acquisition of land at Khasra for business expansion purposes. The total consideration for the land purchase is 60 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1739772664000,
            "Source": "corporate_action"
        },
        {
            "Title": "BigBloc Construction Reports Significant Decline in Q3 EBITDA",
            "Summary": "BigBloc Construction has reported a substantial decrease in its Q3 EBITDA, which fell to 61 million rupees from 161 million rupees in the same quarter last year. The company's EBITDA margin also declined sharply, dropping to 10.75% from 26.20% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739526526000,
            "Source": "earnings"
        },
        {
            "Title": "BigBloc Construction Reports Q3 Revenue Decline",
            "Summary": "BigBloc Construction has reported a revenue of 568 million rupees for the third quarter, compared to 615 million rupees in the same period last year, indicating a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1739526407000,
            "Source": "earnings"
        },
        {
            "Title": "BigBloc Construction Reports Decline in Q3 Net Profit",
            "Summary": "BigBloc Construction has reported a consolidated net profit of 22 million rupees for the third quarter, down from 87 million rupees in the same period last year. This represents a significant year-over-year decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1739526379000,
            "Source": "earnings"
        },
        {
            "Title": "BigBloc Construction Subsidiary Secures 4.5 Crore Rupee Order",
            "Summary": "A subsidiary of BigBloc Construction has been awarded an order worth 4.5 crore rupees. This news indicates a positive development for the company in terms of new business acquisition and potential revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1734933889000,
            "Source": "order&deals"
        },
        {
            "Title": "BigBloc Construction Reports Q2 FY25 Performance Impacted by Monsoons and Plant Upgrades",
            "Summary": "BigBloc Construction's Managing Director stated that the company's Q2 FY25 performance was negatively affected by excessive monsoons and plant shutdowns for upgrades. However, growth is anticipated to recover in Q3 and Q4 following the completion of upgrades at the Umargaon plant.",
            "Sentiment": "neutral",
            "PublishDate": 1731761442000,
            "Source": "result"
        },
        {
            "Title": "BIGBLOC CONSTRUCTION Reports Significant Decline in Q2 EBITDA",
            "Summary": "BIGBLOC CONSTRUCTION's Q2 EBITDA decreased from 310 million rupees to 77 million rupees year-over-year. The company's EBITDA margin also fell sharply from 52.61% to 14.85% in the same period.",
            "Sentiment": "negative",
            "PublishDate": 1731577591000,
            "Source": "result"
        },
        {
            "Title": "BigBloc Construction Reports Decline in Q2 Financial Performance",
            "Summary": "BigBloc Construction has reported its Q2 financial results. The company's consolidated net profit decreased to 21 million rupees from 75.6 million rupees year-over-year. Revenue also declined to 516 million rupees from 589 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731577400000,
            "Source": "result"
        },
        {
            "Title": "BIGBLOC CONSTRUCTION Doubles Manufacturing Capacity",
            "Summary": "BIGBLOC CONSTRUCTION has announced an expansion of its manufacturing capacity from 250,000 to 500,000 cubic meters per annum, effectively doubling its production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1730192611000,
            "Source": "corporate_action"
        },
        {
            "Title": "BigBloc Construction Begins Trial Operations at Umargaon Facility",
            "Summary": "BigBloc Construction has initiated trial operations at its facility in Umargaon. This development suggests the company is in the process of expanding or upgrading its production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1729058417000,
            "Source": "corporate_action"
        },
        {
            "Title": "BigBloc Construction Expands into Construction Chemicals Manufacturing",
            "Summary": "<p><span class='neutral'>BigBloc Construction</span> has announced its <span class='positive'>entry</span> into the <b>manufacturing of construction chemicals</b>. The company plans to produce various products including <span class='neutral'>block jointing mortar</span>, <span class='neutral'>ready mix plaster</span>, and <span class='neutral'>tile adhesives</span>, among others. This move represents a <span class='positive'>significant expansion</span> of the company's <span class='neutral'>product portfolio</span> in the <span class='neutral'>construction materials sector</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728978311000,
            "Source": "corporate_action"
        }
    ]
}