{
    "Symbol": "BIKAJI",
    "ISIN": "INE00E101023",
    "News": [
        {
            "Title": "Bikaji Foods Plans Growth Through Innovation",
            "Summary": "Bikaji Foods International outlines strategic focus on innovation, market expansion, and strengthening consumer connections to drive future growth in the competitive food industry.",
            "Sentiment": "positive",
            "PublishDate": 1769525950939,
            "Source": "stocks"
        },
        {
            "Title": "Bikaji Foods Approves ₹250 Million Investment",
            "Summary": "Bikaji Foods International has approved a strategic investment of ₹250 million in Jai Barbareek Dev Snacks, marking a significant expansion move for the snacks manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1769521261525,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bikaji Foods Q3FY26 Results: Revenue Up 8.7% YoY",
            "Summary": "Bikaji Foods International reported Q3FY26 revenue of ₹73,067.88 lakhs, up 8.7% YoY. Net profit rose 113.9% to ₹6,469.66 lakhs. Board approved ₹50 crore investment in retail subsidiary and joint venture for bakery business.",
            "Sentiment": "positive",
            "PublishDate": 1769519429658,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bikaji Foods Auditor Firm Converts to LLP Structure",
            "Summary": "Bikaji Foods International announces conversion of joint statutory auditor M S K A & Associates into Limited Liability Partnership with new registration number 105047W/W101187.",
            "Sentiment": "neutral",
            "PublishDate": 1768460033050,
            "Source": "stocks"
        },
        {
            "Title": "Bikaji Foods Board Meet on Jan 27 for Q3FY26 Results",
            "Summary": "Bikaji Foods International has scheduled its board meeting for January 27, 2026, to approve Q3FY26 unaudited financial results. Trading window closes from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766986403126,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bikaji Foods Unveils New Brand Logo Design",
            "Summary": "Bikaji Foods International Limited announced a new brand logo inspired by Rajasthani heritage, featuring a royal shield design that symbolizes trust, legacy and pride while maintaining the company's traditional roots.",
            "Sentiment": "positive",
            "PublishDate": 1766400082799,
            "Source": "stocks"
        },
        {
            "Title": "Bikaji Foods Increases Investment in US Subsidiary by $250,000",
            "Summary": "Bikaji Foods has made an additional investment of $250,000 in its subsidiary Bikaji USA while maintaining complete ownership of the entity. The investment represents the company's continued commitment to its US operations and expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1764677308180,
            "Source": "stock"
        },
        {
            "Title": "Bikaji Foods Reports 15.2% Revenue Growth in Q2 FY26 Despite GST Transition Impact",
            "Summary": "Bikaji Foods International delivered robust top-line growth of 15.2% and achieved highest EBITDA of 15.4% in 5 quarters, though ethnic snacks growth was muted at 4.6% due to GST rate change from 12% to 5% causing trade channel disruption in September. The company expects high-teens growth in ethnic snacks for Q3 and Q4 as GST benefits normalize, with export business delivering strong momentum at over INR 50 crores revenue this quarter.",
            "Sentiment": "positive",
            "PublishDate": 1763460154054,
            "Source": "earnings"
        },
        {
            "Title": "Bikaji Foods Receives Approval for Wholly-Owned Non-Profit Subsidiary",
            "Summary": "The Ministry of Corporate Affairs approved the incorporation of Bikaji Foundation as a Section 8 company and wholly-owned subsidiary of Bikaji Foods International Limited, with incorporation date of October 09, 2025. The foundation will implement social development programs and execute Corporate Social Responsibility initiatives as outlined in Schedule VII of the Companies Act, operating as a company limited by guarantee with seven members undertaking ₹1,000 each in guarantees.",
            "Sentiment": "positive",
            "PublishDate": 1763128663386,
            "Source": "corporate_action"
        },
        {
            "Title": "Bikaji Foods Approves ₹8 Crore Acquisition to Make PFPPL Wholly-Owned Subsidiary",
            "Summary": "Bikaji Foods International Limited's Board approved four key transactions on November 11, 2025. The company will acquire an additional 48.78% stake in Petunt Food Processors Private Limited (PFPPL) for ₹8 crore, making it a wholly-owned subsidiary. PFPPL, which operates in the FMCG sector manufacturing food products including sweets and namkeen, reported a turnover of ₹52.07 crore for the year ended March 31, 2025. Additionally, Bikaji approved a $5 lakh investment in its US subsidiary Bikaji Foods International USA Corp through 50,000 common stocks. The company also sanctioned two loan agreements: ₹4 crore to PFPPL for working capital requirements and ₹2.5 crore to Dadiji Snacks Private Limited to cover fire incident expenses. Both loans carry 8% annual interest with a maximum 60-month tenure.",
            "Sentiment": "positive",
            "PublishDate": 1762895364662,
            "Source": "order&deals"
        },
        {
            "Title": "Bikaji Foods Targets Double-Digit Growth Through Premiumization and Geographic Expansion",
            "Summary": "Bikaji Foods has outlined its growth strategy targeting double-digit expansion through premiumization and product diversification. The company is expanding its distribution network beyond Tier-2 cities and accelerating exports to GCC, UK, and North America markets. Bikaji is commissioning new manufacturing lines for namkeen and frozen snacks to enhance capacity and improve margin mix. The company's strategy focuses on brand investments, rural market penetration, and strategic product innovation to achieve sustainable volume-led growth.",
            "Sentiment": "positive",
            "PublishDate": 1762872109205,
            "Source": "stock"
        },
        {
            "Title": "Bikaji Foods Reports 15.5% Net Profit Growth Despite September GST Disruption",
            "Summary": "Bikaji Foods International reported net profit of ₹79.7 crore, up 15.5% year-on-year, with revenue from operations reaching ₹814.9 crore, marking 15.9% annual growth and 24.9% quarterly growth. EBITDA increased 25.6% to ₹112.7 crore with margin improvement of 110 basis points to 13.8%. The retail segment revenue surged 279.5% while store count expanded from 5 to 21 stores. The company faced temporary challenges in September due to distributor de-stocking ahead of GST rate revision, impacting core states despite strong performance in the first two months. Management noted that demand has normalized and excluding the one-time GST impact, the salty snacks business would have achieved high single-digit growth. Shares closed at ₹721, up 1.9%.",
            "Sentiment": "positive",
            "PublishDate": 1762868949327,
            "Source": "earnings"
        },
        {
            "Title": "Bikaji Foods International Approves ₹25 Million Loan for DADJI Snacks",
            "Summary": "Bikaji Foods International has approved a ₹25 million loan for DADJI Snacks. The loan approval represents a financial transaction between the two companies in the snacks industry.",
            "Sentiment": "neutral",
            "PublishDate": 1762864882981,
            "Source": "stock"
        },
        {
            "Title": "Bikaji Foods Reports Strong Q2 Results and Approves Strategic Investments",
            "Summary": "Bikaji Foods International reported quarterly revenue of 7.9 billion rupees compared to 7.1 billion rupees year-over-year. Net profit increased to 776 million rupees from 714 million rupees, while EBITDA rose to 1.3 billion rupees from 1.1 billion rupees. EBITDA margin improved to 16.40% from 15.19%. The company approved the purchase of a 48.78% stake in Petunt Food Processors and sanctioned a 40 million rupees loan to the same entity. Additionally, Bikaji allocated $500,000 for its US subsidiary operations.",
            "Sentiment": "positive",
            "PublishDate": 1762864158166,
            "Source": "order&deals"
        },
        {
            "Title": "Bikaji Foods Invests Additional $150,000 in US Subsidiary",
            "Summary": "Bikaji Foods International Limited made an additional subscription of 15,000 common stocks worth $150,000 in its wholly-owned subsidiary Bikaji Foods International USA Corp on October 25, 2025. The investment maintains Bikaji's 100% shareholding in the US entity, which was incorporated in July 2023 in New Jersey. The US subsidiary operates in the FMCG industry with a focus on trading food items and reported turnover of $1.77 million for the period ended March 31, 2025, compared to $1.10 million in the previous year. The investment aims to strengthen distribution networks in the USA and enhance market presence. The transaction is classified as a related party transaction conducted on an arm's length basis.",
            "Sentiment": "positive",
            "PublishDate": 1761369860701,
            "Source": "stock"
        },
        {
            "Title": "Bikaji Foods Managing Director Summoned by Enforcement Directorate in Money Laundering Investigation",
            "Summary": "Bikaji Foods International Limited disclosed that its Managing Director has been summoned to appear before the Directorate of Enforcement under the Prevention of Money Laundering Act, 2002. The investigation relates to the Rajasthan Premier League conducted by the Rajasthan Cricket Association. The company clarified that its involvement was limited to sponsorship activities conducted in the ordinary course of business for promotion and brand development. Bikaji stated that all sponsorship payments were properly documented, accounted for, and made through valid banking channels. The company emphasized it had no role in the management or operational aspects of the league beyond sponsorship and committed to full cooperation with authorities.",
            "Sentiment": "negative",
            "PublishDate": 1757418067032,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bikaji Foods Managing Director Summoned by Enforcement Directorate Under Money Laundering Act",
            "Summary": "Bikaji Foods International Limited received a summons from the Directorate of Enforcement requiring its Managing Director to appear in person under the Prevention of Money Laundering Act, 2002. The company received the physical summons at its corporate office on September 09, 2025. Bikaji Foods stated it is not in default regarding this matter and will fully cooperate with authorities during proceedings. The company indicated that since only a summons has been issued and the inquiry is at a preliminary stage without alleging any violations, there is no financial impact at the current stage. The summons does not allege any specific violations or contraventions, and the company has been asked for the Managing Director's presentation in connection with an investigation under PMLA.",
            "Sentiment": "negative",
            "PublishDate": 1757406098333,
            "Source": "stock"
        },
        {
            "Title": "Bikaji Foods Rules Out Further Price Hikes as Palm Oil Costs Stabilize",
            "Summary": "Bikaji Foods International has implemented a 3.5-4% price increase over the last three quarters but does not plan any additional price hikes, according to COO Manoj Verma. The decision comes as Malaysian crude palm oil prices have stabilized after rebounding 16% from May lows, following a 30% decline from December peaks. Verma expects palm oil prices to remain stable and anticipates price improvements after the festive season. India's edible oil imports dropped 16% to 15.48 lakh tonnes in July due to reduced palm oil shipments. Bikaji Foods also announced a joint venture with Nepal's Chaudhary Group to manufacture and market its product portfolio including bhujia, namkeen, papad, packaged sweets and snacks in Nepal.",
            "Sentiment": "positive",
            "PublishDate": 1755828274520,
            "Source": "stock"
        },
        {
            "Title": "Bikaji Foods Reports Fire Accident at Contract Manufacturing Unit in Patna",
            "Summary": "Bikaji Foods International Limited experienced a fire accident at its contract manufacturing unit, Dadiji Snacks Private Limited, located in Patna, Bihar on August 17, 2025. The fire was controlled and no casualties or injuries were reported. The company stated it has adequate insurance coverage and has notified the insurance company about the incident. Bikaji expects minimal business impact from the fire and plans to meet demand from other nearby manufacturing units until operations at the affected facility fully resume. The company is currently assessing the actual loss caused by the fire.",
            "Sentiment": "neutral",
            "PublishDate": 1755428538865,
            "Source": "stock"
        },
        {
            "Title": "Bikaji Promoters Sell Rs 183 Crore Stake to Institutional Investors",
            "Summary": "Bikaji Foods International promoters Deepak Agarwal and Shiv Ratan Agarwal sold shares worth Rs 183 crore through block deals. The promoters offloaded nearly 25 lakh shares representing 1% stake at Rs 732 per share. Deepak Agarwal sold 12.5 lakh shares while Paresh Parekh sold 0.49% stake. Major institutional buyers included HDFC Life Insurance (8.1 lakh shares), Tata Mutual Fund (7.42 lakh shares), ICICI Prudential Life Insurance, Aditya Birla Sun Life, and Alphamine Absolute Return Fund. Bikaji's stock closed 0.11% lower at Rs 721.95, underperforming the Nifty 50 which gained 0.91%. The stock has declined 11.47% over the past 12 months and 7.38% year-to-date. All seven analysts covering the company maintain buy ratings with an average price target of Rs 884.14, suggesting 22.5% upside potential.",
            "Sentiment": "neutral",
            "PublishDate": 1754934202175,
            "Source": "order&deals"
        },
        {
            "Title": "Bikaji Foods Promoters Sell 25 Lakh Equity Shares Through Open Market Sale",
            "Summary": "Bikaji Foods International Limited promoters Deepak Agarwal and Shiv Ratan Agarwal sold 25,00,000 equity shares through open market sale. Each promoter sold 12,50,000 shares. Following the transaction, the promoter group's total shareholding decreased from 74.918% to 73.921% of the company's total share capital. Shiv Ratan Agarwal's individual holding reduced from 34.216% to 33.717%, while Deepak Agarwal's stake declined from 14.807% to 14.308%. The company's total equity share capital remains at ₹25,05,92,710 divided into 25,05,92,710 equity shares of ₹1 each.",
            "Sentiment": "neutral",
            "PublishDate": 1754481804009,
            "Source": "corporate_action"
        },
        {
            "Title": "Bikaji Foods Reports Strong Q1 Performance with 15% Revenue Growth and Improved Margins",
            "Summary": "Bikaji Foods International delivered robust quarterly results with consolidated revenue growth of 15% and standalone growth of 11%. The company achieved consolidated gross margins of 35% (33.7% without PLI) and EBITDA of 14.8% (13% without PLI). Volume growth reached 7.5% with revenue of INR 653 crores. The company added 15,000 new outlets, bringing direct coverage to 3.26 lakh outlets. Ethnic snacks, the core category, grew 11.2% while exports surged 60.8%. Family packs outperformed impulse packs with 15.8% growth versus 8.2%. The company announced a 50-50 joint venture with Nepal's CG Group, planning INR 30 crores investment to establish local manufacturing and target INR 50 crores revenue within two years. Management cited improved demand recovery across rural and urban markets, supported by favorable raw material costs and recent price increases of 2.5%. The Hazelnut Factory subsidiary plans to expand to 19-20 stores by year-end, targeting INR 100 crores annual revenue run rate.",
            "Sentiment": "positive",
            "PublishDate": 1753883757573,
            "Source": "earnings"
        },
        {
            "Title": "Bikaji Foods Plans Growth Through Retail Expansion and Export Push",
            "Summary": "Bikaji Foods is targeting rapid growth through multiple strategic initiatives including retail scale-up, export expansion, and deeper distribution networks. The company plans to pursue global expansion through joint ventures while focusing on premium product offerings to drive business growth.",
            "Sentiment": "positive",
            "PublishDate": 1753282311053,
            "Source": "stock"
        },
        {
            "Title": "Bikaji Foods Approves Non-Profit Foundation, ₹5 Crore Subsidiary Loan, and Nepal Joint Venture",
            "Summary": "Bikaji Foods International Limited's Board approved three key initiatives on July 23, 2025. The company will incorporate a non-profit organization called 'BIKAJI FOUNDATION' as a wholly-owned subsidiary to implement Corporate Social Responsibility programs and social development initiatives. The Board also approved a ₹5 crore unsecured loan agreement with its subsidiary Bikaji Bakes Private Limited for working capital requirements, with a maximum term of 60 months and disbursement in tranches. Additionally, Bikaji entered into a joint venture agreement with C. G. Foods Nepal Limited to establish a 50:50 joint venture company in Nepal for manufacturing, trading and marketing snacks, namkeen, bhujia, papad and packaged sweets. The joint venture will use both 'BIKAJI' and 'CG' brand names, with each party having equal director appointment rights.",
            "Sentiment": "positive",
            "PublishDate": 1753277249327,
            "Source": "order&deals"
        },
        {
            "Title": "Bikaji Foods Reports Q1 Results, Approves Nepal Joint Venture and Non-Profit Foundation",
            "Summary": "Bikaji Foods International Limited approved its quarterly financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹60,811.90 lakhs compared to ₹56,767.31 lakhs in the same quarter last year, with profit after tax of ₹6,316.78 lakhs versus ₹4,844.74 lakhs previously. On a consolidated basis, revenue from operations reached ₹63,705.70 lakhs against ₹59,426.44 lakhs in the prior year quarter. The Board approved several strategic initiatives including incorporation of a non-profit organization called 'Bikaji Foundation' for CSR activities, a ₹500 lakhs loan agreement with wholly-owned subsidiary Bikaji Bakes Private Limited, and a joint venture agreement with C.G. Foods Nepal Limited for manufacturing and marketing snacks, namkeen, bhujia, papad and packaged sweets in Nepal. The company also completed divestment of its 51% stake in Bikaji Mega Food Park Private Limited during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753276238680,
            "Source": "earnings"
        },
        {
            "Title": "Bikaji Foods Reports 10.5% Revenue Growth in Q1 Results",
            "Summary": "Bikaji Foods reported Q1 revenue of 6.23 billion rupees, up from 5.64 billion rupees in the same period last year. Net profit increased to 631.6 million rupees from 596 million rupees year-over-year. EBITDA rose to 985 million rupees compared to 928 million rupees previously, though EBITDA margin declined to 15.80% from 16.44% in the prior year period.",
            "Sentiment": "positive",
            "PublishDate": 1753275732230,
            "Source": "earnings"
        },
        {
            "Title": "Bikaji Foods Plans Merger with Vindhyawasini Sales",
            "Summary": "Bikaji Foods has announced plans to merge with Vindhyawasini Sales Pvt Ltd. The news indicates a strategic corporate action, but no further details about the merger or its implications were provided in the given snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1751291292000,
            "Source": "default"
        },
        {
            "Title": "NCLT Approves Amalgamation of Vindhyawasini Sales with Bikaji Foods International",
            "Summary": "The National Company Law Tribunal (NCLT) has approved the scheme of amalgamation between Vindhyawasini Sales and Bikaji Foods International. This corporate action involves the merger of Vindhyawasini Sales into Bikaji Foods International.",
            "Sentiment": "positive",
            "PublishDate": 1749428089000,
            "Source": "default"
        },
        {
            "Title": "Bikaji Foods International Ltd: Q4 Results Beat Expectations, Management Confident on Growth Strategy",
            "Summary": "Bikaji Foods reported strong Q4 results, exceeding market expectations. Gross margins improved due to price hikes and lower input costs. Management focuses on high-margin products like Bhujia and Namkeen, which contribute 70% to profitability. The company aims for 25%+ export growth in the next three years. JM Financial maintains a 'Buy' rating with a ₹790 target price.",
            "Sentiment": "positive",
            "PublishDate": 1747644572000,
            "Source": "earnings"
        },
        {
            "Title": "Bikaji Foods International: Revenue Grows 12.6% in FY2025",
            "Summary": "Bikaji Foods International reported 12.6% YoY revenue growth to ₹2,621.9 crore for FY2025, with 10.3% volume growth. Q4 revenue was flat at ₹613.6 crore due to PLI adjustment. Ethnic snacks segment grew 12%, western snacks 17.7%. Company added 22,900 retail outlets in Q4 and operates in 25 Indian states and 25 countries globally.",
            "Sentiment": "positive",
            "PublishDate": 1747404139000,
            "Source": "earnings"
        },
        {
            "Title": "Bikaji Foods Reports Q4 Results and Approves Investments",
            "Summary": "Bikaji Foods reported Q4 net profit of 490 million rupees, down from 1.16 billion rupees year-over-year and up from 308 million rupees quarter-over-quarter. Q4 revenue was 5.85 billion rupees, compared to 6.06 billion rupees in the same quarter last year. The company recommended a dividend of 1 rupee per equity share. Additionally, Bikaji Foods approved further investment of 150 million rupees in Bikaji Foods Retail and up to 200 million rupees in Jai Barbareek Dev Snacks.",
            "Sentiment": "neutral",
            "PublishDate": 1747354144000,
            "Source": "default"
        },
        {
            "Title": "Bikaji Foods: Q4 Profit Plummets 61.6%, Margins Shrink",
            "Summary": "Bikaji Foods reported a 61.6% YoY drop in Q4 FY25 consolidated net profit to ₹44.6 crore. Revenue remained flat at ₹613.6 crore. EBITDA fell 67% to ₹74.3 crore, with margins contracting to 12% from 36.5% in Q4 FY24.",
            "Sentiment": "negative",
            "PublishDate": 1747319523000,
            "Source": "earnings"
        },
        {
            "Title": "Bikaji Foods International Approves Investments in Subsidiaries",
            "Summary": "Bikaji Foods International has approved two investment decisions. The company will invest 150 million rupees in Bikaji Foods Retail. Additionally, it has approved an investment of up to 200 million rupees in Jai Barbareek Dev Snacks.",
            "Sentiment": "positive",
            "PublishDate": 1747316472000,
            "Source": "default"
        },
        {
            "Title": "Bikaji Foods Reports Q4 Financial Results and Dividend Announcement",
            "Summary": "Bikaji Foods has announced its Q4 financial results and a dividend recommendation. The company's Q4 revenue was 5.85 billion rupees, down from 6.06 billion rupees year-over-year. Q4 EBITDA decreased to 791 million rupees from 1.61 billion rupees year-over-year, with EBITDA margin falling to 13.49% from 26.52%. Q4 net profit declined to 490 million rupees from 1.16 billion rupees year-over-year, but increased from 308 million rupees quarter-over-quarter. The company has recommended a dividend of 1 rupee per equity share.",
            "Sentiment": "negative",
            "PublishDate": 1747315211000,
            "Source": "result"
        },
        {
            "Title": "Bikaji Foods: Dolat Capital Upgrades Rating to 'Buy', Revises Target Price",
            "Summary": "Dolat Capital has upgraded Bikaji Foods to a 'Buy' rating and revised its target price. Bikaji holds market leadership in Rajasthan, Assam, and Bihar, contributing 66.6% to overall revenues. These states reported 10.8% growth in Q3. The company has expanded operations across 25 states and four union territories.",
            "Sentiment": "positive",
            "PublishDate": 1739172387000,
            "Source": "result"
        },
        {
            "Title": "Bikaji Foods International Ltd: Q3 Profit Plunges 39%, Stock Hits Two-Year Low",
            "Summary": "Bikaji Foods reported a 39% drop in Q3 profit to Rs 28.6 crore, missing analyst estimates. The stock tumbled nearly 13% to Rs 638.5, its lowest since November 2022. Ethnic snacks segment grew 11%, contributing 62.1% to overall revenue. Nine-month revenue for FY2025 grew 17% to Rs 2,008.2 crore with 10.9% volume growth.",
            "Sentiment": "negative",
            "PublishDate": 1738902788000,
            "Source": "earnings"
        },
        {
            "Title": "Bikaji Foods Reports Q3 Financial Results",
            "Summary": "Bikaji Foods International Limited has announced its financial results for the third quarter. The company reported a net profit of 308 million rupees, which is lower compared to 491 million rupees in the same quarter last year (YoY) and 721 million rupees in the previous quarter (QoQ). However, the company's revenue increased to 6.6 billion rupees from 6.1 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738846451000,
            "Source": "earnings"
        },
        {
            "Title": "Bikaji Foods to Incorporate Wholly Owned Subsidiary 'Bikaji Bakes Private Limited'",
            "Summary": "Bikaji Foods has approved the incorporation of a new wholly owned subsidiary named 'Bikaji Bakes Private Limited'. The new entity will operate in the FMCG (Fast-Moving Consumer Goods) industry, expanding Bikaji's presence in the sector.",
            "Sentiment": "positive",
            "PublishDate": 1735518026000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bikaji Foods to Incorporate Wholly Owned Subsidiary",
            "Summary": "Bikaji Foods International Limited has approved the incorporation of a wholly owned subsidiary named 'Bikaji Bakes Private Limited'. The new entity will operate in the FMCG (Fast-Moving Consumer Goods) industry.",
            "Sentiment": "positive",
            "PublishDate": 1735449566000,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLT Jaipur Approves Bikaji Foods' Amalgamation with Vindhyawasini Sales",
            "Summary": "Bikaji Foods has received approval from the National Company Law Tribunal (NCLT) Jaipur for its first motion petition regarding the amalgamation with Vindhyawasini Sales Private Limited. The order dispenses with the need for shareholder and creditor meetings for this corporate action.",
            "Sentiment": "positive",
            "PublishDate": 1733997311000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bikaji Foods: Investment Timeline Extended for US Subsidiary",
            "Summary": "Bikaji Foods International Limited has extended the timeline by three months to invest up to $500,000 in its wholly-owned US subsidiary, Bikaji Foods International USA Corp. The investment involves subscribing to 50,000 common stocks at $10 each. The US subsidiary, incorporated in July 2023, reported a turnover of $1,096,593 and a net loss of $70,130.51 for FY ending March 31, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1732178619000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bikaji Foods International Reports Strong Q2 Financial Performance",
            "Summary": "Bikaji Foods International has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 1.09 billion rupees from 890.7 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 15.63% from 14.92% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729785975000,
            "Source": "result"
        },
        {
            "Title": "Bikaji Foods International Reports Q2 Revenue Growth",
            "Summary": "Bikaji Foods International has reported a revenue of 6.96 billion rupees for the second quarter, compared to 5.97 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729785967000,
            "Source": "result"
        },
        {
            "Title": "Bikaji Foods International Reports Q2 Net Profit Increase",
            "Summary": "Bikaji Foods International has reported a net profit of 720.8 million rupees for the second quarter, showing an increase from 613 million rupees year-over-year and 605.5 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1729785959000,
            "Source": "result"
        },
        {
            "Title": "Bikaji Foods International Subsidiary to Invest in Hazelnut Factory Food Products",
            "Summary": "A subsidiary of Bikaji Foods International plans to invest 1.31 billion rupees in Hazelnut Factory Food Products. The subsidiary will acquire a 53.02% stake in the company, which operates in the Food and Beverage (F&B) industry.",
            "Sentiment": "positive",
            "PublishDate": 1729079037000,
            "Source": "corporate_action"
        }
    ]
}