{
    "Symbol": "BIL",
    "ISIN": "INE828A01016",
    "News": [
        {
            "Title": "Bhartiya International Q3FY26 Results Show Strong Growth",
            "Summary": "Bhartiya International Limited reported robust Q3FY26 performance with standalone revenue rising 33.2% YoY to ₹312.67 crores and net profit surging 183.5% to ₹6.68 crores, driven by improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1770804481821,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bhartiya International Sets Up UK Step-Down Subsidiary",
            "Summary": "Bhartiya International's wholly owned subsidiary Ultima SA approves incorporation of new UK subsidiary with initial investment of GBP 50,000 to support textile business operations in United Kingdom.",
            "Sentiment": "positive",
            "PublishDate": 1768477507404,
            "Source": "co_actions_results"
        },
        {
            "Title": "Snehdeep Aggarwal Completes SEBI Disclosure for Share Transfer",
            "Summary": "Snehdeep Aggarwal submitted mandatory SEBI disclosure under Regulation 10(7) for acquiring 50,000 equity shares of Bhartiya International through inter-se transfer from HUF on December 19, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766389337726,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bhartiya International Reports 32.6% Revenue Growth in Q2 FY26",
            "Summary": "Bhartiya International Limited announced its quarterly results for the quarter and half year ended September 30, 2025. The company's fashion business segment showed strong performance with revenue growing 32.6% year-on-year to Rs 390.4 crore in Q2 FY26 compared to Rs 295.9 crore in Q2 FY25. For the half year, revenue reached Rs 679.4 crore, up 29.36% from Rs 525.2 crore in the previous year. Profit After Tax increased to Rs 21.4 crore for H1 FY26 from Rs 13.8 crore in H1 FY25, representing a 55.03% jump. On a standalone basis, the company reported revenue of Rs 328.54 crore for Q2 FY26. The company operates in fashion apparels and accessories including intermediaries as a single business segment. All 12,01,000 warrants issued to promoter group company Urbanac Projects Private Limited have been fully converted into equity shares. The company has entered into an agreement to sell its Bengaluru property for Rs 3,100 lakhs and is relocating its manufacturing operations.",
            "Sentiment": "positive",
            "PublishDate": 1762420148928,
            "Source": "earnings"
        },
        {
            "Title": "Bhartiya International Reports 29% Jump in Q2 Net Profit to 99M Rupees",
            "Summary": "Bhartiya International reported Q2 consolidated net profit of 99 million rupees, up from 77 million rupees in the same period last year. Revenue increased to 3.99 billion rupees from 2.95 billion rupees year-over-year. EBITDA rose to 401 million rupees from 329 million rupees, though EBITDA margin declined to 10% from 11.11% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762416395553,
            "Source": "earnings"
        },
        {
            "Title": "Bhartiya International Limited Reports Q1 FY2026 Financial Results",
            "Summary": "Bhartiya International Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs. 18,658.99 lacs compared to Rs. 24,470.43 lacs in the same quarter last year. Profit after tax stood at Rs. 487.74 lacs versus Rs. 925.54 lacs in the previous year quarter. On a consolidated basis, revenue from operations was Rs. 27,996.15 lacs compared to Rs. 22,924.20 lacs in the corresponding quarter. Consolidated profit after tax was Rs. 558.29 lacs against a loss of Rs. 542.83 lacs in the same period last year. The company operates in fashion apparels and accessories segment. Basic earnings per share on standalone basis was Rs. 3.99 compared to Rs. 7.82 in the previous year quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1755081332402,
            "Source": "earnings"
        },
        {
            "Title": "Bhartiya International Reports Strong Q4 Financial Performance",
            "Summary": "Bhartiya International has reported significant year-over-year improvements in its Q4 financial results. The company's EBITDA increased to 334.6 million rupees from 144.4 million rupees in the previous year. The EBITDA margin improved to 13.88% from 8.04%. Revenue grew to 2.4 billion rupees from 1.8 billion rupees. Consolidated net profit rose substantially to 149.2 million rupees from 14.2 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1748530052000,
            "Source": "result"
        }
    ]
}