{
    "Symbol": "BILVYAPAR",
    "ISIN": "INE071A01013",
    "News": [
        {
            "Title": "BIL Vyapar Invites EOI for Insolvency Resolution",
            "Summary": "BIL Vyapar Limited (formerly Binani Industries) published Form G inviting expressions of interest for Corporate Insolvency Resolution Process. EOI deadline set for February 2, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770890456631,
            "Source": "co_actions_results"
        },
        {
            "Title": "BILVyapar Limited Enters Corporate Insolvency Resolution Process",
            "Summary": "The National Company Law Tribunal ordered the commencement of corporate insolvency resolution process for BILVyapar Limited (formerly Binani Industries Limited) on November 13, 2025, with CA Subodh Kumar Agrawal appointed as Interim Resolution Professional. Creditors are required to submit their claims with proof by December 5, 2025, with the insolvency resolution process estimated to close by May 11, 2026.",
            "Sentiment": "negative",
            "PublishDate": 1764338239583,
            "Source": "corporate_action"
        },
        {
            "Title": "BIL Vyapar Reports Rs 150 Lakh Loss for Half-Year, Financial Results Prepared on Liquidation Basis",
            "Summary": "BIL Vyapar Limited (formerly Binani Industries Limited) reported a net loss of Rs 150.24 lakh for the half-year ended September 30, 2025, compared to a profit of Rs 681.19 lakh in the previous year. The company's accumulated losses reached Rs 21,913.07 lakh, fully eroding its paid-up equity capital of Rs 3,138 lakh. Total liabilities exceeded assets by Rs 18,774.58 lakh. Due to the absence of a business plan despite operational support commitment from promoter Triton Trading Company Private Limited, the financial results have been prepared on liquidation basis rather than going concern assumption. The company faces ongoing legal proceedings with Punjab National Bank at NCLT Kolkata regarding recovery of outstanding dues, with the matter reserved for order following a hearing on September 15, 2025. The company maintains provisions of Rs 2,149 lakh for loss allowances related to corporate guarantees and letters of comfort given to former subsidiaries.",
            "Sentiment": "negative",
            "PublishDate": 1762932550440,
            "Source": "earnings"
        },
        {
            "Title": "BIL Vyapar Limited Company Secretary Ms. Santwana Todi Resigns",
            "Summary": "Ms. Santwana Todi has resigned from her position as Company Secretary Cum Compliance Officer and Key Managerial Personnel of BIL Vyapar Limited, effective from the closing of business hours on October 15, 2025. The company disclosed this information to BSE, NSE, and Calcutta Stock Exchange under regulatory requirements. BIL Vyapar Limited was formerly known as Binani Industries Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1760523703319,
            "Source": "corporate_governance"
        },
        {
            "Title": "BIL Vyapar Limited Reports Rs 69.69 Lakh Loss in Q1 FY2025, Re-appoints Statutory Auditors",
            "Summary": "BIL Vyapar Limited (formerly Binani Industries Limited) reported a net loss of Rs 69.69 lakh for the quarter ended June 30, 2025, compared to Rs 42.43 lakh loss in the previous quarter. The company's total income declined to Rs 0.03 lakh from Rs 2.48 lakh in the prior quarter. The company's accumulated losses reached Rs 21,832.51 lakh, fully eroding its paid-up equity capital of Rs 3,138.49 lakh. Liabilities exceeded total assets by Rs 18,694.02 lakh. The Board approved re-appointment of M/s. V.P. Thacker & Co. as statutory auditors for a second 5-year term. The financial results are prepared on liquidation basis due to the company's financial condition, with promoter Triton Trading Company Private Limited committed to providing operational support. The company faces ongoing legal proceedings with Punjab National Bank at NCLT Kolkata scheduled for September 15, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1754658110531,
            "Source": "earnings"
        }
    ]
}