{
    "Symbol": "BIOCON",
    "ISIN": "INE376G01013",
    "News": [
        {
            "Title": "Fitch Upgrades Biocon Biologics Outlook to Positive",
            "Summary": "Fitch Ratings has revised Biocon Biologics' outlook to positive while maintaining its Issuer Default Rating at 'BB-', signaling improved credit prospects for the biotechnology company.",
            "Sentiment": "positive",
            "PublishDate": 1770362299109,
            "Source": "stocks"
        },
        {
            "Title": "Biocon Sets Record Date for Commercial Paper Buyback",
            "Summary": "Biocon Limited announces January 29, 2026 as record date for buyback of Rs. 1,800 crore commercial paper maturing January 30, 2026. Paper listed on NSE under ISIN INE376G14040.",
            "Sentiment": "neutral",
            "PublishDate": 1769611941479,
            "Source": "co_actions_results"
        },
        {
            "Title": "Biocon Gets VAI Status from US FDA for API Facility",
            "Summary": "Biocon Limited receives Voluntary Action Indicated status from US FDA for its API facility in Andhra Pradesh following inspection conducted between November 3rd and 7th, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769608558592,
            "Source": "stocks"
        },
        {
            "Title": "S&P Upgrades Biocon Biologics Rating to 'BB+' Stable",
            "Summary": "S&P Global Ratings upgraded Biocon Biologics' credit rating to 'BB+' from 'BB' with stable outlook following equity issuance to settle US$1 billion CCPS with Viatris Inc.",
            "Sentiment": "positive",
            "PublishDate": 1769570296177,
            "Source": "stocks"
        },
        {
            "Title": "SBI MF raises Biocon stake to 7.04% with ₹334cr buy",
            "Summary": "SBI Mutual Fund increased its shareholding in Biocon Ltd to 7.0379% from 5.3445% through acquisition of 3.35 crore shares worth approximately ₹334 crores on January 16, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768884327424,
            "Source": "co_actions_results"
        },
        {
            "Title": "Biocon Completes ₹4,150 Cr QIP, SBI & ICICI Get Major Stakes",
            "Summary": "Biocon completed ₹4,150 crore QIP at ₹368.35 per share with SBI and ICICI Prudential MF receiving 29.51% each. Proceeds will fund Biocon Biologics acquisition from Mylan Inc.",
            "Sentiment": "positive",
            "PublishDate": 1768416151503,
            "Source": "co_actions_results"
        },
        {
            "Title": "Biocon Completes ₹41,500 Cr QIP Issue at ₹368.35/Share",
            "Summary": "Biocon Limited successfully allotted 11.27 crore equity shares through QIP to qualified institutional buyers, raising ₹41,500 crores with major participation from SBI and ICICI Prudential funds.",
            "Sentiment": "positive",
            "PublishDate": 1768415718379,
            "Source": "co_actions_results"
        },
        {
            "Title": "Biocon Fund Raising Committee Approves QIP Document",
            "Summary": "Biocon Limited's Fund Raising Committee approved the Placement Document for its Qualified Institutions Placement of ₹5 face value equity shares on January 14, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768410694218,
            "Source": "co_actions_results"
        },
        {
            "Title": "Biocon Completes ₹4,151 Cr QIP at ₹368.35/Share",
            "Summary": "Biocon Limited successfully closed its Qualified Institutions Placement, allotting 11.27 crore equity shares at ₹368.35 per share, raising approximately ₹4,151 crores from qualified institutional buyers.",
            "Sentiment": "positive",
            "PublishDate": 1768409375265,
            "Source": "co_actions_results"
        },
        {
            "Title": "Biocon schedules Q3FY26 earnings call for Feb 13",
            "Summary": "Biocon Limited announces board meeting on February 12, 2026 to approve Q3FY26 financial results, followed by earnings conference call for analysts and investors on February 13, 2026 at 09:00 hrs IST.",
            "Sentiment": "neutral",
            "PublishDate": 1768304381168,
            "Source": "co_actions_results"
        },
        {
            "Title": "Biocon QIP to ease debt; metals, PSU banks favoured",
            "Summary": "Market expert Nischal Maheshwari views Biocon's equity raise positively amid ₹5,000 crore debt concerns, while highlighting opportunities in metals, PSU banks, and power sector following recent corrections.",
            "Sentiment": "positive",
            "PublishDate": 1768295529995,
            "Source": "stocks"
        },
        {
            "Title": "Biocon Opens ₹4,500 Cr QIP for Biologics Integration",
            "Summary": "Biocon launches qualified institutional placement at ₹387.74 floor price to fund acquisition of Mylan's stake in Biocon Biologics for $815 million, aiming to complete integration by March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768225563023,
            "Source": "co_actions_results"
        },
        {
            "Title": "Biocon Launches ₹4,500 Cr QIP to Raise Capital",
            "Summary": "Biocon has initiated its Qualified Institutional Placement on January 12, 2026, following board and shareholder approvals received last month to raise ₹4,500 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768222106699,
            "Source": "co_actions_results"
        },
        {
            "Title": "Biocon launches ₹4,150-crore QIP at ₹387.74 floor price",
            "Summary": "Biocon Limited opens qualified institutional placement with floor price of ₹387.74 per share, offering up to 5% discount. Stock trades below floor price amid fundraising initiative.",
            "Sentiment": "neutral",
            "PublishDate": 1768221877169,
            "Source": "co_actions_results"
        },
        {
            "Title": "Biocon Sets Floor Price at ₹387.74 Per Share",
            "Summary": "Biocon has announced a floor price of ₹387.74 per share for its upcoming equity transaction, establishing a minimum valuation threshold for the pharmaceutical company's shares.",
            "Sentiment": "neutral",
            "PublishDate": 1768221528218,
            "Source": "co_actions_results"
        },
        {
            "Title": "Biocon Opens QIP at ₹387.74 Floor Price",
            "Summary": "Biocon Limited launches Qualified Institutions Placement with floor price of ₹387.74 per share, approved by Fund Raising Committee on January 12, 2026, following board and shareholder approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1768217871214,
            "Source": "co_actions_results"
        },
        {
            "Title": "Biocon Gets USFDA Approval for Everolimus Tablets",
            "Summary": "Biocon receives US FDA approval for Everolimus tablets in 2mg, 3mg, and 5mg strengths for treating Tuberous Sclerosis Complex and SEGAs, expanding its oncology portfolio in the American market.",
            "Sentiment": "positive",
            "PublishDate": 1768187974692,
            "Source": "stocks"
        },
        {
            "Title": "Biocon Gets U.S. FDA Nod for Everolimus Tablets",
            "Summary": "Biocon's subsidiary Biocon Pharma Limited receives U.S. FDA approval for Everolimus Tablets for Oral Suspension in three strengths, used to treat Tuberous Sclerosis Complex conditions.",
            "Sentiment": "positive",
            "PublishDate": 1768187950755,
            "Source": "stocks"
        },
        {
            "Title": "Biocon Chief Opposes Andhra's 75% Local Job Quota",
            "Summary": "Kiran Mazumdar-Shaw criticizes Andhra Pradesh's mandate reserving 75% private sector jobs for locals, calling it detrimental to businesses and advocating for skill-based hiring over regional quotas.",
            "Sentiment": "negative",
            "PublishDate": 1767874202944,
            "Source": "stocks"
        },
        {
            "Title": "Biocon Biologics Expands Biosimilar Oncology Portfolio",
            "Summary": "Biocon Biologics announces three new oncology biosimilars including Trastuzumab/Hyaluronidase, Nivolumab, and Pembrolizumab, representing over $75 billion market opportunity at J.P. Morgan Healthcare Conference.",
            "Sentiment": "positive",
            "PublishDate": 1767702394319,
            "Source": "stocks"
        },
        {
            "Title": "Biocon Issues ₹2,000 Crore Commercial Papers",
            "Summary": "Biocon has issued commercial papers worth ₹2,000 crores to meet its short-term funding requirements and support business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1767356461371,
            "Source": "stocks"
        },
        {
            "Title": "Biocon Issues ₹200 Cr Commercial Papers at 6.80%",
            "Summary": "Biocon Limited has issued Commercial Papers worth ₹200 crores on private placement basis with 60-day tenure at 6.80% interest rate, allotted to Kotak Mahindra funds.",
            "Sentiment": "neutral",
            "PublishDate": 1767353502768,
            "Source": "co_actions_results"
        },
        {
            "Title": "Biocon Partners With Ajanta for Semaglutide Marketing",
            "Summary": "Biocon has entered into a strategic partnership with Ajanta Pharma to market semaglutide across 26 international markets, expanding its diabetes treatment portfolio globally.",
            "Sentiment": "positive",
            "PublishDate": 1766492859721,
            "Source": "stocks"
        },
        {
            "Title": "Biocon Biologics Secures Full Global Rights to Adalimumab",
            "Summary": "Biocon Biologics acquires complete global rights for biosimilar adalimumab from FKB, gaining end-to-end manufacturing and commercialization control with technology transfer and regulatory approvals pending.",
            "Sentiment": "positive",
            "PublishDate": 1766462101045,
            "Source": "stocks"
        },
        {
            "Title": "Biocon Sets March 19, 2026 Record Date for Commercial Paper",
            "Summary": "Biocon Limited has declared March 19, 2026 as the record date for its ₹1,800 crore commercial paper (ISIN: INE376G14040) maturing on March 20, 2026, listed on NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1766413279357,
            "Source": "stocks"
        },
        {
            "Title": "Biocon Gets EIR With VAI Status From U.S. FDA",
            "Summary": "Biocon receives Establishment Inspection Report with Voluntary Action Indicated status from U.S. FDA for its New Jersey manufacturing facility following October inspection.",
            "Sentiment": "neutral",
            "PublishDate": 1766060775773,
            "Source": "stocks"
        },
        {
            "Title": "Biocon Biologics Named Asia IP Elite 2025 by IAM",
            "Summary": "Biocon Biologics receives prestigious Asia IP Elite recognition from IAM for ninth consecutive year, highlighting exceptional intellectual property value creation and global biosimilars leadership.",
            "Sentiment": "positive",
            "PublishDate": 1765939548168,
            "Source": "stocks"
        },
        {
            "Title": "Biocon Gets Credit Rating Reaffirmation from CRISIL",
            "Summary": "CRISIL reaffirms Biocon's credit ratings with AA/Stable for long-term and A1+ for short-term on ₹250 crore bank facilities, maintaining strong creditworthiness profile.",
            "Sentiment": "positive",
            "PublishDate": 1765896577555,
            "Source": "stocks"
        },
        {
            "Title": "Biocon Launches GLP-1 Drug Liraglutide in Netherlands",
            "Summary": "Biocon Limited announces the launch of its GLP-1 peptide Liraglutide for diabetes and obesity treatment in the Netherlands through distribution partner Pharmamedicb B.V., marking its first EU launch under own brand after MEB approval.",
            "Sentiment": "positive",
            "PublishDate": 1765768315327,
            "Source": "stocks"
        },
        {
            "Title": "Biocon Signs Global Biosimilar Aflibercept Deal",
            "Summary": "Biocon Biologics secures settlement and license agreement with Regeneron and Bayer for worldwide commercialization of biosimilar aflibercept YESAFILI, enabling UK launch in January 2026 and global rollout by March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1765614026744,
            "Source": "stocks"
        },
        {
            "Title": "S&P Places Biocon Biologics on Positive Credit Watch",
            "Summary": "S&P Global Ratings places Biocon Biologics on positive credit watch following accelerated debt reduction plans. Company's adjusted debt expected to fall to ₹120 billion by March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1765440055407,
            "Source": "stocks"
        },
        {
            "Title": "Biocon Receives Credit Rating Actions from India Ratings on Multiple Debt Instruments",
            "Summary": "India Ratings assigned INR AA-/Stable rating to Biocon's INR 5,500 million bank loan facilities and IND A1+ rating to INR 8,000 million proposed commercial paper, while affirming existing ratings on other facilities. The rating agency withdrew ratings on INR 10,700 million non-convertible debentures after full payment and receipt of no-dues certificate from the lender.",
            "Sentiment": "positive",
            "PublishDate": 1765353248699,
            "Source": "corporate_action"
        },
        {
            "Title": "Biocon to Acquire Minority Stake in Biocon Biologics for $773 Million to Create Fully Integrated Biopharma Entity",
            "Summary": "Biocon Limited announced acquisition of 23.3% minority stake in Biocon Biologics from investors including Viatris, Serum Institute, and others through share swap and $400 million cash consideration, making it a wholly-owned subsidiary. The consolidation aims to create a simplified corporate structure with operational synergies across biosimilars, insulins, peptides and generics portfolio, targeting completion by Q4 FY2026 subject to regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1765291206753,
            "Source": "corporate_action"
        },
        {
            "Title": "Biocon Receives Tentative FDA Approval for Parkinson's Disease Treatment",
            "Summary": "Biocon received tentative FDA approval for its ANDA of Carbidopa and Levodopa extended-release capsules used to treat Parkinson's disease and related conditions. This regulatory milestone positions the company to enter the market for this neurological treatment once final approval is obtained.",
            "Sentiment": "positive",
            "PublishDate": 1765151593400,
            "Source": "stock"
        },
        {
            "Title": "Biocon Calls EGM to Acquire Minority Stakes in Biologics Unit Through Share Swap and Cash Deal",
            "Summary": "Biocon Limited has convened an EGM on December 31, 2025, to approve acquisition of minority stakes in Biocon Biologics from investors including Mylan Inc., Serum Institute, and others through preferential allotment of 17.13 crore equity shares and USD 400 million cash consideration. The transaction aims to fully integrate the biosimilars business by making BBL a wholly-owned subsidiary, requiring shareholder approval for increased authorized capital, investment limits, and fund raising of up to Rs 4,500 crores.",
            "Sentiment": "positive",
            "PublishDate": 1765097547868,
            "Source": "corporate_action"
        },
        {
            "Title": "Biocon Receives Tentative FDA Approval for Parkinson's Disease Treatment",
            "Summary": "Biocon has received tentative FDA approval for Carbidopa and Levodopa Extended-Release Capsules used to treat Parkinson's disease. This regulatory milestone positions the pharmaceutical company to potentially enter the U.S. market for this neurological treatment once final approval is granted.",
            "Sentiment": "positive",
            "PublishDate": 1764939395851,
            "Source": "stock"
        },
        {
            "Title": "Biocon Plans Fundraising and Investment in Biocon Biologics on December 6",
            "Summary": "Biocon will explore raising funds through commercial paper or share issuance on December 6. The company also plans to invest in Biocon Biologics by purchasing securities from existing shareholders on the same date.",
            "Sentiment": "neutral",
            "PublishDate": 1764817730958,
            "Source": "stock"
        },
        {
            "Title": "Biocon Biologics Secures European Market Entry for Denosumab Biosimilars Through Amgen Settlement",
            "Summary": "Biocon Biologics announced a settlement agreement with Amgen Inc. allowing commercialization of its Denosumab biosimilars Vevzuo and Evfraxy in Europe starting December 2, 2025. The agreement expands the company's global reach in oncology and bone health therapeutics following its previous U.S. settlement in October, enabling broader access to affordable biologics across international markets.",
            "Sentiment": "positive",
            "PublishDate": 1764647260946,
            "Source": "stock"
        },
        {
            "Title": "Biocon Biologics' Bengaluru Drug Substance Facility Receives VAI Classification from US FDA",
            "Summary": "The US FDA classified Biocon Biologics' drug substance facility in Bengaluru as Voluntary Action Indicated (VAI) following an inspection conducted between August 26 to September 3, 2025. The classification relates to the facility's manufacture and supply of Human Recombinant Insulin and Biosimilar Pegfilgrastim Drug Substance to the United States.",
            "Sentiment": "negative",
            "PublishDate": 1764212573372,
            "Source": "stock"
        },
        {
            "Title": "Biocon Receives USFDA Approval for Tofacitinib Extended-Release Tablets",
            "Summary": "Biocon received USFDA final approval for 11mg strength and tentative approval for 22mg strength of Tofacitinib extended-release tablets used for treating rheumatoid arthritis and other conditions. The regulatory approvals enable Biocon to market these pharmaceutical products in the US market, expanding its treatment options for patients with rheumatoid arthritis.",
            "Sentiment": "positive",
            "PublishDate": 1763523738453,
            "Source": "stock"
        },
        {
            "Title": "Biocon Reports Strong Q2 FY26 Results with 20% Revenue Growth Led by Biosimilars Performance",
            "Summary": "Biocon Limited delivered 20% year-on-year growth in operating revenue to INR 4,296 crores for Q2 FY26, driven by 25% growth in biosimilars, 24% growth in generics, and 2% growth in CRDMO business. The company strengthened its balance sheet by settling structured debt obligations with Goldman Sachs and Kotak from QIP proceeds, expecting annual savings of around INR 300 crores in interest costs from FY27.",
            "Sentiment": "positive",
            "PublishDate": 1763466717264,
            "Source": "earnings"
        },
        {
            "Title": "Biocon Clarifies Media Reports on Biocon Biologics Merger Evaluation",
            "Summary": "Biocon Limited addressed media reports regarding potential merger of its unlisted subsidiary Biocon Biologics Limited, confirming that a Board-constituted committee is still evaluating strategic restructuring options including merger, IPO and share swap possibilities. The company stated no material event requiring disclosure exists at this stage, reiterating its commitment to make appropriate disclosures when required under applicable laws.",
            "Sentiment": "neutral",
            "PublishDate": 1763090248637,
            "Source": "stock"
        },
        {
            "Title": "Biocon Shares Hit 52-Week High on $4.5 Billion Biologics Merger and IPO Review",
            "Summary": "Biocon shares jumped 2.6% to a new 52-week high of Rs 416.85 following reports that the company is evaluating an internal merger of its biosimilars arm, Biocon Biologics, with the parent entity. The potential $4.5 billion transaction is being reviewed alongside alternative options including an IPO and share swap with minority investors. Biocon is restructuring its wholly owned subsidiary to unlock shareholder value and reduce acquisition-related debt of $1.2 billion from the 2022 acquisition of Viatris' global biosimilars business for $3.3 billion. Chairperson Kiran Mazumdar-Shaw confirmed the company is exploring all value creation routes and has appointed Morgan Stanley to identify the best alternative. Biocon owns a 90.2% stake in Biocon Biologics, with Serum Institute of Life Sciences holding 5.97%. The IPO route has been deprioritized due to market volatility, with the board now examining a merger as a more viable alternative.",
            "Sentiment": "positive",
            "PublishDate": 1763012097503,
            "Source": "stock"
        },
        {
            "Title": "SBI Mutual Fund Crosses 5% Stake in Biocon with Market Purchase",
            "Summary": "SBI Mutual Fund acquired 3,70,150 shares of Biocon on November 11, 2025, through market purchase, increasing its total holding to 6,68,65,887 shares representing 5.0013% of the company's paid-up share capital. Prior to this acquisition, SBI Mutual Fund held 6,64,95,737 shares (4.9736% stake) in Biocon. The acquisition pushed the fund's holding above the 5% threshold, triggering disclosure requirements. Biocon's total equity share capital consists of 1,33,69,63,635 equity shares with a face value of Rs. 5 each.",
            "Sentiment": "neutral",
            "PublishDate": 1763009427043,
            "Source": "stock"
        },
        {
            "Title": "Biocon Management Projects 40% Margins for October-March Period",
            "Summary": "Biocon's management has indicated expectations of approximately 40% margins during the October to March timeframe. This guidance was shared during a conference call with stakeholders.",
            "Sentiment": "positive",
            "PublishDate": 1762920740281,
            "Source": "stock"
        },
        {
            "Title": "Biocon Reports Quarterly Results, Approves Rs 500 Crore NCD Redemption and Rs 300 Crore CCD Acquisition",
            "Summary": "Biocon Limited's Board approved unaudited financial results for the quarter and half-year ended September 30, 2025. The company announced early full redemption of 50,000 Non-Convertible Debentures worth Rs 500 crores issued in May 2023, to be completed by January 31, 2026. Additionally, Biocon will acquire 1,06,86,044 Compulsorily Convertible Debentures of subsidiary Biocon Biologics Limited from Edelweiss entities for Rs 300 crores by January 30, 2026, which will increase the company's holding in BBL by 65 basis points. The Board also approved issuance of Commercial Papers up to Rs 550 crores on private placement basis. The Board meeting was held on November 11, 2025, from 4:30 PM to 5:45 PM.",
            "Sentiment": "neutral",
            "PublishDate": 1762913684794,
            "Source": "earnings"
        },
        {
            "Title": "Biocon Reports Strong Q2 Results with Net Profit Rising to 1.3B Rupees, Plans 3B Rupees Acquisition",
            "Summary": "Biocon reported consolidated net profit of 1.3 billion rupees for Q2, significantly higher than 271 million rupees in the same period last year and above analyst estimates of 750 million rupees. Revenue reached 42.95 billion rupees compared to 35.9 billion rupees year-over-year, exceeding estimates of 41.5 billion rupees. The company's EBITDA stood at 8.35 billion rupees versus 6.85 billion rupees last year, slightly below estimates of 8.40 billion rupees. EBITDA margin improved to 19.45% from 19.09% year-over-year, though it fell short of the estimated 21%. Additionally, Biocon announced plans to acquire CCDS of Biocon Biologics for 3 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1762874141802,
            "Source": "earnings"
        },
        {
            "Title": "Biocon's Visakhapatnam API Facility Receives Two Observations from US FDA Inspection",
            "Summary": "The US FDA conducted a GMP surveillance inspection of Biocon's API facility (Site 6) in Visakhapatnam, Andhra Pradesh, from November 3-7, 2025. The inspection resulted in two observations that the company will address within the stipulated timeframe. Biocon stated it does not foresee any impact on business operations from these findings.",
            "Sentiment": "neutral",
            "PublishDate": 1762605917132,
            "Source": "stock"
        },
        {
            "Title": "Biocon Limited Receives Credit Rating Reaffirmation from ICRA",
            "Summary": "Biocon Limited received a rating reaffirmation from ICRA Limited for its long-term/short-term unallocated facilities worth Rs. 450 crores, maintaining ICRA [AA] (Stable)/[ICRA] A1+ ratings. The reaffirmation considers Biocon's diversified business model across biosimilars, generics, and research services, with vertical integration and global footprint. ICRA expects the company's credit profile to continue improving over the near-to-medium term. Biocon Biologics Limited (BBL), the largest revenue contributor, has received approval for 11 biosimilars across regulated and emerging markets and plans to launch five more biosimilars. The company reported 10.6% revenue growth in the latest results, with operating profit margin improving to 26.8% from 22.6% in the previous year, partly due to a one-time gain of Rs. 1,057 crores from selling its branded formulations segment to Eris Lifesciences. BBL refinanced borrowings through senior secured notes worth $800 million and a syndicated term loan of $320 million. Biocon raised Rs. 4,500 crores through equity via Qualified Institutional Placement in June, which was used to retire structured debt and improve leverage metrics. The company's consolidated adjusted net debt/OPBDITA improved to 2.6 times from 3.5 times. ICRA maintains a stable outlook reflecting expectations that Biocon will sustain operating metrics and continue deleveraging efforts.",
            "Sentiment": "positive",
            "PublishDate": 1761853288397,
            "Source": "corporate_action"
        },
        {
            "Title": "Biocon Subsidiary to Become Public Company with Name Change",
            "Summary": "Biocon's subsidiary will change its name and convert to a public company status, with the changes taking effect on October 29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761820001963,
            "Source": "corporate_action"
        }
    ]
}