{
    "Symbol": "BIOFILCHEM",
    "ISIN": "INE829A01014",
    "News": [
        {
            "Title": "Biofil Chemicals and Pharmaceuticals Pays Rs 4.24 Lakh Fine to BSE Under Protest",
            "Summary": "Biofil Chemicals and Pharmaceuticals Limited paid a fine of Rs 4,24,823.60 to BSE Limited for alleged non-compliance with Regulation 17(1)(c) of listing regulations. The company had filed waiver applications with both NSE and BSE but received fines of Rs 95,000 and Rs 2,65,000 from BSE, stating there is no material impact on its financial or operational activities.",
            "Sentiment": "negative",
            "PublishDate": 1764771631964,
            "Source": "corporate_governance"
        },
        {
            "Title": "Biofil Chemicals and Pharmaceuticals Pays Rs 4.24 Lakh Fine to NSE Under Protest",
            "Summary": "Biofil Chemicals and Pharmaceuticals Limited paid a fine of Rs 4,24,823.60 to NSE after its waiver application for non-compliance under Regulation 17(1)(c) of listing regulations was rejected. The company states there is no material impact on its financial, operational or other activities from this regulatory action.",
            "Sentiment": "negative",
            "PublishDate": 1764165171562,
            "Source": "corporate_governance"
        },
        {
            "Title": "Biofil Chemicals Reports Mixed Quarterly Performance with Revenue Decline but Improved Profitability",
            "Summary": "Biofil Chemicals and Pharmaceuticals Limited reported revenue from operations of Rs 199.73 lakhs for the quarter ended September 30, 2025, down from Rs 334.02 lakhs in the previous year, while achieving a net profit of Rs 241.10 lakhs compared to a loss of Rs 55.78 lakhs in the same period last year. The company's board approved the unaudited financial results for the quarter and half-year ended September 30, 2025, showing improved profitability despite lower operational revenue across its pharma and chemicals divisions.",
            "Sentiment": "neutral",
            "PublishDate": 1763068598369,
            "Source": "earnings"
        },
        {
            "Title": "Biofil Chemicals Shareholders Approve Sale of Industrial Land Leasehold Rights",
            "Summary": "Biofil Chemicals and Pharmaceuticals Limited received shareholder approval through postal ballot for the sale, transfer, or disposal of leasehold rights for a vacant portion of industrial land measuring 80,156 square meters at Pithampur, Madhya Pradesh. The special resolution was passed with 99.93% votes in favor, with 8,974,224 votes supporting and 6,503 votes against. The e-voting process was conducted from August 15 to September 13, 2025, with L.N. Joshi serving as scrutinizer. Out of 25,845 total shareholders, postal ballot notices were sent to 23,017 members via email. The resolution allows the company to dispose of leasehold rights for the vacant industrial land located at Plot No. 8, Sector-3, Kheda Industrial Estate, Pithampur, District Dhar, Madhya Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1757939430034,
            "Source": "corporate_action"
        },
        {
            "Title": "Biofil Chemicals Appoints Smitesh Shah as Additional Promoter Director",
            "Summary": "Biofil Chemicals & Pharmaceuticals Limited appointed Mr. Smitesh Shah as an Additional Director in the category of Promoter Non-Executive Non Independent Director, effective August 23rd, 2025. The appointment is subject to shareholder approval at the upcoming 40th Annual General Meeting. Shah, aged 65, holds a B.Sc degree and has 45 years of experience in the pharmaceuticals industry. He is the uncle of Ketan Shah, the company's Chairman and Managing Director. The appointment was made upon recommendations of the Nomination and Remuneration Committee. Shah will hold office until the ensuing AGM or within three months from the appointment date, whichever is earlier. He currently holds directorships in 6 other companies.",
            "Sentiment": "neutral",
            "PublishDate": 1755954380474,
            "Source": "corporate_governance"
        },
        {
            "Title": "Biofil Chemicals Reports Q1 FY26 Financial Results; Multiple Companies Announce Quarterly Earnings",
            "Summary": "Biofil Chemicals and Pharmaceuticals Limited published its unaudited financial results for the quarter ended June 30, 2025, with board approval on August 12, 2025. The results were published in newspapers on August 14, 2025, including Free Press Mumbai & Indore and Choutha Sansar. Several other companies also reported quarterly results: Deutsche Investments India Private Limited, Ironwood Education Limited announced its 2nd Annual General Meeting scheduled for September via video conferencing, Empire Industries Limited reported total income from operations and various profit/loss figures, Grand Foundry Limited showed a net loss of Rs 14.69 lakhs for the quarter, and Daikaffil Chemicals India Limited published its quarterly financial results. The companies' results include various financial metrics such as total income from operations, net profit/loss figures, equity share capital, and earnings per share data.",
            "Sentiment": "neutral",
            "PublishDate": 1755156515514,
            "Source": "earnings"
        },
        {
            "Title": "Biofil Chemicals Reports 1,324% Jump in Quarterly Profit, Appoints New Auditors and Directors",
            "Summary": "Biofil Chemicals & Pharmaceuticals Limited reported a net profit of ₹241.10 lakhs for the quarter ended June 30, 2025, compared to ₹16.93 lakhs in the same period last year. Revenue from operations declined to ₹643.26 lakhs from ₹844.34 lakhs year-over-year. The company's board approved the appointment of Joshi Sahay & Company as secretarial auditors for five years and re-appointed two independent directors for second terms. The board also approved changing Ketan Shah's designation from Whole-Time Director to Chairman and Managing Director for three years, and shifting the registered office within Indore. The company scheduled its 40th Annual General Meeting for September 27, 2025, via video conferencing. The significant profit increase was attributed to disposal of an undertaking after obtaining member approval.",
            "Sentiment": "positive",
            "PublishDate": 1755012659119,
            "Source": "earnings"
        },
        {
            "Title": "Biofil Chemicals Seeks Shareholder Approval for Rs 16 Crore Land Rights Sale in Pithampur",
            "Summary": "Biofil Chemicals and Pharmaceuticals Limited has issued a postal ballot notice seeking shareholder approval through special resolution to sell leasehold rights for approximately 80,156 square meters of vacant industrial land at Plot No. 8, Sector-3, Kheda Industrial Estate, Pithampur, Madhya Pradesh. The company proposes to dispose of these rights for a minimum consideration of Rs 16 crores, subject to approval from Madhya Pradesh Industrial Development Corporation (MPIDC). The land represents a portion of the total 1,06,875 square meters held by the company, with about 94,463 square meters remaining vacant and unutilized due to operational constraints and regulatory delays. MPIDC has taken paper possession of the vacant portion, and the company has filed a writ petition in Madhya Pradesh High Court, which granted interim relief. The company plans to use proceeds for clearing pending dues to MPIDC (Rs 400 lakhs), renovating operational units (Rs 550 lakhs), working capital requirements (Rs 475 lakhs), and general expenses (Rs 175 lakhs). The electronic voting period runs from August 15, 2025 to September 13, 2025, with results to be announced by September 15, 2025. Mr. L.N. Joshi has been appointed as scrutinizer for the postal ballot process.",
            "Sentiment": "neutral",
            "PublishDate": 1754653145901,
            "Source": "corporate_action"
        },
        {
            "Title": "Biofil Chemicals And Pharma Plans to Sell Industrial Land for Minimum ₹160 Million",
            "Summary": "Biofil Chemicals And Pharma announced plans to sell 80,156 square meters of industrial land. The company has set a minimum selling price of ₹160 million for the property.",
            "Sentiment": "neutral",
            "PublishDate": 1754314698446,
            "Source": "stock"
        },
        {
            "Title": "Biofil Chemicals Board Approves Sale of Industrial Land in Pithampur for Rs 16 Crores",
            "Summary": "Biofil Chemicals and Pharmaceuticals Limited's Board of Directors approved a proposal to sell, transfer or dispose leasehold rights of an industrial land plot measuring approximately 80,156 square meters located at Plot No. 8, Sector-3, Kheda Industrial Estate, Pithampur, Dist. Dhar, Madhya Pradesh. The vacant industrial land will be sold for a consideration of at least Rs 16 crores, either in lump sum or tranches. The transaction requires approval from Madhya Pradesh Industrial Development Corporation (MPIDC) and other regulatory compliances, along with shareholder approval through postal ballot. The Board also approved the postal ballot notice and authorized the Whole Time Director to conduct the e-voting process.",
            "Sentiment": "neutral",
            "PublishDate": 1754313999113,
            "Source": "corporate_action"
        }
    ]
}