{
    "Symbol": "BIRLACORPN",
    "ISIN": "INE340A01012",
    "News": [
        {
            "Title": "Birla Corp Plans 27.6 MT Capacity by FY29",
            "Summary": "Birla Corporation outlines expansion roadmap with new grinding units in Gaya and Prayagraj, targeting 24.2 million tons capacity by FY2028 and 27.6 million tons by FY2029.",
            "Sentiment": "positive",
            "PublishDate": 1770002881443,
            "Source": "stocks"
        },
        {
            "Title": "Birla Corp Projects Fuel Cost Rise, New Line Launch",
            "Summary": "Birla Corporation anticipates fuel costs to increase slightly to INR 1.5 per 1000 kilocalorie in Q4 FY2026, while Kundanganj Line 3 is scheduled to commence operations this quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1770002708084,
            "Source": "stocks"
        },
        {
            "Title": "Birla Corporation Q3 Net Profit Surges 71% to Rs 53 Cr",
            "Summary": "Birla Corporation reported 71% jump in Q3 net profit to Rs 53 crore despite 4% revenue decline. EBITDA grew 18% to Rs 312 crore with improved cement margins at 14.8%.",
            "Sentiment": "positive",
            "PublishDate": 1769853701667,
            "Source": "co_actions_results"
        },
        {
            "Title": "Birla Corporation Wins Key Court Ruling on Articles",
            "Summary": "Calcutta High Court rejects interim applications seeking to restrain Birla Corporation from implementing amended Articles of Association, clearing path for corporate governance changes.",
            "Sentiment": "positive",
            "PublishDate": 1769163119083,
            "Source": "stocks"
        },
        {
            "Title": "Birla Corporation Board Meet Set for Jan 31, 2026",
            "Summary": "Birla Corporation Limited has scheduled a board meeting on January 31, 2026, to consider and approve Q3FY26 standalone and consolidated unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769075850406,
            "Source": "co_actions_results"
        },
        {
            "Title": "Birla Corporation Faces ₹9.67 Cr Stamp Duty Demand",
            "Summary": "Birla Corporation's subsidiary RCCPL receives orders from Collector of Stamps, Satna for ₹9.67 crore deficit stamp duty payment on mining leases. Company plans to appeal the demand orders.",
            "Sentiment": "negative",
            "PublishDate": 1769075324145,
            "Source": "stocks"
        },
        {
            "Title": "Birla Corp's limestone block bid rejected by Rajasthan",
            "Summary": "Rajasthan government rejected Birla Corporation's bid for Gourum Khan Ki Dhani limestone block despite being preferred bidder with 20.60% offer, citing lower pricing compared to similar regional auctions.",
            "Sentiment": "negative",
            "PublishDate": 1767424652793,
            "Source": "stocks"
        },
        {
            "Title": "Birla Corporation Gets ESG Score of 69.3 from SES ESG",
            "Summary": "Birla Corporation Limited receives an Environmental, Social and Governance (ESG) score of 69.3 from SES ESG Research Private Limited based on fiscal 2025 disclosures and publicly available data.",
            "Sentiment": "neutral",
            "PublishDate": 1767246256633,
            "Source": "stocks"
        },
        {
            "Title": "Birla Corporation Extends Senior Executive Term",
            "Summary": "Birla Corporation Limited extends the service term of Shri Rajeev Bhalla, President and Unit Head of Birla Jute Mills, for one year until December 31, 2026, as disclosed under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1767172153204,
            "Source": "stocks"
        },
        {
            "Title": "Birla Corporation Gets Relief in Court Cases",
            "Summary": "Indian court dismisses two civil revisional applications against Birla Corporation, providing legal relief to the cement company in ongoing litigation matters.",
            "Sentiment": "positive",
            "PublishDate": 1766714687042,
            "Source": "stocks"
        },
        {
            "Title": "Birla Corp Wins Court Case Against Civil Revision Apps",
            "Summary": "Indian court rejects two civil revision applications filed against Birla Corporation, providing legal relief to the cement manufacturer in ongoing litigation matters.",
            "Sentiment": "positive",
            "PublishDate": 1766575988904,
            "Source": "stocks"
        },
        {
            "Title": "Birla Corporation AGM Resolution No. 8 Voting Results",
            "Summary": "Birla Corporation publishes voting results for Resolution No. 8 regarding appointment of Mr. Sudeep Roy as Non-Executive Non-Independent Director following High Court order disposal.",
            "Sentiment": "neutral",
            "PublishDate": 1766072297370,
            "Source": "stocks"
        },
        {
            "Title": "Birla Corporation Gets Court Relief on AGM Injunction Order",
            "Summary": "The 16th Court of Additional District Sessions Judge stayed the September 11, 2025 injunction order that had restrained Birla Corporation from conducting voting on adoption of new Articles of Association at its 105th AGM. The stay order will remain effective until disposal of the company's appeals, allowing potential resumption of the previously adjourned AGM proceedings.",
            "Sentiment": "positive",
            "PublishDate": 1764166619100,
            "Source": "corporate_governance"
        },
        {
            "Title": "Birla Corporation Reports Q2 FY26 Results Amid Regional Price Pressures and Operational Challenges",
            "Summary": "Birla Corporation Limited held its quarterly earnings conference call discussing results for the quarter and half-year ended September 30, 2025. The company faced headwinds including subdued cement prices in the central region, heavy unseasonal rains affecting key markets, and a breakdown at its largest unit Maihar, requiring external clinker purchases worth INR 20-25 crores. Despite challenges, the company maintained profitability through its strategy of focusing on trade segment, blended cement, and premium products. EBITDA per ton stood at INR 712 for the quarter and INR 714 for the first half. The company reported lead distance of 340 kilometers, coal cost of 1.48, and expects full-year capex of around INR 800 crores. Management anticipates cement demand revival in Q3 with 4-5% volume growth and expects the second half to perform better than the first half. The Kundangunj unit is expected to commence by end of Q3 or beginning of Q4.",
            "Sentiment": "neutral",
            "PublishDate": 1763036859631,
            "Source": "earnings"
        },
        {
            "Title": "Birla Corporation Reports Mixed Quarterly Results with Profit Recovery",
            "Summary": "Birla Corporation Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company reported a consolidated net profit of ₹90.64 crores for the quarter compared to a loss of ₹95.85 crores in the previous quarter. For the half year, consolidated net profit stood at ₹25.83 crores versus a loss of ₹100.5 crores in the same period last year. On a standalone basis, the company posted a quarterly net profit of ₹53.12 crores against ₹77.87 crores in the previous quarter. Revenue from operations reached ₹1,229.40 crores for the quarter. The company operates primarily in cement and jute segments, with cement being the major contributor. The Board of Directors approved these results in their meeting held on November 7, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762530139838,
            "Source": "earnings"
        },
        {
            "Title": "Birla Corporation Reports Strong Q2 Turnaround with 905M Rupees Net Profit",
            "Summary": "Birla Corporation reported a net profit of 905 million rupees in Q2, marking a significant turnaround from a loss of 252 million rupees in the same period last year. The company's EBITDA increased to 3 billion rupees from 1.8 billion rupees year-over-year. EBITDA margin improved to 13.8% compared to 9.06% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762508888814,
            "Source": "earnings"
        },
        {
            "Title": "Birla Corp's Subsidiary Wins Two Limestone Block Bids in Telangana",
            "Summary": "RCCPL Private Ltd, Birla Corporation's wholly-owned subsidiary, won bids for two limestone blocks in Telangana's Adilabad district. The company secured the Kanpa-Junapani limestone block with a bid of 87.05% revenue share, covering 3.38 sq km with composite license for prospecting and mining. Earlier, RCCPL won the Guda-Rampur limestone and manganese block with a 57.10% revenue share bid, spanning 3.34 sq km. In quarterly results, Birla Corp reported net profit of ₹120 crore versus ₹33 crore year-over-year, revenue increased 12% to ₹2,454 crore, and EBITDA grew 34% to ₹346.6 crore with margins expanding to 14.12%. Shares closed down 1.25% at ₹1,283 on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1758721762044,
            "Source": "stock"
        },
        {
            "Title": "Birla Corporation Subsidiary Wins Kanpa-Junapani Limestone Block Auction in Telangana",
            "Summary": "RCCPL Private Limited, a wholly owned subsidiary of Birla Corporation Limited, has been declared the preferred bidder for the Kanpa-Junapani Limestone Block in Telangana. The company submitted the highest final price offer of 87.05% in the auction conducted by the Government of Telangana's Department of Mines & Geology. The limestone block is located in District Adilabad, Telangana, covering an area of 3.38 square kilometers. RCCPL will be granted a Composite License for the block based on their winning bid.",
            "Sentiment": "positive",
            "PublishDate": 1758718562794,
            "Source": "stock"
        },
        {
            "Title": "Birla Corporation Issues ₹50 Crore Commercial Paper with 90-Day Tenure at 6.20% Interest",
            "Summary": "Birla Corporation Limited has issued commercial paper worth ₹50 crores comprising 1,000 units of ₹5,00,000 each. The commercial paper carries a 90-day tenure with an interest rate of 6.20% per annum, paid upfront. The instrument was allotted on September 23, 2025, and will mature on December 22, 2025. The commercial paper is proposed to be listed on BSE Limited. No security or charge has been created over company assets for this issuance, and no special rights or privileges are attached to the instrument.",
            "Sentiment": "neutral",
            "PublishDate": 1758630839163,
            "Source": "corporate_action"
        },
        {
            "Title": "Birla Corp Subsidiary Wins Telangana Limestone Block Bid with 57.10% Offer",
            "Summary": "Birla Corporation's wholly-owned subsidiary RCCPL Private Ltd has been declared the preferred bidder for the Guda-Rampur limestone and manganese block in Telangana's Adilabad district. The company secured the 3.34 sq km block with the highest final price offer of 57.10%. The Department of Mines & Geology communicated this decision via letter dated September 20, 2025. Separately, Birla Corp re-appointed Sandip Ghose as managing director and CEO for three years starting January 1, 2026. In quarterly results, the company reported net profit of ₹120 crore versus ₹33 crore year-over-year, with revenue rising 12% to ₹2,454 crore. EBITDA increased 34% to ₹346.6 crore with margins expanding to 14.12% from 11.8%. Birla Corporation shares closed 0.62% higher at ₹1,307 on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1758551626611,
            "Source": "stock"
        },
        {
            "Title": "Birla Corporation Subsidiary Wins Telangana Limestone and Manganese Block Auction",
            "Summary": "RCCPL Private Limited, a wholly owned subsidiary of Birla Corporation Limited, has been declared the preferred bidder for the Guda-Rampur Limestone and Manganese Block in Telangana. The Government of Telangana's Department of Mines & Geology made this announcement based on RCCPL's highest final price offer of 57.10%. The block is located in District Adilabad, Telangana, covering an area of 3.34 square kilometers. RCCPL will receive a Composite License for the mining block.",
            "Sentiment": "positive",
            "PublishDate": 1758546810481,
            "Source": "stock"
        },
        {
            "Title": "Birla Corporation Completes 105th AGM with Item 5 Adjourned Due to Court Injunction",
            "Summary": "Birla Corporation Limited held its 105th Annual General Meeting on September 15, 2025, in Kolkata. The company successfully conducted voting on six agenda items, with all resolutions receiving overwhelming shareholder approval rates above 98%. Key approvals included adoption of financial statements for the year ended March 31, 2025, dividend declaration of ₹10 per share, and re-appointment of Sandip Ghose as Managing Director and CEO for three years from January 1, 2026. However, Item 5 regarding adoption of new Articles of Association was adjourned indefinitely due to a temporary injunction from the Civil Judge Court, Alipore. The meeting had 125,342 shareholders on record date, with 827 shareholders participating either in person or through proxy. All voting was conducted through e-voting and polling papers, with consolidated results submitted to stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1757961359436,
            "Source": "corporate_action"
        },
        {
            "Title": "Birla Corporation Receives Court Injunction on Articles of Association Resolution",
            "Summary": "Birla Corporation Limited received a temporary injunction order from the Civil Judge at Alipore regarding its 105th Annual General Meeting. Five shareholders filed a suit challenging the proposed resolution to adopt new Articles of Association under special business. The court order restrains the company from conducting polls, remote e-voting, and publishing results for this specific resolution. The company states no violation occurred and that the proposal complies with the Companies Act, 2013. Birla Corporation has filed an appeal with the District Judge and is taking appropriate legal steps. The company reports no financial or operational impact from this order.",
            "Sentiment": "negative",
            "PublishDate": 1757684946025,
            "Source": "corporate_governance"
        },
        {
            "Title": "Birla Corporation Revises Dividend Record Date to September 9, 2025 Due to RBI Settlement Holiday",
            "Summary": "Birla Corporation has changed its record date for dividend eligibility for financial year 2024-25 from September 8, 2025 to September 9, 2025. The revision was necessitated after the Reserve Bank of India declared September 8, 2025 as a Clearing/Settlement Holiday. The company had originally set Monday, September 8 as the record date for determining shareholders eligible to receive a dividend of ₹10 per share (100%), subject to approval at the Annual General Meeting scheduled for September 15, 2025. Following RBI's announcement and subsequent advisories from NSE and BSE, the record date has been moved to Tuesday, September 9, 2025. The cut-off date for voting eligibility at the AGM remains unchanged at September 8, 2025. The company will issue a corrigendum to the AGM notice and annual report regarding this change.",
            "Sentiment": "neutral",
            "PublishDate": 1757052985116,
            "Source": "corporate_action"
        },
        {
            "Title": "Birla Corporation Issues ₹50 Crore Commercial Paper",
            "Summary": "Birla Corporation has issued and allotted commercial paper worth ₹50 crore. Commercial paper is a short-term debt instrument used by companies to meet immediate funding requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1756205390743,
            "Source": "corporate_action"
        },
        {
            "Title": "Birla Corporation Issues ₹50 Crore Commercial Paper with 90-Day Tenure",
            "Summary": "Birla Corporation Limited issued and allotted commercial paper worth ₹50 crores on August 8, 2025. The company issued 1,000 units of ₹5 lakh each with a 90-day tenure at a discount rate of 6.15% per annum. The commercial paper has a maturity date of November 6, 2025, and is proposed to be listed on BSE Limited. The payment schedule includes upfront interest payment and principal repayment on the maturity date. No security or charge has been created over the company's assets for this instrument.",
            "Sentiment": "neutral",
            "PublishDate": 1754657986224,
            "Source": "corporate_action"
        },
        {
            "Title": "Birla Corporation Q1 FY26 EBITDA Falls to ₹715/Ton Due to Clinker Shortage and Extended Plant Shutdowns",
            "Summary": "Birla Corporation reported EBITDA of ₹715 per ton for Q1 FY26, down from over ₹1,000 per ton in previous quarters. The decline was primarily attributed to extended planned shutdowns at Mukutban and Maihar plants due to heavy rains and technical issues, forcing the company to purchase 1 lakh tons of clinker from competitors at higher costs. The company's volume mix showed 50% sales from Central India, 21% from East, 16% from North, and 13% from West. Mukutban volume reached 6.6 lakh tons with average lead distance of 342 km. The company increased its blended cement proportion to 89% from 82% sequentially and trade sales to 78% from 72%. Central region prices declined by approximately 2% while Eastern markets saw price increases. Net debt stands at ₹2,300 crores with capex guidance maintained at ₹1,000 crores for the year. Management expects the clinker shortage issue to resolve in subsequent quarters and maintains annual volume growth guidance of 6-7%.",
            "Sentiment": "negative",
            "PublishDate": 1754392313948,
            "Source": "earnings"
        },
        {
            "Title": "Birla Corp Targets Late Single-Digit Volume Growth in FY26 Following Strong Q1 Performance",
            "Summary": "Birla Corporation is targeting late single-digit volume growth in FY26, with MD and CEO Sandip Ghose expecting performance at par or higher than industry levels. The company plans capacity expansion with a third Kundanganj line by Q3 and continued ramp-up of its Mukutban plant. Birla Corp focuses on blended cement, which represents 89% of total sales, and targets retail and individual homebuilder segments. The company reported strong quarterly results with net profit jumping to Rs 120 crore from Rs 33 crore year-on-year, while revenue increased 12.6% to Rs 2,486 crore. Cement division Ebitda per tonne rose 18.6% to Rs 715 crore. Ghose also highlighted renewed focus on the jute business, citing its historical significance since the company's 1910 founding. Shares closed 2.33% lower at Rs 1,320 on Friday.",
            "Sentiment": "positive",
            "PublishDate": 1754195873957,
            "Source": "earnings"
        },
        {
            "Title": "Birla Corporation Reports 264% Jump in Net Profit, EBITDA Up 38% in June Quarter",
            "Summary": "Birla Corporation Limited reported consolidated revenue of Rs 2,486 crore for the June quarter, representing a 13% increase year-on-year. The company's net profit surged 264% to Rs 120 crore compared to Rs 33 crore in the same period last year. EBITDA grew 38% to Rs 379 crore from Rs 275 crore. Cement sales volume increased 9% to 4.79 million tons from 4.38 million tons. The company faced mixed market conditions across regions, with western and eastern markets performing well while central India remained muted. Early monsoon arrival affected demand and pricing. The cement division's EBITDA reached Rs 364 crore, up 34% year-on-year, with EBITDA per ton at Rs 715, up 19%. Blended cement portfolio grew 16% and accounted for 89% of total sales. Power and fuel costs per ton decreased 8.4% to Rs 933. Green power usage increased to 26.9% of total power consumption.",
            "Sentiment": "positive",
            "PublishDate": 1753873510357,
            "Source": "earnings"
        },
        {
            "Title": "Birla Corporation Reports Strong Q1 Performance with Net Profit Surging to 1.2B Rupees",
            "Summary": "Birla Corporation delivered robust quarterly results with consolidated net profit jumping to 1.2 billion rupees from 326 million rupees in the same period last year. Revenue increased to 24.5 billion rupees compared to 21.9 billion rupees year-over-year. The company's EBITDA rose to 3.4 billion rupees from 2.58 billion rupees, while EBITDA margin improved to 14.13% from 11.79% in the corresponding period.",
            "Sentiment": "positive",
            "PublishDate": 1753864820509,
            "Source": "earnings"
        },
        {
            "Title": "Birla Corporation Schedules Investor Call to Discuss June 2025 Quarter Results",
            "Summary": "Birla Corporation Limited has scheduled an investors and analyst conference call for July 31, 2025, at 2:00 PM IST to discuss the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The call will be hosted by HDFC Securities and will feature MD & CEO Sandip Ghose and Group CFO Aditya Saraogi representing the company management.",
            "Sentiment": "neutral",
            "PublishDate": 1753438903870,
            "Source": "earnings"
        },
        {
            "Title": "Birla Corporation Sees Rs. 23.24 Crore Block Trade on NSE",
            "Summary": "Birla Corporation Ltd. witnessed a block trade worth Rs. 23.24 crores on the NSE. The transaction involved approximately 158,515 shares executed at a price of Rs. 1,466.20 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1753162215291,
            "Source": "order&deals"
        },
        {
            "Title": "Birla Corp Declared 'Preferred Bidder' for Limestone Block in Rajasthan",
            "Summary": "Birla Corp has been declared the 'preferred bidder' for a limestone block located in Rajasthan. The block covers an area of 160.3882 hectares. No additional details about the bidding process or the potential use of the limestone block were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752192387000,
            "Source": "default"
        },
        {
            "Title": "Birla Corp Named Preferred Bidder for Limestone Block in Rajasthan",
            "Summary": "Birla Corp has been named the preferred bidder for a limestone block in Rajasthan. The block covers an area of 160.3882 hectares. No additional details about the bidding process, the exact location within Rajasthan, or the potential use of the limestone block were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752151570000,
            "Source": "default"
        },
        {
            "Title": "Birla Corporation: Secures Limestone Block in Rajasthan as Preferred Bidder",
            "Summary": "Birla Corporation has been named the preferred bidder for a 160.39-hectare limestone block in Nagaur district, Rajasthan, with a final price offer of 63.50%. The company received official communication on July 10, 2025. This follows last month's successful bid for another limestone block in Jaisalmer, Rajasthan.",
            "Sentiment": "positive",
            "PublishDate": 1752147443000,
            "Source": "corporate_action"
        },
        {
            "Title": "Birla Corporation: Bengal Incentive Rollback Won't Affect Plans",
            "Summary": "Birla Corporation's CEO Sandip Ghose states that West Bengal's revocation of industrial incentives won't impact the company's strategy. The company has been declared the preferred bidder for a limestone block in Rajasthan. Birla Corp expects 7-8% volume growth in FY26, in line with industry trends.",
            "Sentiment": "neutral",
            "PublishDate": 1750057072000,
            "Source": "normal_news"
        },
        {
            "Title": "Birla Corporation Declared Preferred Bidder for Limestone Block in Rajasthan",
            "Summary": "Birla Corporation has been declared the preferred bidder for a limestone block in Rajasthan. This development suggests the company is looking to secure raw materials for its operations, potentially in the cement industry where limestone is a key ingredient.",
            "Sentiment": "positive",
            "PublishDate": 1750031796000,
            "Source": "default"
        },
        {
            "Title": "Birla Corporation: Secures Limestone Block in Rajasthan Auction",
            "Summary": "Birla Corp has been declared the preferred bidder for the Gourum Khan Ki Dhani (South) limestone block in Rajasthan's Jaisalmer district, covering 499.6394 hectares. The company won with the highest final price offer of 20.60%. This allocation will enhance raw material security and support long-term cement sector expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1749828920000,
            "Source": "corporate_action"
        },
        {
            "Title": "Birla Corporation Named Preferred Bidder for Rajasthan Limestone Block",
            "Summary": "Birla Corporation has been announced as the preferred bidder for a limestone block in Rajasthan. This development suggests the company is potentially expanding its mineral resources or production capabilities in the region.",
            "Sentiment": "positive",
            "PublishDate": 1749822215000,
            "Source": "default"
        },
        {
            "Title": "Birla Corporation: Wins Bid for 500-Hectare Limestone Block in Rajasthan",
            "Summary": "Birla Corporation has been declared the preferred bidder for the Gourum Khan Ki Dhani (South) limestone block in Jaisalmer, Rajasthan. The company agreed to pay 20.60% of the limestone value extracted as revenue share to the state government. The block spans approximately 499.64 hectares.",
            "Sentiment": "positive",
            "PublishDate": 1749819853000,
            "Source": "order&deals"
        },
        {
            "Title": "Birla Corporation: Q4 Results Spark 26% Rally, Expansion Plans Announced",
            "Summary": "Birla Corporation's Q4FY25 results beat estimates, with profit up 33% YoY to ₹257 crore. The company plans to increase cement capacity by 30% to 27.6 MTPA by FY29. Brokerage firms JM Financial and Axis Securities have raised target prices to ₹1,600 and ₹1,560 respectively. The stock has rallied 26.20% in two days following the results.",
            "Sentiment": "positive",
            "PublishDate": 1747195169000,
            "Source": "earnings"
        },
        {
            "Title": "Birla Corporation: Share Price Surges 20% on Strong Q4 Results",
            "Summary": "Birla Corporation's share price hit the 20% upper circuit at ₹1,068 on May 12, following a 33% YoY increase in Q4FY25 net profit to ₹257 crore. Q4 saw improved demand, pricing, and 105% capacity utilization. Cement sales volume grew 8% YoY to 5.2 million tonnes in Q4. The company reduced net debt to ₹2,244 crore by March-end.",
            "Sentiment": "positive",
            "PublishDate": 1747023328000,
            "Source": "earnings"
        },
        {
            "Title": "Birla Corporation Reports Strong Q4 Results with Increased Profit and Revenue",
            "Summary": "Birla Corporation has announced its Q4 financial results. The company's consolidated net profit increased to 2.6 billion rupees, up from 1.93 billion rupees year-over-year and 312 million rupees quarter-over-quarter. Revenue also saw growth, reaching 28.14 billion rupees compared to 26.56 billion rupees in the same quarter last year. Additionally, the company has recommended a dividend of 10 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747008721000,
            "Source": "default"
        },
        {
            "Title": "Birla Corporation: Q4 Profit Surges 32.7% to Rs 256.6 Crore",
            "Summary": "Birla Corporation reported a 32.7% increase in Q4 FY25 net profit to Rs 256.6 crore, driven by higher cement sales volume and realisation. Revenue rose 6% to Rs 2,814.91 crore. Cement sales volume grew 8% to 5.2 million tonnes with 105% capacity utilisation. The board approved a Rs 10 per share dividend and plans for a new cement grinding unit in Bihar.",
            "Sentiment": "positive",
            "PublishDate": 1746870666000,
            "Source": "earnings"
        },
        {
            "Title": "Birla Corporation: Q4 Profit Surges 32%, Plans Expansion",
            "Summary": "Birla Corporation's Q4 consolidated net profit rose 32.7% to Rs 256.60 crore. Total income increased 6.8% to Rs 2,863.14 crore. The company plans to issue NCDs up to Rs 200 crore and set up a new cement grinding unit in Bihar.",
            "Sentiment": "positive",
            "PublishDate": 1746801904000,
            "Source": "earnings"
        },
        {
            "Title": "Birla Corporation Reports Strong Q4 Results and Declares Dividend",
            "Summary": "Birla Corporation has announced its Q4 financial results, showing significant year-over-year improvements. The company's consolidated net profit increased to 2.6 billion rupees from 1.93 billion rupees in the previous year. Revenue rose to 28.14 billion rupees from 26.56 billion rupees. EBITDA improved to 5.3 billion rupees with a margin of 18.97%. Additionally, the company has recommended a dividend of 10 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746793972000,
            "Source": "result"
        },
        {
            "Title": "RCCPL Approves Major Capacity Expansion",
            "Summary": "RCCPL, a unit of Birla Corporation, has approved a significant capital expenditure plan. The plan includes the construction of a 3.70 MTPA clinker unit and 3.40 MTPA grinding units. The total investment required for this capacity addition is estimated at 34.75 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1746715322000,
            "Source": "default"
        },
        {
            "Title": "Birla Corp to Consider Q4 Results on May 9",
            "Summary": "Birla Corporation Limited has announced that it will consider and approve its financial results for the fourth quarter of the fiscal year on May 9.",
            "Sentiment": "neutral",
            "PublishDate": 1746187322000,
            "Source": "default"
        },
        {
            "Title": "Birla Corporation Reports Q3 Results and Announces Plant Closure",
            "Summary": "Birla Corporation reported a significant decrease in Q3 consolidated net profit, dropping to 312 million rupees from 1.1 billion rupees year-over-year. Revenue also declined slightly to 22.57 billion rupees from 23.1 billion rupees. Additionally, the company has approved the closure of its PVC flooring plant located in Birlapur.",
            "Sentiment": "negative",
            "PublishDate": 1738714900000,
            "Source": "earnings"
        },
        {
            "Title": "Birla Corporation: Q3 Profit Plunges 72% Amid Lower Cement Prices, Sales Volume Up",
            "Summary": "Birla Corp reported a 72% decline in Q3 net profit due to lower cement prices. Revenue fell 2.4% to ₹2,272 crore. Cement sales volume increased 7.1% to 4.5 million tons. EBITDA per ton dropped 37% YoY but improved 23.4% sequentially. Premium cement sales grew 19%. The company reduced variable costs and increased renewable power usage.",
            "Sentiment": "neutral",
            "PublishDate": 1738678871000,
            "Source": "earnings"
        }
    ]
}