{
    "Symbol": "BIRLAMONEY",
    "ISIN": "INE865C01022",
    "News": [
        {
            "Title": "Aditya Birla Money Q3 Net Profit Drops 35% YoY",
            "Summary": "Aditya Birla Money reported Q3 net profit of ₹142 million, down 35% from ₹218 million last year, while revenue grew 12% to ₹1.2 billion from ₹1.07 billion in the same period.",
            "Sentiment": "negative",
            "PublishDate": 1768401939303,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Birla Money Q3FY26 Results: Profit Rises 40%",
            "Summary": "Aditya Birla Money reported Q3FY26 net profit of ₹1,422.17 lakhs, up 40.18% QoQ. Revenue grew 12.27% to ₹11,958.06 lakhs with improved margins across segments.",
            "Sentiment": "positive",
            "PublishDate": 1767612762279,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Birla Money Modifies RPT Terms, Raises Share Price",
            "Summary": "Aditya Birla Money's board approves changes to material related party transactions and extends preference share redemption period by one year, with redemption price increased to ₹687.44 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1765775707319,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Birla Money Receives Credit Rating Affirmation from India Ratings",
            "Summary": "India Ratings Research Private Limited has affirmed credit ratings for Aditya Birla Money Limited. The company received a Long Term Issuer Rating of IND AA-/Stable, which was affirmed. Additionally, ratings for instruments worth INR 3,500 million and INR 20,000 million were assigned IND A1 ratings, both affirmed. The rating letter was dated November 12, 2025, and received by the company on November 13, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763036796073,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Money Reports 62% Decline in Q2 Net Profit",
            "Summary": "Aditya Birla Money reported a net profit of 101 million rupees for Q2, down from 267 million rupees in the same quarter last year. The company's revenue also declined to 1.07 billion rupees compared to 1.26 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1760432664854,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Money Reports Q1 Financial Results",
            "Summary": "Aditya Birla Money has reported its Q1 financial results. The company's net profit for the quarter was 154 million rupees, compared to 164 million rupees in the same period last year. Revenue for Q1 stood at 1.13 billion rupees, down from 1.2 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1752236980000,
            "Source": "default"
        },
        {
            "Title": "Aditya Birla Money Reports Q4 Financial Results",
            "Summary": "Aditya Birla Money has released its Q4 financial results. The company's revenue decreased to 980.6 million rupees from 1.14 billion rupees year-over-year. Net profit for Q4 was 93.3 million rupees, down from 165 million rupees year-over-year and 218 million rupees quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1745248694000,
            "Source": "result"
        },
        {
            "Title": "Aditya Birla Money to Consider Q4 Results on April 21",
            "Summary": "Aditya Birla Money has announced that it will consider its fourth quarter (Q4) financial results on April 21. This indicates that the company is preparing to release its earnings report for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1744381348000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Money to Launch New Web Trading Platform 'Elevate'",
            "Summary": "Aditya Birla Money has announced plans to launch a new web trading platform called 'Elevate' on March 31, 2025. This development represents a significant upgrade to the company's digital trading capabilities, potentially offering enhanced features and user experience for its customers.",
            "Sentiment": "positive",
            "PublishDate": 1743466283000,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Money to Launch New Web Trading Platform 'Elevate'",
            "Summary": "Aditya Birla Money has announced plans to launch a new web trading platform called 'Elevate' on March 31, 2025. This development represents a significant upgrade to the company's digital trading infrastructure, potentially enhancing user experience and trading capabilities for its customers.",
            "Sentiment": "positive",
            "PublishDate": 1743175516000,
            "Source": "corporate_action"
        },
        {
            "Title": "SEBI Raises Observations on Aditya Birla Money, Company Takes Corrective Steps",
            "Summary": "Aditya Birla Money has informed that the Securities and Exchange Board of India (SEBI) has raised certain observations regarding the company. In response, the company states that it has already taken necessary corrective measures to address these observations.",
            "Sentiment": "neutral",
            "PublishDate": 1742170275000,
            "Source": "corporate_governance"
        },
        {
            "Title": "SEBI Raises Observations on Aditya Birla Money, Company Takes Corrective Steps",
            "Summary": "Aditya Birla Money has informed that the Securities and Exchange Board of India (SEBI) has raised certain observations regarding the company. In response, the company states that it has already implemented necessary corrective measures to address these observations.",
            "Sentiment": "neutral",
            "PublishDate": 1741882608000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Aditya Birla Money Reports Strong Q3 Financial Results",
            "Summary": "Aditya Birla Money has announced its financial results for the third quarter. The company's net profit increased to 218 million rupees, up from 151 million rupees in the same quarter last year and 267 million rupees in the previous quarter. Revenue for Q3 also saw growth, reaching 1.06 billion rupees compared to 1 billion rupees in the corresponding period last year.",
            "Sentiment": "positive",
            "PublishDate": 1737936785000,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Money: Q3 Profit Surges 43.96% YoY Despite Revenue Dip",
            "Summary": "Aditya Birla Money reported Q3 FY25 results with profit rising 43.96% YoY to ₹21.81 crore, despite a 10.18% QoQ revenue decline to ₹101.34 crore. EPS increased 44.03% YoY to ₹3.86. Operating income grew 24.32% YoY but fell 6.02% QoQ.",
            "Sentiment": "positive",
            "PublishDate": 1737786039000,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Money Reports Q3 Financial Results",
            "Summary": "Aditya Birla Money has announced its financial results for the third quarter. The company reported a net profit of 218 million rupees, which represents an increase from 151 million rupees year-over-year and 267 million rupees quarter-over-quarter. The company's revenue for Q3 stood at 1.06 billion rupees, up from 1 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1737731182000,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Birla Money Reports Strong Q2 Financial Performance",
            "Summary": "Aditya Birla Money has reported significant year-over-year growth in its Q2 financial results. The company's EBITDA increased from 389 million rupees to 666 million rupees. Additionally, the EBITDA margin improved from 40.36% to 53.02% compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1729089141000,
            "Source": "result"
        },
        {
            "Title": "Aditya Birla Money Reports Q2 Revenue Growth",
            "Summary": "Aditya Birla Money has reported a revenue of 1.26 billion rupees for the second quarter, showing a year-over-year increase from 963.6 million rupees and a quarter-over-quarter increase from 1.18 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1729089129000,
            "Source": "result"
        },
        {
            "Title": "Aditya Birla Money Reports Significant Profit Growth in Q2",
            "Summary": "Aditya Birla Money has reported a substantial increase in net profit for the second quarter. The company's net profit rose to 267 million rupees, compared to 119.2 million rupees in the same quarter last year (YoY) and 164 million rupees in the previous quarter (QoQ).",
            "Sentiment": "positive",
            "PublishDate": 1729089116000,
            "Source": "result"
        }
    ]
}