{
    "Symbol": "BIRLACABLE",
    "ISIN": "INE800A01015",
    "News": [
        {
            "Title": "Birla Cable Q3FY26 Net Profit Jumps 159% to ₹402.17 Cr",
            "Summary": "Birla Cable Limited reported strong Q3FY26 results with net profit rising 159% to ₹402.17 lakhs and revenue growing 30% to ₹20,450.51 lakhs compared to Q3FY25.",
            "Sentiment": "positive",
            "PublishDate": 1769691947026,
            "Source": "co_actions_results"
        },
        {
            "Title": "Birla Cable CEO R. Sridharan Resigns Effective Jan 19, 2026",
            "Summary": "Birla Cable Limited announces resignation of Manager and CEO Shri R. Sridharan effective January 19, 2026, due to personal reasons after over two decades with the company.",
            "Sentiment": "neutral",
            "PublishDate": 1768825873348,
            "Source": "stocks"
        },
        {
            "Title": "Birla Cable Board Meet on Jan 29 for Q3FY26 Results",
            "Summary": "Birla Cable Limited has scheduled its board meeting for January 29, 2026, to consider Q3FY26 unaudited financial results. Trading window remains closed until January 31, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768472030394,
            "Source": "co_actions_results"
        },
        {
            "Title": "Birla Cable Ends Power Deal With Continuum MP",
            "Summary": "Birla Cable Limited has terminated its power purchase agreement with Continuum MP Windfarm Development, marking a significant change in the company's energy procurement strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1766060177127,
            "Source": "stocks"
        },
        {
            "Title": "Birla Cable Reports 65% Decline in Q2 Net Profit to 6.9 Million Rupees",
            "Summary": "Birla Cable reported quarterly net profit of 6.9 million rupees compared to 20 million rupees in the same period last year. Revenue decreased to 1.76 billion rupees from 1.82 billion rupees year-over-year. EBITDA fell to 72 million rupees from 93.5 million rupees, while EBITDA margin compressed to 4.09% from 5.15% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1761819652569,
            "Source": "earnings"
        },
        {
            "Title": "Birla Cable Limited Announces 33rd AGM for September 12, 2025 with E-Voting Facility",
            "Summary": "Birla Cable Limited has scheduled its 33rd Annual General Meeting for September 12, 2025, at 10:00 AM at the company's registered office in Rewa, Madhya Pradesh. The meeting will address ordinary business including adoption of audited financial statements for FY2024-25 and re-appointment of Director Harsh Vardhan Lodha. Special business items include appointment of secretarial auditor for five consecutive years and ratification of cost auditor remuneration. The company is providing remote e-voting facility from September 9-11, 2025, through CDSL platform. For FY2024-25, the company reported standalone revenue of ₹66,165.23 lakhs compared to ₹68,549.80 lakhs in the previous year, with net profit of ₹503.11 lakhs versus ₹2,248.75 lakhs in FY2023-24.",
            "Sentiment": "neutral",
            "PublishDate": 1755609197016,
            "Source": "corporate_action"
        },
        {
            "Title": "Birla Cable Reports Strong Q1 Performance with Net Profit Surge and Improved Margins",
            "Summary": "Birla Cable delivered robust quarterly results with net profit jumping to 13.6 million rupees from 1.5 million rupees year-over-year. Revenue grew to 1.76 billion rupees compared to 1.66 billion rupees in the same period last year. The company's EBITDA increased to 78 million rupees from 65 million rupees, while EBITDA margin improved to 4.45% from 3.89% year-over-year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754571483984,
            "Source": "earnings"
        },
        {
            "Title": "Birla Cable Appoints Nedia Enterprises as Distributor for Americas Market",
            "Summary": "Birla Cable Limited has appointed Nedia Enterprises Inc., USA for distribution and marketing of products across the Americas, including the United States, Canada, Mexico, Central and South America. The three-year agreement grants Nedia Fiber distribution and selling rights for Birla Cable's products, with the possibility of extension on mutually agreed terms. The partnership covers distribution, branding, logistics, certifications, marketing and customer engagement activities. Nedia Fiber is described as a specialized distributor in the telecommunications and data centre industry with expertise in optical fibre cables and established operations in the USA. The consideration is based on prospective business opportunities, and the agreement is not classified as a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1753785828604,
            "Source": "order&deals"
        },
        {
            "Title": "EU Imposes Countervailing Duty on Indian Optical Fibre Cables",
            "Summary": "The European Union has imposed a countervailing duty on optical fibre cables imported from India. This decision directly affects Birla Cables, an Indian company in the optical fibre cable industry.",
            "Sentiment": "negative",
            "PublishDate": 1749736139000,
            "Source": "default"
        },
        {
            "Title": "Birla Cable Reports Q4 EBITDA and Margin Decline",
            "Summary": "Birla Cable has reported its Q4 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 58 million rupees, down from 70.7 million rupees in the same quarter of the previous year. The EBITDA margin also decreased to 3.73% from 4.05% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1747837989000,
            "Source": "result"
        },
        {
            "Title": "Birla Cable Reports Q4 Financial Results",
            "Summary": "Birla Cable has reported its quarterly financial results. The company's net profit for Q4 was 14.5 million rupees, compared to 14.6 million rupees in the same quarter last year (YoY) and 15.5 million rupees in the previous quarter (QoQ). Revenue for Q4 stood at 1.56 billion rupees, down from 1.75 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747837943000,
            "Source": "result"
        },
        {
            "Title": "Birla Cable Reports Q2 EBITDA and Margin Decline",
            "Summary": "Birla Cable's Q2 EBITDA decreased to 94 million rupees from 99.9 million rupees year-over-year. The company's EBITDA margin also declined to 5.15% from 5.72% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1729778226000,
            "Source": "result"
        },
        {
            "Title": "Birla Cable Reports Q2 Financial Results",
            "Summary": "Birla Cable has announced its financial results for the second quarter. The company reported a net profit of 20 million rupees, down from 53 million rupees in the same quarter last year. Revenue for Q2 increased slightly to 1.8 billion rupees from 1.74 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1729778148000,
            "Source": "result"
        }
    ]
}