{
    "Symbol": "BIRLANU",
    "ISIN": "INE557A01011",
    "News": [
        {
            "Title": "BirlaNu Wins ₹8.38 Crore GST Case in Telangana HC",
            "Summary": "BirlaNu Limited receives favorable order from Telangana High Court, rescinding entire GST demand of ₹8.38 crore and penalty in Input Service Distributor registration matter.",
            "Sentiment": "positive",
            "PublishDate": 1767880640673,
            "Source": "stocks"
        },
        {
            "Title": "BirlaNu Limited files post-transaction disclosure",
            "Summary": "BirlaNu Limited filed post-transaction disclosure under Regulation 10(6) of SEBI Takeover Regulations following completion of inter-se share transfer of 30.07 lakh equity shares among promoter group members on December 29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766397480005,
            "Source": "co_actions_results"
        },
        {
            "Title": "Birla Nu Reports 5% Revenue Growth to INR 810 Crore with Strong Margin Expansion in Q2 FY26",
            "Summary": "Birla Nu achieved INR 810 crore consolidated revenue with 5% year-on-year growth and 330 basis points margin expansion, despite 3-7% price declines across product categories. The company's Walls business delivered exceptional 18% revenue growth while Construction Chemicals grew 31%, supported by the margin-accretive acquisition of CleanCoats Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1764158520663,
            "Source": "stock"
        },
        {
            "Title": "Birla Nu Limited Issues Notice for Transfer of Unclaimed Shares to IEPF Authority",
            "Summary": "Birla Nu Limited has notified shareholders that unclaimed interim dividend for FY 2018-19 and corresponding equity shares will be transferred to the Investor Education and Protection Fund (IEPF) Authority after March 12, 2026, completing seven years as per Companies Act provisions. Affected shareholders must claim their dividends and update KYC details with the registrar by March 5, 2026, to prevent automatic transfer of their shares to IEPF.",
            "Sentiment": "neutral",
            "PublishDate": 1764076124315,
            "Source": "corporate_action"
        },
        {
            "Title": "Birla Nu Confirms ₹127 Crore Fibre Cement Board Plant in Andhra Pradesh",
            "Summary": "Birla Nu Limited clarified to stock exchanges that its new Fibre Cement Board plant near Krishnapatnam port in Andhra Pradesh was already approved by the Board in August 2025, following media reports linking it to recent stock price decline. The greenfield expansion project involves an estimated investment of ₹127 crore with a capacity of 72,000 metric tons per annum, expected to complete within eighteen months.",
            "Sentiment": "neutral",
            "PublishDate": 1763989668285,
            "Source": "stock"
        },
        {
            "Title": "Birla Nu Reports 5% Revenue Growth to INR 810 Cr in Q2FY26 with Strong EBITDA Margin Expansion",
            "Summary": "Birla Nu Limited (formerly HIL Limited) achieved consolidated revenue of INR 810 crores in Q2FY26, up 5% year-on-year, with EBITDA margin expanding by 330 basis points despite challenging market conditions. The company completed acquisition of CleanCoats for INR 110.19 crores and saw strong performance in Walls segment with 18% revenue growth, while Pipes segment faced headwinds with 11% revenue decline.",
            "Sentiment": "positive",
            "PublishDate": 1763552410686,
            "Source": "earnings"
        },
        {
            "Title": "Birla Nu Limited Schedules Investor Conference Call for Q2 H1 FY26 Results Discussion",
            "Summary": "Birla Nu Limited has scheduled an investor and analyst conference call for November 20, 2025, at 12:00 noon IST to discuss their unaudited standalone and consolidated financial results for Q2 H1 FY26. The conference call will be led by MD & CEO Akshat Seth and CFO Ajay Kapadia, with the company's results having been declared on November 7, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763379534465,
            "Source": "earnings"
        },
        {
            "Title": "Birla Nu Limited Completes Acquisition of Clean Coats Private Limited for ₹110.19 Crores",
            "Summary": "Birla Nu Limited has completed the acquisition of 100% equity share capital of Clean Coats Private Limited for an all-cash consideration of ₹110.19 crores. The transaction amount is subject to adjustments based on the finalization of Clean Coats' closing accounts as per the Share Purchase Agreement provisions. This acquisition follows the company's earlier communication dated November 7, 2025, regarding the execution of the Share Purchase Agreement with Clean Coats and its existing shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1762933694538,
            "Source": "order&deals"
        },
        {
            "Title": "BirlaNu Board Approves 925 Million Rupee Acquisition of Clean Coats",
            "Summary": "BirlaNu's board has approved the purchase of Clean Coats for 925 million rupees. The company reported quarterly consolidated net loss of 429 million rupees compared to 147 million rupees in the same period last year. Revenue increased to 8 billion rupees from 7.7 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762527734801,
            "Source": "corporate_action"
        },
        {
            "Title": "BirlaNu Limited Issues Rs. 10 Crore Corporate Guarantee to ICICI Bank for Step-Down Subsidiary",
            "Summary": "BirlaNu Limited has issued a corporate guarantee of Rs. 10 crore to ICICI Bank Limited for loan covenants and working capital facilities of its step-down subsidiary, Aditya Polytechnic Private Limited. The guarantee ensures compliance with borrowing terms and conditions mutually agreed between BirlaNu and ICICI Bank. Upon execution of the guarantee deed, the Rs. 10 crore amount will be recognized as a contingent liability for BirlaNu. In case of default by Aditya Polytechnic in payment or compliance with loan facility terms, BirlaNu will be required to immediately pay the demanded amount up to the guaranteed limit to ICICI Bank. The promoter group has no interest in this transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1755181118612,
            "Source": "corporate_action"
        },
        {
            "Title": "BirlaNu Reports 4.9% Revenue Decline to INR 1,052 Crore in Q1 FY26 Amid Market Headwinds",
            "Summary": "BirlaNu Limited reported consolidated revenue of INR 1,052 crore for Q1 FY26, marking a 4.9% year-on-year decline, with EBITDA at INR 59 crore compared to INR 74 crore in the previous year. The company faced challenging market conditions including weak demand, early monsoon onset, input price pressures, and excess capacity across product categories. Despite headwinds, the company achieved market share gains in Construction Chemicals (37% revenue growth), Wall segments, and Parador operations. Roofs segment revenue declined 4.7% to INR 442 crore due to subdued rural markets and price erosion, while Pipes revenue fell 17% to INR 124 crore amid continued resin price declines. Parador turned operationally positive with INR 5 crore operating profit versus INR 2 crore loss last year, though revenue declined 3% to INR 304 crore. The company maintained its debt-equity ratio at 0.55 with total debt of INR 678 crore. Management expects INR 500 crore capex investment over 3-4 years and remains focused on gaining market share in priority segments while maintaining cost efficiency.",
            "Sentiment": "neutral",
            "PublishDate": 1754998536104,
            "Source": "earnings"
        },
        {
            "Title": "BirlaNu Limited Reports Q1 FY26 Results with 5% Revenue Decline to ₹1,052 Crore",
            "Summary": "BirlaNu Limited (formerly HIL Limited) reported consolidated revenue of ₹1,052 crore for Q1 FY26, down 4.9% from the previous year. The company faced challenges from weak demand, early monsoon onset, input price pressures, and excess capacity across most product categories. Roofs, Pipes, and Floors segments experienced de-growth, while Construction Chemicals grew 37% and Walls segment increased 2%. Price declines of 2-6% in Roofs and Walls segments impacted operating margins. EBITDA fell to ₹32 crore from ₹74 crore in Q1 FY25. The company reported a net loss of ₹25 crore compared to a profit of ₹5 crore in the previous year. Parador subsidiary saw revenue decline to ₹304 crore but improved operating profits to ₹5 crore from a loss of ₹2 crore previously. Management cited industry-wide challenges including reduced government spending and early rains affecting construction activity. The company is progressing on new facilities including an OPVC plant in Patna and a greenfield project in Andhra Pradesh.",
            "Sentiment": "negative",
            "PublishDate": 1754397183158,
            "Source": "earnings"
        },
        {
            "Title": "BirlaNu Limited Approves Quarterly Results and New ₹127 Crore Fibre Cement Board Plant in Andhra Pradesh",
            "Summary": "BirlaNu Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company also approved setting up a new Fibre Cement Board plant near Krishnapatnam port in Nellore district, Andhra Pradesh. The greenfield expansion project will have a production capacity of 72,000 metric tons per annum in Phase I, requiring an estimated investment of ₹127 crore. The investment covers plant setup, infrastructure, and land acquisition costs. The project is expected to be completed within eighteen months and will be financed through internal accruals and borrowings. The company aims to strategically scale operations, expand premium product lines, and achieve competitive advantage through enhanced market accessibility.",
            "Sentiment": "positive",
            "PublishDate": 1754295730221,
            "Source": "earnings"
        },
        {
            "Title": "BirlaNu Limited Shareholders Approve All 7 Resolutions at 78th Annual General Meeting",
            "Summary": "BirlaNu Limited held its 78th Annual General Meeting on July 31, 2025, where all seven proposed resolutions were passed with requisite majority through e-voting. The company had 32,280 shareholders on record date of July 24, 2025, with 61 shareholders attending through video conferencing. Key resolutions approved include adoption of audited financial statements for the year ended March 31, 2025, declaration of final dividend at Rs 30 per equity share (300% on Rs 10 face value), re-appointment of director Desh Deepak Khetrapal, appointment of M/s Ranjeet Pandey & Associates as Secretarial Auditor for 5 years, approval of Managing Director & CEO Akshat Seth's remuneration for 2025-26, amendments to the Employee Stock Option Scheme 2019, and ratification of Cost Auditors' remuneration for the year ending March 31, 2026. The voting results showed strong support across all resolutions, with approval rates ranging from 98.15% to 99.99%.",
            "Sentiment": "positive",
            "PublishDate": 1753973505823,
            "Source": "corporate_action"
        },
        {
            "Title": "BirlaNu Limited Schedules Board Meeting on August 4, 2025 to Approve Quarterly Financial Results",
            "Summary": "BirlaNu Limited has scheduled a Board of Directors meeting for August 4, 2025 to consider and approve the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company notified BSE Limited and National Stock Exchange of India Limited about the scheduled board meeting through official communication dated July 24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753336071007,
            "Source": "corporate_action"
        },
        {
            "Title": "Birlanu Reports Q4 Results and Recommends Final Dividend",
            "Summary": "Birlanu has announced its Q4 financial results and dividend recommendation. The company reported a Q4 EBITDA of 224 million rupees, up from 177 million rupees year-over-year, with an EBITDA margin of 2.41% compared to 2.07% in the previous year. Q4 consolidated net loss narrowed to 1 million rupees from a loss of 247 million rupees year-over-year. Revenue for Q4 increased to 9.29 billion rupees from 8.52 billion rupees in the same period last year. Additionally, the company has recommended a final dividend of Rs. 30 per share.",
            "Sentiment": "positive",
            "PublishDate": 1747493780000,
            "Source": "result"
        },
        {
            "Title": "HIL Limited Changes Company Name to Birlanu Limited",
            "Summary": "HIL Limited has announced a change in its company name. The company will now be known as 'Birlanu Limited', replacing its previous name 'HIL Limited'.",
            "Sentiment": "neutral",
            "PublishDate": 1742390430000,
            "Source": "corporate_action"
        },
        {
            "Title": "HIL Receives Assessment Orders Disallowing ISD Credits",
            "Summary": "HIL Limited has received assessment orders that disallow Input Service Distributor (ISD) credits. This suggests that tax authorities have rejected certain tax credits claimed by the company under the Input Service Distributor mechanism, which could potentially impact the company's tax liabilities or financial position.",
            "Sentiment": "negative",
            "PublishDate": 1738926825000,
            "Source": "corporate_governance"
        },
        {
            "Title": "HIL Reports Q3 Financial Results",
            "Summary": "HIL Limited has reported its financial results for the third quarter. The company recorded a consolidated net loss of 355 million rupees, compared to a loss of 72 million rupees in the same quarter last year. However, this represents an improvement from the previous quarter, where the company had reported a profit of 147 million rupees. Revenue for Q3 stood at 8 billion rupees, slightly up from 7.8 billion rupees in the corresponding period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738854265000,
            "Source": "earnings"
        }
    ]
}