{
    "Symbol": "BLACKBUCK",
    "ISIN": "INE0UIZ01018",
    "News": [
        {
            "Title": "BlackBuck Reports Q3 Net Profit of ₹325M vs Loss",
            "Summary": "BlackBuck achieved a significant turnaround with Q3 net profit of ₹325 million compared to a loss of ₹482 million in the same quarter last year, marking a strong year-over-year performance improvement.",
            "Sentiment": "positive",
            "PublishDate": 1770280148346,
            "Source": "co_actions_results"
        },
        {
            "Title": "BlackBuck Board Meet Set for Feb 5 to Review Q3 Results",
            "Summary": "BlackBuck Limited has scheduled a board meeting on February 05, 2026, to consider and approve unaudited financial results for Q3FY26 ended December 31, 2025, with trading window closed until 48 hours post-declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1769598276615,
            "Source": "co_actions_results"
        },
        {
            "Title": "BlackBuck Allots 2.09 Lakh Shares Under ESOP Plans",
            "Summary": "BlackBuck Limited allotted 2,09,416 equity shares to employees under ESOP 2016 and ESOP 2019 schemes, increasing paid-up share capital from Rs. 18.12 crore to Rs. 18.14 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1769580420414,
            "Source": "co_actions_results"
        },
        {
            "Title": "BlackBuck Gets Credit Rating Upgrade to [ICRA]A2+",
            "Summary": "ICRA upgrades BlackBuck's short-term credit rating from [ICRA]A3+ to [ICRA]A2+, citing improved business and financial risk profiles following corporate freight business hive-off and successful IPO.",
            "Sentiment": "positive",
            "PublishDate": 1769507574611,
            "Source": "co_actions_results"
        },
        {
            "Title": "BlackBuck CPO Shilpi Pandey Resigns",
            "Summary": "BlackBuck Limited announces resignation of Chief People Officer Ms. Shilpi Pandey effective January 20, 2026, citing personal commitments and pursuit of other interests outside the organization.",
            "Sentiment": "neutral",
            "PublishDate": 1768569582682,
            "Source": "stocks"
        },
        {
            "Title": "Morgan Stanley Sets ₹653 Target for BlackBuck",
            "Summary": "Morgan Stanley maintains 'Equal-weight' rating on BlackBuck with a price target of ₹653, reflecting a measured outlook on the logistics company's stock performance.",
            "Sentiment": "neutral",
            "PublishDate": 1765510699524,
            "Source": "stocks"
        },
        {
            "Title": "BlackBuck Allots 1,89,300 Equity Shares Under Employee Stock Option Schemes",
            "Summary": "BlackBuck Limited allotted 1,89,300 equity shares to employees through its ESOP 2016 and ESOP 2019 schemes, with 114,131 shares from ESOP 2016 and 75,169 shares from ESOP 2019. The allotment increases the company's paid-up share capital from Rs. 18,09,81,847 to Rs. 18,11,71,147, with the new shares ranking pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764084748201,
            "Source": "corporate_action"
        },
        {
            "Title": "BlackBuck Promoter Chanakya Hridaya Acquires 8 Lakh Shares Through Open Market Purchase",
            "Summary": "Chanakya Hridaya, Promoter Executive Director of BlackBuck Limited, acquired 8,00,000 shares representing 0.43% of the company's voting capital through open market transactions on November 18, 2025. The acquisition was disclosed under SEBI substantial acquisition regulations, affecting the promoter group's shareholding in the logistics solutions company listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1763608269666,
            "Source": "corporate_action"
        },
        {
            "Title": "BlackBuck Investors Accel India IV and Accel Growth Fund V Sell 4.3 Million Shares",
            "Summary": "Accel India IV (Mauritius) Limited and Accel Growth Fund V LP sold 4,297,129 equity shares of BlackBuck Limited through open market transactions between September and November 2025. The sale reduced their combined shareholding from 10.60% to 8.23% of the company's total share capital, with transactions totaling INR 1 face value shares across multiple dates.",
            "Sentiment": "neutral",
            "PublishDate": 1763556640506,
            "Source": "stock"
        },
        {
            "Title": "BlackBuck Reports 61% Revenue Growth in Q2 FY26 with Strong Profitability Turnaround",
            "Summary": "BlackBuck Limited reported total income of 167 crores in Q2 FY26, representing 61% year-on-year growth from 104 crores in the previous year. The company achieved adjusted EBITDA of 37 crores, marking 143% growth from 15 crores last year. Net revenue from operations grew 53% to 151 crores. The company's transacting customer base reached approximately 800,000 customers (13% YoY growth), while users utilizing multiple services grew 21% to 400,000. Payment GTV reached 6,800 crores with 29% YoY growth. The core business grew 37% on net revenue basis, while growth businesses (Superloads and vehicle finance) increased 226% sequentially. BlackBuck plans to expand Superloads from 4 hubs to 14-15 hubs over the next six months. The company maintains its strategy of innovation in core businesses (tolling and vehicle tracking) while investing in adjacencies like fuel sensors and new product launches.",
            "Sentiment": "positive",
            "PublishDate": 1762541301791,
            "Source": "earnings"
        },
        {
            "Title": "BlackBuck's National Sales Head Chandra Prakash Resigns Due to Personal Commitments",
            "Summary": "BlackBuck Limited announced the resignation of Chandra Prakash, National Sales Head and Senior Management Personnel. Prakash cited personal commitments and pursuing other interests as reasons for his departure. He will serve a notice period and be relieved from duties on January 31, 2026. The company has acknowledged his resignation and confirmed compliance with SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762458894557,
            "Source": "corporate_governance"
        },
        {
            "Title": "BlackBuck Reports Strong Q2 Turnaround with 305 Million Rupees Net Profit",
            "Summary": "BlackBuck delivered a significant financial turnaround in its quarterly results, posting a net profit of 305 million rupees compared to a loss of 2.69 billion rupees in the same period last year. The company's revenue grew to 1.49 billion rupees from 976 million rupees year-over-year. EBITDA increased substantially to 371.2 million rupees from 143.7 million rupees, while EBITDA margin improved to 24.97% from 14.73% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762388857793,
            "Source": "earnings"
        },
        {
            "Title": "BlackBuck Limited Reports No Deviation in IPO Proceeds Utilization for Q2 FY2026",
            "Summary": "BlackBuck Limited (formerly Zinka Logistics Solutions Limited) submitted its monitoring agency report for Q2 FY2026, confirming no deviation from the stated objects of its IPO issue. ICRA Limited, the appointed monitoring agency, reported that the utilization of issuance proceeds remains in line with the disclosed objectives. The company raised Rs. 550 crore through its IPO in November 2024, with proceeds allocated towards sales and marketing costs (Rs. 200 crore), investment in NBFC subsidiary BlackBuck Finserve (Rs. 140 crore), product development expenditure (Rs. 75 crore), and general corporate purposes (Rs. 135 crore). The report shows Rs. 121.188 crore has been utilized for general corporate purposes, including loan repayments, salary payments, and issue-related expenses. The monitoring report was reviewed by the Audit Committee and approved by the Board on November 5, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762353654228,
            "Source": "corporate_action"
        },
        {
            "Title": "BlackBuck Limited Reports Loss of Rs 875.5 Million in Q2 FY26",
            "Summary": "BlackBuck Limited (formerly Zinka Logistics Solutions Limited) reported a loss before tax of Rs 875.5 million from continuing operations for the quarter ended September 30, 2025, compared to a loss of Rs 2,766.87 million in the same quarter last year. The company's revenue from operations increased to Rs 1,485.0 million from Rs 976.26 million year-over-year. For the half-year period, the company posted a loss before tax of Rs 346.77 million from continuing operations versus Rs 2,758.18 million loss in the previous year. The company operates in two segments: truck operator services providing logistics technology platforms, and lending business through its subsidiary BlackBuck Finserve Private Limited. The Board approved the quarterly results at a meeting held on November 5, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762334515049,
            "Source": "earnings"
        },
        {
            "Title": "BlackBuck Grants Stock Options Equivalent to 2.67 Lakh Equity Shares to Employees",
            "Summary": "BlackBuck Limited's Nomination and Remuneration Committee approved the grant of stock options equivalent to 2,66,731 equity shares under two employee stock option schemes - ESOP 2016 and ESOP 2019. The options are granted to eligible employees with an exercise price of ₹1 per equity share. The vesting schedule is 25% over 4 years. Each stock option in ESOP 2016 converts to one equity share with face value of ₹1, while in ESOP 2019, one thousand stock options convert to one equity share with face value of ₹1. The scheme includes provisions for handling stock options in cases of death, permanent incapacity, resignation, termination, retirement, and abandonment. The equity shares allotted upon exercise of stock options will not be subject to any lock-in period.",
            "Sentiment": "positive",
            "PublishDate": 1762292142647,
            "Source": "corporate_action"
        },
        {
            "Title": "BlackBuck Schedules Conference Call for Q2 FY26 Financial Results Discussion",
            "Summary": "BlackBuck Limited has scheduled a conference call for analysts and investors on November 5, 2025, at 5:00 PM IST to discuss the company's un-audited financial results for the quarter and half-year ended September 30, 2025. The company's Board Meeting is also scheduled for the same date to consider and approve these standalone and consolidated financial results. The conference call will be attended by Chairman, Managing Director and CEO Rajesh Kumar Naidu Yabaji and Chief Financial Officer Satyakam GN. Call details are available on the company's investor relations website.",
            "Sentiment": "neutral",
            "PublishDate": 1761857603198,
            "Source": "earnings"
        },
        {
            "Title": "BlackBuck CEO Clarifies Company Will Relocate Within Bengaluru, Not Leave City",
            "Summary": "BlackBuck CEO Rajesh Yabaji clarified that the logistics tech platform is relocating within Bengaluru to facilitate easier employee commutes, not leaving the city entirely. The company decided to move from its Bellandur location on Outer Ring Road due to commuting issues and road infrastructure problems, with average employee commute times reaching 1.5+ hours one way. The initial announcement prompted business leaders to call for infrastructure improvements and attracted an invitation from Andhra Pradesh Minister Lokesh Nara to relocate to Vizag. Yabaji emphasized that BlackBuck started operations in Bengaluru in 2015 and has benefited from Karnataka's tech ecosystem. The company plans to continue expanding its footprint in Bengaluru while seeking government support for infrastructure improvements.",
            "Sentiment": "neutral",
            "PublishDate": 1758208893906,
            "Source": "stock"
        },
        {
            "Title": "Karnataka Deputy CM Responds to BlackBuck's Bengaluru Exit Over Infrastructure Issues",
            "Summary": "Karnataka Deputy Chief Minister DK Shivakumar responded to logistics platform BlackBuck's decision to relocate from Bengaluru due to infrastructure problems. BlackBuck CEO Rajesh Yabaji announced the company would exit its Bellandur office on Outer Ring Road, citing worsening infrastructure and commute issues affecting employees who face over 90-minute one-way commutes on roads with potholes. Shivakumar stated that while companies are free to relocate, they cannot threaten or blackmail the government, asserting that no company will leave Bengaluru. He acknowledged that many tech hubs fall under village panchayats rather than Greater Bengaluru Authority, limiting civic services. The government has established a dedicated corporation to address these issues and plans to bring affected areas under city jurisdiction. Shivakumar confirmed road repairs are underway with contractors given strict deadlines to fix potholes by November.",
            "Sentiment": "negative",
            "PublishDate": 1758197871411,
            "Source": "stock"
        },
        {
            "Title": "BlackBuck Exits Bengaluru Office Due to Infrastructure Issues, Receives Vizag Relocation Offer",
            "Summary": "Digital trucking company BlackBuck is moving out of its Bellandur office in Bengaluru after nine years of operations due to poor road conditions and infrastructure issues. Co-founder Rajesh Yabaji cited roads full of potholes and dust, with average employee commute times exceeding 1.5 hours one way, as reasons for the decision. Andhra Pradesh Minister Lokesh Nara invited the company to relocate to Vizag, highlighting the city's cleanliness rankings and infrastructure development. Industry leaders including Mohandas Pai and Kiran Mazumdar-Shaw called for urgent government intervention to address Bengaluru's infrastructure problems. Despite Bellandur generating high revenue for the city's civic body and housing global IT companies, the area continues to suffer from broken roads, clogged drains, and deteriorating infrastructure.",
            "Sentiment": "negative",
            "PublishDate": 1758104700582,
            "Source": "stock"
        },
        {
            "Title": "Goldman Sachs Sells 2.7% Stake in Zinka Logistics for Rs 295 Crore",
            "Summary": "GSAM Holdings LLC, a Goldman Sachs Asset Management affiliate, sold a 2.74% stake in Zinka Logistics Solutions (BlackBuck's parent company) for Rs 294.75 crore through an open market transaction. The sale involved 49.09 lakh equity shares at an average price of Rs 600.32 per share. Simultaneously, Nomura India Investment Fund Mother Fund acquired 41.16 lakh shares (2.3% stake) for Rs 246.90 crore at Rs 599.77 per share, increasing Nomura's total holding to 3.94% from 1.64%. Zinka Logistics shares closed 0.23% lower at Rs 635.05 on BSE following the transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1756746133226,
            "Source": "order&deals"
        },
        {
            "Title": "Zinka Logistics Solutions Reports 63% Revenue Growth in Q1 FY26 with Strong Profitability Surge",
            "Summary": "Zinka Logistics Solutions Limited reported total revenues of INR 160 crores for Q1 FY26, marking a 63% year-on-year growth. The company achieved EBITDA of INR 40 crores, representing a 4x increase from the same quarter last year, and posted PAT of INR 34 crores. Operating cash flow reached INR 63 crores due to upfront subscription revenue collection. The company's core business (payments and telematics) grew 41% to INR 120 crores, while growth businesses including SuperLoads expanded 4x to INR 23 crores. Monthly transacting customers increased 14% to 783,000, and payment GTV grew 28% to INR 6,800 crores. The company demonstrated 88% operating leverage year-on-year and continues investing in new business verticals while maintaining profitability growth. SuperLoads business, which transitions from classified to transaction marketplace, is currently live in four hubs with plans for expansion.",
            "Sentiment": "positive",
            "PublishDate": 1754648609625,
            "Source": "earnings"
        },
        {
            "Title": "Zinka Logistics Shares Hit 52-Week High Following Strong Q1 Performance",
            "Summary": "Zinka Logistics Solutions shares reached a 52-week high of ₹574.4 and closed 15% higher at ₹560.30 following strong quarterly results. The digital platform for truck operators reported 55% year-on-year revenue growth to ₹143.6 crore and net profit of ₹33.7 crore, up 4% from the previous year. EBITDA surged to ₹40.4 crore from ₹8.3 crore in the same period last year. The company attributed growth to leveraging trucking industry tailwinds and strong execution. Average monthly transacting truck operators on the platform increased 14% to 783,399. The stock has gained 22% year-to-date. Additionally, Quickroutes International divested a 9% stake worth ₹692 crore at ₹423 per share, while Accel India IV reduced its holding by 1.32%. The board approved a proposal to rename the company to BlackBuck Limited, pending shareholder and regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1754491161396,
            "Source": "earnings"
        },
        {
            "Title": "Zinka Logistics Reports Strong Growth with 40% YoY Increase in Core Business and 35.8% EBITDA Margin",
            "Summary": "Zinka Logistics reported significant growth in its quarterly results, with core payments and telematics segments growing 40% year-over-year. The company's 'Superloads' business experienced exceptional growth of 251%. EBITDA margin reached 35.8% due to operating leverage benefits. The company operates with 783,000 truck operators and plans to expand its reach through cross-selling initiatives while developing new business segments to sustain profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754405407717,
            "Source": "earnings"
        },
        {
            "Title": "Zinka Logistics Solutions Reports No Deviation in IPO Proceeds Utilization for Q1 FY2026",
            "Summary": "Zinka Logistics Solutions Limited submitted its quarterly monitoring agency report for the quarter ended June 30, 2025, showing utilization of proceeds from its Initial Public Offer. The report was prepared by ICRA Limited and found no deviation from the stated objects of the issue. The company raised INR 550 crore through its IPO in November 2024. Out of the total proceeds, INR 201.813 crore has been utilized, with INR 348.187 crore remaining unutilized. The funds were allocated across four main objectives: sales and marketing costs (INR 200 crore), investment in NBFC subsidiary Blackbuck Finserve (INR 140 crore), product development (INR 75 crore), and general corporate purposes (INR 135 crore). The unutilized proceeds totaling INR 351.892 crore are deployed in fixed deposits with Axis Bank and Kotak Bank, earning returns between 6.50% to 7.70%. Under general corporate purposes, the company has utilized funds for employee payments, working capital loan repayments to Bajaj Finance, Shivalik, and Axis Bank, and issue-related expenses.",
            "Sentiment": "neutral",
            "PublishDate": 1754397035902,
            "Source": "stock"
        },
        {
            "Title": "Zinka Logistics Solutions Reports Q1 Results, Schedules AGM and Appoints New Auditors",
            "Summary": "Zinka Logistics Solutions Limited approved its unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 1,410.42 million compared to Rs 914.06 million in the same quarter last year. Profit for the period was Rs 339.37 million versus a loss of Rs 52.79 million in the previous year quarter. The Board scheduled the 10th Annual General Meeting for September 12, 2025, which will include consideration of audited financial statements for FY2025, director re-appointment of Mr. Ramasubramanian Balasubramaniam, and appointment of new statutory and secretarial auditors. The company appointed M/s B S R & Co. LLP as statutory auditors for a five-year term from the 10th to 15th AGM, subject to shareholder approval. The Board also noted that the Ministry of Corporate Affairs granted approval for the company's proposed name change to BlackBuck Limited, pending shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1754384676504,
            "Source": "earnings"
        },
        {
            "Title": "Zinka Logistics Solutions Receives IRDAI License to Operate as Corporate Agent",
            "Summary": "Zinka Logistics Solutions Limited has been granted a certificate of registration by the Insurance Regulatory and Development Authority of India (IRDAI) to act as a Corporate Agent (Composite), effective July 31, 2025. The license is valid from July 31, 2025, to July 30, 2028, and was granted under the Registration of Corporate Agents - Regulations, 2015. This registration will enable the company to expand its business into the insurance sector as a Corporate Agent.",
            "Sentiment": "positive",
            "PublishDate": 1753970148796,
            "Source": "stock"
        },
        {
            "Title": "Zinka Logistics: Accel India IV Reduces Stake by 1.32%",
            "Summary": "Accel India IV (Mauritius) sold 1.32% of its stake in Zinka Logistics Solutions Ltd on June 3, 2025, reducing its shareholding to 9.40%. On the same day, Quickroutes International Private Limited exited its entire 9.01% holding. Zinka Logistics, operating as BlackBuck, recently listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1749138974000,
            "Source": "normal_news"
        },
        {
            "Title": "Zinka Logistics: Peak XV Reduces Stake in Rs 302 Crore Block Deal",
            "Summary": "Peak XV Partners sold 12.1 lakh shares of Zinka Logistics (BlackBuck) at Rs 444.71 per share. ADIA, ICICI Prudential MF, and MIT acquired stakes at Rs 420 per share. The total block deal value was approximately Rs 302 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1748965647000,
            "Source": "block_deals"
        },
        {
            "Title": "Zinka Logistics Solutions: Major Block Deal Sees 9.22% Equity Change Hands",
            "Summary": "1.63 crore shares (9.22% equity) of Zinka Logistics Solutions were traded at ₹423 per share, totaling ₹692 crore. Quickroutes International, which held 9.01% stake, was expected to divest 9% stake. Zinka Logistics shares declined 1.98% to ₹429 following the transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1748923019000,
            "Source": "block_deals"
        },
        {
            "Title": "Zinka Logistics: Quickroutes International to Sell Entire 9% Stake for Rs 647 Crore",
            "Summary": "Quickroutes International plans to sell its entire 9% stake in Zinka Logistics Solutions for approximately Rs 647 crore. The floor price is set at Rs 405 per share, a 7.5% discount to Monday's closing price. The sale will be conducted on NSE and BSE platforms, with IIFL Capital Services as the bookrunner.",
            "Sentiment": "neutral",
            "PublishDate": 1748915793000,
            "Source": "block_deals"
        },
        {
            "Title": "Zinka Logistics: Quickroutes to Sell 9% Stake for ₹647 Crore",
            "Summary": "Quickroutes International plans to sell a 9% stake in Zinka Logistics Solutions Ltd through a block deal. The floor price is set at ₹405 per share, aiming to raise approximately ₹647 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1748875598000,
            "Source": "block_deals"
        },
        {
            "Title": "QuickRoutes International to Sell 9% Stake in Zinka Logistics",
            "Summary": "QuickRoutes International plans to sell a 9% stake in Zinka Logistics at a floor price of ₹405 per share. The sale aims to raise ₹647 crore. The news is reported by CNBCTV18.",
            "Sentiment": "neutral",
            "PublishDate": 1748870567000,
            "Source": "default"
        },
        {
            "Title": "Zinka Logistics: Q4 Profit Improves on Strong Execution",
            "Summary": "Zinka Logistics reported Q4 FY25 revenue of Rs 1.2 billion, up 6.9% QoQ and 30.7% YoY. Adjusted Ebitda reached Rs 388 million with a margin of 31.8%, significantly up from 11.2% in Q4 FY24. PAT stood at Rs 2.9 million, including a deferred tax impact of Rs 2.5 billion. ICICI Securities maintains a Buy rating on the stock.",
            "Sentiment": "positive",
            "PublishDate": 1748432994000,
            "Source": "earnings"
        },
        {
            "Title": "Zinka Logistics: Q4 Revenue Misses Estimates, Morgan Stanley Maintains Outlook",
            "Summary": "Zinka Logistics missed Q4 revenue estimates but saw growth in transacting truck operators. Morgan Stanley maintained a Rs 490 target price. Adjusted Ebitda margin and Profit Before Tax fell short of expectations. The company's stock rose 2.39% to Rs 471 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1748415294000,
            "Source": "earnings"
        },
        {
            "Title": "Zinka Logistics Solutions Reports Q4 Financial Results",
            "Summary": "Zinka Logistics Solutions has reported its Q4 consolidated financial results. The company posted a net profit of 2.8 billion rupees, compared to a loss of 907.5 million rupees in the same quarter last year and a loss of 480.3 million rupees in the previous quarter. Q4 revenue increased to 1.22 billion rupees from 932.2 million rupees year-over-year. The company reported an exceptional item loss of 7.83 million rupees. Profit before tax (PBT) for Q4 was 415.8 million rupees, compared to a loss of 875.5 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1748390425000,
            "Source": "default"
        },
        {
            "Title": "Zinka Logistics Solutions Reports Q4 Financial Results",
            "Summary": "Zinka Logistics Solutions has reported its Q4 financial results. The company's revenue increased to 1.22 billion rupees from 932.2 million rupees year-over-year. The consolidated net profit for Q4 was 2.8 billion rupees, compared to a loss of 907.5 million rupees in the same quarter last year and a loss of 480.3 million rupees in the previous quarter. The company's profit before tax (PBT) for Q4 was 415.8 million rupees, compared to a loss of 875.5 million rupees year-over-year. Additionally, the company reported an exceptional item of loss amounting to 7.83 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1748357651000,
            "Source": "result"
        },
        {
            "Title": "Zinka Logistics Solutions Invests 400 Million Rupees in Subsidiary Blackbuck Finserve",
            "Summary": "Zinka Logistics Solutions has made a significant investment of 400 million rupees in its subsidiary, Blackbuck Finserve. This investment demonstrates the parent company's commitment to strengthening its financial services arm.",
            "Sentiment": "positive",
            "PublishDate": 1742861326000,
            "Source": "corporate_action"
        },
        {
            "Title": "Zinka Logistics Solutions Invests 400 Million Rupees in BlackBuck Finserve",
            "Summary": "Zinka Logistics Solutions has made a significant investment of 400 million rupees in its subsidiary, BlackBuck Finserve. This investment demonstrates the company's commitment to expanding its financial services arm within the logistics sector.",
            "Sentiment": "positive",
            "PublishDate": 1742829895000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tax Authorities Conduct Search at Zinka Logistics Solutions Office",
            "Summary": "The Assistant Commissioner of Commercial Taxes from South Kormangala, Bengaluru has conducted a search at the office of Zinka Logistics Solutions. The company reports that this inspection did not disrupt their normal business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1741824332000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tax Authorities Conduct Search at Zinka Logistics Solutions Office",
            "Summary": "The Assistant Commissioner of Commercial Taxes from South Kormangala, Bengaluru has conducted a search at the office of Zinka Logistics Solutions. The company reports that the inspection did not disrupt their normal operations.",
            "Sentiment": "neutral",
            "PublishDate": 1741785893000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Zinka Logistics Solutions: Stock Surges 87% Since IPO, Hits Upper Circuit",
            "Summary": "Zinka Logistics share price hit a 5% upper circuit at ₹510.85, marking its 10th consecutive session of gains. The stock has risen 87% from its IPO price of ₹273 in less than three months since its November 22 debut. It has gained nearly 34% in February after a 20% decline in January and a 78% surge in December.",
            "Sentiment": "positive",
            "PublishDate": 1739162380000,
            "Source": "normal_news"
        },
        {
            "Title": "Zinka Logistics Reports Increased Q3 Loss Despite Revenue Growth",
            "Summary": "Zinka Logistics experienced a widening net loss in Q3, reporting a loss of 482 million rupees compared to a loss of 197 million rupees in the same period last year. However, the company's revenue showed significant growth, increasing to 1.12 billion rupees from 803 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738801383000,
            "Source": "earnings"
        },
        {
            "Title": "Zinka Logistics Reports Strong Growth in Core Businesses",
            "Summary": "Zinka Logistics has announced that its core businesses, which include tolling and vehicle tracking solutions, continue to be the primary revenue generators for the company. These core segments have shown significant year-over-year growth, with approximately 35% increase in Q3 and 43% increase in the first nine months of the fiscal year, according to the company's investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1738754709000,
            "Source": "earnings"
        },
        {
            "Title": "Zinka Logistics Reports Profit in Q3, Reverses Previous Year's Loss",
            "Summary": "Zinka Logistics has reported a significant turnaround in its financial performance for the third quarter. The company posted a profit before tax (PBT) of 297 million rupees, compared to a loss of 66 million rupees in the same period last year. Additionally, the company reported an exceptional item of 779 million rupees, which likely contributed to the improved financial results.",
            "Sentiment": "positive",
            "PublishDate": 1738750444000,
            "Source": "earnings"
        },
        {
            "Title": "Zinka Logistics Reports Significant EBITDA Improvement in Q3",
            "Summary": "Zinka Logistics has reported a substantial turnaround in its Q3 EBITDA performance. The company achieved an EBITDA gain of 293 million rupees, compared to a loss of 40.5 million rupees in the same quarter of the previous year. Additionally, the Q3 EBITDA margin stood at 26.04%, indicating strong operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738750438000,
            "Source": "earnings"
        },
        {
            "Title": "Zinka Logistics Reports Increased Q3 Loss Despite Revenue Growth",
            "Summary": "Zinka Logistics experienced a widening net loss in Q3, reporting a loss of 482 million rupees compared to 197 million rupees in the same quarter last year. However, the company's revenue showed significant growth, increasing to 1.12 billion rupees from 803 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738750433000,
            "Source": "earnings"
        },
        {
            "Title": "Zinka Logistics Solutions Ltd: Morgan Stanley Initiates Coverage with 'Underweight' Rating",
            "Summary": "Morgan Stanley initiates coverage on Zinka Logistics with an 'Underweight' rating and a price target of ₹450, implying a 16% downside. The stock has rallied 105% since listing, leading to an unfavorable risk-reward balance. The brokerage projects a 24% CAGR for core businesses between FY25-FY27 and steady-state adjusted EBITDA margins of 38%.",
            "Sentiment": "negative",
            "PublishDate": 1735525540000,
            "Source": "normal_news"
        },
        {
            "Title": "Zinka Logistics Reports Significant EBITDA Improvement in Q2",
            "Summary": "Zinka Logistics has reported a substantial turnaround in its Q2 EBITDA performance. The company achieved an EBITDA gain of 150 million rupees, compared to a loss of 341 million rupees in the same quarter of the previous year. Additionally, the Q2 EBITDA margin stood at 15.18%.",
            "Sentiment": "positive",
            "PublishDate": 1734093685000,
            "Source": "earnings"
        },
        {
            "Title": "Zinka Logistics Reports Q2 FY25 Financial Results",
            "Summary": "Zinka Logistics has reported an exceptional item of 3.2 billion rupees in Q2 FY25. The company's profit before the exceptional item was 125 million rupees, compared to a loss of 397 million rupees in the same quarter of the previous year, showing a significant improvement in financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1734093563000,
            "Source": "earnings"
        },
        {
            "Title": "Zinka Logistics Reports Q2 Financial Results",
            "Summary": "Zinka Logistics announced its Q2 financial results. The company reported a consolidated net loss of 2.7 billion rupees, compared to a loss of 477 million rupees in the same quarter last year. However, this represents a profit of 287 million rupees compared to the previous quarter. Q2 revenue increased to 988 million rupees from 634 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1734093458000,
            "Source": "earnings"
        }
    ]
}