{
    "Symbol": "BLBLIMITED",
    "ISIN": "INE791A01024",
    "News": [
        {
            "Title": "BLB Ltd Promoter Acquires 50,000 Shares Worth ₹7 Lakh",
            "Summary": "BLB Limited's promoter and managing director Brij Rattan Bagri acquired 50,000 equity shares worth ₹7.00 lakh through open market purchase on NSE, increasing his shareholding to 42.26%.",
            "Sentiment": "positive",
            "PublishDate": 1770372003492,
            "Source": "co_actions_results"
        },
        {
            "Title": "BLB Limited Promoter Acquires 1.5 Lakh Shares",
            "Summary": "Brij Rattan Bagri, Promoter and Director of BLB Limited, acquired 1,50,000 equity shares worth ₹19,48,500 through open market purchase on 28th January, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769686877232,
            "Source": "co_actions_results"
        },
        {
            "Title": "BLB Limited Reports Q3 FY26 Financial Results",
            "Summary": "BLB Limited announced its unaudited financial results for Q3 FY26, showing improved performance with reduced losses and positive operational metrics across key financial parameters.",
            "Sentiment": "positive",
            "PublishDate": 1768794088310,
            "Source": "co_actions_results"
        },
        {
            "Title": "BLB Limited Incorporates Wholly Owned Subsidiary",
            "Summary": "BLB Limited has incorporated BLB Growth Ventures Private Limited as a wholly owned subsidiary with ₹2.00 crore authorized capital to expand into real estate business operations.",
            "Sentiment": "positive",
            "PublishDate": 1768068901123,
            "Source": "co_actions_results"
        },
        {
            "Title": "BLB Limited Invests Rs. 8 Crores in BRSB Securities Through Preference Shares",
            "Summary": "BLB Limited's Board approved investment of Rs. 8 crores in BRSB Securities Private Limited by subscribing to 64 lakh preference shares at Rs. 12.50 per share. The investment in the stock broking company aims to facilitate working capital funding and business expansion, with completion targeted by January 31, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1764845783779,
            "Source": "order&deals"
        },
        {
            "Title": "ACN Financial Services Reduces Stake in BLB Limited to 12.88%",
            "Summary": "ACN Financial Services Limited sold 12,20,885 shares of BLB Limited through open market transactions, reducing its shareholding from 15.19% to 12.88%. The sale was completed on November 3, 2025, involving 2.31% of BLB Limited's total voting capital. ACN Financial Services is not part of BLB Limited's promoter group. BLB Limited has a total equity share capital of Rs. 5,28,65,258 comprising 52,865,258 equity shares of Re. 1 each. The company's shares are listed on both NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1762283841116,
            "Source": "corporate_action"
        },
        {
            "Title": "BLB Limited Reports Quarterly Results and Plans New Real Estate Subsidiary",
            "Summary": "BLB Limited's Board of Directors approved unaudited financial results for the quarter and half year ended September 30, 2025. The company reported revenue from operations of Rs. 12.40 crores for the quarter, with a profit after tax of Rs. 2.09 crores. For the half year, revenue stood at Rs. 30.75 crores with profit after tax of Rs. 2.40 crores. The Board also approved incorporating a new wholly owned subsidiary called BLB Properties Private Limited to deal in property and real estate business including purchase, sale, construction and allied activities. The proposed subsidiary will have an authorized share capital of Rs. 10 crores and paid-up capital of Rs. 9 crores, with 100% subscription by BLB Limited at face value of Rs. 10 per share.",
            "Sentiment": "positive",
            "PublishDate": 1761993145420,
            "Source": "earnings"
        },
        {
            "Title": "BLB Limited Promoter Brij Rattan Bagri Increases Stake by 0.24% Through Open Market Purchase",
            "Summary": "Brij Rattan Bagri, promoter and director of BLB Limited, acquired 1,26,169 equity shares through open market transactions on March 18, 2025. The acquisition increased his shareholding from 40.16% to 40.40% of the company's total voting capital. The purchase was disclosed under SEBI regulations for substantial acquisition of shares. BLB Limited has a total equity share capital of Rs. 5,28,65,258 comprising 52,865,258 equity shares of Re. 1 each. The company is listed on both NSE and BSE.",
            "Sentiment": "positive",
            "PublishDate": 1757082423758,
            "Source": "corporate_action"
        },
        {
            "Title": "BLB Limited Appoints Two New Directors Following Shareholder Approval",
            "Summary": "BLB Limited appointed Sh. Deepak Shrivastava as Non-Executive Director and Sh. Dinesh Rajvanshi as Non-Executive Independent Director. The appointments were approved by shareholders at the 44th Annual General Meeting held on August 18, 2025. Sh. Rajvanshi's appointment is for a term of 5 consecutive years, effective from August 18, 2025. Sh. Shrivastava, aged 52, holds a Bachelor of Arts degree from Delhi University and has over 30 years of experience in capital markets, management, corporate functions, accounts, and banking within the BLB Group. Sh. Rajvanshi is a fellow member of The Institute of Chartered Accountants of India with around 35 years of experience in accounts, finance, audits, and taxation. Both directors are confirmed as not being debarred from holding director positions by any regulatory authority.",
            "Sentiment": "positive",
            "PublishDate": 1755603550260,
            "Source": "corporate_governance"
        },
        {
            "Title": "ACN Financial Services Reduces Stake in BLB Limited to 17.40%",
            "Summary": "ACN Financial Services Limited sold 11,39,238 shares of BLB Limited through open market transactions on August 11, 2025. The sale reduced ACN's shareholding from 19.56% to 17.40% of BLB Limited's total voting capital. ACN Financial Services is identified as belonging to the promoter group of BLB Limited. The transaction involved 2.16% of BLB's total share capital, with BLB Limited having an equity share capital of Rs. 5,28,65,258 comprising 52,865,258 equity shares of Re. 1 each. BLB Limited is listed on both NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1754985138867,
            "Source": "corporate_action"
        },
        {
            "Title": "BLB Limited Reports Strong Q1 Performance with 1,149 Lacs Net Profit",
            "Summary": "BLB Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025. The company reported a net profit of 1,149 lacs compared to a loss of 302 lacs in the previous quarter. Revenue from operations stood at 5,642 lacs versus 5,891 lacs in the prior quarter. Total comprehensive income reached 1,307 lacs, a significant improvement from the previous quarter's loss of 560 lacs. Basic earnings per share was 2.17 compared to negative 0.87 in the preceding quarter. The company operates in the shares and securities business segment and has no subsidiaries, associates, or joint ventures. The results were reviewed by M/s. Ram Rattan & Associates, Chartered Accountants, and are available on stock exchange websites and the company's website.",
            "Sentiment": "positive",
            "PublishDate": 1754480674183,
            "Source": "earnings"
        },
        {
            "Title": "BLB Limited Board Approves Key Appointments and Sets 44th AGM Date for August 18, 2025",
            "Summary": "BLB Limited's Board of Directors approved several key decisions during their July 22, 2025 meeting. The board recommended the appointment of Dinesh Rajvanshi as Non-Executive Independent Director for a 5-year term, subject to shareholder approval. Rajvanshi is a Chartered Accountant with 35 years of experience in accounts, finance, audits and taxation. The board also approved the appointment of M/s. Meenu S. & Associates as Secretarial Auditors for five consecutive years from 2025-26, replacing the previous auditor whose term expired. Additionally, the board recommended amendments to the Articles of Association regarding director retirement by rotation, changes to executive appointments including amendments to terms for Executive Director Anshul Mehra and Managing Director Brij Rattan Bagri's remuneration limit. The 44th Annual General Meeting was scheduled for August 18, 2025 at 11:30 AM via video conferencing. The board also approved the AGM notice, Board's Report, Management Discussion and Analysis Report, and Corporate Governance Report for financial year 2024-25.",
            "Sentiment": "neutral",
            "PublishDate": 1753182554735,
            "Source": "corporate_governance"
        }
    ]
}