{
    "Symbol": "BLISSGVS",
    "ISIN": "INE416D01022",
    "News": [
        {
            "Title": "Bliss GVS Pharma Q3FY26 Results & Interim Dividend",
            "Summary": "Bliss GVS Pharma reported Q3FY26 standalone net profit of ₹1,860.71 lakh vs ₹2,105.25 lakh YoY. Board declared 50% interim dividend of ₹0.50 per share with February 18, 2026 record date.",
            "Sentiment": "neutral",
            "PublishDate": 1770717270792,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bliss GVS Pharma Sets Up Congo Subsidiary",
            "Summary": "Bliss GVS Pharma Limited announces incorporation of wholly owned subsidiary THERALIFE PHARMA RDC PRIVATE LIMITED in Democratic Republic of Congo through its Singapore unit.",
            "Sentiment": "positive",
            "PublishDate": 1769521954756,
            "Source": "stocks"
        },
        {
            "Title": "Bliss GVS Pharma Appoints CEO as Managing Director",
            "Summary": "Bliss GVS Pharma's board approves appointment of CEO S.N. Kamath as Managing Director for three years, subject to shareholder approval through postal ballot.",
            "Sentiment": "positive",
            "PublishDate": 1766479436943,
            "Source": "stocks"
        },
        {
            "Title": "Bliss GVS Pharma Allots 66,380 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Bliss GVS Pharma's ESOP Allotment Committee approved the allotment of 66,380 equity shares of Re. 1/- each to eligible employees who exercised stock options under the company's 2019 Employee Stock Option Plan at Rs. 43/- per share. The allotment increases the company's total issued share capital to 10,57,88,972 equity shares aggregating Rs. 10,57,88,972/-, with the newly issued shares carrying a 6-month lock-in period until June 09, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1765281428144,
            "Source": "corporate_action"
        },
        {
            "Title": "Bliss GVS Pharma Incorporates Step-Down Subsidiary Theralife Pharma in Kenya",
            "Summary": "Bliss GVS International PTE Ltd, Singapore, a wholly owned subsidiary of Bliss GVS Pharma Limited, has incorporated a wholly owned subsidiary named Theralife Pharma Ltd in Nairobi, Kenya on November 24, 2025. The new pharmaceutical and healthcare entity has a share capital of 1,000 ordinary shares of KES 100, expanding Bliss GVS Pharma's international presence through its Singapore subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1764082074497,
            "Source": "stock"
        },
        {
            "Title": "Bliss GVS Pharma Managing Director Gagan Harsh Sharma Resigns Due to Professional Commitments",
            "Summary": "Bliss GVS Pharma Limited announced the resignation of Managing Director Gagan Harsh Sharma (DIN: 07939421) with immediate effect from November 6, 2025, citing other professional commitments. Sharma also resigned from his positions on the company's Audit Committee, Corporate Social Responsibility Committee, and Risk Management Committee. Additionally, he stepped down from directorship positions in subsidiary and associate companies including Kremoint Pharma Pvt. Ltd., Bliss GVS International Pte Ltd (Singapore), Asterisk Life Sciences Ghana Ltd, EPII Exports Pvt. Ltd., and Asterisk Lifesciences GB Limited (UK). Sharma is the spouse of Dr. Vibha Sharma, Whole-Time Director of the company, and brother-in-law of Mrs. Shruti Vishal Rao, also a Whole-Time Director. The board meeting was held at the company's registered office and concluded at 6:10 PM.",
            "Sentiment": "neutral",
            "PublishDate": 1762482278272,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bliss GVS Pharma Reports Quarterly Results and Appoints New Head-Legal",
            "Summary": "Bliss GVS Pharma Limited announced its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company reported standalone revenue from operations of Rs 19,022.53 lakh for the quarter and Rs 38,564.31 lakh for the half year. Net profit after tax stood at Rs 2,482.76 lakh for the quarter and Rs 6,867.29 lakh for the half year on a standalone basis. On consolidated basis, the company recorded revenue of Rs 20,456.50 lakh for the quarter and Rs 40,802.68 lakh for the half year, with net profit of Rs 2,095.76 lakh and Rs 5,372.36 lakh respectively. Additionally, the Board approved the appointment of Mr. Shreekrushna Joshi as Head-Legal and Senior Management Personnel effective November 6, 2025. Mr. Joshi brings over 15 years of experience in corporate legal, contract management and secretarial compliance, having previously worked with Mahindra & Mahindra Limited, Mankind Pharma Limited, and other pharmaceutical companies.",
            "Sentiment": "positive",
            "PublishDate": 1762473112427,
            "Source": "earnings"
        },
        {
            "Title": "Bliss GVS Pharma Grants 5.53 Lakh Stock Options to Employees",
            "Summary": "Bliss GVS Pharma Limited's Nomination and Remuneration Committee granted 5,53,000 stock options to eligible employees under the Employee Stock Options Plan 2019 on November 6, 2025. The options are priced at Rs. 43 per share, representing a 72.05% discount from the BSE closing price dated November 4, 2025. Each option converts to one equity share of Re. 1 face value. The options will vest in four equal installments of 25% each after 12, 24, 36, and 48 months from the grant date. Vested options must be exercised within 6 months of vesting, and resulting equity shares will have a 6-month lock-in period from allotment.",
            "Sentiment": "positive",
            "PublishDate": 1762446308884,
            "Source": "corporate_action"
        },
        {
            "Title": "Bliss GVS Pharma Reports Mixed Q2 Results with Revenue Growth but Lower Profitability",
            "Summary": "Bliss GVS Pharma reported Q2 consolidated net profit of 273 million rupees compared to 243 million rupees in the same period last year. Revenue increased to 2.4 billion rupees from 2.2 billion rupees year-over-year. However, EBITDA declined to 308 million rupees from 415 million rupees, while EBITDA margin compressed to 12.58% from 19.06% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762442895388,
            "Source": "earnings"
        },
        {
            "Title": "Bliss GVS Pharma Allots 33,670 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Bliss GVS Pharma Limited allotted 33,670 equity shares of face value Re. 1 each to eligible employees who exercised stock options under the company's Employee Stock Option Plan 2019. The allotment was approved by the ESOP Allotment Committee on November 5, 2025. The exercise price was Rs. 43 per share. Following this allotment, the company's total issued share capital increased from 10,56,88,923 shares to 10,57,22,592 shares, aggregating Rs. 10,57,22,592. The newly allotted shares will have a lock-in period of six months from the allotment date, expiring on May 5, 2026. The shares will rank equally with existing equity shares of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1762342402959,
            "Source": "corporate_action"
        },
        {
            "Title": "Bliss GVS Pharma Approves Quarterly Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Bliss GVS Pharma Limited's Board of Directors approved the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The board meeting was held on July 29, 2025, at the company's registered office, commencing at 1:00 p.m. and concluding at 4:30 p.m. The company has provided copies of the unaudited financial results along with the Limited Review Report of the Auditors to stock exchanges NSE and BSE. Company Secretary Aditi Bhatt signed the regulatory communication.",
            "Sentiment": "neutral",
            "PublishDate": 1753794559209,
            "Source": "earnings"
        },
        {
            "Title": "Bliss GVS Pharma Reports Strong Q1 Performance with Net Profit Doubling Year-over-Year",
            "Summary": "Bliss GVS Pharma delivered robust quarterly results with consolidated net profit surging to 430 million rupees from 207 million rupees in the same period last year. Revenue grew to 2.07 billion rupees compared to 1.84 billion rupees year-over-year. The company's EBITDA increased to 413 million rupees from 343 million rupees, while EBITDA margin improved to 19.92% from 18.69% in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753794033806,
            "Source": "earnings"
        },
        {
            "Title": "Bliss Gvs Pharma Reports Q4 Profit Turnaround",
            "Summary": "Bliss Gvs Pharma has reported a consolidated net profit of 155.4 million rupees in Q4, compared to a loss of 91.5 million rupees in the same quarter last year. The company's profit also increased from 238 million rupees in the previous quarter. However, Q4 revenue remained stable at 1.98 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747095743000,
            "Source": "default"
        },
        {
            "Title": "Bliss GVS Pharma Reports Q4 Financial Results",
            "Summary": "Bliss GVS Pharma announced its Q4 financial results. The company's EBITDA decreased to 210.9 million rupees from 283.5 million rupees year-over-year, with EBITDA margin falling to 10.65% from 14.31%. Revenue remained stable at 1.98 billion rupees. The company reported a consolidated net profit of 155.4 million rupees, compared to a loss of 91.5 million rupees in the same quarter last year and a profit of 238 million rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747069305000,
            "Source": "result"
        },
        {
            "Title": "Bliss GVS Pharma's U.S. Partner Receives FDA Approval for Mesalamine Suppositories",
            "Summary": "Bliss GVS Pharma's U.S. partner, Rising Pharma, has obtained FDA approval for Mesalamine Suppositories 1000 mg. This product is targeting a $29 million market in the United States.",
            "Sentiment": "positive",
            "PublishDate": 1744710830000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bliss GVS Pharma Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Bliss GVS Pharma has reported a decrease in its third-quarter EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) to 298 million rupees, down from 436.9 million rupees in the same period last year. The company's EBITDA margin also declined to 14.16% from 21.77% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738075197000,
            "Source": "earnings"
        },
        {
            "Title": "Bliss GVS Pharma Reports Q3 Financial Results",
            "Summary": "Bliss GVS Pharma announced its Q3 consolidated financial results. The company reported a net profit of 238 million rupees, down from 276 million rupees year-over-year and 243 million rupees quarter-over-quarter. Revenue for Q3 increased to 2.1 billion rupees from 2 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738075138000,
            "Source": "earnings"
        },
        {
            "Title": "Bliss GVS Pharma Schedules Board Meeting for Q3 Results and Sweat Equity Shares",
            "Summary": "Bliss GVS Pharma has announced a board meeting on January 28 to consider the company's Q3 results. Additionally, the board will discuss the potential issuance of sweat equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1737467503000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bliss GVS Pharma Receives GMP Compliance Certificate from Romanian Agency",
            "Summary": "Bliss GVS Pharma has successfully obtained a certificate of Good Manufacturing Practice (GMP) compliance from Romania's National Agency for Medicines and Medical Devices. This certification follows an EU GMP inspection of the company's facilities.",
            "Sentiment": "positive",
            "PublishDate": 1732492286000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bliss GVS Pharma Receives EU GMP Compliance Certificate from Romanian Agency",
            "Summary": "Bliss GVS Pharma has successfully obtained a Certificate of GMP (Good Manufacturing Practice) Compliance from Romania's National Agency for Medicines and Medical Devices. This certification follows an EU GMP inspection, indicating that the company's manufacturing practices meet European Union standards.",
            "Sentiment": "positive",
            "PublishDate": 1732347818000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bliss GVS Pharma Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Bliss GVS Pharma's Q2 EBITDA decreased to 415 million rupees from 543 million rupees year-over-year. The company's EBITDA margin also fell to 19.06% from 25.66% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1729782077000,
            "Source": "result"
        },
        {
            "Title": "Bliss GVS Pharma Reports Q2 Revenue Growth",
            "Summary": "Bliss GVS Pharma has reported a revenue of 2.18 billion rupees for the second quarter, compared to 2.1 billion rupees in the same period last year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729782027000,
            "Source": "result"
        },
        {
            "Title": "Bliss GVS Pharma Reports Q2 Financial Results",
            "Summary": "Bliss GVS Pharma announced its Q2 consolidated net profit of 243 million rupees, showing a decrease from 423 million rupees year-over-year. However, it represents an increase from 207 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1729781998000,
            "Source": "result"
        }
    ]
}