{
    "Symbol": "BLKASHYAP",
    "ISIN": "INE350H01032",
    "News": [
        {
            "Title": "B L Kashyap Q3 FY26 Results Show Strong Recovery",
            "Summary": "B L Kashyap reports Q3 FY26 consolidated revenue of ₹323.87 crores with improved margins. Order book stands at ₹5,293 crores with debt reduced from ₹700 crores to ₹270 crores.",
            "Sentiment": "positive",
            "PublishDate": 1770820889195,
            "Source": "co_actions_results"
        },
        {
            "Title": "B.L. Kashyap Board Meeting Set for February 11, 2026",
            "Summary": "B.L. Kashyap and Sons Limited has scheduled a board meeting on February 11, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770011863328,
            "Source": "co_actions_results"
        },
        {
            "Title": "B L Kashyap bags ₹364 cr civil works order in Chennai",
            "Summary": "B L Kashyap and Sons secures ₹364.07 crore contract from ESNP Property Builders for Embassy Splendid Tech Zone project in Chennai with 24-month execution timeline.",
            "Sentiment": "positive",
            "PublishDate": 1767087130624,
            "Source": "co_actions_results"
        },
        {
            "Title": "B.L. Kashyap Gets Credit Rating Upgrade from CRISIL",
            "Summary": "B.L. Kashyap And Sons Limited receives credit rating upgrade from CRISIL on December 16, 2025. Long-term rating upgraded to CRISIL BB-/Stable from CRISIL B+/Stable, short-term rating improved to CRISIL A4 from CRISIL A4.",
            "Sentiment": "positive",
            "PublishDate": 1765882118275,
            "Source": "stocks"
        },
        {
            "Title": "B.L.Kashyap Wins ₹615.69 Cr Chennai Project Order",
            "Summary": "B.L.Kashyap and Sons Limited secured a major construction contract worth ₹615.69 crores from Sattva CKC Private Limited for structural and civil work at Chennai Knowledge City project.",
            "Sentiment": "positive",
            "PublishDate": 1765796552519,
            "Source": "co_actions_results"
        },
        {
            "Title": "B.L. Kashyap and Sons Secures New Civil Construction Work Order in Gurugram",
            "Summary": "B.L. Kashyap and Sons Limited received a work order for civil structural, rough finishing and waterproofing work at Sector 63 Gurugram, involving high rise tower and ancillary low rise buildings. The domestic contract was awarded and the work order was received on 24 November 2025 at 2:14 PM.",
            "Sentiment": "positive",
            "PublishDate": 1764053629223,
            "Source": "order&deals"
        },
        {
            "Title": "B.L. Kashyap & Sons Reports Q2 FY26 Results with Revenue of ₹355.13 Crores",
            "Summary": "B.L. Kashyap & Sons Limited reported consolidated revenue of ₹355.13 crores for the quarter ended September 30, 2025, with EBITDA of ₹20.47 crores (5.76% margin) and a net loss of ₹8.63 crores. The construction company has reduced its fund-based debt from ₹700 crores to ₹275 crores and secured new orders worth ₹2,024 crores during the current financial year, targeting 25% government projects by FY27.",
            "Sentiment": "negative",
            "PublishDate": 1763188923574,
            "Source": "earnings"
        },
        {
            "Title": "B. L. Kashyap And Sons Secures ₹295 Crore Construction Contract in Bengaluru",
            "Summary": "B. L. Kashyap And Sons has won a ₹295 crore contract from Embassy Construction Pvt. Ltd. for civil and structural work in Bengaluru. The project is expected to be completed within 18 months.",
            "Sentiment": "positive",
            "PublishDate": 1760425753058,
            "Source": "order&deals"
        },
        {
            "Title": "B.L. Kashyap and Sons Reports Quarterly Results and Appoints New Secretarial Auditors",
            "Summary": "B.L. Kashyap and Sons Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹3,320.94 crore compared to ₹2,000.18 crore in the previous quarter, with profit after tax of ₹1,072.02 crore versus a loss of ₹2,175.31 crore in the prior quarter. On a consolidated basis, revenue was ₹3,364.23 crore against ₹2,641.64 crore previously, with profit after tax of ₹1,075.35 crore compared to a loss of ₹2,032.40 crore. The Board also appointed M/s. Dhananjay Shukla & Associates as Secretarial Auditors for a five-year term from 2025-26 to 2029-30, subject to shareholder approval at the 36th Annual General Meeting. Basic earnings per share improved to ₹0.48 from -₹0.21 in the previous quarter for both standalone and consolidated results.",
            "Sentiment": "positive",
            "PublishDate": 1755162000839,
            "Source": "earnings"
        },
        {
            "Title": "B.L. Kashyap Secures ₹152 Crore Construction Order from Embassy Development",
            "Summary": "B.L. Kashyap and Sons Limited has secured a new order worth ₹152 crores from Embassy Development Limited for civil and structural work in Bengaluru. The project is expected to be completed in approximately 18 months from the date of site handover. The Letter of Intent was received on July 23, 2025. The order amount excludes GST and involves domestic execution. The company confirmed that promoter or promoter group companies have no interest in the entity awarding the contract, and the transaction does not fall within related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1753347208672,
            "Source": "order&deals"
        },
        {
            "Title": "B. L. Kashyap And Sons Secures ₹910 Crore Order",
            "Summary": "B. L. Kashyap And Sons has secured a new order worth ₹910 crores. The construction company announced this significant contract win, though specific details about the project scope, timeline, or client were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1753095773034,
            "Source": "order&deals"
        },
        {
            "Title": "B L Kashyap And Sons Secures 1.57 Billion Rupee Order",
            "Summary": "B L Kashyap And Sons has received an order worth 1.57 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1753057576988,
            "Source": "order&deals"
        },
        {
            "Title": "B L Kashyap And Sons Secures 1.57 Billion Rupee Contract",
            "Summary": "B L Kashyap And Sons has been awarded a contract valued at 1.57 billion rupees. The news suggests a significant business development for the company, likely in the construction or infrastructure sector given the company's name and the nature of the contract.",
            "Sentiment": "positive",
            "PublishDate": 1752840862000,
            "Source": "default"
        },
        {
            "Title": "B.L. Kashyap and Sons Reports Q4 Financial Results",
            "Summary": "B.L. Kashyap and Sons reported its Q4 financial results. The company experienced a net loss of 32.6 million rupees, compared to a profit of 237 million rupees year-over-year and 11.1 million rupees quarter-on-quarter. Revenue decreased to 2.94 billion rupees from 3.4 billion rupees year-over-year. EBITDA fell to 72.3 million rupees from 330.8 million rupees year-over-year, with EBITDA margin dropping to 2.46% from 9.7%. The company also reported an exceptional item of 117.4 million rupees and a profit before tax of 65.8 million rupees, down from 224.3 million rupees quarter-on-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1748620876000,
            "Source": "result"
        },
        {
            "Title": "B. L. Kashyap and Sons Secures 5.10 Billion Rupee Order",
            "Summary": "B. L. Kashyap and Sons, a construction company, has won a significant order worth 5.10 billion rupees (approximately $61.5 million USD). This new contract represents a substantial business opportunity for the company and could potentially boost its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1746272976000,
            "Source": "default"
        },
        {
            "Title": "B.L. Kashyap and Sons Reports Significant Decline in Q3 EBITDA",
            "Summary": "B.L. Kashyap and Sons experienced a substantial decrease in their third quarter EBITDA, dropping from 233 million rupees to 57 million rupees year-over-year. The company's EBITDA margin also declined significantly, falling from 7.28% to 2.37% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738931448000,
            "Source": "earnings"
        },
        {
            "Title": "B.L. Kashyap and Sons Reports Significant Decline in Q3 Profit and Revenue",
            "Summary": "B.L. Kashyap and Sons, a construction company, has reported a substantial decrease in both profit and revenue for the third quarter. The company's net profit dropped to 9.4 million rupees from 88 million rupees in the same period last year. Revenue also declined, falling to 2.4 billion rupees from 3.2 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738931442000,
            "Source": "earnings"
        },
        {
            "Title": "B.L. Kashyap and Sons Reports Q2 Net Profit Decline",
            "Summary": "B.L. Kashyap and Sons, an Indian construction company, has reported a net profit of 109 million rupees for the second quarter, down from 140 million rupees in the same period last year. This represents a year-over-year decrease in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1731313620000,
            "Source": "result"
        },
        {
            "Title": "BL Kashyap Secures 250 Crore Rupee Order",
            "Summary": "BL Kashyap, a construction company, has won a new order worth 250 crore rupees. This significant contract is likely to boost the company's project portfolio and revenue.",
            "Sentiment": "positive",
            "PublishDate": 1730961088000,
            "Source": "corporate_action"
        },
        {
            "Title": "CRISIL Upgrades B.L. Kashyap's Credit Rating",
            "Summary": "CRISIL has upgraded the long-term credit rating for B.L. Kashyap's bank facilities worth Rs. 539.34 crore from CRISIL B-/Stable to CRISIL B+/Stable. The short-term rating has been reaffirmed at CRISIL A4.",
            "Sentiment": "positive",
            "PublishDate": 1729060646000,
            "Source": "corporate_action"
        }
    ]
}