{
    "Symbol": "BLS",
    "ISIN": "INE153T01027",
    "News": [
        {
            "Title": "BLS International Declares ₹2 Per Share Dividend",
            "Summary": "BLS International Services has announced a dividend of ₹2 per share for its shareholders, reflecting the company's commitment to returning value to investors through regular dividend distributions.",
            "Sentiment": "positive",
            "PublishDate": 1770368530268,
            "Source": "co_actions_results"
        },
        {
            "Title": "BLS International Q3 Net Profit Jumps 33% to ₹1.6B",
            "Summary": "BLS International Services reported consolidated net profit of ₹1.6 billion for Q3, marking a significant 33% year-on-year growth from ₹1.2 billion in the previous year period.",
            "Sentiment": "positive",
            "PublishDate": 1770368353640,
            "Source": "co_actions_results"
        },
        {
            "Title": "BLS International FZE Acquires 95% Stake in Bahrain's MVA",
            "Summary": "BLS International FZE has acquired a 95% stake in Bahrain-based MVA International W.L.L., making it a subsidiary of the company through this strategic acquisition in the Middle East region.",
            "Sentiment": "positive",
            "PublishDate": 1770043866547,
            "Source": "co_actions_results"
        },
        {
            "Title": "BLS International Wins Cyprus Visa Outsourcing Deal",
            "Summary": "BLS International Services has been appointed as the visa outsourcing partner for Cyprus Embassy operations across China, Cambodia, Laos, and Mongolia, expanding its global visa services footprint.",
            "Sentiment": "positive",
            "PublishDate": 1769495738369,
            "Source": "stocks"
        },
        {
            "Title": "BLS International Wins ₹1 Billion Bihar Contract",
            "Summary": "BLS International Services has secured a significant ₹1 billion contract for Aadhaar enrollment services in Bihar, marking a major business development for the company's government services portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1768893649334,
            "Source": "co_actions_results"
        },
        {
            "Title": "BLS International wins Cyprus visa contract for Africa",
            "Summary": "BLS International secures visa outsourcing contract from Cyprus High Commission covering South Africa and 10 neighboring countries, expanding its African operations footprint.",
            "Sentiment": "positive",
            "PublishDate": 1767779751296,
            "Source": "stocks"
        },
        {
            "Title": "BLS International Wins Cyprus Visa Deal in South Africa",
            "Summary": "BLS International Services has secured a visa outsourcing contract from Cyprus for operations in South Africa, expanding its global visa processing footprint in the African market.",
            "Sentiment": "positive",
            "PublishDate": 1767685789285,
            "Source": "co_actions_results"
        },
        {
            "Title": "BLS International Wins Legal Battle Against MEA",
            "Summary": "Delhi High Court quashes Ministry of External Affairs debarment order against BLS International Services, marking a significant legal victory for the visa services company.",
            "Sentiment": "positive",
            "PublishDate": 1766102589606,
            "Source": "stocks"
        },
        {
            "Title": "BLS International Acquires 100% Stake in Armenia-Based Visa Processing Company",
            "Summary": "BLS International FZE, a wholly-owned subsidiary of BLS International Services Limited, acquired 100% share capital of BLS International LLC Armenia for AED 97, making it a step-down subsidiary. The acquired company operates in visa and passport processing services in Armenia with a turnover of AMD 98,850,986 for calendar year 2024.",
            "Sentiment": "positive",
            "PublishDate": 1764939927495,
            "Source": "corporate_action"
        },
        {
            "Title": "BLS International Services Secures Visa Outsourcing Contract with Cyprus Embassy in Russia",
            "Summary": "BLS International Services has signed a contract with the Cyprus Embassy in Russia to provide visa outsourcing services. This agreement expands BLS International's visa processing operations and strengthens its presence in the Russian market through diplomatic partnerships.",
            "Sentiment": "positive",
            "PublishDate": 1764051769162,
            "Source": "stock"
        },
        {
            "Title": "BLS International Reports 49% Revenue Growth in Q2FY26, Wins INR 2,000 Crore Aadhaar Contract",
            "Summary": "BLS International delivered strong quarterly results with revenue reaching INR 737 crores (49% YoY growth) and EBITDA rising 30% to INR 213 crores, driven by increased visa volumes and digital business expansion through Aadifidelis acquisition. The company secured a major 6-year contract worth INR 2,000 crores from UIDAI to establish district-level Aadhaar Seva Kendras, while facing a temporary MEA ban on new tenders due to customer complaints.",
            "Sentiment": "positive",
            "PublishDate": 1763466374426,
            "Source": "earnings"
        },
        {
            "Title": "BLS International Services Secures Five-Year Global Deal With Slovak Republic",
            "Summary": "BLS International Services has secured a five-year global contract with the Slovak Republic. This deal expands the company's international service portfolio and strengthens its position in government services sector.",
            "Sentiment": "positive",
            "PublishDate": 1763455969015,
            "Source": "order&deals"
        },
        {
            "Title": "BLS International Grants 78,000 Employee Stock Options Under ESOP Scheme",
            "Summary": "BLS International Services Limited's Nomination and Remuneration Committee approved the grant of 78,000 employee stock options to eligible employees under the BLS International Employees Stock Option Scheme-2023. The options are convertible into an equal number of equity shares with a face value of Re. 1 each, priced at Rs. 315.45 per stock option based on the closing price on NSE. The options will vest equally over a 3-year period subject to eligibility criteria, and vested options can be exercised within one year from the date of last vesting. If all options are exercised, 78,000 equity shares will be issued.",
            "Sentiment": "positive",
            "PublishDate": 1762899617364,
            "Source": "corporate_action"
        },
        {
            "Title": "BLS International Approves Q2 Results, Appoints New CHRO, and Plans Subsidiary Strike-off",
            "Summary": "BLS International Services Limited's Board of Directors approved several key decisions during their November 11, 2025 meeting. The company approved its standalone and consolidated unaudited financial results for the second quarter and half year ended September 30, 2025. The Board appointed Ajit Hugh Dias as Chief Human Resource Officer under Senior Management Personnel, effective November 11, 2025. Additionally, the company approved the closure and strike-off of its wholly owned subsidiary, Reired BLS International Services Private Limited. The subsidiary contributed minimal value with turnover of Rs. 2,00,000 (0.0009% of total turnover) and net worth of Rs. 30,467 (0.0002% of total net worth) for F.Y. 2024-25. The subsidiary was originally incorporated for a specific project that did not materialize. The dissolution and strike-off process is expected to be completed within 6 months by March 31, 2026, subject to regulatory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1762881614781,
            "Source": "corporate_action"
        },
        {
            "Title": "BLS International Targets 18-20% CAGR Growth Through E-Governance and Visa Expansion",
            "Summary": "BLS International has outlined ambitious growth plans targeting 18-20% compound annual growth rate through new government e-governance and visa projects. The company projects FY26 revenue of ₹1,380 crores, representing 14% year-on-year growth. BLS International is expanding its global footprint to over 60 countries with 18,000 service centers. The company plans to launch AI-based verification and citizen services platforms while focusing on margin expansion through high-tech public service contracts.",
            "Sentiment": "positive",
            "PublishDate": 1762875893808,
            "Source": "stock"
        },
        {
            "Title": "BLS International Services Reports 25% Growth in Q2 Net Profit to Rs 1.75 Billion",
            "Summary": "BLS International Services reported Q2 consolidated net profit of Rs 1.75 billion compared to Rs 1.4 billion in the same period last year. The company's Q2 revenue increased to Rs 7.3 billion from Rs 4.95 billion year-over-year. EBITDA rose to Rs 2.13 billion from Rs 1.64 billion, though EBITDA margin declined to 28.9% from 33.13% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762853948967,
            "Source": "earnings"
        },
        {
            "Title": "BLS International's Chief Human Resource Officer Prashant Khullar Resigns",
            "Summary": "BLS International Services Limited announced the resignation of Prashant Khullar from his position as Chief Human Resource Officer and Senior Management Personnel. His resignation becomes effective from the close of business hours on October 31, 2025. In his resignation letter dated July 21, 2025, Khullar cited personal reasons for his departure and expressed gratitude for the opportunity to work with the organization. He committed to ensuring a smooth transition, including hiring and handover to his successor. The company acknowledged his valuable contribution and dedicated service during his tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1761917136135,
            "Source": "corporate_governance"
        },
        {
            "Title": "BLS International FZE Acquires Full Ownership of Two Subsidiaries",
            "Summary": "BLS International FZE has acquired complete ownership of BLS International Services (Senegal) SARL and BLS International Cyprus Ltd. These entities are now fully owned sub-subsidiaries of BLS International FZE.",
            "Sentiment": "positive",
            "PublishDate": 1761745559725,
            "Source": "order&deals"
        },
        {
            "Title": "BLS International Expands Visa Services with New Contracts in Kazakhstan and China",
            "Summary": "BLS International Services Limited announced two new agreements expanding its visa and consular services operations. The company secured a contract with the Embassy of Cyprus in Kazakhstan to manage the entire Cyprus visa application process in the country. Additionally, BLS International was awarded a three-year contract by India's Ministry of External Affairs to establish and operate Indian Visa Application Centres in China, effective October 14, 2025. The company will set up centres in Beijing, Shanghai, and Guangzhou, providing end-to-end visa services with enhanced infrastructure, advanced technology, and multi-lingual staff. India resumed issuing tourist visas to Chinese nationals in July following suspension during the COVID-19 pandemic and border tensions after the Galwan Valley clashes in 2020.",
            "Sentiment": "positive",
            "PublishDate": 1761223282761,
            "Source": "stock"
        },
        {
            "Title": "BLS International Secures Visa Outsourcing Contract with Cyprus Embassy in Kazakhstan",
            "Summary": "BLS International has won a visa outsourcing deal with the Cyprus Embassy in Kazakhstan. The agreement will allow BLS International to handle visa processing services for the embassy.",
            "Sentiment": "positive",
            "PublishDate": 1761200464207,
            "Source": "stock"
        },
        {
            "Title": "BLS International Liquidates Two Overseas Subsidiaries Due to Non-Operational Status",
            "Summary": "BLS International Services Limited has initiated liquidation of two overseas subsidiaries - Visametric LLC in Tajikistan and iDATA International SARL in Tunisia - due to their non-operational business nature. iDATA International SARL was liquidated on September 18, 2025, while Visametric LLC's liquidation is expected to complete by March 31, 2026. Both entities will cease to be step-down subsidiaries of BLS International FZE. iDATA International SARL had zero revenue contribution, while Visametric LLC contributed EUR 1,24,380.00 (0.050% of total consolidated revenue) during the last financial year. The net worth impact is minimal, with iDATA representing 0.003% and Visametric representing 0.067% of the company's total consolidated net worth. No consideration is being received from these liquidations.",
            "Sentiment": "neutral",
            "PublishDate": 1760706568601,
            "Source": "corporate_action"
        },
        {
            "Title": "BLS International Secures 3-Year Contract to Operate Indian Visa Centers in China",
            "Summary": "BLS International Services Ltd has secured a 3-year contract with the Ministry of External Affairs to establish and operate Indian Visa Application Centres in China. The services will commence on October 14, 2025, with centers located in Beijing, Shanghai, and Guangzhou.",
            "Sentiment": "positive",
            "PublishDate": 1760595024462,
            "Source": "stock"
        },
        {
            "Title": "BLS International Reports Rising Visa Fees and Extended Processing Times for International Travelers",
            "Summary": "Several countries have increased visa processing fees, with the United States introducing an additional $250 'Visa Integrity Fee' for non-immigrant categories including tourist, student and work visas. Shikhar Aggarwal, Joint Managing Director at BLS International, which operates visa application centres for embassies, noted that work and petition-based visas remain more expensive than tourist or student visas due to higher scrutiny requirements. Processing delays have become a significant concern, with Schengen visas taking up to four to six months. These delays can result in higher costs for travelers through increased airfares, rescheduling penalties and accommodation losses. Government fees remain publicly available on embassy websites with no hidden charges, though optional paid services like document pick-up and courier returns are available. Most applicants now pay visa fees online during appointment booking, and no official fast-track processing services are offered in most cases.",
            "Sentiment": "neutral",
            "PublishDate": 1760350204333,
            "Source": "stock"
        },
        {
            "Title": "BLS International Debarred from MEA Tenders for Two Years",
            "Summary": "BLS International Services Ltd. has been debarred from participating in Ministry of External Affairs tenders for two years based on allegations including court cases and passport applicant complaints. The company stated it will assess the order and pursue legal remedies. Current MEA operations remain unaffected, with no impact on financial performance expected. Indian Missions contributed 12% to consolidated revenue and 8% of EBITDA in the first quarter. The New Delhi-based company provides outsourced government services specializing in visa, passport and consular services. Shares closed 0.2% higher at ₹337.9 but have declined 30% year-to-date.",
            "Sentiment": "negative",
            "PublishDate": 1760318973166,
            "Source": "stock"
        },
        {
            "Title": "BLS International Services Barred From Future Tenders For Two Years",
            "Summary": "BLS International Services has been barred from participating in future tenders for a two-year period due to allegations and court cases. The company's existing contracts will continue to remain unaffected by this restriction.",
            "Sentiment": "negative",
            "PublishDate": 1760169802399,
            "Source": "stock"
        },
        {
            "Title": "BLS International's UK Subsidiary Acquires Trefeddian Hotel for ₹78 Crore",
            "Summary": "BLS International's step-down subsidiary BLS UK Hotels has acquired 100% stake in UK-based Trefeddian Hotel (Aberdovey) Ltd for approximately ₹78 crore. The acquisition is part of the company's strategy to expand its hospitality portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1759408710168,
            "Source": "order&deals"
        },
        {
            "Title": "BLS E-Services Subsidiary Abandons Bank CSP Acquisition Due to Approval Issues",
            "Summary": "Zero Mass Private Limited, a subsidiary of BLS E-Services, has abandoned its planned acquisition of State Bank of India and HDFC Bank Customer Service Points from Sub-K Impact Solutions. The acquisition was called off due to the non-receipt of required bank approvals.",
            "Sentiment": "negative",
            "PublishDate": 1759164859586,
            "Source": "order&deals"
        },
        {
            "Title": "BLS International FZE Acquires Full Ownership of Kenyan Subsidiary",
            "Summary": "BLS International FZE has acquired 100% stake in Consular Outsourcing Services Kenya Ltd. Following this acquisition, the Kenyan entity has become a wholly owned step-down subsidiary of BLS International.",
            "Sentiment": "positive",
            "PublishDate": 1756725283080,
            "Source": "order&deals"
        },
        {
            "Title": "BLS International FZE Acquires Full Ownership of Irish Subsidiary",
            "Summary": "BLS International's FZE entity has acquired all shares of BLS Consular Services Ltd in Ireland, making it a fully owned subsidiary. This acquisition consolidates BLS International's ownership structure in the Irish market through complete control of its consular services operations.",
            "Sentiment": "positive",
            "PublishDate": 1756475413364,
            "Source": "order&deals"
        },
        {
            "Title": "BLS International Sets September 9, 2025 as Record Date for Final Dividend Eligibility",
            "Summary": "BLS International Services Limited has set September 9, 2025 as the record date for determining shareholders eligible to receive final dividend payments. The company's 41st Annual General Meeting is scheduled for September 16, 2025 and will be conducted through video conferencing. Shareholders whose names appear in the beneficial owner records at the end of business hours on the record date will be entitled to receive the final dividend, whether their shares are held in dematerialized or physical form.",
            "Sentiment": "neutral",
            "PublishDate": 1756282816624,
            "Source": "corporate_action"
        },
        {
            "Title": "BLS International Wins ₹2,055 Crore UIDAI Contract for Aadhaar Seva Kendras",
            "Summary": "BLS International has secured a ₹2,055 crore contract from the Unique Identification Authority of India (UIDAI) to establish and operate Aadhaar Seva Kendras across the country. The contract involves setting up service centers nationwide for Aadhaar-related services.",
            "Sentiment": "positive",
            "PublishDate": 1756179834510,
            "Source": "order&deals"
        },
        {
            "Title": "BLS International Reports Strong Q1 Results with 44% Revenue Growth and Margin Expansion",
            "Summary": "BLS International Services Limited reported consolidated revenue of Rs. 710 crores, up 44% year-over-year, with EBITDA growing 53% to Rs. 204 crores and margin expansion of 171 basis points to 28.7%. Profit After Tax increased 50% to Rs. 181 crores. The visa and consular services segment saw revenue grow 11% to Rs. 461 crores while processing 11.4 lakh applications, up 33.6% year-over-year. Digital services revenue surged 218% to Rs. 250 crores, driven by consolidation of Aadifidelis Solutions and expansion of Business Correspondent services. The company maintains a strong net cash position of Rs. 1,126 crores and has successfully converted most partnership-based operations to self-managed centers. BLS operates in over 70 countries serving more than 40 client governments, with 90% of contracts renewed in the past year. Management aims to maintain 20-25% growth in profitability and revenue over the next 3-4 years, citing clear revenue visibility for 4-7 years ahead.",
            "Sentiment": "positive",
            "PublishDate": 1754905080552,
            "Source": "earnings"
        },
        {
            "Title": "BLS International Makes Earnings Call Audio Recording Available for Q1 FY2026 Results",
            "Summary": "BLS International Services Limited has made the audio recording of their earnings call available on their company website. The earnings call was held on August 6, 2025, at 4:00 PM IST and discussed the company's operational and financial performance for the first quarter ended June 30, 2025. The audio recording can be accessed at https://www.blsinternational.com/transcript. The company notified stock exchanges NSE and BSE about the availability of this recording.",
            "Sentiment": "neutral",
            "PublishDate": 1754492166733,
            "Source": "earnings"
        },
        {
            "Title": "BLS International Reports Strong Q1 Performance with 44% Revenue Growth and Key Leadership Appointments",
            "Summary": "BLS International Services Limited reported consolidated revenue of Rs 71,056.53 lakhs for the quarter ended June 30, 2025, representing a 44.2% increase from Rs 49,266.90 lakhs in the same quarter last year. Net profit rose to Rs 18,097.57 lakhs compared to Rs 12,078.47 lakhs in the previous year quarter. The company's two main segments showed strong performance - Visa and Consular Services generated Rs 46,068.85 lakhs while Digital Services contributed Rs 24,987.68 lakhs. The Board approved the appointment of Mr. Diwakar Aggarwal as Chairman-Executive Director for three years effective August 5, 2025, and re-appointed Mr. Nikhil Gupta as Managing Director for another three-year term starting February 1, 2026, both subject to shareholder approval. The 41st Annual General Meeting has been scheduled for September 16, 2025. Earnings per share stood at Rs 4.15 for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754386653929,
            "Source": "corporate_action"
        },
        {
            "Title": "BLS International Appoints New Chairman and Reports Strong Q1 Results",
            "Summary": "BLS International Services Ltd announced key leadership changes with Diwakar Aggarwal appointed as Chairman-Executive Director for three years and Nikhil Gupta re-appointed as Managing Director for another three-year term starting February 2026. The company reported consolidated revenue of Rs 71,056.53 lakhs for Q1 ended June 30, 2025, up from Rs 49,266.90 lakhs in the same quarter last year. Net profit increased to Rs 18,097.57 lakhs compared to Rs 12,078.47 lakhs in the previous year quarter. The company operates through two main segments: Visa and Consular Services generating Rs 46,068.85 lakhs and Digital Services contributing Rs 24,987.68 lakhs in revenue. The board also approved holding the 41st Annual General Meeting on September 16, 2025, and reconstituted the Stakeholder Relationship Committee.",
            "Sentiment": "positive",
            "PublishDate": 1754383065789,
            "Source": "corporate_governance"
        },
        {
            "Title": "BLS International Services Reports Strong Q1 Growth with Revenue Rising to 7.1B Rupees",
            "Summary": "BLS International Services delivered strong quarterly results with revenue increasing to 7.1 billion rupees from 4.9 billion rupees year-over-year. The company's EBITDA grew to 2.04 billion rupees compared to 1.33 billion rupees in the same period last year, while EBITDA margin improved to 28.74% from 27.03%. Consolidated net profit rose to 1.71 billion rupees from 1.2 billion rupees year-over-year, reflecting robust operational performance across key financial metrics.",
            "Sentiment": "positive",
            "PublishDate": 1754382463399,
            "Source": "earnings"
        },
        {
            "Title": "BLS International Services Schedules Earnings Conference Call for August 6, 2025",
            "Summary": "BLS International Services Limited will conduct an earnings conference call on August 6, 2025, at 4:00 PM IST to discuss the company's operational and financial performance for the first quarter ended June 30, 2025. The call will be moderated by Ambit Capital and will feature key company representatives including Managing Director Nikhil Gupta, Joint Managing Director Shikhar Aggarwal, CFO Amit Sudhakar, COO Digital Business Lokanath Panda, and Head of Investor Relations Gaurav Chugh. The company has provided dial-in numbers for domestic and international participants.",
            "Sentiment": "neutral",
            "PublishDate": 1753790165043,
            "Source": "earnings"
        },
        {
            "Title": "BLS International Establishes New Subsidiary in Ireland",
            "Summary": "BLS International has opened a new subsidiary in Ireland, expanding its international operations to include the Irish market.",
            "Sentiment": "positive",
            "PublishDate": 1752906060584,
            "Source": "stock"
        },
        {
            "Title": "BLS International Services Ltd.: Targets 20-25% Annual Growth Over Five Years",
            "Summary": "BLS International Services Ltd. aims for 20-25% annual growth over the next five years, driven by market expansion, strategic acquisitions, and increased government outsourcing. The company has renewed 90% of its contracts, providing clear revenue visibility. With over Rs 900 crore in net cash, BLS is exploring synergistic acquisitions to support growth.",
            "Sentiment": "positive",
            "PublishDate": 1752110630000,
            "Source": "normal_news"
        },
        {
            "Title": "BLS International Services Ltd. Block Trade: 660,247 Shares at Rs. 364.45",
            "Summary": "A block trade of approximately 660,247 shares of BLS International Services Ltd. took place on the National Stock Exchange (NSE). The total value of the trade was Rs. 24.06 Crores, with each share priced at Rs. 364.45.",
            "Sentiment": "neutral",
            "PublishDate": 1751860012000,
            "Source": "block_details"
        },
        {
            "Title": "BLS International Services: Billion-Dollar Contracts Fuel Growth Ambitions",
            "Summary": "BLS International Services aims for 25% annual growth over the next five years, driven by expanding global visa outsourcing market and renewed government contracts. The company currently holds 17% market share and expects the industry to reach $3-4 billion in two years. BLS has secured 90% of revenues from renewed contracts and plans to maintain strong EBITDA margins while improving operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1751613950000,
            "Source": "normal_news"
        },
        {
            "Title": "BLS International Services: Record-Breaking FY25 Financial Performance",
            "Summary": "BLS International Services reported its highest-ever financial results for FY25, with revenue up 30.8% to ₹2,193.3 crores, EBITDA surging 82.1% to ₹629.3 crores, and PAT growing 65.7% to ₹539.6 crores. Q4 FY25 saw revenue increase by 54.7% YoY to ₹692.8 crores. The company's growth was driven by strong performance in both Visa & Consular and Digital business segments.",
            "Sentiment": "positive",
            "PublishDate": 1747372182000,
            "Source": "earnings"
        },
        {
            "Title": "BLS International Services Reports Q4 Financial Results and Dividend",
            "Summary": "BLS International Services announced its Q4 consolidated net profit of 1.35 billion rupees, up from 808 million rupees year-over-year and 1.21 billion rupees quarter-over-quarter. Q4 revenue increased to 6.93 billion rupees from 4.5 billion rupees year-over-year. The company has recommended a final dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747354074000,
            "Source": "default"
        },
        {
            "Title": "BLS International Services Reports Strong Q4 Results and Recommends Dividend",
            "Summary": "BLS International Services has announced its Q4 financial results, showing significant year-over-year growth. The company's revenue increased to 6.93 billion rupees from 4.5 billion rupees in the previous year. EBITDA rose to 1.74 billion rupees from 903 million rupees, with the EBITDA margin improving to 25.13% from 20.17%. Consolidated net profit for Q4 reached 1.35 billion rupees, up from 808 million rupees year-over-year and 1.21 billion rupees quarter-over-quarter. Additionally, the company has recommended a final dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747329372000,
            "Source": "result"
        },
        {
            "Title": "BLS International Services Completes Acquisition in China",
            "Summary": "BLS International Services Singapore Pte Ltd, a subsidiary of BLS International Services, has successfully acquired 100% equity shares of Beijing Biaoshi Enterprise Consulting Co. Ltd., a company incorporated under Chinese law.",
            "Sentiment": "positive",
            "PublishDate": 1746460022000,
            "Source": "default"
        },
        {
            "Title": "BLS International Services to Acquire Beijing Biaoshi Enterprise Consulting",
            "Summary": "BLS International Services has announced plans to acquire Beijing Biaoshi Enterprise Consulting. This acquisition represents a significant corporate action that could potentially expand BLS International's presence in the Chinese market.",
            "Sentiment": "positive",
            "PublishDate": 1743466089000,
            "Source": "corporate_action"
        },
        {
            "Title": "BLS International Services Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade of BLS International Services Ltd. shares occurred on the National Stock Exchange (NSE). Approximately 510,114 shares were traded at Rs. 396.60 per share, totaling Rs. 20.23 crores in value.",
            "Sentiment": "neutral",
            "PublishDate": 1742980180000,
            "Source": "block_deals"
        },
        {
            "Title": "BLS International: Management to Meet SBI Mutual Fund, Stock Jumps 3%",
            "Summary": "BLS International's stock price rose over 3% following the announcement of a management meeting with SBI Mutual Fund scheduled for March 19, 2025. The company recently reported a 46.7% increase in Q3 FY25 net profit to ₹127.9 crore and a 17.1% rise in revenue to ₹512.8 crore. Despite recent acquisitions, BLS maintains a strong net cash position of ₹690 crore.",
            "Sentiment": "positive",
            "PublishDate": 1742197573000,
            "Source": "corporate_action"
        },
        {
            "Title": "BLS International Services Reports Q3 Revenue Growth",
            "Summary": "BLS International Services has reported a revenue of 5.1 billion rupees for the third quarter, compared to 4.38 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1739263465000,
            "Source": "earnings"
        },
        {
            "Title": "BLS International Services Reports Strong Q3 EBITDA Growth",
            "Summary": "BLS International Services has reported significant year-over-year growth in its Q3 EBITDA, which increased to 1.58 billion rupees from 886 million rupees. The company's EBITDA margin also improved substantially, rising to 30.82% from 20.23% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739263454000,
            "Source": "earnings"
        }
    ]
}