{
    "Symbol": "BLSE",
    "ISIN": "INE0NLT01010",
    "News": [
        {
            "Title": "BLS E-Services Q3FY26 Results & Interim Dividend",
            "Summary": "BLS E-Services reports consolidated revenue of ₹28,067.64 lakhs in Q3FY26, up 119.9% YoY. Net profit reaches ₹1,522.46 lakhs. Board declares interim dividend of ₹0.50 per share.",
            "Sentiment": "positive",
            "PublishDate": 1770298770172,
            "Source": "co_actions_results"
        },
        {
            "Title": "BLSE-Services Reports No Deviation in IPO Fund Utilization for September Quarter",
            "Summary": "BLSE-Services Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing proper utilization of IPO proceeds without any deviations. The company raised Rs 309.29 crore through its IPO in January-February 2024, with net proceeds of Rs 277.75 crore. During the reported quarter, the company utilized Rs 65.27 lakh for strengthening technology infrastructure and Rs 258.84 lakh for general corporate purposes. No funds were used for organic growth initiatives or acquisitions during this period. The company has Rs 162.71 crore in unutilized funds deployed in fixed deposits with Kotak Mahindra Bank. CRISIL Ratings Limited, serving as the monitoring agency, confirmed all utilization was in line with the prospectus and found no material deviations from disclosed objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1762906715358,
            "Source": "stock"
        },
        {
            "Title": "BLSE E-Services Reports 31% Rise in Quarterly Revenue to Rs 7,162.9 Lakhs",
            "Summary": "BLSE E-Services Limited announced quarterly results with revenue from operations reaching Rs 7,162.9 lakhs compared to Rs 5,137.4 lakhs in the previous quarter. Net profit for the quarter stood at Rs 1,812.6 lakhs versus Rs 1,359.9 lakhs in the prior quarter. For the half-year period, revenue increased to Rs 12,300.3 lakhs from Rs 9,751.8 lakhs in the same period last year. The company operates in digital services including e-governance, business correspondent services, and loan distribution. Total assets grew to Rs 71,708.5 lakhs as of September 30, 2025, from Rs 70,363.2 lakhs in March 2025. The company had raised Rs 30,829.29 lakhs through fresh equity issue, with funds allocated for technology infrastructure strengthening and setting up BLS stores for organic growth.",
            "Sentiment": "positive",
            "PublishDate": 1762804476043,
            "Source": "earnings"
        },
        {
            "Title": "BLSE-Services Reports Strong Q2 FY26 Results with 227% Revenue Growth",
            "Summary": "BLSE-Services Limited, a technology-enabled digital service provider, reported consolidated financial results for the quarter and half year ended September 30, 2025. Total income surged 226.8% year-on-year to Rs. 276.0 crores in Q2 FY26, while profit after tax increased 23.1% to Rs. 18.3 crores. For the half year, total income grew 216.2% to Rs. 527.2 crores and PAT rose 30.2% to Rs. 35.8 crores. The company's network expanded to over 147,000 touchpoints and 45,400 Channel Service Partners. Business Correspondent segment witnessed gross transaction value of over Rs. 27,300 crores during the quarter, including loan distribution of approximately Rs. 8,600 crores. The company entered new partnerships with Aditya Birla Capital, Piramal Finance, and Asit C. Mehta Investment Intermediaries to expand its service portfolio across financial products and mutual funds.",
            "Sentiment": "positive",
            "PublishDate": 1762789210377,
            "Source": "earnings"
        },
        {
            "Title": "BLS E-Services Outlines Growth Strategy Through Digital Infrastructure and Government Partnerships",
            "Summary": "BLS E-Services has outlined its growth strategy focusing on integration with digital public infrastructure and expansion of its Common Service Center (CSC) and e-governance service network across tier-3 and tier-4 towns. The company is targeting new government contracts and partnerships in the banking, financial services, and insurance (BFSI) sector. BLS E-Services aims to improve operating margins through automation and increasing non-government revenue contribution while strengthening its technology infrastructure for future scalability.",
            "Sentiment": "positive",
            "PublishDate": 1762786925415,
            "Source": "stock"
        },
        {
            "Title": "BLS E-Services Reports Mixed Q2 Results with Revenue Surge and Margin Decline",
            "Summary": "BLS E-Services delivered strong financial growth in its quarterly results. Revenue increased significantly to 2.7 billion rupees from 772 million rupees year-over-year. EBITDA rose to 200 million rupees compared to 135 million rupees in the same period last year. Consolidated net profit grew to 154 million rupees from 143 million rupees year-over-year. However, EBITDA margin contracted to 7.41% from 17.5% in the previous year period, indicating pressure on profitability despite revenue growth.",
            "Sentiment": "neutral",
            "PublishDate": 1762763694507,
            "Source": "earnings"
        },
        {
            "Title": "BLS E-Services Revises Final Dividend Record Date to September 9, 2025",
            "Summary": "BLS E-Services Limited has revised the record date for determining shareholders eligible to receive the final dividend for FY 2024-25 from September 8, 2025 to September 9, 2025. The change was made following advice from NSE and BSE due to September 8, 2025 being declared a clearing/settlement holiday by the Reserve Bank of India. The company is proposing a final dividend of ₹1 per share (10%) on equity shares of ₹10 each, subject to shareholder approval at the Annual General Meeting scheduled for September 15, 2025. The cut-off date for voting eligibility at the AGM remains unchanged at September 8, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757062225190,
            "Source": "corporate_action"
        },
        {
            "Title": "BLS E-Services Reports IPO Fund Utilization for Q1 2025, Shows Rs 18,532.63 Lakh Unutilized",
            "Summary": "BLS E-Services Limited submitted its monitoring agency report for the quarter ended June 30, 2025, detailing the utilization of proceeds from its Initial Public Offer. The company raised net proceeds of Rs 27,774.50 lakh through its IPO conducted from January 29 to February 1, 2024. During the quarter, the company utilized Rs 95.11 lakh, bringing total utilization to Rs 9,241.87 lakh since the IPO. Rs 18,532.63 lakh remains unutilized and is deployed in fixed deposits with Kotak Mahindra Bank earning returns between 7.40% to 7.50%. The funds were allocated across four objects: strengthening technology infrastructure (Rs 9,758.71 lakh), funding organic growth through BLS Stores (Rs 7,478.30 lakh), inorganic growth through acquisitions (Rs 2,871.00 lakh), and general corporate purposes (Rs 7,666.49 lakh). The monitoring agency CRISIL reported no deviations from the disclosed objects and confirmed all utilization was in line with the prospectus. The company's promoters include Mr. Diwakar Aggarwal, Mr. Shikhar Aggarwal, and BLS International Services Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1754387439780,
            "Source": "stock"
        },
        {
            "Title": "BLS E-Services Reports 205% Revenue Growth in Q1FY26, PAT Up 38.7%",
            "Summary": "BLS E-Services Limited announced strong quarterly results with total income rising 205.3% year-on-year to Rs. 251.2 crores, driven by expanded Business Correspondent operations and the Aadifidelis Solutions acquisition. Profit after tax grew 38.7% to Rs. 17.5 crores, while EBITDA increased 33.5% to Rs. 24.9 crores. The company's network expanded to over 144,000 touchpoints and 45,000+ Customer Service Points, processing gross transaction value of Rs. 26,200 crores including loan distribution of Rs. 7,200 crores. BLS signed a definitive agreement to acquire Customer Service Points from Sub-K Impact Solutions for Rs. 6.5 crores, pending regulatory approvals. The company launched new initiatives including ReKYC services, partnerships with Bajaj Finserv and HDFC Bank, digitization projects in Chhattisgarh, Aadhaar enrollment in Rajasthan, and courier services with Delhivery. BLS received recognition through multiple awards including The Times Business Award for Financial Inclusion and SBI Certificate of Excellence.",
            "Sentiment": "positive",
            "PublishDate": 1754298613930,
            "Source": "earnings"
        },
        {
            "Title": "BLS E-Services Reports Strong Revenue Growth Despite Margin Decline in Q1",
            "Summary": "BLS E-Services reported Q1 revenue of 2.4 billion rupees, representing significant growth from 753 million rupees in the same period last year. The company's EBITDA increased to 177 million rupees from 117 million rupees year-over-year. However, EBITDA margin contracted to 7.3% compared to 15.57% in the previous year, indicating reduced profitability despite higher absolute earnings.",
            "Sentiment": "neutral",
            "PublishDate": 1754292304078,
            "Source": "earnings"
        },
        {
            "Title": "BLS E-Services Reports 46% Jump in Quarterly Net Profit to 175 Million Rupees",
            "Summary": "BLS E-Services posted a consolidated net profit of 175 million rupees in its quarterly results, representing a significant increase from 120 million rupees in the same period last year. The company achieved a year-over-year growth of 46% in its bottom line performance.",
            "Sentiment": "positive",
            "PublishDate": 1754291869418,
            "Source": "earnings"
        },
        {
            "Title": "BLS E-Services: Subsidiary to Acquire SBI and HDFC Bank CSPs for ₹6.5 Crore",
            "Summary": "BLS E-Services' subsidiary Zero Mass Private Limited is set to acquire Customer Service Points of SBI and HDFC Bank from Sub-K Impact Solutions Limited for ₹6.5 crore. The deal includes 1,400 SBI CSP codes and 80 HDFC CSP codes across multiple states, serving 4.75 million customers annually with ₹8,300 crore in transaction volume.",
            "Sentiment": "positive",
            "PublishDate": 1750782991000,
            "Source": "corporate_action"
        },
        {
            "Title": "BLS e-Services: Major Expansion of Business Correspondent Network Planned",
            "Summary": "BLS e-services aims to expand its Business Correspondent network from 44,800 to over 60,000 agents by 2026-27, focusing on rural and semi-urban areas. The company plans to invest in AI-led analytics and process automation through its BLS Sewa platform.",
            "Sentiment": "positive",
            "PublishDate": 1747743684000,
            "Source": "normal_news"
        },
        {
            "Title": "BLS E-Services Limited: Revenue Surpasses ₹500 Crore Milestone in FY25",
            "Summary": "BLS E-Services Limited reported a 76% YoY increase in total income to ₹545 crore for FY25. Profit after tax grew 75.4% to ₹58.8 crore. The company declared a maiden dividend of ₹1 per share. Q4 total income rose 211.5% to ₹245.2 crore, with PAT up 58.7% to ₹17.3 crore. The company facilitated 14 crore transactions with a GTV exceeding ₹87,000 crore in FY25.",
            "Sentiment": "positive",
            "PublishDate": 1747288150000,
            "Source": "earnings"
        },
        {
            "Title": "BLS E-Services Reports Q4 Results and Declares Dividend",
            "Summary": "BLS E-Services announced its Q4 financial results, showing significant year-over-year growth in revenue and EBITDA. The company's Q4 revenue increased to 2.39 billion rupees from 736.5 million rupees in the previous year. EBITDA rose to 194.2 million rupees from 108.9 million rupees, although the EBITDA margin decreased to 8.12% from 14.78%. Consolidated net profit for Q4 reached 132 million rupees, up from 103.1 million rupees year-over-year. The company also recommended a final dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747243000000,
            "Source": "result"
        },
        {
            "Title": "BLS E-Services Reports Significant Growth in Q3 Financial Results",
            "Summary": "BLS E-Services has announced its Q3 financial results, showing substantial year-over-year growth. The company's consolidated net profit increased to 131 million rupees, up from 75 million rupees in the same quarter last year. Revenue also saw a significant rise, reaching 1.28 billion rupees compared to 717 million rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739233357000,
            "Source": "earnings"
        },
        {
            "Title": "BLS E-Services Reports Q3 EBITDA Growth",
            "Summary": "BLS E-Services has announced its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 158 million rupees, up from 103 million rupees in the same quarter of the previous year. However, the EBITDA margin decreased to 12.37% from 14.39% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739192551000,
            "Source": "earnings"
        },
        {
            "Title": "BLS E-Services Acquires Controlling Stake in Aadifidelis Solutions",
            "Summary": "BLS E-Services has completed the acquisition of a 57% controlling stake in Aadifidelis Solutions & its affiliates (ASPL). The transaction was valued at approximately 1.23 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1732666573000,
            "Source": "corporate_action"
        },
        {
            "Title": "BLS E-Services Acquires Controlling Stake in Aadifidelis Solutions",
            "Summary": "BLS E-Services has completed the acquisition of a 57% controlling stake in Aadifidelis Solutions & its affiliates (ASPL). The acquisition was made for a total consideration of approximately 1.23 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1732632535000,
            "Source": "corporate_action"
        },
        {
            "Title": "BLS E-SERVICES Reports Q2 EBITDA Growth",
            "Summary": "BLS E-SERVICES announced its Q2 financial results, showing an EBITDA of 135 million rupees, up from 120 million rupees in the same quarter last year. The company's EBITDA margin also improved to 17.5% from 14.9% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731312449000,
            "Source": "result"
        },
        {
            "Title": "BLS E-Services Reports Q2 Revenue Decline",
            "Summary": "BLS E-Services has reported a revenue of 772 million rupees for the second quarter, down from 808 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731312347000,
            "Source": "result"
        },
        {
            "Title": "BLS E-Services Reports Strong Q2 Profit Growth",
            "Summary": "BLS E-Services has reported a significant increase in consolidated net profit for the second quarter. The company's net profit rose to 143 million rupees, up from 85 million rupees in the same period last year, representing a year-over-year growth of approximately 68%.",
            "Sentiment": "positive",
            "PublishDate": 1731312294000,
            "Source": "result"
        }
    ]
}