{
    "Symbol": "BLUEDART",
    "ISIN": "INE233B01017",
    "News": [
        {
            "Title": "Blue Dart uploads investor presentation for Jan 2026",
            "Summary": "Blue Dart Express Limited has uploaded its investor presentation for January 2026 on the company website, providing shareholders with comprehensive business updates and financial performance data.",
            "Sentiment": "neutral",
            "PublishDate": 1770145774406,
            "Source": "stocks"
        },
        {
            "Title": "Blue Dart Q3FY26 Results: Revenue Up 6.9% YoY",
            "Summary": "Blue Dart Express reported Q3FY26 revenue of ₹1,616.16 crore, up 6.9% YoY. Net profit stood at ₹70.04 crore vs ₹79.12 crore in Q3FY25, impacted by exceptional items of ₹44.23 crore related to new Labour Codes implementation.",
            "Sentiment": "neutral",
            "PublishDate": 1769778380670,
            "Source": "co_actions_results"
        },
        {
            "Title": "HDFC Mutual Fund Increases Blue Dart Stake to 7.17%",
            "Summary": "HDFC Mutual Fund disclosed an increase in its shareholding in Blue Dart Express Ltd from 5.01% to 7.17% as of January 20, 2026, acquiring 5,12,018 shares through open market transactions.",
            "Sentiment": "positive",
            "PublishDate": 1769148373451,
            "Source": "mutualfunds"
        },
        {
            "Title": "Blue Dart Express Block Trade Worth ₹32.68 Crores",
            "Summary": "Blue Dart Express witnessed a significant block trade on NSE involving 60,277 shares at ₹5,422.00 per share, totaling ₹32.68 crores, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768278455161,
            "Source": "co_actions_results"
        },
        {
            "Title": "Blue Dart Reports Record 14,000 Tonnes Daily Cargo",
            "Summary": "Blue Dart Express delivered 47 million parcels in 2025, with peak day handling 14,000 tonnes. Tier-2 cities drove 60% shipment growth as company expanded across 56,400 locations nationwide.",
            "Sentiment": "positive",
            "PublishDate": 1768221743197,
            "Source": "stocks"
        },
        {
            "Title": "Blue Dart Unveils India Delivery Trends Outlook 2025",
            "Summary": "Blue Dart Express Limited launches its first-ever annual trends outlook 'India on the Move 2025', revealing record delivery volumes of 47 million secured parcels and 2 billion kilometers covered by road.",
            "Sentiment": "positive",
            "PublishDate": 1768203805813,
            "Source": "stocks"
        },
        {
            "Title": "Blue Dart Shares Rise 9% on Price Hike & Tax Relief",
            "Summary": "Blue Dart Express shares surged 9% after announcing 9-12% price hikes from January 2026 and receiving major GST relief with tax demand reduced from ₹421 crore to ₹64.98 lakh.",
            "Sentiment": "positive",
            "PublishDate": 1767233855205,
            "Source": "stocks"
        },
        {
            "Title": "Blue Dart Unit Gets Relief in ₹420 Cr GST Case",
            "Summary": "Blue Dart Aviation receives major relief as GST authorities drop ₹420.14 crore demand, confirming only ₹64.98 lakh liability. Company voluntarily pays confirmed amount to avoid litigation.",
            "Sentiment": "positive",
            "PublishDate": 1767182738847,
            "Source": "stocks"
        },
        {
            "Title": "BlueDart Wins Golden Peacock Award for Corporate Governance Excellence at London Convention",
            "Summary": "BlueDart Express Limited received the prestigious Golden Peacock Award for Excellence in Corporate Governance 2025 from the Institute of Directors, India at the London Global Convention. The recognition highlights BlueDart's commitment to transparency, accountability and ethical conduct, reinforcing its position as a trusted leader in the logistics sector.",
            "Sentiment": "positive",
            "PublishDate": 1763450291609,
            "Source": "corporate_governance"
        },
        {
            "Title": "BlueDart Express Reports 6.6% Revenue Growth with Strong B2C Performance in Q2",
            "Summary": "BlueDart Express Limited reported revenue from operations of INR 15,493 million and profit after tax of INR 795 million for the quarter and half year ended September 30, 2025. The company achieved 6.6% blended revenue growth with B2C segment growing 17.9% and B2B segment growing 2.5%. Total shipments reached 106.28 million with tonnage of 363,974 tons, representing 10% growth in shipments and 5.9% growth in weight. Ground e-commerce segment showed strong performance with 30% growth, while overall B2C business maintained 18% growth. The company operates with a 70-30 split between B2B and B2C segments. E-commerce accounts for approximately 30% of revenue while documents contribute 25-30%. BlueDart launched a Digital Account Opening platform enabling businesses to onboard in under 10 minutes and unveiled a green integrated ground facility at Pataudi, Haryana. The company reported improved profit margins at 7% PBT level, attributed to favorable customer mix, product profile changes, and operational improvements. Aircraft utilization remains at optimal levels above 85% on a volumetric basis.",
            "Sentiment": "positive",
            "PublishDate": 1762750696564,
            "Source": "earnings"
        },
        {
            "Title": "Blue Dart Loses 70kg Appliance Shipment After 10-Day Delivery Saga",
            "Summary": "Aviation journalist Ajay Awtaney reported that Blue Dart lost a 70kg appliance shipment after a 10-day ordeal involving repeated false delivery failure notifications. The cash-on-delivery package was marked as 'Consignee Not Available' or 'Premises Closed' multiple times despite Awtaney's confirmed availability. The delivery failures occurred because the assigned delivery agent did not know how to process payment-on-delivery transactions. Blue Dart confirmed the shipment is now untraceable and under security investigation. Awtaney criticized the logistics company's reliance on COD systems and inability to handle modern payment methods for higher-value items.",
            "Sentiment": "negative",
            "PublishDate": 1762506878428,
            "Source": "stock"
        },
        {
            "Title": "Blue Dart Express Provides Business Guidance on Margins, E-commerce Strategy and Capital Expenditure",
            "Summary": "Blue Dart Express shared guidance during a conference call covering three key areas. The company indicated it will work to improve margins from current levels but did not provide specific targets. For e-commerce growth, the company declined to provide specific projections for the second half, stating only that it aims to play a bigger role as the industry grows. Regarding capital expenditure, the company suggested spending would remain in line with historical levels of around INR 250-260 crore, unless major new opportunities arise.",
            "Sentiment": "neutral",
            "PublishDate": 1762228033279,
            "Source": "stock"
        },
        {
            "Title": "Blue Dart Express Reports ₹795 Million Profit for Q2FY26 with Revenue at ₹15,493 Million",
            "Summary": "Blue Dart Express Limited announced its quarterly results for the period ended September 30, 2025. The company reported a profit after tax of ₹795 million and revenue from operations of ₹15,493 million for the quarter. On a standalone basis, the company posted net profit of ₹7,950 million for the quarter compared to ₹6,076 million in the same period last year. Revenue from operations increased to ₹154,933 million from ₹144,846 million year-over-year. For the half-year period, standalone net profit reached ₹12,643 million versus ₹11,229 million in the previous year, with revenue at ₹299,125 million compared to ₹279,117 million. The company paid a final dividend of ₹25 per share for the year ended March 31, 2025, totaling ₹5,932 lakhs. Blue Dart continues strategic investments in ground hubs and automation to enhance network capacity. The company launched a Digital Account Opening platform and unveiled a Green Integrated Ground Hub at Pataudi, Haryana.",
            "Sentiment": "positive",
            "PublishDate": 1761657601382,
            "Source": "earnings"
        },
        {
            "Title": "Blue Dart Express Opens Green Integrated Ground Hub in Pataudi",
            "Summary": "Blue Dart Express has opened a new green integrated ground hub in Pataudi. The facility is designed to enhance connectivity, scalability, and efficiency. The hub includes sustainability features such as solar power and electric vehicle charging stations.",
            "Sentiment": "positive",
            "PublishDate": 1760521522476,
            "Source": "stock"
        },
        {
            "Title": "Blue Dart Express Launches 10-Minute Digital Account Opening for Businesses",
            "Summary": "Blue Dart Express has introduced an instant digital account opening service that allows businesses to create accounts in just 10 minutes and begin shipping immediately. The new digital service streamlines the onboarding process for business customers seeking logistics services.",
            "Sentiment": "positive",
            "PublishDate": 1760005195642,
            "Source": "stock"
        },
        {
            "Title": "Blue Dart Announces 9-12% Price Increase Starting January 2026",
            "Summary": "Blue Dart has announced a general price increase of 9-12% that will take effect on January 1, 2026. The company will exempt new customers who are onboarded between October and December 2025 from this price increase.",
            "Sentiment": "neutral",
            "PublishDate": 1759142200616,
            "Source": "stock"
        },
        {
            "Title": "Blue Dart Express Launches 'Diwali Express' Deal With Up To 60% Discount on Gift Shipments",
            "Summary": "Blue Dart Express has introduced a 'Diwali Express' promotional offer providing discounts of up to 60% on gift shipments. The deal is available until October 27, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758619187461,
            "Source": "stock"
        },
        {
            "Title": "Blue Dart Subsidiary Faces ₹420 Crore GST Demand Notice",
            "Summary": "Blue Dart's subsidiary has received a show-cause notice from the Commissioner of GST & Central Excise demanding ₹420 crore in GST payments. The company is currently assessing the impact of this demand notice.",
            "Sentiment": "negative",
            "PublishDate": 1758020689951,
            "Source": "stock"
        },
        {
            "Title": "Blue Dart Express Reports Q1 FY2026 Results with Revenue Growth Despite Margin Pressure",
            "Summary": "Blue Dart Express reported revenue from operations of Rs. 1,441.9 million and profit after tax of Rs. 169 million for the quarter ended June 30, 2025. The company processed 94.1 million parcels and handled 340,068 thousand tons during the quarter. EBITDA margin declined to 14.15% from 15.63% in the same quarter last year. B2C segment showed strong growth of 20% while B2B segment grew 2.4%. The company launched India's largest integrated operating facility at Bijwasan in New Delhi and expanded its network with Guwahati as a direct flying location. Blue Dart operates eight freighters (six 757s and two 737s) with seven owned and one leased. The company maintains 71% B2B and 29% B2C revenue mix. Management attributed margin pressure to changes in customer mix and product mix, with heavier parcels growing faster than lighter shipments. Surface segment revenue grew 13% while air segment grew 2.2%. Aircraft capacity utilization remained around 85%. Sagar Patil was appointed as Chief Financial Officer effective August 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754566722548,
            "Source": "earnings"
        },
        {
            "Title": "Blue Dart Express Appoints Sagar Patil as Chief Financial Officer",
            "Summary": "Blue Dart Express Limited has appointed Sagar Patil as Chief Financial Officer, effective August 1, 2025. The appointment was approved by the Board of Directors at a meeting held in Mumbai. Patil, a Chartered Accountant with over 25 years of finance experience, has been with Blue Dart for over eight years, serving in roles including Corporate Controller, Head - Corporate Accounts, and Interim CFO. His career includes leadership positions at DHL Express India, Burger King India, Shell Lubricants, and Owens Corning India. Managing Director Balfour Manuel praised Patil's understanding of Blue Dart's business and financial acumen. Patil expressed gratitude for the opportunity and commitment to driving financial strategies to support the company's growth in the logistics industry.",
            "Sentiment": "positive",
            "PublishDate": 1754563975844,
            "Source": "corporate_governance"
        },
        {
            "Title": "Blue Dart Express Releases Investor Presentation Highlighting Market Leadership and Growth Strategy",
            "Summary": "Blue Dart Express Limited has released an investor presentation outlining its position as India's leading express and parcels delivery company. The company operates 6 Boeing 757-200 and 2 Boeing 737-800 aircraft, covering 56,400+ locations with over 12,725 employees. For FY2024-25, Blue Dart reported sales of ₹57,202 million, EBITDA of ₹5,739 million, and PAT of ₹3,359 million, handling 377 million shipments totaling 1,340 thousand tonnes. The Board has recommended a dividend of ₹25 per share for FY2024-25. DHL Group holds 75% shares in the company. The presentation highlights Blue Dart's strategic focus on maintaining market leadership in B2B air express, expanding eCommerce capabilities, and investing in technology including drone delivery services currently operational in Gurugram. The company emphasizes its debt-free structure and plans for profitable growth through enhanced digital solutions, expanded network coverage, and focus on small and medium enterprises.",
            "Sentiment": "positive",
            "PublishDate": 1754034749897,
            "Source": "stock"
        },
        {
            "Title": "Blue Dart Express Reports Mixed Q1 Results with Revenue Growth and Profit Decline",
            "Summary": "Blue Dart Express announced its Q1 consolidated results showing net profit of 469 million rupees compared to 515 million rupees in the same quarter last year, representing a decline. However, the company's revenue increased to 14.41 billion rupees from 13.4 billion rupees year-over-year, indicating growth in top-line performance despite lower profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1753794739099,
            "Source": "earnings"
        },
        {
            "Title": "Blue Dart Express Appoints Sagar Patil as Chief Financial Officer",
            "Summary": "Blue Dart Express Limited appointed Mr. Sagar Patil as Chief Financial Officer effective August 1, 2025. Patil, who was serving as Interim CFO, will continue as a Key Managerial Personnel of the company. The appointment was approved by the Board of Directors in their meeting held on July 29, 2025. Patil is a Chartered Accountant with over 15 years of experience and has been with Blue Dart for more than 8 years, working in various finance roles including Corporate Controller, Head-Corporate Accounts and Interim CFO. Prior to Blue Dart, he worked with companies including Burger King India, Shell Lubricants, Owens Corning India, and served as CFO for OHL Express India.",
            "Sentiment": "positive",
            "PublishDate": 1753794545224,
            "Source": "corporate_governance"
        },
        {
            "Title": "Blue Dart Express Q4 Results and Dividend Announcement",
            "Summary": "Blue Dart Express reported its Q4 financial results. The company's revenue increased to 14.17 billion rupees from 13.23 billion rupees year-over-year. However, EBITDA decreased to 2.13 billion rupees from 2.26 billion rupees, with EBITDA margin falling to 15.04% from 17.08%. Consolidated net profit declined to 551.5 million rupees from 777.8 million rupees year-over-year, but improved from 810 million rupees quarter-on-quarter. The company also recommended a dividend of 25 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1748272613000,
            "Source": "result"
        },
        {
            "Title": "Blue Dart Express to Consider Q4 Results on May 26",
            "Summary": "Blue Dart Express has announced that it will consider and approve its financial results for the fourth quarter on May 26.",
            "Sentiment": "neutral",
            "PublishDate": 1746792389000,
            "Source": "default"
        },
        {
            "Title": "Blue Dart Express: Partnership with Delhi Metro for Eco-Friendly Cargo Transport",
            "Summary": "Blue Dart Express partners with Delhi Metro Rail Corp. to move cargo in Delhi, aiming to reduce carbon footprint. The company plans to eliminate diesel vehicles in Delhi by year-end, aligning with its 2050 zero-carbon goal. Currently, about 70% of Blue Dart's 150-tonne daily cargo in Delhi NCR is transported via metro.",
            "Sentiment": "positive",
            "PublishDate": 1742447982000,
            "Source": "corporate_action"
        },
        {
            "Title": "Blue Dart Express Reports Q3 FY24 Financial Results",
            "Summary": "Blue Dart Express announced its Q3 consolidated net profit of 810 million rupees, down from 889 million rupees year-over-year but up from 629 million rupees quarter-over-quarter. The company's Q3 revenue increased to 15.1 billion rupees from 13.8 billion rupees in the same quarter last year. Additionally, Blue Dart Express has renewed its ACMI (Aircraft, Crew, Maintenance, and Insurance) agreement with Blue Dart Aviation for a period of 5 years.",
            "Sentiment": "neutral",
            "PublishDate": 1738197199000,
            "Source": "earnings"
        },
        {
            "Title": "Blue Dart Express Renews ACMI Agreement with Blue Dart Aviation",
            "Summary": "Blue Dart Express has announced the renewal of its Aircraft, Crew, Maintenance, and Insurance (ACMI) agreement with Blue Dart Aviation for a period of 5 years. This renewal indicates a continued strategic partnership between the two companies in the logistics and aviation sector.",
            "Sentiment": "positive",
            "PublishDate": 1738164007000,
            "Source": "corporate_action"
        },
        {
            "Title": "Blue Dart Express Reports Improved Q3 EBITDA and Margin",
            "Summary": "Blue Dart Express has announced its Q3 financial results. The company's EBITDA increased to 2.39 billion rupees from 2.1 billion rupees in the same quarter last year. Additionally, the EBITDA margin improved to 15.83% from 15.43% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738160088000,
            "Source": "earnings"
        },
        {
            "Title": "Blue Dart Express Reports Q3 Financial Results",
            "Summary": "Blue Dart Express has announced its Q3 consolidated net profit of 810 million rupees, showing a year-over-year decrease from 889 million rupees. However, it represents an increase from the previous quarter's 629 million rupees. The company's Q3 revenue stood at 15.1 billion rupees, up from 13.8 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738160026000,
            "Source": "earnings"
        },
        {
            "Title": "Blue Dart Launches Affiliate Program for Technology Partners in Logistics",
            "Summary": "Blue Dart, a logistics company, has introduced an affiliate program aimed at fostering innovation in the logistics sector. The program is designed to collaborate with technology partners, potentially enhancing Blue Dart's logistics capabilities through technological advancements.",
            "Sentiment": "positive",
            "PublishDate": 1733357080000,
            "Source": "corporate_action"
        },
        {
            "Title": "Blue Dart Launches Affiliate Program for Technology Partners in Logistics",
            "Summary": "Blue Dart has introduced an affiliate program aimed at fostering innovation in the logistics sector by partnering with technology companies. This initiative is designed to drive advancements and improvements in logistics operations through collaborative efforts with tech partners.",
            "Sentiment": "positive",
            "PublishDate": 1733311756000,
            "Source": "corporate_action"
        },
        {
            "Title": "Blue Dart Express Q2 Financial Results",
            "Summary": "Blue Dart Express reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) was 2.18 billion rupees, slightly down from 2.23 billion rupees in the same quarter last year. The EBITDA margin decreased to 15.05% from 16.82% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731339523000,
            "Source": "result"
        },
        {
            "Title": "Blue Dart Express Reports Q2 Financial Results",
            "Summary": "Blue Dart Express announced its Q2 consolidated net profit of 628 million rupees, showing a year-over-year decrease from 730.6 million rupees and a quarter-over-quarter increase from 534 million rupees. The company's Q2 revenue rose to 14.5 billion rupees from 13.24 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731339473000,
            "Source": "result"
        },
        {
            "Title": "Blue Dart Express Ltd: Large Block Trade on NSE",
            "Summary": "A significant block trade occurred for Blue Dart Express Ltd on the National Stock Exchange (NSE). Approximately 64,347 shares were traded at a price of Rs. 8520.55 per share, totaling Rs. 54.83 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1729154556000,
            "Source": "block_deals"
        },
        {
            "Title": "Blue Dart Announces Diwali Discounts on Shipments",
            "Summary": "<p>Blue Dart is offering <span class=\"positive\">special Diwali discounts</span> on both domestic and international shipments. Customers can avail a <b>40% discount</b> on domestic shipments and a <b>50% discount</b> on international non-document shipments as part of their <span class=\"positive\">Diwali Express promotion</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728370452000,
            "Source": "corporate_action"
        },
        {
            "Title": "Blue Dart: Price Hike Announced for 2025",
            "Summary": "<p>Blue Dart Express Ltd. will implement a <span class='neutral'>general price increase</span> of <span class='negative'>9-12%</span> from <b>January 1, 2025</b>, to cover <span class='negative'>rising operational costs</span> and <span class='positive'>maintain service quality</span> amidst <span class='negative'>inflationary pressures</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1727693040000,
            "Source": "corporate_action"
        }
    ]
}