{
    "Symbol": "BLUESTARCO",
    "ISIN": "INE472A01039",
    "News": [
        {
            "Title": "Blue Star Reports Unauthorized Data Access Incident",
            "Summary": "Blue Star Limited disclosed unauthorized access to product installation data on January 31, 2026, and has taken immediate steps to restrict access while working with cybersecurity experts.",
            "Sentiment": "negative",
            "PublishDate": 1769961452244,
            "Source": "stocks"
        },
        {
            "Title": "Blue Star Expects Strong Q4 Performance Across Segments",
            "Summary": "Blue Star management anticipates robust fourth quarter performance across room air conditioners, commercial ACs, and refrigeration segments during recent conference call discussions.",
            "Sentiment": "positive",
            "PublishDate": 1769754419874,
            "Source": "stocks"
        },
        {
            "Title": "Blue Star Raises Prices in Q4 Due to Cost Pressures",
            "Summary": "Blue Star announces upward price revision in Q4 citing rupee depreciation and rising commodity prices as key factors compelling the adjustment during management concall.",
            "Sentiment": "neutral",
            "PublishDate": 1769754389992,
            "Source": "stocks"
        },
        {
            "Title": "Blue Star Expects Margin Pressure In FY27",
            "Summary": "Blue Star anticipates margin pressure in FY27, according to ET Now report. The company's management outlook suggests potential challenges ahead for profitability metrics.",
            "Sentiment": "negative",
            "PublishDate": 1769750524699,
            "Source": "stocks"
        },
        {
            "Title": "Blue Star Q3 Net Profit Drops 38% to ₹807 Million",
            "Summary": "Blue Star reported consolidated net profit of ₹807 million in Q3, declining 38% from ₹1.30 billion year-on-year, missing analyst estimates of ₹1.27 billion.",
            "Sentiment": "negative",
            "PublishDate": 1769682640013,
            "Source": "co_actions_results"
        },
        {
            "Title": "Blue Star announces board changes, MD re-appointment",
            "Summary": "Blue Star Limited announces significant board changes including re-appointment of Managing Director B Thiagarajan, appointment of two new directors, and completion of Sam Balsara's tenure as Independent Director.",
            "Sentiment": "positive",
            "PublishDate": 1769682445537,
            "Source": "stocks"
        },
        {
            "Title": "Blue Star Shares Drop 2.05% Despite Strong Annual Growth",
            "Summary": "Blue Star shares declined 2.05% to Rs 1,663.30 despite reporting strong annual revenue growth from Rs 4,263.59 crore in 2021 to Rs 11,967.65 crore in 2025, with net profit rising to Rs 592.61 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1769508535761,
            "Source": "stocks"
        },
        {
            "Title": "Blue Star schedules Q3FY26 earnings call for Jan 30",
            "Summary": "Blue Star Limited announces investor conference call on January 30, 2026, at 11:30 AM IST to discuss Q3 and nine-month financial results ended December 31, 2025, with management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1769104153950,
            "Source": "co_actions_results"
        },
        {
            "Title": "Blue Star Executive Director Resigns Due to Personal Reasons",
            "Summary": "Blue Star Limited announces resignation of Executive Director P Venkata Rao, who served the company for over 37 years, effective February 28, 2026, citing personal reasons.",
            "Sentiment": "neutral",
            "PublishDate": 1768467473511,
            "Source": "stocks"
        },
        {
            "Title": "Blue Star Block Trade Worth ₹18.18 Crores on NSE",
            "Summary": "Blue Star Ltd. witnessed a significant block trade on NSE involving 100,262 shares valued at ₹18.18 crores, executed at ₹1,812.80 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767759848092,
            "Source": "co_actions_results"
        },
        {
            "Title": "Blue Star Optimistic About FY27 Sales Growth Trajectory",
            "Summary": "Blue Star management expresses positive outlook for FY27 performance, citing improving sales trends in recent business developments according to CNBC TV18 report.",
            "Sentiment": "positive",
            "PublishDate": 1767155039135,
            "Source": "stocks"
        },
        {
            "Title": "Blue Star Board Meet Set for Q3 FY26 Results",
            "Summary": "Blue Star Limited announces Board meeting on January 29, 2026, to approve Q3 FY26 financial results. Trading window closed from January 1-31, 2026 for designated persons under insider trading regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1766592326500,
            "Source": "co_actions_results"
        },
        {
            "Title": "Blue Star Reports 10% Business Decline During Summer Season",
            "Summary": "Blue Star experienced a 10% drop in business during the summer season. The decline affects the company's performance during what is typically a peak period for air conditioning and cooling equipment demand.",
            "Sentiment": "negative",
            "PublishDate": 1763611880913,
            "Source": "stock"
        },
        {
            "Title": "Blue Star Reports 6.4% Revenue Growth Amid Challenging Quarter with Weather and GST Disruptions",
            "Summary": "Blue Star Limited reported revenue growth of 6.4% to Rs. 2,422 crores in Q2 FY26 compared to Rs. 2,276 crores in Q2 FY25. Net profit increased 2.8% to Rs. 99 crores from Rs. 96 crores in the previous year. EBITDA margin improved to 7.6% from 6.6% in Q2 FY25. The company faced multiple challenges including prolonged rains, lower temperatures impacting secondary sales, and GST rate reduction announcement on August 15, 2025, which deferred demand until implementation on September 22, 2025. The Electro-Mechanical Projects and Commercial Air Conditioning segment grew 16.5% to Rs. 1,664 crores with margins improving to 8.8%. The Unitary Products segment declined 9.5% to Rs. 694 crores. Carried-forward order book grew 7.9% to Rs. 7,120 crores. The company moved from net cash position of Rs. 185 crores to net borrowings of Rs. 417 crores. Management revised growth guidance from positive 5% to flat growth for the year, citing high inventory levels of 65 days versus ideal 45 days and continued weather disruptions.",
            "Sentiment": "neutral",
            "PublishDate": 1762947965418,
            "Source": "earnings"
        },
        {
            "Title": "Blue Star Shares Drop 6% as Company Cuts Revenue Growth Guidance to Flat",
            "Summary": "Blue Star shares declined over 6% after management revised its revenue growth guidance to flat from the previous 5% projection. The company reported challenges during the festive season despite GST rate reductions on consumer durables like air conditioners. Blue Star maintains a 65-day inventory that needs clearing before energy norm changes in January 2026. Management expects the Room AC industry to decline 15% but believes Blue Star will outpace industry growth while maintaining current margin levels. The company projects EBITDA margins of 7% to 7.5% for both EMP and UCP segments for the remainder of the year. Shares traded 5.5% lower at ₹1,814.4, down 10% from daily highs.",
            "Sentiment": "negative",
            "PublishDate": 1762411995472,
            "Source": "stock"
        },
        {
            "Title": "Blue Star Reports Revenue Drop in Air Conditioning Business Due to Extended Monsoon",
            "Summary": "Blue Star experienced a decline in revenue for its air conditioning business, which the company attributes to an extended monsoon season.",
            "Sentiment": "negative",
            "PublishDate": 1762410446084,
            "Source": "stock"
        },
        {
            "Title": "Blue Star Appoints Manish Jha as Senior Management Personnel for Manufacturing",
            "Summary": "Blue Star Limited appointed Manish Jha as Group President, Manufacturing and Senior Management Personnel effective November 5, 2025. The appointment was made by the Board of Directors following recommendations from the Nomination and Remuneration Committee. Jha is a Mechanical Engineering graduate from NIT Patna with a Post-Graduate Diploma in Business Management from IIM Indore. He brings over 26 years of experience in manufacturing and supply chain operations from Tata Motors and Tata Cummins, where he spent 16 years overseeing manufacturing and supply chain operations across six manufacturing units. He was previously Head of Supply Chain at Tata Motors Commercial Vehicles.",
            "Sentiment": "positive",
            "PublishDate": 1762372075464,
            "Source": "corporate_governance"
        },
        {
            "Title": "Blue Star Reports 2.9% Growth in Q2 Net Profit to 990.1M Rupees",
            "Summary": "Blue Star reported consolidated net profit of 990.1 million rupees for Q2, compared to 962 million rupees in the same period last year. Revenue increased to 24.22 billion rupees from 22.75 billion rupees year-over-year. EBITDA rose to 1.83 billion rupees from 1.5 billion rupees, while EBITDA margin improved to 7.57% from 6.56% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762340847713,
            "Source": "earnings"
        },
        {
            "Title": "Blue Star Grants 80,431 Stock Options to Employees Under ESOP 2024",
            "Summary": "Blue Star Limited's Nomination and Remuneration Committee approved the grant of 80,431 stock options to eligible employees under the Blue Star Employees Stock Option Scheme 2024. Each stock option represents one equity share with a face value of Rs 2, priced at Rs 2 per option. The options will vest in four equal installments of 25% each over 12, 24, 36, and 48 months from the grant date, subject to performance criteria. Vested options can be exercised within 7 years from the grant date.",
            "Sentiment": "positive",
            "PublishDate": 1761903362634,
            "Source": "corporate_action"
        },
        {
            "Title": "Blue Star Schedules Board Meeting for November 5 to Review Q2 Results",
            "Summary": "Blue Star has announced that its board of directors will convene on November 5 to review the company's second quarter financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1758803456145,
            "Source": "corporate_action"
        },
        {
            "Title": "Blue Star Ltd. Sees Block Trade Worth Rs. 57.76 Crores on NSE",
            "Summary": "Blue Star Ltd. witnessed a block trade on the National Stock Exchange involving approximately 291,197 shares at a price of Rs. 1,983.40 per share. The total transaction value amounted to Rs. 57.76 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1758516942422,
            "Source": "order&deals"
        },
        {
            "Title": "Blue Star MD Warns AC Sales Could Drop 50% Due to Pending GST Reforms",
            "Summary": "B Thiagarajan, Managing Director of Blue Star, predicts air conditioner sales may decline by up to 50% in the short term as consumers delay purchases awaiting proposed GST reforms. The reforms are expected to reduce GST on ACs from 28% to 18% under a new two-slab structure (5% and 18%) announced by PM Modi during his Independence Day speech. The changes are expected to roll out by October, around Diwali. Thiagarajan noted that August sales will be severely impacted as customers postpone purchases to benefit from lower taxes. He emphasized that early notification of the new rates, ideally before September 1, would minimize industry pain during the festive season including Ganesh Chaturthi, Navratri and Diwali. While B2B customers may continue purchasing due to input tax credit benefits, individual consumers are likely to wait. Dealers are expected to take bookings rather than immediate sales. Despite short-term challenges, Thiagarajan expects the AC industry to achieve 15-20% growth for FY26 once the reforms are implemented.",
            "Sentiment": "neutral",
            "PublishDate": 1755936530787,
            "Source": "stock"
        },
        {
            "Title": "Blue Star Reports Disappointing Q1 FY26 Results Due to Unseasonal Rains Impacting Room AC Sales",
            "Summary": "Blue Star Limited reported mixed quarterly results with revenue growing 4.1% to Rs. 2,982 crores but net profit declining to Rs. 120.82 crores from Rs. 168.76 crores in the previous year. The company faced significant headwinds from unseasonal rains that severely impacted Room Air Conditioner demand during the summer season. EBITDA margin compressed to 6.7% from 8.3% in the prior year. However, the B2B business segments showed resilience with Electro-Mechanical Projects growing 35.9% and order book reaching an all-time high of Rs. 6,843 crores. The Unitary Products segment declined 13.3% due to poor Room AC sales, though the company gained market share to approximately 14.2%. Management expects demand revival during the festive season and maintains optimism for double-digit growth for the full year, supported by strong B2B order book and upcoming energy label changes that typically drive pre-buying behavior.",
            "Sentiment": "neutral",
            "PublishDate": 1755079384806,
            "Source": "earnings"
        },
        {
            "Title": "Blue Star Targets 15% Revenue Growth Over FY26-28 Despite Muted Q1 Performance",
            "Summary": "Blue Star Ltd. is targeting 15% compound annual growth rate in revenue between FY26 and FY28, driven by expected strong demand for air conditioners and refrigerators. Chairman and Managing Director Vir S Advani attributed the muted Q1FY26 performance to deferred demand, noting that air conditioners remain a priority purchase for consumers despite the high ticket size of over Rs 35,000. The company expects the air conditioning industry to grow at 20% CAGR and anticipates strong demand in the second half of the year. Blue Star currently holds 75 days of inventory, about 30 days higher than normal post-summer levels of 45 days, but has avoided aggressive discounting due to better inventory management. The company targets Ebit margin improvement of at least 100 basis points over the next few years. In Q1FY26, Blue Star reported revenue of Rs 2,982 crore, up 4% year-on-year, but Ebitda declined 16% to Rs 200 crore and net profit fell 28% to Rs 121 crore. Shares closed 3.08% higher at Rs 1,825 on Thursday.",
            "Sentiment": "positive",
            "PublishDate": 1754626300028,
            "Source": "stock"
        },
        {
            "Title": "Blue Star Cuts EBITDA Margin Guidance to 8.5% Amid Cooling Division Decline",
            "Summary": "Blue Star has reduced its EBITDA margin guidance to 8.5%. The company's Unitary Cooling Products Division experienced a notable decline. Blue Star indicated that full recovery from weak summer losses would not be possible.",
            "Sentiment": "negative",
            "PublishDate": 1754544487478,
            "Source": "stock"
        },
        {
            "Title": "Blue Star Anticipates Higher Demand in Upcoming Holiday Season",
            "Summary": "Blue Star expects stronger demand during the upcoming holiday season. The company anticipates increased business activity during this period.",
            "Sentiment": "positive",
            "PublishDate": 1754481909516,
            "Source": "stock"
        },
        {
            "Title": "Blue Star Q1 Revenue Rises to 29.8B Rupees, Profit and Margins Decline",
            "Summary": "Blue Star reported Q1 revenue of 29.8 billion rupees, up from 28.7 billion rupees in the same period last year. However, EBITDA fell to 2 billion rupees from 2.4 billion rupees year-over-year, with EBITDA margin declining to 6.7% from 8.3%. Consolidated net profit decreased to 1.2 billion rupees compared to 1.7 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754474319012,
            "Source": "earnings"
        },
        {
            "Title": "Blue Star Appoints Sanjeev Agrawal as Group Chief Technology Officer",
            "Summary": "Blue Star Limited has appointed Sanjeev Agrawal as Group Chief Technology Officer effective August 1, 2025. Agrawal is an Electrical Engineering graduate with a Post-Graduate Diploma in Operations Management from Indira Gandhi National University. He brings over 34 years of experience in R&D strategy, innovation management, technology development, and product lifecycle management. He previously served as Vice President - Innovation & Chief Technology Officer at Crompton Greaves Consumer Electricals Ltd and has worked with organizations including Havells India, Anchor Panasonic, Philips India, Dell International, Schneider Electric, Electrolux Corporation, and Khaitan Electricals. The appointment is classified as a change in Senior Management Personnel under regulatory guidelines.",
            "Sentiment": "positive",
            "PublishDate": 1754046640434,
            "Source": "corporate_governance"
        },
        {
            "Title": "Blue Star's V S Ashok Ceases to be Senior Management Personnel Due to Role Change",
            "Summary": "Blue Star Limited announced that V S Ashok, Executive Vice President – Customer Experience & ESG, has ceased to be a Senior Management Personnel of the company due to a change in his role. The decision was made by the Nomination and Remuneration Committee at its meeting held on July 29, 2025, and became effective immediately. The committee meeting lasted from 2:00 p.m. to 2:52 p.m.",
            "Sentiment": "neutral",
            "PublishDate": 1753783619139,
            "Source": "corporate_governance"
        },
        {
            "Title": "Blue Star to Release Q1 Results on August 8",
            "Summary": "Blue Star has announced that it will release its first quarter results on August 8.",
            "Sentiment": "neutral",
            "PublishDate": 1750945767000,
            "Source": "default"
        },
        {
            "Title": "Blue Star Ltd: AC Maker Cuts Production Amid Weak Summer Demand",
            "Summary": "Blue Star Ltd. has reduced production by 20% in May and over 25% in June due to weaker-than-expected air conditioner demand. The company attributes the downturn to unseasonal rainfall and early monsoon onset. Despite the setback, Blue Star expects 10-15% growth for the full financial year, supported by commercial refrigeration sales and anticipated second-half recovery. The company is addressing inventory build-up and doesn't plan to extend production cuts into July.",
            "Sentiment": "neutral",
            "PublishDate": 1750051705000,
            "Source": "normal_news"
        },
        {
            "Title": "Blue Star Revises Growth Forecast Downward",
            "Summary": "Blue Star has revised its growth forecast from the previous estimate of 20% to a new range of 10-15%.",
            "Sentiment": "negative",
            "PublishDate": 1750047139000,
            "Source": "default"
        },
        {
            "Title": "Blue Star Reports Weak Performance in May",
            "Summary": "Blue Star, a company, has stated that May was a weak month for their business. The company also mentioned that this has been a bad summer overall, as reported by CNBC TV18.",
            "Sentiment": "negative",
            "PublishDate": 1748924295000,
            "Source": "default"
        },
        {
            "Title": "Blue Star Sets RAC Volume Growth Target for FY26",
            "Summary": "Blue Star has set a Room Air Conditioner (RAC) volume growth target of 10% for the fiscal year 2026, as reported by CNBC TV18.",
            "Sentiment": "positive",
            "PublishDate": 1748923827000,
            "Source": "default"
        },
        {
            "Title": "Blue Star Ltd: Q4 Profit Up 21.3%, Misses Estimates",
            "Summary": "Blue Star's Q4 consolidated net profit rose 21.3% to Rs 194 crore, below analyst estimates of Rs 208 crore. Revenue increased 20.8% to Rs 4,019 crore. The company recommended a final dividend of Rs 9 per share for fiscal 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1746621027000,
            "Source": "earnings"
        },
        {
            "Title": "Blue Star Reports Strong Q4 Results and Announces Dividend",
            "Summary": "Blue Star announced its Q4 financial results, showing significant year-over-year growth. The company's revenue increased to 40.19 billion rupees from 33.3 billion rupees in the previous year. Net profit rose to 1.94 billion rupees from 1.6 billion rupees. EBITDA also improved to 2.79 billion rupees, although the EBITDA margin slightly decreased. The company recommended a final dividend of 9 rupees per equity share and expects demand to pick up in May and June 2025.",
            "Sentiment": "positive",
            "PublishDate": 1746616187000,
            "Source": "default"
        },
        {
            "Title": "Blue Star Ltd: Q4 Profit Jumps 20.6%, Announces ₹9 Dividend",
            "Summary": "Blue Star reported a 20.6% increase in Q4 net profit to ₹193.6 crore, with revenue rising 20.8% to ₹4,019 crore. EBITDA grew 15.5% to ₹279.5 crore. The company recommended a final dividend of ₹9 per share.",
            "Sentiment": "positive",
            "PublishDate": 1746615554000,
            "Source": "result"
        },
        {
            "Title": "Government to Relax BIS Norms for Blue Star",
            "Summary": "The government is planning to relax Bureau of Indian Standards (BIS) norms for Blue Star, a leading air conditioning and commercial refrigeration company. This relaxation could potentially ease regulatory requirements for the company's products.",
            "Sentiment": "positive",
            "PublishDate": 1745308095000,
            "Source": "default"
        },
        {
            "Title": "Blue Star: AC Prices to Increase 4-5% in April Due to Rising Costs",
            "Summary": "Blue Star plans to raise AC prices by 4-5% in April, citing increased commodity costs and currency fluctuations. The company aims for 15 lakh AC unit sales this year, a 50% growth. Blue Star targets 14.3% market share by FY2026 and 15% by FY2027. They're investing Rs 310 crore in capacity expansion, R&D, and marketing.",
            "Sentiment": "neutral",
            "PublishDate": 1743131247000,
            "Source": "normal_news"
        },
        {
            "Title": "Blue Star to Consider Q4 Results on May 7",
            "Summary": "Blue Star Limited has announced that it will consider and approve its financial results for the fourth quarter of the fiscal year on May 7.",
            "Sentiment": "neutral",
            "PublishDate": 1743084027000,
            "Source": "result"
        },
        {
            "Title": "FTSE Rejig: Blue Star to See Inflows of $8.7 Million",
            "Summary": "Blue Star, an Indian company, is expected to experience inflows of $8.7 million (approximately 749 million Indian Rupees) due to the FTSE index rebalancing, which is scheduled to occur today at 3 PM.",
            "Sentiment": "positive",
            "PublishDate": 1742548424000,
            "Source": "normal_news"
        },
        {
            "Title": "Blue Star to Increase Air Conditioner Prices by 2-4% from April 1",
            "Summary": "Blue Star's Managing Director has announced that the company will implement a price hike of 2-4% on its air conditioner products across all variants, effective from April 1. This information was reported by NDTV Profit.",
            "Sentiment": "neutral",
            "PublishDate": 1742464541000,
            "Source": "corporate_action"
        },
        {
            "Title": "Blue Star Confident in Supply Chain Capacity for AC Demand Growth",
            "Summary": "Blue Star has stated that its supply chain is capable of handling a 25-30% increase in air conditioner demand for the upcoming season, according to a report by CNBC TV18. This indicates the company's readiness to meet potential growth in the AC market.",
            "Sentiment": "positive",
            "PublishDate": 1742358313000,
            "Source": "corporate_action"
        },
        {
            "Title": "Blue Star: Rs 400 Crore Investment Planned for FY2026 Expansion",
            "Summary": "Blue Star Ltd plans to invest Rs 400 crore in fiscal 2026 to expand manufacturing capacity across air conditioning and refrigeration segments. The company aims for 20% growth in FY2026, with a focus on increasing market share in room ACs and commercial refrigeration.",
            "Sentiment": "positive",
            "PublishDate": 1741276222000,
            "Source": "corporate_action"
        },
        {
            "Title": "Blue Star Expands Commercial Refrigeration Product Range",
            "Summary": "Blue Star has announced an expansion of its commercial refrigeration solutions to meet increasing market demands. This move indicates the company's efforts to strengthen its position in the commercial refrigeration sector and respond to growing customer needs.",
            "Sentiment": "positive",
            "PublishDate": 1741243411000,
            "Source": "corporate_action"
        },
        {
            "Title": "Blue Star: Smart AC Sales Target Set at 500,000 Units for FY26",
            "Summary": "Blue Star expects smart AC sales to reach 500,000 units in FY26, with total AC sales projected to hit 2 million units. The company aims for a 13.9% market share in FY25 and 15.5% by FY28-end. Price gap between normal and smart ACs reduced to ₹990, boosting demand. Blue Star shares surged over 15% in recent trading sessions.",
            "Sentiment": "positive",
            "PublishDate": 1741099464000,
            "Source": "normal_news"
        },
        {
            "Title": "BlueStar Expects 35% Revenue Growth in Q4 Due to Summer Demand",
            "Summary": "BlueStar's Managing Director has announced an expected 35% revenue growth for the company in the January to March quarter, driven by increased summer demand. This projection was shared on ET Now, indicating a positive outlook for the company's performance in the upcoming quarter.",
            "Sentiment": "positive",
            "PublishDate": 1741081258000,
            "Source": "earnings"
        },
        {
            "Title": "BlueStar Aims to Sell 2 Million Air Conditioners in FY26",
            "Summary": "According to ET Now, BlueStar's Managing Director has stated that the company aims to sell 2 million air conditioners in the fiscal year 2026. This target suggests a significant growth ambition for the company's air conditioning business.",
            "Sentiment": "positive",
            "PublishDate": 1741081130000,
            "Source": "corporate_action"
        },
        {
            "Title": "Blue Star Ltd: Targets 20-25% YoY Growth for Summer Season",
            "Summary": "Blue Star Ltd's MD B Thiagarajan projects 20-25% year-on-year growth for the upcoming summer season. Q4 growth estimated at 30-35%. Over 65% of sales come from tier 3, 4, and 5 towns. Consumer finance schemes account for 37% of sales. Entry-level products dominate the portfolio, with increasing demand for high-end features. Air conditioner prices remain stable due to competition and capacity expansion.",
            "Sentiment": "positive",
            "PublishDate": 1740823130000,
            "Source": "normal_news"
        },
        {
            "Title": "Blue Star Ltd. Block Trade: 98,723 Shares Traded for Rs. 19.15 Crores",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) involving Blue Star Ltd. Approximately 98,723 shares of the company were traded at a price of Rs. 1939.40 per share, resulting in a total transaction value of Rs. 19.15 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1740732096000,
            "Source": "block_deals"
        }
    ]
}