{
    "Symbol": "BLUECOAST",
    "ISIN": "INE472B01011",
    "News": [
        {
            "Title": "BlueCoast Hotels Receives Supreme Court Clarification on SEBI Appeal Rights",
            "Summary": "The Supreme Court clarified that BlueCoast Hotels Limited is entitled to file an appeal under Section 15T of the SEBI Act against a Recovery Officer's order dated November 10, 2025, with all questions and contentions left open. The company will file an appeal before the Securities Appellate Tribunal against the Recovery Officer's order and inform about the outcome in due course.",
            "Sentiment": "positive",
            "PublishDate": 1764912310499,
            "Source": "stock"
        },
        {
            "Title": "BlueCoast Hotels Faces Recovery Officer Order to Transfer Rs. 85 Crores from Hotel Sale Proceeds",
            "Summary": "BlueCoast Hotels Limited received an order from a Recovery Officer attached to Justice R.M. Lodha Committee directing IFCI to remit Rs. 85 crores with interest from the auction proceeds of the Park Hyatt Goa Hotel property. The company had sought a refund of surplus auction amount lying with IFCI from the hotel property sale. The order is subject to the final outcome of proceedings pending before the Bombay High Court, Goa Bench. BlueCoast Hotels is exploring legal remedies to challenge the Recovery Officer's order.",
            "Sentiment": "negative",
            "PublishDate": 1762989372309,
            "Source": "stock"
        },
        {
            "Title": "BlueCoast Hotels Reports Quarterly Loss Amid Going Concern Uncertainty and SEBI Investigation",
            "Summary": "BlueCoast Hotels Limited reported a net loss of Rs. 26.67 lakhs for the quarter ended September 30, 2025, compared to a loss of Rs. 130.88 lakhs in the previous quarter. The company's total income decreased to Rs. 57.35 lakhs from Rs. 110.02 lakhs in the prior quarter. The company faces significant financial distress with accumulated losses and negative net worth as of September 30, 2025. BlueCoast is in default on dividend payments of Rs. 485.09 lakhs on redeemable preference shares and redemption amount of Rs. 551.89 lakhs due on October 30, 2025. The company is under SEBI investigation for alleged violations and has filed a settlement application proposing payment of Rs. 78 lakhs. BlueCoast handed over its sole operational asset, Park Hyatt Goa Resort & Spa, in 2019 following Supreme Court directions, significantly affecting its operations. The company has filed claims for Rs. 8,500 lakhs from auction proceeds of the hotel property. Auditors have raised material uncertainty about the company's ability to continue as a going concern, though management believes future business plans and expected financial support from subsidiary BlueCoast Hospitality Limited will help meet obligations.",
            "Sentiment": "negative",
            "PublishDate": 1762771333892,
            "Source": "earnings"
        },
        {
            "Title": "BlueCoast Hotels Defaults on Rs 10.37 Crore Redeemable Preference Shares Payment",
            "Summary": "BlueCoast Hotels Limited has disclosed a default on payment of Rs 10.37 crore related to 0.01% Redeemable Preference Shares issued to promoters. The default amount comprises Rs 5.52 crore in principal and Rs 4.85 crore in dividend. The company has 11 holders of these securities. The preference shares have a 30-year tenure with redemption scheduled from October 30, 2023 to October 30, 2032, with 10% redemption annually starting from the 21st year. The company's total financial indebtedness stands at Rs 34.57 crore. BlueCoast has undertaken several restructuring measures including reducing the coupon rate from 10% to 0.01% per annum and converting portions of the preference shares into Compulsorily Convertible Preference Shares and subsequently into equity shares.",
            "Sentiment": "negative",
            "PublishDate": 1761890317425,
            "Source": "corporate_action"
        },
        {
            "Title": "Blue Coast Hotels Amends Memorandum to Include Virtual Digital Assets and Travel Services",
            "Summary": "Blue Coast Hotels Limited amended its Memorandum of Association at its 32nd Annual General Meeting held on September 6, 2025. The company made three key changes: inserted 'Virtual Digital Assets, Currency' into clause 4 of part A of part III; added a new clause allowing the company to conduct domestic and international travel, tours, and tourism services including organizing tours, travel bookings, reservation services, transport vehicle operations, and publishing travel-related content; and renumbered existing clauses for clarity and consistency.",
            "Sentiment": "neutral",
            "PublishDate": 1757165289189,
            "Source": "corporate_action"
        },
        {
            "Title": "Blue Coast Hotels Re-appoints Vijay Jain as Independent Director for Five-Year Term",
            "Summary": "Blue Coast Hotels Limited re-appointed Mr. Vijay Jain as an Independent Director for a second term of five consecutive years. The re-appointment was approved during the company's 32nd Annual General Meeting held on September 6, 2025. Mr. Jain's new term will commence on March 1, 2026, and continue until February 28, 2031. During his first tenure, Mr. Jain contributed to improving the company's secretarial compliance and corporate governance. He holds no relationships with other directors of the company and is not debarred from holding office by any regulatory authority.",
            "Sentiment": "positive",
            "PublishDate": 1757164180395,
            "Source": "corporate_governance"
        },
        {
            "Title": "Blue Coast Hotels Appoints New Statutory and Secretarial Auditors Following Resignation",
            "Summary": "Blue Coast Hotels Limited announced changes to its auditors on August 7, 2025. The company appointed M/s Virender K Jain & Associates as statutory auditor to fill a casual vacancy created by the resignation of P.P. Bansal & Co. on August 6, 2025. The appointment is subject to shareholder approval and will run until the 32nd Annual General Meeting in 2025. Additionally, the company proposed appointing the same firm as statutory auditor for five consecutive years from the conclusion of the 32nd AGM until the 37th AGM in 2030. Blue Coast Hotels also appointed M/s Ajay K. & Associates as secretarial auditor for five consecutive years covering the same period. The changes apply to the company and its material wholly owned subsidiaries, Blue Coast Hospitality Limited and Golden Joy Hotel Private Limited. Both new audit firms bring extensive experience across various industries including construction, manufacturing, logistics, telecom, banks, and FMCG.",
            "Sentiment": "neutral",
            "PublishDate": 1754566622341,
            "Source": "corporate_action"
        },
        {
            "Title": "Blue Coast Hotels' Statutory Auditors P.P. Bansal & Co. Resign Due to Professional Commitments",
            "Summary": "P.P. Bansal & Co., Chartered Accountants resigned as statutory auditors of Blue Coast Hotels Limited and its two wholly owned material subsidiaries - Blue Coast Hospitality Limited and Golden Joy Hotel Private Limited. The auditors cited pre-occupation with other personal and professional commitments as the reason for resignation. The firm had completed the audit for the financial year ended March 31, 2025 and limited review for the quarter ended June 30, 2025, issuing reports on May 22, 2025 and August 6, 2025 respectively. The company confirmed no concerns were raised by the resigning auditor regarding management and no material reason exists for the resignation. Blue Coast Hotels' Audit Committee and Board of Directors acknowledged the resignation and are taking steps to appoint new statutory auditors to fill the vacancy. P.P. Bansal & Co. was originally appointed for a five-year term from 2022-23 to 2026-27.",
            "Sentiment": "neutral",
            "PublishDate": 1754482867122,
            "Source": "corporate_governance"
        }
    ]
}