{
    "Symbol": "BLUESTONE",
    "ISIN": "INE304W01038",
    "News": [
        {
            "Title": "Bluestone executes share subscription agreement",
            "Summary": "Bluestone Jewellery & Lifestyle executed share subscription agreement with Ethereal House for INR 25.20 crore investment in Series A2 CCPS on February 03, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770131257129,
            "Source": "co_actions_results"
        },
        {
            "Title": "BlueStone passes employee stock option plan ratification",
            "Summary": "BlueStone Jewellery and Lifestyle Limited successfully ratified its Employee Stock Option Plan 2014 through postal ballot voting concluded on January 25, 2026, with 92.35% votes in favour.",
            "Sentiment": "positive",
            "PublishDate": 1769520493085,
            "Source": "co_actions_results"
        },
        {
            "Title": "BlueStone Reports Strong Q3 FY26 Turnaround",
            "Summary": "BlueStone Jewellery & Lifestyle posted ₹714.55 million profit in Q3 FY26, marking a significant turnaround from previous quarter losses, with revenue growing 27.44% YoY to ₹7,479 million.",
            "Sentiment": "positive",
            "PublishDate": 1769082710816,
            "Source": "co_actions_results"
        },
        {
            "Title": "BlueStone Approves ₹25.20 Cr Investment in Subsidiary",
            "Summary": "BlueStone Jewellery & Lifestyle's board approved investment of ₹25.20 crores in subsidiary Ethereal House through Series A2 CCPS subscription, maintaining 74% shareholding ceiling.",
            "Sentiment": "positive",
            "PublishDate": 1769081772383,
            "Source": "co_actions_results"
        },
        {
            "Title": "BlueStone Changes Internal Auditors for FY26",
            "Summary": "BlueStone Jewellery & Lifestyle announces resignation of Nexdigm Private Limited as internal auditors due to other commitments, appoints Sudit K.Parekh & Co. LLP as replacement for FY 2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1768388237257,
            "Source": "stocks"
        },
        {
            "Title": "Bluestone Allots 1.23 Lakh Shares Under ESOP 2014",
            "Summary": "Bluestone Jewellery & Lifestyle allotted 1,23,069 equity shares to employees under ESOP 2014 on January 03, 2026. The share capital increased to ₹15.14 crores from ₹15.13 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1767427788277,
            "Source": "co_actions_results"
        },
        {
            "Title": "BlueStone Jewellery Reports 87.4% Revenue Growth in Q2FY26, Crosses Rs 500 Crore Mark",
            "Summary": "BlueStone Jewellery and Lifestyle Limited delivered record standalone revenue exceeding Rs 500 crores in Q2FY26, marking 87.4% year-on-year growth despite high base effect from previous year's custom duty cut. The company expanded its retail footprint to 311 stores across 127 cities, adding 19 new stores during the quarter. Customer base grew 31% year-on-year to 858,000 customers with same-store sales growth of 11% YoY. Adjusted EBITDA margins expanded to 13.9% compared to 14% in the same quarter last year. The company recorded an inventory gain of Rs 160 million during the quarter. Contribution margin excluding inventory gains improved to 31.8%, showing expansion of over 300 basis points year-on-year driven by scale and manufacturing efficiencies. Pre-IndAS EBITDA margins excluding inventory gains stood at 3.1% versus -5.6% in the same quarter last year. For the first half of FY26, the company delivered 39.4% year-on-year growth. Management highlighted volatile gold price environment and mixed customer demand in September, but noted strong festive finish towards quarter end. The company's omni-channel strategy continues to benefit from seamless connection between online presence and expanding physical retail footprint.",
            "Sentiment": "positive",
            "PublishDate": 1762929382128,
            "Source": "earnings"
        },
        {
            "Title": "BlueStone Jewellery Reports Loss of ₹491 Crore in Q2 FY26 Despite Revenue Growth",
            "Summary": "BlueStone Jewellery and Lifestyle Limited reported a consolidated net loss of ₹516.20 crore for the quarter ended September 30, 2025, compared to a loss of ₹277.50 crore in the same period last year. Revenue from operations increased to ₹5,362.77 crore from ₹3,826.78 crore year-on-year. For the half-year period, the company posted a consolidated loss of ₹1,349.47 crore versus ₹846.73 crore in the previous year, while revenue grew to ₹10,300.25 crore from ₹7,432.78 crore. The company completed its IPO during the quarter, raising ₹15,406.50 crore through fresh issue and offer for sale, with shares listed on BSE and NSE on August 19, 2025. The company utilized ₹1,906.50 crore of IPO proceeds, primarily for working capital requirements. BlueStone operates in the design, manufacture and sale of jewellery segment.",
            "Sentiment": "negative",
            "PublishDate": 1762300827824,
            "Source": "earnings"
        },
        {
            "Title": "BlueStone Jewellery Reports No Deviation in IPO Fund Utilization for September Quarter",
            "Summary": "BlueStone Jewellery and Lifestyle Limited filed a statement confirming no deviation or variation in the utilization of proceeds raised through its Initial Public Offering for the quarter ended September 30, 2025. The company's equity shares were listed on the National Stock Exchange of India Limited and BSE Limited on August 19, 2025. The filing was made pursuant to SEBI Listing Regulations and confirms that IPO funds were used according to their originally disclosed purposes without any modifications to objects or allocation amounts.",
            "Sentiment": "neutral",
            "PublishDate": 1762293086366,
            "Source": "stock"
        },
        {
            "Title": "Bluestone Plans Expansion to 500+ Stores with Focus on Younger Consumers",
            "Summary": "Bluestone plans rapid omnichannel expansion to over 500 stores, building on its digital-first jewelry model and 30%+ revenue compound annual growth rate. The company aims to target younger consumers through design-led daily-wear jewelry offerings and plans to increase in-house manufacturing to improve margins.",
            "Sentiment": "positive",
            "PublishDate": 1762267796530,
            "Source": "stock"
        },
        {
            "Title": "BlueStone Jewellery Reports Narrower Net Loss and Strong Revenue Growth in Q2",
            "Summary": "BlueStone Jewellery reported a net loss of 491 million rupees in Q2, significantly lower than the previous year's loss of 845 million rupees. The company's revenue grew substantially to 5.13 billion rupees from 3.73 billion rupees year-over-year. EBITDA turned positive at 427 million rupees compared to a loss of 44 million rupees in the same quarter last year. The EBITDA margin improved to 8.33% from negative 1.18% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762257787589,
            "Source": "earnings"
        },
        {
            "Title": "BlueStone Jewellery Schedules Q2 FY26 Earnings Conference Call",
            "Summary": "BlueStone Jewellery and Lifestyle Limited has announced a conference call to discuss its Q2 FY26 results scheduled for November 4, 2025, at 6:30 PM IST. The call will be led by Founder, Managing Director & CEO Gaurav Singh Kushwaha and CFO Rumit Dugar. The company has provided dial-in numbers for participants from India, Hong Kong, USA, and UK. Ernst & Young LLP will handle investor relations support for the earnings call.",
            "Sentiment": "neutral",
            "PublishDate": 1761838006044,
            "Source": "earnings"
        },
        {
            "Title": "Bluestone Jewellery Reports 41% Revenue Growth and 630% EBITDA Jump in Q1 FY26",
            "Summary": "Bluestone Jewellery and Lifestyle Limited reported standalone revenue of Rs. 4,926 million for Q1 FY26, marking 41% year-on-year growth from Rs. 3,482 million in the same quarter last year. The company's standalone adjusted EBITDA surged 630% to Rs. 830 million, with margins expanding by 1,358 basis points to 16.8% from 3.3% in Q1 FY25. The company turned cash PAT positive at Rs. 17.5 crores versus a cash loss of Rs. 36 crores in the previous year. Same-store sales growth was 18.4% year-on-year, with repeat revenue ratio at 50.7%. The company expanded its store count to 292 stores by quarter-end, up from 275 stores at the end of FY25, and grew its customer base to over 816,000. Inventory gains of Rs. 228 million contributed to the quarter's performance. The company reported contribution margins of 31.8% excluding inventory gains, an improvement of 130 basis points year-on-year. Marketing costs decreased from 12.2% of revenue in Q1 FY25 to 6.9% of revenue in the current quarter.",
            "Sentiment": "positive",
            "PublishDate": 1757591893489,
            "Source": "earnings"
        },
        {
            "Title": "BlueStone Jewellery Makes Q1 FY 2025-26 Earnings Call Recording Available Online",
            "Summary": "BlueStone Jewellery and Lifestyle Limited has published the audio recording of its Q1 FY 2025-26 earnings conference call on its company website. The recording is accessible through the company's investor relations section and via a direct link. The company is listed on both NSE (symbol: BLUESTONE) and BSE (scrip code: 544484). The filing was signed by Managing Director Gaurav Singh Kushwaha and dated September 06, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757143296232,
            "Source": "earnings"
        },
        {
            "Title": "Bluestone Plans Omni-Channel Expansion with Double-Digit Same-Store Growth Target",
            "Summary": "Bluestone is pursuing sustained expansion through omni-channel scale-up and technology-led design differentiation. The company has outlined plans for double-digit same-store growth, margin improvement, and pan-India store additions. Bluestone aims to capture growth in an industry with projected compound annual growth rate of 18-21%.",
            "Sentiment": "positive",
            "PublishDate": 1757007524771,
            "Source": "stock"
        },
        {
            "Title": "Bluestone Jewellery Reports 41.4% Revenue Growth and Strong Margin Expansion in Q1",
            "Summary": "Bluestone Jewellery and Lifestyle Limited reported standalone revenues of INR 4,926 million for the quarter ended June 30, 2025, representing 41.4% year-on-year growth despite elevated gold prices. The company's customer base expanded 34.4% year-on-year to 816,000 customers. Same-store sales growth reached 18.4% year-on-year, while the company added 17 new stores during the quarter, bringing total store count to 292 across 122 cities. Adjusted EBITDA surged 630% year-on-year to INR 830 million with margins improving to 16.8% from 3.3% in the same quarter last year. Even excluding inventory gains of INR 228 million, Adjusted EBITDA was INR 602 million with 12.2% margins. The company reported contribution margins of 31.8%, up 131 basis points year-on-year, driven by manufacturing efficiencies from new facilities. Repeat revenue share increased to 50.7% from 43.2% in the prior year quarter. The company maintained its omni-channel strategy while focusing on operational leverage in advertising and corporate costs. Management indicated Q2 trends are ahead of May-June exit rates from Q1, supported by an earlier festive season timing.",
            "Sentiment": "positive",
            "PublishDate": 1756983534930,
            "Source": "earnings"
        },
        {
            "Title": "BlueStone Jewellery Reports Strong Q1 Performance with EBITDA Surge",
            "Summary": "BlueStone Jewellery reported Q1 EBITDA of 558 million rupees compared to 20 million rupees in the same period last year. The company's EBITDA margin improved significantly to 11.3% from 0.57% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1756979570074,
            "Source": "earnings"
        },
        {
            "Title": "BlueStone Jewellery Reports Narrowed Q1 Loss Despite Revenue Growth",
            "Summary": "BlueStone Jewellery reported a consolidated net loss of 345 million rupees in Q1, an improvement from the 592 million rupee loss in the same period last year. The company's revenue increased to 4.9 billion rupees compared to 3.5 billion rupees in the previous year's corresponding quarter, representing significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1756979187645,
            "Source": "earnings"
        }
    ]
}