{
    "Symbol": "BLUEJET",
    "ISIN": "INE0KBH01020",
    "News": [
        {
            "Title": "Blue Jet Healthcare Q3FY26 earnings call on Feb 13",
            "Summary": "Blue Jet Healthcare Limited has scheduled an analyst and investor conference call on February 13, 2026, at 5:00 PM IST to discuss Q3 and 9M FY26 financial results for the period ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770364969297,
            "Source": "co_actions_results"
        },
        {
            "Title": "BlueJet Healthcare Gets CARE A1+ Credit Rating",
            "Summary": "BlueJet Healthcare Limited receives CARE A1+ Stable/CARE A1+ rating from CARE Ratings for ₹275 crore bank facilities, reflecting strong financial profile and established market position.",
            "Sentiment": "positive",
            "PublishDate": 1765961618000,
            "Source": "stocks"
        },
        {
            "Title": "BlueJet Healthcare Reports Mixed Q2 FY26 Results with Revenue Decline but Strong Margins",
            "Summary": "BlueJet Healthcare reported quarterly results for Q2 and H1 FY26. EBITDA for Q2 was Rs. 601 million at 36% margin, up 14% year-on-year, while H1 EBITDA stood at Rs. 1,820 million at 35% margin, up 41% year-on-year. PAT for Q2 was Rs. 432 million and Rs. 1,342 million for H1, representing 36% year-on-year growth. Revenue from operations for Q2 was Rs. 165 crores, down 54% sequentially and 21% year-on-year. Contrast Media business recorded revenues of Rs. 81 crores in Q2, down 17% quarter-on-quarter, with H1 revenues at Rs. 178 crores consistent with previous year. The company cited increased transit times from 35-40 days to 60 days due to geopolitical reasons, resulting in higher goods in transit. Pharma Intermediates and API segment reported Q2 revenue of Rs. 42 crores, down 80% quarter-on-quarter, though H1 revenue grew 113% year-on-year to Rs. 255 crores. The company commenced groundwork on its 103-acre Vizag site with Phase-I targeting capacity for contrast media and artificial sweeteners. The Mahad backward integration facility remains on track for commissioning by H2 FY26. BlueJet maintains debt-free status with robust cash position of Rs. 341 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1762581994277,
            "Source": "earnings"
        },
        {
            "Title": "Blue Jet Healthcare Declines to Provide Specific Financial Guidance",
            "Summary": "Blue Jet Healthcare management stated they do not provide specific financial guidance or predictions. During analyst interactions, the company emphasized having good visibility into future demand but prefers to avoid making specific forecasts. Management directed analysts to examine historical trends and aggregated numbers instead of seeking specific performance predictions.",
            "Sentiment": "neutral",
            "PublishDate": 1762400023348,
            "Source": "stock"
        },
        {
            "Title": "BlueJet Healthcare Reports Mixed Q2FY26 Results with 53% Revenue Decline but Strong Half-Year Growth",
            "Summary": "BlueJet Healthcare reported revenue from operations of Rs. 1,655 mn in Q2FY26, down 53% from Q1FY26's Rs. 3,548 mn. EBITDA stood at Rs. 549 mn with 33% margin, while PAT was Rs. 521 mn with 32% margin. The revenue decline was attributed to lower sales in pharmaceutical intermediates segment due to channel inventory de-stocking. However, half-year results showed strong performance with H1FY26 revenue at Rs. 5,202 mn, up 40% year-on-year from Rs. 3,712 mn in H1FY25. EBITDA increased 55% to Rs. 1,759 mn and PAT grew 49% to Rs. 1,433 mn. The company launched a new iodinated contrast media intermediate and reported robust growth in MRI segment contrast media. Cash and treasury investments increased to Rs. 3,413 mn as of September 30, 2025. The company acquired 102 acres of land near Vizag for Rs. 42 crores and incurred capex investment of over Rs. 82 crores during April-September 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762250966945,
            "Source": "earnings"
        },
        {
            "Title": "Blue Jet Healthcare Reports Decline in Q2 Financial Performance",
            "Summary": "Blue Jet Healthcare reported Q2 revenue of 1.66 billion rupees, down from 2.1 billion rupees in the same period last year. Net profit decreased to 521 million rupees from 584 million rupees year-over-year. EBITDA fell to 550 million rupees compared to 694 million rupees in the previous year, while EBITDA margin remained relatively stable at 33.21% versus 33.33% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762240667920,
            "Source": "earnings"
        },
        {
            "Title": "Blue Jet Healthcare's Ambernath Unit Wins Energy Efficiency Award",
            "Summary": "Blue Jet Healthcare Limited's Unit II in Ambernath has been recognized as an 'Excellent Energy Efficient Unit' at the 26th National Awards for Excellence in Energy Management 2025 by the Confederation of Indian Industry (CII). The company notified stock exchanges NSE and BSE about this recognition.",
            "Sentiment": "positive",
            "PublishDate": 1758264776750,
            "Source": "stock"
        },
        {
            "Title": "Blue Jet Healthcare Promoter Sells 6.19% Stake to Meet Public Shareholding Requirements",
            "Summary": "Akshay Bansarilal Arora, a promoter of Blue Jet Healthcare Limited, sold 10,734,529 equity shares representing 6.19% of the company's issued capital through an Offer for Sale mechanism on BSE and NSE on September 10-11, 2025. The sale was conducted to comply with minimum public shareholding requirements. Following this transaction, the promoter group's shareholding in the company decreased from 86.00% to 79.81% of the total issued and paid-up equity share capital. The shares have a face value of ₹2 each, and the sale was facilitated through brokers including ICICI Securities Limited, Kotak Securities Limited, Motilal Oswal Financial Services Limited, and Nomura Financial Advisory and Securities (India) Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1757690051485,
            "Source": "corporate_action"
        },
        {
            "Title": "Blue Jet Healthcare Co-Promoter to Sell 3.42% Stake via OFS",
            "Summary": "Blue Jet Healthcare co-promoter Akshay Arora plans to sell a 3.42% stake in the company through an Offer for Sale. The floor price for the stake sale has been set at 675 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1757419460269,
            "Source": "stock"
        },
        {
            "Title": "BlueJet Healthcare Acquires 102.48-Acre Land in Andhra Pradesh for New Manufacturing Facility",
            "Summary": "BlueJet Healthcare's Board of Directors approved the acquisition of a 102.48-acre industrial land parcel in Anakapalli District, Andhra Pradesh, for establishing a new manufacturing facility. The company received an allotment letter from Andhra Pradesh Industrial Infrastructure Corporation Ltd (APIIC) for land located at Industrial Park Rambilli Cluster Phase II. The land acquisition cost is INR 41.87 crores, with Phase I capital investment estimated up to INR 1,000 crores to be deployed modularly. The proposed capacity addition is up to 1,000 KL in Phase I, scalable in subsequent phases. The facility is targeted for commissioning by FY 28-29. Financing will come through various options including internal accruals, equity, and debt. This greenfield project is part of the company's long-term capacity expansion strategy to support growth, enable entry into new product verticals, and strengthen strategic relationships.",
            "Sentiment": "positive",
            "PublishDate": 1753953708785,
            "Source": "stock"
        },
        {
            "Title": "Blue Jet Healthcare Shares Drop 10% Despite Strong Year-on-Year Growth",
            "Summary": "Blue Jet Healthcare shares fell 10% to ₹906.15 following mixed quarterly results. Revenue increased to ₹354 crore, up from ₹162 crore in the same quarter last year, with sequential growth of 4.4%. EBITDA reached ₹121 crore, nearly triple compared to the previous year but down 13.1% from the March quarter. EBITDA margin narrowed by over 700 basis points sequentially despite widening year-on-year. The stock remains well above its IPO price of ₹346 and has gained 57% in 2025.",
            "Sentiment": "negative",
            "PublishDate": 1753170282381,
            "Source": "earnings"
        },
        {
            "Title": "Blue Jet Healthcare Reports 141% Jump in Quarterly Profit to ₹911.70 Million",
            "Summary": "Blue Jet Healthcare Limited reported a profit of ₹911.70 million for the quarter ended June 30, 2025, compared to ₹377.77 million in the same period last year, marking a 141% increase. Revenue from operations rose to ₹3,547.58 million from ₹1,628.99 million year-over-year. The company manufactures artificial sweeteners, contrast media intermediates, pharmaceutical intermediates, and APIs used in pharmaceutical and healthcare products. Basic earnings per share increased to ₹5.26 from ₹2.18 in the previous year's quarter. The Board of Directors approved these unaudited standalone financial results, which were reviewed by the audit committee and statutory auditor.",
            "Sentiment": "positive",
            "PublishDate": 1753168753469,
            "Source": "earnings"
        },
        {
            "Title": "Blue Jet Healthcare: Aims to Maintain High EBITDA Margins, Reduces China Dependence",
            "Summary": "Blue Jet Healthcare expects to maintain EBITDA margins in the mid-30s for FY26. The company is increasing backward integration to reduce reliance on China, according to COO VK Singh.",
            "Sentiment": "positive",
            "PublishDate": 1747478987000,
            "Source": "normal_news"
        },
        {
            "Title": "Blue Jet Healthcare Reports Significant Profit Increase in Q4",
            "Summary": "Blue Jet Healthcare has announced its fourth-quarter financial results, reporting a net profit of 1.1 billion rupees. This represents a substantial increase from the 396 million rupees reported in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747212152000,
            "Source": "result"
        },
        {
            "Title": "Blue Jet Healthcare: Motilal Oswal Initiates 'Buy' Rating with 26% Upside",
            "Summary": "Motilal Oswal initiated coverage on Blue Jet Healthcare with a 'Buy' rating and a price target of ₹865, implying a 26% upside. The company is expected to see revenue, EBITDA, and profit CAGR of 27%, 24%, and 19% respectively over FY25-27E. Shareholder lock-in for 20% of the company's equity ends on May 2.",
            "Sentiment": "positive",
            "PublishDate": 1745996974000,
            "Source": "normal_news"
        },
        {
            "Title": "Blue Jet Healthcare Product Contribution Outlook",
            "Summary": "Blue Jet Healthcare has stated that they do not expect a specific product to be a significant contributor to their business in the near term. However, the company anticipates that this product will become a meaningful contributor to their financial performance by fiscal year 2027 (FY27). As a result, there is no immediate impact expected from this product on the company's current operations or financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1744184957000,
            "Source": "corporate_action"
        },
        {
            "Title": "Blue Jet Healthcare Begins Exporting Chemical Intermediate for Gadolinium-Based Contrast Media",
            "Summary": "Blue Jet Healthcare has announced that they have started exporting a chemical intermediate in Q4FY25. This intermediate is used by their Europe-based innovator partner to manufacture gadolinium-based contrast media. The company currently does not have any direct exposure to gadolinium.",
            "Sentiment": "neutral",
            "PublishDate": 1744184905000,
            "Source": "corporate_action"
        },
        {
            "Title": "Blue Jet Healthcare Reports Strong Q3 Revenue Growth",
            "Summary": "Blue Jet Healthcare has announced its third-quarter financial results, reporting a significant year-over-year increase in revenue. The company's Q3 revenue reached 3.2 billion rupees, compared to 1.7 billion rupees in the same period last year, representing a substantial growth of approximately 88%.",
            "Sentiment": "positive",
            "PublishDate": 1738137090000,
            "Source": "earnings"
        },
        {
            "Title": "Blue Jet Healthcare Reports Significant Increase in Q3 Net Profit",
            "Summary": "Blue Jet Healthcare has announced its financial results for the third quarter, reporting a net profit of 990 million rupees. This represents a substantial increase from the 321 million rupees net profit reported in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738137052000,
            "Source": "earnings"
        },
        {
            "Title": "Blue Jet Healthcare Receives Consent to Operate Mahad Manufacturing Unit",
            "Summary": "Blue Jet Healthcare has announced that it has received consent to begin manufacturing operations at its Mahad unit. This development indicates an expansion of the company's production capabilities and potentially signals growth for the business.",
            "Sentiment": "positive",
            "PublishDate": 1731675520000,
            "Source": "corporate_action"
        },
        {
            "Title": "Blue Jet Healthcare: New Projects to Boost H2 Performance",
            "Summary": "Blue Jet Healthcare's Q2 results indicate that new projects are expected to start contributing to the company's performance from the second half of the fiscal year, according to an ICICI Securities review.",
            "Sentiment": "positive",
            "PublishDate": 1730801107000,
            "Source": "result"
        },
        {
            "Title": "Blue Jet Healthcare Reports Q2 EBITDA Growth",
            "Summary": "Blue Jet Healthcare's Q2 EBITDA increased to 694 million rupees from 626 million rupees year-over-year. However, the EBITDA margin slightly decreased to 33.33% from 34.53% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730186806000,
            "Source": "result"
        },
        {
            "Title": "Blue Jet Healthcare Reports Q2 Revenue Growth",
            "Summary": "Blue Jet Healthcare has announced its second quarter revenue for the current fiscal year. The company reported revenue of 2.1 billion rupees, compared to 1.8 billion rupees in the same quarter of the previous year, indicating year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730186773000,
            "Source": "result"
        },
        {
            "Title": "Blue Jet Healthcare Reports 22% Increase in Q2 Net Profit",
            "Summary": "Blue Jet Healthcare has announced its Q2 financial results, reporting a net profit of 583 million rupees, up from 478 million rupees in the same quarter last year. This represents a year-over-year increase of approximately 22%.",
            "Sentiment": "positive",
            "PublishDate": 1730186749000,
            "Source": "result"
        }
    ]
}