{
    "Symbol": "BLUSPRING",
    "ISIN": "INE0U4101014",
    "News": [
        {
            "Title": "Bluspring Enterprises Forms Two New Subsidiaries",
            "Summary": "Bluspring Enterprises Limited incorporated two wholly-owned subsidiaries on February 9, 2026, for industrial asset management and facility management services with Rs. 20 lakh authorized capital each.",
            "Sentiment": "positive",
            "PublishDate": 1770654529639,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bluspring Q3FY26 Loss Widens, Approves ESOS 2026",
            "Summary": "Bluspring Enterprises reported consolidated net loss of ₹232.34 million for Q3FY26 vs ₹1,581.26 million loss in Q3FY25. Board approved Employee Stock Option Scheme 2026 for 54.34 lakh options.",
            "Sentiment": "negative",
            "PublishDate": 1770135927866,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bluspring Enterprises Q3FY26 Earnings Call Feb 4",
            "Summary": "Bluspring Enterprises Limited has scheduled an analyst and investors meeting on February 04, 2026 at 11:00 AM IST to discuss Q3FY26 financial results under Regulation 30.",
            "Sentiment": "neutral",
            "PublishDate": 1769254454004,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bluspring targets 20%+ growth post-demerger",
            "Summary": "Bluspring Enterprises unveils refreshed brand identity six months after Quess Corp demerger, targeting over 20% annual revenue growth with plans to expand EBITDA margins from 4% to 6% by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1767800311664,
            "Source": "stocks"
        },
        {
            "Title": "Bluspring Enterprises Reports 14% Revenue Growth to ₹837 Crores in Q2FY26",
            "Summary": "Bluspring Enterprises Limited reported quarterly revenue of ₹837 crores, representing 14% year-on-year growth and 8% quarter-on-quarter growth. EBITDA stood at ₹29 crores, up 1% year-on-year and 22% sequentially. The company secured 36 new contracts worth ₹110 crores across facilities, maintenance, food, and industrial verticals. Facility and food services segment grew 14% year-on-year to ₹514 crores, while security business achieved 19% growth to ₹168 crores with highest-ever quarterly headcount addition of 1,300 guards. Telecom and industrial segment recorded ₹155 crores revenue with 11% year-on-year growth. The company's DSO increased to 105 days from usual 90 days due to contract novation delays following demerger. Net debt position stands at ₹136 crores excluding foundit investments. EBITDA margins improved from 3.1% in Q1 to 3.5% in Q2, with management targeting 4% margins by year-end. Foundit platform showed 4% quarter-on-quarter revenue growth to ₹21 crores with cost base reduced from ₹43.5 crores to ₹33 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762778943300,
            "Source": "earnings"
        },
        {
            "Title": "Bluspring Enterprises Reports 14% Revenue Growth in Q2FY26 with Improved Margins",
            "Summary": "Bluspring Enterprises Limited reported quarterly revenue of INR 837 crores, marking 14% year-over-year growth and 8% quarter-over-quarter increase. The company's EBITDA margin improved to 3.5% with profit after tax reaching INR 16 crores, up 19% year-over-year. The company operates across three main segments: Facility & Food Services (INR 514 crores revenue), Telecom & Industrial Services (INR 155 crores), and Security Services (INR 168 crores). Headcount grew to 90,000 employees. For the half-year period, total revenue reached INR 1,614 crores with 14% growth. The company added 14 new contracts in Facility & Food Services with annual contract value of INR 37 crores, while Security Services recorded highest quarterly net addition of 1,374 man-guards. The presentation outlines strategic objectives targeting 3x GDP organic growth, 6% EBITDA margin, and 20% ROE by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1762482269865,
            "Source": "earnings"
        },
        {
            "Title": "Bluspring Enterprises Targets ₹1,655 Cr Revenue with 36 New Contracts Worth ₹110 Cr",
            "Summary": "Bluspring Enterprises has set a revenue target of ₹1,655 crore for H1'26 while expanding across facility, security, and telecom services. The company added 36 new contracts with an annual value of ₹110 crore. Bluspring is expanding into food and industrial verticals with focus areas including digital consulting, network deployment, and smart infrastructure management. The company plans to strengthen its leadership and sales functions while improving margin efficiency through inorganic growth and technological integration.",
            "Sentiment": "positive",
            "PublishDate": 1762444460875,
            "Source": "stock"
        },
        {
            "Title": "Bluspring Enterprises Approves Purchase of Additional 2% Stake in Vedang Cellular Services",
            "Summary": "Bluspring Enterprises has approved the acquisition of an additional 2% stake in Vedang Cellular Services Private Limited. This decision represents an expansion of Bluspring's ownership position in the cellular services company.",
            "Sentiment": "positive",
            "PublishDate": 1762443326333,
            "Source": "order&deals"
        },
        {
            "Title": "Bluspring Enterprises Reports Mixed Q2 Results with Revenue Growth and Profit Increase Despite Lower EBITDA",
            "Summary": "Bluspring Enterprises reported Q2 revenue of 8.6 billion rupees, up from 7.7 billion rupees year-over-year. The company's consolidated net profit increased to 52 million rupees from 38 million rupees in the same period last year. However, EBITDA declined to 174 million rupees compared to 225 million rupees year-over-year, with EBITDA margin compressing to 2.03% from 2.92% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762442116726,
            "Source": "earnings"
        },
        {
            "Title": "Bluspring Enterprises Reports 13% Revenue Growth in Inaugural Earnings Call Post-Demerger",
            "Summary": "Bluspring Enterprises Limited held its first earnings call as an independent entity following its demerger from Quess Corp. The company reported quarterly revenue of INR 777 crores, representing 13% year-on-year growth, though EBITDA declined 11% to INR 24 crores. The facilities and food services segment, contributing 60% of revenue, grew 13% year-on-year to INR 476 crores. Telecom and industrial services revenue increased 20% year-on-year to INR 152 crores, while security services grew 8% to INR 149 crores. The company added 46 new clients with an annual contract value of INR 93 crores. CEO Kamal Pal Hoda attributed margin pressure to seasonal softness in high-margin food and telecom businesses, wage inflation, and strategic investments in leadership teams post-demerger. The company operates through multiple brands including Avon for facilities, Indya Foods for catering, Hofincons for industrial services, Vedang for telecom, and Terrier for security services. Bluspring maintains a 70% stake in foundit, an AI-powered job search platform that reported INR 20 crores in revenue. Management targets moving from current 3.1% EBITDA margins to 4% by year-end, with long-term goals of 6% margins and 20% return on equity.",
            "Sentiment": "neutral",
            "PublishDate": 1754552285919,
            "Source": "earnings"
        },
        {
            "Title": "Bluspring Enterprises Reports 13% Revenue Growth to ₹777 Cr in Q1 FY26",
            "Summary": "Bluspring Enterprises Limited reported consolidated revenue of ₹777 crores for Q1 FY26, marking a 13% year-over-year increase from ₹687 crores in Q1 FY25, though revenue declined 1% quarter-over-quarter. EBITDA decreased to ₹24 crores (3.1% margin) from ₹27 crores (3.9% margin) in the previous year, representing an 11% decline. Adjusted PAT fell 5% year-over-year to ₹13 crores with a margin of 1.7%. The Facility & Food segment generated ₹476 crores (13% YoY growth), Telecom & Industrials contributed ₹152 crores (20% YoY growth), and Security services added ₹149 crores (8% YoY growth). The company operates across integrated facility management, food services, security, telecom, and industrial services with over 1,000 clients and manages 378 million square feet of space. Bluspring targets 3x GDP organic growth, 6% EBITDA margin, and 20% ROE as long-term objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1753961691587,
            "Source": "stock"
        },
        {
            "Title": "Bluspring Enterprises Reports Q1 Net Loss of 48M Rupees Despite Revenue Growth",
            "Summary": "Bluspring Enterprises posted a consolidated net loss of 48 million rupees in Q1, compared to a profit of 6 million rupees in the same period last year. The company's revenue increased to 7.97 billion rupees from 7.2 billion rupees year-over-year, showing growth despite the shift to losses.",
            "Sentiment": "negative",
            "PublishDate": 1753952425568,
            "Source": "earnings"
        },
        {
            "Title": "Bluspring Enterprises Schedules Analyst Meeting for Q1 FY26 Earnings Discussion",
            "Summary": "Bluspring Enterprises Limited has scheduled an analyst and investors meeting on August 1, 2025, at 11:00 AM IST to discuss the company's Q1 FY26 earnings performance. The meeting will be followed by an interactive Q&A session with management participants including Kamal Pal Hoda (ED and CEO), Prapul Sridhar (CFO), and Nitish Purohit (Head, Investor Relations). The conference call will be accessible through multiple dial-in numbers for India and international participants, with specific toll-free numbers provided for USA, UK, Singapore, and Hong Kong. The company trades on BSE with scrip code 544414 and on NSE with symbol BLUSPRING.",
            "Sentiment": "neutral",
            "PublishDate": 1753514667604,
            "Source": "earnings"
        }
    ]
}