{
    "Symbol": "BMWVENTLTD",
    "ISIN": "INE965W01036",
    "News": [
        {
            "Title": "BMW Ventures Reports Strong Q3 Growth in Profit & Revenue",
            "Summary": "BMW Ventures delivered impressive Q3 performance with net profit rising to ₹115 million from ₹79 million year-on-year, while revenue increased to ₹5.6 billion from ₹4.8 billion in the same period.",
            "Sentiment": "positive",
            "PublishDate": 1770213614583,
            "Source": "co_actions_results"
        },
        {
            "Title": "BMW Ventures schedules board meet for Q3FY26 results",
            "Summary": "BMW Ventures Limited has scheduled a board meeting on February 04, 2026, to consider Q3FY26 unaudited financial results and interim dividend proposal. Trading window closed from January 01, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769604764763,
            "Source": "co_actions_results"
        },
        {
            "Title": "BMW Ventures Secures INR 6.02 Crore Railway Steel Girders Processing Order",
            "Summary": "BMW Ventures Limited has secured a job work processing order worth INR 6.02 crore for railway steel girders from a domestic customer, with materials to be provided by the customer and approved by Indian Railways. The order is to be executed within 6 months with 100% payment after dispatch, strengthening the company's position in the railway infrastructure segment.",
            "Sentiment": "positive",
            "PublishDate": 1764934310052,
            "Source": "order&deals"
        },
        {
            "Title": "BMW Ventures Secures INR 4.53 Crore Order for Structural Steel Supply to Oil & Gas PSU",
            "Summary": "BMW Ventures Limited has secured an order worth INR 4.53 crore for supply, fabrication, and coating of structural steel (Pre Engineered Building) from a leading Oil & Gas PSU. The order is to be executed within 12 weeks from the purchase order date, with payment terms of 5% advance and balance after erection.",
            "Sentiment": "positive",
            "PublishDate": 1763457975882,
            "Source": "order&deals"
        },
        {
            "Title": "BMW Ventures Reports 12.5% Growth in Net Profit for Q2FY26",
            "Summary": "BMW Ventures Limited, a leading steel product distributor and fabricator in Bihar, reported a 12.5% year-over-year growth in net profit to ₹7.11 crore for the quarter ended September 30, 2025. EBITDA decreased slightly by 0.84% to ₹19.96 crore. The company operates through a network of 1,299 dealers across 29 districts in Bihar and has manufacturing capacity of over 27,800 MT per annum. Managing Director Nitin Kishorepuria highlighted the company's operational discipline and efficient supply chain management despite soft steel pricing. The company expects 25-30% bottom-line growth in the second half of FY26, driven by value-added products including Pre-Engineered Buildings (PEBs) and Railway Steel Girders from its RDSO-approved facility. In FY25, the company reported revenue of ₹2,067.33 crore with EBITDA margin of 4.24% and PAT margin of 1.59%.",
            "Sentiment": "positive",
            "PublishDate": 1762962592652,
            "Source": "earnings"
        },
        {
            "Title": "BMW Ventures Limited Reports Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "BMW Ventures Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company's equity shares were listed on NSE and BSE on October 1, 2025, making these the first quarterly results after listing. BMW Ventures operates a diversified business portfolio including trading of iron and steel products sourced from Tata Steel, distribution of John Deere India tractors in Bihar, manufacturing of PVC pipes, pre-engineered buildings and railway girders, and providing rental services for construction equipment. The Board of Directors approved the results at their meeting held on November 10, 2025. The results have been subject to limited review by statutory auditors.",
            "Sentiment": "neutral",
            "PublishDate": 1762806165810,
            "Source": "earnings"
        },
        {
            "Title": "BMW Ventures Limited Reports Q1 Financial Results with Revenue of Rs 484.59 Crores",
            "Summary": "BMW Ventures Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 484.59 crores compared to Rs 519.63 crores in the same quarter last year. Net profit for the quarter stood at Rs 80.26 crores versus Rs 75.96 crores in the corresponding period of the previous year. The company's equity shares were listed on NSE and BSE on October 1, 2025, making these the first quarterly results after listing. BMW Ventures operates in diversified business segments including trading of iron and steel products sourced from Tata Steel, distribution of John Deere tractors in Bihar, manufacturing of PVC pipes, pre-engineered building railway girders, and providing rental services for construction equipment. Basic earnings per share for the quarter was Rs 1.27.",
            "Sentiment": "neutral",
            "PublishDate": 1762803625439,
            "Source": "earnings"
        },
        {
            "Title": "BMW Ventures Reports 12% Growth in Q2 Net Profit to 71.1M Rupees",
            "Summary": "BMW Ventures posted a net profit of 71.1 million rupees in Q2, up from 63.3 million rupees in the same period last year. Revenue increased to 5.02 billion rupees from 4.73 billion rupees year-over-year. However, EBITDA remained flat at 200 million rupees compared to 201 million rupees previously, while EBITDA margin compressed to 3.98% from 4.26% in the prior year period.",
            "Sentiment": "neutral",
            "PublishDate": 1762777110280,
            "Source": "earnings"
        },
        {
            "Title": "BMW Ventures Secures INR 9.94 Crore Railway Infrastructure Order",
            "Summary": "BMW Ventures Limited announced it has secured an order worth INR 9.94 crore for fabrication and supply of Bowstring girders in RDSO approved facility for Indian Railways under its steel girder business. The order is from a domestic entity, though the company cannot disclose the customer name due to confidentiality. The project involves delivering the girders within 90 days from the purchase order date. Payment terms include 5% advance after work order issuance, 70% after trial assembly completion, and 25% before material dispatch. The order does not involve any promoter group interest in the awarding entity and does not constitute a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1762240231261,
            "Source": "order&deals"
        },
        {
            "Title": "BMW Ventures Secures INR 28.95 Crore Order for TMT Bars Distribution",
            "Summary": "BMW Ventures Limited announced securing an order worth INR 28.95 crore from Venus Star Construction Private Limited for TMT bars of different sizes under its distribution business. The order includes payment terms of 20% advance with balance after shipment, and delivery is scheduled within 60 days. The company confirmed that promoters and group companies have no interest in the awarding entity, and the transaction does not fall under related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1761918673764,
            "Source": "order&deals"
        },
        {
            "Title": "BMW Ventures Secures INR 5.11 Crore Airport Supply Contract",
            "Summary": "BMW Ventures has received an order worth INR 5.11 crore to supply sections and accessories for Kolkata Airport. The company is required to complete delivery within 60 days of the order.",
            "Sentiment": "positive",
            "PublishDate": 1761721144195,
            "Source": "order&deals"
        },
        {
            "Title": "BMW Ventures Secures INR 4.49 Crore Order for Pre-Engineered Steel Building Manufacturing",
            "Summary": "BMW Ventures Limited announced it has secured an order worth INR 4.49 crore from a domestic structural steel manufacturer. The order involves manufacturing, supply and erection of Pre-Engineered Steel Building (PEB) through the company's PEB Manufacturing division. The contract includes 10% advance payment with balance due before shipment, and delivery is scheduled within 45 days from the purchase order date. The customer's name remains confidential. The order does not involve any promoter group interest or related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1761388338134,
            "Source": "order&deals"
        },
        {
            "Title": "BMW Ventures Shares Hit Lower Circuit Following Weak Market Debut",
            "Summary": "BMW Ventures shares hit the lower circuit, falling below Rs 65.17 after a disappointing market debut. The stock declined nearly 10% during the week following its listing at Rs 80 on BSE and Rs 78 on NSE, representing discounts of 19.2% and 21.2% respectively from the issue price of Rs 99. The IPO was oversubscribed 1.5 times, with QIBs subscribing 3.09 times and NIIs 3.03 times, while retail investors subscribed 0.99 times. The offering aimed to raise Rs 231.66 crore through a fresh issue of 2.34 crore equity shares with a price band of Rs 94-99 per share. BMW Ventures, a Bihar-based company, distributes steel products including TMT bars and GI sheets, deals in tractor engines and spare parts, and manufactures PVC pipes and steel girders for Indian Railways. The stock traded 5% lower at Rs 63.52 on NSE while the benchmark Nifty 50 advanced 0.31%.",
            "Sentiment": "negative",
            "PublishDate": 1759817125357,
            "Source": "stock"
        }
    ]
}