{
    "Symbol": "BODALCHEM",
    "ISIN": "INE338D01028",
    "News": [
        {
            "Title": "Bodal Chemicals Board Meet Set for Feb 14, 2026",
            "Summary": "Bodal Chemicals Limited has scheduled a board meeting for February 14, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed until February 17, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770301403185,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bodal Chemicals Receives Credit Ratings from Infomerics for Rs 1,127.53 Crore Facilities",
            "Summary": "Bodal Chemicals Limited received credit ratings from Infomerics Valuation and Rating Limited for total facilities worth Rs 1,127.53 crore, including IVRA-/Stable rating for long-term fund based bank facilities of Rs 957.53 crore and IVRA2 rating for short-term facilities and proposed commercial paper. The ratings cover the company's bank facilities, working capital limits, and proposed commercial paper, providing assessment of the chemical company's creditworthiness for debt servicing obligations.",
            "Sentiment": "positive",
            "PublishDate": 1765262118127,
            "Source": "corporate_action"
        },
        {
            "Title": "Bodal Chemicals Reports 12% Revenue Growth to Rs 9,586 Million in H1FY26",
            "Summary": "Bodal Chemicals achieved total revenue of Rs 9,586 million in H1FY26, representing 12% year-on-year growth. The company reported EBITDA of Rs 946 million with 27% growth and PAT of Rs 155 million. Revenue growth was driven by Basic Chemicals sales and additional sales from Benzene downstream products. Basic Chemicals segment grew 76% year-on-year due to increased raw material prices, particularly Sulphur, followed by finished goods price increases. Dye intermediates revenue grew 2% while Dyestuff segment declined 2%. The Chlor Alkali business reported revenue of Rs 1,682 million with 9% growth. The company's Benzene downstream products unit in Saykha started normal production with required quality norms, though margins face pressure due to competition and slower demand. Interest, depreciation and other overheads increased following capitalization of the Saykha project.",
            "Sentiment": "positive",
            "PublishDate": 1762965210764,
            "Source": "earnings"
        },
        {
            "Title": "Bodal Chemicals Reports Quarterly Results and Approves Unit-II Sale",
            "Summary": "Bodal Chemicals Limited's Board of Directors approved standalone and consolidated unaudited financial results for the quarter and half year ended September 30, 2025. The company also approved the sale of Unit-II located at Plot No: 123-124, Phase-I, G.I.D.C., Vatva, Ahmedabad-382445. The unit has been inoperative and is not significant in terms of revenue or other company matters. The unit will be sold at prevailing market rates, with the selling price not being substantial compared to the company's size. The closure of this unit was previously communicated in May 2024. Additionally, the company sold parts of Unit-II and Unit-III during the quarter, generating profits of Rs. 106.60 million and Rs. 72.34 million respectively, which were included in other income. The company received an insurance claim of Rs. 47.11 million related to a fire incident that occurred in December 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1762940419355,
            "Source": "earnings"
        },
        {
            "Title": "Bodal Chemicals Reports Mixed Q2 Results with Revenue Growth but Lower Profitability",
            "Summary": "Bodal Chemicals reported Q2 revenue of 4.8 billion rupees, up from 4.3 billion rupees in the same period last year. However, EBITDA declined to 230 million rupees from 361 million rupees year-over-year, with EBITDA margin dropping to 4.8% from 8.37%. The company posted a consolidated net profit of 60 million rupees compared to a loss of 2.4 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762936959796,
            "Source": "earnings"
        },
        {
            "Title": "Bodal Chemicals Announces Merger of Statutory Auditors with B N P S and Associates LLP",
            "Summary": "Bodal Chemicals Ltd announced that its statutory auditors M/s Naresh J Patel & Co. have merged with M/s B N P S and Associates LLP, effective September 18, 2025. The merged entity will continue as statutory auditors for the remaining term until the conclusion of the 41st Annual General Meeting in 2027. M/s Naresh J Patel & Co. were originally appointed for a five-year term from September 26, 2022. B N P S and Associates LLP comprises 14 partners with presence across Ahmedabad, Rajkot, Raichur, and Bangalore, offering services in assurance, risk advisory, taxation, and management consulting. The company obtained board approval on August 12, 2025, and will seek shareholders' approval at the AGM scheduled for September 26, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758618708226,
            "Source": "corporate_action"
        },
        {
            "Title": "Bodal Chemicals Reports 8% Revenue Growth to INR 458 Crores in Q1 FY26, EBITDA Jumps 40%",
            "Summary": "Bodal Chemicals Limited achieved total revenue of INR 458 crores in Q1 FY26, representing 8% year-on-year growth. EBITDA increased significantly by 40% to INR 52 crores with an 11.3% margin, driven by better realizations. The company reported consolidated net profit of INR 9.53 crores. Division-wise performance showed mixed results: Dye Intermediates revenue declined 4% to INR 150 crores due to lower raw material prices, Dyestuff revenue dropped 10% to INR 122 crores, while Basic Chemicals grew 15% to INR 45 crores and Chlor-alkali increased 8% to INR 84 crores. The newly operational benzene derivatives unit contributed INR 13 crores to revenue but operated at only 20% capacity utilization. Management expects antidumping duty benefits on TCCA to materialize in Q3 and Q4. The company maintains revenue guidance of around INR 1,900 crores for FY26 and targets debt reduction of INR 150-175 crores through asset sales and scheduled repayments.",
            "Sentiment": "positive",
            "PublishDate": 1755169611555,
            "Source": "earnings"
        },
        {
            "Title": "Bodal Chemicals Reports Strong Q1 Performance with Revenue Growth and Profit Surge",
            "Summary": "Bodal Chemicals reported Q1 revenue of 4.45 billion rupees, up from 4.2 billion rupees in the same quarter last year. The company's net profit increased significantly to 103 million rupees compared to 11 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754990651957,
            "Source": "earnings"
        },
        {
            "Title": "Bodal Chemicals Announces Proposed Merger of Statutory Auditors",
            "Summary": "Bodal Chemicals Ltd has announced the proposed merger of its statutory auditors, M/s. Naresh J. Patel & Co., with B N P S and Associates LLP. The company plans to appoint B N P S and Associates LLP as statutory auditors for the remaining years of the current term, which runs until 2027, subject to board and shareholder approval. M/s. Naresh J. Patel & Co. was appointed as statutory auditors for a five-year term from September 2022 to 2027. B N P S and Associates LLP has over 27 years of experience, serves multiple listed companies, has 14 partners, and operates 5 offices across the country. The merger is aimed at strengthening professional resources, enhancing service capabilities, and expanding geographic presence. The company will seek fresh approval from its board and shareholders to give effect to the merger.",
            "Sentiment": "neutral",
            "PublishDate": 1754575062406,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bodal Chemicals Receives Revised Credit Rating of 'IND BBB+/Stable' from India Ratings",
            "Summary": "Bodal Chemicals Ltd received a revised credit rating of 'IND BBB+/Stable' from India Ratings & Research. The rating applies to multiple financial instruments: a term loan of INR 5,073.6 million (reduced from INR 5,372 million) with outlook revised to stable, fund-based/non-fund based working capital limits of INR 4,510 million with outlook revised to stable, additional working capital limits of INR 590 million that were assigned the same rating, and non-fund-based working capital limits of INR 500 million with IND A2 rating that was affirmed.",
            "Sentiment": "positive",
            "PublishDate": 1753175998717,
            "Source": "stock"
        },
        {
            "Title": "Bodal Chemicals Reports Q4 Financial Results",
            "Summary": "Bodal Chemicals has announced its financial results for the fourth quarter. The company reported a net profit of 106 million rupees, compared to 49 million rupees in the same quarter last year and 73 million rupees in the previous quarter. Revenue for Q4 stood at 4.45 billion rupees, up from 3.95 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748390432000,
            "Source": "default"
        },
        {
            "Title": "Bodal Chemicals Reports Improved Q4 Financial Results",
            "Summary": "Bodal Chemicals has reported its Q4 financial results. The company's EBITDA increased to 498 million rupees from 382 million rupees year-over-year. The EBITDA margin improved to 11.18% from 9.66% in the same period. Net profit rose to 106 million rupees from 49 million rupees year-over-year and 73 million rupees quarter-over-quarter. Revenue for Q4 was 4.45 billion rupees, up from 3.95 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748352580000,
            "Source": "result"
        },
        {
            "Title": "Anti-Dumping Investigation Initiated on Beta Naphthol Imports from China",
            "Summary": "An anti-dumping investigation has been initiated concerning imports of Beta Naphthol originating from or exported by China PR. This investigation could potentially impact Bodal Chemicals, a company likely involved in the production or trade of Beta Naphthol.",
            "Sentiment": "neutral",
            "PublishDate": 1743564616000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bodal Chemicals: Anti-Dumping Duty on TCCA Imports to Boost Revenue",
            "Summary": "India's finance ministry recommends anti-dumping duty on TCCA imports from China and Japan for five years, effective March 7, 2025. Bodal Chemicals, the sole Indian producer of TCCA, expects to add ₹50-60 crore annually to its turnover from FY26.",
            "Sentiment": "positive",
            "PublishDate": 1741574334000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bodal Chemicals Reports Strong Q3 Results and Announces New Project",
            "Summary": "Bodal Chemicals has reported a significant increase in its Q3 consolidated net profit, rising to 54 million rupees from 9.8 million rupees year-over-year. The company's Q3 revenue also saw substantial growth, reaching 4.4 billion rupees compared to 3.39 billion rupees in the same period last year. Additionally, Bodal Chemicals has announced plans to establish a new project for manufacturing salt-free dyes at their Unit IV facility in Vatva, Ahmedabad.",
            "Sentiment": "positive",
            "PublishDate": 1739233234000,
            "Source": "earnings"
        },
        {
            "Title": "Bodal Chemicals to Establish Salt-Free Dye Manufacturing Project",
            "Summary": "Bodal Chemicals has announced plans to set up a new project for manufacturing salt-free dyes at their Unit IV facility in Vatva, Ahmedabad. This initiative represents a significant expansion of the company's production capabilities and potentially indicates a move towards more environmentally friendly dyeing processes.",
            "Sentiment": "positive",
            "PublishDate": 1739200899000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bodal Chemicals Reports Significant Increase in Q3 EBITDA",
            "Summary": "Bodal Chemicals has announced its Q3 financial results, showing a substantial improvement in performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) rose to 445 million rupees, compared to 238.8 million rupees in the same quarter of the previous year. This represents an 86.3% year-over-year increase. Additionally, the EBITDA margin expanded to 10.04% from 7.05% in the corresponding quarter last year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739195177000,
            "Source": "earnings"
        },
        {
            "Title": "Bodal Chemicals Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "Bodal Chemicals has announced its Q3 financial results, showing a substantial increase in both net profit and revenue. The company's consolidated net profit rose to 54 million rupees, up from 9.8 million rupees in the same quarter last year. Revenue also saw a significant boost, reaching 4.4 billion rupees compared to 3.39 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739195171000,
            "Source": "earnings"
        },
        {
            "Title": "Bodal Chemicals Reports Improved Q2 EBITDA and Margin",
            "Summary": "Bodal Chemicals has announced its Q2 financial results. The company's EBITDA increased to 326 million rupees from 234 million rupees year-over-year. Additionally, the EBITDA margin improved to 7.61% from 7.12% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731573105000,
            "Source": "result"
        },
        {
            "Title": "Bodal Chemicals Reports Q2 Revenue Growth",
            "Summary": "Bodal Chemicals has announced its Q2 revenue, which stands at 4.3 billion rupees, showing a significant increase from 3.2 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731573043000,
            "Source": "result"
        },
        {
            "Title": "Bodal Chemicals Reports Q2 Net Loss",
            "Summary": "Bodal Chemicals has reported a consolidated net loss of 2.4 million rupees for the second quarter, compared to a profit of 12 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731573012000,
            "Source": "result"
        }
    ]
}