{
    "Symbol": "BOMDYEING",
    "ISIN": "INE032A01023",
    "News": [
        {
            "Title": "CRISIL Revises Bombay Dyeing Outlook to Stable",
            "Summary": "CRISIL revised Bombay Dyeing's outlook to 'Stable' from 'Positive' while reaffirming BBB+ rating on ₹501 crore facilities. Revision reflects moderated PSF segment profitability in H1 FY26 due to reduced US exports.",
            "Sentiment": "neutral",
            "PublishDate": 1767420300923,
            "Source": "stocks"
        },
        {
            "Title": "Bombay Dyeing Faces ₹43.62 Cr GST Demand for FY22",
            "Summary": "Bombay Dyeing receives GST order from Maharashtra authorities demanding ₹43.62 crores including tax, interest and penalty for FY 2021-22 related to high value credit notes discrepancies.",
            "Sentiment": "negative",
            "PublishDate": 1767186815784,
            "Source": "stocks"
        },
        {
            "Title": "Bombay Dyeing Faces ₹6.14 Cr GST Demand for FY19",
            "Summary": "Bombay Dyeing receives GST order from Maharashtra authorities demanding ₹6.14 crores for FY 2018-19, including tax, interest and penalty components. Company plans legal remedies.",
            "Sentiment": "negative",
            "PublishDate": 1766819959897,
            "Source": "stocks"
        },
        {
            "Title": "Bombay Dyeing Shuts Patalganga Plant for Maintenance, Production to Drop 7,500 Metric Tons",
            "Summary": "Bombay Dyeing And Mfg Co will close its Patalganga plant for maintenance from November 28 to December 18. The shutdown will result in a production drop of approximately 7,500 metric tons during this period.",
            "Sentiment": "neutral",
            "PublishDate": 1764244147816,
            "Source": "stock"
        },
        {
            "Title": "Varun Berry Resigns as Non-Executive Director from Bombay Dyeing Board",
            "Summary": "Varun Berry has resigned as Non-Executive Non-Independent Director of The Bombay Dyeing and Manufacturing Company Limited. Berry submitted his resignation letter on November 6, 2025, and the Board accepted it through circular resolution with effect from the close of business hours on November 10, 2025. In his resignation letter addressed to Chairman Nusli Wadia, Berry stated he would like to resign with immediate effect and expressed that it was a privilege to be on the Board while wishing the Board and management the best for the future.",
            "Sentiment": "neutral",
            "PublishDate": 1762795834822,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bombay Dyeing Reports Sharp Decline in Net Profit Despite Exceptional Gain",
            "Summary": "Bombay Dyeing reported a net profit of 18.3 million rupees in Q2, significantly lower than 3.93 billion rupees in the same period last year. Revenue declined to 3.63 billion rupees from 3.8 billion rupees year-over-year. The company's profit before tax improved to 47.4 million rupees compared to a loss of 282.5 million rupees in the previous year. The company recorded an exceptional gain of 5.02 billion rupees during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762433579010,
            "Source": "earnings"
        },
        {
            "Title": "Bombay Dyeing Reports Quarterly Results for Second Quarter Ended September 2025",
            "Summary": "Bombay Dyeing and Manufacturing Company Limited announced its unaudited financial results for the second quarter and half year ended September 30, 2025. The Board of Directors approved both standalone and consolidated financial results at a meeting held on November 6, 2025. The company operates across three main segments: Real Estate, Polyester, and Retail/Textile. The results include subsidiary P.T. Five Star Textile Indonesia and associates Bombay Dyeing Real Estate Company Limited and Pentafil Textile Dealers Limited. The auditor's report references an ongoing SEBI matter from October 2022 involving penalties of ₹2.25 crores and market access restrictions, which the company has appealed before the Securities Appellate Tribunal with a stay order obtained in November 2022.",
            "Sentiment": "neutral",
            "PublishDate": 1762430682736,
            "Source": "earnings"
        },
        {
            "Title": "Bombay Dyeing Appoints Rukhshana Jina Mistry as Independent Woman Director Through Postal Ballot",
            "Summary": "The Bombay Dyeing and Manufacturing Company Limited successfully passed a special resolution through postal ballot to appoint Ms. Rukhshana Jina Mistry as Non-Executive Independent Woman Director for five consecutive years. The resolution was approved on October 3, 2025, with 98.67% of valid votes cast in favor. Out of 206.53 million total shares, 114.27 million votes were polled, representing 55.33% participation. A total of 726 members voted in favor while 83 members voted against the resolution. The postal ballot was conducted through remote e-voting facilitated by NSDL, with the voting period running from September 4 to October 3, 2025. Mr. Mitesh Dhabliwala from Parikh & Associates served as the scrutinizer for the voting process.",
            "Sentiment": "positive",
            "PublishDate": 1759501349464,
            "Source": "corporate_action"
        },
        {
            "Title": "Bombay Dyeing Appoints Rohit Santhosh as CEO of Bombay Realty",
            "Summary": "The Bombay Dyeing and Manufacturing Company Limited appointed Mr. Rohit Santhosh as Chief Executive Officer of Bombay Realty, effective September 18, 2025. The appointment was approved by the Board of Directors based on the recommendation of the Nomination and Remuneration Committee. Santhosh has over 17 years of experience with organizations including CapitaLand, Godrej Properties, Lodha Group, and Shapoorji Pallonji Group. He is an alumni of the Indian School of Business, Hyderabad and National Institute of Technology, Allahabad, with experience leading diverse real estate portfolios including residential, commercial, industrial and renewable-power projects. The position is designated as Senior Management Personnel on a full-time employment basis.",
            "Sentiment": "positive",
            "PublishDate": 1758125507007,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bombay Dyeing Appoints Rukhshana Jina Mistry as Independent Woman Director for 5-Year Term",
            "Summary": "The Bombay Dyeing and Manufacturing Company Limited appointed Ms. Rukhshana Jina Mistry as an Additional Non-Executive Independent Woman Director for a five-year term from August 26, 2025 to August 25, 2030. The appointment was approved by the Board of Directors on recommendation of the Nomination and Remuneration Committee and is subject to shareholder approval through postal ballot. Ms. Mistry is a Chartered Accountant with over 32 years of experience in accounting, auditing, taxation, and company law. She holds a B.Com degree from University of Mumbai and is a Fellow Member of the Institute of Chartered Accountants of India. She serves as an Independent Director on boards of Sterling And Wilson Renewable Energy Ltd, Allied Blenders & Distillers Ltd, Afcons Infrastructure Ltd, and The Bombay Burmah Trading Corporation Limited. She is not related to any existing directors of the company and is not debarred from holding directorship by SEBI or other authorities.",
            "Sentiment": "positive",
            "PublishDate": 1756121737320,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bombay Dyeing Wins Tax Case Against Rs 39.1 Million Demand for FY 2017-18",
            "Summary": "Bombay Dyeing has successfully won a legal case against a tax demand of Rs 39.1 million for the financial year 2017-18. The company has prevailed in this tax dispute.",
            "Sentiment": "positive",
            "PublishDate": 1755599398188,
            "Source": "stock"
        },
        {
            "Title": "Bombay Dyeing Reports Revenue Decline and EBITDA Loss in Q1",
            "Summary": "Bombay Dyeing reported Q1 revenue of 3.8 billion rupees, down from 4.5 billion rupees in the same period last year. The company posted an EBITDA loss of 140 million rupees compared to a gain of 119 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754645670429,
            "Source": "earnings"
        },
        {
            "Title": "Bombay Dyeing Reports 11% Decline in Quarterly Net Profit to 138 Million Rupees",
            "Summary": "Bombay Dyeing reported a net profit of 138 million rupees in its latest quarterly results, representing a decrease from 155 million rupees in the same quarter of the previous year. This marks an 11% year-over-year decline in the company's quarterly earnings.",
            "Sentiment": "negative",
            "PublishDate": 1754645160730,
            "Source": "earnings"
        },
        {
            "Title": "Baymanco Increases Stake in Bombay Dyeing",
            "Summary": "Baymanco has raised its stake in Bombay Dyeing to 28.71%. No further details about the transaction or the previous stake held by Baymanco were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1749102158000,
            "Source": "default"
        },
        {
            "Title": "Bombay Dyeing Reports Q4 Financial Results and Dividend",
            "Summary": "Bombay Dyeing announced its Q4 financial results, reporting a net profit of 115 million rupees, down from 664 million rupees year-over-year and 700 million rupees quarter-over-quarter. The company's Q4 revenue stood at 3.6 billion rupees, compared to 3.81 billion rupees in the same quarter last year. Additionally, Bombay Dyeing has recommended a final dividend of 1.2 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1746490204000,
            "Source": "default"
        },
        {
            "Title": "Bombay Dyeing Recommends Final Dividend",
            "Summary": "Bombay Dyeing has recommended a final dividend of 1.2 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1746452719000,
            "Source": "result"
        },
        {
            "Title": "Bombay Dyeing Reports Q4 FY23 Financial Results",
            "Summary": "Bombay Dyeing has announced its Q4 financial results. The company reported a net profit of 115 million rupees, which is lower compared to 664 million rupees in the same quarter last year and 700 million rupees in the previous quarter. The revenue for Q4 stood at 3.6 billion rupees, slightly down from 3.81 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1746452622000,
            "Source": "result"
        },
        {
            "Title": "Bombay Dyeing to Consider Q4 Results on May 5",
            "Summary": "Bombay Dyeing and Manufacturing Co. has announced that it will consider its fourth quarter (Q4) financial results on May 5. This indicates the company is preparing to disclose its performance for the latest fiscal quarter to shareholders and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1745583326000,
            "Source": "default"
        },
        {
            "Title": "GST Department Takes Action at Bombay Dyeing's Registered Office",
            "Summary": "The GST Department has initiated action at Bombay Dyeing and Manufacturing Company's registered office. The company has stated that at this stage, there is no impact on its financial or operational activities due to this action.",
            "Sentiment": "neutral",
            "PublishDate": 1739320259000,
            "Source": "corporate_governance"
        },
        {
            "Title": "GST Department Initiates Action at Bombay Dyeing's Registered Office",
            "Summary": "The Goods and Services Tax (GST) Department has initiated action at the registered office of Bombay Dyeing and Manufacturing Company. The company has stated that at this stage, there is no impact on its financial or operational activities due to this action.",
            "Sentiment": "neutral",
            "PublishDate": 1739287223000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bombay Dyeing Reports Q3 Profit, Revenue Growth",
            "Summary": "Bombay Dyeing has reported a profit before exceptional item of 431 million rupees in Q3, compared to a loss of 732 million rupees in the same period last year. The company's revenue increased to 4.15 billion rupees from 3.69 billion rupees year-over-year. An exceptional item of 507 million rupees was recorded, significantly lower than the 38.8 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738627985000,
            "Source": "earnings"
        },
        {
            "Title": "Bombay Dyeing Reports Q3 EBITDA of 159 Million Rupees",
            "Summary": "Bombay Dyeing has announced its financial results for the third quarter. The company reported an EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) of 159 million rupees. The EBITDA margin for the quarter stood at 3.84%.",
            "Sentiment": "neutral",
            "PublishDate": 1738590682000,
            "Source": "earnings"
        },
        {
            "Title": "Bombay Dyeing Reports Q3 Revenue Increase",
            "Summary": "Bombay Dyeing has announced its Q3 revenue, which stands at 4.15 billion rupees, compared to 3.69 billion rupees in the same quarter of the previous year. This represents a year-over-year increase in revenue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1738590676000,
            "Source": "earnings"
        },
        {
            "Title": "Bombay Dyeing Reports Profit in Q3 FY2024",
            "Summary": "Bombay Dyeing has reported a profit before exceptional item of 431 million rupees in Q3, compared to a loss of 732 million rupees in the same quarter last year. The company also had an exceptional item of 507 million rupees this quarter, significantly lower than the 38.8 billion rupees exceptional item in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738590669000,
            "Source": "earnings"
        },
        {
            "Title": "Bombay Dyeing & Manufacturing to Consider Q3 Results on February 3",
            "Summary": "Bombay Dyeing & Manufacturing Company has announced that it will consider its third quarter (Q3) financial results on February 3. This indicates that the company is preparing to release its earnings report for the latest fiscal quarter, which is a standard practice for publicly traded companies.",
            "Sentiment": "neutral",
            "PublishDate": 1737722698000,
            "Source": "earnings"
        },
        {
            "Title": "Bombay Dyeing Reports Q2 Net Profit of 3.9 Billion Rupees",
            "Summary": "Bombay Dyeing has reported a net profit of 3.9 billion rupees in Q2, compared to a loss of 520 million rupees in the same quarter last year and a profit of 155 million rupees in the previous quarter. The company's revenue for Q2 stood at 3.8 billion rupees, down from 4.4 billion rupees year-over-year. An exceptional item of 5 billion rupees was recorded in Q2 FY25. The company's loss before tax (LBT) for Q2 was 283 million rupees, an improvement from the 1.2 billion rupees loss in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731455776000,
            "Source": "result"
        }
    ]
}