{
    "Symbol": "BORANA",
    "ISIN": "INE16SF01016",
    "News": [
        {
            "Title": "Borana Weaves Q3 FY26 Net Profit Surges 63.01% YoY",
            "Summary": "Borana Weaves Limited reported strong Q3 FY26 results with net profit rising 63.01% YoY to ₹1,854.76 lakhs. Revenue from operations grew 42.05% to ₹11,136.48 lakhs, driven by improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1769172790477,
            "Source": "co_actions_results"
        },
        {
            "Title": "Borana Weaves Board Meet on Jan 22 for Q3 Results",
            "Summary": "Borana Weaves Limited schedules board meeting for January 22, 2026 to approve Q3FY26 financial results and discuss major business developments including production commencement and renewable energy projects.",
            "Sentiment": "positive",
            "PublishDate": 1768567928478,
            "Source": "co_actions_results"
        },
        {
            "Title": "Borana Weaves invests ₹1 crore in Attero Recycling",
            "Summary": "Borana Weaves Limited announces strategic investment of ₹1 crore in Attero Recycling Private Limited, an e-waste and lithium-ion battery recycling company, approved by board on January 3, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767432834355,
            "Source": "co_actions_results"
        },
        {
            "Title": "Borana Weaves Reports Strong Q2 FY26 Results with 33% Revenue Growth and Completes Unit 4 Expansion",
            "Summary": "Borana Weaves Limited achieved revenue of Rs 95.50 crore in Q2 FY26, marking 33% growth, with EBITDA rising 86% to Rs 21.66 crore and PAT increasing 112% to Rs 16.65 crore. The synthetic greige fabric manufacturer completed its Unit 4 expansion ahead of schedule in October 2025, adding 700 high-tech water jet looms to strengthen its position in the growing domestic synthetic textiles market.",
            "Sentiment": "positive",
            "PublishDate": 1763535919670,
            "Source": "stock"
        },
        {
            "Title": "Borana Weaves Reports Strong Q2 Performance with 114% Net Profit Growth",
            "Summary": "Borana Weaves delivered robust quarterly results with net profit surging to 167M rupees from 78M rupees year-over-year, while revenue increased to 955M rupees from 708M rupees. The company's EBITDA nearly doubled to 217M rupees from 117M rupees, with EBITDA margin expanding to 22.69% from 16.48%, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1763135501266,
            "Source": "earnings"
        },
        {
            "Title": "Borana Weaves Completes Unit 4 Expansion with 348 Water Jet Looms Ahead of Schedule",
            "Summary": "Borana Weaves Limited announced the commencement of commercial operations for 48 water jet looms at its Surat facility, completing its Unit 4 expansion ahead of the proposed December schedule. The unit now houses all 348 state-of-the-art water jet looms, achieving the designed production capacity of 112.75 million meters per annum. The total capex for Unit 4 amounts to ₹71.35 crore, fully funded through IPO proceeds. With this expansion, the company's overall annual capacity has increased to 346 million meters. The unit will manufacture Greige cloth using high-speed and eco-friendly water jet weaving looms. Executive Director and CFO Rajkumar Borana stated that the expansion is expected to improve profitability and enhance the company's reach across domestic and international markets while supporting sustainable growth.",
            "Sentiment": "positive",
            "PublishDate": 1760448538618,
            "Source": "stock"
        },
        {
            "Title": "Borana Weaves Expands Production with 108 New Looms, Targets 346 Million Meters Capacity",
            "Summary": "Borana Weaves announced the addition of 108 new looms in Unit 4, which will increase the company's total production capacity to 346 million meters. The expanded capacity is expected to be operational by October 2025.",
            "Sentiment": "positive",
            "PublishDate": 1759153031845,
            "Source": "stock"
        },
        {
            "Title": "Borana Weaves Limited Commences Commercial Operations of 192 Water Jet Looms at Surat Facility",
            "Summary": "Borana Weaves Limited has started commercial operations of 192 water jet looms at its Surat facility as part of an expansion project to install 348 water jet looms. The company aims to enhance its weaving capacity and product range through this expansion. Director/CFO Rajkumar Borana stated that the commissioning represents a strategic step to strengthen the company's position in the textile industry and boost capacity to deliver high-quality fabrics. The new capacity is expected to improve operational efficiency, increase production volumes, and help cater to rising demand in domestic and international markets.",
            "Sentiment": "positive",
            "PublishDate": 1755103843574,
            "Source": "stock"
        }
    ]
}