{
    "Symbol": "BOROLTD",
    "ISIN": "INE02PY01013",
    "News": [
        {
            "Title": "Borosil Q3FY26 Results Show Strong Operating Performance",
            "Summary": "Borosil Limited releases investor presentation for Q3FY26, highlighting operational efficiency improvements and strategic capacity expansion plans including new stainless steel manufacturing facility.",
            "Sentiment": "positive",
            "PublishDate": 1770365050387,
            "Source": "co_actions_results"
        },
        {
            "Title": "Borosil Board Meet Set for Feb 5 to Review Q3FY26 Results",
            "Summary": "Borosil Limited has scheduled a board meeting on February 05, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769689505985,
            "Source": "co_actions_results"
        },
        {
            "Title": "Borosil Appoints Bhaunik Shah as Interim Company Secretary",
            "Summary": "Borosil Limited has appointed Mr. Bhaunik Shah as Interim Company Secretary and Compliance Officer effective December 24, 2025. Shah brings 16 years of experience in corporate governance.",
            "Sentiment": "positive",
            "PublishDate": 1766565572119,
            "Source": "stocks"
        },
        {
            "Title": "Borosil Allots 1,530 Equity Shares Under ESOP Scheme",
            "Summary": "Borosil Limited allotted 1,530 equity shares under its Employee Stock Option Scheme 2020 on December 16, 2025, increasing paid-up capital to ₹11.96 crores with 11.96 crore shares outstanding.",
            "Sentiment": "neutral",
            "PublishDate": 1765884235337,
            "Source": "co_actions_results"
        },
        {
            "Title": "Borosil Limited's Credit Ratings Reaffirmed by ICRA at AA- (Stable)",
            "Summary": "ICRA Limited reaffirmed Borosil Limited's credit ratings across all facilities totaling Rs. 284.56 crore, maintaining long-term rating at AA- (Stable) and short-term at A1+. The reaffirmation covers fund-based cash credit, term loans, and non-fund based facilities, indicating stable creditworthiness for the glassware manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1765276995119,
            "Source": "stock"
        },
        {
            "Title": "Borosil Limited Vice President Balesh Talapady Resigns from Investor Relations Role",
            "Summary": "Balesh Talapady, Vice President-Investor Relations Business Analysis at Borosil Limited, resigned from his position effective December 02, 2025, to pursue other opportunities. The resignation affects the company's senior management personnel structure as Talapady was designated as a Senior Management Personnel of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1764740567900,
            "Source": "corporate_governance"
        },
        {
            "Title": "Borosil Limited Allots 3,026 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Borosil Limited's ESOP Share Allotment Committee approved the allotment of 3,026 equity shares under the Employee Stock Option Scheme 2020 through a circular resolution on November 19, 2025. The allotment increases the company's issued and paid-up equity share capital to Rs. 11,95,80,599 divided into 11,95,80,599 equity shares of face value Re. 1 each.",
            "Sentiment": "neutral",
            "PublishDate": 1763532376987,
            "Source": "corporate_action"
        },
        {
            "Title": "Borosil Limited Reports 14.7% Revenue Growth in H1 FY26 Despite Supply Chain Challenges",
            "Summary": "Borosil Limited delivered consolidated revenues of INR 573.0 crores in H1 FY26 compared to INR 499.5 crores in the previous year, with PAT rising 45.3% to INR 40.1 crores. The company faces temporary margin pressure due to BIS compliance requirements affecting hydra bottle sales and shift from overseas to domestic sourcing, while expanding manufacturing with a new INR 65 crore stainless steel facility in Rajasthan.",
            "Sentiment": "positive",
            "PublishDate": 1763112366129,
            "Source": "earnings"
        },
        {
            "Title": "Borosil Limited Reports 22% Revenue Growth in Q2FY26 with Strong Performance Across Product Categories",
            "Summary": "Borosil Limited delivered strong quarterly results with net sales rising 22% to ₹334.2 crores compared to ₹273.9 crores in the same period last year. The company's EBITDA grew 7.6% to ₹54 crores, while profit after tax increased 24% to ₹22.7 crores. For the half-year period, net sales reached ₹560.6 crores, up 14.3% from ₹490.7 crores previously. The glassware segment showed exceptional growth of 51.6% in the quarter, while non-glassware and opalware segments grew 13.7% and 13.3% respectively. The company operates with 84 TPD opalware capacity and 25 TPD borosilicate glass manufacturing capacity. Borosil is expanding its manufacturing capabilities with a new facility in Rajasthan for vacuum insulated stainless steel products, requiring an estimated investment of ₹65 crores with initial capacity of 3.6 million units annually. The company maintains a strong balance sheet with net debt of ₹4.5 crores and continues to focus on product innovation and market expansion across multiple channels including general trade, modern trade, and e-commerce.",
            "Sentiment": "positive",
            "PublishDate": 1762753735472,
            "Source": "earnings"
        },
        {
            "Title": "Borosil Reports 26% Revenue Growth and Expands Rajasthan Manufacturing Facility",
            "Summary": "Borosil reported quarterly revenue of 3.4 billion rupees, up from 2.7 billion rupees in the same period last year, representing a year-over-year increase. The company's board has modified project details for its new manufacturing facility in Rajasthan, with plans to add three double-wall production lines to the facility.",
            "Sentiment": "positive",
            "PublishDate": 1762507772180,
            "Source": "earnings"
        },
        {
            "Title": "Borosil Scientific Reports Decline in Profitability Despite Revenue Growth",
            "Summary": "Borosil Scientific reported quarterly results showing mixed performance. Revenue increased to 1.1 billion rupees from 1 billion rupees year-over-year. However, EBITDA declined significantly to 80 million rupees from 155 million rupees, while EBITDA margin compressed to 7.51% from 15.06%. Consolidated net profit fell to 29 million rupees compared to 88 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1762434149975,
            "Source": "earnings"
        },
        {
            "Title": "Anti-Dumping Investigation Launched for Glassware Imports from China",
            "Summary": "An anti-dumping investigation has been initiated regarding glassware imports from China. This development is related to Borosil, though specific details about the investigation's scope, timeline, or potential impact were not provided.",
            "Sentiment": "neutral",
            "PublishDate": 1759232462321,
            "Source": "stock"
        },
        {
            "Title": "Borosil Limited Reports Strong Q1 Results with 87% Jump in Profit",
            "Summary": "Borosil Limited reported revenue of ₹232.7 crores for Q1, up 5.2% year-on-year. EBITDA increased 28.5% to ₹47.2 crores while profit after tax surged 87.4% to ₹17.4 crores. The consumer products company operates across three segments: Non-Glassware (₹94.2 crores, up 10.7%), Opalware (₹76.2 crores, up 0.1%), and Glassware (₹56.2 crores, up 0.9%). Borosil plans to establish a new manufacturing facility for vacuum-insulated stainless steel bottles with ₹40 crore investment, targeting 2.4 million units annual capacity by Q4. The company targets 15-20% revenue CAGR and operates 2 Opal Glass furnaces with 84 TPD capacity plus 1 Borosilicate Glass furnace with 25 TPD capacity. Distribution network spans 250,000 retail outlets through 18,000+ distributors offering 24,000+ SKUs.",
            "Sentiment": "positive",
            "PublishDate": 1755494554855,
            "Source": "earnings"
        },
        {
            "Title": "Borosil Limited Reports Q1 Results with 87% Jump in Standalone Profit",
            "Summary": "Borosil Limited announced its quarterly results for the period ended June 30, 2025. The company's standalone profit increased to Rs. 1,292.85 lakhs compared to Rs. 929.35 lakhs in the same quarter last year. Revenue from operations declined to Rs. 22,124.80 lakhs from Rs. 23,268.97 lakhs year-over-year. On a consolidated basis, profit rose to Rs. 1,741.40 lakhs from Rs. 929.35 lakhs in the corresponding quarter. The company allotted 28,321 equity shares under its employee stock option scheme, increasing paid-up capital by Rs. 0.28 lakh. Borosil incorporated a wholly-owned subsidiary, Stylenest India Limited, for manufacturing and marketing household and kitchenware products. Basic earnings per share stood at Rs. 1.46 for the quarter on a consolidated basis.",
            "Sentiment": "positive",
            "PublishDate": 1755166376397,
            "Source": "earnings"
        },
        {
            "Title": "Borosil Reports Strong Q1 Performance with 87% Jump in Net Profit",
            "Summary": "Borosil delivered robust quarterly results with consolidated net profit surging to 174 million rupees from 93 million rupees year-over-year. Revenue grew to 2.33 billion rupees compared to 2.2 billion rupees in the same period last year. The company's EBITDA increased to 373 million rupees from 334 million rupees, while EBITDA margin expanded to 16.1% from 15.1% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1755165787311,
            "Source": "earnings"
        },
        {
            "Title": "Borosil Scientific Targets 12-14% Revenue Growth Through Export Expansion and Product Innovation",
            "Summary": "Borosil Scientific has outlined its strategy to achieve 12-14% revenue growth by focusing on export expansion, high-profit laboratory equipment, and product diversification. The company is emphasizing 'Make In India' initiatives, new product innovations, and leveraging its brand reputation to improve margins and expand its global market presence.",
            "Sentiment": "positive",
            "PublishDate": 1755016914207,
            "Source": "stock"
        },
        {
            "Title": "Borosil Scientific Reports Q1 Loss of 42M Rupees, Revenue Drops to 960M",
            "Summary": "Borosil Scientific reported a consolidated net loss of 42 million rupees in Q1, compared to a profit of 50 million rupees in the same period last year. Revenue declined to 960 million rupees from 1 billion rupees year-over-year. EBITDA fell to 49 million rupees from 102 million rupees, while EBITDA margin compressed to 5.1% from 9.8% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754899094192,
            "Source": "earnings"
        },
        {
            "Title": "Borosil Ltd: Q4 Profit Doubles, Share Price Surges",
            "Summary": "Borosil Ltd's Q4 consolidated revenue increased by 15.7% to Rs 270 crore. Ebitda grew 57% to Rs 37 crore, with margin improving to 13.7%. Net profit more than doubled to Rs 11 crore. Share price initially surged 9.45% to Rs 392, later trading 2.99% higher at Rs 368.85.",
            "Sentiment": "positive",
            "PublishDate": 1747718188000,
            "Source": "earnings"
        },
        {
            "Title": "Borosil Ltd: Q4 Profit Doubles, Board Approves Expansion",
            "Summary": "Borosil Ltd reported a 120% YoY increase in Q4 FY25 net profit to ₹11 crore. Revenue grew 15.8% to ₹270.2 crore. The board approved a capacity expansion of 600 tonnes per day with an estimated investment of ₹950 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747666335000,
            "Source": "earnings"
        },
        {
            "Title": "Borosil to Raise Funds Up to 2.50 Billion Rupees",
            "Summary": "Borosil has announced plans to raise funds up to 2.50 billion rupees. No further details about the purpose of the fundraising or the method of raising funds were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1747658466000,
            "Source": "default"
        },
        {
            "Title": "Borosil Reports Significant Growth in Q4 Financial Results",
            "Summary": "Borosil has announced its Q4 financial results, showing substantial year-over-year improvements. The company's EBITDA increased to 372 million rupees from 191 million rupees in the previous year. The EBITDA margin rose to 13.75% from 8.34%. Consolidated net profit grew to 111 million rupees from 50 million rupees year-over-year, and 355 million rupees quarter-over-quarter. Revenue for Q4 reached 2.7 billion rupees, up from 1.8 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747657805000,
            "Source": "result"
        },
        {
            "Title": "Borosil to Establish New Manufacturing Unit in Rajasthan",
            "Summary": "Borosil has announced plans to set up a new manufacturing unit in Rajasthan. The estimated capital expenditure for this new facility is 400 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1743599781000,
            "Source": "corporate_action"
        },
        {
            "Title": "Borosil Ltd Schedules Analyst/Investor Meeting",
            "Summary": "Borosil Ltd has announced a meeting with analysts and investors scheduled for March 20 at 9 AM. This meeting suggests the company's commitment to maintaining transparent communication with its stakeholders and potentially discussing recent developments or future strategies.",
            "Sentiment": "neutral",
            "PublishDate": 1741879076000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Borosil Ltd: Sharp Single-Day Stock Plunge Following Q3 Results",
            "Summary": "Borosil Ltd shares fell up to 18% on February 18, marking the largest single-day decline on record. The stock closed 8% lower at ₹315. Q3 FY25 results showed 11.3% revenue growth but a 6.4% drop in net profit due to rising costs.",
            "Sentiment": "negative",
            "PublishDate": 1739871872000,
            "Source": "earnings"
        },
        {
            "Title": "Borosil Reports Q3 EBITDA Decline",
            "Summary": "Borosil's Q3 EBITDA decreased to 544 million rupees from 567 million rupees year-over-year. The company's EBITDA margin also declined to 16.08% from 18.75% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738922828000,
            "Source": "earnings"
        },
        {
            "Title": "Borosil Reports Mixed Q3 Financial Results",
            "Summary": "Borosil announced its Q3 financial results, showing a slight decline in net profit but an increase in revenue. The company's consolidated net profit decreased to 355 million rupees from 373 million rupees year-over-year. However, revenue grew to 3.4 billion rupees from 3 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738922822000,
            "Source": "earnings"
        },
        {
            "Title": "Anti-Dumping Duty Recommended on Chinese Vacuum Insulated Flasks",
            "Summary": "The authority has recommended imposing an anti-dumping duty on imports of vacuum insulated flasks and other stainless steel vacuum vessels from China PR. This measure is aimed at addressing dumping practices and protecting the domestic industry from injury.",
            "Sentiment": "positive",
            "PublishDate": 1734785379000,
            "Source": "corporate_action"
        },
        {
            "Title": "Borosil Reports Q2 EBITDA Growth",
            "Summary": "Borosil's Q2 EBITDA increased to 408 million rupees from 372 million rupees year-over-year. However, the EBITDA margin decreased to 14.89% from 15.85% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731485536000,
            "Source": "result"
        },
        {
            "Title": "Borosil Reports Q2 Revenue Growth",
            "Summary": "Borosil has announced its Q2 revenue, which stands at 2.7 billion rupees, compared to 2.35 billion rupees in the same quarter last year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731485468000,
            "Source": "result"
        },
        {
            "Title": "Borosil Reports Q2 Consolidated Net Profit",
            "Summary": "Borosil has reported a consolidated net profit of 183 million rupees for the second quarter, compared to 185 million rupees in the same period last year, showing a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1731485416000,
            "Source": "result"
        },
        {
            "Title": "Borosil Group Projects Significant Revenue Growth",
            "Summary": "The Borosil Group anticipates substantial revenue growth over the next four years. The company expects to achieve a revenue of approximately Rs 3,500 crore in the fiscal year 2025 and aims to surpass Rs 7,000 crore in revenue within four years.",
            "Sentiment": "positive",
            "PublishDate": 1729482014000,
            "Source": "normal_news"
        }
    ]
}