{
    "Symbol": "BOROSCI",
    "ISIN": "INE02L001032",
    "News": [
        {
            "Title": "Borosil Scientific Q3 Net Profit Drops 32% YoY",
            "Summary": "Borosil Scientific reported a net profit of 241 million rupees in Q3, marking a significant decline from 354 million rupees in the same quarter last year, representing a 32% year-on-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1770282451427,
            "Source": "co_actions_results"
        },
        {
            "Title": "Borosil Scientific Gets Credit Rating Reaffirmation",
            "Summary": "CARE Ratings reaffirmed Borosil Scientific's credit ratings with CARE A- (Stable) for long-term and CARE A1 for short-term facilities. Bank facilities enhanced to ₹99.47 crores from ₹97.90 crores.",
            "Sentiment": "positive",
            "PublishDate": 1765430189774,
            "Source": "stocks"
        },
        {
            "Title": "Borosil Scientific Invests Rs 116.82 Crore in Subsidiary Goel Scientific Through Rights Issue",
            "Summary": "Borosil Scientific Limited made a further investment of Rs 11,68,15,570 in its subsidiary Goel Scientific Glass Works Limited through a rights issue, comprising 1,16,81,557 equity shares at Rs 10 per share. The investment will increase Borosil's shareholding in Goel to 99.37% and enable the subsidiary to meet capital expenses, operational costs and general corporate purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1764229188216,
            "Source": "corporate_action"
        },
        {
            "Title": "Borosil Scientific Reports Mixed Q2 FY26 Results with Revenue Growth but Margin Decline",
            "Summary": "Borosil Scientific Limited reported quarterly results for the period ended September 30, 2025. On a standalone basis, net sales increased 13.8% to ₹99.5 crores compared to ₹87.4 crores in the same quarter last year. However, EBITDA declined 4.1% to ₹14.6 crores with margins contracting to 14.7% from 17.4%. On a consolidated basis, net sales grew 3.8% to ₹106.9 crores while EBITDA fell significantly by 41.5% to ₹10.2 crores, with margins dropping to 9.5% from 16.9%. The company attributed the margin decline to one-time expenses related to discontinued operations at the Ambad manufacturing plant and costs associated with a Voluntary Retirement Scheme settlement of ₹6.61 crores. The Scientific Segment generated ₹71.9 crores in revenue while the Glassware Segment contributed ₹32.9 crores. The company maintains medium-term revenue growth targets of 12-14% CAGR and focuses on expanding its laboratory equipment and process sciences businesses.",
            "Sentiment": "neutral",
            "PublishDate": 1762977146406,
            "Source": "earnings"
        },
        {
            "Title": "Borosil Scientific Plans Multi-Year Expansion in Lab Glassware and Life Sciences",
            "Summary": "Borosil Scientific is targeting multi-year expansion with advanced lab glassware and life-sciences solutions. The company is investing in automation and export capabilities while increasing R&D for specialized lab equipment. The focus includes margin growth through product diversification and global brand reach.",
            "Sentiment": "positive",
            "PublishDate": 1762963247069,
            "Source": "stock"
        },
        {
            "Title": "Borosil Scientific Reports Mixed Q2 Results with 13.8% Revenue Growth but 2.1% Profit Decline",
            "Summary": "Borosil Scientific Limited reported quarterly results with revenue from operations increasing 13.8% to Rs 9,948.14 lakhs compared to Rs 8,738.46 lakhs in the same quarter last year. However, net profit declined 2.1% to Rs 752.06 lakhs from Rs 768.69 lakhs year-over-year. For the half-year period, revenue grew 4.1% to Rs 18,849.09 lakhs while profit fell 43.6% to Rs 797.82 lakhs. The company's Scientific-Laboratory Glass & equipment segment generated Rs 6,368.45 lakhs in quarterly revenue, while the Glassware segment contributed Rs 3,374.73 lakhs. The company implemented a Voluntary Retirement Scheme resulting in exceptional expenses of Rs 661.31 lakhs during the first quarter. Earnings per share for the quarter stood at Rs 0.85 compared to Rs 0.87 in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762472411049,
            "Source": "earnings"
        },
        {
            "Title": "Anti-Dumping Investigation Initiated on Chinese Borosilicate Glassware Imports",
            "Summary": "An anti-dumping investigation has been initiated concerning imports of borosilicate table and kitchen glassware originating from or exported from China. This investigation relates to Borosil's business segment in borosilicate glassware products.",
            "Sentiment": "neutral",
            "PublishDate": 1759284483037,
            "Source": "stock"
        },
        {
            "Title": "Borosil Shares Surge Over 11% in Three-Day Rally",
            "Summary": "Borosil Ltd. extended its winning streak for the third consecutive session, gaining 6.64% intraday and accumulating over 11% gains across three trading sessions. The stock rose 4.67% on Monday to Rs 357 and nearly 7% on Tuesday to Rs 375.95. The company reported strong quarterly results with consolidated net profit surging 87% to Rs 17.41 crore compared to Rs 9.29 crore in the same period last year. EBITDA increased 12% year-on-year to Rs 37.32 crore, while operating margins improved to 16% from 15.1%. The stock traded 1.93% higher at Rs 380.80 with trading volume at 47 times its 30-day average. All four analysts tracking the company maintain 'buy' ratings with an average 12-month price target implying 2.1% upside.",
            "Sentiment": "positive",
            "PublishDate": 1758688767639,
            "Source": "stock"
        },
        {
            "Title": "Borosil Scientific Appoints Paresh Thaker as Associate VP & Plant Head, Nashik",
            "Summary": "Borosil Scientific Limited appointed Mr. Paresh Thaker as Associate Vice President & Plant Head, Nashik, effective August 14, 2025. Thaker brings over 30 years of experience in primary pharmaceutical packaging, plant operations, project management, and process optimization. He previously held senior leadership positions at Nipro Pharma Packaging and Videocon Industries, leading expansion projects, technology upgrades, and operational efficiency initiatives. Thaker holds a bachelor's degree in Mechanical Engineering from Gujarat University and an MBA in Operations from ISBM, Ahmedabad. He is recognized for expertise in lean manufacturing, safety and compliance, technical workforce development, and pharmaceutical packaging solutions.",
            "Sentiment": "positive",
            "PublishDate": 1755510536002,
            "Source": "corporate_governance"
        },
        {
            "Title": "Borosil Reports 87% Profit Surge in Q1 Results with Margin Expansion",
            "Summary": "Borosil Ltd. reported strong quarterly results with consolidated net profit jumping 87% to Rs 17.41 crore compared to Rs 9.29 crore in the same period last year. Revenue grew 5.2% to Rs 232.68 crore from Rs 221.24 crore. EBITDA increased 12% to Rs 37.32 crore versus Rs 33.4 crore, while margins expanded to 16% from 15.1%. Despite the positive results, Borosil shares closed 0.79% lower at Rs 332.05 on NSE. The stock has declined 17.03% over the past 12 months and 17.93% year-to-date. All three analysts covering the company maintain 'buy' ratings, with average price targets suggesting 22% potential upside.",
            "Sentiment": "positive",
            "PublishDate": 1755169949796,
            "Source": "earnings"
        },
        {
            "Title": "Borosil Scientific Reports 93% Drop in Quarterly Profit Due to VRS Settlement Costs",
            "Summary": "Borosil Scientific Limited reported a standalone net profit of Rs. 45.76 lakhs for the quarter ended June 30, 2025, compared to Rs. 647.14 lakhs in the same period last year. The significant decline was primarily due to exceptional items worth Rs. 661.31 lakhs related to a Voluntary Retirement Scheme settlement with workers at its Nashik plant. Revenue from operations decreased to Rs. 8,900.95 lakhs from Rs. 9,375.58 lakhs year-over-year. On a consolidated basis, the company reported a net loss of Rs. 420.96 lakhs compared to a profit of Rs. 502.28 lakhs in the previous year. The company's Scientific segment generated revenue of Rs. 5,625.81 lakhs while the Glassware segment contributed Rs. 3,213.12 lakhs. The company also allotted 12,625 equity shares under its employee stock option plan during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754899767372,
            "Source": "earnings"
        },
        {
            "Title": "Borosil Scientific to Seek Shareholder Approval for 2.50B Rupee Fundraising",
            "Summary": "Borosil Scientific plans to seek shareholders' approval to raise up to 2.50 billion rupees. The company has not provided details on how the funds will be used or the method of fundraising.",
            "Sentiment": "neutral",
            "PublishDate": 1747830929000,
            "Source": "default"
        },
        {
            "Title": "Borosil Scientific Reports Q4 Financial Results",
            "Summary": "Borosil Scientific has reported its Q4 financial results. The company's EBITDA for Q4 was 166 million rupees, compared to 183 million rupees in the same quarter last year. The EBITDA margin decreased to 12.79% from 15.78% year-over-year. The consolidated net profit for Q4 was 87 million rupees, down from 93 million rupees year-over-year, but up from 43 million rupees quarter-on-quarter. Q4 revenue increased to 1.3 billion rupees from 1.15 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1747828995000,
            "Source": "result"
        },
        {
            "Title": "Borosil Scientific Reports Q3 Financial Results",
            "Summary": "Borosil Scientific has announced its Q3 consolidated financial results. The company reported a net profit of 43 million rupees, down from 57 million rupees in the same quarter last year. Revenue for the quarter stood at 1 billion rupees, slightly up from 997 million rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1739262322000,
            "Source": "earnings"
        },
        {
            "Title": "Borosil Scientific Reports Strong Q2 Financial Results",
            "Summary": "Borosil Scientific has announced its Q2 financial results, showing significant year-over-year improvements. The company's consolidated net profit increased to 88 million rupees, up from 51 million rupees in the same quarter last year and 50 million rupees in the previous quarter. Revenue rose to 1 billion rupees from 920 million rupees year-over-year. EBITDA improved to 155 million rupees from 95 million rupees, with the EBITDA margin expanding to 15.06% from 10.30% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731456021000,
            "Source": "result"
        }
    ]
}