{
    "Symbol": "BORORENEW",
    "ISIN": "INE666D01022",
    "News": [
        {
            "Title": "Borosil Renewables Files Q3FY26 Monitoring Reports",
            "Summary": "Borosil Renewables submitted monitoring agency reports for Q3FY26 covering two preferential issues totaling ₹889.15 crore, with ICRA and CARE confirming no deviations from stated objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1769665450546,
            "Source": "co_actions_results"
        },
        {
            "Title": "Borosil Renewables Q3FY26 Results Show Strong Recovery",
            "Summary": "Borosil Renewables reported impressive Q3FY26 results with revenue of Rs. 38,650.48 lakhs and net profit of Rs. 7,825.96 lakhs, marking a significant turnaround from previous year's loss.",
            "Sentiment": "positive",
            "PublishDate": 1769613499357,
            "Source": "co_actions_results"
        },
        {
            "Title": "Borosil Renewables Q3FY26 Results Call on Jan 29",
            "Summary": "Borosil Renewables announces conference call with analysts and investors on January 29, 2026 at 4:00 PM IST to discuss Q3FY26 financial performance for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768998792987,
            "Source": "co_actions_results"
        },
        {
            "Title": "Borosil Renewables Appoints Ajay Singh as VP Manufacturing",
            "Summary": "Borosil Renewables Limited has appointed Mr. Ajay Singh as Vice President - Manufacturing at its Bharuch Plant, effective January 21, 2026. Singh brings over 26 years of manufacturing experience from Guardian Industries and Gerresheimer.",
            "Sentiment": "positive",
            "PublishDate": 1768975931321,
            "Source": "stocks"
        },
        {
            "Title": "Borosil Renewables Discloses Senior Management Resignation",
            "Summary": "Borosil Renewables disclosed resignation of AVP & Plant Head citing personal reasons, though resignation remains unaccepted due to outstanding loan amounts. Company pursuing legal action.",
            "Sentiment": "negative",
            "PublishDate": 1768913553655,
            "Source": "stocks"
        },
        {
            "Title": "Borosil Renewables Chairman Discusses Business Update",
            "Summary": "Borosil Renewables Executive Chairman Pradeep Kumar Kheruka provided a general business update in an interview on ET Now on January 01, 2026, discussing the company's current operations and developments.",
            "Sentiment": "neutral",
            "PublishDate": 1767268484645,
            "Source": "stocks"
        },
        {
            "Title": "Borosil Renewables Gets Credit Rating Outlook Upgrade",
            "Summary": "India Ratings revises outlook to positive from negative while affirming IND A rating on improved EBITDA margins and strengthened credit metrics following equity fundraise.",
            "Sentiment": "positive",
            "PublishDate": 1767092770522,
            "Source": "stocks"
        },
        {
            "Title": "Borosil Renewables: Solar Glass Import Duty Extended",
            "Summary": "Borosil Renewables announces extension of countervailing duty on Malaysian solar glass imports until June 8, 2026, following Ministry of Finance notification dated December 7, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766067906179,
            "Source": "stocks"
        },
        {
            "Title": "Borosil Renewables Promotes Dhaval Patel to Senior Management",
            "Summary": "Borosil Renewables Limited has designated Mr. Dhaval Patel as Senior Management Personnel, expanding his role from Associate Vice President Finance to also lead Investor Relations Department effective December 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765867447522,
            "Source": "stocks"
        },
        {
            "Title": "Borosil Renewables Receives ₹14.21 Crore Subsidy, Total Government Support Reaches ₹106.53 Crore",
            "Summary": "Borosil Renewables obtained ₹14.21 crores in subsidy from the Ministry of Electronics & Information Technology. The company's total subsidy receipts over the last two years have reached ₹106.53 crores, indicating substantial government support for its operations.",
            "Sentiment": "positive",
            "PublishDate": 1764319054960,
            "Source": "stock"
        },
        {
            "Title": "Borosil Renewables Head of Internal Audit Vikas Runthala Resigns",
            "Summary": "Vikas Runthala has resigned from his position as Head of Internal Audit at Borosil Renewables. The departure affects the company's internal audit leadership structure.",
            "Sentiment": "neutral",
            "PublishDate": 1764252943054,
            "Source": "corporate_governance"
        },
        {
            "Title": "Borosil Renewables Grants 5,10,100 Stock Options to Employees Under ESOP Scheme",
            "Summary": "Borosil Renewables' Nomination and Remuneration Committee granted 5,10,100 stock options to eligible employees under the Borosil Employee Stock Option Scheme 2017 at Rs. 491 per option, representing a 20% discount to market price. Each option entitles holders to apply for one equity share of Re. 1 each, with vesting scheduled over multiple years and exercise period of 5 years from vesting date.",
            "Sentiment": "positive",
            "PublishDate": 1763727081836,
            "Source": "corporate_action"
        },
        {
            "Title": "Borosil Renewables Reports Strong Q2 FY26 Results with 33.2% EBITDA Margin Despite European Subsidiary Challenges",
            "Summary": "Borosil Renewables achieved sales of INR 378.44 crores with EBITDA margin of 33.2% in Q2 FY26, driven by higher selling prices of INR 147.5 per millimeter and near-full capacity utilization of 991 tons per day. The company took an impairment provision of INR 33.87 crores for its European subsidiary Interfloat Corporation due to reduced demand following cessation of annealed glass production at GMB Germany.",
            "Sentiment": "positive",
            "PublishDate": 1763385991532,
            "Source": "earnings"
        },
        {
            "Title": "Borosil Renewables Targets 32-33% EBITDA Margin Through FY27 With Capacity Expansion",
            "Summary": "Borosil Renewables expects to maintain 32-33% EBITDA margins in FY26 and FY27, supported by a Rs 950 crore investment in two new furnaces that will add 600 TPD capacity by Q3FY27. The company currently operates at 100% capacity utilization with 1,000 TPD, while domestic solar glass demand is projected to grow from 5,000+ TPD to 7,000 TPD within 12 months.",
            "Sentiment": "positive",
            "PublishDate": 1763175764646,
            "Source": "stock"
        },
        {
            "Title": "Borosil Renewables Projects 3% Production Efficiency Gains and Higher Sales in Coming Quarters",
            "Summary": "Borosil Renewables management indicated potential for small efficiency improvements of around 3% in production through commissioning of a captive power plant by month end, operational improvements in raw materials and coating materials, and production efficiencies. The company expects to achieve higher sales and EBITDA in coming quarters, barring unforeseen circumstances. Management expressed confidence in sustaining EBITDA margins at 33%.",
            "Sentiment": "positive",
            "PublishDate": 1763004727372,
            "Source": "stock"
        },
        {
            "Title": "Borosil Renewables Rectifies Financial Results After Inadvertent Error in Consolidated Statements",
            "Summary": "Borosil Renewables Limited submitted corrected unaudited consolidated financial results for the quarter and half year ended September 30, 2025, after discovering that a line item for 'Purchases of Stock-in-Trade' was inadvertently hidden in the original submission made on November 11, 2025. The company clarified that the respective row in the excel sheet was hidden while taking printout of the financial results. The corrected financial results have been resubmitted along with Limited Review Reports from the auditor. The company emphasized that there is no change in the overall consolidated financial results due to this rectification. The corrected results show revenue from operations of Rs. 37,887.50 lakhs for the quarter and Rs. 72,545.20 lakhs for the half year, with the company reporting a profit of Rs. 2,662.12 lakhs for the quarter attributable to owners.",
            "Sentiment": "neutral",
            "PublishDate": 1762971123096,
            "Source": "earnings"
        },
        {
            "Title": "Borosil Renewables Reports No Deviation in Fund Utilization for Quarter Ended September 2025",
            "Summary": "Borosil Renewables Limited submitted its monitoring agency report for the quarter ended September 30, 2025, prepared by ICRA Limited. The report confirms no deviation from the objects of the preferential issue, with fund utilization in line with stated purposes. The company raised INR 517.66 crore through preferential issue of equity shares and warrants, reduced from the original INR 700 crore due to ineligibility of proposed allottees and undersubscription. As of September 30, 2025, the net proceeds account had a balance of INR 235.14 crore. The company utilized INR 185 crore for satisfaction of liability arising from standby letter of credit for subsidiary GMB Glasmanufaktur Brandenburg GmbH, and INR 16.35 crore for capital expenditure to expand solar glass manufacturing capacity at its Bharuch facility. Unutilized proceeds of INR 34.51 crore were deployed in mutual funds and warrant accounts, generating returns of INR 1.11 crore. The report notes that GMB filed for insolvency proceedings in Germany during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762889156412,
            "Source": "corporate_action"
        },
        {
            "Title": "Borosil Renewables Reports 3.5x Jump in Quarterly Profit to ₹45.8 Crore",
            "Summary": "Borosil Renewables reported consolidated net profit of ₹45.8 crore for the quarter ended September 2025, compared to ₹12.6 crore in the same period last year. Revenue from operations increased 42.5% year-on-year to ₹378.4 crore from ₹265 crore, driven by higher sales volumes and improved realisations. EBITDA more than doubled to ₹124 crore from ₹48 crore, while operating margins expanded to 32.8% from 18.1%. The solar glass manufacturer benefited from robust demand amid India's renewable energy expansion and has been scaling capacity for domestic and export markets. Shares were trading 1.4% higher and have gained approximately 24% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1762850513259,
            "Source": "earnings"
        },
        {
            "Title": "Borosil Renewables Reports Rs 22,653 Crore Loss Due to Subsidiary Impairment, Appoints New Company Secretary",
            "Summary": "Borosil Renewables Limited reported a net loss of Rs 22,653 crore for the half-year ended September 30, 2025, compared to a profit of Rs 898 crore in the previous year. The loss was primarily driven by exceptional items worth Rs 35,978 crore related to impairment provisions for subsidiaries GMB Glasmanufaktur Brandenburg GmbH and Interfloat Corporation. Revenue from operations increased to Rs 71,070 crore from Rs 50,743 crore year-on-year. The company's German subsidiary GMB filed for insolvency proceedings in July 2025 due to absence of demand recovery and monthly funding requirements of Euro 900 thousand. The board accepted the resignation of Company Secretary Ravi Vaishnav effective November 10, 2025, and appointed Kishor Harish Talreja as the new Company Secretary and Compliance Officer from November 11, 2025. Post-quarter end, the company raised Rs 37,149 crore through preferential allotment of equity shares to non-promoter investors.",
            "Sentiment": "negative",
            "PublishDate": 1762848197472,
            "Source": "earnings"
        },
        {
            "Title": "Borosil Renewables Reports Strong Q2 Turnaround with 264M Rupees Net Profit",
            "Summary": "Borosil Renewables reported a net profit of 264 million rupees in Q2, marking a significant turnaround from a loss of 97.5 million rupees in the same period last year. The company's EBITDA surged to 1.19 billion rupees compared to 294 million rupees year-over-year. EBITDA margin expanded substantially to 31.3% from 7.9% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762847719297,
            "Source": "earnings"
        },
        {
            "Title": "Borosil Renewables Converts 28,301 Warrants to Equity Shares",
            "Summary": "Borosil Renewables Limited has allotted 28,301 equity shares of face value Re. 1/- each to Pushpman Consultants Private Limited following warrant conversion. The warrant holder paid the balance 75% amount of Rs. 397.50 per warrant for conversion. These warrants were originally part of 78,80,436 warrants allotted in February 2025 at an issue price of Rs. 530/- each on preferential basis to non-promoter category persons. The company's paid-up equity share capital has increased to Rs. 14,01,88,845 divided into 14,01,88,845 equity shares. The newly allotted shares rank pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1761652593668,
            "Source": "corporate_action"
        },
        {
            "Title": "Borosil Renewables Raises Rs. 371.49 Crores Through Preferential Share Allotment",
            "Summary": "Borosil Renewables Limited allotted 69,43,691 equity shares at Rs. 535 per share to 78 non-promoter investors through a preferential issue, raising Rs. 371.49 crores. The company's paid-up equity share capital increased to Rs. 14,01,60,544 following the allotment. The shares were issued at face value of Re. 1 each with a premium of Rs. 534 per share. Major investors include Niveshaay Hedgehogs Fund, Abakkus Diversified Alpha Fund-2, and Dharmapal Satyapal Limited. The company received in-principle approval from BSE Limited and National Stock Exchange of India Limited. The newly allotted shares rank equally with existing equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1760719242698,
            "Source": "corporate_action"
        },
        {
            "Title": "India Mandates Prior Registration for Renewable Energy Component Imports Starting November 2025",
            "Summary": "The Directorate General of Foreign Trade has introduced mandatory prior registration requirements for specified renewable energy components on the Renewable Energy Equipment Import Monitoring System (REEIMS) effective November 1, 2025. The new policy covers solar glass and photovoltaic cells under specific HS codes for solar energy projects, as well as components for wind-operated electricity generation. Registration applications must be submitted at least two days in advance for air cargo and five days for sea and land route shipments. Each registration remains valid for three months with no registration fee required. The mechanism aims to track imports of critical components for the renewable energy sector to streamline supply chain and support sector growth. Borosil Renewables Limited informed stock exchanges about this policy update that affects companies importing renewable energy components.",
            "Sentiment": "neutral",
            "PublishDate": 1760444848430,
            "Source": "stock"
        },
        {
            "Title": "Borosil Renewables Reports Strong Q1 Profitability Turnaround Despite Revenue Decline",
            "Summary": "Borosil Renewables delivered significantly improved quarterly results with EBITDA rising to 630 million rupees from 228 million rupees year-over-year. The company's EBITDA margin expanded substantially to 18.2% compared to 6.14% in the same period last year. The company achieved a consolidated profit before exceptional items of 360 million rupees, marking a turnaround from a loss of 160 million rupees in the previous year. However, revenue declined to 3.47 billion rupees from 3.71 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1756888628155,
            "Source": "earnings"
        },
        {
            "Title": "Borosil Renewables Revises Preferential Issue to Rs 376 Crores After Removing Four Ineligible Allottees",
            "Summary": "Borosil Renewables Limited issued a corrigendum for its Extra-Ordinary General Meeting scheduled for August 14, 2025, revising its preferential issue details. The company removed four proposed allottees - Mr. Yaman Shailesh Shah, Mr. Abhishek Jain, Mr. Raviendra Manchala and Mr. Santosh Kumar Sinha - due to ineligibility. Three allottees had sold shares during the 90 trading days preceding the relevant date, while one failed to provide complete information required by stock exchanges. Consequently, the fund raise amount was reduced from Rs 379.52 crores to Rs 376.02 crores, and the number of equity shares decreased from 70,93,874 to 70,28,456. The issue price remains unchanged at Rs 535 per share. The proceeds will be used for capital expenditure to expand solar glass manufacturing capacity at the Bharuch facility (Rs 317.34 crores) and general corporate purposes (Rs 58.68 crores). The preferential issue is being made entirely to non-promoter category investors.",
            "Sentiment": "neutral",
            "PublishDate": 1754572891735,
            "Source": "corporate_action"
        },
        {
            "Title": "Borosil Renewables Exits Germany, Refocuses on India Solar Market After ₹326 Crore Loss",
            "Summary": "Borosil Renewables declared its German subsidiary GMB Glasmanufaktur Brandenburg GmbH insolvent, booking a one-time loss of ₹325.91 crore. The company acquired the German solar glass facility in 2022 but faced severe challenges when Chinese manufacturers dumped over 80 GW worth of ultra-cheap solar modules into Europe, causing module prices to fall from 25 cents to below 10 cents. Monthly losses reached ₹8.5-9 crore with no policy support from German authorities. The company is now refocusing entirely on India's solar market, where standalone revenue grew 37% year-on-year to ₹332.26 crore in Q1 FY26, with EBITDA surging 211% to ₹92.53 crore and margins hitting 27.8%. India imposed anti-dumping duties on Chinese and Vietnamese solar glass imports in December 2024, improving domestic pricing to ₹135-140 per mm square. Borosil announced a ₹950 crore expansion plan to build two new 300-tonne furnaces at its Bharuch facility, funded through ₹650 crore from equity and internal accruals and ₹300 crore debt. The expansion targets India's solar glass supply gap, with domestic capacity at only 15 GW against projected 50 GW demand.",
            "Sentiment": "neutral",
            "PublishDate": 1754474764807,
            "Source": "stock"
        },
        {
            "Title": "Borosil Renewables Updates Key Managerial Personnel List Following Ashok Jain's Re-designation",
            "Summary": "Borosil Renewables Limited has updated its list of Key Managerial Personnel authorized to determine and disclose material events to stock exchanges. The update follows the re-designation of Mr. Ashok Jain as a Non-Executive Non-Independent Director after completing his tenure as Whole-time Director and Key Managerial Personnel. The updated KMP list includes Mr. P.K. Kheruka, Mr. Sunil Roongta, and Mr. Ravi Vaishnav, with Vaishnav authorized only to disclose material events. The changes comply with SEBI Listing Regulations requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1754046647072,
            "Source": "corporate_governance"
        },
        {
            "Title": "Borosil Renewables Allots 1.35 Lakh Equity Shares Upon Warrant Conversion",
            "Summary": "Borosil Renewables has allotted 1.35 lakh equity shares following the conversion of warrants. This corporate action increases the company's total share count through the exercise of previously issued warrants by holders.",
            "Sentiment": "neutral",
            "PublishDate": 1753884256792,
            "Source": "corporate_action"
        },
        {
            "Title": "Borosil Renewables Projects 28-30% EBITDA Margins, Targets 6-8% Volume Growth for FY26",
            "Summary": "Borosil Renewables projects sustainable EBITDA margins between 28-30% and anticipates improvement by a few percentage points moving forward. The company expects potential EBITDA margin increase from 28% and forecasts 6-8% volume growth for FY26 compared to the previous year. Management aims for a 10-15% export mix but chose not to share exact guidance numbers, instead providing directional indicators.",
            "Sentiment": "positive",
            "PublishDate": 1753414221625,
            "Source": "stock"
        },
        {
            "Title": "Borosil Renewables Makes Conference Call Recording Available for Q1 Results Discussion",
            "Summary": "Borosil Renewables Limited has made the audio recording of its conference call with institutional investors and analysts available on its website. The call discussed the company's performance for the quarter ended June 30, 2025, and was held on July 24, 2025. The recording can be accessed at the company's investor relations section on their website.",
            "Sentiment": "neutral",
            "PublishDate": 1753366848409,
            "Source": "stock"
        },
        {
            "Title": "Borosil Renewables Reports 37% Revenue Growth in Q1 FY26, Takes ₹326 Cr Hit on German Subsidiary Insolvency",
            "Summary": "Borosil Renewables achieved revenue of ₹332.26 crores in Q1 FY26, marking 37% year-over-year growth from ₹241.82 crores. EBITDA surged 211% to ₹92.53 crores (27.8% margin) compared to ₹29.71 crores (12.3% margin) in the same quarter last year. Average selling prices increased 31% to ₹138.1/mm from ₹105.52/mm, driven by anti-dumping duties imposed on Chinese and Vietnamese solar glass imports in December 2024. However, the company recorded an exceptional loss of ₹325.91 crores due to full provisioning of its exposure to German subsidiary GMB, which filed for insolvency on July 4, 2025. This resulted in a net loss of ₹272.35 crores for the quarter. The Board approved expansion of two new furnaces totaling 600 TPD capacity with ₹950 crore investment, targeting commissioning by December 2026. The company also approved a ₹379.52 crore preferential equity issue to fund the expansion, subject to shareholder approval at the EOGM on August 14, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753344577609,
            "Source": "earnings"
        },
        {
            "Title": "Borosil Renewables Reports Significant Net Loss Increase Despite Revenue Growth",
            "Summary": "Borosil Renewables reported a net loss of 2.72 billion rupees in its quarterly results, substantially higher than the previous year's loss of 36.4 million rupees. Despite the increased losses, the company's revenue grew to 3.32 billion rupees compared to 2.41 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1753286020581,
            "Source": "earnings"
        },
        {
            "Title": "Borosil Renewables Approves Rs 379.52 Crore Fundraise, Reports Rs 272.35 Crore Loss Due to German Subsidiary Insolvency",
            "Summary": "Borosil Renewables Limited's Board approved a preferential issue of up to 70,93,874 equity shares at Rs 535 per share to raise Rs 379.52 crore from non-promoter investors. The company reported quarterly results showing revenue from operations of Rs 332.26 crore but posted a net loss of Rs 272.35 crore due to exceptional items worth Rs 325.91 crore. The exceptional loss stems from full provision against exposure to German subsidiary GMB Glasmanufaktur Brandenburg GmbH, which filed for insolvency on July 4, 2025. The company scheduled an Extraordinary General Meeting for August 14, 2025 to seek shareholder approval for the preferential issue. The fundraise involves up to 82 investors including funds like Abakkus Diversified Alpha Fund and Nuvama Enhanced Dynamic Growth Equity Fund. Consolidated results remain pending due to unavailability of GMB's financial information.",
            "Sentiment": "negative",
            "PublishDate": 1753284899613,
            "Source": "corporate_action"
        },
        {
            "Title": "Borosil Renewables Schedules Q1 FY26 Results Conference Call for July 24, 2025",
            "Summary": "Borosil Renewables Limited will host a conference call with analysts and investors on July 24, 2025, at 4:00 PM IST to discuss financial performance for the quarter ended June 30, 2025. The call will begin with management discussion on earnings performance followed by a Q&A session. Key management representatives include Executive Chairman P.K. Kheruka, Vice Chairman Shreevar Kheruka, Whole-time Director Ashok Jain, Whole Time Director & CFO Sunil Roongta, and VP Investor Relations Balesh Talapady. The call will be led by Sumit Kishore from Axis Capital, with dial-in options available for multiple countries including India, Hong Kong, Singapore, UK, and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1753158342022,
            "Source": "corporate_action"
        },
        {
            "Title": "Borosil Chairman Says US Solar Tariff Petition Unlikely to Impact India Due to Lack of Government Subsidies",
            "Summary": "Pradeep Kumar Kheruka, Chairman of Borosil Renewables, stated that potential US tariffs on solar panel imports may not heavily impact India since there is no direct government subsidy for solar panel manufacturing in the country. His comments follow a petition by four US solar manufacturers led by First Solar, asking the US Commerce Department to impose anti-dumping duties on imports from India, Indonesia, and Laos, alleging these countries are dumping cheap solar panels. Kheruka noted that major Indian exporter Waaree Energies should not be significantly affected as it operates manufacturing facilities in the US. Additionally, the Trump administration announced new rules requiring Interior Secretary Doug Burgum to personally approve permits for green energy projects on government land, ending previous preferential treatment. Borosil Renewables shares traded 1.22% higher at Rs 587.9 on the NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1752894407139,
            "Source": "stock"
        },
        {
            "Title": "Borosil Renewables Focuses on Indian Solar Market as German Subsidiary Files for Insolvency",
            "Summary": "Borosil Renewables is aligning its business strategy towards India's solar energy potential. Meanwhile, its subsidiary, Glasmanufaktur Brandenburg GmbH, has filed for insolvency in Germany. The news indicates a shift in focus for the company, potentially prioritizing the Indian market while facing challenges in its European operations.",
            "Sentiment": "neutral",
            "PublishDate": 1751858415000,
            "Source": "default"
        },
        {
            "Title": "Borosil Renewables: German Subsidiary Files for Bankruptcy",
            "Summary": "Borosil Renewables' German subsidiary GMB has filed for bankruptcy due to poor demand and market conditions in the EU. The company's exposure to the German unit is about ₹350 crore. GMB contributed 22% of overall revenue in FY2025 but remained loss-making. This move will cease a monthly cash loss of ₹9 crore for Borosil Renewables.",
            "Sentiment": "negative",
            "PublishDate": 1751857251000,
            "Source": "corporate_action"
        },
        {
            "Title": "Borosil Renewables: German Subsidiary Files for Insolvency, Shifts Focus to Indian Solar Glass Market",
            "Summary": "Borosil Renewables' German subsidiary, GMB Glasmanufaktur Brandenburg GmbH, has filed for insolvency due to market challenges. The company will now concentrate on the Indian solar glass market, planning to increase production capacity by 600 tonnes per day with an investment of Rs 950 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1751805598000,
            "Source": "corporate_action"
        },
        {
            "Title": "Borosil Renewables Anticipates Potential Revenue Growth",
            "Summary": "Borosil Renewables expects a positive outlook if countervailing duty is maintained. The company foresees the possibility of 10-20% revenue growth within a year, contingent on capacity and market reaction.",
            "Sentiment": "positive",
            "PublishDate": 1750832174000,
            "Source": "default"
        },
        {
            "Title": "DGTR Initiates Review of Countervailing Duties on Malaysian Glass Imports",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has begun a review investigation of countervailing duties on glass imports from Malaysia. This action is prompted by ongoing subsidies and their harmful impact on local industries. The investigation specifically concerns Borosil Renewables, suggesting potential implications for the company's business.",
            "Sentiment": "neutral",
            "PublishDate": 1750832052000,
            "Source": "default"
        },
        {
            "Title": "Borosil Reports Q4 Results and Plans Fund Raising",
            "Summary": "Borosil announced its Q4 consolidated net profit of 111 million rupees, compared to 50 million rupees year-over-year and 355 million rupees quarter-over-quarter. Q4 revenue was reported at 2.7 billion rupees, up from 1.8 billion rupees year-over-year. The company also plans to raise funds up to 2.50 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1747700330000,
            "Source": "default"
        },
        {
            "Title": "Borosil Renewables: Rs 950 Crore Expansion Plan Approved",
            "Summary": "Borosil Renewables' board has approved a revised expansion plan to increase production capacity by 600 tonnes per day at an estimated cost of Rs 950 crore. The expansion involves setting up two furnaces of 300 TPD each, up from the original plan of 500 TPD at Rs 675 crore. The decision is based on anticipated favorable market conditions following government anti-dumping measures on solar glass imports from China and Vietnam.",
            "Sentiment": "positive",
            "PublishDate": 1747396142000,
            "Source": "corporate_action"
        },
        {
            "Title": "Borosil Renewables Approves Revised Expansion Plan",
            "Summary": "Borosil Renewables has approved a revised expansion plan of 600 TPD (tons per day). The estimated cost for this expansion is 9.5 billion rupees. No further details about the timeline or specific nature of the expansion were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747382570000,
            "Source": "default"
        },
        {
            "Title": "India Imposes Import Duty on Chinese and Vietnamese Solar Glass",
            "Summary": "India has implemented an import duty of up to Rs 58,000 per tonne on solar glass imported from China and Vietnam. This measure is likely aimed at protecting domestic manufacturers and reducing dependence on foreign imports in the renewable energy sector.",
            "Sentiment": "neutral",
            "PublishDate": 1747289152000,
            "Source": "default"
        },
        {
            "Title": "Borosil Renewables Forecasts Improved Profitability and Solar Growth",
            "Summary": "Borosil Renewables expects to see improved profitability in upcoming quarters due to better selling prices and yield improvement efforts. The company also anticipates annual solar installations to increase to 40-45 gigawatts in the future.",
            "Sentiment": "positive",
            "PublishDate": 1747107308000,
            "Source": "default"
        },
        {
            "Title": "Borosil Renewables: Q4 Loss Narrows, Board Approves Fundraising",
            "Summary": "Borosil Renewables' Q4 consolidated net loss narrowed to Rs 29.52 crore from Rs 53.32 crore year-on-year. Total income rose to Rs 385.44 crore. The board approved seeking shareholder approval to raise up to Rs 500 crore. Ashok Jain to be re-designated as non-executive director from August 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1746895428000,
            "Source": "result"
        },
        {
            "Title": "Borosil Renewables Reports Q4 EBITDA Turnaround",
            "Summary": "Borosil Renewables has reported a significant improvement in its Q4 EBITDA, turning a loss of 254 million rupees in the previous year into a gain of 155 million rupees. The company's Q4 EBITDA margin stands at 4.07%.",
            "Sentiment": "positive",
            "PublishDate": 1746881841000,
            "Source": "result"
        },
        {
            "Title": "Borosil Renewables Reports Q4 Financial Results",
            "Summary": "Borosil Renewables announced its Q4 financial results. The company reported a consolidated net loss of 201 million rupees, an improvement from the loss of 481 million rupees in the same quarter last year. However, the loss widened compared to the previous quarter's loss of 268 million rupees. Revenue for Q4 increased to 3.7 billion rupees from 2.8 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1746881622000,
            "Source": "result"
        },
        {
            "Title": "Borosil Renewables to Consider Q4 Results on May 10",
            "Summary": "Borosil Renewables has announced that it will consider its fourth quarter (Q4) financial results on May 10. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746627974000,
            "Source": "default"
        },
        {
            "Title": "Borosil Renewables Honors SBLC Obligation and Requests Prepayment",
            "Summary": "Borosil Renewables has announced that it has an outstanding Standby Letter of Credit (SBLC) of €10.8 million. The company has honored its obligations under this SBLC to HDFC, the lender bank. Additionally, a subsidiary of Borosil Renewables has requested HDFC to prepone the repayment schedule.",
            "Sentiment": "neutral",
            "PublishDate": 1743175701000,
            "Source": "corporate_action"
        }
    ]
}