{
    "Symbol": "BOSCHLTD",
    "ISIN": "INE323A01026",
    "News": [
        {
            "Title": "Bosch Q3 FY26 Revenue Rises 9.4% to ₹48,856 Million",
            "Summary": "Bosch Limited reports Q3 FY26 revenue of ₹48,856 million, up 9.4% YoY. Net profit stands at ₹5,321 million with 10.9% margin. Company appoints Sanmay Dasgupta as VP Power Tools.",
            "Sentiment": "positive",
            "PublishDate": 1770385727774,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bosch Limited Q3FY26 earnings call on Feb 9, 2026",
            "Summary": "Bosch Limited announces earnings conference call scheduled for February 09, 2026 at 12:30 PM IST to discuss Q3FY26 financial performance with management representatives including MD & CTO and CFO.",
            "Sentiment": "neutral",
            "PublishDate": 1769678589421,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bosch to Announce Q3 Results on February 6",
            "Summary": "Bosch Ltd has scheduled the review of its third quarter financial results for February 6, marking an important milestone for investors and stakeholders.",
            "Sentiment": "neutral",
            "PublishDate": 1765782586504,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bosch Limited Reports 8.1% Revenue Growth to INR 180,874 Million in FY2024-25",
            "Summary": "Bosch Limited achieved revenue growth of 8.1% reaching INR 180,874 million in FY2024-25, with Q2 2025-26 results showing revenue of INR 95,834 million and PAT of INR 5,542 million (11.6% margin). The company presented its business update covering mobility solutions, localization initiatives, and market outlook during its annual investor meet, highlighting India's automotive market growth trajectory and electrification trends.",
            "Sentiment": "positive",
            "PublishDate": 1763145141091,
            "Source": "earnings"
        },
        {
            "Title": "Bosch Plans ₹2,000 Crore Investment in EV Components and Hydrogen Technologies Over 3 Years",
            "Summary": "Bosch announced a strategic investment of ₹2,000 crore over three years focused on EV components and hydrogen technologies, while expanding R&D teams at Bengaluru and Coimbatore facilities. The company targets mid-teen EBIT margins through mobility solutions, electrification, and AI-driven manufacturing, with software-defined vehicle platform launches planned by FY27.",
            "Sentiment": "positive",
            "PublishDate": 1763135454918,
            "Source": "stock"
        },
        {
            "Title": "Bosch Limited Reports Strong Q2 FY26 Results with 10% Revenue Growth and 466.7% Jump in PAT",
            "Summary": "Bosch Limited announced its quarterly results for the period ending September 30, 2025, showing robust financial performance. Revenue from operations grew 10.0% in the first half of FY26, driven by 11.5% growth in Power Solutions, 4.5% growth in Mobility Aftermarket business, and 78.9% growth in 2-Wheeler powersports segment. EBITDA increased 10.1% quarter-on-quarter and 16.3% for the six-month period, attributed to favorable product mix and expense optimization. Profit After Tax surged 466.7% in the six-month comparison, primarily due to improved EBITDA and profit from the sale of Video solutions, Access and Intrusions, and Communications systems business. The Mobility Solutions segment recorded revenue of ₹80,991 million for April-September 2025, up 13.1% from the previous year, while Consumer Goods grew 5.4%. The company noted that the Indian automotive sector experienced synchronized growth in Q2 FY26, supported by festive momentum, policy support including GST 2.0, and improved consumer confidence. Bosch also highlighted key recognitions including awards from Escorts Kubota for delivery performance and Tata CV for Hydrogen ICE innovation, along with celebrating 25 years of its Technical Centre India.",
            "Sentiment": "positive",
            "PublishDate": 1762863796028,
            "Source": "earnings"
        },
        {
            "Title": "Bosch Reports Strong Q2 Performance with 81.8% Growth in Two-Wheeler Business",
            "Summary": "Bosch delivered robust quarterly results with revenue rising to 48 billion rupees from 43.9 billion rupees year-over-year. Net profit increased to 5.5 billion rupees compared to 5.4 billion rupees in the previous year. EBITDA grew to 6.2 billion rupees from 5.6 billion rupees, while EBITDA margin improved to 12.87% from 12.76%. The company's two-wheeler business segment experienced significant growth of 81.8%, driven by increased sales of exhaust gas sensors. Bosch anticipates strong demand for components due to shifting customer attitudes.",
            "Sentiment": "positive",
            "PublishDate": 1762851507690,
            "Source": "stock"
        },
        {
            "Title": "Volkswagen Confirms Nexperia Chip Supply Resumption with First Deliveries to Carmakers",
            "Summary": "Chip supply from Chinese-owned semiconductor manufacturer Nexperia has resumed, with carmakers receiving their first deliveries. Volkswagen confirmed the resumption of supply from Nexperia, which appears to involve Bosch in the supply chain.",
            "Sentiment": "positive",
            "PublishDate": 1762747869982,
            "Source": "global"
        },
        {
            "Title": "Bosch Limited Receives ESG Rating of 74.0 with Grade B+",
            "Summary": "Bosch Limited received an Environmental, Social, and Governance (ESG) score of 74.0 with Grade B+ based on FY2024-25 data. The rating was provided by CFC Finlease Private Limited, a SEBI-registered ESG Rating Provider under Category Autocomponents and Equipment. The company received this rating on November 5, 2025, as per the report dated November 3, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762449826670,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bosch Limited Warns of Potential Production Disruptions Due to Supplier Issues",
            "Summary": "Bosch Limited has informed stock exchanges about potential supply chain disruptions affecting its operations due to ongoing issues with Nexperia, one of its electronic component suppliers. The company stated that changes in foreign trade policy and geopolitical developments affecting Nexperia present significant challenges to its business. While Bosch is working to serve customers and minimize production restrictions, the company warned that temporary production adjustments at selected manufacturing plants cannot be ruled out if export control restrictions do not improve. The company is closely assessing and addressing the global supply situation for imported components on top priority.",
            "Sentiment": "negative",
            "PublishDate": 1761654361075,
            "Source": "stock"
        },
        {
            "Title": "Bosch Schedules Third Quarter Results Review for November 11",
            "Summary": "Bosch has announced it will review its third quarter results on November 11. The company has set this date for the quarterly results review.",
            "Sentiment": "neutral",
            "PublishDate": 1758780625467,
            "Source": "earnings"
        },
        {
            "Title": "Bosch Faces Rs 140 Crore Customs Duty Demand Over Oxygen Sensor Classification",
            "Summary": "Bosch Ltd received a demand of over Rs 140 crore from customs authorities for differential duty on oxygen sensors. The Principal Commissioner of Customs Air Cargo Complex, New Delhi issued an order regarding the interpretation of oxygen sensor classification, moving them from one category to another. The total demand includes differential duty of Rs 70.41 crore, interest and penalty of Rs 70.46 crore, totaling Rs 140.87 crore plus additional interest. Bosch plans to file an appeal before the tribunal in Delhi with a mandatory pre-deposit of 7.5% on the differential duty demanded. The company is also representing the matter before the Central Board of Indirect Taxes & Customs for clarification on oxygen sensor classification issues.",
            "Sentiment": "negative",
            "PublishDate": 1754566890743,
            "Source": "stock"
        },
        {
            "Title": "Bosch Limited Reports 10.9% Revenue Growth in Q1 FY26, Driven by Two-Wheeler and Power Solutions Business",
            "Summary": "Bosch Limited reported revenue from operations of ₹47,886 million for April-June 2025, marking a 10.9% growth over the same period last year. The mobility business grew 14.3% year-on-year, primarily driven by power solutions business growth of 13.7% due to higher demand for diesel components from off-highway and passenger car segments. Two-wheeler business showed significant growth following the implementation of OBD 2 norms from April 1, 2025, leading to increased sales of exhaust gas sensors. EBITDA increased 23% to ₹6,393 million, while profit after tax reached 23.3% of revenue compared to 10.8% in the previous year. The improvement was attributed to better EBITDA margins and profit recognition from the sale of Video Solutions, Access and Intrusions and Communication systems business. Consumer goods business grew 9.3% driven by higher demand for tools and accessories, while building technologies declined 65.3% due to business divestments. The company is focusing on electrification technologies including vehicle control units and electric coolant pumps, with localized production capabilities at their Bidadi plant.",
            "Sentiment": "positive",
            "PublishDate": 1754543018169,
            "Source": "earnings"
        },
        {
            "Title": "Bosch Reviews Import Request for Rare Earth Magnets from China",
            "Summary": "Bosch has an import request for rare earth magnets from China that is currently under review, according to a company executive.",
            "Sentiment": "neutral",
            "PublishDate": 1754391056175,
            "Source": "stock"
        },
        {
            "Title": "Bosch Reports Strong Q1 Results with 136% Jump in Net Profit, Approves Investment in JSW Renewable Energy",
            "Summary": "Bosch approved an investment of 40.50 million rupees in JSW Renew C&I One. The company reported strong quarterly performance with EBITDA rising to 6.4 billion rupees from 5.2 billion rupees year-over-year, while EBITDA margin improved to 13.35% from 12.04%. Net profit surged to 11 billion rupees compared to 4.65 billion rupees in the same period last year. Revenue grew to 47.9 billion rupees from 43.2 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754317221767,
            "Source": "order&deals"
        },
        {
            "Title": "Bosch Limited Reports Strong Q2 2025 Results with 37.2% Jump in Profit Before Tax",
            "Summary": "Bosch Limited reported total revenue from operations of Rs. 4,789 crores in Q2 2025, marking a 10.9% increase over the same quarter last year. Profit Before Tax (excluding exceptional items) rose 37.2% to Rs. 838 crores, representing 17.5% of total revenue. The company also recognized exceptional gains of Rs. 556 crores from the sale of its Video solutions, Access and Intrusions and Communication systems business to Keenfinity India Private Limited. Including exceptional items, Profit After Tax reached Rs. 1,115 crores, accounting for 23.3% of revenue from operations. The automotive segment drove growth with 14.3% increase in product sales, particularly in Power Solutions business which grew 13.7%. The Board also approved an investment of up to Rs. 40.50 million in JSW RENEW C&I ONE LIMITED for a 26% stake in a 12.66 MWdc solar power plant project in Maharashtra.",
            "Sentiment": "positive",
            "PublishDate": 1754317198808,
            "Source": "earnings"
        },
        {
            "Title": "Bosch Aims to Double Exports from India by 2030",
            "Summary": "Bosch, a global technology company, has set a goal to double its exports from India by the year 2030, according to Gurupasad Mudlapur. The company sees potential for significant growth in its Indian export operations over the next seven years.",
            "Sentiment": "positive",
            "PublishDate": 1752318028000,
            "Source": "default"
        },
        {
            "Title": "Bosch Evaluating Strategic Opportunities for Growth",
            "Summary": "Bosch has issued a clarification regarding news about potential consolidation. The company stated that it evaluates various strategic opportunities as part of its ordinary course of business for growth and expansion. However, Bosch emphasized that at this stage, there is no material event to report.",
            "Sentiment": "neutral",
            "PublishDate": 1751846934000,
            "Source": "default"
        },
        {
            "Title": "Bosch Plans to Merge Subsidiaries and Expand Product Offerings",
            "Summary": "Bosch intends to merge its subsidiaries Bosch Chassis and Bosch Auto Electronics. The company is also considering incorporating Anti-Locking Braking System into Bosch Electronics' product range.",
            "Sentiment": "positive",
            "PublishDate": 1751621143000,
            "Source": "default"
        },
        {
            "Title": "Bosch Ltd: Shares Rise Despite Rs 96 Crore Customs Penalty",
            "Summary": "Bosch Ltd shares gained 3.5% to Rs 35,600 despite a customs order demanding Rs 96 crore in differential duty and penalties. The order relates to wrongful duty benefits on imported automotive components and incorrect classification of parts. The company's market cap is approximately Rs 1,05,300 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1751611017000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bosch Ltd. Block Trade: 10,098 Shares at Rs. 31,565 Each",
            "Summary": "A block trade of approximately 10,098 shares of Bosch Ltd. was reported on the National Stock Exchange (NSE). The total value of the trade was Rs. 31.87 Crores, with each share priced at Rs. 31,565.00.",
            "Sentiment": "neutral",
            "PublishDate": 1750914127000,
            "Source": "block_details"
        },
        {
            "Title": "Bosch Ltd to Review Q1 Results on August 4",
            "Summary": "Bosch Ltd has announced that it will review its first quarter (Q1) results on August 4. The company has not provided any additional details about the upcoming review or the expected financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1750852242000,
            "Source": "default"
        },
        {
            "Title": "Bosch Reports Motorcycle Sales Mix and Potential ABS Requirement",
            "Summary": "Bosch reports that motorcycles under 125cc comprise nearly 76% of their sales mix. The Transport Ministry is considering requiring Anti-lock Braking Systems (ABS) on all two-wheelers starting January 1, 2026. Additionally, the ministry proposes that buyers must acquire two BIS certified helmets during the sale of a two-wheeler.",
            "Sentiment": "neutral",
            "PublishDate": 1750392768000,
            "Source": "default"
        },
        {
            "Title": "Bosch Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 18,161 shares of Bosch Ltd. occurred on the National Stock Exchange (NSE) for Rs. 57.18 crores. The shares were traded at a price of Rs. 31,485.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1749112041000,
            "Source": "block_details"
        },
        {
            "Title": "Bosch Ltd: Q4 Profit Dips 2% Amid Challenging Business Environment",
            "Summary": "Bosch Ltd reported a 2% decline in Q4 FY25 consolidated profit after tax to Rs 554 crore. Revenue from operations increased to Rs 4,911 crore. For FY25, PAT fell 19% to Rs 2,013 crore, while revenue rose to Rs 18,087 crore. The board recommended a final dividend of Rs 512 per share and approved the reappointment of Guruprasad Mudlapur as Managing Director for two years from July 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1748356895000,
            "Source": "earnings"
        },
        {
            "Title": "Bosch Disinvests Shares of Nivaata Systems",
            "Summary": "Bosch has announced the disinvestment of shares of Nivaata Systems at a price of 16,300 rupees per share. No further details about the number of shares or the total value of the transaction were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1748356636000,
            "Source": "default"
        },
        {
            "Title": "Bosch Q4 Results: Revenue Up, Profit Down, Dividend Announced",
            "Summary": "Bosch reported its Q4 financial results. Revenue increased to 49 billion rupees from 42.3 billion rupees year-over-year. EBITDA rose to 6.5 billion rupees from 5.57 billion rupees, with the EBITDA margin slightly improving to 13.17% from 13.16%. However, net profit decreased to 5.5 billion rupees from 5.65 billion rupees year-over-year. The company also recommended a dividend of 512 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1748355793000,
            "Source": "result"
        },
        {
            "Title": "Bosch Ltd: Rs 20 Crore Tax Demand Received for FY 2022-2023",
            "Summary": "Bosch Ltd. received a tax demand notice of over Rs 20 crore, including interest, from the Income Tax department for the assessment year 2022-2023. The company plans to appeal the order.",
            "Sentiment": "negative",
            "PublishDate": 1743412894000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bosch Ltd. Block Trade on NSE: 19,879 Shares at Rs. 26,800 Each",
            "Summary": "A significant block trade of Bosch Ltd. shares occurred on the National Stock Exchange (NSE). Approximately 19,879 shares were traded at a price of Rs. 26,800 per share, totaling Rs. 53.28 crores in value.",
            "Sentiment": "neutral",
            "PublishDate": 1741161264000,
            "Source": "block_deals"
        },
        {
            "Title": "Bosch Approves Sale of Building Technology's Product Businesses",
            "Summary": "Bosch has approved the sale of its Building Technology's product businesses to Keenfinity India for 5.95 billion rupees. This corporate action represents a significant divestment for Bosch, potentially impacting its strategic focus and financial position.",
            "Sentiment": "neutral",
            "PublishDate": 1738066531000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bosch Ltd: Q3 Profit Dips 12%, Approves ₹595 Crore Asset Sale",
            "Summary": "Bosch Ltd reported a 11.6% YoY decrease in Q3 net profit to ₹458 crore, while revenue increased 6.2% to ₹4,465.7 crore. The company approved the sale of its building technologies product businesses to Keenfinity India Private Ltd for ₹595 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1738065627000,
            "Source": "earnings"
        },
        {
            "Title": "Bosch Ltd: Q3 Profit Rises on Strong Auto Parts Sales",
            "Summary": "Bosch Ltd, the Indian unit of Robert Bosch, reported a 9% year-on-year increase in Q3 adjusted profit to 6.65 billion rupees, driven by steady automotive parts sales. Revenue grew 6% to 44.66 billion rupees. The company made a one-time provision of 471 million rupees for restructuring its mobility business operations.",
            "Sentiment": "positive",
            "PublishDate": 1738063570000,
            "Source": "earnings"
        },
        {
            "Title": "Bosch to Consider Q3 Results on January 28",
            "Summary": "Bosch Limited has announced that it will consider its third quarter (Q3) financial results on January 28. This indicates the company is preparing to release its earnings report for the latest fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1734412259000,
            "Source": "earnings"
        },
        {
            "Title": "Bosch: Q2 Results Show Operational Beat",
            "Summary": "Bosch's Q2 results exceeded operational expectations, primarily due to an improved product mix, according to a report by Motilal Oswal.",
            "Sentiment": "positive",
            "PublishDate": 1731502732000,
            "Source": "result"
        },
        {
            "Title": "Bosch Reports Mixed Q2 Results: Profit Down, Revenue Up",
            "Summary": "Bosch has released its Q2 financial results. The company's net profit decreased to 5.4 billion rupees from 9.9 billion rupees in the same quarter last year. However, revenue increased to 44 billion rupees from 41 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731456141000,
            "Source": "result"
        },
        {
            "Title": "Bosch: Over 7,000 Job Cuts Amid Lowered 2024 Forecast",
            "Summary": "Bosch plans to cut more than 7,000 jobs at German plants due to lowered 2024 growth forecast. CEO Stefan Hartung expects maximum 4% return on sales in 2024, down from 5% in 2023. The company faces challenges from industry-wide crisis, economic slowdown, and EV transition uncertainty. Job cuts planned through severance programs until 2027. Bosch also announced plans to acquire Johnson Controls for 7.4 billion euros.",
            "Sentiment": "negative",
            "PublishDate": 1730718912000,
            "Source": "corporate_action"
        },
        {
            "Title": "Bosch Ltd: Stock Surges 2.04% in Third Consecutive Session",
            "Summary": "<p><span class='positive'>Bosch Ltd's stock is up 2.04%</span> at Rs 38,741 on NSE. It has <span class='positive'>gained 15.53% in the last month and 96.48% in the past year</span>, <b>outperforming</b> both NIFTY and Nifty Auto index. The stock's trading volume is 26,194 shares, <span class='negative'>below the monthly average of 46,625</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728459300000,
            "Source": "normal_news"
        }
    ]
}