{
    "Symbol": "BOSCH-HCIL",
    "ISIN": "INE782A01015",
    "News": [
        {
            "Title": "Bosch Home Comfort India Reports Q3 FY26 Loss",
            "Summary": "Bosch Home Comfort India Limited reported a net loss of ₹190.3 million for Q3 FY26, compared to ₹33.4 million loss in Q3 FY25. Revenue increased 10.17% YoY to ₹4,755.7 million.",
            "Sentiment": "negative",
            "PublishDate": 1769598090633,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bosch Group Completes Open Offer for Bosch Comfort India, Acquires 7.97% Additional Stake",
            "Summary": "Bosch Global Software Technologies Private Limited acquired 21,66,628 equity shares representing 7.97% of Bosch Comfort India Limited through an open offer that concluded on November 26, 2025. The acquisition strengthens the Bosch group's position in the company, with Robert Bosch GmbH already holding indirect control of 74.25% and now the group collectively holding over 82% of the target company.",
            "Sentiment": "neutral",
            "PublishDate": 1765343837338,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Sun Life Mutual Fund Completely Exits Johnson Controls-Hitachi Air Conditioning India",
            "Summary": "Aditya Birla Sun Life Mutual Fund sold its entire 5.01% stake (13,61,504 shares) in Johnson Controls-Hitachi Air Conditioning India Ltd through open market transactions on December 8, 2025. The mutual fund's aggregate holding in the company has reduced to NIL from the previously disclosed 5.01% stake as of October 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1765341708194,
            "Source": "stock"
        },
        {
            "Title": "Johnson Controls Reports Wider Q2 Loss Despite Revenue Growth",
            "Summary": "Johnson Controls posted a Q2 net loss of 400 million rupees, widening from a loss of 300 million rupees in the same period last year. The company's quarterly revenue increased to 4 billion rupees from 3.96 billion rupees year-over-year, showing top-line growth amid bottom-line challenges.",
            "Sentiment": "negative",
            "PublishDate": 1763113852520,
            "Source": "earnings"
        },
        {
            "Title": "Bosch Home Comfort India's Independent Directors Recommend Open Offer at Rs 176.25 Per Share",
            "Summary": "The Committee of Independent Directors of Bosch Home Comfort India Limited has recommended shareholders accept the open offer made by Robert Bosch GmbH and Bosch Global Software Technologies Private Limited. The open offer seeks to acquire up to 70,00,355 equity shares representing 25.75% of the company's voting equity share capital at Rs 176.25 per share through cash payment. Independent advisors BDO Valuation Advisory LLP confirmed the offer price complies with SEBI takeover regulations. The committee noted that as of November 8, 2025, the company's closing market price was Rs 174.785 on BSE and Rs 174.750 on NSE, both below the offer price. The committee advised shareholders to independently evaluate the offer and make informed decisions. HSBC Securities and Capital Markets (India) Private Limited is managing the open offer.",
            "Sentiment": "neutral",
            "PublishDate": 1762810023217,
            "Source": "corporate_action"
        },
        {
            "Title": "Johnson Controls-Hitachi Air Conditioning India Limited Changes Name to Bosch Home Comfort India Limited",
            "Summary": "Johnson Controls-Hitachi Air Conditioning India Limited has officially changed its name to Bosch Home Comfort India Limited with effect from November 4, 2025. The Registrar of Companies, Ministry of Corporate Affairs has approved the name change, and the company's Memorandum of Association has been altered accordingly. The company trades on BSE under scrip code 523398 and on NSE under symbol JCHAC, with ISIN INE782A01015. The Certificate of Incorporation confirms the name change while noting that it does not affect the rights and liabilities of stakeholders. The company is required to display the old name alongside the new name for a period of two years at all places where it is required to display its name.",
            "Sentiment": "neutral",
            "PublishDate": 1762246874578,
            "Source": "corporate_action"
        },
        {
            "Title": "Robert Bosch GmbH Launches Open Offer to Acquire 25.75% Stake in Johnson Controls-Hitachi Air Conditioning India at Rs 1,762.54 Per Share",
            "Summary": "Robert Bosch GmbH and Bosch Global Software Technologies Private Limited have announced an open offer to acquire up to 70,00,355 equity shares (25.75%) of Johnson Controls-Hitachi Air Conditioning India Limited at Rs 1,762.54 per share, totaling Rs 12,33,84,05,702. The offer follows Bosch's acquisition of 100% shareholding in Johnson Controls-Hitachi Air Conditioning Holding (UK) Ltd for $3.375 billion, which indirectly gave them control of 74.25% of the Indian entity. The tendering period is scheduled from September 25 to October 9, 2025. The offer price includes an initial price of Rs 1,642.12 plus enhancement of Rs 171.42 minus dividend adjustment of Rs 51. All required regulatory approvals from 19 jurisdictions including India's Competition Commission have been obtained. The acquirers have deposited the full consideration amount in an escrow account and intend to continue the existing business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1755171268673,
            "Source": "order&deals"
        },
        {
            "Title": "Bosch to Acquire Johnson Controls Hitachi Through Open Offer",
            "Summary": "Bosch has announced plans to acquire Johnson Controls Hitachi through an open offer process. The acquisition will involve purchasing shares from existing shareholders through the open offer mechanism.",
            "Sentiment": "neutral",
            "PublishDate": 1754453827406,
            "Source": "order&deals"
        },
        {
            "Title": "Robert Bosch GmbH Completes Acquisition of Johnson Controls-Hitachi Air Conditioning India, Triggers Open Offer",
            "Summary": "Robert Bosch GmbH has acquired 100% of Johnson Controls-Hitachi Air Conditioning India Limited through the purchase of its parent company Johnson Controls-Hitachi Air Conditioning Holding (UK) Ltd. for $337.5 million. The transaction was completed through agreements with Hitachi Global Life Solutions, Inc. (40% stake) and Johnson Control International plc (60% stake). Through this acquisition, Bosch indirectly obtained 74.25% of the target company's share capital, representing 2,01,90,529 equity shares. The acquisition triggered mandatory open offer regulations, requiring Bosch to make a public offer to acquire an additional 25.75% stake (70,00,355 shares) from minority shareholders. Bosch Global Software Technologies Private Limited has been identified as a person acting in concert with the acquirer for this transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1754050052709,
            "Source": "order&deals"
        },
        {
            "Title": "Johnson Controls Reports Decline in Q1 Financial Performance",
            "Summary": "Johnson Controls reported a decline in its Q1 financial results. The company's revenue fell to 8.53 billion rupees from 9.96 billion rupees in the previous year. Net profit decreased to an unspecified amount from 361 million rupees year-over-year. EBITDA dropped to 364 million rupees from 566 million rupees, while EBITDA margin compressed to 4.27% from 5.68% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1753355480135,
            "Source": "earnings"
        },
        {
            "Title": "Johnson Controls-Hitachi Air Conditioning India Reports Q1 Results; Statutory Auditor Resigns Due to Potential Conflicts",
            "Summary": "Johnson Controls-Hitachi Air Conditioning India Limited reported quarterly results with revenue from operations of Rs. 27,564.6 million and profit before tax of Rs. 822.5 million. The Board declared an interim dividend of Rs. 36 per equity share. Price Waterhouse & Co Chartered Accountants LLP resigned as statutory auditors effective July 24, 2025, citing potential conflicts arising from non-audit services provided to Robert Bosch Group, the company's prospective acquirer. The auditor confirmed they had issued their audit report for the year ended March 31, 2025, and limited review report for the quarter ended June 30, 2025, prior to resignation. The company operates in two segments: cooling products for comfort and commercial use, and design and development services.",
            "Sentiment": "neutral",
            "PublishDate": 1753354049812,
            "Source": "earnings"
        },
        {
            "Title": "Johnson Controls-Hitachi Air Conditioning India: ₹36 Interim Dividend Announced",
            "Summary": "Johnson Controls-Hitachi Air Conditioning India Ltd. has declared an interim dividend of ₹36 per equity share for the current financial year. The record date is set for July 9, 2025, with payment to be made by July 24, 2025. This follows a ₹15 per share dividend approved in June 2025, marking the company's return to dividend payments after a six-year hiatus.",
            "Sentiment": "positive",
            "PublishDate": 1751526434000,
            "Source": "corporate_action"
        },
        {
            "Title": "Johnson Controls-Hitachi Air Conditioning India Approves ₹36 Dividend Per Share",
            "Summary": "The Board of Johnson Controls-Hitachi Air Conditioning India has approved a dividend of ₹36 per share. No additional details about the dividend, such as the fiscal year or payout date, were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1751524726000,
            "Source": "default"
        },
        {
            "Title": "Johnson Controls–Hitachi Air Conditioning: Last Day to Buy Shares for Dividend Eligibility",
            "Summary": "Monday is the final day to purchase Johnson Controls–Hitachi Air Conditioning shares to qualify for the Rs 15 per share dividend. The record date is set for June 10. The company's Q4 consolidated revenue grew 20.8% year-on-year to Rs 932 crore, with net profit up 14.7% to Rs 56 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1749441031000,
            "Source": "corporate_action"
        },
        {
            "Title": "Johnson Controls Reports Q4 Results and Announces Dividend",
            "Summary": "Johnson Controls has reported its Q4 financial results. The company's net profit increased to 560.7 million rupees, up from 488.1 million rupees in the same quarter last year. However, it reported a loss of 33.4 million rupees compared to the previous quarter. Q4 revenue rose to 9.33 billion rupees from 7.72 billion rupees year-over-year. The company has recommended a final dividend of 15 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747786965000,
            "Source": "default"
        },
        {
            "Title": "Johnson Controls Reports Q4 Results and Recommends Final Dividend",
            "Summary": "Johnson Controls has announced its Q4 financial results and dividend recommendation. The company's Q4 revenue increased to 9.33 billion rupees from 7.72 billion rupees year-over-year. EBITDA rose to 917 million rupees from 814 million rupees, although the EBITDA margin decreased to 9.83% from 10.55%. Net profit for Q4 increased to 560.7 million rupees from 488.1 million rupees year-over-year, but showed a loss of 33.4 million rupees quarter-over-quarter. The company has recommended a final dividend of 15 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747740919000,
            "Source": "result"
        },
        {
            "Title": "Johnson Controls Reports Q3 Net Loss of 33 Million Rupees",
            "Summary": "Johnson Controls has reported a net loss of 33 million rupees for the third quarter, which represents a significant improvement compared to the loss of 271 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739264837000,
            "Source": "earnings"
        },
        {
            "Title": "Johnson Controls-Hitachi Air Conditioning India Reports Q2 EBITDA Loss",
            "Summary": "Johnson Controls-Hitachi Air Conditioning India has reported an EBITDA loss of 265.7 million rupees for the second quarter, showing an improvement from the loss of 435.8 million rupees in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1729689253000,
            "Source": "result"
        },
        {
            "Title": "Johnson Controls-Hitachi Air Conditioning India Reports Q2 Revenue Growth",
            "Summary": "Johnson Controls-Hitachi Air Conditioning India has reported a revenue of 3.96 billion rupees for the second quarter, compared to 2.8 billion rupees in the same period last year, representing a significant year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729689240000,
            "Source": "result"
        },
        {
            "Title": "Johnson Controls-Hitachi Air Conditioning India Reports Q2 Financial Results",
            "Summary": "Johnson Controls-Hitachi Air Conditioning India has reported its financial results for the second quarter. The company recorded a net loss of 300 million rupees, which is an improvement compared to the loss of 564 million rupees in the same quarter last year. However, it represents a decline from the profit of 361 million rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1729689228000,
            "Source": "result"
        },
        {
            "Title": "Johnson Controls-Hitachi: Startup Incubator for Manufacturing in Gujarat",
            "Summary": "<p><span class='positive'>Johnson Controls-Hitachi Air Conditioning India Ltd</span> and <span class='neutral'>DPIIT</span> sign <b>MoU</b> to establish a <span class='positive'>startup incubator</span> in <span class='neutral'>Gujarat</span>, focusing on <span class='positive'>manufacturing sectors</span>. The incubator will provide <span class='positive'>mentorship</span>, <span class='positive'>guidance</span>, and <span class='positive'>support</span> for <b>concept-to-prototype development</b>, <span class='neutral'>project viability</span>, and <span class='positive'>commercialization</span> of <span class='positive'>innovative products</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727961703000,
            "Source": "normal_news"
        }
    ]
}