{
    "Symbol": "BPCL",
    "ISIN": "INE029A01011",
    "News": [
        {
            "Title": "BPCL promotes 5 new Executive Directors",
            "Summary": "Bharat Petroleum Corporation Limited announced the superannuation of Executive Director Anilkumar P. and promoted 5 employees to Executive Director positions across various business units effective February 1st, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769923397345,
            "Source": "stocks"
        },
        {
            "Title": "BPCL Signs UAE Crude Oil Deal with TotalEnergies",
            "Summary": "Bharat Petroleum Corporation Limited has entered into an agreement with TotalEnergies for the purchase of crude oil from the United Arab Emirates, marking a strategic partnership in oil procurement.",
            "Sentiment": "positive",
            "PublishDate": 1769767484185,
            "Source": "co_actions_results"
        },
        {
            "Title": "BPCL signs $780mn crude deal with Brazil's Petrobras",
            "Summary": "State-run BPCL to sign major crude sourcing contract with Brazil's Petrobras at India Energy Week 2026, as India diversifies oil imports from 27 to 41 countries amid volatile global markets.",
            "Sentiment": "positive",
            "PublishDate": 1769186268508,
            "Source": "stocks"
        },
        {
            "Title": "BPCL Reports Strong Q3FY26 Results with 62% Profit Jump",
            "Summary": "Bharat Petroleum Corporation Limited posted net profit of ₹7,545.27 crore for Q3FY26, up 62% YoY. Revenue rose to ₹136,623.06 crore. Board declared second interim dividend of ₹10 per share.",
            "Sentiment": "positive",
            "PublishDate": 1769174354361,
            "Source": "co_actions_results"
        },
        {
            "Title": "BPCL Subsidiary Makes Oil Discovery in Abu Dhabi Block",
            "Summary": "Bharat Petroleum's subsidiary BPRL announces significant oil discovery in Abu Dhabi Onshore Block 1 through joint venture, marking major milestone after USD 166 million exploration investment since 2019.",
            "Sentiment": "positive",
            "PublishDate": 1768363753793,
            "Source": "stocks"
        },
        {
            "Title": "BPCL Clarifies Technip Energies Contracts Standard",
            "Summary": "Bharat Petroleum Corporation clarifies that contracts awarded to Technip Energies are part of routine business operations and standard capital expenditure activities.",
            "Sentiment": "neutral",
            "PublishDate": 1767879021989,
            "Source": "stocks"
        },
        {
            "Title": "BPCL Awards ₹4,117 Cr Contracts to Technip Energies",
            "Summary": "Bharat Petroleum issues letters of intent worth ₹4,117 crore to Technip Energies for engineering and construction projects at Bina and Mumbai refineries, clarifying these are routine capital expenditure.",
            "Sentiment": "neutral",
            "PublishDate": 1767871941059,
            "Source": "co_actions_results"
        },
        {
            "Title": "BPCL Announces Senior Management Changes",
            "Summary": "Bharat Petroleum Corporation Limited announced superannuation of two Executive Directors on December 31, 2025, and appointed Vivek V Maheshwari as Head - Internal Audit effective January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767242901624,
            "Source": "stocks"
        },
        {
            "Title": "BPCL: Aramco And Oil India May Purchase Stake In Refinery",
            "Summary": "Bharat Petroleum Corporation is willing to dilute 30-40% stake in its new Andhra Pradesh refinery project, with Saudi Aramco and Oil India identified as potential strategic partners for the venture.",
            "Sentiment": "positive",
            "PublishDate": 1767064491868,
            "Source": "co_actions_results"
        },
        {
            "Title": "BPCL Forms JV with Coal India in 49:51 Partnership",
            "Summary": "Bharat Petroleum Corporation announces joint venture structure with Coal India Limited, where BPCL holds 49% stake while Coal India maintains majority control with 51% ownership.",
            "Sentiment": "neutral",
            "PublishDate": 1766064740392,
            "Source": "stocks"
        },
        {
            "Title": "BPCL Gets Approval for Coal Gasification JV",
            "Summary": "Bharat Petroleum Corporation Limited receives approval for joint venture with Coal India to develop coal gasification project in Maharashtra, marking strategic expansion into alternative energy sources.",
            "Sentiment": "positive",
            "PublishDate": 1766064513745,
            "Source": "co_actions_results"
        },
        {
            "Title": "BPCL Director Asheesh Joshi's Tenure Ends Following Completion of Central Deputation",
            "Summary": "Asheesh Joshi's directorship at Bharat Petroleum Corporation Limited concluded on December 1, 2025, following the completion of his central deputation tenure at the Ministry of Petroleum and Natural Gas. His directorship was on a co-terminus basis with his ministry position, which automatically ended his board position at the state-owned oil company.",
            "Sentiment": "neutral",
            "PublishDate": 1764664556457,
            "Source": "corporate_governance"
        },
        {
            "Title": "LIC Reduces Stake in Bharat Petroleum Corporation to 6.757%",
            "Summary": "Life Insurance Corporation of India sold 86,772,543 shares of Bharat Petroleum Corporation Ltd through market sale, reducing its shareholding from 8.758% to 6.757%. The transaction occurred between June 21, 2024 and November 18, 2025, with LIC filing the mandatory disclosure under SEBI regulations for substantial shareholding changes.",
            "Sentiment": "neutral",
            "PublishDate": 1763550382196,
            "Source": "corporate_action"
        },
        {
            "Title": "BPCL's Mozambique LNG Project Partners Resolve Force Majeure Declaration",
            "Summary": "Bharat Petroleum Corporation Limited announced that the Area 1 Mozambique LNG Project Consortium partners have decided to resolve the Force Majeure declaration that was issued in April 2021. The Force Majeure was declared due to deteriorating security conditions in northern Cabo Delgado province, which led to suspension of construction activities that had begun in 2019. The consortium has now decided to resolve the Force Majeure as the security situation has improved. BPRL Ventures Mozambique B.V., a subsidiary of BPCL's wholly owned subsidiary Bharat Petro Resources Ltd., holds a 10% participating interest in the Area 1 concession. The project is operated by Total EP Mozambique Area 1 Limitada with a 26.5% stake, alongside other partners including ENH Rovuma Area Um (15%), MIT Rovuma Offshore (20%), ONGC Videsh Rovuma Limited (10%), Beas Rovuma Energy Mozambique Limited (10%), and PTTEP Mozambique Area Limited (8.5%).",
            "Sentiment": "positive",
            "PublishDate": 1762778407127,
            "Source": "stock"
        },
        {
            "Title": "BPCL Extends Sanjay Khanna's Tenure as Chairman and Managing Director",
            "Summary": "Bharat Petroleum Corporation Limited (BPCL) has extended Sanjay Khanna's role as Chairman and Managing Director. The extension continues his leadership position at the state-owned oil marketing company.",
            "Sentiment": "neutral",
            "PublishDate": 1762521014386,
            "Source": "corporate_governance"
        },
        {
            "Title": "BPCL Purchases 2 Million Barrels from Abu Dhabi Following US Sanctions on Russian Oil Companies",
            "Summary": "Bharat Petroleum Corp purchased 2 million barrels of Upper Zakum crude oil from Abu Dhabi for December loading through a spot tender, replacing Russian oil supplies. ADNOC Trading will supply the cargo. The purchase follows US sanctions imposed on Rosneft and Lukoil, Russia's two largest oil companies, as part of efforts to pressure President Vladimir Putin regarding the Ukraine war. BPCL stated it will only buy Russian oil from non-sanctioned entities going forward. The company typically purchases 2 million metric tons (14.66 million barrels) monthly from the spot market, with most being Russian oil. BPCL plans to source half of its supply from non-sanctioned Russian entities and the remainder from non-Russian oil in the spot market.",
            "Sentiment": "neutral",
            "PublishDate": 1762149606578,
            "Source": "stock"
        },
        {
            "Title": "BPCL Reports 170% Jump in Net Profit, Declares Interim Dividend",
            "Summary": "Bharat Petroleum Corporation Ltd (BPCL) reported a consolidated net profit of Rs 6,191 crore for the quarter ended September 2025, representing a 170% increase from Rs 2,297 crore in the same quarter last year. Revenue from operations grew 3% to Rs 1,21,605 crore compared to the previous year. The company's board declared an interim dividend of Rs 7.5 per equity share with a record date of November 7, 2025. Total expenses decreased to Rs 1,14,635 crore from Rs 1,16,133 crore in the year-ago quarter. BPCL's average Gross Refining Margin for the half-year period was $7.77 per barrel. The company received government approval for Rs 7,594 crore compensation to offset under-recoveries on domestic LPG sales, to be disbursed in 12 monthly installments starting November 2025. On a standalone basis, the company reported a net profit of Rs 6,443 crore, up 169% year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1762141877856,
            "Source": "earnings"
        },
        {
            "Title": "BPCL Reports 29.4% Earnings Per Share Growth and Declares Rs 7.5 Interim Dividend",
            "Summary": "Bharat Petroleum Corporation Limited announced quarterly results with earnings per share of Rs 15.08 compared to Rs 5.61 in the previous year quarter. Net profit increased to Rs 6,442.53 crores from Rs 2,397.23 crores year-over-year. The company declared an interim dividend of Rs 7.5 per equity share (75% on face value of Rs 10) for financial year 2025-26, payable by November 29, 2025. Record date is set for November 7, 2025. Revenue from operations was Rs 1,21,570.90 crores. Refinery throughput decreased to 9.82 MMT from 10.28 MMT, while domestic market sales grew 2.26%. The company's Average Gross Refining Margin improved to $7.77 per barrel from $6.12 per barrel in the previous year period.",
            "Sentiment": "positive",
            "PublishDate": 1761932527454,
            "Source": "earnings"
        },
        {
            "Title": "BPCL Reports 29.41% Earnings Per Share for H1 FY26, Declares Rs 7.5 Interim Dividend",
            "Summary": "Bharat Petroleum Corporation Limited reported net profit of Rs 12,566.46 crores for the half year ended September 30, 2025, with earnings per share of Rs 29.41. The company declared an interim dividend of Rs 7.5 per equity share (75% on face value of Rs 10) for FY 2025-26, payable by November 29, 2025. Record date is set for November 7, 2025. Revenue from operations reached Rs 2,51,248.79 crores for the half year. Refinery throughput was 20.24 MMT while domestic market sales stood at 26.25 MMT. The company's Average Gross Refining Margin improved to $7.77 per barrel compared to $6.12 per barrel in the previous year. Total comprehensive income for the period was Rs 12,842.23 crores.",
            "Sentiment": "positive",
            "PublishDate": 1761905792177,
            "Source": "earnings"
        },
        {
            "Title": "BPCL Reports Higher Quarterly Net Profit and Announces Interim Dividend",
            "Summary": "BPCL announced an interim dividend of 7.5 rupees per share. The company reported quarterly net profit of 64.43 billion rupees, up from 61.2 billion rupees in the previous quarter. Revenue declined to 1.22 trillion rupees from 1.3 trillion rupees quarter-on-quarter. EBITDA increased to 97.7 billion rupees from 96.62 billion rupees, while EBITDA margin improved to 8.04% from 7.46% in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761905398386,
            "Source": "corporate_action"
        },
        {
            "Title": "BPCL to Announce Q2FY26 Results on October 31, Board to Consider Interim Dividend",
            "Summary": "Bharat Petroleum Corporation Ltd. (BPCL) will announce its second quarter FY26 results on October 31. The Board of Directors will also consider declaring an interim dividend for FY 2025-26. An earnings call is scheduled for November 3 at 11 a.m. with senior management. In Q1FY26, BPCL's consolidated net profit more than doubled to Rs 6,839.02 crore from Rs 2,841.55 crore in Q1FY25, while total income grew 1.3% to Rs 1,30,364.40 crore. BPCL shares have gained 5.71% in the past five trading sessions and are up 18.17% year-to-date. The stock hit a 52-week high of Rs 358.65 on July 8 and a 52-week low of Rs 234.01 on March 3, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761798158203,
            "Source": "earnings"
        },
        {
            "Title": "BPCL to Halt Fuel Oil Production After Launching 2 MTPA PRFCC Unit",
            "Summary": "BPCL plans to discontinue fuel oil production following the launch of its 2 MTPA (Million Tonnes Per Annum) Propylene Recovery Fluid Catalytic Cracking Complex (PRFCC) unit. This operational change represents a shift in the company's refining strategy and product mix.",
            "Sentiment": "neutral",
            "PublishDate": 1761716831393,
            "Source": "stock"
        },
        {
            "Title": "BPCL Signs Strategic Partnerships Worth ₹1.35 Lakh Crore for Refinery, Pipeline, and Green Energy Projects",
            "Summary": "Bharat Petroleum Corporation Limited (BPCL) signed three Memoranda of Understanding at the Energy Technology Meet 2025 in Hyderabad. BPCL and Oil India Limited (OIL) entered a non-binding MoU to explore collaboration on a greenfield refinery and petrochemical complex near Ramayapatnam Port in Andhra Pradesh, with an estimated investment of ₹1 lakh crore and refining capacity of 9-12 Million Metric Tons Per Annum. The facility will include a 1.5 MMTPA ethylene cracker unit and is expected to begin commercial operations by FY 2030. BPCL, OIL, and Numaligarh Refinery Limited (NRL) signed a tripartite agreement for a ₹3,500 crore cross-country product pipeline project spanning 700 km from Siliguri to Mughalsarai, with BPCL holding 50% ownership. Additionally, BPCL partnered with Fertilisers & Chemicals Travancore Limited (FACT) for trading organic fertilizers from a Municipal Solid Waste-based Compressed Biogas Plant at Kochi, which will process 150 MT of municipal waste daily.",
            "Sentiment": "positive",
            "PublishDate": 1761661538588,
            "Source": "order&deals"
        },
        {
            "Title": "BPCL Forms Strategic Partnerships with Three Major Energy and Chemical Companies",
            "Summary": "Bharat Petroleum Corporation Limited (BPCL) has established key partnerships with Oil India, Numaligarh Refinery, and Fertilisers & Chemicals Travancore. These partnerships involve three significant players in India's oil, refining, and chemical sectors.",
            "Sentiment": "positive",
            "PublishDate": 1761642662611,
            "Source": "order&deals"
        },
        {
            "Title": "BPCL Plans Crude Oil Tender for December Loading, to Source Russian Oil from Non-Sanctioned Suppliers",
            "Summary": "BPCL plans to release a tender for spot crude oil purchases within 7-10 days for December loading. The company will order Russian oil from non-sanctioned suppliers.",
            "Sentiment": "neutral",
            "PublishDate": 1761634671456,
            "Source": "stock"
        },
        {
            "Title": "BPCL Schedules Board Meeting on October 31, 2025 to Consider Q2 Results and Interim Dividend",
            "Summary": "Bharat Petroleum Corporation Limited will hold a Board of Directors meeting on October 31, 2025 to consider and approve unaudited financial results for the quarter and half year ended September 30, 2025. The board will also consider declaring an interim dividend for financial year 2025-26. The company's trading window will remain closed until November 2, 2025 under its insider trading prevention code.",
            "Sentiment": "neutral",
            "PublishDate": 1761125547626,
            "Source": "corporate_action"
        },
        {
            "Title": "BPCL Plans Refinery Development on 3,352 Acres Near Nellore",
            "Summary": "BPCL has announced plans to build a refinery and infrastructure on 3,352 acres of land close to Nellore. The company also plans to create a green belt covering 1,127 acres at the Nellore refinery location.",
            "Sentiment": "positive",
            "PublishDate": 1759986921639,
            "Source": "stock"
        },
        {
            "Title": "Andhra Pradesh Offers BPCL ₹726.5 Billion Support Package Over 20 Years",
            "Summary": "Andhra Pradesh has announced a comprehensive support package for BPCL worth ₹726.5 billion over 20 years. The package includes capital subsidies, incentives, and affordable power supply. The state government will cover 75% of BPCL's capital expenditure during this period.",
            "Sentiment": "positive",
            "PublishDate": 1759986517791,
            "Source": "stock"
        },
        {
            "Title": "Oil Ministry Opens Applications for BPCL Chairman Position After Previous Selection Process Failed",
            "Summary": "The Oil Ministry has invited applications for the chairman and managing director position at Bharat Petroleum Corporation Ltd (BPCL) with an October 21 deadline. This follows the Public Enterprises Selection Board's (PESB) failure to find suitable candidates after interviewing a dozen applicants, including BPCL's Director (Finance) Vetsa Ramakrishna Gupta and Director (Refineries) Sanjay Khanna. A three-member search-cum-selection committee was constituted in March, headed by PESB chairperson Mallika Srinivasan. The position became vacant when G Krishnakumar retired on April 30, with Sanjay Khanna taking additional charge. This marks the fourth oil sector company since 2021 where PESB could not identify suitable leadership candidates, following similar situations at Indian Oil Corporation, Hindustan Petroleum, and Oil and Natural Gas Corporation. Internal candidates must have two years of residual service while external candidates need three years before reaching the superannuation age of 60.",
            "Sentiment": "neutral",
            "PublishDate": 1759383387682,
            "Source": "corporate_governance"
        },
        {
            "Title": "BPCL Announces Senior Management Changes in PR & Brand Division",
            "Summary": "Bharat Petroleum Corporation Limited announced changes in its senior management. Syed Abbas Akhtar, Executive Director (PR & Brand), superannuated on September 30, 2025. Raman Malik, who was Chief General Manager (PR & Brand), took over as Head (PR & Brand) effective October 1, 2025. Malik holds a B.E in Chemical Engineering from Punjab and a Diploma in Management in Business Administration from SP Jain Institute of Management and Research, Mumbai. He has experience in various roles across HRS & Retail divisions.",
            "Sentiment": "neutral",
            "PublishDate": 1759299311885,
            "Source": "corporate_governance"
        },
        {
            "Title": "Anti-Dumping Investigation Initiated on Normal Butanol Imports from Taiwan and Saudi Arabia",
            "Summary": "An anti-dumping probe has been launched regarding normal butanol imports from Taiwan and Saudi Arabia. The investigation appears to be related to BPCL, though the specific details of the company's involvement or role in the probe are not detailed in the available information.",
            "Sentiment": "neutral",
            "PublishDate": 1759116093948,
            "Source": "stock"
        },
        {
            "Title": "BPCL Gets Environmental Clearance to Proceed with Rs 1.03 Lakh Crore Andhra Pradesh Refinery Project",
            "Summary": "Bharat Petroleum Corp. received permission from the Ministry of Environment and Forest and Climate Change committee to prepare terms of reference for its proposed 9 million metric tons per annum Greenfield Refinery and Petrochemical Complex in Andhra Pradesh. The project carries an estimated cost of Rs 1.03 lakh crore with a 42-month completion timeline. The facility will be located at Chevuru Village in Sri Potti Sriramulu Nellore District and will require 2,109.62 hectares of land, with no forest land acquisition needed. The project is expected to generate 3,400 jobs during construction and 3,750 jobs during operations. The Expert Appraisal Committee found the compliance status satisfactory and recommended the project for detailed Environmental Impact Assessment and Environmental Management Plan study, along with a mandatory public hearing. The complex will have a total power requirement of 600 MW, with 100 MW generated in-house and 500 MW sourced from the state grid.",
            "Sentiment": "positive",
            "PublishDate": 1757231203424,
            "Source": "stock"
        },
        {
            "Title": "BPCL Appoints Dibyendu Dwijesh Sarkar as Chief General Manager (Renewable Energy)",
            "Summary": "Bharat Petroleum Corporation Limited appointed Shri Dibyendu Dwijesh Sarkar as Chief General Manager (Renewable Energy) effective August 26, 2025. Sarkar was previously Project Head of Renewable Energy at the company. He holds a Diploma in Management Studies from Ramniranjan Anandilal Podar College of Commerce & Economics, Mumbai and a B.E in Electrical Engineering from Visvesvaraya Regional College of Engineering, Nagpur. He has experience in various roles within Renewable Energy and Mumbai Refinery operations including administration, projects, and maintenance.",
            "Sentiment": "positive",
            "PublishDate": 1756383782400,
            "Source": "corporate_governance"
        },
        {
            "Title": "BPCL and Oil India Sign Joint Venture for City Gas Distribution in Arunachal Pradesh",
            "Summary": "Bharat Petroleum Corporation Limited (BPCL) and Oil India Limited (OIL) signed a joint venture agreement to establish city gas distribution infrastructure in Arunachal Pradesh. The joint venture will develop compressed natural gas (CNG) stations and piped natural gas (PNG) supply networks for domestic, commercial, and industrial consumers across the state. This project follows the BPCL-OIL consortium's successful bid in the 12th City Gas Distribution Bid Round conducted by the Petroleum and Natural Gas Regulatory Board. BPCL Chairman Sanjay Khanna emphasized the company's commitment to expanding clean energy access in northeastern India, while OIL Chairman Ranjit Rath highlighted the company's existing hydrocarbon production legacy in Arunachal Pradesh. The partnership supports the Indian government's vision of developing a gas-based economy. BPCL shares closed at ₹312.90, down 0.92%, while OIL shares ended at ₹397.80, down 2.82%.",
            "Sentiment": "positive",
            "PublishDate": 1756210730624,
            "Source": "order&deals"
        },
        {
            "Title": "BPCL Explores New Refinery and Petrochemical Complex in Andhra Pradesh",
            "Summary": "Bharat Petroleum Corporation Ltd. is assessing the feasibility of establishing a greenfield oil refinery and petrochemical complex near Ramayapatnam Port in Andhra Pradesh. The project is part of BPCL's expansion strategy to meet India's growing energy demand. India is projected to add 1 million barrels per day of incremental oil demand by 2030, the highest globally, while current consumption stands at 5.5 million barrels daily. The proposed facility is expected to be a 9 million tonnes per year unit with an estimated cost of Rs 95,000 crore. BPCL operates three refineries with combined capacity of 40.5 million tonnes and reported turnover exceeding Rs 5 lakh crore with profit of Rs 13,275 crore. The company is also upgrading its Mumbai Refinery at Rs 14,200 crore and advancing two petrochemical projects at Bina and Kochi with combined investment of Rs 54,000 crore. BPCL has committed to achieving net zero emissions by 2040 and building 10 GW renewable energy portfolio by 2035.",
            "Sentiment": "positive",
            "PublishDate": 1756132835383,
            "Source": "stock"
        },
        {
            "Title": "BPCL Management Sees No Near-Term Auto Fuel Price Cuts Due to Geopolitical Issues",
            "Summary": "BPCL management stated that auto fuel prices are unlikely to decrease in the near term due to ongoing geopolitical instabilities. The company also expects to receive 25-26% of total LPG compensation from the government.",
            "Sentiment": "neutral",
            "PublishDate": 1755151260702,
            "Source": "stock"
        },
        {
            "Title": "BPCL Explores Alternative Oil Markets as Russian Oil Discounts Decline",
            "Summary": "BPCL executives announced during a conference call that the company is exploring alternative markets for Russian oil due to reduced discounts. The company is diversifying its oil procurement by purchasing from Brazil, the United States, and West Africa.",
            "Sentiment": "neutral",
            "PublishDate": 1755150328733,
            "Source": "stock"
        },
        {
            "Title": "BPCL Expands Petrochemical Capacity and Renewable Energy Projects During Energy Transition",
            "Summary": "BPCL is focusing on expanding its petrochemical capacity, fuel retail network, and renewable energy projects. The company aims to broaden its income sources and protect margins during the ongoing energy transition.",
            "Sentiment": "positive",
            "PublishDate": 1755103942071,
            "Source": "stock"
        },
        {
            "Title": "BPCL Reports Strong Q1 FY26 Results with Net Profit Rising 103% to ₹6,124 Crores",
            "Summary": "Bharat Petroleum Corporation Limited (BPCL) announced its quarterly results for the quarter ended June 30, 2025. The company reported a standalone net profit of ₹6,123.93 crores, representing a 103% increase from ₹3,014.77 crores in the same quarter last year. Revenue from operations stood at ₹1,26,864.93 crores compared to ₹1,29,577.89 crores in the previous quarter. On a consolidated basis, net profit reached ₹6,839.02 crores, up from ₹2,841.55 crores in the corresponding quarter of the previous year. The company's refinery throughput was 10.58 MMT, while market sales reached 13.58 MMT. Basic and diluted earnings per share increased to ₹14.33 from ₹7.06 in the same quarter last year. The Average Gross Refining Margin (GRM) for the quarter was $4.88 per barrel, down from $7.86 per barrel in the previous year quarter. BPCL maintained a cumulative net negative buffer of ₹12,522.58 crores related to LPG pricing as of June 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755082564913,
            "Source": "earnings"
        },
        {
            "Title": "BPCL Appoints Ajay Kumar Gupta as Head (CRPO)",
            "Summary": "Bharat Petroleum Corporation Limited appointed Shri Ajay Kumar Gupta as Head (CRPO) effective August 7, 2025. Gupta was previously serving as General Manager (CMRO-TAM). He holds a PG Diploma in Business Management from SP Jain Institute of Management and Research, Mumbai, and a BE in Mechanical Engineering from Visvesvaraya Regional College of Engineering, Nagpur. He has experience in various roles across CMRO, Bina Refinery, and Mumbai Refinery.",
            "Sentiment": "neutral",
            "PublishDate": 1754924876310,
            "Source": "corporate_governance"
        },
        {
            "Title": "BPCL to Announce Q1FY26 Results on August 13",
            "Summary": "Bharat Petroleum Corporation Ltd. (BPCL) will announce its first quarter results for financial year 2025-26 on August 13. The state-owned oil and gas company reported an 8.3% decline in consolidated profit after tax to Rs 4,391.83 crore in Q4FY25, while total income fell 3.67% to Rs 1,27,720.76 crore. BPCL shares have gained 1.26% in the past five trading sessions and 24.46% over six months, though they declined 7.92% in the last month. The stock hit a 52-week high of Rs 376 on September 30, 2024, and a low of Rs 234.01 on March 3, 2025. Trading window for designated persons remains closed from July 1 to August 15.",
            "Sentiment": "neutral",
            "PublishDate": 1754893811827,
            "Source": "earnings"
        },
        {
            "Title": "BPCL Stops Purchasing Russian Crude Oil From Spot Market",
            "Summary": "Bharat Petroleum Corporation Limited (BPCL) has ceased purchasing Russian crude oil from the spot market. This represents a shift in the company's crude oil procurement strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1754018297152,
            "Source": "stock"
        },
        {
            "Title": "BPCL Directed to Pay Rs 1 Crore Environmental Compensation for Timeline Non-Compliance",
            "Summary": "Bharat Petroleum Corporation Limited (BPCL) has been directed by the Central Pollution Control Board (CPCB) to deposit Rs 1 crore as environmental compensation for failing to comply with prescribed timelines. The direction was issued under Section 5 of the Environment (Protection) Act, 1986, relating to CPCB directions dated September 18, 2020 and November 11, 2024. BPCL stated it will seek legal advice on the next course of action. The company has indicated no material impact from this development.",
            "Sentiment": "negative",
            "PublishDate": 1753430741236,
            "Source": "stock"
        },
        {
            "Title": "BPCL Announces Rs. 5 Final Dividend for FY 2024-25 with July 31 Record Date",
            "Summary": "Bharat Petroleum Corporation Limited's Board of Directors recommended a final dividend of Rs. 5 per equity share (50% on face value of Rs. 10) for financial year 2024-25, subject to shareholder approval at the Annual General Meeting scheduled for August 2025. The record date for dividend eligibility is set as July 31, 2025. The company has issued detailed guidelines for tax deduction at source (TDS) compliance, requiring shareholders to submit relevant documents including Form 15G/15H by August 4, 2025. For resident shareholders, TDS will be deducted at 10% if dividend exceeds Rs. 10,000 annually, while non-resident shareholders face 20% TDS unless they provide valid tax treaty documentation. The dividend will be paid only through electronic mode after shareholders furnish required details including PAN, bank account information, and contact details.",
            "Sentiment": "positive",
            "PublishDate": 1753182486810,
            "Source": "corporate_action"
        },
        {
            "Title": "India's Oil Minister Suggests Potential Fuel Price Reduction",
            "Summary": "India's Oil Minister has expressed the belief that fuel prices could decrease if crude oil prices maintain stability over the next 2-3 months. This statement suggests a potential relief for consumers if global oil market conditions remain favorable.",
            "Sentiment": "positive",
            "PublishDate": 1752744656000,
            "Source": "default"
        },
        {
            "Title": "BPCL Chairperson Expresses Interest in U.S. LPG Purchases if Economically Viable",
            "Summary": "The Chairperson of BPCL (Bharat Petroleum Corporation Limited) has indicated interest in purchasing LPG (Liquefied Petroleum Gas) from the United States, provided it is financially viable for the company. This potential move suggests BPCL is exploring diversification of its LPG sources, with a focus on cost-effectiveness.",
            "Sentiment": "neutral",
            "PublishDate": 1752132259000,
            "Source": "default"
        },
        {
            "Title": "DGTR Initiates Anti-Dumping Investigation on LLDPE Imports from Six Countries",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has launched an anti-dumping investigation into Linear Low-Density Polyethylene (LLDPE) imports from Kuwait, Malaysia, Oman, Qatar, Saudi Arabia, and the United Arab Emirates. This action is in response to claims that these imports are causing harm to the local industry in India.",
            "Sentiment": "neutral",
            "PublishDate": 1751354863000,
            "Source": "default"
        },
        {
            "Title": "Bharat Petroleum Corporation Ltd: Water-Mixed Fuel Causes Vehicle Breakdown in MP CM's Convoy",
            "Summary": "BPCL attributes water-mixed fuel at its Ratlam petrol pump to heavy rainfall, causing vehicles in Madhya Pradesh CM's convoy to break down. The fuel station has been closed, samples collected for testing, and the company is cooperating with authorities.",
            "Sentiment": "negative",
            "PublishDate": 1751100863000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Oil Ministry Suggests Favorable Conditions for Fuel Price Cut",
            "Summary": "The Oil Ministry has indicated that conditions are favorable for a reduction in fuel prices, according to ETNOW. The news specifically mentions BPCL (Bharat Petroleum Corporation Limited) in this context.",
            "Sentiment": "positive",
            "PublishDate": 1747732100000,
            "Source": "default"
        },
        {
            "Title": "BPCL Awards Contracts for 100 MW Windfarm Projects",
            "Summary": "Bharat Petroleum Corporation Limited (BPCL) has issued Letters of Award (LOA) to Suzlon Energy and Integrum Energy Infrastructure for 100 MW windfarm projects. These projects are expected to be completed and commissioned within a two-year timeframe.",
            "Sentiment": "positive",
            "PublishDate": 1746703672000,
            "Source": "default"
        }
    ]
}