{
    "Symbol": "BPL",
    "ISIN": "INE110A01019",
    "News": [
        {
            "Title": "BPL Limited Q2FY26 Results: Mixed Performance",
            "Summary": "BPL Limited reports ₹254.48 crores profit for H1FY26 despite Q2 loss of ₹19.70 crores. Revenue from operations declined 5.15% YoY to ₹1,983.90 crores in Q2FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1765803576385,
            "Source": "co_actions_results"
        },
        {
            "Title": "BPL Limited Faces Supreme Court Order for Payment to Unsecured Creditor",
            "Summary": "The Supreme Court of India dismissed BPL Limited's Special Leave Petition and ordered payment to an unsecured creditor based on a Delhi High Court division bench order. The sudden fund outflow will impact the company's cash flows and future expansion projects, though management expects current operations to remain unaffected.",
            "Sentiment": "negative",
            "PublishDate": 1764930563911,
            "Source": "stock"
        },
        {
            "Title": "BPL Limited Reports Q2 Results with Rs 254.48 Lakhs Profit After Tax",
            "Summary": "BPL Limited announced its unaudited financial results for the second quarter ended September 30, 2025. The company reported a profit after tax of Rs 254.48 lakhs for the quarter. Total income reached Rs 3,985.10 lakhs, with revenue from operations at Rs 3,931.60 lakhs. The company's brand licensing fee contributed Rs 918.30 lakhs to revenue. BPL has deposited Rs 96 crores with the Supreme Court Treasury related to an ongoing legal matter with an unsecured claimant. The company operates through multiple segments including brand licensing and power generation. Contingent liabilities stand at Rs 68.79 crores. The results were approved by the Board of Directors at their meeting held on November 12, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762973170292,
            "Source": "earnings"
        },
        {
            "Title": "BPL Limited Seeks Shareholder Approval for Rs 116 Crore Related Party Transactions",
            "Summary": "BPL Limited has scheduled an Extra-Ordinary General Meeting on November 11, 2025, to seek post-facto approval for two material related party transactions. The first involves a Rs 100 crore borrowing from E R Computers Private Limited at 18% annual interest, undertaken on September 12, 2025, to deposit funds with the Supreme Court in compliance with lower court orders regarding alleged dues to an unsecured creditor. The second transaction involves Rs 16 crores advanced to Electronic Research Private Limited for purchasing premium flats in Bengaluru, which was later refunded due to unfavorable revised terms and anticipated delays. Both transactions involve companies where Ajit G Nambiar and Anju Chandrasekhar serve as common directors. The transactions represent 73.01% and 22.24% of the company's annual consolidated turnover respectively. Shareholders can participate through video conferencing, with electronic voting available from November 8-10, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760604844102,
            "Source": "corporate_action"
        },
        {
            "Title": "BPL Limited Promoter Group Entities Pledge Shares to Secure INR 96 Crore Loan",
            "Summary": "BPL Limited received intimations from promoter group entities ER Computers Private Limited and Electro Investment Private Limited regarding shareholding changes. The entities entered into a share pledge agreement dated September 15, 2025, effective from September 12, 2025, with Claypond Capital Partners Private Limited. Under this agreement, both promoter group entities pledged their shareholding in BPL Limited to secure obligations for an INR 96 crore loan availed by ER Computers Private Limited from Claypond Capital Partners. The agreement creates an encumbrance over BPL Limited shares but has no direct impact on the company's management or control, and no liabilities have been imposed on BPL Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1758022026199,
            "Source": "corporate_action"
        },
        {
            "Title": "BPL Deposits ₹96 Crore with Supreme Court Under Protest in Creditor Dispute",
            "Summary": "BPL has deposited ₹96 crore with the Supreme Court under protest as part of an ongoing creditor dispute. The company completed this compliance requirement within the September 19 deadline.",
            "Sentiment": "neutral",
            "PublishDate": 1758021187731,
            "Source": "stock"
        },
        {
            "Title": "BPL Limited Board Approves Plan to Raise Rs 100 Crores from Related Party",
            "Summary": "BPL Limited's Board of Directors approved a plan to raise funds up to Rs 100 crores from a related party during a meeting held on September 11, 2025. The funds are intended to address financial exigency or contingency requiring urgent funding to ensure uninterrupted operations, safeguard assets, and meet regulatory, legal and business obligations. The fundraising plan is subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1757672303262,
            "Source": "corporate_action"
        },
        {
            "Title": "BPL Limited Reports Q1 FY2026 Results with Revenue Growth and Profit Recovery",
            "Summary": "BPL Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs 1,947.70 lakhs, up from Rs 1,938.70 lakhs in the same quarter last year. Net profit reached Rs 274.18 lakhs compared to Rs 1,342.98 lakhs in the previous year quarter. The company operates in two main segments: PCB (Rs 1,432.75 lakhs revenue) and Brand Licensing Fee (Rs 514.95 lakhs revenue). BPL has a brand license agreement with Reliance Retail Limited for usage of the 'BPL' brand for consumer durable products. The company faces challenges with preference shares redemption due to insufficient accumulated profits and has contingent liabilities of Rs 68.63 crores. The Board also approved the 61st Annual General Meeting notice and recommended dividend on preference shares as per the CDR scheme.",
            "Sentiment": "neutral",
            "PublishDate": 1755082745759,
            "Source": "earnings"
        },
        {
            "Title": "BP: Quarterly Profit Plunges 49% Amid Green Energy Retreat",
            "Summary": "BP reported a Q1 2025 net profit of $1.38 billion, missing analyst expectations of $1.6 billion and marking a 49% decline from the previous year. The company recently abandoned its green energy goals and plans to increase fossil fuel production. BP's net debt rose to $26.968 billion, and it announced an 8-cent dividend per share and a $750 million share buyback.",
            "Sentiment": "negative",
            "PublishDate": 1745914990000,
            "Source": "earnings"
        },
        {
            "Title": "BP: Seeking Strategic Partner for 50% Stake in Solar Unit Lightsource bp",
            "Summary": "BP is looking to sell 50% of its solar unit Lightsource bp to a strategic partner. The deal involves cash and future investment commitments. Bids are due in June, with shortlisting in July. Lightsource bp has 5.7 GW of operational assets across 19 markets and aims to deliver 3-5 GW annually.",
            "Sentiment": "neutral",
            "PublishDate": 1741956092000,
            "Source": "corporate_action"
        },
        {
            "Title": "BP: Major Strategy Shift Slashes Renewable Spending, Boosts Fossil Fuel Investment",
            "Summary": "BP announced a significant strategy change, reducing annual spending on renewable energy by $5 billion and increasing oil and gas production investment by 20% to $10 billion. The company aims to grow oil and gas production to 2.3-2.5 million boepd by 2030. CEO Murray Auchincloss cited slower than expected energy transition and strong hydrocarbon demand as reasons for the shift. BP plans to raise dividends by at least 4% annually and expects Q1 share buybacks of $750 million to $1 billion.",
            "Sentiment": "negative",
            "PublishDate": 1740586094000,
            "Source": "corporate_action"
        },
        {
            "Title": "BP: CEO Pledges Strategy Reset as Profits Plunge 35%",
            "Summary": "BP's annual profits fell 35% to $8.9 billion, missing analyst expectations. CEO Murray Auchincloss announced plans to fundamentally reset the company's strategy, focusing on improving performance and growing cash flow. The company is considering increasing US shale gas output and restructuring its low-carbon business. BP extended its $1.75 billion buyback target to Q1 2024.",
            "Sentiment": "negative",
            "PublishDate": 1739289108000,
            "Source": "earnings"
        },
        {
            "Title": "BP: 4,700 Global Job Cuts Announced in Cost-Saving Drive",
            "Summary": "BP plans to eliminate 4,700 jobs from its global workforce and 3,000 contractor positions as part of a cost-saving initiative. The cuts represent over 5% of BP's 90,000 employees worldwide. CEO Murray Auchincloss informed staff via email, citing the need to focus on high-value opportunities. The company has paused or stopped 30 projects since June 2024 and aims to achieve $2 billion in savings by the end of 2026.",
            "Sentiment": "negative",
            "PublishDate": 1737035857000,
            "Source": "corporate_action"
        }
    ]
}