{
    "Symbol": "BRIGADE",
    "ISIN": "INE791I01019",
    "News": [
        {
            "Title": "Brigade Enterprises Independent Director Completes Tenure",
            "Summary": "Brigade Enterprises announces completion of Ms. Lakshmi Venkatachalam's second term as Independent Director on January 31, 2026, following regulatory requirements under Companies Act 2013.",
            "Sentiment": "neutral",
            "PublishDate": 1769838051783,
            "Source": "stocks"
        },
        {
            "Title": "Brigade Enterprises Q3FY26 Results & Leadership Changes",
            "Summary": "Brigade Enterprises reported Q3FY26 consolidated revenue of ₹1,57,511 lakhs with net profit of ₹20,583 lakhs. Company appointed Yogesh Patel as CFO replacing Pradyumna Krishna Kumar effective February 2, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769764083012,
            "Source": "co_actions_results"
        },
        {
            "Title": "Brigade Enterprises acquires 2.25 acres in Secunderabad",
            "Summary": "Brigade Enterprises signs agreement to acquire prime 2.25-acre land parcel in Secunderabad for residential development with estimated GDV of ₹650 crores, expanding footprint in Telangana.",
            "Sentiment": "positive",
            "PublishDate": 1769753902599,
            "Source": "stocks"
        },
        {
            "Title": "Axis AMC reduces Brigade Enterprises stake to 2.99%",
            "Summary": "Axis Asset Management Company disposed of 0.04% equity shares in Brigade Enterprises on January 27, 2026, reducing total holding from 3.03% to 2.99% across multiple mutual fund schemes.",
            "Sentiment": "neutral",
            "PublishDate": 1769751969656,
            "Source": "co_actions_results"
        },
        {
            "Title": "Brigade Enterprises Allots 95,191 ESOP Shares",
            "Summary": "Brigade Enterprises' Nomination and Remuneration Committee approved allotment of 95,191 equity shares under ESOP schemes and granted 98,564 new stock options to employees.",
            "Sentiment": "positive",
            "PublishDate": 1769688411317,
            "Source": "co_actions_results"
        },
        {
            "Title": "Brigade Enterprises Board Meet Set for Jan 30, 2026",
            "Summary": "Brigade Enterprises Limited has scheduled its board meeting for January 30, 2026, to consider Q3FY26 unaudited financial results. Trading window closed from January 1 to February 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768886483952,
            "Source": "co_actions_results"
        },
        {
            "Title": "BuzzWorks Partners with Born Good for Plant-Based Cleaning",
            "Summary": "Brigade Group's BuzzWorks announces strategic partnership with Born Good to integrate high-performance, plant-based cleaning solutions across managed workspaces, reinforcing ESG commitment and employee wellness focus.",
            "Sentiment": "positive",
            "PublishDate": 1767860185863,
            "Source": "co_actions_results"
        },
        {
            "Title": "Brigade Enterprises Issues ₹200 Cr Commercial Paper",
            "Summary": "Brigade Enterprises has issued commercial papers worth ₹200 crores with a 90-day tenure at a discounting rate of 6.83%. The unsecured instruments, rated A1+, were allotted on December 18, 2025, and will mature on March 18, 2026. Kotak Mahindra Bank Limited has subscribed to the entire issue, reflecting strong institutional confidence in the company's creditworthiness and financial stability.",
            "Sentiment": "neutral",
            "PublishDate": 1766146050236,
            "Source": "co_actions_results"
        },
        {
            "Title": "Brigade Enterprises Faces IT Survey at Offices",
            "Summary": "Brigade Enterprises reports Income Tax Department conducted survey under Section 133A at its registered office and other locations from December 9-13, 2025. Company operations remained unaffected.",
            "Sentiment": "neutral",
            "PublishDate": 1765644843499,
            "Source": "stocks"
        },
        {
            "Title": "Brigade Enterprises Acquires 4.04 Acres in Hyderabad's Neopolis Phase 3 for Rs. 118 Crores Per Acre",
            "Summary": "Brigade Enterprises Limited acquired a 4.04-acre land parcel (Plot No. 20) in Neopolis Phase 3, Hyderabad through an auction by Hyderabad Metropolitan Development Authority at Rs. 118 crores per acre. The acquisition strengthens the company's strategic growth plans in Hyderabad, following their earlier development of Brigade Gateway in the same micro-market featuring mixed-use developments including mall, hotel, and residential projects.",
            "Sentiment": "neutral",
            "PublishDate": 1764838203915,
            "Source": "stock"
        },
        {
            "Title": "Brigade Faces GST Demand of 695 Million Rupees",
            "Summary": "Brigade has received a GST demand notice for 695 million rupees from tax authorities. The demand affects the company's financial obligations and potential cash flow impact depending on the resolution of the tax matter.",
            "Sentiment": "negative",
            "PublishDate": 1764772748158,
            "Source": "stock"
        },
        {
            "Title": "Brigade Announces High-End Housing Partnership in Hyderabad Worth Over ₹800 Crores",
            "Summary": "Brigade has entered into a partnership for a high-end housing project in Hyderabad, spanning 0.5 million square feet of development area. The project carries a revenue potential exceeding ₹800 crores, representing a significant expansion opportunity for the real estate developer.",
            "Sentiment": "positive",
            "PublishDate": 1764559344764,
            "Source": "order&deals"
        },
        {
            "Title": "Brigade Enterprises Secures 90-Year Land Lease for 4.86 Acres in Kerala",
            "Summary": "Brigade Enterprises has signed a 90-year land lease agreement for 4.86 acres of land located in Kerala. This land acquisition expands the company's development footprint in the southern Indian state and provides a long-term asset for potential real estate projects.",
            "Sentiment": "positive",
            "PublishDate": 1764211408562,
            "Source": "stock"
        },
        {
            "Title": "Brigade Enterprises Receives Credit Rating Assignment and Reaffirmation from ICRA",
            "Summary": "ICRA Limited assigned [ICRA]A1+ rating for Brigade Enterprises' Rs. 200 crore Commercial Paper program and reaffirmed existing ratings including [ICRA]AA (Stable) for Rs. 2,423 crore term loans and [ICRA]A1+ for Rs. 350 crore short-term facilities. The rating actions cover total credit facilities of Rs. 3,200 crore, providing the real estate company with validated creditworthiness for its funding requirements.",
            "Sentiment": "positive",
            "PublishDate": 1763468567707,
            "Source": "stock"
        },
        {
            "Title": "Brigade Enterprises Appoints Girish Mahendra Agrawal as Sr. Vice President - Accounts & Finance",
            "Summary": "Brigade Enterprises Limited announced the appointment of Girish Mahendra Agrawal as Senior Vice President - Accounts & Finance, effective November 13, 2025. Agrawal is a qualified Chartered Accountant with over 19 years of experience in finance and accounts, covering areas including financial planning and management, cash flow planning, fundraising and treasury management, tax management, risk management and internal control, and budgetary control and variance analysis. He was previously associated with Mahindra Group.",
            "Sentiment": "positive",
            "PublishDate": 1763038059843,
            "Source": "corporate_governance"
        },
        {
            "Title": "Brigade Enterprises Seeks Shareholder Approval for Debashis Chatterjee's Appointment as Independent Director",
            "Summary": "Brigade Enterprises Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Debashis Chatterjee as an Independent Director. Chatterjee was appointed as an Additional Director on October 29, 2025, and the company is now seeking member approval for his appointment as Independent Director for a five-year term from October 29, 2025, to October 28, 2030. The 60-year-old brings over three decades of experience in multi-billion-dollar transformations and strategic growth initiatives. He previously served as CEO and Managing Director of LTIMindtree and has board experience with companies including Cognizant India, Mindtree, and LTIMindtree. The remote e-voting will commence on November 12, 2025, at 9:00 AM and end on December 11, 2025, at 5:00 PM. Results will be declared on or before December 15, 2025. The resolution requires special resolution approval from shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1762803607992,
            "Source": "corporate_action"
        },
        {
            "Title": "Brigade Enterprises Receives ESG Rating of 67 with Grade B from CFC Finlease",
            "Summary": "Brigade Enterprises Limited has been assigned an ESG rating of 67 with a rating grade of B (Good category) by CFC Finlease Private Limited, a SEBI-registered ESG rating provider. The company clarified that it did not engage CFC for this ESG rating, and the rating was prepared independently based on publicly available data. Brigade Enterprises received notification from BSE Limited about CFC Finlease's ESG disclosure submission. The rating information has been published on CFC's website and is also hosted on Brigade Enterprises' official website.",
            "Sentiment": "positive",
            "PublishDate": 1762413228942,
            "Source": "corporate_governance"
        },
        {
            "Title": "Brigade Enterprises Reports 12% Growth in Presales to INR 2,034 Crores in Q2 FY26",
            "Summary": "Brigade Enterprises Limited achieved presales of INR 2,034 crores in Q2 FY26, representing 12% growth over Q2 FY25. Presales volume reached 1.90 million square feet with 13% growth year-over-year. Average realization increased 13% to INR 12,236 per square feet. The company maintains zero residential debt across the group for two consecutive years. Consolidated revenue grew 26% to INR 1,430 crores with EBITDA of INR 375 crores at 26% margin. Real Estate segment revenue increased 31% to INR 951 crores, Leasing segment grew 17% to INR 341 crores, and Hospitality segment rose 16% to INR 138 crores. Consolidated PAT jumped 48% to INR 170 crores. The company has visibility for 7 million square feet launches worth INR 8,000-8,300 crores GDV in the second half. Brigade acquired 13 million square feet with INR 14,000 crores GDV in the first half, including strategic land lease in Chennai and joint development agreements in Bangalore. Office portfolio occupancy stands at 92% with 8.67 million square feet leased out of 9.38 million square feet. Hospitality portfolio ARR grew 14% to INR 7,106 with 76% occupancy.",
            "Sentiment": "positive",
            "PublishDate": 1762274628789,
            "Source": "earnings"
        },
        {
            "Title": "Brigade Group's BuzzWorks Partners With Frido To Launch Wellness Workspaces",
            "Summary": "Brigade Group's BuzzWorks has partnered with Frido to launch comfort-led wellness workspaces in Bengaluru and Hyderabad. The partnership will introduce Frido Comfort Rooms and Ergonomic Corners designed to enhance employee wellbeing and productivity in these locations.",
            "Sentiment": "positive",
            "PublishDate": 1762259526136,
            "Source": "stock"
        },
        {
            "Title": "Brigade Enterprises Reports Strong Q2 Results, Targets 15% Growth in FY26 Presales",
            "Summary": "Brigade Enterprises reported strong second quarter results with revenue rising 26% year-on-year to Rs 1,430 crore and profit after tax jumping 48% to Rs 170 crore. The Bengaluru-based real estate developer achieved pre-sales of over Rs 3,000 crore in the first half and is targeting a 15% year-on-year increase in presales bookings value for FY26. Managing Director Pavitra Shankar stated that achieving annual growth targets depends heavily on regulatory approvals and new residential project launches in the second half. The company has a pipeline of launches planned for Bangalore, Chennai, Hyderabad and Mysore. Shankar noted that underlying demand remains robust and whatever has been launched is selling well, with the challenge being supply rather than customer interest. She highlighted that while IT services firms are reducing headcounts in Bengaluru, Global Capability Centre firms are adding employees at higher salary levels, driving demand for premium residential products. Brigade Enterprises shares closed marginally higher at Rs 1,037.7, up 0.31%.",
            "Sentiment": "positive",
            "PublishDate": 1761894528381,
            "Source": "stock"
        },
        {
            "Title": "Brigade Enterprises Publishes Unaudited Financial Results for Second Quarter",
            "Summary": "Brigade Enterprises Limited published its unaudited financial results for the second quarter and half year ended September 30, 2025. The Board of Directors approved these results at their meeting held on October 29, 2025. The company published extracts of the financial results in The Business Standard (English) and Vijayavani (Kannada) newspapers on October 30, 2025. The full financial results along with Limited Review Report are available on stock exchange websites and the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1761832473697,
            "Source": "earnings"
        },
        {
            "Title": "Brigade Enterprises Schedules Board Meeting to Approve Q2 FY21 Financial Results",
            "Summary": "Brigade Enterprises Limited has announced a board meeting scheduled for November 11, 2020, to consider and approve unaudited standalone and consolidated financial results for the second quarter and half year ended September 30, 2020. The company has closed its trading window from October 1 to November 13, 2020, for designated persons and their immediate relatives. A conference call to discuss the company's financial and operational performance is scheduled for November 12, 2020, at 2:30 PM IST. The management team participating includes CMD M R Jaishankar, Executive Directors Pavitra Shankar, Nirupa Shankar, and Amar Mysore, along with CFO Atul Goyal.",
            "Sentiment": "neutral",
            "PublishDate": 1761795411762,
            "Source": "corporate_action"
        },
        {
            "Title": "Brigade Enterprises Targets ₹40 Billion Presales with 15 Million Sq Ft Pipeline Expansion",
            "Summary": "Brigade Enterprises has set a target of ₹40 billion in presales and is expanding its development pipeline by 15 million square feet across South India. The company is accelerating its leasing and hospitality verticals. Brigade Enterprises expects to sustain a 20% compound annual growth rate (CAGR) in lease income through FY27, supported by housing demand and new data-centre, office, and hotel projects.",
            "Sentiment": "positive",
            "PublishDate": 1761754367815,
            "Source": "stock"
        },
        {
            "Title": "Brigade Enterprises Reports 33% Jump in Q2 Net Profit Despite Margin Decline",
            "Summary": "Brigade Enterprises reported Q2 consolidated net profit of 1.6 billion rupees, up from 1.2 billion rupees year-over-year. Revenue increased to 13.8 billion rupees from 10.7 billion rupees in the same period last year. EBITDA rose to 3.3 billion rupees from 2.9 billion rupees year-over-year. However, EBITDA margin declined to 23.71% from 27.23% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761743398062,
            "Source": "earnings"
        },
        {
            "Title": "Brigade Enterprises Allots 15,233 Equity Shares Under ESOP Schemes",
            "Summary": "Brigade Enterprises' Nomination and Remuneration Committee approved the allotment of 15,233 equity shares under two Employee Stock Option Plans. The allotment includes 3,786 shares under the 2017 ESOP scheme and 11,447 shares under the 2022 ESOP scheme. The company's paid-up share capital increased from Rs. 2,44,48,30,400 to Rs. 2,44,49,82,730 following this allotment. The committee meeting was held on October 28, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761657570357,
            "Source": "corporate_action"
        },
        {
            "Title": "Brigade Foundation Launches Tree Planting Drive of Over 100,000 Trees in Bengaluru's KIADB Area",
            "Summary": "Brigade Foundation has launched a tree planting initiative titled 'From Saplings to a Sanctuary: Planting 100,000 Trees for a Greener Tomorrow' in Bengaluru's KIADB area. The initiative was inaugurated by M B Patil, Minister for Large and Medium Industries & Infrastructure Development, Government of Karnataka, in the presence of M R Jaishankar, Lifetime Trustee of Brigade Foundation and Executive Chairman of Brigade Enterprises Limited. The saplings will be planted around Brigade Group's project in the KIADB area to create ecological reserves. Brigade Foundation has partnered with Bengaluru-based Vanantara to nurture the saplings until they mature into trees. Jaishankar mentioned that Brigade has already planted one lakh trees across properties in Bengaluru and Mysuru. The initiative is part of Brigade Group's Urban Forest philosophy and represents the foundation's expansion beyond its traditional focus areas of education, health and community development.",
            "Sentiment": "positive",
            "PublishDate": 1760721144889,
            "Source": "stock"
        },
        {
            "Title": "Brigade Group Signs Joint Development Agreement for ₹1,000 Crore Residential Project in West Chennai",
            "Summary": "Brigade Group has entered into a Joint Development Agreement (JDA) for a premium residential project spanning 6.6 acres in West Chennai. The project has a Gross Development Value (GDV) of ₹1,000 crore. This development represents Brigade Group's expansion into the Chennai residential real estate market with a significant investment commitment.",
            "Sentiment": "positive",
            "PublishDate": 1759750438803,
            "Source": "stock"
        },
        {
            "Title": "Brigade Enterprises Sells Telangana Land for ₹110 Cr, Acquires AMG Info Park for ₹13 Cr",
            "Summary": "Brigade Enterprises executed a sale deed for 6,534 square yards of land in Kokapet village, Telangana to its subsidiary Brigade Hotel Ventures Limited for ₹110.14 crore. The transaction is part of Brigade Hotel Ventures' IPO objectives. Separately, Brigade acquired 100% equity stake in AMG Info Park Private Limited for ₹13.44 crore, making it a wholly-owned subsidiary. AMG Info Park, incorporated in June 2010, is engaged in real estate development but has not reported turnover as it is becoming operational. Brigade also signed a joint development agreement for a residential project in Banashankari, south Bengaluru, spanning 7.5 acres with a gross development value of approximately ₹1,200 crore. Brigade Enterprises shares closed at ₹910.20, down 1.07%.",
            "Sentiment": "neutral",
            "PublishDate": 1758900847509,
            "Source": "stock"
        },
        {
            "Title": "Brigade Enterprises Sells 1.35 Acres Kokapet Land to Subsidiary for ₹110.14 Crore",
            "Summary": "Brigade Enterprises has sold 1.35 acres of land located in Kokapet to its subsidiary Brigade Hotel Ventures for ₹110.14 crore. This represents an internal transaction between the parent company and its hotel venture subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1758895891955,
            "Source": "stock"
        },
        {
            "Title": "Brigade Enterprises Acquires Full Ownership of AMG Info Park for ₹134.4 Million",
            "Summary": "Brigade Enterprises has acquired complete ownership of AMG Info Park for ₹134.4 million. The acquisition gives the company full control of the information technology park property.",
            "Sentiment": "positive",
            "PublishDate": 1758895304685,
            "Source": "order&deals"
        },
        {
            "Title": "Brigade Group Signs ₹1,200 Crore Residential Project in South Bengaluru",
            "Summary": "Brigade Group has signed a residential project worth ₹1,200 crore in South Bengaluru. The project will be developed on 7.5 acres of land.",
            "Sentiment": "positive",
            "PublishDate": 1758545916212,
            "Source": "stock"
        },
        {
            "Title": "Brigade Group's Twin Towers Project Secures ₹126 Crores Investment From Manipal Group's Shruti Pai",
            "Summary": "Brigade Enterprises has received an investment of ₹126 crores from Shruti Pai of the Manipal Group for Brigade Group's Twin Towers project. The investment represents significant funding for the real estate development initiative.",
            "Sentiment": "positive",
            "PublishDate": 1758500528790,
            "Source": "order&deals"
        },
        {
            "Title": "Brigade Group Receives ₹126 Crores Investment from Manipal Group's Shruti Pai for Twin Towers Project",
            "Summary": "Shruti Pai, Creative Director at Manipal Education and Medical Group International India Pvt. Ltd., has invested ₹126 crores in Brigade Twin Towers located in North-West Bengaluru. The project is positioned near Kempegowda International Airport, Green Line Metro and Peripheral Ring Road. According to a Meraqi-Brigade study, North Bengaluru is projected to capture nearly 30% of overall office absorption by H2 2025. Bengaluru accounted for 28% of India's total office leasing activity in H1 2025. Brigade Group, established in 1986, operates across residential, office, retail, hospitality and education sectors in multiple Indian cities including Bengaluru, Chennai, Hyderabad, Mysuru, Kochi, Thiruvananthapuram, and GIFT City.",
            "Sentiment": "positive",
            "PublishDate": 1758285698503,
            "Source": "order&deals"
        },
        {
            "Title": "Brigade Enterprises Launches First-Ever Brigade Showcase Event in Chennai",
            "Summary": "Brigade Enterprises Limited announced its first Brigade Showcase event in Chennai, scheduled for September 20 and 21, 2025, at Hotel Leela Palace. The event will showcase the company's residential and commercial real estate portfolio across Chennai, Bengaluru, Hyderabad, and Mysuru. Brigade Group has previously conducted 18 successful editions of this flagship property exhibition in Bengaluru since 2009. The Chennai event will feature new launches, completed projects, rental and resale offerings, along with limited-time booking benefits. Managing Director Pavitra Shankar highlighted the company's planned investment of ₹8,000 crores in Chennai over the next six to seven years. The company is conducting a comprehensive marketing campaign across print media, digital platforms, radio, and local activations to promote the event.",
            "Sentiment": "positive",
            "PublishDate": 1758283756063,
            "Source": "stock"
        },
        {
            "Title": "Brigade Enterprises targets Rs 2,500 crore revenue from 10.75-acre luxury housing project in Bengaluru",
            "Summary": "Brigade Enterprises Ltd is targeting Rs 2,500 crore revenue from a new luxury housing project in East Bengaluru. The company has partnered with a landowner for this joint development project spanning 10.75 acres with a total saleable area potential of 2.5 million square feet. Managing Director Pavitra Shankar stated that Bengaluru is their primary market and this development reflects their strategic commitment to high-quality developments in premium micro markets. Brigade Group, established in 1986, has developed projects across Bengaluru, Chennai, Hyderabad, Mysuru, Kochi, Thiruvananthapuram, and GIFT City, focusing on residential, office, retail and hospitality developments.",
            "Sentiment": "positive",
            "PublishDate": 1757471171640,
            "Source": "stock"
        },
        {
            "Title": "Brigade Enterprises Signs Agreement for ₹25 Billion Housing Project in Bengaluru",
            "Summary": "Brigade Enterprises has entered into an agreement for a housing project in Bengaluru spanning 10.75 acres. The project is valued at ₹25 billion.",
            "Sentiment": "positive",
            "PublishDate": 1757330871847,
            "Source": "stock"
        },
        {
            "Title": "Brigade Enterprises Signs Joint Development Agreement for ₹2,500 Crore Residential Project in East Bengaluru",
            "Summary": "Brigade Enterprises Limited has executed and registered a Joint Development Agreement with a land owner for developing a residential project on 10.75 acres in East Bengaluru. The project has a potential saleable area of 2.5 million square feet with an estimated gross development value of ₹2,500 crores. The agreement represents a significant expansion of the company's residential development portfolio in the East Bengaluru market.",
            "Sentiment": "positive",
            "PublishDate": 1757177377440,
            "Source": "stock"
        },
        {
            "Title": "Brigade Enterprises Appoints Two Senior Management Personnel",
            "Summary": "Brigade Enterprises Limited appointed Mr. Rajendra Singh as Chief Operating Officer for Chennai Projects and Mr. Soumen Roy as Assistant Vice President for Residential New Product Development, both effective September 4, 2025. Singh brings over 28 years of experience in project management and development with expertise in mixed-use developments including commercial, residential, and recreational projects. He holds a Bachelor's degree in Civil Engineering and a Postgraduate Program in Business Management. Roy has 16 years of professional experience with expertise in Architecture, Civil Engineering, and Project Management. He holds a Bachelor of Architecture from IIT Kharagpur and an MBA from ISB Hyderabad.",
            "Sentiment": "positive",
            "PublishDate": 1756990743172,
            "Source": "corporate_governance"
        },
        {
            "Title": "Uniqlo Opens First Bengaluru Store at Brigade Enterprises' Orion Mall",
            "Summary": "Japanese clothing retailer Uniqlo launched its first store in Bengaluru at Orion Mall, owned by Brigade Enterprises. The grand opening event was attended by cricket personality Rahul Dravid. This marks Uniqlo's entry into the Bengaluru market through Brigade Enterprises' retail property.",
            "Sentiment": "positive",
            "PublishDate": 1756466948124,
            "Source": "stock"
        },
        {
            "Title": "Brigade Enterprises Signs Chennai Mixed-Use Development Lease and Launches Bengaluru Residential Project",
            "Summary": "Brigade Enterprises signed a long-term lease for a 7-acre mixed-use development on Chennai's OMR. The project will feature 1 million square feet of Grade A offices and a 5-star hotel. The company also launched a residential project called 'Brigade Lakecrest' located beside Bhattarahalli Lake on Old Madras Road in Bengaluru. The projected revenue potential of the project exceeds Rs 950 crores.",
            "Sentiment": "positive",
            "PublishDate": 1756080672797,
            "Source": "stock"
        },
        {
            "Title": "Brigade Enterprises Launches Brigade Lakecrest Residential Project in Bengaluru",
            "Summary": "Brigade Enterprises Limited launched Brigade Lakecrest, a residential project located beside Bhattarahalli Lake on Old Madras Road, Bengaluru. The project will be developed under a Joint Development model with a total development area of approximately 9.33 lakh square feet and projected revenue potential exceeding ₹950 crore. The development received RERA approval on June 24, 2025, with scheduled completion in March 2030. The project features 604 premium 1, 2, and 3 BHK residences with lake views, a double-height clubhouse, and green spaces. Managing Director Pavitra Shankar stated the development enhances Brigade's presence in Bengaluru and strengthens their growth pipeline across South India.",
            "Sentiment": "positive",
            "PublishDate": 1755941039995,
            "Source": "stock"
        },
        {
            "Title": "Brigade Enterprises CFO Jayant B Manmadkar Resigns, Pradyumna Krishna Kumar Named Interim CFO",
            "Summary": "Jayant B Manmadkar has resigned as Chief Financial Officer and Key Managerial Personnel of Brigade Enterprises Limited due to personal reasons related to a family member's health condition, requiring his relocation from Bengaluru to Mumbai. His resignation becomes effective October 9, 2025. The Board of Directors appointed Pradyumna Krishna Kumar, Executive Director, as Interim CFO and Key Managerial Personnel starting October 10, 2025, until a permanent CFO is appointed. Kumar, aged 42, brings over 16 years of experience in investor relations and private equity work, and has been with Brigade Group since 2009. He holds a Bachelor of Commerce from University of Madras and an MBA from Asian Institute of Management in Manila, Philippines.",
            "Sentiment": "neutral",
            "PublishDate": 1755873549326,
            "Source": "corporate_governance"
        },
        {
            "Title": "Brigade Enterprises Signs Long-Term Lease for 7-Acre Mixed-Use Development in Chennai",
            "Summary": "Brigade Enterprises has signed a long-term lease agreement for a 7-acre mixed-use development project located on Chennai's Outer Ring Road (OMR). The development will include 1 million square feet of Grade A office space and a 5-star hotel facility.",
            "Sentiment": "positive",
            "PublishDate": 1755861848886,
            "Source": "stock"
        },
        {
            "Title": "Brigade Enterprises Fully Utilizes Rs 1,500 Crore QIP Proceeds",
            "Summary": "Brigade Enterprises Limited has completely utilized the proceeds from its Qualified Institutions Placement (QIP) during the quarter ended June 30, 2025. The QIP raised Rs 1,500 crore through the issue of 1,30,43,478 equity shares at Rs 1,150 per share, with net proceeds of Rs 1,467.82 crore after expenses. The funds were allocated across four main purposes: Rs 448 crore for repayment of outstanding borrowings, Rs 677 crore for land acquisition costs and joint development agreements, Rs 342.82 crore for general corporate purposes, and Rs 32.18 crore for issue expenses. CARE Ratings Limited, serving as the monitoring agency, reported no deviations from the stated objects and confirmed all proceeds were utilized as disclosed in the offer document. The company completed land acquisition from Raptakos Brett and Company Private Limited for Rs 441.70 crore plus Rs 35.34 crore in stamp duty and registration fees, with Rs 431.03 crore funded from QIP proceeds.",
            "Sentiment": "positive",
            "PublishDate": 1755096187576,
            "Source": "corporate_action"
        },
        {
            "Title": "Brigade Enterprises Reports 20% Revenue Growth and 95% PAT Growth in Q1 FY26",
            "Summary": "Brigade Enterprises Limited held a board meeting on August 13, 2025, approving unaudited consolidated and standalone financial results for the quarter ended June 30, 2025. The company reported total revenue of ₹1,333 crores in Q1 FY26, representing 20% growth over Q1 FY25. Profit After Tax (PAT) grew by 95% to ₹158 crores compared to the previous year quarter. The real estate segment achieved pre-sales of ₹1,118 crores with sales area of 0.95 million square feet, while average realization increased 24% to ₹11,782 per square feet. Collections for the quarter stood at ₹1,728 crores. The company launched Brigade Morgan Heights Phase 1 with 1.09 million square feet area during the quarter. Brigade Hotel Ventures Limited, a subsidiary, completed its Initial Public Offering and got listed on stock exchanges in July 2025. The company maintains a land bank of 60 million square feet and has a pipeline of new launches around 16 million square feet across residential and commercial segments.",
            "Sentiment": "positive",
            "PublishDate": 1755092254604,
            "Source": "earnings"
        },
        {
            "Title": "Brigade Hotel Ventures Reports Strong Q1 Performance with Revenue Growth and Return to Profitability",
            "Summary": "Brigade Hotel Ventures delivered strong quarterly results with revenue increasing to 1.24 billion rupees from 1.02 billion rupees year-over-year. The company returned to profitability with a consolidated net profit of 61 million rupees, compared to a loss of 49 million rupees in the same period last year. EBITDA grew to 410 million rupees from 332 million rupees, while EBITDA margin improved slightly to 32.98% from 32.62%.",
            "Sentiment": "positive",
            "PublishDate": 1754916044865,
            "Source": "earnings"
        },
        {
            "Title": "Brigade Group Launches Brigade Cherry Blossom Plotted Development in East Bengaluru with ₹225 Crore Revenue Potential",
            "Summary": "Brigade Group launched Brigade Cherry Blossom, a premium plotted development in Malur, East Bengaluru. The strategic joint venture project spans 20 acres and 11 guntas, offering 4.51 lakh sqft of development area with projected revenue potential exceeding ₹225 crores. The development features 338 plots in two typologies - 30 feet x 40 feet and 30 feet x 50 feet - targeting homebuyers and investors. The project is located 1.5 km from the Satellite Town Ring Road and Bengaluru-Chennai Expressway, providing connectivity to Whitefield, Sarjapur, and Hoskote. Managing Director Pavitra Shankar stated the development reflects the company's commitment to delivering high-quality projects in emerging growth corridors and aligns with their strategy to build future-ready communities. Brigade Group, established in 1986, operates across residential, office, retail, hospitality and education sectors in multiple Indian cities.",
            "Sentiment": "positive",
            "PublishDate": 1754662382667,
            "Source": "stock"
        },
        {
            "Title": "Brigade Enterprise Launches High-End Land Development Project in East Bengaluru",
            "Summary": "Brigade Enterprise has introduced a high-end land development project in East Bengaluru. The company expects this development to generate ₹2.25 billion in revenue.",
            "Sentiment": "positive",
            "PublishDate": 1754660622400,
            "Source": "stock"
        },
        {
            "Title": "NCLT Approves Amalgamation of Brigade Enterprises' Subsidiaries Tandem Allied Services and WTC Trades & Projects",
            "Summary": "The National Company Law Tribunal has sanctioned the amalgamation of Tandem Allied Services Private Limited, a step-down subsidiary, with WTC Trades & Projects Private Limited, a wholly owned subsidiary of Brigade Enterprises Limited. The amalgamation became effective on July 21, 2025. Both companies operate in facility management. As of March 31, 2025, Tandem had a net worth of Rs 2,250 lakhs and turnover of Rs 2,776 lakhs, while WTC had a net worth of Rs 9,955 lakhs and turnover of Rs 17,007 lakhs. The share exchange ratio is set at 2.92:1, meaning one equity share of WTC for every 2.92 equity shares of Tandem. The amalgamation aims to achieve business synergies, streamline corporate structure, improve administrative efficiencies, and reduce inter-company transactions. The transaction is conducted on an arm's length basis between related parties.",
            "Sentiment": "neutral",
            "PublishDate": 1754577621249,
            "Source": "corporate_action"
        },
        {
            "Title": "Brigade Enterprises Appoints Othayoth Palliyil Nandakumar as Chief Operating Officer - Commercial Office Space",
            "Summary": "Brigade Enterprises Limited has appointed Mr. Othayoth Palliyil Nandakumar as Chief Operating Officer - Commercial Office Space, effective August 4, 2025. Nandakumar holds a bachelor's degree in industrial engineering & management and brings over 25 years of experience in the real estate industry. He has extensive expertise in Sales, Leasing, Marketing and Development of premier real estate projects across India. The appointment is classified as a Senior Management Personnel position.",
            "Sentiment": "positive",
            "PublishDate": 1754319119655,
            "Source": "corporate_governance"
        }
    ]
}