{
    "Symbol": "BRIGHOTEL",
    "ISIN": "INE03NU01014",
    "News": [
        {
            "Title": "Brigade Hotel Ventures Signs ₹1100 Cr Chennai Deal",
            "Summary": "Brigade Hotel Ventures enters agreement with Tamil Nadu government for ₹1100 crore investment in Chennai, planning three new hotels with over 500 rooms combined.",
            "Sentiment": "positive",
            "PublishDate": 1770045594330,
            "Source": "stocks"
        },
        {
            "Title": "Brigade Hotel Ventures Files Q3FY26 Fund Utilisation Report",
            "Summary": "Brigade Hotel Ventures Limited filed its quarterly statement showing no deviation in fund utilisation from Pre-IPO placement of Rs. 126 crores and IPO of Rs. 759.60 crores for Q3FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1769609491615,
            "Source": "stocks"
        },
        {
            "Title": "Brigade Hotel Ventures Reports Strong Q3FY26 Results",
            "Summary": "Brigade Hotel Ventures Limited posted consolidated revenue of ₹13,876 lakhs for Q3FY26, up 11.6% YoY, with profit rising to ₹2,172 lakhs. Board approved auditor appointments.",
            "Sentiment": "positive",
            "PublishDate": 1769606838248,
            "Source": "co_actions_results"
        },
        {
            "Title": "Brigade Hotel Ventures Q3FY26 Results Call on Jan 29",
            "Summary": "Brigade Hotel Ventures Limited announces board meeting on January 28, 2026 to approve Q3FY26 financial results, followed by earnings call on January 29, 2026 at 2:30 PM IST.",
            "Sentiment": "neutral",
            "PublishDate": 1768832146116,
            "Source": "co_actions_results"
        },
        {
            "Title": "Brigade Hotel Ventures Appoints New Chairman & Auditors",
            "Summary": "Brigade Hotel Ventures Limited's board appointed Mr. Mysore Ramachandrasetty Jaishankar as Additional Director and Non-Executive Chairman, along with ASR Co. as Secretarial Auditors for FY2025-26.",
            "Sentiment": "positive",
            "PublishDate": 1765892704229,
            "Source": "stocks"
        },
        {
            "Title": "Brigade Hotel Ventures Reports 20% Revenue Growth in Q2 FY26, Plans INR 3,600 Crore Expansion",
            "Summary": "Brigade Hotel Ventures Limited reported strong quarterly results with total income growing 20% year-on-year to INR 130 crores. EBITDA increased 9% to INR 41 crores, though it was impacted by INR 6 crores in additional property tax expenses. Excluding this impact, operational EBITDA would have grown 25%. Profit after tax surged 58% to INR 11 crores. The company's Bangalore hotels delivered strong performance with 19% ARR growth and 75.6% occupancy, resulting in 14% RevPAR growth. The company operates nine hotels with 1,600 keys and announced plans to double its portfolio by adding approximately 1,700 keys over the next five years with a total capex investment of INR 3,600 crores. Key upcoming projects include hotels under Marriott, Hyatt, InterContinental, and Ritz-Carlton brands across Chennai, Bangalore, Hyderabad, and Kerala. The company deployed INR 468 crores from IPO proceeds for debt repayment and has net cash of INR 111 crores. Management expects growth momentum to continue in the second half, supported by corporate demand, festival travel, and wedding season.",
            "Sentiment": "positive",
            "PublishDate": 1761854990653,
            "Source": "earnings"
        },
        {
            "Title": "Brigade Hotel Ventures Plans ₹3,600 Crore Investment to Double Hotel Portfolio by FY30",
            "Summary": "Brigade Hotel Ventures plans to invest approximately ₹3,600 crores to open 9 new hotels. This expansion will double their portfolio to 18 hotels with about 3,300 rooms by FY30.",
            "Sentiment": "positive",
            "PublishDate": 1761324639676,
            "Source": "stock"
        },
        {
            "Title": "Brigade Hotel Ventures Reports Q2 FY26 Results, Revenue Rises to Rs 12,572 Lakhs",
            "Summary": "Brigade Hotel Ventures Limited announced its quarterly results for the second quarter and half year ended September 30, 2025. The company reported consolidated revenue from operations of Rs 12,572 lakhs for the quarter, compared to Rs 10,799 lakhs in the corresponding quarter. Profit after tax stood at Rs 1,060 lakhs for the quarter versus Rs 716 lakhs in the previous year quarter. For the six-month period, revenue reached Rs 24,988 lakhs with profit after tax of Rs 1,776 lakhs. The company completed its IPO during the period, raising Rs 75,960 lakhs through fresh issue of equity shares, with shares listed on NSE and BSE on July 31, 2025. Additionally, the company raised Rs 12,600 lakhs through Pre-IPO placement. The company faces ongoing litigation regarding property tax assessment with a revised demand of Rs 2,874 lakhs under a settlement scheme. Brigade Hotel Ventures operates in the hospitality business and has one subsidiary, SRP Prosperita Hotel Ventures Limited.",
            "Sentiment": "positive",
            "PublishDate": 1761320316304,
            "Source": "earnings"
        },
        {
            "Title": "Brigade Hotel Ventures Reports 22% Revenue Growth in Q1 FY26 Earnings Call",
            "Summary": "Brigade Hotel Ventures Limited reported strong quarterly results with revenue growing 22% to INR 125 crores and EBITDA increasing 24% to INR 41.8 crores. The company achieved consolidated PAT of INR 7.2 crores compared to a loss of INR 5.8 crores in the same quarter last year. EBITDA margin improved to 33.4% from 32.9%. Bangalore and Chennai hotels showed 12% and 13% RevPAR growth respectively, while the GIFT City hotel delivered 44% RevPAR growth. F&B revenue recorded 32% year-on-year growth. The company repaid entire institutional debt of INR 468 crores using IPO proceeds and maintains net debt of INR 617 crores. Management outlined plans to add nine new hotels and double total key count over the next four to five years, focusing on premium 5-star luxury properties. Construction costs are estimated at Rs 65 lakhs per key for Fairfield brands and Rs 1.75-2 crores per key for luxury hotels like Grand Hyatt and Ritz-Carlton. The entire portfolio achieved EDGE certification for sustainable development.",
            "Sentiment": "positive",
            "PublishDate": 1755169854308,
            "Source": "earnings"
        },
        {
            "Title": "Brigade Hotel Ventures Partners with Marriott International for 6 New Hotels in India",
            "Summary": "Brigade Hotel Ventures has announced a partnership with Marriott International to launch 6 new hotels in India. The expansion will feature properties under five popular Marriott brands as part of the company's growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1755073177354,
            "Source": "stock"
        },
        {
            "Title": "Brigade Hotel Ventures Plans to Double Portfolio to 3,300 Rooms Through Luxury Market Expansion",
            "Summary": "Brigade Hotel Ventures announced plans to double its hotel portfolio to 3,300 rooms by expanding into luxury and upper-midscale market segments. The company intends to leverage strong brands and sustainability initiatives as part of its strategy to increase revenue and profits.",
            "Sentiment": "positive",
            "PublishDate": 1754923143893,
            "Source": "stock"
        },
        {
            "Title": "Brigade Hotel Ventures Reports 22% Revenue Growth in Q1 FY26 Debut Results",
            "Summary": "Brigade Hotel Ventures Limited reported its first quarterly results since listing on July 31, 2025. The hospitality company posted consolidated revenue of ₹124.16 crore for Q1 FY26, marking 22% year-on-year growth from ₹101.80 crore in Q1 FY25. The company turned profitable with PAT of ₹7.16 crore compared to a loss of ₹5.78 crore in the same quarter last year. EBITDA margin stood at 33.4% versus 32.9% in Q1 FY25. The company operates 9 hotels with 1,604 keys and has 9 upcoming hotels with approximately 1,700 keys under planning. Brigade Hotel Ventures raised ₹885.6 crore through IPO and preferential allotment, with proceeds earmarked for debt repayment, land acquisition, and general corporate purposes. The company faces ongoing property tax litigation with a revised demand of ₹28.74 crore under a one-time settlement scheme.",
            "Sentiment": "positive",
            "PublishDate": 1754918651939,
            "Source": "earnings"
        }
    ]
}