{
    "Symbol": "BRITANNIA",
    "ISIN": "INE216A01030",
    "News": [
        {
            "Title": "Britannia Appoints New CMO, Elevates VP Marketing",
            "Summary": "Britannia Industries announces appointment of Puneet Das as Chief Marketing Officer from February 16, 2026, and elevation of Siddharth Gupta to Vice President Marketing from February 1, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770733389550,
            "Source": "stocks"
        },
        {
            "Title": "Britannia Q3FY26: Sales Up 9%, Profit Jumps 17%",
            "Summary": "Britannia Industries reports strong Q3FY26 performance with consolidated sales of Rs 4,885 crores (9.5% growth) and net profit of Rs 682 crores (17.1% growth), driven by momentum in biscuits and adjacent categories.",
            "Sentiment": "positive",
            "PublishDate": 1770731675001,
            "Source": "co_actions_results"
        },
        {
            "Title": "Britannia Industries Company Secretary Resigns",
            "Summary": "Britannia Industries announces resignation of Company Secretary T.V. Thulsidass effective February 5, 2026, citing personal reasons after serving since October 2018.",
            "Sentiment": "neutral",
            "PublishDate": 1770308258870,
            "Source": "stocks"
        },
        {
            "Title": "Britannia Industries Block Trade Worth Rs. 17.53 Crores",
            "Summary": "Britannia Industries witnessed a significant NSE block trade worth Rs. 17.53 crores involving approximately 30,480 shares at Rs. 5751.00 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769745347893,
            "Source": "co_actions_results"
        },
        {
            "Title": "Britannia Industries Block Trade Worth ₹63.51 Cr",
            "Summary": "Britannia Industries witnessed a significant NSE block trade worth ₹63.51 crores involving 105,544 shares at ₹6,017 per share, indicating institutional activity in the FMCG major.",
            "Sentiment": "neutral",
            "PublishDate": 1767598461920,
            "Source": "co_actions_results"
        },
        {
            "Title": "Britannia Faces ₹108.50 Cr GST Demand from Chennai",
            "Summary": "Britannia Industries receives GST order demanding ₹108.50 crores in tax with equivalent penalty for alleged incorrect Input Tax Credit availment across six financial years from FY 2018-19 to FY 2023-24.",
            "Sentiment": "negative",
            "PublishDate": 1767281828133,
            "Source": "stocks"
        },
        {
            "Title": "Delhi HC restrains infringement of Britannia's trademark",
            "Summary": "Delhi High Court issues interim injunction against Shri Swastik Organics for infringing Britannia's 'Little Hearts' trademark and 3D shape, citing triple identity case.",
            "Sentiment": "positive",
            "PublishDate": 1767188133855,
            "Source": "stocks"
        },
        {
            "Title": "Britannia Gets New GST Order with ₹48.60 Lakh Demand",
            "Summary": "Britannia Industries receives fresh GST order under Section 74 from Bhubaneshwar authority alleging incorrect input tax credit for FY 2019-20, with total demand of ₹48,59,912.",
            "Sentiment": "negative",
            "PublishDate": 1767176202663,
            "Source": "stocks"
        },
        {
            "Title": "Britannia Appoints Two Senior Management Officers",
            "Summary": "Britannia Industries announces key leadership appointments with Abhishek Sinha as Chief Sales Transformation Officer and Subhashis Basu as Chief Business Officer-Dairy, both effective December 15, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765808256690,
            "Source": "stocks"
        },
        {
            "Title": "Britannia Industries Block Trade Worth Rs. 31.49 Crores Executed on NSE",
            "Summary": "A block trade involving 53,756 shares of Britannia Industries Ltd. was executed on NSE at Rs. 5,858 per share, totaling Rs. 31.49 crores. The transaction represents a significant institutional or bulk trading activity in the FMCG company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1764820552437,
            "Source": "order&deals"
        },
        {
            "Title": "Britannia Industries Sees Rs. 118.48 Crore Block Trade on NSE",
            "Summary": "Britannia Industries executed a block trade worth Rs. 118.48 crores involving approximately 201,199 shares at Rs. 5,888.50 per share on NSE. The transaction represents a significant institutional or bulk investor activity in the FMCG company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1763611889475,
            "Source": "order&deals"
        },
        {
            "Title": "Britannia Industries Reports 4.1% Revenue Growth and 23.1% Profit Growth in Q2",
            "Summary": "Britannia Industries reported quarterly revenue growth of 4.1% and profit growth of 23.1%. The company faced temporary disruption due to GST rate changes implemented on September 22, 2025, affecting 85% of its business, which caused some de-stocking but has since normalized. Executive Vice Chairman Varun Berry indicated the company lost approximately 2-2.5% in topline growth due to GST implementation disruptions in the final month of the quarter. Operating profit margins improved to 18.3%, with profit before tax at 18.6% and profit after tax at 13.8%. The company increased grammage on 65% of its portfolio by end of October, with full portfolio completion expected by mid-November. Commodity prices remained stable with flour up 2% sequentially and 6% year-over-year. The company expects aggressive topline growth going forward, targeting volume-led growth and double-digit growth rates. New CEO Rakshit Hargave will join in December and handle the entire business operations. The company continues expansion in adjacency businesses including croissants, rusks, and wafers, all showing healthy double-digit growth.",
            "Sentiment": "positive",
            "PublishDate": 1762911464522,
            "Source": "earnings"
        },
        {
            "Title": "Britannia Announces Leadership Transition with New CEO Appointment",
            "Summary": "Britannia announced a leadership change with Co CEO Varun Berry resigning effective November 10. Rakshit Hargave has been appointed as Managing Director & CEO starting December 15. Natarajan Venkataraman will serve as Interim CEO during the transition period between Berry's departure and Hargave's appointment.",
            "Sentiment": "neutral",
            "PublishDate": 1762777596911,
            "Source": "corporate_governance"
        },
        {
            "Title": "Britannia Plans Pricing Adjustments and Revenue Growth Strategy",
            "Summary": "Britannia announced plans to adjust pricing to maintain competitiveness in the market. The company shared insights on future goals and outlined plans for strong revenue growth during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1762490381595,
            "Source": "stock"
        },
        {
            "Title": "Britannia Shares Rise 4% on Rakshit Hargave's Appointment as CEO",
            "Summary": "Britannia Industries shares gained up to 4% following the appointment of Rakshit Hargave as CEO and Executive Director. The stock traded at Rs 6,119 with an intraday high of Rs 6,191, marking the company's biggest intraday gain since September 4. Hargave, previously CEO of Birla Opus, brings FMCG experience including his work with Nivea India and introducing Domino's 30-minute delivery guarantee. His five-year appointment becomes effective December 15, reporting to Managing Director Varun Berry, who served as interim CEO after Rajneet Singh Kohli's departure in March. The stock has gained 30% year-to-date and 7% year-on-year. Analyst consensus shows 25 of 40 analysts recommend 'buy' with a target price of Rs 6,269, implying 2.5% potential returns.",
            "Sentiment": "positive",
            "PublishDate": 1762403624478,
            "Source": "corporate_governance"
        },
        {
            "Title": "Britannia Industries Reports Strong Q2 Performance with EBITDA Rising to 9.6B Rupees",
            "Summary": "Britannia Industries reported quarterly EBITDA of 9.6 billion rupees, up from 7.84 billion rupees in the same period last year. The company's EBITDA margin improved to 19.73% compared to 16.8% year-over-year, indicating enhanced profitability and operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1762365973329,
            "Source": "earnings"
        },
        {
            "Title": "Britannia Industries Reports 23% Growth in Quarterly Net Profit",
            "Summary": "Britannia Industries reported consolidated net profit of 6.5 billion rupees compared to 5.3 billion rupees in the same quarter last year. The company's revenue increased to 48.4 billion rupees from 46.67 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762365638912,
            "Source": "earnings"
        },
        {
            "Title": "Britannia Industries Reports Strong Q2 Performance with 30% Jump in Net Profit",
            "Summary": "Britannia Industries announced its quarterly results for the quarter and half year ended September 30, 2025. The company's consolidated net profit increased to ₹589.95 crores compared to ₹458.27 crores in the previous quarter. Revenue from operations reached ₹4,594.74 crores for the quarter. For the six-month period, consolidated net profit stood at ₹1,148.22 crores with revenue from operations at ₹8,794.25 crores. The Board of Directors approved the unaudited consolidated and standalone financial results at their meeting held on November 5, 2025. The results were authorized by Chairman Nusli N. Wadia and have received an unmodified review report from statutory auditors Walker Chandiok & Co LLP. The company operates primarily in the food segment and maintains its registered office in Kolkata.",
            "Sentiment": "positive",
            "PublishDate": 1762355959582,
            "Source": "earnings"
        },
        {
            "Title": "Rakshit Hargave Appointed CEO of Britannia Industries for Five Years",
            "Summary": "Rakshit Hargave will join Britannia Industries as CEO for five years, effective December 15, 2025, reporting to Managing Director and Chairman Varun Berry. Berry has been serving as interim CEO since Rajneet Singh Kohli left in March 2025. Hargave resigned from Birla Opus Paints to pursue opportunities outside the company. During his tenure at Birla Opus since November 2021, he played a significant role in the startup phase of Decorative Paints and initial business scaling, establishing six integrated manufacturing facilities and scaling distribution networks nationwide. His previous experience includes leadership roles at Beiersdorf (NIVEA) in ASEAN and ANZ regions, Africa operations, and MD of Nivea India. He also held positions at Hindustan Unilever, Kimberly Clark Lever, Lakme Lever, and Jubilant Foodworks where he launched Domino's Pizza 30-minute delivery guarantee model. Hargave holds an MBA from Faculty of Management Studies, Delhi and an Electrical Engineering degree from IIT Varanasi.",
            "Sentiment": "positive",
            "PublishDate": 1762350640853,
            "Source": "corporate_governance"
        },
        {
            "Title": "Urjit Patel Resigns as Independent Director at Britannia",
            "Summary": "Urjit Patel has stepped down from his position as Non-Executive Independent Director at Britannia. The resignation marks his departure from the board of the food and beverage company.",
            "Sentiment": "neutral",
            "PublishDate": 1761835737825,
            "Source": "corporate_governance"
        },
        {
            "Title": "Britannia Schedules Board Meeting to Review Quarterly Results on November 5",
            "Summary": "Britannia has announced that the company will consider its quarterly results on November 5. The board meeting is scheduled to review the company's financial performance for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1761810992398,
            "Source": "earnings"
        },
        {
            "Title": "Britannia Industries Block Trade Worth Rs. 60.54 Crores Executed on NSE",
            "Summary": "Britannia Industries executed a block trade on the National Stock Exchange involving approximately 100,536 shares at Rs. 6,022.00 per share, totaling Rs. 60.54 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1758774261235,
            "Source": "order&deals"
        },
        {
            "Title": "Britannia Adopts Localised Strategy to Counter Regional Competition, Avoids Price Wars",
            "Summary": "Britannia Industries is implementing a localised approach to compete with regional players by treating India as multiple markets rather than one country. Managing Director Varun Berry stated the company will not engage in price wars but will leverage its brand strength, 70 factories, and extensive distribution network. The company has maintained cost optimisation savings of 2% of revenue for 13 years and expects to continue this trend. Commodity inflation is stable at 3-5%, which Berry considers manageable. While performing well in categories like rusk, wafers, croissants, and milkshakes, Britannia is entering a consolidation phase for one year without launching new categories. The milk business has grown from Rs 400 crore to Rs 700 crore over four to five years, though it has not met initial expectations. Capital expenditure will be lower this year as the company utilises existing plant capacity before making new investments.",
            "Sentiment": "neutral",
            "PublishDate": 1757837598996,
            "Source": "stock"
        },
        {
            "Title": "Britannia Targets 50% Rural Sales Share Within 3-4 Years Through Distribution Expansion",
            "Summary": "Britannia expects half of its domestic sales to come from rural markets in the next 3-4 years, up from the current 40%. The company has shifted from a 75-25 urban-rural split to 60-40, with rural markets growing faster than urban areas and showing double-digit growth in the April-June quarter. Managing Director Varun Berry cited aspirational buying preferences in rural areas, where consumers now want premium products like smartphones and quality biscuits. The company is expanding direct distribution to reduce dependence on wholesalers and ensure continuous product availability in villages with less than 3,000 population. Britannia directly reaches approximately three million retail outlets and plans to add 100,000 outlets annually. Urban consumption has been impacted by rising real estate prices and rentals, though the company reported high single-digit urban growth. Quick commerce and e-commerce represent only 4% of total revenue, with 96% coming from traditional distribution channels.",
            "Sentiment": "positive",
            "PublishDate": 1757240838746,
            "Source": "stock"
        },
        {
            "Title": "GST Rate on Biscuits Reduced From 12% to 5%",
            "Summary": "The GST rate on biscuits has been reduced from 12% to 5%. This change affects Britannia, a biscuit manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1756193615449,
            "Source": "stock"
        },
        {
            "Title": "Britannia Industries Appoints Rajesh Kumar Batra as Independent Director",
            "Summary": "Britannia Industries has appointed Rajesh Kumar Batra as an Additional Non-Executive Independent Director for a five-year term from August 25, 2025 to August 24, 2030. The appointment was approved by the Board of Directors through a circular resolution on August 23, 2025, based on the recommendation of the Nomination and Remuneration Committee. The appointment is subject to shareholder approval through a postal ballot. Batra is a second-generation entrepreneur and Chairman and Managing Director of Cravatex Limited. He serves as an Independent Director on two listed companies and is involved with charitable trusts and sports promotion through the Ram Batra Memorial Foundation. He is not related to any existing director of Britannia Industries.",
            "Sentiment": "positive",
            "PublishDate": 1755980168160,
            "Source": "corporate_governance"
        },
        {
            "Title": "Britannia Industries Reports 9.8% Revenue Growth in Q1 FY26 Amid Commodity Price Stabilization",
            "Summary": "Britannia Industries achieved 9.8% revenue growth and 3% profit after tax growth in Q1 FY26, with consolidated revenue reaching INR 4,535 crores. The company gained market share in 5 out of 7 regions, with Hindi belt states showing particularly strong performance at 2.7x growth compared to other states. Rural growth reached double digits while urban growth was in high single digits. The company faced distribution challenges in the East region due to internal restructuring but expects recovery. Commodity prices showed mixed trends - flour inflation at 8%, palm oil inflation at 45% year-on-year, and cocoa inflation at 35%, though sequential trends were more stable. Premium product salience increased by 310 basis points driven by innovations including Pure Magic Stars, Harry Potter products, and new launches like Pure Magic Choco Tarts and 100% Millet NutriChoice. Adjacency businesses performed well with rusk showing high double-digit growth, croissant achieving mid-20s growth and reaching breakeven, and dairy showing 40% growth in general trade. Quick commerce now represents 75% of the company's e-commerce business at 4% of total sales. The company reported a SAR revaluation impact of INR 52 crores and expects more stable commodity conditions ahead.",
            "Sentiment": "positive",
            "PublishDate": 1755012425622,
            "Source": "earnings"
        },
        {
            "Title": "Britannia's Price Hike Strategy in Cake Category Backfires, Company Reassessing Approach",
            "Summary": "Britannia Industries' decision to increase cake prices from Rs 10 to Rs 15 in February has resulted in volume and revenue losses, prompting the company to reconsider its pricing strategy. Executive Vice-Chairman Varun Berry acknowledged the price hike backfired, particularly in the cake segment which is experiencing single-digit growth compared to the well-performing bread segment. The price increase was implemented to counter rising costs of palm oil and cocoa. Despite the setback, Britannia reported a 3% increase in net profit and 8.8% revenue growth, though it missed analyst estimates with a consolidated profit of Rs 520.72 crore versus the expected Rs 568.95 crore. The company believes it has covered most inflation through price increases and is now focusing on territorial competition strategies while expecting stable commodity prices ahead.",
            "Sentiment": "negative",
            "PublishDate": 1754794382833,
            "Source": "earnings"
        },
        {
            "Title": "Britannia Q1 Results Draw Mixed Reactions as Analysts Flag Margin Concerns Amid Competition",
            "Summary": "Britannia's quarterly earnings received cautious responses from analysts at Jefferies and Morgan Stanley, both highlighting competitive pressures affecting margins. The company reported 9.8% product sales growth with underlying volume growth estimated at around 4%. Double-digit growth was seen across four focus states and bakery categories including rusk, wafers, and croissants. However, gross margins showed lower-than-expected sequential expansion, causing EBITDA to fall below estimates. Management noted heightened competition across product categories and reported marginal consumption uptick in both urban and rural segments. Morgan Stanley maintained an 'Underweight' rating with a target price of Rs 4,850, citing margin miss due to competitive intensity. Both brokerages acknowledged the company's focus on sustaining growth through brand investments and product innovation while maintaining cautious outlook on profitability.",
            "Sentiment": "negative",
            "PublishDate": 1754453857975,
            "Source": "earnings"
        },
        {
            "Title": "Britannia Industries Reports 10% Sales Growth with Strong Performance in Major States and Bakery Segments",
            "Summary": "Britannia Industries achieved approximately 10% sales growth in its latest results. The company experienced notable double-digit growth in major states and its bakery business segments, indicating strong regional performance and category expansion.",
            "Sentiment": "positive",
            "PublishDate": 1754406049654,
            "Source": "stock"
        },
        {
            "Title": "Britannia Industries Reports 9.8% Sales Growth to Rs 4,535 Crores in Q1 FY2026",
            "Summary": "Britannia Industries reported consolidated sales of Rs 4,535 crores for the quarter ended June 30, 2025, marking a 9.8% year-on-year growth. Net profit increased 3% to Rs 520 crores compared to Rs 505 crores in the same quarter last year. The company's performance was driven by focused execution strategies, maximizing value from existing outlets, and operational efficiencies across its distribution network. Britannia achieved robust double-digit growth across four focus states and in adjacent bakery categories including Rusk, Wafers, and Croissant. The company launched new premium products including Pure Magic range and Crafted Cookies under Good Day brand. Executive Vice-Chairman Varun Berry attributed the growth to marginal uptick in consumption across urban and rural markets, supported by moderating inflation. Earnings per share stood at Rs 21.62 compared to Rs 20.99 in the previous year quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754400322253,
            "Source": "earnings"
        },
        {
            "Title": "Britannia Industries Reports Mixed Q1 Results with Revenue Growth but Margin Decline",
            "Summary": "Britannia Industries reported Q1 consolidated net profit of 5.21 billion rupees compared to 5.06 billion rupees in the same period last year, representing a modest increase. Revenue grew to 46.22 billion rupees from 42.5 billion rupees year-over-year. EBITDA rose slightly to 7.57 billion rupees from 7.54 billion rupees, however EBITDA margin contracted to 16.38% from 17.73% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754398554021,
            "Source": "earnings"
        },
        {
            "Title": "Britannia Q1 Results Preview: Analysts Forecast 8-13% Growth in Revenue and Profit",
            "Summary": "Britannia Industries is set to announce quarterly results ending June 2025. Bloomberg estimates project 8% revenue growth to Rs 4,610.9 crore and 13% net profit increase to Rs 569 crore. Analysts expect growth driven by 5-6% pricing increases and volume expansion of 3-5.5%. However, EBITDA margins may compress from 18.2% to 17.7% due to elevated raw material costs. Brokerage ratings remain mixed - JM Financial maintains 'Buy' with Rs 5,960 target calling it a top pick, Jefferies holds 'Hold' at Rs 5,768.9, while HSBC has 'Reduce' rating with Rs 5,030 target. Key growth drivers include biscuit volume growth of 3%, price hikes of 6%, and grammage cuts, though gross margins are expected to contract due to commodity price inflation.",
            "Sentiment": "positive",
            "PublishDate": 1754319754994,
            "Source": "earnings"
        },
        {
            "Title": "Strike at Britannia's Jhagadia Plant Called Off, Operations Restored",
            "Summary": "Britannia Industries has announced that the strike at their Jhagadia plant has been called off. The company reports that operations at the plant have been restored to normal.",
            "Sentiment": "positive",
            "PublishDate": 1748870471000,
            "Source": "default"
        },
        {
            "Title": "Britannia Industries: Goldman Sachs Raises Target Price on FY26 Outlook",
            "Summary": "Goldman Sachs upgrades Britannia Industries' 12-month price target to Rs 5,650, citing 9% revenue growth in Q4 FY25 and positive FY26 outlook. Management aims for double-digit revenue growth and profit growth ahead of revenues in FY26. Input costs expected to moderate, potentially aiding gross margin recovery.",
            "Sentiment": "positive",
            "PublishDate": 1747119598000,
            "Source": "normal_news"
        },
        {
            "Title": "Britannia Industries: New CEO Appointment Expected in 3-4 Months",
            "Summary": "Britannia Industries may announce a new CEO in 3-4 months following Rajneet Kohli's exit. Varun Berry, currently executive vice-chairman and managing director, has been designated as CEO effective May 8, 2025, in addition to his current roles. The company reported 9% growth in consolidated sales to ₹4,376 crores for Q4 FY2025, with a 4% increase in net profit to ₹559 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1747027524000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Britannia Industries: Q4 Profit Rises 5% Amid Challenging Market",
            "Summary": "Britannia Industries reported a 5.1% YoY increase in Q4 standalone net profit to ₹557 crore. Revenue grew 9.2% YoY to ₹4,218.9 crore. FY2024-25 revenue reached ₹16,859.2 crore, up 5.8% from FY24, with net profit at ₹2,130.2 crore, up 2.3%. The company achieved growth through strategic pricing and focus on emerging channels, despite challenging market conditions.",
            "Sentiment": "positive",
            "PublishDate": 1746751810000,
            "Source": "earnings"
        },
        {
            "Title": "Britannia Industries: Rs 75 Per Share Final Dividend Proposed",
            "Summary": "Britannia Industries has recommended a final dividend of Rs 75 per share for FY 2025. The 106th AGM is scheduled for August 11, 2025. The company's Q4 consolidated profit increased by 4% YoY to Rs 560 crore, surpassing analyst estimates.",
            "Sentiment": "positive",
            "PublishDate": 1746725765000,
            "Source": "corporate_action"
        },
        {
            "Title": "Britannia Industries: Q4 Profit Rises 4%, Beats Estimates",
            "Summary": "Britannia Industries reported a 4% year-over-year increase in Q4 FY25 consolidated profit to Rs 560 crore, surpassing analyst estimates. Revenue grew 9% to Rs 4,432 crore, while EBITDA rose 2.3% to Rs 805 crore. However, the company's margin contracted to 18.2% from 19.3% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1746721022000,
            "Source": "earnings"
        },
        {
            "Title": "Britannia Industries: Q4 Profit Up 4%, Rs 75 Dividend Declared",
            "Summary": "Britannia Industries reported a 4% increase in Q4 consolidated net profit to Rs 560 crore. Revenue rose 9% to Rs 4,432 crore. The company announced a final dividend of Rs 75 per share for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1746720653000,
            "Source": "result"
        },
        {
            "Title": "Britannia Industries Ltd: Q4 and FY25 Results Announcement Scheduled",
            "Summary": "Britannia Industries Ltd will announce Q4 and FY25 results on May 8, 2025. The board will consider dividend declaration. Trading window for insiders closed from April 1 until 48 hours after results announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1746529254000,
            "Source": "corporate_action"
        },
        {
            "Title": "Britannia Industries Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade of Britannia Industries Ltd. shares occurred on the National Stock Exchange (NSE). The trade involved approximately 50,210 shares, valued at Rs. 25.19 crores, with each share priced at Rs. 5016.20.",
            "Sentiment": "neutral",
            "PublishDate": 1743653523000,
            "Source": "block_deals"
        },
        {
            "Title": "Britannia Industries: Strike Disrupts Gujarat Plant Operations",
            "Summary": "Britannia Industries' Jhagadia plant in Gujarat is partially impacted by a worker strike. The company is in discussions with workers to resolve the situation and is managing demand through available resources to minimize disruptions. Britannia has committed to communicating any material developments to stock exchanges.",
            "Sentiment": "negative",
            "PublishDate": 1742874639000,
            "Source": "corporate_action"
        },
        {
            "Title": "Britannia Industries Faces Partial Strike at Jhagadia Plant",
            "Summary": "Britannia Industries reports that operations at its Jhagadia plant are partially affected by a worker strike. The company is currently in discussions with workers to resolve the issue. Britannia is assessing the impact of the strike and managing demand through available resources.",
            "Sentiment": "negative",
            "PublishDate": 1742861392000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Britannia Industries: Gujarat Plant Operations Partially Affected by Workers' Strike",
            "Summary": "Britannia Industries' Jhagadia plant in Gujarat is experiencing partial operational disruption due to a workers' strike that began on Monday. The company is in discussions with workers to resolve the situation and is managing demand through available resources. The impact is currently being assessed.",
            "Sentiment": "negative",
            "PublishDate": 1742827870000,
            "Source": "normal_news"
        },
        {
            "Title": "Britannia Industries Faces Partial Strike at Jhagadia Plant",
            "Summary": "Britannia Industries reports that operations at its Jhagadia plant are partially affected due to an ongoing workers' strike. The company is currently in discussions with workers to resolve the issue. Britannia is assessing the impact of the strike and managing demand through available resources.",
            "Sentiment": "negative",
            "PublishDate": 1742827759000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Britannia Industries Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade of Britannia Industries Ltd. shares occurred on the National Stock Exchange (NSE). The transaction involved approximately 50,084 shares, valued at Rs. 23.98 crores. The shares were traded at a price of Rs. 4,788.30 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1741590650000,
            "Source": "block_deals"
        },
        {
            "Title": "Britannia Industries CEO Rajneet Singh Kohli Resigns",
            "Summary": "Rajneet Singh Kohli has resigned from his position as the Chief Executive Officer (CEO) of Britannia Industries. This marks a significant change in the company's top leadership.",
            "Sentiment": "neutral",
            "PublishDate": 1741252031000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Britannia Industries: Significant Capex Reduction Planned for FY26",
            "Summary": "Britannia Industries plans to reduce its capital expenditure to ₹150-200 crore in FY26, down from an average of ₹600-650 crore in recent years. This decision follows the completion of three new manufacturing plants. The company also anticipates implementing a cumulative 6% price hike by June 2025 to mitigate inflation on key input materials.",
            "Sentiment": "neutral",
            "PublishDate": 1738934610000,
            "Source": "corporate_action"
        },
        {
            "Title": "Britannia Industries: Dolat Capital Maintains 'Accumulate' Rating Post Q3 Results",
            "Summary": "Britannia launched new products including 'Dual Flavoured Layer Cake' and 'Triple Chocolate Croissants'. The company focuses on new product launches and brand innovations to reduce dependency on conventional biscuit business and create long-term growth opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1738934140000,
            "Source": "result"
        }
    ]
}