{
    "Symbol": "BRNL",
    "ISIN": "INE727S01012",
    "News": [
        {
            "Title": "BRNL Board Meeting Set for February 13, 2026",
            "Summary": "Bharat Road Network Limited announces board meeting on February 13, 2026 to consider Q3FY26 unaudited financial results. Trading window closed from January 1, 2026 until 48 hours post-announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1770194608637,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bharat Road Network Limited Reports Quarterly Results with Auditor Qualifications and Going Concern Issues",
            "Summary": "Bharat Road Network Limited announced its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company's auditors issued qualified conclusions citing non-recognition of interest on Rs. 19,357.73 lakhs from July 01, 2024 onwards, resulting in profit before tax being overstated by Rs. 1,080.57 lakhs for the quarter and Rs. 2,118.34 lakhs for the half year. The auditors also highlighted material uncertainty regarding the company's ability to continue as a going concern due to defaults in debt repayment and significant losses. Additionally, subsidiary Guruvayoor Infrastructure Private Limited failed to recognize interest on Rs. 9,766.18 lakhs from October 01, 2024 onwards. The company faces ongoing legal challenges including search proceedings under the Prevention of Money Laundering Act at its subsidiary GIPL, and project terminations at associates Kurukshetra Expressway Private Limited and Mahakaleshwar Tollways Private Limited, both of which have filed claims with respective authorities.",
            "Sentiment": "negative",
            "PublishDate": 1762903474690,
            "Source": "earnings"
        },
        {
            "Title": "Kerala High Court Revokes Toll Collection Suspension for Bharat Road Network Subsidiary",
            "Summary": "The High Court of Kerala has revoked the suspension on toll collection at the Paliyekkara Toll plaza operated by Guruvayoor Infrastructure Private Limited, a subsidiary of Bharat Road Network Limited. The suspension, which was implemented on August 6, 2025, following a public interest litigation, has been lifted effective October 17, 2025. Toll rates will return to the levels that were in place before the suspension began. The original suspension order had temporarily halted user fee collection for four weeks.",
            "Sentiment": "positive",
            "PublishDate": 1760790194770,
            "Source": "stock"
        },
        {
            "Title": "Bharat Road Network Limited Appoints Anirup Sen as Chief Executive Officer",
            "Summary": "Bharat Road Network Limited has appointed Anirup Sen as Chief Executive Officer and Whole Time Key Managerial Personnel, effective September 17, 2025. The appointment was approved by the Board of Directors based on the recommendation of the Nomination and Remuneration Committee. Sen brings over 28 years of experience across MNC banks, NBFCs, and infrastructure firms. He previously served as Head – Rental & Used Equipment at Innovative Infra & Mining Solutions Ltd. and held CEO and COO positions at organizations including Contract Square, Solapur Tollways, and Jardine Henderson. Sen holds a Bachelor of Science with Mathematics Honours from St. Xavier's College, Kolkata, an MBA from University of Wales, Cardiff, U.K., and is a life member of several professional bodies including Calcutta Management Association.",
            "Sentiment": "positive",
            "PublishDate": 1758127233075,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bajrang Kumar Choudhary Steps Down as Managing Director of Bharat Road Network Limited",
            "Summary": "Bajrang Kumar Choudhary has resigned from his position as Managing Director of Bharat Road Network Limited due to personal reasons, effective September 16, 2025. He will continue serving as a Director on the company's Board of Directors. The resignation was communicated to stock exchanges BSE and NSE on September 17, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758125497865,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bharat Road Network Limited Approves Quarterly Results, Schedules AGM and Appoints New Auditor",
            "Summary": "Bharat Road Network Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company scheduled its 18th Annual General Meeting for September 26, 2025, to be held via video conferencing with e-voting cut-off date set for September 19, 2025. The Board appointed M/s. M. R. & Associates as Secretarial Auditor for a five-year term from FY 2025-26 to 2029-30. The auditor's review report highlighted qualified conclusions due to non-recognition of interest on Rs. 19,357.73 lakhs, resulting in overstated profit before tax by Rs. 1,037.77 lakhs and understated current liabilities by Rs. 3,957.34 lakhs. The company faces material uncertainty regarding its ability to continue as a going concern due to defaulted repayments and significant losses. Associates Kurukshetra Expressway Private Limited and Mahakaleshwar Tollways Private Limited have terminated projects and filed claims with authorities. Subsidiary Guruvayoor Infrastructure Private Limited is subject to search proceedings under the Prevention of Money Laundering Act, 2002.",
            "Sentiment": "negative",
            "PublishDate": 1755013444583,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Road Network Unit Receives ₹383.85 Crore Settlement from NHAI",
            "Summary": "A unit of Bharat Road Network has been granted ₹383.85 crore by the National Highways Authority of India (NHAI) as part of the Vivad Se Vishwas II scheme. This settlement fully resolves a concession disagreement between the two parties. The Vivad Se Vishwas II scheme appears to be a dispute resolution mechanism, though no further details about the scheme or the nature of the concession disagreement are provided in the given information.",
            "Sentiment": "positive",
            "PublishDate": 1752035431000,
            "Source": "default"
        }
    ]
}