{
    "Symbol": "BROOKS",
    "ISIN": "INE650L01011",
    "News": [
        {
            "Title": "Brooks Laboratories ITAT Appeals Dismissed for 3 AYs",
            "Summary": "Brooks Laboratories Limited received ITAT orders dismissing company appeals for Assessment Years 2012-13, 2014-15 and 2016-17, with no material impact on financials or operations.",
            "Sentiment": "negative",
            "PublishDate": 1769781749172,
            "Source": "stocks"
        },
        {
            "Title": "Brooks Laboratories Board Meet Set for Feb 6, 2026",
            "Summary": "Brooks Laboratories Limited has scheduled a board meeting for February 6, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769693560064,
            "Source": "co_actions_results"
        },
        {
            "Title": "Brooks Laboratories Reports Mixed Q2 Performance with Revenue Growth but Profit Decline",
            "Summary": "Brooks Laboratories Limited posted revenue of Rs. 2,345.07 lakhs for Q2 FY26 compared to Rs. 2,079.21 lakhs in Q2 FY25, but recorded a net loss of Rs. 223.73 lakhs versus a profit of Rs. 95.57 lakhs in the same quarter last year. The company's half-year revenue increased to Rs. 4,896.26 lakhs from Rs. 3,872.50 lakhs, though it maintained a net profit of Rs. 488.79 lakhs compared to Rs. 74.34 lakhs in the previous half-year period.",
            "Sentiment": "neutral",
            "PublishDate": 1763143486595,
            "Source": "earnings"
        },
        {
            "Title": "Brooks Laboratories Gets Credit Rating Upgrade from CARE Ratings",
            "Summary": "Brooks Laboratories Limited received a credit rating upgrade from CARE Ratings Limited. The long-term bank facilities rating was upgraded to CARE BB+ Stable from CARE BB- Stable, while the short-term bank facilities rating of CARE A4 was reaffirmed. The upgrade reflects expected improvement in financial performance in FY26 with projected total operating income of ₹100 crore and higher profit margins driven by lower purchase costs due to stronger supplier negotiations. The company reported total operating income of ₹83.04 crore in FY25 with PBILDT and PAT margins of 6.03% and 3.68% respectively. CARE Ratings noted the announced merger of Brooks Laboratories' associate company Brooks Steriscience Limited into OneSource Speciality Pharma Limited, expected to be completed by December 2026. Brooks Laboratories will receive a 1.50% equity stake in OneSource Speciality Pharma in lieu of its 49% stake in Brooks Steriscience Limited. The merger is expected to enhance liquidity position and discontinue the corporate guarantee of ₹68.62 crore extended for Brooks Steriscience Limited's borrowings.",
            "Sentiment": "positive",
            "PublishDate": 1762932536055,
            "Source": "corporate_action"
        },
        {
            "Title": "Brooks Steriscience Approves Multi-Entity Merger Scheme Involving OneSource Specialty Pharma",
            "Summary": "Brooks Steriscience Limited's board has approved a composite scheme involving mergers between five pharmaceutical entities: Steriscience Specialties, Brooks Steriscience, Steriscience Pte, Strides Pharma Services, and OneSource Specialty Pharma. The scheme consolidates sterile injectable manufacturing operations under OneSource through multiple amalgamations. Key financial metrics show OneSource with the largest turnover at INR 12,995.89 million and net worth of INR 59,108.37 million. The merger uses share exchange ratios rather than cash consideration - 48 Brooks Steriscience shares for every 10 Steriscience Specialties shares, and 137 OneSource shares for every 10 Brooks Steriscience shares. Post-merger, OneSource's promoter shareholding will increase from 29.77% to 36.17%. The scheme requires approvals from shareholders, creditors, stock exchanges, SEBI, National Company Law Tribunal, Singapore High Court, and other regulatory authorities. The consolidation aims to strengthen business capabilities, create operational synergies, and enhance shareholder value in the contract development and manufacturing operations sector.",
            "Sentiment": "positive",
            "PublishDate": 1758909475397,
            "Source": "corporate_action"
        },
        {
            "Title": "Brooks Laboratories Reports 265.06 Lakh Net Profit for Quarter Ended June 30, 2025",
            "Summary": "Brooks Laboratories Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported a net profit of Rs. 265.06 lakhs compared to a loss of Rs. 21.23 lakhs in the same quarter last year. Revenue from operations increased to Rs. 2,551.19 lakhs from Rs. 1,793.29 lakhs year-over-year. Total income rose to Rs. 2,572.89 lakhs from Rs. 1,800.22 lakhs. On a consolidated basis, the company posted a significantly higher net profit of Rs. 958.48 lakhs, benefiting from its share of profit from jointly controlled entity Brooks Steriscience Limited, which contributed Rs. 693.42 lakhs. Brooks Steriscience recorded revenue of Rs. 3,230.70 lakhs including licensing income of Rs. 2,083.56 lakhs, resulting in profit after tax of Rs. 1,415.14 lakhs. Basic earnings per share improved to Rs. 0.90 from negative Rs. 0.08 in the previous year quarter. The board meeting to approve these results was held on August 13, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755086333752,
            "Source": "earnings"
        },
        {
            "Title": "Brooks Laboratories Approves Fund Raise of Up to 750 Million Rupees",
            "Summary": "Brooks Laboratories has approved a fund raise of up to 750 million rupees through the issuance of equity shares on a preferential basis.",
            "Sentiment": "positive",
            "PublishDate": 1733930003000,
            "Source": "corporate_action"
        }
    ]
}