{
    "Symbol": "BSE",
    "ISIN": "INE118H01025",
    "News": [
        {
            "Title": "Small-cap stocks crash: 500 stocks down 10-30% in Jan",
            "Summary": "BSE Smallcap index plunges 9% in January, double Sensex's 4% fall. Nearly 500 small-cap stocks crashed over 10%, with investors losing ₹5.6 lakh crore amid widespread market rout.",
            "Sentiment": "negative",
            "PublishDate": 1769172071145,
            "Source": "stocks"
        },
        {
            "Title": "Markets shut Monday for Republic Day, open Sunday",
            "Summary": "Stock exchanges NSE and BSE will remain closed on Monday, January 26, for Republic Day but will operate on Sunday, February 1, for Union Budget presentation with normal trading hours from 9:15 am to 3:30 pm.",
            "Sentiment": "neutral",
            "PublishDate": 1769170462111,
            "Source": "stocks"
        },
        {
            "Title": "BSE-listed firms lose ₹16 lakh cr in market rout",
            "Summary": "BSE Sensex fell 770 points to 81,538 while Nifty dropped 241 points to 25,049 on Friday. Weekly losses exceeded ₹15 lakh crore as broader markets recorded biggest fall in four months with midcap index declining over 4.5%.",
            "Sentiment": "negative",
            "PublishDate": 1769165425468,
            "Source": "stocks"
        },
        {
            "Title": "Axis MF launches BSE India Sector Leaders Index Fund",
            "Summary": "Axis Mutual Fund launches new index fund tracking BSE India Sector Leaders TRI. NFO opens January 23 with ₹100 minimum investment, offering exposure across market caps through top 3 companies from 21 sectors.",
            "Sentiment": "positive",
            "PublishDate": 1769068620492,
            "Source": "mutualfunds"
        },
        {
            "Title": "BSE Shows Double Top Pattern Breakdown",
            "Summary": "BSE Ltd exhibits bearish reversal pattern on 1-hour chart, breaking below ₹2,800 support level with technical indicators confirming downward momentum and potential further decline.",
            "Sentiment": "negative",
            "PublishDate": 1768889711315,
            "Source": "stocks"
        },
        {
            "Title": "BSE leads capital market infra boom with 124% returns",
            "Summary": "BSE emerges as fastest wealth creator post-COVID with 124% CAGR during 2020-25, as capital market infrastructure players benefit from India's equity culture boom and rising retail participation.",
            "Sentiment": "positive",
            "PublishDate": 1768835700936,
            "Source": "stocks"
        },
        {
            "Title": "BSE Sensex Open Interest Jumps 4x After Reshuffle",
            "Summary": "BSE reports Sensex open interest surged nearly four times from 1.7 million to 6 million contracts following expiry day shift from Tuesday to Thursday, with weekly options driving trading volumes.",
            "Sentiment": "positive",
            "PublishDate": 1768812049775,
            "Source": "stocks"
        },
        {
            "Title": "NSE confirms Budget day trading on February 1, 2026",
            "Summary": "National Stock Exchange will operate regular trading session on Union Budget day with standard timings, while Economic Survey release precedes Finance Minister's budget presentation.",
            "Sentiment": "neutral",
            "PublishDate": 1768564824928,
            "Source": "stocks"
        },
        {
            "Title": "Sensex, Nifty snap 2-day losing streak; IT rallies 3%",
            "Summary": "BSE Sensex rose 188 points to 83,570 and Nifty gained 29 points to 25,694 on Thursday, ending two-day decline. Nifty IT surged 3.34% on strong Infosys results while banking stocks outperformed.",
            "Sentiment": "positive",
            "PublishDate": 1768559128690,
            "Source": "stocks"
        },
        {
            "Title": "Stock Market Closed Jan 15 for Maharashtra Elections",
            "Summary": "BSE and NSE announce trading holiday on January 15, 2026 for Maharashtra municipal elections. Both exchanges revise earlier stance, with derivative contracts expiring early.",
            "Sentiment": "neutral",
            "PublishDate": 1768364627177,
            "Source": "stocks"
        },
        {
            "Title": "Stock Markets Closed Jan 15 for Maharashtra Polls",
            "Summary": "Indian equity markets including BSE and NSE will remain closed on January 15, 2026, due to Maharashtra public holiday for municipal corporation elections across 29 urban centres including Mumbai.",
            "Sentiment": "neutral",
            "PublishDate": 1768303108163,
            "Source": "stocks"
        },
        {
            "Title": "Sensex drops 250 points, Nifty holds above 25,700",
            "Summary": "Indian equity markets ended lower with Sensex falling 250 points to 83,628 and Nifty dropping 58 points to 25,732. Banking stocks recovered from lows while broader markets underperformed.",
            "Sentiment": "negative",
            "PublishDate": 1768300174844,
            "Source": "stocks"
        },
        {
            "Title": "Sensex F&O expiry moved to Jan 14 due to civic polls",
            "Summary": "BSE and NSE announce trading holiday on January 15 for Maharashtra civic polls, advancing Sensex F&O expiry to January 14. All equity, derivatives, and commodity segments will remain closed.",
            "Sentiment": "neutral",
            "PublishDate": 1768281360670,
            "Source": "stocks"
        },
        {
            "Title": "NSE, BSE to Remain Closed on Jan 15 for Elections",
            "Summary": "Indian stock exchanges NSE and BSE will shut equity and derivatives trading on January 15, 2026, due to Maharashtra Municipal Corporation elections, with limited commodity trading in evening hours.",
            "Sentiment": "neutral",
            "PublishDate": 1768221853147,
            "Source": "stocks"
        },
        {
            "Title": "BSE, NSE Closed Jan 15 for Maharashtra Elections",
            "Summary": "Stock exchanges BSE and NSE will remain closed on January 15 for trading activities due to municipal corporation elections in Maharashtra, affecting equity and derivatives segments.",
            "Sentiment": "neutral",
            "PublishDate": 1768217732582,
            "Source": "stocks"
        },
        {
            "Title": "BSE, NSE Declare Trading Holiday on January 15",
            "Summary": "Stock exchanges BSE and NSE announce market closure on January 15, 2026 for Maharashtra municipal elections. Equity derivatives contracts expiring on January 15 will be preponed to January 14.",
            "Sentiment": "neutral",
            "PublishDate": 1768216894062,
            "Source": "stocks"
        },
        {
            "Title": "Sensex Posts Worst Start in Decade with 1.93% Fall",
            "Summary": "BSE Sensex declined 1.93% in first 10 days of 2026, marking worst opening stretch in decade. FII selling of ₹11,784 crores and geopolitical tensions drove broad-based selloff across sectors.",
            "Sentiment": "negative",
            "PublishDate": 1768191749790,
            "Source": "stocks"
        },
        {
            "Title": "BSE Trading Holiday on Jan 15 for Select Segments",
            "Summary": "BSE announces trading holiday on January 15 for currency derivatives, new debt, and tri-party repo segments while other segments continue normal operations.",
            "Sentiment": "neutral",
            "PublishDate": 1767963209771,
            "Source": "currency"
        },
        {
            "Title": "NSE, BSE Schedule Mock Trading Session for January 10",
            "Summary": "Indian exchanges NSE and BSE will conduct a mock trading session on Saturday, January 10, to test system resilience and trading infrastructure. The exercise includes testing alternate trading venue mechanisms.",
            "Sentiment": "neutral",
            "PublishDate": 1767963165601,
            "Source": "stocks"
        },
        {
            "Title": "BSE Schedules Mock Trading Session on January 10",
            "Summary": "BSE will conduct a mock trading session on January 10 for currency derivatives, commodity derivatives, and electronic gold receipts to test trading systems and ensure operational readiness.",
            "Sentiment": "neutral",
            "PublishDate": 1767961726013,
            "Source": "stocks"
        },
        {
            "Title": "BSE Launches New Index for Derivative Stock Monitoring",
            "Summary": "BSE introduces specialized index to track derivative stocks from BSE 500, enhancing market monitoring capabilities for investors and traders in the derivatives segment.",
            "Sentiment": "positive",
            "PublishDate": 1767961492757,
            "Source": "stocks"
        },
        {
            "Title": "BSE Launches New All Derivative Stocks Index",
            "Summary": "BSE has introduced a new All Derivative Stocks Index, expanding its index offerings to provide comprehensive coverage of derivative-eligible securities in the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1767961471305,
            "Source": "stocks"
        },
        {
            "Title": "BSE launches All Derivative Stocks Index for F&O tracking",
            "Summary": "BSE Index Services introduces new index to track derivative-eligible stocks within BSE 500 universe, weighted by market cap and momentum with 10% individual stock cap.",
            "Sentiment": "positive",
            "PublishDate": 1767959114732,
            "Source": "stocks"
        },
        {
            "Title": "Stock Market Crash: BSE Companies Lose ₹15 Lakh Crore",
            "Summary": "Indian equities suffered their worst week since September with BSE-listed companies losing ₹15 lakh crore in market cap. Nifty 50 fell to two-month lows with 35 constituents posting losses up to 10%.",
            "Sentiment": "negative",
            "PublishDate": 1767951154746,
            "Source": "stocks"
        },
        {
            "Title": "Auto Sector Leads Market Rally with 32% Gains in FY26",
            "Summary": "BSE Auto index emerges as top-performing sector with 32% surge in FY26, outpacing Sensex's 8.5% gain. SML Mahindra and Force Motors deliver multibagger returns of 185% and 121% respectively.",
            "Sentiment": "positive",
            "PublishDate": 1767946315589,
            "Source": "stocks"
        },
        {
            "Title": "Sensex, Nifty slip early amid continued selloff",
            "Summary": "Indian equity benchmarks BSE Sensex and NSE Nifty declined 0.1% in early Friday trade, extending Thursday's selloff with negative market breadth across segments.",
            "Sentiment": "negative",
            "PublishDate": 1767938872293,
            "Source": "stocks"
        },
        {
            "Title": "Stock Markets Expected Open on Jan 15 Civic Poll Day",
            "Summary": "Despite Maharashtra declaring January 15 as civic poll holiday for municipal elections, BSE and NSE have not announced trading halt. Markets expected to operate normally amid weekly derivatives expiry.",
            "Sentiment": "neutral",
            "PublishDate": 1767934781926,
            "Source": "stocks"
        },
        {
            "Title": "BSE, NSE Trading Status Unclear for January 15 Holiday",
            "Summary": "Maharashtra declares January 15 public holiday for civic polls, but BSE and NSE haven't confirmed trading closure. Historical precedent shows settlement holidays during BMC elections.",
            "Sentiment": "neutral",
            "PublishDate": 1767861615968,
            "Source": "stocks"
        },
        {
            "Title": "Sensex drops 322 points, Nifty ends below 26,300",
            "Summary": "Benchmark indices declined with IT stocks under pressure from US tariff concerns while HDFC Bank fell 2.4% on funding cost worries. Midcap stocks slipped 0.2% but smallcaps gained 0.5%.",
            "Sentiment": "negative",
            "PublishDate": 1767598885380,
            "Source": "stocks"
        },
        {
            "Title": "BSE CEO on Sensex at 40: Index investing to drive growth",
            "Summary": "As Sensex completes 40 years, BSE MD Sundararaman Ramamurthy highlights the index's evolution and the exchange's strategic focus on index investing, technology upgrades, and market depth for future growth.",
            "Sentiment": "positive",
            "PublishDate": 1767584701997,
            "Source": "stocks"
        },
        {
            "Title": "FPIs turn net buyers as Nifty hits first record high of 2026",
            "Summary": "Foreign investors bought ₹289.80 cr worth equities after 8 sessions of selling as Nifty 50 touched all-time high of 26,340. DIIs remained net buyers for 50th consecutive session with ₹677.38 cr purchases.",
            "Sentiment": "positive",
            "PublishDate": 1767349804119,
            "Source": "stocks"
        },
        {
            "Title": "Sensex Gains 492 Points, Nifty Crosses 26,300 Mark",
            "Summary": "Benchmark indices extended gains with Sensex rising 0.58% to ₹85,680.73 and Nifty advancing 0.62% to 26,307.60. Bank Nifty breached 60,000 mark while Coal India led gainers with 5.88% surge.",
            "Sentiment": "positive",
            "PublishDate": 1767340980708,
            "Source": "stocks"
        },
        {
            "Title": "Indian Stock Markets Open on New Year's Day 2026",
            "Summary": "BSE and NSE will remain open for trading on January 1, 2026, while major global markets stay closed. The exchanges have announced 15 trading holidays for 2026, one more than the current year.",
            "Sentiment": "neutral",
            "PublishDate": 1767231120919,
            "Source": "stocks"
        },
        {
            "Title": "Sensex gains 546 pts, Nifty crosses 26,100 mark",
            "Summary": "Indian equity indices snapped four-day losing streak with broad-based buying. Steel and oil stocks led gains after government policy announcements, while IT stocks underperformed.",
            "Sentiment": "positive",
            "PublishDate": 1767176601769,
            "Source": "stocks"
        },
        {
            "Title": "BSE, NSE Release 2026 Holiday Calendar with 15 Trading Days",
            "Summary": "Indian stock exchanges announce 15 market holidays for 2026, including Republic Day, Holi, and Christmas. Markets remain open on New Year while global bourses close.",
            "Sentiment": "neutral",
            "PublishDate": 1767145899811,
            "Source": "stocks"
        },
        {
            "Title": "Indian Markets Add ₹30.20 Lakh Crore in 2025",
            "Summary": "BSE Sensex surged 8.39% in 2025, adding ₹30.20 lakh crore to investor wealth despite foreign fund outflows of ₹1.6 lakh crore. Strong domestic support and record IPO activity drove resilience.",
            "Sentiment": "positive",
            "PublishDate": 1767077308895,
            "Source": "stocks"
        },
        {
            "Title": "BSE shares surge 14x under Ramamurthy's leadership",
            "Summary": "Under CEO Sundararaman Ramamurthy's leadership since January 2023, BSE has delivered over 14x returns through strategic cost-cutting, technology upgrades, and successful launch of Sensex weekly options.",
            "Sentiment": "positive",
            "PublishDate": 1766901299241,
            "Source": "stocks"
        },
        {
            "Title": "BSE Bankex adds 4 new banking stocks in reshuffle",
            "Summary": "BSE BANKEX index reconstitution effective December 26 includes Canara Bank, AU Small Finance Bank, PNB, and Union Bank. Index now has 14 constituents with revamped weighting structure.",
            "Sentiment": "positive",
            "PublishDate": 1766739065471,
            "Source": "stocks"
        },
        {
            "Title": "Midcap, Smallcap Stocks Underperform Sensex in 2025",
            "Summary": "BSE smallcap index declined 6.68% while midcap gained just 0.77% till December 24, 2025, compared to Sensex's 9.30% jump. Elevated valuations and profit-booking after strong 2023-24 rally cited as key reasons.",
            "Sentiment": "negative",
            "PublishDate": 1766645023726,
            "Source": "stocks"
        },
        {
            "Title": "NSE, BSE Announce 2026 Trading Holiday Calendar",
            "Summary": "Stock exchanges reveal 15 trading holidays for 2026, with potential additional closure for BMC elections. Markets closed on major festivals including Republic Day, Holi, and Diwali.",
            "Sentiment": "neutral",
            "PublishDate": 1766589187891,
            "Source": "stocks"
        },
        {
            "Title": "Sensex Delivers 15,594% Return Over 40 Years",
            "Summary": "BSE Sensex completes 40 years with spectacular 15,594% return, rising from 549 points in 1986 to 86,159 this month. Index delivered positive returns in 75% of years, tracking India's economic transformation.",
            "Sentiment": "positive",
            "PublishDate": 1766587064960,
            "Source": "stocks"
        },
        {
            "Title": "BSE Clarifies on Index Options Expansion Reports",
            "Summary": "BSE Limited issues clarification regarding media reports about plans to launch additional monthly index option products, stating no undisclosed information exists.",
            "Sentiment": "neutral",
            "PublishDate": 1766468168257,
            "Source": "stocks"
        },
        {
            "Title": "BSE Plans New Monthly Index Options Launch",
            "Summary": "BSE Limited is reportedly planning to introduce new monthly index options, expanding its derivatives offerings in the Indian financial markets according to Bloomberg reports.",
            "Sentiment": "positive",
            "PublishDate": 1766389303980,
            "Source": "stocks"
        },
        {
            "Title": "BSE Plans Strategic Investment in Section 8 Company",
            "Summary": "BSE Limited announces plans to acquire 16,000 equity shares in a proposed Section 8 company, marking a strategic corporate investment initiative by the leading stock exchange.",
            "Sentiment": "neutral",
            "PublishDate": 1765977289174,
            "Source": "stocks"
        },
        {
            "Title": "BSE Ltd Records ₹49.44 Cr NSE Block Trade",
            "Summary": "BSE Ltd witnessed a significant block trade on NSE worth ₹49.44 crores involving 192,008 shares at ₹2,575.00 per share, indicating substantial institutional activity in the stock exchange operator's shares.",
            "Sentiment": "neutral",
            "PublishDate": 1765860330132,
            "Source": "co_actions_results"
        },
        {
            "Title": "BSE Ltd. Sees Rs. 16.46 Crore Block Trade on NSE",
            "Summary": "BSE Ltd. witnessed a significant block trade worth Rs. 16.46 crores involving approximately 61,087 shares executed at Rs. 2,693.70 per share on the NSE platform. The transaction represents a substantial institutional or bulk investor activity in the stock exchange operator's shares.",
            "Sentiment": "neutral",
            "PublishDate": 1765253601814,
            "Source": "order&deals"
        },
        {
            "Title": "BSE Co-CEO Reports Rising Demand for Colocation Racks",
            "Summary": "BSE's Co-CEO announced increased demand for colocation racks at the exchange. The development indicates growing interest in BSE's technology infrastructure services among market participants.",
            "Sentiment": "positive",
            "PublishDate": 1764736450195,
            "Source": "stock"
        },
        {
            "Title": "BSE Increases Investment in India International Exchange",
            "Summary": "BSE has injected additional funds into India International Exchange (IFSC). The exchange is making further capital investment in its international trading platform.",
            "Sentiment": "positive",
            "PublishDate": 1762953512184,
            "Source": "stock"
        },
        {
            "Title": "BSE Ltd. Sees Rs. 22.64 Crore Block Trade on NSE",
            "Summary": "BSE Ltd. witnessed a block trade worth Rs. 22.64 crores on the National Stock Exchange. The transaction involved approximately 82,651 shares executed at a price of Rs. 2,739.20 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1762919260388,
            "Source": "order&deals"
        },
        {
            "Title": "BSE Reports Record Quarterly Revenue of ₹1,139 Crore, Net Profit Jumps 61%",
            "Summary": "BSE Ltd achieved its highest-ever quarterly revenue of ₹1,139 crore for the quarter ended September 30, 2025, representing a 40% year-on-year increase and marking the tenth consecutive quarter of record revenues. Consolidated net profit surged 61% to ₹557 crore, while operating EBITDA increased 75% to ₹680 crore. The equity derivatives segment processed 642 crore contracts, generating ₹624 crore in revenue. BSE facilitated 97 new equity listings across its main and SME boards, helping companies raise ₹53,548 crore. The SME platform now hosts 657 listed companies that have collectively raised over ₹13,083 crore since launch. The StAR MF platform processed 20.1 crore mutual fund transactions, up 24% from the previous year, maintaining an 89% market share with revenue growing 18% to ₹69.7 crore. BSE's clearing subsidiary ICCL saw equity settled turnover triple to ₹2.91 lakh crore in the first half, while equity derivatives premium turnover nearly doubled to ₹4.31 lakh crore. BSE shares closed at ₹2,643.10, up 0.68%.",
            "Sentiment": "positive",
            "PublishDate": 1762872874880,
            "Source": "earnings"
        }
    ]
}