{
    "Symbol": "BSL",
    "ISIN": "INE594B01012",
    "News": [
        {
            "Title": "BSL Limited Q3FY26 Results Show Mixed Performance",
            "Summary": "BSL Limited reported Q3FY26 net profit of ₹118.31 lac, down from ₹304.51 lac in Q3FY25. Revenue declined to ₹16,688.18 lac from ₹16,978.13 lac year-on-year, reflecting challenging market conditions.",
            "Sentiment": "negative",
            "PublishDate": 1770635942587,
            "Source": "co_actions_results"
        },
        {
            "Title": "BSL Limited Board Meeting Set for February 9, 2026",
            "Summary": "BSL Limited announces board meeting on February 9, 2026, to approve Q3FY26 unaudited financial results. Trading window closed from January 1 to February 11, 2026, for designated persons.",
            "Sentiment": "neutral",
            "PublishDate": 1769689308776,
            "Source": "co_actions_results"
        },
        {
            "Title": "BSL Limited Reports 16.7% Sequential Revenue Growth to ₹184 Crore in Q2FY26",
            "Summary": "BSL Limited, a textile industry company, reported quarterly revenue of ₹184.3 crore, marking a 16.7% sequential growth and 3.5% year-over-year increase. EBITDA reached ₹13.7 crore, up 8.9% quarter-over-quarter, though margins narrowed to 7.5%. Profit after tax stood at ₹1.7 crore, rising 3.7 times sequentially. For the half-year period, revenue was ₹342.4 crore with EBITDA at ₹26.4 crore and PAT at ₹2.2 crore. The company operates across fabric, furnishing, and yarn segments with integrated manufacturing capabilities. Managing Director Nivedan Churiwal attributed the performance to robust market demand and higher production volumes, while noting temporary input cost pressures. The company expects gradual profitability improvement supported by stable raw material costs and improved capacity utilization.",
            "Sentiment": "positive",
            "PublishDate": 1762960015845,
            "Source": "earnings"
        },
        {
            "Title": "BSL Limited Reports Quarterly Results and Approves 6MW Renewable Energy Investment",
            "Summary": "BSL Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company reported revenue from operations of Rs 15,800.54 lacs for the quarter and Rs 34,234.69 lacs for the half year. The company posted a profit after tax of Rs 172.34 lacs for the quarter and Rs 482.93 lacs for the half year. The Board granted in-principle approval for investment in renewable energy capacity of 6MW for captive power use, requiring an investment of Rs 6 crores to be funded through internal accruals. This investment aims to increase the company's renewable energy generation from the current 20% to 62% of its power consumption. The company currently has 7.54MW solar capacity operating at 100% utilization. The proposed capacity addition is expected to be completed within 3 months. The trading window for company shares will open from November 15, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762945021899,
            "Source": "earnings"
        },
        {
            "Title": "PM Modi to Launch BSNL's Indigenous 4G Network Across 98,000 Sites",
            "Summary": "Prime Minister Narendra Modi will launch BSNL's 'Swadeshi' 4G network on September 27, with the inauguration taking place in Jharsuguda, Odisha. The India-made network will be rolled out across approximately 98,000 sites nationwide, with simultaneous launches across multiple states. Telecom Minister Jyotiraditya Scindia stated that this cloud-based network is future-ready and can seamlessly upgrade to 5G. The launch positions India as the fifth country globally to produce and manufacture telecom equipment, joining Denmark, Sweden, South Korea, and China. Additionally, the PM will unveil India's 100 percent 4G saturation network through digital Bharat Nidhi, connecting 29,000 to 30,000 villages through a mission mode project.",
            "Sentiment": "positive",
            "PublishDate": 1758871819884,
            "Source": "stock"
        },
        {
            "Title": "BSL Limited Reports ₹158 Cr Revenue in Q1 FY26, PAT Surges 64% Quarter-on-Quarter",
            "Summary": "BSL Limited, a textile industry company, reported revenue of ₹158 crore for Q1 FY26, representing a 1.6% quarter-on-quarter growth despite global demand slowdown driven by geopolitical tensions and tariff uncertainty. EBITDA reached ₹13 crore with an 8.0% margin, showing a 1.0% quarterly increase but down 6 basis points in margin. Profit After Tax (PAT) was ₹0.5 crore, marking a significant 64.2% quarter-on-quarter increase with margins at 0.3%. However, year-on-year performance showed revenue declining 3.5% and PAT dropping 79.8% compared to the same quarter last year. The company's segmental revenue breakdown includes fabric at 34%, yarn at 49%, furnishing at 12%, and others at 5%. Managing Director Nivedan Churiwal attributed the PAT improvement to operational efficiencies and improved product mix, while noting challenges from fixed overheads, softer demand, and lower realizations in high-margin export categories. The company expects the India-UK agreement to create new market opportunities and reduce tariff barriers.",
            "Sentiment": "neutral",
            "PublishDate": 1755002276464,
            "Source": "earnings"
        },
        {
            "Title": "BSNL Partners With Nokia, Qualcomm, Cisco, Ericsson For 5G and AI Training Initiative",
            "Summary": "Bharat Sanchar Nigam Ltd. signed partnerships with Ericsson India, Qualcomm Technologies, Cisco Systems, and Nokia Solutions and Networks India to accelerate India's digital transformation. The agreements, signed in presence of Communications Minister Jyotiraditya Scindia, will establish advanced training programs in 5G, AI/ML, networking, and digital technologies at BSNL's Bharat Ratna Bhim Rao Ambedkar Institute of Telecom Training in Jabalpur. The Department of Telecommunications plans to create a Telecom Innovation, Research and Training Centre at the institute to develop telecom-specific R&D talent and support product innovation, prototyping, and telecom entrepreneurship. Ericsson India, Nokia and Qualcomm will establish centres focused on 5G and AI training, while Cisco will use its Networking Academy Program to enhance skills in networking, cybersecurity, and IT infrastructure. Scindia called the initiative a landmark step in building a skilled telecom workforce through collaboration between BSNL and global technology companies.",
            "Sentiment": "positive",
            "PublishDate": 1754911084575,
            "Source": "order&deals"
        },
        {
            "Title": "BSNL Launches Re 1 Freedom Plan With Free SIM and 2GB Daily Data for New Users",
            "Summary": "BSNL announced a special 'Freedom Plan' priced at Re 1 for new users, valid until August 31. The plan offers a free SIM card, 2GB daily data, unlimited voice calls, and 100 SMS per day for 30 days. The offer is part of BSNL's strategy to attract new customers and expand its user base. New users can avail the plan by visiting BSNL customer service centers or authorized third-party retailers. The plan remains valid for 30 days from the purchase date.",
            "Sentiment": "positive",
            "PublishDate": 1754643875357,
            "Source": "stock"
        },
        {
            "Title": "BSNL Launches Re 1 'Freedom Plan' Offering One-Month 4G Service Trial",
            "Summary": "BSNL launched its 'Freedom Plan' offering 4G mobile services for Re 1 with one-month validity to attract more customers. The plan includes unlimited voice calls, 2 GB high-speed data per day, 100 SMS daily, and a free BSNL SIM. BSNL Chairman A Robert J Ravi highlighted that the 4G technology was developed under the 'Atmanirbhar Bharat' mission using indigenous technology. The company is rolling out 1 lakh 4G sites across India using Make-in-India technology. Competitors Jio, Bharti Airtel, and Vodafone Idea offer similar benefits for Rs 349, Rs 379, and Rs 399 respectively, though they provide unlimited 5G and entertainment apps. The launch follows Union telecom minister Jyotiraditya Scindia's directive for BSNL to grow its mobile service business by 50%, enterprise business by 25-30%, and fixed line business by 15-20%.",
            "Sentiment": "positive",
            "PublishDate": 1754066013368,
            "Source": "stock"
        },
        {
            "Title": "Starlink Limited to 20 Lakh Connections in India, Says Telecom Minister",
            "Summary": "Union Minister Pemmasani Chandra Sekhar stated that Elon Musk's Starlink satellite communication service can only provide 20 lakh connections in India with speeds up to 200 Mbps. The minister indicated this capacity limitation would not significantly impact existing telecom services, as satcom services are expected to target rural and remote areas. Starlink's services are projected to have high upfront costs with monthly charges around Rs 3,000. Meanwhile, BSNL has completed its 4G rollout and reported 20-30% revenue increase in the first quarter due to 4G services deployment. The minister confirmed BSNL has no plans for tariff increases, focusing instead on market expansion. Technical issues affecting BSNL have been largely resolved, with 30,000 power stations replaced at a cost of Rs 600-700 crore, resulting in improved network uptime. The government plans to continue using indigenous technologies in BSNL while gradually phasing out 2G and 3G equipment, including Chinese vendor equipment from companies like ZTE.",
            "Sentiment": "neutral",
            "PublishDate": 1753719641578,
            "Source": "stock"
        },
        {
            "Title": "Government Sets Aggressive 50% ARPU Growth Target for BSNL with 20-30% Revenue Boost",
            "Summary": "The government has established ambitious revenue targets for state-run telecom operator BSNL, requiring a 50% increase in average revenue per user (ARPU) and 20-30% growth in enterprise business. Overall revenue growth has been targeted at 20-30%. While no tariff hikes are planned, BSNL has been advised to focus on cost-cutting measures and operating efficiency to ensure topline growth outpaces expense increases. The government is monitoring average revenue per employee as a key performance metric. Union Minister Jyotiraditya M. Scindia chaired a review meeting with BSNL's management, emphasizing a 'Revenue First' mandate across all business units. BSNL is implementing several new initiatives including 4G expansion, IFTV and BiTV services, national Wi-Fi roaming, VPN services for enterprise clients, private network projects, and a spam-free network solution. The company is also planning a phased shutdown of 2G and 3G networks while prioritizing domestic equipment vendors.",
            "Sentiment": "positive",
            "PublishDate": 1753712106564,
            "Source": "stock"
        },
        {
            "Title": "BSL Limited Announces 54th AGM on August 28, 2025 with 8% Dividend Recommendation",
            "Summary": "BSL Limited has announced its 54th Annual General Meeting to be held on August 28, 2025 via video conferencing. The company has recommended a final dividend of 8% (₹0.80 per equity share of ₹10 each) for the financial year 2024-25. For FY2025, the company reported a turnover of ₹667.06 crores compared to ₹666.45 crores in the previous year, with profit after tax declining to ₹8.16 crores from ₹11.23 crores in FY2024. The company has undertaken modernization projects including installation of PNG gas-based stenter and solar power project worth ₹25 crores. Export turnover increased to ₹385.56 crores from ₹378.35 crores in the previous year. The AGM will address ordinary business including adoption of financial statements and appointment of directors, along with special business items including ratification of cost auditor remuneration and approval of material related party transactions.",
            "Sentiment": "neutral",
            "PublishDate": 1753359516026,
            "Source": "corporate_action"
        },
        {
            "Title": "CAG Corrects BSNL Loss Estimates From Reliance Jio Deal After Misinterpretation",
            "Summary": "The Comptroller and Auditor General of India has corrected its estimates regarding losses to BSNL from Reliance Jio Infocomm after acknowledging a misinterpretation of contract clauses. The CAG report in April claimed the government suffered a loss of Rs 1,757.56 crore as BSNL failed to bill Reliance Jio for 10 years since May 2014 under their passive infrastructure sharing agreement. Minister of State for Telecom Pemmasani Chandra Sekhar clarified that BSNL has Master Service Agreements with Reliance Jio for leasing tower infrastructure, and there is no actual revenue loss to BSNL or the government. The CAG estimate was based on misinterpretation of add-on technology clauses, which has been rectified. BSNL has issued revised invoices to Reliance Jio. The government has taken measures including resolving agreement ambiguities, monetizing surplus inventory, issuing revised demands, and advising public sector units to process bills timely and exercise caution in business decisions.",
            "Sentiment": "neutral",
            "PublishDate": 1753285277055,
            "Source": "stock"
        },
        {
            "Title": "BSL Limited Schedules Board Meeting for Quarterly Results on August 12, 2025",
            "Summary": "BSL Limited has scheduled a Board of Directors meeting on August 12, 2025, to consider and approve the un-audited financial results for the quarter ended June 30, 2025. The company also announced that the trading window for insiders will remain closed from July 1 to August 14, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753266468693,
            "Source": "corporate_action"
        }
    ]
}