{
    "Symbol": "BSOFT",
    "ISIN": "INE836A01035",
    "News": [
        {
            "Title": "Birlasoft Q3FY26 Results: Profit Drops 2.5% YoY",
            "Summary": "Birlasoft reported Q3FY26 consolidated net profit of ₹1,198.89 million, down 2.5% YoY. Revenue declined 1.1% to ₹13,475.32 million. Company faced ₹406.88 million exceptional charge from new labour codes.",
            "Sentiment": "negative",
            "PublishDate": 1769596752603,
            "Source": "co_actions_results"
        },
        {
            "Title": "Birlasoft Q3FY26 earnings call set for Jan 28, 2026",
            "Summary": "Birlasoft Limited announces Q3FY26 earnings conference call scheduled for January 28, 2026 at 5:30 PM IST. Company filed regulatory disclosure under SEBI Regulation 30 with BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1768984638785,
            "Source": "co_actions_results"
        },
        {
            "Title": "Birlasoft Faces €11,797.91 Penalty from Belgium",
            "Summary": "Birlasoft Limited receives penalty from Federal Agency for Occupational Risks, Belgium for failing to secure mandatory occupational accident insurance. Company states no material impact on operations.",
            "Sentiment": "negative",
            "PublishDate": 1768302713106,
            "Source": "stocks"
        },
        {
            "Title": "Birlasoft Grants 9.5 Lakh Stock Options Under Employee Incentive Plan",
            "Summary": "Birlasoft's Nomination and Remuneration Committee approved the grant of 9,50,000 performance stock units to eligible employees under the company's Share Incentive Plan-2022. Each option carries the right to be converted into one share, with vesting schedule and exercise period to be determined by the committee in accordance with plan terms.",
            "Sentiment": "positive",
            "PublishDate": 1764931720618,
            "Source": "corporate_action"
        },
        {
            "Title": "Birlasoft Shareholders Approve Re-appointment of Angan Guha as CEO and Managing Director",
            "Summary": "Birlasoft Limited shareholders passed an ordinary resolution through postal ballot to re-appoint Angan Guha (DIN: 09791436) as Chief Executive Officer and Managing Director with 98.06% votes in favor. The remote e-voting process concluded on November 27, 2025, with 1,292 members voting in favor and 360 members voting against the resolution.",
            "Sentiment": "positive",
            "PublishDate": 1764326565421,
            "Source": "corporate_action"
        },
        {
            "Title": "Birlasoft Reports Q2 FY26 Results with Margin Expansion Despite Revenue Challenges",
            "Summary": "Birlasoft delivered marginal quarterly revenue growth of 0.1% to $150.7 million in Q2 FY26, while EBITDA margin expanded significantly from 12.4% to 16% quarter-on-quarter due to operational efficiencies and one-time benefits. The company expects sequential revenue growth in Q3 and Q4 despite challenging macro conditions, with management focusing on building deal pipeline and transitioning away from staff augmentation to outcome-based engagements.",
            "Sentiment": "neutral",
            "PublishDate": 1763046724535,
            "Source": "earnings"
        },
        {
            "Title": "Birlasoft Expects Revenue Growth in Q3 and Q4 FY26",
            "Summary": "Birlasoft expects revenue growth for Q3 and Q4 FY26. The company is aiming for stronger performance in the second half compared to the first half of the fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1762487315495,
            "Source": "stock"
        },
        {
            "Title": "Birlasoft Reports Quarterly Results and Declares Rs 2.50 Interim Dividend",
            "Summary": "Birlasoft Limited announced its unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025. The company's board approved an interim dividend of Rs 2.50 per equity share (125% of face value of Rs 2.00 each) for financial year 2025-26, to be paid within 30 days. The consolidated revenue from operations was Rs 1,327.99 crores for the quarter, with profit for the period at Rs 149.61 crores. For the half-year period, consolidated revenue reached Rs 2,610.12 crores with profit of Rs 275.06 crores. The company operates across multiple industry segments including Banking & Financial Services, Manufacturing, Energy & Utilities, and Life Sciences & Services.",
            "Sentiment": "positive",
            "PublishDate": 1762458921266,
            "Source": "earnings"
        },
        {
            "Title": "Birlasoft Grants Stock Options and Performance Units to Employees Under Two Share Incentive Plans",
            "Summary": "Birlasoft's Nomination and Remuneration Committee approved the grant of employee stock options under two share incentive plans on November 6, 2025. Under the 2019 Share Incentive Plan, the company granted 250,000 Restricted Stock Units (RSUs) with an exercise price of Rs. 370.40. Under the 2022 Share Incentive Plan, it granted 62,500 Performance Stock Units (PSUs) and 87,500 stock options with an exercise price of Rs. 2. Each option, RSU, and PSU carries the right to be converted into one share. The vesting schedule and exercise period will be determined by the NRC according to the respective plan terms.",
            "Sentiment": "neutral",
            "PublishDate": 1762458353896,
            "Source": "corporate_action"
        },
        {
            "Title": "Birlasoft Reports Mixed Q2 Results with Higher Profit and EBITDA Despite Revenue Decline",
            "Summary": "Birlasoft reported quarterly consolidated net profit of 1.16 billion rupees, up from 1.06 billion rupees in the previous quarter. Revenue decreased to 13.3 billion rupees from 13.68 billion rupees quarter-on-quarter. EBITDA increased significantly to 2.13 billion rupees from 1.59 billion rupees, while EBITDA margin improved to 16.05% from 12.36% in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762432574024,
            "Source": "earnings"
        },
        {
            "Title": "Birlasoft Schedules Q2 FY26 Earnings Conference Call for November 6, 2025",
            "Summary": "Birlasoft announced it will hold an earnings conference call on November 6, 2025, at 6:00 PM IST following the release of its Q2 FY26 financial results for the quarter ended September 30, 2025. The call will include management commentary followed by a Q&A session with equity analysts and investors. Birlasoft is part of the CKA Birla Group and operates as a global technology company focused on digital transformation through cloud, AI, data, and enterprise solutions. The company employs nearly 12,000 professionals and is led by Chairman Mrs. Amita Birla. The conference call will be recorded and made available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1761841552366,
            "Source": "earnings"
        },
        {
            "Title": "Birlasoft Seeks Shareholder Approval for CEO Angan Guha's Re-appointment",
            "Summary": "Birlasoft has issued a postal ballot notice seeking shareholder approval for the re-appointment of Angan Guha as Chief Executive Officer and Managing Director for two years starting December 1, 2025. His current term expires on November 30, 2025. The proposed compensation includes basic salary and allowances ranging from ₹3.06 crore to ₹3.52 crore per annum, annual variable pay of ₹1.37 crore at 100% achievement (up to 120% based on performance), and grant of 2,85,000 Performance Stock Units vesting over two years. Performance parameters for variable pay and PSUs are based on revenue and EBITDA margin with minimum 90% and 80% achievement thresholds respectively. Guha will also receive compensation from subsidiary Birlasoft Solutions Inc. including $8,57,500 annual base salary and $3,67,500 performance-based incentive. The e-voting period runs from October 29, 2025 to November 27, 2025. The appointment requires Central Government approval as Guha is not a resident of India.",
            "Sentiment": "neutral",
            "PublishDate": 1761656125741,
            "Source": "corporate_action"
        },
        {
            "Title": "Birlasoft Shares Surge Over 10% on H-1B Visa Clarification Relief",
            "Summary": "Birlasoft shares jumped over 10% on Thursday, October 23, recording the biggest single-day gain since May 2021. The Pune-based IT services company experienced heavy trading with volumes reaching a four-month high of around 70 lakh shares, significantly above the 20-day average of 2.4 lakh. The stock broke above key technical levels, crossing its 50-day moving average at ₹366 and 100-day moving average at ₹391. The surge was attributed to relief from Trump administration's clarification that the $100,000 H-1B visa fee will not apply to F-1 student visa holders, L-1 intra-company transferees, or current H-1B visa holders seeking renewals or extensions. This provides relief to Indian IT firms, as Indians account for about 70% of all new H-1B visa allocations with around 300,000 Indian workers currently in the US on H-1B visas. Despite the rally, Birlasoft stock remains down 32% in 2025 and had fallen 22% in 2024.",
            "Sentiment": "positive",
            "PublishDate": 1761202889952,
            "Source": "stock"
        },
        {
            "Title": "Birlasoft Appoints Komal Jain as CEO for Americas Operations",
            "Summary": "Birlasoft has appointed Komal Jain as the new CEO for its Americas region. Jain was previously employed at Infosys before joining Birlasoft in this leadership role.",
            "Sentiment": "positive",
            "PublishDate": 1759903422840,
            "Source": "corporate_governance"
        },
        {
            "Title": "Birlasoft Achieves AWS DevOps Competency Status",
            "Summary": "Birlasoft has gained AWS DevOps Competency Status, representing recognition of the company's expertise in DevOps practices and solutions on Amazon Web Services platform.",
            "Sentiment": "positive",
            "PublishDate": 1759127928279,
            "Source": "stock"
        },
        {
            "Title": "Birlasoft Re-appoints Angan Guha as CEO & Managing Director for Two Years",
            "Summary": "Birlasoft's Board of Directors approved the re-appointment of Angan Guha as Chief Executive Officer & Managing Director for a two-year term starting December 1, 2025. The decision was made based on the recommendation of the Nomination and Remuneration Committee and is subject to statutory approvals. Guha's current term expires on November 30, 2025. He previously served as CEO for the Americas 2 Strategic Market Unit at Wipro and holds an Electronics Engineering degree from the University of Pune, along with an executive management program completion from the University of Chicago's Booth School of Business.",
            "Sentiment": "positive",
            "PublishDate": 1758954194079,
            "Source": "corporate_governance"
        },
        {
            "Title": "Birlasoft Says H-1B Visa Regulatory Changes Won't Significantly Impact Operations",
            "Summary": "Birlasoft Limited addressed recent U.S. regulatory changes to H-1B visa applications, stating the company does not anticipate any immediate significant impact on operations or customer service capabilities. The company referenced a recent U.S. Executive Order and subsequent memorandum from US Citizenship and Immigration Services. Birlasoft emphasized that delivering exceptional customer service remains their top priority and they are committed to ensuring service continuity. The company is strengthening global delivery capabilities and talent sourcing processes to enhance operational resilience and mitigate risks, while continuing to monitor developments for future updates.",
            "Sentiment": "neutral",
            "PublishDate": 1758598877985,
            "Source": "stock"
        },
        {
            "Title": "Birlasoft Reports 1% Sequential Revenue Decline in Q1 FY26, Faces Manufacturing Vertical Headwinds",
            "Summary": "Birlasoft Limited reported quarterly revenue of $150.7 million, down 1% sequentially in dollar terms. Three of four verticals showed growth - BFSI, Life Sciences & Services, and Energy & Utilities - while Manufacturing vertical declined 4% due to project completions, ramp downs, and insourcing. EBITDA margin came in at 12.4% for the quarter. The company secured $141 million in total contract value (TCV) deal wins, with over half comprising new deals. Management expects sequential growth in Q2 but anticipates challenging market conditions to continue affecting performance throughout the year. Effective tax rate increased to 35.9% from historical levels of 25-26% due to provisions for higher tax. Cash and cash equivalents stood at $266.6 million, up 16% year-on-year. CFO Kamini Shah announced her departure for personal reasons, with Chandrasekar Thyagarajan taking over as CFO. The company won marquee deals in emerging areas including GenAI and Agentic AI solutions.",
            "Sentiment": "negative",
            "PublishDate": 1755163302061,
            "Source": "earnings"
        },
        {
            "Title": "Birlasoft Reports Q1 FY2026 Results; CFO Transition Announced",
            "Summary": "Birlasoft Limited published its unaudited consolidated financial results for the quarter ended June 30, 2025. The company reported consolidated sales of ₹12,848.98 million, with net profit after tax of ₹1,661.73 million. Basic earnings per share stood at ₹3.81. On a standalone basis, revenue was ₹6,265.51 million with net profit of ₹367.01 million. The company announced a leadership change with Kamini Shah resigning as Chief Financial Officer effective August 7, 2025, and Chandrasekar Thyagarajan being appointed as the new CFO effective August 8, 2025. The Board of Directors approved these results at their meeting held on August 7, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754649968022,
            "Source": "earnings"
        },
        {
            "Title": "Birlasoft Expects Elevated Tax Rates Through FY26, Wins AI Deals",
            "Summary": "Birlasoft expects elevated tax rates of around 35.9% to continue through FY26 before returning to historical levels. The company does not provide formal guidance as a policy. Some business losses were attributed to clients insourcing work rather than competitive displacement. The company is not planning layoffs but is focused on having the right roles in the right geographies. Birlasoft secured deals involving generative AI use cases, including a partnership with a U.S. energy company for AI implementation in supply chain automation. EBITDA margins are expected to remain around current levels with potential improvement as revenue growth returns.",
            "Sentiment": "neutral",
            "PublishDate": 1754624796763,
            "Source": "stock"
        },
        {
            "Title": "Birlasoft Plans Major Investment in AI and Automation Technologies",
            "Summary": "Birlasoft announced plans for significant investment in generative AI, agentic automation, and ERP transformation initiatives. The company is positioning these investments to support recovery efforts during a manufacturing sector slowdown. Birlasoft reported having a strong deal pipeline and record cash levels to support these strategic investments.",
            "Sentiment": "positive",
            "PublishDate": 1754571495544,
            "Source": "stock"
        },
        {
            "Title": "Birlasoft Reports 29% Drop in Net Profit as Manufacturing Segment Weakens",
            "Summary": "Birlasoft reported a consolidated net profit of ₹106.4 crore, down 29.2% year-on-year from ₹150.2 crore. Revenue from operations declined 3.2% to ₹1,284.8 crore from ₹1,327.4 crore. Operating profit dropped 21% to ₹138 crore with EBIT margin contracting to 10.7% from 13.7%. The Manufacturing segment, Birlasoft's largest vertical, declined due to project closures and ramp-downs, while Energy & Utilities, Life Sciences & Services, and BFSI posted growth. Digital & Data services grew 2.6% quarter-on-quarter. Total contract value of deals signed was $141 million, comprising $76 million from new deals and $65 million from renewals. Active client count stood at 247 compared to 254 in the previous quarter. Cash and cash equivalents increased 19.4% year-on-year to ₹2,286.4 crore. CEO Angan Guha noted that three of four verticals delivered sequential growth but Manufacturing remained soft in a challenging demand environment.",
            "Sentiment": "negative",
            "PublishDate": 1754565000371,
            "Source": "earnings"
        },
        {
            "Title": "Birlasoft Reports Decline in Quarterly Financial Performance",
            "Summary": "Birlasoft reported quarterly consolidated net profit of 1.06 billion rupees, down from 1.2 billion rupees in the previous quarter. The company's EBIT decreased to 1.54 billion rupees from 1.7 billion rupees quarter-over-quarter, with EBIT margin falling to 11.97% from 12.76%. Revenue also declined to 13 billion rupees compared to 13.2 billion rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754560786231,
            "Source": "earnings"
        },
        {
            "Title": "Birlasoft Announces CFO Transition with Kamini Shah's Departure and Chandrasekar Thyagarajan's Appointment",
            "Summary": "Birlasoft has announced a change in its Chief Financial Officer position. Kamini Shah will step down from her role as CFO on August 7, 2025. Chandrasekar Thyagarajan has been appointed as CFO Designate and will take over the position following Shah's departure.",
            "Sentiment": "neutral",
            "PublishDate": 1753269277868,
            "Source": "corporate_governance"
        },
        {
            "Title": "Birlasoft Ltd: Shares Tumble 6% Post Weak Q4 Results",
            "Summary": "Birlasoft shares dropped 6.4% over two days after Q4 earnings miss. Revenue declined 3.36% QoQ to Rs 1,316.89 crore. Nuvama cut target price to Rs 350, maintaining 'reduce' rating. Management expects muted Q1 FY26 with growth pickup from Q2. EBITDA margin improved to 13.2% despite revenue decline.",
            "Sentiment": "negative",
            "PublishDate": 1748586353000,
            "Source": "earnings"
        },
        {
            "Title": "Birlasoft Ltd: Macquarie Downgrades Stock, Slashes Price Target by 45%",
            "Summary": "Macquarie downgraded Birlasoft Ltd. to 'underperform' from 'outperform', cutting its price target to ₹350 from ₹640. The brokerage cited continued revenue decline, margin pressure, and reduced growth expectations. Macquarie lowered EPS estimates for FY2026 and FY2027 by 30% and 28% respectively.",
            "Sentiment": "negative",
            "PublishDate": 1748580188000,
            "Source": "normal_news"
        },
        {
            "Title": "Birlasoft Ltd: Q4 Profit Up 4.3%, Revenue Down 3.4%",
            "Summary": "Birlasoft's Q4 net profit rose 4.3% YoY to ₹122 crore, while revenue declined 3.4% to ₹1,317 crore. EBITDA fell 21.7% to ₹173.5 crore, with margins narrowing. The board recommended a ₹4 per share dividend for FY25. The company appointed a new Secretarial Auditor and redesignated an executive as CEO-ROW.",
            "Sentiment": "neutral",
            "PublishDate": 1748451903000,
            "Source": "earnings"
        },
        {
            "Title": "Birlasoft Reports Q4 Results and Recommends Dividend",
            "Summary": "Birlasoft has announced its Q4 financial results and dividend recommendation. The company's Q4 consolidated net profit increased to 1.2 billion rupees from 1.17 billion rupees in the previous quarter. EBIT rose to 1.5 billion rupees from 1.42 billion rupees, with the EBIT margin improving to 11.53% from 10.43%. However, revenue decreased to 13.2 billion rupees from 13.63 billion rupees quarter-on-quarter. The company has recommended a dividend of 4 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1748446618000,
            "Source": "result"
        },
        {
            "Title": "Birlasoft Achieves Oracle Cloud Solutions Provider Expertise",
            "Summary": "Birlasoft has attained the status of Oracle Cloud Solutions Provider, demonstrating their expertise in Oracle cloud technologies. This achievement likely enhances Birlasoft's capabilities and credibility in providing Oracle-based cloud solutions to clients.",
            "Sentiment": "positive",
            "PublishDate": 1745911093000,
            "Source": "default"
        },
        {
            "Title": "Birlasoft Recognized by ISG for Innovative Digital Solutions",
            "Summary": "Birlasoft, an IT services company, has been acknowledged by Information Services Group (ISG) for its innovative digital solutions. This recognition highlights Birlasoft's capabilities in delivering cutting-edge technology solutions to its clients.",
            "Sentiment": "positive",
            "PublishDate": 1742797233000,
            "Source": "corporate_action"
        },
        {
            "Title": "Birlasoft: Stock Hits 52-Week Low Post Q3 Results",
            "Summary": "Birlasoft's share price dropped 6.4% to ₹472.40, a 52-week low, following Q3 results announcement. The stock later recovered slightly, trading at ₹495.90, down 1.74%.",
            "Sentiment": "negative",
            "PublishDate": 1739348682000,
            "Source": "result"
        },
        {
            "Title": "Birlasoft Ltd.: Analysts Cut Target Price After Weak Q3 Results",
            "Summary": "Birlasoft shares fell after Q3 results indicated sluggish outlook. Macquarie and Nomura reduced target prices due to concerns about revenue growth and margin recovery. Q4 revenue growth expected to be muted. Layoffs continued in January 2025. BFSI sector shows some positive signs, but healthcare and manufacturing face challenges.",
            "Sentiment": "negative",
            "PublishDate": 1739340637000,
            "Source": "earnings"
        },
        {
            "Title": "Birlasoft: Q3 Revenue Up, Profit Down Amid Weak Demand",
            "Summary": "Birlasoft's Q3 FY 2024-25 revenue increased 1.5% YoY to ₹13,627 crore, but net profit fell 27.4% to ₹1,169 crore. EBITDA declined 23.7% YoY with margins contracting to 12%. TCV of deals rose 4% YoY to $226 million. BFSI segment and digital & data services showed growth. Active client count increased to 265, with 27 $5 million-plus clients.",
            "Sentiment": "neutral",
            "PublishDate": 1739278204000,
            "Source": "earnings"
        },
        {
            "Title": "Birlasoft Reports Q3 FY2024 Financial Results",
            "Summary": "Birlasoft, an IT services company, has announced its financial results for the third quarter. The company's EBIT (Earnings Before Interest and Taxes) stood at 1.42 billion rupees, slightly lower than the previous quarter's 1.43 billion rupees. The EBIT margin for Q3 was 10.43%, marginally down from 10.46% in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1739271369000,
            "Source": "earnings"
        },
        {
            "Title": "Birlasoft Reports Q3 Financial Results",
            "Summary": "Birlasoft, an IT services company, has announced its financial results for the third quarter. The company reported a consolidated net profit of 1.2 billion rupees, slightly down from 1.3 billion rupees in the previous quarter. Revenue for Q3 stood at 13.63 billion rupees, marginally lower than the 13.7 billion rupees reported in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1739271363000,
            "Source": "earnings"
        },
        {
            "Title": "Birlasoft Achieves CMMI V3.0 Level 5 Certification",
            "Summary": "Birlasoft, an IT services and consulting company, has successfully attained the Capability Maturity Model Integration (CMMI) V3.0 Level 5 certification. This certification is a globally recognized standard for measuring an organization's capability to deliver high-quality software products and services. Achieving Level 5, the highest level in the CMMI model, demonstrates Birlasoft's commitment to continuous improvement and excellence in software development processes.",
            "Sentiment": "positive",
            "PublishDate": 1736747429000,
            "Source": "corporate_action"
        },
        {
            "Title": "Birlasoft Ltd: CEO for Americas Resigns, Effective February 2025",
            "Summary": "Roopinder Singh, Chief Executive Officer for the Americas at Birlasoft Ltd, has resigned citing personal reasons. His last day will be February 7, 2025. The company recently reported a 3.1% QoQ revenue increase to ₹1,368.2 crore in Q2 FY25, with manufacturing being the largest revenue contributor at 41.2%.",
            "Sentiment": "neutral",
            "PublishDate": 1736256506000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Birlasoft Joins UK Government's G-Cloud 14 Framework",
            "Summary": "Birlasoft has been accepted into the UK Government's G-Cloud 14 Framework, positioning itself to contribute to digital transformation efforts in the public sector. This framework allows UK public sector organizations to easily procure cloud-based services from approved suppliers, potentially expanding Birlasoft's opportunities in the UK market.",
            "Sentiment": "positive",
            "PublishDate": 1736229143000,
            "Source": "corporate_action"
        },
        {
            "Title": "Birlasoft: Share Price Up 0.41% Amid Mixed Peer Performance",
            "Summary": "Birlasoft shares are trading at ₹593.2, up 0.41% from the previous close. The stock has hit a high of ₹594.8 and a low of ₹588 during the day. Trading volume is 68.22% lower than the previous session. Mutual fund holding increased to 22.54% in September quarter, while FII holding decreased to 11.71%.",
            "Sentiment": "neutral",
            "PublishDate": 1732859017000,
            "Source": "normal_news"
        },
        {
            "Title": "Birlasoft: Share Price Declines Amid Market Downturn",
            "Summary": "Birlasoft shares are down 1.18% to ₹593.35 as of 28 Nov 2024, 11:29 AM. The stock has ranged between ₹590.7 and ₹602.7 today. Trading volume is 69.57% lower than the previous session. The company has a ROE of 22.71% and ROA of 17.54%. Mutual fund holdings increased to 22.54% in September quarter, while FII holdings decreased to 11.71%.",
            "Sentiment": "neutral",
            "PublishDate": 1732773545000,
            "Source": "normal_news"
        },
        {
            "Title": "Birlasoft: Share Price Up 0.96% Amid Market Fluctuations",
            "Summary": "Birlasoft shares are trading at ₹598.15, up 0.96% from the previous close. The stock hit a high of ₹604.05 and a low of ₹594. Trading volume is 9.70% higher than the previous session. Technical analysis suggests a potential trend reversal after a downtrend. The company has a ROE of 22.71% and ROA of 17.54%. Mutual fund holding increased to 22.54% in September quarter, while FII holding decreased to 11.71%.",
            "Sentiment": "neutral",
            "PublishDate": 1732686078000,
            "Source": "normal_news"
        },
        {
            "Title": "Birlasoft: Shares Surge 3.12% Amid Market Decline",
            "Summary": "Birlasoft shares are trading at ₹587.15, up 3.12% from the previous close, outperforming the broader market. The stock has hit a high of ₹587.5 and a low of ₹570.15. Trading volume is 9.70% higher than the previous session, indicating potential trend reversal after a downtrend. Mutual fund holding increased to 22.54% in September quarter, while FII holding decreased to 11.71%.",
            "Sentiment": "positive",
            "PublishDate": 1732599011000,
            "Source": "normal_news"
        },
        {
            "Title": "Birlasoft: Share Price Up 1.21% Amid Market Rally",
            "Summary": "Birlasoft shares are trading at ₹568.45, up 1.21% from the previous close. The stock has hit a high of ₹572.75 and a low of ₹565.25. Trading volume is 69.71% lower than the previous session. The company has a ROE of 22.71% and ROA of 17.54%. Mutual fund holding increased to 22.54% in September quarter, while FII holding decreased to 11.71%.",
            "Sentiment": "positive",
            "PublishDate": 1732512742000,
            "Source": "normal_news"
        },
        {
            "Title": "Birlasoft: Share Price Rises 1.52% Amid Mixed Peer Performance",
            "Summary": "Birlasoft shares are trading at ₹553.7, up 1.52% from the previous close. The stock hit a high of ₹563.15 and a low of ₹545.95. Trading volume is 71.33% higher than the previous session. Mutual fund holdings increased to 22.54% in September, while FII holdings decreased to 11.71%.",
            "Sentiment": "neutral",
            "PublishDate": 1732257087000,
            "Source": "normal_news"
        },
        {
            "Title": "Birlasoft: Stock Plunges Amid Market Downturn",
            "Summary": "Birlasoft shares are down 2.84% to ₹541.4 as of 12:00 PM on November 4, 2024. The stock has hit a high of ₹558.15 and a low of ₹536.25. Trading volume is 35.65% lower than the previous session. The stock is trading below short-term and long-term moving averages, indicating a strong downtrend.",
            "Sentiment": "negative",
            "PublishDate": 1730699624000,
            "Source": "normal_news"
        },
        {
            "Title": "Birlasoft: CFO Projects 16% Margins in 3-4 Quarters",
            "Summary": "Birlasoft's CFO Kamini Shah expects Ebitda margins to return to 15-16% levels in 3-4 quarters. Q2 FY2024-25 margins were 12.1%, down from 15.8% year-ago. Improvement strategies include shifting to offshore work, increasing utilization, and reducing administrative expenses. Q3 growth will be impacted by employee pay hikes starting October 1.",
            "Sentiment": "neutral",
            "PublishDate": 1729825237000,
            "Source": "result"
        },
        {
            "Title": "Birlasoft: Q3 Margins Expected to Dip Due to Seasonal Factors",
            "Summary": "Birlasoft anticipates a decline in margins for the third quarter due to seasonal impacts. The company has disclosed this expectation, indicating potential challenges in their upcoming financial results.",
            "Sentiment": "negative",
            "PublishDate": 1729759761000,
            "Source": "normal_news"
        },
        {
            "Title": "Birlasoft: Share Price Drops 3.72% Amid Market Decline",
            "Summary": "Birlasoft shares are trading at ₹578.5, down 3.72% from the previous close. The stock has hit a high of ₹588.8 and a low of ₹556.65. Trading volume is 202.68% higher than the previous session. Technical analysis indicates a strong downtrend. The company has a ROE of 22.71% and a P/E of 26.54. FII holding has decreased from 18.82% to 11.71% in the September quarter.",
            "Sentiment": "negative",
            "PublishDate": 1729748584000,
            "Source": "normal_news"
        },
        {
            "Title": "Birlasoft: Q2 Results Show Long-Term Growth Potential",
            "Summary": "Birlasoft's Q2 results have been reviewed by IDBI Capital, suggesting that the company's long-term growth story remains intact. The full analysis is available to NDTV Profit subscribers.",
            "Sentiment": "positive",
            "PublishDate": 1729742810000,
            "Source": "result"
        },
        {
            "Title": "Birlasoft Approves Interim Dividend",
            "Summary": "Birlasoft's board of directors has approved an interim dividend of Rs. 2.5 per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1729688709000,
            "Source": "corporate_action"
        }
    ]
}