{
    "Symbol": "BTML",
    "ISIN": "INE0EEJ01023",
    "News": [
        {
            "Title": "Bodhi Tree Multimedia confirms no deviation in rights issue proceeds",
            "Summary": "Bodhi Tree Multimedia Limited filed a regulatory disclosure confirming no deviations or variations in the use of proceeds raised from its rights issue under SEBI LODR Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770903156020,
            "Source": "stocks"
        },
        {
            "Title": "Bodhi Tree Multimedia Reports Q3 FY26 Results",
            "Summary": "Bodhi Tree Multimedia announced Q3 FY26 financial results with standalone net profit of ₹61.76 lakhs and consolidated net profit of ₹234.52 lakhs for quarter ended December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1770881908867,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bodhi Tree Multimedia acquires 50.01% stake in Moving Image",
            "Summary": "Bodhi Tree Multimedia Limited announced acquisition of 50.01% equity stake in Moving Image Studios Private Limited for ₹7.00 crores through cash consideration, gaining controlling interest in the media company.",
            "Sentiment": "positive",
            "PublishDate": 1767167629205,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bodhi Tree Multimedia Approves EGM Notice Corrigendum",
            "Summary": "Bodhi Tree Multimedia's board approved corrigendum to EGM notice for ₹1.20 crore preferential issue to acquire 20% stake in Lehren Networks. Meeting scheduled December 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766576953550,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bodhi Tree Multimedia Launches AI-Powered CastMatch",
            "Summary": "Bodhi Tree Multimedia unveils CastMatch, India's first conversational AI casting platform that reduces casting time from hours to 60 seconds with 98% efficiency improvement.",
            "Sentiment": "positive",
            "PublishDate": 1765437439656,
            "Source": "stocks"
        },
        {
            "Title": "Bodhi Tree Multimedia Reports 65% Revenue Growth in Q2FY26, Pivots from Production to IP Ownership Model",
            "Summary": "Bodhi Tree Multimedia achieved total income of INR 24.4 crores in Q2FY26 versus INR 14.82 crores in Q2FY25, with net profit rising 36% to INR 3.05 crores, while transitioning from commissioned content production to IP creation and ownership through multiple creator-led studio acquisitions. The company targets INR 250 crores topline with INR 25 crores PAT over three years, aiming for a 50-50 revenue mix between IP and services versus the current 80-20 commissioned work dominance.",
            "Sentiment": "positive",
            "PublishDate": 1764583518153,
            "Source": "earnings"
        },
        {
            "Title": "Bodhi Tree Multimedia Acquires 20% Stake in Lehren Networks Through Share Swap Deal",
            "Summary": "Bodhi Tree Multimedia's board approved acquiring 20% equity stake in entertainment media company Lehren Networks Private Limited for Rs. 1.2 crore through a share swap arrangement. The company will issue up to 12 lakh equity shares at Rs. 10 per share to Lehren's shareholders and has scheduled an Extraordinary General Meeting for December 30, 2025 to seek shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1764251672280,
            "Source": "order&deals"
        },
        {
            "Title": "Bodhi Tree Multimedia Signs MOU with Moving Images Studios for Content Collaboration",
            "Summary": "Bodhi Tree Multimedia has entered into a non-binding memorandum of understanding with Moving Images Studios to explore potential collaboration opportunities. The partnership aims to focus on content creation and digital media development between the two companies.",
            "Sentiment": "positive",
            "PublishDate": 1764226060802,
            "Source": "order&deals"
        },
        {
            "Title": "Bodhitree Multimedia Schedules Q2 H1 FY26 Earnings Conference Call",
            "Summary": "Bodhitree Multimedia Limited has scheduled an earnings conference call on November 24, 2025, at 4:00 PM to discuss its performance for the half year ended September 30, 2025. The call will be hosted by the company's Investor Relations Advisor, Kirin Advisors, with participation from the Managing Director and other management members.",
            "Sentiment": "neutral",
            "PublishDate": 1763471789695,
            "Source": "corporate_action"
        },
        {
            "Title": "BodhiTree Multimedia Reports 185% Net Profit Growth in H1 FY26",
            "Summary": "BodhiTree Multimedia Limited announced strong financial results for Q2 and H1 FY26, with net profit growing 185% year-over-year in the first half and revenue increasing 64.63% in Q2 FY26 to ₹24.40 crores. The content production company strengthened its industry position through a collaboration with AKCH (Amit Khan Content Hub) and continues expanding its portfolio across TV and OTT platforms with over 100 shows produced since inception.",
            "Sentiment": "positive",
            "PublishDate": 1763359610230,
            "Source": "earnings"
        },
        {
            "Title": "Bodhi Tree Multimedia Reports Q2 FY2026 Results, Adds Two New Subsidiaries",
            "Summary": "Bodhi Tree Multimedia Limited approved its unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025, following audit committee review. The company expanded its subsidiary portfolio by acquiring Bodhi Media Network Private Limited and MadLab Alpha Private Limited during the period.",
            "Sentiment": "neutral",
            "PublishDate": 1763106931937,
            "Source": "earnings"
        },
        {
            "Title": "Bodhi Tree Partners With Amit Khan For New OTT And TV Projects",
            "Summary": "Bodhi Tree has entered into a partnership with Amit Khan to develop new OTT and television projects. The collaboration aims to create content for streaming platforms and traditional television channels.",
            "Sentiment": "positive",
            "PublishDate": 1759129475357,
            "Source": "stock"
        },
        {
            "Title": "Mautik Ajit Tolia Releases Pledge on Bodhi Tree Multimedia Shares",
            "Summary": "Mautik Ajit Tolia has released pledges on equity shares of Bodhi Tree Multimedia Limited. Two separate pledge releases occurred - the first on July 25, 2025, involving 9.68 million shares (5.36% of total share capital), and the second on August 26, 2025, involving another 9.68 million shares (5.36% of total share capital). Both pledges were with Parijata Trading Pvt Ltd. The pledged shares were originally used as collateral for loans infused into the company for working capital and expansion purposes. Following these releases, Tolia's post-event encumbered shareholding reduced from 19.02% to 13.66% of total share capital. Tolia holds 44.01 million shares, representing 24.38% of Bodhi Tree Multimedia's total share capital.",
            "Sentiment": "positive",
            "PublishDate": 1758697974871,
            "Source": "corporate_action"
        },
        {
            "Title": "Bodhi Tree Multimedia Approves Re-appointment of Mrs. Nutan Jha as Independent Director",
            "Summary": "Bodhi Tree Multimedia Limited's Board of Directors approved the re-appointment of Mrs. Nutan Jha as Non-Executive Independent Director for a second term of five years, from August 23, 2025 to August 22, 2030. The re-appointment is subject to shareholder approval at the upcoming General Meeting. Mrs. Jha, born September 29, 1965, holds DIN 08848553 and is not related to any other directors of the company. She holds no shares in the company and is not debarred from holding directorial positions by any regulatory authority.",
            "Sentiment": "neutral",
            "PublishDate": 1755933858966,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bodhi Tree Multimedia Reports Quarterly Profit of Rs 24.33 Lakhs in Standalone Results",
            "Summary": "Bodhi Tree Multimedia Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs 777.32 lakhs compared to Rs 1,529.81 lakhs in the same quarter last year. Standalone net profit was Rs 24.33 lakhs versus a loss of Rs 34.41 lakhs in the previous year quarter. On a consolidated basis, revenue from operations reached Rs 1,822.30 lakhs compared to Rs 1,801.21 lakhs in the corresponding quarter. Consolidated net profit attributable to owners was Rs 96.41 lakhs against a loss of Rs 97.11 lakhs in the same quarter last year. The company's paid-up equity share capital increased to Rs 1,804.98 lakhs from Rs 1,249.60 lakhs. Basic earnings per share on standalone basis was Rs 0.01 and on consolidated basis was Rs 0.06. The company operates in content production for television and internet-based programs.",
            "Sentiment": "positive",
            "PublishDate": 1755191283501,
            "Source": "earnings"
        },
        {
            "Title": "Bodhitree Multimedia Signs ₹500 Crore MOU with Assam Government for Global Media Hub",
            "Summary": "Bodhitree Multimedia has entered into a Memorandum of Understanding (MOU) worth ₹500 crore with the Government of Assam. The agreement aims to establish a Global Media Hub in Guwahati, potentially boosting the media industry in the region and creating new opportunities for content creation and distribution.",
            "Sentiment": "positive",
            "PublishDate": 1744114045000,
            "Source": "corporate_action"
        }
    ]
}