{
    "Symbol": "BUTTERFLY",
    "ISIN": "INE295F01017",
    "News": [
        {
            "Title": "Butterfly Gandhimathi Q3 Net Profit Rises 30% YoY",
            "Summary": "Butterfly Gandhimathi Appliances reports Q3 net profit of ₹108 million, up from ₹83 million year-on-year, while revenue grows to ₹2.45 billion from ₹2.40 billion in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1770211869267,
            "Source": "co_actions_results"
        },
        {
            "Title": "Butterfly Gandhimathi Gets CRISIL Rating Reaffirmation",
            "Summary": "CRISIL reaffirmed Butterfly Gandhimathi Appliances' credit ratings at CRISIL AA/Stable for long-term and CRISIL A1+ for short-term bank facilities of Rs. 100 crore each on January 27, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769523559302,
            "Source": "stocks"
        },
        {
            "Title": "Butterfly Gandhimathi Director Resigns from Board",
            "Summary": "Shantanu Khosla resigns as Non-Executive Director of Butterfly Gandhimathi Appliances effective December 31, 2025, following end of tenure at holding company Crompton Greaves Consumer Electricals.",
            "Sentiment": "neutral",
            "PublishDate": 1767613211940,
            "Source": "stocks"
        },
        {
            "Title": "Butterfly Gandhimathi Gets GST Demand of ₹9.21 Lakh",
            "Summary": "Butterfly Gandhimathi Appliances receives GST demand order of ₹9.21 lakh from Vijayawada authorities for FY22. Company plans to appeal the order expecting favorable outcome.",
            "Sentiment": "negative",
            "PublishDate": 1767186987844,
            "Source": "stocks"
        },
        {
            "Title": "Butterfly Gandhimathi Reconstitutes CSR Committee",
            "Summary": "Butterfly Gandhimathi Appliances reconstitutes Corporate Social Responsibility Committee effective January 1, 2026, appointing Mr. Kaleeswaran Arunachalam as new Chairperson alongside existing independent directors.",
            "Sentiment": "neutral",
            "PublishDate": 1766473728455,
            "Source": "stocks"
        },
        {
            "Title": "Butterfly Gandhimathi Gets AED 25,000 Court Order",
            "Summary": "Civil Court in Abu Dhabi awards AED 25,000 compensation against Butterfly Gandhimathi Appliances following consumer injury allegation. Company states no material financial impact expected.",
            "Sentiment": "negative",
            "PublishDate": 1765546729958,
            "Source": "stocks"
        },
        {
            "Title": "Shantanu Khosla Resigns from Butterfly Gandhimathi Appliances Board",
            "Summary": "Mr. Shantanu Khosla, Non-Executive Non-Independent Director of Butterfly Gandhimathi Appliances Limited, has resigned from the company's Board effective December 31, 2025, following the end of his tenure on Crompton Greaves Consumer Electricals Limited's Board. His resignation will also result in cessation of his roles as Member of the Risk Management Committee and Chairperson of the Corporate Social Responsibility Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1765278250842,
            "Source": "corporate_governance"
        },
        {
            "Title": "Butterfly Gandhimathi Appliances Reports Strong Q2 Growth with 34% Jump in Net Profit",
            "Summary": "Butterfly Gandhimathi Appliances delivered robust quarterly performance with net profit rising to 169.9 million rupees from 126.7 million rupees year-over-year. Revenue increased to 2.93 billion rupees compared to 2.58 billion rupees in the same period last year. EBITDA grew to 278 million rupees from 230 million rupees, while EBITDA margin improved to 9.49% from 8.92% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762260371634,
            "Source": "earnings"
        },
        {
            "Title": "Butterfly Gandhimathi Appliances Settles Consumer Dispute for Rs. 5,000",
            "Summary": "Butterfly Gandhimathi Appliances Limited has settled a consumer dispute case with the District Consumer Disputes Redressal Commission in Ernakulam. The case involved alleged failure or malfunctioning of the company's Butterfly Rapid 4 Jar Mixer Grinder product. The settlement resulted in case closure with a financial impact of Rs. 5,000 on the company. The company stated there is no material impact on its financials, operations, or other activities. The order was passed on July 26, 2025, and received by the company on October 14, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760508453975,
            "Source": "stock"
        },
        {
            "Title": "Butterfly Gandhimathi Appliances Reports 3% Revenue Growth with Strong EBITDA Margin Expansion",
            "Summary": "Butterfly Gandhimathi Appliances Ltd. reported quarterly results with revenue of Rs. 187 crore, representing 3% year-over-year growth despite challenging market conditions. The company achieved significant profitability improvements with EBITDA growing 39% year-over-year to Rs. 13 crore, while EBITDA margin expanded by 170 basis points to 6.8%. EBIT more than doubled with 144% year-over-year growth to Rs. 7 crore, and PAT increased 155% to Rs. 6 crore. The company experienced strong growth in mixer grinders and pressure cookers, gained market share in core categories, and introduced a refreshed brand positioning called 'Celebrating Change' along with the 'Idea First Series' featuring over 40 new products. Material margin improved to 41.0% from 37.8% in the previous year. Management highlighted their commitment to innovation and portfolio premiumization amid subdued consumer demand.",
            "Sentiment": "positive",
            "PublishDate": 1754309341880,
            "Source": "earnings"
        },
        {
            "Title": "Butterfly Gandhimathi Appoints Kaushik Moorthy as National Sales Head",
            "Summary": "Butterfly Gandhimathi has named Kaushik Moorthy as its new National Sales Head. Moorthy brings significant experience from his previous roles at major consumer goods companies, including Britannia, Mondelez, Heinz, and PepsiCo.",
            "Sentiment": "positive",
            "PublishDate": 1751560788000,
            "Source": "default"
        },
        {
            "Title": "Butterfly Gandhimathi Appliances Reports Q4 Profit",
            "Summary": "Butterfly Gandhimathi Appliances has reported a net profit of 90 million rupees in Q4, compared to a loss of 198 million rupees in the same quarter last year. The company's revenue increased to 1.87 billion rupees from 1.66 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747181876000,
            "Source": "default"
        },
        {
            "Title": "Butterfly Gandhimathi Appliances Reports Significant Q4 Turnaround",
            "Summary": "Butterfly Gandhimathi Appliances has reported a remarkable turnaround in its Q4 financial results. The company's EBITDA showed a gain of 161 million rupees, compared to a loss of 198 million rupees in the same quarter last year. The EBITDA margin stood at 8.63%. The company also reported a net profit of 90 million rupees, a significant improvement from the loss of 198 million rupees in the previous year. Quarterly revenue increased to 1.87 billion rupees from 1.66 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747141506000,
            "Source": "result"
        },
        {
            "Title": "Butterfly Gandhimathi Appliances Reports Profit in Q3 FY2024",
            "Summary": "Butterfly Gandhimathi Appliances has reported a net profit of 83 million rupees in the third quarter, compared to a loss of 21.6 million rupees in the same quarter last year. The company's revenue remained stable at 2.4 billion rupees year-over-year. Sequentially, the net profit increased from 127 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739233314000,
            "Source": "earnings"
        },
        {
            "Title": "Butterfly Gandhimathi Appliances Reports Significant Q3 EBITDA Growth",
            "Summary": "Butterfly Gandhimathi Appliances has reported a substantial increase in its Q3 EBITDA, rising to 171 million rupees from 23.5 million rupees year-over-year. The company's EBITDA margin also saw a significant improvement, increasing to 7.18% from 0.99% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739194971000,
            "Source": "earnings"
        },
        {
            "Title": "Butterfly Gandhimathi Appliances Reports Q3 Profit",
            "Summary": "Butterfly Gandhimathi Appliances has reported a net profit of 83 million rupees in Q3, compared to a loss of 21.6 million rupees in the same quarter last year. This represents a significant turnaround for the company. Sequentially, the profit has decreased from 127 million rupees in the previous quarter. The company's revenue for Q3 remained stable at 2.4 billion rupees, unchanged from the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739194924000,
            "Source": "earnings"
        },
        {
            "Title": "Butterfly Gandhimathi Appliances Reports Q2 Financial Results",
            "Summary": "Butterfly Gandhimathi Appliances has reported its Q2 financial results. The company's net profit for the quarter is 127 million rupees, down from 146 million rupees year-over-year, but up from 25 million rupees quarter-over-quarter. Revenue for Q2 stands at 2.58 billion rupees, a decrease from 3.07 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731336239000,
            "Source": "result"
        }
    ]
}