{
    "Symbol": "BVCL",
    "ISIN": "INE139I01011",
    "News": [
        {
            "Title": "Barak Valley Cements Shareholders Approve Capital Increase",
            "Summary": "Barak Valley Cements Limited shareholders approved an ordinary resolution to increase authorized share capital through postal ballot with 99.997% votes in favor. The resolution was passed on February 07, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770722511039,
            "Source": "co_actions_results"
        },
        {
            "Title": "Barak Valley Cements Board Meet on Feb 9, 2026",
            "Summary": "Barak Valley Cements Limited has scheduled a board meeting on February 09, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770140644531,
            "Source": "co_actions_results"
        },
        {
            "Title": "Barak Valley Cements Issues Postal Ballot for Capital Hike",
            "Summary": "Barak Valley Cements Limited issued postal ballot notice for increasing authorized share capital from ₹25 crores to ₹60 crores. E-voting commences January 8, 2026, with results expected by February 10, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767611393317,
            "Source": "co_actions_results"
        },
        {
            "Title": "Barak Valley Cements Reports Financial Results for Quarter and Half Year Ended September 30, 2025",
            "Summary": "Barak Valley Cements Limited submitted unaudited financial results for the quarter and half year ended September 30, 2025, which were approved by the Board of Directors on November 14, 2025. The results were published in newspapers and disclosed to BSE and NSE as per regulatory requirements, with the company showing a net loss of Rs 37.70 lakhs for the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1763379080165,
            "Source": "earnings"
        },
        {
            "Title": "Barak Valley Cements Reports Q2 Results, Discusses Fundraising for Subsidiary Project",
            "Summary": "Barak Valley Cements Limited approved unaudited financial results for the second quarter and half year ended September 30, 2025, with auditors issuing an unmodified opinion. The Board discussed fundraising alternatives for subsidiary Valley Strong Cement's project and general corporate purposes but has not finalized any decision, while also addressing compliance warnings from BSE and NSE regarding corporate governance regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763134662802,
            "Source": "earnings"
        },
        {
            "Title": "Barak Valley Cements Acquires 98.08% Stake in Mustoh Cements Through Debt-to-Equity Conversion",
            "Summary": "Barak Valley Cements Limited acquired 25,53,882 equity shares (98.08% stake) in Mustoh Cements Limited by converting an outstanding loan of Rs 2,55,38,826 into equity shares at face value of Rs 10 per share. The acquisition makes Mustoh Cements a subsidiary of Barak Valley Cements, though the target company has not yet commenced commercial operations despite being incorporated in 2010 for cement manufacturing in Meghalaya.",
            "Sentiment": "neutral",
            "PublishDate": 1763130400552,
            "Source": "order&deals"
        },
        {
            "Title": "Barak Valley Cements Submits Quarterly Financial Results for June 2025",
            "Summary": "Barak Valley Cements Limited, a cement manufacturing company listed on NSE and BSE, submitted its unaudited financial results for the quarter ended June 30, 2025. The Board of Directors approved the results on August 14, 2025, and they were published in Financial Express and Dainandin Barta newspapers on August 15, 2025. The company is based in Assam, India and trades under scrip codes BVCL on NSE and 532916 on BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1755504174459,
            "Source": "earnings"
        },
        {
            "Title": "Barak Valley Cements Reports Q1 Results, Schedules 26th AGM for September 29",
            "Summary": "Barak Valley Cements Limited's Board approved standalone and consolidated unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs 5,752.17 lakhs and net profit after tax of Rs 254.16 lakhs for the quarter. Basic earnings per share stood at Rs 1.15. The Board scheduled the 26th Annual General Meeting for September 29, 2025, via video conferencing. Key appointments were made including Mrs. Preeti Bhatia as Company Secretary effective August 4, 2025, Mr. Deepak Virmani as Internal Auditor for FY 2025-26, and recommended M/s Gaurav Yadav and Co. as Secretarial Auditor for five years subject to shareholder approval. The company reappointed M/S RKKV & Associates as Cost Auditor and approved the reappointment of Mr. Gaurav Tulshyan as Director. The statutory auditors issued an unmodified opinion on the quarterly results.",
            "Sentiment": "neutral",
            "PublishDate": 1755172896616,
            "Source": "earnings"
        },
        {
            "Title": "Valley Strong Cement Appoints Mrs. Preeti Bhatia as Company Secretary and Compliance Officer",
            "Summary": "Valley Strong Cement has appointed Mrs. Preeti Bhatia as Company Secretary and Compliance Officer effective August 4, 2025. She holds membership number A53835 and is designated as a full-time Key Managerial Personnel. Mrs. Bhatia is a qualified Company Secretary, member of The Institute of Company Secretaries of India, and holds a B.Com degree from Delhi University. She replaces Mr. Kamakhya Chamaria, Vice Chairman and Managing Director, who was serving as interim Compliance Officer and ceases to act in that capacity.",
            "Sentiment": "neutral",
            "PublishDate": 1754399430574,
            "Source": "corporate_governance"
        }
    ]
}