{
    "Symbol": "BYKE",
    "ISIN": "INE319B01014",
    "News": [
        {
            "Title": "The Byke Hospitality Reports No Deviation in Use of Preferential Issue Proceeds",
            "Summary": "The Byke Hospitality Limited confirmed no deviation or variation in the use of proceeds raised through preferential issue of equity warrants from stated objectives. The company raised Rs. 54.95 crores in funds, with allotments on January 4, 2024 (Rs. 32 crores) and March 1, 2024 (Rs. 22.95 crores). As of September 30, 2025, Rs. 6.02 crores remained unutilized. The funds were allocated for repayment of borrowings (Rs. 9.07 lakhs utilized) and general corporate purposes (Rs. 39.86 lakhs utilized). Unutilized proceeds of Rs. 6.02 crores are deployed in fixed deposits with Yes Bank (Rs. 4.75 crores earning 8% returns) and UBI (Rs. 1.27 crores earning 6.60% returns), with current market values of Rs. 5.34 crores and Rs. 1.29 crores respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1762894305651,
            "Source": "corporate_action"
        },
        {
            "Title": "The Byke Hospitality Reports Quarterly Financial Results for September 2025",
            "Summary": "The Byke Hospitality Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company reported income from operations of Rs. 2,462.09 lakhs for the quarter, compared to Rs. 2,048.73 lakhs in the same period last year. Net profit for the quarter stood at Rs. 130.05 lakhs versus Rs. 37.05 lakhs in the previous year. For the half year, income from operations increased to Rs. 5,144.35 lakhs from Rs. 4,376.07 lakhs. The company's earnings per share for the quarter was Rs. 0.25 compared to Rs. 0.07 in the corresponding quarter of the previous year. The Board also noted that 18,500 share warrants pending conversion were forfeited, with the application money of Rs. 13.33 lakhs transferred to Capital Reserve Account. The results were reviewed by the Audit Committee and approved by the Board of Directors, with no qualifications reported by the statutory auditors.",
            "Sentiment": "positive",
            "PublishDate": 1762893787317,
            "Source": "earnings"
        },
        {
            "Title": "The Byke Hospitality Limited Schedules Board Meeting for Quarterly Results Review",
            "Summary": "The Byke Hospitality Limited has announced a board meeting scheduled for November 11, 2025, to consider and approve the company's un-audited financial results for the quarter and half-year ended September 30, 2025. The board will also adopt the Limited Review Report of the Auditors. The company has implemented a trading window closure for dealing in company securities starting from October 1, 2025, which will remain closed until 48 hours after the declaration of the financial results, in compliance with insider trading regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762357063766,
            "Source": "corporate_action"
        },
        {
            "Title": "The Byke Hospitality Opens Four New Hotels Across India, Adding 207 Rooms",
            "Summary": "The Byke Hospitality Limited opened four new hotel properties across India. The company launched The Byke Majestic Meadows in Palghar with 100 rooms featuring restaurant, swimming pool, conference hall, banquet lawn and terrace. In Jodhpur, The Byke Amra Oasis Osian opened with 48 rooms offering banquet hall, restaurant, wedding garden and lawn facilities. The Byke Landmark in Indore consists of 37 rooms with restaurant and banquet amenities. The Byke Laxmi Resort in Matheran features 22 rooms with restaurant, conference and lawn facilities. The expansion adds a total of 207 rooms to the company's hospitality portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1757155903419,
            "Source": "stock"
        },
        {
            "Title": "The Byke Hospitality Reports No Deviation in Use of Rs 54.95 Crore Preferential Issue Proceeds",
            "Summary": "The Byke Hospitality Limited confirmed no deviation in the utilization of Rs 54.95 crore raised through preferential issue of equity warrants from the stated objectives. The funds were allocated for repayment of borrowings (Rs 9.07 crore utilized) and general corporate purposes (Rs 37.68 crore utilized). The company raised funds across three tranches - Rs 13.84 crore in January 2024, Rs 22.95 crore in March 2024, and Rs 18.16 crore in July 2024. As of June 30, 2025, Rs 8.20 crore remained unutilized and was deployed in fixed deposits with Yes Bank earning 8% returns. The audit committee and auditors provided no comments on the fund utilization.",
            "Sentiment": "neutral",
            "PublishDate": 1754576502004,
            "Source": "corporate_action"
        },
        {
            "Title": "The Byke Hospitality Appoints Ritika Jaiswal as Company Secretary and Compliance Officer",
            "Summary": "The Byke Hospitality Limited appointed Ms. Ritika Jaiswal as Company Secretary and Compliance Officer effective August 07, 2025. The appointment was recommended by the Nomination & Remuneration Committee and approved by the Board. Ms. Jaiswal is an Associate Member of the Institute of Company Secretaries of India with membership number A75955. She has been designated as one of the Key Managerial Personnel under Section 203 of the Companies Act, 2013. Ms. Jaiswal holds a Bachelor in Commerce degree from University of Allahabad and is described as having strong legal procedures knowledge, communication skills, and ability to work in fast-paced corporate environments.",
            "Sentiment": "positive",
            "PublishDate": 1754574876532,
            "Source": "corporate_governance"
        },
        {
            "Title": "The Byke Hospitality Reports 15% Revenue Growth and Appoints New Company Secretary",
            "Summary": "The Byke Hospitality Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing income from operations of Rs. 2,682.26 lakhs compared to Rs. 2,327.34 lakhs in the same quarter last year. Net profit for the quarter was Rs. 214.77 lakhs versus Rs. 230.02 lakhs in the previous year. The company reported basic earnings per share of Rs. 0.41 for the quarter. The Board also approved the draft notice for the 35th Annual General Meeting scheduled for September 17, 2025, and appointed Ms. Ritika Jaiswal as Company Secretary and Compliance Officer. Ms. Jaiswal is an Associate Member of the Institute of Company Secretaries of India with membership number A75955.",
            "Sentiment": "positive",
            "PublishDate": 1754569334504,
            "Source": "earnings"
        }
    ]
}