{
    "Symbol": "CALSOFT",
    "ISIN": "INE526B01014",
    "News": [
        {
            "Title": "California Software Board Meet on Jan 31 for Call Money",
            "Summary": "California Software Company Limited has scheduled a board meeting for January 31, 2026, to consider call money on partly paid equity shares issued under the Rights Issue.",
            "Sentiment": "neutral",
            "PublishDate": 1769702500287,
            "Source": "co_actions_results"
        },
        {
            "Title": "California Software Company Seeks Shareholder Approval for Rs 200 Crore QIP and USD 100 Million FCCB Fundraising",
            "Summary": "California Software Company Limited has dispatched postal ballot notices to shareholders seeking approval for raising Rs 200 crores through Qualified Institutional Placement and USD 100 million via Foreign Currency Convertible Bonds, along with increasing authorized share capital to Rs 225 crores. The e-voting period runs from November 19 to December 18, 2025, with funds intended for business expansion, customer acquisition, working capital, and strategic growth opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1763390040674,
            "Source": "corporate_action"
        },
        {
            "Title": "California Software Company Limited Schedules Board Meeting to Discuss Financial Results and Major Capital Raising Plans",
            "Summary": "California Software Company Limited has announced a board meeting scheduled for November 14, 2025, to discuss multiple significant agenda items. The board will consider and approve unaudited financial results for the quarter and half-year ended September 30, 2025. Key capital raising initiatives include a Qualified Institutional Placement (QIP) of up to ₹100 crores, Foreign Direct Investment and/or Foreign Currency Convertible Bonds totaling up to USD 50 million, and an increase in authorized share capital to ₹225 crores. The company will also evaluate potential acquisitions of Indian and foreign companies for strategic business expansion. A trading window closure remains in effect from October 1, 2025, to November 16, 2025, for promoters, directors, key management personnel, and specified employees.",
            "Sentiment": "positive",
            "PublishDate": 1762476659829,
            "Source": "corporate_action"
        },
        {
            "Title": "California Software Company Reports Mixed Q1 Results with Auditor Qualifications on Trade Receivables",
            "Summary": "California Software Company Limited announced unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The IT and software development company reported revenue from operations of Rs. 154.59 lakhs, down from Rs. 198.95 lakhs in the previous quarter but up from Rs. 107.63 lakhs in the same quarter last year. Net profit for the quarter was Rs. 19.32 lakhs compared to Rs. 29.55 lakhs in the previous quarter and Rs. 17.33 lakhs in the corresponding quarter of the previous year. Basic earnings per share stood at Rs. 0.03. However, auditors K. Gopal Rao & Co. issued a qualified review report citing several concerns including long outstanding trade receivables of Rs. 1,977.28 lakhs without adequate provision for expected credit loss, unconfirmed trade payables of Rs. 328.45 lakhs, and discrepancies in opening balances compared to previous year's audited statements. The company operates primarily in IT and software development with subsidiary Aspire Communications Private Limited contributing nil revenue during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1755186994656,
            "Source": "earnings"
        }
    ]
}