{
    "Symbol": "CAMLINFINE",
    "ISIN": "INE052I01032",
    "News": [
        {
            "Title": "Camlin Fine Sciences Boosts Vinpai Stake to 83.82%",
            "Summary": "Camlin Fine Sciences increases its ownership in Vinpai to 83.82% through conversion of convertible bonds into equity shares, strengthening its strategic position in the subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1767968093275,
            "Source": "co_actions_results"
        },
        {
            "Title": "Camlin Fine Sciences Increases Vinpai Stake to 83.82%",
            "Summary": "Camlin Fine Sciences converted EUR 33 lakh convertible bonds into 11 lakh Vinpai shares, raising its stake from 78.68% to 83.82% in the French ingredient technology company.",
            "Sentiment": "positive",
            "PublishDate": 1767956724449,
            "Source": "co_actions_results"
        },
        {
            "Title": "Camlin Fine Sciences Vanillin Plant Overcomes Issues",
            "Summary": "CFSL's vanillin plant commissioned in Jan 2023 resolved technical issues, with commercial sales starting H2-CY24. Tight global markets and rising prices benefit the company's positioning.",
            "Sentiment": "positive",
            "PublishDate": 1767931441188,
            "Source": "stocks"
        },
        {
            "Title": "Camlin Fine Sciences Responds to BSE Volume Query",
            "Summary": "Camlin Fine Sciences clarifies its regulatory compliance position following BSE inquiry about increased trading volume, stating it cannot comment on share price movements as equity shares are freely traded.",
            "Sentiment": "neutral",
            "PublishDate": 1767864921963,
            "Source": "stocks"
        },
        {
            "Title": "Camlin Fine Sciences Receives GST Order Worth ₹48.59L",
            "Summary": "Camlin Fine Sciences receives GST demand order of ₹48.59 lakh from Palghar Commissionerate for alleged ITC violations during FY19-20. Company plans to file appeal against the order.",
            "Sentiment": "negative",
            "PublishDate": 1767173342373,
            "Source": "stocks"
        },
        {
            "Title": "Camlin Fine Sciences Completes Acquisition of French Ingredient Tech Company Vinpai",
            "Summary": "Camlin Fine Sciences allotted 41,06,181 equity shares worth ₹101.70 crore to acquire 78.68% stake in Vinpai, a French ingredient technology company specializing in algae, plant and mineral-based functional ingredients. The acquisition expands Camlin's product portfolio into food, cosmetics and nutraceutical markets through share swap arrangement, with Vinpai generating €9.2 million turnover in 2024.",
            "Sentiment": "positive",
            "PublishDate": 1764506556088,
            "Source": "order&deals"
        },
        {
            "Title": "Camlin Fine Sciences Completes Acquisition of 78.68% Stake in French Company Vinpai",
            "Summary": "Camlin Fine Sciences Limited completed the acquisition of a majority stake representing 78.68% of share capital and 84.89% of voting rights in Vinpai, a French company listed on Euronext Growth Paris, at Euro 3.60 per share through a block acquisition from significant shareholders. The company will issue new equity shares at INR 247.69 per share to the sellers on November 30, 2025, and plans to file a simplified cash tender offer for remaining Vinpai shares by mid-December.",
            "Sentiment": "positive",
            "PublishDate": 1764311669410,
            "Source": "order&deals"
        },
        {
            "Title": "Camlin Fine Sciences Adjusts Timeline for Vinpai Acquisition After Regulatory Approval Delay",
            "Summary": "Camlin Fine Sciences received Indian regulatory approvals on November 18, 2025 for its majority stake acquisition in French company Vinpai at Euro 3.60 per share, with shareholders having approved the transaction by 99.9924% votes. The company has adjusted its acquisition timeline with allotment of consideration shares scheduled by November 30, 2025 and filing of the simplified tender offer planned for mid-December 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764140714827,
            "Source": "order&deals"
        },
        {
            "Title": "Camlin Fine Sciences Reports 8.6% Revenue Growth to Rs. 460 Crores in Q2 FY26",
            "Summary": "Camlin Fine Sciences achieved quarterly revenue of Rs. 460 crores with 8.6% growth, driven by increased volumes in trades, blends, and vanillin segments despite realization pressures from US tariffs. The company guided for 4,000 tons vanillin sales and 20% blends growth for next year, with EBITDA improving to Rs. 33 crores at 7.27% margin.",
            "Sentiment": "positive",
            "PublishDate": 1763112469302,
            "Source": "earnings"
        },
        {
            "Title": "Camlin Fine Sciences Seeks Shareholder Approval for Director Re-appointment via Postal Ballot",
            "Summary": "Camlin Fine Sciences Limited has issued a postal ballot notice seeking shareholder approval for the re-appointment of Mr. Mahabaleshwar G. Palekar (DIN: 02455892) as a Non-Executive Independent Director for a second term of five consecutive years commencing from December 24, 2025. The e-voting process will commence on November 14, 2025 at 9:00 a.m. IST and end on December 13, 2025 at 5:00 p.m. IST. Palekar's current term expires on December 23, 2025, having been appointed at the 28th Annual General Meeting held on July 20, 2021 for the period from December 24, 2020 to December 23, 2025. The Board of Directors, on recommendation of the Nomination and Remuneration Committee, has recommended his re-appointment. Palekar is a chemical engineer with a doctorate degree from University Department of Chemical Technology (UDCT now ICT) in Mumbai and has over three decades of professional experience in the specialty chemicals business. He received sitting fees of Rs. 5,95,000 for attending board and committee meetings during FY 2025-26 and holds 6,000 shares in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1763012677625,
            "Source": "corporate_action"
        },
        {
            "Title": "Camlin Fine Sciences Reports No Deviation in Rights Issue Fund Utilization for Quarter Ended September 2025",
            "Summary": "Camlin Fine Sciences Limited submitted its monitoring agency report for the quarter ended September 30, 2025, confirming no deviation in the utilization of funds raised through its Rights Issue. The company raised INR 22,468.39 lakhs through the issue of 2,04,25,805 equity shares at INR 110 per share. The funds were allocated for prepayment/repayment of borrowings (INR 16,904.93 lakhs), general corporate purposes (INR 5,494.22 lakhs), and issue-related expenses (INR 69.24 lakhs). During the quarter, the company utilized INR 1,652.79 lakhs for debt repayment and INR 448.52 lakhs for general corporate purposes. Unutilized funds of INR 2,707.24 lakhs were deployed in fixed deposits with State Bank of India. The monitoring was conducted by India Ratings Research Private Limited, with the report approved by the company's Audit Committee and Board of Directors.",
            "Sentiment": "neutral",
            "PublishDate": 1762811542445,
            "Source": "corporate_action"
        },
        {
            "Title": "Camlin Fine Sciences Reports 41% Growth in Vanillin Segment, Targets Margin Recovery",
            "Summary": "Camlin Fine Sciences reported a 41% year-over-year increase in its vanillin segment. The company is targeting margin revival and growth in high-value blends and aroma ingredients. The company is expanding its marketing presence across key geographies and has a strong order book in blends. Camlin Fine Sciences has an acquisition-led growth pipeline and is focusing on global market penetration with tariff-led margin recovery expected in H2FY26.",
            "Sentiment": "positive",
            "PublishDate": 1762786485252,
            "Source": "stock"
        },
        {
            "Title": "Camlin Fine Sciences Reports Quarterly Loss, Approves Director Re-appointment and Stock Options",
            "Summary": "Camlin Fine Sciences announced its unaudited financial results for the quarter and half year ended September 30, 2025. The Board approved the re-appointment of Mr. Mahabaleshwar Palekar as Non-Executive Independent Director for a second five-year term from December 24, 2025 to December 23, 2030, subject to shareholder approval. The company granted 16,23,000 stock options to eligible employees under the CFSLESOP-2021 scheme at an exercise price of Rs. 150 per option. A postal ballot notice was approved for the director's re-appointment. The Board meeting was held on November 10, 2025, commencing at 1:30 PM and concluding at 3:35 PM.",
            "Sentiment": "neutral",
            "PublishDate": 1762785965962,
            "Source": "earnings"
        },
        {
            "Title": "Camlin Fine Sciences Reports Narrower Q2 Loss Despite Revenue and Margin Decline",
            "Summary": "Camlin Fine Sciences reported a consolidated net loss of 143.8 million rupees in Q2, significantly lower than the 1 billion rupee loss in the same period last year. Revenue reached 4.6 billion rupees compared to 4.17 billion rupees year-over-year. EBITDA declined to 334 million rupees from 515 million rupees, while EBITDA margin compressed to 7.27% from 12.34% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762770933140,
            "Source": "earnings"
        },
        {
            "Title": "Camlin Fine Sciences Issues Corrigendum for Postal Ballot on Preferential Share Issue",
            "Summary": "Camlin Fine Sciences Limited issued a corrigendum to its postal ballot notice dated September 29, 2025, providing additional clarifications requested by BSE and NSE regarding a proposed preferential issue of equity shares. The company plans to issue 41,06,181 equity shares at ₹247.69 per share as consideration for acquiring a 78.68% majority stake in French company Vinpai through a share swap arrangement. Vinpai, founded in 2011, specializes in algae, plant, mineral and fiber-based functional ingredients as natural alternatives to chemical additives, generating €9.2 million revenue in 2024 with exports to over 36 countries. The acquisition involves five investors including founders Cyrille Damany and Philippe Le Ray, with total consideration of €98.03 million. Post-issue, the new shareholders will hold 2.10% of Camlin's expanded share capital. The company has granted members who already voted an opportunity to update their votes based on the additional information, with submissions accepted until October 29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760719688626,
            "Source": "corporate_action"
        },
        {
            "Title": "Camlin Fine Sciences Extends Vinpai Acquisition Timeline to November 2025",
            "Summary": "Camlin Fine Sciences Limited has extended the completion timeline for its proposed acquisition of a majority stake in Vinpai S.A. from September 30, 2025, to November 30, 2025. The delay occurred due to documentation requirements for foreign sellers, who needed to obtain Permanent Account Numbers (PAN) as required for preferential allotment under SEBI regulations. The foreign national sellers have now obtained their PANs, and Camlin Fine Sciences is seeking Board and Shareholders approval to issue equity shares through preferential allotment as payment for the majority stake acquisition via a share swap arrangement.",
            "Sentiment": "neutral",
            "PublishDate": 1758800506873,
            "Source": "order&deals"
        },
        {
            "Title": "Camlin Fine Sciences Schedules Board Meeting for Preferential Share Allotment in Vinpai Acquisition",
            "Summary": "Camlin Fine Sciences Limited has scheduled a Board meeting on September 29, 2025 to consider issuing equity shares through preferential allotment as part of a share swap arrangement to acquire a majority stake in Vinpai S.A. The proposal requires shareholder approval through a postal ballot process. The company has closed its trading window for insiders from September 24, 2025 until 48 hours after the Board meeting concludes. This follows previous disclosures made in February and June 2025 regarding the Vinpai acquisition.",
            "Sentiment": "neutral",
            "PublishDate": 1758712830155,
            "Source": "corporate_action"
        },
        {
            "Title": "Camlin Fine Sciences Shareholders Approve Re-appointment of Independent Director Joseph Conrad D'Souza",
            "Summary": "Camlin Fine Sciences Limited shareholders approved the re-appointment of Mr. Joseph Conrad D'Souza as a Non-Executive Independent Director for a second five-year term through postal ballot voting. The resolution passed with requisite majority on September 17, 2025, with 99.9134% votes in favor and 0.0866% against. The new term commences from September 29, 2025. The voting was conducted through remote e-voting process, with 279 ballots cast in favor totaling 10,20,70,172 votes and 34 ballots against totaling 88,489 votes. The company had 59,905 total shareholders on the cut-off date of August 14, 2025. Promoter and promoter group voted 100% in favor with no opposition, while public institutions and non-institutions showed over 99% approval rates.",
            "Sentiment": "positive",
            "PublishDate": 1758178497192,
            "Source": "corporate_governance"
        },
        {
            "Title": "Camlin Fine Sciences Seeks Shareholder Approval for Re-appointment of Independent Director Joseph Conrad D'Souza",
            "Summary": "Camlin Fine Sciences Limited has issued a postal ballot notice seeking shareholder approval for the re-appointment of Mr. Joseph Conrad D'Souza as Non-Executive Independent Director for a second five-year term starting September 29, 2025. D'Souza's current term expires on September 28, 2025, after serving since September 29, 2020. The e-voting process will run from August 19 to September 17, 2025, with results to be announced by September 19, 2025. D'Souza, aged 65, holds qualifications including a Master's in Commerce, MBA, and Senior Executive Programme from London Business School. He previously served as Chief Investor Relations Officer with HDFC Limited and currently holds directorships in multiple companies including Chalet Hotels Limited, Prism Johnson Limited, and Bharat Bijlee Limited. He received sitting fees of ₹4,50,000 during FY2025-26 and attended all board meetings. The Board recommends his re-appointment based on his expertise in areas including finance, risk management, and strategic governance.",
            "Sentiment": "neutral",
            "PublishDate": 1755502510796,
            "Source": "corporate_governance"
        },
        {
            "Title": "Camlin Fine Sciences Q1 FY26 Earnings: Revenue Dips to INR 423 Crores Due to Plant Maintenance Shutdown",
            "Summary": "Camlin Fine Sciences reported quarterly revenue of INR 423 crores compared to INR 437 crores in the previous year, primarily due to lower revenues in the Specialty Ingredients Straights segment. The company conducted annual maintenance shutdowns at both Dahej and Tarapur facilities in April, resulting in unabsorbed fixed costs of INR 12 crores and production impact. EBITDA declined to INR 19 crores with a 4.5% margin. The company paid one-time performance bonuses of INR 7.5 crores to Blends business employees. Vanillin business saw slight revenue decline of INR 5 crores but maintained stable volumes, with current capacity utilization at 60%. The Blends business showed strong growth across geographies. Management expects vanillin volumes of 2,500-3,000 tons with average realizations of $13-14 for the year. Current vanillin selling prices are $12.5 in Q1, with U.S. retail prices at $18-19 and Europe at $14-15. The company faces 50% tariffs on U.S. vanillin exports while Chinese competitors face 280% duties. Management projects 70-80% vanillin capacity utilization in FY27 and full utilization by FY28.",
            "Sentiment": "neutral",
            "PublishDate": 1755082774038,
            "Source": "earnings"
        },
        {
            "Title": "Camlin Fine Targets FY26 Recovery Through High-Value Products and Global Expansion",
            "Summary": "Camlin Fine is targeting recovery by FY26 through a strategic focus on high-value blends, vanillin growth, and new specialty ingredients. The company plans to improve margins through process optimization, forward integration, and global expansion despite facing current demand challenges.",
            "Sentiment": "positive",
            "PublishDate": 1754666573850,
            "Source": "stock"
        },
        {
            "Title": "Camlin Fine Sciences Makes Conference Call Audio Recording Available for Q1 Results Discussion",
            "Summary": "Camlin Fine Sciences Limited has made the audio recording of their conference call discussing unaudited financial results for the quarter ended June 30, 2025 available on their website. The call was held on August 8, 2025, and featured management representatives including Chairman & Managing Director Ashish Dandekar, Managing Director Nirmal Momaya, and Chief Financial Officer Santosh Parab. The company confirmed that discussions were based on publicly available information and no unpublished price sensitive information was shared during the call.",
            "Sentiment": "neutral",
            "PublishDate": 1754662645251,
            "Source": "earnings"
        },
        {
            "Title": "Camlinfine Ltd Reports Quarterly Loss, Announces Board Changes and Director Appointments",
            "Summary": "Camlinfine Ltd announced its unaudited financial results for the quarter ended June 30, 2025, reporting a standalone net loss of Rs 1,068.10 lakh compared to a profit of Rs 1,561.84 lakh in the previous quarter. Revenue from operations declined to Rs 19,143.82 lakh from Rs 27,259.63 lakh. The company's board approved several key decisions including the re-appointment of Mr. Joseph Conrad D'Souza as Non-Executive Independent Director for a second five-year term from September 29, 2025 to September 28, 2030, subject to shareholder approval. Mr. Hari Rajmohan was appointed as Alternate Director to Mr. Jens Van Nieuwenborgh. Additionally, Chief Financial Officer Mr. Santosh Parab was given interim charge of the Human Resources & Administration Department following the resignation of Mr. Amarsinh Jadhavrao, Chief Executive (HR & Corporate Affairs). The company operates in the specialty chemicals segment and has classified certain operations as discontinued due to economic unviability.",
            "Sentiment": "negative",
            "PublishDate": 1754653033723,
            "Source": "earnings"
        },
        {
            "Title": "Camlin Fine Sciences Reports Reduced Q1 Loss Despite Revenue Growth",
            "Summary": "Camlin Fine Sciences reported a consolidated net loss of 100 million rupees in Q1, significantly lower than the 340 million rupee loss in the same period last year. Revenue increased to 4.23 billion rupees from 3.8 billion rupees year-over-year. However, EBITDA declined to 190 million rupees from 289 million rupees, with EBITDA margin dropping to 4.49% from 7.59% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754649196363,
            "Source": "earnings"
        },
        {
            "Title": "Camlin Fine Sciences: Shares Surge 51% Amid Anti-Dumping Duties on Chinese Vanillin",
            "Summary": "Camlin Fine Sciences' shares have increased by 51% in the past month due to anti-dumping duties imposed by the US and EU on Chinese vanillin manufacturers. The company plans to increase vanillin capacity utilization from 45-50% to 100% over two years. Blends business is expected to grow by 20% in the next 2-3 years with improved EBITDA margins. Net debt has decreased, improving debt-to-equity ratio.",
            "Sentiment": "positive",
            "PublishDate": 1750294013000,
            "Source": "normal_news"
        },
        {
            "Title": "Camlin Fine Sciences Reports Improved Q4 EBITDA and Margin",
            "Summary": "Camlin Fine Sciences has reported its Q4 financial results. The company's EBITDA for the quarter increased to 594 million rupees, up from 315 million rupees in the same quarter of the previous year. The EBITDA margin also improved, rising to 13.58% from 8.35% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748002107000,
            "Source": "result"
        },
        {
            "Title": "Camlin Fine Sciences Reports Q4 Financial Results",
            "Summary": "Camlin Fine Sciences has reported its Q4 consolidated financial results. The company recorded a net loss of 7 million rupees, compared to a loss of 771 million rupees in the same quarter last year, showing a significant reduction in losses. Sequentially, the loss decreased from 41 million rupees in the previous quarter. Revenue for Q4 increased to 4.4 billion rupees from 3.8 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748001975000,
            "Source": "result"
        },
        {
            "Title": "Camlin Fine Sciences to Acquire Majority Stake in Vinpai",
            "Summary": "Camlin Fine Sciences (CFSL) has announced plans to acquire a majority stake in Vinpai. The acquisition will be paid for using newly issued CFSL shares. The share price for Vinpai has been set at €3.60.",
            "Sentiment": "positive",
            "PublishDate": 1740615541000,
            "Source": "corporate_action"
        },
        {
            "Title": "Camlin Fine Sciences to Acquire Stake in Vinpai S.A.",
            "Summary": "Camlin Fine Sciences has announced plans to acquire up to 100% stake in Vinpai S.A. through a combination of share swap and cash offer. Additionally, the company will invest €3.3 million via secured convertible bonds, which can be converted into Vinpai shares.",
            "Sentiment": "positive",
            "PublishDate": 1740450781000,
            "Source": "corporate_action"
        },
        {
            "Title": "Camlin Fine Sciences Reports Reduced Q3 Loss and Revenue Growth",
            "Summary": "Camlin Fine Sciences has reported a consolidated net loss of 41 million rupees for the third quarter, which is a significant improvement from the 118 million rupee loss in the same quarter of the previous year. The company's revenue has also shown substantial growth, increasing to 6.33 billion rupees from 3.86 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739751647000,
            "Source": "earnings"
        },
        {
            "Title": "Swiss Military Consumer Goods Reports Q3 Financial Results",
            "Summary": "Swiss Military Consumer Goods has announced its Q3 financial results. The company's consolidated net profit remained steady at 23 million rupees, showing no year-over-year change. However, revenue increased from 497 million rupees to 573 million rupees, representing a growth in sales.",
            "Sentiment": "neutral",
            "PublishDate": 1739529574000,
            "Source": "earnings"
        },
        {
            "Title": "Camlin Fine Sciences Reports Significant EBITDA Growth in Q3",
            "Summary": "Camlin Fine Sciences has announced its Q3 financial results, showing substantial year-over-year improvement. The company's EBITDA increased to 488 million rupees, up from 233 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 7.70% from 6.04% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739529311000,
            "Source": "earnings"
        },
        {
            "Title": "Camlin Fine Sciences Reports Reduced Q3 Loss and Revenue Growth",
            "Summary": "Camlin Fine Sciences has reported its Q3 financial results. The company's consolidated net loss narrowed to 41 million rupees, compared to a loss of 118 million rupees in the same quarter last year. Revenue showed significant growth, increasing to 6.33 billion rupees from 3.86 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739529228000,
            "Source": "earnings"
        },
        {
            "Title": "Camlin Fine Sciences Revises Rights Issue and Approves NCD Fundraising",
            "Summary": "Camlin Fine Sciences has revised the quantum of its rights issue to an amount not exceeding 2.25 billion rupees. Additionally, the company has approved fundraising through Non-Convertible Debentures (NCDs) aggregating to 1 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1732282530000,
            "Source": "corporate_action"
        },
        {
            "Title": "Camlin Fine Sciences to Revise Rights Issue and Consider Debt Securities",
            "Summary": "Camlin Fine Sciences has announced a board meeting on November 22 to discuss two key financial matters. First, they will consider revising the quantum of a previously proposed rights issue. Second, the board will deliberate on the potential issuance of debt securities.",
            "Sentiment": "neutral",
            "PublishDate": 1731935305000,
            "Source": "corporate_action"
        },
        {
            "Title": "Camlin Fine Sciences Approves Liquidation of Subsidiary",
            "Summary": "Camlin Fine Sciences has approved the liquidation of its subsidiary, CFS Pahang Asia Pte Ltd.",
            "Sentiment": "neutral",
            "PublishDate": 1731319391000,
            "Source": "corporate_action"
        },
        {
            "Title": "Camlin Fine Sciences Reports Strong Q2 Financial Performance",
            "Summary": "Camlin Fine Sciences has reported significant year-over-year improvements in its Q2 financial results. The company's EBITDA increased from 251 million rupees to 432 million rupees. Additionally, the EBITDA margin expanded from 6.19% to 10.22%.",
            "Sentiment": "positive",
            "PublishDate": 1731319330000,
            "Source": "result"
        },
        {
            "Title": "Camlin Fine Sciences Reports Q2 Revenue Growth",
            "Summary": "Camlin Fine Sciences has reported a revenue of 4.23 billion rupees for the second quarter, compared to 4.05 billion rupees in the same period last year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731319208000,
            "Source": "result"
        },
        {
            "Title": "Camlin Fine Sciences Reports Increased Q2 Loss",
            "Summary": "Camlin Fine Sciences has reported a consolidated net loss of 1 billion rupees for the second quarter, compared to a loss of 193 million rupees in the same period last year. This represents a significant increase in the company's losses year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731319175000,
            "Source": "result"
        }
    ]
}