{
    "Symbol": "CAMPUS",
    "ISIN": "INE278Y01022",
    "News": [
        {
            "Title": "Campus Activewear Q3 Net Profit Jumps 38.5% YoY",
            "Summary": "Campus Activewear reported strong Q3 performance with net profit rising to ₹637 million from ₹460 million in the previous year, marking significant growth in the footwear segment.",
            "Sentiment": "positive",
            "PublishDate": 1770023212827,
            "Source": "co_actions_results"
        },
        {
            "Title": "Campus Activewear Board Meet Set for Feb 2, 2026",
            "Summary": "Campus Activewear Limited has scheduled a board meeting on February 2, 2026, to consider and approve unaudited financial results for Q3 FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769253387787,
            "Source": "co_actions_results"
        },
        {
            "Title": "Campus Activewear Allots 62,873 ESOP Shares",
            "Summary": "Campus Activewear Limited issued 62,873 equity shares to employees under ESOP schemes on January 20, 2026, increasing paid-up capital to ₹152.80 crores with shares at varying exercise prices.",
            "Sentiment": "positive",
            "PublishDate": 1768907169957,
            "Source": "co_actions_results"
        },
        {
            "Title": "Campus Activewear Allots 58,138 Shares Under Employee Stock Option Plans",
            "Summary": "Campus Activewear's Nomination and Remuneration Committee allotted 58,138 equity shares of Rs. 5 each to eligible employees under two ESOP schemes with exercise prices ranging from Rs. 5 to Rs. 197.16 per share. The allotment increased the company's paid-up equity share capital from Rs. 1,52,73,60,970 to Rs. 1,52,76,51,660, comprising 30,55,30,332 equity shares, while the committee also granted 5,317 new options to one employee.",
            "Sentiment": "neutral",
            "PublishDate": 1763714385272,
            "Source": "corporate_action"
        },
        {
            "Title": "Campus Activewear Reports Strong Q2 FY26 Results with 16% Revenue Growth and 40% PAT Surge",
            "Summary": "Campus Activewear delivered robust quarterly results with revenue growing 16% to INR 387 crores driven by 20% growth in distribution channel, while profit after tax surged 40% to INR 20 crores with improved margins at 5.1%. The company's premium segment (INR 1,500+ price point) expanded from 45.2% to 57.2% of sales mix, with women's category share rising to 16.2%, supported by new brand ambassador Kriti Sanon and plans for additional manufacturing capacity at Pant Nagar.",
            "Sentiment": "positive",
            "PublishDate": 1763370440723,
            "Source": "earnings"
        },
        {
            "Title": "Campus Activewear Plans Capacity Expansion and Premium Segment Growth",
            "Summary": "Campus Activewear has outlined its growth strategy focusing on premium athleisure and women's segment expansion. The company is adding new manufacturing lines to increase annual capacity beyond 4 crore pairs. The strategy includes investing in technology-driven retail and brand visibility, while focusing on higher-margin SKUs and omnichannel distribution to drive EBITDA improvement.",
            "Sentiment": "positive",
            "PublishDate": 1762963705798,
            "Source": "stock"
        },
        {
            "Title": "Campus Activewear Reports 16% Revenue Growth in Q2 FY26 with Strong Volume Expansion",
            "Summary": "Campus Activewear Limited reported revenue from operations of INR 386.6 crores in Q2 FY26, representing a 16% year-over-year growth from INR 333.3 crores in Q2 FY25. The company sold 5.8 million pairs during the quarter compared to 5.4 million pairs in the previous year, marking a 7.4% volume growth. Average selling price increased to INR 672 per pair from INR 622 per pair. EBITDA grew 32.3% to INR 55 crores with margins improving to 14% from 12.3%. Profit after tax increased 40.4% to INR 20.1 crores. The company maintains operations across 28,000 retail touchpoints in over 700 districts and 28 states, with 46.4% revenue contribution from direct-to-consumer channels. Campus has annual assembly capacity of 30.7 million pairs and launched 504 new designs during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762945084707,
            "Source": "earnings"
        },
        {
            "Title": "Campus Activewear Reports Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "Campus Activewear Limited's Board of Directors approved unaudited financial results for the quarter and half year ended September 30, 2025. The company reported revenue of ₹661 crores for the quarter. During the quarter, the company acquired land and building of approximately 4,700 square meters in Uttarakhand for ₹74.75 crores to expand manufacturing capacity for upper and assembly of footwear products. The company also changed manufacturing of certain products from Free Trade Zone to Domestic Tariff Area. The financial results were reviewed by statutory auditors BSR and Co., who found no material misstatements in the unaudited financial statements.",
            "Sentiment": "neutral",
            "PublishDate": 1762934299305,
            "Source": "earnings"
        },
        {
            "Title": "Campus Activewear Reports 40% Jump in Q2 Net Profit to 201 Million Rupees",
            "Summary": "Campus Activewear reported Q2 net profit of 201 million rupees compared to 143 million rupees in the same period last year. The company's EBITDA increased to 499 million rupees from 390 million rupees year-over-year. EBITDA margin improved to 12.9% from 11.71% in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762933130537,
            "Source": "earnings"
        },
        {
            "Title": "Campus Activewear Schedules Q2 H1 FY26 Earnings Call for November 12, 2025",
            "Summary": "Campus Activewear Limited has scheduled an earnings call with analysts and investors for Wednesday, November 12, 2025, at 5:00 PM IST. The company will announce its financial results for the second quarter and half year ended September 30, 2025, on the same day. The earnings call will run from 5:00 PM to 6:00 PM IST and will include opening comments on earnings performance followed by an interactive Q&A session. The management team will be represented by Mr. Nikhil Aggarwal, Whole-time Director & CEO, and Mr. Sanjay Chhabra, Chief Financial Officer. Multiple dial-in numbers are provided for different regions, and participants can pre-register to avoid wait times.",
            "Sentiment": "neutral",
            "PublishDate": 1762484512743,
            "Source": "earnings"
        },
        {
            "Title": "Campus Activewear Acquires Manufacturing Facility for ₹74.75 Crore, Plans ₹230 Crore Capacity Expansion",
            "Summary": "Campus Activewear has acquired land and building at SIIDCUL Pantnagar for ₹74.75 crore to expand its manufacturing capacity. The company plans to invest ₹230 crore to add 7.2 million pairs of additional manufacturing capacity by FY28.",
            "Sentiment": "positive",
            "PublishDate": 1756899875353,
            "Source": "stock"
        },
        {
            "Title": "Campus Activewear Focuses on Premium Sportswear and Omni-Channel Expansion",
            "Summary": "Campus Activewear is concentrating on premium sportswear products while expanding its omni-channel strategy to increase market share. The company is pursuing a multi-channel approach to reach customers across different platforms and touchpoints.",
            "Sentiment": "positive",
            "PublishDate": 1755101244930,
            "Source": "stock"
        },
        {
            "Title": "Campus Activewear Reports Mixed Q1 Results with Revenue Growth but Profit Decline",
            "Summary": "Campus Activewear reported Q1 net profit of 222 million rupees, down from 254 million rupees in the same period last year. Revenue increased to 3.43 billion rupees from 3.4 billion rupees year-over-year. EBITDA declined to 488 million rupees from 517 million rupees, while EBITDA margin compressed to 14.24% from 15.26% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1755079498416,
            "Source": "earnings"
        },
        {
            "Title": "Campus Activewear Schedules Board Meeting for August 13 to Approve Q2 Results and Consider Final Dividend",
            "Summary": "Campus Activewear Limited has scheduled a Board of Directors meeting for August 13, 2025, to consider and approve unaudited financial results for the quarter ended June 30, 2025, and to consider recommending a final dividend on equity shares for the financial year ended March 31, 2025. The company's trading window for insiders has been closed since July 1, 2025, and will reopen 48 hours after the financial results are declared.",
            "Sentiment": "neutral",
            "PublishDate": 1754403917924,
            "Source": "corporate_action"
        },
        {
            "Title": "Campus Activewear Reports Q4 Financial Results",
            "Summary": "Campus Activewear has released its Q4 financial results. The company's EBITDA increased to 714 million rupees from 639 million rupees year-over-year. The EBITDA margin slightly improved to 17.61% from 17.56% in the same period last year. The standalone net profit rose to 350 million rupees from 327 million rupees compared to the previous year's quarter.",
            "Sentiment": "positive",
            "PublishDate": 1748509130000,
            "Source": "result"
        },
        {
            "Title": "Campus Activewear Block Trade on BSE",
            "Summary": "A block trade of approximately 5 million shares of Campus Activewear occurred on the Bombay Stock Exchange (BSE) during pre-open. The trade was valued at Rs 129.25 crore, with shares priced at Rs 258.5 each.",
            "Sentiment": "neutral",
            "PublishDate": 1741232610000,
            "Source": "block_deals"
        },
        {
            "Title": "Campus Activewear: Shares Surge 10% on Q3 Profit Growth and Analyst Upgrade",
            "Summary": "Campus Activewear's stock rose up to 10% after Kotak Institutional Equities upgraded it to 'Add' with a ₹290 price target. Q3 net profit increased 86% YoY to ₹46.5 crore, revenue grew 9% to ₹515 crore, and EBITDA margin expanded to 16%. The company reported 10.4% volume growth and 9.1% value growth, outperforming most peers.",
            "Sentiment": "positive",
            "PublishDate": 1739356764000,
            "Source": "earnings"
        },
        {
            "Title": "Campus Activewear Reports Strong Q3 EBITDA Growth",
            "Summary": "Campus Activewear has announced its Q3 financial results, showing significant improvement in both EBITDA and EBITDA margin. The company's EBITDA increased to 820 million rupees from 562 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 15.92% from 11.92% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739264187000,
            "Source": "earnings"
        },
        {
            "Title": "Campus Activewear Reports Q3 Revenue Increase",
            "Summary": "Campus Activewear has reported a revenue of 5.1 billion rupees for the third quarter, compared to 4.7 billion rupees in the same period last year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1739264134000,
            "Source": "earnings"
        },
        {
            "Title": "Campus Activewear Reports Significant Increase in Q3 Net Profit",
            "Summary": "Campus Activewear has announced its financial results for the third quarter, reporting a net profit of 465 million rupees. This represents a substantial increase from the 249 million rupees reported in the same period of the previous year, indicating strong year-over-year growth for the company.",
            "Sentiment": "positive",
            "PublishDate": 1739264084000,
            "Source": "earnings"
        },
        {
            "Title": "Campus Activewear to Consider Q3 Results",
            "Summary": "Campus Activewear has announced that it will consider its third quarter (Q3) financial results on February 11. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738675256000,
            "Source": "result"
        },
        {
            "Title": "Campus Activewear Reports Strong Q2 Financial Performance",
            "Summary": "Campus Activewear has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 390 million rupees, up from 240 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 11.71% from 9.24% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1731313471000,
            "Source": "result"
        },
        {
            "Title": "Campus Activewear Reports Q2 Revenue Growth",
            "Summary": "Campus Activewear announced its second quarter financial results, reporting revenue of 3.3 billion rupees, compared to 2.6 billion rupees in the same quarter last year. This represents a significant year-over-year increase in revenue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1731313381000,
            "Source": "result"
        },
        {
            "Title": "Campus Activewear Reports Significant Profit Increase in Q2",
            "Summary": "Campus Activewear has reported a substantial increase in net profit for the second quarter. The company's net profit rose to 143 million rupees, compared to 3 million rupees in the same period last year, marking a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731313334000,
            "Source": "result"
        }
    ]
}