{
    "Symbol": "CANBK",
    "ISIN": "INE476A01022",
    "News": [
        {
            "Title": "Canara Bank Completes Basel III AT1 Bond Redemption",
            "Summary": "Canara Bank successfully redeemed its Rs. 120 crore Basel III AT1 bonds on February 2, 2026, paying total amount of Rs. 129.96 crore including annual interest to bondholders.",
            "Sentiment": "positive",
            "PublishDate": 1770029770952,
            "Source": "co_actions_results"
        },
        {
            "Title": "Canara Bank Raises Credit Growth Target to 13.5%",
            "Summary": "Canara Bank has revised its credit growth target upwards to 13.5% from the previously announced 10.5%, indicating stronger business confidence and expansion plans for the public sector lender.",
            "Sentiment": "positive",
            "PublishDate": 1769681697632,
            "Source": "stocks"
        },
        {
            "Title": "Canara Bank Reports NIL Fund Utilization Deviation Q3FY26",
            "Summary": "Canara Bank disclosed no deviation in fund utilization for Q3 FY2025-26 under SEBI regulations. Bank raised ₹3,500 crores through Basel III AT1 bonds in December 2025, fully utilized as planned.",
            "Sentiment": "neutral",
            "PublishDate": 1769676593231,
            "Source": "stocks"
        },
        {
            "Title": "Canara Bank Files Q3FY26 Security Cover Certificate",
            "Summary": "Canara Bank submitted its quarterly security cover certificate for Q3FY26, disclosing ₹50,423 crore in outstanding unsecured non-convertible debt securities across 18 ISIN series.",
            "Sentiment": "neutral",
            "PublishDate": 1769675099329,
            "Source": "co_actions_results"
        },
        {
            "Title": "Canara Bank Q3 Net Profit Rises 25.6% to ₹51.5B",
            "Summary": "Canara Bank reported a strong 25.6% year-on-year growth in Q3 net profit to ₹51.50 billion, marginally below analyst estimates of ₹52.00 billion but demonstrating solid financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1769672245596,
            "Source": "co_actions_results"
        },
        {
            "Title": "Canara Bank Alerts on Jan 27 Union Strike",
            "Summary": "Canara Bank informs stock exchanges about United Forum of Bank Unions strike scheduled for January 27, 2026, warning of potential disruptions to branch operations.",
            "Sentiment": "negative",
            "PublishDate": 1769329062800,
            "Source": "stocks"
        },
        {
            "Title": "Canara Bank Q3FY26 earnings call set for Jan 29",
            "Summary": "Canara Bank announces earnings call on January 29, 2026 at 4:00 PM IST to discuss Q3FY26 financial results, with media interactions scheduled for January 29-30, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768998763194,
            "Source": "co_actions_results"
        },
        {
            "Title": "Canara Bank Announces Bond Payment Schedule for 2026",
            "Summary": "Canara Bank releases detailed schedule for interest and principal payments on Basel III compliant bonds worth ₹49,403 crores, covering payment dates from February to December 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768407106838,
            "Source": "co_actions_results"
        },
        {
            "Title": "Canara Bank Completes ₹975.60 Cr Bond Payment",
            "Summary": "Canara Bank successfully completed annual interest payment of ₹75.60 crores and full redemption of ₹900 crores for its Basel III Tier II bonds on January 7, 2026, totaling ₹975.60 crores to bondholders.",
            "Sentiment": "positive",
            "PublishDate": 1767794497673,
            "Source": "co_actions_results"
        },
        {
            "Title": "Canara Bank Names Hardeep Singh Ahluwalia as Interim CEO",
            "Summary": "Canara Bank appoints Executive Director Hardeep Singh Ahluwalia as additional charge MD & CEO from January 1, 2026, for three months following K. Satyanarayana Raju's superannuation.",
            "Sentiment": "neutral",
            "PublishDate": 1767188660754,
            "Source": "stocks"
        },
        {
            "Title": "Canara Bank MD & CEO K. Satyanarayana Raju Retires",
            "Summary": "Canara Bank announces completion of tenure of MD & CEO Shri K. Satyanarayana Raju effective December 31, 2025, following superannuation as per government notification.",
            "Sentiment": "neutral",
            "PublishDate": 1767188471801,
            "Source": "stocks"
        },
        {
            "Title": "Canara Bank Completes ₹1,774 Cr Basel III Bond Payment",
            "Summary": "Canara Bank successfully completed annual interest payment of ₹139 crores and full redemption of ₹1,635 crores for Basel III Additional Tier I Bonds on December 31, 2025, totaling ₹1,774 crores.",
            "Sentiment": "positive",
            "PublishDate": 1767176041332,
            "Source": "co_actions_results"
        },
        {
            "Title": "Canara Bank Pays ₹1,772.5 Cr Interest on Tier II Bonds",
            "Summary": "Canara Bank successfully credited ₹1,772.5 crores as annual interest payment on Basel III compliant Tier II bonds to bondholders on December 24, 2025, maintaining its debt servicing commitments.",
            "Sentiment": "positive",
            "PublishDate": 1766567919633,
            "Source": "co_actions_results"
        },
        {
            "Title": "Canara Bank Added to BSE Bankex Index Today",
            "Summary": "Canara Bank gets included in BSE Bankex index restructuring at 3pm today, marking a significant development for the public sector banking stock.",
            "Sentiment": "positive",
            "PublishDate": 1766555374396,
            "Source": "stocks"
        },
        {
            "Title": "Canara Bank Completes ₹814.65 Cr Bond Payment",
            "Summary": "Canara Bank successfully credited ₹814.65 crores to bondholders on December 18, 2025, comprising ₹64.65 crores in annual interest and ₹750 crores in redemption payment for Basel III Tier II bonds.",
            "Sentiment": "positive",
            "PublishDate": 1766063109448,
            "Source": "co_actions_results"
        },
        {
            "Title": "Canara Bank Completes Rs 1,207.5 Crore Annual Interest Payment on Basel III Bonds",
            "Summary": "Canara Bank paid Rs 1,207.5 crore as annual interest on its Non-Convertible Basel III Compliant Additional Tier 1 Bonds with ISIN INE476A08134 on December 2, 2025. The interest payment was credited to bondholders' accounts through RTGS/NEFT/IBA/DD modes as per the terms of issue, with the record date being November 17, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1764685644286,
            "Source": "corporate_action"
        },
        {
            "Title": "Canara Bank Raises Rs 3,500 Crore Through Basel III Compliant Tier I Bonds",
            "Summary": "Canara Bank successfully issued Rs 3,500 crore worth of 7.55% unsecured, subordinated, perpetual Basel III compliant Additional Tier I bonds with a face value of Rs 1 crore each. The bonds were issued on November 28, 2025, allotted on December 2, 2025, and are proposed to be listed on NSE with annual interest payments scheduled for December 2 each year.",
            "Sentiment": "positive",
            "PublishDate": 1764682387569,
            "Source": "stock"
        },
        {
            "Title": "Canara Bank Promotes Kalyan Mukherjee to Chief General Manager of Hyderabad Circle",
            "Summary": "Canara Bank promoted Shri Kalyan Mukherjee from General Manager to Chief General Manager and Circle Head of Hyderabad Circle effective December 1, 2025. Mukherjee, a 30-year veteran who joined the bank in 1995, holds qualifications in B.Sc (Agriculture) and insurance certifications including CAIIB.",
            "Sentiment": "positive",
            "PublishDate": 1764578196296,
            "Source": "corporate_governance"
        },
        {
            "Title": "Centre Plans Merger of Canara Bank and Union Bank of India",
            "Summary": "The Centre is planning to merge Canara Bank with Union Bank of India as part of a consolidation strategy. The merger aims to create one of the four remaining major banks in the country's banking sector.",
            "Sentiment": "neutral",
            "PublishDate": 1764573019388,
            "Source": "order&deals"
        },
        {
            "Title": "Canara Bank Completes Rs 384 Crore Annual Interest Payment on Long-Term Bonds",
            "Summary": "Canara Bank paid Rs 384 crore as annual interest to bondholders of its non-convertible, unsecured long-term bonds with ISIN INE476A08209, featuring a 7.68% coupon rate. The payment was made on the due date of November 29, 2025, through RTGS/NEFT/IBA/DD modes to bondholders' bank accounts as per the terms of issue.",
            "Sentiment": "positive",
            "PublishDate": 1764417230922,
            "Source": "corporate_action"
        },
        {
            "Title": "RBI Imposes Rs. 4.35 Lakh Penalty on Canara Bank for Currency Chest Deficiencies",
            "Summary": "Reserve Bank of India imposed a monetary penalty of Rs. 4,35,550 on Canara Bank for shortage of notes, mutilated notes in currency chest balance and other deficiencies found during inspection conducted from October 29-31, 2025. The bank has disclosed that the impact on its financial, operational or other activities is not significant.",
            "Sentiment": "negative",
            "PublishDate": 1764167827496,
            "Source": "stock"
        },
        {
            "Title": "Bank of Maharashtra Appoints Prabhat Kiran as Executive Director",
            "Summary": "The Department of Financial Services appointed Shri Prabhat Kiran, former Chief General Manager at Canara Bank, as Executive Director of Bank of Maharashtra for three years effective November 24, 2025. Kiran brings 30 years of banking experience in SME-Corporate lending, Risk Management and International operations to his new leadership role at the public sector bank.",
            "Sentiment": "neutral",
            "PublishDate": 1764072489084,
            "Source": "corporate_governance"
        },
        {
            "Title": "Canara Bank Announces Interest Payment and Record Date for Basel III Tier II Bonds",
            "Summary": "Canara Bank has set January 7, 2026 as the interest payment date for its Basel III compliant Tier II bonds worth Rs 900 crore, with December 23, 2025 as the record date. The announcement affects bondholders who will be eligible to receive interest payments based on their holdings as of the record date.",
            "Sentiment": "neutral",
            "PublishDate": 1763730487728,
            "Source": "corporate_action"
        },
        {
            "Title": "Canara Bank Exercises Call Option on Basel III Additional Tier 1 Bonds Worth Rs 1,755 Crore",
            "Summary": "Canara Bank has decided to exercise call options on two Basel III compliant Additional Tier 1 bonds totaling Rs 1,755 crore. The first bond worth Rs 1,635 crore was issued on December 31, 2020, with an 8.50% coupon rate and will be called on December 31, 2025, with a record date of December 16, 2025. The second bond worth Rs 120 crore was issued on February 2, 2021, with an 8.30% coupon rate and will be called on February 24, 2026, with a record date of January 16, 2026. The bank received RBI approval on November 7, 2025, for exercising these call options. Both bonds had a minimum 5-year tenure before the call option could be exercised. Principal amounts along with accrued interest will be paid to bondholders on the respective call dates, after which the bank's liability towards bondholders will cease.",
            "Sentiment": "neutral",
            "PublishDate": 1762819377419,
            "Source": "corporate_action"
        },
        {
            "Title": "Canara Bank Receives Credit Ratings from CARE Ratings for Multiple Bond Instruments",
            "Summary": "Canara Bank received credit ratings from CARE Ratings Limited for various bond instruments totaling Rs. 30,750 crore. The bank received CARE AA+ Stable rating for Tier I Bonds worth Rs. 3,500 crore, while Infrastructure Bonds worth Rs. 20,000 crore and Tier II Bonds worth Rs. 7,250 crore received CARE AAA Stable ratings, with most being reaffirmed. CARE Ratings withdrew ratings for certain Tier II Bonds due to redemption and call option exercise. The rating agency highlighted the bank's established retail franchise, strong network in southern states, comfortable capital adequacy levels, and government ownership of 62.93% as key strengths. However, ratings noted relatively low CASA ratio compared to peers and moderate asset quality levels as areas of concern. The bank reported net profit of Rs. 17,027 crore in FY25 and Rs. 9,526 crore in H1FY26, with total business of Rs. 26.79 lakh crore as of September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762473533526,
            "Source": "corporate_action"
        },
        {
            "Title": "Canara Bank Chairman Vijay Srirangan's Tenure Ends",
            "Summary": "Vijay Srirangan ceased to be Part-Time Non-Official Director and Non-Executive Chairman on Canara Bank's Board following the completion of his tenure on November 6, 2025. The bank notified stock exchanges BSE and NSE about the leadership change through Company Secretary Santosh Kumar Barik.",
            "Sentiment": "neutral",
            "PublishDate": 1762463811319,
            "Source": "corporate_governance"
        },
        {
            "Title": "Canara Bank Shares Hit 52-Week High of Rs 141.45, Up 10% in 3 Sessions",
            "Summary": "Canara Bank shares reached a 52-week high of Rs 141.45, gaining 10% over three consecutive trading sessions. The rally follows strong quarterly results showing net profit of Rs 4,774 crore, up 19% year-on-year, and operating profit growth of 12.20% to Rs 8,588 crore. Global business expanded 13.55% to Rs 26,78,963 crore, with deposits rising 13.40% and advances increasing 13.74%. Asset quality improved significantly with gross NPAs declining 138 basis points to 2.35% and net NPAs falling to 0.54%. The bank's provision coverage ratio strengthened to 93.59%. Additional momentum comes from speculation that the government may raise foreign ownership limits in PSU banks to 49% from 20%, potentially unlocking $4 billion in passive inflows. Nuvama Institutional Equities estimates Canara Bank could attract $305 million in foreign flows from such a change.",
            "Sentiment": "positive",
            "PublishDate": 1762150062430,
            "Source": "stock"
        },
        {
            "Title": "Rekha Jhunjhunwala Increases Stakes in Canara Bank, Federal Bank, and Titan Company in Q2",
            "Summary": "Rekha Jhunjhunwala purchased 1 crore additional shares in Canara Bank during the second quarter of FY26, increasing her total holding to 1.57% or 14.23 crore shares. She also acquired 2.3 crore shares in Federal Bank, raising her stake to 2.4%, and bought 15 lakh shares in Titan Company, bringing her holding to 5.3%. The purchases come amid positive market sentiment for PSU banks due to potential FII cap increases from 20% to 49%, which could unlock $4 billion in passive inflows. Canara Bank reported strong Q2 results with 18.7% year-on-year growth in standalone net profit to Rs 4,773.96 crore and 12.2% growth in operating profit to Rs 8,588 crore. InCred Equities raised Canara Bank's target price to Rs 147 from Rs 127, maintaining an Add rating. The bank's shares have gained 40% over six months and 700% over five years.",
            "Sentiment": "positive",
            "PublishDate": 1761971092328,
            "Source": "stock"
        },
        {
            "Title": "Canara Bank Receives Credit Rating Updates from ICRA, Total Rated Amount Increases to Rs 29,900 Crore",
            "Summary": "ICRA has assigned and reaffirmed credit ratings for Canara Bank's debt instruments totaling Rs 29,900 crore, up from Rs 26,400 crore previously. The rating agency assigned [ICRA]AA+(Stable) to Rs 3,500 crore of Basel III Tier I bonds and reaffirmed existing ratings on other instruments. Basel III Tier I bonds worth Rs 7,500 crore received [ICRA]AA+(Stable) reaffirmation, while Basel III Tier II bonds of Rs 8,900 crore were reaffirmed at [ICRA]AAA(Stable). Certificates of deposit worth Rs 10,000 crore maintained their [ICRA]A1+ rating. The ratings reflect Canara Bank's sovereign ownership with 62.93% government stake, strong deposit franchise with 5.8% market share in net advances and 6.4% in total deposits. The bank reported healthy capital ratios with CET1 at 12.29% and total capital at 14.58% as of June 30, 2025. ICRA noted the bank's robust profitability profile and expects it to maintain steady credit metrics with stable asset quality.",
            "Sentiment": "positive",
            "PublishDate": 1761852779086,
            "Source": "corporate_action"
        },
        {
            "Title": "Canara Bank Plans Bond Fundraising in Q3, Targets INR 95 Billion by FY26",
            "Summary": "Canara Bank plans to raise part of its approved funds through bonds in Q3, with a target to collect a total of INR 95 billion through bonds by FY26. The bank also reported higher credit demand in October during the festival season.",
            "Sentiment": "positive",
            "PublishDate": 1761816580564,
            "Source": "stock"
        },
        {
            "Title": "Canara Bank Discusses PSU Bank Mergers on Conference Call, No Government Updates Shared",
            "Summary": "Canara Bank addressed the topic of PSU bank mergers during a conference call. The bank indicated that no updates have been received from the government regarding potential mergers in the public sector banking space.",
            "Sentiment": "neutral",
            "PublishDate": 1761816183350,
            "Source": "stock"
        },
        {
            "Title": "Canara Bank Reports Decline in Fresh Slippages to 20.3 Billion Rupees",
            "Summary": "Canara Bank reported fresh slippages of 20.3 billion rupees in its quarterly results, compared to 21.3 billion rupees in the previous quarter. This represents a quarter-on-quarter decrease of 1 billion rupees in fresh slippages for the bank.",
            "Sentiment": "positive",
            "PublishDate": 1761809134661,
            "Source": "earnings"
        },
        {
            "Title": "Canara Bank Reports Strong Q2 Performance with Higher Profits and Improved Asset Quality",
            "Summary": "Canara Bank reported total income of Rs 315 billion in Q2, up from Rs 297 billion year-on-year. The bank's asset quality improved with gross non-performing assets (GNPA) declining to 2.35% from 2.69% quarter-on-quarter, while net non-performing assets (NNPA) decreased to 0.54% from 0.63% quarter-on-quarter. Provisions for NPAs reduced to Rs 15 billion from Rs 18.45 billion quarter-on-quarter. Net profit increased to Rs 48 billion compared to Rs 40 billion year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1761807994920,
            "Source": "earnings"
        },
        {
            "Title": "Canara Bank Completes Rs 126 Crore Annual Interest Payment on Basel III Bonds",
            "Summary": "Canara Bank paid Rs 126 crore as annual interest on its Basel III compliant Additional Tier 1 bonds with ISIN INE476A08126. The payment was made on October 27, 2025, two days after the original due date of October 25, 2025, as the due date fell on a holiday. The bonds have a coupon rate of 8.40% and an issue size of Rs 1,500 crore. The interest payment record date was October 10, 2025, and the previous interest payment was made on October 25, 2024. The payment was credited to bondholders' accounts through RTGS/NEFT/IBA/DD modes.",
            "Sentiment": "neutral",
            "PublishDate": 1761567124747,
            "Source": "corporate_action"
        },
        {
            "Title": "Canara Bank Schedules Media Meet and Earnings Call for Q2 Results Discussion",
            "Summary": "Canara Bank has announced the schedule for its media meet and earnings call with analysts and investors to discuss the unaudited financial results for the second quarter and half year ended September 30, 2025. The events include a media interaction on October 30, 2025, at 2:30 p.m., and an earnings call with analysts and investors on October 31, 2025, at 9:30 a.m. The bank's board meeting is scheduled for October 30, 2025, to consider and approve the unaudited standalone and consolidated financial results. The senior management team will be represented by MD & CEO K. Satyanarayana Raju, and Executive Directors Hardeep Singh Ahluwalia, Bhavendra Kumar, and S K Majumdar during the earnings call.",
            "Sentiment": "neutral",
            "PublishDate": 1761052853703,
            "Source": "earnings"
        },
        {
            "Title": "Canara Bank Reduces Stake in Canara HSBC Life Insurance to 36.50% Through IPO",
            "Summary": "Canara Bank has reduced its stake in Canara HSBC Life Insurance Company Limited from 51% to 36.50% through an Initial Public Offer. The subsidiary company was listed on the National Stock Exchange of India Limited and BSE Limited on October 17, 2025. This stake divestment was completed through the public offering process, with the insurance company now trading on both major Indian stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1760699433594,
            "Source": "corporate_action"
        },
        {
            "Title": "Canara Bank Reduces Stake in Canara Robeco Asset Management to 38% Through IPO",
            "Summary": "Canara Bank has reduced its ownership stake in Canara Robeco Asset Management Company Limited from 51% to 38% through an Initial Public Offer. The subsidiary company was listed on both the National Stock Exchange of India Limited and BSE Ltd on October 16, 2025. This divestment represents a partial exit by Canara Bank from its asset management subsidiary while maintaining a significant minority stake.",
            "Sentiment": "neutral",
            "PublishDate": 1760622221374,
            "Source": "corporate_action"
        },
        {
            "Title": "Canara Bank Achieves 90% Recovery Through ₹520 Crore Sale of Karanja Terminal",
            "Summary": "Canara Bank is set to recover approximately 90% of its exposure from the sale of Karanja Terminal & Logistics, a non-performing asset. The infrastructure company owes lenders about ₹600 crore. Through a Swiss challenge process, Canara Bank received a binding offer of ₹520 crore from Prudent Asset Reconstruction Company (ARC), which exceeded the promoter's one-time settlement offer of ₹475 crore. The bidding process began with a base price of ₹428 crore. Against total outstanding dues of ₹606 crore as of August 31, 2025, including ₹457 crore principal owed to a consortium led by Canara Bank along with Bank of Baroda and Punjab & Sind Bank, the sale represents significant recovery. However, the borrower has challenged the sale in high court, with the verdict still pending. Karanja Terminal is an SPV formed by Mercantile Ports and Logistics to develop a port and logistics facility in Raigad district, Maharashtra.",
            "Sentiment": "positive",
            "PublishDate": 1759798515661,
            "Source": "stock"
        },
        {
            "Title": "Canara HSBC Life Insurance Files Updated Draft Prospectus with SEBI",
            "Summary": "Canara HSBC Life Insurance Company Limited, a subsidiary of Canara Bank, filed an updated Draft Red Herring Prospectus (UDRHP) with SEBI on September 26, 2025. The filing is in preparation for a potential securities issuance. Canara Bank informed the BSE and NSE stock exchanges about this development through an official communication from Company Secretary Santosh Kumar Barik.",
            "Sentiment": "neutral",
            "PublishDate": 1758867128851,
            "Source": "corporate_action"
        },
        {
            "Title": "Canara Bank Shares Rise 2.2% on Strong Trading Volumes, Near 52-Week High",
            "Summary": "Canara Bank shares gained 2.2% to reach an intraday high of Rs 117.85, approaching its 52-week high of Rs 119.30. The stock opened at Rs 115.50 and maintained positive momentum throughout the session. Trading activity was robust with 6.65 lakh shares traded and turnover of Rs 7.80 crore. Technical indicators show the stock trading above key moving averages, with the 5-day EMA at Rs 113.9, 10-day EMA at Rs 112.2, and 20-day EMA at Rs 110.6. The RSI stood at 68.94, approaching overbought levels but maintaining firm momentum. The volume-weighted average price was Rs 117.28, indicating consistent buying interest.",
            "Sentiment": "positive",
            "PublishDate": 1758260602646,
            "Source": "stock"
        },
        {
            "Title": "Canara Bank Extends Executive Director Hardeep Singh Ahluwalia's Term Until 2027",
            "Summary": "Canara Bank has extended the term of office for Hardeep Singh Ahluwalia as Executive Director. His term, originally ending on 06.02.2026, has been extended until his superannuation on 30.06.2027 or until further orders, whichever is earlier. The extension was approved by the Department of Financial Services, Ministry of Finance, Government of India through a notification dated 15th September 2025. Ahluwalia began his banking career in 1992 as an Agricultural Field Officer at Allahabad Bank and has over three decades of experience across various banking functions in India and abroad. He previously served as General Manager of the Recovery Department at Indian Bank's corporate office before joining Canara Bank as Executive Director.",
            "Sentiment": "positive",
            "PublishDate": 1758090380977,
            "Source": "corporate_governance"
        },
        {
            "Title": "Canara Bank Appoints Balakrishna Raghavendra Rao as Shareholder Director, Cancels EGM",
            "Summary": "Canara Bank appointed Balakrishna Raghavendra Rao as Shareholder Director effective September 13, 2025, with his term extending until November 29, 2027. The appointment was deemed automatic as only one valid nomination was received for the single vacancy position. The Extraordinary General Meeting scheduled for September 25, 2025, for the director election has been cancelled due to the uncontested nomination. Rao, aged 62 years, brings over 33 years of banking experience and previously served as Deputy Managing Director at State Bank of India. He holds a Post Graduate Degree in Instrumentation Engineering and is a Certified Associate of Indian Institute of Bankers. The bank confirmed that Rao is not related to any existing directors and is not debarred from holding directorship by any regulatory authority.",
            "Sentiment": "neutral",
            "PublishDate": 1757663057414,
            "Source": "corporate_governance"
        },
        {
            "Title": "Canara Bank Chief Digital Officer Vishal Bhatia Resigns Due to Personal Reasons",
            "Summary": "Vishal Bhatia has resigned from his position as Chief Digital Officer at Canara Bank, effective August 14, 2025. Bhatia, who was serving on a contract basis, cited personal reasons for his departure as he plans to relocate to Mumbai with his family. The bank has notified stock exchanges BSE and NSE about this management change.",
            "Sentiment": "neutral",
            "PublishDate": 1755184708060,
            "Source": "corporate_governance"
        },
        {
            "Title": "Canara Bank Gets RBI Approval to Exercise Call Option on Basel III Additional Tier I Bonds Worth Rs 1,181 Crore",
            "Summary": "Canara Bank received Reserve Bank of India approval to exercise call options on two Basel III compliant Additional Tier I Bonds totaling Rs 1,181.10 crore. The bank will exercise the call option on bonds worth Rs 1,012 crore (ISIN: INE476A08084) on September 11, 2025, and bonds worth Rs 169.10 crore (ISIN: INE476A08092) on September 29, 2025. Both perpetual bonds carry an 8.30% coupon rate and were originally issued in September 2020. The RBI granted permission through a letter dated August 5, 2025, and the bank is proceeding to exercise the call options on their respective due dates as per the original terms of issuance.",
            "Sentiment": "neutral",
            "PublishDate": 1754400514220,
            "Source": "corporate_action"
        },
        {
            "Title": "Canara Bank Officials May Face ED Questioning in Anil Ambani Reliance Group Case",
            "Summary": "The Enforcement Directorate may call Canara Bank officials for questioning if the bank's responses in the Anil Ambani Reliance Group case are deemed unsatisfactory. This development indicates ongoing regulatory scrutiny involving the bank and the Reliance Group entity.",
            "Sentiment": "negative",
            "PublishDate": 1754281650420,
            "Source": "stock"
        },
        {
            "Title": "Canara Bank Shares Worth Rs. 67.22 Crores Traded in NSE Block Deal",
            "Summary": "Canara Bank witnessed a block trade on NSE involving approximately 6,160,789 shares at a price of Rs. 109.11 per share, totaling Rs. 67.22 crores. The transaction represents a significant bulk deal in the bank's shares.",
            "Sentiment": "neutral",
            "PublishDate": 1753857507292,
            "Source": "order&deals"
        },
        {
            "Title": "Canara Bank Plans Priority Sector Loan Sale to Counter Margin Pressure from Rate Cuts",
            "Summary": "Canara Bank plans to sell excess priority sector loans in the current quarter to offset margin stress from declining interest rates. The bank's priority sector loans stand at 45.63% of total loans, above the regulatory requirement of 40%. MD K Satyanarayana Raju indicated the bank's Net Interest Margin guidance of 2.75% appears challenging due to RBI's 100 basis point rate cut this year, with expectations of further cuts as inflation dropped below 3%. The bank earned Rs 1,248 crore commission from priority sector loan sales in the June quarter. Canara Bank also plans to list two subsidiaries - Canara Robeco AMC (selling 13% stake) and Canara HSBC Life Insurance (diluting 14.5% stake) - while maintaining majority ownership. The bank reported 22% growth in net profit to Rs 4,752 crore for the June quarter, with total income rising to Rs 38,063 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1753638363265,
            "Source": "stock"
        },
        {
            "Title": "Canara Bank Appoints New Shareholder Directors for Three-Year Term",
            "Summary": "Canara Bank has announced board changes with Ms. Abha Singh Yaduvanshi being re-elected and Shri Gunjeet Singh Pannu being newly elected as Shareholder Directors for a three-year term from July 27, 2025 to July 26, 2028. Ms. Yaduvanshi, aged 63, holds qualifications in Economics and Business Administration and previously served as Additional Secretary at Lok Sabha Secretariat. She has been serving as a Shareholder Director since July 27, 2022. Shri Pannu, aged 63, is a qualified Chartered Accountant and lawyer with over 39 years of experience, having served as Vice-President of the Income Tax Appellate Tribunal. Both directors are appointed under Section 9(3)(i) of the Banking Companies Act, 1970 and are not related to any existing directors of the bank. Shri Bimal Prasad Sharma ceased to be a Shareholder Director upon completion of his tenure on July 26, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753597106170,
            "Source": "corporate_governance"
        },
        {
            "Title": "Canara Bank CEO Expects Strong Business Momentum in H2 FY26 Despite Q1 Challenges",
            "Summary": "Canara Bank MD and CEO K Satyanarayana Raju expects business momentum to improve in the second half of FY26 after a sluggish first quarter. The bank reported a 22% year-on-year jump in Q1 net profit to Rs 4,752 crore, driven primarily by strong non-interest income including Rs 1,200 crore from PSLC income and 16% fee income growth. However, Net Interest Income declined 1.71% to Rs 9,009 crore due to falling yields on advances, which dropped from 8.83% to 8.47% following RBI repo rate cuts. The bank's Net Interest Margin compressed from 2.9% to 2.55%, while Return on Assets fell to 1.14% but still exceeded the bank's 1.05% guidance. CASA deposits declined mainly due to seasonal reduction in institutional deposits, falling from Rs 77,800 crore to Rs 54,000 crore. Raju expects to maintain the 1.14% ROA going forward and anticipates improved returns in the second half as banking sector business typically peaks during that period.",
            "Sentiment": "positive",
            "PublishDate": 1753591018532,
            "Source": "stock"
        },
        {
            "Title": "Canara Bank Announces Interest Payment Schedule for Basel III Bonds from August to December 2025",
            "Summary": "Canara Bank has disclosed interest payment due dates and record dates for its Basel III Compliant Tier I and Tier II Bonds covering August to December 2025. The bonds, totaling approximately Rs 26,089 crore across 15 instruments, carry interest rates ranging from 7.09% to 8.62%. The bank will exercise call options on four bonds subject to RBI approval, with amounts of Rs 1,012 crore, Rs 169.10 crore, Rs 1,635 crore, and Rs 120 crore. Two bonds will reach maturity in December 2025, with principal and interest payments due on maturity dates. Several payment and record dates have been adjusted due to holidays in accordance with SEBI guidelines and bond terms.",
            "Sentiment": "neutral",
            "PublishDate": 1753449148537,
            "Source": "corporate_action"
        }
    ]
}