{
    "Symbol": "CANFINHOME",
    "ISIN": "INE477A01020",
    "News": [
        {
            "Title": "Can Fin Homes Gets RBI Nod for CEO Re-appointment",
            "Summary": "Can Fin Homes Limited receives RBI approval for re-appointment of Suresh Srinivasan Iyer as Managing Director & CEO for two years from March 18, 2026. Shareholder approval to be sought next.",
            "Sentiment": "positive",
            "PublishDate": 1769596068571,
            "Source": "stocks"
        },
        {
            "Title": "Can Fin Homes Q3FY26 PAT Grows 25% YoY to ₹2.60 Billion",
            "Summary": "Can Fin Homes reports strong Q3FY26 results with PAT up 25% YoY to ₹2.60 billion and NII growing 22% YoY to ₹4.20 billion. Motilal Oswal maintains neutral rating with target price of ₹1,015.",
            "Sentiment": "neutral",
            "PublishDate": 1768987179583,
            "Source": "co_actions_results"
        },
        {
            "Title": "Can Fin Homes Gets Accumulate Rating with ₹1,015 Target",
            "Summary": "Prabhudas Lilladher maintains accumulate rating on Can Fin Homes with target price of ₹1,015, citing improved disbursements in Karnataka and Telangana despite elevated operational expenses.",
            "Sentiment": "positive",
            "PublishDate": 1768893867183,
            "Source": "stocks"
        },
        {
            "Title": "Can Fin Homes Plans 250-Member Sales Team by FY28",
            "Summary": "Can Fin Homes announces strategic expansion plan to grow sales team from current levels to 250 people by FY28, starting with 150 additions next year to reduce DSA dependency and diversify sourcing channels.",
            "Sentiment": "positive",
            "PublishDate": 1768881565848,
            "Source": "stocks"
        },
        {
            "Title": "Can Fin Homes Plans 300 Branches by FY28",
            "Summary": "Can Fin Homes announces aggressive expansion plan to reach 300 branches by FY28, targeting 25 new branches annually across North, West, Tamil Nadu, East, and Andhra Pradesh regions.",
            "Sentiment": "positive",
            "PublishDate": 1768881538123,
            "Source": "stocks"
        },
        {
            "Title": "Can Fin Homes Q4 FY26 Disbursement Target Set",
            "Summary": "Can Fin Homes management projects Q4 FY26 disbursements between ₹3,200-3,300 crores, targeting full-year guidance of ₹10,500 crores during recent concall update.",
            "Sentiment": "positive",
            "PublishDate": 1768881451874,
            "Source": "stocks"
        },
        {
            "Title": "Jefferies Issues Buy Rating for Can Fin Homes",
            "Summary": "Jefferies maintains a Buy recommendation on Can Fin Homes with a target price of ₹1,140.00, indicating positive outlook for the housing finance company's stock performance.",
            "Sentiment": "positive",
            "PublishDate": 1768881014460,
            "Source": "stocks"
        },
        {
            "Title": "Can Fin Homes Q3FY26 Net Profit Surges 24.8% YoY",
            "Summary": "Can Fin Homes reported strong Q3FY26 results with net profit rising 24.8% to ₹264.78 crores and total income growing 8.8% to ₹1,073.16 crores compared to Q3FY25.",
            "Sentiment": "positive",
            "PublishDate": 1768815247457,
            "Source": "co_actions_results"
        },
        {
            "Title": "Can Fin Homes Q3 Net Profit Jumps 30% to ₹260 Cr",
            "Summary": "Can Fin Homes reported strong Q3 performance with net profit rising 30% YoY to ₹260 crores, while revenue grew 8.16% to ₹1,060 crores compared to previous year.",
            "Sentiment": "positive",
            "PublishDate": 1768794845936,
            "Source": "co_actions_results"
        },
        {
            "Title": "Can Fin Homes Q3FY26 Earnings Call on Jan 19",
            "Summary": "Can Fin Homes Limited announces earnings conference call scheduled for January 19, 2026 at 3:00 PM IST to discuss Q3FY26 unaudited financial results, organized by Investec Capital Services.",
            "Sentiment": "neutral",
            "PublishDate": 1768400089114,
            "Source": "co_actions_results"
        },
        {
            "Title": "Can Fin Homes Q3FY26 Earnings Call on Jan 19",
            "Summary": "Can Fin Homes Limited announces earnings conference call scheduled for January 19, 2026 at 3:00 PM IST to discuss Q3FY26 unaudited financial results with senior management team.",
            "Sentiment": "neutral",
            "PublishDate": 1768290589406,
            "Source": "co_actions_results"
        },
        {
            "Title": "Can Fin Homes Q3FY26 earnings call on Jan 19",
            "Summary": "Can Fin Homes Limited announces earnings conference call scheduled for January 19, 2026 at 3:00 PM IST to discuss Q3FY26 unaudited financial results with senior management team.",
            "Sentiment": "neutral",
            "PublishDate": 1768290095817,
            "Source": "co_actions_results"
        },
        {
            "Title": "Can Fin Homes submits Q3 FY26 Commercial Paper certificate",
            "Summary": "Can Fin Homes Limited submitted utilization certificate for Commercial Paper proceeds worth ₹500 crores for Q3 FY26, confirming compliance with SEBI regulations and proper fund utilization for working capital needs.",
            "Sentiment": "neutral",
            "PublishDate": 1767789297236,
            "Source": "stocks"
        },
        {
            "Title": "Can Fin Homes Chairman K Satyanarayana Raju Resigns",
            "Summary": "Can Fin Homes Limited announces resignation of Chairman Shri K Satyanarayana Raju effective December 31, 2025, following his superannuation as Managing Director and CEO of Canara Bank.",
            "Sentiment": "neutral",
            "PublishDate": 1767190797540,
            "Source": "stocks"
        },
        {
            "Title": "Morgan Stanley Rolls Can Fin Homes Valuation Forward",
            "Summary": "Morgan Stanley updates Can Fin Homes' risk-reward assessment, rolling valuation to March 2027 with 6% increase in scenario values. Maintains 'overweight' rating with ₹1,060 base-case target.",
            "Sentiment": "positive",
            "PublishDate": 1767149391283,
            "Source": "stocks"
        },
        {
            "Title": "Can Fin Homes Declares ₹7 Per Share Dividend",
            "Summary": "Can Fin Homes has announced a dividend payment of ₹7.00 per share for its shareholders, reflecting the company's commitment to returning value to investors.",
            "Sentiment": "positive",
            "PublishDate": 1765843369409,
            "Source": "co_actions_results"
        },
        {
            "Title": "Can Fin Homes Credits ₹7 Interim Dividend to Shareholders",
            "Summary": "Can Fin Homes successfully credited interim dividend of ₹7.00 per share (350%) to eligible shareholders on December 29, 2025, completing the payment process announced earlier.",
            "Sentiment": "positive",
            "PublishDate": 1765807594999,
            "Source": "co_actions_results"
        },
        {
            "Title": "India Ratings Upgrades Can Fin Homes to IND AAA from IND AA+",
            "Summary": "India Ratings upgraded Can Fin Homes Limited's Long-Term Issuer Rating to IND AAA from IND AA+ with stable outlook, along with its NCDs and subordinated debt programmes. The upgrade reflects expectation of timely liquidity and equity support from parent Canara Bank, which holds 29.99% stake, following RBI's lifting of proposed restrictions on overlapping business lines between banks and subsidiaries.",
            "Sentiment": "positive",
            "PublishDate": 1765348201355,
            "Source": "corporate_action"
        },
        {
            "Title": "CanFin Homes Schedules Board Meeting to Consider Interim Dividend for FY 2025-26",
            "Summary": "CanFin Homes Limited has scheduled a Board of Directors meeting on December 15, 2025, to consider and approve the proposal for declaration and payment of interim dividend for Financial Year 2025-26. The company has fixed December 19, 2025, as the record date for determining shareholder eligibility and closed the trading window from December 8-17, 2025, for designated persons including promoters and connected individuals.",
            "Sentiment": "positive",
            "PublishDate": 1765178119514,
            "Source": "corporate_action"
        },
        {
            "Title": "Can Fin Homes Conducts Investor-Analyst Meetings in Mumbai",
            "Summary": "Can Fin Homes' Managing Director CEO Suresh S Iyer and CFO Abhishek Mishra participated in investor-analyst meetings arranged by DAM Capital in Mumbai. The discussions covered Q2 FY25-26 financial results, NIM, growth prospects, asset quality, and business outlook, with no unpublished price sensitive information shared.",
            "Sentiment": "neutral",
            "PublishDate": 1764853772085,
            "Source": "stock"
        },
        {
            "Title": "Can Fin Homes Grants 1,76,377 Stock Options Under Employee Stock Option Scheme 2024",
            "Summary": "Can Fin Homes Limited's Nomination Remuneration and HR Committee approved the grant of 1,76,377 stock options under Tranche 2 to identified employees on November 29, 2025. The options cover equity shares of face value Rs. 2 each, with a maximum vesting period of 4 years and exercise period of 3 years from vesting date.",
            "Sentiment": "positive",
            "PublishDate": 1764423468180,
            "Source": "corporate_action"
        },
        {
            "Title": "Can Fin Homes Completes Redemption of Rs. 500 Crore Commercial Paper",
            "Summary": "Can Fin Homes Limited has confirmed the redemption of its commercial paper issue worth Rs. 500 crore that was due on November 12, 2025. The company paid the redemption amount by crediting funds to the bank accounts of eligible commercial paper holders. The commercial paper carried an interest rate of 5.92% and was identified as CFHLCP10FY26. The company has filed corporate action forms with the depository for extinguishment of these securities and informed BSE Limited about the completion of this redemption process.",
            "Sentiment": "neutral",
            "PublishDate": 1762966611802,
            "Source": "corporate_action"
        },
        {
            "Title": "Can Fin Homes Reports Strong Q2 FY26 Performance with Record Disbursements and Improved Margins",
            "Summary": "Can Fin Homes achieved record quarterly disbursements of INR 2,500 crores in Q2 FY26, marking the first time crossing this threshold in any second quarter. The company reported improved financial metrics with Net Interest Margin crossing 4% and spread increasing from 2.62% to 2.79%. Total delinquency reduced by INR 130 crores to approximately INR 3,850 crores, leading to minimal credit costs of only INR 3 crores for growth provisioning. Karnataka operations showed significant recovery with September disbursements reaching INR 270 crores compared to INR 78 crores in the previous year's Q2. The company received NHB refinance sanction of INR 1,500 crores at an indicative blended rate of 6.8%. IT transformation implementation progressed as scheduled with first phase modules going live on September 30. For Q3, the company maintains disbursement guidance at INR 2,500 crores considering IT transformation impact, while targeting overall annual disbursements of INR 10,500 crores and 12-13% AUM growth. Management guided for spread of 2.75% and NIM of 3.75% going forward, expecting further delinquency reduction of INR 100 crores in Q3.",
            "Sentiment": "positive",
            "PublishDate": 1761399435833,
            "Source": "earnings"
        },
        {
            "Title": "Can Fin Homes Sets Financial Targets with 2.75% Spread and 15% AUM Growth Goal",
            "Summary": "Can Fin Homes has announced several financial projections and targets. The company predicts a 2.75% spread and 3.75% net interest margin (NIM) going forward. Credit costs for FY26 are expected to be lower than the anticipated 15 basis points. The company targets ₹2,500 crore in disbursements for Q3 FY26, which is below potential due to IT system changes. Can Fin Homes maintains its full-year FY26 guidance of 12-13% AUM growth and ₹10,500 crore in total disbursements. The company aims for 15% AUM growth starting from FY27.",
            "Sentiment": "positive",
            "PublishDate": 1761189909735,
            "Source": "stock"
        },
        {
            "Title": "Can Fin Homes Conducts Earnings Call to Discuss Q2 FY26 Results",
            "Summary": "Can Fin Homes Limited held an earnings call on October 20, 2025, discussing Q2 FY26 financial results with investors and analysts. The call was conducted digitally from 11:00 AM to 12:10 PM and was attended by Managing Director and CEO Suresh S Iyer and Chief Financial Officer Abhishek Mishra. The session was arranged by Investec Capital Services and moderated by Nidhesh Jain. Discussions covered Q2 FY26 financial results, future business prospects, asset quality, growth, borrowings, loan book, profitability, geographies, cost, NIM, spread, provisions, and expansion plans. The audio recording of the earnings call has been made available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1760967109352,
            "Source": "earnings"
        },
        {
            "Title": "Can Fin Homes Reports 18.9% Jump in Net Profit to ₹251.43 Crore in Q2",
            "Summary": "Can Fin Homes Limited reported net profit after tax of ₹251.43 crore for the quarter ended September 30, 2025, compared to ₹211.49 crore in the same quarter last year, representing an 18.9% increase. For the half-year period, net profit rose to ₹475.30 crore from ₹411.13 crore in the previous year. Total income from operations increased to ₹1,049.45 crore in Q2 from ₹962.69 crore year-on-year. Interest income grew to ₹1,043.17 crore from ₹955.25 crore. The company's loan book stood at ₹39,078.29 crore as of September 30, 2025. Earnings per share for the half-year period was ₹35.70 compared to ₹30.88 in the previous year. The company maintained 100% asset cover on its secured non-convertible debentures and reported gross non-performing assets at 0.94% and net non-performing assets at 0.50%.",
            "Sentiment": "positive",
            "PublishDate": 1760793963390,
            "Source": "earnings"
        },
        {
            "Title": "Can Fin Homes Transfers 284,276 Equity Shares to IEPF Under Companies Act Compliance",
            "Summary": "Can Fin Homes Limited has transferred 284,276 equity shares belonging to 371 shareholders to the Investor Education and Protection Fund under Section 124 of the Companies Act, 2013 and IEPF Rules, 2016. The transfer was made after sending required intimation to shareholders for claiming the final dividend for FY 2017-18. Of the transferred shares, 143,396 shares from 169 shareholders were from the company's Unclaimed Suspense Account.",
            "Sentiment": "neutral",
            "PublishDate": 1758804978757,
            "Source": "corporate_action"
        },
        {
            "Title": "Can Fin Homes Board Approves ₹10,000 Crore NCD Issue Through Private Placement",
            "Summary": "Can Fin Homes' board has approved the issuance of Non-Convertible Debentures (NCDs) worth ₹10,000 crore through private placement. This debt instrument will allow the housing finance company to raise funds from select investors without offering the securities to the general public.",
            "Sentiment": "positive",
            "PublishDate": 1756913739444,
            "Source": "corporate_action"
        },
        {
            "Title": "Can Fin Homes Conducts Investor Meet with Premji Invest on Q1 FY25-26 Results",
            "Summary": "Can Fin Homes Limited held a one-on-one investor meeting with representatives from Premji Invest on August 22, 2025, from 5:00 pm to 6:50 pm at their Bengaluru office. The meeting was attended by Managing Director & CEO Suresh Iyer and Chief Financial Officer Abhishek Mishra. Discussions covered Q1 FY25-26 financial results, net interest margin (NIM), growth, run-off ratios, future business prospects, cost, spread, loan book, profitability, asset quality, geographies, borrowings, and provisions.",
            "Sentiment": "neutral",
            "PublishDate": 1755872320185,
            "Source": "stock"
        },
        {
            "Title": "Can Fin Homes Declares Rs 6 Final Dividend Per Share, Q1 Profit Rises 12%",
            "Summary": "Can Fin Homes Ltd. declared a final dividend of Rs 6 per equity share for the financial year ended March 2025, approved by shareholders at the 38th annual general meeting. The dividend will be settled within 30 days through electronic transfer to registered bank accounts, with total disbursement amounting to Rs 80 crore. The company reported quarterly results showing net profit increased 12% to Rs 224 crore from Rs 200 crore, while total income grew 9.6% to Rs 1,020 crore from Rs 931 crore. Shares closed 1.56% higher at Rs 780.10 on NSE, though the stock has declined 7.97% over the past 12 months and gained 2.74% year-to-date. Among 21 analysts covering the stock, 17 recommend 'buy' and 4 suggest 'hold', with the average 12-month price target indicating potential upside of 16.3%.",
            "Sentiment": "positive",
            "PublishDate": 1755694363957,
            "Source": "corporate_action"
        },
        {
            "Title": "Can Fin Homes Appoints Hardeep Singh Ahluwalia as Non-Executive Director Following RBI Approval",
            "Summary": "Can Fin Homes Limited appointed Shri Hardeep Singh Ahluwalia as an Additional Director in the category of Non-Executive, Non-Independent Director, representing promoter Canara Bank. The appointment became effective from August 06, 2025, following approval from the Reserve Bank of India for a term not exceeding five years. Ahluwalia, who serves as Executive Director of Canara Bank, brings over three decades of banking experience across various functional areas including rural, semi-urban, urban, and metro geographies in India and abroad. His tenure will continue until he holds the position of Executive Director in Canara Bank or for five years as approved by RBI, whichever is earlier. The company will seek shareholder approval for this appointment.",
            "Sentiment": "neutral",
            "PublishDate": 1754484562360,
            "Source": "corporate_governance"
        },
        {
            "Title": "Can Fin Homes Conducts Investor Meeting with East Lane Capital to Discuss Q1 FY25-26 Results",
            "Summary": "Can Fin Homes Limited held a one-on-one video conference meeting with representatives of East Lane Capital LLP on July 31, 2025. The meeting was conducted from 11:30 am to 12:30 pm and included the company's Managing Director & CEO Suresh Iyer, Deputy Managing Director Vikram Saha, and Chief Financial Officer Abhishek Mishra. The discussion covered Q1 FY25-26 financial results and various business metrics including NIM, growth, run-off ratios, future business prospects, cost, spread, loan book, profitability, asset quality, geographies, borrowings, and provisions. The topics discussed were detailed in the company's Q1 FY25-26 financial results disclosure and investor presentation previously submitted to stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1753970101297,
            "Source": "stock"
        },
        {
            "Title": "Can Fin Homes Conducts Investor Meetings to Discuss Q1 FY25-26 Results",
            "Summary": "Can Fin Homes Limited held investor and analyst meetings via video conference on July 29, 2025. The meetings included discussions on Q1 FY 25-26 financial results, business prospects, loan book, profitability, asset quality, and other financial metrics with representatives from Helios Mutual Fund and Trust Mutual Fund. Company executives including Managing Director & CEO Suresh Iyer, Deputy Managing Director Vikram Saha, and Chief Financial Officer Abhishek Mishra participated in the sessions. The discussions covered net interest margin, growth, run-off ratios, future business prospects, cost, spread, geographies, borrowings, and provisions.",
            "Sentiment": "neutral",
            "PublishDate": 1753795659331,
            "Source": "stock"
        },
        {
            "Title": "Can Fin Homes Reports Record Q1 Disbursements of INR 2,000 Crores, Reduces Delinquency Despite NPA Rise",
            "Summary": "Can Fin Homes achieved its highest-ever first quarter disbursements of INR 2,000 crores, marking 9% growth. The company reduced total delinquency by INR 280 crores compared to March levels, representing the lowest delinquency percentage in five quarters. However, NPAs increased by INR 45 crores, including INR 13.90 crores from 96 sticky accounts deliberately moved to NPA for recovery. North zone showed 40%+ growth, Tamil Nadu 35%+, and West zone 15%, while East zone turned positive with 40%+ growth. Karnataka remained flat due to e-khata issues, though the state government announced solutions. The company expanded its sales team from 39 to 100 people and passed 25 basis points rate cuts to customers. Cost-to-income ratio increased due to salary revisions and branch expansion costs. Management maintains guidance of INR 10,500 crores annual disbursements, 3.5% NIM, and 15 basis points credit cost.",
            "Sentiment": "positive",
            "PublishDate": 1753526071579,
            "Source": "earnings"
        },
        {
            "Title": "Can Fin Homes Conducts Q1 FY26 Earnings Call with Investors and Analysts",
            "Summary": "Can Fin Homes Limited held an earnings call on July 21, 2025, from 3:00 PM to 4:30 PM IST to discuss Q1 FY26 financial results with investors and analysts. The call was attended by key management including Managing Director and CEO Suresh S Iyer, Deputy Managing Director Vikram Saha, President Prakash Shanbhogue, and Chief Financial Officer Abhishek Mishra. The session was arranged by Investec Capital Services and moderated by Nidhesh Jain. Discussions covered Q1 FY26 financial results, future business prospects, asset quality, growth, borrowings, loan book, profitability, geographies, cost, NIM, spread, provisions, and expansion plans. The audio recording of the earnings call has been made available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1753158679204,
            "Source": "earnings"
        },
        {
            "Title": "Can Fin Homes Publishes Q1 FY2026 Financial Results in Newspapers",
            "Summary": "Can Fin Homes Limited published its unaudited standalone financial results for the first quarter ended June 30, 2025 in Financial Express and Kannada Prabha newspapers on July 21, 2025. The company provided a Quick Response Code and weblink for accessing the complete financial results. The publication was made available on both English and regional language newspapers to ensure broader accessibility for stakeholders.",
            "Sentiment": "neutral",
            "PublishDate": 1753156480990,
            "Source": "earnings"
        },
        {
            "Title": "CANFIN HOMES Reports Higher Asset Quality Deterioration in Q1",
            "Summary": "CANFIN HOMES reported quarterly asset quality metrics showing deterioration. Gross Non-Performing Assets (GNPA) increased to 0.98% from 0.87% on a quarter-on-quarter basis. Net Non-Performing Assets (NNPA) also rose to 0.54% from 0.46% quarter-on-quarter. Both key asset quality indicators showed an upward trend during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1753015531273,
            "Source": "earnings"
        },
        {
            "Title": "Canfin Homes Reports 10.6% Growth in Net Profit for Q1",
            "Summary": "Canfin Homes reported net profit of 2.2 billion rupees for Q1, representing growth from 1.99 billion rupees in the same period last year. The company's revenue increased to 10.1 billion rupees compared to 9.2 billion rupees year-over-year, marking a 9.8% growth in revenue.",
            "Sentiment": "positive",
            "PublishDate": 1753012886431,
            "Source": "earnings"
        },
        {
            "Title": "Can Fin Homes: Board Approves ₹11,000 Crore Fundraising Plan",
            "Summary": "Can Fin Homes' board has approved raising up to ₹11,000 crore through debt and equity instruments. This includes ₹10,000 crore via debt and ₹1,000 crore through QIP, preferential allotment, or rights issue. The proposals will be presented at the AGM on August 20, 2025. A final dividend of ₹6 per share has been announced with a record date of July 11, 2025. Swarupananda Mallick has been appointed as an Additional Director (Independent) for three years.",
            "Sentiment": "positive",
            "PublishDate": 1750865456000,
            "Source": "corporate_action"
        },
        {
            "Title": "Can Fin Homes Recommends Debt Issuance and Share Issuance",
            "Summary": "Can Fin Homes has recommended issuing debt up to 100 billion rupees and proposed a share issuance of up to 10 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1750862778000,
            "Source": "default"
        },
        {
            "Title": "Can Fin Homes Board to Review Fundraising Options",
            "Summary": "Can Fin Homes has announced that its Board of Directors will review options for raising funds through equity shares and debentures. No specific details about the amount or timing of the potential fundraising were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1750341682000,
            "Source": "default"
        },
        {
            "Title": "Can Fin Homes Reports Q4 Financial Results and Dividend Announcement",
            "Summary": "Can Fin Homes has released its Q4 financial results, showing a net profit of 2.34 billion rupees, up from 2.1 billion rupees year-over-year. Revenue increased to 9.82 billion rupees from 9.12 billion rupees in the same period last year. The company's Gross Non-Performing Assets (GNPA) improved to 0.87% from 0.92% in the previous quarter, while Net Non-Performing Assets (NNPA) decreased to 0.46% from 0.50%. Additionally, Can Fin Homes has recommended a dividend of 6 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1745453461000,
            "Source": "default"
        },
        {
            "Title": "Can Fin Homes: Q4 Profit Up 12%, Declares ₹6 Final Dividend",
            "Summary": "Can Fin Homes reported Q4 FY25 net profit of ₹234 crore, up 11.9% YoY. Board recommends ₹6 final dividend, total FY25 dividend at ₹12. Loan book grew 9% YoY to ₹38,217 crore. Gross NPA at 0.87%, net NPA at 0.46%. LCR at 117.86%, above regulatory requirement.",
            "Sentiment": "positive",
            "PublishDate": 1745422385000,
            "Source": "earnings"
        },
        {
            "Title": "CAN FIN HOMES Announces Dividend of 6 Rupees per Share",
            "Summary": "CAN FIN HOMES has recommended a dividend of 6 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1745420133000,
            "Source": "result"
        },
        {
            "Title": "CAN FIN HOMES Reports Q4 Financial Results",
            "Summary": "CAN FIN HOMES announced its Q4 financial results. The company's Gross Non-Performing Assets (GNPA) improved to 0.87% from 0.92% quarter-over-quarter, while Net Non-Performing Assets (NNPA) decreased to 0.46% from 0.50%. The company reported a net profit of 2.34 billion rupees, up from 2.1 billion rupees year-over-year. Q4 revenue increased to 9.82 billion rupees from 9.12 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1745420031000,
            "Source": "result"
        },
        {
            "Title": "Can Fin Homes: Board Meeting Set for Q4 Results and Final Dividend",
            "Summary": "Can Fin Homes announced the date for its board meeting to consider Q4 2025 results and final dividend. The stock price rose 2.37% to ₹666.30 in intraday trading.",
            "Sentiment": "positive",
            "PublishDate": 1744701879000,
            "Source": "corporate_action"
        },
        {
            "Title": "Can Fin Homes: New Interim CFO Appointed as Apurav Agarwal Steps Down",
            "Summary": "Prashanth Joishy takes over as interim CFO of Can Fin Homes, effective March 21, following Apurav Agarwal's resignation. Joishy, a 35-year company veteran, will serve until a permanent CFO is appointed. Agarwal's tenure ended nine months early due to personal reasons.",
            "Sentiment": "neutral",
            "PublishDate": 1742397112000,
            "Source": "corporate_governance"
        },
        {
            "Title": "CAN FIN HOMES Selects IBM India for Core Business Solution Upgrade",
            "Summary": "CAN FIN HOMES has chosen IBM India to implement a core business solution and security upgrade. The contract is valued at Rs. 296.95 crore.",
            "Sentiment": "positive",
            "PublishDate": 1740117869000,
            "Source": "corporate_action"
        },
        {
            "Title": "Can Fin Homes Secures Order Worth ₹297 Crore",
            "Summary": "Can Fin Homes has won an order valued at ₹297 crore. This significant contract is likely to boost the company's financial performance and market position in the housing finance sector.",
            "Sentiment": "positive",
            "PublishDate": 1740117308000,
            "Source": "order&deals"
        },
        {
            "Title": "Can Fin Homes Reports Increased Q3 Net Profit and Interest Income",
            "Summary": "Can Fin Homes has announced its financial results for the third quarter. The company's net profit increased to 2.12 billion rupees, up from 2 billion rupees in the same quarter last year. Additionally, interest income rose to 9.8 billion rupees from 9 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1737333527000,
            "Source": "earnings"
        }
    ]
}