{
    "Symbol": "CANHLIFE",
    "ISIN": "INE01TY01017",
    "News": [
        {
            "Title": "Canara HSBC Life Reports Strong Q3 FY26 Growth",
            "Summary": "Canara HSBC Life Insurance delivered robust 9M FY26 results with Individual WPI of ₹1,915.30 crore (20.50% YoY growth), VNB of ₹412.90 crore (36.80% growth), and protection business surging 126% year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1768998408450,
            "Source": "co_actions_results"
        },
        {
            "Title": "Canara HSBC Life Plans ₹250 Cr NCD Issue",
            "Summary": "Canara HSBC Life Insurance Company announces plans to raise ₹250.00 crores through non-convertible debentures to strengthen its capital base and support business expansion.",
            "Sentiment": "positive",
            "PublishDate": 1768996878725,
            "Source": "stocks"
        },
        {
            "Title": "Canara HSBC Life Authorizes KMPs for Material Disclosures",
            "Summary": "Canara HSBC Life Insurance has authorized three Key Managerial Personnel to determine materiality of events and make disclosures to stock exchanges under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768994685817,
            "Source": "stocks"
        },
        {
            "Title": "Motilal Oswal Initiates Buy on Canara HSBC Life",
            "Summary": "Motilal Oswal initiates coverage on Canara HSBC Life Insurance with a Buy rating and target price of ₹180.00, citing strong growth trajectory and market share gains in the life insurance sector.",
            "Sentiment": "positive",
            "PublishDate": 1768285505369,
            "Source": "stocks"
        },
        {
            "Title": "Motilal Oswal sees 51% upside in Canara HSBC Life",
            "Summary": "Brokerage initiates coverage with ₹180 price target and ₹220 bull case target by FY28. Company shows strong growth with 22% APE CAGR and expanding market share despite low penetration among Canara Bank customers.",
            "Sentiment": "positive",
            "PublishDate": 1768281227176,
            "Source": "stocks"
        },
        {
            "Title": "Motilal Oswal Initiates Buy Rating on Canara HSBC Life",
            "Summary": "Motilal Oswal has initiated coverage on Canara HSBC Life Insurance with a 'Buy' rating, citing multi-year growth opportunities from improving bancassurance and HSBC partnerships.",
            "Sentiment": "positive",
            "PublishDate": 1768277636149,
            "Source": "stocks"
        },
        {
            "Title": "Canara HSBC Life Insurance Partners With Equitas SFB",
            "Summary": "Canara HSBC Life Insurance Company has entered into a partnership agreement with Equitas Small Finance Bank. The agreement was signed on November 25, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767685536907,
            "Source": "stocks"
        },
        {
            "Title": "Canara HSBC Life clarifies Equitas SFB partnership",
            "Summary": "Canara HSBC Life Insurance provides clarification on its distribution agreement with Equitas Small Finance Bank, stating the partnership falls below materiality thresholds for stock exchange reporting.",
            "Sentiment": "neutral",
            "PublishDate": 1766569824659,
            "Source": "co_actions_results"
        },
        {
            "Title": "Investec Initiates 'Buy' on Canara HSBC Life at ₹225",
            "Summary": "Investec Securities has initiated coverage on Canara HSBC Life Insurance Company with a 'Buy' rating and set a price target of ₹225 per share for the mid-cap insurance stock.",
            "Sentiment": "positive",
            "PublishDate": 1766461793191,
            "Source": "stocks"
        },
        {
            "Title": "Canara HSBC Life Insurance Faces ₹3.46 Cr GST Demand",
            "Summary": "Canara HSBC Life Insurance Company received a GST demand order of ₹3.46 crores from UP authorities for FY 2021-22, covering tax, interest, and penalties. The company plans to appeal the order.",
            "Sentiment": "negative",
            "PublishDate": 1765891190636,
            "Source": "stocks"
        }
    ]
}