{
    "Symbol": "CANTABIL",
    "ISIN": "INE068L01024",
    "News": [
        {
            "Title": "Cantabil Retail Q3 Net Profit Jumps 31% to ₹451M",
            "Summary": "Cantabil Retail India reported strong Q3 performance with net profit rising 31% year-on-year to ₹451 million from ₹344 million in the previous year period.",
            "Sentiment": "positive",
            "PublishDate": 1770364342551,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cantabil Retail India Opens 3 New Showrooms in November 2025",
            "Summary": "Cantabil Retail India Limited opened 3 new showrooms/shops at different locations in India during November 2025. The company's total number of showrooms/shops now stands at 646, indicating continued retail expansion across the country.",
            "Sentiment": "positive",
            "PublishDate": 1764420746331,
            "Source": "stock"
        },
        {
            "Title": "Cantabil Retail Reports 20% Revenue Growth in H1 FY26, Plans to Cross INR 1,000 Crores by FY27",
            "Summary": "Cantabil Retail India Limited reported strong financial performance for H1 FY26 with revenue from operations growing 20% to INR 335 crores compared to INR 279 crores in H1 FY25. EBITDA increased 23% to INR 91.1 crores with margins improving to 27.2% from 26.5%. For the quarter, revenue grew 16% to INR 176 crores. The company opened 29 new stores during the quarter and plans to close the year with 675 stores, up from current 630. Management targets crossing INR 850 crores revenue this fiscal year and aims to reach INR 1,000 crores by FY27. The company is strategically opening larger format stores averaging 1,625 square feet compared to previous 1,300 square feet to improve EBITDA margins and customer experience. Cantabil benefits from recent GST rationalization and expects demand recovery driven by favorable monsoon conditions and upcoming wedding and winter seasons.",
            "Sentiment": "positive",
            "PublishDate": 1762503294082,
            "Source": "earnings"
        },
        {
            "Title": "Cantabil Retail India Reports High Single-Digit Same-Store Sales Growth",
            "Summary": "Cantabil Retail India has reported high single-digit growth in same-store sales. The company operates in the retail sector.",
            "Sentiment": "positive",
            "PublishDate": 1762182622486,
            "Source": "stock"
        },
        {
            "Title": "Cantabil Retail India Adds 25 New Stores in Q2FY26, Reaches 630 Total Outlets",
            "Summary": "Cantabil Retail India expanded its store network by adding 25 new stores during Q2FY26, bringing its total store count to 630. The company achieved 21% growth in retail space and is pursuing an aggressive expansion strategy. The retailer is focusing on omni-channel retail operations, increasing average billing value (ABV), and brand premiumization as key strategies to achieve double-digit sales growth.",
            "Sentiment": "positive",
            "PublishDate": 1762181410536,
            "Source": "stock"
        },
        {
            "Title": "Cantabil Retail India Reports Growth in Q2 Financial Results",
            "Summary": "Cantabil Retail India reported quarterly net profit of 67.5 million rupees compared to 65.5 million rupees in the same period last year. Revenue increased to 1.76 billion rupees from 1.51 billion rupees year-over-year. EBITDA rose to 421 million rupees from 345 million rupees, while EBITDA margin improved to 23.93% from 22.85% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762166149006,
            "Source": "earnings"
        },
        {
            "Title": "Cantabil Retail India Opens 11 New Showrooms in October, Total Reaches 643",
            "Summary": "Cantabil Retail India Limited expanded its retail footprint by opening 11 new showrooms and shops across different locations in India during October 2025. The expansion brings the company's total number of showrooms and shops to 643. The company informed stock exchanges BSE and NSE about this development under regulatory disclosure requirements.",
            "Sentiment": "positive",
            "PublishDate": 1761922924941,
            "Source": "stock"
        },
        {
            "Title": "Cantabil Retail Expands Network with 7 New Showrooms, Total Reaches 621",
            "Summary": "Cantabil Retail opened 7 new showrooms across India in August 2025, bringing the company's total showroom count to 621. This expansion represents the company's continued retail network growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1756574027914,
            "Source": "stock"
        },
        {
            "Title": "Cantabil Retail Reports 24% Revenue Growth in Q1 with Strong Same-Store Sales Performance",
            "Summary": "Cantabil Retail India Limited reported revenue of Rs. 159 crores in Q1, marking a 24% year-over-year increase. The fashion apparel company achieved same-store sales growth of 11.3% and volume growth of 17.48%. EBITDA grew 24% to Rs. 49 crores, maintaining margins at 30.8%. Profit after tax increased 29% to Rs. 14.7 crores with margins improving to 9.2%. The company operates 605 stores across India with 8.06 lakh square feet of retail space, adding 24 new stores while closing 18 during the quarter. Manufacturing capacity utilization stands at 85-90% of the 1.8 million garments annual capacity. E-commerce contributes 6% of sales and operates at breakeven. Management targets Rs. 1,000 crores revenue by FY27 with 20-22% CAGR and plans to expand e-commerce to 8-10% of sales over the next two years. The company expects 5-7% same-store sales growth and 20% overall growth in FY26, with planned CAPEX of Rs. 20-25 crores for warehousing and plant capacity expansion.",
            "Sentiment": "positive",
            "PublishDate": 1754915927547,
            "Source": "earnings"
        },
        {
            "Title": "Cantabil Retail India Approves Q1 Results and Rs. 0.5 Final Dividend, Board Changes Announced",
            "Summary": "Cantabil Retail India Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs. 15,867.57 lakhs and profit for the period of Rs. 1,167.20 lakhs. The Board recommended a final dividend of Rs. 0.5 per equity share (25% on face value of Rs. 2) for financial year 2024-25, subject to shareholder approval at the Annual General Meeting scheduled for September 9, 2025. The record date for dividend eligibility is set as August 29, 2025. The Board approved the continuation of Mr. Rajeev Sharma as Independent Director and the appointment of Mr. Basant Goyal as Whole Time Director for a 5-year term, both subject to shareholder approval. Mr. Basant Goyal is involved in administration, e-commerce, and inventory management, and is brother-in-law to Whole Time Director Mr. Deepak Bansal. The company also appointed M/s. DPV & Associates LLP as Secretarial Auditor for the period 2025-26 to 2029-30.",
            "Sentiment": "positive",
            "PublishDate": 1754388541608,
            "Source": "corporate_action"
        },
        {
            "Title": "Cantabil Retail India Reports 29% Growth in Q1 Net Profit to 147 Million Rupees",
            "Summary": "Cantabil Retail India reported Q1 net profit of 147 million rupees compared to 114 million rupees in the same period last year. Revenue increased to 1.6 billion rupees from 1.28 billion rupees year-over-year. EBITDA rose to 490 million rupees from 394 million rupees, while EBITDA margin improved marginally to 30.9% from 30.8%.",
            "Sentiment": "positive",
            "PublishDate": 1754386772663,
            "Source": "earnings"
        },
        {
            "Title": "Cantabil Retail India Schedules Q1 FY26 Earnings Call for August 6, 2025",
            "Summary": "Cantabil Retail India Limited has scheduled a conference call for investors and analysts on August 6, 2025, at 16:00 HRS (IST) to discuss the financial and operating performance for Q1 FY26. The earnings call will be represented by key management including Chairman & Managing Director Vijay Bansal, Wholetime Directors Deepak Bansal and Basant Goyal, CFO Shivendra Nigam, and Company Secretary Poonam Chahal. The company has provided dial-in details for multiple countries including India, Singapore, Hong Kong, UK, and USA. Marathon Capital Advisory Private Limited is coordinating the event.",
            "Sentiment": "neutral",
            "PublishDate": 1753967661553,
            "Source": "stock"
        },
        {
            "Title": "Cantabil Retail Expands Network with 7 New Showrooms in July 2025",
            "Summary": "Cantabil Retail opened 7 new showrooms in India during July 2025, bringing the company's total showroom count to 614. This expansion represents the company's continued retail network growth across the country.",
            "Sentiment": "positive",
            "PublishDate": 1753960293953,
            "Source": "stock"
        },
        {
            "Title": "Cantabil Retail India Reports Strong Q4 Financial Results",
            "Summary": "Cantabil Retail India has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 586.4 million rupees from 448.5 million rupees, with the EBITDA margin expanding to 26.77% from 23.1%. Revenue grew to 2.19 billion rupees from 1.94 billion rupees. Net profit rose to 225.1 million rupees from 184 million rupees year-over-year, but decreased from 343.9 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747310382000,
            "Source": "result"
        },
        {
            "Title": "Cantabil Retail India Reports Strong Q3 Financial Results",
            "Summary": "Cantabil Retail India has announced its Q3 financial results, showing significant year-over-year growth. The company's net profit increased to 344 million rupees from 241 million rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 2.23 billion rupees compared to 1.7 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739233268000,
            "Source": "earnings"
        },
        {
            "Title": "Cantabil Retail to Consider Q3 Results on February 10",
            "Summary": "Cantabil Retail India Limited has announced that it will consider its third quarter (Q3) financial results on February 10. This indicates the company is preparing to release its earnings report for the latest fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738672959000,
            "Source": "earnings"
        },
        {
            "Title": "Cantabil Retail Expands with 4 New Showrooms in December 2024",
            "Summary": "Cantabil Retail has opened 4 new showrooms or shops at various locations in India during December 2024. With these additions, the company's total number of showrooms/shops has now reached 578.",
            "Sentiment": "positive",
            "PublishDate": 1735721052000,
            "Source": "corporate_action"
        },
        {
            "Title": "NSE Issues Warning to Cantabil Retail for Non-Compliance",
            "Summary": "<p>The <span class='neutral'>National Stock Exchange (NSE)</span> has issued a <span class='negative'>warning letter</span> to <b>Cantabil Retail</b> for <span class='negative'>disclosing a research report in violation of listing norms</span>. This action highlights the <span class='positive'>importance of adhering to regulatory requirements</span> for publicly listed companies.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728531457000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cantabil Retail India Projects Strong Growth for FY27",
            "Summary": "<p>Cantabil Retail India has announced its <span class='positive'>growth projections</span> for the fiscal year 2027. The company anticipates a <span class='positive'>17.5% increase</span> in revenue, reaching <b>Rs 986 crore</b>. EBITDA is expected to <span class='positive'>grow by 15.5%</span> to <b>Rs 279 crore</b>, while net profit is projected to <span class='positive'>rise by 9.3%</span> to <b>Rs 102 crore</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728368406000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cantabil Retail India Ltd Receives Buy Recommendation",
            "Summary": "<p>An analyst or financial institution has <span class='positive'>initiated</span> a <span class='positive'>buy recommendation</span> for <b>Cantabil Retail India Ltd</b>. The <span class='neutral'>target price</span> is set at <span class='positive'>INR 502</span>, with a projected timeframe of <span class='neutral'>24 months</span> to reach this target.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728368385000,
            "Source": "normal_news"
        }
    ]
}