{
    "Symbol": "CAPACITE",
    "ISIN": "INE264T01014",
    "News": [
        {
            "Title": "Capacit'e Infraprojects Q3FY26 Net Profit Rises 22.8%",
            "Summary": "Capacit'e Infraprojects reported standalone net profit of ₹4,513.24 lakhs for Q3FY26, up 22.8% YoY. Revenue from operations reached ₹55,481.04 lakhs with strong performance across segments.",
            "Sentiment": "positive",
            "PublishDate": 1770805625742,
            "Source": "co_actions_results"
        },
        {
            "Title": "Capacite Infraprojects Secures ₹445 Crore Project",
            "Summary": "Capacite Infraprojects receives intent letter worth ₹445 crore from Great Value Realty for civil and structural work at Great Value Ekanam project in Noida, marking significant business development.",
            "Sentiment": "positive",
            "PublishDate": 1770184170152,
            "Source": "co_actions_results"
        },
        {
            "Title": "Capacite Infraprojects Reports Record Q2 Results with 24% Revenue Growth Despite Monsoon Challenges",
            "Summary": "Capacite Infraprojects achieved highest-ever Q2 results with total income of Rs 650 crores (up 24% YoY) and EBITDA of Rs 108 crores (up 14% YoY), maintaining 16.8% EBITDA margin within guided range. The company has nearly achieved its full-year order booking guidance of Rs 3,500 crores with Rs 3,464 crores secured year-to-date, while maintaining a strong order book of Rs 11,991 crores and targeting 20% revenue growth for the fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1763372280460,
            "Source": "earnings"
        },
        {
            "Title": "Capacite Infra Expects Orders to Significantly Surpass FY26 Projections",
            "Summary": "Capacite Infraprojects anticipates orders will significantly exceed projections for FY26 and maintains its 20% growth guidance. The company expects H2 performance to outperform H1 results.",
            "Sentiment": "positive",
            "PublishDate": 1763108887450,
            "Source": "earnings"
        },
        {
            "Title": "Capacite Infraprojects Schedules Q2 FY26 Earnings Call",
            "Summary": "Capacite Infraprojects Limited has scheduled an earnings call to discuss operational and financial performance for the second quarter and half-year ended September 30, 2025. The call is set for Friday, November 14, 2025 at 10:00 AM IST. The company will be represented by Executive Chairman Rohit Katyal, CFO Rajesh Das, ED-Finance Alok Mehrotra, and Head Accounts Taxation Nishith Pujary. The company noted that the schedule may change due to exigencies on the part of investors or the company.",
            "Sentiment": "neutral",
            "PublishDate": 1762519737940,
            "Source": "earnings"
        },
        {
            "Title": "Capacite Infraprojects Independent Director Arun Karambelkar Passes Away",
            "Summary": "Capacite Infraprojects Limited announced the demise of Mr. Arun Karambelkar, Independent Director, on November 2, 2025. Karambelkar had been associated with the Board since 2018 and contributed significantly to the company's governance and operations. Following his demise, he has ceased to be an Independent Director and member of the Audit Committee, Nomination and Remuneration Committee, Risk Management Committee, and Corporate Social Responsibility Committee with immediate effect. The Board of Directors and employees conveyed their condolences to his family.",
            "Sentiment": "negative",
            "PublishDate": 1762181379983,
            "Source": "corporate_governance"
        },
        {
            "Title": "Capacite Infraprojects Wins ₹542.37 Crore Construction Contract from IIT Bombay",
            "Summary": "Capacite Infraprojects has secured a ₹542.37 crore order from IIT Bombay for fast track building construction. The contract represents a significant project win for the infrastructure company.",
            "Sentiment": "positive",
            "PublishDate": 1760077493960,
            "Source": "order&deals"
        },
        {
            "Title": "Capacite Infraprojects Confirms IT Department Survey, States Full Cooperation",
            "Summary": "Capacite Infraprojects reported that an IT Department survey was conducted on September 26. The company stated it is fully cooperating with the ongoing proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1758973912393,
            "Source": "stock"
        },
        {
            "Title": "Capacit'e Infraprojects Secures ₹1,518 Crore Contract for Ultra-Luxury Residential Towers in Mumbai",
            "Summary": "Capacit'e Infraprojects Limited has secured a contract worth ₹1,518 crore from Twenty-Five Downtown Realty Limited for the construction of ultra-luxury residential towers in Mumbai. The project, called '25 Downtown' by Hubtown, involves constructing 4 ultra-luxury super high-rise residential towers at Mahalaxmi, Mumbai, featuring state-of-the-art amenities including a clubhouse and penthouses with views of Willingdon Golf Course and the Arabian Sea. The contract value excludes taxes and cess. Managing Director Rahul Katyal stated that this repeat order reinforces client trust in Capacit'e's ability to deliver projects with best-in-class safety and quality standards. The company confirmed that promoters, promoter group, and group companies hold no interest in the contracting entity, making it a non-related party transaction. The trading window for the company's securities will remain closed for 48 hours following this disclosure.",
            "Sentiment": "positive",
            "PublishDate": 1758178029842,
            "Source": "order&deals"
        },
        {
            "Title": "Capacit'e Infraprojects Updates Litigation Status Across Multiple Real Estate Disputes",
            "Summary": "Capacit'e Infraprojects Limited disclosed updated litigation details involving multiple real estate companies. The company has filed cases against eight entities including Gulam Mustafa Enterprises, Ramakrishna Housing, and others across various forums including Karnataka RERA, NCLT, and Bombay High Court. Key developments include: a Karnataka RERA petition for registration of 24 flats valued at Rs. 12.61 crore; restoration of operational creditor petition against Ramakrishna Housing for Rs. 15.83 crore; admitted claims in insolvency proceedings against Siddhi Raj Housing (Rs. 6.37 crore) and Sankalp Siddhi Developers (Rs. 7.67 crore operational claim plus financial claim for 2 flats). Additional cases involve claims against Radius & Deserve Builders for 10 flats worth Rs. 20.31 crore, Rohan Developers (Rs. 22.74 crore with Rs. 10.26 crore admitted by IRP), Epitome Residency (Rs. 18.04 crore claim admitted as financial creditor for Rs. 21.61 crore), and T Bhimjyani Realty (Rs. 58.08 crore claim with settlement reached subject to compliance).",
            "Sentiment": "neutral",
            "PublishDate": 1755339683274,
            "Source": "corporate_action"
        },
        {
            "Title": "Capacit'e Infraprojects Reports Q1 FY26 Revenue of ₹599 Crores, Targets 20% Growth for Full Year",
            "Summary": "Capacit'e Infraprojects Limited reported revenue of ₹599 crores for Q1 FY26 with a PAT margin of 7.53%. The construction company maintains an order book exceeding ₹11,000 crores and collected ₹543 crores during the quarter. Management provided EBITDA margin guidance of 16.5-17.5% for FY26 and targets 20% revenue growth for the full year. The company expects order inflows of ₹4,000-4,500 crores in FY26 and projects revenue of ₹1,500+ crores in H2 FY26. Early monsoons and labor migration during Eid festival impacted Q1 execution, but the company anticipates strong execution ramp-up in the second half after monsoons. Capacit'e operates across residential, commercial, institutional and industrial construction segments with ongoing projects including CIDCO, NBCC, and MHADA. The company added Hinduja Group as a new client and is exploring opportunities in data centers and healthcare projects.",
            "Sentiment": "positive",
            "PublishDate": 1755323276748,
            "Source": "earnings"
        },
        {
            "Title": "Capacit'e Infraprojects Reports Q1 FY2026 Results, Appoints Ernst & Young as Internal Auditor",
            "Summary": "Capacit'e Infraprojects Limited's Board approved unaudited standalone and consolidated financial results for Q1 ended June 30, 2025. Standalone revenue from operations was Rs 50,621.74 lakhs compared to Rs 55,216.48 lakhs in the same quarter last year. Net profit after tax stood at Rs 4,052.50 lakhs versus Rs 5,259.89 lakhs in Q1 FY2024. On consolidated basis, revenue from operations was Rs 58,935.83 lakhs against Rs 56,975.00 lakhs in the previous year quarter, with net profit after tax at Rs 4,699.17 lakhs compared to Rs 5,342.84 lakhs. The company reappointed S Dayma & Co as Internal Auditor for Q1 and appointed Ernst & Young LLP as Internal Auditor from July 1, 2025 to March 31, 2026. The auditor's review report highlighted concerns regarding trade receivables of Rs 1,155.93 lakhs from one party and long outstanding receivables of Rs 6,361.76 lakhs under legal proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1754900507711,
            "Source": "earnings"
        },
        {
            "Title": "Capacite Infraprojects Secures ₹114 Crore Letter of Intent from Hinduja Group",
            "Summary": "Capacite Infraprojects has received a Letter of Intent worth ₹114 crore from Hinduja Group. The announcement indicates a significant business development for the infrastructure company.",
            "Sentiment": "positive",
            "PublishDate": 1754466962081,
            "Source": "order&deals"
        },
        {
            "Title": "Capacite Infraprojects: Secures ₹621 Crore Project in Mumbai's Bhendi Bazaar",
            "Summary": "Capacite Infraprojects received a ₹621 crore letter of intent from Saifee Burhani Upliftment Trust for construction work in Mumbai's Bhendi Bazaar. This is the third repeat order from SBUT. The project includes core and shell works, finishing, and MEPF services for Sector 07 of the Saifee Burhani Upliftment Project.",
            "Sentiment": "positive",
            "PublishDate": 1750755635000,
            "Source": "order&deals"
        },
        {
            "Title": "Capacit'e Infraprojects Receives ₹621 Crore Letter of Intent",
            "Summary": "Capacit'e Infraprojects has received a Letter of Intent from Saifee Burhani Upliftment Trust for a project valued at ₹621 crore. This development suggests potential project progress and a growth opportunity for the company.",
            "Sentiment": "positive",
            "PublishDate": 1750754566000,
            "Source": "default"
        },
        {
            "Title": "Capacit'e Infra Provides Revenue Growth Guidance and Financial Targets",
            "Summary": "Capacit'e Infra has provided guidance for 20% to 22% year-over-year revenue growth. The company expects to maintain work-in-progress (WIP) under contract assets at Rs. 850 crore to 950 crore, assuming revenue of Rs. 2,700 crore. The company's full-year guidance remains unchanged at 17% to 17.5% for EBIT, EBITDA, and PAT on a consolidated basis. This guidance is contingent on the company managing 35 projects that generate a minimum revenue of Rs. 10 crore or more per month.",
            "Sentiment": "positive",
            "PublishDate": 1748401978000,
            "Source": "default"
        },
        {
            "Title": "Capacite Infraprojects: Q4 Revenue Up 16%, FY25 PAT Surges 69%",
            "Summary": "Capacite Infraprojects reported Q4 FY25 consolidated revenue growth of 16% YoY to ₹705 crore, with PAT up 2% to ₹53.1 crore. For FY25, total income rose 23% to ₹2,407 crore, while PAT surged 69% to ₹204 crore. EBITDA for FY25 increased 20% YoY to ₹437 crore.",
            "Sentiment": "positive",
            "PublishDate": 1748341594000,
            "Source": "earnings"
        },
        {
            "Title": "Capacite Infraprojects Reports Q4 Financial Results",
            "Summary": "Capacite Infraprojects has released its Q4 financial results. The company's EBITDA for Q4 was 878.5 million rupees, down from 1.09 billion rupees year-over-year. The EBITDA margin decreased to 13.09% from 18.17% in the same period last year. Revenue for Q4 increased to 6.71 billion rupees from 6 billion rupees year-over-year. The consolidated net profit for Q4 was 525.3 million rupees, slightly up from 517 million rupees year-over-year and 520 million rupees quarter-on-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748272183000,
            "Source": "result"
        },
        {
            "Title": "Capacite Infraprojects to Consider Q4 Results on May 26",
            "Summary": "Capacite Infraprojects has announced that it will consider its fourth quarter (Q4) financial results on May 26.",
            "Sentiment": "neutral",
            "PublishDate": 1747830350000,
            "Source": "default"
        },
        {
            "Title": "Capacit'e Infraprojects Secures 385 Crore Contract from National High Speed Rail Corporation",
            "Summary": "Capacit'e Infraprojects has received a Letter of Award (LOA) from the National High Speed Rail Corporation Limited for a project worth 385 crore rupees. This contract is likely related to infrastructure development for the high-speed rail project in India.",
            "Sentiment": "positive",
            "PublishDate": 1746177145000,
            "Source": "default"
        },
        {
            "Title": "NCLT Initiates Insolvency Process Against Epitome Residency",
            "Summary": "Capacite Infraprojects has announced that the National Company Law Tribunal (NCLT) has initiated a Corporate Insolvency Resolution Process against Epitome Residency. This legal action suggests financial distress or default by Epitome Residency, potentially impacting Capacite Infraprojects' operations or financial interests.",
            "Sentiment": "negative",
            "PublishDate": 1745453436000,
            "Source": "default"
        },
        {
            "Title": "NCLT Initiates Insolvency Process Against Epitome Residency",
            "Summary": "Capacite Infraprojects has announced that the National Company Law Tribunal (NCLT) has initiated a Corporate Insolvency Resolution Process against Epitome Residency. This legal action suggests financial distress or default by Epitome Residency, potentially impacting Capacite Infraprojects' operations or financial interests.",
            "Sentiment": "negative",
            "PublishDate": 1745413320000,
            "Source": "default"
        },
        {
            "Title": "Capacit'e Infraprojects: Shares Surge on New Mumbai Construction Orders",
            "Summary": "Capacit'e Infraprojects received two new construction orders in Mumbai: Rs 295 crore from Indus Co-Operative Housing Society for two buildings in Chembur and Rs 220 crore from TenX Realty for a project in Bandra. The company's shares rose 3.18% to Rs 382.70, reaching a nearly three-month high.",
            "Sentiment": "positive",
            "PublishDate": 1744786031000,
            "Source": "order&deals"
        },
        {
            "Title": "Capacite Infraprojects Secures 295 Crore Rupee Order",
            "Summary": "Capacite Infraprojects Limited has won a new order worth 295 crore rupees. This development represents a significant contract acquisition for the company, potentially boosting its project portfolio and financial outlook.",
            "Sentiment": "positive",
            "PublishDate": 1744783639000,
            "Source": "default"
        },
        {
            "Title": "Capacite Infra Receives LOI Worth ₹220 Crore from Tenx Realty Limited",
            "Summary": "Capacite Infra has received a Letter of Intent (LOI) valued at ₹220 crore from Tenx Realty Limited, a step-down subsidiary of Raymond Limited. This LOI represents a significant new project order for Capacite Infra, potentially boosting its order book and future revenue prospects.",
            "Sentiment": "positive",
            "PublishDate": 1744703443000,
            "Source": "order&deals"
        },
        {
            "Title": "Capacite Infraprojects: Board Approves ₹75 Crore NCD Issuance",
            "Summary": "Capacite Infraprojects' Board approved issuing NCDs worth ₹75 crore on private placement basis. The 3-year 3-month bonds will carry 13.5% annual interest, paid monthly. Funds will repay existing debt and reduce promoter share pledges. Debentures are secured by ₹95 crore in assets and will be redeemed quarterly.",
            "Sentiment": "positive",
            "PublishDate": 1741249131000,
            "Source": "corporate_action"
        },
        {
            "Title": "Capacite Infraprojects Approves Issue of Non-Convertible Debentures",
            "Summary": "Capacite Infraprojects has approved the issuance of Non-Convertible Debentures (NCDs) for up to 750 million rupees. This decision represents a significant financial move for the company, potentially aimed at raising capital for various corporate purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1741242979000,
            "Source": "corporate_action"
        },
        {
            "Title": "Capacit'e Infra to Consider Fund-Raising Options",
            "Summary": "Capacit'e Infra has announced that it will consider and approve various fund-raising options on a private placement basis on March 6. This decision indicates the company's intention to explore potential avenues for raising capital to support its operations or future projects.",
            "Sentiment": "neutral",
            "PublishDate": 1741056294000,
            "Source": "corporate_action"
        },
        {
            "Title": "Capacit'e Infraprojects Limited: Profit Soars 120% in Nine Months, Stock Rises",
            "Summary": "Capacit'e Infraprojects reported a 120% increase in PAT to ₹151 crore for the nine months ended December 31, 2024. Q3 FY25 saw a 77% rise in PAT to ₹52 crore. Revenue grew 26% to ₹1,678 crore for nine months and 23% to ₹590 crore in Q3. The company maintains a ₹10,047 crore order book with 63% public sector projects. Stock price up 1.93% to ₹344.15 on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1739770115000,
            "Source": "earnings"
        },
        {
            "Title": "Capacite Infraprojects Exceeds Growth Targets and Sets Higher Goals",
            "Summary": "Capacite Infraprojects Ltd has surpassed its previous guidance of 12.5% improvement in a key metric, achieving a 50 basis points improvement instead. The company is now targeting further improvement and has set a new guidance for a minimum 25% year-on-year growth on a higher base for the next year.",
            "Sentiment": "positive",
            "PublishDate": 1739616409000,
            "Source": "earnings"
        },
        {
            "Title": "Capacite Infraprojects Ltd Forecasts Strong Order Inflow and Growth",
            "Summary": "Capacite Infraprojects Ltd expects to achieve a minimum of Rs 3,000 crore in fresh order inflow for the current financial year, excluding potential orders from MHADA. The company has projected a 25% growth for the current financial year and is committed to maintaining at least 25% growth for the next year. There is potential for growth to reach 30% or 32% due to shorter execution periods for new orders.",
            "Sentiment": "positive",
            "PublishDate": 1739616383000,
            "Source": "earnings"
        },
        {
            "Title": "Capacite Infraprojects Ltd Provides Positive Financial Guidance",
            "Summary": "Capacite Infraprojects Ltd has provided financial guidance for the upcoming year. The company expects an overall EBITDA of Rs 17.5 crore or more, which is approximately 18% for the full year. They anticipate growing EBIT by at least 200 basis points compared to the previous financial year. Additionally, the company has set an internal target of Rs 4,000 crore for new fresh order inflow in the next financial year.",
            "Sentiment": "positive",
            "PublishDate": 1739616355000,
            "Source": "earnings"
        },
        {
            "Title": "Capacite Infraprojects: Q3 Margins Decline Impacts Share Price",
            "Summary": "Capacite Infraprojects' share price dropped nearly 15% following a 180 bps decline in Q3FY25 EBITDA margins to 16.7%. Despite this, the company reported a 77% YoY increase in Q3 net profit to ₹52.3 crore and a 24% rise in total income to ₹600.7 crore. The company also received a new ₹1,320 crore contract from NBCC (India).",
            "Sentiment": "neutral",
            "PublishDate": 1739527575000,
            "Source": "earnings"
        },
        {
            "Title": "Capacite Infraprojects Secures Major Construction Order",
            "Summary": "Capacite Infraprojects has won a significant construction order valued at ₹1,320 crore. This substantial contract represents a major business development for the company, potentially boosting its project portfolio and revenue prospects.",
            "Sentiment": "positive",
            "PublishDate": 1739515033000,
            "Source": "order&deals"
        },
        {
            "Title": "Capacite Infraprojects Reports Strong Q3 Financial Results",
            "Summary": "Capacite Infraprojects has announced its Q3 consolidated financial results. The company's net profit increased to 520 million rupees, up from 295 million rupees year-over-year and 446 million rupees quarter-over-quarter. Revenue for Q3 rose to 5.9 billion rupees, compared to 4.8 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739492251000,
            "Source": "earnings"
        },
        {
            "Title": "Capacite Infraprojects Reports Mixed Q3 Financial Results",
            "Summary": "Capacite Infraprojects, an infrastructure company, has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 903 million rupees from 871 million rupees year-over-year. However, the EBITDA margin decreased to 15.30% from 18.13% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739452754000,
            "Source": "earnings"
        },
        {
            "Title": "Capacite Infraprojects Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "Capacite Infraprojects has announced its Q3 financial results, showing substantial year-over-year growth. The company's consolidated net profit increased to 520 million rupees, up from 295 million rupees in the same quarter last year. This also represents a quarter-on-quarter increase from 446 million rupees. Revenue for Q3 rose to 5.9 billion rupees, compared to 4.8 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1739452559000,
            "Source": "earnings"
        },
        {
            "Title": "Capacite Infra to Consider Q3 Results on February 13",
            "Summary": "Capacite Infra has announced that it will consider its third quarter financial results on February 13. This indicates the company is preparing to disclose its performance for the most recent fiscal quarter to shareholders and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1738768844000,
            "Source": "earnings"
        },
        {
            "Title": "Capacite Infraprojects Reports Q2 Revenue Growth",
            "Summary": "Capacite Infraprojects, an infrastructure company, has reported a revenue of 5.17 billion rupees for the second quarter, compared to 4.2 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731576230000,
            "Source": "result"
        },
        {
            "Title": "Capacite Infraprojects Reports Strong Q2 Financial Performance",
            "Summary": "Capacite Infraprojects has announced its Q2 financial results, showing significant improvement in both EBITDA and EBITDA margin compared to the same period last year. The company's EBITDA increased from 624 million rupees to 953 million rupees year-over-year. Additionally, the EBITDA margin improved from 14.81% to 18.41% in the same period.",
            "Sentiment": "positive",
            "PublishDate": 1731576178000,
            "Source": "result"
        },
        {
            "Title": "Capacite Infraprojects Reports Significant Profit Growth in Q2",
            "Summary": "Capacite Infraprojects, an infrastructure company, has reported a substantial increase in its consolidated net profit for the second quarter. The company's net profit rose to 446 million rupees, up from 198 million rupees in the same period last year, marking a year-over-year growth of approximately 125%.",
            "Sentiment": "positive",
            "PublishDate": 1731576151000,
            "Source": "result"
        },
        {
            "Title": "Capacit'e Infraprojects: Secures Rs 1,203 Crore Order from Signature Global",
            "Summary": "Capacit'e Infraprojects has received a Rs 1,203 crore work order from Signatureglobal (India) Ltd. for construction of a housing project in Gurugram. The project includes civil structure and partial MEP work for all towers, basements, and ancillary buildings.",
            "Sentiment": "positive",
            "PublishDate": 1729850687000,
            "Source": "normal_news"
        },
        {
            "Title": "Capacite Infra Secures ₹1200 Crore Order",
            "Summary": "Capacite Infra has won a new order worth ₹1200 crore. This significant contract represents a major business development for the company, potentially boosting its project portfolio and future revenue streams.",
            "Sentiment": "positive",
            "PublishDate": 1729846365000,
            "Source": "corporate_action"
        }
    ]
}