{
    "Symbol": "CAPILLARY",
    "ISIN": "INE0ILV01024",
    "News": [
        {
            "Title": "Capillary Technologies Q3 FY26 Results Show Strong Growth",
            "Summary": "Capillary Technologies reported 16% YoY revenue growth to INR 184 crores in Q3 FY26, with adjusted EBITDA rising 24% to INR 30 crores. Nine-month revenue grew 22% to INR 543 crores.",
            "Sentiment": "positive",
            "PublishDate": 1770895470386,
            "Source": "co_actions_results"
        },
        {
            "Title": "Capillary Technologies schedules investor meetings",
            "Summary": "Capillary Technologies India Limited announces multiple one-on-one and group meetings with analysts and investors scheduled for February 11-13, 2026 in Mumbai under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770390273744,
            "Source": "stocks"
        },
        {
            "Title": "Capillary Technologies Q3FY26 Earnings Call on Feb 6",
            "Summary": "Capillary Technologies India Limited schedules earnings conference call for February 6, 2026 at 4:30 PM IST to discuss Q3FY26 results ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770046316799,
            "Source": "co_actions_results"
        },
        {
            "Title": "Capillary Technologies Named Leader in Forrester Wave Loyalty Platforms Report",
            "Summary": "Capillary Technologies India Limited has been recognized as a Leader in the Forrester Wave - Loyalty Platforms, Q4 2025 report. The company disclosed this achievement to stock exchanges and made the Forrester Wave report available on its website for investors and stakeholders.",
            "Sentiment": "positive",
            "PublishDate": 1765338999443,
            "Source": "stock"
        },
        {
            "Title": "Capillary Technologies Seeks Shareholder Approval for ESOP Scheme Ratification",
            "Summary": "Capillary Technologies India Limited has issued a postal ballot notice seeking shareholder approval to ratify its Employee Stock Option Scheme-2021 (ESOP 2021) covering up to 72,91,000 stock options. The e-voting period runs from December 6, 2025 to January 4, 2026, with ratification required under SEBI regulations following the company's listing on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1764928350509,
            "Source": "corporate_action"
        }
    ]
}