{
    "Symbol": "CAPITALSFB",
    "ISIN": "INE646H01017",
    "News": [
        {
            "Title": "Capital Small Finance Bank Q3FY26 Results Show Growth",
            "Summary": "Capital Small Finance Bank reported 19.8% YoY growth in advances to INR8,164 crores and 18.5% YoY deposit growth to INR9,931 crores in Q3FY26, with stable margins at 4% and improved asset quality.",
            "Sentiment": "positive",
            "PublishDate": 1770224787672,
            "Source": "co_actions_results"
        },
        {
            "Title": "Capital Small Finance Bank Investor Meet on Feb 9",
            "Summary": "Capital Small Finance Bank announces participation in Manthan – Systematix Annual India Conference on February 09, 2026, featuring 1x1 and group meetings with investors in Mumbai.",
            "Sentiment": "neutral",
            "PublishDate": 1770223583080,
            "Source": "stocks"
        },
        {
            "Title": "Capital Small Finance Bank Re-appoints Munish Jain",
            "Summary": "Capital Small Finance Bank announces re-appointment of Munish Jain as Executive Director for 3 years from August 28, 2026, subject to RBI and shareholder approval. Bank also reports Q3 FY25 net profit of ₹3,441 lacs.",
            "Sentiment": "positive",
            "PublishDate": 1769677287766,
            "Source": "stocks"
        },
        {
            "Title": "Capital Small Finance Bank Board Meet on Jan 29",
            "Summary": "Capital Small Finance Bank has scheduled a board meeting for January 29, 2026, to consider Q3FY26 unaudited financial results and exercise of call option on debenture bonds.",
            "Sentiment": "neutral",
            "PublishDate": 1769084940731,
            "Source": "co_actions_results"
        },
        {
            "Title": "Capital Small Finance Bank Q3FY26 Highlights",
            "Summary": "Capital Small Finance Bank reports 19.8% YoY growth in advances to ₹8,164 crores and 18.5% YoY growth in deposits to ₹9,931 crores for Q3FY26, maintaining stable asset quality at 2.7% gross NPA.",
            "Sentiment": "positive",
            "PublishDate": 1767588978126,
            "Source": "co_actions_results"
        },
        {
            "Title": "Capital Small Finance Bank Allots 1.32 Lakh Equity Shares Under Employee Stock Option Plan",
            "Summary": "Capital Small Finance Bank allotted 1,32,584 equity shares at Rs. 171 per share to employees under its Employee Stock Option Plan 2023, raising Rs. 2.27 crores. The allotment increased the bank's paid-up equity share capital to Rs. 45.42 crores, consisting of 4.54 crore equity shares of Rs. 10 each.",
            "Sentiment": "positive",
            "PublishDate": 1764917847030,
            "Source": "corporate_action"
        },
        {
            "Title": "Capital Small Finance Bank Receives BSE Approval for Promoter Reclassification",
            "Summary": "Capital Small Finance Bank received no-objection letter from BSE Limited for reclassifying Dinesh Gupta and related promoter group members from promoter category to public category under SEBI regulations. The reclassification involves 14 promoter group entities including Dinesh Gupta who holds 2,95,920 shares (0.65% holding), moving them to public shareholder status.",
            "Sentiment": "neutral",
            "PublishDate": 1763181518868,
            "Source": "corporate_governance"
        },
        {
            "Title": "Capital Small Finance Bank Director Sham Singh Bains to Step Down After Completing Tenure",
            "Summary": "Capital Small Finance Bank announced that Sham Singh Bains will cease to be a Non-Executive Independent Director from close of business hours on November 08, 2025. His departure follows the completion of his second term of 3 consecutive years as an Independent Director, in accordance with Section 149 of Companies Act 2013. Bains holds 188 equity shares in the bank. The bank has informed stock exchanges BSE and NSE about this board change under SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762492619505,
            "Source": "corporate_governance"
        },
        {
            "Title": "Capital Small Finance Bank Reports 18% Loan Growth Despite Flood Impact in Q2 FY26",
            "Summary": "Capital Small Finance Bank reported gross advances of INR 7,907 crores with 17.7% year-on-year growth for the quarter ended September 30, 2025. Total deposits reached INR 9,317 crores, up 20% year-on-year, with CASA ratio at 33.9%. Net interest margin stood at 4.04% compared to 4.1% in the previous quarter. Profit after tax was INR 35 crores, up 5% year-on-year. Gross NPA improved to 2.70% from 2.75% in the previous quarter, while net NPA was 1.38%. The bank faced flood impact in northern regions affecting some Punjab districts, but asset quality remained stable. Fresh disbursements for the quarter were INR 805 crores, registering 36% year-on-year growth. The bank maintains its FY26 growth guidance of 20% plus for advances and targets doubling its loan book over the next three to three-and-a-half years. Capital adequacy ratio remained strong at 24.2% with branch network at 199 branches across five states and two union territories.",
            "Sentiment": "positive",
            "PublishDate": 1762282340521,
            "Source": "earnings"
        },
        {
            "Title": "Capital Small Finance Bank Targets ₹16,000 Cr Loan Book by FY29 with Geographic Expansion",
            "Summary": "Capital Small Finance Bank plans to double its loan book to ₹16,000 crores by FY29. The bank is expanding operations into Uttar Pradesh and Gujarat while targeting to maintain a return on assets (RoA) above 1.6%. The growth strategy focuses on secured MSME lending and mortgage products, supported by CASA-led deposits. The bank maintains asset quality metrics with gross non-performing assets at 2.7% and net non-performing assets at 1.4%.",
            "Sentiment": "positive",
            "PublishDate": 1761755488447,
            "Source": "stock"
        },
        {
            "Title": "Capital Small Finance Reports 5% Growth in Q2 Net Profit to 349 Million Rupees",
            "Summary": "Capital Small Finance reported net profit of 349 million rupees in Q2, up from 333 million rupees in the same period last year. Revenue increased to 2.6 billion rupees from 2.2 billion rupees year-over-year. The bank's asset quality showed marginal improvement with gross non-performing assets (GNPA) declining to 2.70% from 2.74% quarter-over-quarter, while net non-performing assets (NNPA) decreased to 1.38% from 1.39% quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761741054287,
            "Source": "earnings"
        },
        {
            "Title": "Capital Small Finance Bank Schedules Earnings Call for Q2 & H1FY26 Results",
            "Summary": "Capital Small Finance Bank will host an earnings conference call on Thursday, October 30, 2025 at 11:30 AM IST to discuss its financial and operational performance for Q2 & H1FY26. The call will feature senior management including Managing Director & CEO Sarvjit Singh Samra, Executive Director Munish Jain, CFO Aseem Mahajan, Chief Risk Officer Raghav Aggarwal, Chief Treasury Officer Sahil Vijay, and Investor Relations Team member Bharti Babutta. The bank has provided multiple dial-in numbers for participants from different regions including India, USA, UK, Singapore, and Hong Kong, with pre-registration available through a Diamond Pass link.",
            "Sentiment": "neutral",
            "PublishDate": 1761282597493,
            "Source": "corporate_action"
        },
        {
            "Title": "Capital Small Finance Bank Appoints Bhavdeep Sardana as Non-Executive Non-Independent Director",
            "Summary": "Capital Small Finance Bank Limited announced the appointment of Mr. Bhavdeep Sardana (DIN: 03516261) as Non-Executive Non-Independent Director effective August 04, 2025, for an 8-year term. The appointment was approved by shareholders through postal ballot dated August 14, 2025. Sardana serves as Sr. V.P. & CEO of The Sukhjit Starch & Chemicals Limited, a listed company with annual turnover of around 1500 crores, and has 30 years of experience in agro-based food industries. He holds various government positions including membership in Punjab State Planning Board and Punjab State Council for Agricultural Education. Sardana owns 1,28,391 equity shares in the bank jointly with his spouse and has no relationships with other bank directors.",
            "Sentiment": "positive",
            "PublishDate": 1761239559640,
            "Source": "corporate_governance"
        },
        {
            "Title": "Capital Small Finance Bank Reports Strong Growth in Advances and Deposits",
            "Summary": "Capital Small Finance Bank reported a 17.7% year-over-year increase in gross advances and a 6.3% quarter-over-quarter growth. The bank's total deposits grew by 19.8% year-over-year and 2.3% quarter-over-quarter. The growth figures indicate expansion in both lending activities and deposit mobilization for the small finance bank.",
            "Sentiment": "positive",
            "PublishDate": 1759471826912,
            "Source": "stock"
        },
        {
            "Title": "Capital Small Finance Bank Seeks Shareholder Approval for Director Appointment via Postal Ballot",
            "Summary": "Capital Small Finance Bank has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. Bhavdeep Sardana as a Non-Executive Non-Independent Director. The Board appointed Sardana as an Additional Director effective August 04, 2025, and now requires member approval for regularization. The 50-year-old executive serves as Sr. VP & CEO of The Sukhjit Starch & Chemicals Limited and brings 30 years of experience in agro-based food industries. He will receive annual remuneration of ₹9,00,000 plus sitting fees and expense reimbursements. The e-voting period runs from September 24 to October 23, 2025, with results to be announced by October 25, 2025. Sardana holds 1,28,391 equity shares (0.28%) in the bank along with his spouse and serves on boards of multiple companies including Kuantum Papers Limited and Avon Cycles Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1758630849606,
            "Source": "corporate_action"
        },
        {
            "Title": "Capital Small Finance Bank Seeks Reclassification of 14 Promoter Entities to Public Shareholders",
            "Summary": "Capital Small Finance Bank has applied to BSE and NSE for reclassification of 14 entities from Promoter/Promoter Group category to Public shareholders category. The entities include Dinesh Gupta holding 2,95,920 shares (0.65%), Dinesh Gupta HUF with 30,333 shares (0.07%), and 12 other promoter group members including family members and companies. The combined shareholding of all 14 entities represents 0.74% of the bank's total shares. Several entities in the list currently hold zero shares. The application was submitted on September 23, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758615203244,
            "Source": "corporate_action"
        },
        {
            "Title": "Capital Small Finance Bank Approves Reclassification of Dinesh Gupta and Associates from Promoter to Public Shareholders",
            "Summary": "Capital Small Finance Bank's Board of Directors approved the reclassification of Dinesh Gupta and his associated Promoter Group members from Promoter/Promoter Group status to Public shareholders. The reclassification affects 14 entities including Dinesh Gupta, family members, and related companies, who collectively hold 3,35,543 shares representing 0.74% of the company. Dinesh Gupta individually holds 2,95,920 shares (0.65%). The request was made due to Dinesh Gupta's extensive professional and family engagements. Since the cumulative shareholding is less than 1%, no shareholder approval is required. The outgoing promoters confirmed they do not hold more than 10% voting rights, exercise no control over company affairs, have no special rights, are not represented on the Board, and are not key managerial personnel. An application will be filed with stock exchanges for final approval.",
            "Sentiment": "neutral",
            "PublishDate": 1758199078138,
            "Source": "corporate_action"
        },
        {
            "Title": "Capital Small Finance Bank Receives Reclassification Request from Promoter Dinesh Gupta",
            "Summary": "Capital Small Finance Bank received an application from Dinesh Gupta, currently classified as a promoter, seeking reclassification from promoter to public category. Gupta resigned from the Board of Directors effective August 14, 2025, and holds 2,95,920 shares representing 0.65% of the bank. The reclassification request includes 13 related persons and entities from the promoter group, collectively holding an additional small percentage of shares. Gupta states he is no longer associated with the bank's business operations and does not influence policy decisions. He commits to maintaining less than 1% voting rights and not serving on the board or as key managerial personnel for three years post-reclassification.",
            "Sentiment": "neutral",
            "PublishDate": 1757672744400,
            "Source": "corporate_governance"
        },
        {
            "Title": "Capital Small Finance Bank Reports 7% Profit Growth Despite MFI Exposure Challenges",
            "Summary": "Capital Small Finance Bank reported quarterly profit of INR32 crores, marking 7% year-on-year growth. Total deposits grew 17.1% year-on-year to INR9,110 crores, while gross advances increased 16.4% to INR7,437 crores. The bank maintained a healthy NIM of 4.1% and CASA ratio of 35.9%. However, asset quality was impacted by NBFC/MFI exposure, with gross NPAs at 2.7% and credit costs rising to 0.37%, of which 0.19% was attributed to slippage from NBFC/MFI exposure. The bank's exposure to NBFC/MFI remains below 1% of total portfolio. Operating profit grew 24% supported by 38% increase in non-interest income. The bank plans to add 20-25 branches and target 20% advance growth for the fiscal year. Management expects the MFI-related credit cost increase to be temporary and limited to the first quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1753961115699,
            "Source": "earnings"
        },
        {
            "Title": "Capital Small Finance Bank Corrects Appointment Date for New Director Due to Typographical Error",
            "Summary": "Capital Small Finance Bank issued a corrigendum to correct the effective date of appointment for Mr. Bhavdeep Sardana as Additional Director (Non-Executive Non-Independent) to August 04, 2025, citing a typographical error in the original announcement. Mr. Sardana serves as Sr. V.P. & CEO of The Sukhjit Starch & Chemicals Limited, a company with annual turnover of around 1500 crores and manufacturing facilities across multiple states. He brings 30 years of experience in commercial, administrative, operations and management in agro-based food industries. Mr. Sardana holds 1,28,391 equity shares in the bank jointly with his spouse and has no relationships with other directors of the bank.",
            "Sentiment": "neutral",
            "PublishDate": 1753380996709,
            "Source": "corporate_action"
        },
        {
            "Title": "Capital SFB Plans North India Expansion with 27% Growth in MSME Lending",
            "Summary": "Capital Small Finance Bank is pursuing expansion through branch-led growth in North India. The bank reported a 27% year-over-year increase in MSME lending and is implementing digital onboarding processes. The expansion strategy is supported by the bank's CASA franchise and maintained asset quality discipline.",
            "Sentiment": "positive",
            "PublishDate": 1753369122740,
            "Source": "stock"
        },
        {
            "Title": "Capital Small Finance Bank Reports Q1 FY26 Results with 7% PAT Growth and Board Appointments",
            "Summary": "Capital Small Finance Bank announced quarterly results for the period ended June 30, 2025, showing net profit of ₹32 crores, representing 7% year-on-year growth. Total deposits increased 17% to ₹9,110 crores while gross advances grew 16% to ₹7,437 crores. The bank maintained net interest margin at 4.1% and CASA ratio at 35.9%. Asset quality remained stable with gross NPAs at 2.7% and net NPAs at 1.4%. The board appointed Mr. Bhavdeep Sardana as additional non-executive director. Operating profit before provisions grew 24% supported by 38% increase in non-interest income. The bank confirmed full utilization of proceeds from listed non-convertible debt securities and maintained capital adequacy ratio at 24.5%.",
            "Sentiment": "positive",
            "PublishDate": 1753356820408,
            "Source": "earnings"
        },
        {
            "Title": "Capital SFB Reports Growth in Loans and Deposits for Q1 FY26",
            "Summary": "Capital Small Finance Bank (Capital SFB) has reported financial results for the first quarter of FY26. The bank's loans increased by 16.4% to ₹7,437 crore, while deposits rose by 17.1% to ₹9,110 crore. The bank's Gross Non-Performing Assets (NPA) remained stable at 2.7%.",
            "Sentiment": "positive",
            "PublishDate": 1751526036000,
            "Source": "default"
        },
        {
            "Title": "Capital Small Finance Bank: Q4 Profit Up 21%, Stable Asset Quality, ₹4 Dividend Proposed",
            "Summary": "Capital Small Finance Bank reported a 21.4% YoY increase in Q4 net profit to ₹34.24 crore. NII rose 18.8% YoY to ₹103.06 crore. Asset quality remained stable with Gross NPA at 2.58% and Net NPA at 1.3%. AUM grew 16.6% YoY to ₹7,184 crore. The bank's board recommended a final dividend of ₹4 per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1745919049000,
            "Source": "earnings"
        },
        {
            "Title": "Capital Small Finance Bank Reports Q4 FY23 Results",
            "Summary": "Capital Small Finance Bank has reported its Q4 FY23 results. Interest earned increased to 2.3 billion rupees from 2 billion rupees year-over-year. Gross Non-Performing Assets (GNPA) improved to 2.58% from 2.67% quarter-on-quarter, while Net Non-Performing Assets (NNPA) decreased to 1.3% from 1.35%. The bank's net profit rose to 342 million rupees from 282 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1745916407000,
            "Source": "result"
        },
        {
            "Title": "Capital Small Finance Bank Reports Improvement in Gross NPA",
            "Summary": "Capital Small Finance Bank has reported a decrease in its Gross Non-Performing Assets (NPA) ratio. The bank's Gross NPA is now at 2.58%, down from 2.76% in the same period last year, indicating an improvement in the bank's asset quality.",
            "Sentiment": "positive",
            "PublishDate": 1743667337000,
            "Source": "earnings"
        },
        {
            "Title": "Capital Small Finance Bank Reports 11.3% Year-on-Year Increase in Total Deposits",
            "Summary": "Capital Small Finance Bank has announced that its total deposits have grown by 11.3% compared to the previous year, as of March 31. This increase in deposits indicates positive growth for the bank and suggests improved customer trust and financial stability.",
            "Sentiment": "positive",
            "PublishDate": 1743667260000,
            "Source": "result"
        },
        {
            "Title": "Capital Small Finance Bank Reports 16.7% YoY Growth in Gross Advances",
            "Summary": "Capital Small Finance Bank has announced that its gross advances have grown by 16.7% year-over-year as of March 31, 2025. This growth indicates an expansion in the bank's lending activities and potentially suggests improved financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1743667226000,
            "Source": "result"
        },
        {
            "Title": "Capital Small Finance Bank Reports Q3 FY24 Financial Results",
            "Summary": "Capital Small Finance Bank has reported its financial results for the third quarter. The bank's net profit increased to 340.5 million rupees, up from 289 million rupees year-over-year and 333.4 million rupees quarter-over-quarter. Revenue rose to 2.35 billion rupees from 2 billion rupees in the same quarter last year. Provisions decreased to 21.6 million rupees from 39.1 million rupees in the previous quarter. The bank's Gross Non-Performing Assets (GNPA) slightly increased to 2.67% from 2.61% in the previous quarter, while Net Non-Performing Assets (NNPA) rose to 1.35% from 1.29%.",
            "Sentiment": "positive",
            "PublishDate": 1738197237000,
            "Source": "earnings"
        },
        {
            "Title": "Capital Small Finance Bank Reports Increase in Q3 NPAs",
            "Summary": "Capital Small Finance Bank has reported an increase in both Gross Non-Performing Assets (GNPA) and Net Non-Performing Assets (NNPA) for the third quarter. The GNPA rose to 2.67% from 2.61% in the previous quarter, while NNPA increased to 1.35% from 1.29% quarter-on-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1738156596000,
            "Source": "result"
        },
        {
            "Title": "Capital Small Finance Bank Reports Decrease in Q3 Provisions",
            "Summary": "Capital Small Finance Bank has reported a significant decrease in its provisions for the third quarter. The bank's provisions dropped to 21.6 million rupees, compared to 39.1 million rupees in the previous quarter, representing a quarter-on-quarter reduction.",
            "Sentiment": "positive",
            "PublishDate": 1738156588000,
            "Source": "earnings"
        },
        {
            "Title": "Capital Small Finance Bank: Q3 Profit Rises 18%, NII Up 22.4%",
            "Summary": "Capital Small Finance Bank reported an 18% YoY increase in Q3 FY25 net profit to ₹34.1 crore. Net Interest Income grew 22.4% to ₹107.1 crore. Gross NPAs slightly increased to 2.67% from 2.61% in Q2, while net NPAs rose to 1.35% from 1.29%.",
            "Sentiment": "positive",
            "PublishDate": 1738154072000,
            "Source": "earnings"
        },
        {
            "Title": "Capital Small Finance Bank Reports Growth in Deposits and Advances",
            "Summary": "Capital Small Finance Bank has reported provisional financial figures for the end of December. The bank's total deposits have increased by 12% year-over-year, while gross advances have grown by 19.2% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1735863477000,
            "Source": "result"
        },
        {
            "Title": "Capital Small Finance Bank Reports Growth in Deposits and Advances",
            "Summary": "Capital Small Finance Bank has announced provisional financial figures for the end of December. The bank's total deposits have increased by 12% year-over-year, while gross advances have shown a significant growth of 19.2% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1735813928000,
            "Source": "result"
        },
        {
            "Title": "Capital Small Finance Bank Reports Increased Provisions in Q2",
            "Summary": "Capital Small Finance Bank has reported provisions of 39.1 million rupees for the second quarter, which is an increase from 23.8 million rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1729786126000,
            "Source": "result"
        },
        {
            "Title": "Capital Small Finance Bank Reports Q2 Interest Earnings",
            "Summary": "Capital Small Finance Bank has reported its interest earned for the second quarter. The bank's interest income increased to 2.24 billion rupees, up from 1.97 billion rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1729786107000,
            "Source": "result"
        },
        {
            "Title": "Capital Small Finance Bank: Q2 Profit Surges 37%, Leadership Changes Announced",
            "Summary": "Capital Small Finance Bank reported a 37% increase in Q2 net profit to Rs 33.3 crore. The bank approved reappointment of MD Sarvjit Singh Samra for three years and extended chairman Navin Kumar Maini's term. Net interest margin rose to 4.2%, gross advances grew 15% YoY, and asset quality improved with gross NPA ratio falling to 2.6%.",
            "Sentiment": "positive",
            "PublishDate": 1729777636000,
            "Source": "result"
        },
        {
            "Title": "Capital Small Finance Bank: Q2 Update Shows Steady Growth and Stable Asset Quality",
            "Summary": "<p>Capital Small Finance Bank reported <span class='positive'>11% YoY deposit growth</span> to ₹7,780 crore, <span class='positive'>15% YoY advance growth</span> to ₹6,718 crore, and <span class='neutral'>stable asset quality</span> with <span class='neutral'>2.6% Gross NPA</span> in Q2 FY2024. The bank maintains a <span class='positive'>99.8% secured portfolio</span> and <span class='positive'>improved Liquidity Coverage Ratio to 238.1%</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728022426000,
            "Source": "result"
        }
    ]
}