{
    "Symbol": "CAPLIPOINT",
    "ISIN": "INE475E01026",
    "News": [
        {
            "Title": "Caplin Point Labs Q3 Net Profit Rises 17% YoY",
            "Summary": "Caplin Point Laboratories reported consolidated net profit of ₹1.64 billion for Q3, marking a 17.14% increase from ₹1.40 billion in the same quarter last year, demonstrating strong financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1770277478796,
            "Source": "co_actions_results"
        },
        {
            "Title": "Caplin Point Labs Appoints Four New Directors",
            "Summary": "Caplin Point Laboratories shareholders approved appointment of four new directors through postal ballot on January 31, 2026, including two Vice-Chairmen and two Independent Directors.",
            "Sentiment": "positive",
            "PublishDate": 1770113333714,
            "Source": "stocks"
        },
        {
            "Title": "Caplin Point Labs Q3FY26 Earnings Call on Feb 5",
            "Summary": "Caplin Point Laboratories announces post-results conference call scheduled for February 05, 2026 at 16:00 hrs IST to discuss Q3FY26 financial performance for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769683880300,
            "Source": "co_actions_results"
        },
        {
            "Title": "Caplin Steriles Gets USFDA Approval for Injectable",
            "Summary": "Caplin Steriles Limited receives final USFDA approval for Methylprednisolone Acetate Injectable Suspension, targeting a $57.4 million US market opportunity.",
            "Sentiment": "positive",
            "PublishDate": 1769508964864,
            "Source": "stocks"
        },
        {
            "Title": "Caplin Point Labs Reports Strong H1 FY26 Growth",
            "Summary": "Caplin Point Laboratories delivered robust H1 FY26 performance with 10.8% revenue growth to ₹1,044 crores and 21.6% PAT growth to ₹311 crores, maintaining strong margins and debt-free operations.",
            "Sentiment": "positive",
            "PublishDate": 1768294287286,
            "Source": "stocks"
        },
        {
            "Title": "Caplin Point acquires 10 ANDAs worth $473M via subsidiaries",
            "Summary": "Caplin Point Laboratories acquired 10 approved ANDAs for injectable and ophthalmic products through subsidiaries CSL and COL, targeting $473.2M addressable market by August 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767247988744,
            "Source": "co_actions_results"
        },
        {
            "Title": "Caplin Point clears INVIMA-Colombia inspection",
            "Summary": "Caplin Point Laboratories successfully completed INVIMA-Colombia inspection at its Puducherry injectables facility from December 8-12, 2025, strengthening its Latin American expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1765542462676,
            "Source": "stocks"
        },
        {
            "Title": "Caplin Steriles Receives US FDA Approval for Linezolid Injection Generic Drug",
            "Summary": "Caplin Steriles Limited, a subsidiary of Caplin Point Laboratories, received final US FDA approval for its generic version of Linezolid Injection (600mg/300mL), equivalent to Pfizer's ZYVOX brand used for serious bacterial infections. The approved product addresses a market with US sales of approximately $23 million for the 12-month period ending October 2025, adding to Caplin Steriles' portfolio of 44 ANDA approvals out of 53 filed applications.",
            "Sentiment": "positive",
            "PublishDate": 1765269158987,
            "Source": "stock"
        },
        {
            "Title": "Caplin Point Lab's Subsidiary Receives USFDA Approval for Acetaminophen Injection Products",
            "Summary": "Caplin Steriles, a subsidiary of Caplin Point Lab, has received USFDA approval for acetaminophen injection and infusion bags. This regulatory approval allows the subsidiary to market these pharmaceutical products in the US market.",
            "Sentiment": "positive",
            "PublishDate": 1765237760389,
            "Source": "stock"
        },
        {
            "Title": "Caplin Point Laboratories' Mexico Subsidiary Acquires 5.5 Acres for Manufacturing Facility",
            "Summary": "Caplin Point Laboratories' step-down subsidiary Triwin Pharma S.A DE C.V acquired 5.5 acres in Mexico for USD 22.37 lakh to establish a manufacturing facility. The greenfield project will produce suppositories and topical products with initial capacity of 50 million units per annum, requiring total investment of up to USD 15 million and targeting commissioning in FY 2027.",
            "Sentiment": "positive",
            "PublishDate": 1763127477688,
            "Source": "stock"
        },
        {
            "Title": "Caplin Point Laboratories Reports Strong Q2FY26 Results with 21.6% PAT Growth",
            "Summary": "Caplin Point Laboratories announced its quarterly results with consolidated revenue from operations reaching Rs 534 crores, up 10.5% year-over-year. The company's profit after tax increased 21.6% to Rs 311 crores for the half-year period. The Board approved the appointment of Mr. Ashok Partheeban and Mr. Vivek Partheeban as Additional Directors and Vice-Chairmen, effective November 5, 2025. Mr. Vivek Partheeban relinquished his position as Chief Operating Officer following his board appointment. Dr. KC John was appointed as Additional Independent Director. The company's US market revenue recorded 27% growth, reaching Rs 221 crores for the half-year. Free cash reserves stand at Rs 1,334 crores with liquid assets at Rs 2,358 crores. The company maintains a debt-free status and reported strong operational performance across its Latin American and US regulated markets.",
            "Sentiment": "positive",
            "PublishDate": 1762330890030,
            "Source": "earnings"
        },
        {
            "Title": "Caplin Point Laboratories Receives USFDA Approval and Acquires ANDA Products Worth $121 Million",
            "Summary": "Caplin Point Laboratories received USFDA approval for Nicardipine Hydrochloride Injection. The company also acquired four approved ANDA products valued at approximately $121 million.",
            "Sentiment": "positive",
            "PublishDate": 1761211285517,
            "Source": "stock"
        },
        {
            "Title": "Caplin Steriles Receives USFDA Approval for Generic Milrinone Lactate Injection",
            "Summary": "Caplin Steriles, a subsidiary of Caplin Point Laboratories, has received final approval from the USFDA for Milrinone Lactate Injection, which serves as a generic alternative to Primacor. The US market for this product generated approximately $11 million in sales last year.",
            "Sentiment": "positive",
            "PublishDate": 1756888319178,
            "Source": "stock"
        },
        {
            "Title": "Caplin Point Laboratories Reports Strong Q1 Performance with 17% Growth in Net Profit",
            "Summary": "Caplin Point Laboratories reported Q1 EBITDA of 1.78 billion rupees compared to 1.52 billion rupees in the same period last year. The company's EBITDA margin improved to 34.84% from 33.1% year-over-year. Consolidated net profit increased to 1.53 billion rupees versus 1.24 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754551758500,
            "Source": "earnings"
        },
        {
            "Title": "Caplin Point Laboratories: Subsidiary to Acquire Mexican Pharma Company",
            "Summary": "Caplin Point Far East Ltd, a subsidiary of Caplin Point Laboratories, has executed a share purchase agreement to acquire the entire stake in Triwin Pharma, a Mexican company. The acquisition aims to establish a local presence in Mexico for tender sales, direct sales, marketing, and distribution of Caplin Point's products. The deal is expected to be completed within 30 days.",
            "Sentiment": "positive",
            "PublishDate": 1749028794000,
            "Source": "corporate_action"
        },
        {
            "Title": "Caplin Point Lab to Acquire 100% Ownership of Triwin Pharma",
            "Summary": "Caplin Point Lab has signed a share purchase agreement to acquire 100% ownership of Triwin Pharma S.A. de C.V. The acquisition involves a pharmaceutical company, suggesting a strategic move to expand Caplin Point Lab's market presence or product portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1749022946000,
            "Source": "default"
        },
        {
            "Title": "Caplin Point Laboratories: Q4 Profit Up 17%, Declares ₹3 Dividend",
            "Summary": "Caplin Point Laboratories reported a 17.3% YoY increase in Q4 net profit to ₹142.6 crore. Revenue grew 11% to ₹503 crore, with EBITDA margins expanding to 33.5%. The company declared an interim dividend of ₹3 per share for FY25. Management projects 13-14% topline growth for FY26 with EBITDA margins expected to remain between 32-34%.",
            "Sentiment": "positive",
            "PublishDate": 1747297359000,
            "Source": "earnings"
        },
        {
            "Title": "Caplin Point Laboratories Reports Q4 Profit Increase",
            "Summary": "Caplin Point Laboratories has announced its Q4 consolidated net profit, which stands at 1.45 billion rupees, up from 1.2 billion rupees in the same period last year. This represents a year-over-year increase in the company's quarterly earnings.",
            "Sentiment": "positive",
            "PublishDate": 1747295751000,
            "Source": "result"
        },
        {
            "Title": "Caplin Point Laboratories' Subsidiary Receives FDA Approval for Haloperidol Decanoate Injection",
            "Summary": "A subsidiary of Caplin Point Laboratories has obtained approval from the United States Food and Drug Administration (USFDA) for Haloperidol Decanoate Injection. This approval allows the company to market and distribute this pharmaceutical product in the United States.",
            "Sentiment": "positive",
            "PublishDate": 1747201017000,
            "Source": "default"
        },
        {
            "Title": "Caplin Point Laboratories: FDA Approves Subsidiary's Vitamin K Deficiency Treatment",
            "Summary": "Caplin Steriles, a subsidiary of Caplin Point Laboratories, received USFDA approval for Phytonadione Injectable Emulsion USP, a generic treatment for Vitamin K deficiency. The product had $18.5 million in US sales over the past year. Caplin Steriles now has 35 USFDA approvals out of 47 ANDA filings.",
            "Sentiment": "positive",
            "PublishDate": 1745395887000,
            "Source": "corporate_action"
        },
        {
            "Title": "Caplin Point Labs Subsidiary Receives USFDA Approval for Injectable Drug",
            "Summary": "A subsidiary of Caplin Point Laboratories has obtained approval from the United States Food and Drug Administration (USFDA) for Phytonadione Injectable Emulsion. This approval allows the company to manufacture and market this injectable drug in the US market.",
            "Sentiment": "positive",
            "PublishDate": 1745385388000,
            "Source": "default"
        },
        {
            "Title": "Caplin Point Laboratories' Subsidiary Approves Investment in Chilean Pharmaceutical Distributor",
            "Summary": "A subsidiary of Caplin Point Laboratories has approved an investment in Neoethicals Chile Spa, a company involved in the marketing and distribution of pharmaceutical products in Chile. This move suggests an expansion of Caplin Point's operations into the South American pharmaceutical market.",
            "Sentiment": "positive",
            "PublishDate": 1743639274000,
            "Source": "corporate_action"
        },
        {
            "Title": "Caplin Point Laboratories' Subsidiary Approves Investment in Chilean Pharmaceutical Distributor",
            "Summary": "A subsidiary of Caplin Point Laboratories has approved an investment in Neoethicals Chile SPA, a company involved in the marketing and distribution of pharmaceutical products in Chile. This move suggests an expansion of Caplin Point's operations into the Chilean pharmaceutical market.",
            "Sentiment": "positive",
            "PublishDate": 1743593147000,
            "Source": "corporate_action"
        },
        {
            "Title": "Caplin Steriles Receives FDA Approval for Glaucoma Eye Drops",
            "Summary": "Caplin Point Laboratories' subsidiary, Caplin Steriles, has received FDA approval for Brimonidine Tartrate and Timolol Maleate Ophthalmic Solution, a treatment for glaucoma. The approved eye drops had US sales of approximately $242 million for the 12-month period ending December 2024, according to IQVIATM (IMS Health) data.",
            "Sentiment": "positive",
            "PublishDate": 1740615442000,
            "Source": "corporate_action"
        },
        {
            "Title": "Caplin Steriles Receives USFDA Approval for Glaucoma Eye Drops",
            "Summary": "Caplin Steriles, a subsidiary of Caplin Point Laboratories, has obtained USFDA approval for Brimonidine Tartrate and Timolol Maleate Ophthalmic Solution, used to treat glaucoma. According to IQVIA data, this medication had US sales of approximately $242 million for the 12-month period ending December 2024.",
            "Sentiment": "positive",
            "PublishDate": 1740571053000,
            "Source": "corporate_action"
        },
        {
            "Title": "Caplin Point Laboratories: Eyes 13-14% Revenue Growth by FY26 Through US Expansion",
            "Summary": "Caplin Point Laboratories aims for 13-14% revenue growth in FY26, driven by its expansion plans in the United States market.",
            "Sentiment": "positive",
            "PublishDate": 1739251042000,
            "Source": "normal_news"
        },
        {
            "Title": "Caplin Point Laboratories Reports Improved Q3 EBITDA and Margin",
            "Summary": "Caplin Point Laboratories has announced its Q3 financial results. The company's EBITDA increased to 1.94 billion rupees, up from 1.6 billion rupees in the same quarter last year. Additionally, the EBITDA margin improved to 36.9% from 35.2% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738914606000,
            "Source": "earnings"
        },
        {
            "Title": "Caplin Point Laboratories Reports Increase in Q3 Consolidated Net Profit",
            "Summary": "Caplin Point Laboratories has announced its financial results for the third quarter. The company's consolidated net profit increased to 1.4 billion rupees, up from 1.2 billion rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738914421000,
            "Source": "earnings"
        },
        {
            "Title": "Caplin Steriles Receives USFDA Approval for Procainamide Hydrochloride Injection",
            "Summary": "Caplin Steriles, a subsidiary of Caplin Point Laboratories, has obtained approval from the United States Food and Drug Administration (USFDA) for Procainamide Hydrochloride Injection. This approval allows the company to manufacture and market the medication in the US market, potentially expanding its product portfolio and market presence.",
            "Sentiment": "positive",
            "PublishDate": 1738734003000,
            "Source": "corporate_action"
        },
        {
            "Title": "Caplin Point Laboratories Receives USFDA Approval for Levetiracetam Injection",
            "Summary": "Caplin Point Laboratories' steriles division has obtained approval from the United States Food and Drug Administration (USFDA) for Levetiracetam in Sodium Chloride Injection, which will be available in infusion bags. This approval represents a significant milestone for the company's pharmaceutical product portfolio in the US market.",
            "Sentiment": "positive",
            "PublishDate": 1737096142000,
            "Source": "corporate_action"
        },
        {
            "Title": "Caplin Point Laboratories: FDA Inspection Concludes with Zero Violations",
            "Summary": "US FDA completed an unexpected inspection at Caplin Point Laboratories' Tamil Nadu facility with no 483 observations. The inspection took place from August 5-9, 2024, at Caplin Steriles' injectable and ophthalmic manufacturing facility. The company's share price rose 3.46% to Rs 2,594.95, its highest level since January 3.",
            "Sentiment": "positive",
            "PublishDate": 1736228255000,
            "Source": "normal_news"
        },
        {
            "Title": "Caplin Point Laboratories Receives FDA Inspection Report with Zero Observations",
            "Summary": "Caplin Point Laboratories announced receipt of the Establishment Inspection Report (EIR) from the U.S. FDA for their Caplin Steriles' injectable and ophthalmic manufacturing facility in Gummidipoondi. The unannounced inspection, conducted from August 5-9, 2024, concluded with zero 483 observations.",
            "Sentiment": "positive",
            "PublishDate": 1736208522000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Caplin Point Laboratories: FDA Inspection Passed with Zero Observations",
            "Summary": "Caplin Point Laboratories' injectable and ophthalmic manufacturing facility in Gummidipoondi, Tamil Nadu, passed an unannounced FDA inspection conducted from August 5-9, 2024, with zero 483 observations. The company received the Establishment Inspection Report (EIR) confirming compliance with Good Manufacturing Practices.",
            "Sentiment": "positive",
            "PublishDate": 1736174909000,
            "Source": "normal_news"
        },
        {
            "Title": "Caplin Point Laboratories Receives FDA Inspection Report with Zero Observations",
            "Summary": "Caplin Point Laboratories announced that it has received the Establishment Inspection Report (EIR) from the U.S. Food and Drug Administration (FDA) for a recent inspection of Caplin Steriles' injectable and ophthalmic manufacturing facility in Gummidipoondi. The unannounced FDA inspection took place from August 5th to 9th, 2024, and concluded with zero 483 observations, indicating no significant issues were found.",
            "Sentiment": "positive",
            "PublishDate": 1736169030000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Caplin Steriles Receives USFDA Approval for Difluprednate Ophthalmic Emulsion",
            "Summary": "Caplin Steriles, a subsidiary of Caplin Point Laboratories, has obtained approval from the United States Food and Drug Administration (USFDA) for Difluprednate Ophthalmic Emulsion. This product has an estimated US market size of approximately USD 21 million.",
            "Sentiment": "positive",
            "PublishDate": 1734332011000,
            "Source": "corporate_action"
        },
        {
            "Title": "Caplin Point Lab Reports Q2 EBITDA Growth",
            "Summary": "Caplin Point Lab announced its Q2 financial results. The company's EBITDA increased to 1.86 billion rupees from 1.58 billion rupees year-over-year. The EBITDA margin also saw a slight improvement, rising to 36.8% from 36.7% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730966717000,
            "Source": "result"
        },
        {
            "Title": "Caplin Point Lab Reports Strong US Market Growth in H1 FY25",
            "Summary": "Caplin Point Laboratories announced that its revenue from the US market for the first half of fiscal year 2025 reached Rs 170 crores, representing a significant year-over-year growth of 40.8%.",
            "Sentiment": "positive",
            "PublishDate": 1730966700000,
            "Source": "result"
        },
        {
            "Title": "Caplin Point Laboratories Reports Q2 Revenue Growth",
            "Summary": "Caplin Point Laboratories has announced its second quarter revenue for the current fiscal year. The company reported revenue of 4.83 billion rupees, compared to 4.1 billion rupees in the same quarter of the previous year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730966625000,
            "Source": "result"
        },
        {
            "Title": "Caplin Point Laboratories Reports Q2 Profit Increase",
            "Summary": "Caplin Point Laboratories has reported a consolidated net profit of 1.31 billion rupees for the second quarter, up from 1.2 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730966602000,
            "Source": "result"
        }
    ]
}