{
    "Symbol": "CAPTRUST",
    "ISIN": "INE707C01018",
    "News": [
        {
            "Title": "Capital Trust Board Meet Set for Nov 14 for Q3 Results",
            "Summary": "Capital Trust Limited schedules board meeting on November 14, 2025 to consider Q3FY26 unaudited financial results for quarter ended December 31, 2025. Trading window closed from January 1-February 14, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770644296658,
            "Source": "co_actions_results"
        },
        {
            "Title": "Capital Trust Rating Cut to BB from BB+ by CARE",
            "Summary": "CARE Ratings downgrades Capital Trust's long-term bank facilities to BB from BB+ citing weak profitability, deteriorating asset quality, and declining scale of operations.",
            "Sentiment": "negative",
            "PublishDate": 1765966059614,
            "Source": "stocks"
        },
        {
            "Title": "Capital Trust Limited Completes ₹38.1 Million Rights Issue, Shifts Strategy to Secured Lending",
            "Summary": "Capital Trust Limited successfully completed its rights issue raising ₹38.1 million with 1.33 times oversubscription and announced entry into gold loan business while writing off existing unsecured loan portfolio. The company will continue offering unsecured MSME loans through co-lending partnerships and has opened dedicated gold loan branches across its 250-branch network in rural and semi-urban India.",
            "Sentiment": "positive",
            "PublishDate": 1763141288957,
            "Source": "corporate_action"
        },
        {
            "Title": "Capital Trust Limited Reports Loss of Rs 1,788.35 Lakhs in Q2 FY26 Amid Cautious Lending Approach",
            "Summary": "Capital Trust Limited posted a net loss of Rs 1,788.35 lakhs for the quarter ended September 30, 2025, compared to a profit of Rs 23.26 lakhs in the same quarter last year, with total income declining to Rs 862.40 lakhs from Rs 2,811.14 lakhs. The company has adopted a cautious approach to disbursements due to collection challenges in unsecured lending, resulting in lower disbursements and reduced asset under management, while successfully closing a rights issue of Rs 2,381 lakhs in November 2025.",
            "Sentiment": "negative",
            "PublishDate": 1763138623317,
            "Source": "earnings"
        },
        {
            "Title": "Capital Trust Limited Allots 1.7 Crore Equity Shares Through Rights Issue",
            "Summary": "Capital Trust Limited completed the allotment of 17,009,702 fully paid equity shares at Rs. 14 per share (including a premium of Rs. 4 per share) through a rights issue worth Rs. 2,381.36 lakhs. The rights issue was approved for eligible equity shareholders as of the record date October 10, 2025. Following this allotment, the company's paid-up equity share capital increased to 3,40,19,404 shares valued at Rs. 34,01,94,040. The company kept some rights equity shares in abeyance due to a pending court dispute regarding ownership of underlying equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1762987149252,
            "Source": "corporate_action"
        },
        {
            "Title": "Capital Trust Limited Receives Exchange Approval for Rs. 25 Crore Rights Issue",
            "Summary": "Capital Trust Limited has received in-principle approval from NSE and BSE for a proposed rights issue of up to Rs. 25 crores. The company's Rights Issue Committee approved the terms and Letter of Offer for issuing 1,70,09,702 fully paid-up equity shares at Rs. 14 per share, comprising face value of Rs. 10 and premium of Rs. 4. The rights entitlement ratio is set at 1:1, meaning one rights equity share for every one existing share held by eligible shareholders. The record date is October 10, 2025, with the issue opening on October 20, 2025 and closing on November 11, 2025. Upon full subscription, the total outstanding equity shares will increase from 1,70,09,702 to 3,40,19,404 shares.",
            "Sentiment": "positive",
            "PublishDate": 1759501322920,
            "Source": "corporate_action"
        },
        {
            "Title": "Capital Trust Launches Gold Loan Services",
            "Summary": "Capital Trust has started offering gold loans as a new financial service.",
            "Sentiment": "positive",
            "PublishDate": 1759319239174,
            "Source": "stock"
        },
        {
            "Title": "Capital Trust Limited Approves Rights Issue of Up to ₹40 Crores",
            "Summary": "Capital Trust Limited's board approved a rights issue of fully paid-up equity shares with a face value of ₹10 each, for an issue size of up to ₹40 crores. The rights issue will be offered to eligible equity shareholders as of a record date to be announced later. A Rights Issue Committee was formed to determine the terms and conditions of the issue, including finalizing the issue size, rights entitlement ratio, issue price, record date, and timing. The committee will also handle the draft letter of offer, appointment of intermediaries, share allotment, and other related matters. The board meeting was held on September 18, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758198179563,
            "Source": "corporate_action"
        },
        {
            "Title": "Capital Trust Limited Schedules Board Meeting to Consider Rights Issue of Equity Shares",
            "Summary": "Capital Trust Limited has scheduled a board meeting for September 18, 2025, to consider raising funds through a rights issue of equity shares with a face value of ₹10 each to eligible shareholders. The board will also constitute a Rights Issue Committee to handle matters related to the rights issue. The fund raising is subject to necessary regulatory approvals and compliance with the Companies Act 2013, SEBI regulations, and other applicable laws.",
            "Sentiment": "neutral",
            "PublishDate": 1757943052044,
            "Source": "corporate_action"
        },
        {
            "Title": "Capital Trust Limited Reports Q1 FY2026 Results with ₹8.3 Crore Loss Amid Portfolio Contraction",
            "Summary": "Capital Trust Limited, a technology-driven NBFC focused on informal MSME lending in rural India, reported a loss after tax of ₹8.3 crores for Q1 FY2026. The company's total assets under management declined 13% quarter-on-quarter to ₹167 crores, while total income dropped 40% to ₹12.6 crores compared to the previous quarter. The on-book portfolio decreased 17% to ₹73.7 crores and off-book portfolio fell 9% to ₹92.8 crores. Gross NPA and Net NPA stood at 9.1% and 3.7% respectively. The company attributed the AUM contraction and rise in NPA percentage to portfolio run-off and intentionally reduced disbursements amid prevailing stress in the MFI and deep rural market. Capital Trust operates through 284 branches across 10 states, targeting shopkeepers and traders with loans ranging from ₹50,000 to ₹10 lakhs. The company has disbursed over ₹4,500 crores to 12+ lakh clients historically and maintains partnerships with 16 on-balance sheet funders and 5 co-lending partners.",
            "Sentiment": "negative",
            "PublishDate": 1755523313821,
            "Source": "stock"
        },
        {
            "Title": "Capital Trust Limited Reports Loss of Rs 832.34 Lakhs in Q1 Results",
            "Summary": "Capital Trust Limited reported a net loss of Rs 832.34 lakhs for the quarter ended June 30, 2025, compared to a profit of Rs 73.36 lakhs in the same quarter last year. Total income declined to Rs 1,263.57 lakhs from Rs 2,474.82 lakhs year-on-year. The company's earnings per share turned negative at Rs (4.89) versus Rs 0.45 in the previous year. The company adopted a cautious approach to disbursements due to collection challenges in unsecured lending and small loan sectors, resulting in lower disbursements and reduced assets under management. Other expenses included a waiver of overdue interest amounting to Rs 265.12 lakhs due to non-collection. The company's rights issue opened on June 25, 2025 and closed on July 24, 2025, but was unsuccessful. Capital Trust operates solely in financing activities and transferred loans worth Rs 525.86 lakhs through direct assignment during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1755176960209,
            "Source": "earnings"
        },
        {
            "Title": "Capital Trust Partners with CBV Ventures for FMCG Distribution",
            "Summary": "Capital Trust has formed a partnership with CBV Ventures to enhance its FMCG distribution capabilities. The collaboration aims to strengthen Capital Trust's position in the FMCG distribution sector.",
            "Sentiment": "positive",
            "PublishDate": 1751635600000,
            "Source": "default"
        }
    ]
}