{
    "Symbol": "CARBORUNIV",
    "ISIN": "INE120A01034",
    "News": [
        {
            "Title": "Carborundum Universal Block Trade Worth Rs. 15.86 Cr",
            "Summary": "Carborundum Universal witnessed a significant NSE block trade worth Rs. 15.86 crores involving 201,417 shares at Rs. 787.65 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1770098448732,
            "Source": "co_actions_results"
        },
        {
            "Title": "Carborundum Universal Shares Investor Call Recording",
            "Summary": "Carborundum Universal Limited has uploaded the audio recording of its investor call held on January 30, 2026, making it accessible on the company website for stakeholder reference.",
            "Sentiment": "neutral",
            "PublishDate": 1769779255993,
            "Source": "stocks"
        },
        {
            "Title": "Carborundum Universal Q3FY26 Results Call on Jan 30",
            "Summary": "Carborundum Universal Limited has scheduled an analyst/investor call on January 30, 2026 at 11:00 AM IST to discuss Q3FY26 unaudited financial results, organized by DAM Capital Advisors.",
            "Sentiment": "neutral",
            "PublishDate": 1769164486873,
            "Source": "co_actions_results"
        },
        {
            "Title": "Carborundum Universal Liquidates Czech Subsidiary",
            "Summary": "Carborundum Universal announces voluntary liquidation of its step-down subsidiary CUMI Europe s.r.o. in Czech Republic, which ceased operations in 2018 after being set up for European marketing activities.",
            "Sentiment": "neutral",
            "PublishDate": 1767196414005,
            "Source": "co_actions_results"
        },
        {
            "Title": "Carborundum Universal Allots 6,876 Equity Shares Under ESOP Scheme",
            "Summary": "Carborundum Universal Limited allotted 6,876 equity shares of Re. 1 each to option grantees under its ESOP Plan 2016. Following this allotment, the company's total outstanding equity shares increased to 19,04,47,864 with paid-up share capital of Rs. 19,04,47,864.",
            "Sentiment": "neutral",
            "PublishDate": 1765279436622,
            "Source": "corporate_action"
        },
        {
            "Title": "Carborundum Universal Independent Director P.S. Raghavan Passes Away",
            "Summary": "P.S. Raghavan, Independent Director of Carborundum Universal Limited, passed away on November 24, 2025, ending his directorship that began in May 2017. His death results in cessation of his roles as Chairman of Nomination & Remuneration Committee and Risk Management Committee, along with membership in three other board committees.",
            "Sentiment": "negative",
            "PublishDate": 1763992910771,
            "Source": "corporate_governance"
        },
        {
            "Title": "Carborundum Universal Receives Stock Exchange Approvals for Promoter Group Reclassification",
            "Summary": "BSE and NSE have granted no-objection approvals for reclassifying Coromandel Engineering Company Limited and Yanmar Coromandel Agrisolutions Private Limited from Carborundum Universal's promoter group category. The reclassification removes these two entities from the promoter group status, affecting the company's ownership structure and regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1763174515161,
            "Source": "corporate_action"
        },
        {
            "Title": "Carborundum Universal Reports 6.4% Revenue Growth in Q2FY26 Despite VAW Sanctions Impact",
            "Summary": "Carborundum Universal achieved consolidated sales of INR 1,287 crores in Q2FY26, representing 6.4% growth compared to INR 1,209 crores in Q2FY25. The Abrasives segment grew 7.4% to INR 584 crores, while Ceramics increased 7.8% to INR 301 crores. Electrominerals declined marginally by 0.9% to INR 399 crores. PBIT for the quarter was INR 111 crores versus INR 154 crores in the previous year. The company's Russian subsidiary VAW experienced a 37.2% decline in local currency sales due to ongoing sanctions, with management expecting a 25% volume reduction for the full year. Standalone operations showed modest 1% growth to INR 712 crores. The company maintained its full-year guidance of 5.5-6.5% consolidated sales growth and confirmed capex spending of INR 350 crores, with INR 162 crores already invested in H1FY26. Management highlighted sequential recovery in the Abrasives business and expects stronger performance in the second half, particularly in Ceramics driven by order backlogs.",
            "Sentiment": "neutral",
            "PublishDate": 1762415769466,
            "Source": "earnings"
        },
        {
            "Title": "Carborundum Universal Issues ₹25.55 Crore Corporate Guarantee for South African Subsidiary",
            "Summary": "Carborundum Universal Limited has issued a corporate guarantee of RAND 50 million (approximately ₹25.55 crores) in favor of Citibank N.A. for working capital facilities obtained by its South African subsidiary, Foskor Zirconia Pty Ltd (FZL). The guarantee will remain valid until September 18, 2026. In case of default by FZL, the bank can invoke the guarantee against Carborundum Universal for up to RAND 50 million. The guarantee is being treated as a contingent liability in the company's books. The promoter/promoter group/group companies have no interest in this transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1762276594652,
            "Source": "corporate_action"
        },
        {
            "Title": "Carborundum Universal Reports Profit Decline Due to Russian Subsidiary Impact",
            "Summary": "Carborundum Universal reported a decline in profits attributed to lower earnings from its Russian subsidiary, which has been affected by sanctions.",
            "Sentiment": "negative",
            "PublishDate": 1761834092826,
            "Source": "earnings"
        },
        {
            "Title": "Carborundum Universal Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Carborundum Universal reported quarterly results showing revenue growth to 12.98 billion rupees from 12.24 billion rupees in the previous year. However, net profit declined to 745.1 million rupees compared to 1.16 billion rupees in the same period last year. EBITDA decreased to 1.56 billion rupees from 1.94 billion rupees, while EBITDA margin compressed to 12.05% from 15.93% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1761824062483,
            "Source": "earnings"
        },
        {
            "Title": "Carborundum Universal Applies for Promoter Group Reclassification to Public Category",
            "Summary": "Carborundum Universal Limited has applied to the National Stock Exchange of India Limited and BSE Limited for reclassification of Coromandel Engineering Company Limited and Yanmar Coromandel Agrisolutions Private Limited from 'Promoter Group' to 'Public' category. The application was made based on requests from these entities and follows earlier intimations dated August 29, September 17, and October 8. The reclassification is being processed in accordance with SEBI Listing Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1760366844935,
            "Source": "corporate_action"
        },
        {
            "Title": "Carborundum Universal CFO Sushil Kishor Bendale Resigns",
            "Summary": "Sushil Kishor Bendale has resigned from his position as Chief Financial Officer at Carborundum Universal.",
            "Sentiment": "negative",
            "PublishDate": 1758893417020,
            "Source": "corporate_governance"
        },
        {
            "Title": "Yanmar Coromandel Agrisolutions Seeks Reclassification from Promoter Group to Public Category",
            "Summary": "Yanmar Coromandel Agrisolutions Private Limited (YCAS) has requested reclassification from Carborundum Universal Limited's promoter group category to public category. The request follows a change in shareholding structure where Coromandel International Limited's stake in YCAS decreased from 40% to 10.60% after Yanmar Asia (Singapore) Corporation infused Rs.149.72 crores on September 27, 2024. This fund infusion involved allotment of 11,09,00,741 equity shares worth Rs.10 each to Yanmar Singapore. YCAS currently holds no shares in Carborundum Universal Limited. The company confirms YCAS no longer meets the promoter group definition as CIL holds less than 20% equity in YCAS. The request will be presented to the Board of Directors for approval, followed by seeking approvals from NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1758111914878,
            "Source": "corporate_action"
        },
        {
            "Title": "Carborundum Universal Q1 FY26 Results: Consolidated PAT Drops 45% to ₹62 Crores on Lower Volumes",
            "Summary": "Carborundum Universal reported consolidated sales of ₹1,207 crores for Q1 FY26, up 1.9% year-on-year. However, consolidated PAT declined 45.2% to ₹62 crores from ₹113 crores in Q1 FY25, primarily due to lower volumes at VAW (down 25% due to sanctions), logistics disruptions at Rhodius causing EUR 4 million sales loss, and domestic abrasives weakness. Standalone PAT grew 55.4% to ₹145 crores, boosted by a one-time ₹68 crore dividend from SEDCO. Ceramics segment performed well with 11.1% sales growth and improved margins at 25%. The company revised its full-year guidance downward, expecting consolidated PBIT margin drop of 250-300 basis points compared to earlier guidance of 100-150 basis points. Management expects Rhodius logistics issues to resolve by end of August and inventory-related margin pressures in electrominerals to normalize.",
            "Sentiment": "negative",
            "PublishDate": 1755172514186,
            "Source": "earnings"
        },
        {
            "Title": "Carborundum Universal Reports 45% Decline in Q1 Net Profit Despite Revenue Growth",
            "Summary": "Carborundum Universal reported Q1 consolidated net profit of 619 million rupees, down from 1.13 billion rupees in the same period last year. The company's EBITDA fell to 1.21 billion rupees from 1.94 billion rupees year-over-year, with EBITDA margin contracting to 9.95% from 16.16%. Revenue showed marginal growth to 12 billion rupees compared to 11.97 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754557725932,
            "Source": "earnings"
        },
        {
            "Title": "Carborundum Universal Acquires 4.19% Stake in GEPL",
            "Summary": "Carborundum Universal has invested 79.6 million rupees to acquire a 4.19% stake in GEPL. No additional details about GEPL or the reasons for the investment were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1750863725000,
            "Source": "default"
        },
        {
            "Title": "Carborundum Universal: ICICI Securities Cuts Target Price After Underwhelming Q4 Results",
            "Summary": "ICICI Securities maintains 'Reduce' rating on Carborundum Universal and lowers target price following disappointing Q4 results. The company's FY26 guidance is muted due to continued weakness in underlying businesses. Carborundum has unveiled a five-year strategy to double revenues and market share while improving sustainable profits.",
            "Sentiment": "negative",
            "PublishDate": 1747219131000,
            "Source": "earnings"
        },
        {
            "Title": "Carborundum Universal: Q4 Profit Drops, Annual Revenue Rises",
            "Summary": "Carborundum Universal reported Q4 FY2025 net profit of Rs 30.10 crore, down from Rs 142.56 crore year-over-year. Annual consolidated total income increased to Rs 4,935.22 crore. The company recommended a final dividend of Rs 2.50 per share, bringing total dividend to Rs 4 per share for FY2025.",
            "Sentiment": "neutral",
            "PublishDate": 1747137258000,
            "Source": "earnings"
        },
        {
            "Title": "Carborundum Universal Reports Q4 Results and Dividend",
            "Summary": "Carborundum Universal announced its Q4 consolidated net profit of 291 million rupees, down from 1.35 billion rupees year-over-year but up from 348 million rupees quarter-over-quarter. Q4 revenue increased to 12.2 billion rupees from 12.01 billion rupees year-over-year. The company has recommended a dividend of 2.5 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1747095792000,
            "Source": "default"
        },
        {
            "Title": "Carborundum Universal: Q4 Profit Plunges 79% on Weak Operational Performance",
            "Summary": "Carborundum Universal reported a 79% drop in Q4 profit to ₹30 crore, despite a 1.3% revenue increase to ₹1,217 crore. EBITDA fell 30.3% to ₹146 crore, with margins narrowing to 12% from 17.4%. The company declared a final dividend of ₹2.5 per share for FY25.",
            "Sentiment": "negative",
            "PublishDate": 1747055058000,
            "Source": "earnings"
        },
        {
            "Title": "Carborundum Universal Reports Q4 Results and Dividend Recommendation",
            "Summary": "Carborundum Universal has announced its Q4 financial results and dividend recommendation. The company's Q4 consolidated net profit decreased to 291 million rupees from 1.35 billion rupees year-over-year. Revenue slightly increased to 12.2 billion rupees from 12.01 billion rupees. EBITDA fell to 1.5 billion rupees from 2.09 billion, with EBITDA margin declining to 12.02% from 17.44%. The company has recommended a dividend of 2.5 rupees per share.",
            "Sentiment": "negative",
            "PublishDate": 1747051006000,
            "Source": "result"
        },
        {
            "Title": "Carborundum Universal to Consider Q4 Results on May 12",
            "Summary": "Carborundum Universal has announced that it will consider its fourth quarter financial results on May 12. This is a routine corporate announcement regarding the company's upcoming earnings release.",
            "Sentiment": "neutral",
            "PublishDate": 1746195202000,
            "Source": "default"
        },
        {
            "Title": "Carborundum Universal's Subsidiary Sells Partial Investment for 965 Million Rupees",
            "Summary": "Southern Energy Development Corp Ltd (SEDCO), a subsidiary of Carborundum Universal engaged in power generation, has sold a portion of its investments held in the company for 965 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1743171829000,
            "Source": "corporate_action"
        },
        {
            "Title": "Carborundum Universal Reports Q3 Financial Results and Dividend Declaration",
            "Summary": "Carborundum Universal announced its Q3 consolidated net profit of 348 million rupees, down from 1.1 billion rupees year-over-year. Revenue increased to 12.6 billion rupees from 11.5 billion rupees in the previous year. The company reported an exceptional item of 1.04 billion rupees and a profit before tax of 1.4 billion rupees. A dividend of 1.5 rupees per share was declared. Additionally, the company's subsidiary, Volzhsky Abrasive Works in Russia, has been included in the US OFAC SDN list.",
            "Sentiment": "neutral",
            "PublishDate": 1739492276000,
            "Source": "earnings"
        },
        {
            "Title": "Carborundum Universal Ltd: Q3 Profit Plunges 69% Amid Exceptional Charge; Declares Interim Dividend",
            "Summary": "Carborundum Universal reported a 68.8% YoY decline in Q3 net profit to ₹34.7 crore due to a ₹104.13 crore exceptional charge related to US sanctions on Russian firm VAW. Revenue increased 9% to ₹1,255.5 crore. The company declared an interim dividend of ₹1.50 per share.",
            "Sentiment": "negative",
            "PublishDate": 1739469967000,
            "Source": "earnings"
        },
        {
            "Title": "Carborundum Universal's Russian Subsidiary Added to US Sanctions List",
            "Summary": "Carborundum Universal has reported that its subsidiary, Volzhsky Abrasive Works in Russia, has been included in the US Office of Foreign Assets Control's Specially Designated Nationals (SDN) list. This inclusion suggests that the subsidiary is now subject to US sanctions, which could have significant implications for its operations and the parent company's business in Russia.",
            "Sentiment": "negative",
            "PublishDate": 1739450717000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Carborundum Universal Declares Dividend of 1.5 Rupees per Share",
            "Summary": "Carborundum Universal has announced a dividend of 1.5 rupees per share for its shareholders. This corporate action reflects the company's decision to distribute a portion of its profits to its investors.",
            "Sentiment": "positive",
            "PublishDate": 1739448293000,
            "Source": "corporate_action"
        },
        {
            "Title": "Carborundum Universal Reports Q3 PBT of 1.4B Rupees with Exceptional Item",
            "Summary": "Carborundum Universal has reported a profit before tax (PBT) of 1.4 billion rupees for the third quarter, compared to 1.5 billion rupees in the same period last year. The company also disclosed an exceptional item of 1.04 billion rupees, which significantly impacts the financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1739448249000,
            "Source": "earnings"
        },
        {
            "Title": "Carborundum Universal Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Carborundum Universal has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 1.77 billion rupees from 1.92 billion rupees in the same quarter last year. Additionally, the EBITDA margin declined to 14.10% from 16.72% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739448194000,
            "Source": "earnings"
        },
        {
            "Title": "Carborundum Universal Reports Q3 Financial Results",
            "Summary": "Carborundum Universal has announced its Q3 consolidated net profit at 348 million rupees, showing a decrease from 1.1 billion rupees year-over-year and 1.16 billion rupees quarter-over-quarter. However, the company's Q3 revenue increased to 12.6 billion rupees from 11.5 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739448133000,
            "Source": "earnings"
        },
        {
            "Title": "Block Trade of Carborundum Universal Ltd Shares",
            "Summary": "A significant block trade occurred for Carborundum Universal Ltd on the National Stock Exchange (NSE). Approximately 283,506 shares were traded at a price of Rs. 1325.75 per share, amounting to a total transaction value of Rs. 37.59 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1734329230000,
            "Source": "block_deals"
        },
        {
            "Title": "Carborundum: Margin Pressure Leads to Guidance Cut",
            "Summary": "Carborundum faces incremental margin pressure in its Electro-Minerals segment, resulting in a guidance cut according to ICICI Securities' Q2 review.",
            "Sentiment": "negative",
            "PublishDate": 1730973635000,
            "Source": "result"
        },
        {
            "Title": "Carborundum Universal Plans Joint Product Development with SCP",
            "Summary": "Carborundum Universal has announced plans to collaborate with SCP (likely Saint-Gobain Ceramic Products) to develop new products and technologies. The partnership aims to leverage SCP's expertise in furnace design, patterning, and tooling. This information was shared during a company conference call.",
            "Sentiment": "positive",
            "PublishDate": 1730777182000,
            "Source": "corporate_action"
        },
        {
            "Title": "Carborundum Universal Anticipates Raw Material Price Increases",
            "Summary": "Carborundum Universal has indicated during a conference call that they are expecting price increases in alumina and other raw materials used in their production processes. This information suggests potential cost pressures for the company in the near future.",
            "Sentiment": "negative",
            "PublishDate": 1730777100000,
            "Source": "normal_news"
        },
        {
            "Title": "Carborundum Universal Revises Growth Forecast and Provides Awuko Update",
            "Summary": "Carborundum Universal has adjusted its full-year growth expectation to 9%, down from the previous guidance of 10%. The company also reports that its subsidiary Awuko is expected to increase sales by €2 million, but with an anticipated EBITDA loss of approximately €4.5 million.",
            "Sentiment": "neutral",
            "PublishDate": 1730777069000,
            "Source": "result"
        },
        {
            "Title": "Carborundum Universal Reports Q2 EBITDA Growth",
            "Summary": "Carborundum Universal has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 1.94 billion rupees, up from 1.8 billion rupees in the same quarter last year. The EBITDA margin also improved, rising to 15.93% from 15.59% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730280221000,
            "Source": "result"
        },
        {
            "Title": "Carborundum Universal Reports Q2 Revenue Growth",
            "Summary": "Carborundum Universal has announced its second quarter revenue of 12.24 billion rupees, compared to 11.46 billion rupees in the same period last year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730280202000,
            "Source": "result"
        },
        {
            "Title": "Carborundum Universal Reports Q2 Profit Growth",
            "Summary": "Carborundum Universal has announced its Q2 consolidated net profit of 1.16 billion rupees, showing an increase from 1.02 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730280179000,
            "Source": "result"
        }
    ]
}