{
    "Symbol": "CARERATING",
    "ISIN": "INE752H01013",
    "News": [
        {
            "Title": "CARE Ratings Q3 FY26 Results Show Strong Growth",
            "Summary": "CARE Ratings Limited reported robust Q3 FY26 performance with standalone revenue growing 15% YoY to Rs. 90.24 crores and consolidated revenue up 16% to Rs. 112.12 crores, driven by strong ratings segment growth.",
            "Sentiment": "positive",
            "PublishDate": 1770816860067,
            "Source": "co_actions_results"
        },
        {
            "Title": "Foreign banks eye India expansion amid low credit depth",
            "Summary": "Care Ratings study reveals India's 53% credit-to-GDP ratio lags advanced economies, creating opportunities for foreign bank expansion as recent investments by Emirates NBD, MUFG Bank exceed Rs 80,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1769394761702,
            "Source": "stocks"
        },
        {
            "Title": "CARE Ratings Revises Board Committee Composition",
            "Summary": "CARE Ratings Limited announces changes in Board Committee composition with immediate effect following Board meeting held on January 20, 2026, restructuring key committees including Nomination and Remuneration Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1768907840488,
            "Source": "stocks"
        },
        {
            "Title": "CARE Ratings Postal Ballot Results: Dr. Bimal Patel Appointed",
            "Summary": "CARE Ratings Limited successfully completed postal ballot voting on January 15, 2026, with 99.99% approval for Dr. Bimal Patel's appointment as Non-Executive Independent Director for three years.",
            "Sentiment": "positive",
            "PublishDate": 1765885528358,
            "Source": "stocks"
        },
        {
            "Title": "CARE Ratings Allots 11,666 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "CARE Ratings Limited allotted 11,666 equity shares of Rs. 10 face value each to employees under its Employee Stock Option Scheme 2020. The company's paid-up share capital increased from Rs. 30,01,33,630 to Rs. 30,02,50,290, expanding the total equity shares from 3,00,13,363 to 3,00,25,029.",
            "Sentiment": "neutral",
            "PublishDate": 1765198980511,
            "Source": "corporate_action"
        },
        {
            "Title": "CARE Ratings Receives SEBI Recognition as Past Risk and Return Verification Agency",
            "Summary": "CARE Ratings Limited has received final recognition from SEBI to operate as a Past Risk and Return Verification Agency (PaRRVA) under SEBI Circular dated April 4, 2025, with NSE serving as the PaRRVA Data Centre. The company will collaborate with NSE to verify risk-return metrics of Investment Advisers, Research Analysts, and Algorithmic Trading Providers on-boarded by stock brokers and empanelled with recognized Stock Exchanges and Trading Members.",
            "Sentiment": "positive",
            "PublishDate": 1764939335231,
            "Source": "stock"
        },
        {
            "Title": "CARE Ratings Reports Strong Q2 Results, Declares Rs 8 Interim Dividend and Appoints New Independent Director",
            "Summary": "CARE Ratings Limited announced its quarterly results for the period ended September 30, 2025, alongside several key corporate decisions. The company declared an interim dividend of Rs 8 per equity share of face value Rs 10 for Financial Year 2025-26, with the record date set as November 19, 2025. The Board appointed Dr. Bimal Patel as Additional Director (Non-Executive Independent Director) effective November 12, 2025. Dr. Patel brings over 25 years of experience in international law, national security, and institutional leadership, currently serving as Vice-Chancellor at Rashtriya Raksha University. The company also approved the grant of 5,000 stock options under the CARE Employee Stock Option Scheme 2020. Additionally, CARE Ratings approved the sale of partial stake in its subsidiary CareEdge Global IFSC Limited to State Bank of India and NSE IFSC Limited, selling up to 9.9% stake to each buyer for a total consideration of Rs 5.94 crore. Post-transaction, the company will retain 80.20% in the subsidiary. The consolidated results showed total revenue from operations and net profit figures for the reporting period.",
            "Sentiment": "positive",
            "PublishDate": 1762989818381,
            "Source": "corporate_action"
        },
        {
            "Title": "CARE Ratings Targets Revenue Growth Through Diversified Services and Digital Transformation",
            "Summary": "CARE Ratings has outlined its strategic focus on achieving consistent revenue growth through diversified credit rating and advisory services. The company plans to implement digital transformation initiatives to enhance analytical efficiency. CARE Ratings is expanding its ESG and infrastructure ratings segments. The company has provided guidance for margin expansion and data-analytics-driven growth in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1762963482113,
            "Source": "stock"
        },
        {
            "Title": "Care Ratings Sells Stake in CareEdge Global IFSC to SBI and NSE IFSC for ₹59.4 Million",
            "Summary": "Care Ratings has approved the sale of a partial stake in CareEdge Global IFSC to State Bank of India (SBI) and NSE IFSC for ₹59.4 million. The transaction involves two buyers acquiring portions of Care Ratings' holding in its IFSC subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1762958828068,
            "Source": "order&deals"
        },
        {
            "Title": "Care Ratings Reports Strong Q2 Results with 23% Profit Growth and Declares Interim Dividend",
            "Summary": "Care Ratings reported consolidated net profit of 566.6 million rupees for Q2, representing a 23% increase from 460.8 million rupees in the same quarter last year. Revenue grew to 1.36 billion rupees from 1.17 billion rupees year-over-year. EBITDA increased to 684 million rupees from 557 million rupees, while EBITDA margin improved to 50.16% from 47.48%. The company approved an interim dividend of 8 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1762954962985,
            "Source": "earnings"
        },
        {
            "Title": "CARE Ratings Allots 6,283 Equity Shares and Grants 27,000 Stock Options Under ESOP Scheme",
            "Summary": "CARE Ratings Limited's Nomination and Remuneration Committee approved the allotment of 6,283 equity shares of Rs. 10 face value each to employees following exercise of options under the CARE Employee Stock Option Scheme 2020. The company's paid-up share capital increased from Rs. 30,00,70,800 consisting of 3,00,07,080 equity shares to Rs. 30,01,33,630 consisting of 3,00,13,363 equity shares. The committee also approved granting 27,000 stock options to eligible employees under the same scheme. The stock options will vest in three equal tranches over three years, with one-third vesting after completion of each year from the grant date. The ESOP scheme complies with SEBI regulations for share-based employee benefits.",
            "Sentiment": "neutral",
            "PublishDate": 1762587447191,
            "Source": "corporate_action"
        },
        {
            "Title": "CARE Ratings Seeks Shareholder Approval for Re-appointment of Two Independent Directors",
            "Summary": "CARE Ratings Limited has issued a postal ballot notice seeking shareholder approval for the re-appointment of two Independent Directors for their second terms. Mr. Gurumoorthy Mahalingam (DIN: 09660723) is proposed for re-appointment from November 21, 2025 to November 20, 2028, while Mr. Venkatadri Chandrasekaran (DIN: 03126243) is proposed for re-appointment from December 7, 2025 to December 6, 2028. Both appointments require special resolutions. The e-voting period runs from September 17, 2025 at 9:00 AM to October 16, 2025 at 5:00 PM, with results to be announced by October 20, 2025. Mr. Mahalingam has over four decades of experience across RBI and SEBI, while Mr. Chandrasekaran serves as Chairman and is a qualified Chartered Accountant with over three decades of experience in life insurance finance. The Board approved both re-appointments based on performance evaluations and recommendations from the Nomination and Remuneration Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1758022473998,
            "Source": "corporate_governance"
        },
        {
            "Title": "Care Ratings Management Outlines Growth Strategy Amid Favorable Market Conditions",
            "Summary": "Care Ratings management has announced plans for growth across key business areas and geographical expansion to enhance competitiveness. The growth strategy is supported by strong fundraising activities, healthy bond and commercial paper issuances, and positive economic trends in the market.",
            "Sentiment": "positive",
            "PublishDate": 1754403355111,
            "Source": "stock"
        },
        {
            "Title": "CARE Ratings Reports Strong Q1 Performance with 24% YoY Profit Growth, Reappoints Two Independent Directors",
            "Summary": "CARE Ratings Limited announced its quarterly results for the quarter ended June 30, 2025, showing consolidated net profit of ₹2,649.74 lakhs compared to ₹2,138.29 lakhs in the same quarter last year, representing a 24% year-on-year growth. Consolidated revenue from operations increased to ₹9,390.50 lakhs from ₹7,892.00 lakhs in the previous year quarter. On a standalone basis, the company reported net profit of ₹2,911.55 lakhs versus ₹2,401.16 lakhs in the corresponding quarter of the previous year. The Board approved the reappointment of Mr. G. Mahalingam as Independent Director for three years effective November 21, 2025, and Mr. V. Chandrasekaran as Independent Director for three years effective December 7, 2025, both subject to shareholder approval. The company granted 7,500 stock options to employees and allotted 25,933 equity shares under its ESOS 2020 scheme during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754395158583,
            "Source": "corporate_action"
        },
        {
            "Title": "CARE Ratings Reports Strong Q1 Results with 21% Jump in Net Profit, Board Approves Director Reappointments",
            "Summary": "CARE Ratings Limited reported consolidated net profit of ₹2,649.74 lakhs for the quarter ended June 30, 2025, compared to ₹2,138.29 lakhs in the same period last year. Revenue from operations increased to ₹9,390.50 lakhs from ₹7,892.00 lakhs year-on-year. On standalone basis, net profit rose to ₹2,911.55 lakhs versus ₹2,401.16 lakhs in the previous year quarter. The company's board approved reappointment of two Independent Directors - G. Mahalingam for a three-year term effective November 21, 2025, and V. Chandrasekaran for three years from December 7, 2025, both subject to shareholder approval. The company granted 7,500 stock options to employees and allotted 25,933 equity shares during the quarter. Consolidated earnings per share stood at ₹8.61 compared to ₹6.94 in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1754394471123,
            "Source": "earnings"
        },
        {
            "Title": "Care Ratings: SAT Overturns Sebi Ban on Former MD",
            "Summary": "The Securities Appellate Tribunal (SAT) has quashed Sebi's two-year ban on Rajesh Mokashi, former Care Ratings MD, for alleged credit rating manipulation. SAT criticized Sebi's action as a misadventure, ordering the regulator to pay Mokashi ₹5 lakh for appeal costs.",
            "Sentiment": "positive",
            "PublishDate": 1751416337000,
            "Source": "corporate_governance"
        },
        {
            "Title": "CARE Ratings: Q4 PAT Surges 29%, Stock Soars 15%",
            "Summary": "CARE Ratings reported a 29% YoY increase in Q4 PAT to Rs 44.9 crore. Revenue rose 22% YoY to Rs 91.2 crore. EBITDA grew 31% YoY with a 50% margin. The company announced a final dividend of Rs 11 per share. FY25 PAT increased 24% YoY to Rs 147.9 crore with 19% revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1747133364000,
            "Source": "earnings"
        },
        {
            "Title": "Care Ratings Reports Strong Q4 Results, Announces Dividend",
            "Summary": "Care Ratings has reported a significant increase in its Q4 consolidated net profit, rising to 427 million rupees from 241 million rupees year-over-year and 278 million rupees quarter-over-quarter. The company's Q4 revenue also saw growth, reaching 1.1 billion rupees compared to 901 million rupees in the previous year. Additionally, Care Ratings has recommended a dividend of 11 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747095770000,
            "Source": "default"
        },
        {
            "Title": "CARE Ratings: Q4 Profit Surges 76%, ₹11 Dividend Declared",
            "Summary": "CARE Ratings reported a 76.4% YoY increase in Q4 FY25 net profit to ₹43.4 crore. Revenue rose 21.9% to ₹109.7 crore. EBITDA grew 64.8% to ₹47.7 crore with margins expanding to 43.2%. The company achieved its highest-ever annual income from operations. A final dividend of ₹11 per share was recommended.",
            "Sentiment": "positive",
            "PublishDate": 1747068037000,
            "Source": "earnings"
        },
        {
            "Title": "CARE Ratings Reports Strong Q4 Performance and Dividend Announcement",
            "Summary": "CARE Ratings has announced a dividend of 11 rupees per share. The company's Q4 EBITDA increased to 474 million rupees from 290 million rupees year-over-year. Additionally, the Q4 EBITDA margin improved to 43.21% from 32.20% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747061436000,
            "Source": "result"
        },
        {
            "Title": "CARE Ratings Reports Strong Q4 Financial Results",
            "Summary": "CARE Ratings has announced its Q4 financial results, showing significant year-over-year and quarter-over-quarter growth. The consolidated net profit for Q4 reached 427 million rupees, up from 241 million rupees in the same quarter last year and 278 million rupees in the previous quarter. Revenue also increased to 1.1 billion rupees, compared to 901 million rupees in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1747061319000,
            "Source": "result"
        },
        {
            "Title": "CARE Ratings to Consider Q4 Results on May 12",
            "Summary": "CARE Ratings has announced that it will consider its financial results for the fourth quarter on May 12.",
            "Sentiment": "neutral",
            "PublishDate": 1746196712000,
            "Source": "default"
        },
        {
            "Title": "Care Ratings Reports Q3 Financial Results",
            "Summary": "Care Ratings has announced its financial results for the third quarter. The company's consolidated net profit increased to 278 million rupees, up from 235 million rupees in the same quarter last year. However, it decreased from 461 million rupees in the previous quarter. The company's revenue for Q3 rose to 964 million rupees, compared to 787 million rupees in the corresponding period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738239586000,
            "Source": "earnings"
        },
        {
            "Title": "CARE Ratings to Consider Q3 Results on January 30",
            "Summary": "CARE Ratings has announced that it will consider its third quarter (Q3) financial results on January 30. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737385020000,
            "Source": "earnings"
        },
        {
            "Title": "CARE Ratings: Share Price Hits Six-Year High on Strong Q2 FY25 Results",
            "Summary": "CARE Ratings' stock surged over 18% to a six-year high following strong Q2 FY25 results. The company reported 19% YoY growth in ratings business revenue at Rs 177.63 crore and 37% YoY growth in non-ratings business revenue at Rs 18.66 crore. Consolidated H1 FY25 results show 18% YoY revenue growth, 21% EBITDA growth, and 18% PAT growth.",
            "Sentiment": "positive",
            "PublishDate": 1729750852000,
            "Source": "result"
        },
        {
            "Title": "CARE Ratings Approves 300 Million Rupee Investment in CareEdge Global IFSC",
            "Summary": "CARE Ratings has approved an investment of 300 million rupees (approximately $3.6 million USD) in CareEdge Global IFSC, which is likely a subsidiary or affiliated entity operating in an International Financial Services Centre.",
            "Sentiment": "positive",
            "PublishDate": 1729689312000,
            "Source": "corporate_action"
        },
        {
            "Title": "CARE Ratings Approves Investment in Subsidiaries",
            "Summary": "CARE Ratings has approved further investments in two of its subsidiaries. The company will invest 50 million rupees in CARE Analytics and Advisory. Additionally, an unspecified amount will be invested in CAREEDGE Global IFSC.",
            "Sentiment": "positive",
            "PublishDate": 1729689306000,
            "Source": "corporate_action"
        },
        {
            "Title": "CARE Ratings Announces Interim Dividend of Rs.7 Per Share",
            "Summary": "CARE Ratings has declared and approved the payment of an interim dividend of Rs.7 per equity share to its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1729688607000,
            "Source": "corporate_action"
        },
        {
            "Title": "Care Ratings Reports Improved Q2 Financial Performance",
            "Summary": "Care Ratings has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 419 million rupees to 557 million rupees. Additionally, the EBITDA margin expanded from 43.46% to 47.47% compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1729688560000,
            "Source": "result"
        },
        {
            "Title": "CARE Ratings Reports Strong Q2 Financial Results",
            "Summary": "CARE Ratings has announced its Q2 financial results, showing significant year-over-year and quarter-over-quarter growth. The consolidated net profit for Q2 is 461 million rupees, up from 352 million rupees year-over-year and 207 million rupees quarter-over-quarter. Revenue for Q2 is reported at 1.2 billion rupees, compared to 964 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1729688501000,
            "Source": "result"
        },
        {
            "Title": "CARE Ratings' Subsidiary Obtains South African License",
            "Summary": "A subsidiary of CARE Ratings has been granted a license by the Financial Sector Conduct Authority of South Africa. This license allows the subsidiary to provide credit rating services, including sovereign ratings, in South Africa.",
            "Sentiment": "positive",
            "PublishDate": 1729250892000,
            "Source": "corporate_action"
        }
    ]
}