{
    "Symbol": "CARRARO",
    "ISIN": "INE0V7W01012",
    "News": [
        {
            "Title": "Carraro India Q3 FY26 Results Show Strong Growth",
            "Summary": "Carraro India reported 27% YoY growth in Q3 FY26 total income at INR 5,768 Mn with PAT surging 91% to INR 281 Mn, driven by robust performance across agricultural and construction equipment segments.",
            "Sentiment": "positive",
            "PublishDate": 1770909526527,
            "Source": "co_actions_results"
        },
        {
            "Title": "Carraro India Opens First Service Centre in Faridabad",
            "Summary": "Carraro India Limited inaugurated its first authorised service centre in Faridabad on January 22, 2026, marking the beginning of its plan to establish four regional service centres across India by 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769147421949,
            "Source": "stocks"
        },
        {
            "Title": "Carraro India Gets ₹2.74 Cr Tax Relief, ₹5.26 Cr Refund",
            "Summary": "Carraro India Limited receives favorable Order Giving Effect from Income Tax authorities, granting relief from tax demand of ₹2.74 crores and refund of ₹5.26 crores for Assessment Year 2011-12.",
            "Sentiment": "positive",
            "PublishDate": 1768827477882,
            "Source": "stocks"
        },
        {
            "Title": "Carraro India Reports Strong Q2 Performance with 33% Revenue Growth and Optimistic Full-Year Outlook",
            "Summary": "Carraro India achieved 33% year-on-year revenue growth in Q2 FY26 to INR 586 crores, driven by strong export demand for teleboom handler axles and domestic four-wheel drive axle growth, with management expressing confidence in exceeding EUR 220 million full-year guidance. The company faces temporary margin pressure due to product mix changes but maintains its medium-term margin roadmap while expanding capacity and strengthening its after-sales network.",
            "Sentiment": "positive",
            "PublishDate": 1763551018877,
            "Source": "earnings"
        },
        {
            "Title": "Carraro India Reports Mixed Quarterly Performance with Revenue Growth but Profit Decline",
            "Summary": "Carraro India's standalone revenue from operations increased to ₹5,865.55 million in Q2 FY26 from ₹4,367.35 million in Q1 FY26, while net profit decreased to ₹305.96 million from ₹285.06 million in the previous quarter. The automotive equipment manufacturer's Board approved unaudited financial results for the quarter and half-year ended September 30, 2025, showing consolidated revenue of ₹5,862.55 million with net profit of ₹317.07 million.",
            "Sentiment": "positive",
            "PublishDate": 1763141032343,
            "Source": "earnings"
        },
        {
            "Title": "Carraro India Secures Rs 17.50 Crore Contract for Electric Tractor E-Transaxle Development",
            "Summary": "Carraro India Limited secured an engineering services contract worth Rs 17.50 crore from TI Clean Mobility Private Ltd - Montra Electric for developing E-Transaxles for electric-powered agricultural tractors. The agreement was signed on October 14, 2025, and involves detailed feasibility studies and industrialization of E-Transaxles to be completed by March 2027. Managing Director Dr. Balaji Gopalan described this as a significant milestone positioning Carraro as a key technology supplier for the Indian tractor industry. The contract is domestic in nature and does not involve any related party transactions. Carraro India is an independent Tier-I solution provider for axles, transmission systems, and gears, established in 1997 with two manufacturing plants in Pune.",
            "Sentiment": "positive",
            "PublishDate": 1760440012532,
            "Source": "order&deals"
        },
        {
            "Title": "Carraro India Receives Favorable Closure Report in GST Input Tax Credit Case",
            "Summary": "Carraro India Limited received a closure report from the Assistant Commissioner, CGST Division VII Shirur, concluding proceedings in the company's favor. The closure resolves a matter from a February 2022 notice that alleged a discrepancy of ₹196.60 million in input tax credit between Form GSTR-2A records and the company's Form GSTR-3B filings during April 2021 to December 2021. The company made satisfactory submissions to the GST authorities, resulting in complete relief and favorable conclusion of the proceedings.",
            "Sentiment": "positive",
            "PublishDate": 1760433450246,
            "Source": "stock"
        },
        {
            "Title": "Carraro India Faces Rs 15.25 Crore IGST Demand Over Customs Classification Dispute",
            "Summary": "Carraro India Limited received a Show Cause Notice from the Office of the Commissioner of Customs disputing the classification of imported goods. The customs authority alleges that certain imported goods should be subject to IGST at 28% (under residual entry) instead of the 18% rate (for specified tractor parts) applied by the company. This has resulted in a demand for additional IGST of Rs 15,24,59,511 along with applicable interest and penalties under the Customs Act, 1962. The company received the notice on September 17, 2025, and plans to file its response within 30 days. Carraro India states there is no immediate impact on its financial operations or other activities, and believes it will receive favorable relief from the customs authority based on legal advice and past precedents on similar issues.",
            "Sentiment": "negative",
            "PublishDate": 1758181832543,
            "Source": "stock"
        },
        {
            "Title": "Motilal Oswal Nearly Exits Carraro India Through Block Deal",
            "Summary": "Motilal Oswal Mutual Fund sold 10 lakh shares of Carraro India at ₹449 per share through block deals, with Bajaj Allianz Life Insurance Company as the buyer. The fund held a 1.85% stake or 10.52 lakh shares at the end of the June quarter through its Small Cap Fund. Carraro India debuted in December at an IPO price of ₹704 but listed at a discount. The stock closed at ₹446.05, down 1.77% for the day and remains 37% below its IPO price. Mutual funds collectively hold 12.66% stake in the auto components manufacturer, with other investors including HSBC Smallcap Fund (2.79%), LIC Manufacturing Fund (2.15%), and Edelweiss Smallcap Fund (1.68%).",
            "Sentiment": "negative",
            "PublishDate": 1758074146883,
            "Source": "order&deals"
        },
        {
            "Title": "Carraro India Reports Mixed Q3 Results with 26% EBITDA Growth in Nine Months Despite Export Weakness",
            "Summary": "Carraro India Limited reported financial results for the quarter and nine months ended December 31, 2024. For the nine-month period, total income declined 3% to INR 13,755 million, while EBITDA grew 26% to INR 1,375 million with margins expanding to 10%. PAT increased 45% to INR 645 million with margins at 4.7%. However, Q3 performance was weaker with EBITDA declining 15% to INR 365 million and PAT dropping 24% to INR 148 million compared to the same quarter last year. The company faced challenges from weak export demand, particularly in agriculture, while domestic business remained strong with 10% growth. Agricultural equipment revenue grew 3% in Q3, construction equipment rose 10%, while others segment declined 18%. The company added two new customers in soil compactor and backhoe loader segments, began working with electric tractor OEMs, and launched engineering services business. Total capex for nine months was INR 419 million. Management expects continued domestic growth but anticipates export recovery will take longer.",
            "Sentiment": "neutral",
            "PublishDate": 1757130805854,
            "Source": "earnings"
        },
        {
            "Title": "Carraro India Reports 4% Revenue Growth to INR 4,929 Million in Q1 FY26, Maintains 11% EBITDA Margin",
            "Summary": "Carraro India Limited reported revenue from operations of INR 4,929 million in Q1 FY26, representing a 4% year-on-year growth. The company maintained its EBITDA margin at 11% with EBITDA of INR 548 million and profit after tax of INR 291 million. Domestic volumes grew 3% while exports increased 5% year-on-year. The four-wheel drive axle segment showed strong demand, with the company producing a record 4,000 units in May 2025. Carraro secured a new teleboom handler axle project for the domestic market and completed a prototype for high horsepower transmission for an export customer. The company signed a commercial agreement to design electric tractor transmission and reiterated its FY26 revenue growth guidance of 8-12%. Management targets 100 basis points EBITDA margin improvement annually for the next 2-3 years. The company maintains a 60-65% market share in the non-captive four-wheel drive segment and aims to achieve EUR 350 million revenue by FY28-29.",
            "Sentiment": "positive",
            "PublishDate": 1754891371711,
            "Source": "earnings"
        },
        {
            "Title": "Carraro India Sets Record Date for Rs. 4.55 Final Dividend Payment",
            "Summary": "Carraro India Limited's Board of Directors has fixed September 3, 2025 as the record date for determining shareholder eligibility for a proposed final dividend of Rs. 4.55 per equity share with face value of Rs. 10 each (45.50%) for the financial year ended March 31, 2025. The dividend payment is subject to approval at the company's 28th Annual General Meeting scheduled for September 11, 2025. Shareholders whose names appear in the register of members or beneficial owners maintained by depositories will be entitled to receive the dividend if approved.",
            "Sentiment": "positive",
            "PublishDate": 1754407313229,
            "Source": "corporate_action"
        },
        {
            "Title": "Carraro India Plans ₹300+ Crore Capex for EV and Compact Tractor Axle Expansion",
            "Summary": "Carraro India is accelerating growth through new EV and compact tractor axle platforms, supported by a capital expenditure of over ₹300 crores and a localization drive. The company is targeting stronger exports and off-highway momentum for FY26-27, while focusing on operational efficiency improvements.",
            "Sentiment": "positive",
            "PublishDate": 1754405378362,
            "Source": "stock"
        },
        {
            "Title": "Carraro India Reports Q1 2025 Results, Announces 28th AGM and Rs. 4.55 Final Dividend",
            "Summary": "Carraro India Limited approved its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs. 4,891.84 million compared to Rs. 4,406.07 million in the previous quarter, with profit after tax of Rs. 285.06 million versus Rs. 273.67 million. On a consolidated basis, revenue stood at Rs. 4,929.26 million with profit after tax of Rs. 291.20 million. The Board scheduled the 28th Annual General Meeting for September 11, 2025, and fixed September 3, 2025 as the record date for determining shareholder eligibility for the proposed final dividend of Rs. 4.55 per equity share (45.50%) for financial year 2024-25. The Board also approved the re-appointment of Mr. Tomaso Carraro and Mr. Enrico Gomiero as Non-executive, Non-Independent Directors, subject to shareholder approval at the AGM.",
            "Sentiment": "positive",
            "PublishDate": 1754395178719,
            "Source": "earnings"
        },
        {
            "Title": "Carraro India Schedules Q1 Results Review and Conference Call",
            "Summary": "Carraro India has announced that it will review its Q1 results on August 5. The company will also hold a conference call on August 6 at 8:30 AM to discuss the results.",
            "Sentiment": "neutral",
            "PublishDate": 1752644177000,
            "Source": "default"
        },
        {
            "Title": "Carraro India: Shareholder Lock-in Ends, ₹1,234 Crore Shares Eligible for Trade",
            "Summary": "Carraro India's six-month shareholder lock-in period ends on June 26, freeing up 28 million shares (49% of outstanding equity) worth ₹1,234 crore for potential trading. The company aims for 8-10% growth in FY2026 and targets ₹3,100 crore revenue by 2030. Stock closed at ₹441, down 40% from IPO price.",
            "Sentiment": "neutral",
            "PublishDate": 1750899933000,
            "Source": "corporate_action"
        },
        {
            "Title": "Carraro India Reports Q4 Results and Declares Final Dividend",
            "Summary": "Carraro India has announced its Q4 financial results and declared a final dividend. The company's Q4 EBITDA increased to 453 million rupees from 379 million rupees year-over-year, with the EBITDA margin improving to 10.20% from 9.64%. Net profit for Q4 rose to 237 million rupees, up from 182 million rupees year-over-year and 147 million rupees quarter-on-quarter. Q4 revenue reached 4.4 billion rupees, compared to 3.9 billion rupees in the same quarter last year. Additionally, the company declared a final dividend of 4.55 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748346502000,
            "Source": "result"
        },
        {
            "Title": "Carraro India Announces Favorable Closure of Audit Observation",
            "Summary": "Carraro India has reported that an audit observation has been closed in the company's favor. This suggests a positive resolution to a previously identified issue or concern during an audit process.",
            "Sentiment": "positive",
            "PublishDate": 1744848345000,
            "Source": "default"
        },
        {
            "Title": "Carraro India Announces Favorable Closure of Audit Observation",
            "Summary": "Carraro India has reported that an audit observation has been closed in the company's favor. This suggests a positive resolution to a previously identified issue or concern during an audit process.",
            "Sentiment": "positive",
            "PublishDate": 1744816285000,
            "Source": "default"
        },
        {
            "Title": "Carraro India Receives Draft Assessment Order from Income Tax Department",
            "Summary": "Carraro India has received a Draft Assessment Order from the Faceless Assessment Unit of the Income-tax Department. This order follows an Initial Show Cause Notice (SCN) and a subsequent SCN that were previously issued to the company.",
            "Sentiment": "neutral",
            "PublishDate": 1741739407000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Carraro India Receives Draft Assessment Order from Income Tax Department",
            "Summary": "Carraro India has received a draft assessment order from the Faceless Assessment Unit of the Income-Tax Department. This order follows an initial Show Cause Notice (SCN) and a subsequent SCN that were previously issued to the company.",
            "Sentiment": "neutral",
            "PublishDate": 1741704318000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Carraro India: Profit Decline Amidst Expansion Efforts",
            "Summary": "Carraro India reported a 24% YoY drop in Q3 net profit to ₹14.7 crore, with revenue growing 3% to ₹448.7 crore. The company is expanding into engineering services for electric tractors and the teleboom handler market. It aims to improve EBITDA margin to 15% in three years through product mix enhancement and increased gear volumes.",
            "Sentiment": "neutral",
            "PublishDate": 1740616360000,
            "Source": "earnings"
        },
        {
            "Title": "Carraro India Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Carraro India has reported a decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q3 fell to 324 million rupees from 380 million rupees in the same period last year. Additionally, the EBITDA margin declined to 7.2% from 8.74% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738846084000,
            "Source": "earnings"
        },
        {
            "Title": "Carraro India Reports Q3 Financial Results",
            "Summary": "Carraro India has released its Q3 financial results. The company reported a consolidated net profit of 147 million rupees, down from 194 million rupees in the same quarter last year. However, revenue increased to 4.49 billion rupees from 4.35 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738846080000,
            "Source": "earnings"
        },
        {
            "Title": "Carraro India Ltd.: Shares Close Lower on Listing Day",
            "Summary": "Carraro India Ltd. shares ended 2.07% below the listing price on NSE and 3.50% lower on BSE. The stock debuted at a discount of 7.53% on NSE and 6.25% on BSE compared to the IPO price of Rs 704. The IPO was subscribed 1.12 times, with strong demand from institutional buyers.",
            "Sentiment": "negative",
            "PublishDate": 1735556507000,
            "Source": "normal_news"
        }
    ]
}