{
    "Symbol": "CARTRADE",
    "ISIN": "INE290S01011",
    "News": [
        {
            "Title": "CarTrade Tech seeks shareholder approval for CFO pay hike",
            "Summary": "CarTrade Tech Limited has issued a postal ballot notice seeking shareholder approval for increasing the remuneration of Executive Director and CFO Mrs. Aneesha Bhandary through remote e-voting from February 02 to March 03, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769798984181,
            "Source": "stocks"
        },
        {
            "Title": "Tata Mutual Fund Increases Stake in CarTrade Tech",
            "Summary": "Tata Mutual Fund and associated schemes acquired 90,522 shares in CarTrade Tech Limited, increasing their collective holding from 4.83% to 5.02% through secondary market purchases.",
            "Sentiment": "positive",
            "PublishDate": 1769748614162,
            "Source": "co_actions_results"
        },
        {
            "Title": "CarTrade Tech Expresses Confidence in Performance",
            "Summary": "CarTrade Tech shows optimism about current and upcoming quarters with expectations of better performance. The company anticipates increased revenue growth rate for OLX along with projected margin improvements.",
            "Sentiment": "positive",
            "PublishDate": 1769660227354,
            "Source": "stocks"
        },
        {
            "Title": "CarTrade Tech Board Meet Set for Jan 28 Q3FY26 Results",
            "Summary": "CarTrade Tech Limited has scheduled a board meeting on January 28, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window remains closed until January 30, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769063249726,
            "Source": "co_actions_results"
        },
        {
            "Title": "CarTrade Tech Gets ESG Rating of 67.4 for FY25",
            "Summary": "CarTrade Tech Limited receives an ESG rating of 67.4 for FY25 from SES ESG Research, an independent assessment based on publicly available information without company engagement.",
            "Sentiment": "neutral",
            "PublishDate": 1768302953123,
            "Source": "stocks"
        },
        {
            "Title": "CarTrade Tech Launches 'Super Series' To Streamline Used Car Dealerships",
            "Summary": "CarTrade Tech officially launched Super Series initiative on Tuesday, integrating OLX India and CarWale to provide unified solutions for used car dealers across India's largest automotive marketplace.",
            "Sentiment": "positive",
            "PublishDate": 1767684638206,
            "Source": "stocks"
        },
        {
            "Title": "CarTrade Tech shares 3-year growth story with investors",
            "Summary": "CarTrade Tech Limited disclosed its three-year growth journey to investors under regulatory compliance, highlighting performance achievements and outlining AI-led innovation focus for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1767167698538,
            "Source": "stocks"
        },
        {
            "Title": "CarTrade Tech Allots 49,175 ESOP Shares",
            "Summary": "CarTrade Tech Limited allotted 49,175 equity shares under three ESOP schemes on December 11, 2025, increasing paid-up share capital to ₹47.84 crores with 4,78,42,935 total equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1765445387647,
            "Source": "co_actions_results"
        },
        {
            "Title": "CarTrade Tech Receives GST Demand Notice of ₹14.82 Crores for Alleged Ineligible Input Tax Credit",
            "Summary": "CarTrade Tech Limited received a show cause cum demand notice from the Directorate General of Goods and Services Tax Intelligence, Mumbai, proposing a demand of ₹14,81,88,070 along with interest and penalties for alleged ineligible input tax credit on offer for sale expenses. The company maintains the demand is not sustainable as the tax amount has already been paid through invoices raised on selling shareholders, and expects to receive necessary relief from authorities without any financial or operational impact on its business.",
            "Sentiment": "negative",
            "PublishDate": 1765277383741,
            "Source": "stock"
        },
        {
            "Title": "CarTrade Tech Abandons Merger Talks with Girnar Software",
            "Summary": "CarTrade Tech Limited and Girnar Software Private Limited have mutually decided not to proceed with their proposed consolidation of automotive classifieds businesses (CarDekho and BikeWale) in India. The company will focus on strengthening its existing portfolio including CarWale, BikeWale, OLX India, and Shriram Automall while continuing to evaluate strategic opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1764213281571,
            "Source": "order&deals"
        },
        {
            "Title": "Cartrade Tech in Merger Talks with Girnar Software for Cardekho and Bikekho Businesses",
            "Summary": "Cartrade Tech is engaged in discussions with Girnar Software regarding a potential merger of their automotive businesses, specifically Cardekho and Bikekho. The talks involve combining these automotive platforms between the two companies.",
            "Sentiment": "neutral",
            "PublishDate": 1762918066873,
            "Source": "order&deals"
        },
        {
            "Title": "CarTrade Tech to Acquire CarDekho in $1.2 Billion-Plus Deal",
            "Summary": "CarTrade Tech is set to acquire CarDekho (Girnar Software Pvt. Ltd.) in a cash-and-stock transaction valued at over $1.2 billion. The deal is in advanced stages with due diligence underway and an announcement expected soon. CarTrade reported strong quarterly results with revenue rising 29% to ₹222.14 crore and profit after tax surging 109% to ₹64.08 crore. The company maintains a debt-free status with ₹1,080 crore in cash. CarDekho's parent company reported ₹2,644 crore in operating income and achieved profitability at EBITDA and PAT levels. The merger would combine CarTrade's strengths in dealer auctions and B2B remarketing with CarDekho's consumer listings and digital retail capabilities, potentially creating one of India's largest auto-tech deals and reshaping competition in the digital automobile marketplace.",
            "Sentiment": "positive",
            "PublishDate": 1762777250893,
            "Source": "order&deals"
        },
        {
            "Title": "CarTrade Tech Reports 109% Profit Surge in Q2FY26 with Record Revenue of INR 222 Crores",
            "Summary": "CarTrade Tech delivered its best-ever quarterly performance with profits surging 109% to INR 64 crores and revenue growing 29% to INR 222 crores. The consumer group achieved 37% revenue growth with 82% profit increase, while OLX India recorded its highest-ever revenue with 17% growth and 213% profit jump. EBITDA margins expanded significantly across all verticals, with the consumer group reaching 40% margins and OLX achieving 30% margins. The company maintained strong cost discipline with only 8% cost escalation despite 28% revenue growth, demonstrating operational leverage. All three platforms - CarWale, BikeWale, and OLX - crossed 85 million monthly active users with 95% organic traffic. The company holds cash reserves of INR 1,080 crores and continues expanding its physical presence with over 400 abSure and OLX outlets.",
            "Sentiment": "positive",
            "PublishDate": 1762270900226,
            "Source": "earnings"
        },
        {
            "Title": "CarTrade Tech Expects Growth to Exceed 17% in Upcoming Quarters",
            "Summary": "CarTrade Tech expressed optimism about achieving growth rates beyond 17% in future quarters. The company anticipates strong performance in its Consumer Group Business, particularly during the October to March period.",
            "Sentiment": "positive",
            "PublishDate": 1761708590113,
            "Source": "stock"
        },
        {
            "Title": "CarTrade Tech Completes Q2 FY26 Earnings Conference Call with Analysts and Investors",
            "Summary": "CarTrade Tech Limited concluded its earnings conference call on October 28, 2025, with analysts, institutional investors, and funds to discuss the company's unaudited financial results for the second quarter and half year ended September 30, 2025. The call covered both standalone and consolidated financial results. The company made available an investor presentation and audio recording of the conference call on its website for stakeholder access.",
            "Sentiment": "neutral",
            "PublishDate": 1761658623727,
            "Source": "stock"
        },
        {
            "Title": "CarTrade Tech Appoints Varun Sanghi as Chief Strategy Officer",
            "Summary": "CarTrade Tech has appointed Varun Sanghi as Chief Strategy Officer, effective November 1, 2025. The appointment was recommended by the company's Nomination and Remuneration Committee. Sanghi brings over ten years of experience with CarTrade Tech to his new role.",
            "Sentiment": "positive",
            "PublishDate": 1761632764086,
            "Source": "corporate_governance"
        },
        {
            "Title": "CarTrade Tech Reports Record Q2 Performance with Revenue Up 25% to 1.93B Rupees",
            "Summary": "CarTrade Tech reported quarterly revenue of 1.93 billion rupees, up from 1.54 billion rupees year-over-year. EBITDA increased to 636 million rupees from 327 million rupees, with EBITDA margin improving to 32.88% from 21.2%. Consolidated net profit rose to 600 million rupees compared to 278 million rupees in the same period last year. The company achieved its highest-ever revenue and profits across all three business verticals.",
            "Sentiment": "positive",
            "PublishDate": 1761630747051,
            "Source": "earnings"
        },
        {
            "Title": "Cartrade Tech Achieves Record 57 Million Monthly Users on Carwale and BikeWale",
            "Summary": "Cartrade Tech has reached a record traffic high of 57 million monthly users across its Carwale and BikeWale platforms. This represents a significant milestone in user engagement for the company's automotive marketplace platforms.",
            "Sentiment": "positive",
            "PublishDate": 1760511760887,
            "Source": "stock"
        },
        {
            "Title": "Goldman Sachs Asset Management International Reduces CarTrade Tech Stake to 4.65%, Ceases to be Substantial Shareholder",
            "Summary": "Goldman Sachs Asset Management International has reduced its shareholding in CarTrade Tech Limited to 2,207,989 shares, representing 4.650% of the company's share capital. The reduction occurred through the sale of 1,187,622 equity shares (2.501%) via block trade on the National Stock Exchange on October 10, 2025. Prior to the sale, Goldman Sachs along with its persons acting in concert held 3,395,611 equity shares (7.193%). Following this transaction, Goldman Sachs has ceased to be a substantial shareholder of CarTrade Tech. The company's total equity share capital stands at 47,479,035 shares valued at Rs. 474,790,350.",
            "Sentiment": "neutral",
            "PublishDate": 1760442881302,
            "Source": "corporate_action"
        },
        {
            "Title": "CarTrade Tech Reports 66% Traffic Surge on CarWale and BikeWale Platforms",
            "Summary": "CarTrade Tech experienced a 66% increase in traffic on its consumer platforms CarWale and BikeWale. The company attributes this growth to the festive season and GST-related factors.",
            "Sentiment": "positive",
            "PublishDate": 1759737188107,
            "Source": "stock"
        },
        {
            "Title": "CarTrade Tech Reports 74% Traffic Surge on CarWale and BikeWale Platforms During Navratri",
            "Summary": "CarTrade Tech Limited announced that its CarWale and BikeWale platforms achieved their highest ever single-day traffic, with a 74% increase compared to the first day of Navratri last year and a 60% rise over the August 2025 daily average. The company attributes this traffic surge to festive season demand and a recent GST rate cut that has improved affordability and consumer sentiment in the automobile sector. CEO Banwari Lal Sharma described it as a landmark day, highlighting the trust millions of Indians place in their platforms for vehicle research and purchases.",
            "Sentiment": "positive",
            "PublishDate": 1758610628810,
            "Source": "stock"
        },
        {
            "Title": "Cartrade Tech Shares Plunge 15% Following JM Financial Downgrade to 'Sell'",
            "Summary": "Cartrade Tech shares fell 16% on Wednesday, marking their biggest single-day drop on record and ending a three-day gaining streak. JM Financial downgraded the online used car marketplace to 'sell' from 'hold' while raising the price target to ₹2,350 from ₹1,900, implying a 14% downside from Tuesday's close. The brokerage cited the company's high EBITDA multiple of 43 times for financial year 2027 as 'too rich' for a business generating all revenue from B2B clients. JM Financial noted risks from the cyclical nature of B2B spending and potential threats from generative AI tools affecting Google Search usage. Despite this, Cartrade reported a 25% surge in consumer traffic on CarWale and BikeWale platforms following GST rate reductions on automobiles. The stock closed 12.6% lower at ₹2,391.5, having previously surged 8x from its March 2023 low to September 9 high. Analyst coverage shows four 'buy' ratings, one 'hold', and three 'sell' ratings among eight analysts covering the stock.",
            "Sentiment": "negative",
            "PublishDate": 1757481787214,
            "Source": "stock"
        },
        {
            "Title": "CarTrade Tech Reports 25% Traffic Surge Following GST Reduction on Vehicles",
            "Summary": "CarTrade Tech Limited announced that the government's GST reduction on passenger vehicles, two-wheelers, and used vehicles is expected to enhance affordability and accelerate transaction volumes. The company's platforms CarWale and BikeWale experienced over 25% surge in consumer traffic following the GST reduction. The company identified three key growth drivers: increased dealer and OEM participation leading to higher new vehicle volumes, festive season demand, and GST-led affordability gains boosting transaction volumes across new and used products. CEO Banwari Lal Sharma stated the GST reduction is a game-changer that reduces ownership costs for consumers and increases velocity for dealers, creating a new wave of demand ahead of the festive season.",
            "Sentiment": "positive",
            "PublishDate": 1757478903065,
            "Source": "stock"
        },
        {
            "Title": "CarTrade Tech Reports Record Revenues From OLX India, Expects Strong Quarter",
            "Summary": "CarTrade Tech has reported record revenues from its OLX India operations and anticipates achieving its best quarter performance to date.",
            "Sentiment": "positive",
            "PublishDate": 1756800384082,
            "Source": "stock"
        },
        {
            "Title": "CarTrade Tech Reports Record Q1FY26 Results with 106% Profit Growth",
            "Summary": "CarTrade Tech delivered its highest ever quarterly performance with revenue reaching INR199 crores and profit after tax surging 106% to INR47 crores. The consumer group business grew 32% with 79% profit growth, achieving 29% EBITDA margin. The remarketing business gained momentum with 36% revenue growth leading to 258% profit increase. OLX achieved highest ever revenues with 71% profit surge. Consolidated EBITDA margins improved to 25% from 15% year-on-year. The company maintains strong cash position of INR1,024 crores, up INR70 crores from previous quarter. Management expressed optimism about future prospects, citing 75 million monthly users across platforms with 95% organic traffic. Employee costs increased 7% primarily due to annual increments factored in the first quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754311229909,
            "Source": "earnings"
        },
        {
            "Title": "CarTrade Tech Reports Mixed Q1 Results: EBITDA Surges 98% Despite Decline in Auction Activity",
            "Summary": "CarTrade Tech experienced a significant decline in auction business activity, with auction listings dropping to 346,406 from 400,312 quarter-over-quarter, and auction volumes falling to 55,701 from 72,990 in the same period. However, the company's financial performance showed strong improvement with EBITDA rising to 435 million rupees compared to 219 million rupees year-over-year. The EBITDA margin expanded substantially to 25.6% from 15.6% year-over-year, indicating improved operational efficiency despite lower auction activity.",
            "Sentiment": "neutral",
            "PublishDate": 1753679587055,
            "Source": "stock"
        },
        {
            "Title": "CarTrade Tech Reports 92% Jump in Quarterly Net Profit to 429 Million Rupees",
            "Summary": "CarTrade Tech reported quarterly consolidated net profit of 429 million rupees compared to 223 million rupees in the same period last year, representing a 92% increase. The company's revenue grew to 1.7 billion rupees from 1.4 billion rupees year-over-year, marking a 21% increase.",
            "Sentiment": "positive",
            "PublishDate": 1753679205949,
            "Source": "earnings"
        },
        {
            "Title": "Cartrade Tech Launches Cartrade Labs for Innovation",
            "Summary": "Cartrade Tech has announced the launch of Cartrade Labs, a new initiative aimed at driving innovation and shaping the future of technology in the automotive industry. The company expects Cartrade Labs to play a significant role in advancing technological developments within their sector.",
            "Sentiment": "positive",
            "PublishDate": 1750810081000,
            "Source": "default"
        },
        {
            "Title": "CarTrade Tech Launches CarTrade Labs for Innovation",
            "Summary": "CarTrade Tech has announced the launch of CarTrade Labs, an initiative aimed at fostering innovation and influencing future technology in the automotive sector. The company is leveraging its position in the auto-tech industry to drive technological advancements.",
            "Sentiment": "positive",
            "PublishDate": 1750778565000,
            "Source": "default"
        },
        {
            "Title": "CarTrade Tech: Q4 Results Show Growth, But Stock Dips on Visitor Decline",
            "Summary": "CarTrade Tech reported Q4 net profit up 86% YoY to ₹41.8 crore, revenue up 17% to ₹169.5 crore. EBITDA grew 68% YoY with margins expanding to 27%. Full-year revenue hit ₹711 crore, net profit up 6x. However, stock fell 8% from day's high due to decline in monthly average unique visitors to 74 million.",
            "Sentiment": "neutral",
            "PublishDate": 1746602166000,
            "Source": "earnings"
        },
        {
            "Title": "CarTrade Tech Reports Strong Q4 Financial Results",
            "Summary": "CarTrade Tech announced its Q4 financial results, showing significant year-over-year improvements. Revenue increased to 1.69 billion rupees from 1.45 billion rupees. EBITDA rose to 462 million rupees from 273 million rupees, with EBITDA margin expanding to 27.23% from 18.8%. Consolidated net profit grew to 418 million rupees from 234 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1746600776000,
            "Source": "result"
        },
        {
            "Title": "CarTrade Tech: Shares Surge 150% in 11 Months, Strong Q3 Performance",
            "Summary": "CarTrade Tech's stock has risen 150% since March 2024 and 305% since March 2023. The company reported its strongest financial performance in Q3, with total revenue at ₹176 crore and adjusted EBITDA margin of 30.3%. New Auto segment saw 38% YoY revenue increase, while Remarketing business had 27% revenue growth. Net profit jumped 92% to ₹45.33 crore.",
            "Sentiment": "positive",
            "PublishDate": 1739431233000,
            "Source": "earnings"
        },
        {
            "Title": "CarTrade Tech: Shares Hit Record High as Citi Raises Target Price",
            "Summary": "CarTrade Tech shares rose nearly 15% to a new life high after Citi Research increased its target price to Rs 1,820 from Rs 1,232. The company's Q3 results showed strong performance across all business segments, with standalone revenue up 38% YoY, remarketing revenue up 27% YoY, and OLX business growing 15% YoY. Citi raised its Ebitda estimates and reiterated a 'buy' rating.",
            "Sentiment": "positive",
            "PublishDate": 1738217669000,
            "Source": "normal_news"
        },
        {
            "Title": "CarTrade Tech Reports Q3 Revenue Growth",
            "Summary": "CarTrade Tech, an Indian automotive platform, has reported a significant increase in its third-quarter revenue. The company's revenue for Q3 stood at 1.76 billion rupees, compared to 1.4 billion rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738131323000,
            "Source": "earnings"
        },
        {
            "Title": "CarTrade Tech Reports Significant EBITDA Growth in Q3",
            "Summary": "CarTrade Tech has announced its Q3 financial results, showing a substantial increase in EBITDA. The company's EBITDA rose to 501 million rupees, up from 254 million rupees in the same quarter of the previous year. Additionally, CarTrade Tech's EBITDA margin improved to 28.42% from 18.29% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738131319000,
            "Source": "earnings"
        },
        {
            "Title": "CarTrade Tech Reports Significant Increase in Q3 Net Profit",
            "Summary": "CarTrade Tech has announced its financial results for the third quarter, reporting a consolidated net profit from continuing operations of 455 million rupees. This represents a substantial increase from the 220 million rupees reported in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738131283000,
            "Source": "earnings"
        },
        {
            "Title": "CarTrade Tech's Platforms Achieve Milestone of 150 Million Yearly Unique Users",
            "Summary": "CarTrade Tech has announced that three of its platforms - CarWale, BikeWale, and OLX India - have each surpassed 150 million yearly unique users. This milestone indicates significant growth and user engagement across the company's automotive digital platforms.",
            "Sentiment": "positive",
            "PublishDate": 1733288518000,
            "Source": "corporate_action"
        },
        {
            "Title": "CarTrade Tech Reports Strong Q3 Revenue Growth",
            "Summary": "CarTrade Tech, a consumer-focused company, anticipates reporting a significant 30% year-over-year revenue growth for the third quarter. This projection indicates robust performance and positive financial trends for the company.",
            "Sentiment": "positive",
            "PublishDate": 1730777828000,
            "Source": "result"
        },
        {
            "Title": "CarTrade Tech Reports Strong Festive Season Performance",
            "Summary": "CarTrade Tech has announced strong performance during the festive season in October 2024. The company is celebrating its success, indicating positive results during this period.",
            "Sentiment": "positive",
            "PublishDate": 1730777785000,
            "Source": "normal_news"
        },
        {
            "Title": "CarTrade Tech Reports Significant Profit Growth in Q2",
            "Summary": "CarTrade Tech has reported a substantial increase in its Q2 consolidated net profit, rising to 278 million rupees from 30 million rupees year-over-year. The company's revenue also saw growth, reaching 1.54 billion rupees compared to 1.2 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730097682000,
            "Source": "result"
        }
    ]
}