{
    "Symbol": "CARYSIL",
    "ISIN": "INE482D01024",
    "News": [
        {
            "Title": "Carysil Submits Q3FY26 QIP Fund Monitoring Report",
            "Summary": "Carysil Limited submitted its Q3FY26 monitoring agency report for QIP fund utilization. ICRA Limited reported no material deviation from issue objects with ₹82.52 crore utilized out of ₹121.65 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1770197298627,
            "Source": "stocks"
        },
        {
            "Title": "Carysil Q3 Net Profit Surges 68% to ₹210 Million",
            "Summary": "Carysil reported consolidated net profit of ₹210 million in Q3 compared to ₹125 million in the same quarter last year, marking a significant 68% year-on-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1770195465561,
            "Source": "co_actions_results"
        },
        {
            "Title": "Carysil Board Meeting Set for February 4, 2026",
            "Summary": "Carysil Limited has scheduled a board meeting on February 4, 2026, to approve Q3FY26 financial results. Trading window remains closed until February 7, 2026, following regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1768891860947,
            "Source": "co_actions_results"
        },
        {
            "Title": "Carysil Limited Appoints Go India Advisors LLP as Investor Relations Advisory Agency",
            "Summary": "Carysil Limited has appointed M/s Go India Advisors LLP, based in Mumbai's Bandra Kurla Complex, as its new Investor Relations Advisory Agency. The company has informed BSE and NSE about this appointment to enhance its investor communication and advisory services.",
            "Sentiment": "positive",
            "PublishDate": 1765190589679,
            "Source": "stock"
        },
        {
            "Title": "Carysil Employee Marcus John Smyth Sells 27,000 Equity Shares",
            "Summary": "Marcus John Smyth, CEO of Carysil UK Limited and employee of Carysil Limited's group company, sold 27,000 equity shares in two transactions on November 14 and November 17, 2025, for a total value of Rs. 2.75 crore. The transactions were disclosed under SEBI insider trading regulations, with shares sold at average prices of Rs. 1,032.03 and Rs. 1,020.31 per share respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1763460418871,
            "Source": "corporate_action"
        },
        {
            "Title": "Carysil Reports Strong Q2 FY26 Performance Despite US Tariff Challenges",
            "Summary": "Carysil Limited achieved consolidated revenue of INR 244 crores in Q2 FY26, marking 17.9% Y-o-Y growth, with EBITDA rising 33.5% to INR 49.5 crores and PAT surging 61.9% to INR 27.2 crores despite facing 50% US tariffs. The company secured 70% of IKEA's global non-US quartz sink business, expanded quartz sink capacity by 100,000 units, and maintained strong partnerships with major retailers like Lowes while planning significant capacity expansions across all product segments.",
            "Sentiment": "positive",
            "PublishDate": 1763451854603,
            "Source": "earnings"
        },
        {
            "Title": "Carysil Limited Reports Quarterly Financial Results for Quarter and Half-Year Ended September 30, 2025",
            "Summary": "Carysil Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025. The company operates in the Kitchen Bath Products segment. For the quarter ended September 30, 2025, standalone revenue from operations was Rs. 114.0 crores compared to Rs. 105.5 crores in the previous quarter. Profit after tax for the quarter was Rs. 27.7 crores versus Rs. 26.0 crores in the prior quarter. For the half-year period, standalone revenue reached Rs. 225.6 crores compared to Rs. 205.9 crores in the previous year. Half-year profit after tax stood at Rs. 53.7 crores against Rs. 50.9 crores in the corresponding previous period. The company's trading window for designated persons will open on November 13, 2025. The results include consolidated figures from 13 subsidiary companies across various international markets including the USA, Turkey, UK, UAE, and Germany.",
            "Sentiment": "positive",
            "PublishDate": 1762806079567,
            "Source": "earnings"
        },
        {
            "Title": "Carysil Limited Reports No Material Deviation in QIP Fund Utilization for Q2 FY2026",
            "Summary": "Carysil Limited submitted its monitoring agency report for Q2 FY2026 regarding the utilization of funds raised through its Qualified Institutions Placement (QIP). ICRA Limited, the appointed monitoring agency, reported no material deviation from the stated objectives of the issue. The QIP raised Rs. 125 crore with net proceeds of Rs. 121.65 crore after issue-related expenses. Out of the total proceeds, Rs. 76.94 crore has been utilized, leaving Rs. 44.71 crore unutilized. The funds were allocated for capital expenditure towards machinery and equipment (Rs. 62.50 crore), working capital requirements (Rs. 31.25 crore), and general corporate purposes (Rs. 27.90 crore). The unutilized amount of Rs. 44.71 crore is deployed in fixed deposits with HDFC Bank earning interest rates between 6.25% to 6.60%. For capital expenditure, Rs. 17.79 crore has been utilized with Rs. 44.71 crore remaining, while funds for working capital and general corporate purposes have been fully utilized.",
            "Sentiment": "neutral",
            "PublishDate": 1762769024458,
            "Source": "corporate_action"
        },
        {
            "Title": "CARYSIL Reports Strong Q2 Performance with Revenue Rising to 2.4B Rupees",
            "Summary": "CARYSIL delivered robust quarterly results with revenue increasing to 2.4 billion rupees from 2.1 billion rupees year-over-year. The company's EBITDA grew to 461 million rupees compared to 372 million rupees in the same period last year, while EBITDA margin improved to 19.2% from 17.97%. Consolidated net profit showed significant growth, reaching 272 million rupees versus 168 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762764166414,
            "Source": "earnings"
        },
        {
            "Title": "Carysil Board Approves 10% Expansion in Quartz Kitchen Sink Manufacturing Capacity",
            "Summary": "Carysil's board has approved an expansion of its quartz kitchen sink manufacturing capacity by 100,000 units per annum, representing a 10% increase in production capacity.",
            "Sentiment": "positive",
            "PublishDate": 1759816386874,
            "Source": "stock"
        },
        {
            "Title": "US Imposes 50% Tariff on Kitchen Cabinets and Bathroom Vanities",
            "Summary": "The United States has implemented a 50% tariff on kitchen cabinets, bathroom vanities, and related products. This tariff policy affects companies in this sector, including Carysil and Stovecraft.",
            "Sentiment": "negative",
            "PublishDate": 1758857466600,
            "Source": "stock"
        },
        {
            "Title": "Carysil Rules Out Fresh QIP for Kitchen Appliances Expansion",
            "Summary": "Carysil has clarified that it will not raise fresh funds through a Qualified Institutional Placement (QIP) for its kitchen appliances capacity expansion project. The company stated that the project will be financed using proceeds from an existing QIP and internal accruals.",
            "Sentiment": "neutral",
            "PublishDate": 1758803463341,
            "Source": "stock"
        },
        {
            "Title": "CARYSIL Expands Kitchen Appliance Manufacturing Capacity by 50% with ₹25 Crore Investment",
            "Summary": "CARYSIL's board has approved an expansion of kitchen appliance manufacturing capacity by 50,000 units, bringing total capacity to 150,000 units. The project requires an estimated investment of ₹25 crore, which will be funded through a combination of Qualified Institutional Placement (QIP) and internal accruals. The company targets commercial production to begin in Q1 FY 2026-27.",
            "Sentiment": "positive",
            "PublishDate": 1758698747241,
            "Source": "stock"
        },
        {
            "Title": "Carysil Limited Appoints Shveta Sharma as VP Sales and Senior Management Personnel",
            "Summary": "Carysil Limited appointed Ms. Shveta Sharma as VP Sales (STERNHAGEN & B2B) and designated her as Senior Management Personnel, effective September 15, 2025. The Board of Directors approved the appointment based on the recommendation of the Nomination and Remuneration Committee. Sharma brings over 20 years of experience in driving growth across luxury lifestyle and building materials sectors. She has led enterprise partnerships with marquee clients, built high-impact channels, and delivered award-winning go-to-market strategies across India and South Asia. She was previously recognized as 'LIXILian of the Year' and is known for cross-functional leadership and consistent top-line growth in both B2B and B2C markets.",
            "Sentiment": "positive",
            "PublishDate": 1757950884008,
            "Source": "corporate_governance"
        },
        {
            "Title": "CARYSIL Targets ₹500 Crore Domestic Revenue Through Dealer Expansion and IKEA Partnership",
            "Summary": "CARYSIL has set a target of ₹500 crore in domestic revenue through strategic initiatives including expanding its dealer network and securing a global supply deal with IKEA. The company plans to invest ₹20 crore to support these growth plans. CARYSIL is experiencing strong OEM demand in steel sinks and is operating at 75-95% capacity utilization. The company is focusing on brand development and expects these factors to enhance profits and drive growth across multiple markets.",
            "Sentiment": "positive",
            "PublishDate": 1755019587514,
            "Source": "stock"
        },
        {
            "Title": "Carysil Limited Reports No Material Deviation in QIP Fund Utilization for Q1 FY2026",
            "Summary": "Carysil Limited submitted its monitoring agency report for the quarter ended June 30, 2025, covering the utilization of funds raised through its Qualified Institutions Placement (QIP). ICRA Limited, the appointed monitoring agency, reported no material deviation from the stated objects of the issue. The company raised Rs 125 crore through the QIP in July 2024, with net proceeds of Rs 121.65 crore after issue-related expenses. During Q1 FY2026, Rs 7.11 crore was utilized for capital expenditure on machinery and equipment, while Rs 31.25 crore was used for working capital requirements and Rs 27.90 crore for general corporate purposes. The remaining Rs 47.98 crore of unutilized funds are deployed in fixed deposits with HDFC Bank earning returns of 6.60% to 7.40%. The company operates in manufacturing kitchen sinks, appliances, faucets, and related products.",
            "Sentiment": "neutral",
            "PublishDate": 1754994251724,
            "Source": "corporate_action"
        },
        {
            "Title": "Carysil Limited Approves Quarterly Results and Schedules 38th AGM for September 2025",
            "Summary": "Carysil Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company scheduled its 38th Annual General Meeting for September 24, 2025 at 3:00 PM via video conferencing. The Board also approved the appointment of M/s. P.C. Shah & Co., Practicing Company Secretaries, as Secretarial Auditors for five consecutive years from FY 2025-26 to FY 2029-30, subject to shareholder approval. The trading window for designated persons will open on August 15, 2025. The consolidated results include 13 subsidiary companies across multiple countries including Turkey, United Kingdom, Germany, United Arab Emirates, and United States of America.",
            "Sentiment": "neutral",
            "PublishDate": 1754991955958,
            "Source": "earnings"
        },
        {
            "Title": "CARYSIL Reports Strong Q1 Performance with Revenue Growth to 2.3B Rupees",
            "Summary": "CARYSIL reported Q1 revenue of 2.3 billion rupees compared to 2 billion rupees in the same period last year. The company's EBITDA increased to 438 million rupees from 358 million rupees year-over-year, with EBITDA margin improving to 19.3% from 17.84%. Consolidated net profit rose to 230 million rupees versus 159 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754991185911,
            "Source": "earnings"
        },
        {
            "Title": "CARYSIL Plans 200 Million Rupee Investment for Global Sink Supply Partnership with IKEA",
            "Summary": "CARYSIL announced plans to invest 200 million rupees for business expansion through a partnership with IKEA Supply AG. The investment aims to meet global sink demand, with operations excluding the U.S. market.",
            "Sentiment": "positive",
            "PublishDate": 1754914975671,
            "Source": "stock"
        },
        {
            "Title": "Mphasis Reports 9.1% Revenue Growth in Q1 Results; Multiple Business Acquisitions Completed",
            "Summary": "Mphasis Limited reported consolidated revenue of ₹37,324.89 million and net profit of ₹4,417.03 million for the quarter ended June 30, 2025, representing year-over-year growth of 9.1% and 9.2% respectively. The company's earnings per share stood at ₹23.22 (basic) and ₹23.14 (diluted). The Board approved a final dividend of ₹57 per equity share for the year ended March 31, 2025. The company completed several strategic acquisitions through its subsidiary Mphasis Corporation, including the cybersecurity business of EDZ systems for $17 million and software testing business of tsQs Inc for $27 million. Additionally, Mphasis acquired a 26% equity stake in Aokah Inc. for $4 million and entered a framework agreement to acquire Locate Software Inc's digital transformation business for $8.4 million.",
            "Sentiment": "positive",
            "PublishDate": 1753515647694,
            "Source": "earnings"
        },
        {
            "Title": "Carysil Limited Appoints Pavankumar Palkar as Chief Sales Officer for Domestic Sales",
            "Summary": "Carysil Limited has appointed Pavankumar Palkar as Chief Sales Officer for Domestic Sales and designated him as Senior Management Personnel, effective July 21, 2025. The appointment was approved by the Board of Directors based on the Nomination and Remuneration Committee's recommendation. Palkar brings 17 years of experience in sales, business development, and P&L management from senior roles at reputed organizations. He has expertise in driving transformational growth through strategic planning, market expansion, and cross-functional leadership across modern trade, e-commerce, exports, and institutional sales.",
            "Sentiment": "positive",
            "PublishDate": 1753101860834,
            "Source": "corporate_governance"
        },
        {
            "Title": "Carysil Reports Q4 Results and Recommends Final Dividend",
            "Summary": "Carysil has announced its Q4 financial results and dividend recommendation. The company's Q4 consolidated net profit increased to 185.8 million rupees from 155.3 million rupees year-over-year. Revenue grew to 2.04 billion rupees from 1.91 billion rupees in the same period last year. EBITDA slightly increased to 349.3 million rupees from 345.3 million rupees, while the EBITDA margin decreased to 17.11% from 18.12% year-over-year. The company has recommended a final dividend of 2.4 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747669059000,
            "Source": "result"
        },
        {
            "Title": "Carysil Announces Potential Revenue Boost from Key Customer",
            "Summary": "Carysil has reported that the maximum revenue potential from a specific customer is 375 million rupees. This addition is expected to increase the company's total revenue by 5%.",
            "Sentiment": "positive",
            "PublishDate": 1741752469000,
            "Source": "corporate_action"
        },
        {
            "Title": "Carysil Secures New Customer with Dedicated Quartz Sink Production",
            "Summary": "Carysil has announced a commitment to dedicate a minimum production capacity of 150,000 quartz sinks per year for a new customer. This dedicated production is set to commence in May 2025, indicating a significant new business relationship and potential growth for the company's quartz sink manufacturing division.",
            "Sentiment": "positive",
            "PublishDate": 1741752110000,
            "Source": "corporate_action"
        },
        {
            "Title": "Carysil Secures Agreement with Karran Inc. for Quartz Sink Supply to Major U.S. Retailer",
            "Summary": "Carysil has entered into an agreement with Karran Inc., USA to supply quartz kitchen sinks for a new major U.S. home retail chain. This deal positions Carysil to expand its presence in the U.S. market and potentially increase its revenue through a significant retail partnership.",
            "Sentiment": "positive",
            "PublishDate": 1741751930000,
            "Source": "order&deals"
        },
        {
            "Title": "Carysil Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Carysil, a company in the consumer goods sector, has reported its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 290 million rupees from 352 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin dropped to 14.29% from 18.73% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739350203000,
            "Source": "earnings"
        },
        {
            "Title": "Carysil Reports Mixed Q3 Financial Results",
            "Summary": "Carysil Limited has announced its Q3 financial results. The company's consolidated net profit decreased to 120 million rupees from 153 million rupees year-over-year. However, revenue showed a slight increase, reaching 2 billion rupees compared to 1.9 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739350090000,
            "Source": "earnings"
        },
        {
            "Title": "Carysil Reports Mixed Q2 Financial Results",
            "Summary": "Carysil, a company likely in the manufacturing sector, has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 380 million rupees from 340 million rupees year-over-year. However, the EBITDA margin decreased to 18.36% from 20.73% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730972282000,
            "Source": "result"
        },
        {
            "Title": "Carysil Reports Strong Q2 Revenue Growth",
            "Summary": "Carysil, a company likely in the manufacturing or consumer goods sector, has reported its second quarter revenue for the current fiscal year. The company's revenue increased to 2.1 billion rupees, up from 1.6 billion rupees in the same quarter of the previous year, representing significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730972193000,
            "Source": "result"
        },
        {
            "Title": "Carysil Reports Q2 Profit Increase",
            "Summary": "Carysil, a company likely in the manufacturing or consumer goods sector, has reported its second quarter consolidated net profit. The profit has increased to 168 million rupees from 154 million rupees in the same quarter of the previous year, showing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730972171000,
            "Source": "result"
        }
    ]
}