{
    "Symbol": "CASTROLIND",
    "ISIN": "INE172A01027",
    "News": [
        {
            "Title": "Castrol India Sets EBITDA Margin Forecast 21-24%",
            "Summary": "Castrol India forecasts EBITDA margins between 21-24%, targeting around 24% by FY25. Company recorded Q4 margins at 26% and expects volume growth at 1.5-2x market rate.",
            "Sentiment": "positive",
            "PublishDate": 1770262332129,
            "Source": "stocks"
        },
        {
            "Title": "Castrol India Q4FY25 Earnings Call Recording Live",
            "Summary": "Castrol India makes post-earnings call recording available on company website following discussion of audited financial results for quarter and year ended 31 December 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770208106474,
            "Source": "co_actions_results"
        },
        {
            "Title": "Castrol India Trials Data Center Cooling Solutions",
            "Summary": "Castrol India management reports ongoing trials for immersion coolants used in data centers, highlighting this as a significant growth opportunity for the company's future business expansion.",
            "Sentiment": "positive",
            "PublishDate": 1770188522837,
            "Source": "stocks"
        },
        {
            "Title": "Castrol India Declares Final Dividend of Rs 5.25",
            "Summary": "Castrol India announces final dividend of Rs 5.25 per share for shareholders, reflecting the company's commitment to returning value to investors through regular dividend distributions.",
            "Sentiment": "positive",
            "PublishDate": 1770118059601,
            "Source": "co_actions_results"
        },
        {
            "Title": "Castrol India Q3 Net Profit Drops to ₹2.45B",
            "Summary": "Castrol India reported a net profit of ₹2.45 billion for Q3, marking a decline from ₹2.70 billion in the same quarter last year, representing a 9.26% year-on-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1770117995422,
            "Source": "co_actions_results"
        },
        {
            "Title": "Castrol India Schedules Q4FY25 Earnings Call for Feb 4",
            "Summary": "Castrol India Limited announces post-earnings conference call scheduled for February 4, 2026, to discuss Q4 and full year FY25 financial results with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1769575225595,
            "Source": "co_actions_results"
        },
        {
            "Title": "Castrol India Partners HPCL for Re-Refined Base Oil",
            "Summary": "Castrol India signs agreement with HPCL to investigate re-refined base oil system, developing circular model for gathering and re-refining used lubricating oil to promote sustainability.",
            "Sentiment": "positive",
            "PublishDate": 1769492144049,
            "Source": "stocks"
        },
        {
            "Title": "Stonepeak launches open offer for 26% Castrol India stake",
            "Summary": "Stonepeak and CPPIB launch open offer to acquire 26% stake in Castrol India at ₹194.04 per share, valued at ₹4,990 crore, following BP's $6 billion divestment deal.",
            "Sentiment": "neutral",
            "PublishDate": 1766714291044,
            "Source": "co_actions_results"
        },
        {
            "Title": "Castrol India: Motion JVCo makes 26% open offer at ₹194.04",
            "Summary": "Motion JVCo, Stonepeak and CPPIB launch open offer to acquire 26% stake in Castrol India at ₹194.04 per share following BP's $6 billion stake sale to Stonepeak.",
            "Sentiment": "positive",
            "PublishDate": 1766557199202,
            "Source": "co_actions_results"
        },
        {
            "Title": "Castrol India Appoints Mayank Pandey as Vice-President Head-B2C Sales",
            "Summary": "Castrol India's Board of Directors appointed Mayank Pandey as Vice-President Head-B2C Sales, a Senior Management Personnel position, effective January 1, 2026. Pandey brings over 25 years of experience across oil & gas, lubricants, and other sectors, having previously served as Whole-Time Director and Vice-President Head-Supply Chain at Castrol India from August 2021 to July 2024.",
            "Sentiment": "positive",
            "PublishDate": 1763114639709,
            "Source": "corporate_governance"
        },
        {
            "Title": "Castrol India Reports 6% Revenue Growth in Q3 2025 with Strong Volume Expansion",
            "Summary": "Castrol India delivered revenue of INR 1,363 crores in Q3 2025, representing 6% year-on-year growth driven by 7% volume growth. EBITDA increased to INR 323 crores, up INR 37 crores, while profit after tax reached INR 228 crores, marking 10% growth. For nine months ending September 2025, revenue reached INR 4,282 crores (up 7%), with EBITDA at INR 980 crores (up 9%) and profit after tax at INR 705 crores (up 8%). The company achieved 8% year-to-date volume growth with strong performance across segments - personal mobility grew 6%, commercial vehicles 8%, and industrial segment posted double-digit growth. Castrol expanded its retail network to over 150,000 outlets including 40,000 rural outlets, and increased Castrol Auto Service centers to 750 across 300 cities. The company launched new products including helmet cleaner and signed an MoU with VinFast Auto for EV after-sales services. Managing Director Kedar Lele will be succeeded by Saugata Basuray from January 1st. BP's strategic review of Castrol business globally continues with data room processes ongoing for potential investors.",
            "Sentiment": "positive",
            "PublishDate": 1762897336689,
            "Source": "earnings"
        },
        {
            "Title": "Castrol India Reports 6% Revenue Growth to ₹1,363 Crore in Third Quarter 2025",
            "Summary": "Castrol India Limited announced its results for the quarter and nine months ended September 30, 2025. The company reported revenue from operations of ₹1,363 crore in the third quarter, representing 6% growth year-on-year. EBITDA reached ₹323 crore with 13% growth, while profit after tax rose 10% to ₹228 crore. Volumes increased 7% during the quarter. For the nine-month period, revenue from operations stood at ₹4,282 crore (up 7%), EBITDA at ₹980 crore (up 9%), and profit after tax at ₹705 crore (up 8%), with volumes growing 8%. The company expanded its national network to 150,000 outlets across India and launched new products including Castrol All-in-One Helmet Cleaner. Rural and industrial segments contributed significantly to growth momentum. Managing Director Kedar Lele highlighted the company's focus on driving volume growth and expanding portfolio in consumer-relevant categories.",
            "Sentiment": "positive",
            "PublishDate": 1762248180029,
            "Source": "earnings"
        },
        {
            "Title": "Castrol India Reports Revenue Growth to 13.6B Rupees in Q2",
            "Summary": "Castrol India reported Q2 revenue of 13.6 billion rupees, up from 12.9 billion rupees in the same period last year. The company's EBITDA increased to 3.22 billion rupees from 2.9 billion rupees year-over-year. EBITDA margin improved to 23.69% compared to 22.21% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762244848419,
            "Source": "earnings"
        },
        {
            "Title": "Castrol India Reports 8.6% Growth in Net Profit to 2.28 Billion Rupees",
            "Summary": "Castrol India reported net profit of 2.28 billion rupees compared to 2.1 billion rupees in the same quarter of the previous year, representing year-over-year growth. The results reflect the company's quarterly financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1762244414910,
            "Source": "earnings"
        },
        {
            "Title": "Castrol India Managing Director Kedar Lele to Resign; Saugata Basuray Named Interim CEO",
            "Summary": "Castrol India Limited announced that Managing Director Kedar Lele will resign effective December 31, 2025, to pursue other opportunities. The Board of Directors appointed Saugata Basuray as Interim CEO starting January 1, 2026, until a new Managing Director is appointed. Basuray will retain his current role as Wholetime Director & Head B2C Sales and will be re-designated as 'Wholetime Director & Interim CEO'. Basuray brings over 25 years of experience with Castrol India, having joined as a Management Trainee in 1999 and worked across multiple countries including the UK, Philippines, and Indonesia. He currently heads the B2C business segment and has led transformation of the company's go-to-market model while expanding distribution networks into rural India.",
            "Sentiment": "neutral",
            "PublishDate": 1760090524028,
            "Source": "corporate_governance"
        },
        {
            "Title": "VinFast India Partners with Castrol India to Strengthen Electric Vehicle After-Sales Services",
            "Summary": "VinFast India has entered into an agreement with Castrol India to enhance its electric vehicle after-sales service network. The partnership aims to improve service capabilities for electric vehicles through Castrol India's expertise and network.",
            "Sentiment": "positive",
            "PublishDate": 1759296300490,
            "Source": "order&deals"
        },
        {
            "Title": "Castrol India Launches Helmet Cleaner Product",
            "Summary": "Castrol India has launched a helmet cleaner as part of expanding its auto care product range. The new product represents the company's strategy to diversify its automotive care offerings beyond traditional lubricants.",
            "Sentiment": "positive",
            "PublishDate": 1758518832233,
            "Source": "stock"
        },
        {
            "Title": "Castrol India Shareholders Approve Key Appointments Through Postal Ballot",
            "Summary": "Castrol India Limited completed a postal ballot through remote e-voting from August 14 to September 12, 2025. Shareholders approved three resolutions with overwhelming support: appointment of Ms. Mrinalini Srinivasan as Director (99.02% approval), her appointment as Wholetime Director for five years from July 28, 2025 to July 27, 2030 (99.25% approval), and appointment of M/s. Parikh & Associates as Secretarial Auditors for five consecutive years (99.90% approval). The voting process was conducted entirely through electronic means, with 2,842 members participating in the first resolution. K.G. Saraf of Saraf and Associates served as the scrutinizer for the e-voting process.",
            "Sentiment": "positive",
            "PublishDate": 1757921244452,
            "Source": "corporate_action"
        },
        {
            "Title": "Castrol India Seeks Shareholder Approval for New CFO Appointment and Secretarial Auditor Change",
            "Summary": "Castrol India Limited has issued a postal ballot notice seeking shareholder approval for three ordinary resolutions. The company proposes to appoint Ms. Mrinalini Srinivasan as Director and Wholetime Director for a five-year term from July 28, 2025 to July 27, 2030. Ms. Srinivasan, who has over 17 years of experience at Procter & Gamble India including serving as CFO, will receive annual remuneration in the scale of INR 3.53 crore to INR 5.52 crore, along with a joining bonus of INR 75 lakh. The company also seeks approval to appoint M/s. Parikh & Associates as Secretarial Auditors for five consecutive years from FY 2025 to FY 2029, replacing the current auditors M/s. S. N. Ananthasubramanian & Co. The e-voting period runs from August 14 to September 12, 2025, with results to be declared by September 16, 2025. The cut-off date for eligible shareholders is August 8, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755071137954,
            "Source": "corporate_governance"
        },
        {
            "Title": "Castrol India Outlines Growth Strategy Through Rural Expansion and Industrial Lubricants",
            "Summary": "Castrol India has outlined its long-term growth strategy focusing on several key areas. The company plans to enter rural markets and expand its industrial lubricants business while offering eco-friendly fluids. The strategy includes forming partnerships with equipment makers, improving services and auto care products, and enhancing digital distribution channels. These initiatives aim to boost sales volume, maintain profit margins, and deliver returns to shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1755019580872,
            "Source": "stock"
        },
        {
            "Title": "Castrol India Reports 7% Revenue Growth to ₹1,497 Crores in Q2 2025",
            "Summary": "Castrol India delivered strong quarterly results with revenue from operations growing 7% year-on-year to ₹1,497 crores. EBITDA increased 8% to ₹349 crores, while PAT rose 5% to ₹244 crores. For the first half, revenue grew 7% to ₹2,919 crores with EBITDA up 7% at ₹657 crores and PAT increasing 6.5% to ₹477 crores. The Board recommended an interim dividend of ₹3.50 per share. Volume growth reached 8% overall, driven by industrial segment growth of 13%, rural expansion at 12%, and high single-digit growth in bikes and cars. The company expanded its retail presence to over 160,000 outlets and maintained market share above 20%. Industrial segment showed consistent growth for nine quarters, supported by new product launches including metalworking fluids and chemical management services. The company continues testing data center cooling solutions with hyperscalers while expanding its rural distribution network through 1,000 sub-distributors.",
            "Sentiment": "positive",
            "PublishDate": 1754903654779,
            "Source": "earnings"
        },
        {
            "Title": "Castrol India Targets 21-24% EBITDA Margin, Expects Growth in Industrial and Rural Segments",
            "Summary": "Castrol India has set an EBITDA margin target of 21-24%. The company expressed optimism about its full-year results, citing strong performance in the first half. Management expects growth in both industrial and rural sectors.",
            "Sentiment": "positive",
            "PublishDate": 1754537652357,
            "Source": "stock"
        },
        {
            "Title": "Castrol India Reports 7% Revenue Growth in Q2 2025, Declares ₹3.5 Interim Dividend",
            "Summary": "Castrol India Limited reported revenue from operations of ₹1,497 crore for the quarter ended June 30, 2025, representing 7% year-on-year growth. EBITDA increased 8% to ₹349 crore, while profit after tax rose 5% to ₹244 crore. For the six-month period, revenue reached ₹2,919 crore (up 7%), with profit after tax of ₹477 crore (up 6.5%). The Board declared an interim dividend of ₹3.50 per equity share for financial year 2025, payable on or before September 3, 2025, with August 11, 2025 as the record date. The company appointed M/s. Parikh & Associates as Secretarial Auditors for a five-year term from 2025 to 2029, subject to shareholder approval. Key operational highlights include expansion in industrial business with over 100 customers for the Rustilo range, presence in over 160,000 outlets, and FastScan app usage by over one million mechanics.",
            "Sentiment": "positive",
            "PublishDate": 1754385986732,
            "Source": "corporate_action"
        },
        {
            "Title": "Castrol India Reports Higher Quarterly Profit and Revenue Growth",
            "Summary": "Castrol India reported net profit of 2.44 billion rupees compared to 2.3 billion rupees in the same period last year. The company's revenue increased to 14.96 billion rupees from 13.98 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754385345403,
            "Source": "earnings"
        },
        {
            "Title": "Castrol India Launches New Magnatec Engine Oil With Updated API SQ Standards",
            "Summary": "Castrol India has launched a new version of its Magnatec engine oil that meets updated global API SQ standards. The product launch represents the company's effort to align with enhanced international quality specifications for engine oils.",
            "Sentiment": "positive",
            "PublishDate": 1754024745157,
            "Source": "stock"
        },
        {
            "Title": "Seven BSE 500 Companies Including Castrol and HUL Paid Dividends Exceeding FY25 Profits",
            "Summary": "Seven companies in the BSE 500 index paid more in dividends than their net profits in FY25, resulting in payout ratios above 100%. The companies are Castrol India, Page Industries, Tech Mahindra, Hindustan Zinc, Hindustan Unilever, Aster DM Healthcare, and Godrej Consumer Products. All had market capitalizations above ₹20,000 crore, with four exceeding ₹1 lakh crore. Three companies - Castrol India, HUL, and Aster DM - declared special dividends. Aster DM paid the highest special dividend of ₹118 per share after separating its Gulf business, distributing around ₹6,150 crore against net profit of over ₹5,400 crore. By sector, IT companies showed the highest aggregate payout ratio at 76% for FY25, up from 60% previously. FMCG sector payout ratios decreased to 64% from 80.5%, while metals sector ratios increased to 53% from 49%.",
            "Sentiment": "positive",
            "PublishDate": 1753663960303,
            "Source": "corporate_action"
        },
        {
            "Title": "Castrol India: Shares Surge 6% on Favorable Tax Dispute Ruling",
            "Summary": "Castrol India's stock jumped 6% after receiving a favorable order from CESTAT in a Rs 4,131 crore tax dispute with Maharashtra Sales Tax Department. The ruling covers a 9-year period from 2007-08 to 2015-16 and 2017-18, rejecting MSTD's appeals. The dispute involved allegations of inter-state sales from Maharashtra plants to CFAs in other states.",
            "Sentiment": "positive",
            "PublishDate": 1752484924000,
            "Source": "order&deals"
        },
        {
            "Title": "Castrol India Wins Tax Appeal Against Maharashtra Sales Tax Department",
            "Summary": "The Customs, Excise and Service Tax Appellate Tribunal (Cestat) has ruled in favor of Castrol India, rejecting appeals from the Maharashtra Sales Tax Department. The company had previously received demand orders totaling 41.31 billion rupees for the period 2007-08 to 2017-18 from the Maharashtra Sales Tax Department.",
            "Sentiment": "positive",
            "PublishDate": 1752451686000,
            "Source": "default"
        },
        {
            "Title": "Castrol India: Wins ₹4,131 Crore Tax Dispute Against Maharashtra Sales Tax Department",
            "Summary": "Castrol India received a favorable order from CESTAT in a long-standing tax dispute with Maharashtra Sales Tax Department, involving ₹4,131 crore under MVAT regime. The dispute, spanning 2007-08 to 2017-18, was resolved in Castrol's favor, with no financial impact on the company.",
            "Sentiment": "positive",
            "PublishDate": 1752237206000,
            "Source": "order&deals"
        },
        {
            "Title": "CESTAT Rules in Favor of Castrol India in Tax Dispute",
            "Summary": "The Customs, Excise and Service Tax Appellate Tribunal (CESTAT) has ruled in favor of Castrol India, rejecting appeals from the Maharashtra Sales Tax Department. The department had demanded 41.31 billion rupees from Castrol India for the period 2007-08 to 2017-18.",
            "Sentiment": "positive",
            "PublishDate": 1752235839000,
            "Source": "default"
        },
        {
            "Title": "Castrol India Expands Product Line with New Automotive Cleaners",
            "Summary": "Castrol India has announced an expansion of its product line. The company has introduced three new automotive cleaning products: a Throttle Body Cleaner, a Fuel Injector and Carburetor Cleaner, and a Brake Cleaner. These additions aim to enhance Castrol's offerings in the automotive maintenance sector.",
            "Sentiment": "positive",
            "PublishDate": 1751265986000,
            "Source": "default"
        },
        {
            "Title": "Castrol India Clarifies Share Price Surge Amid BP's Strategic Review",
            "Summary": "Castrol India has issued a clarification regarding the recent surge in its share price. The company stated that it is not involved in any negotiations or discussions mentioned in a recent news article and has no undisclosed information that could explain the price movement. Additionally, Castrol India confirmed that it is unaware of any legal or regulatory proceedings related to the issue. This clarification comes in the context of BP's strategic review, which was mentioned but not elaborated upon in the news.",
            "Sentiment": "neutral",
            "PublishDate": 1748523729000,
            "Source": "default"
        },
        {
            "Title": "Castrol India Reports Q4 Financial Results",
            "Summary": "Castrol India has released its Q4 financial results. The company's EBITDA increased to 3.07 billion rupees from 2.94 billion rupees year-over-year. However, the EBITDA margin slightly decreased to 21.61% from 22.17%. Revenue grew to 14.2 billion rupees from 13.25 billion rupees. Net profit rose to 2.33 billion rupees from 2.2 billion rupees year-over-year, but decreased from 2.71 billion rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1745841183000,
            "Source": "result"
        },
        {
            "Title": "Castrol India: Q4 Profit Rises 8%, Revenue Up 7%",
            "Summary": "Castrol India reported a net profit of ₹233 crore in Q4, up 8% year-over-year. The company's revenue also increased by 7% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1745838638000,
            "Source": "earnings"
        },
        {
            "Title": "Castrol India to Consider Q4 Results on April 28",
            "Summary": "Castrol India Limited has announced that it will consider and approve its financial results for the fourth quarter on April 28. This announcement indicates the company is preparing to disclose its performance for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1743682443000,
            "Source": "result"
        },
        {
            "Title": "Castrol India: Share Price Drops 7% on Ex-Dividend Day",
            "Summary": "Castrol India's shares fell nearly 7% as they turned ex-dividend. The company declared a total dividend of Rs 13 per share, including a special dividend of Rs 4.50. The record date was set as March 18, with eligible shareholders to receive the dividend within 30 days.",
            "Sentiment": "neutral",
            "PublishDate": 1742274568000,
            "Source": "corporate_action"
        },
        {
            "Title": "Saudi Aramco Considers Bid for BP's Castrol Lubricant Assets",
            "Summary": "Saudi Aramco, the world's largest oil company, is reportedly weighing a bid for BP's Castrol lubricant business. This potential acquisition could significantly expand Saudi Aramco's presence in the global lubricants market. Castrol, known for its motor oils and industrial lubricants, is a valuable asset in BP's portfolio. The news suggests a strategic move by Saudi Aramco to diversify its operations and strengthen its position in the downstream sector of the oil industry.",
            "Sentiment": "neutral",
            "PublishDate": 1741176895000,
            "Source": "corporate_action"
        },
        {
            "Title": "BP Initiates Strategic Review of Castrol India",
            "Summary": "BP has announced a strategic review of its Castrol business, including Castrol India. The review aims to accelerate Castrol's next phase of value delivery and will consider all options with a focus on creating value. This move suggests BP is exploring ways to optimize its Castrol operations, potentially leading to significant changes in the business structure or strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1740627784000,
            "Source": "corporate_action"
        },
        {
            "Title": "BP Considers Selling Stake in Castrol India",
            "Summary": "BP is reportedly considering selling some of its stake in Castrol India, according to CNBC Awaaz. BP currently holds a 51% stake in the company. This potential move could signify a strategic shift in BP's investment portfolio or a reallocation of resources.",
            "Sentiment": "neutral",
            "PublishDate": 1740627689000,
            "Source": "corporate_action"
        },
        {
            "Title": "Castrol India Ltd: Q3 Profit Jumps 12%, Stock Surges",
            "Summary": "Castrol India reported a 12% YoY increase in Q3 FY25 net profit to ₹271 crore. Revenue rose 7% to ₹1,354 crore. The company declared a final dividend of ₹9.5 per share. Stock price reached ₹187.75 with high trading volumes.",
            "Sentiment": "positive",
            "PublishDate": 1738656517000,
            "Source": "result"
        },
        {
            "Title": "Castrol India Reports Increased Q3 Profit and Revenue, Declares Dividend",
            "Summary": "Castrol India has announced its Q3 financial results, showing improved performance. The company's net profit rose to 2.7 billion rupees from 2.4 billion rupees year-over-year. Revenue also increased to 13.54 billion rupees from 12.6 billion rupees in the same period last year. Additionally, Castrol India has recommended a final dividend of 9.5 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1738627948000,
            "Source": "earnings"
        },
        {
            "Title": "Castrol India Recommends Final Dividend of Rs 9.5 Per Share",
            "Summary": "Castrol India has recommended a final dividend of Rs 9.5 per share to its shareholders. This announcement represents a significant corporate action, indicating the company's financial performance and its commitment to returning value to shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1738592300000,
            "Source": "corporate_action"
        },
        {
            "Title": "Castrol India Reports Improved Q3 EBITDA and Margin",
            "Summary": "Castrol India has announced its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 3.76 billion rupees, up from 3.3 billion rupees in the same period last year. Additionally, the EBITDA margin improved to 27.77% from 26.03% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738591604000,
            "Source": "earnings"
        },
        {
            "Title": "Castrol India Reports Increased Q3 Profit and Revenue",
            "Summary": "Castrol India has announced its financial results for the third quarter. The company's net profit increased to 2.7 billion rupees from 2.4 billion rupees in the same period last year. Revenue also saw growth, rising to 13.54 billion rupees from 12.6 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738591596000,
            "Source": "earnings"
        },
        {
            "Title": "Castrol India Announces Collaboration to Strengthen B2C Aftermarket Network and Prepare for Electric Mobility",
            "Summary": "Castrol India has announced a new collaboration aimed at developing a robust B2C aftermarket network in India. The partnership also focuses on enhancing readiness for the transition to electric mobility. This strategic move indicates Castrol's efforts to adapt to changing market dynamics and future automotive trends.",
            "Sentiment": "positive",
            "PublishDate": 1732885484000,
            "Source": "corporate_action"
        },
        {
            "Title": "Castrol India Invests in KI Mobility Solutions to Strengthen Automotive Aftermarket",
            "Summary": "Castrol India has announced a collaboration with KI Mobility Solutions to enhance the Indian automotive aftermarket ecosystem. The partnership involves an investment of up to 487.5 crores by Castrol India in KI Mobility Solutions. This strategic move aims to create a co-branded service and maintenance network, potentially revolutionizing the automotive aftermarket sector in India.",
            "Sentiment": "positive",
            "PublishDate": 1732885478000,
            "Source": "corporate_action"
        },
        {
            "Title": "Castrol India Appoints New Managing Director",
            "Summary": "Castrol India has appointed Kedar Lele as its new Managing Director. This leadership change represents a significant corporate decision for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1730262506000,
            "Source": "corporate_action"
        },
        {
            "Title": "Castrol India: Q3 Results In Line with Expectations",
            "Summary": "Castrol India's Q3 results met expectations according to IDBI Capital. The brokerage suggests waiting for a better entry point for the stock.",
            "Sentiment": "neutral",
            "PublishDate": 1730174091000,
            "Source": "result"
        },
        {
            "Title": "Castrol India: Strategic Brand Investments to Drive Sustainable Growth",
            "Summary": "Castrol India is focusing on strategic brand investments and developing products aligned with sustainability to fuel growth.",
            "Sentiment": "positive",
            "PublishDate": 1729840022000,
            "Source": "normal_news"
        },
        {
            "Title": "Castrol India: Q3 Profit Rises 7% but Misses Estimates",
            "Summary": "Castrol India's Q3 consolidated net profit increased 7% to Rs 207.4 crore, falling short of analysts' expectations. Revenue grew 8.9% to Rs 1,288.2 crore. EBITDA rose 7%, but margin contracted to 22.2%. The company plans to focus on product innovations and strategic brand investments.",
            "Sentiment": "neutral",
            "PublishDate": 1729774322000,
            "Source": "result"
        }
    ]
}