{
    "Symbol": "CCAVENUE",
    "ISIN": "INE483S01020",
    "News": [
        {
            "Title": "AvenuesAI Converts 79.41 Lakh Partly Paid Shares",
            "Summary": "AvenuesAI Limited's Rights Issue Committee approved conversion of 79,41,270 partly paid-up equity shares to fully paid-up shares on February 10, 2026, following receipt of Rs. 5 per share call money payment.",
            "Sentiment": "positive",
            "PublishDate": 1770801020677,
            "Source": "co_actions_results"
        },
        {
            "Title": "Infibeam Avenues Gets CA Certificate for Name Change",
            "Summary": "Infibeam Avenues Limited receives revised CA certificate for proposed name change to AvenuesAI Limited, complying with SEBI Regulation 45 requirements. Last name change occurred on July 23, 2018.",
            "Sentiment": "neutral",
            "PublishDate": 1769607229463,
            "Source": "stocks"
        },
        {
            "Title": "Infibeam Avenues Rebrands to AvenuesAI Limited",
            "Summary": "Infibeam Avenues Limited officially changes its corporate name to AvenuesAI Limited effective January 20, 2026, following MCA approval. The company also unveils a new logo to align with its strategic vision.",
            "Sentiment": "positive",
            "PublishDate": 1768919357483,
            "Source": "stocks"
        },
        {
            "Title": "Infibeam's RediffPay UPI App Enters CUG Testing Phase",
            "Summary": "Infibeam Avenues' RediffPay UPI app begins Closed User Group testing after NPCI approval, targeting financial wellness with investment products and credit services for Tier 2-3 cities.",
            "Sentiment": "positive",
            "PublishDate": 1766986128230,
            "Source": "stocks"
        },
        {
            "Title": "Infibeam Avenues Seeks Shareholder Approval for AI Rebrand",
            "Summary": "Infibeam Avenues proposes name change to Avenues AI Limited, reflecting transformation to AI-first digital payments company. Postal ballot includes leadership changes and business expansion.",
            "Sentiment": "positive",
            "PublishDate": 1765974785286,
            "Source": "co_actions_results"
        },
        {
            "Title": "Infibeam Avenues Converts 68.22 Cr Partly Paid Shares",
            "Summary": "Infibeam Avenues Rights Issue Committee approved conversion of 68,21,82,616 partly paid-up equity shares into fully paid-up shares upon receipt of final call money of ₹5 per share on December 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765889106683,
            "Source": "co_actions_results"
        },
        {
            "Title": "Infibeam Avenues Board Approves Name Change to Avenues AI",
            "Summary": "Infibeam Avenues board approves strategic transformation to Avenues AI Limited, elevates Vishwas Patel to MD & CEO, and appoints new independent director as company pivots to AI-first technology enterprise.",
            "Sentiment": "positive",
            "PublishDate": 1765444327292,
            "Source": "stocks"
        },
        {
            "Title": "Odigma Consultancy Solutions Reports Share Transmission from Deceased Promoter to Legal Heir",
            "Summary": "Odigma Consultancy Solutions Limited announced the transmission of 42,299 shares from deceased promoter group member Late Mr. Subhashchandra R. Amin to his legal heir Ms. Shetal Samirbhai Patel. Ms. Patel will now be classified as part of the promoter group, with the updated shareholding pattern to be reflected in the shareholding pattern for the quarter ending December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764159145488,
            "Source": "corporate_action"
        },
        {
            "Title": "Infibeam Avenues Issues Final Call Notice for Rights Issue Shares",
            "Summary": "Infibeam Avenues has issued a first and final call notice to holders of partly paid-up equity shares from its June 2025 rights issue, requiring payment of ₹5 per share by December 9, 2025. Failure to pay the call money will result in forfeiture of the partly paid-up shares, with trading in these shares suspended from November 14, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763554851641,
            "Source": "corporate_action"
        },
        {
            "Title": "Infibeam Avenues Secures RBI Approval for Offline Payment Aggregator Services",
            "Summary": "Infibeam Avenues received RBI authorization to operate as a payment aggregator for offline payments through POS devices, marking its fourth RBI licence under the CCAvenue brand. The approval enables the company to offer unified digital and offline payment solutions to merchants, expanding its presence in India's growing POS device market projected to reach ₹135.32 billion by 2034.",
            "Sentiment": "positive",
            "PublishDate": 1763363980122,
            "Source": "stock"
        },
        {
            "Title": "Infibeam Avenues Reports Record Q2 FY26 Results, Approaches $1 Billion Annual Revenue Run Rate",
            "Summary": "Infibeam Avenues achieved its highest-ever quarterly performance with gross revenue of Rs. 1,965 crores (up 93% year-on-year) and net revenue of Rs. 153 crores, driven by strong TPV growth and improved credit card transaction mix. The company is transitioning into a hybrid B2B-B2C organization combining AI-driven fintech infrastructure through CCAvenue with consumer platforms under Rediff, while securing multiple regulatory approvals including PPI license and IFSC authorizations.",
            "Sentiment": "positive",
            "PublishDate": 1763363924584,
            "Source": "earnings"
        },
        {
            "Title": "Infibeam Avenues Receives RBI Authorization for Physical Payment Aggregator Services",
            "Summary": "Reserve Bank of India granted Infibeam Avenues final authorization to operate as a Payment Aggregator in Physical mode, expanding beyond its existing Online Payment Aggregator License under the Payment and Settlement Systems Act, 2007. This authorization enables the company to provide digital payment services to merchants across the country through both online and physical channels.",
            "Sentiment": "positive",
            "PublishDate": 1763142571798,
            "Source": "stock"
        },
        {
            "Title": "Infibeam Avenues Reports No Deviation in Rs. 699.99 Crore Rights Issue Fund Utilization",
            "Summary": "Infibeam Avenues Limited submitted its monitoring agency report for the quarter ended September 30, 2025, confirming no variation or deviation in the utilization of proceeds from its Rs. 699.99 crore rights issue conducted in July 2025. The company utilized Rs. 151.08 crore during the quarter, primarily for subsidiary investments and loan repayments, with Rs. 198.91 crore remaining unutilized and deployed in fixed deposits.",
            "Sentiment": "positive",
            "PublishDate": 1763122462220,
            "Source": "earnings"
        },
        {
            "Title": "Infibeam Avenues Targets ₹6 Trillion Annual TPV with AI-Powered Fintech Expansion",
            "Summary": "Infibeam Avenues is expanding its merchant network across India and MENA regions while launching an AI-powered payment fraud detection platform, targeting ₹6 trillion annual transaction processing volume. The company is focusing on SaaS, digital credit, and enterprise payment integration to drive margin expansion in its payments and AI-based fintech solutions business.",
            "Sentiment": "positive",
            "PublishDate": 1763052058281,
            "Source": "stock"
        },
        {
            "Title": "Infibeam Avenues Reports 51% Jump in Quarterly Net Profit to 665 Million Rupees",
            "Summary": "Infibeam Avenues reported consolidated net profit of 665 million rupees for the quarter, representing a significant increase from 441 million rupees in the same period last year. The year-over-year growth reflects a 51% rise in quarterly earnings.",
            "Sentiment": "positive",
            "PublishDate": 1763021278795,
            "Source": "earnings"
        },
        {
            "Title": "Infibeam Avenues Reports 92% Revenue Growth Despite Margin Compression",
            "Summary": "Infibeam Avenues reported quarterly revenue of 19.6 billion rupees, representing a significant increase from 10.2 billion rupees in the same period last year. The company's EBITDA rose to 962 million rupees from 784 million rupees year-over-year. However, EBITDA margin declined to 4.9% compared to 7.71% in the previous year, indicating margin compression despite revenue growth.",
            "Sentiment": "neutral",
            "PublishDate": 1763020334201,
            "Source": "earnings"
        },
        {
            "Title": "Infibeam Avenues Makes Final Call on Rights Issue Shares Worth Rs 350 Crore",
            "Summary": "Infibeam Avenues' Rights Issue Committee approved the first and final call of Rs 5 per share on 69,99,85,723 partly paid equity shares. The shares were originally allotted on July 15, 2025, with Re 0.50 paid-up out of Re 1 face value. The call amount totals Rs 349,99,28,615, with Re 0.50 adjusting towards face value and Rs 4.50 towards securities premium. The record date is set for November 14, 2025, and the payment period runs from November 25 to December 9, 2025. Trading in partly paid-up shares will be suspended from November 14, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762770886150,
            "Source": "corporate_action"
        },
        {
            "Title": "Infibeam Avenues Schedules Rights Issue Committee Meeting for First and Final Call",
            "Summary": "Infibeam Avenues Limited has scheduled a Rights Issue Committee meeting for November 10, 2025, to consider the first and final call for the rights issue and determine the record date for holders of partly paid-up equity shares. The company will set the record date to identify shareholders who will receive call notices for payment of the first and final call. The trading window for the company's securities remains closed from October 1, 2025, to November 17, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762343224755,
            "Source": "corporate_action"
        },
        {
            "Title": "Infibeam Avenues Receives RBI Initial Approval for Prepaid Payment Tools",
            "Summary": "Infibeam Avenues has received initial approval from the Reserve Bank of India (RBI) for prepaid payment tools under payment regulations. This regulatory approval allows the company to operate prepaid payment instruments in compliance with RBI guidelines.",
            "Sentiment": "positive",
            "PublishDate": 1761644499484,
            "Source": "stock"
        },
        {
            "Title": "Infibeam Avenues' Subsidiary Receives In-Principle Approval as Payment Service Provider in GIFT-IFSC",
            "Summary": "Infibeam Avenues Limited announced that its wholly owned subsidiary, IA Fintech IFSC Private Limited, has received in-principle approval from the International Financial Services Centres Authority (IFSCA) to operate as a Payment Service Provider in GIFT-IFSC. The approval allows IA Fintech to offer three payment services: Escrow Service, Cross Border Money Transfer Service, and Merchant Acquisition Service. The approval was granted through IFSCA's letter dated October 27, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761573895740,
            "Source": "stock"
        },
        {
            "Title": "Infibeam Avenues Launches PayCentral.AI, India's First AI-Powered Payment Platform for Merchants",
            "Summary": "Infibeam Avenues has introduced PayCentral.AI, positioned as India's first payment platform powered by AI agents specifically designed for merchants. The platform incorporates Google's AP2 standards to ensure safe and verifiable transactions.",
            "Sentiment": "positive",
            "PublishDate": 1759897267922,
            "Source": "stock"
        },
        {
            "Title": "Infibeam Avenues Sells Platform Business to Rediff, Increases Stake to 82.66%",
            "Summary": "Infibeam Avenues has completed the sale of its platform business to Rediff. Following this transaction, Infibeam Avenues' shareholding in Rediff has increased to 82.66%.",
            "Sentiment": "positive",
            "PublishDate": 1759241309381,
            "Source": "order&deals"
        },
        {
            "Title": "Infibeam Avenues Reports 72% Revenue Growth, Transfers E-commerce Platform to Rediff for INR800 Crores",
            "Summary": "Infibeam Avenues delivered strong quarterly performance with gross revenue jumping 72% year-on-year to INR1,280 crores and net revenue growing 31% to INR152 crores. The company announced a strategic transfer of its e-commerce platform infrastructure business to Rediff.com for INR800 crores, with half the consideration coming as additional 28% stake in Rediff. This move allows Infibeam to focus on CCAvenue payments and Phronetic.AI while Rediff handles e-commerce enterprise SaaS and productivity platforms. Adjusted EBITDA increased 3% to INR71 crores with impressive margins of 47%, while adjusted PAT surged 70% to INR85 crores. The company provided guidance for revenue of INR5,250-5,500 crores and PAT of INR220-240 crores. International TPV crossed AED 12 billion with expansion in UAE, Saudi Arabia, and Oman markets. Rediff is expected to reach INR300 crores run rate post-integration and target INR1,000 crores within 12 months. The AI arm Phronetic.AI is generating over $1 million annually through video LLM models, reasoning models, and agentic developer platforms.",
            "Sentiment": "positive",
            "PublishDate": 1755069917477,
            "Source": "earnings"
        },
        {
            "Title": "Infibeam Avenues Reports 72% Revenue Growth in Q1 FY26, Approves Platform Business Transfer to Rediff.com for ₹800.39 Crores",
            "Summary": "Infibeam Avenues Limited reported strong quarterly results with consolidated gross revenue of ₹12,802 million, up 72% year-on-year, and adjusted profit after tax of ₹855 million, up 70% compared to the same quarter last year. The company's board approved several key decisions including increasing authorized share capital from ₹350 crores to ₹700 crores and transferring its Platform Business to subsidiary Rediff.com India Limited through a slump sale for ₹800.39 crores (₹400 crores in cash and ₹400.39 crores through fresh equity shares). The board also approved additional investment of up to ₹88 crores in Rediff.com, which will increase Infibeam's shareholding in Rediff.com to not exceeding 83%. The company scheduled its 15th Annual General Meeting for September 29, 2025. For FY26, Infibeam provided guidance of ₹52,500-55,000 million in revenue, ₹5,400-6,000 million in net revenue, ₹3,250-3,500 million in EBITDA, and ₹2,200-2,400 million in PAT. The transactions are subject to shareholder approval and regulatory clearances.",
            "Sentiment": "positive",
            "PublishDate": 1754640387357,
            "Source": "earnings"
        },
        {
            "Title": "Infibeam Avenues Reports Mixed Q1 Results with Revenue Growth and Profit Decline",
            "Summary": "Infibeam Avenues reported Q1 consolidated net profit of 612 million rupees, down from 700 million rupees in the same period last year. Revenue increased significantly to 12 billion rupees compared to 7.53 billion rupees year-over-year. EBITDA rose to 710 million rupees from 691 million rupees, but EBITDA margin compressed to 5.6% from 9.3% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754639824302,
            "Source": "earnings"
        },
        {
            "Title": "Infibeam Avenues: ₹700 Crore Rights Issue Oversubscribed 1.4 Times",
            "Summary": "Infibeam Avenues concluded its ₹700 crore rights issue, oversubscribed 1.4 times. The company allotted 69,99,85,723 partly paid-up equity shares. Funds will be used for AI and digital payments expansion, including Phronetic.AI, RediffPay, and RediffOne development. Strategic acquisitions and data center network expansion are also planned.",
            "Sentiment": "positive",
            "PublishDate": 1752586141000,
            "Source": "corporate_action"
        },
        {
            "Title": "Infibeam Avenues Completes 7 Billion Rupees Rights Issue",
            "Summary": "Infibeam Avenues has successfully completed a rights issue, raising 7 billion rupees. The company issued new shares to existing shareholders, allowing them to purchase additional stock at a potentially discounted price. This corporate action aims to raise capital for the company.",
            "Sentiment": "positive",
            "PublishDate": 1752576448000,
            "Source": "default"
        },
        {
            "Title": "Infibeam Avenues: Shares Surge 15% on Rights Issue Submission to SEBI",
            "Summary": "Infibeam Avenues' stock jumped nearly 15% to Rs 23.39 after submitting the Letter of Offer for its upcoming rights issue to SEBI. The company plans to raise up to Rs 699.98 crore, with the record date set for 26 June 2025. The promoter group has confirmed participation.",
            "Sentiment": "positive",
            "PublishDate": 1750830264000,
            "Source": "corporate_action"
        },
        {
            "Title": "Infibeam Avenues Approves ₹7 Billion Rights Issue",
            "Summary": "Infibeam Avenues' board has approved a rights issue worth ₹7 billion. The company will offer 67 shares for every 267 fully paid-up shares held by existing shareholders. This rights issue is a form of corporate action that allows existing shareholders to purchase additional shares at a discounted price.",
            "Sentiment": "positive",
            "PublishDate": 1750337543000,
            "Source": "default"
        },
        {
            "Title": "Infibeam Avenues Introduces New Products and Expands Services",
            "Summary": "Infibeam Avenues has announced several new initiatives and expansions. The company has introduced an AI-optimized product called Infibeam Quantum Edge. They have also expanded their CCAvenue service in the GCC region. Additionally, Infibeam Avenues has launched two new products: Smart Soundbox and TapPay. The company has also expanded its BillAvenue service into rural India.",
            "Sentiment": "positive",
            "PublishDate": 1748252204000,
            "Source": "default"
        },
        {
            "Title": "Infibeam Avenues: Q4 Revenue Surges 62% YoY, Profit Up 5%",
            "Summary": "Infibeam Avenues reported Q4 revenue of ₹1,160.5 crore, up 62% YoY. Net profit increased 5.15% to ₹49 crore. EBITDA rose 14% to ₹77.7 crore. Net take rate improved to 10.6 bps. The company added 110,000+ merchants in Q4 and expanded internationally.",
            "Sentiment": "positive",
            "PublishDate": 1748249743000,
            "Source": "earnings"
        },
        {
            "Title": "Infibeam Avenues Reports Q4 Results and Approves Disinvestment",
            "Summary": "Infibeam Avenues announced its Q4 financial results and a corporate action. The company's Q4 revenue increased to 11.6 billion rupees from 7.2 billion rupees year-over-year. EBITDA rose to 777 million rupees from 682 million rupees, although the EBITDA margin decreased to 6.7% from 9.5%. Consolidated net profit for Q4 grew to 491 million rupees from 466 million rupees year-over-year. Additionally, the company's board approved the complete disinvestment of its wholly owned subsidiary, Infibeams Logistics Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1748246981000,
            "Source": "result"
        },
        {
            "Title": "Infibeam Avenues to Consider Fund Raising on May 9",
            "Summary": "Infibeam Avenues has announced a board meeting scheduled for May 9 to discuss and potentially approve raising funds for the company. This meeting indicates that the company may be looking to secure additional capital for its operations or expansion plans.",
            "Sentiment": "neutral",
            "PublishDate": 1746541517000,
            "Source": "default"
        },
        {
            "Title": "Infibeam Avenues Partners with IISc for Deepfake Detection System",
            "Summary": "Infibeam Avenues has signed a Memorandum of Understanding (MOU) with the Indian Institute of Science (IISc) to develop real-time deepfake detection systems. This collaboration aims to create technology that can combat scammers and protect government entities, corporations, and other organizations from deepfake-related threats.",
            "Sentiment": "positive",
            "PublishDate": 1742181220000,
            "Source": "corporate_action"
        },
        {
            "Title": "Infibeam Avenues to Divest 49% Stake in Pirimid Technologies",
            "Summary": "Infibeam Avenues has approved the divestment of a 49% stake in Pirimid Technologies. The consideration for this sale will not exceed 270 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1741265430000,
            "Source": "corporate_action"
        },
        {
            "Title": "NPCI Approves Infibeam Avenues' Subsidiary for UPI Participation",
            "Summary": "Infibeam Avenues has announced that the National Payment Corporation of India (NPCI) has granted approval to its subsidiary, Rediff.com India Limited, to participate in the Unified Payments Interface (UPI) as a Third-Party Application Provider. This approval allows Rediff.com to integrate UPI payment services into its platform, potentially expanding its digital payment capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1738919291000,
            "Source": "corporate_action"
        },
        {
            "Title": "Infibeam Avenues Reports Q3 Consolidated Net Profit",
            "Summary": "Infibeam Avenues has announced its financial results for the third quarter. The company reported a consolidated net profit, although the exact figure was not provided in the given news snippet. The report indicates a year-over-year comparison, with the previous year's Q3 net profit being 415 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1738655301000,
            "Source": "earnings"
        },
        {
            "Title": "Infibeam Avenues Launches CCAvenue SoundBox for Offline Payments",
            "Summary": "Infibeam Avenues has introduced CCAvenue SoundBox, a new point-of-sale device for offline payments. This innovative device combines tap-to-pay functionality with dynamic QR codes and soundbox features, offering merchants advanced payment processing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1735689847000,
            "Source": "corporate_action"
        },
        {
            "Title": "Infibeam Avenues Launches CCAvenue SoundBox for Offline Payments",
            "Summary": "Infibeam Avenues has introduced CCAvenue SoundBox, a new point-of-sale (POS) device for offline payments. This innovative device features tap-to-pay functionality, dynamic QR code generation, and audio confirmation for transactions. The SoundBox aims to enhance the offline payment experience for merchants and customers alike.",
            "Sentiment": "positive",
            "PublishDate": 1735652364000,
            "Source": "corporate_action"
        },
        {
            "Title": "CCAvenue Integrates Net Banking Facility with Bassein Catholic Co-op Bank",
            "Summary": "Infibeam Avenues' payment gateway, CCAvenue, has successfully integrated the net banking facility of Bassein Catholic Co-operative Bank. This integration allows CCAvenue users to access the bank's online banking services, potentially expanding payment options for customers and enhancing the reach of CCAvenue's payment solutions.",
            "Sentiment": "positive",
            "PublishDate": 1735020826000,
            "Source": "corporate_action"
        },
        {
            "Title": "Infibeam Avenues Launches CCAvenue SoundBox Max",
            "Summary": "Infibeam Avenues has introduced the CCAvenue SoundBox Max, a versatile payment acceptance device. This all-in-one soundbox is capable of processing various payment methods, including UPI, credit cards, debit cards, and more. The announcement was made during a conference call.",
            "Sentiment": "positive",
            "PublishDate": 1731468615000,
            "Source": "corporate_action"
        },
        {
            "Title": "Infibeam Avenues Raises $20 Million for UAE Payment Subsidiary",
            "Summary": "Infibeam Avenues has successfully raised $20 million for its UAE payment subsidiary. This capital injection is intended to accelerate the company's growth in the UAE market. Following this investment, the post-money valuation of the UAE payment subsidiary stands at $100 million.",
            "Sentiment": "positive",
            "PublishDate": 1731468496000,
            "Source": "corporate_action"
        },
        {
            "Title": "Infibeam Avenues Expects Positive ROI from Recent Investment",
            "Summary": "Infibeam Avenues has announced during a conference call that it anticipates a return on investment (ROI) within 12-18 months from a recent investment. The company also noted that settling faster with merchants contributes to improved overall margins.",
            "Sentiment": "positive",
            "PublishDate": 1731468279000,
            "Source": "corporate_action"
        },
        {
            "Title": "Infibeam Avenues Expects International Segment Growth",
            "Summary": "Infibeam Avenues anticipates its international segment to contribute 12% to 15% of net revenue in the next two years, up from its current single-digit share, as revealed in a recent conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1731468147000,
            "Source": "corporate_action"
        },
        {
            "Title": "Infibeam Avenues Reports Q2 EBITDA Growth",
            "Summary": "Infibeam Avenues reported Q2 EBITDA of 784 million rupees, up from 701 million rupees year-over-year. However, the EBITDA margin decreased to 7.71% from 8.87% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731397808000,
            "Source": "result"
        },
        {
            "Title": "Infibeam Avenues Reports Strong Q2 Revenue Growth",
            "Summary": "Infibeam Avenues, an Indian fintech company, has reported a significant increase in its second-quarter revenue. The company's revenue for Q2 reached 10.2 billion rupees, up from 7.9 billion rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731397796000,
            "Source": "result"
        },
        {
            "Title": "Infibeam Avenues Reports Q2 Profit Growth",
            "Summary": "Infibeam Avenues, an Indian digital payment solutions and enterprise software company, has reported a consolidated net profit of 441 million rupees for the second quarter, up from 412 million rupees in the same period last year. This represents a year-over-year increase in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1731397748000,
            "Source": "result"
        },
        {
            "Title": "Infibeam Avenues Incorporates AI Subsidiary NueroMind Technologies",
            "Summary": "<p><span class='neutral'>Infibeam Avenues</span> has announced the incorporation of a new <b>wholly owned subsidiary</b> called <span class='positive'>NueroMind Technologies</span>. This new entity is associated with the <span class='positive'>artificial intelligence</span> business <span class='neutral'>Phronetic.AI</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728046698000,
            "Source": "corporate_action"
        }
    ]
}