{
    "Symbol": "CCCL",
    "ISIN": "INE429I01024",
    "News": [
        {
            "Title": "CCCL Corrects Investor Name in Preferential Issue",
            "Summary": "Consolidated Construction Consortium Limited corrects investor name to Mark AB Capital Private Limited for its Rs.98.90 crore preferential issue of 4.30 crore equity shares at Rs.23 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1770136357892,
            "Source": "co_actions_results"
        },
        {
            "Title": "Consolidated Construction Q3 Profit Surges to ₹35M",
            "Summary": "Consolidated Construction Consortium reports strong Q3 turnaround with ₹35.00 million net profit versus ₹93.00 million loss last year, while revenue jumps to ₹741.00 million from ₹512.00 million.",
            "Sentiment": "positive",
            "PublishDate": 1769783704691,
            "Source": "co_actions_results"
        },
        {
            "Title": "CCCL Secures Rs 222 Cr Orders in B&F Division",
            "Summary": "Consolidated Construction Consortium Limited announces new orders worth Rs 222 Cr from various clients under Buildings & Factories division during January 2026, covering 18.12 lakhs sq feet construction.",
            "Sentiment": "positive",
            "PublishDate": 1769596222223,
            "Source": "co_actions_results"
        },
        {
            "Title": "CCCL Board to Consider Fund Raising via Equity Issue",
            "Summary": "Consolidated Construction Consortium Limited announces board meeting to consider raising funds through equity shares or convertible instruments via preferential allotment or private placement.",
            "Sentiment": "neutral",
            "PublishDate": 1769520832356,
            "Source": "co_actions_results"
        },
        {
            "Title": "NCCCL Wins ₹112.5 Cr Lodha Contract for Alibaug Project",
            "Summary": "New Consolidated Construction Company secured a ₹112.50 crore contract from Lodha Developers for Tower 1 construction at Alibaug residential development. Project spans 7.26 lakh sq ft with 24-month execution timeline.",
            "Sentiment": "positive",
            "PublishDate": 1767700111344,
            "Source": "co_actions_results"
        },
        {
            "Title": "NCCCL Wins ₹112.5 Cr Lodha Mandwa Project Contract",
            "Summary": "Consolidated Construction gets major residential tower contract for Lodha's 200+ acre Mandwa development in Alibaug. Construction timeline set for 24 months starting mid-January 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767588693381,
            "Source": "co_actions_results"
        },
        {
            "Title": "CCCL Secures New Orders Worth ₹458 Crores",
            "Summary": "Consolidated Construction Consortium Limited announces major order wins totaling ₹458 crores, including ₹432 crores from Kerala Government for iconic commercial building in Trivandrum and ₹26 crores under Buildings and Factories Division.",
            "Sentiment": "positive",
            "PublishDate": 1765536771027,
            "Source": "co_actions_results"
        },
        {
            "Title": "Consolidated Construction Consortium Secures Rs 276 Crore Orders Across Multiple States",
            "Summary": "Consolidated Construction Consortium Limited secured orders worth Rs 276.48 crore from various clients for construction of buildings and factories totaling 23.88 lakh square feet, spanning projects in Kerala, Andhra Pradesh, Tamil Nadu, Odisha, and Karnataka from September 12 to November 24, 2025. The company's order backlog now stands at Rs 853 crore, with execution scheduled before Financial Year 2026-27.",
            "Sentiment": "positive",
            "PublishDate": 1763968767535,
            "Source": "order&deals"
        },
        {
            "Title": "Consolidated Construction Consortium Gets New Credit Rating from Infomerics After CARE EDGE Withdrawal",
            "Summary": "Infomerics Valuation and Rating assigned IVR BB/Stable rating to Consolidated Construction Consortium's Rs. 150 crore bank facilities, while the company withdrew from CARE EDGE rating due to settlement considerations. The rating reflects the company's experienced promoters and satisfactory order book of Rs. 611.15 crores, but remains constrained by operational losses and moderate scale of operations.",
            "Sentiment": "neutral",
            "PublishDate": 1763538287248,
            "Source": "corporate_action"
        },
        {
            "Title": "Consolidated Construction Consortium Reports Rs 4,878 Crore Profit in Q2 FY26 Following Subsidiary Sale",
            "Summary": "Consolidated Construction Consortium Limited reported a profit of Rs 4,878.65 crore for the quarter ended September 30, 2025, driven by an exceptional gain of Rs 9,578.35 crore from the sale of its wholly-owned subsidiary CCCL Infrastructure Limited to DPF Textiles Pvt Ltd for Rs 22,500 crore. The company's revenue from operations was Rs 5,544.27 crore for the quarter. The subsidiary sale was completed with control transferred on May 31, 2025, and shares formally transferred on October 14, 2025. The company operates in construction and infrastructure services with work on hand valued at Rs 51,658.47 crore as of September 30, 2025. The auditors issued a qualified review report citing concerns about unconfirmed balances and identification of micro and small enterprises.",
            "Sentiment": "positive",
            "PublishDate": 1761652436688,
            "Source": "earnings"
        },
        {
            "Title": "Consolidated Construction Secures 18.03 Billion Rupees in New Orders from B&F Division",
            "Summary": "Consolidated Construction has received orders worth 18.03 billion rupees from its B&F Division. The company announced this significant order intake, which represents new business for the construction firm.",
            "Sentiment": "positive",
            "PublishDate": 1758107892597,
            "Source": "order&deals"
        },
        {
            "Title": "Consolidated Construction Secures Orders Worth 1.80 Billion Rupees",
            "Summary": "Consolidated Construction has secured new orders valued at 1.80 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1757895084081,
            "Source": "order&deals"
        },
        {
            "Title": "Consolidated Construction Consortium Secures Rs 180 Crore Orders in Buildings & Factories Division",
            "Summary": "Consolidated Construction Consortium Limited (CCCL) announced new orders worth Rs 180 crore from various clients under its Buildings & Factories division. The orders include a commercial building in Kochi, Kerala (Rs 76 crore), industrial buildings in Tamil Nadu (Rs 29 crore), institutional buildings in Bengaluru, Karnataka (Rs 56 crore), car parking maintenance in Delhi (Rs 9 crore), and a hotel building in Mysuru, Karnataka (Rs 10 crore). The projects involve construction of buildings and factories covering 13.50 lakh square feet and are BOQ-based item rate contracts at various sites across India, to be executed during Financial Year 2025-26. The company's order backlog stands at Rs 652 crore. CCCL has executed over 950 projects across 21 states with an aggregate built-up area of over 130 million square feet.",
            "Sentiment": "positive",
            "PublishDate": 1757590972469,
            "Source": "order&deals"
        },
        {
            "Title": "Consolidated Construction Consortium Reports Strong Quarterly Results with Major Subsidiary Sale",
            "Summary": "Consolidated Construction Consortium Ltd announced its unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs 5,130.72 lakhs, up from Rs 2,736.85 lakhs in the same quarter last year. Standalone profit for the period reached Rs 9,882.83 lakhs compared to Rs 22.75 lakhs in the previous year quarter. The company completed a significant transaction during the quarter, selling its entire holding in wholly-owned subsidiary CCCL Infrastructure Limited to DPF Textiles Pvt Ltd for Rs 22,500 lakhs. This divestment resulted in an exceptional gain of Rs 14,405.35 lakhs. The company also implemented a revised Insider Trading Policy. Work on hand for execution stands at Rs 31,086.97 lakhs as of June 30, 2025. The auditors issued a qualified review report citing concerns about pending confirmations from ICICI Bank regarding a settlement plan and unconfirmed balances with various parties.",
            "Sentiment": "positive",
            "PublishDate": 1753711988526,
            "Source": "earnings"
        },
        {
            "Title": "Consolidated Construction Consortium Reports Strong Q1 Turnaround with 625M Rupees Net Profit",
            "Summary": "Consolidated Construction Consortium achieved a net profit of 625 million rupees in Q1, marking a significant turnaround from a loss of 26 million rupees in the same period last year. The company's revenue increased substantially to 513 million rupees compared to 282 million rupees year-over-year. The results included an exceptional item worth 789 million rupees. The company's loss before tax (LBT) improved to 165 million rupees from a loss of 26 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753711558511,
            "Source": "earnings"
        },
        {
            "Title": "Consolidated Construction Consortium Secures ₹200.13 Crore Orders",
            "Summary": "Consolidated Construction Consortium has obtained orders worth ₹200.13 crore under its Buildings & Factories vertical for the fiscal year 2025-26. The company has not provided any additional details about the nature of the projects or the clients involved.",
            "Sentiment": "positive",
            "PublishDate": 1752192406000,
            "Source": "default"
        },
        {
            "Title": "Consolidated Construction Consortium Secures ₹200.13 Crore Contracts",
            "Summary": "Consolidated Construction Consortium has won contracts worth ₹200.13 crore for buildings and factories projects. The contracts are slated for execution in the fiscal year 2025-26.",
            "Sentiment": "positive",
            "PublishDate": 1752149608000,
            "Source": "default"
        },
        {
            "Title": "CCCL Approves Sale of Subsidiary",
            "Summary": "Consolidated Construction Consortium Limited (CCCL) has approved the sale of its subsidiary, CCCL Infrastructure.",
            "Sentiment": "neutral",
            "PublishDate": 1746626708000,
            "Source": "default"
        },
        {
            "Title": "CCCL's Buildings & Factories Vertical Secures Orders Worth Rs 215 Crore",
            "Summary": "Consolidated Construction Consortium Limited (CCCL) has announced that its Buildings & Factories Vertical has secured orders totaling Rs 215 crore. The orders are divided into two parts: Rs 115 crore to be completed by January 31, 2025, and Rs 100 crore to be completed by February 28, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1741651578000,
            "Source": "order&deals"
        },
        {
            "Title": "COS Buildings & Factories Vertical Secures Orders Worth Rs 215 Crore",
            "Summary": "The Buildings & Factories vertical of COS (likely referring to Capacit'e Infraprojects Limited) has secured orders totaling Rs 215 crore. This includes orders worth Rs 115 crore until January 31, 2025, and an additional Rs 100 crore until February 28, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1741602470000,
            "Source": "order&deals"
        },
        {
            "Title": "Consolidated Construction Consortium: Raising ₹50 Crore Through Preferential Share Issue",
            "Summary": "Consolidated Construction Consortium plans to raise ₹50 crore by issuing 2.85 crore equity shares at ₹17.50 each through a preferential issue. The move aims to strengthen the company's balance sheet and improve financial flexibility. Systematic Conscom, a construction solutions company, is among the new marquee shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1740571525000,
            "Source": "corporate_action"
        },
        {
            "Title": "Consolidated Construction Consortium to Issue Equity Shares Worth 500 Million Rupees",
            "Summary": "Consolidated Construction Consortium has announced plans to issue equity shares on a preferential basis. The total value of the shares to be issued is 500 million rupees, with each share priced at 17.50 rupees.",
            "Sentiment": "positive",
            "PublishDate": 1740478009000,
            "Source": "corporate_action"
        },
        {
            "Title": "Consolidated Construction Consortium Ltd: Plans ₹50 Crore Equity Raise for Turnaround",
            "Summary": "CCCL to issue 2.86 crore equity shares at ₹17.50 each, aiming to raise ₹50 crore through preferential allotment. The company seeks to attract investors like Systematic Conscom Ltd. CCCL reported a profit of ₹40 crore for the first nine months of the current fiscal year and is now debt-free after settling dues with lenders.",
            "Sentiment": "positive",
            "PublishDate": 1740399676000,
            "Source": "corporate_action"
        },
        {
            "Title": "Consolidated Construction Consortium Reports Mixed Q3 Financial Results",
            "Summary": "Consolidated Construction Consortium has reported a consolidated net loss of 118 million rupees for the third quarter, compared to a loss of 6.1 billion rupees in the same period last year. This represents a significant reduction in losses. However, it's a decline from the previous quarter's profit of 461 million rupees. The company's revenue increased to 522 million rupees from 436 million rupees year-over-year, showing some improvement in business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1738109791000,
            "Source": "earnings"
        },
        {
            "Title": "Consolidated Construction Consortium Reports Q3 Financial Results",
            "Summary": "Consolidated Construction Consortium Limited has reported its Q3 financial results. The company's consolidated net loss narrowed to 118 million rupees, compared to a loss of 6.1 billion rupees in the same quarter last year. However, this represents a decline from the previous quarter's profit of 461 million rupees. The company's revenue for Q3 increased to 522 million rupees, up from 436 million rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738076259000,
            "Source": "earnings"
        }
    ]
}