{
    "Symbol": "CCHHL",
    "ISIN": "INE652F01027",
    "News": [
        {
            "Title": "Country Club Hospitality Holidays Reports Quarterly Financial Results for September 2025",
            "Summary": "Country Club Hospitality Holidays Limited announced its unaudited standalone and consolidated financial results for the quarter ended September 30, 2025, approved by the Board of Directors at their meeting held on November 14, 2025. The company recognized revenue from the sale of flats pertaining to its real estate project Osadia Realty, with financial results presented separately under Real Estate segment reporting, distinct from hospitality operations.",
            "Sentiment": "neutral",
            "PublishDate": 1763173390395,
            "Source": "earnings"
        },
        {
            "Title": "Country Club Hospitality Plans USD 100 Million Fundraise for Premium Leisure Properties",
            "Summary": "Country Club Hospitality and Holidays Ltd (CCHHL) plans to raise USD 100 million through GDR or FCCB to establish premium leisure properties across India. Chairman and Managing Director Y Rajeev Reddy stated the funds will be used for setting up clubs and resorts at various locations. The Hyderabad-headquartered company has become debt-free after repaying Rs 600 crore in the first quarter. CCHHL currently operates 30 properties directly and manages another 30 through franchises. The company has also expanded into real estate projects in residential and commercial segments, with upcoming projects planned in Mumbai, Delhi, Bengaluru, Hyderabad and Chennai.",
            "Sentiment": "positive",
            "PublishDate": 1758525048683,
            "Source": "stock"
        },
        {
            "Title": "Country Club Hospitality & Holidays Reports Quarterly Profit of ₹16.09 Lakhs",
            "Summary": "Country Club Hospitality & Holidays Limited reported quarterly results for the quarter ended June 30, 2025. The company posted a standalone net profit of ₹16.09 lakhs compared to a loss of ₹39.94 lakhs in the same quarter last year. Revenue from operations increased to ₹2,402.58 lakhs from ₹1,226.55 lakhs year-over-year. On a consolidated basis, net profit was ₹25.83 lakhs versus a loss of ₹30.19 lakhs in the previous year quarter. The company recognized revenue from the sale of flats pertaining to its real estate project 'Osadia Realty' during the quarter. Trade payables of ₹98.45 lakhs were written off and recognized as income under Other Income. The company operates in two segments: Hotel & Membership and Real Estate, with the Real Estate segment contributing ₹1,426.53 lakhs in revenue during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1755183950378,
            "Source": "earnings"
        }
    ]
}