{
    "Symbol": "CCL",
    "ISIN": "INE421D01022",
    "News": [
        {
            "Title": "CCL Products Declares ₹2.75 Interim Dividend",
            "Summary": "CCL Products (India) announces interim dividend of ₹2.75 per share for shareholders, reflecting the company's commitment to returning value to investors through regular dividend distributions.",
            "Sentiment": "positive",
            "PublishDate": 1770215463459,
            "Source": "co_actions_results"
        },
        {
            "Title": "CCL Products Q3 Net Profit Surges 58.7% to ₹1B",
            "Summary": "CCL Products India reported strong Q3 performance with consolidated net profit rising 58.7% YoY to ₹1 billion and revenue growing 40% to ₹10.5 billion, demonstrating robust operational growth.",
            "Sentiment": "positive",
            "PublishDate": 1770215392445,
            "Source": "co_actions_results"
        },
        {
            "Title": "CCL Products Board Meet on Feb 4 for Q3 Results",
            "Summary": "CCL Products India Limited has scheduled a board meeting on February 4, 2026, to approve Q3FY26 financial results and consider interim dividend declaration for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1769006015857,
            "Source": "co_actions_results"
        },
        {
            "Title": "CCL Products Board Approves CHF 20 Million Guarantee",
            "Summary": "CCL Products (India) Limited board approves corporate guarantee of CHF 20 Million for subsidiary Continental Coffee SA, Switzerland's credit facilities with JP Morgan Chase Bank, London Branch.",
            "Sentiment": "neutral",
            "PublishDate": 1768206384591,
            "Source": "co_actions_results"
        },
        {
            "Title": "CCL Products Board Approves CHF 20 Million Guarantee",
            "Summary": "CCL Products (India) Limited board approved corporate guarantee of CHF 20 million for JP Morgan Chase Bank credit facilities to be availed by its wholly owned subsidiary Continental Coffee SA, Switzerland.",
            "Sentiment": "neutral",
            "PublishDate": 1768205826350,
            "Source": "co_actions_results"
        },
        {
            "Title": "CCL Products Board Approves ₹2 Billion Bank Guarantee",
            "Summary": "CCL Products (India) board has approved a ₹2 billion guarantee to JP Morgan Chase Bank for its Swiss subsidiary Continental Coffee SA, marking a significant financial commitment for the coffee company.",
            "Sentiment": "neutral",
            "PublishDate": 1768205570132,
            "Source": "stocks"
        },
        {
            "Title": "CCL Products Appoints Srinivas Atla as Chief Human Resources Officer",
            "Summary": "CCL Products (India) Limited has appointed Mr. Srinivas Atla as Chief Human Resources Officer effective November 13, 2025, following approval from the Board of Directors and Nomination Remuneration Committee. Atla brings 28 years of HR experience including his previous role as Chief Human Resources Officer at Titagarh Rail Systems Limited, with expertise in talent acquisition, employee engagement, and HR strategy.",
            "Sentiment": "positive",
            "PublishDate": 1763054239844,
            "Source": "corporate_governance"
        },
        {
            "Title": "CCL Products Reports 52.7% Revenue Growth in Q2 FY26 Earnings Call",
            "Summary": "CCL Products (India) Limited held its Q2 FY26 earnings conference call on November 6, 2025. The company achieved revenue of INR 1,128.21 crores in Q2 versus INR 738.74 crores in the corresponding quarter last year, marking 52.7% growth. EBITDA grew 44.3% to INR 198.61 crores, while net profit increased 36.4% to INR 100.86 crores. For the first half, revenue reached INR 2,186.25 crores (44.5% growth) with EBITDA of INR 360.05 crores (33.7% growth). The domestic market showed strong momentum with gross sales of INR 160 crores in Q2 and INR 310 crores in H1, of which INR 210 crores was branded business. Volume growth was over 20% for the quarter. Green coffee prices remain volatile due to conflicting reports about Vietnam crop conditions. The company maintains its debt reduction guidance of INR 1,350 crores by December and INR 1,200 crores by March. Management discussed expansion plans to become an FMCG company, with new product launches in iced tea and snacks categories.",
            "Sentiment": "positive",
            "PublishDate": 1762766721520,
            "Source": "earnings"
        },
        {
            "Title": "CCL Products India Sets 10-20% Volume Growth Guidance, Plans Retail Expansion",
            "Summary": "CCL Products India has set volume growth guidance between 10-20%, with first half growth estimated at 15%. The company expects EBITDA growth of 15-20% and aims for the higher end of this range. CCL Products plans to double its retail outlets from 150,000 over the next three years. The company anticipates tax rates averaging about 17%. Management forecasts debt levels to reach INR 1,350 crores by December and INR 1,200 crores by March.",
            "Sentiment": "positive",
            "PublishDate": 1762485167748,
            "Source": "stock"
        },
        {
            "Title": "CCL Products Reports Strong Q2 Performance with 172% Jump in Standalone Net Profit",
            "Summary": "CCL Products (India) Limited reported standalone net profit of Rs. 112.26 crores for Q2 ended September 30, 2025, representing a 306% increase from Rs. 27.62 crores in the same quarter last year. Revenue from operations grew 28% to Rs. 559.18 crores compared to Rs. 436.90 crores in Q2 2024. For the half-year period, standalone net profit reached Rs. 143.63 crores, up 172% from Rs. 52.77 crores in the previous year, while revenue increased 26% to Rs. 1,093.99 crores. On a consolidated basis, Q2 net profit was Rs. 100.87 crores versus Rs. 73.95 crores last year, with revenue rising 53% to Rs. 1,126.73 crores. The company's board also approved a modified acquisition plan for 26% stake in Mukkonda Renewables Private Limited for Rs. 12.12 crores, to be jointly acquired by CCL Products (20.54%) and its subsidiary CCL Food and Beverages (5.46%) for renewable energy consumption of 10 MWs.",
            "Sentiment": "positive",
            "PublishDate": 1762361328986,
            "Source": "earnings"
        },
        {
            "Title": "CCL Products Acquires 26% Stake in Mukkonda Renewables for Rs. 9.57 Crores",
            "Summary": "CCL Products (India) Limited has entered into an agreement to acquire a 26% equity stake in Mukkonda Renewables Private Limited for Rs. 9.57 crores. Mukkonda Renewables is a subsidiary of Ecoren Energy India Private Limited, incorporated on July 18, 2025, and operates in power generation through non-conventional energy sources. The acquisition will provide CCL access to approximately 7.9 MW of renewable wind and solar energy on a captive consumption basis. The investment aims to reduce electricity costs, ensure reliable green power supply, and align with regulatory requirements under Indian Electricity Laws and government renewable energy policy. The investment will be completed in three stages: 30% within 10 days of executing key agreements, 40% upon placing orders for major equipment, and 30% upon receipt of major equipment. Following completion, Mukkonda Renewables will become an associate of CCL Products.",
            "Sentiment": "positive",
            "PublishDate": 1755615120578,
            "Source": "order&deals"
        },
        {
            "Title": "CCL Products Reports 37% Revenue Growth to INR 1,058 Crores in Q1, Achieves First INR 1,000+ Crore Quarter",
            "Summary": "CCL Products (India) Limited reported quarterly revenue of INR 1,058 crores compared to INR 774.6 crores in the previous year, marking 37% growth and the company's first quarter exceeding INR 1,000 crores. EBITDA grew 23% to INR 161.43 crores from INR 131.62 crores, while net profit increased marginally by 1% to INR 72.45 crores. The domestic branded business reached INR 150 crores, with INR 100 crores from retail operations. Green coffee prices have softened 20-30% in recent months, though market volatility continues. The company maintains volume growth guidance of 10-20% and EBITDA growth of 15-20%. Net debt stands at INR 1,671 crores, down from INR 1,812 crores in March, with plans to reduce it to INR 1,350 crores by December. Capacity utilization is at approximately 60% across facilities. Management noted increased inquiries from US customers due to tariff changes affecting Brazil.",
            "Sentiment": "positive",
            "PublishDate": 1754986621011,
            "Source": "earnings"
        },
        {
            "Title": "CCL Products Reports 25% Jump in Standalone Revenue to Rs 534.8 Crore in Q1",
            "Summary": "CCL Products (India) Limited reported standalone revenue from operations of Rs 534.8 crore for the quarter ended June 30, 2025, marking a 24% increase from Rs 431.6 crore in the same quarter last year. Net profit rose to Rs 31.4 crore compared to Rs 25.1 crore in the previous year quarter. On a consolidated basis, revenue reached Rs 1,055.6 crore, up from Rs 773.3 crore year-on-year, while consolidated net profit grew to Rs 72.4 crore from Rs 71.5 crore. The company's basic earnings per share improved to Rs 2.36 on standalone basis and Rs 5.45 on consolidated basis. The consolidated results include five subsidiaries: CCL Food and Beverages Private Limited, Continental Coffee Private Limited, Ngon Coffee Company Limited (Vietnam), Continental Coffee SA (Switzerland), and Jayanti Pte Limited (Singapore).",
            "Sentiment": "positive",
            "PublishDate": 1754400459084,
            "Source": "earnings"
        },
        {
            "Title": "CCL Products Targets ₹5,000 Crores Revenue by FY30",
            "Summary": "CCL Products has set a revenue target of ₹5,000 crores by FY30. The company plans to achieve this goal through multiple strategic initiatives including increased production capacity, expanding B2C brand portfolio, developing premium product offerings, and pursuing global expansion across India, Vietnam, and Ethiopia.",
            "Sentiment": "positive",
            "PublishDate": 1753287507356,
            "Source": "stock"
        },
        {
            "Title": "CCL Products Board Approves Rs. 5 Final Dividend, Re-appoints Executive Chairman for 5 Years",
            "Summary": "CCL Products (India) Limited's Board of Directors approved a final dividend of Rs. 5 per equity share with a record date of August 7, 2025. The company scheduled its 64th Annual General Meeting for August 14, 2025, to be held through video conference. The Board recommended the re-appointment of Challa Rajendra Prasad as Executive Chairman for a 5-year term starting April 1, 2026, subject to shareholder approval. Prasad has nearly 4 decades of industrial experience and over 35 years in the international soluble coffee industry, having promoted CCL Products in 1995. The Board also recommended M/s. P S Rao & Associates as Secretarial Auditor for a five-year term. Both appointments require shareholder approval at the upcoming AGM.",
            "Sentiment": "positive",
            "PublishDate": 1753100640179,
            "Source": "corporate_action"
        },
        {
            "Title": "CCL Products: Targets 15-20% Revenue CAGR with Cost-Plus Model",
            "Summary": "CCL Products (India) Ltd. aims for 15-20% revenue CAGR, leveraging its cost-plus business model. The company remains insulated from coffee price volatility, working on fixed margins. Coffee prices are expected to normalize in the next 1-2 years, with potential price drops in about six months. CCL advises customers against long-term commitments due to expected price changes.",
            "Sentiment": "positive",
            "PublishDate": 1750813963000,
            "Source": "normal_news"
        },
        {
            "Title": "CCL Products: Indian Coffee Exports Grow 125% in 11 Years",
            "Summary": "Indian coffee exports have increased significantly over the past 11 years, rising by 125% to reach USD 1.8 billion. This growth in the coffee export sector highlights India's expanding presence in the global coffee market.",
            "Sentiment": "positive",
            "PublishDate": 1750649285000,
            "Source": "default"
        },
        {
            "Title": "CCL Products Launches South Indian Snacks Brand 'Malgudi'",
            "Summary": "CCL Products (India) has introduced a new line of South Indian snacks under the brand name 'Malgudi'. This move represents a diversification of the company's product offerings into the food sector.",
            "Sentiment": "positive",
            "PublishDate": 1750340142000,
            "Source": "default"
        },
        {
            "Title": "CCL Products: Shares Poised for 14% Upside Following Channel Breakout",
            "Summary": "CCL Products' stock has broken out of its weekly channel pattern around ₹740, signaling a potential upside to ₹960. The stock closed 10.8% higher at ₹839.8 on Tuesday, with a 36% rise in the last month. Analysts suggest considering fresh long positions with a stop-loss below ₹770.",
            "Sentiment": "positive",
            "PublishDate": 1747790561000,
            "Source": "normal_news"
        },
        {
            "Title": "CCL Products: Strong Q4 and FY25 Performance Driven by Favorable Mix",
            "Summary": "CCL Products reported robust FY25 results with 17% YoY consolidated revenue growth. Ebitda and PAT increased by 25% and 24% respectively, attributed to favorable volume mix, higher value-added contracts, and strategic execution across geographies.",
            "Sentiment": "positive",
            "PublishDate": 1746795382000,
            "Source": "earnings"
        },
        {
            "Title": "CCL Products (India): Q4 Results Spark 30% Stock Surge and Analyst Upgrades",
            "Summary": "CCL Products (India) stock jumped 30% in two sessions after strong Q4FY25 results. Q4 revenue grew 15% YoY to ₹836 crore, with PAT up 57% YoY to ₹102 crore. Analysts raised target prices, citing potential for double-digit volume growth due to Vietnam operations ramp-up and increasing specialty coffee sales.",
            "Sentiment": "positive",
            "PublishDate": 1746680962000,
            "Source": "earnings"
        },
        {
            "Title": "CCL Products (India): Q4 Profit Surges 57%, Stock Soars 16%",
            "Summary": "CCL Products reported a 57% YoY increase in Q4FY25 net profit to ₹102 crore. Revenue grew to ₹836 crore, up from ₹727 crore in Q4FY24. EBITDA rose 38% YoY to ₹163 crore with margins expanding 400 bps. The company's Vietnam facility is operating at 40-50% capacity. A final dividend of ₹5 per share was recommended.",
            "Sentiment": "positive",
            "PublishDate": 1746505116000,
            "Source": "earnings"
        },
        {
            "Title": "CCL Products Reports Strong Q4 Results, Announces Dividend and Green Energy Initiative",
            "Summary": "CCL Products (India) reported a Q4 consolidated net profit of 1 billion rupees, up from 652 million rupees year-over-year. Revenue increased to 8.4 billion rupees from 7.3 billion rupees. The company recommended a final dividend of 5 rupees per equity share. CCL completed the expansion of its Vietnam subsidiary and approved a new green energy initiative, investing up to 15 crore rupees in an SPV for hybrid power procurement.",
            "Sentiment": "positive",
            "PublishDate": 1746490248000,
            "Source": "default"
        },
        {
            "Title": "CCL Products Expands Vietnam Subsidiary and Invests in Green Energy",
            "Summary": "CCL Products (India) has completed the expansion of its wholly owned subsidiary, Ngon Coffee Company Ltd, in Vietnam. Additionally, the company's board has approved a new green energy initiative, which involves investing up to ₹15 crore in a Special Purpose Vehicle (SPV) to procure hybrid power under the group captive model.",
            "Sentiment": "positive",
            "PublishDate": 1746458758000,
            "Source": "default"
        },
        {
            "Title": "CCL Products (India): Q4 Profit Surges 56%, Rs 5 Dividend Declared",
            "Summary": "CCL Products (India) Ltd. reported a 56% increase in Q4 FY25 consolidated net profit to Rs 101.86 crore, surpassing analyst estimates. Revenue rose 15% to Rs 835.84 crore. The company announced a final dividend of Rs 5 per share, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1746449276000,
            "Source": "earnings"
        },
        {
            "Title": "CCL Products (India) Reports Strong Q4 Results and Declares Dividend",
            "Summary": "CCL Products (India) has announced its Q4 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 1 billion rupees from 652 million rupees in the previous year. Revenue rose to 8.4 billion rupees from 7.3 billion rupees. EBITDA improved to 1.6 billion rupees with a margin of 19.53%, up from 1.2 billion rupees and 16.26% margin in the previous year. Additionally, the company has recommended a final dividend of 5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746446620000,
            "Source": "result"
        },
        {
            "Title": "CCL Products to Consider Q4 Results on May 5",
            "Summary": "CCL Products has announced that it will consider its fourth quarter (Q4) financial results on May 5. This indicates the company is preparing to release its earnings report for the latest fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1745594644000,
            "Source": "default"
        },
        {
            "Title": "CCL Products: Systematix Maintains 'Buy' Rating, Lowers Target Price",
            "Summary": "CCL Products maintains 15% long-term volume growth guidance but is cautious with 10-20% near-term outlook. The company doesn't anticipate price drops despite new coffee crop influx in India and Vietnam markets. Brazil's crop is reported to be good, potentially affecting prices.",
            "Sentiment": "neutral",
            "PublishDate": 1738849240000,
            "Source": "result"
        },
        {
            "Title": "CCL Products (India) Reports Q3 EBITDA Growth",
            "Summary": "CCL Products (India) has announced its Q3 financial results. The company's EBITDA increased to 1.24 billion rupees from 1.11 billion rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 16.41% from 16.69% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738756216000,
            "Source": "earnings"
        },
        {
            "Title": "CCL Products (India) Reports Q3 Financial Results",
            "Summary": "CCL Products (India) has announced its Q3 financial results. The company's consolidated net profit remained relatively stable at 630 million rupees compared to 633 million rupees in the same quarter last year. Revenue showed growth, increasing to 7.58 billion rupees from 6.64 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738756210000,
            "Source": "earnings"
        },
        {
            "Title": "CCL Products to Consider Q3 Results",
            "Summary": "CCL Products has announced that it will consider its third quarter (Q3) financial results on February 5. This indicates the company is preparing to release its earnings report for the latest fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738072892000,
            "Source": "earnings"
        },
        {
            "Title": "CCL Products (India) Ltd.: CEO Explains Strategy to Manage High Coffee Prices",
            "Summary": "CCL Products' CEO Praveen Jaipuriar states that rising coffee prices will impact topline but not Ebitda per kilo. The company uses a cost-plus model, passing through price increases to clients. Ebitda growth will mirror volume growth, and the company maintains a Rs 110 per kilo price for the next two years.",
            "Sentiment": "neutral",
            "PublishDate": 1734151783000,
            "Source": "normal_news"
        },
        {
            "Title": "CCL Products: Coffee Giant's Stock Soars 126% in 2.5 Years",
            "Summary": "CCL Products' stock has surged 126.3% since May 2022, reaching ₹713. Q2 FY25 saw 22% YoY revenue growth to ₹738 crore, with 10% volume increase. EBITDA grew 24.7% YoY to ₹137 crore. The company maintains 10-20% volume growth guidance for FY25 despite coffee price headwinds. Expansion plans include doubling capacity to 77,000 MT by FY25.",
            "Sentiment": "positive",
            "PublishDate": 1731389919000,
            "Source": "result"
        },
        {
            "Title": "CCL Products: Targets 22% Growth Despite Coffee Price Challenges",
            "Summary": "CCL Products India Ltd. aims for 22% revenue and profit growth in FY25. Q2 saw 21.5% YoY revenue increase to Rs 738 crore. CEO expects Rs 3,200-3,300 crore topline for the full year. Long-term contracts may revive post-December with market stability. Company faces volume growth challenges but maintains positive outlook.",
            "Sentiment": "positive",
            "PublishDate": 1730955560000,
            "Source": "normal_news"
        },
        {
            "Title": "CCL Products: Robust Q2 Performance Amid High Coffee Prices",
            "Summary": "CCL Products reported strong Q2 results despite elevated coffee prices, according to an IDBI Capital review.",
            "Sentiment": "positive",
            "PublishDate": 1730952115000,
            "Source": "result"
        },
        {
            "Title": "CCL Products (India) Reports Q2 EBITDA Growth",
            "Summary": "CCL Products (India) has announced its Q2 financial results. The company's EBITDA increased to 1.37 billion rupees, up from 1.1 billion rupees in the same quarter last year. The EBITDA margin also improved, rising to 18.57% from 18.09% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730823006000,
            "Source": "result"
        },
        {
            "Title": "CCL Products (India) Reports Q2 Revenue Growth",
            "Summary": "CCL Products (India) has reported a revenue of 7.38 billion rupees for the second quarter, compared to 6.07 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730822996000,
            "Source": "result"
        },
        {
            "Title": "CCL Products (India) Reports Q2 Profit Growth",
            "Summary": "CCL Products (India) has announced its Q2 consolidated net profit of 739.5 million rupees, showing an increase from 608.6 million rupees year-over-year and 714.7 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730822983000,
            "Source": "result"
        }
    ]
}