{
    "Symbol": "CDSL",
    "ISIN": "INE736A01011",
    "News": [
        {
            "Title": "CDSL Ventures KYC records cross 10 crore milestone",
            "Summary": "CDSL Ventures Limited, India's first KYC Registration Agency, achieves significant milestone of 10 crore KYC records, reflecting growing digital adoption and retail investor participation in financial markets.",
            "Sentiment": "positive",
            "PublishDate": 1767943842351,
            "Source": "stocks"
        },
        {
            "Title": "Central Depository Services Sees Rs. 16.84 Crore Block Trade on NSE",
            "Summary": "Central Depository Services (India) Ltd. recorded a block trade worth Rs. 16.84 crores on the National Stock Exchange. The transaction involved approximately 102,027 shares at a price of Rs. 1,650.60 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1762932002286,
            "Source": "order&deals"
        },
        {
            "Title": "CDSL Reports 13.6% Decline in Net Profit Despite Strong Sequential Growth; Nuvama Raises Target Price",
            "Summary": "Central Depository Services (India) Limited reported a net profit of Rs 140.21 crore for the quarter ended September 2025, representing a 13.6% year-on-year decline from Rs 162.02 crore in the same quarter last year. Revenue from operations dropped marginally by 1% to Rs 318.89 crore compared to Rs 322.26 crore in the previous year. However, the company showed strong sequential performance with net profit surging 37% quarter-on-quarter from Rs 102.37 crore. Total expenses increased to Rs 157.41 crore from Rs 134.41 crore year-on-year. The company achieved an EBIT margin of 50.7%, down 765 basis points year-on-year but up 612 basis points quarter-on-quarter. Following the results, Nuvama maintained its Buy rating and raised the target price to Rs 1,840 from Rs 1,780, citing robust sequential growth driven by a 195.2% quarter-on-quarter surge in IPO and corporate action charges and a 48.4% rise in online data charges. The brokerage valued the stock at a P/E multiple of 61.2x for FY27 and 50.8x for FY28.",
            "Sentiment": "neutral",
            "PublishDate": 1762139869501,
            "Source": "earnings"
        },
        {
            "Title": "CDSL Reports Decline in Q2 Revenue and EBITDA Compared to Previous Year",
            "Summary": "CDSL reported Q2 revenue of Rs 3.18 billion compared to Rs 3.22 billion in the same period last year. The company's Q2 EBITDA decreased to Rs 1.76 billion from Rs 2 billion year-over-year. EBITDA margin contracted to 55.29% from 62.18% in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1761984478679,
            "Source": "earnings"
        },
        {
            "Title": "CDSL Reports 13.6% Decline in Quarterly Consolidated Net Profit",
            "Summary": "CDSL's consolidated net profit decreased to Rs 1.4 billion in Q2 compared to Rs 1.62 billion in the same quarter of the previous year, representing a year-over-year decline of approximately 13.6%.",
            "Sentiment": "negative",
            "PublishDate": 1761984134321,
            "Source": "earnings"
        },
        {
            "Title": "CDSL Faces Legal Action from Samir Shah Over Compensation Claims",
            "Summary": "Samir Shah has initiated legal proceedings against CDSL regarding compensation claims. The nature and amount of the compensation dispute have not been specified.",
            "Sentiment": "negative",
            "PublishDate": 1756127192006,
            "Source": "corporate_governance"
        },
        {
            "Title": "NSDL vs CDSL: Mixed Q1 Performance Shows Contrasting Revenue Trends for India's Depository Leaders",
            "Summary": "NSDL reported consolidated revenue of Rs 312 crore, down 14% sequentially, while net profit grew 8% to Rs 89.6 crore. The company's demat account market share increased to 15.5% from 9.4% in the previous year, crossing four crore accounts, and maintains 86.6% market share by custody value. CDSL posted stronger revenue growth of 15.6% to Rs 259 crore, driven by higher issuer revenue and transaction income recovery. However, CDSL's net profit growth was modest at Rs 102 crore versus Rs 100 crore previously, with annual bottomline declining 24%. CDSL added 5.7 million demat accounts compared to 6.4 million in the previous quarter but retained its 84% market share in new account additions. Valuation-wise, NSDL trades at 74 times price-to-earnings with a market cap of Rs 24,166 crore, while CDSL trades at 66 times P/E with a market cap of Rs 32,806 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1755077054052,
            "Source": "earnings"
        },
        {
            "Title": "CDSL Reports 23.6% Drop in Net Profit Despite Higher Demat Custody",
            "Summary": "Central Depository Services (India) Limited (CDSL) reported demat custody of ₹79 lakh crore in the first quarter, up from ₹71 lakh crore in the previous quarter and ₹74 lakh crore in the same quarter last year. The company opened 57 lakh net accounts during the June quarter, compared to 64 lakh in the previous quarter and 99 lakh in the first quarter of last fiscal. Net profit declined to ₹102.4 crore from ₹134 crore in the previous year. Revenue remained flat at ₹259 crore versus ₹257.4 crore last year. EBITDA fell to ₹130.6 crore from ₹154.4 crore, with margins contracting to 50.4% from 60%. CDSL shares closed 3.77% lower at ₹1,616 and have gained 10.65% year-to-date.",
            "Sentiment": "negative",
            "PublishDate": 1753529611561,
            "Source": "earnings"
        },
        {
            "Title": "CDSL Reports 23.6% Drop in Net Profit Despite Flat Revenue Growth",
            "Summary": "Central Depository Services (India) Ltd. (CDSL) reported a 23.6% decline in net profit to ₹102.4 crore in the June quarter, down from ₹134 crore in the same period last year. Revenue remained nearly flat with a marginal 0.6% increase to ₹259 crore compared to ₹257.4 crore in the previous year's first quarter. EBITDA fell 15.1% to ₹130.6 crore from ₹154.4 crore year-over-year. The company's margin contracted significantly to 50.4% from 60% in the year-ago period. CDSL shares closed 3.77% lower at ₹1,616 and have declined 10.65% year-to-date.",
            "Sentiment": "negative",
            "PublishDate": 1753520973596,
            "Source": "earnings"
        },
        {
            "Title": "CDSL Shares Drop 3% as Rival NSDL Prepares for IPO Launch",
            "Summary": "Central Depository Services (India) Ltd (CDSL) shares fell nearly 3% to Rs 1,630.40 as investor focus shifted to competitor National Securities Depository Limited's (NSDL) upcoming IPO. NSDL's IPO opens for public subscription from July 30 to August 1, with anchor bidding on July 29. The IPO is priced between Rs 760-800 per share with a lot size of 18 shares, requiring minimum investment of Rs 14,400. The Rs 4,011.6 crore issue is entirely an offer for sale by existing shareholders including IDBI Bank, NSE, Union Bank of India, SBI, HDFC Bank, and SUUTI. NSDL targets a Rs 16,000 crore valuation and grey market trading shows premium of Rs 145-155, indicating potential 18.13% listing gains. CDSL has gained 37.45% over the past year but declined 6.31% in the last month.",
            "Sentiment": "negative",
            "PublishDate": 1753424870468,
            "Source": "stock"
        },
        {
            "Title": "CDSL: Partners with IIM Mumbai for Data Analytics and Research",
            "Summary": "CDSL signed an MoU with IIM Mumbai for collaboration on data analytics, research, and case studies in financial markets. The partnership includes joint consulting, research projects, internships, and expert sessions. CDSL aims to leverage IIM Mumbai's academic expertise for advanced data analysis and risk management.",
            "Sentiment": "positive",
            "PublishDate": 1750840633000,
            "Source": "corporate_action"
        },
        {
            "Title": "Central Depository Services (India) Ltd: Shares Surge 60% from March Lows",
            "Summary": "CDSL shares have rebounded 60.4% from March lows to Rs 1,680. The stock climbed 9.8% in today's session, with 152.99 lakh shares traded on NSE. Market cap stands at Rs 34,903 crore. Q4FY25 results show 22% YoY drop in net profit to Rs 100.39 crore and 6.7% YoY decline in revenue to Rs 224.45 crore.",
            "Sentiment": "positive",
            "PublishDate": 1748856695000,
            "Source": "earnings"
        },
        {
            "Title": "Central Depository Services Ltd: CDSL Shares Surge 25% in One Month, Nearing Record Highs",
            "Summary": "CDSL shares have risen 25% in the last month, with a 9% surge on June 2. The stock is extending gains after a three-month winning streak. Analysts suggest potential targets of ₹1,740 to ₹1,820, with immediate support at ₹1,600.",
            "Sentiment": "positive",
            "PublishDate": 1748851493000,
            "Source": "normal_news"
        },
        {
            "Title": "Central Depository Services (India) Ltd: Q4 Results Disappoint, Stock Declines",
            "Summary": "CDSL's Q4 FY2025 results show revenue down 4.3% to Rs 256 crore, net profit down 22.4% to Rs 100 crore, and EBITDA down 27% to Rs 107.35 crore. Margin contracted to 47.8% from 61.4%. Board recommends final dividend of Rs 12.5 per share. Stock price fell 5.13% in early trade.",
            "Sentiment": "negative",
            "PublishDate": 1746419291000,
            "Source": "earnings"
        },
        {
            "Title": "Central Depository Services Ltd: Q4 Revenue and Profit Decline for Second Consecutive Quarter",
            "Summary": "CDSL reported a 19.3% quarter-on-quarter revenue decline to ₹224.4 crore in Q4, with net profit falling 23% year-over-year to ₹100 crore. EBITDA decreased by 32% QoQ to ₹109.35 crore. The company opened 30% fewer net accounts compared to the previous quarter. The board approved a dividend of ₹12.5 per share.",
            "Sentiment": "negative",
            "PublishDate": 1746402505000,
            "Source": "earnings"
        },
        {
            "Title": "Central Depository Services (India) Limited: Declares 125% Dividend, Q4 Profit Dips 22%",
            "Summary": "CDSL announced a final dividend of ₹12.50 per share for FY24-25, subject to shareholder approval. Q4 net profit fell 22% YoY to ₹100.39 crore, while revenue dropped 7% to ₹224.44 crore. Total expenses rose 28% to ₹129.40 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1746368280000,
            "Source": "result"
        },
        {
            "Title": "CDSL: Q4 PAT Declines 22% YoY, Announces Final Dividend",
            "Summary": "CDSL reported a 22% YoY decline in Q4FY25 PAT to Rs 100.39 crore. Revenue from operations fell 6.7% YoY to Rs 224.45 crore. The board announced a final dividend of Rs 12.50 per share for FY24-25, subject to shareholder approval.",
            "Sentiment": "negative",
            "PublishDate": 1746269779000,
            "Source": "result"
        },
        {
            "Title": "CDSL: Q4 Profit Falls 22.4%, Revenue Dips 4.3%",
            "Summary": "CDSL reported Q4FY25 net profit of Rs 100 crore, down 22.4% YoY. Revenue decreased 4.3% to Rs 256 crore. Board recommends final dividend of Rs 12.50 per share for FY 24-25.",
            "Sentiment": "negative",
            "PublishDate": 1746266349000,
            "Source": "earnings"
        },
        {
            "Title": "SEBI Directs CDSL to Deposit 30 Million Rupees for Past Technical Glitches",
            "Summary": "The Securities and Exchange Board of India (SEBI) has advised Central Depository Services Limited (CDSL) to deposit 30 million rupees as a consequence for past technical glitches. This regulatory action highlights SEBI's focus on maintaining robust technological infrastructure in India's financial markets.",
            "Sentiment": "negative",
            "PublishDate": 1744099755000,
            "Source": "corporate_governance"
        },
        {
            "Title": "CDSL's Subsidiary CVL Signs MOU with L&T Realty for Property Purchase",
            "Summary": "Central Depository Services Limited (CDSL) has announced that its subsidiary, CDSL Ventures Limited (CVL), has entered into a Memorandum of Understanding (MOU) with L&T Realty Properties. The agreement involves CVL purchasing premises at L&T Seawoods Grand Central, indicating a potential expansion or relocation of CVL's operations.",
            "Sentiment": "neutral",
            "PublishDate": 1743167243000,
            "Source": "corporate_action"
        },
        {
            "Title": "SEBI Issues Warning to CDSL to Strengthen Internal Systems",
            "Summary": "The Securities and Exchange Board of India (SEBI) has issued a warning to Central Depository Services Limited (CDSL) to strengthen its internal systems. This action by the regulatory body suggests potential vulnerabilities or inadequacies in CDSL's current internal processes or infrastructure.",
            "Sentiment": "negative",
            "PublishDate": 1742996914000,
            "Source": "corporate_governance"
        },
        {
            "Title": "CDSL Subsidiary CIRL Partners with LIC for Insurance Repository Services",
            "Summary": "Central Depository Services Limited (CDSL) has announced that its subsidiary, CDSL Insurance Repository Limited (CIRL), has entered into an agreement with Life Insurance Corporation of India (LIC) to provide Insurance Repository (IR) services.",
            "Sentiment": "positive",
            "PublishDate": 1742474493000,
            "Source": "corporate_action"
        },
        {
            "Title": "Central Depository Services Ltd: Demat Account Growth Slows, Stock Declines",
            "Summary": "CDSL shares have fallen 40% in 2025, now 45% below peak. February saw slowest demat account growth in 21 months, with 22.6 lakh new accounts, down 20% from January and 48% year-over-year. Market correction, stricter F&O norms, and fewer IPOs may be contributing factors.",
            "Sentiment": "negative",
            "PublishDate": 1741672544000,
            "Source": "normal_news"
        },
        {
            "Title": "Central Depository Services (India) Ltd: CDSL and NSDL Launch Unified Investor App",
            "Summary": "CDSL and NSDL have launched a unified investor app in collaboration with SEBI. The app provides consolidated view of securities across both depositories, transaction cum holding statements, and monitoring of open positions and margin details across exchanges. It features single-login system and robust security measures.",
            "Sentiment": "positive",
            "PublishDate": 1740110559000,
            "Source": "normal_news"
        },
        {
            "Title": "Central Depository Services (India) Ltd: Achieves 15 Crore Demat Accounts Milestone",
            "Summary": "CDSL has become the first depository in India to register over 15 crore Demat accounts. The company's Q3 net profit increased by 21% YoY to ₹130 crore, while total income rose 30% to ₹278 crore. However, new account additions slowed to 92 lakh in Q3, down from 1.18 crore in Q2. Some brokerages have downgraded their outlook on CDSL due to concerns over market volumes.",
            "Sentiment": "neutral",
            "PublishDate": 1739341091000,
            "Source": "normal_news"
        },
        {
            "Title": "CDSL Becomes First Depository to Surpass 15 Crore Demat Accounts",
            "Summary": "Central Depository Services Limited (CDSL) has achieved a significant milestone by becoming the first depository in India to register over 15 crore demat accounts. This achievement highlights the growing participation of retail investors in the Indian stock market and the increasing digitalization of financial services.",
            "Sentiment": "positive",
            "PublishDate": 1739330533000,
            "Source": "corporate_action"
        },
        {
            "Title": "Central Depository Services (India) Ltd: Low Retail Participation Impacts Q4 Outlook",
            "Summary": "CDSL faces challenges due to low retail participation in the secondary market. Transaction charges were reduced to Rs 3.5 per debit, leading to a 29% sequential drop in transaction charge income to Rs 59 crore. The company expects continued lower retail activity to affect Q4 transaction charges. CDSL aims to increase market participation from 7% to 20-30% of the Indian population.",
            "Sentiment": "negative",
            "PublishDate": 1738050764000,
            "Source": "earnings"
        },
        {
            "Title": "Central Depository Services Ltd: CDSL Shares Plummet 17% in Three Days Amid Downgrade",
            "Summary": "CDSL shares fell 6% on Tuesday, extending a three-day 17% decline following Q3 results. Revenue dropped 14% due to lower transaction charges. B&K Securities downgraded CDSL to 'sell' with a price target of ₹1,100. Nuvama cut its price target to ₹1,510, maintaining a 'hold' rating.",
            "Sentiment": "negative",
            "PublishDate": 1738042037000,
            "Source": "earnings"
        },
        {
            "Title": "Central Depository Services Ltd: Analyst Sees Limited Upside Despite 'Compelling Story'",
            "Summary": "Motilal Oswal initiated coverage on CDSL with a 'neutral' rating and a price target of ₹2,000, implying 6% upside. The brokerage expects CDSL to maintain leadership, with EBITDA margins expanding to 66% by FY2027. However, rich valuations limit further upside potential.",
            "Sentiment": "neutral",
            "PublishDate": 1733804911000,
            "Source": "normal_news"
        },
        {
            "Title": "Central Depository Services Ltd: CDSL Shares Soar Above Analyst Targets, Nearing ₹2,000 Mark",
            "Summary": "CDSL shares are up 2.5% today, extending a 15% gain over four sessions. The stock has crossed ₹1,900 and is approaching ₹2,000, surpassing all analyst price targets. Year-to-date returns exceed 100%, marking the third time since 2017 the stock has doubled in a calendar year. The company recently issued a 1:1 bonus share.",
            "Sentiment": "positive",
            "PublishDate": 1733722834000,
            "Source": "normal_news"
        },
        {
            "Title": "CDSL Block Trade: 103,176 Shares Traded at Rs. 1,801.30",
            "Summary": "A significant block trade occurred for Central Depository Services India Ltd (CDSL) on the National Stock Exchange (NSE). Approximately 103,176 shares were traded at a price of Rs. 1,801.30 per share, amounting to a total transaction value of Rs. 18.59 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1733372900000,
            "Source": "block_deals"
        },
        {
            "Title": "CDSL: Q2 Profit Surges 49%, Stock Jumps 7%",
            "Summary": "CDSL reported a 49% increase in Q2 net profit to Rs 162 crore, with revenue up 55% to Rs 322 crore. EBITDA rose 54% to Rs 200 crore. The stock price surged nearly 7% in early trade following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1730091888000,
            "Source": "result"
        },
        {
            "Title": "CDSL: Shares Surge 8%, Breaking 11-Day Losing Streak",
            "Summary": "<p><span class='positive'>CDSL shares rose up to 8%</span> to ₹1,477, <span class='positive'>ending an 11-day decline</span>. The stock is now <span class='positive'>trading above its 50-Day Moving Average</span> of ₹1,391. <b>RSI</b> has <span class='positive'>rebounded to 55</span>. Analyst ratings are <span class='neutral'>mixed</span> with 3 buys, 4 holds, and 2 sells.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728456036000,
            "Source": "normal_news"
        }
    ]
}