{
    "Symbol": "CEATLTD",
    "ISIN": "INE482A01020",
    "News": [
        {
            "Title": "CEAT's CAMSO Unit Eyes Double-Digit Margins from Q4",
            "Summary": "CEAT's CAMSO division expects to achieve double-digit margins starting Q4 as one-time transition costs end. The company anticipates recovery in OEM MHCVs, high double-digit LCV growth, and rising three-wheeler sales driven by e-commerce expansion.",
            "Sentiment": "positive",
            "PublishDate": 1768967998141,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ceat Expects Double-Digit Growth in Passenger Segment",
            "Summary": "Ceat anticipates strong growth in passenger vehicle tyres driven by consumer shift to smaller cars and improved financing. However, margin pressure of 1-1.5% expected in Q4 due to currency and raw material headwinds.",
            "Sentiment": "neutral",
            "PublishDate": 1768967928583,
            "Source": "stocks"
        },
        {
            "Title": "CLSA Sets ₹4,823 Target for CEAT with Outperform Rating",
            "Summary": "Global brokerage CLSA has assigned an Outperform rating to CEAT Limited with a target price of ₹4,823.00, indicating positive outlook for the tyre manufacturer's stock performance.",
            "Sentiment": "positive",
            "PublishDate": 1768967792882,
            "Source": "stocks"
        },
        {
            "Title": "Nomura Issues Buy Rating for CEAT with ₹4,613 Target",
            "Summary": "Global brokerage firm Nomura has issued a buy recommendation for CEAT Limited, setting an ambitious target price of ₹4,613 per share for the tyre manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1768967764342,
            "Source": "stocks"
        },
        {
            "Title": "CEAT Gets Buy Rating with ₹4,579 Target Price",
            "Summary": "Motilal Oswal maintains Buy recommendation on CEAT with revised target price of ₹4,579, up from previous target of ₹4,515, indicating positive outlook for the tyre manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1768967739307,
            "Source": "stocks"
        },
        {
            "Title": "CEAT Tire Industry Growth Outlook Positive",
            "Summary": "CEAT highlights tire industry poised for strong single-digit growth by FY31, driven by favorable tax policies, EV adoption, and premiumization trends across segments.",
            "Sentiment": "positive",
            "PublishDate": 1768967232975,
            "Source": "stocks"
        },
        {
            "Title": "CEAT Executive Optimistic About Q4 Growth Trajectory",
            "Summary": "CEAT co-executive expresses confidence in sustained positive growth momentum for the current quarter, aiming to deliver strong year-end performance for the tire manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1768833413297,
            "Source": "stocks"
        },
        {
            "Title": "CEAT Invests ₹361 Lakhs in Subsidiary Tyresnmore",
            "Summary": "CEAT Limited approves investment of ₹361 lakhs in wholly owned subsidiary Tyresnmore Online Private Limited through rights issue subscription, maintaining 100% shareholding in the auto ancillary business.",
            "Sentiment": "neutral",
            "PublishDate": 1768828592786,
            "Source": "co_actions_results"
        },
        {
            "Title": "CEAT Plans ₹1,314 Cr Investment in Chennai Facility",
            "Summary": "CEAT announces major expansion with ₹1,314 crores investment in Chennai manufacturing facility to boost annual tyre production capacity by 3.5 million units, strengthening market position.",
            "Sentiment": "positive",
            "PublishDate": 1768828294572,
            "Source": "stocks"
        },
        {
            "Title": "CEAT Q3 Results: Profit jumps 60% YoY, plans ₹1,314 cr expansion",
            "Summary": "CEAT Limited reported strong Q3FY26 results with consolidated net profit rising 60.30% to ₹155.70 crore and revenue growing 26.00% to ₹4,157.00 crore. Company announced ₹1,314.00 crore capacity expansion at Chennai plant.",
            "Sentiment": "positive",
            "PublishDate": 1768827932539,
            "Source": "co_actions_results"
        },
        {
            "Title": "CEAT Q3FY26 Revenue Jumps 26% to ₹4,157 Crores",
            "Summary": "CEAT Limited reported strong Q3FY26 results with consolidated revenue of ₹4,157 crores, up 26% YoY. Company announced major capacity expansion of ₹1,314 crores at Chennai plant.",
            "Sentiment": "positive",
            "PublishDate": 1768827779132,
            "Source": "co_actions_results"
        },
        {
            "Title": "CEAT Appoints Rahul Gama as Senior VP - HR",
            "Summary": "CEAT Limited announces the appointment of Mr. Rahul Gama as Senior Vice President – Human Resources effective January 15, 2026. Gama brings 28 years of global HR experience across multiple industries.",
            "Sentiment": "positive",
            "PublishDate": 1768465343864,
            "Source": "stocks"
        },
        {
            "Title": "CEAT Partners CleanMax for 59 MW Renewable Energy",
            "Summary": "CEAT Limited collaborates with CleanMax to develop approximately 59 MW hybrid wind-solar projects across key manufacturing locations, strengthening sustainable energy initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1768401012072,
            "Source": "stocks"
        },
        {
            "Title": "CEAT Senior VP HR Somraj Roy Resigns Effective Jan 14",
            "Summary": "CEAT Limited announces resignation of Mr. Somraj Roy, Senior Vice President – Human Resources, effective January 14, 2026, to pursue opportunities within the Group.",
            "Sentiment": "neutral",
            "PublishDate": 1768393930931,
            "Source": "stocks"
        },
        {
            "Title": "CEAT Invests ₹32.33 Cr in 59 MW Hybrid Wind-Solar Projects",
            "Summary": "CEAT Limited partners with CleanMax to develop ~59 MW hybrid wind-solar projects across Gujarat and Tamil Nadu, investing up to ₹32.33 crores to boost renewable energy capacity to 60%.",
            "Sentiment": "positive",
            "PublishDate": 1768389243257,
            "Source": "co_actions_results"
        },
        {
            "Title": "CEAT Sets Up New UK Subsidiary for Global Expansion",
            "Summary": "CEAT Limited has established CEAT International UK Limited as its new subsidiary in the United Kingdom, marking a strategic expansion into the European market for the Indian tyre manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1768228347155,
            "Source": "stocks"
        },
        {
            "Title": "CEAT Sets Up UK Subsidiary for International Expansion",
            "Summary": "CEAT Limited announces incorporation of wholly owned subsidiary CEAT INTERNATIONAL UK LIMITED with capital of 15,000 shares at GBP 1 per share, focusing on automotive tyres and related products.",
            "Sentiment": "positive",
            "PublishDate": 1768223351770,
            "Source": "co_actions_results"
        },
        {
            "Title": "CEAT Gets Credit Rating Update from CARE",
            "Summary": "CARE Ratings reaffirms CEAT's commercial paper rating at A1+ while maintaining AA/Positive outlook on debentures and long-term facilities. Short-term facilities enhanced to ₹1,920 crores.",
            "Sentiment": "positive",
            "PublishDate": 1767881485154,
            "Source": "stocks"
        },
        {
            "Title": "CEAT Board Meeting & Earnings Call Set for Jan 19-20",
            "Summary": "CEAT Limited scheduled board meeting on January 19, 2026 to review Q3FY26 results, followed by earnings call on January 20 at 4:00 PM IST with management team participation.",
            "Sentiment": "neutral",
            "PublishDate": 1767701975605,
            "Source": "co_actions_results"
        },
        {
            "Title": "CEAT Allots ₹250 Cr NCDs at 7.20% Interest Rate",
            "Summary": "CEAT has successfully allotted ₹250 crores worth of non-convertible debentures through private placement, featuring 7.20% annual interest and 5-year tenure with NSE listing.",
            "Sentiment": "positive",
            "PublishDate": 1767073651646,
            "Source": "co_actions_results"
        },
        {
            "Title": "CEAT Gets Approval for UK and Germany Subsidiaries",
            "Summary": "CEAT Limited has received regulatory approval to establish subsidiaries in the United Kingdom and Germany, marking a significant step in the tire manufacturer's international expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1766492777014,
            "Source": "stocks"
        },
        {
            "Title": "CEAT Approves Two New International Subsidiaries",
            "Summary": "CEAT Limited's board committee approved incorporation of wholly owned subsidiary in UK and step-down subsidiary in Germany for automotive tyres business expansion.",
            "Sentiment": "positive",
            "PublishDate": 1766491864194,
            "Source": "co_actions_results"
        },
        {
            "Title": "CEAT subsidiary renames to CEAT Tyres B.V.",
            "Summary": "CEAT Limited announces name change of its Netherlands-based wholly owned subsidiary from CEAT Specialty Tyres B.V. to CEAT Tyres B.V., effective December 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766036397150,
            "Source": "stocks"
        },
        {
            "Title": "CEAT Brazil subsidiary changes name to Holding LTDA",
            "Summary": "CEAT Limited announces name change of its wholly-owned Brazilian subsidiary from CEAT BRAZIL TIRES SERVICOS LTDA to CEAT BRAZIL HOLDING LTDA, effective December 16, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765954276080,
            "Source": "stocks"
        },
        {
            "Title": "CEAT subsidiary renames to CEAT Tires Inc",
            "Summary": "CEAT Limited announces name change of its wholly owned US subsidiary from CEAT Specialty Tires Inc to CEAT Tires Inc, effective December 10, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765466841177,
            "Source": "stocks"
        },
        {
            "Title": "CEAT Limited Approves ₹250 Crores NCDs and ₹3,800 Million Investment in Indonesian Subsidiary",
            "Summary": "CEAT Limited's board has approved the issuance of ₹250 crores in unsecured non-convertible debentures and plans to invest ₹3,800 million to increase its ownership in PT CEAT Tyres Indonesia to 99.93%. The dual financing strategy involves both debt fundraising and significant capital deployment to strengthen control over the Indonesian operations.",
            "Sentiment": "positive",
            "PublishDate": 1764932019895,
            "Source": "corporate_action"
        },
        {
            "Title": "CEAT Limited Receives Reaffirmed Credit Rating from CARE Ratings",
            "Summary": "CARE Ratings Limited has revalidated CEAT Limited's credit rating for proposed Non-Convertible Debentures worth Rs. 500 crores, maintaining a CARE AA rating with positive outlook. The reaffirmation supports the tire manufacturer's debt fundraising plans and indicates stable creditworthiness assessment.",
            "Sentiment": "positive",
            "PublishDate": 1764679520019,
            "Source": "corporate_action"
        },
        {
            "Title": "CEAT to Consider Non-Convertible Debentures Issuance on December 5",
            "Summary": "CEAT will consider issuing non-convertible debentures on December 5. The decision affects the tire manufacturer's debt financing strategy and potential investors in the debentures.",
            "Sentiment": "neutral",
            "PublishDate": 1764677010325,
            "Source": "corporate_action"
        },
        {
            "Title": "CEAT Limited Seeks Shareholder Approval for Two Director Appointments via Postal Ballot",
            "Summary": "CEAT Limited has issued a postal ballot notice seeking member approval for the appointment of Mr. Apurva Chandra as Non-Executive Independent Director and Mr. Paras K. Chowdhary as Non-Executive Non-Independent Director, both appointed by the Board on October 17, 2025. The remote e-voting period runs from November 19, 2025 to December 18, 2025, with results to be declared by December 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763372247401,
            "Source": "corporate_governance"
        },
        {
            "Title": "CEAT Limited Invests ₹340 Lakhs in Wholly-Owned Subsidiary Tyresnmore Online",
            "Summary": "CEAT Limited has approved an investment of up to ₹340 lakhs through subscription in a rights issue of equity shares of Tyresnmore Online Private Limited. The company will acquire 27,855 equity shares of face value Re. 1 each in its wholly-owned subsidiary. Tyresnmore is engaged in selling automotive tyres, batteries and accessories, and providing installation and wheel alignment services. The subsidiary reported a turnover of ₹3,225.73 lakhs as of March 31, 2025, showing growth from ₹1,481.15 lakhs in FY2022-23 and ₹2,558.64 lakhs in FY2023-24. CEAT's shareholding in Tyresnmore will remain at 100% post this investment. The equity shares are expected to be allotted by November 24, 2025, with payment through cash consideration via normal banking channels.",
            "Sentiment": "positive",
            "PublishDate": 1762318599726,
            "Source": "corporate_action"
        },
        {
            "Title": "Ceat Shares Hit Life High on Strong Q2 Financial Performance",
            "Summary": "Ceat Ltd. shares reached a life high following better-than-expected quarterly results. Consolidated revenue grew 14% year-on-year to Rs 3,772 crore, surpassing estimates of Rs 3,673 crore. Net profit jumped 52% to Rs 185 crore versus estimated Rs 140 crore. Operational profitability improved with Ebitda rising 39% to Rs 506 crore, exceeding the Rs 428 crore estimate. Ebitda margin expanded by 240 basis points to 13.4%, compared to forecast of 11.7%. The company reported healthy volume growth led by OEM and International Business segments. International business is recovering well despite global tariff uncertainty, with strong demand from key clusters. Realisations improved marginally on annual and sequential basis.",
            "Sentiment": "positive",
            "PublishDate": 1760948835664,
            "Source": "earnings"
        },
        {
            "Title": "CEAT Limited Reports Strong Q2 FY26 Results with 14.2% Revenue Growth and New Board Appointments",
            "Summary": "CEAT Limited announced its quarterly results for the period ended September 30, 2025, showing consolidated revenue of Rs. 3,772.7 crore, up 14.2% year-on-year, with EBITDA margin at 13.5% and net profit of Rs. 185.7 crore. On standalone basis, revenue reached Rs. 3,701.1 crore, up 12.2% year-on-year, with EBITDA margin of 13.7% and net profit of Rs. 202.2 crore. The company appointed two new directors: Mr. Apurva Chandra as Non-Executive Independent Director for a five-year term, and Mr. Paras K. Chowdhary as Non-Executive Non-Independent Director, both subject to shareholder approval. The company completed the acquisition of Camso brand's Off-Highway construction equipment tyre and tracks business on September 1, 2025, for $225 million through its subsidiary CEAT OHT Lanka. CEAT also launched SecuraDrive CIRCL, India's first passenger car tyre with up to 90% sustainable materials, and received recognition as 'Great Indian ESG Organisation of the Year (Manufacturing)' at ESG & Cleantech Summit and Awards 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760694621887,
            "Source": "corporate_action"
        },
        {
            "Title": "CEAT Reports Strong Q2 Performance with 14% Revenue Growth",
            "Summary": "CEAT delivered robust quarterly results with revenue rising to 37.7 billion rupees from 33 billion rupees year-over-year. The company's EBITDA increased significantly to 5.03 billion rupees compared to 3.6 billion rupees in the same period last year, while EBITDA margin expanded to 13.34% from 10.96%. Consolidated net profit grew to 1.9 billion rupees versus 1.2 billion rupees year-over-year. The Co-CEO expressed optimism about the company's prospects, anticipating double-digit growth for the latter half of the year.",
            "Sentiment": "positive",
            "PublishDate": 1760693872970,
            "Source": "earnings"
        },
        {
            "Title": "CEAT Completes $171M Acquisition of Michelin's CAMSO Construction Compact Line Business",
            "Summary": "CEAT has completed the acquisition of Michelin's CAMSO Construction Compact Line business for $171 million. The acquisition includes Sri Lanka manufacturing plants, CAMSO brand rights, and provides access to over 40 global original equipment manufacturers (OEMs). This transaction expands CEAT's presence in the construction equipment tire segment and strengthens its global manufacturing footprint.",
            "Sentiment": "positive",
            "PublishDate": 1756733327182,
            "Source": "order&deals"
        },
        {
            "Title": "Ceat's OHT Lanka Signs $171 Million Investment Agreement with BOI Sri Lanka",
            "Summary": "OHT Lanka, associated with Ceat, has signed a $171 million investment agreement with the Board of Investment (BOI) of Sri Lanka. The investment is aimed at expanding manufacturing operations for OHT and tracks products. The expansion is expected to safeguard 1,483 jobs.",
            "Sentiment": "positive",
            "PublishDate": 1756080689592,
            "Source": "stock"
        },
        {
            "Title": "OHT Lanka Signs $171 Million Investment Agreement with BOI Sri Lanka",
            "Summary": "OHT Lanka has entered into a $171 million investment agreement with the Board of Investment (BOI) of Sri Lanka. The expansion project aims to enhance manufacturing capabilities for OHT and tracks products while securing employment for 1,483 jobs.",
            "Sentiment": "positive",
            "PublishDate": 1755862191276,
            "Source": "stock"
        },
        {
            "Title": "CEAT Limited Announces Record Dates for Non-Convertible Debentures Interest and Principal Payments",
            "Summary": "CEAT Limited has published newspaper advertisements announcing record dates for principal and interest payments on its Non-Convertible Debentures. The company will make payments on two series of NCDs: Rs. 150 crores of 7.99% listed, senior, unsecured, redeemable NCDs with record dates of September 4, 2025 for interest payment on September 19, 2025, and September 26, 2025 for interest and redemption payment on October 13, 2025. Additionally, Rs. 100 crores of 7.00% secured, rated, listed NCDs are included in the announcement. The advertisements were published in Financial Express and Loksatta newspapers, and the information is hosted on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1754727142059,
            "Source": "corporate_action"
        },
        {
            "Title": "CEAT Limited Reports Loss of Share Certificates for Multiple Shareholders",
            "Summary": "CEAT Limited has reported the loss of share certificates belonging to three shareholders. The affected shareholders are Jayati Banerjee (11 shares), TR Narayana Murthy with joint holder TR Hari Prasad (1 share), and Dushyant Nagar (75 shares), totaling 87 shares of Rs. 10 each. The company has notified BSE and NSE through its registrar NSDL Database Management Limited. Anyone with claims regarding these securities must lodge them with the company within 15 days, after which duplicate certificates will be issued without further notice.",
            "Sentiment": "neutral",
            "PublishDate": 1753343470462,
            "Source": "corporate_action"
        },
        {
            "Title": "CEAT Limited Makes Q1 FY26 Earnings Call Transcript Available on Company Website",
            "Summary": "CEAT Limited has published the transcript of its Q1 FY26 results earnings call on its company website for investor reference. The earnings call was held on July 18, 2025, at 4:00 pm IST to discuss the company's unaudited financial results for the period ended June 30, 2025. The transcript is accessible on the company's investor relations section at their official website. The company notified both BSE Limited and National Stock Exchange of India Limited about the transcript availability through a formal communication dated July 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753190095996,
            "Source": "earnings"
        },
        {
            "Title": "CEAT Forecasts Double-Digit Revenue Growth Driven by Rural Two-Wheeler Tyre Demand",
            "Summary": "CEAT Ltd expects to maintain double-digit revenue growth this fiscal year, supported by strong demand in the rural replacement tyre segment, particularly for two-wheelers.",
            "Sentiment": "positive",
            "PublishDate": 1752992686728,
            "Source": "stock"
        },
        {
            "Title": "Ceat Ltd: Q1 PAT Declines 9% YoY Despite 11% Revenue Growth",
            "Summary": "Ceat Ltd reported a 9.2% YoY decline in Q1FY26 PAT to Rs 135.5 crore, despite an 11.1% revenue growth to Rs 3,521 crore. EBITDA increased by 2.5% to Rs 391.01 crore, but EBITDA margin contracted by 93 basis points to 11.1%.",
            "Sentiment": "neutral",
            "PublishDate": 1752809873000,
            "Source": "earnings"
        },
        {
            "Title": "Ceat Ltd: Q1 Profit Drops 9%, Misses Analyst Estimates",
            "Summary": "Ceat Ltd reported a 9% decrease in standalone net profit for Q1 FY25, falling to Rs 135.35 crore from Rs 149.24 crore year-over-year. Revenue increased by 11.1% to Rs 3,520.70 crore. EBITDA rose slightly by 2% to Rs 391.05 crore, with margins at 11.1%. The results fell short of Bloomberg analyst estimates.",
            "Sentiment": "negative",
            "PublishDate": 1752761108000,
            "Source": "earnings"
        },
        {
            "Title": "Ceat Plans Capacity Expansion and Reports Q1 Financial Results",
            "Summary": "Ceat has announced plans to increase capacity by 35% at its Chennai plant, requiring an investment of 4.50 billion rupees. The company also reported its Q1 financial results: EBITDA of 3.9 billion rupees (vs 3.83 billion YoY), EBITDA margin of 10.99% (vs 11.99% YoY), consolidated net profit of 1.12 billion rupees (vs 1.54 billion YoY), and revenue of 35.3 billion rupees (vs 31.93 billion YoY).",
            "Sentiment": "neutral",
            "PublishDate": 1752760570000,
            "Source": "default"
        },
        {
            "Title": "Ceat Ltd. Block Trade: 104,123 Shares Sold for Rs. 40.76 Crores",
            "Summary": "A block trade of approximately 104,123 shares of Ceat Ltd. was reported on the National Stock Exchange (NSE). The transaction was valued at Rs. 40.76 Crores, with each share priced at Rs. 3,915.00.",
            "Sentiment": "neutral",
            "PublishDate": 1752640257000,
            "Source": "block_details"
        },
        {
            "Title": "CEAT Approves Investment in Subsidiary Tyresnmore Online",
            "Summary": "CEAT's Board has approved an investment in its fully owned subsidiary, Tyresnmore Online Private Limited. The exact amount of the investment or other details were not provided in the given information.",
            "Sentiment": "positive",
            "PublishDate": 1751983554000,
            "Source": "default"
        },
        {
            "Title": "Ceat Plans Multiple Financial Initiatives",
            "Summary": "Ceat has announced several financial plans: issuing Non-Convertible Debentures (NCDs) worth up to 5 billion rupees, investing up to 4 billion rupees in its Sri Lanka subsidiary, and accessing a credit facility of up to 10 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1750854510000,
            "Source": "default"
        },
        {
            "Title": "CEAT to Explore Fundraising Options",
            "Summary": "CEAT has announced plans to explore fundraising options. The company will discuss these options on June 25.",
            "Sentiment": "neutral",
            "PublishDate": 1750431294000,
            "Source": "default"
        },
        {
            "Title": "Ceat Ltd: Board to Consider Rs 500 Crore NCD Issuance",
            "Summary": "Ceat Ltd's board will meet on June 10 to consider issuing non-convertible debentures (NCDs) worth up to Rs 500 crore through private placement. This decision follows shareholder approval at the August 29, 2024 Annual General Meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1749140049000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ceat Ltd: Camso Integration Key Focus, Debt to Rise",
            "Summary": "Ceat's debt/Ebitda is expected to increase to 2x from 1.3x after Camso acquisition. Management considers this level comfortable. Tariffs are not expected to significantly impact Ceat's operations, including Camso.",
            "Sentiment": "neutral",
            "PublishDate": 1749115045000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ceat Ltd.: Targets 40%+ Gross Margin in FY26, Driven by Lower Raw Material Costs",
            "Summary": "Ceat Ltd. aims for over 40% gross margin in FY26, up from 37.5% in Q4 FY25, due to expected reduction in raw material costs. The company anticipates margin expansion from Q2 FY26. Rural demand is outpacing urban, especially in two-wheeler tyres. Ceat plans Rs 900-1,000 crore capex for FY26, focusing on brownfield expansions. The integration of Camso acquisition is progressing, expected to contribute to margins.",
            "Sentiment": "positive",
            "PublishDate": 1746070993000,
            "Source": "normal_news"
        }
    ]
}