{
    "Symbol": "CEIGALL",
    "ISIN": "INE0AG901020",
    "News": [
        {
            "Title": "Ceigall India Wins ₹2,160 Crore Highway Project",
            "Summary": "Ceigall India's subsidiary secured Letter of Award from NHAI for 4-laning of 78.942 km stretch of NH 139W in Bihar under Hybrid Annuity Mode with 730 days construction period.",
            "Sentiment": "positive",
            "PublishDate": 1770865466989,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ceigall India Reports Strong Q3FY26 Financial Results",
            "Summary": "Ceigall India Limited published unaudited financial results for Q3FY26, showing total income from operations of ₹8,815.81 million and net profit after tax of ₹744.56 million for the quarter ended December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1770734763178,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ceigall India Reports Insider Trading Violations",
            "Summary": "Ceigall India Limited disclosed violations of its insider trading code by three designated persons, with the Audit Committee imposing penalties of ₹1,100 each and requiring deposit of profits to SEBI IPEF.",
            "Sentiment": "negative",
            "PublishDate": 1770726921512,
            "Source": "stocks"
        },
        {
            "Title": "Ceigall India Wins ₹1,700 Crore Solar Project",
            "Summary": "Ceigall India Limited secured a 220 MW Solar Power Project with Battery Energy Storage System at Morena Solar Park, Madhya Pradesh, valued at approximately ₹1,700 crore with a tariff of ₹2.70 per kWh.",
            "Sentiment": "positive",
            "PublishDate": 1770693772272,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ceigall India schedules Q3FY26 earnings call",
            "Summary": "Ceigall India Limited has scheduled an earnings call for February 09, 2026, at 05:00 PM IST to discuss Q3 and nine months FY26 unaudited financial results with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1770128766284,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ceigall subsidiary wins ₹2,160 cr NHAI highway project",
            "Summary": "Ceigall Infra Projects Private Limited emerges as L1 bidder for 78.94 km highway construction project in Bihar under Hybrid Annuity Mode with 730 days construction period.",
            "Sentiment": "positive",
            "PublishDate": 1769053285604,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ceigall India Wins ₹918 Crore Jaipur Metro Project",
            "Summary": "Ceigall India Limited emerges as L-1 bidder for Jaipur Metro Phase-II elevated viaduct and stations project worth ₹918.04 crores, holding 74% stake in joint venture with SAM India Builtwell.",
            "Sentiment": "positive",
            "PublishDate": 1768554260700,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ceigall India Wins ₹918.04 Cr Jaipur Metro EPC Deal",
            "Summary": "Ceigall India emerges as top bidder for Jaipur Metro Rail Corporation's EPC contract worth ₹918.04 crores in partnership with Sam India Builtwell, with 34-month completion timeline.",
            "Sentiment": "positive",
            "PublishDate": 1768553949994,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ceigall India Appoints Adfactors PR as IR Agency",
            "Summary": "Ceigall India Limited has appointed Adfactors PR Private Limited as its Investor Relations agency effective January 16, 2026, following regulatory compliance under SEBI LODR Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768477130458,
            "Source": "stocks"
        },
        {
            "Title": "Ceigall India Approves Subsidiary Stake Sale & New SPV",
            "Summary": "Ceigall India's Management Committee authorized sale of 100% stake in step-down subsidiary and approved incorporation of new SPV for ₹48.10 km highway project worth ₹74,000.",
            "Sentiment": "positive",
            "PublishDate": 1768282346223,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ceigall India Approves Subsidiary Stake Sale & New SPV",
            "Summary": "Ceigall India's Management Committee authorizes sale of 100% stake in step-down subsidiary and approves incorporation of new SPV for ₹48.10 km highway project worth ₹74,000.",
            "Sentiment": "positive",
            "PublishDate": 1768282147029,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ceigall India Approves Sale of Highway Subsidiaries",
            "Summary": "Ceigall India has approved a non-binding sale offer for its entire stake in two highway subsidiaries - Ceigall Malout Abohar Sadhuwali Highways and the newly formed Ceigall Indore Ujjain Greenfield Highway Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1768281993129,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ceigall India Acquires Velgaon Power for ₹18.9 Cr",
            "Summary": "Ceigall India announces acquisition of all shares in Velgaon Power Transmission Limited for ₹18.90 million, expanding its power transmission portfolio through strategic investment.",
            "Sentiment": "positive",
            "PublishDate": 1767963711339,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ceigall India Acquires Velgaon Power Transmission",
            "Summary": "Ceigall India Limited has acquired 100% equity shares of Velgaon Power Transmission Limited for ₹1.89 crores through a share purchase agreement with REC Power Development and Consultancy Limited.",
            "Sentiment": "positive",
            "PublishDate": 1767962610325,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ceigall India Forms Subsidiary for 130 MW Solar Projects",
            "Summary": "Ceigall India establishes fully owned subsidiary to develop 130 MW solar power projects in Madhya Pradesh, expanding renewable energy portfolio through strategic business restructuring.",
            "Sentiment": "positive",
            "PublishDate": 1767714278679,
            "Source": "stocks"
        },
        {
            "Title": "Ceigall India Approves Strategic Acquisitions",
            "Summary": "Ceigall India's Management Committee approved acquisition of Velgaon Power Transmission Limited for ₹5.00 lakh and incorporation of two new subsidiaries for renewable energy and highway projects.",
            "Sentiment": "positive",
            "PublishDate": 1767352033515,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ceigall India shares in focus after ₹1,089 cr project win",
            "Summary": "Ceigall India shares will be in focus after subsidiary wins ₹1,089 crore highway project from MP government. Stock ended 3.2% higher at ₹259.85, though down 24% YTD with order book at ₹14,237 crore.",
            "Sentiment": "positive",
            "PublishDate": 1766928768600,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ceigall India shares rise 3.49% on NHAI project update",
            "Summary": "Ceigall India shares gained 3.49% to ₹260.25 after subsidiary received NHAI provisional certificate for ₹613.11 crore Punjab highway project, declared commercially operational from December 22, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766743096511,
            "Source": "stocks"
        },
        {
            "Title": "Ceigall India Forms Subsidiary for ₹550 Cr Solar Project",
            "Summary": "Ceigall India incorporates wholly owned subsidiary Ceigall Green Energy MP Limited to execute 130 MW solar power project worth ₹550 crore awarded by MPUVNL under PM KUSUM-C scheme.",
            "Sentiment": "positive",
            "PublishDate": 1766390423523,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ceigall India's Subsidiary Receives Completion Certificate for INR 918 Crore Highway Project",
            "Summary": "Ceigall Malout Abohar Sadhuwali Highway Private Limited, a subsidiary of Ceigall India Limited, received completion certificate for its four-laning highway project in Punjab with bid project cost of INR 918 crore. The project was completed 214 days ahead of its scheduled completion date and has been declared fit for commercial operation from November 11, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765019561826,
            "Source": "stock"
        },
        {
            "Title": "Ceigall India's Subsidiary Emerges as L1 Bidder for Rs 1,089 Crore Highway Project",
            "Summary": "Ceigall Infra Projects Private Limited, a wholly owned subsidiary of Ceigall India Limited, has emerged as the lowest bidder for a Rs 1,089 crore highway construction project from Madhya Pradesh Road Development Corporation Limited. The project involves construction of a 48.10 km Indore-Ujjain Greenfield highway on Hybrid Annuity Mode with a 24-month execution timeline.",
            "Sentiment": "positive",
            "PublishDate": 1764319036611,
            "Source": "stock"
        },
        {
            "Title": "Ceigall India Secures Rs. 12.185 Crore Contract from Punjab Government",
            "Summary": "Ceigall India Limited received a Letter of Acceptance dated November 26, 2025, from the Office of Executive Engineer Drainage Cum Mining and Geology Ropar Division WRD Punjab for a desilting project worth Rs. 12.185 crore. The contract involves desilting of Siswan Nadi to protect agricultural land in Village Dulchi Majra to Khizarpur, Tehsil Shri Chamkaur Sahib, District Ropar, with a completion timeline of 180 days.",
            "Sentiment": "positive",
            "PublishDate": 1764218630518,
            "Source": "order&deals"
        },
        {
            "Title": "Ceigall India Secures LOI for Rs 450 Crore Power Transmission Project with 35-Year O&M Contract",
            "Summary": "Ceigall India Limited received a Letter of Intent from REC Power Development for establishing a 400/220kV Gas Insulated Substation in Velgaon, Maharashtra, with an EPC cost of approximately Rs 450 crore. The project includes a two-year construction period followed by 35 years of operation and maintenance, generating Rs 58.5 crore annuity per year and providing long-term recurring cash flows for the infrastructure EPC company.",
            "Sentiment": "positive",
            "PublishDate": 1764046056234,
            "Source": "stock"
        },
        {
            "Title": "Ceigall India Successfully Incorporates Wholly Owned Subsidiary in Singapore",
            "Summary": "Ceigall India Limited has successfully incorporated Ceigall Global Pte. Ltd. in Singapore with an investment of SGD 10,000 (approximately Rs. 6.78 lacs) for 100% shareholding. The subsidiary will focus on strategic investments in infrastructure and allied activities, including potential acquisitions, tie-ups, and joint ventures globally, particularly in road and railway construction sectors.",
            "Sentiment": "positive",
            "PublishDate": 1763707807053,
            "Source": "stock"
        },
        {
            "Title": "Ceigall India Reports Muted Q2 Growth, Maintains Order Book at ₹12,598 Crores",
            "Summary": "Ceigall India's standalone revenue declined to ₹7,870 million in Q2 FY26 from ₹8,097 million in Q2 FY25, with EBITDA margins at 11.7%, impacted by prolonged monsoon disrupting construction activities. The company maintains a robust order book of ₹12,598 crores across 26 projects and secured new orders worth ₹3,747 crores, expanding into renewable energy and transmission sectors while targeting 10-15% revenue growth for FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1763379104385,
            "Source": "earnings"
        },
        {
            "Title": "Ceigall India Emerges as H1 Bidder for Rs 12.18 Crore Punjab Water Resources Project",
            "Summary": "Ceigall India Limited has emerged as the H1 bidder for a Rs 12.18 crore royalty-based contract from the Government of Punjab Water Resources Department for de-silting work in Satluj basin. The project involves clearing choked creek beds and disposing surplus material, with a royalty payment of Rs 2.87 per cubic foot to the Punjab government.",
            "Sentiment": "positive",
            "PublishDate": 1763055036059,
            "Source": "order&deals"
        },
        {
            "Title": "CEIGALL India Emerges as Top Bidder in Tender Worth 121.9 Million Rupees",
            "Summary": "CEIGALL India has secured the position of highest bidder in a tender process with a bid amount of 121.9 million rupees. This successful bidding positions the company to potentially win the contract, which could contribute to its business operations and revenue pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1763052554766,
            "Source": "stock"
        },
        {
            "Title": "Ceigall India Limited Submits Q2 FY2026 IPO Monitoring Report Showing No Material Deviations",
            "Summary": "Ceigall India Limited submitted its monitoring agency report for Q2 FY2026 to stock exchanges, prepared by ICRA Limited. The company raised INR 652.308 crore net proceeds from its IPO that opened on August 1, 2024 and closed on August 5, 2024. The report shows no material deviation from the stated objects of the issue, with utilization in line with disclosed purposes. The company has utilized INR 681.516 crore out of INR 684.410 crore allocated, with INR 2.736 crore remaining unutilized. Key utilizations include INR 99.789 crore for equipment purchase, INR 413.242 crore for repayment of borrowings by the company and its subsidiary, and INR 139.277 crore for general corporate purposes. The general corporate purpose funds were primarily used for equity infusion and investments in subsidiaries including Ceigall Northern Ayodhya Bypass Pvt Ltd and Ceigall Ayodhya Bypass Pvt Ltd. All objects are reported to be on schedule for completion by Fiscal 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762899202796,
            "Source": "corporate_action"
        },
        {
            "Title": "Ceigall India Reports Quarterly Results and Approves New Subsidiary Formations",
            "Summary": "Ceigall India Limited's Board approved unaudited financial results for the quarter and half-year ended September 30, 2025. The company also approved the incorporation of a wholly owned subsidiary in Singapore and a step-down subsidiary in Dubai, UAE, both focused on infrastructure and allied activities including potential acquisitions and joint ventures. The Singapore entity will be 100% owned by Ceigall India, while the Dubai entity will be owned by the Singapore subsidiary. Both incorporations are subject to regulatory approvals in their respective jurisdictions. The Board meeting was held on November 11, 2025, with results reviewed by statutory auditors BD Bansal & Co.",
            "Sentiment": "neutral",
            "PublishDate": 1762872562167,
            "Source": "earnings"
        },
        {
            "Title": "Ceigall India Reports 3.1% Revenue Growth in H1 FY26 Despite Monsoon Challenges",
            "Summary": "Ceigall India Limited reported consolidated revenue of Rs. 16,447 million for H1 FY26, representing a 3.1% year-on-year increase. The company's consolidated EBITDA stood at Rs. 2,227 million with PAT at Rs. 1,075 million for the half-year period. However, EBITDA margin declined to 13.5% from 16.8% in the previous year, and PAT margin dropped to 6.5% from 9.0%. The company attributed margin pressure to prolonged monsoon conditions that delayed material and equipment deliveries. Ceigall's order book reached Rs. 1,25,980 million as of September 30, 2025, with roads and highways contributing 64.3% and renewables 21.8%. The company secured Rs. 37,470 million worth of new orders during H1 FY26 and expects to exceed its full-year guidance of Rs. 50,000 million. Chairman Ramneek Sehgal highlighted the company's strategic diversification into transmission distribution, renewables, and industrial infrastructure segments.",
            "Sentiment": "neutral",
            "PublishDate": 1762868202884,
            "Source": "earnings"
        },
        {
            "Title": "Ceigall India Reports Mixed Q2 Results with Revenue Growth but Lower Profitability",
            "Summary": "Ceigall India announced Q2 financial results showing revenue growth to 8 billion rupees from 7.7 billion rupees year-over-year. However, the company experienced declining profitability with EBITDA falling to 1.13 billion rupees from 1.23 billion rupees, while EBITDA margin compressed to 14.1% from 15.94%. Consolidated net profit also decreased to 580 million rupees compared to 673 million rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1762853958142,
            "Source": "earnings"
        },
        {
            "Title": "Ceigall India Limited Schedules Earnings Call for Q2 and H1 FY26 Results",
            "Summary": "Ceigall India Limited has announced an earnings call for analysts and investors scheduled for November 11, 2025, at 16:00 hours IST. The call will discuss the company's unaudited financial results for the quarter and half year ended September 30, 2025. The management team participating includes Chairman cum Managing Director Ramneek Sehgal and Chief Financial Officer Kapil Aggarwal. Dial-in details and access information have been provided for participants, with multiple international access numbers available. The company has informed both BSE Limited and National Stock Exchange of India Limited about this earnings call schedule.",
            "Sentiment": "neutral",
            "PublishDate": 1762252019773,
            "Source": "earnings"
        },
        {
            "Title": "Ceigall India's Subsidiary Achieves Financial Close for 6-Lane Southern Ludhiana Bypass Project",
            "Summary": "Ceigall India Limited announced that its subsidiary, Ceigall Southern Ludhiana Bypass Private Limited, has achieved financial close for a highway project. The National Highways Authority of India confirmed the financial close on October 22, 2025. The project involves development of a 6-lane Greenfield Southern Ludhiana Bypass from intersection with NH-44 near Village Rajgarh to intersection with Delhi Katra Expressway near Village Ballowal, spanning 25.24 kilometers as part of Ludhiana-Ajmer Economic Corridor. The project operates under Hybrid Annuity Mode with a 24-month completion period. The financial close date is listed as September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761193476645,
            "Source": "stock"
        },
        {
            "Title": "Ceigall India Approves Incorporation of Two Subsidiaries for 337 MW Solar Projects in Maharashtra",
            "Summary": "Ceigall India Limited's Management Committee approved the incorporation of two wholly owned subsidiaries - Ceigall Green Energy MH1 Limited and Ceigall Green Energy MH2 Limited. These special purpose vehicles will operate in the renewable energy sector to undertake solar photovoltaic power projects awarded by Maharashtra State Electricity Distribution Co. Ltd. under Mukhyamantri Saur Krushi Vahini Yojana 2.0. MH1 Limited will handle 190 MW capacity projects while MH2 Limited will manage 147 MW capacity projects, totaling 337 MW. Each subsidiary requires Rs. 1,00,000 initial investment with 100% cash subscription, and Ceigall India will hold complete ownership of both entities. The projects were awarded through a letter dated October 2, 2025, and the incorporation process is currently underway.",
            "Sentiment": "positive",
            "PublishDate": 1760618063603,
            "Source": "corporate_action"
        },
        {
            "Title": "CEIGALL India Wins INR 6.61 Crore Arbitration Award for Halwara IAF Station Construction Work",
            "Summary": "CEIGALL India has won an arbitration award of INR 6.61 crore from a tribunal related to construction work at Halwara IAF Station. The award was granted through arbitration proceedings concerning the company's construction project at the Indian Air Force station.",
            "Sentiment": "positive",
            "PublishDate": 1760069920756,
            "Source": "stock"
        },
        {
            "Title": "Ceigall India Secures ₹712 Crore Contract for 190 MW Solar Projects",
            "Summary": "Ceigall India has secured a Letter of Award (LoA) worth ₹712 crore from MSEDCL to develop 190 MW solar projects under the Mukhyamantri Saur Krushi Vahini Yojana 2.0 scheme.",
            "Sentiment": "positive",
            "PublishDate": 1759709583686,
            "Source": "stock"
        },
        {
            "Title": "Ceigall India Secures ₹712 Crore Contract for 190 MW Solar Projects",
            "Summary": "Ceigall India has secured a Letter of Award (LoA) worth ₹712 crore from MSEDCL to develop 190 MW solar projects under the Mukhyamantri Saur Krushi Vahini Yojana 2.0 scheme. The contract involves the development of solar power infrastructure as part of this government initiative.",
            "Sentiment": "positive",
            "PublishDate": 1759486735434,
            "Source": "order&deals"
        },
        {
            "Title": "Ceigall India Secures Rs. 225 Crore Contract for Bulk Drug Park Development in Himachal Pradesh",
            "Summary": "Ceigall India Limited has received a Letter of Intent from Himachal Pradesh State Industrial Development Corporation Limited for developing a Bulk Drug Park in Una District, Himachal Pradesh. The contract is valued at Rs. 225 crore and involves formation cutting, construction of internal roads, storm water drains, bridge, and boundary fencing for Phase-I of the project. The work is to be completed within 18 months under an item rate contract with a performance security requirement of 3% of the contract value. The company confirmed that promoters have no interest in the awarding entity and the contract does not involve related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1759237153524,
            "Source": "order&deals"
        },
        {
            "Title": "CEIGALL India Subsidiary Receives Start Date for ₹981 Crore Highway Project",
            "Summary": "CEIGALL India's subsidiary has received the start date from NHAI for the Ludhiana-Bathinda highway project valued at ₹981 crore. The project involves highway construction connecting Ludhiana and Bathinda.",
            "Sentiment": "positive",
            "PublishDate": 1759212478864,
            "Source": "stock"
        },
        {
            "Title": "Ceigall India Subsidiary Receives Appointed Date for Rs 981 Crore Punjab Highway Project",
            "Summary": "Ceigall Ludhiana Bathina Greenfield Highway Private Limited, a subsidiary of Ceigall India Limited, received notification from the National Highways Authority of India setting September 29, 2025 as the 'Appointed Date' for a highway development project. The project involves development of a 6-lane access controlled Ludhiana-Bathinda Greenfield highway section under Bharatmala Pariyojana Phase-I with a bid project cost of Rs 981 crore. The project will be executed under Hybrid Annuity Mode with a construction period of 730 days from the appointed date and an operation period of 15 years. The highway section spans from km 30+300 to km 75+543 as part of the Ludhiana-Ajmer Economic Corridor in Punjab.",
            "Sentiment": "positive",
            "PublishDate": 1759055225348,
            "Source": "stock"
        },
        {
            "Title": "Ceigall India's Joint Venture Wins ₹509.20 Crore Infrastructure Contract from GMADA",
            "Summary": "Ceigall India Limited's joint venture with JSP Projects Pvt. Ltd. has secured a ₹509.20 crore Letter of Award from the Greater Mohali Area Development Authority (GMADA) for infrastructure development in Mohali Township. The joint venture has Ceigall India holding 80% stake and JSPPPL holding 20%. The contract covers construction of internal roads and associated civil, public health, and electrical works in Pockets B, C & D of Aerotropolis, S.A.S Nagar in Mohali, Punjab. The project is scheduled for completion within 24 months under an item-rate contract structure. Chairman & Managing Director Ramneek Sehgal described the award as an important milestone that underscores trust in the company's execution capabilities and reinforces their commitment to delivering infrastructure projects with efficiency and quality.",
            "Sentiment": "positive",
            "PublishDate": 1759038444001,
            "Source": "order&deals"
        },
        {
            "Title": "Ceigall India JV Wins Rs. 509 Crore Road Construction Contract from GMADA",
            "Summary": "Ceigall India's joint venture has secured a road construction project worth Rs. 509 crores from GMADA (Greater Mohali Area Development Authority) in Aerotropolis, SAS Nagar. This contract award represents a significant business development for the company's infrastructure division.",
            "Sentiment": "positive",
            "PublishDate": 1758802045890,
            "Source": "order&deals"
        },
        {
            "Title": "Ceigall India Wins 220 MW Solar Project with Battery Storage at ₹2.70/kWh Tariff",
            "Summary": "Ceigall India Limited emerged as the lowest bidder for a 220 MW solar power project with battery energy storage systems at Morena Solar Park, Madhya Pradesh. The company quoted a tariff of ₹2.70/kWh in an electronic reverse auction conducted by Rewa Ultra Mega Solar Limited. Ceigall secured 220 MW capacity out of the total 440 MW project through tariff-based competitive bidding. The project has an approximate value of ₹1,700 crores including GST, with a construction period of 24 months and operational period of 25 years. The project involves establishing a grid-connected ground-mounted solar photovoltaic system with battery energy storage systems.",
            "Sentiment": "positive",
            "PublishDate": 1758370851193,
            "Source": "order&deals"
        },
        {
            "Title": "Ceigall India Board Approves ₹50 Crore Convertible Loan and 74% Stake Investment",
            "Summary": "Ceigall India's board has approved a ₹50 crore convertible loan to revive C&C Constructions. The board also approved a 74% stake investment in Southern Ludhiana Bypass SPV.",
            "Sentiment": "positive",
            "PublishDate": 1758195222606,
            "Source": "stock"
        },
        {
            "Title": "CEIGALL India Limited Appoints Ernst & Young LLP for Investor Relations Consulting Services",
            "Summary": "CEIGALL India Limited has executed an engagement letter with Ernst & Young LLP to provide Investor Relations Consulting Services. The appointment is effective immediately. The company has informed stock exchanges BSE Limited and National Stock Exchange of India Limited about this development.",
            "Sentiment": "neutral",
            "PublishDate": 1758092014643,
            "Source": "stock"
        },
        {
            "Title": "Ceigall India Shares Rise Over 3% After Winning ₹509 Crore Road Construction Contract",
            "Summary": "Ceigall India's shares gained more than 3% after the company secured a ₹509.2 crore road construction project in Mohali from the Greater Mohali Area Development Authority (GMADA). The project involves constructing internal road networks in Aerotropolis, Sahibzada Ajit Singh Nagar district, Punjab, with an estimated cost of ₹467.93 crore including GST. The construction timeline spans 24 months followed by a 36-month defects liability period. Shares reached an intraday high of ₹278.4, though they remain below the 52-week high of ₹399.6. The company's board will meet to discuss a proposed scheme of arrangement involving subsidiary Ceigall Infra Projects and C & C Construction Ltd. The trading window for designated persons has been closed until 48 hours after the board meeting concludes.",
            "Sentiment": "positive",
            "PublishDate": 1757916711921,
            "Source": "order&deals"
        },
        {
            "Title": "Ceigall India Secures ₹4.68 Billion Project Contract",
            "Summary": "Ceigall India has been awarded a project contract valued at ₹4.68 billion. The company announced this new project acquisition, which represents a significant business development for the organization.",
            "Sentiment": "positive",
            "PublishDate": 1757894993602,
            "Source": "stock"
        },
        {
            "Title": "Ceigall India Wins INR 509.20 Crore Road Construction Contract from GMADA",
            "Summary": "Ceigall India Limited emerged as the L1 bidder for a construction project worth INR 509.20 crore from Greater Mohali Area Development Authority (GMADA). The project involves construction of internal roads in Pocket B, C & D of Aerotropolis SAS Nagar, including civil, public health, and electrical works. The original project cost was INR 467.93 crore, but the awarded cost is INR 509.20 crore, both including GST. The contract will be executed over 24 months with a 36-month defects liability period. The project requires a 5% performance bank guarantee and operates on an item rate basis.",
            "Sentiment": "positive",
            "PublishDate": 1757687206700,
            "Source": "stock"
        },
        {
            "Title": "CEIGALL INDIA Receives Letter of Intent for 147 MW Solar Power Project in Maharashtra",
            "Summary": "CEIGALL INDIA LIMITED has received a Letter of Intent for procurement of 147 MW solar power under the Mukhyamantri Saur Krushi Vahini Yojana 2.0 from Maharashtra State Electricity Distribution Co. Limited (MSEDCL). The company will set up grid-connected solar power projects at multiple locations in Maharashtra. The Letter of Intent was awarded through a tariff-based competitive bidding process. Additional details will be provided once the Letter of Award is received.",
            "Sentiment": "positive",
            "PublishDate": 1757224936889,
            "Source": "stock"
        },
        {
            "Title": "CEIGALL INDIA Receives Letter of Intent for 190 MW Solar Power Project in Maharashtra",
            "Summary": "CEIGALL INDIA LIMITED has received a Letter of Intent for procurement of 190 MW solar power under the Mukhyamantri Saur Krushi Vahini Yojana 2.0 from Maharashtra State Electricity Distribution Co. Limited (MSEDCL). The company will establish grid-connected solar power projects at multiple locations across Maharashtra state. The Letter of Intent was awarded under Lot # 1 MSKVY 2.0/ROUND 1 through a tariff-based competitive bidding process. Additional details will be provided once the Letter of Award is received.",
            "Sentiment": "positive",
            "PublishDate": 1757223994143,
            "Source": "stock"
        }
    ]
}