{
    "Symbol": "CELEBRITY",
    "ISIN": "INE185H01016",
    "News": [
        {
            "Title": "Celebrity Fashions Board Approves Share Capital Changes",
            "Summary": "Celebrity Fashions Limited board approved reclassification of authorized share capital and preferential issue of 48,69,932 equity shares worth ₹5.02 crores to promoters and investors.",
            "Sentiment": "positive",
            "PublishDate": 1768817698361,
            "Source": "co_actions_results"
        },
        {
            "Title": "Celebrity Fashions Limited Reports Rs 10.68 Crore Loss for Half-Year Period",
            "Summary": "Celebrity Fashions Limited's Board approved unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported a loss of Rs 3.95 crores for the quarter and Rs 10.68 crores for the half-year period. Revenue from operations was Rs 42.52 crores for the quarter and Rs 83.19 crores for the half-year. The company has accumulated losses of Rs 49.81 crores as of September 30, 2025. Basic earnings per share stood at negative Rs 0.66 for the quarter and negative Rs 1.79 for the half-year. The auditors noted material uncertainty related to going concern but concluded the company can continue as a going concern. The company operates exclusively in the garments segment.",
            "Sentiment": "negative",
            "PublishDate": 1762756600762,
            "Source": "earnings"
        },
        {
            "Title": "Celebrity Fashions Limited Reports Rs 6.73 Crore Loss for Quarter Ended June 2025, Appoints New Secretarial Auditors",
            "Summary": "Celebrity Fashions Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing a net loss of Rs 6.73 crores compared to Rs 8.56 crores loss in the same quarter last year. Revenue from operations increased to Rs 40.67 crores from Rs 36.24 crores year-over-year. The company has accumulated losses of Rs 45.87 crores as of June 30, 2025. The Board also approved the appointment of BP & Associates as Secretarial Auditors for five consecutive years from FY 2025-26 to FY 2029-30, subject to shareholder approval at the 36th Annual General Meeting. The firm has over two decades of experience in corporate law, capital markets, and securities laws. Basic and diluted earnings per share stood at negative Rs 1.13 for the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754984646149,
            "Source": "earnings"
        },
        {
            "Title": "Celebrity Fashions Plans to Consolidate Chennai Plant Operations",
            "Summary": "Celebrity Fashions announced plans to combine its Chennai plant operations by shutting down one manufacturing unit. The consolidation move aims to streamline the company's production facilities in the Chennai region.",
            "Sentiment": "neutral",
            "PublishDate": 1753844904709,
            "Source": "stock"
        },
        {
            "Title": "Celebrity Fashions Limited Closes Vellanur Plant, Appoints New Company Secretary",
            "Summary": "Celebrity Fashions Limited's Board of Directors approved the closure and merger of its manufacturing and washing plant in Vellanur with existing facilities in Tambaram, Chennai. The Vellanur plant contributed ₹43.84 crores (26.53% of turnover) during the last financial year. The closure is scheduled for August 15, 2025, citing strategic considerations. The company also appointed S. Vivekanandan as Company Secretary and Compliance Officer, effective July 29, 2025. Vivekanandan is an Associate Member of the Institute of Company Secretaries of India with experience in corporate laws and compliance functions.",
            "Sentiment": "neutral",
            "PublishDate": 1753808658858,
            "Source": "corporate_action"
        }
    ]
}