{
    "Symbol": "CELLECOR",
    "ISIN": "INE0OMO01025",
    "News": [
        {
            "Title": "Cellecor Gadgets Reports 50.7% Revenue Growth in H1 FY26",
            "Summary": "NSE-SME listed Cellecor Gadgets posted strong H1 FY26 results with total income rising 50.7% YoY to ₹641.60 crores. Net profit grew 35.2% to ₹19.60 crores despite margin compression from higher input costs.",
            "Sentiment": "positive",
            "PublishDate": 1768839673231,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cellecor Gadgets: Stock Surges Amid Market Decline on New Product Launch",
            "Summary": "Cellecor Gadgets' stock price rose over 2% intraday, reaching ₹43.90, despite overall market decline. The company announced the launch of a new range of Fully Automatic Top Load Washing Machines in May 2025, produced in collaboration with Dixon Technologies.",
            "Sentiment": "positive",
            "PublishDate": 1747116876000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cellecor Gadgets: SME Stock Expands Retail Footprint with New Store in Punjab",
            "Summary": "Cellecor Gadgets, a small-cap SME stock, announced the opening of its eighth exclusive brand store in Barnala, Punjab. This expansion is part of the company's strategy to enhance brand visibility and strengthen its offline presence. The new store will showcase Cellecor's full product range, including smart TVs, home appliances, and wearables.",
            "Sentiment": "positive",
            "PublishDate": 1746163750000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cellecor Gains Access to Over 2,000 Core Patents and Advanced R&D",
            "Summary": "Cellecor has announced that it will gain access to more than 2,000 core patents and advanced research and development capabilities. This development is likely to significantly enhance the company's technological portfolio and innovation potential.",
            "Sentiment": "positive",
            "PublishDate": 1745833274000,
            "Source": "default"
        },
        {
            "Title": "Cellecor Gadgets Signs NDA with Shenzhen H&T for Intelligent Control Technology",
            "Summary": "Cellecor Gadgets has entered into a strategic non-disclosure agreement (NDA) with Shenzhen H&T Intelligent Control Co. The partnership aims to develop a facility specializing in intelligent controllers, sensors, chips, semiconductor components, and integrated smart solutions.",
            "Sentiment": "positive",
            "PublishDate": 1745833235000,
            "Source": "default"
        },
        {
            "Title": "Cellecor Gadgets Board Approves Rs 1 Billion Fundraising",
            "Summary": "The board of directors of Cellecor Gadgets has approved raising funds amounting to Rs 1 billion (approximately $12 million USD). This decision indicates the company's intent to secure additional capital, potentially for expansion, debt reduction, or other strategic initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1744877752000,
            "Source": "default"
        },
        {
            "Title": "Cellecor Gadgets Reports Mixed H2 FY25 Financial Results",
            "Summary": "Cellecor Gadgets announced its H2 FY25 financial results. EBITDA increased to 289M rupees from 253M in H1 FY25, but the EBITDA margin decreased to 4.82% from 5.9%. Net profit rose to 163M rupees from 91M year-over-year, while revenue doubled to 6B rupees from 3B. However, the EBITDA margin declined year-over-year from 5.81% to 4.82%.",
            "Sentiment": "neutral",
            "PublishDate": 1744877588000,
            "Source": "result"
        },
        {
            "Title": "Cellecor Gadgets: Board Meeting Set to Consider ₹100 Crore Fundraise",
            "Summary": "Cellecor Gadgets has scheduled a board meeting on April 16, 2025, to consider Q4 FY25 financial results and a potential ₹100 crore fundraise through securities issuance. The company will also discuss business growth plans for upcoming quarters. Trading window for insiders will remain closed from April 1, 2025, until 48 hours after the board meeting concludes.",
            "Sentiment": "positive",
            "PublishDate": 1743921368000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cellecor Gadgets Expands in South India through Retail Partnerships",
            "Summary": "Cellecor Gadgets has formed partnerships with B New Mobiles and Celekt retail chains to expand its presence in South India. The company projects an annual business of INR 500 million through these collaborations, indicating a significant growth strategy in the region's consumer electronics market.",
            "Sentiment": "positive",
            "PublishDate": 1742256144000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cellecor Gadgets Expands in South India Through Retail Partnerships",
            "Summary": "Cellecor Gadgets has announced a strategic partnership with B New Mobiles and Celekt retail chains to expand its presence in South India. The company projects an annual business of INR 500 million through this collaboration, which aims to strengthen Cellecor's market position in the region.",
            "Sentiment": "positive",
            "PublishDate": 1742211218000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cellecor Gadgets Partners with Zepto for Product Distribution",
            "Summary": "Cellecor Gadgets has formed a partnership with Zepto, enabling customers to purchase Cellecor's product range through Zepto's rapid delivery network. This collaboration aims to enhance the accessibility and convenience of Cellecor's products for consumers.",
            "Sentiment": "positive",
            "PublishDate": 1741220832000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cellecor Gadgets Partners with Zepto for Rapid Product Delivery",
            "Summary": "Cellecor Gadgets has announced a partnership with Zepto, enabling customers to purchase Cellecor's range of products through Zepto's rapid delivery network. This collaboration aims to provide seamless and quick access to Cellecor's products for Zepto users.",
            "Sentiment": "positive",
            "PublishDate": 1741174717000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cellecor Gadgets Partners with Rockingdeals to Expand Offline Presence",
            "Summary": "Cellecor Gadgets has announced a partnership with Rockingdeals to expand its offline presence. The collaboration will allow Cellecor Gadgets to leverage Rockingdeals' network to increase its physical retail footprint.",
            "Sentiment": "positive",
            "PublishDate": 1740702247000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cellecor Gadgets Partners with Rockingdeals to Expand Offline Presence",
            "Summary": "Cellecor Gadgets has announced a partnership with Rockingdeals to expand its offline presence. The collaboration will allow Cellecor to leverage Rockingdeals' network to increase its physical retail footprint.",
            "Sentiment": "positive",
            "PublishDate": 1740656801000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cellecor Gadgets: Expands Retail Presence with New Stores in Bihar and Maharashtra",
            "Summary": "Cellecor Gadgets opened its sixth and seventh exclusive stores in Sasaram, Bihar and Nanded, Maharashtra. The company aims to tap into Bihar's $2.33 billion appliance market and Maharashtra's $5.8 billion market. Cellecor offers a range of consumer electronics products including mobile phones, smart TVs, and appliances.",
            "Sentiment": "positive",
            "PublishDate": 1738738675000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cellecor Gadgets Expands Product Line in Electronics Segment",
            "Summary": "Cellecor Gadgets has announced the launch of new products in both the commercial and consumer electronics segments. This move indicates the company's efforts to expand its market presence and diversify its product offerings.",
            "Sentiment": "positive",
            "PublishDate": 1737719473000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cellecor Gadgets: Small-Cap Stock Surges on Dixon Tech Partnership",
            "Summary": "Cellecor Gadgets shares hit 5% upper circuit after announcing partnership with Dixon Technologies subsidiary for manufacturing premium refrigerators. The stock closed at ₹64.25, up 4.98% from previous close. Cellecor aims to strengthen its presence in the home appliance market through this collaboration.",
            "Sentiment": "positive",
            "PublishDate": 1735286026000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cellecor Gadgets Partners with Moglix for Market Expansion",
            "Summary": "Cellecor Gadgets has formed a partnership with Moglix to expand its market reach. The company will utilize Moglix's B2B and B2C e-commerce networks to introduce its consumer electronics and appliances to a broader audience.",
            "Sentiment": "positive",
            "PublishDate": 1735041813000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cellecor Gadgets Partners with Epack Durable for Air Conditioner Manufacturing",
            "Summary": "Cellecor Gadgets has entered into a partnership with Epack Durable Pvt Ltd to enhance its air conditioner manufacturing capabilities. This collaboration aims to strengthen Cellecor's position in the air conditioner market by leveraging Epack Durable's expertise in manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1734482392000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cellecor Gadgets Partners with Epack Durable for Air Conditioner Manufacturing",
            "Summary": "Cellecor Gadgets has announced a partnership with Epack Durable Pvt Ltd to enhance its air conditioner manufacturing capabilities. This collaboration aims to strengthen Cellecor's position in the air conditioner market by leveraging Epack Durable's expertise in manufacturing durable goods.",
            "Sentiment": "positive",
            "PublishDate": 1734435428000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cellecor Gadgets: SME Stock Hits 5% Upper Circuit, Surges Nearly 170% in One Year",
            "Summary": "Cellecor Gadgets stock hit a 5% upper circuit at ₹58.70 on NSE, marking its second consecutive day of gains. The company recently announced a business update about its cooler segment, sparking investor interest.",
            "Sentiment": "positive",
            "PublishDate": 1733901840000,
            "Source": "normal_news"
        },
        {
            "Title": "Cellecor Gadgets Enters Cooler Market with Strong Initial Orders",
            "Summary": "Cellecor Gadgets has launched a new range of high-performance coolers to meet various cooling needs. The company reports significant initial success, securing confirmed advance orders for 42,000 units within the first week of launch. Dispatches for 10,000 units have already begun.",
            "Sentiment": "positive",
            "PublishDate": 1733838318000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cellecor Gadgets Announces Partnerships to Enhance Supply Chain Operations",
            "Summary": "Cellecor Gadgets has formed partnerships with four logistics companies: TCI Express, DTDC Express, OM Logistics, and Express Roadways Pvt Ltd. These collaborations are aimed at improving the company's supply chain operations, potentially leading to more efficient distribution and delivery of their gadgets and products.",
            "Sentiment": "positive",
            "PublishDate": 1733788648000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cellecor Gadgets Announces Logistics Partnerships to Enhance Supply Chain",
            "Summary": "Cellecor Gadgets has formed partnerships with multiple logistics companies including TCI Express, DTDC Express, OM Logistics, and Express Roadways Pvt Ltd. These collaborations aim to improve the company's supply chain operations, potentially leading to more efficient product distribution and delivery.",
            "Sentiment": "positive",
            "PublishDate": 1733745157000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cellecor Gadgets to Launch New Sound Systems Series in January",
            "Summary": "Cellecor Gadgets has announced plans to introduce a new series of sound systems in January. The company describes these upcoming products as 'highly anticipated,' suggesting significant interest or innovation in the line.",
            "Sentiment": "positive",
            "PublishDate": 1732550408000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cellecor Gadgets: Kareena Kapoor Khan Becomes Brand Ambassador for Smart TVs",
            "Summary": "Cellecor Gadgets Limited appoints Bollywood star Kareena Kapoor Khan as brand ambassador for their Smart TV line. The company's shares rose 5% to Rs 63.90 intraday. The partnership aims to enhance Cellecor's position in the growing Smart TV market through a national advertising campaign. H1FY25 results show 103% increase in net sales to Rs 425.71 crores and 108.3% rise in net profit to Rs 14.62 crores.",
            "Sentiment": "positive",
            "PublishDate": 1730360592000,
            "Source": "normal_news"
        },
        {
            "Title": "Cellecor Gadgets Partners with Dixon Technologies for Washing Machine Production",
            "Summary": "Cellecor Gadgets has announced a partnership with Dixon Technologies to manufacture high-quality washing machines. This collaboration aims to expand Cellecor's product lineup and strengthen its position in the home appliances segment.",
            "Sentiment": "positive",
            "PublishDate": 1730116991000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cellecor Gadgets: Retail Expansion in South India and Gujarat",
            "Summary": "Cellecor Gadgets Ltd is expanding its retail networks in South India and Gujarat through partnerships with major retail chains. The company aims to achieve over Rs 100 crore in business from these regions within a year. Key partnerships include Sangeetha Mobiles and Cellbay in Telangana and Andhra Pradesh, and Poojara Telecom, PhoneWale, Umiya Mobile, and Ramdev Mobiles in Gujarat.",
            "Sentiment": "positive",
            "PublishDate": 1729670674000,
            "Source": "normal_news"
        },
        {
            "Title": "Cellecor Gadgets: Strategic Partnership Boosts South Indian Retail Presence",
            "Summary": "Cellecor Gadgets partners with Sathya Agencies to expand in Tamil Nadu, Pondicherry, and Andhra Pradesh. Initial order of Rs 25 million received, with projected 12-month business of Rs 600-800 million. H1 FY25 results show net revenue of Rs 425.71 crore, up from Rs 209.66 crore in H1 FY24. Net profit increased by 108.26% to Rs 14.62 crore.",
            "Sentiment": "positive",
            "PublishDate": 1729334928000,
            "Source": "normal_news"
        },
        {
            "Title": "Cellecor Gadgets Expands Retail Presence in South India",
            "Summary": "Cellecor Gadgets has announced a collaboration with Sathya Agencies Pvt. Ltd. to expand its retail presence in South India. This partnership aims to increase Cellecor's market reach and availability in the region.",
            "Sentiment": "positive",
            "PublishDate": 1729253589000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cellecor Gadgets: 5% Surge Hits 52-Week High Amid Strong Financials",
            "Summary": "Cellecor Gadgets stock reached a new 52-week high of Rs 71.80, up 5% in upper circuit. The company reported a 103% increase in net sales to Rs 425.71 crore for H1 FY25, with net profit up 108.3% to Rs 14.62 crore. Cellecor recently partnered with OSIA Hyper Retail Limited in Gujarat and executed a 10:1 stock split in August 2024.",
            "Sentiment": "positive",
            "PublishDate": 1729071647000,
            "Source": "normal_news"
        },
        {
            "Title": "Cellecor Gadgets Reports Significant Revenue Growth in Q2",
            "Summary": "Cellecor Gadgets, a company listed on the SME (Small and Medium Enterprise) exchange, has reported a substantial increase in its second-quarter revenue. The company's Q2 revenue reached 4.3 billion rupees, compared to 2.1 billion rupees in the same quarter of the previous year, representing a year-over-year growth of approximately 105%.",
            "Sentiment": "positive",
            "PublishDate": 1729058770000,
            "Source": "result"
        },
        {
            "Title": "Cellecor Gadgets Reports Significant Q2 Profit Growth",
            "Summary": "Cellecor Gadgets, an SME company, has reported a substantial increase in its second-quarter net profit. The company's net profit for Q2 reached 146 million rupees, compared to 70 million rupees in the same period last year, representing a year-over-year growth of approximately 108.6%.",
            "Sentiment": "positive",
            "PublishDate": 1729058694000,
            "Source": "result"
        },
        {
            "Title": "Cellecor Gadgets: Shares Surge 5% on OSIA Hyper Retail Partnership",
            "Summary": "<p><span class='positive'>Cellecor Gadgets</span> stock hit <span class='positive'>5% upper circuit</span> at ₹54.40 after announcing <span class='positive'>partnership</span> with <b>OSIA Hyper Retail</b>. The company <span class='positive'>expects</span> business in Gujarat to <span class='positive'>exceed 100 crores</span> in next 12 months through OSIA's <span class='neutral'>43-store network</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728379332000,
            "Source": "normal_news"
        },
        {
            "Title": "Cellecor Gadgets Partners with Osia Hyper Retail for Gujarat Expansion",
            "Summary": "<p><span class='positive'>Cellecor Gadgets</span> has formed a <b>partnership</b> with <span class='positive'>Osia Hyper Retail Ltd</span> to <span class='positive'>expand</span> its retail presence in <b>Gujarat</b>. This collaboration will allow Cellecor to <span class='positive'>introduce</span> its range of appliances and smart gadgets through Osia Hypermart's <span class='positive'>extensive retail network</span> across the state.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728300764000,
            "Source": "corporate_action"
        }
    ]
}