{
    "Symbol": "CELLO",
    "ISIN": "INE0LMW01024",
    "News": [
        {
            "Title": "Cello World Q3FY26 Earnings Call on Feb 16, 2026",
            "Summary": "Cello World Limited schedules earnings conference call for February 16, 2026 at 9:00 AM IST to discuss Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770821475553,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cello World Gets ESOP Listing Approval from NSE, BSE",
            "Summary": "Cello World Limited received in-principle approval from NSE and BSE for listing up to 66,26,551 equity shares under CELLO ESOP-2025 scheme on January 05, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767620254901,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cello World Receives GST Order on Product Classification",
            "Summary": "Cello World Limited receives Order-in-Original from GST authorities regarding alleged misclassification of polyurethane insulated products. Company plans to file appeal against the order.",
            "Sentiment": "negative",
            "PublishDate": 1766067043438,
            "Source": "stocks"
        },
        {
            "Title": "Cello World Leases Trademark for Stationery Business, Targets ₹200 Crore Revenue",
            "Summary": "Cello World has entered into an agreement to lease the 'cello brand' trademark for stationery and writing instruments from CPIW. The company anticipates generating revenues of ₹200 crore from this brand in its first year of operations beginning January 2026.",
            "Sentiment": "positive",
            "PublishDate": 1764029056037,
            "Source": "stock"
        },
        {
            "Title": "Cello World Reports 20% Revenue Growth, Acquires Cello Brand for Writing Instruments",
            "Summary": "Cello World achieved revenues of INR 587 crores in Q2 FY26 with 20% year-on-year growth, crossing INR 1,000 crores on half-yearly basis for the first time. The company is acquiring the Cello brand for writing instruments and stationery from BIC through promoter group entity CPIW, which will be leased to operate alongside existing Unomax brand.",
            "Sentiment": "positive",
            "PublishDate": 1763458814480,
            "Source": "earnings"
        },
        {
            "Title": "Cello World Reports No Deviation in QIP Fund Utilization for September 2025 Quarter",
            "Summary": "Cello World Limited's monitoring agency CARE Ratings confirmed no deviation from stated objectives in the utilization of Rs. 737.32 crore raised through QIP, though there has been delay in Object 1 implementation with timeline extended to March 2026. The company has utilized Rs. 675.81 crore across various objectives including subsidiary investments, debt repayments, and working capital augmentation, with Rs. 61.51 crore remaining unutilized and invested in mutual funds.",
            "Sentiment": "neutral",
            "PublishDate": 1763148168540,
            "Source": "corporate_action"
        },
        {
            "Title": "Cello World Acquires 'Cello' Brand Trademark from Bic Group for Stationery Business",
            "Summary": "Cello World has purchased the trademark for the 'Cello' brand from Bic Group and plans to reintroduce it for stationery and writing tools. The company will operate under both the Cello and Unomax brands going forward.",
            "Sentiment": "positive",
            "PublishDate": 1762858424259,
            "Source": "stock"
        },
        {
            "Title": "Cello World Reports 20% Revenue Growth to Rs 587 Crores in Q2",
            "Summary": "Cello World Limited announced its quarterly results with revenue from operations reaching Rs 587.4 crores, marking a 20% year-on-year growth. The company achieved an EBITDA of Rs 141.3 crores with a margin of 24.0%, compared to 26.9% in the previous year. Profit after tax attributable to owners was Rs 85.7 crores, up 5% from Rs 81.6 crores. For the half-year period, revenue stood at Rs 1,116.5 crores with 13% growth. The Consumer Ware segment led performance with Rs 422.2 crores revenue, growing 23% year-on-year. Writing Instruments generated Rs 81.0 crores (16% growth) and Moulded Furniture contributed Rs 84.3 crores (8% growth). The company's Glass plant in Falna is operating at 55% utilization and is expected to reach 80% by Q4. Chairman Managing Director Pradeep Rathod attributed the performance to strong festive momentum and noted minimal impact from recent GST rate changes. The company operates 14 manufacturing facilities and has a distribution network of 4,000 distributors and 150,000 retailers across India.",
            "Sentiment": "positive",
            "PublishDate": 1762826173883,
            "Source": "earnings"
        },
        {
            "Title": "Cello World Reports 17.8% Revenue Growth in Q2 FY26 with Strong Profitability",
            "Summary": "Cello World Limited announced its quarterly results for the quarter ended September 30, 2025. On a consolidated basis, the company reported revenue from operations of Rs 987.44 crores compared to Rs 490.09 crores in the previous quarter, representing significant growth. Net profit after tax reached Rs 171.98 crores for the six-month period ended September 30, 2025, compared to Rs 175.91 crores in the corresponding period last year. The company's earnings per share stood at Rs 7.18 for the six-month period. Total comprehensive income for the six months was Rs 272.69 crores. The board meeting was held on November 10, 2025, where directors approved the unaudited standalone and consolidated financial results. The company continues to focus on consumer products as its primary business segment. A dividend of Rs 1.50 per equity share for financial year 2024-25 was previously approved by shareholders at the Annual General Meeting held on August 8, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762824701269,
            "Source": "earnings"
        },
        {
            "Title": "Cello World Reports 4.9% Growth in Q2 Net Profit to 856.6 Million Rupees",
            "Summary": "Cello World reported Q2 consolidated net profit of 856.6 million rupees compared to 816.4 million rupees in the same period last year. Revenue increased to 5.87 billion rupees from 4.9 billion rupees year-over-year. EBITDA rose to 1.28 billion rupees from 1.18 billion rupees, while EBITDA margin declined to 21.73% from 24.2% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762792415403,
            "Source": "earnings"
        },
        {
            "Title": "Cello World Receives ESG Rating of 60 (Grade C) from CFC Finlease",
            "Summary": "Cello World Limited has been assigned an ESG rating of 60 (Grade C) categorized as 'Average' by CFC Finlease Private Limited, a SEBI registered ESG Rating Provider. The rating was assigned voluntarily without the company engaging the rating agency's services. CFC Finlease prepared the report independently using publicly available data pertaining to FY2024-25. The company received notification of this rating through an email from BSE Limited, which informed that CFC Finlease had submitted ESG disclosure for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1762483073949,
            "Source": "stock"
        },
        {
            "Title": "Cello World Limited Convenes Shareholder and Creditor Meetings for Composite Scheme of Arrangement",
            "Summary": "Cello World Limited has dispatched notices for separate meetings of equity shareholders and unsecured creditors following an order dated October 7, 2025 from the National Company Law Tribunal, Ahmedabad Bench. The meetings are being held to consider and approve a Composite Scheme of Arrangement among Wim Plast Limited, Cello Consumer Products Private Limited, and Cello World Limited along with their respective shareholders and creditors. The company completed dispatch of meeting notices on November 3, 2025 through electronic mode to equity shareholders whose email addresses were registered as of October 30, 2025. The notices and accompanying documents have been made available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1762204992208,
            "Source": "corporate_action"
        },
        {
            "Title": "Cello World Limited Shareholders Approve Re-appointment of Key Directors Through Postal Ballot",
            "Summary": "Cello World Limited announced the results of its postal ballot conducted through electronic voting, with shareholders approving four ordinary resolutions for director re-appointments. The company received approval for re-appointing Pradeep Ghisulal Rathod as Chairman and Managing Director with 92.70% votes in favor, Pankaj Ghisulal Rathod as Joint Managing Director with 92.94% approval, and Gaurav Pradeep Rathod as Joint Managing Director with 92.94% support. Additionally, Gagandeep Singh Chhina's re-appointment as Non-Executive, Non-Independent Director received overwhelming approval with 99.35% votes in favor. The postal ballot notice was issued on October 1, 2025, with voting conducted electronically from October 2 to October 31, 2025. All appointments are for a five-year term from November 11, 2025, to November 10, 2030. The scrutinizer's report was submitted by CS Dharmesh Sarvaiya on November 3, 2025, confirming the validity of the voting process and results.",
            "Sentiment": "positive",
            "PublishDate": 1762203967750,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cello World Reports 6% Revenue Growth to INR 529 Crores in Q1 FY26 Amid Margin Pressures",
            "Summary": "Cello World Limited reported revenue of INR 529 crores for Q1 FY26, representing 6% year-on-year growth compared to INR 501 crores in Q1 FY25. The Consumerware segment drove growth with 12% increase, led by glassware business which grew 50%. However, the company achieved its highest-ever gross profit margin of 54% but EBITDA margin declined to 24%. PAT stood at INR 73 crores with 14% margin. Writing Instruments segment faced challenges with revenue declining to INR 74 crores from INR 83 crores due to export demand slowdown and domestic sales pressure. Furniture business remained subdued at INR 90 crores. The new glassware facility in Falna contributed INR 15-16 crores in sales but operated at losses, impacting overall profitability. Management cited margin pressure from increased sales promotion activities, higher energy costs in Daman, wage increases, and inability to raise prices due to competitive environment. The company maintained revenue guidance of 12-15% growth for the full year but revised EBITDA margin guidance to around 23% from earlier expectations.",
            "Sentiment": "neutral",
            "PublishDate": 1755671581115,
            "Source": "earnings"
        },
        {
            "Title": "Cello World Plans Multi-Segment Expansion Strategy",
            "Summary": "Cello World is pursuing an aggressive expansion strategy across multiple segments. The company's plans include adding new capacity, diversifying into different categories, and positioning premium brands to meet growing consumer demand.",
            "Sentiment": "positive",
            "PublishDate": 1755016072642,
            "Source": "stock"
        },
        {
            "Title": "Cello World Limited Passes All 14 Resolutions at 7th Annual General Meeting",
            "Summary": "Cello World Limited held its 7th Annual General Meeting on August 8, 2025, via video conferencing where all 14 proposed resolutions were passed with requisite majority. The approved resolutions included adoption of audited financial statements for FY 2024-25, declaration of 30% dividend (Rs. 1.5 per equity share), reappointment of Managing Director Pradeep Ghisulal Rathod, and appointment of Sarvaiya & Co as Secretarial Auditor for five years. The company also approved reappointment of five Non-Executive Independent Directors effective July 28, 2025, adoption of revised Articles of Association, and approval of Employee Stock Option Scheme 2025 for company and subsidiary employees. The voting was conducted through remote e-voting and e-voting during the AGM, with shareholders holding shares as of August 1, 2025 cutoff date eligible to vote.",
            "Sentiment": "positive",
            "PublishDate": 1755009074678,
            "Source": "corporate_action"
        },
        {
            "Title": "Cello World Reports Q1 FY26 Results and Approves Key Executive Re-appointments",
            "Summary": "Cello World Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 281.93 crores compared to Rs 259.95 crores in the same quarter last year, with profit after tax of Rs 16.04 crores versus Rs 16.76 crores in Q1 FY25. On a consolidated basis, revenue from operations stood at Rs 529.01 crores against Rs 500.66 crores in the previous year quarter, with profit after tax of Rs 80.65 crores compared to Rs 89.12 crores. The Board also approved re-appointments of key executives for a five-year term from November 11, 2025 to November 10, 2030, subject to shareholder approval: Mr. Pradeep Ghisulal Rathod as Chairman and Managing Director, Mr. Pankaj Ghisulal Rathod as Joint Managing Director, Mr. Gaurav Pradeep Rathod as Joint Managing Director, and Mr. Gagandeep Singh Chhina as Non-Executive Non-Independent Director. The company reported no deviation in the utilization of funds raised through its Qualified Institutional Placement of Rs 738 crores in July 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1754926345817,
            "Source": "earnings"
        },
        {
            "Title": "Cello World Reports Mixed Q1 Results with Revenue Growth but Lower Profitability",
            "Summary": "Cello World reported quarterly revenue of 5.29 billion rupees, up from 5 billion rupees in the same period last year. However, the company's profitability declined with consolidated net profit falling to 730 million rupees from 826 million rupees year-over-year. EBITDA dropped to 1.09 billion rupees compared to 1.29 billion rupees previously, while EBITDA margin compressed to 20.61% from 25.75% in the prior year period.",
            "Sentiment": "negative",
            "PublishDate": 1754925194873,
            "Source": "earnings"
        },
        {
            "Title": "Cello World Reports Q4 Results and Recommends Final Dividend",
            "Summary": "Cello World has announced its Q4 financial results and dividend recommendation. The company's Q4 revenue increased to 5.9 billion rupees from 5.12 billion rupees year-over-year. EBITDA slightly improved to 1.35 billion rupees from 1.33 billion rupees, although the EBITDA margin decreased to 22.96% from 25.93%. Consolidated net profit for Q4 was 881.9 million rupees, down from 888 million rupees year-over-year but up from 864 million rupees quarter-over-quarter. The company has recommended a final dividend of 1.50 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1748016245000,
            "Source": "result"
        },
        {
            "Title": "Cello World: Shares Rally 7% on Kotak Equities Upgrade",
            "Summary": "Cello World shares rose 7% after Kotak Institutional Equities upgraded the stock to 'buy' with a target price of Rs 710. The upgrade is based on easing inventory concerns, ramp-up of new glassware unit, and potential revenue growth recovery. The company expects 12-14% revenue growth in FY2026, with the new glassware plant contributing significantly.",
            "Sentiment": "positive",
            "PublishDate": 1744872092000,
            "Source": "normal_news"
        },
        {
            "Title": "Cello World Ltd: Fire Incident at Subsidiary's Daman Facility",
            "Summary": "A fire broke out at Cello Industries Private Ltd's Opal division in Daman on February 18, 2025. The incident occurred in one furnace and was quickly controlled. No casualties reported. The company has adequate insurance coverage and is assessing financial impact.",
            "Sentiment": "neutral",
            "PublishDate": 1739896398000,
            "Source": "normal_news"
        },
        {
            "Title": "Cello World Reports Q3 EBITDA and Margin Decline",
            "Summary": "Cello World announced its Q3 financial results. The company's EBITDA decreased to 1.27 billion rupees from 1.32 billion rupees in the same quarter last year. Additionally, the EBITDA margin declined to 22.86% from 25.06% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739285860000,
            "Source": "earnings"
        },
        {
            "Title": "Cello World Reports Q3 Financial Results",
            "Summary": "Cello World announced its Q3 financial results. The company's consolidated net profit increased to 863 million rupees, up from 849 million rupees year-over-year and 816 million rupees quarter-over-quarter. Revenue for Q3 rose to 5.6 billion rupees, compared to 5.3 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739285802000,
            "Source": "earnings"
        },
        {
            "Title": "Cello World to Consider Q3 Results on February 11",
            "Summary": "Cello World has announced that it will consider its third quarter (Q3) financial results on February 11. This indicates the company is preparing to review and potentially approve its quarterly financial performance report.",
            "Sentiment": "neutral",
            "PublishDate": 1738760728000,
            "Source": "corporate_action"
        },
        {
            "Title": "Anti-Dumping Duty Recommended on Chinese Vacuum Insulated Flasks",
            "Summary": "The authority has recommended imposing an anti-dumping duty on imports of vacuum insulated flasks and other stainless steel vacuum vessels from China PR. This measure is aimed at addressing dumping practices and protecting the domestic industry from injury.",
            "Sentiment": "positive",
            "PublishDate": 1734785387000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cello World Reports Q2 EBITDA and Margin",
            "Summary": "Cello World announced its Q2 financial results. The company's EBITDA for the quarter was 1.19 billion rupees, slightly down from 1.2 billion rupees in the same quarter last year. The EBITDA margin also saw a minor decrease, standing at 24.2% compared to 24.6% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1731430949000,
            "Source": "result"
        },
        {
            "Title": "Cello World Reports Stable Q2 Revenue",
            "Summary": "Cello World has announced its Q2 revenue of 4.9 billion rupees, which remains unchanged compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731430942000,
            "Source": "result"
        },
        {
            "Title": "Cello World Reports Q2 FY24 Financial Results",
            "Summary": "Cello World announced its Q2 consolidated net profit of 816.4 million rupees, showing a year-over-year increase from 799.9 million rupees and a quarter-over-quarter decrease from 825.8 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1731430934000,
            "Source": "result"
        },
        {
            "Title": "Cello World Commissions Glassware Manufacturing Facility in Rajasthan",
            "Summary": "Cello World has announced the commissioning of a new glassware manufacturing facility in Rajasthan. This development indicates an expansion of the company's production capabilities in the glassware segment.",
            "Sentiment": "positive",
            "PublishDate": 1731344565000,
            "Source": "corporate_action"
        }
    ]
}