{
    "Symbol": "CEMPRO",
    "ISIN": "INE686A01026",
    "News": [
        {
            "Title": "Cemindia Projects Q3 Net Profit Rises 26.4% YoY",
            "Summary": "Cemindia Projects reported consolidated net profit of 1.1 billion rupees in Q3, up from 870 million rupees year-over-year, while revenue grew to 23.15 billion rupees from 22.7 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1770298148047,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cemindia Projects Postal Ballot Results Declared",
            "Summary": "Cemindia Projects Limited announces successful completion of postal ballot voting with both ordinary and special resolutions approved by requisite majority on January 27, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769513444156,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cemindia Projects Board Meet Set for Feb 5, 2026",
            "Summary": "Cemindia Projects Limited has scheduled a board meeting on February 5, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed from January 1-February 8, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768393815391,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cemindia Projects Changes Statutory Auditors as Part of Adani Group Alignment Strategy",
            "Summary": "Cemindia Projects Limited's Board approved the resignation of statutory auditor TR Chadha & Co LLP and appointed PriceWaterhouse Chartered Accountants LLP as replacement auditors. TR Chadha & Co LLP resigned effective November 5, 2025, citing the company's alignment with Adani Group processes for appointing globally affiliated audit firms for major listed companies. The outgoing auditors completed their audit work for the year ended March 31, 2025, and limited review for the quarter and half-year ended September 30, 2025, with no concerns raised. PriceWaterhouse Chartered Accountants LLP will conduct the audit for financial year 2025-26 and hold office until the 48th Annual General Meeting in 2026, subject to member approval. The appointment requires shareholder approval through general meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1762376073471,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cemindia Projects Acquires 26% Stake in Morsagar Bisalpur Water Limited",
            "Summary": "Cemindia Projects Limited will subscribe for 2,600 shares of Rs 10 each, representing a 26% stake in Morsagar Bisalpur Water Limited (MBWL). MBWL was incorporated on November 3, 2025, with a subscribed capital of Rs 1,00,000 divided into 10,000 equity shares. The company has not yet commenced business operations and has nil turnover. MBWL's business objective is to design, finance, develop, construct, operate, and maintain the MorSagar Artificial Reservoir and feeder from Bisalpur to MorSagar Artificial Reservoir in Rajasthan under a Hybrid Annuity Model. The remaining 74% stake will be held by Adani Enterprises Limited, identified as a related party. MBWL is registered with the Registrar of Companies, Ahmedabad.",
            "Sentiment": "neutral",
            "PublishDate": 1762309938334,
            "Source": "order&deals"
        },
        {
            "Title": "Cemindia Projects Reports Strong Q2FY26 Results with 49% PAT Growth and Secures ₹3,258 Crores in New Orders",
            "Summary": "Cemindia Projects Limited announced its financial results for the quarter ended September 30, 2025. Consolidated revenue grew 9.3% year-on-year to ₹2,175 crores. EBITDA increased 18.6% to ₹242 crores with margin improving to 11.1% from 10.3%. PAT surged 49% to ₹108 crores with margin expanding to 5.0% from 3.6%. For the half-year period, revenue grew 7.9% to ₹4,718 crores, EBITDA rose 12.5% to ₹497 crores, and PAT jumped 42% to ₹245 crores. The company secured new orders worth ₹3,258 crores during the quarter, taking total H1FY26 orders to ₹6,189 crores. Total order book stands at ₹20,646 crores as of September 30, 2025. The company received credit rating upgrades from CARE (to CARE A+ Stable) and ICRA (to ICRA A+ Stable). The Board also approved the elevation of Mr. Arnab Das to Senior Management Personnel category effective November 1, 2025. Net worth stood at ₹2,051 crores with net debt of ₹510 crores, resulting in a debt-to-equity ratio of 0.25x.",
            "Sentiment": "positive",
            "PublishDate": 1761851651228,
            "Source": "earnings"
        },
        {
            "Title": "Cemindia Targets 20%+ Order Book Growth with ₹10,000+ Cr Project Pipeline",
            "Summary": "Cemindia has set a target for over 20% order book growth in FY26-FY27, backed by a project pipeline exceeding ₹10,000 crores. The pipeline spans metro, port, hydro, and data-center EPC projects. The company is focusing on urban infrastructure and water management segments while strengthening execution capacity and expanding into specialist engineering and foundation projects.",
            "Sentiment": "positive",
            "PublishDate": 1761834702307,
            "Source": "stock"
        },
        {
            "Title": "CEMINDIA Projects Reports 50% Jump in Q2 Net Profit to 1.08 Billion Rupees",
            "Summary": "CEMINDIA Projects reported quarterly net profit of 1.08 billion rupees compared to 720.4 million rupees in the same period last year. Revenue increased to 21.7 billion rupees from 18.98 billion rupees year-over-year. EBITDA rose to 2.05 billion rupees from 1.89 billion rupees, while EBITDA margin declined to 9.45% from 9.98% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761821118035,
            "Source": "earnings"
        },
        {
            "Title": "Cemindia Projects Receives Rs 15.05 Crores Payment from Delhi Metro Following Arbitration Award",
            "Summary": "Cemindia Projects Limited received payment of Rs 15.05 crores net of TDS from Delhi Metro Rail Corporation on October 18, 2025, against an arbitration award of Rs 15.84 crores. The company had initiated arbitration proceedings against DMRC for various claims, and a 3-member Arbitral Tribunal passed the award on July 22, 2025. The payment was received at around 2:08 PM on the specified date. DMRC will pay GST on the award amount upon production of documentary evidence. The company stated that the payment will have financial impact on income, cash flow and tax.",
            "Sentiment": "positive",
            "PublishDate": 1760812470725,
            "Source": "stock"
        },
        {
            "Title": "ITD Cementation Rebrands as Cemindia Projects, Submits Compliance Certificate",
            "Summary": "ITD Cementation has undergone a corporate name change to Cemindia Projects. The company has filed a CA compliance certificate with stock exchanges as part of this rebranding process.",
            "Sentiment": "neutral",
            "PublishDate": 1756907684945,
            "Source": "corporate_action"
        },
        {
            "Title": "ITD Cementation Rebrands to Cemindia Projects Limited",
            "Summary": "ITD Cementation has officially rebranded itself as Cemindia Projects Limited after receiving a new incorporation certificate. The company has completed the formal process required for the name change.",
            "Sentiment": "neutral",
            "PublishDate": 1755705482165,
            "Source": "corporate_action"
        },
        {
            "Title": "ITD Cementation Reports 37% Jump in Q1 FY26 Profit, Secures Orders Worth INR 4,300 Crores",
            "Summary": "ITD Cementation India Limited reported strong quarterly results with total operating income of INR 2,542 crores, marking 7% year-on-year growth. The company's profit after tax surged 37% to INR 137 crores compared to INR 100 crores in the corresponding quarter. EBITDA grew 7% to INR 254 crores with margins maintained at 10%. The company secured orders worth over INR 2,900 crores in Q1 FY26 and additional orders of INR 1,300 crores in July, bringing total secured orders to INR 4,300 crores. The company is also L1 in orders worth INR 1,400 crores. Key project developments include completion of TBM breakthrough for Chennai Metro, progress on challenging Dahej project, and successful execution of large-scale piling work in Bangladesh. The company's credit rating was upgraded from A to A+ during the quarter. Management expects revenue growth of 20-25% for FY26 and anticipates securing INR 15,000-16,000 crores in total orders for the year, with approximately 35% expected from group entities. The company maintains a healthy net debt to equity ratio of 0.34x.",
            "Sentiment": "positive",
            "PublishDate": 1754298983262,
            "Source": "earnings"
        },
        {
            "Title": "ITD Cementation and Reliance Infrastructure Mutually Terminate Arbitration Proceedings",
            "Summary": "ITD Cementation India Limited and Reliance Infrastructure Limited have mutually agreed to terminate arbitration proceedings that arose from a works contract dispute. ITD Cementation had filed claims for Rs. 2.85 crore plus interest and arbitration costs, while Reliance Infrastructure had counter-claimed Rs. 59.83 crore with interest. Both parties filed a joint application on July 31, 2025, to unconditionally withdraw their respective claims and counter-claims. The Arbitral Tribunal accepted the application and passed an order terminating the proceedings on the same date. ITD Cementation stated there is no material financial impact on the company due to the settlement.",
            "Sentiment": "positive",
            "PublishDate": 1754041574593,
            "Source": "stock"
        },
        {
            "Title": "ITD Cementation Reports Record Q1 Results with 37% Profit Growth",
            "Summary": "ITD Cementation India Limited reported its highest ever quarterly income of Rs 2,542 crore for the quarter ended June 30, 2025, representing a 7% year-over-year growth. The company achieved its highest quarterly profit after tax of Rs 137 crore, marking a 37% increase compared to the same period last year. EBITDA reached Rs 254 crore, up 7% year-over-year. The company secured new orders worth over Rs 2,900 crore during the quarter and maintains a consolidated order book of Rs 18,820 crore. The company's net debt to equity ratio stands at 0.34x. During the quarter, ITD Cementation became part of the Adani Group after Italian-Thai Development Public Company Limited divested their entire 46.64% shareholding to Renew Elim DMCC, an Adani group company, which became the new promoter effective May 28, 2025. Renew also acquired an additional 20.83% equity stake from public shareholders through an open offer.",
            "Sentiment": "positive",
            "PublishDate": 1753875603785,
            "Source": "earnings"
        },
        {
            "Title": "ITD Cementation Wins Rs. 15.84 Crore Arbitration Award Against Delhi Metro in Contract Dispute",
            "Summary": "ITD Cementation India Limited received an arbitration award of Rs. 15.84 crore plus interest from a 3-member Arbitral Tribunal in its dispute with Delhi Metro Rail Corporation. The dispute arose from a work contract for the Dwarka-Najafgarh corridor, with ITD Cementation seeking damages for delays and scope changes. The company had originally claimed Rs. 57.23 crore but was awarded a partial amount. The arbitration award was passed and received on July 22, 2025. The company stated that financial impact will be determined upon actual receipt of the awarded amount.",
            "Sentiment": "positive",
            "PublishDate": 1753265861615,
            "Source": "stock"
        },
        {
            "Title": "ITD Cementation India: Secures Rs 580 Crore International Marine Contract",
            "Summary": "ITD Cementation India has been awarded a US$67.4 million (approx. Rs 580 crore) contract for jetty construction works for the Ruwais LNG project in Abu Dhabi. The contract reinforces the company's position in the international engineering and construction segment.",
            "Sentiment": "positive",
            "PublishDate": 1751255453000,
            "Source": "order&deals"
        },
        {
            "Title": "ITD Cementation India Secures $67.4 Million International Marine Contract",
            "Summary": "ITD Cementation India has been awarded an international marine contract valued at $67.4 million (Rs 580 crore). The contract is for marine-related work, though specific details about the project or its location are not provided in the given information.",
            "Sentiment": "positive",
            "PublishDate": 1751241490000,
            "Source": "default"
        },
        {
            "Title": "ITD Cementation India: Secures ₹580 Crore Abu Dhabi Contract",
            "Summary": "ITD Cementation India has won a $67.4 million (₹580 crore) contract for jetty construction in Abu Dhabi's Ruwais LNG project. This follows last week's ₹960 crore worth of orders for projects in Kerala and West Bengal. The company's Q4 net profit increased 27% YoY to ₹113.6 crore, with revenue up 10% to ₹2,478.7 crore. A dividend of ₹2 per share was recommended for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1751032787000,
            "Source": "order&deals"
        },
        {
            "Title": "ITD Cementation India Secures $67.4 Million International Marine Contract",
            "Summary": "ITD Cementation India has been awarded an international marine contract valued at $67.4 million. The contract is related to marine work, but no further details about the specific nature of the project or its location are provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1751031195000,
            "Source": "default"
        },
        {
            "Title": "ITD Cementation Lowest Bidder for Kolkata Metro Project",
            "Summary": "ITD Cementation has been selected as the lowest bidder for the Kolkata Metro Birati Project. The project is valued at ₹1,100 crore. This development suggests that ITD Cementation is likely to be awarded the contract for this significant infrastructure project in Kolkata's metro system.",
            "Sentiment": "positive",
            "PublishDate": 1750911855000,
            "Source": "default"
        },
        {
            "Title": "ITD Cementation Reports Strong Project Pipeline and Growth Targets",
            "Summary": "ITD Cementation has reported securing projects worth around ₹4,000 crore so far for the upcoming financial year. The company anticipates a 25% increase in revenue and expects margins to exceed 10% for FY26. Additionally, ITD Cementation aims to achieve an order inflow of ₹15,000 crore in the current year.",
            "Sentiment": "positive",
            "PublishDate": 1750656025000,
            "Source": "default"
        },
        {
            "Title": "ITD Cementation Selected as Lowest Bidder for Projects Worth ₹1,500 Crore",
            "Summary": "ITD Cementation has been announced as the lowest bidder for several projects with a combined value of ₹1,500 crore. The company's selection as the lowest bidder puts it in a strong position to secure these contracts, potentially boosting its order book and future revenue prospects.",
            "Sentiment": "positive",
            "PublishDate": 1750655854000,
            "Source": "default"
        },
        {
            "Title": "ITD Cementation India: Secures Rs 960 Crore in New Orders",
            "Summary": "ITD Cementation India has won two new orders totaling Rs 960 crore. One project involves construction work at Trivandrum International Airport, Kerala, while the other is for a commercial complex in Kolkata, West Bengal. This follows a recent Rs 893 crore contract for a jetty project in Odisha.",
            "Sentiment": "positive",
            "PublishDate": 1750388978000,
            "Source": "order&deals"
        },
        {
            "Title": "ITD Cementation India: Secures ₹960 Crore in New Orders, Reports Q4 Profit Growth",
            "Summary": "ITD Cementation India has won two contracts worth ₹960 crore for projects in Kerala and West Bengal. The company's Q4 net profit increased 27% YoY to ₹113.6 crore, with revenue up 10% to ₹2,478.7 crore. Operating profit rose 18% to ₹259.6 crore. The board recommended a dividend of ₹2 per share for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1750333077000,
            "Source": "order&deals"
        },
        {
            "Title": "ITD Cementation India Secures Contracts Worth ₹9.6 Billion",
            "Summary": "ITD Cementation India has secured contracts totaling ₹9.6 billion for two projects. One project involves work at Trivandrum International Airport, while the other is for a multi-storey commercial building in Kolkata. No further details about the specific nature of the work or project timelines were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1750331615000,
            "Source": "default"
        },
        {
            "Title": "ITD Cementation India: Secures Rs 893 Crore Contract for Odisha Project",
            "Summary": "ITD Cementation India has won a contract worth Rs 893 crore for constructing a Berth & Breakwater for a Greenfield Captive Jetty development in Odisha. The contract includes GST and is part of the company's ordinary business operations.",
            "Sentiment": "positive",
            "PublishDate": 1749526057000,
            "Source": "order&deals"
        },
        {
            "Title": "ITD Cementation India Ltd: Secures ₹893 Crore Odisha Jetty Project",
            "Summary": "ITD Cementation India Ltd has won a new order worth ₹893 crore for constructing berth and breakwater structures for a greenfield captive jetty development in Odisha. This follows a recent ₹593 crore contract for Jaipur International Airport infrastructure works. The company's Q4 results showed a 27% YoY increase in net profit to ₹113.6 crore and a 10% rise in revenue to ₹2,478.7 crore.",
            "Sentiment": "positive",
            "PublishDate": 1749470314000,
            "Source": "order&deals"
        },
        {
            "Title": "ITD Cementation India Secures ₹8.93 Billion Contract",
            "Summary": "ITD Cementation India has been awarded a new contract valued at ₹8.93 billion. The news indicates a positive development for the company in terms of business growth and project acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1749468512000,
            "Source": "default"
        },
        {
            "Title": "ITD Cementation India Ltd: Targets 25-30% Top-Line Growth for FY26",
            "Summary": "ITD Cementation India Ltd aims for 25-30% top-line growth in FY26, focusing on cost control and margin improvement. The company expects significant order booking improvement, with a mix of government and private sector projects. Q4 FY25 saw 18% revenue growth and 27% increase in net profit to Rs 113 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747274378000,
            "Source": "earnings"
        },
        {
            "Title": "ITD Cementation India Ltd: Q4 Profit Surges 27%, Dividend Announced",
            "Summary": "ITD Cementation India Ltd reported a 27% increase in Q4 FY25 net profit to Rs 113 crore. Revenue grew 9.8% to Rs 2,480 crore. EBITDA rose 17.6% with margin expansion to 10.5%. The company announced a final dividend of Rs 2 per share for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1747199588000,
            "Source": "earnings"
        },
        {
            "Title": "ITD Cementation India Ltd: Shares Surge 12% on ₹593 Crore Order Win",
            "Summary": "ITD Cementation India Ltd won a ₹593 crore order for infrastructure works at Jaipur International Airport. The company's Q4 net profit increased 27% to ₹113.6 crore, with revenue up 10% to ₹2,478.7 crore. The board recommended a dividend of 2 per equity share for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1747197290000,
            "Source": "order&deals"
        },
        {
            "Title": "ITD Cementation India Secures ₹5.93 Billion Contract",
            "Summary": "ITD Cementation India has announced the acquisition of a new contract valued at 5.93 billion rupees. This development represents a significant business opportunity for the company and could potentially impact its future financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1747193239000,
            "Source": "default"
        },
        {
            "Title": "ITD Cementation India Reports Strong Q4 Results and Dividend",
            "Summary": "ITD Cementation India has announced its Q4 consolidated net profit of 1.1 billion rupees, up from 895 million rupees year-over-year and 870 million rupees quarter-over-quarter. The company's Q4 revenue increased to 24.8 billion rupees from 22.5 billion rupees in the previous year. Additionally, the company has recommended a dividend of 2 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747181871000,
            "Source": "default"
        },
        {
            "Title": "ITD Cementation India: Q4 Profit Jumps 27%, Dividend Proposed",
            "Summary": "ITD Cementation India's Q4 FY25 net profit rose 27% YoY to ₹113.6 crore. Revenue increased 10% to ₹2,478.7 crore. Operating profit grew 18% with margins expanding to 10.5%. Board recommends ₹2 per share dividend for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1747145770000,
            "Source": "earnings"
        },
        {
            "Title": "ITD Cementation India Reports Q4 Results and Dividend",
            "Summary": "ITD Cementation India has announced its Q4 financial results and a dividend recommendation. The company's Q4 consolidated net profit increased to 1.1 billion rupees from 895 million rupees year-over-year. Revenue rose to 24.8 billion rupees from 22.5 billion rupees. EBITDA improved to 2.6 billion rupees with a margin of 10.46%. The company has recommended a dividend of 2 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747142971000,
            "Source": "result"
        },
        {
            "Title": "ITD Cementation India JV Wins 102.2 Million Rupees in Arbitration",
            "Summary": "ITD Cementation India's joint venture has been awarded 102.2 million rupees through an arbitration process. This decision represents a favorable outcome for the company in a legal dispute.",
            "Sentiment": "positive",
            "PublishDate": 1742372883000,
            "Source": "result"
        },
        {
            "Title": "DEME and Jan De Nul Joint Venture Awarded Dredging Contract for Vadhavan Port in India",
            "Summary": "DEME and Jan De Nul have formed a joint venture that has signed a Letter of Award for dredging works at the new Vadhavan Port in Maharashtra, India. The project involves nearshore reclamation and shore protection for the greenfield port. Construction is set to begin in Q3 2025, with the joint venture acting as a subcontractor to ITD Cementation. DEME's share in the joint venture is valued at up to 50 million euros.",
            "Sentiment": "positive",
            "PublishDate": 1741220775000,
            "Source": "order&deals"
        },
        {
            "Title": "ITD Cementation Awarded Subcontract for Construction Project",
            "Summary": "ITD Cementation has received a letter of award for a construction project, with work scheduled to begin in Q3 2025. DEME, as part of a joint venture, will serve as a subcontractor to ITD Cementation for this phase of the project. The value of the letter of award for DEME's part in the joint venture is up to 50 million euros.",
            "Sentiment": "positive",
            "PublishDate": 1741192696000,
            "Source": "order&deals"
        },
        {
            "Title": "DEME and Jan De Nul Joint Venture Awarded Dredging Contract for Vadhavan Port",
            "Summary": "A joint venture between DEME and Jan De Nul has been awarded a letter of award for dredging works at the new Vadhavan Port in Maharashtra, India. The project involves nearshore reclamation and shore protection for this greenfield port development on India's west coast.",
            "Sentiment": "positive",
            "PublishDate": 1741192690000,
            "Source": "order&deals"
        },
        {
            "Title": "ITD Cementation India Reports Increased Q3 Profit and Revenue",
            "Summary": "ITD Cementation India has announced its Q3 financial results. The company's consolidated net profit rose to 870 million rupees from 784 million rupees in the same quarter last year. Revenue also increased to 22.45 billion rupees from 20.17 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739405824000,
            "Source": "earnings"
        },
        {
            "Title": "ITD Cementation India: Q3 Profit Rises 11%, Order Book at ₹19,893 Crore",
            "Summary": "ITD Cementation India reported an 11% YoY increase in Q3FY25 net profit to ₹87 crore. Revenue rose 11.3% to ₹2,244.9 crore. EBITDA grew 0.6% to ₹206.1 crore, with margin contracting to 9.2%. The company's order book stands at ₹19,893 crore as of December 31, 2024, with new orders of ₹6,370 crore secured in FY25 to date.",
            "Sentiment": "positive",
            "PublishDate": 1739365992000,
            "Source": "earnings"
        },
        {
            "Title": "Renew Exim DMCC to Make Open Offer for ITD Cementation India",
            "Summary": "Renew Exim DMCC has announced plans to make an open offer for 26% of ITD Cementation India's shares at a price of 571.68 rupees per share. This move suggests a potential significant change in ownership or control of ITD Cementation India, a construction and civil engineering company.",
            "Sentiment": "neutral",
            "PublishDate": 1738197142000,
            "Source": "corporate_action"
        },
        {
            "Title": "CCI Approves Acquisition of Majority Stake in ITD Cementation India by ReNew Exim",
            "Summary": "The Competition Commission of India (CCI) has approved the acquisition of up to 72.64% stake in ITD Cementation India by ReNew Exim. This represents a significant change in ownership and control for ITD Cementation India, a company likely involved in the construction or infrastructure sector.",
            "Sentiment": "neutral",
            "PublishDate": 1738109755000,
            "Source": "corporate_action"
        },
        {
            "Title": "CCI Approves Acquisition of ITD Cementation India Stake by Renew Exim",
            "Summary": "The Competition Commission of India (CCI) has approved the acquisition of up to 72.64% stake in ITD Cementation India by Renew Exim. This significant transaction represents a major change in ownership for ITD Cementation India, a company likely involved in the construction or infrastructure sector.",
            "Sentiment": "neutral",
            "PublishDate": 1738068966000,
            "Source": "corporate_action"
        },
        {
            "Title": "ITD Cementation India Receives Partial Arbitration Award",
            "Summary": "ITD Cementation India has received an arbitral award partially granting the company's claims in contractual disputes. The total award amounts to 122.1 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1737125376000,
            "Source": "corporate_governance"
        },
        {
            "Title": "ITD Cementation India: Secures Rs 1,648 Crore Vadhvan Port Contract",
            "Summary": "ITD Cementation India won a Rs 1,648 crore EPC contract for near-shore reclamation and shore protection work at Vadhvan Port, Maharashtra. The company was the lowest bidder, offering a price 6.9% below the estimated cost. The project involves developing 200 hectares of land, crucial for initiating other key port packages.",
            "Sentiment": "positive",
            "PublishDate": 1735700106000,
            "Source": "order&deals"
        },
        {
            "Title": "ITD Cementation Poised to Secure ₹1,648 Crore Contract for Vadhvan Port Project",
            "Summary": "ITD Cementation India Ltd is reportedly on track to win a significant contract worth ₹1,648 crore for the development of Vadhvan Port. The project is part of India's infrastructure expansion in the port sector. This large-scale contract represents a major opportunity for ITD Cementation and could potentially boost the company's order book and future revenue prospects.",
            "Sentiment": "positive",
            "PublishDate": 1735618368000,
            "Source": "order&deals"
        },
        {
            "Title": "ITD Cementation India Reports Q2 Financial Results",
            "Summary": "ITD Cementation India has announced its Q2 financial results. The company's EBITDA for the quarter was 1.8 billion rupees, compared to 1.7 billion rupees in the same quarter last year. However, the EBITDA margin decreased to 9.13% from 10.35% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730983614000,
            "Source": "result"
        },
        {
            "Title": "ITD Cementation India Reports Q2 Revenue Growth",
            "Summary": "ITD Cementation India has announced its Q2 revenue, which stands at 19.9 billion rupees, compared to 16.1 billion rupees in the same quarter last year. This represents a year-over-year increase in revenue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1730983602000,
            "Source": "result"
        },
        {
            "Title": "ITD Cementation India Reports Q2 Profit Increase",
            "Summary": "ITD Cementation India has reported a consolidated net profit of 720 million rupees for the second quarter, showing a year-over-year increase from 536 million rupees and a quarter-over-quarter increase from 1 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1730983591000,
            "Source": "result"
        }
    ]
}