{
    "Symbol": "CENTUM",
    "ISIN": "INE320B01020",
    "News": [
        {
            "Title": "Centum Electronics Q3FY26 Earnings Call on Feb 16",
            "Summary": "Centum Electronics Limited has scheduled its Q3FY26 earnings conference call for February 16, 2026 at 11:00 AM IST, to be led by Joint MD Nikhil Mallavarapu and CFO Sundararajan Parthasarathy.",
            "Sentiment": "neutral",
            "PublishDate": 1770731784659,
            "Source": "co_actions_results"
        },
        {
            "Title": "Centum Electronics Board Meet Set for Feb 6, 2026",
            "Summary": "Centum Electronics schedules board meeting on February 06, 2026 to approve Q3FY26 unaudited results for quarter ended December 31, 2025. Earnings call planned for February 09, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769755771323,
            "Source": "co_actions_results"
        },
        {
            "Title": "Centum Electronics Wins ₹29.40 Cr Naval Order",
            "Summary": "Centum Electronics secured a prestigious ₹29.40 crore order from GRSE for Advanced Naval Navigation Systems, marking expansion into defence maritime domain with delivery by February 2028.",
            "Sentiment": "positive",
            "PublishDate": 1768929035159,
            "Source": "co_actions_results"
        },
        {
            "Title": "Centum Electronics Elevates Dr. Vinod Chippalkatti to CTO",
            "Summary": "Centum Electronics redesignated Dr. Vinod Chippalkatti from President of Strategic Electronics Business Unit to Chief Technology Officer of Centum Group with immediate effect.",
            "Sentiment": "positive",
            "PublishDate": 1767884533648,
            "Source": "stocks"
        },
        {
            "Title": "Centum Electronics Independent Director Steps Down",
            "Summary": "Centum Electronics announces cessation of Independent Director Mr. Thiruvengadam Parthasarathi effective December 27, 2025, upon completion of his second and final term as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1766731348297,
            "Source": "stocks"
        },
        {
            "Title": "Centum Electronics Appoints Apurva Chandra as Director",
            "Summary": "Centum Electronics Limited announces the appointment of Mr. Apurva Chandra, former IAS officer, as Additional Non-Executive Independent Director for a five-year term effective December 19, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766152216169,
            "Source": "stocks"
        },
        {
            "Title": "Centum Electronics Shuts Down Canadian Operations",
            "Summary": "Centum Electronics discontinues operations of two fourth-level subsidiaries in Canada due to consistent losses accumulated over several years, with closure expected by March 2026.",
            "Sentiment": "negative",
            "PublishDate": 1766150644676,
            "Source": "stocks"
        },
        {
            "Title": "Centum Electronics Partners With Indra Air Traffic",
            "Summary": "Centum Electronics forms strategic alliance with Indra Air Traffic Inc. to develop advanced air navigation systems for Indian Navy, supporting Aatmanirbhar Bharat initiative and strengthening defence capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1765436369135,
            "Source": "stocks"
        },
        {
            "Title": "Centum Electronics Reports 18% Revenue Growth in Q2 FY26, Targets 30% Full-Year Growth Despite Subsidiary Losses",
            "Summary": "Centum Electronics achieved 18% YoY standalone revenue growth to INR 206 crores in Q2 FY26 with EBITDA margins expanding to 11.97%, driven by strong Build-to-Spec business execution for domestic defence and space customers. The company is progressing on divestment of Canada operations and evaluating strategic options for European subsidiary to address consolidated margin impact from international losses.",
            "Sentiment": "positive",
            "PublishDate": 1763474002129,
            "Source": "earnings"
        },
        {
            "Title": "Centum Electronics Reports QIP Fund Utilization Progress for September Quarter",
            "Summary": "Centum Electronics submitted its monitoring agency report showing utilization of Rs 1,250.68 million from its Rs 2,006.80 million QIP proceeds, with Rs 1,149.92 million used for debt repayment and Rs 100.76 million for equipment purchases. The company maintains Rs 756.84 million in unutilized funds deployed across fixed deposits and current accounts, with no deviations reported from stated objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1763175034451,
            "Source": "corporate_action"
        },
        {
            "Title": "Centum Electronics Reports Strong Q2 FY26 Results with 18.4% Revenue Growth",
            "Summary": "Centum Electronics delivered strong quarterly results with standalone operational income of INR 2,055 million in Q2 FY26, representing 18.4% year-over-year growth. The company achieved standalone EBITDA margin expansion to 11.97% and net profit of INR 130 million with 6.33% PAT margin. For H1 FY26, standalone revenue reached INR 3,906 million (24% YoY growth) with EBITDA margin of 12.88%. The Build-to-Spec business for domestic Defence and Space customers was a key growth driver. However, consolidated performance was impacted by subsidiary losses, with consolidated EBITDA margin at 6.16% for Q2 FY26. The company is evaluating strategic actions for its European business and progressing on planned divestment of Canada operations. Centum signed MoUs with GRSE for navigation systems and BEL for defence electronics, while delivering close to 400 critical modules for ISRO's CMS-03 satellite mission.",
            "Sentiment": "positive",
            "PublishDate": 1762995133654,
            "Source": "earnings"
        },
        {
            "Title": "Centum Electronics Allots 28,998 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Centum Electronics Limited has allotted 28,998 equity shares to employees who exercised their options under the Centum-Restricted Stock Unit Plan 2021. The Board of Directors approved the allotment on November 11, 2025, based on the Nomination and Remuneration Committee's recommendation. The company's paid-up equity share capital increased from ₹14,70,71,520 to ₹14,73,61,500 following this allotment. The exercise price was set at face value of ₹10 per share, generating ₹2,89,980 for the company. The newly issued shares rank pari passu with existing equity shares and are listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1762909978010,
            "Source": "corporate_action"
        },
        {
            "Title": "Centum Electronics Reports Q2 Net Profit of 42.3M Rupees, Reversing Previous Year Loss",
            "Summary": "Centum Electronics reported a consolidated net profit of 42.3 million rupees in Q2, compared to a loss of 3 million rupees in the same period last year. Revenue increased to 2.87 billion rupees from 2.51 billion rupees year-over-year. However, EBITDA declined to 202 million rupees from 210 million rupees, with EBITDA margin contracting to 7.05% from 8.33% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762869591376,
            "Source": "earnings"
        },
        {
            "Title": "Centum Electronics Schedules Earnings Call for Q2/H1 FY26 Results",
            "Summary": "Centum Electronics Limited has scheduled an earnings call with investors and analysts to discuss the company's financial and operational performance for the second quarter and half year ended September 30, 2025. The conference call is set for Thursday, November 13, 2025 at 16:00 hours IST. The management will be represented by Joint Managing Director Nikhil Mallavarapu and Chief Financial Officer Sundararajan Parthasarathy. The company has provided multiple dial-in numbers including universal, US, UK, Singapore and Hong Kong toll-free access numbers for participants.",
            "Sentiment": "neutral",
            "PublishDate": 1762364984889,
            "Source": "earnings"
        },
        {
            "Title": "Centum Electronics Submits Investor Presentation Highlighting Q1 FY26 Performance and Growth Strategy",
            "Summary": "Centum Electronics submitted an investor presentation to stock exchanges covering its Q1 FY26 financial results and business overview. The company reported consolidated revenue of INR 2,734 million for Q1 FY26, with an EBITDA margin of 8.38% and PAT margin of 1.65%. The presentation highlighted the company's three business segments: Electronic Manufacturing Services (EMS) contributing 59% of revenue, Engineering R&D Services (ER&D) at 32%, and Build to Specification (BTS) at 9%. Centum operates across defense, aerospace, space, healthcare, and industrial sectors with over 1,900 employees including 600+ design engineers. The company maintains a consolidated order book of INR 17,691 million as of June 30, 2025, with significant exposure to overseas markets contributing 65-70% of revenues from advanced economies.",
            "Sentiment": "neutral",
            "PublishDate": 1757603570778,
            "Source": "stock"
        },
        {
            "Title": "Centum Electronics Signs Agreement with BEL Under India's Defence Ministry",
            "Summary": "Centum Electronics has signed an agreement with BEL (Bharat Electronics Limited) under India's Defence Ministry. The partnership involves collaboration between the two companies in the defense sector.",
            "Sentiment": "positive",
            "PublishDate": 1755664447617,
            "Source": "order&deals"
        },
        {
            "Title": "Centum Electronics Reports Strong Q1 FY26 Results with 35% Standalone Revenue Growth",
            "Summary": "Centum Electronics delivered strong quarterly performance with consolidated revenue growing 11.4% year-on-year to Rs. 273 crores. Standalone revenue surged 35% to Rs. 180 crores, driven by high-margin build-to-spec business for domestic defense and space customers. EBITDA grew 47% year-on-year to Rs. 23 crores with margins at 8.38%. Net profit reached Rs. 4.5 crores. The company's order book increased to Rs. 1,769 crores as of June 30, 2025, with new EMS customers entering serial production and development orders received from DRDO for the Virupaksha Radar program. International subsidiaries faced headwinds due to delayed customer decisions in Europe's uncertain macro environment. The company is evaluating strategic actions for its loss-making Canadian subsidiary, which incurred losses of €600,000-€700,000 in the quarter. Management expects better performance in the second half contingent on pipeline conversions.",
            "Sentiment": "positive",
            "PublishDate": 1754922643792,
            "Source": "earnings"
        },
        {
            "Title": "Centum Electronics Submits QIP Monitoring Report for Quarter Ended June 30, 2025",
            "Summary": "Centum Electronics Limited submitted a monitoring agency report on the utilization of proceeds from their qualified institutions placement for the quarter ended June 30, 2025. The report was issued by CRISIL Limited and reviewed by the Audit Committee on August 4, 2025, and approved by the Board on August 5, 2025. The QIP was conducted from March 10-13, 2025, raising Rs 2,100 million with net proceeds of Rs 2,006.80 million. The proceeds were allocated for repayment of borrowings (Rs 1,149.92 million), capital expenditure for equipment and machinery (Rs 349.68 million), and general corporate purposes (Rs 507.20 million). During the quarter, Rs 40 million was utilized toward repaying cash credit facility of Kotak Bank, with Rs 864.46 million remaining unutilized and invested in fixed deposits across HDFC Bank, SBI Bank, and Kotak Bank. The monitoring agency reported no deviations from the disclosed objects of the issue.",
            "Sentiment": "neutral",
            "PublishDate": 1754908950918,
            "Source": "corporate_action"
        },
        {
            "Title": "Centum Electronics Promoter Sells 4.5% Stake for Rs 153 Crore",
            "Summary": "Mallavarapu Venkata Apparao, a promoter of Centum Electronics, sold 6.65 lakh equity shares representing a 4.53% stake for Rs 153.19 crore through open market transactions. The shares were sold at an average price of Rs 2,300.93 per share. Following this sale, Apparao's holding in the company decreased from 40.10% to 35.57%. HDFC Mutual Fund purchased 2.15 lakh shares (1.5% stake) while 3P Investment Managers acquired 3 lakh shares (2.04% stake) through its funds at an average price of Rs 2,300 per share, totaling Rs 118.45 crore. Centum Electronics shares closed 0.74% higher at Rs 2,412.70 on BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1754671439167,
            "Source": "order&deals"
        },
        {
            "Title": "Centum Electronics Reconstitutes Board Committees Following Independent Directors' Term Completion",
            "Summary": "Centum Electronics Limited reconstituted its Board committees effective August 7, 2025, following the cessation of two Independent Directors - Mr. Manoj Nagrath and Mr. Rajiv C Mody - upon completion of their second and final terms on August 6, 2025. Mr. Thiruvengadam Parthasarathi was appointed as Chairman of the Audit Committee, Ms. V Kavitha Dutt as Chairperson of the Nomination and Remuneration Committee, and Dr. Udayant Malhoutra as Chairman of the Stakeholders' Relationship Committee. The company also submitted a Statement of Deviation or Variation for its Qualified Institutions Placement proceeds for the period ended June 30, 2025, reporting no deviation in fund utilization. The QIP raised ₹2,100 million on March 13, 2025, with ₹1,142.34 million utilized for debt repayment and net proceeds revised to ₹2,006.80 million due to lower actual issue expenses.",
            "Sentiment": "neutral",
            "PublishDate": 1754402611408,
            "Source": "corporate_governance"
        },
        {
            "Title": "Centum Electronics Reports Strong Q1 FY26 Results with 165% Profit Growth",
            "Summary": "Centum Electronics Limited reported its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company achieved revenue from operations of Rs. 1,795.52 million and net profit of Rs. 164.99 million, with earnings per share of Rs. 11.22. On a consolidated basis, revenue reached Rs. 2,733.93 million with net profit of Rs. 44.76 million and earnings per share of Rs. 3.95. The company operates in the Electronics System Design and Manufacturing (ESDM) segment. During the previous year, the company raised approximately Rs. 2,100 million through a Qualified Institutional Placement, with proceeds used for debt repayment. The results were reviewed by the Audit Committee and approved by the Board of Directors, with statutory auditors S.R. Batliboi & Associates LLP conducting a limited review.",
            "Sentiment": "positive",
            "PublishDate": 1754396011709,
            "Source": "earnings"
        },
        {
            "Title": "Centum Electronics: Defence Stock Surges 10% on Q4 Profitability",
            "Summary": "Centum Electronics reported a net profit of ₹22 crore in Q4, reversing last year's loss. Revenue increased 24.2% YoY to ₹369 crore. EBITDA doubled to ₹42 crore with margin expanding to 11.3%. Order book stands at ₹1,861 crore, with Defence and Aerospace contributing 51%. Stock price rose 10% to ₹2,264.",
            "Sentiment": "positive",
            "PublishDate": 1747980426000,
            "Source": "earnings"
        },
        {
            "Title": "Centum Electronics Reports Q4 Profit and Recommends Dividend",
            "Summary": "Centum Electronics announced its Q4 results, reporting a consolidated net profit of 215 million rupees, compared to a loss of 69 million rupees in the same quarter last year. However, this represents a loss of 193 million rupees compared to the previous quarter. The company's Q4 revenue increased to 3.7 billion rupees from 2.8 billion rupees year-over-year. Additionally, Centum Electronics has recommended a dividend of 6 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747955875000,
            "Source": "default"
        },
        {
            "Title": "Centum Electronics Reports Q4 Profit and Recommends Dividend",
            "Summary": "Centum Electronics has reported its Q4 financial results. The company's consolidated net profit for Q4 is 215 million rupees, compared to a loss of 69 million rupees in the same quarter last year and a loss of 193 million rupees in the previous quarter. Q4 revenue increased to 3.7 billion rupees from 2.8 billion rupees year-over-year. EBITDA for Q4 rose to 423 million rupees from 187 million rupees year-over-year, with EBITDA margin improving to 11.57% from 6.6%. The company has recommended a dividend of 6 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747919515000,
            "Source": "result"
        },
        {
            "Title": "Centum Electronics to Invest Up to 2 Million Euros in Centum T&S Group",
            "Summary": "Centum Electronics has announced plans to invest up to 2 million euros in Centum T&S Group. This investment decision indicates a significant financial commitment by the company to support or expand operations within its subsidiary or affiliated group.",
            "Sentiment": "positive",
            "PublishDate": 1742393202000,
            "Source": "corporate_action"
        },
        {
            "Title": "3P India Equity Fund Acquires 3.5% Stake in Centum Electronics via QIP",
            "Summary": "3P India Equity Fund, managed by Prashant Jain, has acquired a 3.5% stake in Centum Electronics through a Qualified Institutional Placement (QIP). This acquisition represents a significant investment in the company by a notable equity fund.",
            "Sentiment": "positive",
            "PublishDate": 1742203298000,
            "Source": "corporate_action"
        },
        {
            "Title": "Centum Electronics: Launches Rs 250 Crore QIP with Floor Price at Rs 1,219.65",
            "Summary": "Centum Electronics has launched a Rs 250 crore Qualified Institutional Placement (QIP) with a floor price of Rs 1,219.65 per share. The issue size is set at Rs 175 crore with a green shoe option of Rs 75 crore. The indicative issue price is Rs 1,160 per share, representing a 4.89% discount to the floor price.",
            "Sentiment": "neutral",
            "PublishDate": 1741667977000,
            "Source": "corporate_action"
        },
        {
            "Title": "Centum Electronics Sets Floor Price for Share Issue",
            "Summary": "Centum Electronics has announced that the floor price for its share issue has been set at 1,219.65 rupees per share. This establishes the minimum price at which the company's shares will be offered in the upcoming issue.",
            "Sentiment": "neutral",
            "PublishDate": 1741651346000,
            "Source": "corporate_action"
        },
        {
            "Title": "Centum Electronics Sets Floor Price for Share Issue",
            "Summary": "Centum Electronics has announced that the floor price for their new share issue has been set at 1,219.65 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1741621765000,
            "Source": "corporate_action"
        },
        {
            "Title": "Centum Electronics Reports Increased Net Loss in Q3",
            "Summary": "Centum Electronics has reported a consolidated net loss of 193 million rupees in the third quarter, compared to a loss of 72 million rupees in the same period last year. The loss has also increased from 3 million rupees in the previous quarter. The company's revenue for Q3 decreased to 2.75 billion rupees from 2.9 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739751354000,
            "Source": "earnings"
        },
        {
            "Title": "Centum Electronics Reports Q3 EBITDA Decline",
            "Summary": "Centum Electronics experienced a significant decrease in its Q3 EBITDA, dropping from 294 million rupees to 201 million rupees year-over-year. The company's EBITDA margin also contracted, falling from 10.19% to 7.30% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739544374000,
            "Source": "earnings"
        },
        {
            "Title": "Centum Electronics Reports Q3 Financial Results",
            "Summary": "Centum Electronics has reported its Q3 financial results. The company experienced a consolidated net loss of 193 million rupees, compared to a loss of 72 million rupees in the same quarter last year. This represents a year-over-year increase in losses. Sequentially, the loss widened from 3 million rupees in the previous quarter. Revenue for Q3 stood at 2.75 billion rupees, down from 2.9 billion rupees in the same period last year, indicating a decline in sales.",
            "Sentiment": "negative",
            "PublishDate": 1739544318000,
            "Source": "earnings"
        },
        {
            "Title": "Centum Electronics to Invest Up to 2 Million Euros in Centum T&S Group SA",
            "Summary": "Centum Electronics has announced plans to invest up to 2 million euros in Centum T&S Group SA. This investment decision indicates a strategic move by the company to expand its operations or strengthen its position within the T&S Group SA.",
            "Sentiment": "positive",
            "PublishDate": 1737505283000,
            "Source": "corporate_action"
        },
        {
            "Title": "Centum Electronics to Invest Up to 2 Million Euros in Centum T&S Group SA",
            "Summary": "Centum Electronics has announced plans to invest up to 2 million euros in Centum T&S Group SA. This investment decision indicates a significant financial commitment by the company to expand or strengthen its operations through its subsidiary or affiliate.",
            "Sentiment": "positive",
            "PublishDate": 1737460434000,
            "Source": "corporate_action"
        },
        {
            "Title": "Centum Electronics Reports Q2 Results and Approves Fundraising",
            "Summary": "Centum Electronics reported a reduced net loss of 3 million rupees in Q2, compared to 46 million rupees year-over-year. Revenue increased to 2.5 billion rupees from 2.4 billion rupees. EBITDA improved to 210 million rupees with a margin of 8.36%. The company approved raising funds up to 2.5 billion rupees through QIP or other methods.",
            "Sentiment": "positive",
            "PublishDate": 1731456016000,
            "Source": "result"
        },
        {
            "Title": "Centum Electronics to Consider Fund Raising via QIP",
            "Summary": "Centum Electronics has scheduled a board meeting on November 12 to discuss and potentially approve raising funds through a Qualified Institutional Placement (QIP) or other modes.",
            "Sentiment": "neutral",
            "PublishDate": 1730987224000,
            "Source": "corporate_action"
        }
    ]
}