{
    "Symbol": "CENTURYPLY",
    "ISIN": "INE348B01021",
    "News": [
        {
            "Title": "Century Plyboards Promoter Reduces Stake by 0.81%",
            "Summary": "Prem Kumar Bhajanka, promoter of Century Plyboards, sold 18 lakh shares through open market transactions on February 11, 2026, reducing his shareholding from 1.65% to 0.84%.",
            "Sentiment": "neutral",
            "PublishDate": 1770906992490,
            "Source": "co_actions_results"
        },
        {
            "Title": "Century Plyboards Plant Head Resigns Due to Personal Reasons",
            "Summary": "Century Plyboards announces resignation of Ashok Kumar Goyal, Plant Head - Hoshiarpur, effective February 7, 2026, citing family commitments as the reason for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1770469640922,
            "Source": "stocks"
        },
        {
            "Title": "Century Plyboards Particle Board Segment Targets 15% Margin",
            "Summary": "Century Plyboards' particle board segment reaches breakeven EBITDA and aims for 15% margin by Q4 next year, signaling improved operational efficiency in the division.",
            "Sentiment": "positive",
            "PublishDate": 1770349304981,
            "Source": "stocks"
        },
        {
            "Title": "Century Plyboards Projects Strong Growth Across Divisions",
            "Summary": "Century Plyboards anticipates over 15% growth in laminate division this year and 20% next year, while plywood division expects 5-7% growth with new capacity additions in Hoshiarpur and Chennai.",
            "Sentiment": "positive",
            "PublishDate": 1770349274960,
            "Source": "stocks"
        },
        {
            "Title": "Century Plyboards Sets Ambitious Growth Targets",
            "Summary": "Century Plyboards aims for INR 12,000 crores revenue by FY31 with 18% annual growth. MDF segment expects over 25% growth in FY26 with strong margins ahead.",
            "Sentiment": "positive",
            "PublishDate": 1770349246788,
            "Source": "stocks"
        },
        {
            "Title": "Century Plyboards Q3FY26 Results Call on Feb 5",
            "Summary": "Century Plyboards (India) Limited has scheduled a conference call with investors and analysts on February 5, 2026 at 3:00 PM to discuss Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770046650624,
            "Source": "co_actions_results"
        },
        {
            "Title": "Century Plyboards Board Meet Set for Feb 4, 2026",
            "Summary": "Century Plyboards India Ltd schedules board meeting on February 4, 2026, to review Q3FY26 unaudited financial results. Trading window closed from January 1 to February 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769000649641,
            "Source": "co_actions_results"
        },
        {
            "Title": "Century Plyboards Plans MDF Price Hikes in FY27",
            "Summary": "Century Plyboards announces strategic price adjustments as needed, with MDF segment price increases planned for FY27. Company expects improved margins and market share growth going forward.",
            "Sentiment": "positive",
            "PublishDate": 1767945160834,
            "Source": "stocks"
        },
        {
            "Title": "Century Plyboards Targets 80-90% Capacity Utilisation",
            "Summary": "Century Plyboards announces strategic plans to achieve 80-90% capacity utilisation in the near term, signaling operational expansion and improved manufacturing efficiency across its facilities.",
            "Sentiment": "positive",
            "PublishDate": 1767945135618,
            "Source": "stocks"
        },
        {
            "Title": "CenturyPlyboards Seeks Shareholder Approval for Independent Director Appointment via Postal Ballot",
            "Summary": "CenturyPlyboards has initiated a postal ballot process for shareholders to approve the appointment of Ms. Nilima Joshi as Independent Director for a five-year term from October 1, 2025 to September 30, 2030. The e-voting period runs from November 24, 2025 to December 23, 2025, with results to be declared by December 26, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763638759420,
            "Source": "corporate_action"
        },
        {
            "Title": "CenturyPlyboards Reports Record Q2 Revenue of INR 1,386 Crores, Up 17.1% YoY",
            "Summary": "CenturyPlyboards delivered its highest-ever quarterly revenue of INR 1,386 crores with 17.1% year-on-year growth, driven by strong performance across plywood, laminates, and MDF segments. The company achieved record EBITDA of INR 181.7 crores with improved margins at 13.1%, while successfully commencing commercial production at its new particle board plant during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1763365756395,
            "Source": "earnings"
        },
        {
            "Title": "CenturyPlyboards Appoints Ashok Kumar Goyal as Plant Head-Hoshiarpur",
            "Summary": "CenturyPlyboards (India) Limited designated Shri Ashok Kumar Goyal as Plant Head-Hoshiarpur in the Senior Management Personnel category effective November 14, 2025. Goyal brings 37 years of experience including 34 years in MDF manufacturing with organizations like Nuchem Ltd., Greenpanel Industries Ltd., and CenturyPlyboards.",
            "Sentiment": "positive",
            "PublishDate": 1763120367747,
            "Source": "corporate_governance"
        },
        {
            "Title": "Century Plyboards Projects 40% Particle Board Sales Growth, Targets INR 200 Crores Revenue",
            "Summary": "Century Plyboards expects a 40% increase in particle board sales, aiming for approximately INR 200 crores revenue this year. The company anticipates MDF utilization to exceed 80% in the second half, with a target of reaching 85% utilization.",
            "Sentiment": "positive",
            "PublishDate": 1763091813613,
            "Source": "stock"
        },
        {
            "Title": "Century Plyboards Reports Strong Q2 Growth with Revenue Up 17% and Net Profit Surging 72%",
            "Summary": "Century Plyboards reported quarterly revenue of 13.8 billion rupees compared to 11.8 billion rupees in the same period last year. The company's consolidated net profit increased significantly to 689 million rupees from 400 million rupees year-over-year. EBITDA rose to 1.75 billion rupees from 1.13 billion rupees, while EBITDA margin improved to 12.6% from 9.4% in the corresponding period last year.",
            "Sentiment": "positive",
            "PublishDate": 1762935696988,
            "Source": "earnings"
        },
        {
            "Title": "Century Plyboards Re-appoints Key Directors Including Chairman for Five-Year Terms",
            "Summary": "Century Plyboards (India) Ltd. shareholders approved the re-appointment of four directors at their Annual General Meeting held on September 18, 2025. Ajay Baldawa and Nikita Bansal were re-appointed as Directors after retiring by rotation. Sajjan Bhajanka was re-appointed as Chairman and Managing Director for five years effective April 1, 2026, while Keshav Bhajanka was re-appointed as Executive Director for five years effective January 28, 2026. The company confirmed that none of the re-appointed directors are debarred from holding directorial positions by SEBI or any other authority.",
            "Sentiment": "neutral",
            "PublishDate": 1758197328096,
            "Source": "corporate_governance"
        },
        {
            "Title": "Century Plyboards Communicates TDS Guidelines for Recommended Re. 1 Per Share Dividend",
            "Summary": "Century Plyboards (India) Ltd has communicated tax deduction at source (TDS) provisions to shareholders regarding a recommended dividend of Re. 1 per equity share for the financial year ended March 31, 2025. The Board of Directors recommended this dividend at their meeting held on May 29, 2025, subject to shareholder approval at the 44th Annual General Meeting scheduled for September 18, 2025. The company has outlined detailed TDS rates and exemption procedures for different categories of shareholders. For resident individual members, no TDS applies if aggregate dividend doesn't exceed Rs. 10,000. If it exceeds Rs. 10,000, TDS rates vary from 10% for members with valid PAN to 20% for those without PAN or with invalid PAN. Various exemptions are available through forms 15G/15H and other declarations. For non-resident members, TDS is 20% plus applicable surcharge and cess, with potential relief under Double Tax Avoidance Agreements. The record date is September 11, 2025, and share transfer books will remain closed from September 12-18, 2025. Shareholders must submit required documents by September 11, 2025, to claim applicable exemptions or lower deduction rates.",
            "Sentiment": "neutral",
            "PublishDate": 1756102006522,
            "Source": "corporate_action"
        },
        {
            "Title": "Century Plyboards Targets Mid-Teens Revenue Growth in FY26 Through Capacity Expansion",
            "Summary": "Century Plyboards expects mid-teens topline growth in FY26 driven by capacity expansion across product segments. Executive Director Keshav Bhajanka outlined specific growth targets: 10% for plywood, 20% for laminates, 20% for MDF, and 40% for particle wood based on new capacity additions. The company anticipates value growth to exceed volume growth due to inflation-driven price increases in plywood and laminates. BIS mandatory quality control norms implemented in August are expected to benefit organized players like Century Plyboards. Despite MDF oversupply limiting price hikes, the company improved margins through operational efficiencies and raw material optimization, achieving close to 5% savings. For the quarter ended June 30, consolidated net profit rose 55% year-on-year to Rs 52.93 crore, while revenue increased 16.3% to Rs 1,169.36 crore. Century Plyboards shares closed 4.88% higher at Rs 764 on Monday.",
            "Sentiment": "positive",
            "PublishDate": 1755576198059,
            "Source": "stock"
        },
        {
            "Title": "Century Plyboards Subsidiary Century Ports Begins Commercial Operations at Kolkata Port",
            "Summary": "Century Ports Ltd., a wholly owned subsidiary of Century Plyboards (India) Ltd., commenced commercial operations at its rejuvenated Khidderpore Docks (KPD-I West) at Syama Prasad Mookerjee Port, Kolkata on August 16, 2025. The subsidiary has successfully launched operations at the port facility.",
            "Sentiment": "positive",
            "PublishDate": 1755337125802,
            "Source": "stock"
        },
        {
            "Title": "Century Plyboards Reports 16.3% Consolidated Revenue Growth in Q1 FY26",
            "Summary": "Century Plyboards India Limited reported consolidated revenue growth of 16.3% year-on-year and 6.8% on standalone basis for Q1 FY26. Consolidated EBITDA margin improved to 12.5% from 11.2% in Q1 FY25, driven by positive contribution from the Badvel plant. The plywood segment led performance with 15.3% revenue growth and 13.8% EBITDA margin. MDF business achieved 23.7% revenue growth with 14.3% EBITDA margin, while laminates showed early turnaround signs with 12.8% growth and 5.9% EBITDA margin. The particle board segment remained in recovery phase with margin pressure due to elevated timber costs. The company achieved record plywood sales volume in July 2025 and commenced commercial production at its new Tamil Nadu particle board plant. Working capital cycle improved from 76 days to 71 days. Management maintained 10% plus growth guidance for plywood and expects continued recovery in other segments.",
            "Sentiment": "positive",
            "PublishDate": 1754983611211,
            "Source": "earnings"
        },
        {
            "Title": "Century Ply Targets ₹5,000 Crore Revenue in 3 Years Through MDF Expansion",
            "Summary": "Century Ply has set a revenue target of ₹5,000 crore over the next three years. The company plans to achieve this growth through expanding its MDF (Medium Density Fiberboard) operations, leveraging the housing cycle, increasing exports, and improving working capital management.",
            "Sentiment": "positive",
            "PublishDate": 1754576580963,
            "Source": "stock"
        },
        {
            "Title": "Century Plyboards Reports 6.8% Revenue Growth in Q1 FY26 with Mixed Segment Performance",
            "Summary": "Century Plyboards reported revenue growth of 6.8% on standalone basis and 16.3% on consolidated basis for Q1 FY26. Standalone EBITDA margin declined to 12.7% from 13.5% in Q1 FY25, primarily due to higher advertising and promotional expenses. The plywood segment led performance with 15.3% revenue growth and 13.8% EBITDA margin. Laminates showed recovery signs with 12.8% growth on consolidated basis and 5.9% EBITDA. MDF business delivered strong 23.7% revenue growth with 14.3% EBITDA margin. Particle board segment remained in recovery phase with revenue decline compared to Q1 FY25 but sequential improvement from Q4 FY25. The company provided guidance targeting 10%+ growth for plywood with 12-14% EBITDA, 20% growth for laminates and MDF with respective EBITDA targets of high single digit and 15%, and 40% growth for particle board.",
            "Sentiment": "positive",
            "PublishDate": 1754573324051,
            "Source": "earnings"
        },
        {
            "Title": "Century Plyboards Sets Record Date for Dividend Eligibility",
            "Summary": "Century Plyboards (India) Ltd has set Thursday, 11th September, 2025 as the record date for determining shareholders eligible to receive dividends for the financial year ended 31st March, 2025, if declared at the upcoming Annual General Meeting. The company's Register of Members and Share Transfer Books will remain closed from Friday, 12th September, 2025 to Thursday, 18th September, 2025 for the Annual General Meeting and to ascertain members entitled to receive dividend.",
            "Sentiment": "neutral",
            "PublishDate": 1754568973744,
            "Source": "corporate_action"
        },
        {
            "Title": "Century Plyboards Reports 51% Jump in Q1 Net Profit to 518 Million Rupees",
            "Summary": "Century Plyboards reported quarterly results showing net profit of 518 million rupees compared to 344 million rupees in the same period last year. Revenue increased to 12 billion rupees from 10 billion rupees year-over-year. EBITDA rose to 1.28 billion rupees from 1.11 billion rupees, though EBITDA margin slightly declined to 10.96% from 11.06%. Profit before exceptional items remained relatively flat at 712 million rupees versus 710 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754555324886,
            "Source": "earnings"
        },
        {
            "Title": "Century Plyboards Begins Commercial Production in Tamil Nadu",
            "Summary": "Century Plyboards has announced the commencement of commercial production at its manufacturing unit in Tamil Nadu. This development marks a significant expansion for the company's operations in the region.",
            "Sentiment": "positive",
            "PublishDate": 1751003321000,
            "Source": "default"
        },
        {
            "Title": "Century Plyboards Provides Guidance on EBITDA Margin and Growth Targets",
            "Summary": "Century Plyboards has provided guidance on its EBITDA margin for the current year, aiming for better results in the following year. The company has set a turnover target of INR 12,000 crores by FY '31 and believes it is on track to achieve this goal. Century Plyboards has also stated a target of 20% growth for the current year, which it expects to meet. The company's management acknowledged that their past guidance has historically been incorrect. Century Plyboards does not typically provide specific guidance on exports or domestic sales.",
            "Sentiment": "positive",
            "PublishDate": 1748921272000,
            "Source": "default"
        },
        {
            "Title": "Century Plyboards: Q4 Profit Drops 34% Despite Revenue Growth",
            "Summary": "Century Plyboards reported Q4 FY2025 results with revenue up 13% YoY to ₹1,198 crore, but net profit fell 34% to ₹52.50 crore. EBITDA decreased 1.80% to ₹134.6 crore with margins contracting 170 bps. The board recommended a dividend of ₹1 per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1748511988000,
            "Source": "earnings"
        },
        {
            "Title": "Century Plyboards Reports Q4 Financial Results",
            "Summary": "Century Plyboards has announced its Q4 financial results. The company's revenue increased to 11.98 billion rupees from 10.6 billion rupees in the same quarter last year. However, the consolidated net profit decreased to 525 million rupees from 795 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1748509018000,
            "Source": "result"
        },
        {
            "Title": "Century Plyboards (India) Ltd: Chairman Sajjan Bhajanka Announces Retirement and Philanthropic Plans",
            "Summary": "Sajjan Bhajanka, Chairman of Century Plyboards (India) Ltd and Founder of Star Cement Ltd, is set to retire. He plans to dedicate 20% of his wealth to charity. Bhajanka reflects on his career, from starting with a small factory to leading CenturyPly to market leadership. He attributes the company's success to product quality and strong customer relationships.",
            "Sentiment": "positive",
            "PublishDate": 1746061922000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Century Plyboards (India) Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade occurred for Century Plyboards (India) Ltd. on the National Stock Exchange (NSE). Approximately 300,254 shares were traded at a price of Rs. 706.10 per share, amounting to a total transaction value of Rs. 21.20 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1743569179000,
            "Source": "block_deals"
        },
        {
            "Title": "Special Court Orders FIR Against Century Plyboards' Independent Director",
            "Summary": "A special court has directed the filing of a First Information Report (FIR) against Pramod Agrawal, an independent director of Century Plyboards. This legal action suggests potential concerns or allegations related to the director's conduct or responsibilities within the company.",
            "Sentiment": "negative",
            "PublishDate": 1740987755000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Century Plyboards (India) Ltd: Stock Surges 12% Amid Market Crash",
            "Summary": "Century Plyboards (India) Ltd's stock rose up to 12% intraday, reaching ₹837.15 despite overall market decline. The company recently incorporated a wholly owned subsidiary, Centuryply Furniture Fittings Limited, for manufacturing furniture fittings and fixtures.",
            "Sentiment": "positive",
            "PublishDate": 1740125558000,
            "Source": "corporate_action"
        },
        {
            "Title": "Century Plyboards: New Andhra Pradesh Facility Boosts Export Capabilities",
            "Summary": "Century Plyboards' new Andhra Pradesh unit enables production of larger laminate sizes, allowing entry into new export markets like Europe, Australia, and Israel. The company is optimistic about export growth potential. Raw material prices have stabilized after previous increases.",
            "Sentiment": "positive",
            "PublishDate": 1739677234000,
            "Source": "normal_news"
        },
        {
            "Title": "Century Plyboards: Reaffirms Margin Guidance Despite Cost Pressures",
            "Summary": "Century Plyboards has reaffirmed its margin guidance, maintaining its outlook despite facing cost pressures in the current business environment.",
            "Sentiment": "positive",
            "PublishDate": 1739274580000,
            "Source": "normal_news"
        },
        {
            "Title": "Century Plyboards: Q3 Profit Dips 6% Despite Revenue Growth",
            "Summary": "Century Plyboards reported a 6.1% decline in Q3 net profit to Rs 58.8 crore, while revenue grew 21.7% to Rs 1,140.47 crore. The company incorporated a new subsidiary in the Netherlands and completed the acquisition of Century Infotech Ltd.",
            "Sentiment": "neutral",
            "PublishDate": 1738935620000,
            "Source": "earnings"
        },
        {
            "Title": "Century Plyboards Reports Revenue Growth in Q3",
            "Summary": "Century Plyboards (India) Limited has reported a significant increase in revenue for the third quarter. The company's revenue rose to 11.4 billion rupees, up from 9.4 billion rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738917611000,
            "Source": "earnings"
        },
        {
            "Title": "Century Plyboards Reports Improved Q3 EBITDA and Margin",
            "Summary": "Century Plyboards (India) Limited has reported its Q3 financial results. The company's EBITDA increased to 1.3 billion rupees from 1.1 billion rupees year-over-year. The EBITDA margin also saw a slight improvement, rising to 11.35% from 11.32% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738917576000,
            "Source": "earnings"
        },
        {
            "Title": "Century Plyboards Reports Decline in Q3 Net Profit",
            "Summary": "Century Plyboards (India) Limited has reported a consolidated net profit of 585 million rupees for the third quarter, down from 631 million rupees in the same period last year. This represents a year-over-year decrease in the company's quarterly earnings.",
            "Sentiment": "negative",
            "PublishDate": 1738917531000,
            "Source": "earnings"
        },
        {
            "Title": "Century Plyboards to Consider Q3 Results on February 7",
            "Summary": "Century Plyboards has announced that it will consider its third quarter (Q3) financial results on February 7. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738159631000,
            "Source": "earnings"
        },
        {
            "Title": "Century Plyboards: Seeks PLI Scheme for Furniture, Higher Tax Exemption in Budget",
            "Summary": "Century Plyboards is advocating for a Production Linked Incentive (PLI) scheme for the furniture sector and an increase in tax exemption in the upcoming 2025 budget.",
            "Sentiment": "neutral",
            "PublishDate": 1737726043000,
            "Source": "normal_news"
        },
        {
            "Title": "Century Plyboards Reports 18% Revenue Growth in Q2",
            "Summary": "Century Plyboards (India) Limited has announced its financial results for the second quarter. The company reported revenue of 11.8 billion rupees, compared to 10 billion rupees in the same quarter last year, representing an 18% year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731486784000,
            "Source": "result"
        },
        {
            "Title": "Century Plyboards Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Century Plyboards (India) has reported a decrease in its Q2 EBITDA, which fell to 1.1 billion rupees from 1.4 billion rupees year-over-year. The company's Q2 EBITDA margin also declined, dropping to 9.41% from 14.47% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731486779000,
            "Source": "result"
        },
        {
            "Title": "Century Plyboards Reports 59% Drop in Q2 Net Profit",
            "Summary": "Century Plyboards (India) Limited has reported a consolidated net profit of 400 million rupees for the second quarter, down from 969 million rupees in the same period last year. This represents a significant year-over-year decline of approximately 59% in the company's quarterly earnings.",
            "Sentiment": "negative",
            "PublishDate": 1731486680000,
            "Source": "result"
        }
    ]
}