{
    "Symbol": "CENTRUM",
    "ISIN": "INE660C01027",
    "News": [
        {
            "Title": "Business Match Services Creates Additional Pledges",
            "Summary": "Business Match Services (India) Private Limited creates additional pledges on 6.40 lakh equity shares of Centrum Capital Limited with four financial entities due to market price fluctuations.",
            "Sentiment": "neutral",
            "PublishDate": 1770651819982,
            "Source": "co_actions_results"
        },
        {
            "Title": "Centrum Capital Gets RBI Nod for CHFL Stake Sale",
            "Summary": "Centrum Capital Limited receives Reserve Bank of India approval for the proposed change in control of its material subsidiary Centrum Housing Finance Limited, moving closer to completing the stake transfer to Weaver Services Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1770145197012,
            "Source": "co_actions_results"
        },
        {
            "Title": "Business Match Services pledges more Centrum shares",
            "Summary": "Business Match Services (India) Private Limited has pledged additional equity shares in Centrum Capital Limited to multiple lenders, increasing total pledged shares to 18.77% of share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1769757728490,
            "Source": "co_actions_results"
        },
        {
            "Title": "Centrum Capital Issues ₹20 Cr Corporate Guarantee",
            "Summary": "Centrum Capital Limited has issued a corporate guarantee of ₹20 crores in favor of Beacon Trusteeship Limited for non-convertible debentures to be issued by its material subsidiary Centrum Wealth Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1765608157598,
            "Source": "stocks"
        },
        {
            "Title": "Centrum Capital Submits Monitoring Reports for Rs 349.7 Crore Fund Utilization",
            "Summary": "Centrum Capital Limited submitted monitoring agency reports from Brickwork Ratings for fund utilization during the quarter ended September 30, 2025. The reports cover two preferential issues: Rs 199.99 crore warrant issue (with Rs 49.99 crore received as 25% upfront payment) and Rs 149.71 crore equity shares issue (fully subscribed from proposed Rs 172.56 crore). Funds were utilized for debt repayment at company and subsidiary levels, and general corporate purposes including Rs 35 crore loan to group company Centrum Broking Limited for margin money payments. The monitoring agency reported no deviations from stated objectives and confirmed all funds were deployed as per offer documents.",
            "Sentiment": "neutral",
            "PublishDate": 1762799247110,
            "Source": "corporate_action"
        },
        {
            "Title": "Centrum Capital Reports Net Loss of Rs 850 Lakhs in Q2 FY26, Raises Rs 200 Crores Through Equity Infusion",
            "Summary": "Centrum Capital Limited reported a consolidated net loss of Rs 850.48 lakhs for the quarter ended September 30, 2025, compared to a net profit of Rs 764.04 lakhs in the same quarter last year. Total revenue from operations decreased to Rs 32,298.88 lakhs from Rs 70,362.60 lakhs year-on-year. The company raised approximately Rs 200 crores through promoter equity infusion and external investments during the quarter. In August 2025, the company allotted 7.01 crore warrants to promoter entity JBCG Advisory Services at Rs 28.52 per warrant, raising Rs 5,000 lakhs. Additionally, 4.35 crore equity shares were allotted to marquee investors at Rs 34.38 per share, raising Rs 14,971.27 lakhs. The company has agreed to sell its stake in Centrum Housing Finance Limited to Weaver Services Private Limited, subject to regulatory approvals. Unity Bank expanded to 295 branches across India and introduced new products including credit cards and personal loans. The company's wealth management business manages AUM of over Rs 41,000 crores serving 5,000+ clients across 18 locations.",
            "Sentiment": "negative",
            "PublishDate": 1762567873987,
            "Source": "earnings"
        },
        {
            "Title": "Centrum Capital Reports Wider Q2 Loss Despite Revenue Growth",
            "Summary": "Centrum Capital reported a consolidated net loss of 406.5 million rupees in Q2, significantly higher than the 235 million rupee loss in the same quarter last year. The company's revenue increased to 8.23 billion rupees from 7.84 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762522260518,
            "Source": "earnings"
        },
        {
            "Title": "Centrum Capital Shareholders Approve Sale of Housing Finance Subsidiary and Foreign Ownership Cap",
            "Summary": "Centrum Capital Limited shareholders approved three special resolutions through postal ballot voting that concluded on October 27, 2025. The resolutions included approval for the sale of Centrum Housing Finance Limited, a material subsidiary of the company, which received 99.63% votes in favor. Shareholders also approved a cap of up to 49% on aggregate foreign ownership with 99.66% support, and the reappointment of Mr. R. A. Sankara Narayanan as an Independent Director with 99.63% approval. The voting process was conducted entirely through remote e-voting from September 28 to October 27, 2025, with 37,738 total shareholders on record date and 55.73% voter participation. All three resolutions passed with requisite majority as confirmed by scrutinizer Umesh P. Maskeri.",
            "Sentiment": "positive",
            "PublishDate": 1761650288224,
            "Source": "corporate_action"
        },
        {
            "Title": "Business Match Services Creates Additional Pledge on Centrum Capital Shares Worth ₹792.65 Crore",
            "Summary": "Business Match Services (India) Private Limited has created an additional pledge on 7,92,64,500 equity shares of Centrum Capital Limited in favor of Aditya Birla Capital Limited. The pledge was created on October 20, 2025, due to fluctuation in market price. This represents 17.25% of Centrum Capital's total share capital. Following this transaction, Business Match Services' total encumbered shareholding in Centrum Capital increased to 7,94,64,500 shares, representing 17.29% of the total share capital. The company holds 13,44,99,041 shares in Centrum Capital, which constitutes 29.27% of the total share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1761561136406,
            "Source": "corporate_action"
        },
        {
            "Title": "Businessmatch Services Creates and Releases Pledges on Centrum Capital Shares",
            "Summary": "Businessmatch Services (India) Private Limited reported multiple pledge transactions on its equity shares in Centrum Capital Limited. The company created additional pledges totaling 14.5 lakh shares (0.30% of total share capital) with Aditya Birla Capital Limited, Minsol Limited, Merlin Projects Limited, and Carwin Trading Private Limited between October 6-8, 2025, citing market price fluctuations as the reason. Subsequently, the company released 22.99 lakh shares (0.50% of total share capital) from pledge with Tata Capital Limited on October 10, 2025, due to partial loan repayment. Post these transactions, Businessmatch Services holds 13.44 crore shares (29.27% of total share capital) in Centrum Capital, with 7.92 crore shares (17.25% of total share capital) remaining pledged.",
            "Sentiment": "neutral",
            "PublishDate": 1760419299243,
            "Source": "corporate_action"
        },
        {
            "Title": "Centrum Capital Seeks Shareholder Approval for Sale of Housing Finance Subsidiary and Foreign Ownership Cap",
            "Summary": "Centrum Capital Limited has issued a postal ballot notice seeking shareholder approval for three special resolutions. The company proposes to sell its entire shareholding of 15,04,79,986 equity shares in Centrum Housing Finance Limited, a material subsidiary, to Weaver Services Private Limited for INR 429.77 crore. The sale is part of business reorganization to enable Unity Small Finance Bank Limited to undertake housing finance business in the future. Additionally, the company seeks approval to cap foreign ownership at 49% to comply with RBI requirements for acting as promoter of Unity Small Finance Bank. The third resolution involves reappointment of R. A. Sankara Narayanan as Independent Director for a second five-year term from April 2026 to April 2031. Remote e-voting is scheduled from September 28, 2025 to October 28, 2025, with results to be announced within two working days of voting conclusion.",
            "Sentiment": "neutral",
            "PublishDate": 1758977100387,
            "Source": "corporate_action"
        },
        {
            "Title": "Centrum Capital Approves Re-appointment of R. A. Sankara Narayanan as Independent Director",
            "Summary": "Centrum Capital Limited's Board of Directors approved the re-appointment of Mr. R. A. Sankara Narayanan as an Independent Director for a second five-year term from April 3, 2026 to April 2, 2031. The appointment is subject to shareholder approval and his office will not be liable to retire by rotation. Mr. Narayanan holds qualifications including MBA in Finance, CAIIB, and various other certifications. He previously served as Managing Director and CEO of Canara Bank until January 2020 and has been on the Board of South Indian Bank Limited since October 2020. He is not related to other Directors of the Company and is not debarred from holding directorship by any regulatory authority.",
            "Sentiment": "neutral",
            "PublishDate": 1758903947813,
            "Source": "corporate_governance"
        },
        {
            "Title": "Centrum Capital Completes Transfer of Insurance Brokers Subsidiary Following IRDAI Approval",
            "Summary": "Centrum Capital Limited completed the transfer of its wholly-owned subsidiary Centrum Insurance Brokers Limited (CIBL) from Centrum Retail Services Limited to Centrum Financial Services Limited on September 17, 2025. The transaction received regulatory approval from IRDAI and was valued at Rs. 13.76 crores. CIBL contributed 0.38% to consolidated turnover and 16.79% to consolidated net-worth for FY 2024-25, with turnover of Rs. 13.03 crores and net-worth of Rs. 11.36 crores. The buyer, Centrum Financial Services Limited, is a subsidiary where Centrum Capital holds 99.9976% equity. Following the transfer, CIBL ceased to be a wholly-owned subsidiary of Centrum Capital. The transaction was conducted at arm's length between related entities.",
            "Sentiment": "neutral",
            "PublishDate": 1758116481213,
            "Source": "corporate_action"
        },
        {
            "Title": "Businessmatch Services Creates Pledge on Centrum Capital Equity Shares",
            "Summary": "Businessmatch Services (India) Private Limited has created a pledge on equity shares held in Centrum Capital Limited. The pledge involves 12,00,000 shares representing 0.29% of total share capital, created in favor of Ms. Shalini Verma. The encumbrance was created on 21.08.2025 as a third party pledge regarding fresh loan. Post-event, Businessmatch Services' total encumbered shareholding in Centrum Capital stands at 7,63,14,250 shares (18.34% of total share capital). The company's overall holding in Centrum Capital is 13,44,99,041 shares representing 32.33% of total share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1756126801170,
            "Source": "corporate_action"
        },
        {
            "Title": "Centrum Capital Sells Entire Stake in Centrum Housing Finance for ₹430 Crore",
            "Summary": "Centrum Capital has agreed to sell its complete stake in Centrum Housing Finance to Weaver Services for ₹430 crore. The transaction involves the full divestment of the housing finance subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1755834249017,
            "Source": "order&deals"
        },
        {
            "Title": "Businessmatch Services Reports Pledge Creation and Release on Centrum Capital Shares",
            "Summary": "Businessmatch Services (India) Private Limited reported multiple pledge transactions on its equity shares in Centrum Capital Limited. The transactions included the release of 29 lakh shares pledged to Aditya Birla Finance Limited on August 7, 2025, due to market price fluctuations. Additionally, 35 lakh shares were pledged to a third party on August 11, 2025, for a fresh loan. Two separate releases of 5 lakh shares each occurred on August 6, 2025, to KR Choksey and Talland Limited, also due to market price fluctuations. Post these transactions, Businessmatch Services holds 13.45 crore shares representing 32.33% of Centrum Capital's total share capital, with 7.71 crore shares (18.53%) remaining encumbered. The reporting was made to stock exchanges on August 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754988011316,
            "Source": "corporate_action"
        },
        {
            "Title": "Centrum Capital Reports Rs 10,696 Crore Consolidated Net Loss for Quarter Ended June 30, 2025",
            "Summary": "Centrum Capital Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported a consolidated net loss of Rs 10,696.36 crores compared to a net loss of Rs 12,187.18 crores in the same quarter last year. Total income increased to Rs 1,04,089.67 crores from Rs 72,499.82 crores year-over-year. Revenue from operations rose to Rs 84,627.38 crores versus Rs 71,604.42 crores in the previous year quarter. Total expenses reached Rs 1,12,156.81 crores, up from Rs 85,028.71 crores. The company's earnings per share stood at negative Rs 0.33. During the quarter, subsidiary Centrum Retail Services Limited raised Rs 10,051 crores through debentures, and Centrum Financial Services Limited divested warrants for Rs 185.84 crores.",
            "Sentiment": "negative",
            "PublishDate": 1754658469555,
            "Source": "earnings"
        },
        {
            "Title": "Centrum Capital Reports Wider Quarterly Loss Despite Revenue Growth",
            "Summary": "Centrum Capital's consolidated net loss increased to 1.39 billion rupees from 912 million rupees in the same quarter last year. The company's revenue grew to 8.46 billion rupees compared to 7.2 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754656819977,
            "Source": "earnings"
        },
        {
            "Title": "Business Match Services Creates Pledge on Centrum Capital Shares Worth ₹63 Crore",
            "Summary": "Business Match Services (India) Private Limited has created pledges on equity shares held in Centrum Capital Limited. The company pledged 22 lakh shares (0.53% of total capital) to Metharani Bhawnani on August 1, 2025, and 35 lakh shares (0.84% of total capital) to Minsol Limited on July 30, 2025, for fresh loan purposes. Additionally, 6 lakh shares (0.14% of total capital) were pledged to Ashok KR Choicsey Financial Services on July 30, 2025, also for fresh loan requirements. Following these transactions, Business Match Services' total encumbered shareholding in Centrum Capital increased to 7.48 crore shares, representing 18% of the total share capital. The company holds 13.44 crore shares (32.33%) in Centrum Capital Limited, which is listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1754370157994,
            "Source": "corporate_action"
        },
        {
            "Title": "Centrum Capital Allots Rs 200 Crore Convertible Warrants to Promoter Group Entity",
            "Summary": "Centrum Capital Limited has allotted 7,01,26,225 convertible warrants to JBCG Advisory Services Private Limited, a promoter group entity, at Rs. 28.52 per warrant, totaling Rs. 199.99 crore. The company received 25% of the amount upfront, with the balance due within 18 months upon warrant exercise. The allotment was approved by the Board of Directors and received shareholder approval through postal ballot on June 25, 2025, along with in-principle approvals from BSE and NSE on July 31, 2025. Each warrant will convert into one equity share upon exercise, ranking equally with existing shares. The warrants are subject to lock-in provisions and will be held in electronic form. The paid-up equity share capital remains unchanged until conversion occurs.",
            "Sentiment": "neutral",
            "PublishDate": 1754040331852,
            "Source": "corporate_action"
        },
        {
            "Title": "Business Match Services Releases Pledge on 30 Lakh Centrum Capital Shares",
            "Summary": "Business Match Services (India) Private Limited released a pledge on 30 lakh equity shares of Centrum Capital Limited on July 24, 2025. The pledge release was made in favor of STO Finance Limited due to fluctuation in market price. Following the release, Business Match Services' total encumbered shareholding in Centrum Capital decreased to 7.07 crore shares, representing 17.02% of the company's total share capital. The company holds 13.45 crore shares in Centrum Capital, constituting 32.33% of total share capital. The transaction was reported to BSE and NSE under SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1753440822830,
            "Source": "corporate_action"
        },
        {
            "Title": "Centrum Capital: Board Approves ₹172.6 Crore Fundraise via Preferential Issue",
            "Summary": "Centrum Capital's board has approved raising ₹172.56 crore through a preferential issue of 5,01,91,537 equity shares at ₹34.38 per share to 55 non-promoter investors, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1752603107000,
            "Source": "corporate_action"
        },
        {
            "Title": "Centrum Capital Approves ₹172.56 Crore Fundraise",
            "Summary": "Centrum Capital's Board has approved a fundraising initiative of ₹172.56 crore through preferential allotment. This decision indicates a significant financial move for the company, potentially aimed at strengthening its capital base or funding future growth plans.",
            "Sentiment": "positive",
            "PublishDate": 1752590338000,
            "Source": "default"
        },
        {
            "Title": "Centrum Capital to Discuss Equity Fundraising Options",
            "Summary": "Centrum Capital has announced that it will discuss options for raising funds through equity issuance on July 15. The company is exploring various methods for the fundraising initiative.",
            "Sentiment": "neutral",
            "PublishDate": 1752152235000,
            "Source": "default"
        },
        {
            "Title": "Centrum Capital to Review Q1 Results on August 8",
            "Summary": "Centrum Capital has announced that it will review its Q1 results on August 8. The company has not provided any additional details about the financial performance or expectations for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1751025571000,
            "Source": "default"
        },
        {
            "Title": "Centrum Capital Restructures Broking Operations",
            "Summary": "Centrum Capital has restructured its broking operations by transferring internal stakes worth 438 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1750778797000,
            "Source": "default"
        },
        {
            "Title": "Centrum Capital Approves 2B Rupees Share Warrant Issue",
            "Summary": "Centrum Capital's board has approved the issuance of share warrants worth 2 billion rupees. The warrants will be issued at a price of 28.52 rupees per warrant through a preferential issue. The recipient of these warrants will be JBCG Advisory Services.",
            "Sentiment": "positive",
            "PublishDate": 1748269343000,
            "Source": "default"
        },
        {
            "Title": "Centrum Capital Approves Fund Raising via NCDs and Warrants",
            "Summary": "Centrum Capital has approved fund raising of up to 10 billion rupees through Non-Convertible Debentures (NCDs) and the issuance of warrants up to 2 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1747406463000,
            "Source": "default"
        },
        {
            "Title": "Centrum Capital Reports Increased Q4 Loss and Revenue",
            "Summary": "Centrum Capital reported a consolidated net loss of 205 million rupees in Q4, compared to a loss of 16 million rupees in the same quarter last year. The company's revenue increased to 11.2 billion rupees from 6.6 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1747403137000,
            "Source": "result"
        },
        {
            "Title": "Centrum Capital to Hold Board Meeting for Q4 Results and Fund Raising",
            "Summary": "Centrum Capital has scheduled a board meeting on May 16 to consider and approve the Q4 financial results. Additionally, the company will discuss raising funds up to 10 billion rupees through Non-Convertible Debentures (NCDs).",
            "Sentiment": "neutral",
            "PublishDate": 1743084954000,
            "Source": "corporate_action"
        },
        {
            "Title": "Centrum Capital: Q3 FY25 Loss Widens to ₹52.28 Crore Despite Revenue Growth",
            "Summary": "Centrum Capital reported Q3 FY25 results with revenue up 65.46% YoY to ₹863.81 crore. However, net loss increased by 86.18% YoY to ₹52.28 crore. Operating income rose 83.64% YoY. EPS improved to ₹0.95, up 171.43% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1737847212000,
            "Source": "earnings"
        },
        {
            "Title": "Centrum Capital Approves Rights Issue to Raise 1.50 Billion Rupees",
            "Summary": "Centrum Capital has approved a fund-raising initiative through a rights issue. The company aims to raise up to 1.50 billion rupees (approximately $18.2 million) through this corporate action. A rights issue allows existing shareholders to purchase additional shares at a discounted price, proportionate to their current holdings.",
            "Sentiment": "positive",
            "PublishDate": 1737726217000,
            "Source": "corporate_action"
        },
        {
            "Title": "Centrum Capital Reports Increased Q3 Loss and Revenue",
            "Summary": "Centrum Capital's Q3 consolidated net loss widened to 523 million rupees from 281 million rupees in the same period last year. However, the company's revenue increased to 8.7 billion rupees from 5.6 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1737723474000,
            "Source": "earnings"
        },
        {
            "Title": "Centrum Capital to Consider Fund Raising Proposal",
            "Summary": "Centrum Capital has announced a board meeting scheduled for January 24 to consider a proposal for raising funds. This meeting suggests the company may be looking to increase its capital, potentially for expansion, debt reduction, or other strategic purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1737379246000,
            "Source": "corporate_action"
        },
        {
            "Title": "Centrum Capital Subsidiary Receives Registration Certificate from CDSL",
            "Summary": "A subsidiary of Centrum Capital has been granted a Certificate of Registration from Central Depository Services (CDSL). This registration is a significant development for the company, potentially allowing the subsidiary to engage in depository-related services.",
            "Sentiment": "positive",
            "PublishDate": 1733788675000,
            "Source": "corporate_action"
        },
        {
            "Title": "Centrum Capital Subsidiary Receives Registration Certificate from CDSL",
            "Summary": "A subsidiary of Centrum Capital has been granted a certificate of registration from Central Depository Services (CDSL). This registration is likely to allow the subsidiary to offer depository services, which is an important function in the securities market.",
            "Sentiment": "positive",
            "PublishDate": 1733742177000,
            "Source": "corporate_action"
        },
        {
            "Title": "Centrum Capital Reports Strong Q2 Revenue Growth",
            "Summary": "Centrum Capital has announced its Q2 revenue, which stands at 7.8 billion rupees, showing a significant increase from 5.3 billion rupees in the same quarter last year. This represents a year-over-year growth in revenue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1730289317000,
            "Source": "result"
        },
        {
            "Title": "Centrum Capital Reports Q2 Net Loss",
            "Summary": "Centrum Capital has reported a consolidated net loss of 235 million rupees for the second quarter. This represents a slight increase in loss compared to the same quarter last year (234 million rupees) and a significant improvement from the previous quarter's loss of 912 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1730289305000,
            "Source": "result"
        }
    ]
}