{
    "Symbol": "CENTEXT",
    "ISIN": "INE281A01026",
    "News": [
        {
            "Title": "Century Extrusions Q3FY26 Results & Rights Issue",
            "Summary": "Century Extrusions reports Q3FY26 net profit of Rs. 290 lacs, up 18.37% YoY, with revenue at Rs. 12,253 lacs. Board approves Rs. 45 crores rights issue for fundraising.",
            "Sentiment": "positive",
            "PublishDate": 1770813326165,
            "Source": "co_actions_results"
        },
        {
            "Title": "Century Extrusions Secures ₹18 Cr Credit Facility",
            "Summary": "Century Extrusions Limited executed a credit facility agreement with Bandhan Bank for ₹18.00 crores for working capital purposes on December 31, 2025, secured by current and fixed assets.",
            "Sentiment": "positive",
            "PublishDate": 1767183050920,
            "Source": "stocks"
        },
        {
            "Title": "Century Extrusions Reports Quarterly Financial Results with Mixed Performance",
            "Summary": "Century Extrusions Limited's board approved unaudited financial results for the quarter and half year ended September 30, 2025, showing revenue from operations of Rs. 10,966 lacs for the quarter compared to Rs. 10,415 lacs in the previous quarter. The company reported net profit of Rs. 236 lacs for the quarter versus Rs. 238 lacs in the corresponding previous period, with basic EPS of Rs. 0.30 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1763129120863,
            "Source": "earnings"
        },
        {
            "Title": "Century Extrusions Reports Q1 Results and Director Retirement",
            "Summary": "Century Extrusions Limited approved its unaudited standalone financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 10,415 lacs compared to Rs 10,142 lacs in the same quarter last year. Net profit after tax stood at Rs 236 lacs versus Rs 243 lacs in the corresponding quarter of the previous year. Basic and diluted earnings per share remained flat at Rs 0.30. The Board also noted the retirement of Smt. Suhita Mukhopadhyay as Non-Executive Independent Director effective September 7, 2025, upon completion of her second five-year term. Post her retirement, the Board will comprise six directors with half being Non-Executive Independent Directors. The company operates in two business segments: manufacturing of Aluminium Extruded Products and Transmission and Distribution Line Hardware.",
            "Sentiment": "neutral",
            "PublishDate": 1754660159706,
            "Source": "corporate_action"
        },
        {
            "Title": "Century Extrusions to Invest 300 Million Rupees in New Extrusion Press",
            "Summary": "Century Extrusions has announced plans to set up a new extrusion press at their Kharagpur plant. The company will invest 300 million rupees in this expansion project.",
            "Sentiment": "positive",
            "PublishDate": 1731333745000,
            "Source": "corporate_action"
        },
        {
            "Title": "Century Extrusions Reports Q2 Financial Results",
            "Summary": "Century Extrusions has announced its Q2 financial results. The company reported a net profit of 24 million rupees, which is a slight increase from 23 million rupees in the same quarter last year. The net profit remained stable at 24 million rupees compared to the previous quarter. Revenue for Q2 increased to 1.07 billion rupees from 957 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731328909000,
            "Source": "result"
        }
    ]
}