{
    "Symbol": "CENTENKA",
    "ISIN": "INE485A01015",
    "News": [
        {
            "Title": "Century Enka Q3 Net Profit Surges 67% to ₹239M",
            "Summary": "Century Enka reported strong Q3 performance with net profit jumping 67% year-on-year to ₹239 million from ₹143 million in the same quarter last year, demonstrating robust operational growth.",
            "Sentiment": "positive",
            "PublishDate": 1770367836179,
            "Source": "co_actions_results"
        },
        {
            "Title": "Century Enka Board Meet Set for Feb 6 for Q3FY26 Results",
            "Summary": "Century Enka Limited has scheduled its board meeting for February 6, 2026, to consider and approve unaudited financial results for Q3FY26. Trading window remains closed until February 8, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769527272101,
            "Source": "co_actions_results"
        },
        {
            "Title": "Century Enka Reports 24% Revenue Decline in Q2 FY26 Amid Chinese Import Pressure",
            "Summary": "Century Enka Limited reported operating revenue of INR 409 crores in Q2 FY26, declining 24% year-on-year but increasing 2% quarter-on-quarter. EBITDA stood at INR 32 crores with margins at 7.73%, while profit after tax was INR 22 crores, up 4% year-on-year. The company faced challenges from subdued demand and increased low-cost imports from China in both tyre cord fabrics and filament yarn segments. For H1 FY26, revenue declined 24% to INR 810 crores with total volumes down 14% to 34,992 metric tons. The industry is pursuing anti-dumping duties on nylon filament yarn imports from China. The company expects commercial supplies from its PTCF project to begin in Q4, with total investment of approximately INR 100 crores. Management anticipates better volumes in the second half supported by GST reductions on tyres and festive season demand, though geopolitical tensions and trade uncertainties remain key risks.",
            "Sentiment": "negative",
            "PublishDate": 1763017468411,
            "Source": "earnings"
        },
        {
            "Title": "Century Enka Reports Q2 FY26 Revenue of INR 4,087 Million with 7.73% EBITDA Margin",
            "Summary": "Century Enka Limited reported quarterly results with revenue from operations of INR 4,087 million and EBITDA of INR 316 million, representing a 7.73% EBITDA margin. Net profit stood at INR 223 million with a 5.46% PAT margin, resulting in basic/diluted EPS of INR 10.22. For the half-year period, revenue reached INR 8,102 million with EBITDA of INR 516 million (6.37% margin) and net profit of INR 377 million (4.65% margin). The company's Tyre Cord Fabric business faced challenges from lower demand and higher imports from China, while margins remained under pressure from cheap imports. Filament yarn sales volumes improved sequentially after plant restart following fire disruption. The company continues to face impact from significantly increased imports from China at low prices. Caprolactam prices continued to decline to record lows, though the pace of decline has reduced. The company has two manufacturing facilities in Pune and Bharuch with capacity of 92,000 MTPA and maintains a net surplus cash position.",
            "Sentiment": "neutral",
            "PublishDate": 1762616117290,
            "Source": "earnings"
        },
        {
            "Title": "Century Enka Reports Mixed Q2 Results with Revenue Decline and Profit Growth",
            "Summary": "Century Enka reported quarterly results showing EBITDA of 316 million rupees compared to 379 million rupees in the same period last year. The company's EBITDA margin improved to 7.74% from 7.07% year-over-year. Net profit increased to 226 million rupees from 216 million rupees in the previous year. However, revenue declined significantly to 4.1 billion rupees from 5.4 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1762417713199,
            "Source": "earnings"
        },
        {
            "Title": "Century Enka Schedules Q2FY26 Earnings Conference Call for November 10",
            "Summary": "Century Enka Limited has announced an earnings conference call scheduled for Monday, November 10, 2025, at 11:00 AM IST to discuss Q2FY26 results. The call will be represented by Managing Director Suresh Sodani and Chief Financial Officer Yogesh Shah. The company has provided multiple access numbers for participants, including toll-free numbers for various countries and registration options for investors. Call details are available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1761654403806,
            "Source": "earnings"
        },
        {
            "Title": "Century Enka Receives GPCB Approval for Continued Operations at Spinning Plants",
            "Summary": "Century Enka has received approval from the Gujarat Pollution Control Board (GPCB) to continue operations at its NFY Spinning Plant and Rajashree Polyfil facilities. The green signal from the environmental regulatory authority allows the company to maintain production at these manufacturing units.",
            "Sentiment": "positive",
            "PublishDate": 1756080683288,
            "Source": "stock"
        },
        {
            "Title": "Century Enka Receives Approval to Continue Operations at NFY Spinning Plant After Fire Incident",
            "Summary": "Century Enka Limited has received permission from the Gujarat Pollution Control Board to continue operations at its NFY Spinning Plant following a fire incident. The company had previously reported a fire at the NFY Spinning Plant at Unit-Rajashree Polyfil in Gujarat, which led to an interim Fire Accident Environment Compensation of Rs. 36 lakhs and a Bank Guarantee requirement of Rs. 2.5 lakhs. After a GPCB officer visited the facility and found the unit complying with Consolidated Consent and Authorisation conditions and submitted notarized undertakings, the board confirmed continued operation permission. The company has been directed to maintain adherence to applicable CCA conditions. No quantifiable financial impact from this regulatory approval was disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1755932572452,
            "Source": "stock"
        },
        {
            "Title": "Century Enka Limited Concludes 59th Annual General Meeting, Passes Key Resolutions Including Dividend Declaration",
            "Summary": "Century Enka Limited held its 59th Annual General Meeting on August 12, 2025, through video conferencing. Shareholders passed seven resolutions with requisite majority through remote e-voting and electronic voting during the meeting. The approved resolutions included adoption of audited standalone and consolidated financial statements for the financial year ended March 31, 2025, declaration of dividend on equity shares, and re-appointment of Mr. Jayant V. Dhobley as director. Additionally, shareholders approved the re-appointment of Mrs. Krupa R. Gandhi as Independent Director and Mr. Suresh Sodani as Managing Director. The meeting also saw approval for appointment of M/s. Sanjay Sangani & Co. as Secretarial Auditors and ratification of Cost Auditors' remuneration for the financial year ending March 31, 2026. The meeting was conducted from 2:30 PM to 3:54 PM IST.",
            "Sentiment": "neutral",
            "PublishDate": 1755005462143,
            "Source": "corporate_action"
        },
        {
            "Title": "Century Enka Appoints Dr. Partheban Manoharan as Head of CTS and Quality Assurance",
            "Summary": "Century Enka Limited appointed Dr. Partheban Manoharan as Head - CTS and Quality Assurance effective August 8, 2025. The appointment was approved by the Board of Directors based on the Nomination and Remuneration Committee's recommendation through a circular resolution. Dr. Manoharan brings expertise in Materials Development, Quality Assurance, and Technical Services within the tyre and polymer industry. His experience includes R&D work on high-performance tyre compounds, feasibility analyses, reverse engineering, and managing product development and commercialization. He holds a Ph.D. in Polymer Science and Technology from IIT Kharagpur, an M.Tech in Rubber Technology, and a B.E. in Production Engineering from Anna University, Chennai. The appointment is for full-time employment.",
            "Sentiment": "positive",
            "PublishDate": 1754649983857,
            "Source": "corporate_governance"
        },
        {
            "Title": "Century Enka Q1 FY26 Revenue Falls 24% to ₹402 Crores Amid Weak Demand and Chinese Imports",
            "Summary": "Century Enka Limited reported operating revenue of ₹402 crores for Q1 FY26, declining 24% year-on-year. EBITDA dropped 52% to ₹20 crores with margins at 4.96%, while profit after tax decreased 37% to ₹15 crores. Total volumes fell 17% to 17,072 metric tons. Tyre Cord Fabrics revenue declined 35% to ₹181 crores due to lower demand from the tyre industry and higher imports from China, particularly affecting 2-wheeler and commercial vehicle segments. Filament Yarn revenue decreased 15% to ₹193 crores, impacted by a fire at the Bharuch plant in February 2025, which resumed full operations in June 2025. Raw material caprolactam prices fell to record lows, creating margin pressure. The company expects demand improvement in Q2 following inventory adjustments by tyre manufacturers and anticipates better second-half performance supported by festive season demand and favorable monsoon impact on farm income. Management indicated normal EBITDA margin targets of 6-8% and expects new capacity to contribute ₹100-120 crores at full utilization.",
            "Sentiment": "negative",
            "PublishDate": 1754562886336,
            "Source": "earnings"
        },
        {
            "Title": "Century Enka Reports 24% Revenue Decline in Q1FY26 Due to Weak Tyre Industry Demand",
            "Summary": "Century Enka Limited reported revenue of INR 4,015 million for Q1FY26, declining 24% year-over-year from INR 5,280 million in Q1FY25. EBITDA fell significantly to INR 199 million with margins at 4.96%, down from 7.78% in the previous year. Net profit decreased 36.6% to INR 154 million. The company's performance was impacted by lower demand from tyre industries, higher imports from China, and a slowdown in automobile sectors, particularly two-wheelers and commercial vehicles. Filament yarn sales were affected by a fire at the Bharuch plant in February 2025, which resumed full operations in June 2025. Raw material costs faced pressure as Caprolactam prices dropped to record lows. The company expects NTCF demand may improve in Q2 after inventory adjustments at tyre producers, with better demand anticipated in H2 due to festive season and favorable monsoon impact on farm income.",
            "Sentiment": "negative",
            "PublishDate": 1754206387438,
            "Source": "earnings"
        },
        {
            "Title": "Century Enka Reports 37% Decline in Q1 Net Profit to 154 Million Rupees",
            "Summary": "Century Enka reported quarterly net profit of 154 million rupees, down from 243 million rupees in the same period last year. The company's EBITDA fell to 199 million rupees from 410 million rupees year-over-year, with EBITDA margin contracting to 4.95% from 7.76%. Revenue declined to 4 billion rupees compared to 5.3 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754036386685,
            "Source": "earnings"
        },
        {
            "Title": "Century Enka Limited Schedules Q1FY26 Earnings Conference Call for August 4, 2025",
            "Summary": "Century Enka Limited has scheduled an earnings conference call with investors on Monday, August 4, 2025 at 4:00 PM IST to discuss Q1FY26 financial results. The call will be represented by Managing Director Suresh Sodani and Chief Financial Officer Yogesh R. Shah. Arihant Capital Markets Ltd is hosting the conference call, which will provide universal dial-in numbers for domestic and international participants, as well as an express join option. The company trades on BSE under scrip code 500280 and on NSE under symbol CENTENKA.",
            "Sentiment": "neutral",
            "PublishDate": 1753450320072,
            "Source": "earnings"
        },
        {
            "Title": "Century Enka Resumes NFY Spinning Plant Operations After Fire Incident",
            "Summary": "Century Enka has restarted operations at its NFY (Nylon Filament Yarn) spinning plant following a fire incident. The Gujarat Pollution Control Board (GPCB) has given approval for the plant to resume operations.",
            "Sentiment": "positive",
            "PublishDate": 1750645504000,
            "Source": "default"
        },
        {
            "Title": "Century Enka Reports Q4 Results and Declares Dividend",
            "Summary": "Century Enka announced its Q4 financial results, showing a decline in revenue and profitability. The company's revenue decreased to 4.4 billion rupees from 4.7 billion rupees year-over-year. EBITDA fell significantly to 87.7 million rupees from 338 million rupees, with the EBITDA margin dropping to 1.98% from 7.21%. Net profit also declined to 69 million rupees from 203 million rupees. Despite the lower performance, Century Enka declared a dividend of 10 rupees per share.",
            "Sentiment": "negative",
            "PublishDate": 1746522468000,
            "Source": "result"
        },
        {
            "Title": "Fire Incident at Century Enka's NFY Spinning Plant",
            "Summary": "A fire has occurred at Century Enka Limited's NFY (Nylon Filament Yarn) spinning plant. The company has reported the incident, but no further details about the extent of damage, potential impact on operations, or any injuries have been provided in this brief news update.",
            "Sentiment": "negative",
            "PublishDate": 1740634040000,
            "Source": "corporate_action"
        },
        {
            "Title": "Century Enka Reports Q3 Revenue Growth",
            "Summary": "Century Enka has announced its third-quarter revenue figures. The company reported revenue of 4.9 billion rupees, compared to 4.5 billion rupees in the same quarter of the previous year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1739262885000,
            "Source": "earnings"
        },
        {
            "Title": "Century Enka Reports Improved Q3 EBITDA and Margin",
            "Summary": "Century Enka has reported a significant improvement in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 271 million rupees, up from 183 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin improved to 5.49% from 4.06% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739262863000,
            "Source": "earnings"
        },
        {
            "Title": "Century Enka Reports Significant Profit Growth in Q3",
            "Summary": "Century Enka has announced its financial results for the third quarter, reporting a net profit of 143 million rupees. This represents a substantial increase from the 74 million rupees reported in the same quarter of the previous year, indicating strong year-over-year growth for the company.",
            "Sentiment": "positive",
            "PublishDate": 1739262787000,
            "Source": "earnings"
        },
        {
            "Title": "Century Enka Reports Significant Q2 EBITDA Growth",
            "Summary": "Century Enka has announced its Q2 financial results, showing a substantial increase in EBITDA from 93 million rupees to 379 million rupees year-over-year. The company's EBITDA margin also improved significantly, rising from 2.36% to 7.07% compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730968197000,
            "Source": "result"
        },
        {
            "Title": "Century Enka Reports 36% Revenue Growth in Q2",
            "Summary": "Century Enka, a synthetic yarn manufacturer, has reported a significant increase in its second-quarter revenue. The company's revenue rose to 5.4 billion rupees, up from 3.96 billion rupees in the same period last year, representing a year-over-year growth of approximately 36%.",
            "Sentiment": "positive",
            "PublishDate": 1730968181000,
            "Source": "result"
        },
        {
            "Title": "Century Enka Reports Significant Profit Increase in Q2",
            "Summary": "Century Enka has announced a substantial year-over-year increase in its second-quarter net profit, rising from 45 million rupees to 216 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1730968155000,
            "Source": "result"
        }
    ]
}