{
    "Symbol": "CENTRALBK",
    "ISIN": "INE483A01010",
    "News": [
        {
            "Title": "Central Bank of India Issues Strike Notice for Feb 12",
            "Summary": "Central Bank of India informs exchanges about proposed bank strike on February 12, 2026, called by major banking unions in support of Central Trade Unions' strike call.",
            "Sentiment": "neutral",
            "PublishDate": 1770810365412,
            "Source": "stocks"
        },
        {
            "Title": "Central Bank Partners with HSBC AMC for Mutual Funds",
            "Summary": "Central Bank of India enters distribution agreement with HSBC Asset Management (India) Private Limited to offer mutual fund products to customers, expanding investment options through HSBC's Rs.1,38,654 crore AUM platform.",
            "Sentiment": "positive",
            "PublishDate": 1769862246219,
            "Source": "stocks"
        },
        {
            "Title": "Central Bank of India Alerts on Proposed Strike",
            "Summary": "Central Bank of India informs exchanges about United Forum of Bank Unions' proposed one-day strike on January 27, 2026, while assuring continuity of banking operations through contingency measures.",
            "Sentiment": "neutral",
            "PublishDate": 1769174207019,
            "Source": "stocks"
        },
        {
            "Title": "Central Bank of India Ratings Reaffirmed by CRISIL",
            "Summary": "CRISIL reaffirmed Central Bank of India's AA/Stable corporate credit rating and other instrument ratings on January 22, 2026, citing expected strong government support and adequate resource profile despite moderate asset quality.",
            "Sentiment": "positive",
            "PublishDate": 1769082045206,
            "Source": "co_actions_results"
        },
        {
            "Title": "Central Bank of India Q3FY26 Earnings Call Recording",
            "Summary": "Central Bank of India has uploaded the audio recording of its earnings call held on January 16, 2026, discussing Q3FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768567729626,
            "Source": "co_actions_results"
        },
        {
            "Title": "Central Bank of India Declares 3rd Interim Dividend",
            "Summary": "Central Bank of India announces 3rd interim dividend at 2% (₹0.20 per share) for FY2026 with record date set for January 23, 2026, as approved by the Board of Directors.",
            "Sentiment": "positive",
            "PublishDate": 1768559003398,
            "Source": "co_actions_results"
        },
        {
            "Title": "Central Bank of India Q3 Results Show 31.6% Profit Growth",
            "Summary": "Central Bank of India reported Q3FY26 net profit of ₹1,262 crore, up 31.6% YoY. Other income surged 57.4% to ₹1,935 crore. Gross NPA improved to 2.7% from 3.01% QoQ. Shares gained 3.6% on results.",
            "Sentiment": "positive",
            "PublishDate": 1768552906648,
            "Source": "co_actions_results"
        },
        {
            "Title": "Central Bank of India Q3 Profit Jumps 32% YoY to ₹1,263 Cr",
            "Summary": "Central Bank of India reported 32% YoY profit growth to ₹1,263 crores in Q3 FY26, with gross NPAs declining to 2.70% from 3.86% and total business growing to ₹7.74 lakh crores.",
            "Sentiment": "positive",
            "PublishDate": 1768552533159,
            "Source": "co_actions_results"
        },
        {
            "Title": "Central Bank of India Q3FY26 earnings call on Jan 16",
            "Summary": "Central Bank of India announces virtual earnings call with analysts and investors on January 16, 2026 at 4:00 PM IST to discuss Q3FY26 and nine-month financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1768220197483,
            "Source": "co_actions_results"
        },
        {
            "Title": "Central Bank of India Board Meet on Jan 16, 2026",
            "Summary": "Central Bank of India announces board meeting on January 16, 2026 to consider Q3FY26 unaudited financial results and third interim dividend proposal for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1767947043500,
            "Source": "co_actions_results"
        },
        {
            "Title": "Central Bank Q3 update: Advances grow 19.6%, CASA slips",
            "Summary": "Central Bank of India reports 15.8% business growth to ₹7.74 lakh crore in Q3, with advances rising 19.57% and CASA ratio declining to 47.12%. Q2 net profit surged 32.8% to ₹1,212.8 crore.",
            "Sentiment": "positive",
            "PublishDate": 1767592730814,
            "Source": "co_actions_results"
        },
        {
            "Title": "Central Bank of India GM Bharat Bhushan Mutreja Retires",
            "Summary": "Central Bank of India announces the superannuation of Shri Bharat Bhushan Mutreja, General Manager of Recovery Department, effective December 31, 2025, under SEBI LODR regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1767185518749,
            "Source": "stocks"
        },
        {
            "Title": "Central Bank of India Gets IND AA Rating Reaffirmed",
            "Summary": "India Ratings reaffirmed Central Bank of India's IND AA/Stable rating for long-term issuer rating and Basel III Tier-II bonds, citing improved capital position and asset quality.",
            "Sentiment": "positive",
            "PublishDate": 1766418135392,
            "Source": "co_actions_results"
        },
        {
            "Title": "Central Bank Appoints Auditors for FY2025-26",
            "Summary": "Central Bank of India announces appointment of statutory central auditors for FY2025-26 with RBI approval. Three continuing firms retained, one new appointment made replacing retired auditor.",
            "Sentiment": "neutral",
            "PublishDate": 1766405943678,
            "Source": "stocks"
        },
        {
            "Title": "Central Bank of India Appoints New Chief Compliance Officer",
            "Summary": "Central Bank of India has appointed Mrs. Kavita Thakur as Chief Compliance Officer, replacing Mr. Joy Mukherjee effective December 20, 2025. Thakur brings over 35 years of banking experience to the role.",
            "Sentiment": "neutral",
            "PublishDate": 1766228118315,
            "Source": "stocks"
        },
        {
            "Title": "Central Bank of India Gets Credit Rating Reaffirmation",
            "Summary": "CARE Ratings reaffirmed Central Bank of India's Certificate of Deposits rating at CARE A1+ for ₹10,000 crore programme, citing improved capitalisation and government support.",
            "Sentiment": "positive",
            "PublishDate": 1765526787104,
            "Source": "co_actions_results"
        },
        {
            "Title": "Central Bank Partners with Bandhan AMC for Mutual Funds",
            "Summary": "Central Bank of India enters distribution agreement with Bandhan AMC Limited to offer mutual fund products to customers. Partnership aims to help customers unlock savings value through diverse investment options.",
            "Sentiment": "positive",
            "PublishDate": 1765379678553,
            "Source": "stocks"
        },
        {
            "Title": "Central Bank of India Announces Senior Management Changes with Four Key Promotions and Appointments",
            "Summary": "Central Bank of India promoted Vasti Venkatesh as Chief General Manager-International Division Treasury Department and P Mahadevan as General Manager-Retail Assets, while appointing Vivek Kumar as General Manager-Finance Accounts and Kavita Thakur as General Manager-Compliance effective December 1, 2025. The changes involve experienced banking professionals with 26-35 years of experience across various departments, strengthening the bank's leadership structure in key operational areas.",
            "Sentiment": "positive",
            "PublishDate": 1764679871349,
            "Source": "corporate_governance"
        },
        {
            "Title": "Central Bank of India General Manager Pravin Keshav Kini Retires",
            "Summary": "Shri Pravin Keshav Kini, General Manager Emerging Business at Central Bank of India, superannuated on November 30, 2025. The bank informed stock exchanges NSE and BSE about this management change as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1764509488280,
            "Source": "corporate_governance"
        },
        {
            "Title": "Central Bank of India Appoints E. Ratan Kumar as Executive Director",
            "Summary": "Central Bank of India appointed Shri E. Ratan Kumar as Executive Director for three years, effective from his assumption of office on November 24, 2025, following government notification. Kumar, who previously served as Chief General Manager, brings 35 years of banking experience across banking and IT areas to his new board position.",
            "Sentiment": "positive",
            "PublishDate": 1764059325822,
            "Source": "corporate_governance"
        },
        {
            "Title": "Central Bank of India Wins Bid to Acquire Additional Stakes in Generali Central Insurance Companies",
            "Summary": "Central Bank of India has been declared the successful bidder by the Committee of Creditors for the sale of assets of Future Corporate Resources Private Limited (FCRPL). The acquisition involves FCRPL's equity stakes of 0.82% in Generali Central Life Insurance Company Limited and 1.09% in Generali Central Insurance Company Limited. The bank received a Letter of Intent dated November 4, 2025. Upon completion of the acquisition process, Central Bank of India's equity stake in both insurance companies will increase from 25.18% and 24.91% respectively to 26% each.",
            "Sentiment": "positive",
            "PublishDate": 1762453952201,
            "Source": "order&deals"
        },
        {
            "Title": "Central Bank of India Reports 32.86% Jump in Net Profit, Gross NPA Falls to 3.01%",
            "Summary": "Central Bank of India reported a net profit of Rs. 1,213 crores for the second quarter, marking a 32.86% year-on-year increase. The bank's total business grew 14.43% to Rs. 7,37,938 crores, with deposits rising 13.40% to Rs. 4,44,450 crores and gross advances increasing 16% to Rs. 2,93,488 crores. Asset quality improved significantly with gross NPA declining 158 basis points to 3.01% and net NPA falling to 0.48%. Return on assets increased to 1.01% while return on equity rose to 14.22%. However, the bank faced challenges with cost-to-income ratio rising to 62.72% from 57.19% year-on-year, and net interest margin compressed 52 basis points to 2.89%. Operating profit decreased to Rs. 1,786 crores due to lower treasury income. Managing Director Kalyan Kumar outlined plans to maintain a 65:35 ratio between retail-agriculture-MSME and corporate lending, focus on digital initiatives, and target recovery of over Rs. 2,000 crores from written-off accounts during the financial year.",
            "Sentiment": "positive",
            "PublishDate": 1761565996128,
            "Source": "earnings"
        },
        {
            "Title": "Central Bank of India Announces Record Date for Second Interim Dividend Payment",
            "Summary": "Central Bank of India has announced the record date for payment of its second interim dividend and provided tax deduction at source (TDS) information for shareholders. The bank published newspaper advertisements in Financial Express (English), Jansatta (Hindi), and Loksatta (Marathi) on October 19, 2025, regarding the record date intimation for the second interim dividend payment and TDS communication. The announcement was made through a regulatory filing dated October 20, 2025, signed by Company Secretary & Compliance Officer Chandrakant Bhagwat.",
            "Sentiment": "neutral",
            "PublishDate": 1760963127840,
            "Source": "corporate_action"
        },
        {
            "Title": "Central Bank of India Declares Second Interim Dividend of 20 Paise Per Share",
            "Summary": "Central Bank of India's board has recommended a second interim dividend of 20 paise per share for shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1760703105177,
            "Source": "corporate_action"
        },
        {
            "Title": "Central Bank of India Reports Q2 FY2026 Results and Declares 2% Interim Dividend",
            "Summary": "Central Bank of India's Board approved unaudited standalone and consolidated financial results for Q2 and H1 FY2026 on October 17, 2025. The bank declared a 2% interim dividend (₹0.20 per equity share with face value of ₹10 each). Standalone net profit for Q2 was ₹1,21,288 lakh compared to ₹91,284 lakh in Q2 FY2025. For H1, net profit reached ₹2,38,157 lakh versus ₹1,79,278 lakh in the previous year. Gross NPA ratio improved to 3.01% from 4.59% year-over-year, while net NPA ratio decreased to 0.48% from 0.69%. The bank's capital adequacy ratio stood at 17.34%. Operating profit for Q2 was ₹1,78,562 lakh. The bank changed its depreciation method from Written Down Value to Straight Line Method, resulting in increased depreciation and decreased net profit by ₹2,637 lakh for the half year.",
            "Sentiment": "positive",
            "PublishDate": 1760690765681,
            "Source": "earnings"
        },
        {
            "Title": "Central Bank Of India Partners With Godrej Housing Finance For Co-Lending Housing Loans",
            "Summary": "Central Bank Of India has formed a co-lending partnership with Godrej Housing Finance for housing loans. The partnership aims to grow the bank's housing loan portfolio and provide better interest rates to customers.",
            "Sentiment": "positive",
            "PublishDate": 1760619687203,
            "Source": "order&deals"
        },
        {
            "Title": "Central Bank of India to Consider Second Interim Dividend for FY 2025-26",
            "Summary": "Central Bank of India announced that its Board of Directors meeting on October 17, 2025 will consider a proposal to declare a second interim dividend for FY 2025-26. The board meeting will also review the bank's Q2 FY 2025-26 financial results. The meeting is scheduled to take place at the bank's Head Office in Mumbai.",
            "Sentiment": "positive",
            "PublishDate": 1760452079771,
            "Source": "corporate_action"
        },
        {
            "Title": "Central Bank of India Partners with C2FO Factoring Solutions for MSME Trade Receivables Discounting Services",
            "Summary": "Central Bank of India has entered into a strategic partnership with C2FO Factoring Solutions Pvt. Ltd. to provide Trade Receivables Discounting System (TReDS) services for MSMEs across India. The collaboration aims to improve liquidity and financial inclusion for small and medium enterprises through the C2Treds platform. C2FO Factoring Solutions, a wholly owned subsidiary of US-based C2FO, received RBI permission to operate as a TReDS platform on March 4, 2024. Under this partnership, Central Bank of India will offer seamless invoice discounting services through the licensed C2Treds platform, supporting the Reserve Bank of India's initiative to expand digital financing avenues for MSMEs and promote transparent trade receivables management.",
            "Sentiment": "positive",
            "PublishDate": 1758608025445,
            "Source": "order&deals"
        },
        {
            "Title": "Central Bank of India Approves Rs 64.40 Crore Investment in Subsidiary's Rights Issue",
            "Summary": "Central Bank of India's Board of Directors approved a proposal to invest Rs 64.40 crore in a rights issue of its subsidiary, Cent Home Bank Finance Ltd. The total rights issue is valued at Rs 100 crore and is subject to necessary approvals. The board meeting was held on September 17, 2025, commencing at 3:00 pm and concluding at 5:15 pm.",
            "Sentiment": "positive",
            "PublishDate": 1758116028888,
            "Source": "corporate_action"
        },
        {
            "Title": "Central Bank of India Extends Executive Director's Term Until 2027",
            "Summary": "The Department of Financial Services, Ministry of Finance has extended the term of office for Shri M V Murali Krishna, Executive Director of Central Bank of India. His term, which was set to expire on November 30, 2025, has been extended until his superannuation on July 31, 2027, or until further orders. The extension was notified on September 15, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758009397677,
            "Source": "corporate_governance"
        },
        {
            "Title": "Central Bank of India Partners with KredX to Offer TReDS Services for MSMEs",
            "Summary": "Central Bank of India has announced a strategic partnership with KredX Platform Pvt Ltd to facilitate Trade Receivables Discounting System (TReDS) services for MSMEs across the country. Under this partnership, Central Bank of India will leverage KredX's newly licensed TReDS platform, branded as DTX (Domestic Trade Exchange), to offer seamless invoice discounting services. KredX is described as India's leading integrated supply chain finance platform and is licensed by both the Reserve Bank of India (RBI) and the International Financial Services Centers Authority (IFSCA). The collaboration aims to improve liquidity and financial inclusion for small and medium enterprises and aligns with RBI's push to expand digital financing avenues for MSMEs and promote transparent, efficient trade receivables management.",
            "Sentiment": "positive",
            "PublishDate": 1756115631085,
            "Source": "order&deals"
        },
        {
            "Title": "Central Bank of India Receives RBI Approval to Establish IFSC Banking Unit in GIFT City",
            "Summary": "Central Bank of India has received approval from the Reserve Bank of India to establish an IFSC Banking Unit (IBU) in GIFT City, Gandhinagar, Gujarat. The approval was granted through RBI's letter dated August 11, 2025. The IBU will enable the bank to expand its international banking business and provide specialized banking services to customers. The unit will offer access to international financial markets and deliver foreign currency funding solutions to corporate clients. Services will include foreign currency loans, trade finance solutions, treasury and risk management products, and enhanced banking solutions for customers.",
            "Sentiment": "positive",
            "PublishDate": 1755004923868,
            "Source": "stock"
        },
        {
            "Title": "Shri Matam Venkat Rao Retires as Managing Director & CEO of Central Bank of India",
            "Summary": "Shri Matam Venkat Rao ceased to be the Managing Director & CEO of Central Bank of India effective from the close of working hours on July 31, 2025, due to superannuation. The bank notified stock exchanges BSE and NSE about this change in board composition. Chandrakant Bhagwat, Company Secretary & Compliance Officer, signed the notification.",
            "Sentiment": "neutral",
            "PublishDate": 1753983218384,
            "Source": "corporate_governance"
        },
        {
            "Title": "Central Bank of India Appoints Shri Baldeo Purushartha as Government Nominee Director",
            "Summary": "Central Bank of India has appointed Shri Baldeo Purushartha as Government Nominee Director on its Board, effective July 24, 2025, replacing Shri Hardik Mukesh Sheth. Purushartha, an IAS officer since 2002, currently serves as Joint Secretary in the Department of Economic Affairs, Ministry of Finance. He has held various government positions including Secretary at Lokpal, Divisional Commissioner in Jalandhar, and roles in Punjab government departments. He represents the Government of India on boards of multiple organizations including India Infrastructure Finance Company Ltd., Indian Railway Finance Corporation Limited, and serves as Director in the Executive Board of International Fund for Agricultural Development. Purushartha holds a Post Graduate degree in History from University of Delhi and is not related to any existing Directors or Key Managerial Personnel of the bank.",
            "Sentiment": "neutral",
            "PublishDate": 1753448403358,
            "Source": "corporate_governance"
        },
        {
            "Title": "Central Bank of India Announces Record Date for Interim Dividend Payment",
            "Summary": "Central Bank of India has published newspaper advertisements across multiple publications including Business Standard (English), Navbharat (Hindi), and a Marathi newspaper in Mumbai to inform shareholders about the record date for interim dividend payment and tax deduction details. The advertisements were published on July 23rd, 2025, in compliance with SEBI regulations. The communication was signed by Chandrakant Bhagwat, Company Secretary & Compliance Officer.",
            "Sentiment": "neutral",
            "PublishDate": 1753275676611,
            "Source": "corporate_action"
        },
        {
            "Title": "Central Bank of India Reports Quarterly Financial Results for June 2025",
            "Summary": "Central Bank of India has published its financial results for the quarter ended June 30, 2025. The bank submitted newspaper advertisements regarding its unaudited standalone and consolidated financial results to stock exchanges NSE and BSE on July 21, 2025. The advertisements were published in Financial Express (English), Rajdhani (Hindi), and Loksatha (Marathi) newspapers on July 20, 2025. The document was signed by Company Secretary & Compliance Officer Chandrakant Bhagwat and submitted pursuant to SEBI LODR Regulations 47 & 52.",
            "Sentiment": "neutral",
            "PublishDate": 1753160660662,
            "Source": "earnings"
        },
        {
            "Title": "Central Bank of India Makes Q1 FY2026 Earnings Call Recording Available Online",
            "Summary": "Central Bank of India has uploaded the audio recording of its conference call with analysts and investors discussing the unaudited financial results for the first quarter ended June 30, 2025. The earnings call was held on July 21, 2025, and the recording is now accessible on the bank's website through provided links. The bank informed stock exchanges NSE and BSE about the availability of this recording through a formal communication signed by Company Secretary Chandrakant Bhagwat.",
            "Sentiment": "neutral",
            "PublishDate": 1753156819361,
            "Source": "earnings"
        },
        {
            "Title": "Central Bank Reports Improved Asset Quality with Lower NPAs and Provisions in Q1",
            "Summary": "Central Bank's Q1 results show significant improvement in asset quality metrics. The bank's provisions for non-performing assets decreased to 4.7 billion rupees from 8.3 billion rupees quarter-on-quarter. Gross non-performing assets (GNPA) ratio improved to 3.13% from 3.18%, while net non-performing assets (NNPA) ratio declined to 0.49% from 0.55% on a quarter-on-quarter basis.",
            "Sentiment": "positive",
            "PublishDate": 1752914640611,
            "Source": "earnings"
        },
        {
            "Title": "Central Bank of India: Q1 FY26 Results and Dividend Announcement Scheduled",
            "Summary": "Central Bank of India will announce Q1 FY26 results on July 19, 2025. The board will consider an interim dividend. Trading window is closed from July 1 until 48 hours post-results. Earnings call scheduled for July 21, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1752814694000,
            "Source": "corporate_action"
        },
        {
            "Title": "Central Bank of India: Record Date Set for FY25 Dividend",
            "Summary": "Central Bank of India has announced July 4, 2025, as the record date for its FY25 final dividend of Rs 0.1875 per share. The dividend is subject to shareholder approval at the AGM scheduled for July 19, 2025. The bank's Q4 FY25 net profit increased by 35.3% YoY to Rs 1,104.58 crore.",
            "Sentiment": "positive",
            "PublishDate": 1751257494000,
            "Source": "corporate_action"
        },
        {
            "Title": "Central Bank of India: Acquires Stakes in Future Generali Insurance Arms",
            "Summary": "Central Bank of India has acquired 24.91% stake in Future Generali India Insurance Company Ltd and 25.18% in Future Generali India Life Insurance Company Ltd. The bank signed agreements with Generali Group for governance, branding, and distribution frameworks. A bancassurance agreement was also established for distributing life insurance products through the bank's network.",
            "Sentiment": "positive",
            "PublishDate": 1751046385000,
            "Source": "corporate_action"
        },
        {
            "Title": "Central Bank of India Reports Strong Q4 Financial Results",
            "Summary": "Central Bank of India has announced its Q4 financial results, showing significant improvements. The bank's net profit increased to 10.34 billion rupees, up from 8.1 billion year-over-year and 9.6 billion quarter-over-quarter. Revenue rose to 86.2 billion rupees from 83.4 billion year-over-year. The bank's asset quality improved, with Gross Non-Performing Assets (GNPA) decreasing to 3.18% from 3.86% in the previous quarter, and Net Non-Performing Assets (NNPA) slightly reducing to 0.55% from 0.59%. Provisions increased to 8.44 billion rupees from 5.57 billion in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745885460000,
            "Source": "default"
        },
        {
            "Title": "Central Bank of India Reports Strong Q4 Financial Results",
            "Summary": "Central Bank of India has announced its Q4 financial results, showing improvements across key metrics. The bank's net profit increased to 10.34 billion rupees, up from 8.1 billion year-over-year and 9.6 billion quarter-over-quarter. Revenue rose to 86.2 billion rupees from 83.4 billion year-over-year. The bank's asset quality improved, with Gross Non-Performing Assets (GNPA) decreasing to 3.18% from 3.86% in the previous quarter, and Net Non-Performing Assets (NNPA) slightly reducing to 0.55% from 0.59%. However, provisions increased to 8.44 billion rupees from 5.57 billion in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745840134000,
            "Source": "result"
        },
        {
            "Title": "Central Bank of India: Q4 Profit Rises 28%, Asset Quality Improves",
            "Summary": "Central Bank of India reported a 28% year-on-year increase in Q4 net profit to ₹1,033.6 crore. Net interest income fell 4% to ₹3,399 crore. Gross NPAs decreased to 3.18% from 3.86% in the previous quarter. Return on assets improved to 0.90% from 0.76% year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1745837329000,
            "Source": "earnings"
        },
        {
            "Title": "Central Bank of India: Board to Consider FY26 Fundraising Plan on April 28",
            "Summary": "Central Bank of India's board will meet on April 28 to consider and approve a capital raising plan for FY 2025-26. The plan may include various options such as follow-on public offer, rights issue, or qualified institutional placement. The board will also review FY25 financial results and consider recommending a final dividend.",
            "Sentiment": "neutral",
            "PublishDate": 1745424181000,
            "Source": "corporate_action"
        },
        {
            "Title": "Central Bank of India to Consider Capital Raising Plan",
            "Summary": "Central Bank of India has scheduled a board meeting on April 28 to consider a capital raising plan for the fiscal year 2025-26. The bank will explore various options for raising capital, including Follow-on Public Offer (FPO), Rights Issue, Qualified Institutional Placement (QIP), or Preferential Issue.",
            "Sentiment": "positive",
            "PublishDate": 1745417649000,
            "Source": "default"
        },
        {
            "Title": "Central Bank of India Reports 10.75% Growth in Total Business",
            "Summary": "Central Bank of India has announced provisional figures for its business performance as of March 31. The bank's total business has grown by 10.75% year-over-year, while total deposits have increased by 7.18% compared to the previous year. Notably, the bank has crossed the 7 trillion rupee mark in total business as of March 31.",
            "Sentiment": "positive",
            "PublishDate": 1743639258000,
            "Source": "result"
        },
        {
            "Title": "Central Bank of India: Stock Hits 18-Month Low, Down 52% from Recent Peak",
            "Summary": "Central Bank of India's stock fell 11% to ₹36.86, hitting an 18-month low. The stock is down 52% from its February 2024 peak of ₹77. The decline follows a QIP issue to reduce government shareholding. LIC was the top investor in the QIP. The bank's Q3 FY25 net profit increased by 33.58% to ₹958.93 crore.",
            "Sentiment": "negative",
            "PublishDate": 1743594902000,
            "Source": "corporate_action"
        },
        {
            "Title": "Central Bank of India Reports Business and Deposit Growth",
            "Summary": "Central Bank of India has announced provisional figures showing a 10.75% year-over-year increase in total business as of March 31. Additionally, the bank's total deposits have grown by 7.18% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1743593990000,
            "Source": "result"
        },
        {
            "Title": "Central Bank of India: Launches QIP to Raise Up to Rs 1,500 Crore",
            "Summary": "Central Bank of India opened a qualified institutional placement (QIP) to raise up to Rs 1,500 crore with an option to upsize by Rs 500 crore. The base issue offers over 37 crore shares with a greenshoe option of over 12.3 crore shares. The indicative price is Rs 40.49 per share, a 13.7% discount to the last closing price. Shares will be allotted on April 1 and tradable after April 3.",
            "Sentiment": "positive",
            "PublishDate": 1742869639000,
            "Source": "corporate_action"
        }
    ]
}