{
    "Symbol": "CERA",
    "ISIN": "INE739E01017",
    "News": [
        {
            "Title": "Cera Sanitaryware Q3 Net Profit Drops 48% YoY",
            "Summary": "Cera Sanitaryware reported a standalone net profit of 237 million rupees in Q3, marking a significant 48.37% decline from 459 million rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1770189842958,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cera Sanitaryware Board Meet Set for Feb 4, 2026",
            "Summary": "Cera Sanitaryware Limited has scheduled its board meeting for February 4, 2026, to review and approve Q3 FY26 unaudited financial results. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769065566445,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cera Sanitaryware Down 30% from Highs, Eyes Recovery",
            "Summary": "Cera Sanitaryware trades near support levels after 30% decline from peaks. Technical analysts suggest potential bounce-back opportunity for medium-term traders targeting ₹7,400.00 over 6-8 months.",
            "Sentiment": "neutral",
            "PublishDate": 1766750302915,
            "Source": "stocks"
        },
        {
            "Title": "Cera Sanitaryware Sees Rs. 19.39 Crore Block Trade on NSE",
            "Summary": "Cera Sanitaryware Ltd witnessed a block trade worth Rs. 19.39 crores involving approximately 35,017 shares at Rs. 5,537.50 per share on the NSE. The transaction represents a significant institutional or bulk investor activity in the sanitaryware company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1764312734564,
            "Source": "order&deals"
        },
        {
            "Title": "Cera Sanitaryware Reports Flat Q2 Revenue at ₹488 Crore, Exits Two LLPs for Strategic Focus",
            "Summary": "Cera Sanitaryware's quarterly revenue remained flat at ₹488 crore with EBITDA margins declining to 13.8% from 14.2%, while the company completed divestment of two LLPs for ₹18.75 crore consideration. The sanitaryware segment grew 1.4% and project sales contributed 39% to topline, with management projecting 7-8% full-year growth despite retail demand remaining subdued.",
            "Sentiment": "neutral",
            "PublishDate": 1763383523586,
            "Source": "earnings"
        },
        {
            "Title": "Cera Sanitaryware Guides for 7-8% Full Year Growth, Maintains Operating Margin Outlook",
            "Summary": "Cera Sanitaryware management provided updated guidance during a conference call, projecting 10-12% growth for the second half of the year. This translates to full year growth guidance of 7-8%. The company reaffirmed its operating margin guidance of 14.5-15.5%.",
            "Sentiment": "positive",
            "PublishDate": 1762925206738,
            "Source": "stock"
        },
        {
            "Title": "Cera Sanitaryware Expresses Cautious Optimism for Second Half Performance",
            "Summary": "Cera Sanitaryware has indicated cautious optimism regarding its performance expectations for the second half of the year. This outlook was shared during a conference call with stakeholders.",
            "Sentiment": "neutral",
            "PublishDate": 1762924637022,
            "Source": "stock"
        },
        {
            "Title": "Cera Sanitaryware Reports Decline in Q2 Net Profit Despite Flat Revenue",
            "Summary": "Cera Sanitaryware reported Q2 net profit of 566 million rupees, down from 680 million rupees in the same period last year. The company's EBITDA decreased to 671 million rupees from 696 million rupees year-over-year, with EBITDA margin declining to 13.76% from 14.20%. Revenue remained flat at 4.9 billion rupees compared to the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762843815894,
            "Source": "earnings"
        },
        {
            "Title": "Cera Sanitaryware Faces Rs 63.11 Lakh GST Demand from Telangana Tax Authority",
            "Summary": "Cera Sanitaryware Ltd received two demand orders from the Assistant Commissioner in Medchal Jurisdiction, Telangana on September 24, 2025. The first order demands Rs 40.76 lakh (tax of Rs 20.38 lakh plus equal penalty) under sections 74 of CGST Act and corresponding Telangana GST Act. The second order demands Rs 22.34 lakh (tax of Rs 11.35 lakh and penalty of Rs 10.99 lakh) under sections 73 and 74. The authority alleges the company short paid taxes and improperly availed input tax credits blocked under section 17(5). The total demand amounts to Rs 63.11 lakh. Cera Sanitaryware states there is no material impact on its financials or operations, believes the demand is not maintainable, and plans to file an appeal against both orders.",
            "Sentiment": "negative",
            "PublishDate": 1758784086884,
            "Source": "stock"
        },
        {
            "Title": "Cera Sanitaryware Advances Divestment of Race Polymer Arts LLP Subsidiary",
            "Summary": "Cera Sanitaryware Limited provided an update on the divestment of its entire stake in subsidiary Race Polymer Arts LLP. The company reported that negotiations with joint venture partner Shreeyam Ceramic LLP are progressing, with substantial agreement reached on terms and conditions. Cera expects to execute the necessary documents, including the Retirement Deed, by September 30, 2025. This follows the company's earlier communication dated September 2, 2025 regarding the same divestment process.",
            "Sentiment": "positive",
            "PublishDate": 1758118044752,
            "Source": "corporate_action"
        },
        {
            "Title": "Cera Sanitaryware Reports 5.4% Revenue Growth in Q1 FY26, Launches Two New Brands",
            "Summary": "Cera Sanitaryware Limited reported revenue of Rs. 419 crore for Q1 FY26, marking a 5.4% increase from Rs. 398 crore in Q1 FY25. EBITDA remained stable at Rs. 72 crore, though margins declined to 16.4% from 17.5% due to inflation-driven cost increases and expenses related to new brand launches. The Faucetware segment grew 13.4% year-on-year, while Sanitaryware revenues remained flat. The B2B segment contributed 38% of revenues compared to 36% in Q1 FY25, with project business showing 32% growth in order wins. The company launched two new brands: Senator, targeting the luxury segment with 23 channel partners and plans to reach 45-50 stores by FY26 end, and POLIPLUZ, a value brand targeting tier 4 cities and rural markets with expected revenues of Rs. 25-30 crore in the current year. Capacity utilization stood at 92% for Faucetware and 86% for Sanitaryware. The company maintains cash reserves of Rs. 778 crore and has allocated Rs. 23 crore for capex in FY26. Management expects higher single-digit to early double-digit growth for the full year, contingent on market recovery in the second half.",
            "Sentiment": "neutral",
            "PublishDate": 1755100759237,
            "Source": "earnings"
        },
        {
            "Title": "Cera Sanitaryware Seeks Shareholder Approval for Re-appointment of Independent Director Through Postal Ballot",
            "Summary": "Cera Sanitaryware Limited has issued a postal ballot notice seeking shareholder approval for the re-appointment of Mr. Ravi Bhamidipaty as an Independent Director for a second term of three consecutive years from August 4, 2025 to August 3, 2028. The e-voting period runs from August 13 to September 11, 2025, with results to be declared by September 13, 2025. The cut-off date for voting eligibility is August 8, 2025. Mr. Bhamidipaty, who holds qualifications including B.Com, CA, CS, ICWA and CFA, has 39 years of experience in corporate finance, debt syndication, and mergers & acquisitions. He was first appointed as Independent Director on August 4, 2022, and received commission of Rs. 5 lakhs and sitting fees of Rs. 1.60 lakhs in the latest results. The Board has recommended his re-appointment based on his performance evaluation and guidance to management. M/s. Parikh Dave & Associates has been appointed as scrutinizer for the postal ballot process.",
            "Sentiment": "neutral",
            "PublishDate": 1755008284719,
            "Source": "corporate_action"
        },
        {
            "Title": "Cera Sanitaryware Reports Mixed Q1 Results with Revenue Growth but Lower Profitability",
            "Summary": "Cera Sanitaryware announced its Q1 financial results showing revenue growth to Rs 4.2 billion from Rs 4 billion year-over-year. However, the company experienced a decline in profitability with net profit dropping to Rs 466 million from Rs 471 million compared to the same period last year. EBITDA also decreased to Rs 551 million from Rs 581 million year-over-year, while EBITDA margin compressed to 13.1% from 14.5% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1754463558723,
            "Source": "earnings"
        },
        {
            "Title": "Cera Sanitaryware Re-appoints Ravi Bhamidipaty as Independent Director for Second Three-Year Term",
            "Summary": "Cera Sanitaryware Limited's Board of Directors approved the re-appointment of Mr. Ravi Bhamidipaty as an Independent Director for a second term of three consecutive years, effective from August 4, 2025. The decision was made based on the recommendation of the Nomination and Remuneration Committee and is subject to shareholder approval. Mr. Bhamidipaty holds multiple professional qualifications including CA, CS, CFA, and ICWA, and brings 40 years of experience in corporate finance, debt syndication, equity placement, mergers and acquisitions, and governance. He previously served as Chief Financial Officer at companies including Ashima, Sembawang and Adani Port, and currently provides management and financial consultancy services. He also serves as director on three other private limited companies and holds no shares in Cera Sanitaryware.",
            "Sentiment": "positive",
            "PublishDate": 1753428129069,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cera Sanitaryware Launches 'Polipluz' Bathware Line",
            "Summary": "Cera Sanitaryware has introduced a new bathware line called 'Polipluz' for the local market. The line includes bathroom fixtures such as showers and bathtubs.",
            "Sentiment": "positive",
            "PublishDate": 1751475719000,
            "Source": "global"
        },
        {
            "Title": "CERA Sanitaryware Reports Q4 Results and Declares Dividend",
            "Summary": "CERA Sanitaryware announced its Q4 financial results, showing year-over-year improvements. The company reported revenue of 5.8 billion rupees, up from 5.5 billion. EBITDA increased to 1.08 billion rupees from 949 million, with the EBITDA margin improving to 18.63% from 17.3%. Consolidated net profit rose to 856 million rupees from 749 million. Additionally, the company declared a dividend of 65 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1746775871000,
            "Source": "result"
        },
        {
            "Title": "Cera Sanitaryware Ends Partnership with Milo Tile LLP",
            "Summary": "Cera Sanitaryware has terminated its partnership with Milo Tile LLP due to quality issues with the tiles procured from them. As a result, the company will write off 23.8 million rupees from its investment in Milo.",
            "Sentiment": "negative",
            "PublishDate": 1742220762000,
            "Source": "corporate_action"
        },
        {
            "Title": "CERA Sanitaryware Reports Q3 Revenue of 4.5 Billion Rupees",
            "Summary": "CERA Sanitaryware, a company in the sanitary ware industry, has announced its third quarter revenue. The company reported revenue of 4.5 billion rupees, compared to 4.4 billion rupees in the same quarter of the previous year, indicating a slight year-over-year increase.",
            "Sentiment": "neutral",
            "PublishDate": 1739256804000,
            "Source": "earnings"
        },
        {
            "Title": "Cera Sanitaryware Reports Stable Q3 EBITDA with Slight Margin Decline",
            "Summary": "Cera Sanitaryware has reported its Q3 financial results. The company's EBITDA remained relatively stable at 615 million rupees compared to 614 million rupees in the same quarter last year. However, the EBITDA margin saw a slight decrease, dropping to 13.60% from 14.00% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739256796000,
            "Source": "earnings"
        },
        {
            "Title": "Cera Sanitaryware Reports Decrease in Q3 Consolidated Net Profit",
            "Summary": "Cera Sanitaryware, a sanitary ware manufacturer, reported a consolidated net profit of 458 million rupees for the third quarter, down from 509 million rupees in the same period last year. This represents a year-over-year decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1739256714000,
            "Source": "earnings"
        },
        {
            "Title": "CERA Sanitaryware Reports Q2 EBITDA Growth",
            "Summary": "CERA Sanitaryware's Q2 EBITDA increased to 721 million rupees from 704 million rupees year-over-year. However, the EBITDA margin decreased to 14.64% from 16.41% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731395893000,
            "Source": "result"
        },
        {
            "Title": "Cera Sanitaryware Reports Q2 Revenue Growth",
            "Summary": "Cera Sanitaryware, a company in the sanitary ware industry, has reported its second quarter revenue for the current fiscal year. The company's revenue for Q2 stands at 4.9 billion rupees, compared to 4.63 billion rupees in the same quarter of the previous year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731395862000,
            "Source": "result"
        },
        {
            "Title": "CERA Sanitaryware Reports 19.5% Increase in Q2 Net Profit",
            "Summary": "CERA Sanitaryware, a leading sanitaryware company, has announced its Q2 consolidated net profit of 680 million rupees, compared to 569 million rupees in the same quarter last year. This represents a year-over-year increase of approximately 19.5%.",
            "Sentiment": "positive",
            "PublishDate": 1731395843000,
            "Source": "result"
        }
    ]
}