{
    "Symbol": "CESC",
    "ISIN": "INE486A01021",
    "News": [
        {
            "Title": "CESC Reports 11.5% Growth in Q3 Net Profit",
            "Summary": "CESC Limited posted consolidated net profit of ₹2.9 billion in Q3, marking an 11.5% year-on-year increase from ₹2.6 billion in the corresponding quarter of previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770365360797,
            "Source": "co_actions_results"
        },
        {
            "Title": "CESC Limited Announces Investor Conference Schedule",
            "Summary": "CESC Limited will participate in three major investor conferences in Mumbai from February 9-12, 2026, including events by Systematix, Nuvama, and Axis Capital.",
            "Sentiment": "neutral",
            "PublishDate": 1770042514591,
            "Source": "stocks"
        },
        {
            "Title": "CESC Board Meeting Set for February 6 to Review Q3 Results",
            "Summary": "CESC Limited has scheduled a board meeting on February 6, 2026, to consider and approve unaudited financial results for Q3 and nine months ended December 31, 2025, under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769772959465,
            "Source": "co_actions_results"
        },
        {
            "Title": "CESC Unit Signs ₹3,800 Cr Solar Plant MoU with UP",
            "Summary": "CESC subsidiary enters agreement with Uttar Pradesh government for establishing 3 GW solar cell manufacturing plant with investment of approximately ₹3,800 crores.",
            "Sentiment": "positive",
            "PublishDate": 1769041211632,
            "Source": "stocks"
        },
        {
            "Title": "CESC Green Power Signs ₹4,500 Cr Odisha MoU",
            "Summary": "CESC Green Power enters major partnership with Odisha government for 3 GW solar manufacturing facility, 5 GWh battery pack production, and 60 MW captive power plant with ₹4,500 crore investment.",
            "Sentiment": "positive",
            "PublishDate": 1768795241834,
            "Source": "stocks"
        },
        {
            "Title": "CESC Independent Director Sunil Mitra Passes Away",
            "Summary": "CESC Limited announces the sad demise of Independent Director Mr. Sunil Mitra on January 12, 2026. The company highlighted his valuable contributions and expressed condolences to his family.",
            "Sentiment": "negative",
            "PublishDate": 1768231082704,
            "Source": "stocks"
        },
        {
            "Title": "CESC Head of Power Sector Kush Singh Resigns",
            "Summary": "CESC Limited announces resignation of Mr. Kush Singh as Head of Power Sector effective January 1, 2026, due to personal reasons. Singh submitted formal resignation requesting release on December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767358109719,
            "Source": "stocks"
        },
        {
            "Title": "CESC unit wins 180 MW renewable energy project",
            "Summary": "Purvah Green Power, CESC's subsidiary, secures 25-year contract for round-the-clock renewable power supply through competitive bidding process from REMC Limited.",
            "Sentiment": "positive",
            "PublishDate": 1766589618133,
            "Source": "co_actions_results"
        },
        {
            "Title": "CESC's Purvah Green Power Wins 180 MW Renewable Project",
            "Summary": "Purvah Green Power, subsidiary of CESC Ltd, secures award letter for 180 MW renewable energy project with 25-year contract at ₹4.35 per kWh tariff, expected to contribute ₹117 crores to core revenue.",
            "Sentiment": "positive",
            "PublishDate": 1766569291618,
            "Source": "stocks"
        },
        {
            "Title": "CESC Unit Issues LOI for 250 MW Wind Farm Project",
            "Summary": "CESC's subsidiary has issued a binding letter of intent to Klasscorp Solutions for consultancy services related to a 250 MW wind farm development project in Karnataka.",
            "Sentiment": "positive",
            "PublishDate": 1766362602069,
            "Source": "stocks"
        },
        {
            "Title": "CESC Unit Signs Wind Farm Consultancy Deal",
            "Summary": "CESC's subsidiary Purvah Green Power issued binding letter of intent to Klasscorp Solutions for consultancy services on 250 MW wind farm project in Karnataka's Bijapur CTU location.",
            "Sentiment": "positive",
            "PublishDate": 1766148298285,
            "Source": "stocks"
        },
        {
            "Title": "CESC Receives Tax Order Worth ₹9.28 Crores for FY22",
            "Summary": "CESC Limited received a tax determination order from West Bengal government for ₹9.28 crores under CGST/WBGST Act for FY 2021-22. Company plans to file appeal against the order.",
            "Sentiment": "negative",
            "PublishDate": 1765893758506,
            "Source": "stocks"
        },
        {
            "Title": "CESC Subsidiary Wins ₹300MW Wind Tower Contract",
            "Summary": "Deshraj Solar Energy, CESC's subsidiary, secured tower supply contract with Toolfab Renewable Energy for 91 wind turbine towers supporting 300MW wind project in Andhra Pradesh villages.",
            "Sentiment": "positive",
            "PublishDate": 1765881424163,
            "Source": "co_actions_results"
        },
        {
            "Title": "CESC Plans ₹1,000 Crore Infrastructure Investment and Targets 10 GW Renewable Energy Capacity",
            "Summary": "CESC announced a ₹1,000 crore investment plan over the next 5 years for network enhancement, operational reliability improvements, and metering upgrades. The company aims to achieve 3.2 GW of renewable energy capacity by FY29 and expand to 10 GW by FY32 as part of its phased growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1764414313087,
            "Source": "stock"
        },
        {
            "Title": "CESC Green Power Gets Approval for Rs. 4,500 Crore Solar Manufacturing Facility in Odisha",
            "Summary": "CESC Green Power Limited, a subsidiary of CESC Limited, received in-principle approval from Odisha's High-Level Clearance Authority to establish a manufacturing facility for 3GW solar cells, 3GW solar modules, 5GWh battery cell packs, and advanced solar components with 60MW AC captive power plant in Dhenkanal district. The project involves an investment of around Rs. 4,500 crores to be executed in three phases.",
            "Sentiment": "positive",
            "PublishDate": 1763061044897,
            "Source": "stock"
        },
        {
            "Title": "CESC Subsidiary Purvah Green Power Wins 300 MW Solar Project Contract from SECI",
            "Summary": "Purvah Green Power Private Limited, a subsidiary of CESC Limited, has received and accepted a Letter of Award from Solar Energy Corporation of India Limited (SECI) for setting up a solar power project with energy storage systems. The project involves 300 MW contracted capacity under a tariff-based competitive bidding process. The contract spans 25 years from the scheduled commencement of supply date, with a tariff rate of Rs 2.86 per kWh. This award is part of SECI's larger initiative for 2000 MW ISTS-connected Solar PV Power Projects with 1000 MW/4000 MWh Energy Storage Systems across India. The contract is with a domestic entity and does not involve any related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1761654430993,
            "Source": "order&deals"
        },
        {
            "Title": "CESC Limited Reports Strong Q2 Performance with 11% Profit Growth and Declares Rs 6 Interim Dividend",
            "Summary": "CESC Limited's Board approved unaudited financial results for Q2 and H1 ended September 30, 2025. The company reported standalone net profit of Rs 242 crore for Q2, up from Rs 218 crore in the same period last year. Revenue from operations stood at Rs 2,676 crore for the quarter. On a consolidated basis, the company posted net profit of Rs 445 crore for Q2 compared to Rs 373 crore in the previous year. The Board declared an interim dividend of Rs 6 per equity share for eligible shareholders with October 27, 2025 as the record date. The company's earnings per share increased to Rs 1.83 for Q2 from Rs 1.65 in the corresponding quarter last year. CESC operates primarily in electricity generation and distribution and has 41 subsidiaries and 1 joint venture.",
            "Sentiment": "positive",
            "PublishDate": 1760701964983,
            "Source": "corporate_action"
        },
        {
            "Title": "CESC Board Approves ₹300 Crore Private Placement of Secured Redeemable NCDs",
            "Summary": "CESC's board has approved a private placement worth ₹300 crore for secured redeemable non-convertible debentures (NCDs). This decision represents a debt fundraising initiative by the company through private placement of secured debt instruments.",
            "Sentiment": "positive",
            "PublishDate": 1758690463061,
            "Source": "corporate_action"
        },
        {
            "Title": "CESC Limited to Consider Proposal for Non-Convertible Debentures Issue",
            "Summary": "CESC Limited announced that its Board Committee will consider a proposal to issue Redeemable, Senior, Secured, Unlisted, Rated Non-Convertible Debentures at a meeting scheduled for September 24, 2025. The company notified stock exchanges BSE and NSE about this debt securities proposal through a communication dated September 19, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758283750131,
            "Source": "corporate_action"
        },
        {
            "Title": "CESC Ltd Plans Solar Cell/Module Plant With Up to ₹5,000 Crores Investment",
            "Summary": "CESC Ltd announced plans to build a solar cell/module manufacturing plant with an investment of up to ₹5,000 crores. The company's subsidiary, CESC Green Power Ltd, will receive financial aid to execute the project.",
            "Sentiment": "positive",
            "PublishDate": 1758260524756,
            "Source": "stock"
        },
        {
            "Title": "CESC Limited Releases Participant List for September 8, 2025 Investors Conference",
            "Summary": "CESC Limited has disclosed the list of 90 investors who will participate in the RP-Sanjiv Goenka Group Investor Day scheduled for September 8, 2025. The event will be held in physical mode and includes major financial institutions such as HDFC Asset Management, ICICI Prudential, Kotak Mahindra Asset Management, Morgan Stanley Investment Management, UBS Securities, and various mutual funds, insurance companies, and investment advisors. The company noted that changes to the participant list may occur due to exigencies from either the company or investors.",
            "Sentiment": "neutral",
            "PublishDate": 1757042932928,
            "Source": "stock"
        },
        {
            "Title": "CESC Reports Higher Q1 Net Profit and Revenue with Slight EBITDA Margin Decline",
            "Summary": "CESC reported consolidated net profit of 3.87 billion rupees in Q1, up from 3.78 billion rupees in the same period last year. Revenue increased to 52.02 billion rupees from 48.6 billion rupees year-over-year. EBITDA rose to 10.92 billion rupees from 10.6 billion rupees, though EBITDA margin decreased to 20.99% from 21.8% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753873113440,
            "Source": "earnings"
        },
        {
            "Title": "CESC's Purvadhar Green Power Secures 1 GW Wind Turbine Supply Contract",
            "Summary": "Purvadhar Green Power, a company associated with CESC, has finalized a contract for the supply of 1 GW of wind turbines. This agreement marks a significant development in the renewable energy sector, potentially boosting CESC's green energy portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1749048258000,
            "Source": "default"
        },
        {
            "Title": "CESC Ltd: Q4 Profit Dips, Revenue Rises 15%, EBITDA Surges",
            "Summary": "CESC Ltd reported Q4 FY24 results with net profit down 7.2% YoY to ₹385 crore, while revenue increased 14.5% to ₹3,877 crore. EBITDA nearly doubled to ₹812 crore, and operating margins expanded to 20.94%. Post-earnings, shares were trading 1.73% lower at ₹164.90 on BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1747301401000,
            "Source": "earnings"
        },
        {
            "Title": "CESC Reports Mixed Q4 Financial Results",
            "Summary": "CESC, an Indian power utility company, has reported its Q4 financial results. The company's EBITDA increased significantly to 8.12 billion rupees from 4.10 billion rupees year-over-year, with the EBITDA margin improving to 20.94% from 12.11%. Revenue also saw growth, rising to 38.8 billion rupees from 33.87 billion rupees in the same period last year. However, consolidated net profit slightly decreased to 3.7 billion rupees from 4 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747296170000,
            "Source": "result"
        },
        {
            "Title": "CESC to Consider Q4 Results on May 15",
            "Summary": "CESC Limited has announced that it will consider its fourth quarter financial results on May 15. This is a standard corporate procedure where the company's board will review and potentially approve the financial statements for the last quarter of their fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1746539181000,
            "Source": "default"
        },
        {
            "Title": "CESC Signs 25-Year Power Purchase Agreement for 300 MW Hybrid Project",
            "Summary": "CESC has entered into a Power Purchase Agreement (PPA) with its subsidiary, Bhojraj Renewables Energy Pvt Ltd, for a 300 MW wind-solar hybrid power project. The agreement is set for a 25-year period with a tariff of Rs. 3.81 per kWh.",
            "Sentiment": "positive",
            "PublishDate": 1745885345000,
            "Source": "default"
        },
        {
            "Title": "CESC Signs 25-Year Power Purchase Agreement for Hybrid Project",
            "Summary": "CESC has entered into a Power Purchase Agreement (PPA) with its unit Bhojraj Renewables Energy Pvt Ltd for a 300 MW wind-solar hybrid power project. The agreement is set for a duration of 25 years at a tariff of Rs. 3.81 per kWh.",
            "Sentiment": "positive",
            "PublishDate": 1745851114000,
            "Source": "default"
        },
        {
            "Title": "CESC Ltd: Board Approves Rs 250 Crore NCD Allotment to Axis Bank",
            "Summary": "CESC Ltd's board has approved the allotment of 25,000 secured, unlisted, redeemable, rated non-convertible debentures (NCDs) worth Rs 250 crore to Axis Bank on a private placement basis. The NCDs have a face value of Rs 1 lakh each, with an allotment date of April 11, 2025, and maturity on April 11, 2030. The coupon rate is set at 2.67%, with a call/put option after three years.",
            "Sentiment": "neutral",
            "PublishDate": 1744372161000,
            "Source": "corporate_action"
        },
        {
            "Title": "CESC Board Meeting to Consider Non-Convertible Debentures Issue",
            "Summary": "CESC Limited has announced a board meeting scheduled for April 7 to consider a proposal for issuing non-convertible debentures. This meeting suggests the company may be exploring debt-based financing options.",
            "Sentiment": "neutral",
            "PublishDate": 1743601415000,
            "Source": "corporate_action"
        },
        {
            "Title": "CESC Subsidiary Enters 3-Year Power Purchase Agreement for 25MW Supply",
            "Summary": "A subsidiary of CESC Limited has entered into a power purchase agreement to supply 25 megawatts of electricity for a period of three years. This agreement represents a significant business development for the company, potentially providing a stable revenue stream over the contract duration.",
            "Sentiment": "positive",
            "PublishDate": 1743081365000,
            "Source": "corporate_action"
        },
        {
            "Title": "CESC Acquires Chandigarh Power Distribution for ₹871 Crore",
            "Summary": "CESC has acquired a 100% stake in Chandigarh Power Distribution for ₹871 crore. This acquisition is part of CESC's strategy to expand its electricity retail business.",
            "Sentiment": "positive",
            "PublishDate": 1738380595000,
            "Source": "corporate_action"
        },
        {
            "Title": "CESC Reports Q3 Revenue Increase",
            "Summary": "CESC, an Indian power utility company, has reported its third-quarter revenue for the current fiscal year. The company's revenue stood at 36 billion rupees, compared to 32.4 billion rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1736498447000,
            "Source": "earnings"
        },
        {
            "Title": "CESC Reports Decline in Q3 Consolidated Net Profit",
            "Summary": "CESC, an Indian power utility company, has reported a decrease in its consolidated net profit for the third quarter. The company's net profit stood at 2.65 billion rupees, down from 2.8 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1736498407000,
            "Source": "earnings"
        },
        {
            "Title": "CESC Awards Wind-Solar Hybrid Power Project to Subsidiary",
            "Summary": "CESC has issued a Letter of Award to its subsidiary, Purvah Green Power, for the development of a 150 MW wind-solar hybrid power project. The project includes an additional 150 MW capacity under a greenshoe option, potentially doubling the total capacity to 300 MW.",
            "Sentiment": "positive",
            "PublishDate": 1736257271000,
            "Source": "corporate_action"
        },
        {
            "Title": "CESC to Consider Q3 Results and Interim Dividend on January 10",
            "Summary": "CESC Limited has announced that its board of directors will meet on January 10 to consider and approve the company's financial results for the third quarter of the current fiscal year. Additionally, the board will deliberate on the declaration of an interim dividend for the shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1735568979000,
            "Source": "corporate_action"
        },
        {
            "Title": "CESC Subsidiary Awarded 300 MW Wind-Solar Hybrid Power Supply Contract",
            "Summary": "CESC's subsidiary, Noida Power Company Ltd (NPCL), has awarded a contract to another CESC subsidiary, Purvah Green Power Pvt Ltd, for the supply of 300 MW of wind-solar hybrid power.",
            "Sentiment": "positive",
            "PublishDate": 1735568974000,
            "Source": "corporate_action"
        },
        {
            "Title": "CESC Unit to Acquire Chandigarh Electricity Distribution Company",
            "Summary": "A unit of CESC has received a letter of intent to purchase 100% shares of the electricity distribution company in Chandigarh. The acquisition deal is valued at 8.71 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1732282878000,
            "Source": "corporate_action"
        },
        {
            "Title": "CESC Targets 3,200 MW Hybrid Renewable Capacity by 2029",
            "Summary": "CESC has announced its plan to fully commission 3,200 MW of hybrid renewable energy capacity by March 2029. This ambitious target demonstrates the company's commitment to expanding its presence in the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1732271830000,
            "Source": "corporate_action"
        },
        {
            "Title": "CESC: Q2 Profit Rises 3% to Rs 373 Crore on Higher Income",
            "Summary": "CESC Ltd reported a 3% increase in consolidated net profit to Rs 373 crore for Q2 FY2025. Total income rose to Rs 4,770 crore from Rs 4,414 crore year-over-year. Expenses increased to Rs 4,427 crore from Rs 4,314 crore in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731416932000,
            "Source": "result"
        },
        {
            "Title": "CESC Reports Strong Q2 Financial Performance",
            "Summary": "CESC, an Indian power utility company, has reported significant year-over-year improvements in its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased from 6.4 billion rupees to 8.9 billion rupees. Additionally, CESC's EBITDA margin expanded from 14.84% to 19.06%, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1731397692000,
            "Source": "result"
        },
        {
            "Title": "CESC Reports Q2 Revenue Growth",
            "Summary": "CESC, an Indian power utility company, has reported its second quarter revenue for the current fiscal year. The company's revenue increased to 47 billion rupees, up from 43.5 billion rupees in the same quarter of the previous year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731397671000,
            "Source": "result"
        },
        {
            "Title": "CESC Reports Slight Increase in Q2 Consolidated Net Profit",
            "Summary": "CESC, an Indian power utility company, has reported a consolidated net profit of 3.53 billion rupees for the second quarter, compared to 3.5 billion rupees in the same period last year. This represents a marginal year-over-year increase in profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1731397644000,
            "Source": "result"
        },
        {
            "Title": "CESC Incorporates Wholly Owned Subsidiary in Renewable Power Sector",
            "Summary": "CESC has incorporated a new wholly owned subsidiary named Mazzi Power Projects. The new entity will operate in the renewable power sector.",
            "Sentiment": "positive",
            "PublishDate": 1729785738000,
            "Source": "corporate_action"
        },
        {
            "Title": "CESC Acquires Deshraj Solar Energy",
            "Summary": "<p>CESC has entered into a <span class='positive'>share purchase agreement</span> to <span class='positive'>acquire 100%</span> of the share capital of <b>Deshraj Solar Energy</b>, a company in the <span class='positive'>renewable energy</span> sector.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728914511000,
            "Source": "corporate_action"
        },
        {
            "Title": "CESC Unit Purvah Green Power Signs Binding Term Sheet with Bhojraj Renewables Energy",
            "Summary": "<p>CESC's subsidiary, <span class='neutral'>Purvah Green Power</span>, has entered into a <span class='positive'>binding term sheet</span> with <span class='neutral'>Bhojraj Renewables Energy</span>. The deal is valued at <b>1.09 billion rupees</b> (approximately $13.1 million USD). This agreement suggests a <span class='positive'>significant move</span> in the <span class='positive'>renewable energy sector</span>, potentially involving <span class='neutral'>asset acquisition</span> or a <span class='neutral'>strategic partnership</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727983326000,
            "Source": "corporate_action"
        }
    ]
}