{
    "Symbol": "CEWATER",
    "ISIN": "INE037Z01029",
    "News": [
        {
            "Title": "Concord Enviro Q3 FY26 Results Call on Feb 13",
            "Summary": "Concord Enviro Systems announces earnings conference call on February 13, 2026 at 09:00 AM IST to discuss Q3 & 9M FY26 results following board meeting on February 12, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770634119762,
            "Source": "co_actions_results"
        },
        {
            "Title": "Concord Enviro Acquires 8% Stake in NALA Membranes",
            "Summary": "Concord Enviro Systems invests US$ 19.99 lakhs in NALA Membranes Inc., acquiring 8% stake through convertible preference shares to strengthen membrane technology capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1769190942524,
            "Source": "co_actions_results"
        },
        {
            "Title": "Concord Enviro CFO Sudarshan Kamath to Retire Jan 2026",
            "Summary": "Concord Enviro Systems announces retirement of Chief Financial Officer Mr. Sudarshan Kamath effective January 02, 2026, marking end of his tenure as Key Managerial Personnel.",
            "Sentiment": "neutral",
            "PublishDate": 1766755183331,
            "Source": "stocks"
        },
        {
            "Title": "Concord Enviro clarifies recent price movement",
            "Summary": "Concord Enviro Systems attributes recent share price movement to market conditions, stating no undisclosed price-sensitive information exists under regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1765905246825,
            "Source": "stocks"
        },
        {
            "Title": "Concord Enviro Systems Reports 23% Revenue Decline in Q2 FY26, Revises Growth Guidance Downward",
            "Summary": "Concord Enviro Systems' Q2 FY26 revenue fell to INR 1,248.45 million from INR 1,618.94 million year-on-year, primarily due to delays in African project approvals and absence of large Mexico project billing from previous year. The company revised its FY26 revenue growth guidance from 18-20% to 12-15% and EBITDA guidance down by 1%, while maintaining order book at INR 5,354 million with CBG projects expected to commence in Q3.",
            "Sentiment": "negative",
            "PublishDate": 1763102444659,
            "Source": "earnings"
        },
        {
            "Title": "Concord Enviro Systems Reports No Material Deviation in IPO Fund Utilization for September Quarter",
            "Summary": "Concord Enviro Systems Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing no material deviation from the objects of its Initial Public Offering. The company raised INR 175 crore through its IPO in December 2024, with actual net proceeds of INR 162.076 crore. Out of the total proceeds, INR 91.629 crore has been utilized, leaving INR 83.371 crore unutilized. The company has deployed INR 50 crore for repayment of borrowings by subsidiary Concord Enviro FZE, INR 5 crore for working capital requirements, and INR 4.773 crore for technology and growth initiatives. Unutilized funds totaling INR 85.585 crore are invested in fixed deposits with ICICI Bank at interest rates ranging from 4.50% to 7.25%. ICRA Limited, the monitoring agency, confirmed that fund utilization is in line with the stated objectives and all projects are on schedule.",
            "Sentiment": "neutral",
            "PublishDate": 1762851418308,
            "Source": "corporate_action"
        },
        {
            "Title": "Concord Enviro Systems Reports ₹5,354 Million Order Book With ₹27,000 Million Pipeline, Plans India's First CO₂ Capture Unit",
            "Summary": "Concord Enviro Systems has announced an order book of ₹5,354 Million with a pipeline worth ₹27,000 Million. The company is targeting aggressive growth and expects strong execution momentum in FY26 despite temporary global delays. The company is scaling operations in high-margin green sectors including carbon capture, green hydrogen, and semiconductor effluent solutions. Concord plans to commission India's first 7.5TPD CO₂ capture unit in FY26. The company is expanding its proprietary ZLD and membrane technologies, having been granted 9 patents. Concord is targeting margin recovery through R&D-led innovation, renewable integration, and export expansion.",
            "Sentiment": "positive",
            "PublishDate": 1762531771783,
            "Source": "stock"
        },
        {
            "Title": "Concord Enviro Systems Reports Sharp Decline in Q2 Financial Performance",
            "Summary": "Concord Enviro Systems reported significantly lower quarterly results with EBITDA falling to 77 million rupees from 264 million rupees year-over-year. The company's EBITDA margin compressed to 6.16% compared to 16.29% in the same period last year. Consolidated net profit declined to 45 million rupees from 173 million rupees year-over-year. Revenue also decreased to 1.25 billion rupees from 1.62 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762528857915,
            "Source": "earnings"
        },
        {
            "Title": "Rochem Separation Systems Acquires Full Ownership of Pathak Utility Pvt. Ltd.",
            "Summary": "Rochem Separation Systems, a subsidiary of Concord Enviro Systems, has acquired complete ownership of Pathak Utility Pvt. Ltd. (PUPL). Following this acquisition, PUPL has become a step-down subsidiary in the Concord Enviro Systems corporate structure.",
            "Sentiment": "neutral",
            "PublishDate": 1759160463192,
            "Source": "order&deals"
        },
        {
            "Title": "Concord Enviro Systems Reports Mixed Q1 Performance with 18-20% Growth Guidance for FY26",
            "Summary": "Concord Enviro Systems Limited reported revenue of INR 1,024 million for Q1 FY26, similar to the previous year's Q1. EBITDA increased to INR 107 million from INR 15 million, including gains on peso exposure and IPO cost recoveries. Adjusted EBITDA stood at INR 27.5 million. The company turned profitable with PAT of INR 51 million compared to a loss of INR 26 million in Q1 FY25. The order book stands at INR 5,366 crores as of June 30, 2025, with 59% relating to zero liquid discharge projects, 15% to compressed biogas orders, and 26% to operation and maintenance contracts. Management maintains revenue growth guidance of 18-20% for FY26, expecting H2 to be delivery-heavy. The company is pursuing quotes worth approximately INR 2,500 crores with a 25% conversion rate expectation. Recent order wins include INR 800 million from a listed customer for O&M services and INR 150 million from an automobile client. The company successfully commissioned its first Mexico project in July 2025 and is expanding into new sectors including solar, semiconductors, and carbon capture technologies.",
            "Sentiment": "positive",
            "PublishDate": 1755106779617,
            "Source": "earnings"
        },
        {
            "Title": "Concord Enviro Systems Holds Investor Conference Call to Discuss Quarterly Results",
            "Summary": "Concord Enviro Systems Limited conducted a conference call with investors on August 11, 2025, to discuss the company's financial results for the quarter ended June 30, 2025. The company has made the audio recording of the call available on its website at https://www.concordenviro.in/investors.php. The environmental systems company, listed on NSE (CEWATER) and BSE (544315), filed this disclosure under SEBI's Listing Obligations and Disclosure Requirements Regulations. Director Prerak Goel signed the regulatory filing from Mumbai.",
            "Sentiment": "neutral",
            "PublishDate": 1754922299676,
            "Source": "earnings"
        },
        {
            "Title": "Concord Enviro Systems Reports Strong Q1 Performance with Multiple Strategic Appointments and Financial Restructuring",
            "Summary": "Concord Enviro Systems Limited announced its unaudited financial results for the quarter ended June 30, 2025, showing standalone revenue from operations of Rs. 112.18 million and profit after tax of Rs. 39.52 million. On a consolidated basis, the company reported revenue from operations of Rs. 1,023.92 million and net profit of Rs. 41.19 million. The company's board approved several key appointments including Ms. Jyoti Nikunj Chawda as Company Secretary and Compliance Officer effective August 11, 2025, M/s. Sahajwani & Associates LLP as Internal Auditors for FY 2025-26, and M/s. Martinho Ferrao & Associates as Secretarial Auditors for five years subject to shareholder approval. The board also approved a Scheme of Arrangement to adjust negative retained earnings against the Securities Premium Account, which requires regulatory approvals including from NCLT. Additionally, the company approved capital infusion of up to Rs. 400 million in its wholly owned subsidiary Concord Enviro (FZE) and amendments to its Employee Stock Option Plan 2022. The company reported no deviation in the utilization of IPO proceeds, with Rs. 771.20 million utilized and Rs. 849.56 million remaining unutilized as of June 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754664822069,
            "Source": "earnings"
        },
        {
            "Title": "Concord Enviro Systems Subsidiary Acquires Pathak Utility for INR 1.01 Crore",
            "Summary": "Rochem Separation Systems (India) Private Limited, a wholly owned subsidiary of Concord Enviro Systems Limited, has agreed to acquire 100% equity share capital of Pathak Utility Private Limited for INR 1.01 crore. The acquisition involves 10,10,000 equity shares of INR 10 each through a cash transaction. Pathak Utility operates in water and wastewater management, specifically engaged in operation, maintenance and rehabilitation of water treatment plants. The company was incorporated on 27th February 2024 and reported a turnover of Rs 12.31 crore with a net profit of Rs 2.04 lakh for the year ending March 2025. Post-acquisition, Pathak Utility will become a step-down subsidiary of Concord Enviro Systems. The acquisition aims to strengthen and expand presence in the water treatment sector, particularly the third-party operations and maintenance business. The transaction is expected to complete within 3 months and does not require governmental or regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1754571140009,
            "Source": "order&deals"
        },
        {
            "Title": "Concord Enviro Systems Schedules Q1 FY26 Results Conference Call for August 11",
            "Summary": "Concord Enviro Systems Limited will announce its Q1 FY26 financial results on August 8, 2025, following a board meeting. The company has scheduled a conference call on August 11, 2025, at 09:00 AM IST to discuss these quarterly results. The management team participating in the call includes Chairman & Managing Director Prayas Goel, Executive Director Prerak Goel, Group CFO Anish Goel, CFO Sudarshan Kamath, and Head of Strategy and M&A Abhijit Ghalke. Concord Enviro Systems is a Mumbai-headquartered global provider of water and wastewater treatment solutions, specializing in zero-liquid discharge technology and serving industries including pharmaceuticals, chemicals, food and beverage, defense, automotive, steel, and textiles.",
            "Sentiment": "neutral",
            "PublishDate": 1754484523599,
            "Source": "earnings"
        },
        {
            "Title": "Concord Enviro Systems Reports Strong Q2 Financial Results",
            "Summary": "Concord Enviro Systems has announced its Q2 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 173 million rupees from 124 million rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 1.62 billion rupees compared to 973.5 million rupees in the previous year's Q2.",
            "Sentiment": "positive",
            "PublishDate": 1737333549000,
            "Source": "earnings"
        },
        {
            "Title": "Concord Enviro Systems Reports Mixed Q2 Financial Results",
            "Summary": "Concord Enviro Systems has reported its Q2 financial results. The company's EBITDA increased to 263.7 million rupees, up from 230 million rupees in the same quarter last year. However, the EBITDA margin decreased to 16.29% from 23.62% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1737128691000,
            "Source": "earnings"
        },
        {
            "Title": "Concord Enviro Systems Reports Significant Revenue Growth in Q2",
            "Summary": "Concord Enviro Systems has announced its Q2 revenue, which stands at 1.62 billion rupees. This represents a substantial increase from the previous year's Q2 revenue of 973.5 million rupees, indicating strong year-over-year growth for the company.",
            "Sentiment": "positive",
            "PublishDate": 1737128683000,
            "Source": "earnings"
        },
        {
            "Title": "Concord Enviro Systems Reports 39.5% Increase in Q2 Consolidated Net Profit",
            "Summary": "Concord Enviro Systems has reported a consolidated net profit of 173 million rupees for the second quarter, compared to 124 million rupees in the same period last year. This represents a significant year-over-year increase of 39.5% in the company's net profit.",
            "Sentiment": "positive",
            "PublishDate": 1737128675000,
            "Source": "earnings"
        },
        {
            "Title": "Concord Enviro to Invest 550 Million Rupees in Concord FZE",
            "Summary": "Concord Enviro Systems Limited has announced plans to inject additional capital into its subsidiary, Concord FZE. The company will invest 550 million rupees (approximately $6.6 million USD) to strengthen Concord FZE's operations and financial position.",
            "Sentiment": "positive",
            "PublishDate": 1736749346000,
            "Source": "corporate_action"
        },
        {
            "Title": "Concord Enviro Systems to Consider Q3 Results on January 17",
            "Summary": "Concord Enviro Systems has announced that it will consider its financial results for the third quarter on January 17.",
            "Sentiment": "neutral",
            "PublishDate": 1736516254000,
            "Source": "result"
        },
        {
            "Title": "Concord Enviro Systems Ltd: Strong Market Debut with 17.83% Premium",
            "Summary": "Concord Enviro Systems Ltd listed at Rs 826.00 on NSE, a 17.83% premium over its IPO price. The stock opened at Rs 807.55 on BSE, a 15.20% premium. The IPO was oversubscribed 4.34 times, raising Rs 500.3 crore. The company provides water and wastewater treatment solutions globally.",
            "Sentiment": "positive",
            "PublishDate": 1735278440000,
            "Source": "result"
        },
        {
            "Title": "Concord Enviro Systems: Shares List at 19% Premium on BSE",
            "Summary": "Concord Enviro Systems shares debuted on the BSE at ₹832, an 18.69% premium over the issue price of ₹701. On NSE, shares listed at ₹826, a 17.83% premium. The IPO, which closed on December 23, was oversubscribed 10.67 times. The company raised ₹500 crore, with plans to use fresh funds for subsidiary investments, capital expenditure, and expansion.",
            "Sentiment": "positive",
            "PublishDate": 1735274050000,
            "Source": "normal_news"
        },
        {
            "Title": "Concord Enviro Systems: Shares List at 18% Premium on Market Debut",
            "Summary": "Concord Enviro Systems Ltd. shares listed at ₹826, an 18% premium to their IPO price of ₹701. The company's ₹500-crore IPO included a fresh issue of ₹175 crore and an OFS of ₹325.33 crore. Proceeds will be used for expansion, debt payment, and working capital requirements.",
            "Sentiment": "positive",
            "PublishDate": 1735273812000,
            "Source": "corporate_action"
        }
    ]
}