{
    "Symbol": "CGCL",
    "ISIN": "INE180C01042",
    "News": [
        {
            "Title": "Capri Global Capital Withdraws Postal Ballot Notice",
            "Summary": "Capri Global Capital Limited has withdrawn its postal ballot notice dated January 13, 2026, for the re-appointment of Independent Director Mr. Desh Raj Dogra, citing governance considerations.",
            "Sentiment": "neutral",
            "PublishDate": 1770814027357,
            "Source": "stocks"
        },
        {
            "Title": "Capri Global Capital Launches New Brand Campaign",
            "Summary": "Capri Global Capital announces 'Zaroorat Mein Aapke Saath' campaign featuring Pankaj Tripathi, positioning itself as a dependable financial partner during urgent needs across TV and digital platforms.",
            "Sentiment": "positive",
            "PublishDate": 1770642171797,
            "Source": "stocks"
        },
        {
            "Title": "Capri Global Capital Q3FY26 Profit Surges 99% YoY",
            "Summary": "Capri Global Capital delivered highest ever quarterly profit of ₹255 crores in Q3FY26, up 99% YoY. AUM grew 47% YoY to ₹30,406 crores with strong performance across all lending segments.",
            "Sentiment": "positive",
            "PublishDate": 1770400195633,
            "Source": "co_actions_results"
        },
        {
            "Title": "Capri Global Capital Strengthens ESG Profile",
            "Summary": "Capri Global Capital achieves significant ESG improvements with S&P Global score of 71 (43% YoY growth) and 'Low Risk' ratings from multiple agencies, reinforcing sustainability commitment across lending portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1770274210284,
            "Source": "stocks"
        },
        {
            "Title": "Capri Global Capital's Independent Director Steps Down",
            "Summary": "Capri Global Capital Limited announces cessation of Independent Director Mr. Desh Raj Dogra effective January 31, 2026, upon completion of his five-year term as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1769863907871,
            "Source": "stocks"
        },
        {
            "Title": "Capri Global Capital Q3FY26 Results Show Strong Growth",
            "Summary": "Capri Global Capital reported consolidated net profit of ₹2,554.39 million for Q3FY26, up 99.4% YoY. Revenue from operations grew 48.7% to ₹12,203.13 million. Board approved USD 1 billion GMTN programme and ₹200 crore investment in subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1769705879600,
            "Source": "co_actions_results"
        },
        {
            "Title": "Capri Global Allots Rs 100 Cr NCDs Series 16",
            "Summary": "Capri Global Capital Limited successfully allots 10,000 NCDs worth Rs 100 crore under Series 16 through private placement, offering 9% annual interest with 24-month tenure.",
            "Sentiment": "positive",
            "PublishDate": 1769615487414,
            "Source": "co_actions_results"
        },
        {
            "Title": "Capri Global Capital clarifies volume surge to BSE",
            "Summary": "Capri Global Capital responds to BSE surveillance query on trading volume increase, confirming no pending price sensitive information and full regulatory compliance under SEBI Listing Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768990101066,
            "Source": "stocks"
        },
        {
            "Title": "Capri Global CEO Monu Ratra Steps Down, Targets Gold Loan Growth",
            "Summary": "Capri Global Capital CEO Monu Ratra resigned effective January 19, 2026, to pursue entrepreneurial ventures. Company targets ₹20 crore gold loan asset base per branch in FY27 and expects profit of ₹900 crore in current FY.",
            "Sentiment": "neutral",
            "PublishDate": 1768819749990,
            "Source": "stocks"
        },
        {
            "Title": "Capri Global Seeks Shareholder Approval for Director",
            "Summary": "Capri Global Capital initiates postal ballot for re-appointment of Independent Director Desh Raj Dogra for second three-year term through remote e-voting from January 17 to February 15, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768564267278,
            "Source": "stocks"
        },
        {
            "Title": "Capri Global Gets Low ESG Risk Rating from Sustainalytics",
            "Summary": "Capri Global Capital Limited receives ESG Risk Rating of 19.7 from Morningstar Sustainalytics, categorized as Low Risk. Company filed regulatory intimation on January 16, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768560118738,
            "Source": "stocks"
        },
        {
            "Title": "Capri Global Gets Credit Rating Limit Enhanced to ₹1500 Cr",
            "Summary": "Capri Global Capital Limited receives enhanced Commercial Paper credit rating limit from ₹700 crores to ₹1500 crores with Crisil A1+ rating reaffirmed by CRISIL Ratings Limited.",
            "Sentiment": "positive",
            "PublishDate": 1767974935812,
            "Source": "stocks"
        },
        {
            "Title": "Capri Global Capital Sees 4.57M Share Block Trade",
            "Summary": "Capri Global Capital witnessed significant block trading activity with 4.57 million shares changing hands across two separate block trades at ₹185 per share, indicating substantial institutional interest.",
            "Sentiment": "neutral",
            "PublishDate": 1767780504900,
            "Source": "co_actions_results"
        },
        {
            "Title": "Capri Global Capital Board Approves Key Appointments",
            "Summary": "Capri Global Capital's board approves re-appointment of Independent Director Desh Raj Dogra for 3-year term from February 1, 2026, and appoints Zoheb Sheikh as Head of Internal Audit effective December 17, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765891162693,
            "Source": "stocks"
        },
        {
            "Title": "Capri Global Capital Incorporates Wholly Owned Subsidiary for Insurance Broking Business",
            "Summary": "Capri Global Capital Limited has incorporated a wholly owned subsidiary, Capri Global Insurance Brokers Private Limited, with an authorized capital of Rs. 75 lakh and received the Certificate of Incorporation on December 2, 2025. The subsidiary will operate in the insurance broking industry, providing advisory, consultancy and intermediation services across life, general, health, motor, marine and specialty insurance segments.",
            "Sentiment": "positive",
            "PublishDate": 1764669899342,
            "Source": "corporate_action"
        },
        {
            "Title": "Capri Global Capital Allots Rs. 20 Crore Non-Convertible Debentures",
            "Summary": "Capri Global Capital Limited allotted 2,000 secured, rated, redeemable non-convertible debentures of Rs. 1,00,000 each through private placement on December 1, 2025. The debentures carry an interest rate of 8.90% per annum with an 18-month tenure, maturing on June 1, 2027, and are secured by a first ranking pari passu floating charge over hypothecated assets.",
            "Sentiment": "neutral",
            "PublishDate": 1764593509212,
            "Source": "corporate_action"
        },
        {
            "Title": "Capri Global Capital Receives ESG Score of 71 from S&P Global",
            "Summary": "Capri Global Capital Limited received an ESG score of 71 from S&P Global, reflecting enhanced transparency and improved performance across environmental, social and governance areas with very high disclosure rates. The assessment noted significant improvement in disclosure-based scoring with strong performance in human rights, financial inclusion, risk management and business ethics, strengthening the company's positioning in sustainable finance.",
            "Sentiment": "positive",
            "PublishDate": 1764076513606,
            "Source": "stock"
        },
        {
            "Title": "Capri Global Capital Allots Rs 50 Crore Non-Convertible Debentures Under Series 14",
            "Summary": "Capri Global Capital Limited allotted 5,000 secured, rated, redeemable non-convertible debentures of Rs 1,00,000 each through private placement, raising Rs 50 crore on November 24, 2025. The debentures carry a 9.25% annual coupon rate with monthly interest payments, mature on May 24, 2028, and are secured by first ranking pari passu floating charge over hypothecated assets.",
            "Sentiment": "neutral",
            "PublishDate": 1763992938569,
            "Source": "corporate_action"
        },
        {
            "Title": "Capri Global Forms New Wholly Owned Subsidiary for Insurance Broking Business",
            "Summary": "Capri Global has initiated the formation of a new wholly owned subsidiary named 'Capri Global Insurance Brokers Pvt Ltd' to enter the insurance broking business. This strategic move represents the company's expansion into the insurance sector through a dedicated subsidiary structure.",
            "Sentiment": "positive",
            "PublishDate": 1763597010005,
            "Source": "corporate_action"
        },
        {
            "Title": "Capri Global Capital Allots 5.18 Lakh Equity Shares Under ESOP Scheme",
            "Summary": "Capri Global Capital Limited allotted 5,18,840 equity shares of Rs. 1 each following the exercise of employee stock options under its ESOP 2009 scheme. The Management Committee approved the allotment on November 6, 2025. The company's paid-up share capital increased from Rs. 96,16,35,122 to Rs. 96,21,53,962, consisting of 96,21,53,962 equity shares with a face value of Rs. 1 each. The exercise prices for the shares ranged from Rs. 0.50 to Rs. 62.50 per share. The newly allotted shares will rank equally with existing equity shares and the company is completing formalities for listing these shares. Capri Global Capital is listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1762455319498,
            "Source": "corporate_action"
        },
        {
            "Title": "Capri Global Capital Targets 50% AUM Growth by FY27 After Raising ₹20 Billion",
            "Summary": "Capri Global Capital plans to achieve 50% AUM growth by FY27 through expansion in MSME, affordable housing, and gold loans. The company recently raised ₹20 billion via QIP to fund this scaling initiative. The growth strategy is powered by in-house AI-driven credit and collection platforms. The company expects 30-40% year-on-year disbursement growth and double-digit ROE, leveraging its presence in tier-2 and tier-3 markets along with co-lending partnerships.",
            "Sentiment": "positive",
            "PublishDate": 1762438386041,
            "Source": "stock"
        },
        {
            "Title": "Capri Global Capital Reports 143% Jump in Q2 FY26 Profit, AUM Grows 40% to ₹27,040 Crores",
            "Summary": "Capri Global Capital Limited announced its quarterly results with profit after tax surging 143% year-on-year to ₹236 crores. The company's consolidated assets under management reached ₹27,040 crores, reflecting 40% year-on-year growth and 9% quarter-on-quarter growth. Gold loan AUM crossed ₹10,000 crores milestone, growing 58% year-on-year to ₹10,406 crores. Housing AUM stood at ₹5,972 crores with 37% year-on-year growth, while MSME AUM grew 18% to ₹5,602 crores. The company successfully completed its maiden public issuance of secured rated listed redeemable non-convertible debentures for ₹400 crores, which was oversubscribed across all investor categories. Net interest income increased 57% year-on-year to ₹480 crores. The company added 86 branches during the quarter, expanding its network to 1,224 locations. Co-lending AUM surged 61% year-on-year to ₹5,677 crores, accounting for 21% of total AUM. Return on average equity improved to 14.4% and return on average assets reached 4%. The company appointed Monu Ratra as CEO and projects AUM of ₹32,000 crores for FY26 and ₹42,000 crores for FY27.",
            "Sentiment": "positive",
            "PublishDate": 1762430673814,
            "Source": "earnings"
        },
        {
            "Title": "Capri Global Capital Receives Strong ESG Rating of 64 from ESGRisk.ai",
            "Summary": "Capri Global Capital Limited received an ESG score of 64 from ESG Risk Assessments and Insights Limited (ESGRisk.ai), placing the company in the Strong category. The rating agency recognized the company's strong performance in auditor independence, minority shareholder rights, financial transparency, anti-bribery anti-corruption practices, and board committee governance. According to ESGRisk.ai's criteria, a Strong rating indicates an ESG leader with demonstrated ability to effectively manage material ESG risks through a comprehensive and robust risk management framework.",
            "Sentiment": "positive",
            "PublishDate": 1762205855595,
            "Source": "corporate_governance"
        },
        {
            "Title": "Capri Global Targets ₹50,000 Crore AUM by FY28 with 40% Growth Projection for FY25",
            "Summary": "Capri Global Capital projects 40% AUM growth in FY25 and aims to reach ₹50,000 crore assets under management by FY28. Managing Director Rajesh Sharma attributes growth to adding 86 branches in the latest quarter, technology improvements, and strong demand across lending segments. The company maintains ROA around 4% and ROE in 16-18% range while targeting cost-to-income ratio reduction from current 49% to 40% within 12-18 months. Fee-based income from insurance, co-lending, and car loans contributes 29% of total income. The loan portfolio is 100% secured, with 38% backed by gold loans and remainder in MSME and affordable housing loans secured by property. Capri Global operates under RBI's 75% loan-to-value cap for gold loans and uses automated SMS alerts for LTV breaches to manage risk.",
            "Sentiment": "positive",
            "PublishDate": 1762141870109,
            "Source": "stock"
        },
        {
            "Title": "Capri Global Capital Projects AUM Growth to ₹32,000 Crores and PAT of ₹850 Crores by FY26",
            "Summary": "Capri Global Capital expects its Assets Under Management (AUM) to reach ₹32,000 crores by the end of the current financial year. The company also projects its Profit After Tax (PAT) to reach ₹850 crores by FY26. These projections were shared during a conference call.",
            "Sentiment": "positive",
            "PublishDate": 1761989120207,
            "Source": "stock"
        },
        {
            "Title": "Capri Global Capital Receives ESG Rating of 64 from Crisil ESG Ratings",
            "Summary": "Capri Global Capital Limited received an ESG rating of 64 for FY2025 from Crisil ESG Ratings & Analytics Ltd. The rating breakdown shows Environmental Pillar Score of 56/100, Social Pillar Score of 59/100, and Governance Pillar Score of 73/100. The company did not engage Crisil ESG Ratings for this assessment, as the rating was independently prepared using publicly available data. Crisil ESG Ratings is a SEBI-registered Category 1 ESG rating provider. The detailed ESG summary report is available on the company's website and Crisil ESG's website.",
            "Sentiment": "neutral",
            "PublishDate": 1761924308764,
            "Source": "stock"
        },
        {
            "Title": "Capri Global Capital Sets Ambitious Growth Targets for FY28",
            "Summary": "Capri Global Capital's Co-Managing Director announced the company's strategic goals to achieve Rs 50,000 crores in Assets Under Management (AUM) by FY28. The company also targets a Return on Average Equity (ROAE) of 16-18% and Return on Average Assets (ROAA) of 4.0%-4.5% during the same period.",
            "Sentiment": "positive",
            "PublishDate": 1761795606285,
            "Source": "stock"
        },
        {
            "Title": "Capri Global Capital Reports Strong Q2 Growth with Net Profit Rising 143% Year-on-Year",
            "Summary": "Capri Global Capital reported consolidated net profit of 2.36 billion rupees for Q2, compared to 970 million rupees in the same quarter last year. The company's revenue increased to 11.21 billion rupees from 7.52 billion rupees year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1761748920599,
            "Source": "earnings"
        },
        {
            "Title": "Capri Global Capital's ₹4,000 Million NCD Issue Oversubscribed",
            "Summary": "Capri Global Capital Limited announced its public issue of secured, rated, listed, redeemable non-convertible debentures has been oversubscribed. The issue opened on September 30, 2025, and closed on October 7, 2025, receiving strong response from institutional investors, non-institutional investors, high-net worth individuals and retail investors. The NCD issue had a base size of ₹2,000 million with an option to retain oversubscription up to ₹2,000 million, aggregating up to ₹4,000 million. The NCDs offer a coupon rate of up to 9.70% per annum with face value of ₹1,000 each and were listed on BSE Limited on October 15, 2025. At least 75% of the funds will be used for onward lending, financing, and repayment of existing borrowings, while the balance will be utilized for general corporate purposes. Trust Investment Advisors Private Limited served as the Lead Manager. Capri Global Capital is a systemically important NBFC with an AUM of ₹247,528.31 million, serving 0.56 million customers through 11,546 employees and 1,138 branches as of June 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760520670715,
            "Source": "corporate_action"
        },
        {
            "Title": "Capri Global Capital Plans $733 Million Fundraise Through Bonds and Loans",
            "Summary": "Capri Global Capital plans to raise 65 billion rupees ($732.9 million) through bonds and loans in the financial year. The non-banking financial company has already raised 18 billion rupees from April to September and aims to raise 47 billion rupees in the second half of the fiscal year. The proceeds will fund loan book expansion and opening 200 new branches. The company will raise around 4 billion rupees through a public bond issue opening next week, with maturities ranging from 18 months to 10 years. The bonds carry 'AA' ratings from Infomerics and Acuite Ratings, with Trust Investment Advisors as lead manager. Capri Global plans to raise 10-15 billion rupees through bonds over the next six months and may consider another public issue based on market response.",
            "Sentiment": "positive",
            "PublishDate": 1758718650665,
            "Source": "stock"
        },
        {
            "Title": "Capri Global Capital Approves ₹4,000 Million Non-Convertible Debentures Public Issue",
            "Summary": "Capri Global Capital Limited has approved a public issuance of secured, rated, listed, redeemable non-convertible debentures worth up to ₹4,000 million. The issue comprises a base size of ₹2,000 million with a green shoe option of ₹2,000 million. Each debenture has a face value of ₹1,000. The issue will open on September 30, 2025, and close on October 14, 2025. The NCDs offer six series with tenors ranging from 18 months to 120 months, with coupon rates between 8.55% to 9.70% per annum. The debentures have received credit ratings of 'ACUITE AA | Stable' from Acuite Ratings and 'IVR AA/ Positive' from Infomerics Valuation. The NCDs will be listed on BSE Limited and are secured by a first pari-passu charge on the company's standard receivables, loan book, and unencumbered cash and bank balances. The minimum application amount is ₹10,000 across all series.",
            "Sentiment": "positive",
            "PublishDate": 1758570438092,
            "Source": "corporate_action"
        },
        {
            "Title": "Capri Global Capital Approves Draft Prospectus for ₹400 Crore Non-Convertible Debentures Issue",
            "Summary": "Capri Global Capital Limited's Management Committee approved a draft prospectus for issuing non-convertible debentures worth ₹400 crore with a face value of ₹1,000 each. This issuance is part of a larger ₹1,000 crore debt issuance plan previously approved by the Board of Directors on June 30, 2025. The draft prospectus dated September 18, 2025, has been filed with BSE Limited and forwarded to SEBI. The company has made the document accessible on its website at capriloans.in.",
            "Sentiment": "neutral",
            "PublishDate": 1758219641506,
            "Source": "corporate_action"
        },
        {
            "Title": "Capri Global Capital Launches Special Gold Loan Offer to Mark Third Anniversary",
            "Summary": "Capri Global Capital Limited announced a three-day special customer offer for its Gold Loan business from August 25-27, 2025, to celebrate the third anniversary of this division. The offer features Gold Loans starting at 92 paise per month per Rs. 100, targeting new customer acquisition during the festive season beginning with Ganesh Chaturthi. The company operates over 825 active branches across 10 states and Union Territories, with Gold Loan assets under management exceeding Rs. 9,500 crores and having served over 9 lakh customers. Additional benefits include auto-pay facility, flexible payment options, and 100% insurance cover on pledged gold. Chief Business Officer Ravish Gupta stated the offer celebrates customer trust and the company's commitment to transparent, flexible, and affordable financial solutions.",
            "Sentiment": "positive",
            "PublishDate": 1755944345048,
            "Source": "stock"
        },
        {
            "Title": "Capri Global Capital Reports Strong Q1 FY26 Results with 42% AUM Growth and INR2,000 Crore QIP Fundraise",
            "Summary": "Capri Global Capital Limited announced its quarterly results with consolidated AUM reaching INR24,754 crores, marking 42% year-on-year growth. The company successfully completed a Qualified Institutions Placement raising INR2,000 crores in primary equity capital. Net interest income grew 38% to INR416 crores, while profit after tax surged 131% to INR175 crores. The gold loan business showed strong momentum with 69% growth to INR9,105 crores AUM. Cost-to-income ratio improved significantly to 46% from 65% in the previous year. Credit costs increased to INR81 crores due to higher ECL provisions and some slippages in MSME segment. Gross Stage 3 asset ratio stood at 1.7% with net Stage 3 ratio at 1%. The company maintains guidance for 30% AUM growth and expects ROAE of 13.5-14% for the year. Management plans to add 200-250 branches and expand into Southern India markets including Tamil Nadu, Andhra, Karnataka and Odisha.",
            "Sentiment": "positive",
            "PublishDate": 1754905140119,
            "Source": "earnings"
        },
        {
            "Title": "Capri Global Capital Posts Rs 175 Crore Net Profit Amid Rising Bad Loan Provisions",
            "Summary": "NBFC Capri Global Capital reported a net profit of Rs 175 crore, more than doubling year-on-year but declining 2% from the previous quarter. The quarterly decline was attributed to increased provisions for bad loans. Loan impairment costs surged four times to Rs 815 crore from Rs 185 crore in the previous quarter. The company's non-performing assets also deteriorated, with loans overdue for more than 90 days rising to 1.7% of the loan book from 1.5% previously.",
            "Sentiment": "neutral",
            "PublishDate": 1754354474129,
            "Source": "earnings"
        },
        {
            "Title": "Capri Global Capital Reports Strong Q1FY26 Results with 42% YoY AUM Growth and 131% PAT Increase",
            "Summary": "Capri Global Capital Limited reported robust quarterly results with Assets Under Management (AUM) growing 42% year-over-year to ₹247,538 million. Net Interest Income increased 38% YoY to ₹4,156 million, while Profit After Tax surged 131% YoY to ₹1,749 million. The company's Cost-Income ratio improved significantly to 46.5% from 64.6% in the previous year. Operating profit jumped 115% YoY to ₹3,115 million. The company maintains healthy asset quality with Net NPA at 1.0% and adequate capital adequacy ratios. Capri Global operates across multiple segments including MSME loans, gold loans, housing finance, and construction finance, with a diversified geographical presence through 1,138 branches. The company has set ambitious targets of ₹500 billion AUM by FY28 and ₹1,000+ billion by FY33, aiming for 25-30% CAGR growth.",
            "Sentiment": "positive",
            "PublishDate": 1754239781215,
            "Source": "earnings"
        },
        {
            "Title": "Capri Global Capital Reports Proper Utilization of Rs 19,489 Million QIP Proceeds",
            "Summary": "Capri Global Capital Limited submitted a monitoring agency report for the quarter ended June 30, 2025, detailing the utilization of proceeds from their Qualified Institutions Placement (QIP) of equity shares. The QIP, conducted from June 9-12, 2025, raised Rs 20,000 million with net proceeds of Rs 19,489 million. CRISIL Ratings Limited, the appointed monitoring agency, confirmed that funds were used according to objectives stated in the placement document. The company utilized Rs 13,189 million during the quarter - Rs 9,657 million for expanding business operations by augmenting capital base and Rs 3,533 million for repayment of outstanding borrowings. Unutilized proceeds of Rs 6,300 million were deployed in fixed deposits, mutual funds, and bank accounts. The report shows no deviations from stated objectives and confirms compliance with regulatory requirements.",
            "Sentiment": "positive",
            "PublishDate": 1754048975423,
            "Source": "corporate_action"
        },
        {
            "Title": "Capri Global Capital Appoints Kishore Lodha as CFO, Replacing Partha Chakroborthi",
            "Summary": "Capri Global Capital Limited announced a change in its Chief Financial Officer position effective August 1, 2025. Partha Chakroborthi resigned from his CFO role to take up the CFO position at Capri Global Housing Finance Limited, a wholly owned subsidiary of the company. The Board of Directors approved the appointment of Kishore Lodha as the new CFO based on recommendations from the Nomination and Remuneration Committee and Audit Committee. Lodha brings 23 years of experience in fund raising, financial modeling, accounting, taxation, and regulatory compliances, with particular expertise in the NBFC sector including MSME loans, vehicle financing, and housing finance. Both the resignation and appointment took effect simultaneously to ensure continuity in the CFO position.",
            "Sentiment": "neutral",
            "PublishDate": 1754039922689,
            "Source": "corporate_governance"
        },
        {
            "Title": "Capri Global Capital Approves Q1 FY26 Results, Appoints Joint Auditors and New CFO",
            "Summary": "Capri Global Capital Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The statutory auditors issued an unmodified opinion in their Limited Review Report. The Board approved the appointment of M/s Singhi & Co. as Joint Statutory Auditors, subject to shareholder approval at the Annual General Meeting. Mr. Partha Chakroborthi resigned as CFO effective August 1, 2025, and Mr. Kishore Lodha was appointed as the new CFO on the same date. The company reported no deviations in the utilization of funds raised through non-convertible debentures totaling Rs. 220 crore across multiple issuances. The Board meeting was held on August 1, 2025, from 11:00 AM to 2:00 PM.",
            "Sentiment": "neutral",
            "PublishDate": 1754038331644,
            "Source": "earnings"
        },
        {
            "Title": "Capri Global Capital Reports Strong Q1 Growth with Net Profit Surging 131%",
            "Summary": "Capri Global Capital delivered strong quarterly results with consolidated net profit rising to 1.75 billion rupees from 757 million rupees in the same period last year, representing a 131% increase. The company's revenue also grew significantly to 10 billion rupees compared to 7.2 billion rupees in the previous year, marking a 39% year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1754037576806,
            "Source": "earnings"
        },
        {
            "Title": "Capri Global Capital Creates New Subsidiary for Wealth Management",
            "Summary": "Capri Global Capital has established a new subsidiary named Capri Global Wealth Management Pvt Ltd. The news indicates an expansion into the wealth management sector, potentially diversifying the company's financial services offerings.",
            "Sentiment": "positive",
            "PublishDate": 1752586859000,
            "Source": "default"
        },
        {
            "Title": "Capri Global Capital Forms New Subsidiary",
            "Summary": "Capri Global Capital has established a new subsidiary named Capri Global Financial Services Pvt Ltd. This corporate action expands the company's organizational structure, potentially indicating plans for growth or diversification in financial services.",
            "Sentiment": "neutral",
            "PublishDate": 1751985483000,
            "Source": "default"
        },
        {
            "Title": "Capri Global Board Approves NCDs Issuance Up to 1 Billion Rupees",
            "Summary": "The Board of Directors of Capri Global has approved the issuance of Non-Convertible Debentures (NCDs) up to a value of 1 billion rupees. This decision represents a significant financial move for the company, potentially aimed at raising capital or refinancing existing debt.",
            "Sentiment": "positive",
            "PublishDate": 1751983722000,
            "Source": "default"
        },
        {
            "Title": "Capri Global Capital Approves NCD Issuance for Fund Raising",
            "Summary": "Capri Global Capital has approved fund raising through the issuance of Non-Convertible Debentures (NCDs) worth up to 10 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1751328380000,
            "Source": "default"
        },
        {
            "Title": "Capri Global Approved to Establish Two New Subsidiaries",
            "Summary": "Capri Global has received approval to set up two new fully owned subsidiaries: Capri Global Financial Services Pvt Ltd and Capri Global Wealth Management Pvt Ltd. These new entities are expected to expand the company's operations in financial services and wealth management sectors.",
            "Sentiment": "positive",
            "PublishDate": 1751288984000,
            "Source": "default"
        },
        {
            "Title": "Capri Global Capital Approves NCD Issuance Up To 10 Billion Rupees",
            "Summary": "Capri Global Capital has approved raising funds through the issuance of Non-Convertible Debentures (NCDs) for an amount up to 10 billion rupees. This decision represents a significant financial move for the company, potentially aimed at expanding its capital base or funding new initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1751284406000,
            "Source": "default"
        },
        {
            "Title": "Capri Global Capital to Consider Re-approval of NCD Issuance",
            "Summary": "Capri Global Capital's board is set to meet to consider and re-approve the issuance of Non-Convertible Debentures (NCDs) up to 10 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1750636722000,
            "Source": "default"
        },
        {
            "Title": "Capri Global Capital to Discuss NCD Issuance of Up to 10 Billion Rupees",
            "Summary": "Capri Global Capital has announced that its Board of Directors will hold a meeting to discuss and potentially approve the issuance of Non-Convertible Debentures (NCDs) worth up to 10 billion rupees. This decision indicates the company is considering raising funds through debt instruments.",
            "Sentiment": "neutral",
            "PublishDate": 1750421445000,
            "Source": "default"
        },
        {
            "Title": "Capri Global Capital: Successful Rs 2,000 Crore QIP Attracts Notable Investors",
            "Summary": "Capri Global Capital completed a Rs 2,000 crore Qualified Institutions Placement (QIP), with investments from Prashant Jain's 3P Investment Managers (Rs 150 crore) and Madhusudan Kela's MKVentures Capital. The QIP issued 136.5 million equity shares to Qualified Institutional Buyers, attracting both foreign and domestic institutional investors.",
            "Sentiment": "positive",
            "PublishDate": 1750062148000,
            "Source": "corporate_action"
        },
        {
            "Title": "Capri Global Capital Raises ₹2,000 Crores Through QIP",
            "Summary": "Capri Global Capital has successfully secured ₹2,000 crores through a Qualified Institutions Placement (QIP). The company has not provided additional details about the use of funds or the terms of the placement in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1749973943000,
            "Source": "default"
        }
    ]
}