{
    "Symbol": "CGPOWER",
    "ISIN": "INE067A01029",
    "News": [
        {
            "Title": "CG Power Allots 10,000 Shares Under ESOP 2021",
            "Summary": "CG Power and Industrial Solutions allotted 10,000 equity shares to eligible employee under ESOP 2021 at exercise price of Rs. 156.20 per share, increasing paid-up capital to Rs. 3,14,98,05,218.",
            "Sentiment": "neutral",
            "PublishDate": 1770407107999,
            "Source": "co_actions_results"
        },
        {
            "Title": "CG Power Unit Wins ₹433 Crore Railway Safety Contract",
            "Summary": "G.G. Tronics India, subsidiary of CG Power, secures major Kavach train collision avoidance system contract from Chittaranjan Locomotive Works with 11-year maintenance support.",
            "Sentiment": "positive",
            "PublishDate": 1769769042475,
            "Source": "co_actions_results"
        },
        {
            "Title": "CG Power Gets Stay on Rs 33.02 Crore Tax Demand",
            "Summary": "CG Power and Industrial Solutions receives stay order from Income Tax Department on Rs 33.02 crore tax demand for AY 2020-21, required to pay 20% in six instalments while appeal is pending before ITAT.",
            "Sentiment": "positive",
            "PublishDate": 1769698810452,
            "Source": "stocks"
        },
        {
            "Title": "CG Power Gets Stay on Rs 365.37 Cr Tax Demand",
            "Summary": "CG Power and Industrial Solutions receives stay order on tax demand of Rs 365.37 crore for AY 2018-19, required to pay 20% in instalments while appeal is pending before ITAT.",
            "Sentiment": "positive",
            "PublishDate": 1769697903549,
            "Source": "stocks"
        },
        {
            "Title": "CG Power Gets Updated Stay Order on Tax Demand",
            "Summary": "CG Power receives revised stay order requiring additional payment of Rs. 28.13 crores in 3 instalments for remaining tax demand of Rs. 467.76 crores from Assessment Year 2021-22.",
            "Sentiment": "neutral",
            "PublishDate": 1769697641843,
            "Source": "stocks"
        },
        {
            "Title": "CG Power Nears EV Motor Approval, Trials in 4-5 Weeks",
            "Summary": "CG Power approaches final approvals for EV motor and controller with passenger trials starting in 4-5 weeks. Brownfield switchgear expansion nears completion, expected to add INR 400 crores revenue.",
            "Sentiment": "positive",
            "PublishDate": 1769571220972,
            "Source": "stocks"
        },
        {
            "Title": "CG Power Export Orders Jump Over 50% in 9 Months",
            "Summary": "CG Power & Industrial Solutions reports more than 50% growth in export order pipeline for power sector over the last nine months, indicating strong international demand.",
            "Sentiment": "positive",
            "PublishDate": 1769571189002,
            "Source": "co_actions_results"
        },
        {
            "Title": "CG Power Accelerates Transformer Capacity Expansion",
            "Summary": "CG Power plans to boost transformer capacity from 40,000 MVA to 65,000 MVA, with additional 10,000-20,000 MVA from new facility in 2-3 quarters.",
            "Sentiment": "positive",
            "PublishDate": 1769571102452,
            "Source": "stocks"
        },
        {
            "Title": "CG Power OSAT Plants: M1 Sales in 2 Quarters",
            "Summary": "CG Power's OSAT Mini Plant M1 to start sales in two quarters with strong performance expected. Larger M2 plant operational by December 2026, beginning Q4 operations next financial year.",
            "Sentiment": "positive",
            "PublishDate": 1769571078862,
            "Source": "stocks"
        },
        {
            "Title": "CG Power Forecasts Growth Till 2029",
            "Summary": "CG Power anticipates sustained growth in power transmission sector until 2029, driven by government infrastructure and power generation initiatives across the country.",
            "Sentiment": "positive",
            "PublishDate": 1769571051929,
            "Source": "stocks"
        },
        {
            "Title": "CG Power declares Rs 1.30 interim dividend for FY26",
            "Summary": "CG Power and Industrial Solutions announced 65% interim dividend for FY 2025-26 with record date February 1, alongside Q3 FY26 financial results at board meeting on January 27.",
            "Sentiment": "positive",
            "PublishDate": 1769514041917,
            "Source": "co_actions_results"
        },
        {
            "Title": "CG Power Files Q3 QIP Fund Utilisation Report",
            "Summary": "CG Power and Industrial Solutions confirms no deviation in utilisation of Rs. 3,000 crores QIP funds for Q3 FY26, with Rs. 274.37 crores utilised so far across semiconductor and transformer projects.",
            "Sentiment": "neutral",
            "PublishDate": 1769512018576,
            "Source": "stocks"
        },
        {
            "Title": "CG Power shares decline 1.88% amid volume surge",
            "Summary": "CG Power and Industrial Solutions shares fell 1.88% to Rs 538.80 in Tuesday's trading session, accompanied by increased trading volumes. The company has shown consistent revenue growth from Rs 2,963.95 crore in 2021 to Rs 9,908.66 crore in 2025.",
            "Sentiment": "negative",
            "PublishDate": 1769508431452,
            "Source": "stocks"
        },
        {
            "Title": "CG Power Q3 Net Profit Rises 18.75% to ₹2.85 Billion",
            "Summary": "CG Power & Industrial Solutions reported consolidated net profit of ₹2.85 billion in Q3, marking an 18.75% year-on-year increase from ₹2.40 billion in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1769505704823,
            "Source": "co_actions_results"
        },
        {
            "Title": "CG Power Allots 15,000 Shares Under ESOP 2021",
            "Summary": "CG Power and Industrial Solutions allotted 15,000 equity shares at ₹156.20 per share under ESOP 2021, increasing paid-up capital to ₹314.98 crores with 15.75 crore total shares outstanding.",
            "Sentiment": "neutral",
            "PublishDate": 1769065943328,
            "Source": "co_actions_results"
        },
        {
            "Title": "CG Power Schedules Q3FY26 Earnings Call on Jan 27",
            "Summary": "CG Power and Industrial Solutions announces earnings conference call for Q3FY26 results discussion on January 27, 2026, featuring comprehensive management participation across all business segments.",
            "Sentiment": "neutral",
            "PublishDate": 1768846194081,
            "Source": "co_actions_results"
        },
        {
            "Title": "CG Power Board to Consider Interim Dividend on Jan 27",
            "Summary": "CG Power and Industrial Solutions has scheduled a board meeting for January 27, 2026, to consider declaring an interim dividend for FY 2025-26. Trading window remains closed until January 29, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768845478120,
            "Source": "co_actions_results"
        },
        {
            "Title": "CG Power Secures ₹900 Cr US Data Center Order",
            "Summary": "CG Power & Industrial Solutions wins major ₹900 crore order from Tallgrass, marking strategic entry into the rapidly expanding US data center market segment.",
            "Sentiment": "positive",
            "PublishDate": 1768796230864,
            "Source": "co_actions_results"
        },
        {
            "Title": "CG Power Board Meet on Jan 27 for Q3FY26 Results",
            "Summary": "CG Power and Industrial Solutions has scheduled its board meeting for January 27, 2026, to consider and approve Q3FY26 unaudited financial results for standalone and consolidated basis.",
            "Sentiment": "neutral",
            "PublishDate": 1767868337445,
            "Source": "co_actions_results"
        },
        {
            "Title": "CG Power Records ₹17.04 Cr NSE Block Trade",
            "Summary": "CG Power and Industrial Solutions executed a significant block trade on NSE worth ₹17.04 crores involving 265,609 shares at ₹641.50 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767845651904,
            "Source": "co_actions_results"
        },
        {
            "Title": "CG Power Announces Senior Management Changes",
            "Summary": "CG Power and Industrial Solutions announces resignation of VP-Railways Chidambaram Balakrishnan and appointment of Dhananjay Bapat as new VP-Railway Business effective January 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767337407157,
            "Source": "stocks"
        },
        {
            "Title": "CG Power in Apple iPhone Component Talks",
            "Summary": "CG Power & Industrial Solutions is reportedly in preliminary discussions with Apple for assembling and packaging iPhone components in India, marking potential entry into Apple's supply chain.",
            "Sentiment": "positive",
            "PublishDate": 1765942271177,
            "Source": "stocks"
        },
        {
            "Title": "CG Power Receives Warning Letters from NSE and BSE for Delayed Disclosure in Promoter Reclassification",
            "Summary": "CG Power and Industrial Solutions Limited received warning letters from NSE and BSE on December 5, 2025, for delayed compliance with disclosure requirements during their promoter reclassification application process. The company was 3 days late in disclosing the submission of their reclassification application, violating the 24-hour disclosure requirement under SEBI regulations, though the exchanges approved the reclassification with the warning.",
            "Sentiment": "negative",
            "PublishDate": 1764948532308,
            "Source": "corporate_governance"
        },
        {
            "Title": "CG Power Receives Stock Exchange Approval for Promoter Group Reclassification",
            "Summary": "NSE and BSE have granted no-objection for the reclassification of Coromandel Engineering Company Limited and Yanmar Coromandel Agrisolutions Private Limited from CG Power's promoter group category. The reclassification was approved on December 5, 2025, following CG Power's application dated November 2, 2025, effectively removing these entities from the promoter group structure.",
            "Sentiment": "neutral",
            "PublishDate": 1764948264661,
            "Source": "corporate_action"
        },
        {
            "Title": "CG Power Allots 10,000 Equity Shares Under Employee Stock Option Plan",
            "Summary": "CG Power and Industrial Solutions Limited allotted 10,000 equity shares of Rs. 2 each at an exercise price of Rs. 156.20 per share to eligible employees under ESOP 2021. The company's paid-up equity share capital increased from Rs. 3,14,96,15,218 to Rs. 3,14,96,35,218, comprising 1,57,48,17,609 equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764749483622,
            "Source": "corporate_action"
        },
        {
            "Title": "CG Power Allots 15,000 Equity Shares Under Employee Stock Option Plan",
            "Summary": "CG Power and Industrial Solutions Limited allotted 15,000 equity shares of Rs. 2 each at an exercise price of Rs. 156.20 per share to eligible employees under ESOP 2021. The company's paid-up equity share capital increased from Rs. 3,14,95,85,218 to Rs. 3,14,96,15,218, comprising 1,57,48,07,609 equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764319592801,
            "Source": "corporate_action"
        },
        {
            "Title": "CG Power Sees Rs. 79.69 Crore Block Trade on NSE",
            "Summary": "CG Power and Industrial Solutions executed a block trade worth Rs. 79.69 crores involving approximately 1,170,373 shares at Rs. 680.90 per share on NSE. The transaction represents a significant institutional or bulk investor activity in the company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1764045418931,
            "Source": "order&deals"
        },
        {
            "Title": "CG Power's GGT Division Develops Uniform Braking Algorithm",
            "Summary": "CG Power's GGT Division has successfully created and tested a uniform braking algorithm, marking a significant technological advancement for the company. This milestone demonstrates progress in the company's engineering capabilities and product development within its transportation technology segment.",
            "Sentiment": "neutral",
            "PublishDate": 1763955941840,
            "Source": "stock"
        },
        {
            "Title": "CG Power Receives ₹3.65 Billion Tax Demand for Assessment Year 2018-19",
            "Summary": "CG Power And Industrial Solutions has received a tax demand of ₹3.65 billion from tax authorities for the assessment year 2018-19. The substantial tax demand affects the company's financial obligations and could impact its cash flow and financial planning.",
            "Sentiment": "negative",
            "PublishDate": 1763559518943,
            "Source": "stock"
        },
        {
            "Title": "CG Power Allots 21,800 Equity Shares Under Employee Stock Option Plan",
            "Summary": "CG Power and Industrial Solutions Limited allotted 21,800 equity shares of Rs. 2 each at an exercise price of Rs. 635.10 per share to eligible employees under ESOP 2021. The company's paid-up equity share capital increased from Rs. 3,14,95,41,618 to Rs. 3,14,95,85,218, comprising 1,57,47,92,609 equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763476259201,
            "Source": "corporate_action"
        },
        {
            "Title": "CG Power Receives Rs 33.02 Crore Tax Demand for Assessment Year 2020-21",
            "Summary": "CG Power and Industrial Solutions received a final assessment order from the Income Tax Department with tax demands of Rs 33.02 crore due to various disallowances and additions for Assessment Year 2020-21. The company plans to file appeals against the assessment order and believes it has a fair chance of succeeding based on legal precedents and opinions.",
            "Sentiment": "negative",
            "PublishDate": 1763476022834,
            "Source": "stock"
        },
        {
            "Title": "CG Power Reports No Deviations in Rs 3,000 Crore QIP Fund Utilization",
            "Summary": "CG Power and Industrial Solutions Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing proper utilization of proceeds from its Rs 3,000 crore Qualified Institutional Placement (QIP). CARE Ratings Limited, serving as the monitoring agency, reported no deviations from stated objectives. The QIP was conducted from June 30 to July 3, 2025. Out of total proceeds, Rs 179.12 crore has been utilized during the quarter, with Rs 2,820.88 crore remaining unutilized. Major allocations include Rs 1,062.85 crore for investment in subsidiary CG Semi Private Limited for semiconductor assembly facility, Rs 856.98 crore for capital expenditure including power transformer plant setup, Rs 330 crore for acquisitions, and Rs 724.14 crore for general corporate purposes. The company has deployed unutilized funds in fixed deposits and mutual funds across various banks including HDFC Bank and Axis Bank. All statutory approvals related to the objectives have been obtained, and the monitoring agency confirmed appropriate utilization as per the offer document.",
            "Sentiment": "positive",
            "PublishDate": 1762758211597,
            "Source": "corporate_action"
        },
        {
            "Title": "CG Power Seeks Stock Exchange Approval for Declassification of Two Promoter Group Entities",
            "Summary": "CG Power and Industrial Solutions Limited has applied to NSE and BSE seeking no-objection for declassification of two entities from its promoter group category. The entities are Yantra Coromandel Agrisolutions Private Limited and Coromandel Engineering Company Limited, both currently holding 0.00% shareholding in the company. This follows the company's earlier disclosures regarding re-classification of these promoter group members. The declassification request is being made in accordance with Regulation 31A of SEBI Listing Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762438222956,
            "Source": "corporate_action"
        },
        {
            "Title": "CG Power Allots 11,000 Equity Shares Under Employee Stock Option Plan",
            "Summary": "CG Power and Industrial Solutions Limited allotted 11,000 equity shares of Rs. 2 each at an exercise price of Rs. 635.10 per share to eligible employees under its Employee Stock Option Plan 2021. The allotment increases the company's paid-up equity share capital from Rs. 3,14,95,19,618 to Rs. 3,14,95,41,618, comprising 1,57,47,70,809 equity shares with a face value of Rs. 2 each. The newly allotted shares rank equally with existing equity shares in all respects.",
            "Sentiment": "neutral",
            "PublishDate": 1762320721141,
            "Source": "corporate_action"
        },
        {
            "Title": "Semiconductor Production Begins at Kaynes and CG Power Manufacturing Plants",
            "Summary": "Ashwani Vaishnaw announced that semiconductor production has commenced at manufacturing facilities operated by Kaynes and CG Power. This marks the start of semiconductor manufacturing operations at both companies' plants.",
            "Sentiment": "positive",
            "PublishDate": 1762155096861,
            "Source": "stock"
        },
        {
            "Title": "CG Power Plans ₹748 Crore Switchgear Plant in Western India to Double Production Capacity",
            "Summary": "CG Power has announced plans to establish a new switchgear manufacturing plant in Western India with an investment of ₹748 crore. The facility is intended to double the company's production capacity in the switchgear segment.",
            "Sentiment": "positive",
            "PublishDate": 1761729565524,
            "Source": "stock"
        },
        {
            "Title": "CG Power Reports Mixed Q2 Results with Revenue Growth but Misses Estimates",
            "Summary": "CG Power and Industrial Solutions reported Q2 revenue of 29 billion rupees, up from 24.1 billion rupees year-over-year, but fell short of the estimated 32.83 billion rupees. EBITDA increased to 3.86 billion rupees from 2.95 billion rupees year-over-year, though below the 4.31 billion rupee estimate. EBITDA margin improved to 13.23% from 12.23% year-over-year, slightly exceeding the 13.1% estimate. Consolidated net profit rose to 2.9 billion rupees from 2.2 billion rupees year-over-year, but missed the estimated 3.13 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1761729185963,
            "Source": "earnings"
        },
        {
            "Title": "CG Power Appoints Vrushali Gadkari as VP & Chief Human Resources Officer",
            "Summary": "CG Power and Industrial Solutions Limited appointed Ms. Vrushali Kedar Gadkari as Vice President & Chief Human Resources Officer, effective September 30, 2025. Gadkari brings over 21 years of HR experience in building high-performance businesses across various sectors including FMCG, BFSI, Realty, Healthcare, and Steel Manufacturing. She has expertise in managing business turnarounds, organizational transformation, and talent management across different business stages including mergers and acquisitions, expansions, and scale-ups. The appointment is part of the company's strategy to strengthen human capital and support growth ambitions.",
            "Sentiment": "positive",
            "PublishDate": 1759232249068,
            "Source": "corporate_governance"
        },
        {
            "Title": "CECL Requests Reclassification from Promoter Group to Public Category After Complete Divestment",
            "Summary": "Coromandel Engineering Company Limited (CECL) has requested reclassification from 'promoter and promoter group' to 'public' category for CG Power and Industrial Solutions Limited. The request follows a Share Purchase Agreement executed on 29th September 2023, through which CECL's entire shareholding was divested, resulting in a change of control on 29th December 2023. CECL currently holds zero shares (0.00% shareholding) in the company. The company has received the request letter and will place it before the Board of Directors for approval. Upon board approval, an application will be submitted to NSE and BSE seeking no-objection for the reclassification. CECL has confirmed it does not hold more than 10% voting rights, does not exercise control over company affairs, has no special rights, board representation, or key managerial personnel positions in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1758901914198,
            "Source": "corporate_action"
        },
        {
            "Title": "YCAS Requests Reclassification from Promoter Group to Public Category Following Shareholding Changes",
            "Summary": "Yanmar Coromandel Agrisolutions Private Limited (YCAS) has requested reclassification from 'promoter and promoter group' to 'public' category for CG Power and Industrial Solutions Limited. The request follows a change in shareholding structure where Coromandel International Limited's stake in YCAS reduced from 40% to 10.60% due to a Rs. 149.72 crore fund infusion by Yanmar Asia (Singapore) Corporation Pte. Ltd. on September 27, 2024. Following the allotment of 11,09,00,741 equity shares of face value Rs. 10 each to Yanmar Singapore, YCAS no longer meets the definition of promoter group as CIL holds less than 20% of YCAS equity share capital. YCAS currently holds zero shares in CG Power. The company confirms it does not exercise control over CG Power's affairs, has no special rights, board representation, or access to price sensitive information. The request will be placed before CG Power's Board of Directors for approval, after which an application will be submitted to stock exchanges for no-objection.",
            "Sentiment": "neutral",
            "PublishDate": 1758103433873,
            "Source": "corporate_action"
        },
        {
            "Title": "CG Power Shares Surge 14% on OSAT Facility Launch and Morgan Stanley Coverage",
            "Summary": "CG Power and Industrial Solutions shares climbed 14% over four trading sessions, reaching Rs 757.20 on BSE. The rally followed the launch of India's first end-to-end Outsourced Semiconductor Assembly and Test (OSAT) facility in Sanand, Gujarat, through subsidiary CG Semi Private Limited. The company is investing over Rs 7,600 crore in two facilities expected to create more than 5,000 jobs. The first facility operates at 0.5 million units per day capacity, while the second facility under construction targets 14.5 million units per day by 2026. Morgan Stanley initiated coverage with an 'Overweight' rating, projecting 34% profit after tax CAGR between FY25-FY28. The brokerage expects the industrials business to achieve 14% revenue CAGR and 15% EBIT CAGR, while power systems division is projected for 35% revenue CAGR and 42% EBIT CAGR during FY25-28.",
            "Sentiment": "positive",
            "PublishDate": 1756881636120,
            "Source": "stock"
        },
        {
            "Title": "CG Power Shares Hit Seven-Month High Following Semiconductor Facility Launch",
            "Summary": "CG Power And Industrial Solutions shares extended gains for a second session after its unit CG Semi launched India's first outsourced semiconductor assembly and testing facility in Sanand, Gujarat. The stock gained 4.56% over two sessions and rose as much as 3.69% to Rs 711.90, reaching its highest level since January 8. CG Semi has become one of India's full-service OSAT providers, offering solutions across traditional and advanced packaging technologies with support from central and state governments. The company has collaborated with Renesas and Stars Microelectronics and plans to invest Rs 7,600 crore over five years to develop two facilities in Sanand, Gujarat. Trading volume reached 7.6 times its 30-day average. Out of 13 analysts tracking the company, 10 maintain a 'buy' rating while three suggest 'sell', with the average 12-month consensus price target implying a 5.1% upside.",
            "Sentiment": "positive",
            "PublishDate": 1756702670275,
            "Source": "stock"
        },
        {
            "Title": "CG Semi Launches India's First End-to-End OSAT Semiconductor Facility in Gujarat",
            "Summary": "CG Semi Private Limited, a subsidiary of CG Power and Industrial Solutions Limited, has launched its first Outsourced Semiconductor Assembly and Test (OSAT) facility in Sanand, Gujarat. The company is investing over ₹7,600 crore (~USD 870 million) over five years to develop two facilities (G1 and G2) in collaboration with Renesas and Stars Microelectronics. The G1 facility will operate at a peak capacity of approximately 0.5 million units per day and handle end-to-end chip assembly, packaging, testing, and post-test services. Commercial production is expected to commence in calendar year 2026. The G2 facility, under construction, is expected to be completed by the end of calendar year 2026 with a capacity of approximately 14.5 million units per day. Together, both facilities are projected to generate over 5,000 direct and indirect jobs. CG Semi has assembled a team with over 1,000 years of combined semiconductor experience and has sent Indian engineers, operators, and technicians to Malaysia for three months of training.",
            "Sentiment": "positive",
            "PublishDate": 1756383777332,
            "Source": "stock"
        },
        {
            "Title": "CG Power Opens New Chip Manufacturing Plant with Production Starting This Month",
            "Summary": "CG Power is opening a new chip manufacturing plant this month, with production expected to begin by month-end. The facility represents the company's expansion into semiconductor manufacturing operations.",
            "Sentiment": "positive",
            "PublishDate": 1755066886653,
            "Source": "stock"
        },
        {
            "Title": "CG Power's US Subsidiary Partners with Flanders Electric to Expand Railway Market Presence",
            "Summary": "CG Power and Industrial Solutions Limited's wholly owned step-down subsidiary, CG DE SUB, LLC (CG USA), has entered into an agreement with Flanders Electric Motors Service, LLC to expand its footprint in the US railway sector. The partnership aims to leverage local capabilities and offer railway traction motor replacements and refurbishments with competitive pricing and faster turnaround times. The US railway market spans approximately 140,000 miles, three times larger than Indian Railways, with substantial demand for high-quality solutions dominated by Class I railroads. Flanders brings rapid throughput times, quality assurance, and maximum reliability through their US footprint, while CG contributes over eight decades of global expertise in railway solutions. Both companies plan to scale capabilities and expand into US rail markets. CG Power reported consolidated revenue of Rs. 9,909 crores for FY25 and operates 18 manufacturing units across India and one in Sweden, employing around 3,113 people.",
            "Sentiment": "positive",
            "PublishDate": 1754933728952,
            "Source": "order&deals"
        },
        {
            "Title": "CG Power Secures 99-Year Land Lease for 45,000 MVA Transformer Plant in Madhya Pradesh",
            "Summary": "CG Power and Industrial Solutions Limited has received land allocation for its greenfield transformer manufacturing facility in Sehore, Madhya Pradesh. The M.P Industrial Development Corporation Limited (MPIDC) granted the company a 99-year lease for approximately 45.13 acres of undeveloped land in Village-Jahangirpura, Tehsil-Sehore. The facility will have a capacity of 45,000 MVA and represents the company's expansion into transformer manufacturing in Western India. This development follows the board's earlier decision in January 2025 to establish the new transformer plant.",
            "Sentiment": "positive",
            "PublishDate": 1754118232720,
            "Source": "stock"
        },
        {
            "Title": "CG Power Reports 29% Revenue Growth in Q1 Results",
            "Summary": "CG Power and Industrial Solutions reported Q1 revenue of 28.78 billion rupees, up from 22.23 billion rupees in the same period last year. The company's consolidated net profit increased to 2.7 billion rupees from 2.4 billion rupees year-over-year. EBITDA rose to 3.8 billion rupees compared to 3.3 billion rupees previously, though the EBITDA margin declined to 13.25% from 14.68% in the prior year period.",
            "Sentiment": "positive",
            "PublishDate": 1753347232533,
            "Source": "earnings"
        },
        {
            "Title": "CG Power Schedules Q1 FY26 Earnings Conference Call for July 24, 2025",
            "Summary": "CG Power and Industrial Solutions Limited has scheduled an earnings conference call for Q1 FY26 on Thursday, July 24, 2025, at 5:00 PM IST. The call will discuss the company's financial results for the quarter ended June 30, 2025, followed by a Q&A session with management. Key executives participating include Managing Director & CEO Amar Kaul, CFO Susheel Todi, and various business heads from drives & automation, switchgears, transformers, railways, motors, and consumer products divisions. The call will be accessible through digital platforms and telephone dial-in numbers for domestic and international participants.",
            "Sentiment": "neutral",
            "PublishDate": 1753158252684,
            "Source": "earnings"
        },
        {
            "Title": "CG Power Completes QIP, Raises ₹3,200 Crores at ₹660 Per Share",
            "Summary": "CG Power has successfully completed its Qualified Institutional Placement (QIP), selling equity shares at ₹660 each. The company has raised approximately ₹3,200 crores through this placement. The selling price represents a 2.81% discount to the floor price set for the QIP.",
            "Sentiment": "positive",
            "PublishDate": 1751597291000,
            "Source": "default"
        },
        {
            "Title": "CG Power and Industrial Solution Ltd: Launches Rs 3,000 Crore QIP with Floor Price Set",
            "Summary": "CG Power and Industrial Solution Ltd. launched a qualified institutional placement (QIP) to raise up to Rs 3,000 crore. The floor price is set at Rs 679.08 per share, with a potential 5% discount. The indicative issue price is Rs 660 per share. The QIP could result in a 2.89% dilution of the company's shares.",
            "Sentiment": "positive",
            "PublishDate": 1751302324000,
            "Source": "corporate_action"
        }
    ]
}