{
    "Symbol": "CHALET",
    "ISIN": "INE427F01016",
    "News": [
        {
            "Title": "Chalet Hotels faces Rs.39.56 crore tax notice",
            "Summary": "Chalet Hotels receives property tax notice from Greater Bengaluru Authority for Rs.39.56 crore dues on Whitefield hotel complex, claims system glitch and plans legal action.",
            "Sentiment": "negative",
            "PublishDate": 1770824651859,
            "Source": "stocks"
        },
        {
            "Title": "Chalet Hotels Q3 FY26 Revenue Jumps 27% to ₹5,892 Million",
            "Summary": "Chalet Hotels reported strong Q3 FY26 results with consolidated revenue growing 27% YoY to ₹5,892 million and EBITDA rising 29% to ₹2,726 million. RevPAR growth of 12% driven by 16% ADR increase.",
            "Sentiment": "positive",
            "PublishDate": 1770691047148,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chalet Hotels Board Approves Promoter Reclassification",
            "Summary": "Chalet Hotels Limited board approved reclassification of two entities from Promoter Group to Public category, both holding zero shares, subject to stock exchange approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1770042407416,
            "Source": "stocks"
        },
        {
            "Title": "Chalet Hotels Q3 Net Profit Jumps 24% to ₹1.2B",
            "Summary": "Chalet Hotels reported strong Q3 performance with consolidated net profit rising 24% to ₹1.2 billion and revenue growing 26% to ₹5.8 billion year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1770038072486,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chalet Hotels Shareholders Approve Key Appointments",
            "Summary": "Chalet Hotels Limited shareholders approved three special resolutions through postal ballot, including appointment of new Managing Director & CEO Shwetank Singh and Non-Executive Director Dr. Sanjay Sethi.",
            "Sentiment": "positive",
            "PublishDate": 1769883285517,
            "Source": "stocks"
        },
        {
            "Title": "Chalet Hotels Upgrades Aravali Resort Brand",
            "Summary": "Chalet Hotels has upgraded its Courtyard by Marriott Aravali Resort, NCR to Aravali Marriott Resort & Spa, Delhi NCR, marking a significant brand enhancement for the property.",
            "Sentiment": "positive",
            "PublishDate": 1769859622078,
            "Source": "stocks"
        },
        {
            "Title": "Chalet Hotels schedules Q3FY26 results call",
            "Summary": "Chalet Hotels Limited announces analyst/investor conference call on February 3, 2026 at 11:00 AM IST to discuss Q3FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769614214049,
            "Source": "co_actions_results"
        },
        {
            "Title": "HDFC MF Increases Chalet Hotels Stake to 7.05%",
            "Summary": "HDFC Mutual Fund acquired 4.5 million shares of Chalet Hotels through various schemes, increasing its total holding from 4.99% to 7.05% through open market purchases.",
            "Sentiment": "positive",
            "PublishDate": 1768993975607,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chalet Hotels Seeks Promoter Group Reclassification",
            "Summary": "Chalet Hotels receives requests from two entities to reclassify from promoter group to public category under SEBI regulations. Both entities currently hold zero shareholding in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1768842555347,
            "Source": "stocks"
        },
        {
            "Title": "Chalet Hotels Plans Expansion to 5,000 Keys",
            "Summary": "Chalet Hotels maintains positive outlook after strong first half performance and projects better second half. Company planning significant expansion to 5,000 keys as announced by Shwetank Singh.",
            "Sentiment": "positive",
            "PublishDate": 1767764024515,
            "Source": "stocks"
        },
        {
            "Title": "Chalet Hotels allots 2 lakh shares under ESOP 2023",
            "Summary": "Chalet Hotels Limited allotted 2,00,468 equity shares to employees under its ESOP 2023 scheme at ₹528 per share, raising ₹10.58 crores and increasing paid-up capital to ₹218.95 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1767362852574,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chalet Hotels faces ₹160.02 cr GST penalty demand",
            "Summary": "Maharashtra GST Department levies ₹160.02 crore penalty on Chalet Hotels for ITC mismatches and block credits related to FY 2018-19. Company plans to contest the order through legal recourse.",
            "Sentiment": "negative",
            "PublishDate": 1767290693268,
            "Source": "stocks"
        },
        {
            "Title": "Chalet Hotels Block Trade Worth ₹23.83 Crores",
            "Summary": "Chalet Hotels executed a significant NSE block trade involving 274,403 shares at ₹868.50 per share, totaling ₹23.83 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1767161710607,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chalet Hotels Publishes Postal Ballot Newspaper Ads",
            "Summary": "Chalet Hotels publishes newspaper advertisements for postal ballot notice regarding MD & CEO appointment and other resolutions, complying with SEBI Regulation 47 requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1765444556390,
            "Source": "stocks"
        },
        {
            "Title": "Chalet Hotels Allots 14,000 Shares Under ESOP 2022",
            "Summary": "Chalet Hotels Limited allotted 14,000 equity shares to eligible employees under its Employee Stock Option Plan 2022, increasing paid-up share capital to ₹218.75 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1765380639597,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chalet Hotels Acquires 26% Stake in Solar Power SPV",
            "Summary": "Chalet Hotels Limited has acquired a 26% shareholding in Pro-Zeal Green Power SPV for a solar power project located in Maharashtra, marking the company's entry into renewable energy investments.",
            "Sentiment": "positive",
            "PublishDate": 1765377554193,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chalet Hotels Acquires 26% Stake in Solar Power SPV for Rs 26,000",
            "Summary": "Chalet Hotels Limited acquired a 26% equity stake in Pro-zeal Green Power Fourteen Private Limited for Rs 26,000 to participate in a captive solar power arrangement in Maharashtra. The acquisition involves setting up a solar power plant through the SPV, with completion expected within 8 months of the agreement signing on December 10, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765364157640,
            "Source": "order&deals"
        },
        {
            "Title": "Chalet Hotels Receives ICRA AA- Stable Credit Rating for Debt Instruments and Bank Facilities",
            "Summary": "Chalet Hotels Limited received credit ratings from ICRA Limited for various debt instruments and bank facilities, with long-term facilities rated ICRA AA- (Stable) and short-term limits rated ICRA A1+. The ratings cover non-convertible debentures, term loans, fund-based limits, and non-fund based limits, providing investors with assessment of the company's creditworthiness.",
            "Sentiment": "positive",
            "PublishDate": 1764945741914,
            "Source": "corporate_action"
        },
        {
            "Title": "Chalet Hotels Allots 54,017 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Chalet Hotels Limited allotted 54,017 fully paid-up equity shares of Rs. 10 each to eligible employees under its CHL Employee Stock Option Plan 2022, increasing the company's paid-up share capital from Rs. 218.69 crore to Rs. 218.74 crore. The allotted shares rank pari-passu with existing equity shares and represent part of the total 12,17,831 equity shares covered under the ESOP scheme.",
            "Sentiment": "neutral",
            "PublishDate": 1763385213236,
            "Source": "corporate_action"
        },
        {
            "Title": "Chalet Hotels Reports 94% Revenue Growth, Launches Athiva Brand and Declares Maiden Dividend",
            "Summary": "Chalet Hotels Limited reported consolidated revenue of INR 7.4 billion, up 94% year-on-year, with EBITDA rising 98% to INR 3.1 billion. The growth was driven by residential project revenue recognition of INR 2.8 billion from 55 apartment sales at Vivarea Bangalore. Excluding residential business, core hospitality and commercial revenue grew 20% to INR 4.6 billion. Hospitality revenue increased 13% to INR 3.8 billion with ADR jumping 16% to INR 12,170, though occupancy dropped 7 percentage points to 67% due to weather disruptions and new inventory ramp-up. Commercial real estate revenue surged 76% to INR 738 million. The company launched its new premium lifestyle brand Athiva Hotels & Resorts, starting with the rebranded Dukes Retreat in Khandala, with 5 additional properties identified for conversion. The board declared a maiden interim dividend of INR 1 per share. MD and CEO Dr. Sanjay Sethi announced his stepping down on January 31, 2026, with Shwetank Singh taking over leadership.",
            "Sentiment": "positive",
            "PublishDate": 1762951212981,
            "Source": "earnings"
        },
        {
            "Title": "Chalet Hotels Expects Strong H2 Performance Driven by Wedding Season and International Travel Recovery",
            "Summary": "Chalet Hotels anticipates robust performance in the second half of the financial year, driven by the wedding season and recovering travel demand. Executive Director Shwetank Singh noted that the second half traditionally accounts for 55% of annual business versus 45% in the first half. The company expects benefits from deferred auspicious wedding dates and strong bookings for November and February, its highest-performing months. International travel recovery is contributing significantly, with direct flights resuming and expat movement returning to pre-pandemic levels. This segment provides better average daily rates and higher food and beverage consumption. The company reported a 7% year-on-year decline in portfolio occupancy for the quarter, attributed to fewer auspicious wedding dates and extended weekends affecting resort bookings. Chalet Hotels maintains a debt level of approximately Rs 2,100 crore with a 2.8 debt-to-EBITDA multiple, well below its 3.5 target ceiling. Singh indicated that debt servicing is covered by lease rentals, freeing up hospitality cash flows for growth investments.",
            "Sentiment": "positive",
            "PublishDate": 1762761926446,
            "Source": "stock"
        },
        {
            "Title": "Chalet Hotels Declares Interim Dividend of Re. 1 Per Share for FY 2025-26",
            "Summary": "Chalet Hotels Limited's Board of Directors declared an interim dividend of Re. 1 per equity share (10% on face value of Rs. 10) for Financial Year 2025-26. The dividend will be paid to shareholders holding equity shares as on the record date of November 11, 2025, within 30 days of declaration through electronic mode. The company has informed shareholders about tax deduction at source (TDS) obligations on dividend payments, with TDS rates varying from nil to 20% for resident shareholders and 20% for non-resident shareholders, depending on documentation provided. Shareholders must update their PAN, residential status, email address, and bank account details with their depository participants before the record date. The dividend payment will be subject to applicable TDS deductions as per Income Tax Act provisions.",
            "Sentiment": "positive",
            "PublishDate": 1762477069906,
            "Source": "corporate_action"
        },
        {
            "Title": "Chalet Hotels Reports Strong Q2 Performance with 1.55 Billion Rupees Net Profit",
            "Summary": "Chalet Hotels reported consolidated net profit of 1.55 billion rupees in Q2, compared to a loss of 1.38 billion rupees in the same period last year. Revenue increased to 7.35 billion rupees from 3.77 billion rupees year-over-year. EBITDA rose to 2.96 billion rupees from 1.5 billion rupees, while EBITDA margin improved to 40.29% from 39.65%.",
            "Sentiment": "positive",
            "PublishDate": 1762389361035,
            "Source": "earnings"
        },
        {
            "Title": "Chalet Hotels Launches Premium Brand 'Athiva Hotels & Resorts' with 94% Revenue Growth",
            "Summary": "Chalet Hotels launched 'Athiva Hotels & Resorts', a premium lifestyle brand featuring over 900 keys including pipeline properties across Mumbai, Goa, and Kerala. The company reported 94% year-over-year revenue growth driven by hospitality and real estate segments. Chalet Hotels declared its first interim dividend and achieved recognition as India's first EV100-compliant hospitality firm, strengthening its ESG leadership position.",
            "Sentiment": "positive",
            "PublishDate": 1762268239107,
            "Source": "stock"
        },
        {
            "Title": "Chalet Hotels Recommends Interim Dividend of ₹1 Per Share",
            "Summary": "Chalet Hotels has recommended an interim dividend of ₹1 per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1762252451702,
            "Source": "corporate_action"
        },
        {
            "Title": "Chalet Hotels Reports Strong Q2 Turnaround with 1.55B Rupees Net Profit",
            "Summary": "Chalet Hotels delivered a significant turnaround in Q2, posting a consolidated net profit of 1.55 billion rupees compared to a loss of 1.38 billion rupees in the same period last year. Revenue nearly doubled to 7.35 billion rupees from 3.77 billion rupees year-over-year. EBITDA increased substantially to 2.96 billion rupees from 1.5 billion rupees, while EBITDA margin improved to 40.29% from 39.65% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762252059436,
            "Source": "earnings"
        },
        {
            "Title": "Chalet Hotels' General Manager for Investor Relations Resigns",
            "Summary": "Ruchi Rudra, General Manager for Investor Relations and Business Strategy at Chalet Hotels Limited, has resigned from her position. Her resignation becomes effective from the close of business hours on October 31, 2025, ending her role as a member of the Senior Management team. In her resignation letter dated August 11, 2025, Rudra cited her decision to pursue new opportunities and challenges after expressing gratitude for the growth and learning experiences at the company.",
            "Sentiment": "neutral",
            "PublishDate": 1761922095115,
            "Source": "corporate_governance"
        },
        {
            "Title": "Chalet Hotels Redeems Rs 600 Million Preference Shares",
            "Summary": "Chalet Hotels Limited redeemed 6,000 Series B Non-Cumulative, Non-Convertible Redeemable Preference Shares on October 17, 2025. Each share had a face value of Rs 1,00,000, totaling Rs 600 million. The redemption was executed at par value using the company's profits available for distribution.",
            "Sentiment": "neutral",
            "PublishDate": 1760698404863,
            "Source": "corporate_action"
        },
        {
            "Title": "Chalet Hotels Launches Luxury Brand 'Athiva' with 900+ Rooms Across Six Properties",
            "Summary": "Chalet Hotels has introduced a new luxury hospitality brand called 'Athiva' featuring over 900 guest rooms across six hotels. The first property under this brand is Athiva Resort & Spa located in Khandala. The company has set a target to double its capacity within three years.",
            "Sentiment": "positive",
            "PublishDate": 1760510920598,
            "Source": "stock"
        },
        {
            "Title": "Chalet Hotels Raises Rs.100 Crore Through Commercial Paper Issuance",
            "Summary": "Chalet Hotels Limited has allotted 2,000 commercial papers worth Rs.100 crore through private placement. The commercial papers carry a fixed coupon rate of 6.10% and have a tenure of three months, maturing on December 22, 2025. The issuance received a CRISIL A1+ rating and will be listed on the Wholesale Debt Market segment of BSE Limited. The commercial papers are unsecured and will be redeemed at par value. Each commercial paper has a face value of Rs.5,00,000 and was issued at a discount.",
            "Sentiment": "neutral",
            "PublishDate": 1758627131925,
            "Source": "corporate_action"
        },
        {
            "Title": "Chalet Hotels Expects High 70s Occupancy Rate in H2, Projects Double-Digit RevPAR Growth",
            "Summary": "Chalet Hotels MD & CEO Sanjay Sethi expressed confidence in achieving occupancy rates in the high 70s during the second half of the financial year, despite challenges in the second quarter due to monsoons across Indian cities. The company views recent GST rate rationalization as providing tailwinds for the hotel industry by putting more money in consumers' pockets. The new 5% GST rate for hotel rooms below Rs 7,500 will have minimal impact on Chalet Hotels, as only single-digit percentage of their room nights are sold below this threshold. Sethi dismissed any plans to reprice rooms to take advantage of the lower tax bracket. He advocated for reversing the withdrawal of Input Tax Credit for rooms under Rs 7,500 and suggested raising the threshold to Rs 12,000, linked to the Consumer Price Index. The CEO projects double-digit RevPAR growth for the coming years, with costs growing at 5.5-6%, allowing the industry to continue adding margins. Chalet Hotels shares closed 2.16% lower at Rs 1,017.8 on the NSE.",
            "Sentiment": "positive",
            "PublishDate": 1757757742212,
            "Source": "stock"
        },
        {
            "Title": "Chalet Hotels Subsidiary Acquires Land in Uttarakhand for Rs 600 Million",
            "Summary": "Mahananda Spa and Resorts Private Limited, a wholly owned subsidiary of Chalet Hotels Limited, acquired approximately 18,848 square meters of land in Narendra Nagar, Uttarakhand for Rs 600 million in cash. The land is located near the existing Westin Resort & Spa, Himalayas property. The company described this acquisition as a strategic investment for expansion in the high-end leisure market.",
            "Sentiment": "positive",
            "PublishDate": 1755004962915,
            "Source": "stock"
        },
        {
            "Title": "Chalet Hotels Reports 146% Revenue Growth in Q1 FY26; CEO Sanjay Sethi to Step Down in January 2026",
            "Summary": "Chalet Hotels Limited reported consolidated revenue of INR 9.1 billion for the quarter ended June 30, 2025, marking a 146% year-on-year increase. EBITDA grew 150% to INR 3.7 billion with margins expanding 70 basis points to 40.9%. The strong performance was driven by residential revenue recognition from 95 apartment handovers at The Vivarea project (INR 4.4 billion) and hospitality segment growth of 18% to INR 3.9 billion. Excluding residential, core business revenue grew 27% with EBITDA up 37%. The company added 165 keys during the quarter, including 121 rooms at Marriott Whitefield Bengaluru. RevPAR increased 10% to INR 8,059 with ADR growing 17% to INR 12,207, though occupancy declined 4.4 percentage points to 66% due to market softness and new inventory additions. MD & CEO Sanjay Sethi announced his decision to step down from executive role on January 31, 2026, with Shwetank Singh designated as successor. The company targets expanding from current 3,300+ operational rooms to 5,000 rooms including pipeline projects.",
            "Sentiment": "positive",
            "PublishDate": 1754581193264,
            "Source": "earnings"
        },
        {
            "Title": "Chalet Hotels Targets Long-Term Growth with Mixed-Use Development Strategy",
            "Summary": "Chalet Hotels is pursuing long-term growth through mixed-use projects and residential revenue generation. The company has a development pipeline of approximately 1,200 rooms and 0.9 million square feet of commercial space. EBITDA margins are remaining steady as the company expands into new areas and focuses on green infrastructure leadership.",
            "Sentiment": "positive",
            "PublishDate": 1753979427391,
            "Source": "stock"
        },
        {
            "Title": "Chalet Hotels Reports Strong Q1 FY26 Results with 146% Revenue Growth and Residential Project Launch",
            "Summary": "Chalet Hotels Limited reported consolidated revenue of ₹9,083 million for Q1 FY26, representing 146% year-over-year growth. EBITDA increased 150% to ₹3,711 million with a margin of 40.9%. The hospitality business generated ₹3,856 million in revenue (18% growth) with EBITDA of ₹1,608 million (20% growth). The annuity business saw significant growth with revenue of ₹732 million (106% increase) and EBITDA of ₹608 million (130% increase). The company commenced revenue recognition from its residential project, contributing ₹4,391 million in revenue and ₹1,628 million in EBITDA. The company handed over 95 residential units at The Vivarea, Koramangala, Bengaluru. Hospitality operations showed mixed performance with average daily rates increasing 17% to ₹12,207 but occupancy declining 4.4 percentage points to 66%. The company added 121 rooms at Bengaluru Marriott Hotel Whitefield and 44 rooms at The Dukes Retreat. Net profit for the quarter was ₹2,031 million compared to ₹606 million in the previous year. The company maintained its expansion pipeline with projects under construction including Taj at Delhi International Airport and CIGNUS Powai Tower II.",
            "Sentiment": "positive",
            "PublishDate": 1753974792070,
            "Source": "earnings"
        },
        {
            "Title": "Chalet Hotels Reports Strong Q1 Results, Announces Leadership Transition with New CEO Designate",
            "Summary": "Chalet Hotels Limited reported robust quarterly results for the period ended June 30, 2025, with consolidated revenue from operations reaching ₹8,945.51 million and profit for the period at ₹2,031.28 million. The company's EBITDA stood at ₹3,710.65 million. During the quarter, the company recognized ₹4,391.17 million revenue from its residential project in Bengaluru. The Board approved the appointment of Mr. Shwetank Singh as Managing Director & CEO Designate, effective February 1, 2026, following Dr. Sanjay Sethi's planned retirement. Dr. Sethi will continue as a Non-Executive, Non-Independent Director from February 1, 2026. The company also repaid ₹400 million of Non-Cumulative Non-Convertible Redeemable Preference Shares during the quarter, reducing the outstanding amount to ₹1,600 million.",
            "Sentiment": "positive",
            "PublishDate": 1753974365615,
            "Source": "corporate_governance"
        },
        {
            "Title": "Chalet Hotels Appoints New CEO and Reports Strong Q1 Results",
            "Summary": "Chalet Hotels Limited appointed Mr. Shwetank Singh as Managing Director & CEO Designate, effective February 1, 2026, following Dr. Sanjay Sethi's planned retirement. Dr. Sethi will continue as Non-Executive, Non-Independent Director from the same date. The company reported quarterly results with total income of ₹9,083.38 million, up from ₹3,691.08 million in the same quarter last year. Profit for the period increased to ₹2,031.28 million compared to ₹606.47 million in the previous year quarter. Revenue from operations reached ₹8,945.51 million versus ₹3,610.06 million in the corresponding period. The company recognized ₹4,391.17 million revenue from its residential project in Bengaluru during the quarter. EBITDA stood at ₹3,710.65 million compared to ₹1,483.39 million in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1753972603595,
            "Source": "corporate_action"
        },
        {
            "Title": "Chalet Hotels Reports Strong Q1 Performance with Revenue and Profit More Than Doubling",
            "Summary": "Chalet Hotels delivered robust quarterly results with revenue surging to 8.9 billion rupees from 3.6 billion rupees year-over-year. Net profit increased significantly to 2 billion rupees compared to 607 million rupees in the same period last year. EBITDA rose to 3.7 billion rupees from 1.5 billion rupees year-over-year, while EBITDA margin improved slightly to 41.48% from 41.08%.",
            "Sentiment": "positive",
            "PublishDate": 1753971681744,
            "Source": "earnings"
        },
        {
            "Title": "Chalet Hotels: Record Q4 Performance Drives Target Price Hike",
            "Summary": "Chalet Hotels reported its best-ever quarterly performance in Q4, with revenue crossing Rs 5 billion for the first time. The company saw YoY growth of 25% in revenue, 32% in EBITDA, and 60% in PBT. EBITDA margin reached a record 46.3%, attributed to superior cost control and a richer revenue mix. Nirmal Bang maintains a 'Buy' rating and has increased the target price.",
            "Sentiment": "positive",
            "PublishDate": 1747215738000,
            "Source": "earnings"
        },
        {
            "Title": "Chalet Hotels: Confident of Double-Digit Revenue Growth in FY26",
            "Summary": "Chalet Hotels expects double-digit revenue growth in FY26, driven by strong demand in hospitality and annuity businesses. The company aims to exceed 5,000 operational and pipeline rooms in 4-5 quarters. Despite short-term disruptions in May, June shows full recovery. Q4 performance was strong with 21% increase in average room rates. The company's net debt is just under ₹2,000 crore, with plans to raise ₹1,000 crore for future growth opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1747128815000,
            "Source": "earnings"
        },
        {
            "Title": "Chalet Hotels Reports Q4 Profit Growth and Approves Fundraising Plans",
            "Summary": "Chalet Hotels announced its Q4 financial results, reporting a consolidated net profit of 1.2 billion rupees, up from 824 million rupees year-over-year. Revenue increased to 5.2 billion rupees from 4.18 billion rupees in the same period last year. The company's board has approved plans to raise up to 2,500 million rupees through commercial paper and an additional 10,000 million rupees through unspecified means.",
            "Sentiment": "positive",
            "PublishDate": 1747095779000,
            "Source": "default"
        },
        {
            "Title": "Chalet Hotels to Raise Funds via Commercial Paper and Other Means",
            "Summary": "Chalet Hotels has announced that its board has approved raising up to 2,500 million rupees through commercial paper. Additionally, the company plans to raise up to 10,000 million rupees through other means, though the specific method is not mentioned in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747063320000,
            "Source": "default"
        },
        {
            "Title": "Chalet Hotels Reports Strong Q4 Financial Performance",
            "Summary": "Chalet Hotels announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 2.6 billion rupees from 1.9 billion rupees in the previous year, with EBITDA margin expanding to 49.21% from 43.72%. Consolidated net profit rose to 1.2 billion rupees, up from 824 million rupees year-over-year and 963 million rupees quarter-over-quarter. Revenue also saw growth, reaching 5.2 billion rupees compared to 4.18 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747060118000,
            "Source": "result"
        },
        {
            "Title": "Chalet Hotels to Acquire Mahananda Spa And Resorts",
            "Summary": "Chalet Hotels has announced its intention to acquire Mahananda Spa And Resorts. The acquisition is valued at an enterprise value of 5,300 million rupees. This move represents a significant expansion for Chalet Hotels in the hospitality sector.",
            "Sentiment": "positive",
            "PublishDate": 1739233190000,
            "Source": "corporate_action"
        },
        {
            "Title": "Chalet Hotels to Acquire Mahananda Spa and Resorts",
            "Summary": "Chalet Hotels has announced its intention to acquire Mahananda Spa and Resorts. The acquisition is valued at an enterprise value of 5,300 million rupees. This move represents a significant expansion for Chalet Hotels in the hospitality sector.",
            "Sentiment": "positive",
            "PublishDate": 1739191378000,
            "Source": "corporate_action"
        },
        {
            "Title": "Chalet Hotels: Ambitious Plan to Triple EBITDA in Four Years",
            "Summary": "Chalet Hotels aims to triple its EBITDA over the next four years through room additions and increased revenue from existing properties. The company plans to add 1,100 rooms to its current 3,050, with a goal of reaching 5,000 rooms in the next two quarters. Q3 saw a 23% YoY EBITDA increase and 37% YoY net profit growth. The company expects double-digit RevPAR growth next year and anticipates Q4 to outperform Q3.",
            "Sentiment": "positive",
            "PublishDate": 1738475570000,
            "Source": "earnings"
        },
        {
            "Title": "Chalet Hotels Reports Q3 Financial Results",
            "Summary": "Chalet Hotels announced its Q3 financial results. The company reported a consolidated net profit of 965.4 million rupees, compared to a profit of 706 million rupees in the same quarter last year. However, this represents a loss of 1.38 billion rupees compared to the previous quarter. Revenue for Q3 increased to 4.58 billion rupees from 3.74 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738197253000,
            "Source": "earnings"
        },
        {
            "Title": "Chalet Hotels Reports Improved Q3 EBITDA and Margin",
            "Summary": "Chalet Hotels has announced its Q3 financial results, showing an improvement in both EBITDA and EBITDA margin. The company's EBITDA increased to 2.11 billion rupees from 1.72 billion rupees in the same quarter last year. The EBITDA margin also saw a slight improvement, rising to 46.17% from 46.09% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738153294000,
            "Source": "earnings"
        },
        {
            "Title": "Chalet Hotels Reports Q3 Revenue Increase",
            "Summary": "Chalet Hotels has reported a revenue of 4.58 billion rupees for the third quarter, compared to 3.74 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738153286000,
            "Source": "earnings"
        },
        {
            "Title": "Chalet Hotels Reports Q3 Profit Increase Year-over-Year, Decrease Quarter-over-Quarter",
            "Summary": "Chalet Hotels has reported a consolidated net profit of 965.4 million rupees for the third quarter, showing an increase from 706 million rupees in the same quarter last year. However, this represents a decrease from the previous quarter, where the company recorded a loss of 1.38 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1738153275000,
            "Source": "earnings"
        }
    ]
}