{
    "Symbol": "CHAMBLFERT",
    "ISIN": "INE085A01013",
    "News": [
        {
            "Title": "Chambal Fertilisers Q3FY26 Results Show Strong Growth",
            "Summary": "Chambal Fertilisers reports 19.93% YoY revenue growth to ₹5,898.26 crore in Q3FY26, with net profit rising 11.91% to ₹564.54 crore. Nine-month revenue jumped 26.84% to ₹18,008.63 crore.",
            "Sentiment": "positive",
            "PublishDate": 1770806115391,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chambal Fertilisers Q3FY26 Results Show Strong Growth",
            "Summary": "Chambal Fertilisers reports 20% revenue growth to ₹58,983 Mn in Q3FY26 with 10% PAT increase to ₹5,864 Mn. Nine-month revenue surged 27% to ₹1,80,086 Mn with 17% PAT growth.",
            "Sentiment": "positive",
            "PublishDate": 1770744632822,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chambal Fertilisers Changes Share Transfer Agent",
            "Summary": "Chambal Fertilisers and Chemicals Limited enters tri-partite agreement to change registrar and share transfer agent from Zuar FinServ Limited to KFin Technologies Limited on February 06, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770653679937,
            "Source": "stocks"
        },
        {
            "Title": "Chambal Fertilisers Q3FY26 Earnings Call on Feb 11",
            "Summary": "Chambal Fertilisers & Chemicals announces earnings conference call on February 11, 2026 at 2:30 PM IST to discuss Q3FY26 and 9MFY26 financial results with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1770292448330,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chambal Fertilisers Gets ICRA A1+ Rating Reaffirmed",
            "Summary": "ICRA Limited has re-affirmed Chambal Fertilisers' commercial paper programme credit rating at [ICRA] A1+, though the programme amount has been revised down from Rs. 4,500 crore to Rs. 2,500 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1769756137347,
            "Source": "stocks"
        },
        {
            "Title": "Chambal Fertilisers Board Meet Set for Feb 10",
            "Summary": "Chambal Fertilisers and Chemicals Limited has scheduled its board meeting for February 10, 2026, to approve Q3FY26 unaudited financial results. Trading window remains closed until February 12, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769678061585,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chambal Fertilisers Gets Withdrawal Order in Haryana",
            "Summary": "Chambal Fertilisers receives regulatory order to withdraw 11 products from Haryana market for FCO violations, company plans to challenge the order citing good case on merits.",
            "Sentiment": "negative",
            "PublishDate": 1765377527294,
            "Source": "stocks"
        },
        {
            "Title": "CMAIRTIME PROMOTION LLP Increases Stake in Chambal Fertilisers and Chemicals",
            "Summary": "CMAIRTIME PROMOTION LLP purchased 118,804 equity shares of Chambal Fertilisers and Chemicals Ltd on December 8, 2025, increasing their total shareholding to 1,113,877 equity shares representing 0.278% of the company. The acquisition was made through open market purchase and disclosed in compliance with SEBI substantial acquisition regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1765341065751,
            "Source": "corporate_action"
        },
        {
            "Title": "CM Airtime Promotion LLP Increases Stake in Chambal Fertilisers",
            "Summary": "CM Airtime Promotion LLP purchased 10,000 equity shares of Chambal Fertilisers and Chemicals Ltd on December 4, 2025, through open market transactions. The acquisition increased their total shareholding from 962,073 shares (0.240%) to 972,073 shares (0.243%) of the company's equity capital.",
            "Sentiment": "neutral",
            "PublishDate": 1765005292241,
            "Source": "corporate_action"
        },
        {
            "Title": "Jyotsna Poddar Acquires Additional Stake in Chambal Fertilisers Through Open Market Purchases",
            "Summary": "Jyotsna Poddar acquired 1,00,000 equity shares of Chambal Fertilisers and Chemicals Limited through open market transactions on December 2-3, 2025. The acquisition increased Poddar's total shareholding to 66,40,972 shares, representing 1.66% of the company's paid-up share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1764829881354,
            "Source": "corporate_action"
        },
        {
            "Title": "CM Airtime Promotion LLP Increases Stake in Chambal Fertilisers and Chemicals",
            "Summary": "CM Airtime Promotion LLP purchased 50,000 equity shares of Chambal Fertilisers and Chemicals Ltd on December 2, 2025, through open market transactions. The acquisition increased their total shareholding to 912,073 equity shares, representing 0.228% of the company's voting capital, up from 0.215%.",
            "Sentiment": "neutral",
            "PublishDate": 1764762966047,
            "Source": "corporate_action"
        },
        {
            "Title": "CM Airtime Promotion LLP Increases Stake in Chambal Fertilisers and Chemicals",
            "Summary": "CM Airtime Promotion LLP purchased 12,000 equity shares of Chambal Fertilisers and Chemicals Ltd on November 27, 2025, through open market transactions. The acquisition increased the promoter group entity's total shareholding to 819,073 equity shares, representing 0.204% of the company's total voting capital.",
            "Sentiment": "neutral",
            "PublishDate": 1764331047763,
            "Source": "corporate_action"
        },
        {
            "Title": "CMAIRTIME Promotion LLP Increases Stake in Chambal Fertilisers",
            "Summary": "CMAIRTIME Promotion LLP purchased 17,000 equity shares of Chambal Fertilisers and Chemicals Ltd on November 21, 2025, through open market transactions. The acquisition increased the promoter group entity's total shareholding from 578,073 shares (0.144%) to 595,073 shares (0.149%) of the company's equity capital.",
            "Sentiment": "neutral",
            "PublishDate": 1763986053032,
            "Source": "corporate_action"
        },
        {
            "Title": "CMA Airtime Promotion LLP Increases Stake in Chambal Fertilisers",
            "Summary": "CMA Airtime Promotion LLP purchased 65,000 equity shares of Chambal Fertilisers and Chemicals Ltd on November 20, 2025, through open market transactions. The acquisition increased the promoter group entity's total shareholding to 578,073 equity shares, representing 0.144% of the company's total equity capital of 400,652,297 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763726594111,
            "Source": "corporate_action"
        },
        {
            "Title": "Birla Real Estate Increases Stake in Chambal Fertilisers with Fresh Share Purchase",
            "Summary": "Birla Real Estate Limited purchased 25,325 equity shares of Chambal Fertilisers and Chemicals Limited through open market transactions, increasing its total shareholding to 34,061 equity shares representing 0.008% of the company's total voting capital. The acquisition was disclosed under SEBI regulations for substantial acquisition of shares, with Birla Real Estate identified as part of the promoter group of Chambal Fertilisers.",
            "Sentiment": "neutral",
            "PublishDate": 1763550372351,
            "Source": "corporate_action"
        },
        {
            "Title": "CM Airtime Promotion LLP Increases Stake in Chambal Fertilisers and Chemicals",
            "Summary": "CM Airtime Promotion LLP purchased 40,000 equity shares of Chambal Fertilisers and Chemicals Ltd on November 14, 2025, increasing their total holding to 445,313 equity shares representing 0.111% of the company's total share capital. The acquisition was disclosed under SEBI regulations for substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1763384764231,
            "Source": "corporate_action"
        },
        {
            "Title": "Chambal Fertilisers Reports 20% PAT Growth in Q2 FY26, TAN Plant Operations to Begin January 2026",
            "Summary": "Chambal Fertilisers achieved revenues of Rs. 6,413 crore and profit after tax of Rs. 602 crore in quarterly results, marking 20% growth, while half-yearly PAT reached Rs. 1,240 crore with 18% growth. The company's Technical Ammonium Nitrate plant with Rs. 1,052 crore investment is progressing on schedule for January 2026 operations, and Crop Protection business showed strong 29% revenue growth at Rs. 374 crore.",
            "Sentiment": "positive",
            "PublishDate": 1763041892424,
            "Source": "earnings"
        },
        {
            "Title": "CM Airtime Promotion LLP Increases Stake in Chambal Fertilisers and Chemicals",
            "Summary": "CM Airtime Promotion LLP purchased 10,000 equity shares of Chambal Fertilisers and Chemicals Ltd on November 12, 2025. Following this acquisition, the company's aggregate shareholding increased to 385,313 equity shares, representing 0.096% of the total share capital. The shares were acquired through open market purchase. The company belongs to the promoter group category and the transaction was disclosed under SEBI regulations for substantial acquisition of shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763027114255,
            "Source": "corporate_action"
        },
        {
            "Title": "CM Airtime Promotion LLP Increases Stake in Chambal Fertilisers and Chemicals",
            "Summary": "CM Airtime Promotion LLP purchased 16,012 equity shares of Chambal Fertilisers and Chemicals Ltd on November 11, 2025, through open market transactions. The acquisition increased the LLP's total shareholding from 359,301 shares (0.090%) to 375,313 shares (0.094%) of the company's total equity capital. The disclosure was made under SEBI regulations for substantial acquisition of shares and takeovers. Chambal Fertilisers has a total equity share capital of 400,652,297 equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1762982358331,
            "Source": "corporate_action"
        },
        {
            "Title": "CMA Airtime Promotion LLP Increases Stake in Chambal Fertilisers and Chemicals",
            "Summary": "CMA Airtime Promotion LLP purchased 40,000 equity shares of Chambal Fertilisers and Chemicals Ltd on November 10, 2025, through open market transactions. The acquisition increased the LLP's total shareholding from 319,301 shares to 359,301 equity shares. The LLP's stake in the company rose from 0.080% to 0.090% of the total share capital. CMA Airtime Promotion LLP belongs to the promoter group of Chambal Fertilisers and Chemicals. The company's total equity share capital stands at Rs. 4,00,65,22,970 comprising 40,065,2297 equity shares. The shares are listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1762885102570,
            "Source": "corporate_action"
        },
        {
            "Title": "CMA Airtime Promotion LLP Increases Stake in Chambal Fertilisers and Chemicals",
            "Summary": "CMA Airtime Promotion LLP purchased 25,000 equity shares of Chambal Fertilisers and Chemicals Ltd on November 7, 2025. Following this acquisition, the company's aggregate shareholding increased to 319,301 equity shares, representing 0.080% of the total voting capital. The purchase was made through open market transactions. Prior to this acquisition, CMA Airtime Promotion LLP held 0.073% of the voting rights in Chambal Fertilisers and Chemicals.",
            "Sentiment": "neutral",
            "PublishDate": 1762835654599,
            "Source": "corporate_action"
        },
        {
            "Title": "Chambal Fertilisers Faces Rs 15.6 Crore Penalty Upheld in CGST Appeal",
            "Summary": "Chambal Fertilisers and Chemicals Limited received an order from the Commissioner (Appeals), Central Goods Services Tax and Central Excise, Jodhpur, upholding a penalty of Rs 15,55,73,914 under Section 74(1) of the CGST Act. The penalty relates to disallowance of transitional credit pertaining to capital goods. The company had already reversed the disputed transitional credit before the show cause notice was issued. Chambal Fertilisers stated it has a good case on merits and will challenge the order before the appropriate forum. The company indicated no impact on financial, operational or other activities except for the penalty amount.",
            "Sentiment": "negative",
            "PublishDate": 1762606381798,
            "Source": "stock"
        },
        {
            "Title": "Chambal Fertilisers Appoints KFin Technologies as New Registrar and Share Transfer Agent",
            "Summary": "Chambal Fertilisers and Chemicals Limited's Board of Directors approved the appointment of KFin Technologies Limited, Hyderabad as the company's new Registrar and Share Transfer Agent to strengthen investor services functions. KFin holds SEBI Registration No: INR000000221. The transition process including formalities for RTA change, electronic connectivity shift, and data transfer will be processed in due course. Until the transition is complete, Zuari Finserv Limited will continue as RTA. A tripartite agreement will be executed between Chambal Fertilisers, KFin, and Zuari Finserv, with the effective date to be communicated separately.",
            "Sentiment": "positive",
            "PublishDate": 1762304008490,
            "Source": "corporate_action"
        },
        {
            "Title": "Chambal Fertilisers And Chemicals Reappoints Anuj Jain As CFO",
            "Summary": "Chambal Fertilisers And Chemicals has reappointed Anuj Jain to the position of Chief Financial Officer.",
            "Sentiment": "neutral",
            "PublishDate": 1762257299379,
            "Source": "corporate_governance"
        },
        {
            "Title": "Chambal Fertilisers Reports 20% Jump in Q2 Net Profit, Declares Interim Dividend",
            "Summary": "Chambal Fertilisers & Chemicals reported quarterly net profit of 6.01 billion rupees compared to 5 billion rupees in the same period last year, marking a 20% increase. Revenue surged 47% to 64.13 billion rupees from 43.5 billion rupees year-on-year. EBITDA rose to 8.45 billion rupees from 7.9 billion rupees, though EBITDA margin compressed to 13.13% from 18.18% in the previous year. The company recommended an interim dividend of 5 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1762255542462,
            "Source": "earnings"
        },
        {
            "Title": "Simon India Limited Files Disclosure Under SEBI Takeover Regulations",
            "Summary": "Simon India Limited submitted a disclosure to BSE Limited and National Stock Exchange of India under Regulation 31(1) and 31(2) of SEBI (Substantial Acquisition of Shares and Takeovers) Regulations 2011. The disclosure was addressed to Chambal Fertilisers and Chemicals Limited and signed by Umesh Sood, Manager at Simon India Limited. The document indicates compliance with securities regulations regarding substantial share acquisitions.",
            "Sentiment": "neutral",
            "PublishDate": 1761833085364,
            "Source": "corporate_action"
        },
        {
            "Title": "Chambal Fertilisers Sets Record Date for Interim Dividend Consideration",
            "Summary": "Chambal Fertilisers and Chemicals Limited has fixed November 11, 2025 as the record date for determining equity shareholders' eligibility for interim dividend payment. The company's Board of Directors is scheduled to meet on November 4, 2025 to consider declaring the interim dividend. Shareholders holding equity shares as of the record date will be eligible for the dividend if approved by the board.",
            "Sentiment": "positive",
            "PublishDate": 1761650423685,
            "Source": "corporate_action"
        },
        {
            "Title": "Chambal Fertilisers Hit with Rs 527 Crore GST Penalty, Plans Appeal",
            "Summary": "Chambal Fertilisers and Chemicals Limited received a penalty order of Rs 5,26,84,73,848 from the Joint Commissioner, CGST & Central Excise, Patna-I. The penalty relates to alleged GST liability on subsidy receivable from the Government of India on fertilisers and wrong availment of Input Tax Credit for FY 18-19 to FY 22-23. The company maintains that under section 15(2)(e) of Central GST Act, subsidy receivable from Government of India is excluded from value of taxable supply and GST is not applicable. Chambal Fertilisers stated it has a strong case on merits and will challenge the order at an appropriate appellate forum. The company indicated no impact on financial, operational or other activities except for the penalty amount.",
            "Sentiment": "negative",
            "PublishDate": 1758959236498,
            "Source": "stock"
        },
        {
            "Title": "CM Airtime Promotion LLP Increases Stake in Chambal Fertilisers to 139,095 Shares",
            "Summary": "CM Airtime Promotion LLP purchased 76,000 equity shares of Chambal Fertilisers and Chemicals Ltd on September 9, 2025. Following this acquisition, the company's total shareholding in Chambal Fertilisers increased to 139,095 equity shares, representing 0.035% of the company's equity. The transaction was disclosed in compliance with SEBI regulations regarding substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1757494661490,
            "Source": "stock"
        },
        {
            "Title": "Chambal Fertilisers Approves Key Leadership Appointments at 40th Annual General Meeting",
            "Summary": "Chambal Fertilisers and Chemicals Limited shareholders approved several key appointments at their 40th Annual General Meeting held on August 26, 2025. Mr. Abhay Baijal was reappointed as Managing Director for three years from July 21, 2025 to July 28, 2028. Mrs. Rita Menon was reappointed as Independent Director for a second five-year term from September 10, 2025 to September 09, 2030. Dr. Rakesh Jain was appointed as Independent Director for five years from July 15, 2025 to July 14, 2030. The company also appointed M/s. RMG & Associates as Secretarial Auditor for five consecutive years. All appointed directors are confirmed to be non-relatives of existing directors and are not debarred from holding directorial positions.",
            "Sentiment": "positive",
            "PublishDate": 1756222480410,
            "Source": "corporate_governance"
        },
        {
            "Title": "Chambal Fertilisers Reports 16% Standalone PAT Growth in Q1 FY26, Expands Crop Protection Portfolio",
            "Summary": "Chambal Fertilisers and Chemicals Limited reported standalone revenue of Rs. 5,698 crore for Q1 FY26, with EBITDA of Rs. 929 crore and profit after tax of Rs. 638 crore, representing 16% year-on-year growth. Consolidated PAT grew 23% to Rs. 549 crore. Urea production declined to 8.54 lakh metric tons from 9.03 lakh metric tons due to breakdown in Gadepan-II plant, which was down for approximately 24-25 days in May. P&K fertiliser sales surged 70% to 4.21 lakh metric tons driven by strategic sourcing and subsidy framework. The company's CPC-SN business grew 32% with revenues of Rs. 452 crore, introducing 13 new crop protection products. Chambal launched seed business with maize and bajra seeds contributing Rs. 6 crore revenue. The Technical Ammonium Nitrate project has spent Rs. 918 crore of total Rs. 1,645 crore budget, with trial production expected in late November/early December and commercial production by mid-January. Joint venture IMACID is expanding phosphoric acid capacity from 5 lakh tons to 7 lakh tons. The company maintains net cash of Rs. 1,600 crore and subsidy outstanding of Rs. 1,326 crore.",
            "Sentiment": "positive",
            "PublishDate": 1754573304081,
            "Source": "earnings"
        },
        {
            "Title": "Chambal Fertilisers Plans to Double Crop Protection Business by FY27",
            "Summary": "Chambal Fertilisers aims to double its crop protection and specialty nutrients business by FY27. The company's growth strategy includes launching 18 new products, entering the seeds segment, and completing a ₹1,645 crore capital expenditure program. The expansion focuses on sustainable, high-profit business-to-consumer agricultural growth.",
            "Sentiment": "positive",
            "PublishDate": 1753972196608,
            "Source": "stock"
        },
        {
            "Title": "Chambal Fertilisers Reports 16% Growth in Q1 Net Profit to 6.4 Billion Rupees",
            "Summary": "Chambal Fertilisers & Chemicals reported Q1 net profit of 6.4 billion rupees, up from 5.5 billion rupees in the same period last year. Revenue increased to 57 billion rupees from 49 billion rupees year-over-year. EBITDA rose slightly to 7.61 billion rupees from 7.52 billion rupees, though EBITDA margin declined to 13.36% from 15.24% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753961218542,
            "Source": "earnings"
        },
        {
            "Title": "Chambal Fertilisers Sets Record Date for Rs. 5 Final Dividend",
            "Summary": "Chambal Fertilisers and Chemicals Limited has set August 5, 2025 as the record date for determining shareholder eligibility for a final dividend of Rs. 5.00 per equity share. The dividend payment is subject to approval at the Annual General Meeting scheduled for August 26, 2025 at 10:30 AM. The company trades on BSE with security code 500085 and on NSE with symbol CHAMBLFERT.",
            "Sentiment": "positive",
            "PublishDate": 1753447904632,
            "Source": "corporate_action"
        },
        {
            "Title": "Chambal Fertilisers & Chemicals Q4 Results and Dividend Announcement",
            "Summary": "Chambal Fertilisers & Chemicals reported its Q4 results with a net profit of 997.1 million rupees, up from 862 million rupees year-over-year. Revenue decreased to 24.49 billion rupees from 26.4 billion rupees. EBITDA remained relatively stable at 1.64 billion rupees, with a slight improvement in EBITDA margin to 6.68%. The company also recommended a final dividend of 5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746708407000,
            "Source": "result"
        },
        {
            "Title": "Chambal Fertilisers to Consider Q4 Results on May 8",
            "Summary": "Chambal Fertilisers and Chemicals Limited has announced that it will consider its fourth quarter (Q4) financial results on May 8. This announcement indicates the company's scheduled board meeting to review and approve the financial performance for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1745585579000,
            "Source": "default"
        },
        {
            "Title": "Indian Government Extends Urea Import Permission for Chambal Fertilisers",
            "Summary": "The Indian government has extended permission for Chambal Fertilisers and Chemicals to import urea through India Potash Limited until March 2026. This extension allows the company to continue securing urea supplies for its operations.",
            "Sentiment": "positive",
            "PublishDate": 1742356034000,
            "Source": "corporate_action"
        },
        {
            "Title": "Chambal Fertilisers Clarifies No Gas Leak at Kota Plant",
            "Summary": "Chambal Fertilisers has issued a clarification regarding reports of a gas leak at its Kota plant. The company firmly states that there has been no gas or chemical leakage from the facility. This statement appears to be in response to circulating reports or rumors about a potential leak, which the company is now refuting.",
            "Sentiment": "neutral",
            "PublishDate": 1739761981000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Chambal Fertilisers & Chemicals Reports Improved Q3 EBITDA and Margin",
            "Summary": "Chambal Fertilisers & Chemicals has reported its Q3 financial results. The company's EBITDA increased to 7.9 billion rupees, up from 6.3 billion rupees in the same quarter last year. Additionally, the EBITDA margin improved to 16%, compared to 14.45% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738827621000,
            "Source": "earnings"
        },
        {
            "Title": "Chambal Fertilisers & Chemicals Reports Q3 Revenue Increase",
            "Summary": "Chambal Fertilisers & Chemicals has reported a revenue of 49.2 billion rupees for the third quarter, compared to 43.5 billion rupees in the same period last year. This represents a year-over-year increase in revenue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1738827596000,
            "Source": "earnings"
        },
        {
            "Title": "Chambal Fertilisers & Chemicals Reports 25% Increase in Q3 Net Profit",
            "Summary": "Chambal Fertilisers & Chemicals has announced its financial results for the third quarter, reporting a net profit of 5 billion rupees. This represents a significant increase from the 4 billion rupees net profit reported in the same quarter of the previous year, indicating a year-over-year growth of 25%.",
            "Sentiment": "positive",
            "PublishDate": 1738827575000,
            "Source": "earnings"
        },
        {
            "Title": "Chambal Fertilisers Secures 992 Crore Rupee Order",
            "Summary": "Chambal Fertilisers has won a significant order valued at 992 crore rupees. This substantial contract is likely to boost the company's revenue and potentially its market position in the fertiliser industry.",
            "Sentiment": "positive",
            "PublishDate": 1737526341000,
            "Source": "order&deals"
        },
        {
            "Title": "Chambal Fertilisers Declares Interim Dividend",
            "Summary": "Chambal Fertilisers & Chemicals has announced an interim dividend of 5 rupees per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1730893478000,
            "Source": "corporate_action"
        },
        {
            "Title": "Chambal Fertilisers & Chemicals Reports Strong Q2 Financial Performance",
            "Summary": "Chambal Fertilisers & Chemicals has reported significant year-over-year improvements in its Q2 financial results. The company's EBITDA increased from 6.15 billion rupees to 7.9 billion rupees. Additionally, the EBITDA margin expanded from 11.42% to 18.18%, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1730893370000,
            "Source": "result"
        },
        {
            "Title": "Chambal Fertilisers & Chemicals Reports Q2 Profit Increase",
            "Summary": "Chambal Fertilisers & Chemicals has reported a significant increase in its Q2 net profit, rising to 5 billion rupees from 3.72 billion rupees year-over-year. This represents a 34.4% increase. However, the company's Q2 revenue decreased to 43.5 billion rupees from 53.85 billion rupees in the same period last year, marking a 19.2% decline.",
            "Sentiment": "positive",
            "PublishDate": 1730893274000,
            "Source": "result"
        }
    ]
}