{
    "Symbol": "CHEMCON",
    "ISIN": "INE03YM01018",
    "News": [
        {
            "Title": "Chemcon Board Meet Set for Feb 12 to Review Q3 Results",
            "Summary": "Chemcon Speciality Chemicals has scheduled its board meeting for February 12, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770384366268,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chemcon Speciality Chemicals: Promoter Group Completes Inter-se Share Transfer",
            "Summary": "Naresh Vijaykumar Goyal acquired 62,33,500 equity shares (17.02% of diluted share capital) of Chemcon Speciality Chemicals through an off-market gift transfer from promoter Navdeep Naresh Goyal. The inter-se transfer within the promoter group maintains overall shareholding control unchanged, with Naresh Goyal's stake increasing from 8.29% to 25.30%.",
            "Sentiment": "neutral",
            "PublishDate": 1765275399503,
            "Source": "corporate_action"
        },
        {
            "Title": "Chemcon Speciality Chemicals: Promoter Group Member to Acquire 62.33 Lakh Shares via Gift Transfer",
            "Summary": "Naresh Vijaykumar Goyal, a promoter group member of Chemcon Speciality Chemicals Limited, will acquire 62,33,500 equity shares (17.0171% of total paid-up capital) as a gift from promoters Navdeep Naresh Goyal and Shubharangana Naresh Goyal on or after December 1, 2025. The inter-se transfer among immediate relatives is exempt from open offer requirements, with Naresh Goyal's shareholding increasing from 8.2877% to 25.3048% while overall promoter group holding remains unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1763982470295,
            "Source": "corporate_action"
        },
        {
            "Title": "Chemcon Specialty Chemicals Reports 2% YoY Growth in Q2FY26, Acquires Shivam Petrochem for ₹36 Crore",
            "Summary": "Chemcon Specialty Chemicals posted revenue of ₹53 crore in Q2FY26 with 2% YoY growth and ₹107 crore in H1FY26 with 9% YoY growth, driven by steady demand in Organic Chemicals despite weak pharma offtake and pricing pressures from global dumping. The company acquired Shivam Petrochem Industries' entire business for ₹36 crore through slump sale to strengthen product portfolio and accelerate growth, while new manufacturing units P-10 and P-11 construction progresses slowly.",
            "Sentiment": "negative",
            "PublishDate": 1763195296027,
            "Source": "earnings"
        },
        {
            "Title": "Chemcon Speciality Chemicals Completes INR 36 Crore Acquisition of Shivam Petrochem Industries",
            "Summary": "Chemcon Speciality Chemicals Limited has entered into a Slump Sale Agreement with Shivam Petrochem Industries for the acquisition of its entire business undertaking for INR 36 crores. The Board of Directors approved the proposal on August 5, 2025, and shareholders approved the material related party transaction at the 36th Annual General Meeting held on September 11, 2025. The agreement was executed on October 18, 2025, with Shivam Petrochem Industries being a partnership firm that forms part of the Promoter Group. The acquisition involves the sale of business on a going concern basis through slump sale.",
            "Sentiment": "positive",
            "PublishDate": 1760785294765,
            "Source": "order&deals"
        },
        {
            "Title": "Chemcon Speciality Chemicals Reports 18% Revenue Growth in Q1 FY26 at ₹54 Cr",
            "Summary": "Chemcon Speciality Chemicals recorded revenue of ₹54 crores in Q1 FY26, marking an 18% year-on-year growth from ₹45.5 crores in Q1 FY25. The company's profit after tax increased 19% to ₹6.4 crores compared to ₹5.4 crores in the previous year quarter. EBITDA grew 8% to ₹7.7 crores. The Organic Chemicals segment, including HMDS, CMIC, and Bromobenzene, showed steady demand recovery, though pricing remained moderated due to supply from China. The Inorganic Chemicals segment faced challenges from reduced oil drilling activities caused by crude oil price volatility and global instability. Sales volume increased to 2,416 MT from 2,097 MT in Q1 FY25. The company is constructing P-10 and P-11 plants to manufacture new products, with completion expected in Q3 FY26. Export contribution was 22% while domestic sales comprised 78% of revenue. PAT margin remained stable at 11.9% compared to 11.8% in the previous year quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754567611944,
            "Source": "stock"
        },
        {
            "Title": "Chemcon Speciality Chemicals Approves Acquisition of Shivam Petrochem Industries for Up to INR 100 Crore",
            "Summary": "Chemcon Speciality Chemicals Limited's board approved the acquisition of the entire business undertaking of Shivam Petrochem Industries through slump sale, subject to shareholder approval. Shivam Petrochem Industries is a partnership firm incorporated in 2002, engaged in manufacturing, processing, and distribution of bulk drugs, chemicals, and pharmaceutical intermediaries. The company reported a turnover of INR 26.46 crore for FY 2024-25, showing growth from INR 9.55 crore in FY 2023-24 and INR 3.27 crore in FY 2022-23. The transaction is a related party deal as Shivam Petrochem is part of the promoter group, with promoters holding 42.50%, 27.50%, and 15.00% stakes respectively. The total consideration will not exceed INR 100 crore, to be paid in cash. The acquisition aims to enable strategic expansion by acquiring a complementary business on a going concern basis, ensuring operational continuity and creating cost efficiencies. The transaction is expected to complete by December 31, 2025, with no government or regulatory approvals required.",
            "Sentiment": "positive",
            "PublishDate": 1754407304743,
            "Source": "order&deals"
        },
        {
            "Title": "Chemcon Speciality Chemicals Appoints Neel Shah as Independent Director",
            "Summary": "Chemcon Speciality Chemicals Limited appointed Mr. Neel Snehalkumar Shah as an Additional Director (Non-Executive & Independent) for a 5-year term effective August 5, 2025. The appointment is subject to shareholder approval. Mr. Shah is a Chartered Accountant with over eight years of professional experience and currently serves as Head of Operations at a printing sector organization since 2016. He also serves as an Independent Director on the board of a public healthcare company. Shah brings expertise in financial management, taxation, auditing, and corporate governance. He has no relationships with other directors of the company and is not debarred from holding directorship by any regulatory authority.",
            "Sentiment": "positive",
            "PublishDate": 1754404645508,
            "Source": "corporate_governance"
        },
        {
            "Title": "Chemcon Speciality Chemicals Reports Quarterly Results, Approves Acquisition and Board Appointment",
            "Summary": "Chemcon Speciality Chemicals Ltd's Board approved unaudited financial results for the quarter ended June 30, 2025, showing revenue from operations of Rs 5,488.76 lakhs and net profit of Rs 638.71 lakhs. The company reported earnings per share of Rs 1.74. The Board approved the acquisition of Shivam Petrochem Industries' entire business through slump sale for consideration not exceeding Rs 100 crore, subject to shareholder approval. Shivam Petrochem, a related party partnership firm, reported turnover of Rs 26.46 crore for FY 2024-25 and operates in chemicals manufacturing and distribution. The Board appointed Mr. Neel Snehalkumar Shah as Additional Director (Non-Executive & Independent) for a 5-year term effective August 5, 2025, pending shareholder approval. The company scheduled its 36th Annual General Meeting for September 11, 2025, via video conferencing.",
            "Sentiment": "positive",
            "PublishDate": 1754398444410,
            "Source": "earnings"
        },
        {
            "Title": "Chemcon Speciality Chemicals Reports Q4 Financial Results",
            "Summary": "Chemcon Speciality Chemicals announced its Q4 financial results. The company's EBITDA increased to 58 million rupees from 44 million rupees year-over-year, with EBITDA margin improving to 10.53% from 7.36%. Net profit rose to 39 million rupees from 29 million rupees year-over-year, but decreased from 88 million rupees quarter-over-quarter. Revenue for Q4 was 549 million rupees, down from 596 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747225719000,
            "Source": "result"
        },
        {
            "Title": "Chemcon Speciality Chemicals Reports Significant Q3 EBITDA Growth",
            "Summary": "Chemcon Speciality Chemicals has reported a substantial increase in its Q3 EBITDA, rising to 113 million rupees from 63 million rupees in the same quarter last year. The company's EBITDA margin also improved significantly, reaching 20.75% compared to 11.97% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739366247000,
            "Source": "earnings"
        },
        {
            "Title": "Chemcon Speciality Chemicals Reports Strong Q3 Profit Growth",
            "Summary": "Chemcon Speciality Chemicals has reported a significant increase in net profit for the third quarter. The company's net profit rose to 88 million rupees, up from 44 million rupees year-over-year and 63 million rupees quarter-over-quarter. Revenue for Q3 also saw a slight increase to 544 million rupees from 530 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739366181000,
            "Source": "earnings"
        },
        {
            "Title": "Chemcon Speciality Chemicals Plans Product Expansion",
            "Summary": "Chemcon Speciality Chemicals aims to launch new products at their P-10 unit by the end of FY25 and P-11 unit by Q1 FY26, both located in Manjusar. These new products will primarily serve pharmaceutical applications, aligning with the company's strategy to diversify and reduce portfolio risk.",
            "Sentiment": "positive",
            "PublishDate": 1730215397000,
            "Source": "corporate_action"
        },
        {
            "Title": "Chemcon Speciality Chemicals Reports Q2 Financial Results",
            "Summary": "Chemcon Speciality Chemicals has reported its Q2 financial results. The company's net profit increased to 63 million rupees, up from 59 million rupees year-over-year and 54 million rupees quarter-over-quarter. However, revenue decreased to 526 million rupees from 752 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730118288000,
            "Source": "result"
        }
    ]
}