{
    "Symbol": "CHEMPLASTS",
    "ISIN": "INE488A01050",
    "News": [
        {
            "Title": "Chemplast Sanmar Q3 FY26 Results Show Challenges",
            "Summary": "Chemplast Sanmar reports consolidated revenue of ₹835 crore in Q3 FY26, down 21% YoY, with EBITDA loss of ₹57 crore amid pricing pressures across segments.",
            "Sentiment": "negative",
            "PublishDate": 1770836555807,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chemplast Sanmar Board Meet Set for Feb 7, 2026",
            "Summary": "Chemplast Sanmar Limited has scheduled a board meeting on February 7, 2026, to approve Q3FY26 unaudited financial results. Trading window remains closed until February 10, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770031715123,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chemplast Sanmar Board Approves Key Leadership Changes",
            "Summary": "Chemplast Sanmar's board approved the reappointment of Ramkumar Shankar as Managing Director for two months and appointed S Ganeshkumar as new MD from April 2026, alongside reappointing four independent directors for second terms.",
            "Sentiment": "neutral",
            "PublishDate": 1768030853082,
            "Source": "stocks"
        },
        {
            "Title": "Chemplast Sanmar Board Approves Key Leadership Changes",
            "Summary": "Chemplast Sanmar's board approved reappointment of Managing Director Ramkumar Shankar for 2 months, appointment of S Ganeshkumar as new MD from April 2026, and reappointment of four independent directors for second terms.",
            "Sentiment": "neutral",
            "PublishDate": 1768030563274,
            "Source": "stocks"
        },
        {
            "Title": "Chemplast Sannar Reports Sequential Recovery with Revenue of INR 1,033 Crores in Q2FY26",
            "Summary": "Chemplast Sannar achieved quarterly revenue of INR 1,033 crores and EBITDA of INR 43 crores, showing marked improvement both quarter-on-quarter and year-on-year, driven by better margins in Suspension PVC business and higher volumes from new Paste PVC plant at Cuddalore running at full capacity. The company faces ongoing challenges from Chinese dumping in PVC markets and awaits clarity on anti-dumping duty implementation, while progressing with expansion plans in Custom Manufactured Chemicals Division and refrigerant gas projects.",
            "Sentiment": "neutral",
            "PublishDate": 1763728683301,
            "Source": "earnings"
        },
        {
            "Title": "Chemplast Sanmar Plans Capacity Expansion With Focus on High-Margin Specialty Products",
            "Summary": "Chemplast Sanmar is pursuing steady growth through new projects at Cuddalore and Mettur facilities to expand PVC and CPVC capacity, focusing on high-margin specialty polymers and piping systems. The company's strategy includes backward integration and value-added chemicals development to support EBITDA margin expansion and improve cash flow visibility.",
            "Sentiment": "positive",
            "PublishDate": 1763052463956,
            "Source": "earnings"
        },
        {
            "Title": "Chemplast Sanmar Reports Loss of Rs 115.29 Crores in Q2 FY2025",
            "Summary": "Chemplast Sanmar Limited posted a consolidated net loss of Rs 115.29 crores for the quarter ended September 30, 2025, compared to a loss of Rs 37 crores in the same period last year, with revenue declining to Rs 2,033.20 crores from Rs 2,137.64 crores. The specialty chemicals manufacturer's standalone operations also showed losses of Rs 110.60 crores for the quarter, reflecting continued operational challenges across both business segments.",
            "Sentiment": "negative",
            "PublishDate": 1763046386976,
            "Source": "earnings"
        },
        {
            "Title": "Chemplast Sanmar Reports Strong Q2 EBITDA Growth",
            "Summary": "Chemplast Sanmar reported Q2 EBITDA of 540 million rupees, representing significant growth from 260 million rupees in the same period last year. The company's EBITDA margin improved to 5.23% compared to 2.6% year-over-year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1763037160318,
            "Source": "earnings"
        },
        {
            "Title": "Chemplast Sanmar Schedules Earnings Call for Q2 H1 FY26 Results",
            "Summary": "Chemplast Sanmar Limited has announced an earnings conference call scheduled for Friday, November 14, 2025, at 12:00 PM IST to discuss the company's operational and financial performance for Q2 H1 FY26. The call will be attended by key executives including Managing Director Ramkumar Shankar, Chief Financial Officer N Muralidharan, and Business Head Krishna Kumar Rangachari. The company has provided multiple dial-in numbers for domestic and international participants, along with a pre-registration link for the call.",
            "Sentiment": "neutral",
            "PublishDate": 1762841530332,
            "Source": "earnings"
        },
        {
            "Title": "Chemplast Sanmar Reports INR 1,100 Crore Revenue with INR 17 Crore EBITDA in Q1 FY26",
            "Summary": "Chemplast Sanmar Limited achieved revenue of INR 1,100 crores and EBITDA of INR 17 crores in Q1 FY26, compared to INR 1,145 crores revenue in the previous year. The company reported a net loss of INR 64 crores for the quarter. Revenue declined 4% year-on-year due to lower PVC realizations and reduced Caustic Soda volumes, partially offset by higher Suspension PVC volumes. The company faced pricing pressures from dumping of Paste PVC from Europe and Suspension PVC from China. Specialty Chemical revenue remained flat at INR 355 crores, while Suspension PVC revenue was INR 646 crores. The new Paste PVC plant in Cuddalore has reached full operating capacity. Anti-dumping duty investigations are ongoing for European Union and Japan for Paste PVC, with final findings expected by end of calendar year. For Suspension PVC, final anti-dumping duty findings are expected soon following disclosure statement issuance. The company sold 92,849 tons of Suspension PVC during the quarter, representing 17% quarter-on-quarter growth. Construction of multipurpose blocks MPB 3 Phase 3 and MPB 4 are progressing as planned with completion expected by Q3. Environmental clearance has been received for the R32 refrigerant gas project.",
            "Sentiment": "neutral",
            "PublishDate": 1754398478818,
            "Source": "earnings"
        },
        {
            "Title": "Chemplast Sanmar Makes Earnings Call Audio Recording Available Following Quarterly Results",
            "Summary": "Chemplast Sanmar Limited conducted an earnings call on July 29, 2025, following the release of their unaudited financial results for the quarter ended June 30, 2025. The company has made the audio recording of this earnings call available on their website. The call was held at 6:05 PM IST and covered both standalone and consolidated financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1753795158521,
            "Source": "earnings"
        },
        {
            "Title": "Chempplast Sanmar Reports Strong Outlook for PVC Products Amid Automobile Industry Recovery",
            "Summary": "Chempplast Sanmar expects a strong future outlook for its Paste PVC and Suspension PVC products. The company anticipates steady demand and is seeing positive signs from the automobile industry, which could benefit its PVC business segments.",
            "Sentiment": "positive",
            "PublishDate": 1753716168773,
            "Source": "stock"
        },
        {
            "Title": "Chemplast Sanmar Reports Q1 FY'26 Results with Revenue of Rs 1,100 Crores",
            "Summary": "Chemplast Sanmar Limited reported quarterly results with revenue from operations of Rs 1,100 crores, compared to Rs 1,145 crores in the previous quarter and Rs 1,151 crores in the same quarter last year. EBITDA declined to Rs 17 crores from Rs 37 crores in the previous quarter and Rs 124 crores year-on-year. The company posted a net loss of Rs 64 crores compared to a loss of Rs 54 crores in the previous quarter and a profit of Rs 24 crores in the corresponding quarter last year. The company faced continued pricing pressure during the quarter due to persistent dumping of Paste PVC and Suspension PVC products. Management noted that caustic soda prices remained firm during the quarter, while chloromethanes and hydrogen peroxide prices were stable. The company has been building capacity in specialty businesses and expects medium to long-term outlook for both Paste PVC and Suspension PVC to remain strong.",
            "Sentiment": "negative",
            "PublishDate": 1753716135082,
            "Source": "earnings"
        },
        {
            "Title": "Chemplast Sanmar Reports Sharp Decline in Q1 EBITDA and Margins",
            "Summary": "Chemplast Sanmar reported Q1 EBITDA of 171 million rupees compared to 1.24 billion rupees in the same period last year, representing a significant year-over-year decline. The company's EBITDA margin also dropped substantially to 1.55% from 10.84% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1753713402124,
            "Source": "earnings"
        },
        {
            "Title": "Chemplast Sanmar Reports Quarterly Loss of 643 Million Rupees",
            "Summary": "Chemplast Sanmar posted a consolidated net loss of 643 million rupees in its latest quarterly results, compared to a profit of 239 million rupees in the same period last year. The company's revenue declined to 11 billion rupees from 11.44 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1753712878372,
            "Source": "earnings"
        },
        {
            "Title": "Chemplast Sanmar Schedules Q1 FY26 Earnings Call for July 29, 2025",
            "Summary": "Chemplast Sanmar Limited has announced an earnings conference call scheduled for Tuesday, July 29, 2025 at 11:00 AM IST to discuss the operational and financial performance of Q1 FY26. The call will feature key executives including Managing Director Ramkumar Shankar, Chief Financial Officer N Muralidharan, and Business Head of Custom Manufactured Chemicals Division Dr. Krishna Kumar Rangachari. The company has provided access numbers for participation and noted that changes may occur due to exigencies.",
            "Sentiment": "neutral",
            "PublishDate": 1753364338521,
            "Source": "earnings"
        },
        {
            "Title": "Chemplast Sanmar Reports Q4 FY2023 Financial Results",
            "Summary": "Chemplast Sanmar has released its Q4 FY2023 financial results. The company's EBITDA increased to 367.3 million rupees from 210 million rupees year-over-year, with EBITDA margin improving to 3.19% from 2%. Revenue rose to 11.51 billion rupees from 10.51 billion rupees. However, the consolidated net loss widened to 541.7 million rupees, compared to a loss of 311 million rupees in the same quarter last year and a loss of 488.2 million rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747150342000,
            "Source": "result"
        },
        {
            "Title": "Chemplast Sanmar to Acquire Shares in JSW Green Energy Nine for Renewable Power Plants",
            "Summary": "Chemplast Sanmar is set to acquire equity shares in JSW Green Energy Nine, which will establish renewable power plants in Tamil Nadu. The acquisition cost is reported to be 213.8 million rupees for Chemplast Sanmar and 90.5 million rupees for its unit.",
            "Sentiment": "positive",
            "PublishDate": 1740702182000,
            "Source": "corporate_action"
        },
        {
            "Title": "Chemplast Sanmar: Acquiring Stake in JSW Green Energy Nine for Renewable Power",
            "Summary": "Chemplast Sanmar and its subsidiary CCVL are acquiring a combined 26.27% stake in JSW Green Energy Nine Ltd for ₹30.43 crore. This follows a Power Purchase Agreement to source renewable energy, aiming to reduce carbon emissions and lower energy costs.",
            "Sentiment": "positive",
            "PublishDate": 1740679602000,
            "Source": "corporate_action"
        },
        {
            "Title": "Chemplast Sanmar Reports Reduced Q3 Net Loss and Increased Revenue",
            "Summary": "Chemplast Sanmar has reported its Q3 financial results. The company's consolidated net loss decreased to 488 million rupees, compared to a loss of 894 million rupees in the same quarter last year. Revenue for Q3 increased to 11 billion rupees from 8.9 billion rupees year-over-year, showing significant growth.",
            "Sentiment": "positive",
            "PublishDate": 1739146449000,
            "Source": "earnings"
        },
        {
            "Title": "Chemplast Sanmar Initiates Commercial Production at Berigai Chemicals Division",
            "Summary": "Chemplast Sanmar has announced the commencement of commercial production from a new block at its Chemicals Division located in Berigai. This development indicates an expansion of the company's production capabilities and potentially signals growth in its operations.",
            "Sentiment": "positive",
            "PublishDate": 1734654875000,
            "Source": "corporate_action"
        },
        {
            "Title": "Chemplast Sanmar: Q2 Results Show Potential PVC Market Normalization",
            "Summary": "ICICI Securities reports that corrective measures in the PVC market may help normalize spreads for Chemplast Sanmar, as indicated in their Q2 results.",
            "Sentiment": "neutral",
            "PublishDate": 1730963201000,
            "Source": "result"
        },
        {
            "Title": "Chemplast Sanmar Reports Q2 Net Loss of 312.6 Million Rupees",
            "Summary": "Chemplast Sanmar, a chemical manufacturing company, has reported a consolidated net loss of 312.6 million rupees for the second quarter, compared to a profit of 260 million rupees in the same period last year. This represents a significant downturn in the company's financial performance. However, the company's revenue remained relatively stable at 9.92 billion rupees, compared to 9.9 billion rupees in the previous year. Sequentially, the company's performance has also declined from a profit of 239 million rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1730853152000,
            "Source": "result"
        }
    ]
}