{
    "Symbol": "CHEMFAB",
    "ISIN": "INE783X01023",
    "News": [
        {
            "Title": "Chemfab Alkalis Board Meet Set for Jan 28, 2026",
            "Summary": "Chemfab Alkalis Limited has scheduled a board meeting on January 28, 2026, to consider Q3FY26 unaudited financial results. Trading window remains closed from January 1-30, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769065912029,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chemfab Alkalis Commissions New Ineos Electrolyser",
            "Summary": "Chemfab Alkalis Ltd successfully commissioned new Ineos electrolyser replacing 30-year-old equipment with ₹57 crore investment. Company expects enhanced operating rates and power savings from Q4 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1767677771103,
            "Source": "stocks"
        },
        {
            "Title": "Chemfab Alkalies Subsidiary Changes Name to Chemfab Karaikal Limited",
            "Summary": "Chemfab Alkalies Limited's wholly owned subsidiary has changed its name from Chemfab Alkalies Karaikal Limited to Chemfab Karaikal Limited with effect from December 3, 2025. The name change was approved by the Registrar of Companies, Central Processing Centre and has been communicated to stock exchanges BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1764761507164,
            "Source": "corporate_action"
        },
        {
            "Title": "Chemfab Alkalis Incorporates Wholly Owned Subsidiary for OPVC Pipes Manufacturing",
            "Summary": "Chemfab Alkalis Limited has incorporated a wholly owned subsidiary, Chemfab Hiitech Piping Limited, with an investment of Rs. 5 lakh for manufacturing and trading OPVC pipes and fittings. The subsidiary was registered in Tamil Nadu on October 28, 2025, and will serve agricultural, engineering, electrical and mechanical industries.",
            "Sentiment": "positive",
            "PublishDate": 1763128745259,
            "Source": "corporate_action"
        },
        {
            "Title": "Chemfab Alkalis CEO Amends Trading Plan to Include Price Details for Share Sale",
            "Summary": "Chemfab Alkalis Limited disclosed an amended trading plan for CEO V.M. Srinivasan. The original plan was approved on November 12, 2024, but required amendment to include price action details that were initially missed. Srinivasan, who holds 259,606 equity shares, plans to sell 95,000 shares during the trading period from March 13, 2025 to March 30, 2026. The sale is intended for funding further ESOP and personal needs. The price range has been set between the closing price on the day before submission and up to 20% lower than that closing price. The amended plan maintains all other terms and conditions from the original November 2024 submission.",
            "Sentiment": "neutral",
            "PublishDate": 1762892455766,
            "Source": "corporate_governance"
        },
        {
            "Title": "Chemfab Alkalis Limited Updates Insider Trading Code and Fair Disclosure Policies",
            "Summary": "Chemfab Alkalis Limited's Board of Directors approved and amended the company's Code of Conduct to regulate, monitor and report trading by designated persons and Code of Practices and Procedures for Fair Disclosure of Unpublished Price Sensitive Information. The amended code becomes effective from October 31, 2025. The policy applies to all employees and connected persons who have access to unpublished price sensitive information. Key provisions include trading window restrictions, pre-clearance requirements for transactions exceeding Rs. 10 lakhs or 10,000 shares per quarter, mandatory disclosures by designated persons, and disciplinary actions for violations including profit recovery and potential termination.",
            "Sentiment": "neutral",
            "PublishDate": 1762201055882,
            "Source": "corporate_action"
        },
        {
            "Title": "Chemfab Alkalis Reports Net Loss of Rs 159.22 Lakhs in Q2 FY2026",
            "Summary": "Chemfab Alkalis Limited reported a net loss of Rs 159.22 lakhs for the quarter ended September 30, 2025, compared to a profit of Rs 539.40 lakhs in the previous quarter and Rs 204.72 lakhs in the corresponding quarter of the previous year. Revenue from operations declined to Rs 7,040.51 lakhs from Rs 8,738.10 lakhs in the preceding quarter. For the half-year period, the company posted a net profit of Rs 698.62 lakhs compared to Rs 727.61 lakhs in the previous year. The company operates in two segments: Chemicals and Related Products, and PVC-O Pipes. The board also approved the allotment of 6,000 equity shares under the employee stock option scheme. The company has classified assets worth Rs 2,165 lakhs as held for sale related to Salt Division 2, with the sale expected to be completed before the financial year end.",
            "Sentiment": "negative",
            "PublishDate": 1761917741882,
            "Source": "earnings"
        },
        {
            "Title": "Chemfab Alkalis Reports Mixed Quarterly Results Amid Challenging Operating Environment",
            "Summary": "Chemfab Alkalis Limited submitted its investor presentation for the quarter ended June 30, 2025. The company faced a challenging operating environment with softer global caustic prices, as ECU realization declined from ₹42,386/MT in Q4FY25 to ₹40,955/MT in Q1FY26. In the OPVC segment, market demand remained muted with no major uptick in Central Government fund flows towards the Jal Jeevan Mission. The company undertook planned maintenance for recoating and re-membraning of elements, which impacted production. Both factors affected the company's top line and bottom line for the quarter. Chemfab operates two business segments: a Chlor-Alkali division with 65,700 TPA caustic soda capacity and an OPVC pipes division with 14,000 TPA capacity. The company is expanding OPVC capacity to 23,000 TPA with the 5th line expected in Q2FY26. Two significant capex projects - technology modernization (₹60 crore) and hybrid power sourcing (₹15 crore) - are progressing and expected to be completed in Q2FY26, with anticipated cost savings and improved profitability starting Q3FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1754025549911,
            "Source": "earnings"
        },
        {
            "Title": "Chemfab Alkalis Reports Mixed Q1 Results with Director Resignation and ESOP Allotment",
            "Summary": "Chemfab Alkalis Limited reported quarterly results for the period ended June 30, 2025, with standalone net profit of Rs 539.40 lakhs compared to Rs 393.06 lakhs in the previous quarter and Rs 332.89 lakhs in the same quarter last year. Revenue from operations stood at Rs 8,758.10 lakhs versus Rs 8,784.59 lakhs in the preceding quarter. On a consolidated basis, the company posted a net profit of Rs 254.76 lakhs against a loss of Rs 915.63 lakhs in the previous quarter. The board approved allotment of 4,000 ESOP shares of Rs 10 each to employees and amendments to the CAESOS 2020 scheme. C.S. Ramesh resigned as Non-Executive and Non-Independent Director effective July 31, 2025, leading to reconstitution of various board committees. The company operates in two segments: Chemicals and Related Products, and PVC-O Pipes, with the latter showing stronger performance.",
            "Sentiment": "neutral",
            "PublishDate": 1753968396624,
            "Source": "earnings"
        },
        {
            "Title": "Chemfab Alkalis Reports Strong Q1 Performance with 178% Jump in Net Profit",
            "Summary": "Chemfab Alkalis delivered robust quarterly results with consolidated net profit surging to 25 million rupees from 9 million rupees in the same period last year. Revenue grew to 915 million rupees compared to 765 million rupees year-over-year. The company's EBITDA increased to 113 million rupees from 83 million rupees, while EBITDA margin improved to 12.34% from 10.88% in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753967778757,
            "Source": "earnings"
        },
        {
            "Title": "Chemfab Alkalis Schedules Board Meeting for July 31 to Approve Quarterly Financial Results",
            "Summary": "Chemfab Alkalis Limited has scheduled a Board of Directors meeting on July 31, 2025, at 12:00 P.M. to consider and approve the unaudited financial results for the quarter ended June 30, 2025. The company has implemented a trading window closure for directors, designated employees, other insiders, and their relatives from July 1, 2025, until August 2, 2025, which extends 48 hours after the declaration of the quarterly financial results. The trading window closure is in accordance with the company's Code of Prevention of Insider Trading and SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1753438873001,
            "Source": "corporate_action"
        },
        {
            "Title": "Chemfab Alkalis Recommends Dividend",
            "Summary": "Chemfab Alkalis has recommended a dividend of 1.25 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1747233943000,
            "Source": "result"
        },
        {
            "Title": "Chemfab Alkalis Reports Q4 Financial Results",
            "Summary": "Chemfab Alkalis reported its Q4 financial results. The company's EBITDA increased to 133 million rupees from 123 million rupees year-over-year. However, the EBITDA margin decreased slightly to 14.45% from 14.97%. The company reported a consolidated net loss of 92 million rupees, compared to a loss of 54 million rupees in the same quarter last year. Revenue increased to 923 million rupees from 823 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747233905000,
            "Source": "result"
        },
        {
            "Title": "Chemfab Alkalis Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Chemfab Alkalis has reported a decrease in its third-quarter EBITDA, which fell to 145 million rupees from 164 million rupees in the same period last year. The company's EBITDA margin also declined, dropping to 18.28% from 18.99% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738241210000,
            "Source": "earnings"
        },
        {
            "Title": "Chemfab Alkalis Reports Q3 Financial Results",
            "Summary": "Chemfab Alkalis has reported its Q3 financial results. The company's net profit for the quarter stood at 40 million rupees, down from 82 million rupees year-over-year and up from 29 million rupees quarter-over-quarter. Revenue for Q3 was 792 million rupees, compared to 863 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738241140000,
            "Source": "earnings"
        },
        {
            "Title": "Chemfab Alkalis to Consider Q3 Results",
            "Summary": "Chemfab Alkalis Limited has announced that it will consider its third quarter (Q3) financial results on January 30. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737726072000,
            "Source": "earnings"
        },
        {
            "Title": "Chemfab Alkalis Reports Improved Q2 EBITDA and Margin",
            "Summary": "Chemfab Alkalis has announced its Q2 financial results. The company's EBITDA increased to 126.6 million rupees, up from 121 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 16.03% from 15.24% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730722265000,
            "Source": "result"
        },
        {
            "Title": "CHEMFAB ALKALIS Reports Q2 Revenue",
            "Summary": "CHEMFAB ALKALIS reported a quarterly revenue of 790 million rupees for Q2, compared to 796 million rupees in the same quarter last year, showing a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1730722255000,
            "Source": "result"
        },
        {
            "Title": "CHEMFAB ALKALIS Reports Q2 Net Profit Decline",
            "Summary": "CHEMFAB ALKALIS reported a net profit of 29 million rupees for the second quarter, showing a decrease from 54 million rupees year-over-year and 43 million rupees quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1730722245000,
            "Source": "result"
        }
    ]
}