{
    "Symbol": "CHEMBOND",
    "ISIN": "INE995D01025",
    "News": [
        {
            "Title": "Chembond Promoter Acquires 33,425 Shares",
            "Summary": "Sameer Vinod Shah, Chairman & MD of Chembond Material Technologies, acquired 33,425 equity shares through open market purchases, increasing his shareholding from 27.02% to 27.26%.",
            "Sentiment": "neutral",
            "PublishDate": 1769240799054,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chembond Q3FY26 Net Profit Falls 51% to ₹158.86 Cr",
            "Summary": "Chembond Material Technologies reported Q3FY26 net profit of ₹158.86 crores, down 51% YoY. Revenue grew 18.6% to ₹6,289.52 crores despite exceptional gratuity charges of ₹179.61 crores.",
            "Sentiment": "negative",
            "PublishDate": 1768566828422,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chembond grants 34,238 stock options to employees",
            "Summary": "Chembond Material Technologies Limited granted 34,238 stock options under its Employee Stock Option Plan 2025, with exercise prices of ₹164 and ₹115 per share across different tranches.",
            "Sentiment": "positive",
            "PublishDate": 1768564437842,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chembond Promoter Receives 19.27L Share Gift",
            "Summary": "Sameer V. Shah receives 19.27 lakh equity shares as gift from brother Nirmal V. Shah, increasing his shareholding from 12.69% to 27.02% in Chembond Material Technologies.",
            "Sentiment": "neutral",
            "PublishDate": 1767159212721,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chembond Chemicals Promoter Shah Buys 5,084 Shares",
            "Summary": "Nirmal V. Shah, Promoter and Managing Director of Chembond Chemicals Limited, purchased 5,084 equity shares through open market transactions on NSE on December 9, 2025, increasing his shareholding to 13.62%.",
            "Sentiment": "positive",
            "PublishDate": 1765519399430,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chembond Material Technologies Receives In-Principle Approval for ESOP Listing",
            "Summary": "Chembond Material Technologies Limited received in-principle approval from BSE and NSE to list up to 400,000 equity shares of Rs. 5 each under its Employee Stock Option Plan 2025. The approvals are subject to compliance with various regulatory conditions including SEBI regulations, statutory approvals, and listing agreement requirements.",
            "Sentiment": "positive",
            "PublishDate": 1763175397160,
            "Source": "corporate_action"
        },
        {
            "Title": "Chembond Material Technologies Promoter Sameer Vinod Shah Acquires Additional 6,000 Shares",
            "Summary": "Sameer Vinod Shah, Chairman & Managing Director and promoter of Chembond Material Technologies Limited, purchased 6,000 equity shares through open market transactions on BSE and NSE on October 21, 2025. The acquisition increased his shareholding from 17,00,144 shares (12.64%) to 17,06,144 shares (12.69%) of the company's total share capital. The company has a total equity share capital of Rs. 6,72,41,440 comprising 1,34,48,288 shares of Rs. 5 each. The disclosure was made under SEBI regulations for substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1761309317934,
            "Source": "corporate_action"
        },
        {
            "Title": "SHBA & CO LLP Resigns as Statutory Auditors of Chembond Material Technologies",
            "Summary": "SHBA & CO LLP, Chartered Accountants, resigned as statutory auditors of Chembond Material Technologies Limited effective August 14, 2025. The auditing firm completed their audit for the financial year ended March 31, 2025, and limited review for the quarter ended June 30, 2025, before resigning. The resignation was attributed to restructuring within the company pursuant to a composite scheme of arrangement and the auditor's continuation as statutory auditors of the resulting company, Chembond Chemical Specialties Limited. SHBA & CO LLP was appointed for a second five-year term from August 19, 2023, until 2028, but chose to resign early. The firm confirmed no other material reasons existed for their resignation beyond those stated.",
            "Sentiment": "neutral",
            "PublishDate": 1755180863387,
            "Source": "corporate_governance"
        },
        {
            "Title": "Chembond Material Technologies Promoter Nirmal V. Shah Receives 124,700 Equity Shares as Gift from Family Members",
            "Summary": "Nirmal V. Shah, a promoter of Chembond Material Technologies Limited, received 124,700 equity shares as gifts from immediate family members on August 7, 2025. The shares were gifted by Mamta N. Shah (93,300 shares), Kshitija N. Shah (27,100 shares), and Rahil N. Shah (4,300 shares). Following this transaction, Shah's shareholding increased from 17,95,190 shares (13.35%) to 19,19,890 shares (14.28%) of the company's total voting capital. The transaction was conducted off-market with no consideration involved. The company's total equity share capital remains unchanged at Rs. 6,72,41,440, comprising 1,34,48,288 shares of Rs. 5 each.",
            "Sentiment": "neutral",
            "PublishDate": 1754649997245,
            "Source": "corporate_action"
        },
        {
            "Title": "Chembond Material Technologies Secures 10.02 Acres in Karnataka for Manufacturing Expansion",
            "Summary": "Chembond Material Technologies Limited has been allotted 10.02 acres of land by Karnataka Industrial Areas Development Board in Kanagala Industrial Area, Belagavi District, on a lease-cum-sale basis. The land will be used to establish a manufacturing unit for metal treatment chemicals, automotive sealants, engineering adhesives, industrial and high performance coatings, paint booth solutions, maintenance repair overhaul products, and biosciences. The tentative cost of the plot is Rs. 7.94 crore. The allotment letter was dated July 21, 2025, and received by the company on July 25, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753509785356,
            "Source": "stock"
        },
        {
            "Title": "Chembond Chemicals Reports Flat Q1 EBITDA at 35M Rupees with Margin Decline",
            "Summary": "Chembond Chemicals reported Q1 EBITDA of 35 million rupees, unchanged from the same period last year. However, the company's EBITDA margin declined to 6.02% compared to 7.44% in the previous year, indicating reduced profitability despite maintaining absolute earnings levels.",
            "Sentiment": "negative",
            "PublishDate": 1753442272402,
            "Source": "earnings"
        },
        {
            "Title": "Chembond Material Technologies Reports 399.02 Crore Net Profit for Q1 FY2026",
            "Summary": "Chembond Material Technologies Limited reported unaudited financial results for the quarter ended June 30, 2025. The company achieved consolidated revenue from operations of Rs 5,767.50 crore, up from Rs 4,626.79 crore in the same quarter last year. Net profit increased to Rs 399.02 crore compared to Rs 467.74 crore in the previous year quarter. On standalone basis, revenue was Rs 4,892.03 crore with net profit of Rs 316.95 crore. The Board also noted completion of demerger and listing of Chembond Chemicals Limited shares on BSE and NSE. The company operates in two segments - Specialty Chemicals (Rs 4,805.99 crore revenue) and Biosciences Animal Health (Rs 961.51 crore revenue). Basic earnings per share stood at Rs 2.97 for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753440269926,
            "Source": "earnings"
        },
        {
            "Title": "Chembond Chemicals Receives Stock Exchange Listing Approval",
            "Summary": "Chembond Chemicals has received approval for listing on both BSE and NSE stock exchanges. Trading of the company's shares is scheduled to commence on July 23, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753166950527,
            "Source": "stock"
        },
        {
            "Title": "Chembond Chemicals Limited Receives Approval for Stock Exchange Listing, Trading Begins July 23, 2025",
            "Summary": "Chembond Chemicals Limited (formerly Chembond Chemical Specialties Limited) has received approval for listing and trading of its equity shares on BSE Limited and the National Stock Exchange of India Limited. The equity shares will be available for trading on both exchanges starting Wednesday, July 23, 2025. The company has scrip codes 544450 on BSE and CHEMBONDCH on NSE, with ISIN INEOTGX01019. This listing follows a composite scheme of arrangement involving multiple Chembond group companies including Chembond Material Technologies Limited, Chembond Clean Water Technologies Limited, Chembond Material Technologies Private Limited, Phiroze Sethna Private Limited, and Gramos Chemicals (India) Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1753166892881,
            "Source": "corporate_action"
        },
        {
            "Title": "Chembond Chemicals: Q3 Profit Dips 13.19% Despite Revenue Growth",
            "Summary": "Chembond Chemicals reported Q3 FY25 results with revenue up 10.1% YoY to ₹126.18 crore, but profit down 13.19% to ₹11.72 crore. Operating income increased 26.27% YoY. EPS decreased to ₹8.71, down 13.25% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1737785995000,
            "Source": "earnings"
        },
        {
            "Title": "Chembond Chemicals Reports Q3 Revenue Growth",
            "Summary": "Chembond Chemicals announced its third-quarter revenue, which increased to 1.26 billion rupees from 1.14 billion rupees in the same period last year, representing year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1737709226000,
            "Source": "earnings"
        },
        {
            "Title": "Chembond Chemicals Reports Improved Q3 EBITDA and Margin",
            "Summary": "Chembond Chemicals has reported a significant improvement in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 179 million rupees, up from 142 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin expanded to 14.16% from 12.36% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1737709223000,
            "Source": "earnings"
        },
        {
            "Title": "Chembond Chemicals Reports Q3 Consolidated Net Profit of 117 Million Rupees",
            "Summary": "Chembond Chemicals has announced its third-quarter consolidated net profit of 117 million rupees, compared to 135 million rupees in the same period last year. This represents a year-over-year decrease in net profit for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1737709151000,
            "Source": "earnings"
        },
        {
            "Title": "Chembond Chemicals Reports Q2 Financial Results",
            "Summary": "Chembond Chemicals announced its Q2 financial results. The company's EBITDA decreased to 126.6 million rupees from 145.1 million rupees year-over-year. The EBITDA margin also declined to 10.25% from 12.95% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1729845027000,
            "Source": "result"
        },
        {
            "Title": "Chembond Chemicals Reports Q2 Financial Results",
            "Summary": "Chembond Chemicals announced its Q2 financial results. The company reported a consolidated net profit of 138.5 million rupees, down from 153.5 million rupees in the same quarter last year. However, revenue increased to 1.23 billion rupees from 1.12 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1729845007000,
            "Source": "result"
        }
    ]
}