{
    "Symbol": "CHEMBONDCH",
    "ISIN": "INE0TGX01019",
    "News": [
        {
            "Title": "Chembond Chemicals Reports Strong Q3 Performance",
            "Summary": "Chembond Chemicals delivered robust Q3 FY26 results with consolidated revenue rising 15.31% to ₹8,634.57 lakhs and net profit declining 2.59% to ₹971.17 lakhs compared to Q3 FY25.",
            "Sentiment": "positive",
            "PublishDate": 1768993902474,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chembond Chemicals sells 40% stake in associate",
            "Summary": "Chembond Chemicals Limited completes sale of entire 40% stake in associate company Rewasoft Solutions Private Limited for ₹2.00 lakhs to Mr. Mohit S. Shah on December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767266279455,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chembond Chemicals Completes 29.39L Share Transfer",
            "Summary": "Nirmal V Shah received 29.39 lakh equity shares from Sameer V Shah through inter-se transfer on December 29, 2025, increasing his stake to 25.96% from 15.03%.",
            "Sentiment": "neutral",
            "PublishDate": 1765873953246,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chembond Chemicals Promoter Sameer V. Shah Receives 81,000 Equity Shares as Gift",
            "Summary": "Sameer V. Shah, Promoter and Director of Chembond Chemicals Limited, received 81,000 equity shares through gift transactions from promoter group members Raunaq S. Shah (13,600 shares) and Mallika S. Shah (67,400 shares) on December 5, 2025. The off-market gift transaction represents 0.30% of the company's total voting capital and was disclosed under SEBI takeover regulations with no monetary consideration involved.",
            "Sentiment": "neutral",
            "PublishDate": 1765199007321,
            "Source": "corporate_action"
        },
        {
            "Title": "Chembond Chemicals Promoter Nirmal Shah Acquires Additional 3,000 Shares",
            "Summary": "Nirmal V. Shah, Promoter and Managing Director of Chembond Chemicals Limited, purchased 3,000 equity shares through open market transaction on NSE on December 1, 2025. The acquisition increased his shareholding from 36,56,872 shares (13.60%) to 36,59,872 shares (13.61%) in the company with total equity capital of Rs. 13,44,82,880.",
            "Sentiment": "positive",
            "PublishDate": 1764677566876,
            "Source": "corporate_action"
        },
        {
            "Title": "Chembond Chemicals Reports Mixed Q2 Results with Revenue Decline but Margin Improvement",
            "Summary": "Chembond Chemicals posted consolidated revenue of Rs. 73.04 crores in Q2 FY26, down 3% year-on-year, while EBITDA grew 14% to Rs. 11.08 crores due to improved margins from lower raw material costs. The company, which operates across water technologies (85-87% of business), construction chemicals, cleaning & hygiene, and distribution segments, expects better performance in H2 with a Rs. 100+ crore order book in water business.",
            "Sentiment": "neutral",
            "PublishDate": 1764132524295,
            "Source": "earnings"
        },
        {
            "Title": "Chembond Chemicals Reports Mixed Performance with 1% Revenue Decline in H1 FY26",
            "Summary": "Chembond Chemicals' consolidated revenue fell 1% to Rs 138.40 crores in H1 2025-26, with water technologies growing 5% while construction chemicals dropped 6% due to prolonged monsoons and distribution declined 30%. The company's EBITDA improved 15% to Rs 21.89 crores and PBT rose 13% to Rs 19.42 crores, driven by lower raw material costs and newer product technologies.",
            "Sentiment": "neutral",
            "PublishDate": 1763717935191,
            "Source": "earnings"
        },
        {
            "Title": "Chembond Chemicals Schedules H1 FY2026 Earnings Call for November 21, 2025",
            "Summary": "Chembond Chemicals Limited will conduct a virtual analyst and investor earnings call on November 21, 2025, at 15:30 hrs IST to discuss Q2 and H1 FY2026 results ended September 30, 2025. The call will feature management discussion led by Chairman and Managing Director Nirmal V. Shah, Executive Director Vinod Deshpande, and CFO Prachi Mahadik, followed by an interactive Q&A session.",
            "Sentiment": "neutral",
            "PublishDate": 1763467333645,
            "Source": "earnings"
        },
        {
            "Title": "Chembond Chemicals Promoter Nirmal Shah Acquires 6,823 Additional Equity Shares",
            "Summary": "Nirmal V. Shah, Promoter and Managing Director of Chembond Chemicals Limited, purchased 6,823 equity shares through open market transactions on NSE over two days in November 2025. The acquisition was disclosed under SEBI regulations for substantial acquisition of shares, with transactions totaling 2,635 shares on November 12 and 4,188 shares on November 13.",
            "Sentiment": "neutral",
            "PublishDate": 1763108602783,
            "Source": "corporate_action"
        },
        {
            "Title": "Chembond Chemicals Promoter Nirmal Shah Acquires Additional 8,173 Shares",
            "Summary": "Nirmal V. Shah, Promoter and Managing Director of Chembond Chemicals Limited, acquired 8,173 equity shares of the company through open market transactions on NSE. The purchases were made on November 6, 2025 (2,173 shares) and November 7, 2025 (6,000 shares). Following this acquisition, Shah's shareholding increased from 36,41,876 shares (13.54%) to 36,50,049 shares (13.57%) of the company's total voting capital. The company has an equity share capital of Rs. 13,44,82,880 consisting of 2,68,96,576 shares of Rs. 5 each. The disclosure was made under SEBI regulations for substantial acquisition of shares.",
            "Sentiment": "positive",
            "PublishDate": 1762807664100,
            "Source": "corporate_action"
        },
        {
            "Title": "Chembond Chemicals Promoters Acquire Additional 23,797 Shares Through Open Market",
            "Summary": "Promoters of Chembond Chemicals Limited acquired 23,797 equity shares through open market transactions on NSE. Nirmal V. Shah purchased 23,547 shares, Rahil N. Shah acquired 150 shares, and Kshitija N. Shah bought 100 shares. The transactions occurred between October 20-21, 2025. Following these acquisitions, the promoter group's total shareholding increased from 36,81,279 shares (13.69%) to 37,05,076 shares (13.78%) of the company's total share capital. The company has an equity share capital of Rs. 13,44,82,880 comprising 2,68,96,576 shares of Rs. 5 each. The shares are listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1761556773712,
            "Source": "corporate_action"
        },
        {
            "Title": "Chembond Chemicals Reports Strong Q2 Performance with 14.6% Revenue Growth",
            "Summary": "Chembond Chemicals Limited reported consolidated revenue from operations of ₹7,303.98 lakhs for the quarter ended September 30, 2025, compared to ₹7,502.53 lakhs in the same quarter last year. Net profit attributable to shareholders increased to ₹724.56 lakhs from ₹690.64 lakhs year-over-year. For the half-year period, consolidated revenue reached ₹13,842.08 lakhs versus ₹13,938.04 lakhs in the previous year. The company's earnings per share for the quarter stood at ₹2.69 compared to ₹2.57 in the corresponding quarter of the previous year. On a standalone basis, the company achieved revenue of ₹1,448.62 lakhs for the quarter, up from ₹1,358.13 lakhs in the same period last year. The Board approved these unaudited financial results in a meeting held on October 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760623533622,
            "Source": "earnings"
        },
        {
            "Title": "Chembond Chemicals Promoter Nirmal Shah Acquires 14,043 Additional Shares",
            "Summary": "Nirmal Shah, Promoter and Managing Director of Chembond Chemicals Limited, acquired 14,043 equity shares through open market purchases on NSE. The transactions occurred on September 26 (5,000 shares), September 29 (5,000 shares), and September 30 (4,043 shares), 2025. Following this acquisition, Shah's shareholding increased from 36,04,286 shares (13.40%) to 36,18,329 shares (13.45%) of the company's total voting capital. The company's total equity share capital remains at Rs. 13,44,82,880, comprising 2,68,96,576 shares of Rs. 5 each. The disclosure was made under SEBI regulations for substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1759233813451,
            "Source": "corporate_action"
        },
        {
            "Title": "Chembond Chemical Specialties Reports 602.86 Crore Annual Profit Following Corporate Restructuring",
            "Summary": "Chembond Chemical Specialties Limited reported a net profit of Rs 602.86 crore for the year ended March 31, 2025, compared to Rs 743.03 crore in the previous year. Revenue from operations reached Rs 5,990.04 crore versus Rs 5,886.05 crore last year. The company completed a composite scheme of arrangement involving demerger of construction chemicals and water technologies business from Chembond Material Technologies Limited and amalgamation of Chembond Clean Water Technologies Limited. The scheme was approved by NCLT on April 7, 2025, with an appointed date of April 1, 2024. Under the arrangement, shareholders received 2 equity shares of Rs 5 each for every 1 share held in the demerged company. Basic earnings per share stood at Rs 2.24 for the current year compared to Rs 2.76 in the previous year. The company operates primarily in specialty chemicals manufacturing.",
            "Sentiment": "neutral",
            "PublishDate": 1758882572529,
            "Source": "earnings"
        },
        {
            "Title": "Chembond Chemicals Promoter Nirmal Shah Acquires 1,000 Additional Shares",
            "Summary": "Nirmal Shah, Promoter and Managing Director of Chembond Chemicals Limited, purchased 1,000 equity shares of the company through open market transactions on NSE on August 11, 2025. Following this acquisition, Shah's total shareholding increased to 36,04,286 shares, maintaining his 13.40% stake in the company. The company's total equity share capital remains at Rs. 13,44,82,880 comprising 2,68,96,576 shares of Rs. 5 each. The acquisition was disclosed under SEBI regulations for substantial acquisition of shares.",
            "Sentiment": "neutral",
            "PublishDate": 1754997613036,
            "Source": "corporate_action"
        },
        {
            "Title": "Chembond Chemicals Promoter Nirmal Shah Acquires 12,906 Additional Equity Shares",
            "Summary": "Nirmal Shah, Promoter and Managing Director of Chembond Chemicals Limited, acquired 12,906 equity shares through open market transactions on BSE and NSE. The purchase was made on August 6 and 7, 2025, with 2,514 shares bought on the first date and 10,392 shares on the second. Following this acquisition, Shah's total shareholding increased from 35,90,380 shares (13.35%) to 36,03,286 shares (13.40%) of the company's total voting capital. The company has an equity share capital of Rs. 13,44,82,880 comprising 2,68,96,576 shares of Rs. 5 each. The disclosure was made under SEBI regulations for substantial acquisition of shares and takeovers.",
            "Sentiment": "positive",
            "PublishDate": 1754634337401,
            "Source": "corporate_action"
        },
        {
            "Title": "Chembond Chemicals Reports Q1 FY26 Results Following Demerger and Stock Exchange Listing",
            "Summary": "Chembond Chemicals Limited reported its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. On a standalone basis, the company recorded revenue from operations of Rs 1,849.57 lakhs compared to Rs 1,658.38 lakhs in the same quarter last year, with profit after tax of Rs 112.12 lakhs versus Rs 113.64 lakhs in the previous year quarter. On a consolidated basis, revenue from operations reached Rs 6,538.10 lakhs compared to Rs 6,435.51 lakhs in the corresponding quarter, with profit after tax of Rs 627.01 lakhs against Rs 560.16 lakhs in the same period last year. The company completed its demerger process and began trading on BSE and NSE on July 23, 2025. The company was renamed from Chembond Chemical Specialties Limited to Chembond Chemicals Limited with effect from June 24, 2025, following NCLT approval. The company operates primarily in specialty chemicals manufacturing and has subsidiaries in Malaysia and Thailand along with other domestic subsidiaries.",
            "Sentiment": "neutral",
            "PublishDate": 1753516327323,
            "Source": "earnings"
        }
    ]
}