{
    "Symbol": "CHENNPETRO",
    "ISIN": "INE178A01016",
    "News": [
        {
            "Title": "CPCL Q3FY26 Net Profit Surges to ₹987.22 Crore",
            "Summary": "Chennai Petroleum Corporation reports strong Q3FY26 performance with net profit of ₹987.22 crore vs ₹10.46 crore in Q3FY25, driven by improved refining margins and higher crude throughput.",
            "Sentiment": "positive",
            "PublishDate": 1769263604262,
            "Source": "co_actions_results"
        },
        {
            "Title": "CPCL Appoints S.G. Venkatesh as Director (Technical)",
            "Summary": "Chennai Petroleum Corporation Limited appointed Shri S.G. Venkatesh as Director (Technical) effective January 5, 2026. The new director brings 31 years of experience in petroleum refining and petrochemicals.",
            "Sentiment": "positive",
            "PublishDate": 1767620758145,
            "Source": "stocks"
        },
        {
            "Title": "Chennai Petroleum Corporation Fined Rs 10.85 Lakh by BSE and NSE for Board Composition Non-Compliance",
            "Summary": "Chennai Petroleum Corporation Limited received notices from BSE and NSE imposing fines of Rs 5.42 lakh each for failing to appoint a Woman Independent Director during the quarter ended September 30, 2025. The company has requested waiver of the fines, citing that director appointments are handled by the Ministry of Petroleum and Natural Gas, Government of India, and that similar waiver requests were favorably considered by exchanges in the past.",
            "Sentiment": "negative",
            "PublishDate": 1764352469148,
            "Source": "corporate_governance"
        },
        {
            "Title": "Chennai Petroleum Corporation Clarifies Recent Share Volume Surge as Market-Driven",
            "Summary": "Chennai Petroleum Corporation Limited responded to stock exchange inquiries regarding a significant increase in its share trading volume. The company stated it has disclosed all required information under SEBI regulations and confirmed there is no unpublished price-sensitive information that needs disclosure. The company attributed the recent volume movement in its shares to market-driven factors.",
            "Sentiment": "neutral",
            "PublishDate": 1761638671737,
            "Source": "stock"
        },
        {
            "Title": "Chennai Petroleum Corp Reports Strong Q2 Performance with 7.3B Rupees Net Profit",
            "Summary": "Chennai Petroleum Corp delivered robust Q2 results with revenue of 200.34 billion rupees, up from 186.8 billion rupees in the previous quarter. The company posted a net profit of 7.3 billion rupees, marking a significant turnaround from a loss of 566 million rupees in the prior quarter. EBITDA surged to 11.4 billion rupees from 986 million rupees, while EBITDA margin expanded substantially to 5.71% from 0.53% quarter-on-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761544910485,
            "Source": "earnings"
        },
        {
            "Title": "CPCL MD Says Russian Oil Import Curbs Won't Impact Operations",
            "Summary": "Chennai Petroleum Corporation Ltd. Managing Director H Shankar stated that potential restrictions on Russian oil imports will not affect the company as it has secured crude requirements for the next two months through mid-September. The company places crude orders two months in advance and maintains diversified sourcing options, including opportunities in the West African market. CPCL does not directly procure crude oil - its parent company Indian Oil handles sourcing and procurement. Regarding quarterly results, CPCL reported a net loss of Rs 40 crore compared to a net profit of Rs 484 crore in the same quarter last year, with revenue declining 8% to Rs 18,683 crore. Shankar attributed challenges to crude price fluctuations between $60-78 per barrel and noted that inventory stocks experienced significant deviations.",
            "Sentiment": "neutral",
            "PublishDate": 1754303642861,
            "Source": "stock"
        },
        {
            "Title": "Chennai Petroleum Reports Q1 Net Loss of 566 Million Rupees",
            "Summary": "Chennai Petroleum Corporation reported a net loss of 566 million rupees in Q1, compared to a profit of 4.5 billion rupees in the previous quarter. The company's revenue declined to 186.8 billion rupees from 205.8 billion rupees quarter-on-quarter, representing a decrease of 19 billion rupees.",
            "Sentiment": "negative",
            "PublishDate": 1753431807792,
            "Source": "earnings"
        },
        {
            "Title": "Chennai Petroleum Corporation Ltd: Plans ₹400 Crore Investment to Re-enter Retail Fuel Business",
            "Summary": "Chennai Petroleum Corporation Ltd. (CPCL) is investing ₹400 crore over 2-3 years to re-enter the direct fuel retail segment. The company plans to set up petrol and diesel retail outlets, with the first phase launching during CPCL's Diamond Jubilee year. The initiative, approved by the Ministry of Petroleum and Natural Gas, aims to meet current fuel demand and strengthen CPCL's market presence.",
            "Sentiment": "positive",
            "PublishDate": 1749023738000,
            "Source": "corporate_action"
        },
        {
            "Title": "Chennai Petroleum Corporation Ltd: Ventures into Retail Fuel Outlets with Rs 400 Crore Investment",
            "Summary": "Chennai Petroleum Corporation Ltd (CPCL) plans to establish retail fuel outlets, allocating Rs 400 crore for capital expansion over 2-3 years. The company aims to launch its first outlets during its Diamond Jubilee year, with plans to expand gradually across India based on market conditions.",
            "Sentiment": "positive",
            "PublishDate": 1748971925000,
            "Source": "corporate_action"
        },
        {
            "Title": "Chennai Petroleum Corporation Granted Retail Marketing Rights for Fuel",
            "Summary": "The Ministry of Petroleum & Natural Gas has approved Chennai Petroleum Corporation's request to exercise retail marketing rights for Motor Spirit (MS) and High Speed Diesel (HSD). This approval comes from the Government of India, allowing the company to market these fuel products directly.",
            "Sentiment": "positive",
            "PublishDate": 1748335579000,
            "Source": "default"
        },
        {
            "Title": "Chennai Petroleum Q4 Performance and Operational Updates",
            "Summary": "Chennai Petroleum reported Q4 GRM of $6.22/bbl, down from $7.7/bbl a year ago. The company saw an inventory gain of 1.25 billion rupees in Q4. Executives mentioned plans for early rollout of sustainable aviation fuel and upcoming maintenance for one crude unit. The company continues to use Basra crude in its long-term portfolio and is receiving favorable offers for US and African crudes through tenders.",
            "Sentiment": "neutral",
            "PublishDate": 1746403561000,
            "Source": "default"
        },
        {
            "Title": "Chennai Petroleum Q4 Update: Inventory Gain and Crude Sourcing",
            "Summary": "Chennai Petroleum reported an inventory gain of 1.25 billion rupees in Q4. The company includes Basra crude in its long-term portfolio and is receiving favorable offers for US and African crudes through tenders. One crude unit is scheduled for maintenance this year. The company's Q4 GRM decreased to $6.22/bbl from $7.7/bbl year-over-year. Chennai Petroleum also anticipates an early rollout of sustainable aviation fuel.",
            "Sentiment": "neutral",
            "PublishDate": 1746186521000,
            "Source": "default"
        },
        {
            "Title": "Chennai Petroleum Corporation Ltd: Q4 Revenue Jumps 34%, Announces Dividend",
            "Summary": "Chennai Petroleum Corporation Ltd reported a 33.5% increase in Q4 revenue to ₹17,249 crore. EBITDA margin improved to 4.6% from 1.9% in the previous quarter. The company announced a final dividend of ₹5 per share for FY 2024-2025.",
            "Sentiment": "positive",
            "PublishDate": 1745570625000,
            "Source": "earnings"
        },
        {
            "Title": "Chennai Petroleum Corp Reports Q4 Revenue Increase",
            "Summary": "Chennai Petroleum Corporation has reported a revenue of 206 billion rupees for the fourth quarter, compared to 157 billion rupees in the previous quarter, representing a quarter-on-quarter increase.",
            "Sentiment": "positive",
            "PublishDate": 1745569713000,
            "Source": "result"
        },
        {
            "Title": "Chennai Petroleum Corp Reports Q4 Net Profit of 4.50B Rupees",
            "Summary": "Chennai Petroleum Corporation has announced its financial results for the fourth quarter. The company reported a net profit of 4.50 billion rupees, which represents a significant increase from the previous quarter's profit of 100 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1745569344000,
            "Source": "result"
        },
        {
            "Title": "NGT Grants Interim Stay on TNPCB Order Against Chennai Petroleum",
            "Summary": "The National Green Tribunal (NGT) has issued an interim stay on an order by the Tamil Nadu Pollution Control Board (TNPCB) that demanded 736.8 million rupees from Chennai Petroleum Corporation Limited. This stay provides temporary relief to the company from the financial obligation imposed by the state pollution control authority.",
            "Sentiment": "neutral",
            "PublishDate": 1742516560000,
            "Source": "corporate_governance"
        },
        {
            "Title": "NGT Grants Interim Stay on TNPCB Order Demanding 736.8 Million Rupees from Chennai Petroleum",
            "Summary": "The National Green Tribunal (NGT) has issued an interim stay on an order by the Tamil Nadu Pollution Control Board (TNPCB) that demanded 736.8 million rupees from Chennai Petroleum Corporation Limited. This temporary relief suspends the enforcement of the financial demand while the case is being reviewed.",
            "Sentiment": "neutral",
            "PublishDate": 1742469151000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Chennai Petroleum Reports Profit in Q3 FY2024",
            "Summary": "Chennai Petroleum Corporation Limited has reported a net profit of 105 million rupees in Q3, compared to a loss of 6.3 billion rupees in the previous quarter. The company's revenue increased to 156 billion rupees from 144 billion rupees quarter-over-quarter. EBITDA improved to 2.4 billion rupees from a loss of 6.75 billion rupees in the previous quarter. The Q3 margin stood at 1.54%.",
            "Sentiment": "positive",
            "PublishDate": 1737333530000,
            "Source": "earnings"
        },
        {
            "Title": "Chennai Petroleum Reports Q3 Profit Turnaround",
            "Summary": "Chennai Petroleum Corporation Limited has reported a significant improvement in its financial performance for the third quarter. The company posted a net profit of 105 million rupees, compared to a loss of 6.3 billion rupees in the previous quarter. Revenue also increased to 156 billion rupees from 144 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737201021000,
            "Source": "earnings"
        },
        {
            "Title": "Chennai Petroleum Corp to Consider Q3 Results on January 18",
            "Summary": "Chennai Petroleum Corporation Limited has announced that it will consider and approve its financial results for the third quarter of the fiscal year on January 18.",
            "Sentiment": "neutral",
            "PublishDate": 1736171739000,
            "Source": "result"
        },
        {
            "Title": "Chennai Petroleum Corporation: IOC's Arvinder Sahney Appointed Part-Time Chairperson",
            "Summary": "Arvinder Singh Sahney, current chairperson of Indian Oil Corp., has been nominated as part-time chairperson of Chennai Petroleum Corp.'s board of directors. Sahney, with 30 years of experience in refinery and petrochemicals, was previously appointed as a director of CPCL in November.",
            "Sentiment": "neutral",
            "PublishDate": 1734461048000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Chennai Petroleum: Optimistic Outlook for H2 FY2024-25",
            "Summary": "Chennai Petroleum Corp. expects better growth in H2 FY2024-25 due to improving crude and crack spread prices, and enhanced operational efficiencies. Q2 saw a 29% sequential decrease in total income to Rs 14,429.11 crore and a net loss of Rs 634 crore. The company has completed major refinery maintenance work and anticipates robust performance in Q3 and Q4.",
            "Sentiment": "positive",
            "PublishDate": 1729825526000,
            "Source": "normal_news"
        },
        {
            "Title": "Chennai Petroleum: Q2 Results Show Weak Performance",
            "Summary": "Chennai Petroleum's Q2 results were negatively impacted by a shutdown and inventory losses, according to Yes Securities.",
            "Sentiment": "negative",
            "PublishDate": 1729669846000,
            "Source": "result"
        },
        {
            "Title": "Chennai Petroleum Corporation Reports Q2 Net Loss",
            "Summary": "Chennai Petroleum Corporation has reported a net loss of 6.3 billion rupees in the second quarter, compared to a profit of 3.4 billion rupees in the previous quarter. The company's revenue also decreased to 144 billion rupees from 203.6 billion rupees quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1729597705000,
            "Source": "result"
        },
        {
            "Title": "Chennai Petroleum in Talks for $3.3B Refinery Loan",
            "Summary": "<p><span class=\"neutral\">Chennai Petroleum Corporation</span> is <span class=\"positive\">negotiating</span> to raise <b>$3.3 billion</b> for a <span class=\"positive\">new refinery project</span> in <span class=\"neutral\">Tamil Nadu, southern India</span>. <span class=\"neutral\">State Bank of India</span> is expected to <span class=\"positive\">lead</span> the local-currency loan deal.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728626508000,
            "Source": "corporate_action"
        }
    ]
}