{
    "Symbol": "CHEVIOT",
    "ISIN": "INE974B01016",
    "News": [
        {
            "Title": "Cheviot Acquires 32,000 More Hindalco Shares at ₹937.58",
            "Summary": "Cheviot Company Limited purchased additional 32,000 equity shares of Hindalco Industries Limited on January 7, 2026, at ₹937.58 per share, increasing total holding to 226,000 shares.",
            "Sentiment": "positive",
            "PublishDate": 1766048071064,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cheviot Company Acquires 10,000 NSE Shares Worth ₹1.83 Crore",
            "Summary": "Cheviot Company Limited purchased 10,000 equity shares of National Stock Exchange of India Limited for ₹1.83 crore at ₹1,830 per share on November 17, 2025. The acquisition represents 0.00646% shareholding in NSEIL and was made as a long-term investment considering the exchange's strong fundamentals and leading market position.",
            "Sentiment": "neutral",
            "PublishDate": 1763376554275,
            "Source": "corporate_action"
        },
        {
            "Title": "Cheviot Company Reports 44% Drop in Quarterly Profit Despite Revenue Growth",
            "Summary": "Cheviot Company Limited reported a net profit of ₹1,484 lakhs for the quarter ended September 30, 2025, down 44% from ₹2,633 lakhs in the same quarter last year. Revenue from operations increased 44% to ₹14,821 lakhs compared to ₹10,285 lakhs in the previous year quarter. The company experienced negative other income of ₹24 lakhs primarily due to losses on fair valuation of investments measured at Fair Value through Profit and Loss (FVTPL). For the half-year period, net profit reached ₹4,355 lakhs compared to ₹4,470 lakhs in the corresponding period last year. Basic earnings per share for the quarter stood at ₹25.40 versus ₹31.39 in the same quarter last year. The company operates in the jute goods business segment and has no subsidiaries, associates or joint ventures.",
            "Sentiment": "neutral",
            "PublishDate": 1762847687668,
            "Source": "earnings"
        },
        {
            "Title": "Cheviot Co Reports Mixed Q2 Results with Revenue Growth but Lower Net Profit",
            "Summary": "Cheviot Co announced its Q2 financial results showing revenue of Rs 1.4 billion compared to Rs 1.03 billion in the same period last year. The company's net profit declined to Rs 148 million from Rs 185 million year-over-year. However, EBITDA improved significantly to Rs 226 million from Rs 103 million, with EBITDA margin expanding to 15.23% from 10.03% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762844238088,
            "Source": "earnings"
        },
        {
            "Title": "Cheviot Company Limited Acquires Additional Reliance Industries Shares Worth ₹17.87 Crores",
            "Summary": "Cheviot Company Limited acquired 13,000 equity shares of Reliance Industries Limited on August 14, 2025, for ₹17,870,938 at an average price of ₹1,374.69 per share through stock exchange mechanism. Following this acquisition, Cheviot now holds 2,05,000 equity shares of RIL in total. The company stated the purchase was made for long-term investment purposes considering RIL's strong fundamentals and market position, with no intention to acquire control. The shareholding remains below 0.01% of RIL's share capital. The acquisition required disclosure due to the transaction value exceeding regulatory thresholds under SEBI Listing Regulations. RIL reported total assets of ₹10,22,401 crores, revenue of ₹5,32,792 crores, and profit after tax of ₹35,262 crores for the year ended March 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755180856025,
            "Source": "corporate_action"
        },
        {
            "Title": "Cheviot Company Acquires 7,000 Reliance Industries Shares Worth ₹9.66 Crores",
            "Summary": "Cheviot Company Limited acquired 7,000 equity shares of Reliance Industries Limited on August 12, 2025, for ₹96.63 lakh at an average price of ₹1,380.50 per share through stock exchange trading. The company now holds 1.92 lakh RIL shares in total, representing less than 0.01% of RIL's share capital. The acquisition was made for long-term investment purposes considering RIL's strong fundamentals and market position, with no intention to acquire control. The purchase required disclosure under SEBI regulations as the transaction value exceeded the specified threshold. RIL reported total assets of ₹10.22 lakh crores, revenue of ₹5.33 lakh crores, and profit after tax of ₹35,262 crores for the year ended March 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755004636217,
            "Source": "corporate_action"
        },
        {
            "Title": "Cheviot Company Acquires Additional Reliance Industries Shares Worth ₹10.9 Crores",
            "Summary": "Cheviot Company Limited acquired 8,000 equity shares of Reliance Industries Limited on August 8, 2025, for ₹10,935,400 at an average price of ₹1,366.93 per share through stock exchange mechanism. The company now holds a total of 1,85,000 RIL shares, representing less than 0.01% of RIL's share capital. The acquisition was made for long-term investment purposes considering RIL's strong fundamentals and market position, with no intention to acquire control. The purchase required disclosure as it exceeded the threshold specified in listing regulations. RIL reported total assets of ₹10,22,401 crores, revenue of ₹5,32,792 crores, and profit after tax of ₹35,262 crores for the year ended March 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754662417501,
            "Source": "stock"
        },
        {
            "Title": "Cheviot Co Reports Strong Q1 Performance with EBITDA Doubling Year-over-Year",
            "Summary": "Cheviot Co reported Q1 EBITDA of 199 million rupees, representing a significant increase from 83 million rupees in the same period last year. The company's EBITDA margin also improved substantially to 16.6% compared to 8.8% year-over-year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754466268208,
            "Source": "earnings"
        },
        {
            "Title": "Cheviot Co Reports 8% Growth in Net Profit to 287M Rupees",
            "Summary": "Cheviot Co announced quarterly results showing net profit of 287 million rupees compared to 265 million rupees in the same period last year, representing year-over-year growth. Revenue increased to 1.2 billion rupees from 947 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754465664294,
            "Source": "earnings"
        },
        {
            "Title": "Cheviot Company Acquires Reliance Industries Shares Worth ₹20.83 Crores",
            "Summary": "Cheviot Company Limited purchased 14,932 equity shares of Reliance Industries Limited on August 5, 2025, for ₹20,825,263 at an average price of ₹1,394.67 per share through stock exchange mechanism. The company now holds 1,77,000 equity shares of RIL in total, representing less than 0.01% of RIL's share capital. The acquisition was made as a long-term investment considering RIL's strong fundamentals and market position, with no intention to acquire control. The transaction required disclosure under SEBI regulations due to the purchase value exceeding specified thresholds. RIL reported total assets of ₹10,22,401 crores, revenue of ₹5,32,792 crores, and profit after tax of ₹35,262 crores for the year ended March 31, 2025. The acquisition is not a related party transaction and required no regulatory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1754400469003,
            "Source": "corporate_action"
        },
        {
            "Title": "Cheviot Company Limited Schedules Board Meeting to Approve Quarterly Financial Results",
            "Summary": "Cheviot Company Limited has scheduled a Board of Directors meeting for August 6, 2025, to consider and approve the unaudited standalone financial results for the quarter ended June 30, 2025. The meeting notice was communicated to BSE Limited and National Stock Exchange of India Limited on July 29, 2025, by Company Secretary and Compliance Officer Aditya Banerjee.",
            "Sentiment": "neutral",
            "PublishDate": 1753781842354,
            "Source": "corporate_action"
        },
        {
            "Title": "Cheviot Company Acquires 10,500 RIL Shares Worth ₹14.74 Crores as Long-Term Investment",
            "Summary": "Cheviot Company Limited acquired 10,500 equity shares of Reliance Industries Limited through stock exchange mechanism on July 24, 2025. The acquisition was valued at ₹14,743,949.85 at an average price of ₹1,404.19 per share. The shareholding represents less than 0.01% of RIL's share capital and was purchased as a long-term investment based on RIL's strong fundamentals and market position. The transaction is not a related party deal and requires disclosure due to the acquisition cost exceeding regulatory thresholds. RIL reported total assets of ₹10,22,401 crores, revenue of ₹5,32,792 crores, and profit after tax of ₹35,262 crores for the year ended March 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753358818409,
            "Source": "order&deals"
        },
        {
            "Title": "Cheviot Company Acquires 4,000 RIL Shares Worth ₹56.8 Crore for Long-Term Investment",
            "Summary": "Cheviot Company Limited acquired 4,000 equity shares of Reliance Industries Limited through stock exchange mechanism on July 22, 2025, for ₹56,80,000 at an average price of ₹1,420 per share. The acquisition represents less than 0.01% of RIL's share capital and was made as a long-term investment based on RIL's strong fundamentals and market position. The purchase was made through cash consideration in the secondary market without any intention to acquire control. RIL reported total assets of ₹10,22,401 crores, revenue from operations of ₹5,32,792 crores, and profit after tax of ₹35,262 crores for the year ended March 31, 2025. The transaction required disclosure under listing regulations due to the consideration amount exceeding specified thresholds, despite the minimal shareholding percentage.",
            "Sentiment": "neutral",
            "PublishDate": 1753186937901,
            "Source": "order&deals"
        },
        {
            "Title": "Anti-Dumping Duties Review on Jute from Bangladesh and Nepal",
            "Summary": "A mid-term review of anti-dumping duties on jute products from Bangladesh and Nepal has been initiated. The review is prompted by price drops and their impact on local producers. The process aims to reassess the current duties in light of changing market conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1751427379000,
            "Source": "default"
        },
        {
            "Title": "Cheviot Co. Reports Q4 Results and Recommends Dividend",
            "Summary": "Cheviot Co. has announced its Q4 financial results and recommended a dividend. The company's Q4 revenue increased to 1.34 billion rupees from 1.2 billion rupees year-over-year. EBITDA rose to 205.8 million rupees from 104.7 million rupees, with the EBITDA margin improving to 15.38% from 8.52%. However, net profit decreased to 93.1 million rupees from 149 million rupees year-over-year, but increased from 34.4 million rupees quarter-over-quarter. The company has recommended a dividend of 5 rupees per ordinary share.",
            "Sentiment": "neutral",
            "PublishDate": 1748272991000,
            "Source": "result"
        },
        {
            "Title": "Cheviot Co. Reports Mixed Q3 Results",
            "Summary": "Cheviot Co. has released its Q3 financial results. The company reported a net profit of 34 million rupees, significantly lower than the 179 million rupees reported in the same quarter last year. However, revenue increased to 1.1 billion rupees from 984 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739492199000,
            "Source": "earnings"
        },
        {
            "Title": "Cheviot Co. Reports Q3 Financial Results",
            "Summary": "Cheviot Co. has announced its financial results for the third quarter. The company reported a net profit of 34 million rupees, which is significantly lower compared to 179 million rupees in the same period last year. However, the company's revenue increased to 1.1 billion rupees from 984 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739458563000,
            "Source": "earnings"
        },
        {
            "Title": "Cheviot Co. Reports Q2 EBITDA Decline",
            "Summary": "Cheviot Co. has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 is 103 million rupees, down from 151 million rupees in the same quarter last year. The EBITDA margin has also decreased to 10.03% from 12.05% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731049876000,
            "Source": "result"
        },
        {
            "Title": "Cheviot Reports Q2 Net Profit of 185M Rupees",
            "Summary": "Cheviot Company Limited has reported a net profit of 185 million rupees for the second quarter, compared to 197 million rupees in the same period last year, indicating a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1731049841000,
            "Source": "result"
        }
    ]
}