{
    "Symbol": "CHOICEIN",
    "ISIN": "INE102B01014",
    "News": [
        {
            "Title": "Choice International acquires 51% stake in Fintoo Wealth",
            "Summary": "Choice International Limited completed acquisition of 51% equity stake in Fintoo Wealth Private Limited for INR 9.99 crores to strengthen its technology-driven wealth management segment.",
            "Sentiment": "positive",
            "PublishDate": 1770820106269,
            "Source": "co_actions_results"
        },
        {
            "Title": "Choice International: Patodia Properties Releases Pledge",
            "Summary": "Patodia Properties Private Limited releases pledge on 3.20 lakh shares of Choice International Limited with National Securities Clearing Corporation Ltd, reducing encumbered holdings from 3.71% to 3.56%.",
            "Sentiment": "positive",
            "PublishDate": 1770722615469,
            "Source": "co_actions_results"
        },
        {
            "Title": "Choice International Q3 Net Profit Doubles to ₹656M",
            "Summary": "Choice International reported consolidated net profit of ₹656 million in Q3, up from ₹307 million year-on-year. Revenue increased to ₹3 billion from ₹2 billion in the same period.",
            "Sentiment": "positive",
            "PublishDate": 1770131923309,
            "Source": "co_actions_results"
        },
        {
            "Title": "Patodia Properties revises SEBI takeover disclosure",
            "Summary": "Patodia Properties Private Limited submitted revised disclosure under SEBI takeover regulations following exchange clarification on post-encumbered shares in Choice International Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1769757108672,
            "Source": "co_actions_results"
        },
        {
            "Title": "Choice International Changes Auditor Firm Structure",
            "Summary": "Choice International Limited announces statutory auditor M S K A & Associates' conversion from partnership to LLP structure under regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1768574202991,
            "Source": "stocks"
        },
        {
            "Title": "Choice International Subsidiary Wins IPPB Contract",
            "Summary": "Choice International Ltd's subsidiary Choice Wealth secured a mutual fund aggregator contract from India Post Payment Bank, expanding nationwide investment service access through IPPB's extensive network.",
            "Sentiment": "positive",
            "PublishDate": 1767864951070,
            "Source": "co_actions_results"
        },
        {
            "Title": "Choice International Promoter Releases Share Pledge",
            "Summary": "Patodia Properties releases ₹106.31 crore worth of pledged shares in Choice International while creating new encumbrance for ₹40 crore loan facility from Aditya Birla Capital.",
            "Sentiment": "neutral",
            "PublishDate": 1767331800661,
            "Source": "co_actions_results"
        },
        {
            "Title": "Soansrishti Properties Discloses Substantial Shareholding Changes Following Warrant Conversion",
            "Summary": "Soansrishti Properties Private Limited filed disclosures under SEBI regulations following the allotment of equity shares upon conversion of warrants by Choice International Limited on December 5, 2025. The company's equity share capital increased from INR 214.79 crores to INR 222.78 crores, with promoter group holding reaching 57.37% of total voting capital.",
            "Sentiment": "neutral",
            "PublishDate": 1765343483358,
            "Source": "corporate_action"
        },
        {
            "Title": "Choice International Limited Raises INR 179.72 Crore Through Equity Share Conversion",
            "Summary": "Choice International Limited received INR 179.72 crore from the conversion of 79,87,667 equity shares, increasing its paid-up share capital to INR 222.77 crore. The equity conversion strengthens the company's capital base and provides additional funds for business operations.",
            "Sentiment": "positive",
            "PublishDate": 1764932328902,
            "Source": "corporate_action"
        },
        {
            "Title": "Choice International Allots 58 Lakh Equity Shares Through Warrant Conversion Worth INR 130.50 Crores",
            "Summary": "Choice International Limited allotted 58,00,000 equity shares upon conversion of warrants to Plutus Wealth Management LLP (40 lakh shares for INR 90 crores) and Soansrishti Properties Private Limited (18 lakh shares for INR 40.50 crores). The company's paid-up equity share capital increased to INR 214.79 crores consisting of 21.48 crore equity shares, with 79.87 lakh warrants still outstanding for conversion.",
            "Sentiment": "positive",
            "PublishDate": 1764332061818,
            "Source": "corporate_action"
        },
        {
            "Title": "Choice International Promoter Pledges 600,000 Shares to ICICI Bank",
            "Summary": "Arun Kumar Poddar, promoter of Choice International Limited, pledged 600,000 shares (3.70% of his holding, 0.28% of total share capital) to ICICI Bank on November 14, 2025. The pledge serves as collateral for credit facilities availed by M/s. TrooTribeTech Limited, with shares valued at Rs. 47.09 crores against borrowing of Rs. 100 crores, and expires on November 12, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1764046989651,
            "Source": "corporate_action"
        },
        {
            "Title": "Choice International Subsidiary Acquires Full Stake in Ayoleeza Consultants",
            "Summary": "A subsidiary of Choice International has acquired complete ownership of Ayoleeza Consultants through a full stake acquisition. This transaction expands Choice International's business portfolio through its subsidiary's complete takeover of the consulting firm.",
            "Sentiment": "positive",
            "PublishDate": 1763462619691,
            "Source": "order&deals"
        },
        {
            "Title": "Choice International Allots 33.33 Lakh Equity Shares Upon Warrant Conversion",
            "Summary": "Choice International Limited has allotted 33,33,333 equity shares of INR 10 each to Plutus Wealth Management LLP following warrant conversion. The company received INR 74.99 crores as the balance 75% consideration amount at INR 225 per warrant. This follows an earlier allotment of 60 lakh equity shares to the same entity. Post-allotment, Plutus Wealth Management's shareholding increased from 2.92% to 4.47%. The company's paid-up equity share capital now stands at INR 208.99 crores comprising 20,89,88,833 equity shares. Outstanding warrants totaling 1,37,87,667 remain to be exercised within 18 months from the original allotment date of June 6, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1762952773058,
            "Source": "corporate_action"
        },
        {
            "Title": "Choice International Subsidiary Partners With SolarEra Green Renewables, Dilutes 49% Stake",
            "Summary": "Choice International's subsidiary has entered into a partnership with SolarEra Green Renewables for solar project development. As part of this arrangement, Choice International is diluting a 49% stake in its step-down subsidiaries.",
            "Sentiment": "neutral",
            "PublishDate": 1762433069446,
            "Source": "stock"
        },
        {
            "Title": "Choice International Limited Submits Earnings Call Transcript for Q2 & H1 FY26 Results",
            "Summary": "Choice International Limited has submitted the transcript of its earnings conference call to BSE and NSE. The call was held on October 17, 2025, discussing the company's unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The transcript is also available on the company's website. The submission was made by Company Secretary Karishma Shah in compliance with SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1761308738775,
            "Source": "earnings"
        },
        {
            "Title": "Choice International Expands Wealth Management Business Through Strategic Acquisitions and Alliances",
            "Summary": "Choice International has expanded its wealth management operations through multiple strategic moves. The company acquired Fintoo Group's distribution business, adding ₹300 crores in assets under management (AUM). It also acquired Glory Prime Wealth, contributing ₹210 crores AUM. Additionally, Choice International formed a strategic alliance with mutual fund distributors, which added ₹125 crores AUM. These transactions collectively increased the company's total AUM by ₹635 crores across its wealth management division.",
            "Sentiment": "positive",
            "PublishDate": 1761197039831,
            "Source": "order&deals"
        },
        {
            "Title": "Choice International Limited Releases Audio Recording of Q2 & H1 FY26 Earnings Call",
            "Summary": "Choice International Limited has provided an audio recording of their earnings conference call held on October 18, 2025. The call discussed the company's unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025. The audio recording has been made available on the company's website and was shared with BSE and NSE exchanges. Company Secretary Karishma Shah signed the communication to the exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1760787439063,
            "Source": "earnings"
        },
        {
            "Title": "Choice International Limited Signs MoU to Acquire 51% Stake in Fintoo Wealth for INR 10 Crores",
            "Summary": "Choice International Limited has entered into a Memorandum of Understanding to acquire a 51% equity stake in Fintoo Wealth Private Limited, a SEBI-registered Investment Advisory firm, for up to INR 10 crores. The transaction is subject to SEBI approval. Additionally, Choice International's subsidiary companies have entered into definitive agreements to acquire the distribution business of the Fintoo Group for up to INR 15 crores. The Fintoo Group's distribution business includes wealth products, insurance products, Alternative Investment Funds (AIFs), and Portfolio Management Services, currently operated under Mihika Financial Services Private Limited and Mihika Insurance Marketing Firm LLP.",
            "Sentiment": "positive",
            "PublishDate": 1760720805559,
            "Source": "order&deals"
        },
        {
            "Title": "Choice International Targets 35-40% Revenue Growth Through Tech-Enabled Services",
            "Summary": "Choice International has provided guidance for 35-40% revenue compound annual growth rate (CAGR). The company's growth strategy focuses on tech-enabled wealth management and NBFC (Non-Banking Financial Company) verticals, expansion of government advisory business, and leveraging strong annuity income visibility.",
            "Sentiment": "positive",
            "PublishDate": 1760631983112,
            "Source": "stock"
        },
        {
            "Title": "Choice International Reports 21.7% Revenue Growth in Q2 FY2026 with Net Profit Rising to Rs 5,646 Lakhs",
            "Summary": "Choice International Limited reported consolidated revenue from operations of Rs 27,443.26 lakhs for the quarter ended September 30, 2025, representing a 10.9% increase compared to Rs 24,739.31 lakhs in the same quarter last year. Net profit after tax grew to Rs 5,646.31 lakhs from Rs 4,645.02 lakhs year-over-year. For the half-year period, revenue reached Rs 50,905.60 lakhs versus Rs 44,803.80 lakhs previously, while net profit increased to Rs 10,442.42 lakhs from Rs 7,846.02 lakhs. The company converted 60 lakh warrants into equity shares, receiving Rs 13,500 lakhs from Plutus Wealth Management LLP. Choice International made strategic investments including acquiring Choice AMC Private Limited as a wholly owned subsidiary for Rs 5,611 lakhs and investing Rs 9,951.75 lakhs in subsidiary Choice Finserv Private Limited. The company operates through three main business segments: Broking Services (Rs 16,073.30 lakhs revenue), Advisory Services (Rs 7,904.83 lakhs), and NBFC Services (Rs 4,286.97 lakhs) for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1760624394840,
            "Source": "earnings"
        },
        {
            "Title": "Choice International Secures ₹140 Crore Order",
            "Summary": "Choice International has secured an order worth ₹140 crore. The company announced this business development, though specific details about the nature of the order, client, or timeline were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1755847945678,
            "Source": "order&deals"
        },
        {
            "Title": "Choice Finserv Receives BSE Approval for Non-Convertible Debentures Listing",
            "Summary": "Choice Finserv Private Limited, a material subsidiary of Choice International Limited, has received approval from BSE Limited for listing its Secured, Rated, Listed, Fully Paid, Redeemable, Taxable, Non-Convertible Debentures. The approval enables the subsidiary to list its debt securities on the BSE platform.",
            "Sentiment": "positive",
            "PublishDate": 1755172579666,
            "Source": "corporate_action"
        },
        {
            "Title": "Choice International Receives SEBI Approval to Launch Choice Mutual Fund",
            "Summary": "Choice International Limited has received SEBI approval to act as a sponsor for a mutual fund, with registration granted for 'Choice Mutual Fund'. The company's wholly owned subsidiary, Choice AMC Private Limited, has been approved to operate as the Asset Management Company. The company plans to begin operations with a phased rollout starting with passive investment products including Index Funds and Exchange Traded Funds (ETFs). CEO Arun Poddar described this as a significant milestone in expanding their financial services portfolio. Choice Group currently serves over 14 lakh clients through a network of more than 58,000 business associates and ranks among the top 20 brokers in the country.",
            "Sentiment": "positive",
            "PublishDate": 1754045661006,
            "Source": "mutualfunds"
        },
        {
            "Title": "Choice International Reports 50% PAT Growth in Q1 FY26, Expands Branch Network to 208",
            "Summary": "Choice International Limited reported revenue of Rs. 238 crore for Q1 FY26, marking 16% year-over-year growth. The company achieved profit after tax of Rs. 48 crore, representing 50% growth compared to the previous year, with PAT margin improving to 20.16%. EBITDA stood at Rs. 87 crore with 49% growth and margins at 36.48%. The company expanded its branch network to 208 from 149 a year ago and grew demat accounts to 11.5 lakh, up 29% year-over-year. Total client assets in stock broking reached Rs. 47,800 crore with 16% growth, while wealth products AUM grew 443% to Rs. 4,769 crore. The advisory business secured new orders worth Rs. 63.5 crore across Maharashtra and Odisha, including a Rs. 52.8 crore World Bank-backed project. The company's Choice Business Associate network expanded to over 58,000 associates. Management expects to maintain 25-30% growth rate for the next 3-4 years and plans to launch their first mutual fund ETF before Diwali following SEBI's final approval process.",
            "Sentiment": "positive",
            "PublishDate": 1753709252475,
            "Source": "earnings"
        },
        {
            "Title": "Choice International Plans to Launch First Mutual Fund Product with ETF Funds Before Diwali",
            "Summary": "Choice International announced plans to introduce its first mutual fund product featuring ETF funds before Diwali. The company has received final approval from SEBI for this launch. This information was shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1753242488784,
            "Source": "mutualfunds"
        },
        {
            "Title": "Choice International Reports 443% Growth in Wealth Products AUM to Rs 47,690 Crore",
            "Summary": "Choice International announced that its Assets Under Management (AUM) for wealth products has reached Rs 47,690 crore, representing a 443% year-over-year growth. The company outlined plans to achieve 25-30% yearly growth over the next 3-4 years during a recent conference call.",
            "Sentiment": "positive",
            "PublishDate": 1753242022848,
            "Source": "stock"
        },
        {
            "Title": "Choice International Reports Strong Q1 FY26 Results with 16% Revenue Growth and 50% PAT Surge",
            "Summary": "Choice International Limited reported robust quarterly results with revenue rising 16% year-on-year to Rs. 238 crores and profit after tax surging 50% to Rs. 47.96 crores. The company saw growth across all business segments - stock broking contributed 60% of revenue, advisory 24%, and NBFC 16%. Key operational metrics showed strong momentum with demat accounts growing 29% to 11.50 lakh, client assets under stock broking increasing 16% to Rs. 47,800 crores, and wealth products AUM jumping 443% to Rs. 4,769 crores. The insurance segment generated Rs. 76 crores in premium (up 62%) with 39,182 policies sold (up 46%). The NBFC segment maintained a total loan book of Rs. 745 crores with retail loans at Rs. 596 crores and net NPAs at 2.25%. The company expanded its branch network to 208 locations and secured government advisory mandates worth Rs. 130 crores during the quarter. The board also approved the re-appointment of two independent directors and scheduled the 32nd Annual General Meeting for September 17, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753160965051,
            "Source": "earnings"
        },
        {
            "Title": "Choice International Plans Multi-Vertical Growth Through Fintech Platform",
            "Summary": "Choice International has outlined plans for rapid expansion across multiple business verticals using technology and its fintech platform. The company's growth strategy includes expanding lending operations, pursuing advisory projects, and promoting financial inclusion through its technology platform.",
            "Sentiment": "positive",
            "PublishDate": 1753110423234,
            "Source": "stock"
        },
        {
            "Title": "Choice International Reports Strong Q1 Performance with 56% Jump in EBITDA",
            "Summary": "Choice International delivered robust quarterly results with EBITDA rising to 827 million rupees from 530 million rupees year-over-year. The company's EBITDA margin expanded significantly to 35.37% compared to 26.39% in the same period last year. Consolidated net profit increased to 480 million rupees from 320 million rupees year-over-year, while revenue grew to 2.34 billion rupees from 2 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753096318501,
            "Source": "earnings"
        },
        {
            "Title": "Choice International Incorporates Step-down Subsidiary for Solar Projects",
            "Summary": "Choice International has incorporated a new step-down subsidiary named 'Choice Green Energy Solutions'. This new entity will focus on developing solar projects, including power generation, supply, and sales. It will also be involved in constructing renewable energy facilities.",
            "Sentiment": "positive",
            "PublishDate": 1750983031000,
            "Source": "default"
        },
        {
            "Title": "Choice International Forms Subsidiary for Renewable Energy Projects",
            "Summary": "Choice International has established a step-down subsidiary named 'Choice Green Energy Solutions'. This new entity is intended to develop solar projects and construct renewable energy facilities.",
            "Sentiment": "positive",
            "PublishDate": 1750942828000,
            "Source": "default"
        },
        {
            "Title": "Choice International to Acquire 50% Stake in Subsidiary",
            "Summary": "Choice International has announced plans to acquire a 50% stake in its subsidiary, Choice Insurance Broking India. The acquisition is valued at 625 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1750251863000,
            "Source": "default"
        },
        {
            "Title": "Choice International Secures ₹63.5 Crore Order",
            "Summary": "Choice International has secured an order valued at ₹63.5 crores. No further details about the order or the company's operations were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1749097857000,
            "Source": "default"
        },
        {
            "Title": "Societe Generale Acquires 11 Lakh Shares of Choice International",
            "Summary": "Societe Generale has purchased 11 lakh shares of Choice International through the open market at a price of 705.2 per share.",
            "Sentiment": "positive",
            "PublishDate": 1749082116000,
            "Source": "default"
        },
        {
            "Title": "Choice International: BNP Paribas Sells Rs 78 Crore Stake in Block Deal",
            "Summary": "BNP Paribas sold 11 lakh shares of Choice International for Rs 78 crore at Rs 705.20 per share. Societe Generale purchased nearly the same amount. The transaction occurred on Wednesday, with the stock closing at Rs 704.55 on the NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1749052456000,
            "Source": "block_deals"
        },
        {
            "Title": "Societe Generale Acquires Shares in Choice International",
            "Summary": "Societe Generale has acquired 1.1 million shares of Choice International through the open market at a price of ₹705.2 per share.",
            "Sentiment": "positive",
            "PublishDate": 1749050457000,
            "Source": "default"
        },
        {
            "Title": "Choice International Establishes New Subsidiary for Solar Power",
            "Summary": "Choice International has incorporated a new subsidiary called Choice Green Energy MH-1 Private Limited. This new entity will be focused on operations in the solar power sector.",
            "Sentiment": "positive",
            "PublishDate": 1747302473000,
            "Source": "default"
        },
        {
            "Title": "Choice International Reports Strong Q4 Financial Results",
            "Summary": "Choice International has announced its Q4 financial results. The company's consolidated net profit increased to 535.2 million rupees, up from 394 million rupees year-over-year and 307.4 million rupees quarter-over-quarter. Revenue for Q4 also saw growth, reaching 2.53 billion rupees compared to 2.15 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1745367698000,
            "Source": "default"
        },
        {
            "Title": "Choice International Reports Strong Q4 Financial Results",
            "Summary": "Choice International has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 962.5 million rupees from 675 million rupees, with the EBITDA margin expanding to 38.04% from 31.46%. Revenue grew to 2.53 billion rupees from 2.15 billion rupees. Consolidated net profit rose to 535.2 million rupees, up from 394 million rupees year-over-year and 307.4 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745342268000,
            "Source": "result"
        },
        {
            "Title": "Choice International to Consider Q4 Results on April 22",
            "Summary": "Choice International has announced that it will be considering its fourth quarter (Q4) financial results on April 22. This indicates the company is preparing to release its latest quarterly earnings report.",
            "Sentiment": "neutral",
            "PublishDate": 1744812076000,
            "Source": "default"
        },
        {
            "Title": "Choice International Subsidiary Secures 45 MW Power Plant Order in Maharashtra",
            "Summary": "A subsidiary of Choice International has been awarded a contract to set up a 45 MW power plant in Maharashtra. This project is expected to generate annual revenue of over Rs 20 crore for the company.",
            "Sentiment": "positive",
            "PublishDate": 1744358934000,
            "Source": "order&deals"
        },
        {
            "Title": "Choice International Acquires Full Ownership of Choice AMC for Mutual Fund Setup",
            "Summary": "Choice International has announced that it has gained complete ownership of Choice Asset Management Company (AMC) as part of its strategy to establish a mutual fund business. This acquisition represents a significant step for Choice International in expanding its financial services portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1743777805000,
            "Source": "corporate_action"
        },
        {
            "Title": "Choice International Acquires Arete Capital Services",
            "Summary": "Choice International has announced the completion of a transaction that has resulted in Arete Capital Services becoming its wholly owned subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1743171547000,
            "Source": "corporate_action"
        },
        {
            "Title": "Choice International Schedules Analyst and Investor Meeting",
            "Summary": "Choice International has announced a meeting with analysts and investors scheduled for March 19. This suggests the company is preparing to share important information or updates with financial stakeholders.",
            "Sentiment": "neutral",
            "PublishDate": 1741879845000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Choice International to Acquire Stake in Arete Capital Services",
            "Summary": "Choice International has announced plans to purchase a stake in Arete Capital Services for 360 million rupees. This acquisition represents a significant corporate action that could potentially impact the company's financial position and strategic direction.",
            "Sentiment": "neutral",
            "PublishDate": 1739838599000,
            "Source": "corporate_action"
        },
        {
            "Title": "Choice International to Acquire Stake in Arete Capital Services",
            "Summary": "Choice International has announced plans to purchase a stake in Arete Capital Services for 360 million rupees. This acquisition represents a significant corporate action that could potentially impact the company's financial position and strategic direction.",
            "Sentiment": "neutral",
            "PublishDate": 1739797414000,
            "Source": "corporate_action"
        },
        {
            "Title": "Choice International Reports Q3 Financial Results",
            "Summary": "Choice International has announced its Q3 financial results. The company's consolidated net profit for the quarter stood at 307 million rupees, compared to 403 million rupees in the same quarter last year and 465 million rupees in the previous quarter. The Q3 revenue was reported at 2.1 billion rupees, slightly up from 2.07 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1738197196000,
            "Source": "earnings"
        },
        {
            "Title": "Choice International Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Choice International has reported a decrease in its third quarter EBITDA, which fell to 596 million rupees from 667 million rupees in the same period last year. The company's EBITDA margin also declined, dropping to 28.45% from 32.19% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738160630000,
            "Source": "earnings"
        },
        {
            "Title": "Choice International Reports Q3 Financial Results",
            "Summary": "Choice International has announced its Q3 financial results. The company's consolidated net profit for the quarter stands at 307 million rupees, showing a decrease from 403 million rupees year-over-year and 465 million rupees quarter-over-quarter. However, the Q3 revenue increased slightly to 2.1 billion rupees from 2.07 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738160579000,
            "Source": "earnings"
        },
        {
            "Title": "Choice International to Consider Q3 Results",
            "Summary": "Choice International has announced that it will consider its third quarter (Q3) financial results on January 29. This indicates the company is preparing to release its quarterly earnings report, which will provide insights into its financial performance for the most recent three-month period.",
            "Sentiment": "neutral",
            "PublishDate": 1737638720000,
            "Source": "result"
        }
    ]
}