{
    "Symbol": "CHOLAHLDNG",
    "ISIN": "INE149A01033",
    "News": [
        {
            "Title": "Cholamandalam Financial Holdings Q3FY26 Results",
            "Summary": "Cholamandalam Financial Holdings reports consolidated PAT of ₹1,385.82 crores for Q3FY26, up 27% YoY. Nine months PAT reached ₹3,859.63 crores, growing 14% from previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770629082010,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cholamandalam Financial Holdings Block Trade",
            "Summary": "Cholamandalam Financial Holdings witnessed a significant NSE block trade worth ₹17.17 crores involving 100,472 shares at ₹1,709.10 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768888217811,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cholamandalam Financial Holdings Q3FY26 Board Meet",
            "Summary": "Cholamandalam Financial Holdings schedules board meeting on February 9, 2026 to approve Q3FY26 unaudited financial results. Trading window closed from January 1-11, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768391478759,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cholamandalam Financial Holdings Sees Rs. 54.48 Crore Block Trade on NSE",
            "Summary": "Cholamandalam Financial Holdings Ltd. witnessed a block trade worth Rs. 54.48 crores involving approximately 299,827 shares at Rs. 1,817.10 per share on the NSE. The transaction represents a significant institutional or bulk investor activity in the financial services company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1764310072864,
            "Source": "order&deals"
        },
        {
            "Title": "Cholamandalam Financial Holdings Receives Stock Exchange Approvals for Promoter Group Reclassification",
            "Summary": "Both NSE and BSE have granted no-objection approvals for the de-classification of Yanmar Coromandel Agrisolutions Private Limited from Cholamandalam Financial Holdings Limited's promoter and promoter group category. The approvals were issued on November 25, 2025, following the company's application dated November 11, 2025, under SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764090670309,
            "Source": "corporate_action"
        },
        {
            "Title": "Cholamandalam Financial Holdings Reports Q2 FY26 Results with 115.3% Combined Ratio",
            "Summary": "Cholamandalam MS General Insurance recorded gross direct premium of INR 1,835 crores for Q2 and INR 3,647 crores for H1. The company lost crop insurance business due to retender, impacting quarterly GDPI by INR 323 crores. Motor business maintained 5.3% market share with composition of 52% cars, 37% commercial vehicles, and 12% two-wheelers. Combined ratio for H1 stood at 115.3%, which reduces to 112.1% without I/n effect. Claims ratio at 81.9% for Q2 and 81.5% for H1 were higher than previous year levels. The company stepped up motor third-party reserving, with provisioning levels 10% higher than peers. Investment corpus reached INR 18,380 crores with mark-to-market gains of INR 500 crores. PBT for H1 was INR 266 crores with return on equity at 6.2%. Solvency ratio maintained at comfortable 2.112x. Management expects combined ratio improvement in H2 and targets motor OD loss ratio reduction of 5 percentage points. The company also submitted applications to stock exchanges seeking reclassification of Yanmar Coromandel Agrisolutions from promoter group to public shareholder category.",
            "Sentiment": "neutral",
            "PublishDate": 1762891834772,
            "Source": "earnings"
        },
        {
            "Title": "Cholamandalam Financial Holdings Reports Q2 Net Profit Growth to 5.5B Rupees",
            "Summary": "Cholamandalam Financial Holdings reported Q2 consolidated net profit of 5.5 billion rupees compared to 5.25 billion rupees in the same period last year. The company's Q2 revenue increased to 94.6 billion rupees from 81 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762505543547,
            "Source": "earnings"
        },
        {
            "Title": "Cholamandalam Financial Holdings Schedules Quarterly Results Review",
            "Summary": "Cholamandalam Financial Holdings will review its quarterly results on November 7. The company has announced this date for examining its financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1760094547716,
            "Source": "earnings"
        },
        {
            "Title": "Cholamandalam Financial Holdings Sees Rs. 25.98 Crore Block Trade on NSE",
            "Summary": "Cholamandalam Financial Holdings Ltd. witnessed a block trade worth Rs. 25.98 crores on the National Stock Exchange. The transaction involved approximately 143,790 shares at a price of Rs. 1,806.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1759128962569,
            "Source": "order&deals"
        },
        {
            "Title": "Yanmar Coromandel Agrisolutions Seeks Reclassification from Promoter Group to Public Shareholder in Cholamandalam Financial Holdings",
            "Summary": "Yanmar Coromandel Agrisolutions Private Limited has requested reclassification from promoter group to public category shareholder in Cholamandalam Financial Holdings Limited. The request was made through a letter dated September 16, 2025, seeking the change under Regulation 31A of SEBI Listing Regulations. Currently, Yanmar Coromandel Agrisolutions holds no paid-up equity shares in the company. The reclassification requires approval from Cholamandalam Financial Holdings' Board of Directors and both the National Stock Exchange of India Limited and BSE Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1758106223304,
            "Source": "corporate_action"
        },
        {
            "Title": "Cholamandalam Financial Holdings Sees Rs. 142.27 Crore Block Trade on NSE",
            "Summary": "Cholamandalam Financial Holdings Ltd. executed a block trade worth Rs. 142.27 crores on the National Stock Exchange. The transaction involved approximately 753,970 shares at a price of Rs. 1,887.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1755749665280,
            "Source": "order&deals"
        },
        {
            "Title": "Cholamandalam Financial Holdings Reports Q1 FY26 Results with 114.8% Combined Ratio",
            "Summary": "Cholamandalam Financial Holdings reported quarterly results with gross written premium of INR 1,997 crores compared to INR 1,945 crores in the previous year's corresponding quarter. The company's motor insurance market share stood at 5.2% with a composition of 50% cars, 38% commercial vehicles, and 12% two-wheelers. The claims ratio increased to 81% from the previous year, impacted by enhanced motor third-party reserving (3.53% impact) and large fire claims (1.78% impact). The combined ratio reached 114.8%, or 111.5% without the 1/n effect. Expense of management improved to 30.4% from 33.3% in the corresponding quarter last year. The company reported profit before tax of INR 145 crores with return on equity at 3.45% and solvency ratio at 2.17x. The investment portfolio corpus exceeded INR 18,140 crores with mark-to-market gains of over INR 690 crores. The company expects a drop of approximately INR 500 crores in crop insurance premium due to business shifting to AIC in Maharashtra, Bengal, and Odisha. Reinsurance accepted business increased to 9% of total GWP from 2% last year, expected to remain at 8-10% range.",
            "Sentiment": "negative",
            "PublishDate": 1755155836731,
            "Source": "earnings"
        },
        {
            "Title": "Cholamandalam Financial Holdings Reports 8.6% Rise in Quarterly Profit to Rs 1,259 Crore",
            "Summary": "Cholamandalam Financial Holdings reported a consolidated profit after tax of Rs 1,259.54 crore for the April-June 2025 quarter, up from Rs 1,159.56 crore in the same period last year. The Murugappa Group company's consolidated total income grew to Rs 9,382.95 crore from Rs 7,677.43 crore year-on-year. For the full financial year ending March 2025, consolidated PAT was Rs 4,739.88 crore with total income of Rs 33,459.92 crore. Cholamandalam Investment and Finance Company, in which the holding company has a 44.34% stake, disbursed Rs 24,325 crore during the quarter. The general insurance subsidiary registered gross written premium of Rs 2,073 crore, up from Rs 1,957 crore, but its profit declined to Rs 119 crore from Rs 211 crore due to changes in fair value of equity instruments and increased loss ratios in motor, health and fire segments.",
            "Sentiment": "positive",
            "PublishDate": 1754665068449,
            "Source": "earnings"
        },
        {
            "Title": "Cholamandalam Financial Holdings Reports Higher Q1 Profit and Revenue",
            "Summary": "Cholamandalam Financial Holdings reported consolidated net profit of 5.8 billion rupees in Q1, compared to 5.5 billion rupees in the same period last year. The company's revenue increased to 92.96 billion rupees from 76.3 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754642953305,
            "Source": "earnings"
        },
        {
            "Title": "Cholamandalam Financial Holdings: Q4 PAT Rises to Rs 1,362.18 Crore",
            "Summary": "Cholamandalam Financial Holdings reported a consolidated Q4 FY2025 PAT of Rs 1,362.18 crore, up from Rs 1,143.75 crore year-over-year. Full-year PAT increased to Rs 4,739.88 crore. The company's board recommended a final dividend of 130% (Rs 1.30 per share).",
            "Sentiment": "positive",
            "PublishDate": 1746797682000,
            "Source": "earnings"
        },
        {
            "Title": "Cholamandalam Financial Holdings Reports Q4 FY23 Results",
            "Summary": "Cholamandalam Financial Holdings announced its Q4 financial results. The company's total income increased to 89.1 billion rupees from 70.6 billion rupees year-over-year. The consolidated net profit rose to 6.1 billion rupees from 5.13 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1746782282000,
            "Source": "result"
        },
        {
            "Title": "Cholamandalam Financial Holdings Ltd. Block Trade",
            "Summary": "A block trade of approximately 127,344 shares of Cholamandalam Financial Holdings Ltd. was executed on the NSE for Rs. 24.10 Crores at a price of Rs. 1892.80 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1745822386000,
            "Source": "block_details"
        },
        {
            "Title": "Cholamandalam Financial Holdings Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 303,201 shares of Cholamandalam Financial Holdings Ltd. was executed on the National Stock Exchange (NSE) at a price of Rs. 1973.20 per share. The total value of the transaction amounted to Rs. 59.83 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1745298138000,
            "Source": "block_details"
        },
        {
            "Title": "Cholamandalam Financial Holdings Reports Q3 Revenue Growth",
            "Summary": "Cholamandalam Financial Holdings has announced its third-quarter revenue results. The company reported revenue of 84.9 billion rupees, compared to 68 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738918568000,
            "Source": "earnings"
        },
        {
            "Title": "Cholamandalam Financial Holdings Reports Q3 Consolidated Net Profit Increase",
            "Summary": "Cholamandalam Financial Holdings has reported a consolidated net profit of 4.9 billion rupees for the third quarter, compared to 4.7 billion rupees in the same period last year, indicating a year-over-year increase in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1738918528000,
            "Source": "earnings"
        },
        {
            "Title": "Cholamandalam Financial Holdings Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 406,712 shares of Cholamandalam Financial Holdings Ltd. occurred on the National Stock Exchange (NSE). The trade was valued at Rs. 58.73 crores, with each share priced at Rs. 1443.90.",
            "Sentiment": "neutral",
            "PublishDate": 1737690779000,
            "Source": "block_deals"
        },
        {
            "Title": "Cholamandalam Financial Holding to Consider Q3 Results",
            "Summary": "Cholamandalam Financial Holding has announced that it will consider its third quarter (Q3) financial results on February 7. This indicates the company is preparing to release its earnings report for the latest fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1736773656000,
            "Source": "earnings"
        },
        {
            "Title": "InCred Downgrades Cholamandalam Financial Holdings",
            "Summary": "InCred has downgraded Cholamandalam Financial Holdings stock from 'Add' to 'Hold' and significantly reduced the target price from 1550 to 1300. This represents a substantial decrease in the expected value of the stock.",
            "Sentiment": "negative",
            "PublishDate": 1734407812000,
            "Source": "normal_news"
        },
        {
            "Title": "Cholamandalam Financial Holdings Reports Q2 Revenue Growth",
            "Summary": "Cholamandalam Financial Holdings announced its second quarter revenue of 81 billion rupees, compared to 63.2 billion rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731058765000,
            "Source": "result"
        },
        {
            "Title": "Cholamandalam Financial Holdings Reports Q2 Profit Increase",
            "Summary": "Cholamandalam Financial Holdings has reported a consolidated net profit of 5.25 billion rupees for the second quarter, compared to 4.2 billion rupees in the same period last year. This represents a year-over-year increase in profit.",
            "Sentiment": "positive",
            "PublishDate": 1731058723000,
            "Source": "result"
        }
    ]
}