{
    "Symbol": "CHOLAFIN",
    "ISIN": "INE121A01024",
    "News": [
        {
            "Title": "Cholamandalam Investment Allots 40,600 ESOP Shares",
            "Summary": "Cholamandalam Investment and Finance Company's Nomination and Remuneration Committee approved allotment of 40,600 equity shares of Rs.2/- each under employee stock option scheme. Company to apply for final listing on NSE and BSE.",
            "Sentiment": "positive",
            "PublishDate": 1770051601476,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chola Finance Reclassifies Algavista Greentech",
            "Summary": "Cholamandalam Investment board approves reclassification of Algavista Greentech Private Limited from promoter group to public category under SEBI regulations, subject to stock exchange approval.",
            "Sentiment": "neutral",
            "PublishDate": 1769779182066,
            "Source": "stocks"
        },
        {
            "Title": "Cholamandalam Investment Q3 FY26 Results",
            "Summary": "Cholamandalam Investment reports strong Q3 FY26 performance with PAT of ₹1,287.66 crores (19% YoY growth), total income of ₹7,985.36 crores, and AUM reaching ₹2,27,770 crores. Board approves 65% interim dividend.",
            "Sentiment": "positive",
            "PublishDate": 1769776589554,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cholamandalam Investment Allots ₹1000 Cr Securities",
            "Summary": "Cholamandalam Investment and Finance Company successfully allotted 100000 secured non-convertible securities worth ₹1000 crores through private placement on NSE EBP platform with 7.83% coupon rate.",
            "Sentiment": "positive",
            "PublishDate": 1769613850655,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chola Finance Q3FY26 Earnings Call on Feb 2",
            "Summary": "Cholamandalam Investment and Finance Company has scheduled its Q3FY26 earnings call for February 2, 2026, at 10:00 AM IST, organized by Kotak Institutional Equities to discuss quarterly results.",
            "Sentiment": "neutral",
            "PublishDate": 1769169059685,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chola Finance Board to Consider Interim Dividend",
            "Summary": "Cholamandalam Investment and Finance Company Limited has scheduled a board meeting for January 30, 2026, to consider an interim dividend proposal for FY2026.",
            "Sentiment": "positive",
            "PublishDate": 1769167579223,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cholamandalam Investment Allots ₹400 Cr Securities",
            "Summary": "Cholamandalam Investment and Finance Company successfully allotted 40,000 secured non-convertible securities worth ₹400 crores through private placement on NSE's WDM segment with 7.73% annual coupon rate.",
            "Sentiment": "positive",
            "PublishDate": 1768922321304,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chola Finance Gets Stock Exchange Nod for Promoter Reclassification",
            "Summary": "Cholamandalam Investment and Finance Company received NSE and BSE approval to reclassify two promoter group entities - Yanmar Coromandel Agrisolutions and Coromandel Engineering - to public category under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768032122010,
            "Source": "stocks"
        },
        {
            "Title": "Chola Finance Allots 76.31L Equity Shares via CCD Conversion",
            "Summary": "Cholamandalam Investment converts 1.06L CCDs worth ₹1,063 crores into 76.31 lakh equity shares at ₹1,392.88 per share following applications from six CCD holders during January conversion window.",
            "Sentiment": "positive",
            "PublishDate": 1767861335093,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cholamandalam Investment Board Meet on Jan 30, 2026",
            "Summary": "Cholamandalam Investment and Finance Company Limited has scheduled a board meeting on January 30, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767374243605,
            "Source": "co_actions_results"
        },
        {
            "Title": "Morgan Stanley Raises Cholamandalam Target to ₹1,640",
            "Summary": "Morgan Stanley maintains Equal Weight rating on Cholamandalam Investment while increasing target price to ₹1,640 from ₹1,540, representing a 6.49% upward revision.",
            "Sentiment": "positive",
            "PublishDate": 1767066730653,
            "Source": "stocks"
        },
        {
            "Title": "Cholamandalam Investment Allots ₹1,001 Cr Securities",
            "Summary": "Cholamandalam Investment and Finance Company Limited has allotted secured non-convertible securities worth ₹1,001 crores under private placement with 8.20% coupon rate and 2.15 years maturity.",
            "Sentiment": "neutral",
            "PublishDate": 1766591943278,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chola Management Defends Against Governance Allegations",
            "Summary": "Cholamandalam Investment management strongly refuted governance allegations, calling them inconsistent and lacking context. Arul Selvan D clarified insurance transactions and executive compensation practices.",
            "Sentiment": "positive",
            "PublishDate": 1766586670189,
            "Source": "stocks"
        },
        {
            "Title": "Cholamandalam Investment Issues Detailed Response",
            "Summary": "Cholamandalam Investment provides comprehensive clarification on allegations, reports strong financial position with ₹14,900 crores cash and 19.79% CAR as of November 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766462920779,
            "Source": "stocks"
        },
        {
            "Title": "Cholamandalam Investment Allots 98,980 Shares",
            "Summary": "Cholamandalam Investment and Finance Company Limited has allotted 98,980 equity shares of ₹2 each to employees under its Employee Stock Option Scheme following committee approval.",
            "Sentiment": "neutral",
            "PublishDate": 1766022645544,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cholamandalam Investment Allots ₹1000 Crore Secured Non-Convertible Securities",
            "Summary": "Cholamandalam Investment and Finance Company has allotted 50,000 secured non-convertible securities through private placement with a coupon rate of 7.36% and maturity date of December 2, 2028. The securities are part of a ₹1000 crore issue including ₹500 crore greenshoe option, listed in the WDM segment of NSE with annual coupon payments.",
            "Sentiment": "neutral",
            "PublishDate": 1764690364835,
            "Source": "corporate_action"
        },
        {
            "Title": "Cholamandalam Investment Allots 88,583 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Cholamandalam Investment and Finance Company's Nomination and Remuneration Committee approved allotment of 88,583 equity shares of Rs. 2/- each to employees who exercised their stock options. The company will apply for final listing of these shares on NSE and BSE to complete the formalities.",
            "Sentiment": "neutral",
            "PublishDate": 1764349881099,
            "Source": "corporate_action"
        },
        {
            "Title": "Cholamandalam Investment Issues Rs 1000 Crore Unsecured Subordinated Securities",
            "Summary": "Cholamandalam Investment and Finance Company Limited has allotted 50,000 unsecured subordinated non-convertible securities through private placement with a total issue size of Rs 1000 crores including Rs 500 crores greenshoe option. The securities carry a 2.40% annual coupon rate with payment dates on November 25 every year and maturity on November 25, 2032, and are listed in the WDM segment of NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1764082980807,
            "Source": "corporate_action"
        },
        {
            "Title": "Cholamandalam Investment Allots 123,440 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Cholamandalam Investment and Finance Company's Nomination and Remuneration Committee approved the allotment of 123,440 equity shares of Rs. 2/- each to employees who exercised their stock options. The company will apply for final listing of these shares on NSE and BSE to complete the formalities.",
            "Sentiment": "neutral",
            "PublishDate": 1763655990550,
            "Source": "corporate_action"
        },
        {
            "Title": "Cholamandalam Investment Files Application for Promoter Group Re-classification to Public Category",
            "Summary": "Cholamandalam Investment and Finance Company Limited filed an application with NSE and BSE for re-classification of two promoter group entities to public category. The application involves Yanmar Coromandel Agrisolutions Private Limited and Coromandel Engineering Company Limited, both currently belonging to the promoter group category. The company's Board of Directors had previously approved the request from these entities for re-classification. The application was filed under Regulation 31A of SEBI Listing Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762802327241,
            "Source": "corporate_action"
        },
        {
            "Title": "Cholamandalam Investment Expects Improved Disbursement Growth in Q3",
            "Summary": "Cholamandalam Investment anticipates better disbursement growth in the third quarter. This expectation was shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1762490870948,
            "Source": "stock"
        },
        {
            "Title": "Cholamandalam Investment Sets Ambitious Growth Targets for FY27",
            "Summary": "Cholamandalam Investment has announced strategic growth targets for FY27, aiming to achieve assets under management (AUM) above ₹2.5 lakh crore. The company plans to focus on retail lending and launch a new gold loan business. The expansion strategy includes growing the branch network to over 1,800 locations while maintaining an 18% return on equity (ROE). The company targets sustaining 20% profit after tax (PAT) growth through digital platforms, AI-driven credit models, and deep rural penetration to capture high-yield segments.",
            "Sentiment": "positive",
            "PublishDate": 1762441133632,
            "Source": "stock"
        },
        {
            "Title": "Cholamandalam Investment Board Approves Reclassification of Two Promoter Group Entities to Public Category",
            "Summary": "Cholamandalam Investment and Finance Company's Board of Directors approved the reclassification of two promoter group entities - Yanmar Coromandel Agrisolutions Private Limited and Coromandel Engineering Company Limited - from promoter group category to public category. Both entities currently hold nil paid-up equity shares with nil percentage shareholding. The Board confirmed their eligibility under SEBI Listing Regulations and noted that both entities have undertaken to comply with specified requirements. The reclassification is subject to receiving no-objection from the stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1762438264904,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cholamandalam Investment Reports 20% Revenue Growth in Q2",
            "Summary": "Cholamandalam Investment and Finance Company reported quarterly revenue of Rs 74.6 billion compared to Rs 62.2 billion in the same period last year, representing a year-over-year increase of approximately 20%.",
            "Sentiment": "positive",
            "PublishDate": 1762419372458,
            "Source": "earnings"
        },
        {
            "Title": "Cholamandalam Investment Reports 19.8% Jump in Q2 Net Profit to 11.5B Rupees",
            "Summary": "Cholamandalam Investment and Finance Company reported a net profit of 11.5 billion rupees for Q2, representing a significant increase from 9.6 billion rupees in the same period last year. However, the company's asset quality indicators showed deterioration with Stage 3 levels rising to 3.35% from 3.16% in the previous quarter. Gross Non-Performing Assets (GNPA) increased to 4.57% from 4.29% quarter-on-quarter, while Net Non-Performing Assets (NNPA) rose to 3.07% from 2.86% in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762417309995,
            "Source": "earnings"
        },
        {
            "Title": "Cholamandalam Investment Block Trade Worth Rs. 50.13 Crores Executed on NSE",
            "Summary": "Cholamandalam Investment and Finance Company executed a block trade on the National Stock Exchange involving approximately 297,960 shares at a price of Rs. 1,682.30 per share. The total transaction value amounted to Rs. 50.13 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1761201648171,
            "Source": "order&deals"
        },
        {
            "Title": "Cholamandalam Investment And Finance Allocates ₹550 Crore Through NCD Private Placement",
            "Summary": "Cholamandalam Investment And Finance has allocated ₹550 crore through Non-Convertible Debentures (NCDs) via private placement. This fundraising initiative provides the company with additional capital through debt instruments issued to select investors.",
            "Sentiment": "positive",
            "PublishDate": 1760449046715,
            "Source": "corporate_action"
        },
        {
            "Title": "Cholamandalam Investment Sees Block Trade Worth Rs. 56.41 Crores on NSE",
            "Summary": "Cholamandalam Investment and Finance Company executed a block trade on the National Stock Exchange involving approximately 350,249 shares at Rs. 1,610.50 per share, totaling Rs. 56.41 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1759982215824,
            "Source": "order&deals"
        },
        {
            "Title": "Coromandel Engineering Company Limited Seeks Reclassification from Promoter Group to Public Category",
            "Summary": "Coromandel Engineering Company Limited (CECL) has requested reclassification from 'Promoter and Promoter group' category to 'Public' category for Cholamandalam Investment and Finance Company Limited. The request follows a change in control of CECL on December 29, 2023, when the Murugappa Group divested their entire shareholding in CECL through a Share Purchase Agreement executed on September 29, 2023. CECL currently holds no shares in the company and confirms it does not hold more than 10% voting rights, exercise control, have special rights, board representation, or act in concert with promoters. The request will be placed before the Board for approval under Regulation 31A of SEBI Listing Regulations, after which approvals will be sought from NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1758807126886,
            "Source": "corporate_action"
        },
        {
            "Title": "Cholamandalam Finance Expects Improved Margins as Interest Rates Fall",
            "Summary": "Cholamandalam Investment and Finance Company anticipates improvement in net interest margins over the next two quarters due to falling interest rates and lower bank lending rates reducing funding costs. CFO Arul Selvan D explained that 55% of the company's loan portfolio consists of fixed-rate loans, primarily vehicle financing, allowing the company to benefit from lower funding costs without passing rate reductions to these customers. For floating-rate products like loans against property and home loans, rate benefits will be passed to customers. The company plans gradual diversification from vehicle finance into mortgage businesses including home loans, SME loans, and secured business loans over the next three years. Cholamandalam targets 20-22% growth in assets under management for FY26, while acknowledging that new loans will need to be offered at competitive lower rates, though this will take time to significantly impact the overall loan book.",
            "Sentiment": "positive",
            "PublishDate": 1758708237528,
            "Source": "stock"
        },
        {
            "Title": "Yanmar Coromandel Agrisolutions Seeks Reclassification from Promoter Group to Public Category at Cholamandalam Investment",
            "Summary": "Cholamandalam Investment and Finance Company received a reclassification request from Yanmar Coromandel Agrisolutions Private Limited (YCAS) to move from 'Promoter and Promoter group' category to 'Public' category. The request follows a reduction in Coromandel International Limited's shareholding in YCAS from 40% to 10.60% due to a Rs.149.72 crore fund infusion by Yanmar Asia (Singapore) Corporation on September 27, 2024. YCAS allotted 11,09,00,741 equity shares of face value Rs.10 each to Yanmar Singapore. Since CIL now holds less than 20% of YCAS equity, YCAS no longer qualifies as a promoter group under SEBI regulations. YCAS currently holds no shares in Cholamandalam Investment. The request will be placed before the Board for approval, after which requisite approvals will be sought from NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1758116038195,
            "Source": "corporate_action"
        },
        {
            "Title": "Cholamandalam Investment Reduces AUM Growth Guidance to 20-23%",
            "Summary": "Cholamandalam Investment has lowered its full-year Assets Under Management (AUM) growth guidance to 20-23% from the previously projected 20-25%. The revision follows GST reductions that have impacted the company's growth outlook.",
            "Sentiment": "negative",
            "PublishDate": 1757564455536,
            "Source": "stock"
        },
        {
            "Title": "Cholamandalam Investment CFO Maintains AUM Growth Target Despite Vehicle Finance Disbursement Slowdown",
            "Summary": "Cholamandalam Investment achieved 18% AUM growth in vehicle finance despite disbursement growth of only 7%, falling short of the 15% disbursement target. CFO Arul Selvan emphasized the company focuses on AUM growth rather than disbursement growth as it drives interest income. The home loan segment showed strong 33% year-on-year AUM growth despite flat disbursement due to registration process changes in key markets like Karnataka. The company maintains its full-year AUM growth target of 20-25%, expecting improvement in Q3 and Q4 post-monsoon during festival season. Cholamandalam borrows Rs 7,000-10,000 crore monthly through various channels including ECBs, commercial papers, and NCDs. The company is expanding its new gold loan business from 75 branches to 120 branches by Q2.",
            "Sentiment": "neutral",
            "PublishDate": 1754279061189,
            "Source": "stock"
        },
        {
            "Title": "Cholamandalam Investment & Finance Reports 21% Profit Growth in Q1",
            "Summary": "Cholamandalam Investment and Finance Company, part of the Murugappa Group, reported net profit of Rs 1,135.91 crore for April-June 2025, representing 21% growth from Rs 942.23 crore in the same quarter last year. Total income increased 26% to Rs 7,330.78 crore from Rs 5,828.97 crore. Overall disbursements remained flat at Rs 24,325 crore. Vehicle Finance disbursements grew 7% to Rs 13,647 crore, while Loan Against Property disbursements increased 21.45% to Rs 4,705 crore. Home loans saw marginal decline to Rs 1,764 crore from Rs 1,778 crore. SME business disbursements fell to Rs 1,705 crore from Rs 2,160 crore due to the company slowing down certain low Return on Total Asset products. The company launched gold loan business during the quarter with Rs 100 crore in disbursements. The financial services provider operates 2,481 touchpoints across the country.",
            "Sentiment": "positive",
            "PublishDate": 1754135504596,
            "Source": "earnings"
        },
        {
            "Title": "Cholamandalam Targets ₹2 Lakh Crore Assets Under Management by FY27",
            "Summary": "Cholamandalam has set a target to reach ₹2 lakh crore in assets under management by FY27. The company plans to focus on diverse retail lending and expand into new areas including e-commerce, SMEs, and affordable housing. The strategy includes implementing technology-driven digital solutions. The company forecasts maintaining a consistent return on assets above 2.5% while emphasizing solid capital strength and asset quality.",
            "Sentiment": "positive",
            "PublishDate": 1753979450812,
            "Source": "stock"
        },
        {
            "Title": "Cholamandalam Investment Reports 21% Jump in Quarterly Profit, Approves Rs 55,000 Crore NCD Issuance",
            "Summary": "Cholamandalam Investment and Finance Company reported a 21% year-on-year increase in profit after tax to Rs 1,136 crore for the quarter ended June 30, 2025, compared to Rs 942 crore in the same period last year. Total income rose 26% to Rs 7,331 crore from Rs 5,828 crore. Assets under management grew 23% to Rs 2,07,663 crore. The Board approved issuance of secured and/or unsecured non-convertible debentures aggregating Rs 55,000 crore in tranches. Vehicle Finance disbursements increased 7% to Rs 13,647 crore, while Loan Against Property disbursements grew 21% to Rs 4,705 crore. However, asset quality deteriorated with Stage 3 levels rising to 3.16% from 2.81% in March 2025, and GNPA increasing to 4.29% from 3.97%. The company maintained a strong capital adequacy ratio of 19.96% and liquidity position of Rs 16,731 crore in cash balances.",
            "Sentiment": "positive",
            "PublishDate": 1753954818639,
            "Source": "earnings"
        },
        {
            "Title": "Cholamandalam Investment Reports 23% AUM Growth, Stage 3 Assets Rise to 3.16%",
            "Summary": "Cholamandalam Investment and Finance Co reported 23% year-on-year growth in Assets Under Management (AUM) for Q1 FY26. The company's total Stage 3 assets increased to 3.16% from 2.81% quarter-on-quarter. Non-Performing Assets (NPA) as per RBI guidelines rose to 4.29% compared to 3.97% in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1753953858652,
            "Source": "earnings"
        },
        {
            "Title": "Cholamandalam Investment Plans ₹55,000 Crore NCD Fundraise; Q1 Profit Jumps 20%",
            "Summary": "Cholamandalam Investment and Finance Company announced plans to raise up to ₹55,000 crores through Non-Convertible Debenture (NCD) issuance. The company reported strong quarterly results with revenue increasing to ₹72 billion from ₹57.8 billion year-over-year. Net profit rose to ₹11.3 billion compared to ₹9.4 billion in the same period last year, marking a 20% growth.",
            "Sentiment": "positive",
            "PublishDate": 1753953237713,
            "Source": "stock"
        },
        {
            "Title": "Cholamandalam Investment and Finance Shares Worth Rs. 175.72 Crores Traded in NSE Block Deal",
            "Summary": "Cholamandalam Investment and Finance Company executed a block trade on NSE involving approximately 1,213,356 shares at a price of Rs. 1,448.20 per share. The total transaction value amounted to Rs. 175.72 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1753946472204,
            "Source": "order&deals"
        },
        {
            "Title": "Cholamandalam Investment Plans Non-Convertible Debentures Issue on July 4",
            "Summary": "Cholamandalam Investment is planning to issue non-convertible debentures on July 4. The company is moving forward with this debt instrument offering as part of its financing activities.",
            "Sentiment": "neutral",
            "PublishDate": 1753195944378,
            "Source": "corporate_action"
        },
        {
            "Title": "Cholamandalam Investment and Finance Company Ltd. Block Trade",
            "Summary": "A block trade of approximately 266,278 shares of Cholamandalam Investment and Finance Company Ltd. occurred on the NSE. The trade was valued at Rs. 40.42 Crores, with shares priced at Rs. 1517.90 each.",
            "Sentiment": "neutral",
            "PublishDate": 1751871229000,
            "Source": "block_details"
        },
        {
            "Title": "Cholamandalam Investment And Finance Co Schedules Q1 Results Review",
            "Summary": "Cholamandalam Investment And Finance Co has announced that it will review its Q1 results on July 31.",
            "Sentiment": "neutral",
            "PublishDate": 1751641414000,
            "Source": "default"
        },
        {
            "Title": "Cholamandalam Investment and Finance Company Ltd. Block Trade",
            "Summary": "A block trade of approximately 101,471 shares of Cholamandalam Investment and Finance Company Ltd. occurred on the NSE. The trade was valued at Rs. 15.82 Crores, with shares priced at Rs. 1558.90 each.",
            "Sentiment": "neutral",
            "PublishDate": 1749788868000,
            "Source": "block_details"
        },
        {
            "Title": "Cholamandalam Investment and Finance Company Block Trade on NSE",
            "Summary": "A block trade of approximately 100,335 shares of Cholamandalam Investment and Finance Company Ltd. took place on the National Stock Exchange (NSE) at a price of Rs. 1644.00 per share. The total value of the transaction was Rs. 16.50 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1747890241000,
            "Source": "block_details"
        },
        {
            "Title": "Cholamandalam Investment and Finance Forecasts 20-25% AUM Growth for FY'26",
            "Summary": "Cholamandalam Investment and Finance Company has provided guidance for its Assets Under Management (AUM) growth, projecting a range of 20-25% for the fiscal year 2026. This forecast was reported by CNBC TV18, indicating the company's optimistic outlook for its financial performance in the coming years.",
            "Sentiment": "positive",
            "PublishDate": 1745814125000,
            "Source": "default"
        },
        {
            "Title": "Cholamandalam Investment and Finance: Q4 PAT Rises to Rs 1,259.54 Crore",
            "Summary": "Cholamandalam Investment and Finance reported a Q4 FY2025 consolidated PAT of Rs 1,259.54 crore, up from Rs 1,065.23 crore year-over-year. Total income for the quarter increased to Rs 7,136.91 crore. FY2025 disbursements exceeded Rs 1 lakh crore, reaching Rs 1,00,869 crore. AUM as of March 31, 2025, stood at Rs 1,99,876 crore, a 30% growth. The company's CAR was 19.75%, well above the regulatory requirement.",
            "Sentiment": "positive",
            "PublishDate": 1745658233000,
            "Source": "earnings"
        },
        {
            "Title": "Cholamandalam Investment and Finance Company: Q4 Profit Up 18%, Enters Gold Loan Business",
            "Summary": "Cholamandalam Investment reported Q4 net profit of ₹1,259 crore, up 18% YoY. NII rose 30% to ₹3,056 crore. The company announced plans to enter the gold loan business in select geographies. Asset quality remained stable quarter-on-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745576179000,
            "Source": "earnings"
        },
        {
            "Title": "Cholamandalam Investment and Finance Company: Plans Gold Loan Foray",
            "Summary": "Cholamandalam Investment and Finance Company Ltd. announced its entry into the gold loan industry in select geographies, following similar moves by Poonawalla Fincorp, L&T Finance, and InCred. The company's Q4 results show stable asset quality, with Net Interest Income up 30% YoY and Net profit growing 18.2% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1745575670000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cholamandalam Investment and Finance Reports Q4 Results",
            "Summary": "Cholamandalam Investment and Finance announced its Q4 financial results. The company's revenue increased to 70.25 billion rupees, up from 53.88 billion rupees year-over-year. Additionally, the company's gross stage 3 assets decreased to 2.81% from 2.91% quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745574050000,
            "Source": "result"
        },
        {
            "Title": "Cholamandalam Investment and Finance Reports Strong Q4 AUM Growth",
            "Summary": "Cholamandalam Investment and Finance Company has reported a total Assets Under Management (AUM) of Rs 1,99,876 crore for Q4, representing a 30% year-over-year growth. This performance exceeds the company's previous guidance of 25% growth.",
            "Sentiment": "positive",
            "PublishDate": 1745573646000,
            "Source": "result"
        }
    ]
}