{
    "Symbol": "CIEINDIA",
    "ISIN": "INE536H01010",
    "News": [
        {
            "Title": "CIE Automotive India Q4 & FY25 Results Call Feb 20",
            "Summary": "CIE Automotive India Limited announces Q4 & Full Year CY25 results conference call scheduled for Friday, February 20, 2026 at 12:00 hrs IST, with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1770789175769,
            "Source": "co_actions_results"
        },
        {
            "Title": "CIE Automotive Completes ₹2.63 Cr Investment in AMP Energy",
            "Summary": "CIE Automotive India Limited has completed its strategic investment in AMP Energy C&I Thirty Two Private Limited with the second tranche of ₹1.31 crores, bringing total investment to ₹2.63 crores for captive solar power generation.",
            "Sentiment": "positive",
            "PublishDate": 1768841975317,
            "Source": "co_actions_results"
        },
        {
            "Title": "CIE Automotive India Unit Acquires 39.91% Stake in Ampin Energy Thirty One",
            "Summary": "A unit of CIE Automotive India has acquired a 39.91% stake in Ampin Energy Thirty One as part of the first phase of investment. The acquisition makes the special purpose vehicle (SPV) an associate company of CIE Automotive India.",
            "Sentiment": "positive",
            "PublishDate": 1764683239048,
            "Source": "order&deals"
        },
        {
            "Title": "CIE Automotive India Conducts Investor Meeting with Major Fund Houses",
            "Summary": "CIE Automotive India held an investor meeting organized by Kotak in Mumbai with participation from major investors including Marcellus Investment, PPFAS Asset Management, Raiffeisen Kapitalanlage GmbH, and others. The discussions focused on clarifications regarding the company's quarterly results presentation and conference call transcript available on their website.",
            "Sentiment": "neutral",
            "PublishDate": 1763644574559,
            "Source": "stock"
        },
        {
            "Title": "CIE Automotive India Conducts Investor Meeting in Mumbai",
            "Summary": "CIE Automotive India held an investor meeting organized by Anand Rathi in Mumbai, with participation from multiple institutional investors including PPFAS MF, Torus PMS, and Ambit Asset Management. The discussions focused on clarifications regarding the company's quarterly results presentation and conference call transcript available on their website.",
            "Sentiment": "neutral",
            "PublishDate": 1763041857185,
            "Source": "stock"
        },
        {
            "Title": "CIE Automotive India Reports Record Quarterly Sales of INR 15.2 Billion in Q3 CY2025",
            "Summary": "CIE Automotive India Limited released its quarterly results transcript showing consolidated sales of INR 23.1 billion with 12% growth. The Indian operations achieved record quarterly sales of INR 15.2 billion, marking 9% year-on-year growth and 4.5% sequential growth. The company's Indian business EBITDA margin was 17.3%, impacted by energy tariff increases in Maharashtra. European operations reported sales of INR 7.9 billion with 18% growth, including an 11% positive exchange rate effect. The light vehicle market in India grew 5.6%, two-wheelers by 10%, and tractors by 14%. Management highlighted potential benefits from GST structure optimization which could improve three-year growth CAGR by 2.5-3%. US tariffs pose challenges with 25% on light vehicle components and 50% on trucks and tractors, though only 1% of Indian revenue is in high-risk category. European markets remain challenging with structural issues including stagnating EV penetration and Chinese import competition. Mahindra represents approximately one-third of the Indian business, with light vehicles contributing 52% of revenue mix, two-wheelers 21%, and tractors 18%.",
            "Sentiment": "neutral",
            "PublishDate": 1760935354761,
            "Source": "earnings"
        },
        {
            "Title": "CIE Automotive India Expects Multi-Year Growth from EV Components and Export Orders",
            "Summary": "CIE Automotive India anticipates sustained growth driven by three key factors: EV-ready components, export-driven orders, and localized production. The company expects this combination to create operational leverage and generate strong free cash flow over multiple years.",
            "Sentiment": "positive",
            "PublishDate": 1760632362507,
            "Source": "stock"
        },
        {
            "Title": "CIE Automotive India Reports Strong Q3 2025 Results with Revenue Growth and Higher Profitability",
            "Summary": "CIE Automotive India Limited reported its quarterly results for the quarter and nine months ended September 30, 2025. On a standalone basis, revenue from operations increased to ₹12,543 million in Q3 2025 from ₹11,360 million in Q3 2024. Profit after tax rose to ₹1,380 million compared to ₹1,236 million in the same quarter last year. For the nine-month period, standalone revenue grew to ₹36,221 million from ₹34,445 million, while profit after tax increased to ₹4,834 million from ₹4,673 million. On a consolidated basis, Q3 2025 revenue from continuing operations reached ₹23,718 million versus ₹21,346 million in Q3 2024. Consolidated profit after tax from continuing operations was ₹2,132 million compared to ₹1,947 million in the previous year. The company's earnings per share for the quarter stood at ₹3.64 on standalone basis and ₹5.64 on consolidated basis. The Board had earlier recommended a final dividend of ₹7.00 per equity share for the financial year ended December 31, 2024, which was paid during the quarter ended June 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760619181631,
            "Source": "earnings"
        },
        {
            "Title": "CIE Automotive Reports Higher Q2 Revenue and Profit Despite Margin Decline",
            "Summary": "CIE Automotive reported Q2 consolidated net profit of 2.1 billion rupees compared to 1.95 billion rupees in the previous year. Revenue increased to 23.7 billion rupees from 21.3 billion rupees year-over-year. EBITDA rose to 3.6 billion rupees from 3.3 billion rupees, though the EBITDA margin decreased to 14.99% from 15.48% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1760618685656,
            "Source": "earnings"
        },
        {
            "Title": "CIE Automotive India Reports 7% Growth in India Operations, European Business Shows Signs of Stabilization",
            "Summary": "CIE Automotive India held its quarterly results conference call, reporting India business sales of INR 14.5 billion with 7% year-on-year growth and 17.5% EBITDA margin. The company completed liquidation of Bill Forge Precision subsidiary. European operations recorded sales of INR 8.3 billion, down 1% year-on-year but showing improvement from previous quarters' double-digit declines. Consolidated sales reached INR 23 billion with 15.7% EBITDA margin. The company secured INR 6 billion in new orders during the first half and expects better performance in the second half driven by festive season demand. European operations underwent restructuring at Metalcastello facility, reducing workforce from 200 to 170 employees. Management indicated capacity utilization at 75-80% in India while Europe has significant excess capacity. Growth capex for the first half was INR 0.7 billion, focused primarily on Indian projects.",
            "Sentiment": "neutral",
            "PublishDate": 1753361691766,
            "Source": "earnings"
        },
        {
            "Title": "CIE Automotive India Makes Q2 & H1 CY25 Results Conference Call Recording Available",
            "Summary": "CIE Automotive India Limited has made the audio recording of their quarterly results conference call available on their company website. The conference call covered Q2 & H1 CY25 results and was held on July 22, 2025. The recording can be accessed through the company's website under the quarterly result calls and transcripts section. This follows previous communications regarding advance intimation for the results conference call and a revised investor presentation.",
            "Sentiment": "neutral",
            "PublishDate": 1753181886926,
            "Source": "earnings"
        },
        {
            "Title": "CIE Automotive India Submits Revised Q2 & H1CY25 Investor Presentation After Correcting Data Errors",
            "Summary": "CIE Automotive India Limited submitted a revised investor presentation for its quarterly results, correcting numerical errors in notes on pages 7 and 11 of the original presentation submitted on July 21, 2025. The company reported consolidated sales of ₹22,906 million for the quarter with 4% growth, though EBITDA declined 8% to ₹3,588 million. The Indian operations showed strong performance with sales of ₹14,591 million (+7%) and EBITDA of ₹2,552 million (+1%), while European operations faced challenges with sales declining 1% to ₹8,315 million and EBITDA dropping 25% to ₹1,036 million due to restructuring costs at Metalcastello. For the half-year period, consolidated sales were ₹44,868 million (-1%) with EBITDA of ₹7,305 million (-9%). The company paid a dividend of ₹7 per share during the quarter and maintains a strong balance sheet with net financial debt of ₹7,639 million.",
            "Sentiment": "neutral",
            "PublishDate": 1753162189194,
            "Source": "earnings"
        },
        {
            "Title": "CIE Automotive India Reports Mixed Q2 Results with Strong India Performance Offset by European Decline",
            "Summary": "CIE Automotive India released its quarterly results showing consolidated sales growth of 4% to ₹22,906 million, though EBITDA declined 8% to ₹3,588 million with margins at 15.7%. The India segment performed strongly with 7% sales growth to ₹14,591 million and EBITDA margins of 17.5%, outpacing weighted average market growth of around 5%. However, the Europe segment saw sales decline 1% to ₹8,315 million with EBITDA dropping 25% to ₹1,036 million, impacted by restructuring costs at Metalcastello. For the half-year period, consolidated sales declined 1% to ₹44,868 million while EBITDA fell 9% to ₹7,305 million. The company maintained strong cash flow generation with operating cash flow at 76% of EBITDA and paid dividends of ₹7 per share totaling ₹2,656 million. Net financial debt improved to ₹7,639 million from ₹12,022 million. The company expects continued growth in India while European market evolution remains uncertain.",
            "Sentiment": "neutral",
            "PublishDate": 1753158670266,
            "Source": "earnings"
        },
        {
            "Title": "CIE Automotive India Maintains Strong Credit Ratings and Reports Quarterly Financial Results",
            "Summary": "ICRA Limited reaffirmed CIE Automotive India Limited's credit ratings at [ICRA]AA with stable outlook for long-term and [ICRA]A1+ for short-term facilities totaling Rs. 575 crore. The company reported unaudited financial results for the quarter and half year ended June 30, 2025. On standalone basis, revenue from operations reached Rs. 12,043.32 million for the quarter with profit after tax of Rs. 1,267.83 million. For the half year, standalone revenue was Rs. 23,677.77 million with profit after tax of Rs. 3,453.19 million. On consolidated basis, quarterly revenue from continuing operations was Rs. 23,690.04 million with profit after tax of Rs. 2,030.12 million. The Board approved a final dividend of Rs. 7.00 per equity share for the year ending December 31, 2024, which was paid during the quarter. The company operates across automotive segments in India and Europe through various subsidiaries and associate companies.",
            "Sentiment": "positive",
            "PublishDate": 1753156698048,
            "Source": "corporate_action"
        },
        {
            "Title": "Cie Automotive India Reports Strong Local Growth Amid European Margin Pressures",
            "Summary": "Cie Automotive India is experiencing strong local growth and is focusing on capital expenditure for future expansion. However, the company is facing challenges with profit margins in its European operations.",
            "Sentiment": "neutral",
            "PublishDate": 1753109711597,
            "Source": "stock"
        },
        {
            "Title": "CIE Automotive Reports Mixed Q1 Results with Revenue Growth but Lower Profitability",
            "Summary": "CIE Automotive reported quarterly results showing revenue growth to 23.69 billion rupees from 22.93 billion rupees in the previous year. However, net profit declined to 2.04 billion rupees compared to 2.16 billion rupees year-over-year. EBITDA decreased to 3.37 billion rupees from 3.6 billion rupees, with EBITDA margin compressing to 14.22% from 15.7% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1753103954123,
            "Source": "earnings"
        },
        {
            "Title": "CIE Automotive India's Subsidiary Plans Investment in Ampin Energy",
            "Summary": "CIEALCAST, a subsidiary of CIE Automotive India, plans to acquire up to 29% of shares in Ampin Energy and invest 17.5 million rupees. This move indicates a strategic investment in the energy sector by the automotive company.",
            "Sentiment": "positive",
            "PublishDate": 1750768622000,
            "Source": "default"
        },
        {
            "Title": "Cie Automotive India Reports Q4 Financial Results",
            "Summary": "Cie Automotive India has released its Q4 financial results. The company reported a consolidated net profit of 2.06 billion rupees, down from 2.3 billion rupees year-over-year and up from 1.85 billion rupees quarter-over-quarter. Revenue for Q4 stood at 22.7 billion rupees, a decrease from 24.27 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1745972713000,
            "Source": "default"
        },
        {
            "Title": "CIE Automotive India Reports Q4 Financial Results",
            "Summary": "CIE Automotive India has released its Q4 financial results. The company's EBITDA decreased to 3.36 billion rupees from 3.61 billion rupees year-over-year. The EBITDA margin slightly declined to 14.76% from 14.86%. Consolidated net profit fell to 2.06 billion rupees from 2.3 billion rupees year-over-year, but increased from 1.85 billion rupees quarter-over-quarter. Revenue decreased to 22.7 billion rupees from 24.27 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1745932212000,
            "Source": "result"
        },
        {
            "Title": "CIE Automotive India to Consider Q4 Results on April 29",
            "Summary": "CIE Automotive India has announced that it will consider its fourth quarter financial results on April 29. This indicates that the company is preparing to release its earnings report for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1742993620000,
            "Source": "result"
        },
        {
            "Title": "Cie Automotive India Terminates Agreement with Ijya Renewables",
            "Summary": "Cie Automotive India has announced the termination of its agreement with Ijya Renewables. As a result, the proposed acquisition of Ijya Renewables shares by Cie Automotive India has been cancelled. This decision marks a significant change in the company's previously planned business strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1742516363000,
            "Source": "corporate_action"
        },
        {
            "Title": "CIE Automotive India: Q4 Profit Rises 9.49% Despite Revenue Decline",
            "Summary": "CIE Automotive India reported Q4 2025 profit of ₹184.98 crore, up 9.49% YoY, despite a 5.82% YoY revenue decline to ₹2109.95 crore. EPS increased 1.29% YoY to ₹4.72. Operating income fell 12.41% YoY. Analysts' consensus recommendation is Buy.",
            "Sentiment": "neutral",
            "PublishDate": 1740202948000,
            "Source": "earnings"
        },
        {
            "Title": "Cie Automotive Reports Q3 Financial Results and Dividend Declaration",
            "Summary": "Cie Automotive announced its Q3 consolidated net profit of 1.85 billion rupees, up from 1.69 billion rupees year-over-year, but down from 1.95 billion rupees quarter-over-quarter. Q3 revenue decreased to 21.1 billion rupees from 22.4 billion rupees year-over-year. The company also declared a dividend of 7 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1740096641000,
            "Source": "earnings"
        },
        {
            "Title": "CIE Automotive India: Q4 Profit Up 9.5%, Dividend Announced",
            "Summary": "CIE Automotive India reported a 9.5% YoY increase in Q4 net profit to ₹184.9 crore, despite a 5.8% revenue decline. The company announced a final dividend of ₹7 per share for FY24, with a record date of April 23, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1740064430000,
            "Source": "earnings"
        },
        {
            "Title": "CIE Automotive India Underperforms Industry Growth Targets",
            "Summary": "CIE Automotive India's business performance has fallen short of management's guidance, which aimed to outperform the industry by 5-10%. This indicates that the company's growth has not met the expected levels set by its leadership.",
            "Sentiment": "negative",
            "PublishDate": 1734497693000,
            "Source": "earnings"
        },
        {
            "Title": "CIE Automotive: Q3 Profit Plummets 48%, Revenue Dips 6%",
            "Summary": "CIE Automotive India reported a 48% decline in Q3 net profit to Rs 195 crore, with revenue falling 6.4% to Rs 2,135 crore. EBITDA decreased 4% to Rs 331 crore, while the EBITDA margin contracted slightly. The company attributes the decline to a drop in the European market, expecting weak sales in Europe but anticipating growth in India.",
            "Sentiment": "negative",
            "PublishDate": 1729780942000,
            "Source": "result"
        },
        {
            "Title": "CIE Automotive India Reports Q2 2023 Financial Results",
            "Summary": "CIE Automotive India has released its Q2 financial results. The company's consolidated net profit from continuing operations stands at 1.95 billion rupees, showing a slight increase from 1.86 billion rupees year-over-year, but a decrease from 2.16 billion rupees quarter-over-quarter. Revenue for Q2 is reported at 21.3 billion rupees, down from 22.8 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1729777983000,
            "Source": "result"
        },
        {
            "Title": "CIE Automotive: Profitability Stable Amid Slowing Growth",
            "Summary": "<p>Motilal Oswal reports that <span class='neutral'>CIE Automotive</span> is expected to <span class='positive'>maintain profitability</span> despite <span class='negative'>moderating growth</span>. The full analysis is available to <b>NDTV Profit</b> subscribers.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728881186000,
            "Source": "normal_news"
        }
    ]
}