{
    "Symbol": "CIFL",
    "ISIN": "INE345H01024",
    "News": [
        {
            "Title": "Capital India Finance Appoints Executive Vice Chairman",
            "Summary": "Capital India Finance Limited shareholders approved the appointment of Mr. Surender Rana as Executive Vice Chairman through postal ballot with 90.79% voting participation and unanimous approval.",
            "Sentiment": "positive",
            "PublishDate": 1770907700422,
            "Source": "stocks"
        },
        {
            "Title": "Capital India Finance CCO Chetan Bafna Resigns",
            "Summary": "Capital India Finance Limited announces resignation of Chief Credit Officer Chetan Bafna effective January 31, 2026, citing personal reasons for departure from senior management role.",
            "Sentiment": "neutral",
            "PublishDate": 1769869793730,
            "Source": "stocks"
        },
        {
            "Title": "Capital India Finance Gets RBI License Renewal",
            "Summary": "Capital India Finance secures RBI license renewal for money transfer services until January 2028, enabling RemitX platform to continue cross-border transfers with Western Union partnership.",
            "Sentiment": "positive",
            "PublishDate": 1768185766592,
            "Source": "stocks"
        },
        {
            "Title": "Capital India Finance appoints Head-Risk & Policy",
            "Summary": "Capital India Finance Limited's board approved appointment of Mohit Sirpurkar as Head-Risk & Policy and authorized postal ballot for Executive Vice Chairman position through remote e-voting.",
            "Sentiment": "positive",
            "PublishDate": 1767091679524,
            "Source": "stocks"
        },
        {
            "Title": "Capital India Finance allots 13.48 lakh ESOP shares",
            "Summary": "Capital India Finance Limited allotted 13,47,500 equity shares under its ESOP scheme, raising ₹2.44 crores and increasing paid-up capital to ₹78.21 crores with 39.11 crore shares outstanding.",
            "Sentiment": "positive",
            "PublishDate": 1766858730791,
            "Source": "co_actions_results"
        },
        {
            "Title": "Capital India Finance Re-appoints Keshav Porwal as Managing Director for Three Years",
            "Summary": "Capital India Finance Limited re-appointed Mr. Keshav Porwal as Managing Director for a further term of 3 years effective from November 27, 2025, following Board and shareholder approval. The appointment affects the company's leadership structure and was disclosed to stock exchanges BSE and NSE in compliance with listing regulations.",
            "Sentiment": "positive",
            "PublishDate": 1764241148741,
            "Source": "corporate_governance"
        },
        {
            "Title": "Capital India Finance Appoints Former SBI Deputy MD as Executive Vice Chairman, Reports Strong Q2 Results",
            "Summary": "Capital India Finance Limited appointed Mr. Surender Rana, former Deputy Managing Director at State Bank of India, as Executive Vice Chairman for a three-year term effective November 18, 2025. The company reported robust Q2 FY2025-26 performance with AUM at ₹1024 crore (up 11.43% YoY), disbursements of ₹155.54 crore (up 45% YoY), and divested its housing finance subsidiary for ₹266.53 crore to focus on core lending business.",
            "Sentiment": "positive",
            "PublishDate": 1763449070768,
            "Source": "corporate_governance"
        },
        {
            "Title": "Capital India Finance Reports Strong Q2 Turnaround with 460M Rupees Net Profit",
            "Summary": "Capital India Finance posted a consolidated net profit of 460 million rupees in Q2 compared to 5 million rupees in the same period last year, despite revenue declining to 1.3 billion rupees from 1.4 billion rupees year-over-year. The company reported an exceptional item of 1.06 billion rupees and loss before tax improved significantly to 541 million rupees from a loss of 8 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1763129294958,
            "Source": "earnings"
        },
        {
            "Title": "Capital India Finance Appoints Surender Rana as Executive Vice Chairman Following RBI Approval",
            "Summary": "Capital India Finance Limited appointed Mr. Surender Rana as Additional Director and Executive Vice Chairman effective November 18, 2025, for a 3-year term following RBI approval received on November 13, 2025. The appointment, subject to shareholder approval, brings over 34 years of banking expertise from State Bank of India, including experience as Deputy Managing Director - SME Agri Business.",
            "Sentiment": "positive",
            "PublishDate": 1763117259930,
            "Source": "corporate_governance"
        },
        {
            "Title": "Capital India Finance Limited Concludes 31st AGM, Approves Dividend and Key Resolutions",
            "Summary": "Capital India Finance Limited held its 31st Annual General Meeting on September 25, 2025, through video conferencing. The company approved audited standalone and consolidated financial statements for the year ended March 31, 2025. Shareholders approved a final dividend of INR 0.02 per equity share of nominal value INR 2 each. The meeting saw the re-appointment of Mr. Keshav Porwal as Director and Managing Director for three years effective November 27, 2025. Other approved resolutions included amendments to the Memorandum of Association, authorization for debt securities issuance, and appointment of M/s Arun Gupta & Associates as Secretarial Auditors for five years from April 2025 to March 2030. All seven resolutions were passed with requisite majority, with 6,657 members on record date and 75 members attending through video conferencing.",
            "Sentiment": "positive",
            "PublishDate": 1758809393099,
            "Source": "corporate_action"
        },
        {
            "Title": "Capital India Finance Appoints Surender Rana as Executive Vice Chairman, Subject to RBI Approval",
            "Summary": "Capital India Finance Limited's Board of Directors approved the appointment of Mr. Surender Rana as Additional Director in the category of Whole-time Director and Executive Vice Chairman. The appointment is subject to Reserve Bank of India approval, with effectiveness from the date of RBI approval or as decided by the Board. Rana brings over 34 years of banking experience from State Bank of India, where he served as Deputy Managing Director for SME & Agri Business. He has expertise in MSME and Agri financing, credit and risk management, policy formulation, and regulatory engagement. The company will submit an application to RBI for prior approval as required under applicable regulations. Rana is not related to any other director of the company and is not debarred from holding directorship.",
            "Sentiment": "positive",
            "PublishDate": 1758709466508,
            "Source": "corporate_governance"
        },
        {
            "Title": "Capital India Finance Approves Managing Director Re-appointment and Business Expansion Plans",
            "Summary": "Capital India Finance Limited's Board approved the re-appointment of Mr. Keshav Porwal as Managing Director for another 3-year term effective November 27, 2025, subject to shareholder approval. The Board also appointed M/s. Arun Gupta & Associates as Secretarial Auditors for 5 years from April 2025 to March 2030. The company approved amendments to its Memorandum of Association to include insurance intermediation business. The 31st Annual General Meeting is scheduled for September 25, 2025, via video conferencing, with record date set for September 19, 2025, for dividend eligibility. Share transfer books will remain closed from September 20-25, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755078352363,
            "Source": "corporate_governance"
        },
        {
            "Title": "Capital India Finance Reports Minimal Profit and Approves INR 200 Crore Fundraising Plan",
            "Summary": "Capital India Finance Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported a standalone net profit of INR 11.22 lakhs compared to INR 461.34 lakhs in the same quarter last year, while consolidated results showed a net loss of INR 563.80 lakhs versus a loss of INR 634.99 lakhs in the previous year. The Board also approved raising funds up to INR 200 crore through non-convertible debentures, bonds, and other debt securities, subject to shareholder and regulatory approvals. During the quarter, the company allotted 4,51,906 equity shares to employees under its stock option plan and granted 40,00,000 new options at an exercise price of INR 19 per share. The company successfully divested its entire stake in subsidiary Capital India Home Loans Limited for INR 266.53 crore, with the transaction completing on August 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755068809600,
            "Source": "earnings"
        },
        {
            "Title": "Capital India Finance Completes Sale of Home Loans Unit for INR 266.53 Crore",
            "Summary": "Capital India Finance Limited has completed the divestment of its entire stake in subsidiary Capital India Home Loans Limited to Weaver Services Private Limited for INR 266.53 crore. The transaction received approvals from the Reserve Bank of India, National Housing Bank and other stakeholders, with all conditions under the Share Purchase Agreement fulfilled. Following the sale, Capital India Home Loans ceased to be a subsidiary of the company. Managing Director Keshav Porwal stated the sale represents a strategic decision to focus on core lending segments including MSMEs, professionals, and retail customers. He noted that Weaver is backed by investors including Premji Invest and Gaja Capital. Capital India Finance is a non-deposit taking NBFC that provides customized credit solutions through a phygital model.",
            "Sentiment": "positive",
            "PublishDate": 1754920410958,
            "Source": "order&deals"
        },
        {
            "Title": "Capital India Finance Approves Issuance of NCDs Worth Up To 500 Million Rupees",
            "Summary": "Capital India Finance has approved the issuance of Non-Convertible Debentures (NCDs) with a value of up to 500 million rupees. This decision represents a significant financial move for the company, potentially aimed at raising capital or refinancing existing debt.",
            "Sentiment": "positive",
            "PublishDate": 1752677996000,
            "Source": "default"
        },
        {
            "Title": "Capital India Finance to Discuss Non-Convertible Debentures Issuance",
            "Summary": "Capital India Finance has announced that it will hold a discussion regarding the issuance of Non-Convertible Debentures on July 16. No further details about the potential issuance or its terms were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1752155067000,
            "Source": "default"
        },
        {
            "Title": "Capital India Finance Plans to Finalize Sale of Home Loan Subsidiary",
            "Summary": "Capital India Finance has announced plans to finalize the sale of its home loan subsidiary by August 29. The company has not provided any additional details about the sale or the subsidiary in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1751296138000,
            "Source": "default"
        },
        {
            "Title": "RBI Approves Weaver Services' Acquisition of Capital India Home Loans",
            "Summary": "Capital India Finance has announced that the Reserve Bank of India (RBI) has approved the acquisition of its subsidiary, Capital India Home Loans, by Weaver Services.",
            "Sentiment": "positive",
            "PublishDate": 1747829326000,
            "Source": "default"
        },
        {
            "Title": "Capital India Finance Reports Q4 Financial Results",
            "Summary": "Capital India Finance has released its Q4 financial results. The company reported revenue of 1.39 billion rupees, down from 1.67 billion rupees year-over-year. The company also reported a consolidated net loss of 5.9 million rupees, compared to a profit of 8 million rupees in the same quarter last year. However, this represents an improvement from the previous quarter, where the company reported a profit of 6.9 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1747236445000,
            "Source": "result"
        },
        {
            "Title": "Capital India Finance: NBFC Lists on NSE to Enhance Shareholder Value",
            "Summary": "Capital India Finance Ltd has listed on the National Stock Exchange of India effective April 17, 2025, in addition to its existing BSE listing. The company aims to increase accessibility for a broader investor base and enhance long-term shareholder value. Shares will trade under the ticker symbol CIFL on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1744969895000,
            "Source": "corporate_action"
        }
    ]
}