{
    "Symbol": "CIGNITITEC",
    "ISIN": "INE675C01017",
    "News": [
        {
            "Title": "Cigniti Technologies Q3 Net Profit Jumps 26% YoY",
            "Summary": "Cigniti Technologies reported strong Q3 performance with consolidated net profit rising 26.26% to ₹80.30 crores and revenue growing 13.73% to ₹580.00 crores year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1769101842902,
            "Source": "co_actions_results"
        },
        {
            "Title": "WhiteOak Capital Crosses 5% Stake in Cigniti Tech",
            "Summary": "WhiteOak Capital Mutual Fund acquired 1,50,750 shares of Cigniti Technologies on December 31, 2025, increasing its stake to 5.45% and triggering mandatory disclosure under SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1767426446482,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cigniti Files Second Motion with NCLT for Coforge Merger",
            "Summary": "Cigniti Technologies has submitted a second motion petition to NCLT seeking approval for its amalgamation with Coforge Limited, following multiple regulatory disclosures throughout 2024 and 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765874834046,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cigniti Technologies Shareholders Approve Amalgamation with Coforge Limited",
            "Summary": "Cigniti Technologies Limited shareholders voted on December 6, 2025, approving the scheme of amalgamation with Coforge Limited, with 99.75% of votes cast in favor of the resolution. The meeting was conducted through video conferencing as per National Company Law Tribunal directions, with both remote e-voting and e-voting during the meeting facilitated for equity shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1765161414827,
            "Source": "corporate_action"
        },
        {
            "Title": "Cigniti Technologies Allots 90,000 Shares Under ESOP Scheme",
            "Summary": "Cigniti Technologies' Board approved allotment of 90,000 equity shares with face value of Rs. 10 each under the Employee Stock Option Plan on November 26, 2025. The allotment increased the company's paid-up share capital to 27,546,959 equity shares aggregating to Rs. 275,469,590, with listing formalities in process.",
            "Sentiment": "positive",
            "PublishDate": 1764219939994,
            "Source": "corporate_action"
        },
        {
            "Title": "Cigniti Technologies Transitions to New Registrar and Share Transfer Agent",
            "Summary": "Cigniti Technologies Limited has appointed M/s. MUFG Intime India Private Limited as its new Registrar and Share Transfer Agent, replacing Aarthi Consultants Private Limited. The transition process is currently underway, with the existing RTA continuing services until the database and electronic connectivity are completely shifted to the new agent.",
            "Sentiment": "neutral",
            "PublishDate": 1763361149413,
            "Source": "corporate_action"
        },
        {
            "Title": "Cigniti Technologies Receives Stock Exchange Approval for Promoter Reclassification",
            "Summary": "Cigniti Technologies received approval from NSE and BSE for reclassifying five promoters from the Promoter/Promoter Group category to Public category. The reclassified individuals are Venkata Subramanyam Chakkilam, Chakkilam Rajeswari, Chakkilam Srikanth, Pennam Sudhakar, and Pennam Sapna. Following the reclassification, promoter holding decreased from 55.04% to 54.17%, while public holding increased from 44.96% to 45.83%. The total shares involved in the reclassification represent 0.87% of the company's shareholding. Both exchanges granted approval based on the company's application dated January 25, 2025, under Regulation 31A of SEBI Listing Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762503284165,
            "Source": "corporate_action"
        },
        {
            "Title": "Cigniti Technologies Announces Shareholder Meeting for Coforge Amalgamation Scheme",
            "Summary": "Cigniti Technologies Limited has issued a notice to equity shareholders and unsecured creditors regarding a meeting convened under directions from the National Company Law Tribunal, Chandigarh Bench. The meeting relates to the Scheme of Amalgamation of Cigniti Technologies with and into Coforge Limited. The meeting will be held through Video Conference/Other Audio-Visual Means. The notice has been published in Business Standard (English) and Jansatta (Hindi) newspapers. The company has informed stock exchanges BSE and NSE about this development under SEBI Listing Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762443252175,
            "Source": "corporate_action"
        },
        {
            "Title": "Cigniti Tech Reports Strong Q2 Performance with Revenue Growth to 5.67B Rupees",
            "Summary": "Cigniti Tech delivered solid quarterly results with revenue increasing to 5.67 billion rupees from 5.34 billion rupees in the previous quarter. The company's consolidated net profit rose to 826 million rupees compared to 659 million rupees quarter-over-quarter. EBIT improved to 997 million rupees from 884 million rupees, while EBIT margin expanded to 17.57% from 16.55% in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761297062774,
            "Source": "earnings"
        },
        {
            "Title": "NCLT Approves Cigniti Technologies-Coforge Merger Proceedings, Orders Shareholder and Creditor Meetings",
            "Summary": "The National Company Law Tribunal (NCLT) Chandigarh Bench has issued directions for the proposed merger between Cigniti Technologies Limited and Coforge Limited. The tribunal ordered the convening of meetings for equity shareholders and unsecured creditors of both companies to consider and approve the merger scheme. The NCLT dispensed with the requirement for secured creditors meeting of Cigniti Technologies as the company has no secured creditors. Cigniti Technologies has 28,488 equity shareholders and 16 unsecured creditors owing Rs 1.63 crore, while Coforge has 1,88,219 equity shareholders, 5 secured creditors owed Rs 382.07 crore, and 56 unsecured creditors owed Rs 265.97 crore. The merger scheme has an appointed date of April 1, 2025, and aims to create synergies in AI-led assurance and IT solutions, strengthen market presence, and streamline corporate structure. Both companies' boards approved the scheme in December 2024 and July 2025 respectively.",
            "Sentiment": "positive",
            "PublishDate": 1760791629027,
            "Source": "corporate_action"
        },
        {
            "Title": "Cigniti Technologies Files Amalgamation Application with NCLT for Merger with Coforge Limited",
            "Summary": "Cigniti Technologies Limited has filed an application with the National Company Law Tribunal, Chandigarh Bench seeking approval for its proposed amalgamation with Coforge Limited. The company disclosed this development to stock exchanges, referencing previous intimations dated December 27, 2024 and July 18, 2025 regarding the scheme of amalgamation. Under the proposed scheme, Cigniti Technologies will act as the transferor company while Coforge Limited will be the transferee company, with the merger affecting their respective shareholders and creditors.",
            "Sentiment": "neutral",
            "PublishDate": 1754590906816,
            "Source": "order&deals"
        },
        {
            "Title": "Morgan Stanley Asia Singapore Acquires 1.6 Lakh Shares in Cigniti Technologies for ₹264 Million",
            "Summary": "Morgan Stanley Asia Singapore Pte acquired 1.6 lakh shares of Cigniti Technologies for ₹264 million through open market transactions on July 24. The acquisition represents a significant investment by the institutional investor in the technology company.",
            "Sentiment": "positive",
            "PublishDate": 1753413496198,
            "Source": "order&deals"
        },
        {
            "Title": "Morgan Stanley Purchases Cigniti Technologies Shares During 9% Stock Decline",
            "Summary": "Cigniti Technologies shares fell over 9% on Thursday following its June quarter results, closing at ₹1,573.8. During the decline, Morgan Stanley Asia Singapore Pte. purchased 1.65 lakh shares at an average price of ₹1,591.46 per share, representing 0.6% of the company's total outstanding equity. Morgan Stanley already held a 1.69% stake in Cigniti Technologies. The stock is currently down 20% from its 52-week high of ₹1,970. Other significant shareholders include Whiteoak Capital Flexi Cap Fund with 4.11% stake, Ashoka India Equity Investment Trust Plc with 1.83%, and Nuvama Multi Asset Strategy Return Fund with 1.07%. Cigniti Technologies is majority-owned by Coforge, which acquired the company last year and also saw its shares decline nearly 9% after reporting quarterly numbers.",
            "Sentiment": "negative",
            "PublishDate": 1753399356786,
            "Source": "stock"
        },
        {
            "Title": "Cigniti Technologies Announces Company Secretary Transition with Dahia Replacing Vasudha",
            "Summary": "Cigniti Technologies Limited announced a leadership change in its Company Secretary position. Ms. Naga Vasudha resigned from her role as Company Secretary and Compliance Officer, effective August 31, 2025, citing other prior commitments. The Board of Directors appointed Mr. Abhishek Dahia as the new Company Secretary and Compliance Officer, effective September 1, 2025. Dahia is a fellow member of the Institute of Company Secretaries of India with over 13 years of experience in Corporate Law and Secretarial operations. He holds an LL.B. from the University of Delhi and serves as Group Manager at Coforge Limited. His experience includes SEBI compliances, company incorporations, audits, and regulatory filings across listed entities including Apollo Tyres Group, India Glycols, INOX Group, and ICRA Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1753280636539,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cigniti Technologies Reports Q1 FY26 Results, Announces Leadership Changes and ESOP Allotment",
            "Summary": "Cigniti Technologies announced its quarterly results for the quarter ended June 30, 2025, with consolidated revenue from operations of Rs. 5,342 million and net profit of Rs. 659 million. The company's consolidated basic EPS stood at Rs. 23.94. On a standalone basis, revenue was Rs. 2,627 million with net profit of Rs. 448 million and basic EPS of Rs. 16.28. The board approved allotment of 60,000 equity shares to employee Vinay Rawat under the ESOP Scheme 2015. The company announced leadership changes with Naga Vasudha resigning as Company Secretary effective August 31, 2025, and Abhishek Dahia being appointed as the new Company Secretary from September 1, 2025. Additionally, the board approved changing the Registrar and Transfer Agent from Aarthi Consultants Private Limited to MUFG Intime India Private Limited effective November 15, 2025. The company received no objection from NSE and no adverse observations from BSE regarding its merger scheme with Coforge Limited, with the acquirer now proceeding to file the merger scheme with the National Company Law Tribunal.",
            "Sentiment": "positive",
            "PublishDate": 1753279844638,
            "Source": "earnings"
        },
        {
            "Title": "Cigniti Tech Reports Q4 Financial Results",
            "Summary": "Cigniti Technologies has announced its Q4 consolidated financial results. The company reported a net profit of 731.5 million rupees, up from 636 million rupees in the previous quarter. Revenue for Q4 stood at 5.3 billion rupees, compared to 5.16 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1746490258000,
            "Source": "default"
        },
        {
            "Title": "Cigniti Tech Reports Q4 Financial Results",
            "Summary": "Cigniti Tech has released its Q4 financial results, showing improvements across key metrics. The company's EBIT increased to 873.5 million rupees from 820 million rupees in the previous quarter. EBIT margin improved to 16.48% from 15.88%. Revenue rose to 5.3 billion rupees from 5.16 billion rupees. Consolidated net profit grew to 731.5 million rupees from 636 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1746445178000,
            "Source": "result"
        },
        {
            "Title": "Cigniti Technologies Reports Increased Q3 Profit and Revenue",
            "Summary": "Cigniti Technologies has announced its Q3 financial results. The company's consolidated net profit increased to 636 million rupees, up from 529 million rupees in the previous quarter. Revenue also saw growth, rising to 5.16 billion rupees from 4.9 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737591156000,
            "Source": "earnings"
        },
        {
            "Title": "Cigniti Technologies: Q3 Net Profit Surges 47%, Revenue Up 10%",
            "Summary": "Cigniti Technologies reported a 46.7% YoY increase in Q3 FY25 net profit to ₹22 crore. Revenue rose 10.3% to ₹516.4 crore. EBIT grew 35.3% to ₹76.7 crore with margin expanding to 14.9%.",
            "Sentiment": "positive",
            "PublishDate": 1737556304000,
            "Source": "earnings"
        },
        {
            "Title": "Cigniti Tech to Merge with Coforge Limited",
            "Summary": "Cigniti Tech has approved a scheme of amalgamation with Coforge Limited. The swap ratio for the merger is set at 1 equity share of Coforge (INR 10 each) for every 5 equity shares of Cigniti Tech (INR 10 each).",
            "Sentiment": "neutral",
            "PublishDate": 1735518081000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cigniti Technologies Announces Merger Swap Ratio with Coforge",
            "Summary": "Cigniti Technologies has announced the swap ratio for its merger with Coforge. Shareholders of Cigniti will receive 1 equity share of Coforge for every 5 equity shares of Cigniti. Both companies' shares have a face value of INR 10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1735371694000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cigniti Technologies Approves Amalgamation with Coforge Limited",
            "Summary": "Cigniti Technologies has approved a scheme of amalgamation with Coforge Limited. This corporate action involves the merger of Cigniti Technologies into Coforge Limited, potentially creating a combined entity with enhanced capabilities and market presence.",
            "Sentiment": "neutral",
            "PublishDate": 1735371414000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cigniti Technologies Reports Improved Q2 Financial Performance",
            "Summary": "Cigniti Technologies has reported its Q2 financial results. The company's EBIT (Earnings Before Interest and Taxes) increased to 619.7 million rupees, up from 476 million rupees in the previous quarter. Additionally, the EBIT margin improved to 12.42% from 10.15% quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1729598107000,
            "Source": "result"
        },
        {
            "Title": "Cigniti Technologies Reports Q2 Revenue Growth",
            "Summary": "Cigniti Technologies has announced its Q2 revenue, which stands at 4.9 billion rupees. This represents an increase from the previous quarter's revenue of 4.7 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1729598096000,
            "Source": "result"
        },
        {
            "Title": "Cigniti Technologies Reports Significant Profit Increase in Q2",
            "Summary": "Cigniti Technologies has reported a substantial increase in its consolidated net profit for the second quarter. The company's net profit rose to 529 million rupees, up from 105 million rupees in the previous quarter, representing a significant quarter-over-quarter growth.",
            "Sentiment": "positive",
            "PublishDate": 1729598085000,
            "Source": "result"
        }
    ]
}