{
    "Symbol": "CINEVISTA",
    "ISIN": "INE039B01026",
    "News": [
        {
            "Title": "Cinevista Q3FY26 Revenue Jumps to ₹825.44 Lakhs",
            "Summary": "Cinevista Limited reported Q3FY26 revenue of ₹825.44 lakhs vs ₹2.64 lakhs in Q3FY25, with net profit of ₹352.02 lakhs against loss of ₹224.49 lakhs year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1769686690809,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cinevista Board Meet Set for Jan 29 for Q3FY26 Results",
            "Summary": "Cinevista Limited has scheduled its board meeting for January 29, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768989330556,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cinevista Limited Receives Updated Carpet Area Details for Joint Development Project",
            "Summary": "Cinevista Limited disclosed updated RERA carpet area details for Tower A (33 floors) and Tower B (31 floors with 58,422 sq ft) from their joint development partner K. Raheja Corp. Real Estate Pvt. Ltd. The company will receive area corresponding to their 24.5% shareholding as per the joint development agreement dated May 29, 2023.",
            "Sentiment": "neutral",
            "PublishDate": 1764755893624,
            "Source": "stock"
        },
        {
            "Title": "Cinevista Limited Reports Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "Cinevista Limited announced its standalone and consolidated unaudited financial results for the quarter and half-year ended September 30, 2025. The Board of Directors approved the results during a meeting held on November 5, 2025. The company operates in two business segments: Media Business and Real Estate Business. For the Real Estate segment, the company has entered into a Joint Development Agreement with KRaheja Corp Real Estate Private Limited for a plot in Kanjurmarg, Mumbai, recognizing revenue using the Percentage Completion Method. The Media Business includes various YouTube channels created for content generation. The consolidated results include figures from subsidiary companies Cinevista Eagle Plus Media Pvt. Ltd. and Chimera Entertainment Pvt. Ltd., as well as associate company Heritage Productions Pvt. Ltd. The financial results were reviewed by the audit committee and accompanied by a Limited Review Report from statutory auditors.",
            "Sentiment": "neutral",
            "PublishDate": 1762374823568,
            "Source": "earnings"
        },
        {
            "Title": "Cinevista Limited Reports Q2 2025 Results, Schedules 28th AGM for September 24",
            "Summary": "Cinevista Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025. The company scheduled its 28th Annual General Meeting for September 24, 2025, at 11:00 AM IST through video conferencing without physical presence of members. The Register of Members and Share Transfer Books will be closed from September 17-24, 2025 for AGM purposes. Financial results will be published in The Financial Express and Mumbai Lakshadeep on August 2, 2025, and made available on stock exchange websites and the company's website. The results include both standalone and consolidated unaudited financial statements, reviewed by the Audit Committee and audited by Raj Niranjan Associates.",
            "Sentiment": "neutral",
            "PublishDate": 1754046618586,
            "Source": "earnings"
        }
    ]
}