{
    "Symbol": "CINELINE",
    "ISIN": "INE704H01022",
    "News": [
        {
            "Title": "Cineline India Q3FY26 Net Profit Jumps 471% to ₹621.21 Lakhs",
            "Summary": "Cineline India Limited reported strong Q3FY26 results with net profit surging 471% YoY to ₹621.21 lakhs. Revenue from operations grew 6.16% to ₹6,720.57 lakhs driven by improved operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1769587993391,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cineline Opens 3-Screen MovieMax Multiplex in Bareilly",
            "Summary": "Cineline India Limited inaugurates its newest 3-screen MovieMax Multiplex at City Centre LA Mall, Bareilly, expanding its Uttar Pradesh presence to 23 screens and nationwide footprint to 80 screens across 20 properties.",
            "Sentiment": "positive",
            "PublishDate": 1769507438988,
            "Source": "stocks"
        },
        {
            "Title": "Cineline India Appoints New Company Secretary",
            "Summary": "Cineline India Limited's Board of Directors appointed Mr. Palkeshkumar Jain as Company Secretary and Compliance Officer effective January 06, 2026, following recommendation from the Nomination & Remuneration Committee.",
            "Sentiment": "positive",
            "PublishDate": 1767700169143,
            "Source": "stocks"
        },
        {
            "Title": "Cineline India Becomes Debt-Free After INR 270 Crore Hotel Asset Sale, Focuses on Cinema Expansion",
            "Summary": "Cineline India Limited has achieved debt-free status by monetizing its hotel asset, Hyatt Centric Goa, for an enterprise value of INR 270 crores through subsidiary sale. The proceeds facilitated total debt reduction of INR 228 crores, including hotel asset-related and company debt. The company will save INR 22 crores annually in debt servicing costs. For Q2FY26, total revenues increased to INR 6,426 lakhs from INR 5,614 lakhs in Q2FY25, while EBITDA rose to INR 1,512 lakhs from INR 1,368 lakhs. The film exhibition business generated revenues of INR 6,399 lakhs versus INR 5,591 lakhs in the previous year. The company operates 77 screens across 79 cities with 19,000 seats and plans to add 5 upcoming screens by December 2025. Cineline achieved 3x expansion in market share through gross box office collections and surpassed INR 200 crores revenue milestone. The company received awards as most admired retailer of the year by MAPIC India and most impactful brand by Big Cine Expo 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762434986305,
            "Source": "earnings"
        },
        {
            "Title": "Cineline India Reports Quarterly Loss Despite Revenue Growth",
            "Summary": "Cineline India Limited reported a net loss of ₹205.84 lakhs for the quarter ended September 30, 2025, compared to a profit of ₹64.06 lakhs in the same quarter last year. Revenue from operations increased to ₹6,197.33 lakhs from ₹4,528.98 lakhs year-over-year. For the half-year period, the company posted a loss of ₹572.59 lakhs versus a loss of ₹6,064.42 lakhs in the previous year. Total expenses for the quarter rose to ₹5,925.01 lakhs from ₹4,969.28 lakhs. The company's cash and bank balances decreased to ₹443.69 lakhs from ₹3,326.76 lakhs as of March 2025. The Board of Directors approved these unaudited standalone financial results at their meeting held on November 6, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762419327272,
            "Source": "earnings"
        },
        {
            "Title": "Cineline India Approves Quarterly Results and Key Leadership Appointments",
            "Summary": "Cineline India Limited's Board approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2020. The company reported revenue from operations of Rs 479.17 lakhs for the quarter, with profit after tax of Rs 223.21 lakhs. The Board also approved re-appointment of Rasesh Kanakia as Executive Chairman and Himanshu Kanakia as Executive Managing Director for five-year terms starting May 1, 2021. Additionally, Rashmi Shah was appointed as Company Secretary and Compliance Officer effective November 11, 2020. The company noted that COVID-19 pandemic led to tenant requests for rental concessions, with negotiations completed for most tenants and ongoing discussions for others.",
            "Sentiment": "neutral",
            "PublishDate": 1761796202131,
            "Source": "earnings"
        },
        {
            "Title": "Cineline India Re-appoints Rasesh and Himanshu Kanakia as Executive Chairman and Managing Director for 5-Year Term",
            "Summary": "Cineline India Limited has approved the re-appointment of Mr. Rasesh Kanakia as Executive Chairman and Mr. Himanshu Kanakia as Managing Director for a 5-year term from May 1, 2026 to April 30, 2031. The appointments take effect after their present terms end on April 30, 2026. Mr. Rasesh Kanakia has 41 years of career experience, starting as a real estate consultant in 1984 and moving into real estate development in 1986. He pioneered the company's entry into the exhibition business and oversees finance, strategic management, and public relations. Mr. Himanshu Kanakia has 39 years of experience and has been integral to day-to-day management operations. Under his guidance, the Kanakia Group has developed and delivered 14 million sq. ft. of commercial, residential, entertainment, education and industrial spaces. The two executives are brothers, with Mr. Himanshu also being the brother-in-law of Mrs. Hiral Kanakia. Both directors have been confirmed as not being debarred from holding director positions by any regulatory authority.",
            "Sentiment": "positive",
            "PublishDate": 1758889903828,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cineline India Divests Wholly-Owned Subsidiary Transquare Realty for ₹1 Lakh",
            "Summary": "Cineline India Limited has sold its 100% stake in wholly-owned subsidiary Transquare Realty Private Limited for ₹1,00,000 on February 28, 2025. The buyers are Mr. Vivek Bhutta and Mr. Bhadresh Joshi, who are not part of the promoter group. Transquare Realty reported total income of ₹5 lakhs as of December 31, 2024, with profit before tax of ₹15.50 lakhs and profit after tax of ₹12.97 lakhs for financial year 2023-2024. The subsidiary had a negative net worth of ₹6.62 lakhs as of December 31, 2024. Following the divestment, Transquare Realty is no longer a subsidiary of Cineline India. The transaction does not qualify as a related party transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1754659705896,
            "Source": "corporate_action"
        },
        {
            "Title": "Cineline India Limited Approves Re-appointment of Key Leadership for Five-Year Terms",
            "Summary": "Cineline India Limited's Board of Directors approved the re-appointment of Mr. Rasesh Kanakia as Executive Chairman and Mr. Himanshu Kanakia as Managing Director for five-year terms from May 1, 2026 to April 30, 2031. Both appointments are subject to shareholder approval at the upcoming Annual General Meeting. The Board also approved a revision in remuneration for Mr. Ashish Rasesh Kanakia in senior management, pending shareholder approval. Mr. Rasesh Kanakia has been Chairman since the company's incorporation with 40 years of career experience, while Mr. Himanshu Kanakia has been Managing Director since incorporation with 37 years of experience. The appointments were recommended by the Nomination and Remuneration Committee.",
            "Sentiment": "positive",
            "PublishDate": 1753876495293,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cineline India Limited Reports Strong Q1 Performance with 27% Revenue Growth and Debt-Free Status",
            "Summary": "Cineline India Limited achieved debt-free status after selling its hotel asset Hyatt Centric Goa for INR 270 crores enterprise value, using proceeds to reduce total debt by INR 228 crores. The company reported 27% revenue growth in quarterly results, reaching INR 46.99 crores compared to INR 36.92 crores in the previous year. EBITDA increased 103% to INR 7.38 crores with margin improving to 15.7%. The film exhibition business showed strong operational metrics with admits growing 7% and average ticket price rising 16% to INR 232. Net box office collections increased 22% while food & beverage collections grew 31%. The company operates 19 cinemas with 77 screens across 13 cities and plans to launch 9 additional screens by December 2025. Cineline expects to have INR 80-100 crores cash reserves by FY26 to support expansion, with annual debt servicing savings of approximately INR 22 crores enabling regular free cash flow generation.",
            "Sentiment": "positive",
            "PublishDate": 1753865585152,
            "Source": "stock"
        },
        {
            "Title": "Cineline India Reports Loss of ₹205.88 Lakhs in Q1 Results",
            "Summary": "Cineline India Limited reported a net loss of ₹205.88 lakhs for the quarter ended June 30, 2025, compared to a loss of ₹656.65 lakhs in the same quarter last year. Revenue from operations increased to ₹4,528.98 lakhs from ₹3,647.27 lakhs year-over-year. Total income rose to ₹4,698.81 lakhs versus ₹3,692.06 lakhs in the previous year quarter. Total expenses were ₹4,969.24 lakhs, resulting in a loss before tax of ₹270.43 lakhs. The company's earnings per share from continuing operations was -₹0.60. The Board of Directors approved these unaudited standalone financial results, which were reviewed by statutory auditors KKC & Associates LLP. The company operates in a single segment and has no subsidiary companies.",
            "Sentiment": "negative",
            "PublishDate": 1753861023664,
            "Source": "earnings"
        },
        {
            "Title": "Cineline India Sells Hotel Asset for INR 270 Crores, Becomes Debt-Free",
            "Summary": "Cineline India has successfully monetized its hotel asset for INR 270 Crores, enabling the company to become net debt-free. The company plans to fully repay its existing debt with the proceeds from this sale. Moving forward, Cineline India intends to focus entirely on expanding its film exhibition business.",
            "Sentiment": "positive",
            "PublishDate": 1743466260000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cineline India Sells Hotel Asset for INR 270 Crores, Becomes Debt-Free",
            "Summary": "Cineline India has announced the monetization of its hotel asset for INR 270 crores. This transaction has enabled the company to become net debt-free, as it plans to fully repay its outstanding debt. Following this move, Cineline India states that it will now focus entirely on expanding its film exhibition business.",
            "Sentiment": "positive",
            "PublishDate": 1743234751000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cineline India Opens New Multiplex in Noida",
            "Summary": "Cineline India has opened a new 4-screen multiplex at RCube Monad Mall in Noida, Uttar Pradesh. This expansion represents growth in the company's cinema operations and presence in the National Capital Region.",
            "Sentiment": "positive",
            "PublishDate": 1734343093000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cineline India Approves Sale of Subsidiary Stake for 2.7 Billion Rupees",
            "Summary": "Cineline India has approved the sale of a stake in its subsidiary for approximately 2.7 billion rupees. The company has not provided further details about the subsidiary or the buyer in this brief announcement.",
            "Sentiment": "positive",
            "PublishDate": 1733819653000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cineline India Opens New Multiplex in Pune",
            "Summary": "<p><span class='positive'>Cineline India</span> has announced the <b>opening</b> of a new <span class='positive'>3-screen multiplex</span> at <span class='neutral'>Mariplex Mall</span> in <span class='neutral'>Pune, Maharashtra</span>. This <span class='positive'>expansion</span> marks the company's <span class='positive'>growth</span> in the entertainment sector and <span class='positive'>increases</span> its presence in the Pune market.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728998168000,
            "Source": "corporate_action"
        }
    ]
}