{
    "Symbol": "CIPLA",
    "ISIN": "INE059A01026",
    "News": [
        {
            "Title": "Cipla's InvaGen facility receives 2 USFDA observations",
            "Summary": "Cipla's US subsidiary InvaGen received 2 inspection observations from USFDA following Pre-Approval Inspection at its New York manufacturing facility from February 2-9, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770694079283,
            "Source": "stocks"
        },
        {
            "Title": "Cipla Faces GST Department Inspection at Maharashtra Facilities",
            "Summary": "Cipla Limited discloses GST Department inspection initiated on February 5, 2026 at its Maharashtra facilities. Company states no financial impact and operations remain unaffected during ongoing proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1770298420679,
            "Source": "stocks"
        },
        {
            "Title": "Cipla Allots 8,879 Equity Shares Under ESOS Schemes",
            "Summary": "Cipla Limited allotted 8,879 equity shares under employee stock option schemes on January 28, 2026, increasing paid-up capital to INR 1,61,55,61,354 with 80,77,80,677 total shares.",
            "Sentiment": "neutral",
            "PublishDate": 1769609061490,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cipla, Syngene fall on brokerage downgrades",
            "Summary": "Cipla shares declined 1.1% after JPMorgan downgrade to neutral following weak Q3 results. Syngene International hit four-year low, falling 10% on Jefferies downgrade and reduced revenue forecast.",
            "Sentiment": "negative",
            "PublishDate": 1769499384792,
            "Source": "stocks"
        },
        {
            "Title": "Cipla Sees Rs. 15.48 Crore NSE Block Trade",
            "Summary": "Cipla Ltd. witnessed a significant block trade on NSE worth Rs. 15.48 crores involving approximately 119,140 shares at Rs. 1298.90 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769488256283,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sun Pharma, Cipla Face US Product Recalls Over Quality Issues",
            "Summary": "Sun Pharma recalls over 26,000 bottles of generic medications while Cipla recalls 15,221 syringes in the US due to manufacturing defects and particulate matter presence respectively.",
            "Sentiment": "negative",
            "PublishDate": 1769486519067,
            "Source": "stocks"
        },
        {
            "Title": "Cipla Eyes Semaglutide Generics, Partners with Eli Lilly",
            "Summary": "Cipla is exploring entry into the semaglutide generics market and has partnered with Eli Lilly to launch Mounjaro under the Yurpeak brand, expanding its diabetes care portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1769163901681,
            "Source": "stocks"
        },
        {
            "Title": "Cipla Shares Drop 3.5% Despite Strong Q2 Performance",
            "Summary": "Cipla shares declined 3.5% to ₹1,322.40 amid high trading volume, despite reporting quarterly sales growth to ₹7,589 crores and improved profitability metrics across multiple financial parameters.",
            "Sentiment": "neutral",
            "PublishDate": 1769159441035,
            "Source": "stocks"
        },
        {
            "Title": "Cipla Announces Key Management Personnel Changes",
            "Summary": "Cipla Limited's Board approved changes in Key Managerial Personnel effective April 1, 2026, including updates to contact details for regulatory compliance under SEBI Listing Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769159139465,
            "Source": "stocks"
        },
        {
            "Title": "Cipla Re-appoints P R Ramesh as Independent Director",
            "Summary": "Cipla's Board approves re-appointment of Mr P R Ramesh as Independent Director for second five-year term from July 2026 to June 2031, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1769158951966,
            "Source": "stocks"
        },
        {
            "Title": "Cipla Co-CEO: New Launches to Offset Revlimid Impact",
            "Summary": "Cipla's Co-CEO indicates that upcoming product launches are expected to help cushion the revenue impact from Revlimid, as the pharmaceutical company navigates market dynamics in its oncology portfolio.",
            "Sentiment": "neutral",
            "PublishDate": 1769156811438,
            "Source": "stocks"
        },
        {
            "Title": "Cipla Q3 Net Profit Drops 57% to ₹6.76 Billion",
            "Summary": "Cipla reported consolidated net profit of ₹6.76 billion for Q3, marking a significant 57% decline from ₹15.70 billion in the same quarter last year, falling short of analyst estimates of ₹11.30 billion.",
            "Sentiment": "negative",
            "PublishDate": 1769155621769,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cipla partners ImmunoACT for CAR-T therapy in Africa",
            "Summary": "Cipla Ltd has partnered with ImmunoACT to launch talicabtagene autoleucel, an anti-CD19 CAR-T cell therapy, for blood cancer treatment across select African markets including South Africa, Algeria and Morocco.",
            "Sentiment": "positive",
            "PublishDate": 1768930250995,
            "Source": "stocks"
        },
        {
            "Title": "Cipla's Lanreotide Recall: $120-150M Product Resupply Delayed",
            "Summary": "Nomura reveals Cipla's recalled Lanreotide injection generates $120-150M annually, making it a top U.S. product, with resupply unlikely in H1 FY27 due to quality issues.",
            "Sentiment": "negative",
            "PublishDate": 1768798419984,
            "Source": "stocks"
        },
        {
            "Title": "Cipla Pauses Key Drug Production; Zydus Gets FDA Nod",
            "Summary": "Cipla halts Lanreotide injection production due to supply partner issues, while Zydus Lifesciences receives FDA approval for Eltrombopag tablets. Biocon raises ₹4,150 crore through QIP.",
            "Sentiment": "neutral",
            "PublishDate": 1768529157875,
            "Source": "stocks"
        },
        {
            "Title": "Cipla shares slide 5% on key drug production halt",
            "Summary": "Cipla shares fell 4.6% to Rs 1,367.8 after temporarily halting Lanreotide manufacturing following USFDA inspection observations at Greek facility. Nine Form 483 observations issued.",
            "Sentiment": "negative",
            "PublishDate": 1768519805364,
            "Source": "stocks"
        },
        {
            "Title": "Cipla's Lanreotide Production Halted at Greece Plant",
            "Summary": "USFDA issues Form 483 to Pharmathen's Greece facility, forcing Cipla to pause lanreotide production with supply resumption expected in first half of FY27.",
            "Sentiment": "negative",
            "PublishDate": 1768451185390,
            "Source": "stocks"
        },
        {
            "Title": "Cipla shares drop 2% on rival's generic Advair approval",
            "Summary": "Cipla shares fell nearly 2% after US FDA approved Aurobindo Pharma's generic Advair inhaler. Citi termed it marginal negative while expecting Cipla's own approval soon with $50M revenue potential by FY27.",
            "Sentiment": "negative",
            "PublishDate": 1768299861740,
            "Source": "stocks"
        },
        {
            "Title": "Cipla Block Trade Worth ₹68.52 Crores on NSE",
            "Summary": "Cipla witnessed a significant block trade on NSE involving 472,059 shares worth ₹68.52 crores at ₹1,451.50 per share, indicating substantial institutional activity in the pharmaceutical major.",
            "Sentiment": "neutral",
            "PublishDate": 1768194679142,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cipla Block Trade Worth ₹15.11 Crores on NSE",
            "Summary": "Cipla witnessed a significant block trade on NSE involving 103,457 shares valued at ₹15.11 crores, executed at ₹1,460.80 per share, indicating institutional interest in the pharmaceutical major.",
            "Sentiment": "neutral",
            "PublishDate": 1767939898945,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cipla evaluates FDA observations on partner Pharmathen",
            "Summary": "Cipla assesses impact of nine FDA inspectional observations issued to supply partner Pharmathen's Greece facility. Stock drops 4.28% amid regulatory concerns over lanreotide manufacturing.",
            "Sentiment": "negative",
            "PublishDate": 1767794139460,
            "Source": "stocks"
        },
        {
            "Title": "Cipla shares fall 4% on USFDA observations at partner",
            "Summary": "Cipla shares declined 4% after USFDA issued Form 483 to partner Pharmathen's Rodopi facility, highlighting serious cGMP compliance concerns including microbiological contamination risks.",
            "Sentiment": "negative",
            "PublishDate": 1767759184431,
            "Source": "stocks"
        },
        {
            "Title": "Cipla Sees ₹15.81 Cr NSE Block Trade at ₹1528.30",
            "Summary": "Cipla Ltd. recorded a significant NSE block trade worth ₹15.81 crores involving 103,426 shares at ₹1528.30 per share, indicating substantial institutional activity in the pharmaceutical stock.",
            "Sentiment": "neutral",
            "PublishDate": 1767682571762,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cipla Sees ₹76.53 Cr NSE Block Trade at Premium",
            "Summary": "Cipla witnessed a significant block trade on NSE worth ₹76.53 crores for 505,366 shares at ₹1,514.40 per share, indicating institutional interest in the pharmaceutical major.",
            "Sentiment": "neutral",
            "PublishDate": 1767586891170,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cipla's Global Chief People Officer to Retire",
            "Summary": "Cipla Limited announces the superannuation of Dr Raju Mistry, Global Chief People Officer and Senior Management Personnel, effective December 31, 2025. The company will announce his successor in due course.",
            "Sentiment": "neutral",
            "PublishDate": 1767088195963,
            "Source": "stocks"
        },
        {
            "Title": "Pfizer Signs Exclusive 5-Year Deal With Cipla For 4 Brands",
            "Summary": "Pfizer enters exclusive marketing agreement with Cipla for Corex, Dolonex, Neksium and Dalacin C brands in India for 5 years, with workforce reduction planned to support transition.",
            "Sentiment": "positive",
            "PublishDate": 1766124399699,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cipla Allots 585 Equity Shares Under ESOS Schemes",
            "Summary": "Cipla Limited allotted 585 equity shares under employee stock option schemes, increasing paid-up share capital to ₹1,615.54 crores comprising 80.78 crore equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1765975230529,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cipla Launches Yurpeak for Obesity & Diabetes",
            "Summary": "Cipla has launched Yurpeak (Tirzepatide), a new treatment for obesity and Type 2 diabetes, expanding its therapeutic portfolio in metabolic disorders.",
            "Sentiment": "positive",
            "PublishDate": 1765412004277,
            "Source": "stocks"
        },
        {
            "Title": "Cipla Launches Yurpeak (Tirzepatide) for Obesity and Type 2 Diabetes Treatment in India",
            "Summary": "Cipla launched Yurpeak (tirzepatide), a weekly injectable therapy for obesity and type 2 diabetes, under a marketing and distribution agreement with Eli Lilly and Company (India) Private Limited. The drug will be available in six strengths across India including regions beyond metro cities, with Lilly manufacturing and supplying the product at the same price as Mounjaro.",
            "Sentiment": "positive",
            "PublishDate": 1765363549365,
            "Source": "stock"
        },
        {
            "Title": "Cipla Receives ESG Rating of 66 from NSE Sustainability for FY2024-25",
            "Summary": "NSE Sustainability Ratings Analytics Limited has independently assigned an Environmental, Social, and Governance (ESG) rating of 66 to Cipla for FY2024-25. The pharmaceutical company received the rating communication on December 9, 2025, and has informed stock exchanges including BSE, NSE, and Luxembourg Stock Exchange as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1765352962167,
            "Source": "stock"
        },
        {
            "Title": "Cipla Completes 100% Acquisition of Inzpera Healthsciences",
            "Summary": "Cipla has completed the full takeover of Inzpera Healthsciences by acquiring the remaining stake to achieve 100% ownership. This acquisition strengthens Cipla's portfolio and expands its presence in the healthcare sector through complete control of Inzpera's operations.",
            "Sentiment": "positive",
            "PublishDate": 1764901065594,
            "Source": "corporate_action"
        },
        {
            "Title": "LIC Increases Stake in Cipla to 7.055% Through Market Purchases",
            "Summary": "Life Insurance Corporation of India acquired 16,402,663 shares of Cipla through market purchases between July 17, 2025 and November 27, 2025, increasing its holding from 5.025% to 7.055%. The acquisition represents a significant increase in LIC's stake in the pharmaceutical company, crossing the 7% threshold that requires regulatory disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1764574205277,
            "Source": "corporate_action"
        },
        {
            "Title": "CIPLA Advances to Second Position in Respiratory Drug Market as Segment Grows 14.7% in October",
            "Summary": "CIPLA's respiratory drug segment experienced 14.7% growth in October, driven by increased demand due to toxic air conditions. The company moved up to second place in the market, overtaking Abbott in the respiratory drugs segment.",
            "Sentiment": "positive",
            "PublishDate": 1764146290874,
            "Source": "stock"
        },
        {
            "Title": "Eli Lilly Receives Regulatory Approval to Market Donanemab in India",
            "Summary": "Eli Lilly has obtained approval to market Donanemab in India. This regulatory clearance allows the pharmaceutical company to commercialize the drug in the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1763449718816,
            "Source": "stock"
        },
        {
            "Title": "Mounjaro Becomes India's Top-Selling Drug with ₹1 Billion Monthly Revenue Through Cipla Partnership",
            "Summary": "Mounjaro achieved the position of India's highest revenue-generating drug in October, recording monthly sales of ₹1 billion. Eli Lilly has partnered with Cipla for the drug's distribution across India.",
            "Sentiment": "positive",
            "PublishDate": 1762493475775,
            "Source": "stock"
        },
        {
            "Title": "Cipla Reports Record Quarterly Revenue of ₹7,589 Crores with 25% EBITDA Margin",
            "Summary": "Cipla delivered its highest-ever quarterly revenue of ₹7,589 crores with 8% year-on-year growth and maintained a robust EBITDA margin of 25%. The company announced Achin Gupta as the designated CEO, effective January 1st, taking full responsibilities from April 1st. One-India business showed improving growth at 7% year-on-year, with key therapies like anti-diabetes (10%), cardiac (13%), urology (17%), and dermatology (18%) delivering strong double-digit growth. The company added four new brands to the ₹100 crores plus club, bringing the total to 29 brands. In North America, Cipla emerged as the number one player in the U.S. albuterol MDI market with 22% market share and launched filgrastim, its first biosimilar. The company entered the obesity care segment through a partnership with Eli Lilly, launching Yurpeak (tirzepatide) in India. Cipla revised its full-year EBITDA margin guidance to 22.75%-24% from the earlier 23.5%-24.5%, primarily due to increased R&D investments of 7.1% of revenue and reduced contribution from generic Revlimid. The company maintains a strong net cash position of ₹9,901 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762185363488,
            "Source": "earnings"
        },
        {
            "Title": "Cipla Acquires 100% Stake in Inzpera Healthsciences for INR 110.65 Crores",
            "Summary": "Cipla Limited has entered into definitive agreements to acquire 100% stake in Inzpera Healthsciences Limited for INR 110.65 crores through a cash transaction. Inzpera, incorporated in 2016, develops, manufactures and markets differentiated paediatric pharmaceutical and wellness products. The company reported turnover of INR 26.75 crores in FY2024-25, INR 22.05 crores in FY2023-24, and INR 20.76 crores in FY2022-23. The enterprise value is INR 120 crores, with the purchase consideration adjusted for working capital. The acquisition aims to combine Inzpera's paediatric pharmaceutical portfolio with Cipla's distribution network and operational capabilities. The transaction is expected to be completed within one month from signing, making Inzpera a wholly owned subsidiary of Cipla.",
            "Sentiment": "positive",
            "PublishDate": 1762165248557,
            "Source": "order&deals"
        },
        {
            "Title": "Cipla CEO States Eli Lilly Has Adequate Mounjaro Supply",
            "Summary": "Cipla's CEO Vohra announced that Eli Lilly has sufficient supply of Mounjaro, a diabetes medication. The statement addresses supply availability concerns for the pharmaceutical product.",
            "Sentiment": "positive",
            "PublishDate": 1761818529119,
            "Source": "stock"
        },
        {
            "Title": "Cipla Announces Leadership Transition: Achin Gupta to Replace Umang Vohra as MD & CEO in 2026",
            "Summary": "Cipla has announced a leadership transition effective March 31, 2026. Umang Vohra will step down from his position as Managing Director and Group Chief Executive Officer. Achin Gupta will assume the role of MD & GCEO starting April 1, 2026. Additionally, Meera Vanjari has been appointed as Global General Counsel, also effective April 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1761812438118,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cipla Reports 4% Growth in Net Profit to Rs 1,351 Crore in Q2",
            "Summary": "Cipla reported a 4% year-on-year growth in consolidated net profit to Rs 1,351 crore for the second quarter. Revenue from operations increased 8% year-on-year to Rs 7,589 crore. EBITDA improved marginally by 0.5% year-on-year to Rs 1,895 crore, with margins at 25%.",
            "Sentiment": "positive",
            "PublishDate": 1761811104506,
            "Source": "earnings"
        },
        {
            "Title": "Cipla Plans to Launch 7 New Products by 2026, Including Respiratory and Peptide Treatments",
            "Summary": "Cipla has announced plans to introduce 4 main respiratory products by 2026, with Gadvair scheduled for launch in the fourth quarter of FY26. The company also plans to introduce 3 peptide products, including Liraglutide, as part of its product expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1761810271270,
            "Source": "stock"
        },
        {
            "Title": "Cipla Reports Q2 Net Profit of 13.5B Rupees, Beating Estimates",
            "Summary": "Cipla reported quarterly EBITDA of 18.94 billion rupees compared to 18.9 billion rupees year-over-year, slightly exceeding estimates of 18.82 billion rupees. The EBITDA margin declined to 24.97% from 26.7% year-over-year, falling short of the estimated 25.5%. Consolidated net profit increased to 13.5 billion rupees from 13 billion rupees year-over-year, marginally above the estimate of 13.48 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1761809117544,
            "Source": "earnings"
        },
        {
            "Title": "Cipla Quarterly Results Expected to Show US Sales Decline Due to Revlimid Competition",
            "Summary": "Cipla is expected to report declining US market sales in its quarterly results due to increased competition for Revlimid Generic and fewer regulatory approvals. Analysts project US sales to fall between 3-12% with estimates around $220 million, compared to $226 million in the June quarter. Overall revenue is anticipated to grow 5% to ₹7,370 crore, while EBITDA may remain flat year-on-year. EBITDA margin is expected to narrow by 120 basis points to 25.5%, and net profit may grow 3% to ₹1,348 crore. The domestic formulations business is projected to grow 7-9%, while EU and Rest of World markets are expected to grow 8-10%. Key focus areas include performance of oncology drugs Nano Paclitaxel and Nilotinib capsules launched in June quarter, GST impact on domestic business, and updates on Revlimid generic pricing and Indore facility reinspection timeline. Cipla shares traded 0.6% lower at ₹1,570.8 ahead of earnings, though up 5% over the past month.",
            "Sentiment": "negative",
            "PublishDate": 1761806547844,
            "Source": "earnings"
        },
        {
            "Title": "ITC, Swiggy, Cipla, Hyundai, and Other Major Companies Report Quarterly Results",
            "Summary": "Several major companies including Aditya Birla Capital, Cipla, Swiggy, NTPC, ITC, and Hyundai Motor India are announcing their quarterly results. Cipla is expected to report a net profit of Rs 1,345.6 crore and revenue of Rs 7,438.5 crore for the September quarter. ITC is projected to post a net profit of Rs 21,152.8 crore and revenue of Rs 81,392.6 crore for the second quarter of fiscal 2026. Brokerages remain positive on ITC due to steady cigarette demand and gradual FMCG business improvement. The pharma sector faces challenges with projected revenue growth of 7-10% year-on-year and earnings growth of only 4-5%, reflecting margin pressures from declining gRevlimid sales, weak acute season demand in India, and GST-related de-stocking impacts.",
            "Sentiment": "neutral",
            "PublishDate": 1761785529821,
            "Source": "earnings"
        },
        {
            "Title": "Cipla Partners with Eli Lilly to Launch Second Brand of Tirzepatide in India",
            "Summary": "Cipla Limited has signed a marketing and distribution agreement with Eli Lilly and Company (India) Private Limited to launch Yurpeak, a second brand of tirzepatide in India. Tirzepatide was initially launched by Lilly in India in March 2025 under the brand name Mounjaro. Under the agreement, Cipla will distribute and promote Yurpeak at the same price as Mounjaro, with Lilly manufacturing and supplying the product. The partnership aims to expand availability of tirzepatide beyond cities where Lilly has established presence. Tirzepatide is a dual agonist prescription medication for treating type 2 diabetes and chronic weight management in adults with obesity or overweight conditions. The product will be available in KwikPen presentation with six dose strengths and will launch upon receiving regulatory approvals. India has approximately 101 million people living with diabetes and around 100 million people affected by obesity as of 2023.",
            "Sentiment": "positive",
            "PublishDate": 1761214189126,
            "Source": "order&deals"
        },
        {
            "Title": "Cipla Shares Worth Rs. 51.05 Crores Traded in NSE Block Deal",
            "Summary": "Cipla Ltd. witnessed a block trade on the National Stock Exchange involving approximately 331,705 shares at a price of Rs. 1,539.10 per share. The total transaction value amounted to Rs. 51.05 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1758776137693,
            "Source": "order&deals"
        },
        {
            "Title": "Cipla Schedules Board Meeting for October 30 to Review Quarterly Results",
            "Summary": "Cipla has announced that its board of directors will convene on October 30 to consider the company's Q2 results. The meeting will focus on reviewing the pharmaceutical company's second-quarter financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1758713806991,
            "Source": "earnings"
        },
        {
            "Title": "Cipla Recalls Over 20,000 Packs of Asthma Medication in US Due to Failed Stability Tests",
            "Summary": "Cipla USA, Inc. is recalling 20,352 packs of Albuterol Sulfate Inhalation Aerosol in the US due to failed stability specifications. The US Food and Drug Administration reported that out-of-specification results were observed in the Induction Port during particle size distribution analysis at the 12-month time point. The medication is used to treat asthma and chronic obstructive pulmonary disease. The New Jersey-based subsidiary of Mumbai-based Cipla initiated the Class III recall on July 24, which indicates the product is not likely to cause adverse health consequences.",
            "Sentiment": "negative",
            "PublishDate": 1756302521121,
            "Source": "stock"
        },
        {
            "Title": "Cipla Completes Acquisition of 20% Stake in iCaltech Innovations",
            "Summary": "Cipla has completed the acquisition of a 20% stake in iCaltech Innovations Pvt. Ltd. The pharmaceutical company has finalized this strategic investment in the private limited company.",
            "Sentiment": "positive",
            "PublishDate": 1756220065675,
            "Source": "order&deals"
        },
        {
            "Title": "Cipla's Bommasandra Facility Receives VAI Classification from USFDA",
            "Summary": "Cipla's Bommasandra facility has been classified as Voluntary Action Indicated (VAI) following a USFDA inspection. VAI classification indicates that objectionable conditions or practices were found during the inspection, but the agency is not prepared to take or recommend any administrative or regulatory action.",
            "Sentiment": "neutral",
            "PublishDate": 1754365409250,
            "Source": "stock"
        }
    ]
}