{
    "Symbol": "CLEAN",
    "ISIN": "INE227W01023",
    "News": [
        {
            "Title": "Clean Science Independent Director Completes Term",
            "Summary": "Clean Science and Technology Limited announces completion of Prof. Ganapati Dadasaheb Yadav's tenure as Independent Director effective February 5, 2026, with board expressing appreciation for his contributions.",
            "Sentiment": "neutral",
            "PublishDate": 1770466061701,
            "Source": "stocks"
        },
        {
            "Title": "Clean Science Declares ₹2 Interim Dividend Per Share",
            "Summary": "Clean Science & Technology announces interim dividend of ₹2 per share for shareholders, reflecting the company's commitment to returning value to investors through regular dividend distributions.",
            "Sentiment": "positive",
            "PublishDate": 1770293135387,
            "Source": "co_actions_results"
        },
        {
            "Title": "Clean Science Block Trade Worth Rs. 16.59 Crores",
            "Summary": "Clean Science and Technology Ltd. witnessed a significant NSE block trade worth Rs. 16.59 crores involving approximately 199,648 shares at Rs. 831.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1769921775471,
            "Source": "co_actions_results"
        },
        {
            "Title": "Clean Science Q3FY26 Results: Profit Drops 30% YoY",
            "Summary": "Clean Science & Technology reported Q3FY26 net profit of ₹518.97 million, down 30% YoY. Revenue declined 19.9% to ₹1,854.90 million. Board declared interim dividend of ₹2 per share.",
            "Sentiment": "negative",
            "PublishDate": 1769849531233,
            "Source": "co_actions_results"
        },
        {
            "Title": "Clean Science Board Meet on Jan 31 for Q3 Results",
            "Summary": "Clean Science and Technology Limited has scheduled its board meeting for January 31, 2026, to consider Q3FY26 financial results and interim dividend declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1768481288182,
            "Source": "co_actions_results"
        },
        {
            "Title": "Clean Science Block Trade Worth ₹20.91 Crores",
            "Summary": "Clean Science and Technology executed a significant NSE block trade involving 243,417 shares at ₹859.15 per share, totaling ₹20.91 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1768365770325,
            "Source": "co_actions_results"
        },
        {
            "Title": "Clean Science Starts Hydroquinone Production",
            "Summary": "Clean Science & Technology commences commercial production of hydroquinone and catechol, strengthening import substitution efforts and expanding market presence in specialty chemicals.",
            "Sentiment": "positive",
            "PublishDate": 1766040612714,
            "Source": "stocks"
        },
        {
            "Title": "Clean Science and Technology Allots 2,708 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Clean Science and Technology Limited allotted 2,708 equity shares of face value Re. 1 each to eligible employees under its CSTL ESOS 2021 scheme on December 6, 2025. The allotment increased the company's paid-up share capital from Rs. 10,62,73,791 to Rs. 10,62,76,499, with the new shares ranking pari passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1765005272067,
            "Source": "corporate_action"
        },
        {
            "Title": "Clean Science Promoter Group Members Transfer Equity Stakes Through Gift Transactions",
            "Summary": "Pooja Vivek Navandar and Prasad Krishnakumar Boob, promoter group members of Clean Science and Technology Limited, transferred 32,05,986 and 34,24,000 equity shares respectively on November 26, 2025 through inter-se gift transfers among promoters. The transactions reduced Navandar's shareholding from 3.22% to 0.21% and Boob's holding from 3.22% to 0.00%, representing internal restructuring within the promoter group without any monetary consideration.",
            "Sentiment": "neutral",
            "PublishDate": 1764313027506,
            "Source": "corporate_action"
        },
        {
            "Title": "Clean Science Promoter Group Member Acquires 6.24% Stake Through Gift Transfer",
            "Summary": "Nilima Krishnakumar Boob, a promoter group member of Clean Science and Technology Limited, acquired 66,29,986 equity shares (6.24% stake) through inter-se gift transfer from two other promoter group members on November 26, 2025. Her shareholding increased from 0.09% to 6.33%, while the overall promoter group holding remained unchanged as this was an internal transfer among family members to streamline assets and businesses.",
            "Sentiment": "neutral",
            "PublishDate": 1764312701837,
            "Source": "corporate_action"
        },
        {
            "Title": "Clean Science Promoter Parth Maheshwari Gifts 28.09 Lakh Shares, Reduces Stake to 0.09%",
            "Summary": "Parth Ashok Maheshwari, a promoter of Clean Science and Technology Limited, transferred 28,09,745 equity shares as a gift to another promoter on November 26, 2025. His shareholding decreased from 2.74% to 0.09% of the company's paid-up share capital following this inter-se transfer among promoters.",
            "Sentiment": "neutral",
            "PublishDate": 1764311914544,
            "Source": "corporate_action"
        },
        {
            "Title": "Clean Science Promoters Execute Share Transfers Worth 2.54% Stake",
            "Summary": "Ashok Ramnarayan Boob transferred 26,00,000 equity shares (2.45% stake) and Nidhi Mohunta transferred 57,99,745 equity shares (5.47% stake) of Clean Science and Technology Limited on November 26, 2025 through inter-se gift transfers among promoters. The transactions reduced Boob's shareholding from 5.90% to 3.45% and Mohunta's from 5.56% to 0.09%, representing internal promoter group restructuring without any monetary consideration.",
            "Sentiment": "neutral",
            "PublishDate": 1764311630126,
            "Source": "corporate_action"
        },
        {
            "Title": "Clean Science Promoter Acquires 26 Lakh Shares Through Gift Transfer",
            "Summary": "Siddhartha Ashok Sikchi acquired 26,00,000 equity shares of Clean Science and Technology Limited through an inter-se gift transfer from promoter group member Ashok Ramnarayan Boob. The acquisition increased Sikchi's shareholding from 2.96% to 5.41% while the overall promoter group holding remained unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1764310414715,
            "Source": "corporate_action"
        },
        {
            "Title": "Clean Science Promoter Group Member to Acquire 8.11% Stake Through Gift Transfer",
            "Summary": "Asha Ashok Boob, a promoter group member of Clean Science and Technology Limited, will acquire 86,19,490 equity shares (8.11% stake) from fellow promoter group members Parth Ashok Maheshwari and Nidhi Mohunta through gift transfer on or after November 26, 2025. The inter-se transfer among promoter group members falls under SEBI exemption regulations and will not change the aggregate holding of the promoter group.",
            "Sentiment": "neutral",
            "PublishDate": 1763608256188,
            "Source": "corporate_action"
        },
        {
            "Title": "Clean Science Promoter Group Member to Acquire 6.24% Stake Through Gift Transfer",
            "Summary": "Nilima Krishnakumar Boob, a promoter group member of Clean Science and Technology Limited, will acquire 66,29,986 equity shares (6.24% stake) from fellow promoter group members Prasad Krishnakumar Boob and Pooja Vivek Navandar through gift transfer on or after November 26, 2025. The inter-se transfer among promoter group members falls under SEBI exemption regulations and will not change the aggregate holding of the promoter group.",
            "Sentiment": "neutral",
            "PublishDate": 1763607401576,
            "Source": "corporate_action"
        },
        {
            "Title": "Clean Science Promoter Acquires 2.45% Stake Through Gift Transfer",
            "Summary": "Siddhartha Ashok Sikchi, a promoter of Clean Science and Technology Limited, will acquire 26 lakh equity shares (2.45% stake) from fellow promoter Ashok Ramnarayan Boob through a gift deed on or after November 26, 2025. This inter-promoter transfer falls under SEBI exemption regulations and aims to streamline family assets and businesses while maintaining the same aggregate promoter group holding.",
            "Sentiment": "neutral",
            "PublishDate": 1763607133701,
            "Source": "corporate_action"
        },
        {
            "Title": "Clean Science and Technology Seeks Shareholder Approval for Board Restructuring via Postal Ballot",
            "Summary": "Clean Science and Technology Limited has issued a postal ballot notice seeking shareholder approval for six resolutions including continuation of Ms. Madhu Dubhashi as independent director post-75 years, re-appointment of Mr. Keval Doshi, and appointment of two new independent directors. The company also proposes leadership changes with Mr. Ashok Boob transitioning from Managing Director to Executive Vice Chairman and Mr. Siddhartha Sikchi moving from Whole Time Director to Managing Director, effective April 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1763097892732,
            "Source": "corporate_governance"
        },
        {
            "Title": "Clean Science Reports 5% Sequential Revenue Decline in Q2 FY26 Amid China Market Challenges",
            "Summary": "Clean Science and Technology reported standalone revenue of INR 206 crores in Q2 FY26, declining 5% sequentially and 8% year-on-year. The revenue decline was primarily driven by lower sales in established products, with top four products contributing 80% to standalone revenue versus 84% in the previous quarter. EBITDA margins remained resilient at 44% despite the revenue moderation. Standalone EBITDA was INR 90 crores (down 10% quarter-on-quarter) and PAT was INR 65 crores (down 15% quarter-on-quarter). The company attributed lower sales to customers experiencing sharp price declines in their end products due to competitive pressure from Chinese suppliers, leading to slower procurement. Additionally, demand uncertainty in end markets prompted some customers to defer procurement plans. The HALS segment showed positive momentum with monthly run-rate volumes averaging 260 tons per month, representing over 25% growth compared to the previous quarter. Material margins for HALS portfolio improved to 35% from 31%. The company commercialized HALS 2020 and barbituric acid during the quarter. Performance Chemical 1 is undergoing chemical trials with satisfactory results, and commercialization is expected this month. The facility has an installed capacity of about 10,000 tons with potential revenue of INR 300 crores at current prices over a 3-year period by FY28.",
            "Sentiment": "negative",
            "PublishDate": 1762903431095,
            "Source": "earnings"
        },
        {
            "Title": "Clean Science and Technology Grants 29,447 Stock Options to Employees",
            "Summary": "Clean Science and Technology Limited has granted 29,447 stock options to eligible employees under its Employee Stock Option Scheme 2021. The options have an exercise price of Rs. 500 per option, with each option convertible into one equity share having a face value of Re. 1. The vesting schedule spans four years: 20% each in November 2026, 2027, and 2028, with the remaining 40% vesting in November 2029. Employees will have one year from each vesting date to exercise their respective options. The grant was approved by the Nomination and Remuneration Committee and complies with SEBI regulations for share-based employee benefits.",
            "Sentiment": "positive",
            "PublishDate": 1762462298429,
            "Source": "corporate_action"
        },
        {
            "Title": "Clean Science and Technology Reports Q2 FY2026 Results with Resilient EBITDA Margins",
            "Summary": "Clean Science and Technology Limited released its investor presentation for Q2 and H1 FY2026. The company reported consolidated revenue of INR 238 crore for Q2 FY2026, up 3% year-over-year, with EBITDA margins at 38.2%. For H1 FY2026, consolidated revenue reached INR 488 crore, up 6% year-over-year, with EBITDA margins of 38.9%. The performance segment's share in revenue mix increased to 36% in H1 FY2026 from 30% in the previous year, driven by higher sales of HALS series products. Raw material costs as percentage of revenue stood at 37.5% for H1 FY2026. The company maintains a debt-free balance sheet and has commercialized the largest HALS facility in India through its subsidiary Clean Fino Chem Ltd. Chemical trials for performance chemical 1 are underway, while construction for performance chemical 2 remains on track.",
            "Sentiment": "positive",
            "PublishDate": 1762451573030,
            "Source": "earnings"
        },
        {
            "Title": "Clean Science and Technology Reports Q2 Results, Proposes Board Changes via Postal Ballot",
            "Summary": "Clean Science and Technology Limited approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company reported quarterly revenue from operations of ₹2,113.14 million and profit after tax of ₹646.35 million, with earnings per share of ₹6.08. The Board recommended several resolutions for shareholder approval through postal ballot, including continuation of Ms. Madhu Dubhashi as Independent Director beyond age 75, re-appointment of Mr. Keval Doshi for a second five-year term, and appointment of two new Independent Directors - Mr. Raj Kamal and Ms. Pallavi Gokhale. Additionally, the company proposed designation changes for executive directors, with Mr. Ashok Boob moving from Managing Director to Whole Time Director-Executive Vice Chairman, and Mr. Siddhartha Sikchi transitioning from Whole Time Director to Managing Director. The e-voting period for the postal ballot is scheduled from November 17, 2025 to December 16, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762420591018,
            "Source": "earnings"
        },
        {
            "Title": "Clean Science and Technology Reports Mixed Q2 Results with Declining Profit but Improved Margins",
            "Summary": "Clean Science and Technology reported Q2 net profit of 646 million rupees, down from 674 million rupees in the same period last year. The company's EBITDA for the quarter was 900 million rupees compared to 945 million rupees year-over-year. Despite lower absolute profits, the EBITDA margin improved to 42.61% from 41.44% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762416370687,
            "Source": "earnings"
        },
        {
            "Title": "Clean Science and Technology Limited Completes 22nd AGM with All Nine Resolutions Approved",
            "Summary": "Clean Science and Technology Limited held its 22nd Annual General Meeting on September 11, 2025, through video conferencing with 70 shareholders attending. The company approved all nine resolutions including adoption of audited financial statements for the year ended March 31, 2025, confirmation of interim dividend of Rs. 2 per share and declaration of final dividend of Rs. 4 per share. Key appointments approved include re-appointment of Mr. Krishnakumar Ramnarayan Boob and Mr. Siddhartha Ashok Sikchi as Whole Time Directors effective April 1, 2026. The meeting also ratified cost auditor remuneration for 2025-26 and approved aggregate annual remuneration exceeding 5% of net profits for Executive Directors who are Promoters. M/s J.B. Bhave & Co. was appointed as secretarial auditors for five years. Voting was conducted through remote e-voting with 78.69% of outstanding shares participating in the process.",
            "Sentiment": "positive",
            "PublishDate": 1757602579394,
            "Source": "corporate_action"
        },
        {
            "Title": "Clean Science and Technology Plans to Add Two Independent Directors to Board",
            "Summary": "Clean Science and Technology Limited announced its intention to recommend the appointment of two additional independent directors to its Board. The management aims to balance board diversity and support long-term strategic planning through these appointments. The Nomination and Remuneration Committee will consider the recommendation in November 2025, followed by board approval and shareholder approval through special resolutions.",
            "Sentiment": "positive",
            "PublishDate": 1756975024873,
            "Source": "corporate_governance"
        },
        {
            "Title": "Clean Science Promoters Sell 24% Stake Worth ₹2.55 Crore Shares in Market Transaction",
            "Summary": "Six promoters of Clean Science and Technology Limited sold a combined 24% stake in the company through on-market transactions on August 21, 2025. The sellers included Krishnakumar Ramnarayan Boob, Nilima Krishnakumar Boob, Shradha Kariwala, Ashok Ramnarayan Boob, Asha Ashok Boob, and Parth Ashok Maheshwari, who collectively disposed of 2.55 crore shares. Following the sale, the promoter group's total holding decreased from 74.97% to 50.97% of the company's equity. The transaction involved shares listed on BSE Limited and National Stock Exchange of India Limited, with the company having an equity share capital of 10.63 crore shares as of June 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1756131165775,
            "Source": "corporate_action"
        },
        {
            "Title": "Clean Science Trading Error Exposes Flaws in India's Block Deal System",
            "Summary": "A major trading error involving Clean Science & Technology Ltd. has highlighted potential weaknesses in India's block deal system. Avendus Capital's unit accidentally executed duplicate trades while attempting to sell 24% of Clean Science shares worth $300 million, believing their initial transaction hadn't gone through. The incident occurred because the trades were conducted during regular market hours rather than in India's dedicated 15-minute block deal windows, which only allow discounts up to 1%. The Clean Science shares were offered at a 13% discount, exceeding the block deal limit. In response, India's Securities and Exchange Board proposed changes including tripling the discount limit to 3% and raising minimum trade sizes to 250 million rupees from 100 million rupees. Block deals have become increasingly popular in India, overtaking IPOs as a preferred method for large investors to reduce holdings. Market experts suggest that large block deals relative to company size should be conducted in separate block windows to prevent similar incidents.",
            "Sentiment": "negative",
            "PublishDate": 1756117497130,
            "Source": "stock"
        },
        {
            "Title": "Norges Bank Acquires Rs 158 Crore Stake in Clean Science as Promoters Sell 20% Holdings",
            "Summary": "Norway-based Norges Bank purchased 14.62 lakh shares worth Rs 158 crore in Clean Science and Technology through a block deal at Rs 1,077.68 per share, representing a 9% discount to the previous closing price of Rs 1,180.80. Nippon India Mutual Fund emerged as the largest buyer, acquiring 31.15 lakh shares for Rs 335 crore at Rs 1,075.20 per share. SBI Mutual Fund purchased 27.52 lakh shares for Rs 296 crore, while Bajaj Allianz Life Insurance bought 8 lakh shares worth Rs 86 crore. The transactions involved promoters Asha Ashok Boob and Ashok Ramnarayan Boob selling over 1.9 crore shares, representing approximately 20% stake in the company. Clean Science shares closed 2.8% lower at Rs 1,147.80. The stock has experienced significant declines with a 24.46% drop over the past year and 23.36% decline year-to-date.",
            "Sentiment": "negative",
            "PublishDate": 1755792960991,
            "Source": "order&deals"
        },
        {
            "Title": "Clean Science Confirms Trading Error Led to Block Deal Mix-up, Promoters Sell 24% Stake",
            "Summary": "Clean Science and Technology confirmed that Spark Institutional Equities Pvt. Ltd. made a punching error during a block trade, resulting in sell orders for significantly more shares than authorized. The error led to 6 crore shares appearing to change hands instead of the intended 2.5 crore shares. Promoters Ashok Boob, Krishnakumar Boob, and Parth Maheshwari were the sellers in the block trade. The company clarified that the actual sale was limited to 24% of outstanding equity (2.5 crore shares), not the 56% that the error initially suggested. The sellers are awaiting a detailed explanation from SIEPL regarding the incident and remedial steps. The stock experienced volatility, declining 7% initially, recovering 13% from day's low, then giving up gains to trade 2.2% lower at ₹1,154.4. Clean Science shares have declined 9.5% in the past month and 25.2% year-to-date.",
            "Sentiment": "negative",
            "PublishDate": 1755769855680,
            "Source": "stock"
        },
        {
            "Title": "Clean Science Shares Hit 52-Week Low After Promoter Block Sale",
            "Summary": "Clean Science and Technology shares fell to a 52-week low following a promoter equity sale through block deals. Around 60 million shares were traded in block deals, exceeding the planned 25.5 million shares. The floor price was set at Rs 1,030 per share, representing a 13% discount to the previous day's closing price. The stock declined 9.3% intraday to Rs 1,070.5 on the NSE. Trading volume reached 6,343 times the 30-day average, with total traded value of Rs 6,953 crore on BSE. The promoter stake stands at 74.97%. The stock has declined 19% over the past 12 months and 26% year-to-date. Among 14 analysts covering the stock, eight have 'buy' ratings, two recommend 'hold', and four suggest 'sell', with the average 12-month price target indicating 35% potential upside.",
            "Sentiment": "negative",
            "PublishDate": 1755751249512,
            "Source": "stock"
        },
        {
            "Title": "Clean Science Tech Reports Punching Error by Spark Avendus Caused Unusual Trading Volume",
            "Summary": "Clean Science Tech executive stated that a punching error by Spark Avendus resulted in extraordinary trading volume. The company clarified that the block deal involved 24% equity only.",
            "Sentiment": "neutral",
            "PublishDate": 1755750076474,
            "Source": "order&deals"
        },
        {
            "Title": "Clean Science and Technology Sees Large Block Trades Worth Rs 2,531 Crores",
            "Summary": "Clean Science and Technology experienced significant block trading activity across both major exchanges. On BSE, approximately 20.84 million shares were traded at Rs 1,124 per share, totaling Rs 2,342.92 crores. Additionally, on NSE, around 1.74 million shares changed hands at Rs 1,078.70 per share, amounting to Rs 188.19 crores. The combined block trades were worth over Rs 2,531 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1755748511138,
            "Source": "order&deals"
        },
        {
            "Title": "Clean Science and Technology Sees Rs. 108.76 Crore Block Trade on NSE",
            "Summary": "Clean Science and Technology Ltd. witnessed a block trade worth Rs. 108.76 crores on the NSE. The transaction involved approximately 993,265 shares executed at Rs. 1,095.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1755748120940,
            "Source": "order&deals"
        },
        {
            "Title": "Clean Science Promoters to Sell 24% Stake Worth ₹2,626 Crore Through Block Deals",
            "Summary": "Promoters Ashok Boob and Krishna Boob plan to sell up to 24% stake in Clean Science and Technology through block deals at a floor price of ₹1,030 per share, representing a 13% discount to current market price. The speciality chemical manufacturer reported June quarter revenue of ₹240 crore, up 8% year-on-year, with EBITDA rising 5% to ₹100 crore. Net profit increased 6% while margins compressed 100 basis points to 41.7%. Over 25% of revenue came from newer product launches and the company gained market share. Management revised full-year EBITDA growth guidance to 15-18% from earlier 18-20%, expressing optimism for the second half, particularly the fourth quarter. Shares closed at ₹1,181.20, down 0.70%.",
            "Sentiment": "neutral",
            "PublishDate": 1755706552475,
            "Source": "order&deals"
        },
        {
            "Title": "Clean Science Invests ₹70 Crore in Subsidiary Clean Fino-Chem",
            "Summary": "Clean Science has invested ₹70 crore in its wholly owned subsidiary Clean Fino-Chem. The investment represents a capital infusion into the subsidiary company.",
            "Sentiment": "positive",
            "PublishDate": 1753880395398,
            "Source": "stock"
        },
        {
            "Title": "Clean Science and Technology: Q1 Results and Potential Stake Sale Impact Stock",
            "Summary": "Clean Science and Technology's shares fell 7% following Q1 results and management's commentary on potential stake sale. Q1 revenue increased 8% YoY to ₹240 crore, EBITDA up 5% YoY. Margins narrowed to 41.7%. Promoters evaluating minority stake sale for family estate planning. Full-year EBITDA growth guidance revised to 15-18% from 18-20%.",
            "Sentiment": "negative",
            "PublishDate": 1752814077000,
            "Source": "earnings"
        },
        {
            "Title": "Clean Science & Tech Adjusts Growth Projections Amid New Product Launches",
            "Summary": "Clean Science & Tech has revised its EBITDA growth predictions from 18-20% to 15-18%. The company expects profitability despite potentially missing revenue goals for its HALS unit business due to new product launches. Q2 growth is anticipated to be slow, similar to Q1, with a real increase expected in Q3 and particularly in Q4. More details are expected after Q2 results.",
            "Sentiment": "neutral",
            "PublishDate": 1752809582000,
            "Source": "default"
        },
        {
            "Title": "Clean Science And Technology's Co-Promoter Group Considers Minority Stake Sale",
            "Summary": "Clean Science And Technology's co-promoter group is considering selling a minority stake in the company. Siddhartha Sikchi, a key figure in the company, has pledged to maintain his current shareholding. The proposed sale will not significantly alter the company's ownership structure, as the promoter group will retain over 50% ownership after the transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1752751073000,
            "Source": "default"
        },
        {
            "Title": "Clean Science and Tech Reports Q1 Financial Results",
            "Summary": "Clean Science and Tech has released its Q1 financial results. The company reported an EBITDA of 1 billion rupees, up from 978 million rupees in the same quarter last year. The EBITDA margin improved to 45.77% from 45% year-over-year. Net profit increased to 766 million rupees from 722 million rupees in the previous year. Revenue remained stable at 2.2 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1752749601000,
            "Source": "result"
        },
        {
            "Title": "Clean Science and Tech Reports Q4 Results and Declares Dividend",
            "Summary": "Clean Science and Tech has reported its quarterly results. The company's Q4 EBITDA increased to 1.05 billion rupees from 987 million rupees year-over-year. However, the EBITDA margin decreased to 42.59% from 43.79% in the same period last year. Revenue for Q4 rose to 2.45 billion rupees from 2.25 billion rupees year-over-year. The company's standalone net profit for Q4 increased to 786 million rupees from 748 million rupees in the previous year. Additionally, Clean Science and Tech has declared a dividend of 4 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747898361000,
            "Source": "result"
        },
        {
            "Title": "Clean Science & Technology to Consider Q4 Results on May 22",
            "Summary": "Clean Science & Technology has announced that it will consider its fourth quarter (Q4) financial results on May 22. This indicates the company is preparing to release its latest earnings report, which will provide insights into its financial performance for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1745933169000,
            "Source": "default"
        },
        {
            "Title": "Clean Science Receives Mega Project Offer from Maharashtra Government",
            "Summary": "Clean Science and Technology Limited has announced that the Government of Maharashtra has issued an offer letter for mega projects to the company. This development suggests potential significant investment or expansion opportunities for Clean Science in the state of Maharashtra.",
            "Sentiment": "positive",
            "PublishDate": 1740734560000,
            "Source": "corporate_action"
        },
        {
            "Title": "Clean Science & Technology: Q3 Profit Rises 4.81% YoY, Revenue Up 23.67%",
            "Summary": "Clean Science & Technology reported Q3 FY25 results with profit at ₹65.64 crore, up 4.81% YoY. Revenue increased 23.67% YoY to ₹240.82 crore. Operating income rose 6.47% YoY. EPS stood at ₹6.18, up 4.92% YoY. Analysts' consensus recommendation is Buy.",
            "Sentiment": "positive",
            "PublishDate": 1738303690000,
            "Source": "earnings"
        },
        {
            "Title": "Clean Science Approves 3 Billion Rupee Investment in Clean Fino-Chem",
            "Summary": "Clean Science has approved an additional investment of 3 billion rupees in Clean Fino-Chem, a subsidiary or related entity. This significant financial commitment suggests a strategic expansion or development initiative within the company's operations.",
            "Sentiment": "positive",
            "PublishDate": 1738225510000,
            "Source": "corporate_action"
        },
        {
            "Title": "Clean Science and Technology Reports Q3 EBITDA Growth",
            "Summary": "Clean Science and Technology has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 1.02 billion rupees, up from 864 million rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 44.13% from 44.39% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738225496000,
            "Source": "earnings"
        },
        {
            "Title": "Clean Science and Technology Reports Q3 Profit and Revenue Growth",
            "Summary": "Clean Science and Technology has reported a year-over-year increase in both profit and revenue for the third quarter. The company's net profit rose to 741 million rupees from 624 million rupees in the same period last year. Revenue also saw growth, reaching 2.3 billion rupees compared to 1.95 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1738225422000,
            "Source": "earnings"
        },
        {
            "Title": "Clean Science and Technology to Consider Q3 Results",
            "Summary": "Clean Science and Technology Limited has announced that it will consider its third quarter (Q3) financial results on January 30. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737385064000,
            "Source": "earnings"
        },
        {
            "Title": "Clean Science and Technology Subsidiary Begins Commercial Production of DHDT",
            "Summary": "Clean Science and Technology has announced that its wholly owned subsidiary has commenced commercial production of 2,5-Dihydroxy-1,4-dithiane (DHDT). This development marks a significant milestone for the company's expansion into new chemical products.",
            "Sentiment": "positive",
            "PublishDate": 1735552837000,
            "Source": "corporate_action"
        },
        {
            "Title": "Clean Science Subsidiary Begins Commercial Production of BHA",
            "Summary": "Clean Science and Technology Limited has announced that its subsidiary, Clean Fino-Chem Limited, has commenced commercial production of Butylated Hydroxyanisole (BHA). This development marks an expansion in the company's product portfolio and manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1734413185000,
            "Source": "corporate_action"
        },
        {
            "Title": "Clean Science: Q2 Results Show Continued Margin Pressure",
            "Summary": "Clean Science's Q2 results indicate ongoing pressure on margins, impacting overall performance according to a review by Motilal Oswal.",
            "Sentiment": "negative",
            "PublishDate": 1731051996000,
            "Source": "result"
        },
        {
            "Title": "Clean Science and Tech Reports Q2 EBITDA Growth",
            "Summary": "Clean Science and Technology has reported its Q2 financial results. The company's EBITDA increased to 945 million rupees from 756 million rupees year-over-year. However, the EBITDA margin slightly decreased to 41.44% from 41.71% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730964435000,
            "Source": "result"
        }
    ]
}