{
    "Symbol": "CLEDUCATE",
    "ISIN": "INE201M01029",
    "News": [
        {
            "Title": "CL Educate Q3FY26 Results Show Mixed Performance",
            "Summary": "CL Educate reported consolidated revenue growth of 67% to ₹445.1 crore in Q3FY26, driven by strong performance in assessments and MarTech business, though the company posted a net loss of ₹15.7 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1770371005360,
            "Source": "co_actions_results"
        },
        {
            "Title": "CL Educate Amends UPSI Fair Disclosure Code",
            "Summary": "CL Educate Limited has amended its Code of Practices and Procedures for Fair Disclosure of Unpublished Price Sensitive Information to incorporate recent SEBI regulatory amendments.",
            "Sentiment": "neutral",
            "PublishDate": 1770303306378,
            "Source": "stocks"
        },
        {
            "Title": "CL Educate Faces ₹15.46 Cr GST Demand on Subsidiary",
            "Summary": "CL Educate received GST order demanding ₹15.46 crores in tax and penalty on former subsidiary CL Media for alleged excess Input Tax Credit during FY19-22. Company plans to contest through appellate process.",
            "Sentiment": "negative",
            "PublishDate": 1767719744745,
            "Source": "stocks"
        },
        {
            "Title": "CL Educate Reports 64% Revenue Growth to Rs 319 Crores in H1 FY26, Driven by DEXIT Global Integration",
            "Summary": "CL Educate's revenue surged 64% year-on-year to Rs 319 crores in H1 FY26, with DEXIT Global contributing Rs 139 crores following successful integration of the acquired NSEIT business. Despite strong operational performance with EBITDA growing 101% to Rs 50 crores, net profit declined to Rs 1.5 crores from Rs 7.5 crores due to higher finance costs of Rs 26 crores from acquisition-related borrowings and increased depreciation.",
            "Sentiment": "positive",
            "PublishDate": 1763112399693,
            "Source": "earnings"
        },
        {
            "Title": "CL Educate Reports 62% Revenue Growth to Rs 310 Cr in H1FY26, Net Profit Drops to Rs 1.5 Cr",
            "Summary": "CL Educate Limited reported consolidated operating revenue growth of 62% year-on-year to Rs 310 crores for the half year ended September 30, 2025. Consolidated operating EBITDA increased 92% to Rs 40.9 crores. However, consolidated net profit declined to Rs 1.5 crores from Rs 7.6 crores in the previous year, primarily due to increased finance costs rising to Rs 26 crores from Rs 4.4 crores and higher depreciation of Rs 19 crores versus Rs 8.3 crores previously. The revenue growth was largely driven by DEX segment performance at Rs 139 crores compared to Rs 124 crores last year, with DEX EBITDA improving from Rs 27 crores to Rs 38 crores. On standalone basis, operating revenue decreased 11% to Rs 154 crores with operating EBITDA down 60% to Rs 5.5 crores, resulting in a standalone net loss of Rs 10 crores. The company conducted 27 lakh assessments including for clients like IRDAI, NISM, ICAI, and NTA. Key business highlights include retention of market share in MBA segment, expansion into schools through institutional partnerships, and successful client retention across segments.",
            "Sentiment": "neutral",
            "PublishDate": 1762762850220,
            "Source": "earnings"
        },
        {
            "Title": "CL Educate Reports 62% Revenue Growth in H1 FY26, Operating EBITDA Surges 92%",
            "Summary": "CL Educate Limited announced quarterly results for the quarter and half-year ended September 30, 2025. Consolidated revenue from operations grew 62% year-over-year to ₹310.03 crore for the half-year period, compared to ₹190.82 crore in the corresponding period last year. Operating EBITDA increased 92% to ₹40.87 crore versus ₹21.23 crore in H1 FY25. However, net profit declined to ₹1.49 crore from ₹7.55 crore in the previous year, primarily due to increased finance costs (₹26.15 crore vs ₹1.46 crore) and depreciation (₹18.54 crore vs ₹8.34 crore) following the acquisition of DEXIT Global Limited. For the quarter, revenue from operations increased 13% to ₹164.34 crore compared to ₹145.68 crore in the previous quarter. The company continues to face challenges from discontinued operations, recording a loss of ₹175.49 lacs in the current quarter. The company operates across three main segments: EdTech, MarTech, and DEX (digital assessments).",
            "Sentiment": "positive",
            "PublishDate": 1762539977638,
            "Source": "earnings"
        },
        {
            "Title": "CL Educate Schedules Q2 FY26 Earnings Call on Metaverse Platform",
            "Summary": "CL Educate Limited will announce its Q2 FY26 results on November 7, 2025, followed by an earnings call on November 10, 2025, at 3:30 PM IST. The company will host the earnings call on the Kestone Metaverse platform, marking a digital approach to investor communication. The call will discuss unaudited financial results for the quarter and half year ended September 30, 2025. Management representation includes Chairman Satya Narayanan R, Vice Chairman and Managing Director Gautam Puri, Executive Director Group CEO Nikhil Mahajan, and CFO Arjun Wadhwa. A recording of the call will be made available on the company's website. CL Educate operates across EdTech, MarTech and Digital Assessments segments and has been listed on BSE and NSE since 2017.",
            "Sentiment": "neutral",
            "PublishDate": 1762366733275,
            "Source": "earnings"
        },
        {
            "Title": "CL Educate Reports 58% Revenue Growth to Rs 149.84 Crores in Q1 FY26, Posts Net Loss Due to Acquisition Costs",
            "Summary": "CL Educate Limited reported consolidated revenue growth of 58% year-on-year to Rs 149.84 crores in Q1 FY26, driven primarily by the integration of DEXIT Global (formerly NSEIT). Operating EBITDA increased 66% to Rs 17.5 crores. However, the company posted a net loss of Rs 3.71 crores compared to a profit of Rs 4.2 crores in the same quarter last year, primarily due to increased finance costs of Rs 12.7 crores from the Rs 200 crore loan taken for the DEX acquisition. DEXIT Global showed strong performance with revenue growing 54% to Rs 59.2 crores and EBITDA more than doubling to Rs 12.8 crores. The MarTech division recorded modest 7% revenue growth to Rs 37.2 crores, while EdTech revenues declined marginally due to market shifts toward self-preparation models in the MBA segment. The company executed over 17 lakh assessments in the quarter and signed new contracts worth Rs 53 crores including deals with AYUSH Ministry, IIBF, and NISM. Management expects the finance costs and depreciation impacts to ease in coming quarters as the acquired assets begin delivering value.",
            "Sentiment": "neutral",
            "PublishDate": 1755000276037,
            "Source": "earnings"
        },
        {
            "Title": "CL Educate Reports 58% Revenue Growth to ₹149.8 Cr in Q1 FY26, Posts Net Loss of ₹3.7 Cr",
            "Summary": "CL Educate Limited reported consolidated revenue growth of 58% year-on-year to ₹149.8 crores in Q1 FY26, driven largely by its DEX business segment. The company's consolidated operating EBITDA increased 66% to ₹17.5 crores. However, the company posted a consolidated net loss of ₹3.7 crores compared to a profit in the previous year, primarily due to increased finance costs of ₹12.7 crores and higher depreciation from intangible assets creation. The DEX segment showed strong performance with revenue up 54% to ₹59.2 crores and EBITDA jumping 124% to ₹12.8 crores. The EdTech division faced challenges with revenue declining 11% to ₹60.1 crores and EBITDA dropping 33% to ₹6.4 crores due to structural changes in student preparation habits. The MarTech segment reported 7% revenue growth to ₹37.2 crores. DEX conducted over 17 lakh assessments and secured new contracts with clients including Ayush, IIBF, UIDAI, and Meazure Learning.",
            "Sentiment": "neutral",
            "PublishDate": 1754639699853,
            "Source": "earnings"
        },
        {
            "Title": "CL Educate Reports 56% Revenue Growth in Q1 FY26 Despite Net Loss Due to DEXIT Acquisition Costs",
            "Summary": "CL Educate Limited announced its quarterly results for the period ended June 30, 2025, showing consolidated revenue from operations growing 56% year-over-year to ₹145.68 crore. Operating EBITDA increased 66% to ₹17.50 crore. However, the company reported a consolidated net loss of ₹3.71 crore, primarily due to increased finance costs (₹12.76 crore vs ₹0.72 crore in Q1 FY25) and depreciation expenses (₹8.74 crore vs ₹4.13 crore in Q1 FY25) related to the DEXIT Global acquisition completed in February 2025. The Board approved several key appointments including Mr. Yatrik Vin as Additional Independent Director for a 5-year term, and re-appointments of senior executives including Chairman Satya Narayanan R, Vice-Chairman Gautam Puri, and Executive Director Nikhil Mahajan for 3-year terms starting April 2026. The company also approved renewal of its employee stock option plan and granted up to 35,000 options to employees. DEXIT's revenue grew 55% to ₹56.20 crore with operating EBITDA of ₹9.85 crore. The company discontinued certain product offerings to avoid conflict of interest with DEXIT's examination business, recognizing a loss of ₹97.27 lacs from discontinued operations.",
            "Sentiment": "neutral",
            "PublishDate": 1754577684201,
            "Source": "corporate_action"
        },
        {
            "Title": "CL Educate Reports Q4 Financial Results with Significant Losses",
            "Summary": "CL Educate has reported its Q4 financial results, showing a decline in performance. The company's EBITDA dropped to 11.6 million rupees from 50.6 million rupees year-over-year, with EBITDA margin falling to 1.19% from 6.99%. The company recorded an exceptional loss of 41.9 million rupees. Q4 revenue increased to 974.6 million rupees from 724.7 million rupees, but the company reported a net loss of 157.2 million rupees compared to a profit of 18.8 million rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1747238755000,
            "Source": "result"
        },
        {
            "Title": "CL Educate to Acquire NSEIT Ltd for 2.30 Billion",
            "Summary": "CL Educate has announced plans to acquire 100% shareholding of NSEIT Ltd. The acquisition is structured at 2.30 billion Indian Rupees, with 750 million tied to an earn-out based on NSEIT's FY25 performance.",
            "Sentiment": "positive",
            "PublishDate": 1738669431000,
            "Source": "corporate_action"
        },
        {
            "Title": "CL Educate Reports Q3 EBITDA Loss",
            "Summary": "CL Educate, an education services company, has reported an EBITDA loss of 12 million rupees in the third quarter, compared to a gain of 47 million rupees in the same period last year. This represents a significant year-over-year decline in the company's operational performance.",
            "Sentiment": "negative",
            "PublishDate": 1738662221000,
            "Source": "earnings"
        },
        {
            "Title": "CL Educate Reports Q3 Financial Results",
            "Summary": "CL Educate has reported its Q3 financial results, showing a net loss of 31 million rupees compared to a profit of 29 million rupees in the same quarter last year. The company's revenue increased to 705 million rupees from 664 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738662117000,
            "Source": "earnings"
        }
    ]
}