{
    "Symbol": "CLSEL",
    "ISIN": "INE419D01026",
    "News": [
        {
            "Title": "Chaman Lal Setia Exports Schedules Q3 FY26 Call",
            "Summary": "Chaman Lal Setia Exports Ltd. has scheduled an investor conference call for February 13, 2026, at 01:00 PM IST to discuss Q3 & 9M FY26 financial performance for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770397295295,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chaman Lal Setia Board Meet Set for Feb 12",
            "Summary": "Chaman Lal Setia Exports has scheduled its board meeting for February 12, 2026, to consider Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769684267153,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chaman Lal Setia Exports Reports Revenue Decline Due to Lower Rice Prices and Customer Buying Delays",
            "Summary": "Chaman Lal Setia Exports experienced export sales decline of approximately INR 150 crores in Q2/H1 FY26 as rice prices fell from INR 71/kg to INR 60/kg, causing customers to delay purchases expecting further price drops. The company maintained profitability ratios despite volume decline and targets INR 1,500 crore revenue for FY26, leveraging low procurement prices and expanded capacity from new plants in Karnal and Gandhidham.",
            "Sentiment": "neutral",
            "PublishDate": 1763205897324,
            "Source": "earnings"
        },
        {
            "Title": "Chaman Lal Setia Exports Reports Quarterly Financial Results",
            "Summary": "Chaman Lal Setia Exports Limited announced its standalone unaudited financial results for the quarter ended September 30, 2025. The rice miller and exporter reported revenue from operations of Rs 272.96 crores and a net profit of Rs 19.93 crores for the quarter. The company's earnings per share stood at Rs 3.81 (basic) and Rs 3.81 (diluted). The Board of Directors approved these results at their meeting held on November 11, 2025. The company operates in the business of manufacturing, trading and marketing of rice.",
            "Sentiment": "neutral",
            "PublishDate": 1762866498071,
            "Source": "earnings"
        },
        {
            "Title": "Chaman Lal Setia Exports Reports Flat Q1 FY26 Volumes Amid Geopolitical Challenges and Price Volatility",
            "Summary": "Chaman Lal Setia Exports held its quarterly earnings call discussing Q1 FY26 performance. The company reported export volumes of 33,797 tons and total volumes of 41,255 tons, remaining flat compared to the previous year's Q1 figure of 41,169 tons. Revenue declined by approximately 15% due to lower rice prices, though the company maintained stable margins. Management cited geopolitical issues, including conflicts involving Russia-Iran and disruptions in Lebanon and Yemen, as factors affecting business decisions. The company has opened new processing units - one in Mundra operational from July 4th and two out of three units in Karnal are operational, with each unit capable of generating INR 100 crore annual revenue. Management indicated they deliberately slowed business operations in Q1 due to expected rice price declines with the new crop season, targeting INR 400 crore revenue for Q2. The company remains debt-free and has reduced inventory levels while awaiting lower-priced new crop arrivals. US tariff increases to 25% on Indian rice exports were discussed, though management expects minimal impact on their ethnic customer base. The company operates across 94-95 countries and is exploring opportunities in Russia and Japan markets.",
            "Sentiment": "neutral",
            "PublishDate": 1754995608531,
            "Source": "earnings"
        },
        {
            "Title": "Chaman Lal Setia Exports Reports Q1FY26 Results with Revenue of Rs 307 Crores",
            "Summary": "Chaman Lal Setia Exports Limited submitted its quarterly investor presentation showing revenue of Rs 307.3 crores for Q1FY26, compared to Rs 362.8 crores in Q1FY25 and Rs 367.7 crores in Q4FY25. The company reported net profit of Rs 21.6 crores with a PAT margin of 7.0%, up from 6.2% in Q1FY25. EBITDA stood at Rs 29.4 crores with a margin of 9.6%. Export revenue was Rs 261 crores for the quarter. The basmati rice exporter operates in 90+ countries through 440+ distributors and maintains processing capacity of 660 MT per day with warehouse capacity of 82,500 MT. The company's gross margin improved to 24.8% from 19.0% in the previous year quarter. EPS for the quarter was Rs 4.35 compared to Rs 4.37 in Q1FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1754405229945,
            "Source": "stock"
        },
        {
            "Title": "Chaman Lal Setia Exports Reports Decline in Q1 Profit and Revenue",
            "Summary": "Chaman Lal Setia Exports reported a net profit of 216.4 million rupees in Q1, down from 226 million rupees in the same period last year. The company's revenue also decreased to 3.07 billion rupees compared to 3.62 billion rupees year-over-year. Both key financial metrics showed a decline from the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754391061760,
            "Source": "earnings"
        },
        {
            "Title": "Chaman Lal Setia Exports: No Impact on Freight via Strait of Hormuz Amid Iran-Israel Tensions",
            "Summary": "Rajeev Setia, Joint Managing Director of Chaman Lal Setia Exports Ltd., reports no disruption in cargo movement through the Strait of Hormuz despite Iran-Israel conflict. The company ceased exports to Iran 20 years ago due to sanctions. While global exports are affected, with some shipments stuck at ports, ocean freight rates remain stable for now.",
            "Sentiment": "neutral",
            "PublishDate": 1750334211000,
            "Source": "normal_news"
        },
        {
            "Title": "Chaman Lal Setia Exports Targets INR 2,000 Crore Revenue",
            "Summary": "Chaman Lal Setia Exports has announced a revenue target of INR 2,000 crores for the year, as disclosed during a company conference call. This guidance provides insight into the company's growth expectations for the upcoming period.",
            "Sentiment": "positive",
            "PublishDate": 1748575855000,
            "Source": "default"
        },
        {
            "Title": "Chaman Lal Setia Exports Reports Q4 Results and Recommends Dividend",
            "Summary": "Chaman Lal Setia Exports has announced its Q4 financial results and dividend recommendation. The company's Q4 EBITDA was 334 million rupees, down from 356 million rupees year-over-year. The EBITDA margin decreased slightly to 9.08% from 9.28% in the same period last year. Net profit for Q4 increased to 246 million rupees from 233 million rupees year-over-year, but decreased from 290 million rupees quarter-on-quarter. Revenue for Q4 was 3.7 billion rupees, down from 3.8 billion rupees year-over-year. The company has recommended a dividend of 2.5 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1748437817000,
            "Source": "result"
        },
        {
            "Title": "Chaman Lal Setia Exports Reports Q3 Financial Results",
            "Summary": "Chaman Lal Setia Exports has reported its third quarter financial results. The company's net profit decreased to 290 million rupees from 387 million rupees in the same quarter last year. Revenue also saw a slight decline, coming in at 3.95 billion rupees compared to 4 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1739233363000,
            "Source": "earnings"
        },
        {
            "Title": "Chaman Lal Setia Exports Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Chaman Lal Setia Exports has reported a decrease in its Q3 EBITDA, which fell to 395 million rupees from 520 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 9.99% from 13% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739192510000,
            "Source": "earnings"
        },
        {
            "Title": "Chaman Lal Setia Exports Reports Q3 Financial Results",
            "Summary": "Chaman Lal Setia Exports has announced its financial results for the third quarter. The company reported a net profit of 290 million rupees, down from 387 million rupees in the same period last year. Revenue for Q3 stood at 3.95 billion rupees, slightly lower than the 4 billion rupees reported in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1739192507000,
            "Source": "earnings"
        },
        {
            "Title": "Chaman Lal Setia Exports Reports Q2 Financial Results",
            "Summary": "Chaman Lal Setia Exports announced its Q2 financial results. The company's EBITDA for the quarter was 361 million rupees, compared to 356 million rupees in the same quarter last year, showing a slight increase. However, the EBITDA margin decreased from 11.55% to 9.76% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730721631000,
            "Source": "result"
        },
        {
            "Title": "Chaman Lal Setia Exports Reports Q2 Financial Results",
            "Summary": "Chaman Lal Setia Exports announced its Q2 financial results. The company's net profit increased to 267 million rupees, up from 262 million rupees year-over-year and 226 million rupees quarter-over-quarter. Revenue for Q2 rose to 3.69 billion rupees, compared to 3.1 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730721569000,
            "Source": "result"
        }
    ]
}