{
    "Symbol": "CMSINFO",
    "ISIN": "INE925R01014",
    "News": [
        {
            "Title": "CMS Info Systems Board Meet on Feb 12 for Q3 Results",
            "Summary": "CMS Info Systems Limited has scheduled a board meeting on February 12, 2026, to consider Q3FY26 unaudited financial results and interim dividend declaration for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1770620464037,
            "Source": "co_actions_results"
        },
        {
            "Title": "CMS Info Systems Reports India's Cash Usage Resilience",
            "Summary": "CMS Info Systems releases its fourth consumption trends report showing cash dispensed per ATM at ₹1.21 Cr in CY'25, with insurance spending surging 32% and organised retail chains growing 22% amid GST reforms.",
            "Sentiment": "positive",
            "PublishDate": 1769575558683,
            "Source": "stocks"
        },
        {
            "Title": "CMS Info Systems Surges 7% on ₹1,000 Cr SBI Contract Win",
            "Summary": "CMS Info Systems shares jumped nearly 7% after announcing a ₹1,000 crore 10-year integrated cash solutions contract with SBI covering 5,000 ATMs nationwide.",
            "Sentiment": "positive",
            "PublishDate": 1767764383093,
            "Source": "co_actions_results"
        },
        {
            "Title": "CMS Info Systems announces board changes",
            "Summary": "CMS Info Systems announces retirement of Independent Director Ms. Sayali Karanjkar and approval of Ms. Vidya Krishnan as Independent Director Designate, pending NOC from SBI.",
            "Sentiment": "neutral",
            "PublishDate": 1767194299464,
            "Source": "stocks"
        },
        {
            "Title": "CMS Info Systems Co-CEO Plans Acquisitions to Strengthen HawkAI Platform",
            "Summary": "CMS Info Systems' Co-CEO announced plans to acquire companies in the payments and technology sectors. The acquisitions are intended to enhance the company's HawkAI machine-learning platform capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1764818694118,
            "Source": "stock"
        },
        {
            "Title": "CMS Info Systems Q2 FY26 Revenue Drops 3% to INR 609 Crores, PAT Falls 20% on ATM Network Disruptions",
            "Summary": "CMS Info Systems reported consolidated revenue of INR 609 crores for Q2 FY26, declining 3% sequentially from INR 627 crores. PAT dropped 20% to INR 73 crores from INR 94 crores in the previous quarter, with margins contracting 280 basis points to 12.1%. The company faced temporary disruption with 4,000 ATMs becoming inactive due to private sector banks rationalizing off-site ATMs and funding constraints among MSPs post-AGS issues. This led to revenue impact of approximately INR 15 crores. The company took prudent provisions of INR 10 crores due to elongated payment cycles. Managed Services Tech revenue grew 5% sequentially to INR 271 crores, while cash logistics dropped 5% to INR 395 crores. Order wins for the quarter stood at INR 500 crores from leading private sector banks. The SBI cash outsourcing RFP concluded, representing incremental revenue opportunity of INR 500 crores over 10 years. Management expects to reach 74,000-75,000 ATMs by March and sequential improvement in revenue and margins through Q3 and Q4. HAWKAI platform continues rapid growth, on track to reach 50,000+ sites by year-end from 30,000 at the beginning of FY26.",
            "Sentiment": "negative",
            "PublishDate": 1762857260775,
            "Source": "earnings"
        },
        {
            "Title": "CMS Info Systems Provides Multi-Year Growth Guidance Across ATM and Digital Platform Businesses",
            "Summary": "CMS Info Systems shared its business expansion targets during a conference call. The company expects to operate 74,000-75,000 ATMs in its cash business by March FY26. The Hawkai platform is projected to reach over 50,000 sites by end of FY26 and expand to 80,000 sites by FY30. For FY26, the company estimates capital expenditure of around INR 300 crores. Services revenue is expected to grow 9% in H2 FY26 to INR 1,225 crores from H1's INR 1,125 crores, indicating 8% overall FY26 services revenue growth. Looking ahead to FY27, the company targets services revenue of INR 2,700-2,800 crores, representing 15-19% growth.",
            "Sentiment": "positive",
            "PublishDate": 1762486923446,
            "Source": "stock"
        },
        {
            "Title": "CMS Info Systems Hits 52-Week Low Following Disappointing Q2 Results",
            "Summary": "CMS Info Systems shares fell to a 52-week low of ₹340.20, trading down 4.32% at ₹346.85. The business services firm reported consolidated revenue of ₹609 crore for Q2 FY26, declining 3% year-on-year, while profit after tax dropped 19% to ₹73.3 crore with margins contracting to 12%. For the first half of FY26, revenue remained flat at ₹1,236 crore with 1% growth, though PAT fell 8% to ₹167 crore. The company attributed weak performance to softer retail consumption due to extended monsoon rains and temporary delays in ATM redeployment by banking clients. The Cash Logistics segment saw EBIT plunge 39% despite marginal revenue growth, while Managed Services posted a 5% decline in EBIT. CMS announced new order wins worth ₹500 crore in Q2 and completed the Securens acquisition. CEO Rajiv Kaul expressed confidence in recovery, targeting 9% revenue growth in H2 over H1. The stock has declined from its 52-week high of ₹556.90 reached in December 2024.",
            "Sentiment": "negative",
            "PublishDate": 1762415007323,
            "Source": "earnings"
        },
        {
            "Title": "CMS Info Systems Reports Decline in Q2 Financial Performance",
            "Summary": "CMS Info Systems reported consolidated net profit of 733.5 million rupees for Q2, down from 909 million rupees in the same quarter last year. Revenue decreased to 6.08 billion rupees from 6.24 billion rupees year-over-year. EBITDA fell to 1.37 billion rupees compared to 1.52 billion rupees in the previous year. The company's EBITDA margin compressed to 22.58% from 24.49% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762350217105,
            "Source": "earnings"
        },
        {
            "Title": "CMS Info Systems Increases Stake in Securens Systems to 99.50%",
            "Summary": "CMS Info Systems Limited has completed the acquisition of an additional 12,06,150 equity shares of ₹10 each in Securens Systems Private Limited. This acquisition increases CMS Info Systems' aggregate holding in Securens to 99.50% of the total share capital on a fully diluted basis. The company plans to acquire the remaining shares of Securens in one or more tranches and will provide separate notifications upon completion of each transaction.",
            "Sentiment": "positive",
            "PublishDate": 1761656210447,
            "Source": "order&deals"
        },
        {
            "Title": "CMS Info Systems Increases Stake in SecureNS Systems to 75.78% with ₹25.03 Crore Investment",
            "Summary": "CMS Info Systems has raised its ownership in SecureNS Systems to 75.78% through a ₹25.03 crore investment via a rights issue. The investment is aimed at enhancing the AIOT (Artificial Intelligence of Things) remote monitoring business.",
            "Sentiment": "positive",
            "PublishDate": 1759890793544,
            "Source": "stock"
        },
        {
            "Title": "CMS Info Systems Increases Stake in SecuRens Systems to 56.17%",
            "Summary": "CMS Info Systems has completed the second stage of its acquisition of SecuRens Systems, increasing its ownership stake to 56.17%. This transaction represents a strategic expansion of CMS Info Systems' portfolio through the finalization of a multi-stage purchase agreement.",
            "Sentiment": "positive",
            "PublishDate": 1759325754929,
            "Source": "order&deals"
        },
        {
            "Title": "CMS Info Systems Reports Weak H1 Results, Sets FY30 Revenue Targets",
            "Summary": "CMS Info Systems reported weak results for the first half of the fiscal year. The company has projected revenue targets for FY30, estimating ₹3,750-3,950 crore through organic growth and ₹4,500-4,750 crore through inorganic growth strategies.",
            "Sentiment": "negative",
            "PublishDate": 1759290686245,
            "Source": "earnings"
        },
        {
            "Title": "CMS Info Systems Reschedules Annual Analyst Meet 2025 and Presents Growth Outlook",
            "Summary": "CMS Info Systems rescheduled its Annual Analyst Meet 2025 to 4:15 PM IST on September 30, 2025, due to logistical reasons. The company presented its investor presentation outlining three core business segments: ATM Management Solutions (₹1,300 Cr revenue), Retail Solutions & Currency Logistics (₹640 Cr), and Technology & Payment Solutions (₹240 Cr), totaling ₹2,180 Cr in services revenue for FY25. The company reported 16% revenue CAGR and 19% PAT CAGR growth, with total revenues reaching ₹2,425 Cr. CMS projects FY30 revenue potential of ₹3,750-3,950 Cr at 12% CAGR organically, with aspirational targets of ₹4,500-4,750 Cr including inorganic growth at 16% CAGR. The company maintains a 42% market share in cash logistics and operates across 97% of India's districts. CMS holds a cash balance of ₹1,000 Cr and targets a 'Rule of 35' combining revenue growth and EBITDA margin exceeding 35%.",
            "Sentiment": "positive",
            "PublishDate": 1759232309087,
            "Source": "stock"
        },
        {
            "Title": "CMS Info Systems Completes 53.89% Acquisition of Securens Systems in First Tranche",
            "Summary": "CMS Info Systems Limited has completed the acquisition of 15,14,299 Compulsorily Convertible Preference Shares of Securens Systems Private Limited, representing 53.89% of the target company's share capital on a fully diluted basis. This acquisition was completed under the first tranche of their arrangement. The company plans to acquire the remaining shares of Securens Systems through one or more additional tranches, with each transaction to be disclosed separately upon completion.",
            "Sentiment": "positive",
            "PublishDate": 1758006420585,
            "Source": "order&deals"
        },
        {
            "Title": "CMS Info Systems Secures Contract to Replace 1,000 ATMs for India Post Payments Bank",
            "Summary": "CMS Info Systems has been awarded a contract to replace 1,000 ATMs and cash dispensers for India Post Payments Bank following the bankruptcy of previous service provider AGS Transact Technologies. The IPPB had experienced disruptions in ATM operations due to AGS's financial troubles. CMS managed 73,000 ATMs as of March 31, 2025, representing 47% of all outsourced ATMs in India, along with 65,000 retail touchpoints. The collapse of AGS, which previously operated nearly 40,000 ATMs, has led several banks to transition to CMS. India's total ATM network contracted by 4% to 208,063 by end-July 2025 from 216,352 a year earlier. Private banks are using this disruption to restructure ATM strategies, shifting from brown label models to fixed-cost contracts and upgrading to cash recyclers that function as self-service kiosks for broader transaction capabilities.",
            "Sentiment": "neutral",
            "PublishDate": 1756686945137,
            "Source": "order&deals"
        },
        {
            "Title": "CMS Info Systems Reports 5% Revenue Growth to ₹627 Crores in Q1 FY26 Amid Industry Challenges",
            "Summary": "CMS Info Systems delivered consolidated revenue of ₹627 crores (up 5% year-on-year) and PAT of ₹93.6 crores (up 3%) for the quarter ended June 30, 2025. The company faced headwinds from a 10% dip in India ATM transactions, geopolitical issues, and muted consumption, resulting in an estimated revenue impact of ₹8-10 crores. Both cash logistics and managed services segments grew 8% year-on-year to ₹417 crores and ₹258 crores respectively. The company secured new orders worth ₹500 crores during the quarter, including a multi-year software contract with a leading bank. CMS announced a binding agreement to acquire Securens Systems Private Limited for approximately ₹80 crores enterprise value, valued at 10X FY2025 adjusted EBITDA. The company expanded its cash logistics footprint to 153,000 business touchpoints (9% year-on-year increase) and increased its ATM cash market share to 58-60%. Management highlighted challenges from AGS-related ATM shutdowns affecting the industry, with almost 50% of AGS's 20,000 brown label ATMs shut down. The company maintained its pricing discipline and focus on fixed-price contracts over transaction-linked models.",
            "Sentiment": "neutral",
            "PublishDate": 1753795176851,
            "Source": "earnings"
        },
        {
            "Title": "CMS Info Systems Reports Q1 FY26 Results with ₹627 Crore Revenue and ₹93.6 Crore Net Profit",
            "Summary": "CMS Info Systems Limited reported quarterly results with total income from operations of ₹6,274.05 million (₹627.40 crore) and net profit after tax of ₹935.79 million (₹93.58 crore). On a consolidated basis, the company showed total income from operations of ₹6,274.05 million, net profit before tax of ₹1,255.95 million, and net profit after tax of ₹935.79 million. Basic earnings per share stood at ₹5.69 and diluted earnings per share at ₹5.59. On standalone basis, total income from operations was ₹5,820.89 million with net profit after tax of ₹841.29 million. The results were reviewed by the Audit Committee and approved by the Board of Directors at their meeting held on July 23, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753437942772,
            "Source": "earnings"
        },
        {
            "Title": "CMS Info Systems Targets ₹2,500 Crore Revenue By FY27",
            "Summary": "CMS Info Systems has set a revenue target of ₹2,500 crore by FY27. The company plans to achieve this growth through AI-powered ATM automation, expansion of cash logistics operations, development of profitable managed services, and growth in digital payment infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1753287841428,
            "Source": "stock"
        },
        {
            "Title": "CMS Info Systems Acquires SecureNS Systems for ₹80 Crore",
            "Summary": "CMS Info Systems has acquired SecureNS Systems for ₹80 crore. The acquisition is aimed at strengthening the company's Vision AI capabilities and positioning it as a leader in AIOT (Artificial Intelligence of Things) surveillance market.",
            "Sentiment": "positive",
            "PublishDate": 1753286782760,
            "Source": "order&deals"
        },
        {
            "Title": "CMS Info Systems Reports Steady Q1 FY26 Performance Despite Consumption Slowdown",
            "Summary": "CMS Info Systems delivered steady quarterly results with revenue of ₹627 crores (5% YoY growth), EBITDA of ₹163 crores (3% YoY growth), and PAT of ₹94 crores (3% YoY growth). The company achieved significant business milestones including 1,53,000 business touchpoints in cash logistics (9% YoY growth), ₹500 crores in order wins across software, managed services and cards, and secured a multi-year software contract with ICICI Bank for their entire ATM network. CMS announced a strategic acquisition in Vision AI business with ₹80 crores investment and launched new brand positioning 'UNIFIED PLATFORM. LIMITLESS POSSIBILITIES.' However, the company faced challenges from subdued consumption trends impacting retail spend and ATM transactions, slow ATM roll-outs by operators completing only one-third of planned deployments, and cancellation of a large PSU bank cash outsourcing tender. The company consolidated business and operations teams under new leadership appointments and continues focusing on executing its order book while maintaining stable business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1753286756846,
            "Source": "earnings"
        },
        {
            "Title": "CMS Info Systems Reports 5% Revenue Growth in Q1 FY26, Announces Securens Acquisition for Rs 80 Crore",
            "Summary": "CMS Info Systems Limited reported consolidated revenue of Rs 627 crore for the quarter ended June 30, 2025, marking a 5% year-over-year growth. The company's profit after tax increased 3% to Rs 93.6 crore with a margin of 15%. The Cash Logistics Business generated revenue of Rs 417 crore (8% YoY growth) while Managed Services & Technology Solutions recorded Rs 258 crore revenue (8% YoY growth). The company secured Rs 500 crore in new order wins and expanded its business touchpoints to 1,53,000 (9% YoY growth). Additionally, CMS announced a binding agreement to acquire up to 100% stake in Securens Systems Private Limited for approximately Rs 80 crore. Securens operates in the AIoT remote monitoring services industry and reported turnover of Rs 772.1 million for FY2024. The acquisition aims to scale CMS's Vision AI business through its HAWKAI brand, positioning it as a market leader with twice the scale of its closest competitor.",
            "Sentiment": "positive",
            "PublishDate": 1753284110010,
            "Source": "earnings"
        },
        {
            "Title": "CMS Info Systems Reports Q1 Net Profit Growth to 936M Rupees",
            "Summary": "CMS Info Systems reported Q1 consolidated net profit of 936 million rupees, up from 908 million rupees in the same period last year. Revenue increased to 6.27 billion rupees from 5.99 billion rupees year-over-year. EBITDA rose to 1.58 billion rupees from 1.52 billion rupees, though EBITDA margin declined slightly to 25.16% from 25.40% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753283755526,
            "Source": "earnings"
        },
        {
            "Title": "CMS Info Systems Unveils New Brand Positioning 'Unified Platform. Limitless Possibilities.'",
            "Summary": "CMS Info Systems Limited announced a new brand positioning 'Unified Platform. Limitless Possibilities.' to reflect its transformation from a cash logistics company to a broader business services institution. The company now offers integrated end-to-end solutions for banking and retail sectors through its nationwide network, technology-driven solutions, and domain expertise. Managed Services & Technology Solutions contribute 40% of overall revenue. CEO Rajiv Kaul stated the rebrand was necessary due to the revenue shift, while retaining the CMS brand name for its strong customer recognition and trust. The company has launched a refreshed website showcasing how its solutions enhance operational efficiency for customers. CMS provides logistics and technology solutions to banks, financial institutions, organized retail, and e-commerce companies across Cash Logistics, Managed Services, and Technology Solutions segments.",
            "Sentiment": "positive",
            "PublishDate": 1753096233501,
            "Source": "stock"
        },
        {
            "Title": "CMS Info Systems: Last Day to Buy Shares for Special and Final Dividend Eligibility",
            "Summary": "Thursday is the final day to purchase CMS Info Systems shares to qualify for the special dividend of Rs 3 and final dividend of Rs 3.25 per equity share. The ex-dividend and record date is set for Friday, May 23. The company's Q4 consolidated net profit rose 5% to Rs 97.5 crore, with revenue up 6.5% to Rs 619 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747894269000,
            "Source": "corporate_action"
        },
        {
            "Title": "CMS Info Systems: Targets Double-Digit Growth, Expands Managed Services",
            "Summary": "CMS Info Systems aims for 14-17% CAGR over next two years. Managed services to reach 45% of revenue in 5 quarters. Vision AI and software verticals contribute 7% of revenue, targeting 10% by FY27. Company gained market share across verticals, with cash management market share at 44-45%. H2 FY25 saw ₹800 crore in order wins, with Q4 at ₹500 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747813436000,
            "Source": "earnings"
        },
        {
            "Title": "CMS Info Systems: Q4 Profit Up 7%, Declares ₹9.50 Total Dividend for FY25",
            "Summary": "CMS Info Systems reported a 6.8% YoY increase in Q4 FY25 net profit to ₹97.6 crore. Revenue rose 4.2% to ₹162.2 crore. The company declared a special interim dividend of ₹3.00 per share and recommended a final dividend of ₹3.25 per share, bringing the total FY25 dividend to ₹9.50 per share. New contract wins for Q4 totaled ₹500 crore, with annual order wins reaching ₹1,200 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747673648000,
            "Source": "earnings"
        },
        {
            "Title": "CMS Info Systems Reports Q4 Results and Dividend Announcement",
            "Summary": "CMS Info Systems has announced its Q4 financial results and dividend plans. The company's Q4 consolidated net profit increased to 975.6 million rupees from 914 million rupees year-over-year. Q4 revenue slightly decreased to 6.19 billion rupees from 6.27 billion rupees in the previous year. EBITDA for Q4 rose to 1.62 billion rupees from 1.55 billion rupees, with EBITDA margin improving to 26.18% from 24.79%. The company has recommended a final dividend of 3.25 rupees per equity share and declared a special (interim) dividend of 3 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747670177000,
            "Source": "result"
        },
        {
            "Title": "CMS Info Systems to Consider Q4 Results on May 19",
            "Summary": "CMS Info Systems has announced that it will consider its fourth quarter (Q4) financial results on May 19. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747141037000,
            "Source": "default"
        },
        {
            "Title": "CMS Info Systems Receives No Objection for De-classification of Sion Investment",
            "Summary": "CMS Info Systems has received approval for the de-classification of Sion Investment Holdings Pte. Limited. This corporate action suggests a change in the company's ownership structure or investor relations, potentially impacting shareholder dynamics.",
            "Sentiment": "neutral",
            "PublishDate": 1743639050000,
            "Source": "corporate_action"
        },
        {
            "Title": "CMS Info Systems Receives No Objection for De-classification of Sion Investment",
            "Summary": "CMS Info Systems has received approval for the de-classification of Sion Investment. This suggests a change in the company's investment structure or ownership, potentially impacting its corporate governance or shareholder composition.",
            "Sentiment": "neutral",
            "PublishDate": 1743603687000,
            "Source": "corporate_governance"
        },
        {
            "Title": "CMS Info Systems: Potential Beneficiary of AGS Transact's Liquidity Issues",
            "Summary": "CMS Info Systems' stock has gained 7.5% in eight trading sessions amid concerns over liquidity issues at competitor AGS Transact Technologies. AGS defaulted on loan repayments, potentially benefiting CMS in the medium term. However, CMS faces short-term pressure due to delayed project executions. The company expects 13-15% annual revenue growth in the medium term.",
            "Sentiment": "positive",
            "PublishDate": 1741739998000,
            "Source": "normal_news"
        },
        {
            "Title": "BKKM Appeals NCLAT Judgment to Supreme Court in CMS Info Systems Case",
            "Summary": "CMS Info Systems has announced that BKKM has filed an appeal with the Supreme Court against a judgment previously made by the National Company Law Appellate Tribunal (NCLAT). This legal action suggests an ongoing dispute involving CMS Info Systems and BKKM, with the matter now escalating to India's highest court for further review and potential resolution.",
            "Sentiment": "neutral",
            "PublishDate": 1739838522000,
            "Source": "corporate_governance"
        },
        {
            "Title": "BKKM Appeals NCLAT Judgment to Supreme Court in CMS Info Systems Case",
            "Summary": "CMS Info Systems has reported that BKKM has filed an appeal with the Supreme Court against a judgment previously made by the National Company Law Appellate Tribunal (NCLAT). This legal action suggests an ongoing dispute involving CMS Info Systems and BKKM, with the matter now escalating to India's highest court for further review.",
            "Sentiment": "neutral",
            "PublishDate": 1739801371000,
            "Source": "corporate_governance"
        },
        {
            "Title": "CMS Info Systems Reports Q3 Financial Results and Declares Dividend",
            "Summary": "CMS Info Systems announced its Q3 consolidated net profit of 932 million rupees, up from 871 million rupees year-over-year and 909 million rupees quarter-over-quarter. The company's Q3 revenue was 5.8 billion rupees, slightly down from 5.82 billion rupees in the same quarter last year. Additionally, CMS Info Systems declared a dividend of 3.25 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1738801192000,
            "Source": "earnings"
        },
        {
            "Title": "CMS Info Systems Declares Dividend of 3.25 Rupees per Share",
            "Summary": "CMS Info Systems has announced a dividend of 3.25 rupees per equity share. This corporate action represents a return of value to shareholders and may indicate positive financial performance or cash flow for the company.",
            "Sentiment": "positive",
            "PublishDate": 1738768536000,
            "Source": "corporate_action"
        },
        {
            "Title": "CMS Info Systems Reports Improved Q3 EBITDA and Margin",
            "Summary": "CMS Info Systems has announced its Q3 financial results, showing an increase in EBITDA to 1.6 billion rupees from 1.5 billion rupees year-over-year. The company's EBITDA margin also improved, rising to 27.46% from 25.90% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738768493000,
            "Source": "earnings"
        },
        {
            "Title": "CMS Info Systems Reports Q3 FY24 Financial Results",
            "Summary": "CMS Info Systems announced its Q3 financial results. The company reported a consolidated net profit of 932 million rupees, up from 871 million rupees year-over-year and 909 million rupees quarter-over-quarter. However, revenue slightly decreased to 5.8 billion rupees from 5.82 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738768389000,
            "Source": "earnings"
        },
        {
            "Title": "CMS Info Systems Sets Ambitious Revenue Growth Target for FY25",
            "Summary": "CMS Info Systems aims to increase its revenue from Rs 2,265 crore in FY24 to a target range of Rs 2,500-2,700 crore in FY25. The company also projects a Total Addressable Market (TAM) of over Rs 22,000 crore by FY27.",
            "Sentiment": "positive",
            "PublishDate": 1730086669000,
            "Source": "corporate_action"
        },
        {
            "Title": "CMS Info Systems Reports Q2 EBITDA Growth",
            "Summary": "CMS Info Systems announced its Q2 financial results. The company's EBITDA increased to 1.6 billion rupees from 1.46 billion rupees year-over-year. However, the EBITDA margin decreased to 24.97% from 26.79% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1729862249000,
            "Source": "result"
        },
        {
            "Title": "CMS Info Systems Reports Q2 Revenue Growth",
            "Summary": "CMS Info Systems has reported a revenue of 6.24 billion rupees for the second quarter, compared to 5.44 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729862240000,
            "Source": "result"
        },
        {
            "Title": "CMS Info Systems Reports Q2 Profit Growth",
            "Summary": "CMS Info Systems announced its Q2 consolidated net profit of 909 million rupees, showing an increase from 844 million rupees year-over-year. The profit remained relatively stable compared to the previous quarter's 908 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1729862229000,
            "Source": "result"
        }
    ]
}