{
    "Symbol": "CNL",
    "ISIN": "INE985W01018",
    "News": [
        {
            "Title": "Creative Newtech wins ₹54.15 crore govt orders",
            "Summary": "Creative Newtech Limited secures two major government contracts worth ₹54.15 crore from Government of Maharashtra for body-worn cameras and disaster management kits.",
            "Sentiment": "positive",
            "PublishDate": 1770351973923,
            "Source": "co_actions_results"
        },
        {
            "Title": "Creative Newtech Q3 Net Profit Jumps 37% to ₹234M",
            "Summary": "Creative Newtech reported consolidated net profit of ₹234 million in Q3, marking a significant 37% increase from ₹171 million in the same quarter last year, demonstrating strong operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1770285452198,
            "Source": "co_actions_results"
        },
        {
            "Title": "Creative Newtech Partners with EIZO for Pan-India Deal",
            "Summary": "Creative Newtech Limited announces Pan-India distribution agreement with EIZO Private Limited, Japanese subsidiary specializing in advanced imaging and surveillance solutions with Make in India focus.",
            "Sentiment": "positive",
            "PublishDate": 1767156528461,
            "Source": "co_actions_results"
        },
        {
            "Title": "Creative Newtech Reports Strong Q3 Financial Results",
            "Summary": "Creative Newtech has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 171 million rupees from 115 million rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 6.6 billion rupees compared to 5.1 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1738656669000,
            "Source": "earnings"
        },
        {
            "Title": "Creative Newtech Reports Q2 Financial Results",
            "Summary": "Creative Newtech announced its Q2 consolidated financial results. The company's EBITDA increased to 141 million rupees from 138 million rupees year-over-year. The EBITDA margin also improved to 3.44% from 3.20% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730195770000,
            "Source": "result"
        },
        {
            "Title": "Creative Newtech Reports Q2 Revenue Decline",
            "Summary": "Creative Newtech has reported its Q2 revenue figures. The company's revenue for the quarter stood at 4.1 billion rupees, down from 4.3 billion rupees in the same quarter last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1730195675000,
            "Source": "result"
        },
        {
            "Title": "Creative Newtech Reports Q2 Profit Growth",
            "Summary": "Creative Newtech has announced its Q2 consolidated net profit, which increased to 132 million rupees from 105 million rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730195640000,
            "Source": "result"
        }
    ]
}