{
    "Symbol": "COALINDIA",
    "ISIN": "INE522F01014",
    "News": [
        {
            "Title": "Coal India Q3FY26: Profit Drops 16% to ₹7,166 Cr",
            "Summary": "Coal India reported Q3FY26 consolidated profit of ₹7,165.98 crores, down 15.6% YoY. Revenue declined 5.2% to ₹34,924.19 crores. Board declared third interim dividend of ₹5.50 per share.",
            "Sentiment": "negative",
            "PublishDate": 1770904096721,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coal India Sets Up Chile Unit for Critical Minerals",
            "Summary": "Coal India Limited announces board approval for incorporating an Intermediate Holding Company in Chile to explore lithium and copper opportunities as part of diversification strategy.",
            "Sentiment": "positive",
            "PublishDate": 1770225414856,
            "Source": "stocks"
        },
        {
            "Title": "Coal India Approves ₹31.33 Billion JV Investment",
            "Summary": "Coal India approves ₹31.33 billion investment in joint venture project with total cost of ₹208.86 billion and 70:30 debt-equity financing structure.",
            "Sentiment": "positive",
            "PublishDate": 1770208531181,
            "Source": "stocks"
        },
        {
            "Title": "Coal India Approves JV With UPRVUNL For Renewable Energy",
            "Summary": "Coal India has approved a joint venture with UPRVUNL for a renewable energy project in Uttar Pradesh, marking the company's expansion into clean energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1770208504435,
            "Source": "stocks"
        },
        {
            "Title": "Coal India Approves ₹31.90 Billion BCGCL Investment",
            "Summary": "Coal India has approved a significant investment of ₹31.90 billion in BCGCL, marking a major capital allocation decision by the state-owned mining giant.",
            "Sentiment": "positive",
            "PublishDate": 1770205856878,
            "Source": "stocks"
        },
        {
            "Title": "Coal India Hikes Mid-Level Executive Pay by ₹34 Billion",
            "Summary": "Coal India announces salary increases for mid-level executives with an expected cost impact of ₹34.00 billion, reflecting the company's focus on employee compensation enhancement.",
            "Sentiment": "neutral",
            "PublishDate": 1770045867025,
            "Source": "stocks"
        },
        {
            "Title": "Coal India Reports Mixed Performance in January 2026",
            "Summary": "Coal India's production rose 2.6% to 79.8 million tonnes in January 2026, while offtake declined 4.7% to 66.3 million tonnes compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1769938955548,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coal India Executive Director Steps Down on Retirement",
            "Summary": "Coal India Limited announced that Executive Director (Co-ordination) Shri Alok Lalit Kumar relinquished his charge on 01.02.2026 upon reaching superannuation age, as disclosed under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769908471159,
            "Source": "stocks"
        },
        {
            "Title": "Coal India Sets Q3 Earnings Review Date",
            "Summary": "Coal India announces board meeting scheduled for February 12 to review third quarter financial results and consider dividend declaration for shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1769755974499,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coal India Boosts Quality with 85% Grade Conformity",
            "Summary": "Coal India enhances quality control through automated sampling systems, achieving 85% grade conformity and targeting 80% silo loading by FY26 to improve operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1769060953811,
            "Source": "stocks"
        },
        {
            "Title": "Coal India Eyes 1 BT Output as India Targets 1.31 BT by FY27",
            "Summary": "India aims for 1.31 billion tonnes coal production by FY27 while Coal India targets record 1 billion tonne mark. Coal Ministry to finalise exchange rules by March following domestic production crossing 1 BT in FY25.",
            "Sentiment": "positive",
            "PublishDate": 1768986275116,
            "Source": "stocks"
        },
        {
            "Title": "Coal India Gets Kawalapur REE Block License",
            "Summary": "Coal India receives mineral concession license from Ministry of Mines for Kawalapur rare earth elements block, with execution timeline set for 5 years.",
            "Sentiment": "positive",
            "PublishDate": 1768889010081,
            "Source": "stocks"
        },
        {
            "Title": "Coal India's Bharat Coking Coal IPO Reduces Stake to 90%",
            "Summary": "Coal India Limited's shareholding in subsidiary Bharat Coking Coal Limited reduced from 100% to 90% following successful IPO listing on BSE and NSE on January 19, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768802201367,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coal India Eyes Rare Earth Pacts With Russia, Australia",
            "Summary": "Coal India is exploring partnerships with Russia and Australia for rare earth elements, expanding beyond its traditional coal mining operations into strategic mineral resources.",
            "Sentiment": "positive",
            "PublishDate": 1768534334814,
            "Source": "stocks"
        },
        {
            "Title": "Coal India Breaks Out to Fresh 52-Week High",
            "Summary": "Coal India breaks out from ascending triangle pattern on monthly charts, hitting fresh 52-week high in January 2026. Experts suggest target of ₹500.00 for short-term traders.",
            "Sentiment": "positive",
            "PublishDate": 1768521466063,
            "Source": "stocks"
        },
        {
            "Title": "Coal India Shares Hit Two-Month High on BCCL IPO Success",
            "Summary": "Coal India shares surge nearly 3% to ₹439.90 as subsidiary BCCL's IPO closes with record 145x subscription, attracting 90 lakh applications worth ₹1.17 lakh crore in India's primary markets.",
            "Sentiment": "positive",
            "PublishDate": 1768366568846,
            "Source": "stocks"
        },
        {
            "Title": "BSE & Coal India Buy Calls for 9-10% Gains",
            "Summary": "Technical analysts recommend buying BSE at ₹2,790 with 9% upside target and Coal India at ₹432 with 10% upside potential following bullish breakout patterns.",
            "Sentiment": "positive",
            "PublishDate": 1768230109450,
            "Source": "stocks"
        },
        {
            "Title": "Coal India clarifies BCCL IPO proceeds ownership",
            "Summary": "Coal India Limited issued clarification regarding material price movement in its shares, confirming that entire proceeds from BCCL's OFS will accrue to CIL as the holding company.",
            "Sentiment": "neutral",
            "PublishDate": 1768226392907,
            "Source": "stocks"
        },
        {
            "Title": "Coal India, NTPC to benefit from mining reforms",
            "Summary": "Government proposes scrapping 50% ceiling on captive coal mine sales and extending lease tenures from 30 to 50 years. Coal India, NTPC, JSW Energy, GMDC, and Adani Power positioned to benefit from enhanced operational flexibility.",
            "Sentiment": "positive",
            "PublishDate": 1768191895376,
            "Source": "stocks"
        },
        {
            "Title": "Coal India's BCCL IPO: Value Unlock or Already Priced In?",
            "Summary": "Coal India's market value tripled over five years. Analysts debate whether Bharat Coking Coal's upcoming IPO will unlock fresh value for shareholders or if gains are already reflected in recent rally.",
            "Sentiment": "neutral",
            "PublishDate": 1767939038133,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coal India Creates ₹1.8 Lakh Crore Wealth in 5 Years",
            "Summary": "Coal India's market value surged from ₹84,121 crore to ₹2.66 lakh crore, delivering 213% stock price gains. Subsidiary BCCL now approaches market with strategic coking coal assets.",
            "Sentiment": "positive",
            "PublishDate": 1767846732098,
            "Source": "stocks"
        },
        {
            "Title": "Coal India Block Trade Worth ₹128.01 Crores on BSE",
            "Summary": "Coal India witnessed a significant block trade on BSE worth ₹128.01 crores involving approximately 3 million shares at ₹426.70 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767602223251,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coal India shares surge 7% to 52-week high on policy change",
            "Summary": "Coal India shares rallied 7% to ₹426.95 after implementing direct foreign buyer participation in e-auctions for Bangladesh, Bhutan, and Nepal consumers, becoming top Nifty 50 gainer.",
            "Sentiment": "positive",
            "PublishDate": 1767336622917,
            "Source": "stocks"
        },
        {
            "Title": "Coal India Production at 60% of FY26 Target After Q3",
            "Summary": "Coal India's Dec production rose 4.6% to 75.7mt, bringing 9-month total to 529.2mt (60% of FY26 target). Off-take declined 5.2% to 64.9mt. PMO directs subsidiary listings by FY30.",
            "Sentiment": "neutral",
            "PublishDate": 1767248892182,
            "Source": "stocks"
        },
        {
            "Title": "Coal India Appoints Rajiva Kumar Singh as ED",
            "Summary": "Coal India Limited announces the appointment of Shri Rajiva Kumar Singh as Executive Director (Exploration) effective December 29, 2025, following his promotion to a senior management position.",
            "Sentiment": "positive",
            "PublishDate": 1766994122733,
            "Source": "stocks"
        },
        {
            "Title": "Coal India Appoints B Sairam as CEO",
            "Summary": "Coal India's board appointed Chairman-cum-Managing Director B Sairam as CEO to streamline leadership amid rising production targets. The dual role reflects Centre's push for agile management.",
            "Sentiment": "positive",
            "PublishDate": 1766973593599,
            "Source": "stocks"
        },
        {
            "Title": "PMO directs Coal India to list all subsidiaries by 2030",
            "Summary": "Prime Minister's Office instructs coal ministry to map and list all Coal India subsidiaries by 2030 to improve governance and unlock value. BCCL and CMPDI set for March 2026 listing.",
            "Sentiment": "positive",
            "PublishDate": 1766900358736,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coal India Appoints Chandra Prakash Garg as ED",
            "Summary": "Coal India Limited announces the appointment of Shri Chandra Prakash Garg as Executive Director (Safety & Rescue) effective December 26, 2025, following his promotion within the organization.",
            "Sentiment": "positive",
            "PublishDate": 1766749730795,
            "Source": "stocks"
        },
        {
            "Title": "Coal India appoints B Sairam as CEO",
            "Summary": "Coal India Ltd's board appointed current CMD B Sairam as CEO effective from date of assuming charge. The appointment consolidates leadership at the state-run coal major under SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1766745836016,
            "Source": "stocks"
        },
        {
            "Title": "Coal India Surges 3% on Subsidiary Listing Plans",
            "Summary": "Coal India shares jumped nearly 3% to become Nifty 50's top gainer after board approved in-principle listing of subsidiaries MCL and SECL for next financial year, signaling value unlocking.",
            "Sentiment": "positive",
            "PublishDate": 1766587657406,
            "Source": "stocks"
        },
        {
            "Title": "Coal India shares rise 1.5% on subsidiary listing nod",
            "Summary": "Coal India shares jumped 1.5% to ₹406.75 after receiving board approval for listing subsidiaries MCL and SECL, following Ministry of Coal directions for upcoming financial year.",
            "Sentiment": "positive",
            "PublishDate": 1766586514445,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coal India gets approval to list subsidiary SECL",
            "Summary": "Coal India Limited receives in-principle board approval for listing subsidiary South Eastern Coalfields Limited (SECL) following Ministry of Coal directive dated December 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766490848018,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coal India Gets Approval for MCL Subsidiary Listing",
            "Summary": "Coal India Limited receives in-principle board approval to list its wholly-owned subsidiary Mahanadi Coalfields Limited (MCL) following Ministry of Coal directive for upcoming financial year.",
            "Sentiment": "positive",
            "PublishDate": 1766490793752,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coal India CMD Gets Additional Charge of NCL",
            "Summary": "Coal India's Chairman-cum-Managing Director B. Sairam has been entrusted with additional charge of Northern Coalfields Limited for six months effective December 16, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765883787602,
            "Source": "stocks"
        },
        {
            "Title": "Coal India Appoints B. Sairam as CEO",
            "Summary": "Coal India Limited's Board appointed Chairman-cum-Managing Director B. Sairam as Chief Executive Officer during December 26, 2025 meeting, expanding his leadership role.",
            "Sentiment": "positive",
            "PublishDate": 1765815325602,
            "Source": "stocks"
        },
        {
            "Title": "LIC increases Coal India stake to 11.497%",
            "Summary": "Life Insurance Corporation of India disclosed acquisition of 12.61 crore shares in Coal India, raising its shareholding from 9.450% to 11.497% through market purchases between October-December 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765606466585,
            "Source": "stocks"
        },
        {
            "Title": "Coal India Receives ESG Rating of 'Moderate' Category from NSE Sustainability",
            "Summary": "Coal India Limited received an unsolicited ESG rating from NSE Sustainability with scores of 54 for Environment, 54 for Social, and 66 for Governance, placing it in the 'Moderate' rating category. The assessment highlighted challenges including high greenhouse gas emissions, 15 worker fatalities, and regulatory compliance penalties totaling Rs. 16.28 lakh from stock exchanges for board composition violations.",
            "Sentiment": "neutral",
            "PublishDate": 1765281147953,
            "Source": "stock"
        },
        {
            "Title": "Coal India Reports Provisional Production and Off-take Performance for November 2025",
            "Summary": "Coal India Limited submitted its provisional production and off-take performance data for November 2025 and the period April 2025 to November 2025 to stock exchanges. The disclosure was made in compliance with SEBI listing regulations, providing operational performance updates to investors and stakeholders.",
            "Sentiment": "neutral",
            "PublishDate": 1764581892434,
            "Source": "stock"
        },
        {
            "Title": "Coal India CMD Aspires to Meet 875 MT Production Target Despite Recent Shortfalls",
            "Summary": "Coal India Ltd's Chairman-cum-Managing Director Sanoj Kumar Jha stated the company will aspire to reach its production target of 875 MT in FY26. Jha, who took charge on November 1, acknowledged that Coal India missed production targets in September and October due to monsoon rains. The company's production declined 9.8% to 56.4 MT in October and dropped to 48.97 MT in September. Coal India accounts for over 80% of domestic coal output and has a dispatch target of 900 MT for FY26. Jha noted that coal demand has been sluggish with reduced demand from the power sector, but assured the company will meet industry requirements and have higher stock levels than the previous year. Additionally, regulations for a proposed coal exchange are expected within six months.",
            "Sentiment": "neutral",
            "PublishDate": 1762685360127,
            "Source": "stock"
        },
        {
            "Title": "Coal India Signs Joint Venture with Damodar Valley Corporation for Thermal Power Plant Expansion",
            "Summary": "Coal India has entered into a joint venture agreement with Damodar Valley Corporation for the expansion of a thermal power plant. The project involves the development of 2×800 MW capacity, which would add 1,600 MW of thermal power generation capacity through this partnership.",
            "Sentiment": "positive",
            "PublishDate": 1762517972316,
            "Source": "order&deals"
        },
        {
            "Title": "Three PSU Stocks - Coal India, Mazagon Dock, and RailTel - Trade Ex-Dividend on November 4",
            "Summary": "Coal India, Mazagon Dock Shipbuilders, and RailTel Corporation will trade ex-dividend on November 4, making November 3 the last day to purchase shares for dividend eligibility. Coal India announced an interim dividend of Rs 10.25 per share (102.5% of face value), Mazagon Dock declared Rs 6 per share (120% of face value), and RailTel set Rs 1 per share (10% payout). The record date for determining eligible shareholders is November 4. Additionally, Bhansali Engineering Polymers (Rs 1 per share), Happiest Minds Technologies (Rs 2.75 per share), and Sundram Fasteners (Rs 3.75 per share) will also go ex-dividend on the same date.",
            "Sentiment": "neutral",
            "PublishDate": 1762137755674,
            "Source": "corporate_action"
        },
        {
            "Title": "Coal India Chairman Calls for Business Model Overhaul Amid Energy Transition",
            "Summary": "Coal India Limited Chairman Sanoj Kr Jha announced plans for a comprehensive overhaul of the state-run miner's business model and operations during the company's 50th anniversary celebration. Jha emphasized the need for adaptation amid the global shift towards renewable energy, noting that coal is no longer the primary energy source it was 50 years ago. The transformation strategy focuses on three key areas: diversification beyond core mining into coal gasification and renewable energy projects, expansion of underground mining targeting 100 million tonnes by 2035, and modernization of logistics and technology. CIL plans to mechanize transport arrangements within four to five years under its First Mile Connectivity initiative and deploy advanced mining technologies. The company, which currently supplies around 55% of India's energy demand, has grown production nearly 10-fold since 1975 and aims to participate in the critical minerals sector both domestically and internationally.",
            "Sentiment": "positive",
            "PublishDate": 1762070430414,
            "Source": "stock"
        },
        {
            "Title": "Coal India Reports Decline in Production and Off-Take for October",
            "Summary": "Coal India reported coal production of 56.4 million tonnes in October, down from 62.5 million tonnes in the same month last year. The company's coal off-take also decreased to 58.3 million tonnes compared to 62 million tonnes in the previous year's October.",
            "Sentiment": "negative",
            "PublishDate": 1761981424767,
            "Source": "stock"
        },
        {
            "Title": "Coal India Limited Reports Provisional Production and Off-take Performance Data",
            "Summary": "Coal India Limited submitted its provisional production and off-take performance data for October and the period April-October to stock exchanges. The company provided this information to BSE and NSE as part of regulatory compliance requirements. The document includes performance metrics for CIL and its subsidiary companies, with data generated from ERP reports.",
            "Sentiment": "neutral",
            "PublishDate": 1761980714048,
            "Source": "stock"
        },
        {
            "Title": "Coal India Appoints Sanoj Kumar Jha as Chairman-cum-Managing Director on Additional Charge",
            "Summary": "Coal India Limited has appointed Shri Sanoj Kumar Jha, IAS, Additional Secretary at Ministry of Coal, as Chairman-cum-Managing Director on additional charge for an initial period of 3 months starting November 1, 2025. The appointment continues until a regular incumbent is appointed or further orders, whichever is earlier. Jha holds degrees including Bachelor of Science in Physics from University of Delhi and Master of Science in Public Policy and Management from Kings College London. Meanwhile, Shri P.M. Prasad has ceased his role as CMD after reaching superannuation age, effective November 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761980409840,
            "Source": "corporate_governance"
        },
        {
            "Title": "Coal India Promotes Company Secretary to Executive Director Position",
            "Summary": "Coal India Limited announced the promotion of Bijay Prakash Dubey from Company Secretary & Compliance Officer to Executive Director (Company Secretary), effective October 31, 2025. The new position is one level below the Board of Directors. Dubey is an alumnus of St. Xavier's College, Kolkata, and an Associate member of The Institute of Company Secretaries of India (ICSI), with over two decades of professional experience in Company Law and Secretarial functions in major CPSEs and listed companies.",
            "Sentiment": "positive",
            "PublishDate": 1761907475982,
            "Source": "corporate_governance"
        },
        {
            "Title": "Coal India Declares Dividend of Rs 10.25 Per Share; Q2 Revenue Falls to Rs 302B",
            "Summary": "Coal India declared a dividend of Rs 10.25 per share. The company reported quarterly revenue of Rs 302 billion compared to Rs 306.7 billion in the same period last year, though it exceeded estimates of Rs 295.87 billion. EBITDA declined to Rs 67.16 billion from Rs 86.2 billion year-over-year, falling short of estimates of Rs 78.27 billion. EBITDA margin compressed to 22.25% from 28.09% in the previous year, below the estimated 26.45%.",
            "Sentiment": "negative",
            "PublishDate": 1761726100747,
            "Source": "corporate_action"
        },
        {
            "Title": "Coal India Q2 Net Profit Drops to 43.5B Rupees, Missing Estimates",
            "Summary": "Coal India reported Q2 consolidated net profit of 43.5 billion rupees, declining from 62.9 billion rupees in the same quarter last year. The results fell short of analyst estimates of 55.44 billion rupees.",
            "Sentiment": "negative",
            "PublishDate": 1761725746195,
            "Source": "earnings"
        },
        {
            "Title": "Coal India Q2 Results Preview: Analysts Expect Muted Performance Due to Weak Power Demand",
            "Summary": "Coal India is set to announce its quarterly financial results on Wednesday, with analysts forecasting a subdued performance. Bloomberg estimates suggest revenue will rise 11.5% to Rs 30,394.36 crore, while net profit is expected to fall 9.5% to Rs 5,692.52 crore and Ebitda to decline 2.4% to Rs 8,409.3 crore. The weak performance is attributed to lower volumes, reduced power demand, and elevated inventory levels. Production declined 4% year-on-year with dispatches falling 2%. Multiple brokerages including Morgan Stanley, Jefferies, JM Financial, and Equirus Securities have issued mixed ratings with price targets ranging from Rs 360 to Rs 410. While near-term outlook remains cautious due to thermal power generation slowdown and soft e-auction premiums, analysts view medium to long-term fundamentals as intact, supported by structural growth in domestic power demand and operational efficiency measures.",
            "Sentiment": "negative",
            "PublishDate": 1761698829687,
            "Source": "earnings"
        },
        {
            "Title": "Coal India to Announce Q2 Results on October 29, May Declare Second Interim Dividend",
            "Summary": "Coal India Ltd., the world's largest coal producer, will announce its second quarter results on October 29. The Board of Directors will consider the unaudited standalone and consolidated financial results for the quarter ended September 30 and may declare a second interim dividend for FY 2025-26. The trading window for company securities has been closed from October 1 until 48 hours after results declaration. In the previous quarter, Coal India reported a 20.2% decline in consolidated net profit to Rs 8,734.17 crore and a 5% drop in total income to Rs 37,458.05 crore. Coal India shares have gained 1.07% in the past five trading sessions and 2.37% over the last month, with the stock trading at Rs 397.50 on the NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1761627801626,
            "Source": "earnings"
        }
    ]
}