{
    "Symbol": "COASTCORP",
    "ISIN": "INE377E01024",
    "News": [
        {
            "Title": "Coastal Corporation Q3FY26 Results Show Strong Growth",
            "Summary": "Coastal Corporation reported Q3FY26 standalone revenue of ₹19,171.18 lakhs with net profit of ₹316.02 lakhs. Marine products segment contributed ₹18,953.41 lakhs to total revenue for the quarter ended December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1770905742421,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coastal Corporation Board Meet Set for Feb 12, 2026",
            "Summary": "Coastal Corporation Limited schedules board meeting for February 12, 2026, to review Q3FY26 unaudited financial results. Trading window remains closed until February 14, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769882279077,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coastal Corporation Gets Credit Rating Reaffirmation",
            "Summary": "CARE Ratings reaffirms Coastal Corporation's credit ratings at CARE BB; Stable for long-term and CARE A4 for short-term bank facilities worth ₹234 crore, despite operational challenges.",
            "Sentiment": "neutral",
            "PublishDate": 1768046992369,
            "Source": "stocks"
        },
        {
            "Title": "Coastal Corporation Reports Q2 Profit Rise, Board Considers Subsidiary Merger",
            "Summary": "Coastal Corporation Limited announced its quarterly results for the quarter ended September 30, 2025, showing a net profit of Rs 462.29 lakhs on standalone basis and Rs 366.65 lakhs on consolidated basis. The company's total revenue reached Rs 15,395.60 lakhs (standalone) and Rs 16,552.75 lakhs (consolidated). The Board of Directors approved the unaudited financial results and considered a proposal to merge two wholly-owned subsidiaries - Continental Fisheries India Limited (CFIL) and Coastal Biotech Private Limited (CBPL). The company confirmed no deviation in the use of funds raised through Rights Issue of Partly Paid-Up Equity Shares. Coastal Biotech Private Limited is fully operational and has started selling grain-based Ethanol to Oil Marketing Companies. The company faces contingent liabilities of Rs 74.78 lakhs and Rs 108.06 lakhs for Fuel Power Purchase Cost Adjustment charges for financial years 2022-2023 and 2023-2024 respectively, against which appeals are being filed.",
            "Sentiment": "positive",
            "PublishDate": 1762799608461,
            "Source": "earnings"
        },
        {
            "Title": "Coastal Corporation Receives Russian Federation Approval for Seafood Exports",
            "Summary": "Coastal Corporation Limited has received approval from the Ministry of Agriculture of the Russian Federation, through the Federal Service for Veterinary and Phytosanitary Control (Rosselkhoznadzor), for two processing units to export seafood products to Russian markets. The company views this approval as a key milestone in its strategy to expand international presence, particularly in the Russian Federation. The approval is expected to enhance the company's export capabilities and contribute positively to revenue growth. Coastal Corporation believes this development will open new business opportunities and strengthen its position in the global seafood export market.",
            "Sentiment": "positive",
            "PublishDate": 1762479907111,
            "Source": "stock"
        },
        {
            "Title": "Coastal Corporation Secures Rs. 361.73 Crore Ethanol Supply Order",
            "Summary": "Coastal Corporation has secured an ethanol supply order for 56,521 KL under the Ethanol Blended Petrol Programme (EBPP). The order has an estimated value of Rs. 361.73 crores.",
            "Sentiment": "positive",
            "PublishDate": 1761136677691,
            "Source": "order&deals"
        },
        {
            "Title": "Coastal Corporation Limited Publishes Quarterly Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Coastal Corporation Limited, a seafood processing and export company based in Visakhapatnam, Andhra Pradesh, has published its unaudited financial results for the quarter ended June 30, 2025. The results were approved by the Board of Directors based on the Audit Committee's recommendation at a meeting held on August 14, 2025. The company published the results in Business Standard (English) and Andhra Prabha (Telugu) newspapers. The results include both standalone and consolidated financial statements, which underwent limited review by statutory auditors M/s. Brahmayya & Co. The company operates three processing units in Andhra Pradesh and is listed on NSE and BSE with scrip code 501831. Complete financial results are available on the company's website at www.coastalcorp.co.in.",
            "Sentiment": "neutral",
            "PublishDate": 1755330878592,
            "Source": "earnings"
        },
        {
            "Title": "Coastal Corporation Limited Approves Q1 2025 Results and Board Changes",
            "Summary": "Coastal Corporation Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company appointed A V V S S CH B Sekhar Babu as Secretarial Auditor for 5 years and Vasantharao Satya Venkata Rao as Additional Director. The Board re-appointed Jeeja Valsaraj as director and scheduled the 44th Annual General Meeting for September 26, 2025. M. V. Suryanarayana will cease to be an Independent Director on September 28, 2025. The company also approved borrowing limits up to Rs 700 crores and loan/guarantee provisions up to Rs 500 crores, both subject to shareholder approval. Share transfer books will remain closed from September 20-26, 2025 for AGM and dividend purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1755177891580,
            "Source": "earnings"
        }
    ]
}