{
    "Symbol": "COCHINSHIP",
    "ISIN": "INE704P01025",
    "News": [
        {
            "Title": "Cochin Shipyard Gets ESG Rating Grade B from SES ESG",
            "Summary": "Cochin Shipyard Limited receives ESG rating of Grade B with score 60.3 from SES ESG Research Pvt. Ltd, reflecting company's environmental, social and governance performance parameters.",
            "Sentiment": "neutral",
            "PublishDate": 1770890558095,
            "Source": "stocks"
        },
        {
            "Title": "Cochin Shipyard CMD Retires, Finance Director Takes Charge",
            "Summary": "Cochin Shipyard Limited announces retirement of Chairman & Managing Director Madhu Sankunny Nair on January 31, 2026, with Director (Finance) Jose V J taking additional charge for 3 months from February 01, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769879842785,
            "Source": "stocks"
        },
        {
            "Title": "Cochin Shipyard Wins ₹100-250 Cr Green Tug Order",
            "Summary": "Cochin Shipyard Limited secures significant order for two green tugs from domestic client, valued between ₹100-250 crore, strengthening its position in eco-friendly marine vessels.",
            "Sentiment": "positive",
            "PublishDate": 1769754834458,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cochin Shipyard Opts for Domestic Over US$ 50M Debt",
            "Summary": "Cochin Shipyard's board decides against issuing US$ 50 million debt, choosing domestic borrowing alternatives instead for its financing requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1769617332723,
            "Source": "stocks"
        },
        {
            "Title": "Cochin Shipyard Q3FY26 Results: Strong Performance",
            "Summary": "Cochin Shipyard reports consolidated revenue of ₹135,040.99 lakhs for Q3FY26, up from ₹114,763.55 lakhs in Q3FY24. Board declares interim dividend of ₹3.50 per share.",
            "Sentiment": "positive",
            "PublishDate": 1769615632932,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cochin Shipyard Q3 FY26 Results Due Soon",
            "Summary": "State-owned Cochin Shipyard prepares to announce third quarter earnings for period ended December 31, 2025, as part of ongoing earnings season for Q3 FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1769278161049,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cochin Shipyard Extends CMD Tenure Till Jan 2026",
            "Summary": "Cochin Shipyard Limited announces extension of Chairman & Managing Director Shri Madhu Sankunny Nair's tenure till January 31, 2026, approved by the Appointments Committee of the Cabinet.",
            "Sentiment": "positive",
            "PublishDate": 1767098854985,
            "Source": "stocks"
        },
        {
            "Title": "Kolkata Port & Cochin Shipyard Share ₹5.94 Cr Profit",
            "Summary": "SMPK Kolkata receives ₹5.94 crore profit share from joint venture with Cochin Shipyard, highlighting success of indigenous ship repair collaboration under Make in India initiative.",
            "Sentiment": "positive",
            "PublishDate": 1766762833537,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cochin Shipyard Secures Contract to Build Four Electric Tugs for Svitzer",
            "Summary": "Cochin Shipyard signed a significant contract with Svitzer to construct four fully electric Transverse 2600e tugs. The delivery of these vessels is scheduled to begin in late 2027.",
            "Sentiment": "positive",
            "PublishDate": 1765151634616,
            "Source": "order&deals"
        },
        {
            "Title": "Cochin Shipyard Secures Contract with Svitzer for Four Electric Tugs",
            "Summary": "Cochin Shipyard signed a major deal with Svitzer to construct four fully electric Transverse 2600E tugs. The deliveries are scheduled to begin in late 2027, marking a significant order for the shipbuilder in the electric marine vessel segment.",
            "Sentiment": "positive",
            "PublishDate": 1765013509273,
            "Source": "order&deals"
        },
        {
            "Title": "Indian Navy to Commission First Indigenous Mahe-Class Submarine-Hunting Vessel",
            "Summary": "The Indian Navy will commission its first indigenously-built Mahe-class anti-submarine warfare shallow water craft on November 24 in Mumbai, built by Cochin Shipyard Limited. The vessel features over 80% indigenous content and is equipped with torpedoes and anti-submarine rockets, marking India's advancement in self-reliant naval shipbuilding capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1763300322821,
            "Source": "stock"
        },
        {
            "Title": "Cochin Shipyard Q2 Profit Drops 43% on Higher Expenses, Announces Rs 4 Interim Dividend",
            "Summary": "Cochin Shipyard reported consolidated net profit fell 43% to Rs 108 crore in the July-September quarter compared to Rs 189 crore in the same period last year. This marks the second consecutive quarter of profit decline, attributed to higher expenses. Revenue from operations decreased 2% to Rs 1,119 crore. EBITDA dropped significantly by 63% to Rs 74 crore from Rs 197 crore, with margins contracting sharply to 6.6% from 17.3%. The shipbuilding segment saw income decline 12%, while ship repair income increased 27%. The company declared an interim dividend of Rs 4 per equity share for FY26, with record date set for November 18 and payment by December 11. Shares closed 2.1% higher at Rs 1,792.05 ahead of results announcement.",
            "Sentiment": "negative",
            "PublishDate": 1762961015394,
            "Source": "earnings"
        },
        {
            "Title": "Cochin Shipyard Reports Decline in Q2 Financial Performance, Declares Interim Dividend",
            "Summary": "Cochin Shipyard reported quarterly results showing significant year-over-year declines across key financial metrics. EBITDA fell to 562 million rupees from 1.96 billion rupees, while EBITDA margin dropped to 5.90% from 17.87%. Net profit decreased to 1 billion rupees from 1.93 billion rupees, and revenue declined to 9.5 billion rupees from 10.97 billion rupees. Despite the weaker financial performance, the company declared an interim dividend of 4 rupees per share.",
            "Sentiment": "negative",
            "PublishDate": 1762960940333,
            "Source": "earnings"
        },
        {
            "Title": "Cochin Shipyard to Release Q2FY26 Results on November 12, Board to Consider Interim Dividend",
            "Summary": "Cochin Shipyard Ltd., a public sector shipbuilding company specializing in defense vessels for the Indian Navy, will announce its Q2FY26 financial results on November 12. The board meeting will consider standalone and consolidated unaudited financial results for the quarter and half-year ended September 30. The board will also evaluate a proposal for declaring an interim dividend to equity shareholders for FY26. The company's trading window has been closed since October 1 and will remain restricted until 48 hours after the results announcement. In Q1FY26, Cochin Shipyard reported revenue of Rs 1,068.59 crore compared to Rs 771.47 crore in the previous year, with consolidated net profit rising to Rs 187.83 crore from Rs 174.23 crore. The company's shares have gained 15.73% over the past six months and 26.32% over the past year, with the stock trading at Rs 1,760 on the NSE.",
            "Sentiment": "positive",
            "PublishDate": 1762838758184,
            "Source": "earnings"
        },
        {
            "Title": "Cochin Shipyard Partners with Svitzer for Electric Tug Construction",
            "Summary": "Cochin Shipyard Limited has signed an agreement with Svitzer to build new electric tugs. The partnership is designed to reduce carbon emissions and support the government's Maritime India Vision 2030 initiative.",
            "Sentiment": "positive",
            "PublishDate": 1761890330538,
            "Source": "order&deals"
        },
        {
            "Title": "Cochin Shipyard Secures Mega Order for Six LNG-Fueled Container Vessels from European Client",
            "Summary": "Cochin Shipyard Limited has secured a mega order from a European client for the design and construction of six 1,700 TEU LNG-fueled feeder container vessels. A Letter of Intent was signed on October 14, 2025, with a formal shipbuilding contract to follow. The company confirmed that no promoters or group companies have any interest in the entity that awarded the order, and the transaction does not involve related party dealings. The order is classified as 'Mega' according to the company's internal classification system.",
            "Sentiment": "positive",
            "PublishDate": 1760426912609,
            "Source": "order&deals"
        },
        {
            "Title": "Cochin Shipyard Signs Strategic Partnerships with HD Korea and Tamil Nadu Government",
            "Summary": "Cochin Shipyard Ltd. signed a Memorandum of Understanding with HD Korea Shipbuilding and Offshore Engineering for long-term strategic collaboration in shipbuilding. The partnership will utilize Cochin Shipyard's 310 metre dry dock to construct large vessels including Suezmax tankers, container ships and Capesize bulk carriers with capacity of up to six vessels annually. A dedicated block fabrication facility is planned at Kochi across 80 acres with annual capacity of 1.2 lakh MT requiring investment of ₹3,700 crore, expected to generate around 2,000 direct jobs. Additionally, Cochin Shipyard signed an MoU with Tamil Nadu government for a greenfield investment of around ₹15,000 crore to establish a shipyard in collaboration with a Korean partner. The Tamil Nadu project's first phase is estimated to create around 10,000 jobs and may include a ship repair facility. Cochin Shipyard shares declined 1.9% to ₹1,888.9 but have gained 12.1% over the past month.",
            "Sentiment": "positive",
            "PublishDate": 1758621430114,
            "Source": "order&deals"
        },
        {
            "Title": "Cochin Shipyard Plans 37 Billion Rupee Block Fabrication Facility in Kochi",
            "Summary": "Cochin Shipyard announced plans to establish a new block fabrication facility in Kochi with an annual capacity of 120,000 metric tons. The project involves an investment of approximately 37 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1758616019528,
            "Source": "stock"
        },
        {
            "Title": "Cochin Shipyard Signs Long-Term Partnership Agreement with HD Korea",
            "Summary": "Cochin Shipyard has entered into an agreement with HD Korea to establish a long-term shipbuilding partnership. The agreement aims to strengthen collaboration between the two companies in the shipbuilding sector.",
            "Sentiment": "positive",
            "PublishDate": 1758615664114,
            "Source": "order&deals"
        },
        {
            "Title": "Cochin Shipyard Block Trade Worth Rs. 29.51 Crores Executed on NSE",
            "Summary": "Cochin Shipyard Ltd. saw a block trade executed on the National Stock Exchange involving approximately 153,487 shares at a price of Rs. 1922.80 per share, totaling Rs. 29.51 crores in value.",
            "Sentiment": "neutral",
            "PublishDate": 1758167294441,
            "Source": "order&deals"
        },
        {
            "Title": "Cochin Shipyard Secures Rs. 200 Crore Contract from ONGC for Jack Up Rig Repairs",
            "Summary": "Cochin Shipyard Limited signed a contract with Oil and Natural Gas Corporation Limited for dry dock and major lay-up repairs of a Jack Up Rig. The contract is valued at approximately Rs. 200 crore with an estimated project duration of 12 months. The company confirmed that no promoters, promoter groups, or group companies have any interest in the entity that awarded the order, and the transaction does not fall under related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1758106605878,
            "Source": "order&deals"
        },
        {
            "Title": "Cochin Shipyard Promotes Eight Officials to General Manager Positions",
            "Summary": "Cochin Shipyard Limited promoted eight officials to Senior Management Personnel at the General Manager E7 Level. The promoted officials are Shri Sreekumar Raja C A (General Manager), Shri A Vettriselvan (General Manager Technical), Shri Nagesh Krishna Moorthy (General Manager Materials), Shri Sanil Peter (General Manager OSD-BD SB Ship Repair), Shri Jathesh Chandra Gopinathan (General Manager Basic Design), Shri Suresh Babu V (General Manager Defence Projects I), Shri Anoop Das (General Manager), and Shri Binoj Shankar (General Manager QC & T Design). The promoted personnel have experience ranging from 22 to 34 years in relevant fields including shipbuilding, materials management, defense projects, quality control, and design departments.",
            "Sentiment": "positive",
            "PublishDate": 1757939416194,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cochin Shipyard Shares Rally 2.8% on Dividend Declaration and Auditor Appointment",
            "Summary": "Cochin Shipyard Limited shares rose 2.8% to ₹1,794.50 following corporate announcements. The company declared a final dividend of ₹2.25 per equity share for financial year 2024-25, with record date set for September 12, 2025. The dividend proposal requires approval at the 53rd Annual General Meeting on September 29, 2025, with payments due by October 28, 2025 if approved. The stock opened at ₹1,753.90 and reached an intraday high of ₹1,828.00, with trading volumes of 26.11 lakh shares worth ₹469.65 crore. Additionally, the Comptroller & Auditor General of India appointed M/s Babu A Kallivayalil & Co as statutory auditors for FY 2025-26. The company trades at a market capitalization of ₹47,223 crore with a 52-week range of ₹1,180.20 to ₹2,545.",
            "Sentiment": "positive",
            "PublishDate": 1757919598217,
            "Source": "corporate_action"
        },
        {
            "Title": "Japan's MOL Shows Interest in Ships from Cochin Shipyard",
            "Summary": "Japanese shipping company MOL has expressed interest in acquiring Indian-made ships for its fleet from Cochin Shipyard. This represents potential business opportunities for the Indian shipbuilder in the international market.",
            "Sentiment": "positive",
            "PublishDate": 1756869798826,
            "Source": "stock"
        },
        {
            "Title": "Cochin Shipyard Appoints New Directors for Operations and Technical Roles",
            "Summary": "Cochin Shipyard Limited appointed Dr. Harikrishnan S as Director (Operations) and Shri Rajesh Gopalakrishnan as Director (Technical), effective August 27, 2025. Both executives were previously serving as Executive Directors within the company - Dr. Harikrishnan in Ship Building and Shri Rajesh in Ship Repair. Dr. Harikrishnan's appointment runs until May 31, 2029, while Shri Rajesh receives a five-year tenure. The appointments were authorized by the Appointments Committee of the Cabinet through the Ministry of Ports, Shipping and Waterways. Chairman and Managing Director Shri Madhu Sankunny Nair, who was holding additional charge of both positions, has transferred responsibilities to the new appointees. Both directors have nearly three decades of experience with the company and serve as directors on the boards of wholly owned subsidiaries Hooghly Cochin Shipyard Limited and Udupi Cochin Shipyard Limited.",
            "Sentiment": "positive",
            "PublishDate": 1756300882486,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cochin Shipyard Reports 38.5% Revenue Growth in Q1 FY26 with Rs 21,100 Crore Order Book",
            "Summary": "Cochin Shipyard Limited reported revenue of Rs 1,068.59 crores in Q1 FY26, up from Rs 771.47 crores in Q1 FY25. Profit after tax increased to Rs 187.82 crores from Rs 174.23 crores in the same period. The company maintains a total order book of Rs 21,100 crores, comprising Rs 19,600 crores in shipbuilding and Rs 1,500 crores in ship repair across 75 vessels. EBITDA margin stood at 28% and PAT margin at 18% for the quarter. The company completed its new drydock and International Ship Repair Facility, with 14 vessels currently under repair. Management expects revenue growth of 14-15% for FY26, with long-term annual growth guidance of 10-12% over the next 5-10 years. For FY26, the company projects PAT margin around 15% and EBITDA margin around 20%. Cochin Shipyard signed MoUs with Drydocks World UAE and HD KSOE of South Korea, and is bidding for defense projects worth Rs 10,000 crores.",
            "Sentiment": "positive",
            "PublishDate": 1756206996703,
            "Source": "earnings"
        },
        {
            "Title": "₹65,000 Crore Grants for Shipping Sector Awaiting Approval",
            "Summary": "Grants worth ₹65,000 crore for the shipping sector are expected to be approved soon. This development was reported in relation to Cochin Shipyard, indicating potential financial support for the maritime industry.",
            "Sentiment": "positive",
            "PublishDate": 1755753797117,
            "Source": "sectoral"
        },
        {
            "Title": "Cochin Shipyard Projects 14-15% Revenue Growth in FY26 with 15% PAT Margin Guidance",
            "Summary": "Cochin Shipyard has provided financial guidance for FY26, expecting revenue to increase by 14-15% with PAT margins around 15%. The company estimates ship repair revenue at ₹1,500 crores for FY26. Shipbuilding margins are projected at 10-12%, while overall EBITDA guidance stands at approximately 20%. For long-term growth, the company has set revenue growth guidance of 10-12% over the next 5-10 years.",
            "Sentiment": "positive",
            "PublishDate": 1755661865125,
            "Source": "stock"
        },
        {
            "Title": "Cochin Shipyard Reports 38% Revenue Growth in Q1 FY26 with Rs 19,600 Crore Order Book",
            "Summary": "Cochin Shipyard Limited delivered strong Q1 FY26 results with consolidated revenue rising 38% year-on-year to Rs 1,068.59 crores, while profit after tax increased 4% to Rs 187.83 crores. EBITDA margin stood at 28%, down from 37% in the previous year. The company's ship repair segment drove growth with 157% increase to Rs 629.62 crores, offsetting a 5.6% decline in shipbuilding revenue to Rs 438.97 crores. CSL maintains a robust order book of Rs 19,600 crores across 75 vessels, comprising defence orders worth Rs 13,700 crores and commercial orders totaling Rs 5,900 crores. The company has a substantial order pipeline of Rs 2,85,000 crores, with 77% from defence and 23% from commercial segments. During the quarter, CSL secured new orders for power tugs and a luxury river cruise vessel, delivered the 19th electric hybrid water metro boat to Kochi Metro, and signed strategic partnerships with HD KSOE of South Korea and Drydocks World of UAE. The company has enhanced its infrastructure with ship repair facilities capable of handling vessels up to 130 meters and capacity to repair 82 ships annually.",
            "Sentiment": "positive",
            "PublishDate": 1755596750606,
            "Source": "earnings"
        },
        {
            "Title": "Cochin Shipyard Launches 100-Day 'Saksham Niveshak' Campaign for Shareholder KYC Updates and Dividend Claims",
            "Summary": "Cochin Shipyard Limited has launched a 100-day special outreach initiative called 'Saksham Niveshak' running from July 28, 2025 to November 06, 2025. The campaign aims to help shareholders update their KYC details including bank account mandates, nominee registration, and contact information, as well as claim unpaid dividends to prevent transfer of dividends and shares to IEPF. The initiative was launched pursuant to a letter from the Investor Education and Protection Fund Authority, Ministry of Corporate Affairs dated July 16, 2025. Shareholders with unclaimed dividends are advised to contact the company's registrar MUFG Intime India Private Limited or use the SWAYAM portal. The company warns that dividends unclaimed for 7 consecutive years, along with corresponding shares, are liable to be transferred to IEPF.",
            "Sentiment": "neutral",
            "PublishDate": 1755169623511,
            "Source": "corporate_action"
        },
        {
            "Title": "Cochin Shipyard Limited Faces Rs 14.04 Lakh Fine Each from BSE and NSE for Board Composition Non-Compliance",
            "Summary": "Cochin Shipyard Limited received fines totaling Rs 14,04,200 each from BSE and NSE for non-compliance with SEBI LODR Regulations during the quarter ended March 31, 2025. The violations included lack of independent directors including a woman director, insufficient board meeting quorum, and non-compliance with committee constitution requirements for Audit, Nomination and Remuneration, Stakeholders Relationship, and Risk Management Committees. The company's Board noted that director appointments are controlled by the Government of India. The Ministry of Ports, Shipping & Waterways appointed Dr. Seema Suri as an independent director on May 20, 2025, following which the company re-constituted two committees on June 1, 2025. The appointment of five additional independent directors remains pending from the Government of India. The company has filed waiver requests with stock exchanges, citing that the non-compliances were beyond management control.",
            "Sentiment": "negative",
            "PublishDate": 1755008746459,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cochin Shipyard Reports 8% Profit Growth Despite Margin Compression",
            "Summary": "Cochin Shipyard Ltd. reported net profit of Rs 187.83 crore for the quarter ended June 30, representing an 8% increase from Rs 174.24 crore in the same period last year. Revenue grew significantly by 38.5% to Rs 1,068.59 crore compared to Rs 771.47 crore. EBITDA rose 36% to Rs 241.36 crore from Rs 177.36 crore. However, margins compressed slightly to 22.6% from 23% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755003047879,
            "Source": "earnings"
        },
        {
            "Title": "Cochin Shipyard Reports 38% Revenue Growth in Q1 with Higher EBITDA",
            "Summary": "Cochin Shipyard delivered strong Q1 results with revenue rising to 9.8 billion rupees from 7.1 billion rupees year-over-year. EBITDA increased to 2.3 billion rupees compared to 1.8 billion rupees in the same period last year. Net profit grew marginally to 1.88 billion rupees from 1.8 billion rupees year-over-year. However, EBITDA margin compressed to 23.90% from 25.69% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1755002934492,
            "Source": "earnings"
        },
        {
            "Title": "Cochin Shipyard To Announce Q1 Results On August 12",
            "Summary": "Cochin Shipyard Ltd. will announce its quarterly results for the period ending June 30 on Tuesday, August 12. The Board of Directors meeting will consider and approve standalone and consolidated unaudited financial results for the April-June quarter. The company has closed its trading window from July 1 until 48 hours after the results announcement. In its previous quarterly results, Cochin Shipyard reported consolidated revenue of Rs 1,757.65 crore, up 36.6% year-on-year, with net profit growing 11% to Rs 287.19 crore. However, Ebitda declined 8% to Rs 265.78 crore with margins contracting to 15.1% from 22.5%. The stock has declined 5.18% in the past five trading sessions and 16.12% in the last month, though it gained 25.38% over six months. The shares recorded a 52-week high of Rs 2,545 on June 6, 2025, and a 52-week low of Rs 1,180.20 on February 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754887809270,
            "Source": "earnings"
        },
        {
            "Title": "Cochin Shipyard Appoints New Government Nominee Director",
            "Summary": "Cochin Shipyard Limited has appointed Shri Venkatesapathy S IAS as Part-time Official (Nominee) Director on its Board, replacing Shri Rajesh Kumar Sinha IAS. The appointment was made by the Ministry of Ports, Shipping and Waterways and became effective August 07, 2025. Venkatesapathy is a 2009-batch IAS officer from Kerala cadre, currently serving as Joint Secretary in the Ministry of Ports, Shipping and Waterways. He holds a Bachelor of Technology degree in Production Engineering from Madras Institute of Technology, Anna University. Throughout his administrative career, he has held various positions including District Collector, Managing Director of Kerala Water Authority, and Director in the Fisheries Department. He also serves as Government Nominee Director in Shipping Corporation of India Limited, Shipping Corporation of India Land and Assets Limited, and Sagarmala Finance Corporation Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1754564679514,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cochin Shipyard: Strategic Partnership with HD Korea Shipbuilding",
            "Summary": "Cochin Shipyard signed an MoU with HD Korea Shipbuilding & Offshore Engineering for collaboration in shipbuilding and maritime development. The partnership aims to explore newbuilding opportunities, share technical expertise, and enhance productivity. This aligns with India's 'Maritime India Vision 2030' to become a global maritime hub.",
            "Sentiment": "positive",
            "PublishDate": 1751859333000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cochin Shipyard Signs MoU with HD Korea Shipbuilding",
            "Summary": "Cochin Shipyard has signed a Memorandum of Understanding (MoU) with HD Korea Shipbuilding for long-term cooperation in shipbuilding. The agreement aims to establish a collaborative relationship between the two companies in the shipbuilding industry.",
            "Sentiment": "positive",
            "PublishDate": 1751846930000,
            "Source": "default"
        },
        {
            "Title": "Cochin Shipyard to Partner with HD Korea Shipbuilding & Offshore Engineering",
            "Summary": "Cochin Shipyard has announced a partnership with HD Korea Shipbuilding & Offshore Engineering. The collaboration will span various domains, though specific details of these domains are not provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1751776559000,
            "Source": "default"
        },
        {
            "Title": "Cochin Shipyard Limited: Strategic MoU with HD Korea Shipbuilding for Maritime Collaboration",
            "Summary": "Cochin Shipyard Limited signed an MoU with HD Korea Shipbuilding & Offshore Engineering Co Ltd for long-term collaboration in shipbuilding and maritime development. The partnership aims to explore new building opportunities, share technical expertise, and enhance productivity. This aligns with India's Maritime India Vision 2030 and Maritime Amrit Kaal Vision 2047.",
            "Sentiment": "positive",
            "PublishDate": 1751633141000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cochin Shipyard Signs Partnership Agreement with HD Korea Shipbuilding",
            "Summary": "Cochin Shipyard has entered into an agreement with HD Korea Shipbuilding for a long-term shipbuilding partnership. The collaboration aims to enhance shipbuilding capabilities between the two companies.",
            "Sentiment": "positive",
            "PublishDate": 1751631164000,
            "Source": "default"
        },
        {
            "Title": "Cochin Shipyard Ltd: Secures ₹250 Crore Order for Two Tugs",
            "Summary": "Cochin Shipyard Ltd. won a 'notable' order from Polestar Maritime Ltd. to construct two 70 T bollard pull tugs, scheduled for delivery in May and September 2027. The order is valued between ₹100-250 crore. The tugs will be jointly constructed by Cochin Shipyard and its subsidiary Udupi-CSL, using Robert Allan Ltd designs and Niigata IHI Power Systems engines.",
            "Sentiment": "positive",
            "PublishDate": 1751258433000,
            "Source": "order&deals"
        },
        {
            "Title": "Cochin Shipyard Secures Order for Two Tugboats",
            "Summary": "Cochin Shipyard has received an order to build two tugboats with a bollard pull capacity of 70 tons. The order is valued between 100 to 250 crores.",
            "Sentiment": "positive",
            "PublishDate": 1751250898000,
            "Source": "default"
        },
        {
            "Title": "Cochin Shipyard: Subsidiary Wins Luxury River Cruise Vessel Order",
            "Summary": "Cochin Shipyard's subsidiary, Hooghly Cochin Shipyard Limited, secured an order valued between Rs 100-250 crore from Heritage River Journeys Private Limited for two luxury river cruise vessels for the Brahmaputra River. The contract for the first vessel is signed, with a Letter of Intent issued for the second.",
            "Sentiment": "positive",
            "PublishDate": 1750735661000,
            "Source": "order&deals"
        },
        {
            "Title": "Cochin Shipyard Receives Order Worth 1-2.5 Billion Rupees",
            "Summary": "Cochin Shipyard has received an order valued between 1 billion and 2.50 billion rupees. No further details about the nature of the order or the client were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1750722543000,
            "Source": "default"
        },
        {
            "Title": "Cochin Shipyard: Subsidiary Wins Luxury River Cruise Vessel Order",
            "Summary": "Hooghly Cochin Shipyard Ltd., a subsidiary of Cochin Shipyard Ltd., has secured an order valued between Rs 100-250 crore from Heritage River Journeys Pvt. for constructing two luxury river cruise vessels for operation on the Brahmaputra.",
            "Sentiment": "positive",
            "PublishDate": 1750699748000,
            "Source": "order&deals"
        },
        {
            "Title": "Cochin Shipyard: Shares Dip 4% After 76% Monthly Rally",
            "Summary": "Cochin Shipyard shares fell 3.6% to Rs 2,305.30 on BSE due to profit booking after a 76.3% surge in the past month. The stock had rallied 30.7% last week alone. Analysts suggest a 'buy-on-dips' strategy, with potential accumulation in the Rs 2,200-2,100 range.",
            "Sentiment": "neutral",
            "PublishDate": 1749448085000,
            "Source": "normal_news"
        },
        {
            "Title": "Cochin Shipyard: Shares Surge 8% Amid NATO Defence Spending Push",
            "Summary": "Cochin Shipyard's stock rallied 8.4% to Rs 2,547.25, extending a 32.4% gain over four days. The surge follows NATO's call for increased defence spending, potentially benefiting Indian defence companies. The company recently reported a 10.8% rise in Q4 net profit to Rs 287 crore, with revenue up 37% to Rs 1,758 crore.",
            "Sentiment": "positive",
            "PublishDate": 1749191589000,
            "Source": "normal_news"
        },
        {
            "Title": "Cochin Shipyard: Share Price Hits 10-Month High Amid High Trading Volumes",
            "Summary": "Cochin Shipyard's share price rose up to 8% in early trade, reaching a 10-month high. The stock has gained 35% in the last month and 60% year-to-date. Q4 net profit increased 11% to Rs 287.19 crore, while revenue grew 36.6% to Rs 1,757.65 crore. However, EBITDA margin contracted to 15.1%. The company announced a final dividend of Rs 2.25 per share.",
            "Sentiment": "positive",
            "PublishDate": 1749185327000,
            "Source": "result"
        },
        {
            "Title": "Cochin Shipyard: Shares Surge 12.66% Amid Market Rally",
            "Summary": "Cochin Shipyard Ltd. shares rose 12.66% to Rs 2350.8 during trading on Thursday, outpacing the BSE Sensex's gain. The stock saw high trading volume with 23,864,609 shares traded and a turnover of Rs 5373.58 crore.",
            "Sentiment": "positive",
            "PublishDate": 1749121443000,
            "Source": "normal_news"
        },
        {
            "Title": "Cochin Shipyard: Shares Surge 7% Amid Heavy Trading Volume",
            "Summary": "Cochin Shipyard's stock jumped nearly 7% to Rs 2,175 intraday on NSE with high trading volumes. The company reported a 10.8% YoY increase in Q4 net profit to Rs 287 crore and a 37% YoY revenue surge to Rs 1,758 crore. However, EBITDA dropped 7.6% and margins narrowed. The stock has gained over 700% in the past two years.",
            "Sentiment": "positive",
            "PublishDate": 1749015880000,
            "Source": "earnings"
        }
    ]
}