{
    "Symbol": "COFFEEDAY",
    "ISIN": "INE335K01011",
    "News": [
        {
            "Title": "Coffee Day Enterprises Q3FY26 Revenue ₹286 Cr, Up 2% YoY",
            "Summary": "Coffee Day Enterprises reported Q3FY26 revenue of ₹286 crores with 2% YoY growth. EBITDA surged 174% to ₹115 crores, while net profit turned positive at ₹55 crores vs ₹10 crores loss in Q3FY25.",
            "Sentiment": "positive",
            "PublishDate": 1770904204011,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coffee Day Gets Karnataka HC Relief in FEMA Case",
            "Summary": "Karnataka High Court defers ED proceedings against Coffee Day Enterprises in FEMA case related to 2010 FDI transaction until February 23, 2026. Company maintains no financial impact expected.",
            "Sentiment": "positive",
            "PublishDate": 1769075823029,
            "Source": "stocks"
        },
        {
            "Title": "Karnataka HC Stays PMLA Proceedings Against CCD CEO",
            "Summary": "Karnataka High Court has stayed Prevention of Money Laundering Act proceedings against Coffee Day Enterprises CEO Malavika Hegde following a show cause notice issued by authorities.",
            "Sentiment": "neutral",
            "PublishDate": 1768810322131,
            "Source": "stocks"
        },
        {
            "Title": "Coffee Day Enterprises Reports ₹1.26 Billion Debt",
            "Summary": "Coffee Day Enterprises has disclosed its total financial indebtedness at ₹1.26 billion, providing transparency on the company's current debt obligations and financial position.",
            "Sentiment": "neutral",
            "PublishDate": 1767788259217,
            "Source": "stocks"
        },
        {
            "Title": "Coffee Day Enterprises Settles ₹70 Cr Debt with Axis Bank",
            "Summary": "Coffee Day Enterprises Limited announces One Time Settlement agreement with Axis Bank Limited for ₹70 crores to reduce debt liability, with structured payment schedule through September 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767002500682,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coffee Day Enterprises Settles ₹70 Cr Debt With Axis Bank",
            "Summary": "Coffee Day Enterprises announces one-time settlement of ₹70 crores with Axis Bank to reduce debt burden. Payment plan structured through September 2026 for systematic debt resolution.",
            "Sentiment": "positive",
            "PublishDate": 1767002449082,
            "Source": "stocks"
        },
        {
            "Title": "Coffee Day Enterprises Subsidiary Secures ₹40 Cr OTS",
            "Summary": "Coffee Day Global Limited, a material subsidiary of Coffee Day Enterprises, has received in-principle approval for a One Time Settlement of ₹40 crores with RARE ARC for outstanding loans from three banks.",
            "Sentiment": "positive",
            "PublishDate": 1766831709754,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coffee Day Enterprises Promoters Execute Share Transactions Through Open Market",
            "Summary": "Coffee Day Enterprises disclosed promoter group share transactions where Malavika Hegde sold 2,09,489 shares (reducing stake from 1.12% to 1.02%) and 1,78,995 shares (reducing from 1.20% to 1.12%), while Ahih Resorts acquired 1,55,000 and 49,000 shares (increasing stake from 4.18% to 4.27%). The transactions occurred between December 3-4, 2025, through open market operations involving the company's promoter entities with total equity share capital of Rs. 2,11,25,17,190.",
            "Sentiment": "neutral",
            "PublishDate": 1765178943069,
            "Source": "corporate_action"
        },
        {
            "Title": "Coffee Day Enterprises Promoters Execute Share Transactions Through Open Market",
            "Summary": "Coffee Day Enterprises disclosed that promoter group entities Ahih Resorts and Retreat Private Limited acquired 49,000 shares while promoter Malavika Hegde sold 2,09,489 shares through open market transactions on December 4, 2025. The transactions resulted in Ahih Resorts increasing its holding to 4.27% while Malavika Hegde's stake remained at 1.12% of the company's total share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1765178129476,
            "Source": "corporate_action"
        },
        {
            "Title": "Coffee Day Enterprises Completes Share Transmission from Late VG Siddhartha to Malavika Hegde",
            "Summary": "Coffee Day Enterprises transmitted 9,99,658 equity shares (0.47% stake) from late promoter VG Siddhartha to Malavika Hegde on December 2, 2025. The transmission increased Malavika Hegde's shareholding from 0.73% to 1.20% while reducing VG Siddhartha's holding from 0.57% to 0.10%.",
            "Sentiment": "neutral",
            "PublishDate": 1764759612058,
            "Source": "corporate_action"
        },
        {
            "Title": "Coffee Day Enterprises Reports Mixed Q2 Results with Revenue Growth but EBITDA Decline",
            "Summary": "Coffee Day Enterprises posted 4% revenue growth to Rs 280 crores in Q2 FY26 but EBITDA dropped 30% to Rs 35 crores, while the company moved from a net loss of Rs 3 crores to Rs 12 crores. The company continues to face debt covenant breaches and ongoing legal proceedings, though it entered settlement agreements with lenders and received one-time gains from loan settlements totaling Rs 34.98 crores.",
            "Sentiment": "negative",
            "PublishDate": 1763112316114,
            "Source": "earnings"
        },
        {
            "Title": "Dolly Khanna Increases Stake in Coffee Day Enterprises to 2.19%",
            "Summary": "Dolly Khanna increased her shareholding in Coffee Day Enterprises from 1.55% to 2.19% during the second quarter. This represents a stake increase of 0.64 percentage points in the coffee chain company.",
            "Sentiment": "positive",
            "PublishDate": 1759986512723,
            "Source": "stock"
        },
        {
            "Title": "Coffee Day Enterprises Transfers 4.65% Stake to AHIH Resorts, Income Tax Attachment Withdrawn",
            "Summary": "Coffee Day Enterprises Limited announced the transfer of 98,28,451 shares (4.65% of total paid-up capital) from Mrs. Malavika Hegde, CEO and Whole time director, to AHIH Resorts and Retreat Private Limited. The transfer follows a DRT order dated September 18, 2025, and will be completed through a block deal on or before September 27, 2025. The company's board approved the transaction on September 23, 2025, and added AHIH Resorts to the promoter group. The overall shareholding of the promoter and promoter group remains unchanged post-transfer. Additionally, Coffee Day Enterprises reported that the Income Tax Department has withdrawn the provisional attachment on the company's shares that was initially disclosed in February 2019.",
            "Sentiment": "positive",
            "PublishDate": 1758694624300,
            "Source": "corporate_action"
        },
        {
            "Title": "Coffee Day Enterprises Reports Share Transmission from Late Promoter V G Siddhartha to Mrs. Malavika Hegde",
            "Summary": "Coffee Day Enterprises Limited announced the transmission of shares belonging to late promoter V G Siddhartha to Mrs. Malavika Hegde. The company received intimation from the promoter regarding this share transmission and has informed the stock exchanges accordingly. Company Secretary Sadananda Poojary communicated this development to both NSE and BSE for record purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1757408865960,
            "Source": "corporate_action"
        },
        {
            "Title": "Coffee Day Enterprises Reports Strong Q1 Turnaround with 282 Million Rupees Net Profit",
            "Summary": "Coffee Day Enterprises delivered a significant turnaround in its quarterly results, posting a net profit of 282 million rupees compared to a loss of 115 million rupees in the same period last year. Revenue grew to 2.69 billion rupees from 2.6 billion rupees year-over-year. EBITDA surged to 322 million rupees from 37.35 million rupees, though the EBITDA margin declined to 11.96% from 14.36% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755469958032,
            "Source": "earnings"
        },
        {
            "Title": "Malavika Hegde Appointed Chairperson of Coffee Day Enterprises, Re-appointed as Whole-time Director",
            "Summary": "Malavika Hegde has been appointed as Chairperson of Coffee Day Enterprises Limited and its material subsidiary Coffee Day Global Limited, effective immediately. The Board also approved her re-appointment as Whole-time Director for five years from December 31, 2025, to December 30, 2030, subject to shareholder approval. Hegde, a commerce graduate from the promoter family, has been involved in the Group's hospitality business since 2008 and has been leading the company's turnaround since 2020, focusing on debt resolution and growth of the Coffee Day brand across cafes, vending machines, and kiosks. She succeeds S.V. Ranganath, who served as Chairperson during the company's challenging period.",
            "Sentiment": "positive",
            "PublishDate": 1755177447676,
            "Source": "corporate_governance"
        },
        {
            "Title": "Coffee Day Enterprises Reports Mixed Q1 Results with Revenue Growth and Exceptional Gains",
            "Summary": "Coffee Day Enterprises Limited reported consolidated revenue of ₹269 crores for the quarter ended June 30, 2025, up 3% year-over-year. EBITDA reached ₹76 crores, up 77% YoY, including one-time gains of ₹35 crores from loan settlements and lender adjustments. Net profit stood at ₹28 crores compared to a loss of ₹11 crores in the same quarter last year. The company's subsidiary Coffee Day Global Limited reported revenue of ₹263 crores, up 6% YoY, but EBITDA declined 4% to ₹37 crores. The group operates 427 cafe outlets and 55,189 vending machines. However, auditors issued disclaimer opinions citing concerns over recoverability of dues from group companies worth ₹1,606 crores and amounts due from MACEL totaling ₹3,373 crores. The company continues to face debt covenant breaches and has ongoing legal proceedings, though it maintains operations on a going concern basis with positive net worth of ₹2,964 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1755167200198,
            "Source": "earnings"
        },
        {
            "Title": "Coffee Day Enterprises Reports Release of Pledged Shares by Group Company",
            "Summary": "Coffee Day Enterprises Limited disclosed the release of pledged equity shares in connection with borrowings by a Group Company. The disclosure was made by Malavika Hegde on July 29, 2025, under SEBI regulations for substantial acquisition of shares and takeovers. The release involved 375,000 shares (0.18% of total share capital) that were pledged to HDFC Bank Limited for borrowings availed by Coffee Day group companies. The shares were released on July 10, 2025. Total promoter holding stands at 1,73,46,708 shares representing 8.21% of the company's share capital, with post-event encumbered shares at 46,19,780 shares (2.19% of share capital).",
            "Sentiment": "neutral",
            "PublishDate": 1753789116799,
            "Source": "corporate_action"
        },
        {
            "Title": "Coffee Day Enterprises Receives Shareholding Disclosure from NLS Mauritius LLC",
            "Summary": "Coffee Day Enterprises Limited received shareholding change disclosures from NLS Mauritius LLC under SEBI Substantial Acquisition of Shares and Takeovers Regulations. The company has forwarded these disclosures to the National Stock Exchange of India Limited and Bombay Stock Exchange Limited. The disclosure was signed by Sadananda Poojary, Company Secretary & Compliance Officer of Coffee Day Enterprises Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1753339611126,
            "Source": "corporate_action"
        },
        {
            "Title": "Coffee Day Enterprises: Dolly Khanna Acquires 1.55% Stake",
            "Summary": "Renowned investor Dolly Khanna has purchased a 1.55% stake (32.78 lakh shares) in Coffee Day Enterprises during the June 2025 quarter. The stock hit the upper circuit at Rs 39.86 on the BSE, rising 10% following this news.",
            "Sentiment": "positive",
            "PublishDate": 1752646285000,
            "Source": "block_deals"
        },
        {
            "Title": "Coffee Day Enterprises: Dolly Khanna Acquires 1.55% Stake in June Quarter",
            "Summary": "Star investor Dolly Khanna has purchased a 1.55% stake (32.78 lakh shares) in Coffee Day Enterprises during the June 2025 quarter. This is either a fresh investment or an increase from a previously undisclosed stake below 1%. The stock has shown strong recovery in 2025, gaining 52.01% year-to-date despite a 32.11% decline over the past year.",
            "Sentiment": "positive",
            "PublishDate": 1752583787000,
            "Source": "normal_news"
        },
        {
            "Title": "Dolly Khanna Acquires 1.55% Stake in Coffee Day Enterprises",
            "Summary": "Investor Dolly Khanna has acquired a 1.55% stake in Coffee Day Enterprises. The news indicates a significant investment by a notable investor in the company.",
            "Sentiment": "positive",
            "PublishDate": 1752572729000,
            "Source": "default"
        },
        {
            "Title": "Coffee Day Enterprises: SEBI Penalty Stay Order Extended by Six Months",
            "Summary": "Coffee Day Enterprises has announced that the stay order on a penalty imposed by the Securities and Exchange Board of India (SEBI) has been extended for an additional six months. This extension provides the company with more time to address the regulatory matter without immediate financial consequences.",
            "Sentiment": "neutral",
            "PublishDate": 1752062627000,
            "Source": "default"
        },
        {
            "Title": "Coffee Day Enterprises: Q4 Net Loss Narrows, Revenue Grows 7%",
            "Summary": "Coffee Day Enterprises Ltd. reported a consolidated net loss of Rs 114.16 crore in Q4 FY25, down from Rs 296.40 crore year-over-year. Revenue from operations increased 7% to Rs 268.03 crore. For FY25, the company reduced its net loss to Rs 143.20 crore from Rs 307.43 crore in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748614230000,
            "Source": "earnings"
        },
        {
            "Title": "Coffee Day Enterprises Reports Q4 Financial Results",
            "Summary": "Coffee Day Enterprises has released its Q4 financial results. The company reported an EBITDA of 90 million rupees, down from 330 million rupees year-over-year. The EBITDA margin decreased to 3.36% from 13.15% in the same period last year. The consolidated net loss for Q4 was 330 million rupees, an improvement from a loss of 3.02 billion rupees year-over-year, but a decline from a loss of 103 million rupees quarter-over-quarter. Q4 revenue increased to 2.7 billion rupees from 2.5 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748526400000,
            "Source": "result"
        },
        {
            "Title": "Coffee Day Enterprises Unit to Sell Shares in Magnasoft Consulting",
            "Summary": "A unit of Coffee Day Enterprises is set to sell shares in Magnasoft Consulting for 235.7 million rupees. No further details about the transaction or the companies involved were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1747638664000,
            "Source": "default"
        },
        {
            "Title": "Coffee Day Enterprises: Total Default Reaches ₹425.38 Crore by March 2025",
            "Summary": "Coffee Day Enterprises Ltd (CDEL) reported a total default of ₹425.38 crore as of March 31, 2025, including principal and interest payments on loans from banks, financial institutions, and unlisted debt securities. The company attributes the delay to a liquidity crisis and has not recognized interest since April 2021 due to loan recall notices and legal disputes.",
            "Sentiment": "negative",
            "PublishDate": 1744034842000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Coffee Day Enterprises Settles Outstanding Debt of 2.05 Billion Rupees",
            "Summary": "Coffee Day Enterprises has successfully settled an outstanding debt of 2.05 billion rupees. This financial move indicates the company's efforts to manage its liabilities and improve its financial position.",
            "Sentiment": "positive",
            "PublishDate": 1742256171000,
            "Source": "corporate_action"
        },
        {
            "Title": "Coffee Day Enterprises Settles Outstanding Debt",
            "Summary": "Coffee Day Enterprises has settled its outstanding debt for 2.05 billion rupees (approximately $24.7 million USD). This debt settlement represents a significant financial move for the company, potentially improving its balance sheet and financial stability.",
            "Sentiment": "positive",
            "PublishDate": 1742208195000,
            "Source": "corporate_action"
        },
        {
            "Title": "Coffee Day Enterprises: Insolvency Proceedings Set Aside, Stock Surges",
            "Summary": "Coffee Day Enterprises stock hit upper circuit limit for second consecutive day, rising 20% after NCLAT set aside insolvency proceedings against the company. The stock reached Rs 30.78 on BSE and Rs 30.63 on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1741075509000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Coffee Day Enterprises: NCLAT Sets Aside Insolvency Proceedings",
            "Summary": "The National Company Law Appellate Tribunal (NCLAT) has overturned insolvency proceedings against Coffee Day Enterprises Ltd, reversing the NCLT's August 2024 order. The company's shares surged 20% to Rs 25.65 on the BSE following this news. The insolvency plea, filed by IDBI Trusteeship Services Ltd over an alleged Rs 228 crore default, has been set aside.",
            "Sentiment": "positive",
            "PublishDate": 1740976485000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Coffee Day Enterprises: Insolvency Proceedings Resume as NCLAT Misses Deadline",
            "Summary": "Insolvency process against Coffee Day Enterprises Ltd. has resumed after NCLAT failed to pass an order by the Supreme Court's deadline of Feb. 21, 2025. The Corporate Insolvency Resolution Process (CIRP) recommences, and the Interim Resolution Professional's powers are reinstated effective Feb. 22, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1740391092000,
            "Source": "corporate_governance"
        },
        {
            "Title": "NFRA: Rs 2 Crore Penalty on Coffee Day Auditors, CAs Barred",
            "Summary": "<p>NFRA imposed a <span class='negative'>Rs 2 crore penalty</span> on Coffee Day Enterprises Limited's statutory auditor and <span class='negative'>Rs 15 lakh</span> on two chartered accountants for <span class='negative'>professional misconduct</span> in FY2019-20 audit. The auditors were found to have <span class='negative'>neglected their duty</span> to report <span class='negative'>fraud</span> involving <span class='negative'>fund diversion</span> of <span class='negative'>Rs 3,535 crore</span>. Two CAs have been <span class='negative'>debarred</span> for <b>10 and 5 years</b> respectively.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728568786000,
            "Source": "normal_news"
        }
    ]
}