{
    "Symbol": "COFORGE",
    "ISIN": "INE591G01025",
    "News": [
        {
            "Title": "Coforge Named Leader in ISG Provider Lens 2025 Cloud",
            "Summary": "Coforge Limited recognized as leader in ISG Provider Lens 2025 Multi Public Cloud Services for US and UK regions in Consulting & Transformation Services and Managed Services - Midmarket categories.",
            "Sentiment": "positive",
            "PublishDate": 1769664350975,
            "Source": "stocks"
        },
        {
            "Title": "Coforge Postal Ballot Results: 4 of 5 Resolutions Pass",
            "Summary": "Coforge shareholders approved 4 out of 5 resolutions in postal ballot concluded January 25, 2026, with over 95% support for capital increase, share issuance, investment limits, and QIP fundraising.",
            "Sentiment": "positive",
            "PublishDate": 1769535865097,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coforge Sees ₹76.12 Cr NSE Block Trade at ₹1653",
            "Summary": "Coforge witnessed a significant block trade on NSE worth ₹76.12 crores involving approximately 460,511 shares at ₹1653.00 per share, indicating substantial institutional activity in the IT services stock.",
            "Sentiment": "neutral",
            "PublishDate": 1769493831430,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coforge Partners with Innovaccer for Healthcare AI",
            "Summary": "Coforge announces strategic partnership with Innovaccer to launch G-Forge initiative, combining AI platform expertise to accelerate healthcare transformation and improve patient outcomes.",
            "Sentiment": "positive",
            "PublishDate": 1769445716541,
            "Source": "stocks"
        },
        {
            "Title": "Coforge CEO Hints at Major Deal Announcement in Q4",
            "Summary": "Mid-cap IT services provider Coforge is set to announce one of its biggest deals in Q4, with CEO Sudhir Singh revealing a major healthcare sector contract already signed in the current quarter.",
            "Sentiment": "positive",
            "PublishDate": 1769402615201,
            "Source": "stocks"
        },
        {
            "Title": "Coforge Executive Advises Against QIP Proposal",
            "Summary": "A Coforge executive has recommended against proceeding with the company's proposed Qualified Institutional Placement (QIP), though specific details about the reasoning remain limited.",
            "Sentiment": "negative",
            "PublishDate": 1769147857312,
            "Source": "stocks"
        },
        {
            "Title": "Coforge Q3FY26 Results: Revenue Rises 28.5% YoY",
            "Summary": "Coforge reported consolidated revenue of ₹41,881 million for Q3FY26, up 28.5% YoY. Net profit stood at ₹2,967 million. Board declared third interim dividend of ₹4 per share.",
            "Sentiment": "positive",
            "PublishDate": 1769105368797,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coforge Shares Investor Call Transcript",
            "Summary": "Coforge Limited has made available the transcript of its investor conference call held on December 26, 2025, following the board meeting, as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1767006064745,
            "Source": "stocks"
        },
        {
            "Title": "CLSA Maintains Outperform Rating on Coforge at ₹2,275",
            "Summary": "CLSA maintains 'Outperform' rating on Coforge with price target of ₹2,275, adding to positive analyst sentiment alongside Morgan Stanley's ₹2,030 target.",
            "Sentiment": "positive",
            "PublishDate": 1766979881637,
            "Source": "stocks"
        },
        {
            "Title": "Coforge EBIT margin rises 60 bps to 18% on cost synergies",
            "Summary": "Coforge reports EBIT margin expansion to 18.0% driven by $10 million cost synergies, higher EBITDA margin, and 5% revenue growth in higher-margin business areas.",
            "Sentiment": "positive",
            "PublishDate": 1766962720303,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coforge clarifies speculative news reports",
            "Summary": "Coforge Limited issues clarification statement regarding speculative news item on Moneycontrol, stating it was premature and not based on official company information.",
            "Sentiment": "neutral",
            "PublishDate": 1766767424222,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coforge Encora Acquisition EPS Analysis & Overview",
            "Summary": "Coforge releases investor presentation showing EPS accretive Encora acquisition with detailed financial projections and shareholding structure analysis for the $2.35 billion deal.",
            "Sentiment": "positive",
            "PublishDate": 1766731636921,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coforge in talks to acquire Encora for $2B; board meet today",
            "Summary": "Coforge is negotiating to acquire Encora for $2 billion, up from earlier $1B+ reports. Board meeting scheduled today to consider fund raising proposal, with analyst call this evening.",
            "Sentiment": "neutral",
            "PublishDate": 1766719156642,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coforge Gets Approval to Raise $550M Through QIP",
            "Summary": "Coforge receives board approval to raise up to $550 million through qualified institutional placement, marking second major fund raise in 18 months after previous ₹2,240 crore QIP for Cigniti acquisition.",
            "Sentiment": "neutral",
            "PublishDate": 1766716036990,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coforge Launches EvolveOps.AI Platform for IT Operations",
            "Summary": "Coforge introduces EvolveOps.AI, an Agentic AI-powered IT operations platform with 28 AI personas, delivering 25% downtime reduction, 40% cost savings, and 60% faster incident resolution.",
            "Sentiment": "positive",
            "PublishDate": 1766560693713,
            "Source": "stocks"
        },
        {
            "Title": "Coforge to Discuss Fundraising Plans on December 26",
            "Summary": "IT services company Coforge has scheduled a meeting on December 26 to discuss fundraising initiatives, marking a significant corporate development for the large-cap technology firm.",
            "Sentiment": "neutral",
            "PublishDate": 1766461713699,
            "Source": "stocks"
        },
        {
            "Title": "Coforge Board to Meet on Dec 26 for Fund Raising Proposal",
            "Summary": "Coforge announces board meeting on December 26, 2025, to consider fund raising through equity shares or other securities via various modes including private placement and QIP.",
            "Sentiment": "neutral",
            "PublishDate": 1766428006639,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coforge Allots 1.45 Lakh Shares Under ESOP Scheme",
            "Summary": "Coforge Limited has allotted 1,45,189 equity shares under its Employee Stock Option Plan (ESOP) 2005 scheme on December 14, 2025, increasing the company's paid-up share capital to ₹67.01 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1765687027318,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cigniti Technologies Unsecured Creditors Approve Amalgamation with Coforge Limited",
            "Summary": "Cigniti Technologies Limited's unsecured creditors unanimously approved the scheme of amalgamation with Coforge Limited during a meeting held on December 06, 2025, with 99.36% of creditors by value voting in favor. The approval represents a significant step in the merger process between the two technology companies, pending final tribunal and regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1765213955694,
            "Source": "corporate_action"
        },
        {
            "Title": "Coforge Secured Creditors Unanimously Approve Amalgamation with Cigniti Technologies",
            "Summary": "Coforge Limited's secured creditors unanimously approved the proposed scheme of amalgamation with Cigniti Technologies Limited during a meeting held on December 6, 2025, through video conferencing as directed by NCLT Chandigarh Bench. The approval with 100% votes in favor represents a significant step forward in the merger process between the two technology companies, subject to final tribunal approval and other regulatory clearances.",
            "Sentiment": "positive",
            "PublishDate": 1765213207576,
            "Source": "corporate_action"
        },
        {
            "Title": "Coforge Establishes Z/TPF Center of Excellence for AI-Enhanced Transaction Processing",
            "Summary": "Coforge has launched a Z/TPF Center of Excellence focused on AI-driven transaction processing innovation. The initiative positions the company to enhance its capabilities in mainframe transaction processing systems through artificial intelligence integration.",
            "Sentiment": "positive",
            "PublishDate": 1765162351207,
            "Source": "stock"
        },
        {
            "Title": "Coforge Named Leader in Everest Group's Enterprise Quality Engineering Services Assessment 2025",
            "Summary": "Coforge Limited has been recognized as a Leader in Everest Group's Enterprise Quality Engineering Services PEAK Matrix Assessment 2025, highlighting its comprehensive QE capabilities, AI-driven solutions, and strong market presence across regulated sectors. The recognition reflects Coforge's expanding enterprise QE footprint and one of the highest year-over-year QE revenue increases among all assessed providers, driven by its proprietary BlueSwan platform and deep industry expertise.",
            "Sentiment": "positive",
            "PublishDate": 1764900383840,
            "Source": "stock"
        },
        {
            "Title": "Coforge Enhances AI Platform With New Automation And Governance Tools",
            "Summary": "Coforge has upgraded its Quasar AI Platform by adding workflow automation agents, governance systems, and a smart orchestration engine. The enhancement strengthens the company's AI capabilities and expands its technology offerings for clients seeking advanced automation solutions.",
            "Sentiment": "positive",
            "PublishDate": 1764653690313,
            "Source": "stock"
        },
        {
            "Title": "Coforge Shares Worth Rs. 53.35 Crores Traded in NSE Block Deal",
            "Summary": "Coforge Ltd. witnessed a block trade on NSE involving 278,597 shares at Rs. 1,914.90 per share, totaling Rs. 53.35 crores. The transaction represents a significant institutional trade in the IT services company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1764302017430,
            "Source": "order&deals"
        },
        {
            "Title": "Coforge Launches Forge-X AI-Native Platform to Transform Software Delivery",
            "Summary": "Coforge Limited announced the launch of Forge-X, an integrated engineering and delivery platform built on Agentic AI principles that transforms software delivery through autonomous AI agents and spans across Software Development Life Cycle and Product Development Life Cycle. The platform includes specialized tools like CodeInsight AI, BlueSwan, NORTHSTAR, and EvolveOps.AI, designed to deliver faster time-to-market, improved resiliency and optimized engineering costs for clients across geographies.",
            "Sentiment": "positive",
            "PublishDate": 1763966494950,
            "Source": "stock"
        },
        {
            "Title": "Coforge Wins 2025 ISG Star of Excellence Award for IT Operations",
            "Summary": "Coforge Limited received the 2025 ISG Star of Excellence Award in the IT Operations category, recognizing the company for demonstrating highest standards of customer service excellence based on direct enterprise customer feedback. The award was presented at the ISG Sourcing Industry Awards Gala Dinner in London, with Coforge achieving an overall customer experience score of 90 among more than 240 evaluated service providers.",
            "Sentiment": "positive",
            "PublishDate": 1763710667591,
            "Source": "stock"
        },
        {
            "Title": "Coforge Allots 1,02,070 Equity Shares Under ESOP Scheme",
            "Summary": "Coforge's ESOP Allotment Committee approved the allotment of 1,02,070 equity shares with face value of Rs. 2 each under the Employee Stock Option Plan on November 20, 2025. The allotment increased the company's paid-up share capital to 334,896,619 equity shares aggregating to Rs. 669,793,238, with listing and trading approval processes underway.",
            "Sentiment": "neutral",
            "PublishDate": 1763691049440,
            "Source": "corporate_action"
        },
        {
            "Title": "Coforge Transitions to New Registrar and Share Transfer Agent",
            "Summary": "Coforge Limited is transitioning from Alankit Assignments Limited to MUFG Intime India Private Limited as its Registrar and Share Transfer Agent, with the process currently underway. Alankit will continue providing RTA services until the complete database and connectivity shift is confirmed by both depositories.",
            "Sentiment": "neutral",
            "PublishDate": 1763311615490,
            "Source": "corporate_action"
        },
        {
            "Title": "Coforge Receives Credit Rating Upgrade from CRISIL",
            "Summary": "CRISIL Ratings Limited upgraded Coforge's long-term issuer rating to CRISIL AA+/Stable from CRISIL AA/Positive and reaffirmed the short-term rating at CRISIL A1+. Coforge has accepted the updated ratings as required by CRISIL. The company communicated this rating revision to BSE and NSE stock exchanges.",
            "Sentiment": "positive",
            "PublishDate": 1762829976415,
            "Source": "stock"
        },
        {
            "Title": "Coforge Shareholders Approve Board Appointments Through Postal Ballot",
            "Summary": "Coforge shareholders approved two key board appointments through a postal ballot concluded on November 2, 2025. The first resolution approved the re-appointment of Mr. DK Singh as Independent Director for a second term of 5 years from February 12, 2026 to February 11, 2031, receiving 98.77% votes in favor. The second resolution approved the appointment of Mr. John Speight as Executive Director for up to 5 years from October 10, 2025 to October 9, 2030, with 95.09% votes in favor. The voting was conducted entirely through electronic remote e-voting, with the postal ballot notice sent on October 3, 2025 to shareholders as of the cut-off date of September 26, 2025. The remote e-voting period ran from October 4, 2025 at 9:00 AM to November 2, 2025 at 5:00 PM.",
            "Sentiment": "positive",
            "PublishDate": 1762204453946,
            "Source": "corporate_governance"
        },
        {
            "Title": "Coforge Grants 175,000 Stock Options to Employees Under ESOP 2005",
            "Summary": "Coforge Limited's Nomination and Remuneration Committee approved Grant 167 under the Employee Stock Option Plan 2005, issuing 175,000 performance-based stock options to employees of the company and its subsidiaries. The options will vest based on performance across multiple fiscal years, with 100% vesting scheduled for October 31, 2026 (FY26 performance), and July 1 for subsequent years through 2030 (FY27-FY30 performance). Employees must exercise their vested options by December 31st of the respective vesting year.",
            "Sentiment": "positive",
            "PublishDate": 1761931759974,
            "Source": "corporate_action"
        },
        {
            "Title": "Coforge Grants Performance-Based Stock Options to Employees Under ESOP 2005",
            "Summary": "Coforge's Nomination and Remuneration Committee approved the grant of performance-based stock options to employees and subsidiary company staff under the Employee Stock Option Plan 2005. The company issued 12 separate grants (Grant 155-166) with varying quantities and exercise prices. Most grants have an exercise price of Rs. 1,550 per option, while two grants (158 and 164) are priced at Rs. 2 per option. The options will vest based on performance across fiscal years FY26 through FY30, with 50% vesting occurring in two tranches for each performance year. Exercise periods range from 2 to 5 years from each vesting date, with some grants allowing exercise by December 31st of the vesting year.",
            "Sentiment": "positive",
            "PublishDate": 1761888432701,
            "Source": "corporate_action"
        },
        {
            "Title": "Coforge Inaugurates AI Lab at IIT Varanasi for Social Impact Research",
            "Summary": "Coforge Limited has inaugurated the Coforge Data & AI Lab at IIT (BHU), Varanasi under a formal MoU as part of its CSR initiative. The 980 sq. ft. lab features 32 Apple desktops, Azure cloud access, and video conferencing facilities to foster AI and data science innovation. The lab will support four research projects including AI-assisted cybersecurity vulnerability detection, AI-powered reading systems for visually impaired, IoT-based soil health monitoring for agriculture, and cognitive research to enhance mathematical abilities of schoolchildren in Varanasi. CEO Sudhir Singh stated the goal is to empower students with hands-on AI experience to solve real-world challenges. The initiative aims to bridge academic learning with industry expertise while contributing to research publications and skill-building certifications in emerging technologies.",
            "Sentiment": "positive",
            "PublishDate": 1761634645320,
            "Source": "stock"
        },
        {
            "Title": "Coforge CEO Emphasizes Curiosity Over Certificates for AI-Era Hiring",
            "Summary": "Coforge CEO Sudhir Singh stated that curiosity is the most critical skill for new hires in the AI age, prioritizing hands-on experience and hackathon participation over traditional certificates. The company continues hiring fresh graduates and lateral talent to support growth. Singh addressed US H1B visa concerns, noting Coforge secured only 65 H1B petitions for 35,000 global employees, calling the impact containable through on-site hiring. The company closed 10 large deals in the first half compared to 14 for the entire previous year, with Europe showing strength. Coforge reported quarterly revenue of Rs 3,986 crore with 8.1% quarter-on-quarter growth in rupee terms and 5.9% in constant currency. EBITDA margin reached 18.3%, up 115 basis points quarter-on-quarter. Shares closed 4.03% higher at Rs 1,831.",
            "Sentiment": "positive",
            "PublishDate": 1761632824102,
            "Source": "stock"
        },
        {
            "Title": "Coforge Stock Gains 4% as Strong September Quarter Performance Drives Analyst Target Upgrades",
            "Summary": "Coforge's stock rose 4% following strong September quarter results that showed revenue growth of 4.5% sequentially to $462.1 million, outpacing tier I peers who recorded below 3% growth. The company reported $514 million in new deals, marking the fifth consecutive quarter with total contract value above $500 million. The 12-month executable order book reached a record high of $1,635 million. Net profit grew 18.4% to Rs375.8 crore while operating margin expanded 260 basis points to 14%. The $1.6 billion deal with Sabre Corporation signed in March began contributing to revenue. Headcount increased to 34,896 with attrition remaining low at 11.4%. Analysts raised 12-month price targets by an average of 7%, with IDBI Capital setting a target of Rs2,030 and Elara Capital at Rs2,010. The stock closed at Rs1,830.3 on Monday.",
            "Sentiment": "positive",
            "PublishDate": 1761572920881,
            "Source": "stock"
        },
        {
            "Title": "Coforge Shares Worth Rs. 65.01 Crores Traded in NSE Block Deal",
            "Summary": "Coforge Ltd. witnessed a block trade on NSE involving approximately 353,295 shares at Rs. 1,840 per share, totaling Rs. 65.01 crores. The transaction represents a significant bulk deal in the IT services company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1761540999644,
            "Source": "order&deals"
        },
        {
            "Title": "Coforge Projects 14% EBIT Margin for FY26 Amid Expected Seasonal Furloughs",
            "Summary": "Coforge anticipates normal seasonal furloughs in the next quarter, consistent with previous years. The company projects a 14% EBIT margin for FY26 and plans to maintain this rate going forward. Management expects strong growth in H2 FY26, particularly in Q4, which typically represents one of their strongest quarters. The company forecasts its free cash flow to PAT ratio will remain at 70-80% and effective tax rate will stabilize at 23.5-24%.",
            "Sentiment": "positive",
            "PublishDate": 1761537341642,
            "Source": "stock"
        },
        {
            "Title": "Coforge Reports Strong Q2 Performance with 18.6% Jump in Net Profit",
            "Summary": "Coforge delivered robust quarterly results with consolidated net profit rising to 3.76 billion rupees from 3.17 billion rupees quarter-on-quarter, nearly matching analyst estimates of 3.77 billion rupees. Revenue grew to 39.85 billion rupees from 36.9 billion rupees in the previous quarter. The company's EBIT increased significantly to 5.6 billion rupees from 4.17 billion rupees, though slightly below the estimated 5.75 billion rupees. EBITDA margin expanded to 14.07% from 11.33% quarter-on-quarter, aligning closely with the 14% estimate.",
            "Sentiment": "positive",
            "PublishDate": 1761523726479,
            "Source": "earnings"
        },
        {
            "Title": "Coforge Reports Strong Q2 Results, Declares Rs 4 Interim Dividend and Approves Subsidiary Wind-Up",
            "Summary": "Coforge's Board approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company declared a second interim dividend of Rs 4 per equity share with a record date of October 31, 2025, payable within 30 days. The Board also approved voluntary winding up of two UK subsidiaries - Coforge SF Limited and Coforge DPA UK Limited - to enhance cost efficiency and operational synergy. Consolidated revenue from operations reached Rs 39,857 million for the quarter, with profit after tax at Rs 4,254 million. The company appointed John Speight as President and Executive Director effective October 10, 2025, subject to shareholder approval. Statutory auditors S R Batliboi & Associates issued unmodified limited review reports for the quarterly results.",
            "Sentiment": "positive",
            "PublishDate": 1761320084842,
            "Source": "earnings"
        },
        {
            "Title": "Coforge Receives Approval to Wind Down Two UK Subsidiaries",
            "Summary": "Coforge has obtained approval to wind down two of its subsidiaries located in the United Kingdom. The company is proceeding with the closure process for these UK-based entities.",
            "Sentiment": "neutral",
            "PublishDate": 1761309487615,
            "Source": "stock"
        },
        {
            "Title": "Coforge Reports Strong Q2 Performance with $514M Order Intake and 19% Profit Growth",
            "Summary": "Coforge delivered robust quarterly results with net profit rising to 3.76 billion rupees from 3.17 billion rupees quarter-on-quarter, nearly meeting estimates of 3.77 billion rupees. Revenue increased to 39.85 billion rupees from 36.9 billion rupees. EBIT surged to 5.6 billion rupees from 4.17 billion rupees, slightly below the 5.75 billion rupee estimate. EBITDA margin improved significantly to 14.07% from 11.33%, exceeding the estimated 14%. The company secured $514 million in total contract value order intake during the quarter and recommended an interim dividend of 4 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1761302716930,
            "Source": "stock"
        },
        {
            "Title": "Coforge to Announce Q2 Results on October 24, Board to Consider Second Interim Dividend",
            "Summary": "Coforge will announce its second quarter results on October 24, with the board meeting to approve unaudited consolidated and standalone financial results for the quarter and half-year ended September 30, 2025. The board will also consider a proposal for a second interim dividend payment for FY26. An earnings call is scheduled for the same day at 5 p.m. IST to discuss performance with investors and analysts. The company serves over 260 clients globally with a workforce exceeding 32,000, specializing in AI, cloud, data, and automation solutions. In the previous quarter, Coforge reported a 55.67% year-on-year increase in total income to Rs 3,707.2 crore, while consolidated net profit more than doubled to Rs 356.4 crore. The stock has declined 1.44% in the past five trading sessions and fallen 10.14% year-to-date, though it has gained 20.76% over the last year.",
            "Sentiment": "neutral",
            "PublishDate": 1761135029982,
            "Source": "earnings"
        },
        {
            "Title": "NCLT Approves Shareholder and Creditor Meetings for Coforge-Cigniti Technologies Merger",
            "Summary": "The National Company Law Tribunal Chandigarh Bench has directed Coforge Limited to convene meetings of equity shareholders, secured creditors, and unsecured creditors to consider the proposed merger with Cigniti Technologies Limited. The order dated October 17, 2025, follows a joint application filed by both companies under the Companies Act, 2013. The scheme involves amalgamation of Cigniti Technologies (transferor company) into Coforge Limited (transferee company) with an appointed date of April 1, 2025. Cigniti Technologies has 28,488 equity shareholders and 16 unsecured creditors owing Rs 1.63 crore, while Coforge has 1,88,219 equity shareholders, 5 secured creditors owed Rs 382.07 crore, and 56 unsecured creditors owed Rs 265.97 crore. The tribunal appointed Mr. LN Gupta as chairperson and Advocate Yashraj Singh as scrutinizer for the meetings. Both companies' boards approved the scheme in December 2024 and July 2025 respectively. The merger aims to create synergies in AI-led assurance and IT solutions, strengthen market presence, and streamline corporate structure.",
            "Sentiment": "positive",
            "PublishDate": 1760790205262,
            "Source": "corporate_action"
        },
        {
            "Title": "Coforge Seeks Shareholder Approval for Director Appointments via Postal Ballot",
            "Summary": "Coforge Limited has issued a postal ballot notice seeking shareholder approval for two director appointments. The company is proposing the re-appointment of Mr. D K Singh as Independent Director for a second term of 5 years from February 12, 2026 to February 11, 2031. Additionally, shareholders will vote on appointing Mr. John Speight as Executive Director for 5 years from October 10, 2025 to October 09, 2030, with an annual salary of GBP 335,494 and bonus of GBP 111,336. The remote e-voting period runs from October 4, 2025 to November 2, 2025, with results to be declared by November 3, 2025. Mr. Singh, who has over 36 years of leadership experience across multiple industries, currently serves as Senior Advisor at McKinsey & Company. Mr. Speight, with over 40 years of IT industry experience, currently leads Coforge's UK and Europe operations.",
            "Sentiment": "neutral",
            "PublishDate": 1759507993734,
            "Source": "corporate_action"
        },
        {
            "Title": "Coforge Limited Wins Golden Peacock Award for Excellence in Corporate Governance 2025",
            "Summary": "Coforge Limited has been awarded the Golden Peacock Award for Excellence in Corporate Governance for 2025 by the Institute of Directors, India. The award was decided by a jury chaired by Hon'ble Justice Uday U. Lalit, former Chief Justice of India, along with other distinguished members including Hon'ble Justice Ritu Raj Awasthi and Prof. Mervyn E. King SC. The award recognizes Coforge's commitment to high standards of corporate governance, transparency, and ethical business practices. The company describes this recognition as a benchmark of Corporate Governance Excellence worldwide.",
            "Sentiment": "positive",
            "PublishDate": 1759127856000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Coforge Board Approves Re-appointment of Independent Director and New Executive Director",
            "Summary": "Coforge Limited's Board of Directors approved the re-appointment of D K Singh as Independent Director for a second five-year term from February 12, 2026 to February 11, 2031. The board also approved the appointment of John Speight as Executive Director for up to five years starting October 10, 2025. Both appointments are subject to shareholder approval. Singh brings over 36 years of leadership experience across retail, industrial, consumer goods, and technology sectors, with expertise in procurement and supply chain management. He previously served as Senior Vice President and Chief Procurement Officer at Walmart and is a Senior Advisor at McKinsey & Company. Speight, who joined Coforge in July 2018, serves as Business Head for UK and Europe operations and has over 40 years of IT industry experience. He previously worked at Genpact in banking and financial services and held leadership roles at London brokerages. Neither director is related to any existing company directors.",
            "Sentiment": "positive",
            "PublishDate": 1758557781683,
            "Source": "corporate_governance"
        },
        {
            "Title": "Coforge Says New US H-1B Visa Rules Will Have Minimal Impact on Operations",
            "Summary": "Coforge addressed investor concerns regarding new US H-1B visa regulations, stating that the impact on its operations will be minimal. The company generates 53% of its revenue from the US market in FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1758506478976,
            "Source": "stock"
        },
        {
            "Title": "SailPoint And CoForge Partner To Strengthen Enterprise Identity Security Solutions",
            "Summary": "SailPoint and CoForge have formed a partnership focused on enhancing enterprise-level identity security. The collaboration aims to strengthen identity security solutions for enterprise clients.",
            "Sentiment": "positive",
            "PublishDate": 1756992068013,
            "Source": "order&deals"
        },
        {
            "Title": "Coforge Completes Merger of Three Subsidiaries Into Coforge Technologies",
            "Summary": "Coforge has announced the merger of three entities - Coforge Services, Coforge SmartServe, and Coforge SF - into Coforge Technologies. The company stated this consolidation is aimed at improving operational efficiency. The transfer status has been updated to 'Amalgamated' in the Registrar of Companies records, indicating the formal completion of the merger process.",
            "Sentiment": "positive",
            "PublishDate": 1756882259985,
            "Source": "corporate_action"
        },
        {
            "Title": "Coforge Schedules Board Meeting for Q2 Results Review",
            "Summary": "Coforge has announced that its board of directors will convene on October 24 to consider the company's second quarter results.",
            "Sentiment": "neutral",
            "PublishDate": 1756881917953,
            "Source": "earnings"
        }
    ]
}