{
    "Symbol": "COLPAL",
    "ISIN": "INE259A01022",
    "News": [
        {
            "Title": "Colgate-Palmolive India Q3FY26 Results Announced",
            "Summary": "Colgate-Palmolive India reported Q3FY26 net sales of Rs. 1,473 crore, up 1.4% YoY. Net profit stood at Rs. 324 crore, with 2.3% growth excluding exceptional items from new labour code implementation.",
            "Sentiment": "positive",
            "PublishDate": 1769696011714,
            "Source": "co_actions_results"
        },
        {
            "Title": "Colgate-Palmolive India Board Meet Set for Jan 29",
            "Summary": "Colgate-Palmolive (India) Limited has scheduled a board meeting for January 29, 2026, to approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768909448113,
            "Source": "co_actions_results"
        },
        {
            "Title": "Colgate-Palmolive Block Trade Worth ₹208.2 Crores",
            "Summary": "Colgate-Palmolive witnessed a significant block trade on BSE worth ₹208.2 crores involving approximately 1,000,473 shares at ₹2,081 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767690652422,
            "Source": "co_actions_results"
        },
        {
            "Title": "Colgate Palmolive Block Trade Worth ₹61.25 Crores",
            "Summary": "Colgate Palmolive (India) Ltd. witnessed a significant NSE block trade worth ₹61.25 crores involving 292,883 shares at ₹2,091.20 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767606668917,
            "Source": "co_actions_results"
        },
        {
            "Title": "Colgate Palmolive NSE Block Trade Worth ₹22.49 Cr",
            "Summary": "Colgate Palmolive (India) Ltd. witnessed a significant NSE block trade worth ₹22.49 crores involving approximately 107,471 shares at ₹2,093.00 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767596735777,
            "Source": "co_actions_results"
        },
        {
            "Title": "Colgate-Palmolive Receives ₹267.64 Cr Tax Demand",
            "Summary": "Colgate-Palmolive (India) Limited received an assessment order from Income Tax authorities demanding ₹267.64 crores for FY2021-22, primarily due to transfer pricing adjustments and expense disallowances.",
            "Sentiment": "negative",
            "PublishDate": 1766732284568,
            "Source": "stocks"
        },
        {
            "Title": "Colgate-Palmolive India Appoints New Executive VP-Legal and Company Secretary",
            "Summary": "Colgate-Palmolive India's Board approved the appointment of Priyan Pillay as Executive Vice-President-Legal effective January 2, 2026, and Jaikshan Shah as Company Secretary and Compliance Officer effective November 26, 2025. The appointments strengthen the company's senior management and key managerial personnel with experienced professionals having extensive expertise in legal, compliance, and corporate secretarial functions.",
            "Sentiment": "positive",
            "PublishDate": 1764132513546,
            "Source": "corporate_governance"
        },
        {
            "Title": "Colgate-Palmolive Reports Sluggish Urban Demand in India",
            "Summary": "A Colgate-Palmolive executive stated that demand in India is experiencing sluggishness, particularly in urban areas. The company identified this trend as affecting their business operations in the Indian market.",
            "Sentiment": "negative",
            "PublishDate": 1761916207281,
            "Source": "stock"
        },
        {
            "Title": "Colpal Launches First Visible White Purple Serum for Oral Beauty",
            "Summary": "Colpal has introduced a new product called the First Visible White Purple Serum, which is positioned as an innovative offering in the oral beauty segment.",
            "Sentiment": "positive",
            "PublishDate": 1761737021099,
            "Source": "stock"
        },
        {
            "Title": "Colgate-Palmolive India Reports 6.3% Sales Decline in Q2 FY26, Declares Rs 24 Interim Dividend",
            "Summary": "Colgate-Palmolive (India) Limited reported net sales of Rs 1,507 crore for the quarter ended September 30, 2025, down 6.3% compared to Rs 1,609 crore in the same period last year. Net profit after tax declined to Rs 328 crore from Rs 395 crore year-on-year. The company attributed the performance to GST-led disruptions after oral care GST rates were reduced from 18% to 5%, causing transitory disruption at distributors and retailers. Sequential growth was 6.1% compared to the previous quarter. The Board declared a first interim dividend of Rs 24 per equity share for FY 2025-26, totaling Rs 652.8 crore, payable on November 19, 2025. The company appointed Jaikishan Shah as Compliance Officer effective October 28, 2025, following the cessation of Surender Sharma. Management expects gradual recovery in the second half and continues to invest in brand building despite topline headwinds.",
            "Sentiment": "negative",
            "PublishDate": 1761214217091,
            "Source": "earnings"
        },
        {
            "Title": "Colpal Schedules Quarterly Results Review for October 23",
            "Summary": "Colpal has announced it will review its quarterly results on October 23. The company has set this date for the review of its financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1760088202534,
            "Source": "earnings"
        },
        {
            "Title": "Colgate's India Toothpaste Market Share Drops 15 Percentage Points Over Decade",
            "Summary": "Colgate Palmolive's toothpaste market share in India declined from 58% to 43% over a ten-year period. This represents a significant erosion in the company's dominant position in the Indian toothpaste market.",
            "Sentiment": "negative",
            "PublishDate": 1759232540895,
            "Source": "stock"
        },
        {
            "Title": "Colgate-Palmolive India Announces Global Milestone of 2 Billion Children Reached Through Oral Health Program",
            "Summary": "Colgate-Palmolive (India) Limited announced that its Colgate Bright Smiles, Bright Futures program has reached 2 billion children worldwide since its inception in 1991. In India, the program has engaged over 185 million children and families through partnerships with state governments including Uttar Pradesh, Maharashtra, Assam, Bihar, Andhra Pradesh, Kerala and Goa. The initiative provides oral health education, free dental screenings, and treatment access to underserved communities. The company aims to reach over 10 million children and families annually in India through Public-Private-Policy Partnerships, focusing on preventive healthcare and building oral health habits.",
            "Sentiment": "positive",
            "PublishDate": 1758792436295,
            "Source": "stock"
        },
        {
            "Title": "Colpal Partners with Trained Nurses' Association of India to Integrate Oral Health into Primary Healthcare",
            "Summary": "Colpal has formed a partnership with the Trained Nurses' Association of India (TNAI), described as the world's largest nursing community. The collaboration aims to integrate oral health into the primary healthcare framework.",
            "Sentiment": "positive",
            "PublishDate": 1757296054714,
            "Source": "stock"
        },
        {
            "Title": "Colpal Partners with Trained Nurses' Association of India to Integrate Oral Health into Primary Healthcare",
            "Summary": "Colpal has partnered with The Trained Nurses' Association of India (TNAI), described as the world's largest nursing community, to integrate oral health into the primary healthcare framework. The collaboration aims to incorporate oral health services within the broader healthcare system through the nursing community network.",
            "Sentiment": "positive",
            "PublishDate": 1757072277827,
            "Source": "stock"
        },
        {
            "Title": "Colgate Palmolive India Sees Rs. 37.69 Crore Block Trade on NSE",
            "Summary": "Colgate Palmolive (India) Ltd. witnessed a block trade worth Rs. 37.69 crores on the National Stock Exchange. The transaction involved approximately 153,006 shares at a price of Rs. 2,463.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1756957823798,
            "Source": "order&deals"
        },
        {
            "Title": "GST Cut on Toothpaste Expected, Finance Ministry Sources Indicate",
            "Summary": "Finance Ministry sources suggest that a GST reduction on toothpaste is likely. This development could impact Colgate-Palmolive (ColPal) and the broader oral care industry.",
            "Sentiment": "positive",
            "PublishDate": 1756196980717,
            "Source": "stock"
        },
        {
            "Title": "Toothpaste GST Rate Maintained at 18%",
            "Summary": "The GST rate for toothpaste remains unchanged at 18%. This affects ColPal and other companies in the oral care segment.",
            "Sentiment": "neutral",
            "PublishDate": 1756194046010,
            "Source": "stock"
        },
        {
            "Title": "Colgate-Palmolive India Partners with K-Pop Icon IU as Brand Ambassador for Visible White Purple",
            "Summary": "Colgate-Palmolive (India) Limited announced an exclusive partnership with Korean icon IU (Lee Ji-eun) as the brand ambassador for Colgate Visible White Purple toothpaste. This marks the first time a major Korean personality is promoting oral care as part of her beauty regimen to Indian consumers. The campaign launched on August 8th across digital, television, and social media platforms, featuring IU revealing Colgate Visible White Purple as her secret for a dazzling white smile. The product uses purple optic brighteners to color-correct yellow tones for whiter teeth. Gunjit Jain, Executive Vice President of Marketing, highlighted how K-culture has evolved from niche to mainstream in India, spanning K-dramas, K-pop, and K-beauty. The product is available through quick commerce, e-commerce platforms, and major retail outlets.",
            "Sentiment": "positive",
            "PublishDate": 1755180584259,
            "Source": "stock"
        },
        {
            "Title": "Colgate-Palmolive India's Whole-time Director Legal & Company Secretary Surender Sharma Resigns",
            "Summary": "Surender Sharma has resigned from his position as Whole-time Director - Legal & Company Secretary at Colgate-Palmolive (India) Limited. The Nomination & Remuneration Committee noted his decision to explore opportunities outside Colgate. His resignation will be effective at the close of business hours on October 27, 2025, and he will remain with the company until that date to ensure a smooth transition.",
            "Sentiment": "neutral",
            "PublishDate": 1755177317739,
            "Source": "corporate_governance"
        },
        {
            "Title": "MUFG Reduces Stake in Colgate-Palmolive India to 2.98% Through Subsidiary Divestment",
            "Summary": "Mitsubishi UFJ Financial Group (MUFG) has reduced its stake in Colgate-Palmolive (India) Ltd to 2.98% following the sale of multiple subsidiary entities on July 25th, 2025. The transaction involved the divestment of First Sentier Investors (Hong Kong) Limited, First Sentier Investors (Singapore), Mitsubishi UFJ Asset Management Co., Ltd., and Mitsubishi UFJ Trust and Banking Corporation, which directly held shares in the Indian consumer goods company. MUFG's holding decreased from 5.00% (13,603,560 shares) to 2.98% (8,114,309 shares), representing a sale of 5,489,251 shares or 2.02% of the company's total voting capital. The total voting capital of Colgate-Palmolive India remains at 271,985,634 shares. The disclosure was made under SEBI regulations governing substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1753782735224,
            "Source": "corporate_action"
        },
        {
            "Title": "Colgate-Palmolive India Reports Mixed Results with Revenue Decline in Q1 FY26",
            "Summary": "Colgate-Palmolive (India) Limited released its quarterly newsletter for the period ending June 30, 2025. The company reported net sales of Rs. 1,421 crore for the quarter, compared to Rs. 1,486 crore in the same period last year, representing a decline. Net profit after tax for the quarter stood at Rs. 321 crore versus Rs. 364 crore in the previous year. The company acknowledged tough operating conditions but expects gradual recovery in the second half of the year. For the full fiscal year FY25, the company showed stronger performance with topline revenue increasing 6.3% year-on-year, domestic net sales growth of 5.6%, and net profit after tax growing 8.5%. The company declared total interim dividends of Rs. 51 per share for FY25. Key developments include the launch of Colgate Kids Squeezy Toothpaste for children aged 3-6, participation in the Colgate Oral Health Movement Summit in New Delhi attended by Union Health Minister Jagat Prakash Nadda, and the release of their fourth ESG report. The company's Oral Health Movement has screened over 4.5 million people across India, with over 700,000 visiting dentists post-screening.",
            "Sentiment": "neutral",
            "PublishDate": 1753275268651,
            "Source": "corporate_action"
        },
        {
            "Title": "Colgate-Palmolive India Reports 4.4% Decline in Net Sales for First Quarter",
            "Summary": "Colgate-Palmolive (India) Limited reported net sales of Rs. 1,421 crore for the quarter ended June 30, 2025, down 4.4% from Rs. 1,486 crore in the same period last year. Net profit after tax declined to Rs. 321 crore from Rs. 364 crore year-over-year. The company attributed the challenging performance to subdued urban demand, elevated competition intensity, and cycling a high growth base from the previous year. Despite headwinds, the company maintained brand investments and continued premiumization efforts, with its premium portfolio delivering strong revenue growth. The company launched two new product formats during the quarter - Colgate Kids Squeezy Toothpaste and MaxFresh Mouthwash Sachet Stick. Management expects gradual recovery in the second half of the year.",
            "Sentiment": "negative",
            "PublishDate": 1753169724829,
            "Source": "earnings"
        },
        {
            "Title": "Colgate-Palmolive: Goldman Sachs Cuts Target Price After Q4 Revenue Decline",
            "Summary": "Goldman Sachs reduced Colgate-Palmolive's price target to Rs 2,375 from Rs 2,630 following a 1.8% YoY revenue decline in Q4FY25. The brokerage cites weak urban consumption and increased competition as key factors, maintaining a 'sell' rating. Colgate expects challenges to persist in 1HFY26 but anticipates a rebound in 2HFY26, focusing on premiumization strategies.",
            "Sentiment": "negative",
            "PublishDate": 1747973932000,
            "Source": "earnings"
        },
        {
            "Title": "Colgate-Palmolive Expects EBITDA Margins to Remain in Low 30s Range",
            "Summary": "During a conference call, an executive from Colgate-Palmolive stated that the company anticipates its EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) margins to stay in the low 30s range. No specific time frame or additional context was provided in the given information.",
            "Sentiment": "neutral",
            "PublishDate": 1747895140000,
            "Source": "default"
        },
        {
            "Title": "Colgate-Palmolive Reports Slow Demand in Lower-Tier Urban Areas",
            "Summary": "During a conference call, a Colgate-Palmolive executive stated that demand in the bottom 70% of urban areas remains slow. The company expects this trend to persist. No specific timeframe or additional details were provided in the given news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1747894272000,
            "Source": "default"
        },
        {
            "Title": "Colgate-Palmolive India: Q4 Profit and Revenue Miss Estimates, Declares Dividend",
            "Summary": "Colgate-Palmolive India reported a 6.5% YoY decline in Q4 FY25 net profit to ₹355 crore, missing analyst estimates. Revenue fell 1.9% to ₹1,462.5 crore. FY25 net sales grew 6.3% to ₹5,999 crore. The company declared a second interim dividend of ₹27 per share, bringing the total FY25 dividend to ₹51 per share.",
            "Sentiment": "negative",
            "PublishDate": 1747829598000,
            "Source": "earnings"
        },
        {
            "Title": "Colgate-Palmolive Q4 Results: Profit and Revenue Decline, Dividend Announced",
            "Summary": "Colgate-Palmolive reported its quarterly results. The company's Q4 net profit decreased to 3.6 billion rupees from 3.8 billion rupees year-over-year. Revenue declined to 14.5 billion rupees from 14.8 billion rupees in the same period last year. EBITDA fell to 4.98 billion rupees from 5.32 billion rupees, with EBITDA margin dropping to 34.30% from 35.94%. The company has recommended a dividend of 27 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747828617000,
            "Source": "result"
        },
        {
            "Title": "Colgate-Palmolive to Consider Q4 Results on May 21",
            "Summary": "Colgate-Palmolive (COLPAL) has announced that it will consider its fourth quarter (Q4) financial results on May 21. This indicates the company is preparing to release its earnings report for the latest fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746452087000,
            "Source": "default"
        },
        {
            "Title": "Colgate-Palmolive India Reports Q3 Financial Results",
            "Summary": "Colgate-Palmolive India has reported its Q3 financial results. The company's net profit stood at 3.23 billion rupees, slightly down from 3.3 billion rupees year-over-year, and below the estimated 3.37 billion rupees. Revenue for Q3 was 14.52 billion rupees, up from 13.9 billion rupees in the previous year, but fell short of the estimated 14.93 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1738109900000,
            "Source": "earnings"
        },
        {
            "Title": "Colgate-Palmolive Q3 EBITDA and Margin Results",
            "Summary": "Colgate-Palmolive reported Q3 EBITDA of 4.54 billion rupees, down from 4.7 billion rupees year-over-year, falling short of the estimated 4.73 billion rupees. The company's Q3 EBITDA margin decreased to 31.29% from 33.78% in the previous year, slightly below the estimated 31.7%.",
            "Sentiment": "negative",
            "PublishDate": 1738064544000,
            "Source": "earnings"
        },
        {
            "Title": "Colgate-Palmolive India Reports Q3 Revenue Growth",
            "Summary": "Colgate-Palmolive India Limited (COLPAL) has reported a revenue of 14.52 billion rupees for the third quarter, showing year-over-year growth from 13.9 billion rupees. However, this figure falls short of the estimated 14.93 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1738064534000,
            "Source": "earnings"
        },
        {
            "Title": "Colgate-Palmolive India Reports Q3 Net Profit of 3.23 Billion Rupees",
            "Summary": "Colgate-Palmolive India Limited (COLPAL) has reported a net profit of 3.23 billion rupees for the third quarter, slightly lower than the 3.3 billion rupees reported in the same quarter last year. This figure falls short of the estimated 3.37 billion rupees. The company's net profit has also decreased from 3.95 billion rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738064525000,
            "Source": "earnings"
        },
        {
            "Title": "Colgate-Palmolive to Consider Q3 Results",
            "Summary": "Colgate-Palmolive (India) Limited has announced that it will consider its third quarter financial results on January 28.",
            "Sentiment": "neutral",
            "PublishDate": 1737464418000,
            "Source": "result"
        },
        {
            "Title": "Colgate-Palmolive Launches New MaxFresh Range for Enhanced Oral Care Experience",
            "Summary": "Colgate-Palmolive has introduced a new MaxFresh range of oral care products, designed to provide consumers with a sensory experience. This launch represents an expansion of their product line and an effort to innovate in the oral care market.",
            "Sentiment": "positive",
            "PublishDate": 1734937974000,
            "Source": "corporate_action"
        },
        {
            "Title": "Colgate-Palmolive (India) Ltd: Shares Rise on Positive Analyst Outlook",
            "Summary": "Colgate-Palmolive (India) Ltd shares gained over 3% after JPMorgan upgraded it to 'overweight' with a target price of Rs 3,400. Analysts are optimistic about potential earnings growth from new verticals, premium product sales, and marketing initiatives. However, Citi Research maintains a 'sell' rating, citing challenges in changing consumer behavior.",
            "Sentiment": "positive",
            "PublishDate": 1732768158000,
            "Source": "normal_news"
        },
        {
            "Title": "Colgate India: Rs 254.27 Crore Tax Demand to be Appealed",
            "Summary": "Colgate-Palmolive (India) Ltd. plans to appeal a Rs 254.27 crore Income Tax demand for the 2021-22 assessment year. The company will challenge the order before the Income Tax Appellate Tribunal, stating it doesn't impact financial operations. This follows a previous Rs 248.74 crore transfer pricing-related demand in July for FY 2021.",
            "Sentiment": "neutral",
            "PublishDate": 1730217798000,
            "Source": "normal_news"
        },
        {
            "Title": "Colgate-Palmolive India Faces 2.54 Billion Rupee Tax Liability",
            "Summary": "Colgate-Palmolive (India) has announced that it has received a tax liability notice amounting to 2.54 billion rupees (approximately $30.5 million USD). This represents a significant financial obligation for the company and may impact its financial statements.",
            "Sentiment": "negative",
            "PublishDate": 1730214280000,
            "Source": "corporate_action"
        },
        {
            "Title": "Colgate: Q2 Operating Margin Hits Seven-Quarter Low",
            "Summary": "Colgate reported its lowest operating margin in the last seven quarters for Q2, according to Yes Securities.",
            "Sentiment": "negative",
            "PublishDate": 1729827691000,
            "Source": "result"
        },
        {
            "Title": "Colgate-Palmolive Declares Dividend of ₹24 Per Share",
            "Summary": "Colgate-Palmolive (COLPAL) has announced a dividend of 24 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1729753783000,
            "Source": "corporate_action"
        },
        {
            "Title": "Colgate-Palmolive Q2 EBITDA Rises, Margin Declines",
            "Summary": "Colgate-Palmolive reported Q2 EBITDA of 4.97 billion rupees, up from 4.82 billion rupees in the same quarter last year. However, the EBITDA margin decreased to 30.91% from 32.97% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1729753635000,
            "Source": "result"
        },
        {
            "Title": "Colgate-Palmolive Reports Strong Q4 Performance",
            "Summary": "Colgate-Palmolive (COLPAL) has reported its highest ever quarterly revenues, driven by high-single digit volume growth in its toothpaste segment. This performance indicates continued momentum in the company's core business.",
            "Sentiment": "positive",
            "PublishDate": 1729753608000,
            "Source": "result"
        },
        {
            "Title": "Colgate-Palmolive India Reports Q2 Revenue Growth",
            "Summary": "Colgate-Palmolive India Limited (COLPAL) has reported a revenue of 16 billion rupees for the second quarter, compared to 14.62 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729753532000,
            "Source": "result"
        },
        {
            "Title": "Colgate-Palmolive India Reports Q2 Net Profit Increase",
            "Summary": "Colgate-Palmolive India (COLPAL) has reported a net profit of 3.95 billion rupees for the second quarter, up from 3.4 billion rupees in the same period last year. This represents a year-over-year increase in profits. The reported figure is slightly below the estimated 3.96 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1729753494000,
            "Source": "result"
        }
    ]
}