{
    "Symbol": "COMPUSOFT",
    "ISIN": "INE453B01029",
    "News": [
        {
            "Title": "Compucom Software Board Meet on Feb 7 for Q3FY26 Results",
            "Summary": "Compucom Software Limited has scheduled a board meeting on February 7, 2026, to approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769853663920,
            "Source": "co_actions_results"
        },
        {
            "Title": "Compucom Software Launches Hotel Ranavilas Palace",
            "Summary": "Compucom Software Limited has commenced commercial operations of Hotel Ranavilas Palace in Jaipur, expected to support company growth in FY 2025-26.",
            "Sentiment": "positive",
            "PublishDate": 1769595804893,
            "Source": "stocks"
        },
        {
            "Title": "Compucom Software Gets ₹17.43L GST Demand Order",
            "Summary": "Compucom Software Limited received GST demand order of ₹17,43,198.00 from Joint Commissioner, Jaipur for FY 2021-22. Company plans to appeal major portion while depositing remaining amount.",
            "Sentiment": "negative",
            "PublishDate": 1767275891388,
            "Source": "stocks"
        },
        {
            "Title": "Compucom Software Reports Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "Compucom Software Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The board meeting was held on November 12, 2025, at the company's registered office in Jaipur. The company also took on record the Limited Review Report on the unaudited financial results. The trading window for designated persons and their immediate relatives will open from November 15, 2025. The financial results will be published in newspapers and made available on the company's website at https://compucom.co.in/investors/financial-filings/. The results include statements of assets and liabilities as of September 30, 2025, and cash flow statements for the half year period.",
            "Sentiment": "neutral",
            "PublishDate": 1762956351887,
            "Source": "earnings"
        },
        {
            "Title": "Compucom Software Receives Rs 58.03 Lakh Work Order from Rajasthan Government",
            "Summary": "Compucom Software Limited secured a work order worth approximately Rs 58.03 lakhs from RajCOMP Info Services Ltd, a Government of Rajasthan undertaking. The contract involves manpower supply for the operation and maintenance of the Labour Department Management System (LDMS) Project for the Department of Labour, Government of Rajasthan. The project has a duration of 3 months and 15 days, with payment terms requiring bill submission along with required documents. The company has submitted a performance security deposit of Rs 2,90,133 through a bank guarantee. This is a domestic contract received in the normal course of business, with no promoter or group company interest in the awarding entity.",
            "Sentiment": "positive",
            "PublishDate": 1757056939071,
            "Source": "stock"
        },
        {
            "Title": "Compucom Software and Mangalam Drugs Submit Quarterly Financial Results for June 2025",
            "Summary": "Compucom Software Limited submitted copies of newspaper publications containing their unaudited financial results for the quarter ended June 30, 2025, to BSE and NSE exchanges. The Board of Directors approved these results at a meeting held on August 7, 2025. The results were published in Financial Express (English) and Nafa Nuksan (Hindi) newspapers on August 8, 2025, and made available on the company website. Additionally, Mangalam Drugs & Organics Limited released their unaudited standalone and consolidated financial results for the same quarter. For Mangalam Drugs, total income from operations was Rs 5,734.87 lakhs, with a net loss of Rs 1,372.80 lakhs from ordinary activities after tax on a standalone basis. The company's earnings per share was negative at Rs 8.67 for basic and diluted calculations. Both companies fulfilled their regulatory obligations under SEBI listing requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1754640398915,
            "Source": "earnings"
        },
        {
            "Title": "Compucom Software Reports Quarterly Results and Board Changes",
            "Summary": "Compucom Software Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue of Rs 903.01 lakhs and profit of Rs 98.10 lakhs for the quarter. The 31st Annual General Meeting is scheduled for September 27, 2025, via video conferencing, with record date for final dividend set as September 20, 2025. The Board noted completion of Mr. Baldev Singh's second tenure as Independent Director, effective August 23, 2025. Dr. Ashwini Kumar Sharma and Mrs. Sunita Garg were approved for re-appointment as Independent Directors for a second three-year term from May 27, 2026 to May 26, 2029, subject to shareholder approval. The company operates across multiple segments including Software & E-Governance Services, Learning Solutions, Wind Power Generation, and Hotel services.",
            "Sentiment": "neutral",
            "PublishDate": 1754574740432,
            "Source": "corporate_action"
        }
    ]
}