{
    "Symbol": "COMSYN",
    "ISIN": "INE073V01015",
    "News": [
        {
            "Title": "Commercial Syn Bags Q3FY26 Results Show Strong Growth",
            "Summary": "Commercial Syn Bags Limited reported robust Q3FY26 performance with revenue of ₹9699.16 lakhs and net profit of ₹624.81 lakhs, marking significant improvement over previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770300434094,
            "Source": "co_actions_results"
        },
        {
            "Title": "Commercial Syn Bags Gets Credit Rating Reaffirmation",
            "Summary": "ICRA Limited reaffirms Commercial Syn Bags' credit rating for bank facilities worth ₹141.00 crore, maintaining [ICRA]BBB (Stable) rating amid improved financial performance and expansion plans.",
            "Sentiment": "neutral",
            "PublishDate": 1769069186858,
            "Source": "stocks"
        },
        {
            "Title": "Commercial Syn Bags Board Meet on Jan 24 for Expansion",
            "Summary": "Commercial Syn Bags Limited has scheduled a board meeting on January 24, 2026, to consider expansion plans including setting up a new manufacturing unit through its subsidiary and expanding existing capacity at Pithampur facilities.",
            "Sentiment": "positive",
            "PublishDate": 1768993778995,
            "Source": "stocks"
        },
        {
            "Title": "Commercial Syn Bags Reports Mixed Financial Performance for Quarter Ended September 2025",
            "Summary": "Commercial Syn Bags Limited announced its quarterly results for the period ended September 30, 2025. The company's standalone revenue from operations was Rs. 9,743.71 lakhs compared to Rs. 8,943.10 lakhs in the previous quarter. Total income reached Rs. 9,838.75 lakhs versus Rs. 8,999.16 lakhs in the prior quarter. The company reported a profit after tax of Rs. 853.70 lakhs for the quarter, compared to Rs. 505.99 lakhs in the previous quarter. On a consolidated basis, revenue from operations was Rs. 9,845.37 lakhs with profit after tax of Rs. 842.26 lakhs. The company operates in manufacturing and sale of FIBC, bulk bags, poly tarpaulin, woven sacks/bags, and other technical textile products, along with trading of granules and solar power generation. The Board of Directors approved these results in their meeting held on November 7, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762567885618,
            "Source": "earnings"
        },
        {
            "Title": "Commercial Syn Bags Reports Strong Q2 Performance with 64% Profit Growth",
            "Summary": "Commercial Syn Bags delivered robust quarterly results with consolidated net profit rising to 84 million rupees from 36 million rupees year-over-year. Revenue increased to 985 million rupees compared to 867 million rupees in the same period last year. The company's EBITDA grew significantly to 130 million rupees from 79 million rupees, while EBITDA margin expanded to 13.20% from 9.08% year-over-year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1762521403786,
            "Source": "earnings"
        },
        {
            "Title": "Commercial Syn Bags Receives R&D Unit Recognition from Ministry of Science and Technology",
            "Summary": "Commercial Syn Bags Limited announced that its in-house R&D unit named TECHTEX has received recognition and a Certificate of Registration from the Ministry of Science and Technology, Department of Scientific and Industrial Research (DSIR). The recognized unit is located at Plot Nos. A-12 A-13, Indore Special Economic Zone, Pithampur Phase II, Dhar, Madhya Pradesh. The recognition is valid from October 15, 2025 to March 31, 2028. The company stated this recognition will strengthen its focus on research, innovation, and development activities in technical textiles. The registration enables the R&D unit to avail customs duty exemption on purchase of equipment, instruments, spares and consumables used for research and development, subject to relevant government policies.",
            "Sentiment": "positive",
            "PublishDate": 1761851695977,
            "Source": "corporate_action"
        },
        {
            "Title": "Commercial Syn Bags Limited Approves Final Dividend of Rs. 0.40 Per Share for FY 2024-25",
            "Summary": "Commercial Syn Bags Limited shareholders approved a final dividend of Rs. 0.40 per equity share (4%) for the financial year 2024-25 at the 41st Annual General Meeting held on September 29, 2025. The dividend will be paid on 3,99,52,200 equity shares of Rs. 10 each to eligible shareholders whose names appear in the register as of the record date of September 22, 2025. The dividend will be credited to shareholders' registered bank accounts within the prescribed timeframe.",
            "Sentiment": "positive",
            "PublishDate": 1759315634401,
            "Source": "corporate_action"
        },
        {
            "Title": "Commercial Syn Bags Limited Board Approves Re-appointment of Two Directors",
            "Summary": "Commercial Syn Bags Limited's Board of Directors has approved the re-appointment of two key directors, subject to shareholder approval at the upcoming AGM. Shri Virendra Singh Pamecha has been re-appointed as Whole-time Director & KMP for a 3-year term effective March 26, 2026. Pamecha, aged 56, brings over three decades of experience in manufacturing, marketing and administrative functions. Additionally, Shri Vijay Kumar Bansal has been re-appointed as Independent Director for a second 5-year term from February 14, 2026 to February 13, 2031. Bansal, aged 63, holds a Post Graduate Diploma in Management from IIM Ahmedabad and has 37 years of experience in the petrochemical industry with IPCL/RIL. Both directors have confirmed they have not been debarred from holding directorial positions by SEBI or other authorities.",
            "Sentiment": "neutral",
            "PublishDate": 1756972309164,
            "Source": "corporate_governance"
        },
        {
            "Title": "Commercial Syn Bags Limited Announces Rs 0.40 Dividend for FY 2024-25",
            "Summary": "Commercial Syn Bags Limited's Board of Directors has recommended a dividend of Rs 0.40 per equity share (4% on Rs 10 face value) for the financial year 2024-25. The dividend will be paid on 3,99,52,200 equity shares. The record date for determining eligible shareholders is September 22, 2025. The dividend is subject to approval at the company's 41st Annual General Meeting scheduled for September 29, 2025, which will be conducted through video conferencing. Shareholders who wish to relinquish their dividend rights can submit forms available on the company's website to the Company Secretary.",
            "Sentiment": "positive",
            "PublishDate": 1756969398910,
            "Source": "corporate_action"
        },
        {
            "Title": "Commercial Syn Bags Reports 405% Jump in Quarterly Net Profit to ₹506 Lakhs",
            "Summary": "Commercial Syn Bags Limited reported standalone net profit of ₹505.99 lakhs for the quarter ended June 30, 2025, compared to ₹100.18 lakhs in the same period last year. Revenue from operations increased to ₹8,938.03 lakhs from ₹7,511.90 lakhs year-over-year. On a consolidated basis, net profit rose to ₹555.40 lakhs from ₹193.49 lakhs, while consolidated revenue grew to ₹9,051.32 lakhs from ₹7,688.94 lakhs. The company operates in manufacturing of FIBC, bulk bags, woven sacks, technical textiles, trading of granules, and solar power generation. During the quarter, the company acquired an additional 1% stake in Smartlift Bulk Packaging Limited, UK for GBP 43,500, bringing its total holding to 50%. The company's wholly owned subsidiary Comsyn India Private Limited also acquired 100% equity shares of Erawat Vegcap Private Limited for ₹551 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1754651994343,
            "Source": "earnings"
        },
        {
            "Title": "Commercial Syn Bags Subsidiary Revises Share Purchase Agreement with Erawat Pharma",
            "Summary": "A subsidiary of Commercial Syn Bags has executed an addendum to its Share Purchase Agreement (SPA) with Erawat Pharma. The consideration price has been revised to 58 rupees per share, resulting in a new total consideration of 55.1 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1745502452000,
            "Source": "default"
        }
    ]
}