{
    "Symbol": "CONCOR",
    "ISIN": "INE111A01025",
    "News": [
        {
            "Title": "CONCOR schedules investor meetings in February 2026",
            "Summary": "Container Corporation of India announces three investor meetings on February 11 & 18, 2026 with Axis Capital, Nuvama, and Dolat Capital in Mumbai under SEBI disclosure regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770377727118,
            "Source": "stocks"
        },
        {
            "Title": "CONCOR Signs MOU for Bharat Container Shipping Line JV",
            "Summary": "Container Corporation of India and five other entities signed MOU on February 3, 2026 to form joint venture company Bharat Container Shipping Line (BCSL) for comprehensive logistics solutions.",
            "Sentiment": "positive",
            "PublishDate": 1770140737630,
            "Source": "co_actions_results"
        },
        {
            "Title": "CONCOR Set to Finalize Deal for Three Key Ports Today",
            "Summary": "Container Corporation of India (CONCOR) is scheduled to finalize an important deal today involving three key ports, marking a significant development in the company's port operations strategy.",
            "Sentiment": "positive",
            "PublishDate": 1770092211097,
            "Source": "co_actions_results"
        },
        {
            "Title": "CONCOR Makes Post-Results Call Audio Available",
            "Summary": "Container Corporation of India has made the audio recording of its post-results conference call held on January 30, 2026, available for stakeholders in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769769726165,
            "Source": "co_actions_results"
        },
        {
            "Title": "CONCOR Independent Director R.C. Paul Kanagaraj Resigns",
            "Summary": "Container Corporation of India announces resignation of Independent Director Shri R.C. Paul Kanagaraj effective January 30, 2026, citing personal reasons and professional commitments.",
            "Sentiment": "neutral",
            "PublishDate": 1769765977419,
            "Source": "stocks"
        },
        {
            "Title": "CONCOR Maintains Business Guidance Unchanged",
            "Summary": "Container Corporation of India management reaffirms throughput, Exim, and domestic business guidance during recent conference call, indicating stable operational outlook.",
            "Sentiment": "neutral",
            "PublishDate": 1769754448469,
            "Source": "stocks"
        },
        {
            "Title": "CONCOR MD Calls FY27 Company Gamechanger",
            "Summary": "Container Corporation of India's Managing Director has identified FY27 as a pivotal year that will transform the company's trajectory and business operations.",
            "Sentiment": "positive",
            "PublishDate": 1769749332585,
            "Source": "stocks"
        },
        {
            "Title": "CONCOR Q3 FY26 Results: Profit Drops 4.2% to ₹329.12 Cr",
            "Summary": "Container Corporation of India reports Q3 FY26 net profit of ₹329.12 crore, down 4.2% YoY. Revenue grows 4.5% to ₹2,301.72 crore. Board declares 3rd interim dividend of ₹3.40 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1769693203510,
            "Source": "co_actions_results"
        },
        {
            "Title": "Container Corporation shares decline 2.14% on Nifty",
            "Summary": "Container Corporation of India shares fell 2.14% to ₹483.75, ranking among top losers on Nifty Midcap 150. Company reported annual revenue growth to ₹8,887 crores in 2025 with net profit of ₹1,259.70 crores.",
            "Sentiment": "negative",
            "PublishDate": 1769163529204,
            "Source": "stocks"
        },
        {
            "Title": "CONCOR Appoints Ravi Prakash Chaturvedi as Group GM",
            "Summary": "Container Corporation of India announces appointment of Shri Ravi Prakash Chaturvedi as Group General Manager (C&O) with effect from January 7, 2026. The IRTS officer brings 27 years of railway experience.",
            "Sentiment": "neutral",
            "PublishDate": 1768824684574,
            "Source": "stocks"
        },
        {
            "Title": "CONCOR Q3FY26 Earnings Call on January 30, 2026",
            "Summary": "Container Corporation of India announces post-result conference call for Q3 FY2025-26 earnings scheduled for January 30, 2026 at 11:30 AM IST with multiple access numbers for investors.",
            "Sentiment": "neutral",
            "PublishDate": 1768824046993,
            "Source": "co_actions_results"
        },
        {
            "Title": "CONCOR Reports 10.78% Growth in Q3 FY26 Volumes",
            "Summary": "Container Corporation of India disclosed strong operational performance with total throughput reaching 14.23 lakh TEUs in Q3 FY26, marking 10.78% quarter-on-quarter growth driven by both EXIM and domestic segments.",
            "Sentiment": "positive",
            "PublishDate": 1768198553967,
            "Source": "stocks"
        },
        {
            "Title": "CONCOR to announce Q3 results on January 29",
            "Summary": "Container Corporation of India has scheduled its third quarter financial results announcement for January 29, 2025, as the logistics major prepares to unveil its quarterly performance.",
            "Sentiment": "neutral",
            "PublishDate": 1768198331671,
            "Source": "co_actions_results"
        },
        {
            "Title": "Container Corp Down 20% But Shows Bottoming Signs",
            "Summary": "Container Corporation of India trades near six-year support levels at ₹520.00, down from ₹652.00 highs. Experts suggest potential bounce to ₹575.00 for high-risk traders.",
            "Sentiment": "neutral",
            "PublishDate": 1767008258397,
            "Source": "stocks"
        },
        {
            "Title": "CONCOR Faces ₹2.54 Cr GST Demand from Ahmedabad Tax Authority",
            "Summary": "Container Corporation of India receives GST demand order for FY2021-22 totaling ₹2.54 crores including penalty and interest. Company disputes excess input tax credit allegations and plans appeal.",
            "Sentiment": "negative",
            "PublishDate": 1766388423694,
            "Source": "stocks"
        },
        {
            "Title": "CONCOR Promotes Two Officials to Senior Management",
            "Summary": "Container Corporation of India promotes Smt. Suhani Mishra and Shri Monu Luthra to Group General Manager positions, both IRTS officers with 17+ years railway experience.",
            "Sentiment": "positive",
            "PublishDate": 1766147403667,
            "Source": "stocks"
        },
        {
            "Title": "CONCOR Announces Senior Management Changes and Director Finance Extension",
            "Summary": "Container Corporation of India announced the superannuation of two senior executives - Kamal Jain (PED Shipping New Initiatives) and K. Srinivasan (GGM CO/Area-III) effective November 30, 2025. The Railway Board also approved a one-year extension for Anurag Kapil's additional charge as Director (Finance) from October 23, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764152515854,
            "Source": "corporate_governance"
        },
        {
            "Title": "Rail Ministry Develops New Freight Policy for Automobiles and Steel Sectors",
            "Summary": "The Rail Ministry is developing a new freight policy for automobiles and steel sectors, modeled after the existing cement policy framework. This policy development could impact Container Corporation of India (Concor) and freight operations in these industrial sectors.",
            "Sentiment": "neutral",
            "PublishDate": 1763973329092,
            "Source": "sectoral"
        },
        {
            "Title": "CONCOR Reports Record Q2 Performance with Highest Ever Throughput and PAT, Declares INR 2.60 Dividend",
            "Summary": "Container Corporation of India achieved record quarterly throughput of 1.44 million TEUs and highest ever operating income and PAT in Q2, with Board approving INR 2.60 dividend taking total yearly dividend to INR 4.20. The company reported 11% throughput growth in first half of FY26 with improved rail freight margins from 26.17% to 27.80%, while signing strategic MOUs with UltraTech and Adani Cement for bulk cement movement and expanding into shipping operations with 30%+ margins.",
            "Sentiment": "positive",
            "PublishDate": 1763551376594,
            "Source": "earnings"
        },
        {
            "Title": "CONCOR Launches New Tank Containers for Bulk Cement Multi-Modal Transport",
            "Summary": "CONCOR has unveiled new tank containers specifically designed for bulk cement transportation that are suitable for multi-modal transport operations. Railway Minister Ashwini Vaishnaw announced this development, which could enhance the company's logistics capabilities in the cement sector.",
            "Sentiment": "positive",
            "PublishDate": 1763455960535,
            "Source": "stock"
        },
        {
            "Title": "Railway Ministry Plans New Policy for Cement Terminals on Unused Railway Land",
            "Summary": "The Railway Ministry is set to introduce a new policy that will allow the construction of cement terminals on unused railway land. This development could impact Container Corp and the broader logistics sector by potentially expanding infrastructure for cement transportation.",
            "Sentiment": "positive",
            "PublishDate": 1763444953360,
            "Source": "stock"
        },
        {
            "Title": "CONCOR Expects Stronger Second Half Performance, Maintains 20% Domestic Volume Growth Target",
            "Summary": "CONCOR anticipates improved performance in the second half compared to the first half. The company has maintained its domestic volume growth target of 20% for FY26. CONCOR reported a decrease in its total market share and stated it will avoid low-margin business going forward.",
            "Sentiment": "neutral",
            "PublishDate": 1762929400570,
            "Source": "stock"
        },
        {
            "Title": "Container Corporation of India Block Trade Worth Rs. 53.57 Crores on NSE",
            "Summary": "Container Corporation of India executed a block trade on the National Stock Exchange involving approximately 1,015,609 shares at Rs. 527.45 per share, totaling Rs. 53.57 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1762922698456,
            "Source": "order&deals"
        },
        {
            "Title": "CONCOR Reports Quarterly Results and Declares Second Interim Dividend of Rs 2.60 Per Share",
            "Summary": "Container Corporation of India Limited (CONCOR) announced its quarterly results for the period ended September 30, 2025. The company's Board of Directors declared a second interim dividend of 52% (Rs 2.60 per equity share of face value Rs 5) amounting to Rs 198.02 crores for FY 2025-26. The record date for dividend payment is November 20, 2025, with payment scheduled on or after November 27, 2025. The company reported segment-wise revenue with EXIM contributing Rs 423.88 crores and domestic operations generating Rs 961.62 crores for the quarter. CONCOR made a payment of Rs 216.49 crores as Land License Fee to Indian Railways based on the Master Circular dated October 4, 2022. The company also revised the useful life of LNG Trucks and Trailers from 8 years to 15 years, resulting in reduced depreciation expenses. The results include consolidated figures covering subsidiaries like Fresh and Healthy Enterprises Limited, CONCOR Air Limited, and various joint venture entities.",
            "Sentiment": "positive",
            "PublishDate": 1762898576275,
            "Source": "earnings"
        },
        {
            "Title": "Container Corporation of India Reports Q2 Net Profit Growth, Declares Interim Dividend",
            "Summary": "Container Corporation of India reported Q2 consolidated net profit of 3.79 billion rupees, up from 3.65 billion rupees year-over-year. Revenue increased to 23.54 billion rupees from 22.88 billion rupees in the same period last year. However, EBITDA declined to 5.76 billion rupees from 5.82 billion rupees year-over-year, with EBITDA margin dropping to 24.45% from 25.44%. The company recommended an interim dividend of 2.6 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1762865982248,
            "Source": "corporate_action"
        },
        {
            "Title": "Container Corporation of India Awards Three Major Orders Worth Rs 461.55 Crores",
            "Summary": "Container Corporation of India Ltd has placed three significant orders totaling Rs 461.55 crores (excluding GST). The company awarded M/s Touax Taxmaco Railcar Leasing Pvt. Ltd. an order worth Rs 157.92 crores for supply of 8 rakes of BLSS wagons with brake van on 10-year operating lease, to be completed in 255 days. M/s TIL Ltd received an order valued at Rs 66.75 crores for design, manufacture, supply and commissioning of 25 loaded reach stackers, with completion required in 330 days. The largest order went to M/s GATX India Pvt. Ltd. worth Rs 236.88 crores for supply of 12 rakes of BLSS wagons with brake van on 10-year operating lease, to be delivered in 315 days. All three orders were awarded to domestic entities and do not involve any promoter group interests or related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1762513980371,
            "Source": "order&deals"
        },
        {
            "Title": "Concor Signs MoU with Jawaharlal Nehru Port Authority for Vadhvan Port Rail Operations",
            "Summary": "Concor has signed a memorandum of understanding with Jawaharlal Nehru Port Authority to develop and manage common rail handling operations at the upcoming Vadhvan Port. The project involves an investment of ₹500 crore. This partnership will enable Concor to handle rail operations at the new port facility.",
            "Sentiment": "positive",
            "PublishDate": 1761737006142,
            "Source": "order&deals"
        },
        {
            "Title": "CONCOR Appoints Rakesh Kumar Rousan as Part-Time Government Director",
            "Summary": "Container Corporation of India Limited (CONCOR) appointed Shri Rakesh Kumar Rousan as Part-Time Government Director effective October 22, 2025, following approval from the Ministry of Railways. Rousan, who holds DIN 11350227, serves as Executive Director (Business Development) at Railway Board and is a senior Indian Railway Traffic Service officer with over two decades of railway sector experience. His appointment continues until he holds his Railway Board position or receives further orders. The company confirmed he is not debarred from directorship and has no relationships with other company directors. CONCOR's board now includes 10 directors comprising executive directors, part-time government directors, and part-time non-official directors.",
            "Sentiment": "neutral",
            "PublishDate": 1761656035049,
            "Source": "corporate_governance"
        },
        {
            "Title": "CONCOR Signs Strategic MOUs with Adani Cement for Rail-Based Bulk Cement Transportation",
            "Summary": "Container Corporation of India Limited (CONCOR) signed two strategic MOUs with Adani Cement on October 24, 2025, for rail-based transportation of bulk cement using specialized tank containers. CONCOR will deploy dedicated container rakes to facilitate cement movement across key rail corridors, leveraging Indian Railways' network for multimodal logistics. The partnership aims to shift transportation from road to rail, targeting reduced carbon emissions, lower transportation costs, decreased road congestion, and enhanced supply chain efficiency. The MOUs were signed in New Delhi with CONCOR's Chairman & Managing Director Sanjay Swarup and Adani Cement's CEO Vinod Bahety present. The initiative supports India's net-zero goals and the National Logistics Policy's emphasis on green freight, while setting a benchmark for bulk logistics in other industrial sectors.",
            "Sentiment": "positive",
            "PublishDate": 1761319908494,
            "Source": "order&deals"
        },
        {
            "Title": "Container Corporation of India Schedules Q2 FY26 Earnings Conference Call",
            "Summary": "Container Corporation of India Ltd. (CONCOR) has announced that its Q2 FY 2025-26 post-result conference call will be held on November 12, 2025 at 11:30 hrs IST. The company has notified both the Bombay Stock Exchange and National Stock Exchange of India about the earnings call. Conference call details and access numbers for domestic and international participants have been provided, with the full notice available on the company's investor relations webpage.",
            "Sentiment": "neutral",
            "PublishDate": 1761308813999,
            "Source": "earnings"
        },
        {
            "Title": "CONCOR Extends Anurag Kapil's Additional Charge as Director (Finance) Beyond October 2025",
            "Summary": "The Ministry of Railways has extended Shri Anurag Kapil's additional charge as Director (Finance) of Container Corporation of India Ltd. (CONCOR) beyond October 22, 2025, until further orders. Kapil, who serves as Executive Director/Finance(X) at Railway Board, assumed the additional charge on October 23, 2024. The extension is pending approval from the Competent Authority. CONCOR informed stock exchanges BSE and NSE about this development through a regulatory communication dated October 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761129409629,
            "Source": "corporate_governance"
        },
        {
            "Title": "CONCOR Appoints Rakesh Kumar Rousan as Part-time Government Director",
            "Summary": "Container Corporation of India Limited (CONCOR) announced the appointment of Shri Rakesh Kumar Rousan as Part-time Government Director on its Board. The appointment was made by the Ministry of Railways and is effective immediately. Rousan will serve in this position until he holds the post of Executive Director (BD), Railway Board or until further orders, whichever comes earlier. CONCOR is completing the required procedures under the Companies Act 2013 and will file necessary disclosures with stock exchanges within the stipulated time.",
            "Sentiment": "neutral",
            "PublishDate": 1760691176515,
            "Source": "corporate_governance"
        },
        {
            "Title": "CONCOR Reports 10.54% Year-Over-Year Growth in Total Throughput",
            "Summary": "CONCOR achieved a 10.54% year-over-year increase in total throughput for the quarter ending September 25. This growth indicates improved operational performance in the company's logistics and container handling business.",
            "Sentiment": "positive",
            "PublishDate": 1759925163023,
            "Source": "stock"
        },
        {
            "Title": "CONCOR Partners with UltraTech Cement for Dedicated Railway Transport Services",
            "Summary": "Container Corporation of India (CONCOR) has entered into an agreement with UltraTech Cement to provide dedicated railway rakes for cement transportation. This partnership will involve CONCOR supplying specialized rail transport services to facilitate UltraTech's cement logistics operations.",
            "Sentiment": "positive",
            "PublishDate": 1759843269280,
            "Source": "order&deals"
        },
        {
            "Title": "Container Corporation of India Sees Rs. 25.28 Crore Block Trade on NSE",
            "Summary": "Container Corporation of India Ltd. witnessed a block trade worth Rs. 25.28 crores on the National Stock Exchange. The transaction involved approximately 482,009 shares traded at a price of Rs. 524.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1759129493677,
            "Source": "order&deals"
        },
        {
            "Title": "CONCOR Promotes Anita Barik to Group General Manager Position",
            "Summary": "Container Corporation of India Ltd. (CONCOR) announced the promotion of Smt. Anita Barik to the position of Group General Manager (C&O), joining the company's senior management team effective September 2, 2025. Barik is an IRTS officer from the 2007 batch who previously worked as Deputy CVO(T) at South Central Railway. She holds an MPhil in Sociology from JNU and serves as Cluster Head of the Hyderabad cluster at CONCOR.",
            "Sentiment": "positive",
            "PublishDate": 1757337052015,
            "Source": "corporate_governance"
        },
        {
            "Title": "CONCOR Signs MoU with BPIPL to Operate Container Terminal at Bhavnagar Port",
            "Summary": "Container Corporation of India Ltd. (CONCOR) signed a Memorandum of Understanding with Bhavnagar Port Infrastructure Private Limited (BPIPL) on September 4, 2025, to operate and maintain the upcoming Container Terminal at the northside of Bhavnagar Port in Gujarat. BPIPL has already executed an agreement with the Gujarat Maritime Board in September 2024 for port infrastructure development, with 235 hectares of land allotted on a 30-year lease and provision for additional 250 hectares expansion. Under the MoU terms, CONCOR will serve as the Container Terminal Operator, responsible for operation, management, and marketing of the container terminal. The port facility is expected to serve the logistics needs of Central Gujarat, the Dholera Industrial Belt, and customers in the National Capital Region. CONCOR's CMD Sanjay Swarup noted that this collaboration represents a strategic move toward forward integration and is expected to provide substantial value addition to customers while strengthening CONCOR's leadership in the logistics sector.",
            "Sentiment": "positive",
            "PublishDate": 1756990790310,
            "Source": "order&deals"
        },
        {
            "Title": "CONCOR Reports Record Q1 Throughput of 1.29 Million TEUs, Declares INR 1.60 Dividend",
            "Summary": "Container Corporation of India achieved all-time high quarterly throughput of 1.29 million TEUs with 11.3% growth, comprising 12% EXIM growth and 9% domestic growth. The company declared a dividend of INR 1.60 per share. Rail freight margin improved to 26.96% from 24.36%, while operating margin increased to 29.81% from 28.58%. Operating income grew 2.5% and PAT increased 1%. The company gained 200 basis points market share at JNPT to 58.39% but lost 200 basis points at Mundra to 36%. Double stack rakes increased 11.2% to 1,505 rakes. Management cited volume discount reconciliation and one-time employee award of INR 18 crores as factors affecting results. Domestic segment saw subdued performance due to tank container supply delays from Braithwaite and conscious avoidance of low-margin traffic. The company launched bulk cement transportation in tank containers and signed MOU with RHS Group Dubai for end-to-end logistics services. Management maintained volume growth guidance of 13% with EXIM at 10% and domestic at 20%. WDFC connection to JNPT expected by December 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754906832365,
            "Source": "earnings"
        },
        {
            "Title": "Container Corp Expands Into Liquid Cargo Transport, Maintains Growth Guidance at 13%",
            "Summary": "Container Corp is expanding into liquid cargo transport using tank containers for products like caustic soda and benzene. The company maintains its capex budget guidance of INR 860 crores for the financial year, with plans to review after Q2. Container Corp has ordered 5,500 tank containers from Braithwaite and 500 from the open market, with deliveries expected in the coming months. The company maintains its 2028 targets of 100 terminals, 500+ rakes, and over 70,000 containers. Overall growth guidance remains at 13%, with Exim at 10% and domestic at 20%.",
            "Sentiment": "positive",
            "PublishDate": 1754538065523,
            "Source": "stock"
        },
        {
            "Title": "CONCOR Reports Lower Demand in April-June Quarter",
            "Summary": "CONCOR reported experiencing lower demand during the April to June period. The information was shared during a conference call update with stakeholders.",
            "Sentiment": "negative",
            "PublishDate": 1754460727025,
            "Source": "earnings"
        },
        {
            "Title": "CONCOR Reports Q1 FY2026 Results, Declares Rs 1.60 Interim Dividend and Appoints New Secretarial Auditors",
            "Summary": "Container Corporation of India Limited (CONCOR) announced its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 2,149.53 crore compared to Rs 2,097.07 crore in the same quarter last year. Profit after tax increased to Rs 257.71 crore from Rs 255.35 crore year-on-year. The Board declared an interim dividend of Rs 1.60 per equity share (32% on face value of Rs 5), amounting to Rs 121.86 crore, with record date of August 13, 2025 and payment on or after August 24, 2025. The company also appointed M/s Amit Agrawal & Associates as Secretarial Auditors for five years from FY 2025-26 to 2029-30, subject to shareholder approval. CONCOR reassessed the useful life of LNG Trucks & Trailers from 8 years to 15 years, resulting in reduced depreciation expense of Rs 1.54 crore for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754400586839,
            "Source": "corporate_action"
        },
        {
            "Title": "CONCOR Reports Mixed Q1 Results with Higher Revenue but Lower EBITDA",
            "Summary": "CONCOR reported Q1 consolidated net profit of 2.67 billion rupees compared to 2.58 billion rupees in the same period last year. Revenue increased to 21.54 billion rupees from 21 billion rupees year-over-year. However, EBITDA declined to 4.33 billion rupees from 4.41 billion rupees, while EBITDA margin compressed to 20.09% from 21% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754399587055,
            "Source": "earnings"
        },
        {
            "Title": "CONCOR Appoints Smt. Namita Devi as Non-Official Part-Time Director",
            "Summary": "Container Corporation of India Limited (CONCOR) appointed Smt. Namita Devi alias Smt. Lovely Gupta as Non-official Part-Time Director effective July 7, 2025, for a period of one year or until further orders. The appointment was made following an order from the Ministry of Railways dated July 7, 2025, with the President's approval. Smt. Namita Devi holds a PhD and Post Graduate degree in Sociology and has expertise in Public Administration, Public Service with focus on Women and Children, and Management. She previously served as Independent Director at Andrew Yule & Company Limited for three years. The appointee confirmed she is not debarred from holding directorship and has no relationship with other directors of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1753191287929,
            "Source": "corporate_governance"
        },
        {
            "Title": "CONCOR Schedules Board Meeting on August 5, 2025 for Quarterly Results and Potential Interim Dividend",
            "Summary": "Container Corporation of India Ltd. (CONCOR) has scheduled a Board of Directors meeting on August 5, 2025 to consider approval of unaudited financial results for the quarter ended June 30, 2025. The board may also consider declaration of interim dividend for 2025-26 to shareholders. The trading window for company shares is closed from July 1, 2025 until 48 hours after the financial results are declared for all designated persons and their immediate relatives.",
            "Sentiment": "neutral",
            "PublishDate": 1753158456682,
            "Source": "corporate_action"
        },
        {
            "Title": "ITAT Dismisses Tax Application Against Container Corporation of India",
            "Summary": "The Income Tax Appellate Tribunal (ITAT) has dismissed a tax application against Container Corporation of India. The case involves a sum of 965.9 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1752843888000,
            "Source": "default"
        },
        {
            "Title": "CONCOR Signs Agreement with Rais Hassan Saadi Group for International Logistics Opportunities",
            "Summary": "CONCOR (Container Corporation of India) has entered into an agreement with Rais Hassan Saadi Group in Dubai. The partnership aims to explore joint opportunities in international shipping and logistics sectors. This collaboration suggests a strategic move by CONCOR to expand its presence in global logistics operations.",
            "Sentiment": "positive",
            "PublishDate": 1752563791000,
            "Source": "default"
        },
        {
            "Title": "Container Corporation of India: Q1 Volumes Rise 11%, Bonus Issue Record Date Set",
            "Summary": "CONCOR reported 11.3% YoY growth in total volumes for Q1 FY2025-26, with domestic volumes up 9% and EXIM volumes up 12%. The company set July 4 as the record date for its 1:4 bonus issue.",
            "Sentiment": "positive",
            "PublishDate": 1751966299000,
            "Source": "result"
        },
        {
            "Title": "Container Corp Reports 11.29% Year-Over-Year Throughput Growth",
            "Summary": "Container Corp has reported a total throughput growth of 11.29% compared to the same period last year. The company's performance indicates positive momentum in its operations, specifically in handling and transporting containers.",
            "Sentiment": "positive",
            "PublishDate": 1751960689000,
            "Source": "default"
        },
        {
            "Title": "Container Corporation of India: Shares Trade Ex-Bonus, Down 23% YTD",
            "Summary": "CONCOR shares are trading ex-bonus for a 1:4 bonus issue with July 4 as the record date. The stock is up 0.69% at ₹600.45 but has declined 23% year-to-date. CONCOR missed its FY23 volume growth guidance, reporting 8% growth against the projected 18-20%.",
            "Sentiment": "neutral",
            "PublishDate": 1751603895000,
            "Source": "corporate_action"
        },
        {
            "Title": "Container Corporation of India: Last Day to Buy Shares for Bonus Issue",
            "Summary": "Today is the final day for investors to purchase Container Corp. of India shares to qualify for the upcoming bonus issue. The record date is set for July 4, 2025, with a 1:4 bonus ratio. The new shares will be allotted on July 7 and available for trading on July 8.",
            "Sentiment": "positive",
            "PublishDate": 1751521248000,
            "Source": "corporate_action"
        }
    ]
}