{
    "Symbol": "CONCORDBIO",
    "ISIN": "INE338H01029",
    "News": [
        {
            "Title": "Concord Biotech clarifies on trading volume spike",
            "Summary": "Concord Biotech responds to BSE inquiry about increased trading volume, confirming compliance with disclosure norms and stating no undisclosed price-sensitive information pending announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1770789708573,
            "Source": "stocks"
        },
        {
            "Title": "Concord Biotech Company Secretary Resigns",
            "Summary": "Hina Patel, Company Secretary and Compliance Officer at Concord Biotech Limited, has tendered her resignation to pursue opportunities outside the organization, effective January 21, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766578382939,
            "Source": "stocks"
        },
        {
            "Title": "Concord Biotech CFO Lalit Sethi Announces Early Retirement Due to Personal Reasons",
            "Summary": "Concord Biotech Limited's Chief Financial Officer Mr. Lalit Sethi has submitted his intention to retire early due to personal reasons including family commitments and health considerations as he approaches age 59, effective close of business hours on January 5, 2026. The company has closed its trading window from December 8, 2025 for 48 hours following the announcement, with Sethi committing to ensure seamless transition of financial statements, compliance documentation, and investor relations materials.",
            "Sentiment": "neutral",
            "PublishDate": 1765182375901,
            "Source": "corporate_governance"
        },
        {
            "Title": "Concord Biotech Reports 20% Revenue Decline in Q2 FY26 Due to Regulatory Delays and Market Disruptions",
            "Summary": "Concord Biotech's Q2 FY26 revenues dropped to Rs. 247 crores from Rs. 310 crores year-on-year, primarily due to CDSCO written confirmation delays affecting EU sales, deferred Middle East government tender, and US procurement pattern shifts from tariff uncertainties. The company expects stronger H2 performance as regulatory approvals are now received and delayed shipments resume, with EBITDA margins at 41% excluding injectable facility startup costs.",
            "Sentiment": "neutral",
            "PublishDate": 1763528308280,
            "Source": "earnings"
        },
        {
            "Title": "Concord Biotech Expects Stronger H2 FY26 Performance, Eyes 25% CAGR Growth",
            "Summary": "Concord Biotech management anticipates stronger performance in H2 FY26 compared to H2 FY25, with better clarity expected in Q4, while the injectable facility could potentially generate INR 400-600 crores revenue from a total addressable market of INR 3,000-4,000 crores. The company believes it has capabilities to achieve 25% CAGR based on its facilities, product mix, and new facilities that weren't previously contributing, though no formal guidance has been provided.",
            "Sentiment": "positive",
            "PublishDate": 1763218277754,
            "Source": "stock"
        },
        {
            "Title": "Concord Biotech Reports Decline in Q2 Financial Performance",
            "Summary": "Concord Biotech reported Q2 net profit of 629 million rupees compared to 987 million rupees year-over-year, with revenue declining to 2.47 billion rupees from 3.1 billion rupees. The company's EBITDA dropped to 905.4 million rupees from 1.36 billion rupees, while EBITDA margin compressed to 36.65% from 44.06% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1763074581536,
            "Source": "earnings"
        },
        {
            "Title": "Concord Biotech Successfully Completes NAFDAC Inspection at Valthera Facility",
            "Summary": "Concord Biotech completed a successful NAFDAC inspection at its Oral Solid Dosage Unit-2 facility in Valthera on October 6-7, 2025. The inspection was conducted by Nigeria's National Agency for Food and Drug Administration and Control (NAFDAC).",
            "Sentiment": "positive",
            "PublishDate": 1759901920784,
            "Source": "stock"
        },
        {
            "Title": "Concord Biotech Completes EU GMP Inspection at Limbassi API Facility",
            "Summary": "Concord Biotech announced the completion of an EU GMP (Good Manufacturing Practice) inspection at its API (Active Pharmaceutical Ingredient) facility located in Limbassi. The inspection process has been concluded at this manufacturing site.",
            "Sentiment": "positive",
            "PublishDate": 1755766159801,
            "Source": "stock"
        },
        {
            "Title": "Concord Biotech Reports 5% Revenue Decline in Q1 FY26 Due to Customer Procurement Lumpiness",
            "Summary": "Concord Biotech Limited reported quarterly revenues of INR 204 crores compared to INR 216 crores in the same period last year, representing a 5% decline. The API business segment saw a 10% decline to INR 153.8 crores, while formulation business grew 12% to INR 50.2 crores. EBITDA dropped to INR 61 crores from INR 81 crores, with margins at 30.1% versus 37.7% previously. The company attributed the revenue decline primarily to customer procurement pattern lumpiness, noting that the preceding quarter had exceptionally high sales. EBITDA margins were impacted by commercialization costs of approximately INR 12-13 crores from the new injectable facility in Valthera. Excluding these costs, EBITDA margins stood at approximately 37%, consistent with the same quarter last year. The company received US FDA approval for teriflunomide tablets and successfully passed multiple regulatory inspections including US FDA, European GMP, and Russian GMP. Concord incorporated two new subsidiaries: Stellon Biotech Inc. for US market operations and Concord Lifegen Limited for domestic marketing. The company initiated CDMO business sales to the US market and launched two products from its injectable facility in the domestic market. Management expects the injectable facility costs to normalize as revenues scale up through FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1755521875862,
            "Source": "earnings"
        },
        {
            "Title": "Concord Biotech Reports Q1FY26 Results with 5% Revenue Decline and CDMO Business Launch",
            "Summary": "Concord Biotech Limited published its Q1FY26 financial results showing revenue of Rs 204 crores, down 5% from Rs 216 crores in Q1FY25, attributed to lumpiness in customer procurement patterns. EBITDA declined 24% to Rs 61 crores with margins at 30.1% compared to 37.7% in the previous year, impacted by expenses related to commercialization of new injectable facility at Valthera. PAT decreased 26% to Rs 44 crores. The company commenced commercial supply of CDMO services to a US customer in Q2FY26 and successfully completed regulatory inspections by USFDA, EU GMP, and Russian GMP at its Dholka facility. Concord acquired 75% stake in US-based Stellon Biotech and incorporated wholly-owned subsidiary Concord Lifegen Limited for domestic market operations. The company maintains optimism for FY26 growth trajectory despite quarterly volatility.",
            "Sentiment": "neutral",
            "PublishDate": 1755025489071,
            "Source": "earnings"
        },
        {
            "Title": "Concord Biotech Targets 25% Annual Growth Despite Withholding Specific FY26 Guidance",
            "Summary": "Concord Biotech has not provided specific guidance for FY26 but expects performance to align with historical trends. The company outlined key factors supporting its target of 25% yearly growth: a historical growth rate of 18% per year, potential 6-7% growth from CDMO operations representing a $40-50 million opportunity, and expected 5% growth from its injectable facility.",
            "Sentiment": "positive",
            "PublishDate": 1754969098547,
            "Source": "stock"
        },
        {
            "Title": "Concord Biotech Reports Mixed Q1 Results with 5% Revenue Decline, Expands US Operations",
            "Summary": "Concord Biotech Limited reported revenue of Rs 204 crores, down 5% year-on-year, attributed to lumpiness in customer procurement patterns. EBITDA fell 24% to Rs 61 crores and PAT decreased 26% to Rs 44 crores, impacted by expenses related to new injectable facility commercialization. However, gross margins improved slightly to 77.9%. The company achieved several operational milestones including successful completion of USFDA, EU GMP, and Russian GMP inspections at its Dholka facility, commencement of commercial CDMO supplies to a US customer, acquisition of 75% stake in US-based Stellon Biotech, and incorporation of wholly-owned subsidiary Concord Lifegen Limited for domestic marketing. Management remains optimistic about growth prospects driven by geographical expansion, new product launches, and CDMO opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1754811135152,
            "Source": "earnings"
        },
        {
            "Title": "Concord Biotech Reports Strong Q1 FY2026 Results with 24% Revenue Growth",
            "Summary": "Concord Biotech Limited reported strong financial performance for Q1 FY2026. Income from operations increased to Rs. 24,907.45 lakhs from Rs. 20,100.62 lakhs in Q1 FY2025. Net profit after tax rose to Rs. 3,234.79 lakhs compared to Rs. 2,558.62 lakhs in the previous year. Earnings per share improved to Rs. 2.54 from Rs. 2.02. Total comprehensive income grew significantly to Rs. 4,662.61 lakhs from Rs. 2,652.25 lakhs. The company's equity share capital increased to Rs. 1,274.83 lakhs from Rs. 1,011.58 lakhs. The results were approved by the Board of Directors on August 8, 2025, and published in Financial Express newspapers on August 9, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754802307903,
            "Source": "earnings"
        },
        {
            "Title": "Concord Biotech Reports Q1 Results and Declares Rs. 10.70 Dividend Per Share",
            "Summary": "Concord Biotech Limited announced its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs. 20,398.76 lakhs compared to Rs. 21,580.17 lakhs in the same quarter last year. Profit after tax stood at Rs. 4,256.55 lakhs versus Rs. 5,823.86 lakhs in the previous year quarter. Earnings per share was Rs. 4.07 compared to Rs. 5.57 in the corresponding quarter. The board approved a dividend of Rs. 10.70 per equity share with September 3, 2025 set as the record date. The company also made an equity investment of USD 1,500 in Stellon Biotech Inc., USA, acquiring a 75% ownership stake through subscription of 15 million equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1754653164674,
            "Source": "earnings"
        },
        {
            "Title": "Concord Biotech Completes Russian GMP Inspection at Gujarat API Manufacturing Facility",
            "Summary": "Concord Biotech Limited announced the successful completion of a Russian GMP (Good Manufacturing Practice) inspection at their Active Pharmaceutical Ingredient (API) manufacturing facility in Dholka, Gujarat. The inspection was conducted from July 22 to July 25, 2025. The company stated this achievement demonstrates their commitment to maintaining quality, safety, and regulatory compliance standards and reflects their focus on meeting global regulatory authority requirements.",
            "Sentiment": "positive",
            "PublishDate": 1753504275702,
            "Source": "stock"
        },
        {
            "Title": "Concord Biotech Establishes Fully Owned Subsidiary Concord Lifegen Limited",
            "Summary": "Concord Biotech has created a new fully owned subsidiary named Concord Lifegen Limited. The subsidiary is established to enhance the company's pharmaceutical marketing and distribution capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1753193263184,
            "Source": "stock"
        },
        {
            "Title": "Concord Biotech Incorporates Wholly Owned Subsidiary Concord Lifegen for Pharmaceutical Sales and Distribution",
            "Summary": "Concord Biotech Limited has incorporated a wholly owned subsidiary named Concord Lifegen Limited to manage marketing, sales, and distribution of pharmaceutical products. The subsidiary was incorporated on July 21, 2025, with an authorized and issued share capital of Rs. 1,00,000 divided into 10,000 equity shares of Rs. 10 each. Concord Biotech acquired 100% shareholding for a cash consideration of Rs. 1,00,000. The subsidiary operates in the biopharmaceutical industry and aims to enhance commercial efficiency, ensure regulatory compliance across domestic and international markets, and strengthen customer engagement. Concord Lifegen has not yet commenced business operations and has no turnover history. The equity shares will be allotted within 90 days from the investment.",
            "Sentiment": "positive",
            "PublishDate": 1753192634616,
            "Source": "corporate_action"
        },
        {
            "Title": "Concord Biotech Passes EU GMP Inspection at Dholka API Facility",
            "Summary": "Concord Biotech has announced the successful completion of a European Union Good Manufacturing Practice (EU GMP) inspection at their Active Pharmaceutical Ingredient (API) facility in Dholka. This inspection is a crucial regulatory requirement for pharmaceutical companies looking to supply products to the European market.",
            "Sentiment": "positive",
            "PublishDate": 1752824305000,
            "Source": "default"
        },
        {
            "Title": "NCLT Grants 60-Day Extension for Settlement Talks Between Concord Enviro Systems and Its Unit",
            "Summary": "The National Company Law Tribunal (NCLT) has allowed Concord Enviro Systems a 60-day period to engage in settlement discussions with one of its units. This decision indicates ongoing legal or financial matters between the company and its subsidiary that require resolution.",
            "Sentiment": "neutral",
            "PublishDate": 1751633251000,
            "Source": "default"
        },
        {
            "Title": "U.S. FDA Inspection at Concord Biotech's Dholka API Plant Concludes Successfully",
            "Summary": "The U.S. Food and Drug Administration (FDA) conducted an inspection at Concord Biotech's API plant in Dholka. The inspection was completed successfully with no issues found, and there is no need for any regulatory action.",
            "Sentiment": "positive",
            "PublishDate": 1750752753000,
            "Source": "default"
        },
        {
            "Title": "Concord Biotech Reports Q4 Net Profit of 1.4 Billion Rupees, Recommends Dividend",
            "Summary": "Concord Biotech has reported its Q4 financial results. The company's net profit for the quarter is 1.4 billion rupees, compared to 972 million rupees year-over-year and 741 million rupees quarter-over-quarter. Q4 revenue stands at 4.3 billion rupees, up from 3.2 billion rupees in the same quarter last year. The company has recommended a dividend of 10.70 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748559780000,
            "Source": "default"
        },
        {
            "Title": "Concord Biotech Recommends Dividend of 10.70 Rupees per Share",
            "Summary": "Concord Biotech has recommended a dividend of 10.70 rupees per equity share. No additional details about the dividend, such as the fiscal year or record date, were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1748528179000,
            "Source": "result"
        },
        {
            "Title": "Concord Biotech Reports Strong Q4 Financial Results",
            "Summary": "Concord Biotech has announced its Q4 financial results. The company's EBITDA increased to 1.9 billion rupees from 1.34 billion rupees year-over-year. The EBITDA margin improved to 44.30% from 42.10% in the same period. Net profit rose to 1.4 billion rupees, up from 972 million rupees year-over-year and 741 million rupees quarter-over-quarter. Revenue for Q4 reached 4.3 billion rupees, compared to 3.2 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748528147000,
            "Source": "result"
        },
        {
            "Title": "USFDA Inspection of Concord Biotech's Dholka Facility Concludes with Form 483",
            "Summary": "Concord Biotech has completed a USFDA inspection of its Dholka facility, which took place from April 28 to May 2, 2025. At the conclusion of the inspection, the USFDA issued a Form 483 with four observations.",
            "Sentiment": "neutral",
            "PublishDate": 1746403552000,
            "Source": "default"
        },
        {
            "Title": "Concord Biotech Receives FDA Form 483 After Facility Inspection",
            "Summary": "Concord Biotech's Dholka facility underwent a USFDA inspection from April 28 to May 2, 2025. The inspection concluded with the FDA issuing a Form 483 containing four observations. This form is typically issued when inspectors observe conditions that may constitute violations of the Food Drug and Cosmetic Act.",
            "Sentiment": "neutral",
            "PublishDate": 1746188787000,
            "Source": "default"
        },
        {
            "Title": "Concord Biotech Receives USFDA Approval for Teriflunomide Tablets",
            "Summary": "Concord Biotech has been granted final approval from the US Food and Drug Administration (USFDA) to market Teriflunomide Tablets in 7 mg and 14 mg strengths. The US market for Teriflunomide Tablets is estimated at $402 million, while the global market is approximately $908 million, presenting significant growth opportunities for the company.",
            "Sentiment": "positive",
            "PublishDate": 1744157458000,
            "Source": "corporate_action"
        },
        {
            "Title": "Concord Biotech Receives FDA Approval for Teriflunomide Tablets",
            "Summary": "Concord Biotech has obtained final approval from the USFDA to market Teriflunomide tablets in 7 mg and 14 mg strengths. The US market for Teriflunomide tablets is valued at approximately $402 million, while the global market is around $908 million, presenting significant growth opportunities for the company.",
            "Sentiment": "positive",
            "PublishDate": 1744116278000,
            "Source": "corporate_action"
        },
        {
            "Title": "Concord Biotech Commences Injectable Production at New Facility",
            "Summary": "Concord Biotech has announced the successful commissioning and commencement of injectable production at its new manufacturing facility located in Valthera.",
            "Sentiment": "positive",
            "PublishDate": 1742881075000,
            "Source": "corporate_action"
        },
        {
            "Title": "Concord Biotech Passes MFDS Inspection at Manufacturing Unit I",
            "Summary": "Concord Biotech has announced that the Ministry of Food and Drug Safety (MFDS) conducted an inspection at the company's Manufacturing Unit I. The inspection was successfully completed, reaffirming Concord Biotech's commitment to maintaining world-class quality standards and industry leadership.",
            "Sentiment": "positive",
            "PublishDate": 1740042083000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Concord Biotech: Q3 Profit Dips, Shares Tumble 16%",
            "Summary": "Concord Biotech reported a 2.1% YoY decline in Q3 FY25 net profit to Rs 75.92 crore. Revenue rose 1.4% YoY to Rs 244.22 crore. Sequentially, revenue fell 21.2% and profit dropped 20.7%. Total expenses increased 7.2% YoY. The stock price fell 16% to Rs 1,777.7 following the results.",
            "Sentiment": "negative",
            "PublishDate": 1739513039000,
            "Source": "earnings"
        },
        {
            "Title": "Concord Biotech Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Concord Biotech experienced a decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 980 million rupees from 1.11 billion rupees in the same quarter of the previous year. Additionally, the EBITDA margin declined to 40.11% from 46.06% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739457198000,
            "Source": "earnings"
        },
        {
            "Title": "Concord Biotech Reports Q3 Financial Results",
            "Summary": "Concord Biotech announced its Q3 financial results. The company reported a net profit of 741 million rupees, slightly down from 746 million rupees year-over-year, but down from 987 million rupees quarter-over-quarter. Revenue for Q3 remained stable at 2.4 billion rupees, unchanged from the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739457133000,
            "Source": "earnings"
        },
        {
            "Title": "Concord Biotech to Acquire 26% Stake in Clean Max",
            "Summary": "Concord Biotech has entered into a share purchase agreement with Clean Max. As part of this agreement, Concord Biotech will acquire a 26% equity stake in Clean Max. This move represents a significant investment for Concord Biotech and potentially signals a strategic expansion or diversification of their business interests.",
            "Sentiment": "neutral",
            "PublishDate": 1737073310000,
            "Source": "corporate_action"
        },
        {
            "Title": "Concord Biotech to Acquire 26% Stake in Clean Max",
            "Summary": "Concord Biotech has entered into a share purchase agreement with Clean Max. As part of this agreement, Concord Biotech will acquire a 26% equity stake in Clean Max. This move represents a significant investment and potential strategic partnership between the two companies.",
            "Sentiment": "positive",
            "PublishDate": 1737023696000,
            "Source": "corporate_action"
        },
        {
            "Title": "Concord Biotech Invests $1 Million in Palvella Therapeutics",
            "Summary": "Concord Biotech has made an investment of $1 million in compulsorily convertible notes of Palvella Therapeutics, Inc. This strategic investment indicates Concord Biotech's interest in expanding its portfolio or potential collaboration in the biotech sector.",
            "Sentiment": "neutral",
            "PublishDate": 1733983988000,
            "Source": "corporate_action"
        },
        {
            "Title": "Concord Biotech Reports Q2 Revenue Growth",
            "Summary": "Concord Biotech has announced its Q2 revenue, which stands at 3.1 billion rupees, compared to 2.6 billion rupees in the same quarter last year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731309964000,
            "Source": "result"
        },
        {
            "Title": "Concord Biotech Reports Q2 EBITDA Growth",
            "Summary": "Concord Biotech announced its Q2 financial results. The company's EBITDA increased to 1.36 billion rupees from 1.19 billion rupees year-over-year. However, the EBITDA margin slightly decreased to 44.06% from 45.43% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731309906000,
            "Source": "result"
        },
        {
            "Title": "Concord Biotech Reports Q2 Net Profit Increase",
            "Summary": "Concord Biotech has announced its financial results for the second quarter, reporting a net profit of 987 million rupees. This represents an increase from the 845 million rupees reported in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1731309834000,
            "Source": "result"
        }
    ]
}