{
    "Symbol": "CONFIPET",
    "ISIN": "INE552D01024",
    "News": [
        {
            "Title": "Confidence Petroleum Board Approves Key Appointments",
            "Summary": "Confidence Petroleum India Limited announces director appointments and joint statutory auditor selection, with EGM scheduled for February 27, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770212731121,
            "Source": "stocks"
        },
        {
            "Title": "Confidence Petroleum auditor L N J & Associates resigns",
            "Summary": "Confidence Petroleum India Limited announces resignation of joint statutory auditor L N J & Associates effective December 30, 2025, citing preoccupation with other commitments.",
            "Sentiment": "neutral",
            "PublishDate": 1767098253663,
            "Source": "stocks"
        },
        {
            "Title": "Confidence Petroleum India to Set Up Wholly Owned Subsidiary in Dubai",
            "Summary": "Confidence Petroleum India announced plans to incorporate Confidence LPG Trading FZCO as a wholly owned subsidiary in Dubai, UAE. The move represents the company's expansion into international markets through its LPG trading operations.",
            "Sentiment": "neutral",
            "PublishDate": 1765237803533,
            "Source": "corporate_governance"
        },
        {
            "Title": "Confidence Petroleum India Announces Board Changes and Dubai Subsidiary Incorporation",
            "Summary": "Confidence Petroleum India's Board approved the resignation of Mr. Simon Charles Hill as Non-Executive Non-Independent Director and appointed Mrs. Ketki Mahendra Save as Additional Director on December 8, 2025. The company also approved incorporating a wholly owned subsidiary, Confidence LPG Trading FZCO, in Dubai for LPG trading operations with 100% share capital subscription.",
            "Sentiment": "neutral",
            "PublishDate": 1765212153139,
            "Source": "corporate_governance"
        },
        {
            "Title": "Confidence Petroleum India Reports Mixed Q2 Results with Revenue Decline",
            "Summary": "Confidence Petroleum India reported quarterly EBITDA of 824M rupees with improved margin at 8.39%, while consolidated net profit remained flat at 203M rupees. The company experienced a revenue decline to 9.8B rupees from 11.2B rupees quarter-over-quarter, despite maintaining profitability levels.",
            "Sentiment": "neutral",
            "PublishDate": 1763205537861,
            "Source": "earnings"
        },
        {
            "Title": "Income Tax Authorities Conduct Search Operations at Confidence Petroleum Facilities",
            "Summary": "Income tax authorities have conducted search and seizure operations at Confidence Petroleum's offices and plants. The operations, which began on October 7, 2025, also extended to the homes of the company's promoter and directors.",
            "Sentiment": "negative",
            "PublishDate": 1760000383544,
            "Source": "stock"
        },
        {
            "Title": "Confidence Petroleum India Limited Appoints Two Independent Directors and Schedules 31st AGM",
            "Summary": "Confidence Petroleum India Limited's Board of Directors approved the appointment of Mr. Sumit Bansal and Mrs. Richa Kalra as Additional Non-Executive Independent Directors effective September 8, 2025, subject to shareholder approval at the 31st Annual General Meeting. Mr. Bansal, aged 36, is a qualified Company Secretary since 2015 with LLB from CCS University, while Mrs. Kalra, aged 46, is a Company Secretary since 2004 with experience serving as Independent Director in several listed companies. Both appointments are for a five-year term ending September 7, 2030. The company scheduled its 31st Annual General Meeting for September 30, 2025, at 1:00 PM via video conferencing. The Board also approved the Annual Report, re-appointed M/s. Narendra Peshne & Associates as Cost Auditors for FY 2025-26, and appointed M/s Siddharth Sipani & Associates as Secretarial Auditors for five years. The Register of Members will remain closed from September 24-30, 2025, with the record date set as September 23, 2025. Electronic voting will be available from September 27 at 9:00 AM to September 29 at 5:00 PM.",
            "Sentiment": "positive",
            "PublishDate": 1757336531786,
            "Source": "corporate_governance"
        },
        {
            "Title": "Confidence Petroleum India Reports 38% Jump in Q1 Revenue to Rs 1,063 Crores",
            "Summary": "Confidence Petroleum India Limited reported standalone revenue from operations of Rs 1,06,351 lakhs for the quarter ended June 30, 2025, compared to Rs 77,113 lakhs in the same quarter last year. Net profit increased to Rs 1,940 lakhs from Rs 1,404 lakhs year-on-year. On a consolidated basis, revenue rose to Rs 1,11,199 lakhs from Rs 77,793 lakhs, while consolidated net profit grew to Rs 2,045 lakhs from Rs 1,544 lakhs. The company operates through two segments - Cylinder Division (Rs 4,419 lakhs revenue) and LPG Division (Rs 1,06,780 lakhs revenue). Basic earnings per share stood at Rs 0.58 for standalone and Rs 0.61 for consolidated results. The company has decided to discontinue its planned LPG import terminal project at JNPA and incorporated a wholly owned subsidiary Confidence Green Energy Private Limited on July 16, 2025. The auditors issued a qualified review report citing differences in GST input tax credit reconciliation and non-recognition of additional provident fund liability.",
            "Sentiment": "positive",
            "PublishDate": 1755096550238,
            "Source": "earnings"
        },
        {
            "Title": "Confidence Petroleum India Reports Mixed Q1 Results with Higher Revenue but Lower Profitability",
            "Summary": "Confidence Petroleum India reported Q1 revenue of 11.2 billion rupees, up from 9.2 billion rupees in the previous quarter. However, the company's profitability metrics declined quarter-over-quarter. EBITDA fell to 828 million rupees from 905 million rupees, while EBITDA margin compressed to 7.45% from 9.79%. Consolidated net profit also decreased to 202 million rupees from 228 million rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1755093158351,
            "Source": "earnings"
        },
        {
            "Title": "Confidence Petroleum Launches New Subsidiary for LPG and CNG Operations",
            "Summary": "Confidence Petroleum has established a new unit called 'Confidence Green Energy Pvt. Ltd.' The new subsidiary is aimed at expanding the company's operations in the LPG (Liquefied Petroleum Gas) and CNG (Compressed Natural Gas) sectors.",
            "Sentiment": "positive",
            "PublishDate": 1752715615000,
            "Source": "default"
        },
        {
            "Title": "Confidence Petroleum Launches 'Confidence Green Energy' Subsidiary",
            "Summary": "Confidence Petroleum has launched a new subsidiary called 'Confidence Green Energy' to expand its operations in the LPG and CNG sectors.",
            "Sentiment": "positive",
            "PublishDate": 1752685133000,
            "Source": "default"
        },
        {
            "Title": "Confidence Petroleum India Ltd: Wins Major LPG Bottling Contracts Despite Stock Dip",
            "Summary": "Confidence Petroleum India Ltd secured LPG bottling contracts worth ₹42.09 crore from BPCL, HPCL, and IOCL. The contracts cover bottling volumes of 3 lakh cylinders for BPCL, 1.2 lakh for HPCL, and 90,000 for IOCL. The company is also shortlisted for an IOCL tender at Sarangpur. Despite the news, the stock fell 7.02% to ₹51.50 on the NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1751013670000,
            "Source": "order&deals"
        },
        {
            "Title": "Confidence Petro Secures 40 Crore Rupee Bottling Contracts",
            "Summary": "Confidence Petro has obtained bottling contracts worth 40 crore rupees from major Public Sector Undertakings (PSUs). These contracts are set to last for a duration of 10 years.",
            "Sentiment": "positive",
            "PublishDate": 1751009129000,
            "Source": "default"
        },
        {
            "Title": "Confidence Petro Expands CNG Network in Bangalore",
            "Summary": "Confidence Petro has commissioned 5 additional CNG stations in Bangalore, increasing their total number of stations from 45 to 50 in the city.",
            "Sentiment": "positive",
            "PublishDate": 1749537658000,
            "Source": "default"
        },
        {
            "Title": "Confidence Petroleum India Commissions Eight New Auto LPG Stations",
            "Summary": "Confidence Petroleum India has commissioned eight additional auto LPG stations. This expansion increases the company's network of auto LPG dispensing facilities.",
            "Sentiment": "positive",
            "PublishDate": 1748846006000,
            "Source": "default"
        },
        {
            "Title": "Confidence Petroleum India Reports Q4 EBITDA and Margin",
            "Summary": "Confidence Petroleum India has reported its quarterly financial results. The company's EBITDA for Q4 was 905 million rupees, compared to 808 million rupees in the previous quarter. The EBITDA margin for Q4 was 9.79%, down from 11.59% in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748525922000,
            "Source": "result"
        },
        {
            "Title": "Confidence Petroleum India Reports Q4 Financial Results",
            "Summary": "Confidence Petroleum India has reported its quarterly financial results. The company's consolidated net profit for the latest quarter stands at 228 million rupees, compared to 307 million rupees in the previous quarter. Revenue for the quarter is 9.24 billion rupees, up from 6.97 billion rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748525867000,
            "Source": "result"
        },
        {
            "Title": "Confidence Petroleum Reports Q3 Financial Results",
            "Summary": "Confidence Petroleum has announced its Q3 consolidated financial results. The company's net profit increased to 307 million rupees, up from 177 million rupees in the previous quarter. However, revenue decreased to 6.97 billion rupees from 7.4 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739146180000,
            "Source": "earnings"
        },
        {
            "Title": "Confidence Petroleum Reports Improved Q3 EBITDA and Margin",
            "Summary": "Confidence Petroleum has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q3 stands at 808 million rupees, up from 780 million rupees in the previous quarter. The EBITDA margin has also improved to 11.59% from 10.45% quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739017280000,
            "Source": "earnings"
        },
        {
            "Title": "Confidence Petroleum Reports Q3 Financial Results",
            "Summary": "Confidence Petroleum has announced its Q3 consolidated financial results. The company's net profit increased to 307 million rupees, up from 177 million rupees in the previous quarter. However, revenue decreased to 6.97 billion rupees from 7.4 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739017276000,
            "Source": "earnings"
        },
        {
            "Title": "Confidence Petroleum to Consider Q3 Results",
            "Summary": "Confidence Petroleum India Limited has announced that it will consider its third quarter (Q3) financial results on February 8th. This indicates the company is preparing to disclose its performance for the latest fiscal quarter to shareholders and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1738759943000,
            "Source": "earnings"
        },
        {
            "Title": "Confidence Petroleum India Reports Q2 EBITDA Growth",
            "Summary": "Confidence Petroleum India has reported its Q2 financial results. The company's EBITDA increased to 780 million rupees, up from 751 million rupees in the previous quarter. Additionally, the EBITDA margin improved to 10.45% from 9.65% quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731430195000,
            "Source": "result"
        },
        {
            "Title": "Confidence Petroleum India Reports Q2 Financial Results",
            "Summary": "Confidence Petroleum India announced its Q2 financial results. The company's consolidated net profit increased to 177 million rupees from 150 million rupees in the previous quarter. However, revenue decreased to 7.4 billion rupees from 7.8 billion rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1731430144000,
            "Source": "result"
        }
    ]
}