{
    "Symbol": "CONTROLPR",
    "ISIN": "INE663B01015",
    "News": [
        {
            "Title": "Control Print Q3 Revenue Up 20% Despite Profit Drop",
            "Summary": "Control Print reported Q3 consolidated revenue of ₹1.2 billion, up from ₹1 billion year-on-year, while net profit declined to ₹53 million from ₹83 million in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1769677149789,
            "Source": "co_actions_results"
        },
        {
            "Title": "Control Print Reports Strong Q2 FY26 Results with 28% EBITDA Margin",
            "Summary": "Control Print Limited delivered robust quarterly results with H1 FY26 standalone revenue of ₹202 crores and achieved a record EBITDA margin of 28%, driven by strong performance in coding and marking business which contributes 89% of revenue. The company expects to cross ₹100 crores in standalone profit before tax for FY26, while Italian operations continue to face losses of EUR 1-1.2 million, though management anticipates breakeven by next financial year.",
            "Sentiment": "positive",
            "PublishDate": 1763647337883,
            "Source": "earnings"
        },
        {
            "Title": "Control Print Limited Submits Quarterly Financial Results to Stock Exchanges",
            "Summary": "Control Print Limited submitted its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025, to BSE and NSE as required under SEBI regulations. The results were approved by the Board of Directors and published in Business Standard and Navshakti newspapers, fulfilling mandatory disclosure requirements for listed companies.",
            "Sentiment": "positive",
            "PublishDate": 1763125790534,
            "Source": "earnings"
        },
        {
            "Title": "Control Print Limited Schedules Q2 FY2026 Earnings Conference Call",
            "Summary": "Control Print Limited has announced an earnings conference call for Q2 FY2026 scheduled for November 14, 2025, at 2:30 PM IST. The call will be conducted through Kaptify Consulting via Zoom platform. The management team will be represented by Mr. Shiva Kabra, Joint Managing Director, and Mr. Jaideep Barve, Chief Financial Officer. The call requires prior registration through a provided Zoom link, and joining details will be sent to registered participants. The session will be recorded.",
            "Sentiment": "neutral",
            "PublishDate": 1762841062091,
            "Source": "earnings"
        },
        {
            "Title": "Control Print Limited Reports Share Transmission from Late Promoter to Legal Heir",
            "Summary": "Control Print Limited disclosed the transmission of 13,75,997 equity shares from late Mrs. Pushpa Kabra to her legal heir, Mr. Basant Kabra. Mrs. Pushpa Kabra, a promoter of the company, held 14,01,480 equity shares in total. Both Mrs. Pushpa Kabra and Mr. Basant Kabra are promoters of Control Print Limited. The transmission represents the transfer of shares to the legal heir following the promoter's death.",
            "Sentiment": "neutral",
            "PublishDate": 1758034130253,
            "Source": "corporate_action"
        },
        {
            "Title": "Control Print Reports Mixed Q1FY26 Results with Revenue Growth Offset by Margin Pressures",
            "Summary": "Control Print Limited reported standalone revenue of ₹109 crores for Q1FY26, up from ₹89 crores in the same quarter last year, with operating revenue at ₹100 crores versus ₹88 crores previously. On consolidated basis, operating revenue reached ₹111 crores compared to ₹98 crores in Q1FY25. However, consolidated EBITDA declined from ₹20 crores to ₹18.5 crores year-on-year. The company faced margin pressures primarily due to losses in its packaging business, with CP Italy (V-Shapes) recording a loss of €384,000 (₹4.5-5 crores) in the quarter. Management announced price increases effective August 1st to improve coding and marking business margins, expecting benefits from Q3 onwards. The track and trace business is approaching breakeven, while the packaging business continues to face challenges with material costs at ₹2 per piece, targeting reduction to ₹1 through in-house manufacturing. The company received ₹3.99 crores in exceptional income from capital subsidy related to Mask Lab investment. Employee costs increased to 18% of operating revenue due to expansion in new business segments.",
            "Sentiment": "neutral",
            "PublishDate": 1753706982944,
            "Source": "earnings"
        },
        {
            "Title": "Control Print Reports 14% Revenue Growth in Q1FY26 with Highest Ever Quarterly Sales",
            "Summary": "Control Print Limited achieved its highest ever Q1 revenue of Rs 1,005 million, marking 14% year-over-year growth. The company's standalone profit before tax (excluding exceptional items) grew 30% year-over-year. The company sold two packaging machines during the quarter and received Rs 39.9 million as capital investment grant under CCIIAC. Gross margins softened to 56.47% from 61.65% in the previous year due to higher printer sales. The company maintains an installed base of over 21,500 printers and holds a 19-20% market share in India's organized coding and marking sector. Control Print operates through multiple business segments including coding & marking equipment, track & trace solutions through QRiousCodes brand, and packaging business through V Shapes.",
            "Sentiment": "positive",
            "PublishDate": 1753158161135,
            "Source": "earnings"
        },
        {
            "Title": "Control Print Q1 Revenue Rises to 1.1B Rupees Despite Profit and Margin Decline",
            "Summary": "Control Print reported Q1 consolidated net profit of 86 million rupees, down from 117 million rupees in the same period last year. The company's EBITDA decreased to 186 million rupees from 204 million rupees year-over-year, with EBITDA margin contracting to 16.70% from 20.9%. However, Q1 revenue grew to 1.1 billion rupees compared to 978 million rupees in the previous year, showing top-line growth despite pressure on profitability metrics.",
            "Sentiment": "neutral",
            "PublishDate": 1753085602647,
            "Source": "earnings"
        },
        {
            "Title": "Control Print Reports Q4 Financial Results and Dividend",
            "Summary": "Control Print has announced its Q4 financial results. The company reported a consolidated net profit of 666 million rupees, compared to 125 million rupees year-over-year and 83 million rupees quarter-over-quarter. Q4 revenue stood at 1.2 billion rupees, up from 1 billion rupees in the previous year. The company's profit before tax (PBT) for Q4 was 213 million rupees, compared to 197 million rupees year-over-year. Control Print has a deferred tax of 500 million rupees. Additionally, the company has recommended a dividend of 6 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748223252000,
            "Source": "default"
        },
        {
            "Title": "Control Print Recommends Dividend and Reports Q4 Results",
            "Summary": "Control Print has recommended a dividend of 6 rupees per equity share. The company reported a deferred tax of 500 million rupees. For the fourth quarter, Control Print's profit before tax (PBT) was 213 million rupees, compared to 197 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1748009131000,
            "Source": "result"
        },
        {
            "Title": "Control Print Reports Q4 Financial Results",
            "Summary": "Control Print has released its Q4 financial results. The company's EBITDA for Q4 was 221 million rupees, compared to 230 million rupees in the same quarter last year. The EBITDA margin decreased to 18.11% from 22.84% year-over-year. Consolidated net profit for Q4 was 666 million rupees, up from 125 million rupees year-over-year and 83 million rupees quarter-over-quarter. Q4 revenue increased to 1.2 billion rupees from 1 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1748009044000,
            "Source": "result"
        },
        {
            "Title": "Control Print Announces Dividend of 4 Rupees Per Share",
            "Summary": "Control Print has declared a dividend of 4 rupees per share for its shareholders. This corporate action represents a distribution of the company's profits to its investors.",
            "Sentiment": "positive",
            "PublishDate": 1737190204000,
            "Source": "corporate_action"
        },
        {
            "Title": "Control Print Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Control Print has reported a decrease in its third quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 173 million rupees from 218 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin declined to 16.73% from 24.63% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1737189983000,
            "Source": "earnings"
        },
        {
            "Title": "Control Print Reports Mixed Q3 Financial Results",
            "Summary": "Control Print, an Indian company, has reported its Q3 financial results. The consolidated net profit decreased to 83 million rupees from 134 million rupees in the same quarter last year. However, revenue increased to 1.03 billion rupees from 886 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1737189738000,
            "Source": "earnings"
        },
        {
            "Title": "Control Print Establishes Wholly Owned Subsidiary in UAE",
            "Summary": "Control Print, an Indian company, has announced the incorporation of a new wholly owned subsidiary in the United Arab Emirates. This strategic move suggests an expansion of the company's operations into the Middle Eastern market.",
            "Sentiment": "positive",
            "PublishDate": 1736347781000,
            "Source": "corporate_action"
        },
        {
            "Title": "Control Print Reports Q2 EBITDA and Margin Decline",
            "Summary": "Control Print has reported its Q2 financial results. The company's EBITDA slightly decreased to 202.5 million rupees from 204 million rupees year-over-year. The EBITDA margin also declined to 19.89% from 23.71% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1729844330000,
            "Source": "result"
        },
        {
            "Title": "Control Print Reports Q2 FY24 Financial Results",
            "Summary": "Control Print Limited has announced its financial results for the second quarter. The company reported a consolidated net profit of 135 million rupees, slightly down from 141 million rupees in the same quarter last year. However, revenue increased to 1.04 billion rupees from 864 million rupees in the corresponding period, showing significant top-line growth.",
            "Sentiment": "neutral",
            "PublishDate": 1729844256000,
            "Source": "result"
        }
    ]
}