{
    "Symbol": "CORALFINAC",
    "ISIN": "INE558D01021",
    "News": [
        {
            "Title": "Coral India Finance Reports Strong Q3FY26 Results",
            "Summary": "Coral India Finance posts 60.78% jump in Q3FY26 net profit to ₹375.31 lakhs with revenue rising 6.57% to ₹392.54 lakhs, though nine-month profit declined 20.13% to ₹1,209.50 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770893151605,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coral India Finance Reports Strong Q2 Performance with 353 Lakh Net Profit",
            "Summary": "Coral India Finance and Housing Limited reported net profit of ₹353 lakhs for the quarter ended September 30, 2025, with total income of ₹482.70 lakhs and earnings per share of ₹1.19. The company's board approved unaudited standalone financial statements showing robust performance across investment and construction segments with total assets of ₹2,944.98 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1763113272365,
            "Source": "earnings"
        },
        {
            "Title": "Coral India Finance and Housing Reports Quarterly Financial Results",
            "Summary": "Coral India Finance and Housing Limited approved its unaudited standalone financial statements for the quarter ended June 30, 2025, at a board meeting held on August 14, 2025. The company reported total income of Rs 660.46 lakhs compared to Rs 360.43 lakhs in the previous quarter and Rs 2,597.06 lakhs for the year ended March 31, 2025. Revenue from operations stood at Rs 458.09 lakhs while other income was Rs 202.37 lakhs. Total profit for the period was Rs 481.20 lakhs. The company's earnings per share was Rs 4.34 for the quarter. Total assets were Rs 23,438.01 lakhs and total liabilities were Rs 1,422.34 lakhs. The company operates in two main segments - Investment and Constructions, with Investment segment contributing Rs 816.28 lakhs and Constructions segment contributing Rs 173.38 lakhs to total revenue.",
            "Sentiment": "positive",
            "PublishDate": 1755158233968,
            "Source": "earnings"
        }
    ]
}