{
    "Symbol": "COROMANDEL",
    "ISIN": "INE169A01031",
    "News": [
        {
            "Title": "Coromandel Q3 FY26 Results: Strong CPC Growth Drives Performance",
            "Summary": "Coromandel International reported consolidated revenue of INR8,863 crores in Q3 FY26, up 26% YoY. Crop Protection business delivered strong 24% revenue growth with margins expanding to 20%.",
            "Sentiment": "positive",
            "PublishDate": 1770736773259,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coromandel International Approves ₹9 Dividend",
            "Summary": "Coromandel International has approved a dividend payment of ₹9 per share for its shareholders, reflecting the company's commitment to returning value to investors.",
            "Sentiment": "positive",
            "PublishDate": 1769681654951,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coromandel Board Approves Promoter Reclassification",
            "Summary": "Coromandel International's board approved application to stock exchanges for reclassifying Algavista Greentech Private Limited from promoter group to public category, subject to regulatory approval.",
            "Sentiment": "neutral",
            "PublishDate": 1769681309569,
            "Source": "stocks"
        },
        {
            "Title": "Coromandel International Q3 Net Profit Dips to ₹5B",
            "Summary": "Coromandel International reports Q3 consolidated net profit of ₹5 billion, down from ₹5.1 billion in the same quarter last year, marking a slight year-on-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1769680538045,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coromandel International Q3FY26 Results Call Jan 30",
            "Summary": "Coromandel International announces conference call on January 30, 2026 at 3:00 PM IST to discuss Q3FY26 financial results for quarter ended December 31, 2025, hosted by IIFL Capital.",
            "Sentiment": "neutral",
            "PublishDate": 1769512292337,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coromandel International Completes JV Share Issuance",
            "Summary": "Coromandel International's subsidiary CCL acquires 60% stake in Stuccoedge India Private Limited for Rs. 6 lakh, forming joint venture for phospho-gypsum based building materials manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1769240834655,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coromandel International Block Trade Worth ₹20.84 Cr",
            "Summary": "Coromandel International executed a significant block trade on NSE involving 90,616 shares at ₹2,300.10 per share, totaling ₹20.84 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1768799391878,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coromandel targets ₹10,000 cr crop protection revenue",
            "Summary": "Coromandel International expands beyond fertilizers into crop protection, targeting ₹10,000 crore revenue in five years. Q2FY26 revenue rose 29.8% YoY to ₹9,654 crore with strong profitability growth.",
            "Sentiment": "positive",
            "PublishDate": 1768031426389,
            "Source": "stocks"
        },
        {
            "Title": "Coromandel Increases Stake in NACL Industries to 53.73%",
            "Summary": "Coromandel International acquired 1.88 crore additional shares in subsidiary NACL Industries through rights issue at ₹76.70 per share, raising its shareholding from 53.06% to 53.73%.",
            "Sentiment": "positive",
            "PublishDate": 1767193581736,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coromandel International Clarifies Volume Movement",
            "Summary": "Coromandel International responds to BSE inquiry on increased trading volume, stating no material information pending and attributing movement to market conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1767171229327,
            "Source": "stocks"
        },
        {
            "Title": "Coromandel International Director Steps Down",
            "Summary": "Coromandel International announces cessation of Whole-time Director Natarajan Srinivasan from Executive Vice Chairman position effective December 20, 2025, following mutual consent.",
            "Sentiment": "neutral",
            "PublishDate": 1766209437904,
            "Source": "stocks"
        },
        {
            "Title": "Coromandel International Allots 74,300 Equity Shares Under ESOP Scheme",
            "Summary": "Coromandel International's Stakeholders Relationship Committee approved allotment of 74,300 equity shares of Re. 1/- each to option grantees under ESOP Scheme 2016. The allotment increases the company's share capital from Rs. 29,49,21,109/- to Rs. 29,49,95,409/- divided into 29,49,95,409 equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1765201060776,
            "Source": "corporate_action"
        },
        {
            "Title": "Coromandel International Re-appoints Arun Alagappan as Executive Chairman",
            "Summary": "Coromandel International Limited has re-appointed Mr. Arun Alagappan as Whole-time Director and Executive Chairman effective February 15, 2026, following the conclusion of his current tenure on February 14, 2026. The re-appointment was approved through postal ballot results and affects the company's leadership continuity, with Alagappan being a member of the Murugappa Family and having extensive experience across the group's companies.",
            "Sentiment": "positive",
            "PublishDate": 1764948257233,
            "Source": "corporate_action"
        },
        {
            "Title": "Coromandel International Faces Rs 5.98 Crore GST Demand Order for Alleged Excess Input Tax Credit",
            "Summary": "Coromandel International received a demand order from Chennai GST authorities for Rs 5.98 crores (including tax of Rs 3.40 crores, interest of Rs 2.22 crores, and penalty of Rs 34 lakhs) for alleged excess Input Tax Credit availment. The company believes it has a strong case to defend on merits and plans to file an appeal, stating no material impact on its financial operations.",
            "Sentiment": "negative",
            "PublishDate": 1764864677967,
            "Source": "stock"
        },
        {
            "Title": "Coromandel International Approves Rs 250 Crore Investment in Subsidiary Rights Issue and Philippines Expansion",
            "Summary": "Coromandel International's board approved investing up to Rs 250 crores in subsidiary NACL Industries' rights issue and establishing a wholly-owned subsidiary in Philippines with USD 200,000 investment. The company also designated two new senior management personnel as part of organizational changes, while NACL Industries appointed a new CFO following the resignation of its previous chief financial officer.",
            "Sentiment": "positive",
            "PublishDate": 1764600204360,
            "Source": "corporate_action"
        },
        {
            "Title": "Coromandel International Chairman Emeritus A Vellayan Passes Away",
            "Summary": "Coromandel International announced the demise of Shri A Vellayan, Chairman Emeritus of the company and former Chairman of the Murugappa Group. Vellayan served the Murugappa group for several decades, providing strategic leadership across diverse businesses and playing a key role in expanding the Group into one of India's most respected conglomerates.",
            "Sentiment": "negative",
            "PublishDate": 1763390861405,
            "Source": "corporate_governance"
        },
        {
            "Title": "Coromandel International Gets Stock Exchange Approval for Promoter Group Reclassification",
            "Summary": "NSE and BSE have granted no-objection approvals for the reclassification of Coromandel Engineering Company Limited and Yantar Coromandel Agrisolutions Private Limited from Coromandel International's promoter group. The approvals were issued on November 14, 2025, following the company's application submitted on September 26, 2025, under SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763139914531,
            "Source": "corporate_action"
        },
        {
            "Title": "Coromandel International Signs ₹2,000 Crore MOU With Andhra Pradesh Government",
            "Summary": "Coromandel International has entered into a ₹2,000 crore memorandum of understanding with the Andhra Pradesh Government. The agreement focuses on strategic investments and industrial growth initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1763090484625,
            "Source": "order&deals"
        },
        {
            "Title": "Coromandel International Seeks Shareholder Approval for Executive Chairman Re-appointment and Rs 160 Crore Loan to Subsidiary",
            "Summary": "Coromandel International Limited has issued a postal ballot notice seeking shareholder approval for two key resolutions. The first involves re-appointing Mr. Arun Alagappan as Whole-time Director designated as Executive Chairman for five years from February 15, 2026 to February 14, 2031, with a basic salary of Rs 33.48 lakh per month plus performance incentives and allowances. The second resolution seeks approval to provide loans up to Rs 160 crores to subsidiary NACL Industries Limited under Section 185 of the Companies Act, 2013. The loan will be unsecured with tenure up to 18 months and interest rate up to 250 basis points over one-year government securities yield. E-voting for the postal ballot opens November 6, 2025 and closes December 5, 2025. Under Alagappan's leadership since 2021, Coromandel's revenue increased 70% from Rs 14,182 crores to Rs 24,085 crores in FY2025, while profit after tax grew 55% to Rs 2,055 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762349791449,
            "Source": "corporate_action"
        },
        {
            "Title": "Coromandel International Targets 25% Growth in Domestic Crop Protection Business",
            "Summary": "Coromandel International expects 25% growth in its domestic crop protection business. The company plans to reach 1 MT volume in new markets including Rajasthan, Madhya Pradesh, and Uttar Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1761991018968,
            "Source": "stock"
        },
        {
            "Title": "Coromandel International Reports Q2 FY26 Results and Announces Postal Ballot for Key Approvals",
            "Summary": "Coromandel International Limited's Board approved unaudited financial results for the quarter and half year ended September 30, 2025. The company will conduct a postal ballot seeking shareholder approval for three key items: re-appointment of Mr. Arun Alagappan as Executive Chairman for a 5-year term from February 15, 2026 to February 14, 2031, approval for providing loans under Section 185 of the Companies Act 2013, and granting inter-corporate loan of Rs. 160 crores to subsidiary NACL Industries Limited. The Board also approved issuing Letter of Comfort up to Rs. 550 crores in favor of lenders for loans to NACL Industries and its subsidiaries. The company holds 53.08% shareholding in NACL Industries Limited, which became a subsidiary effective August 8, 2025. The Board meeting was held on October 30, 2025, commencing at 11:00 a.m. and concluding at 01:30 p.m.",
            "Sentiment": "neutral",
            "PublishDate": 1761843226140,
            "Source": "earnings"
        },
        {
            "Title": "Coromandel International Reports Strong Q2 Growth with Net Profit Rising to 8 Billion Rupees",
            "Summary": "Coromandel International delivered robust quarterly performance with consolidated net profit increasing to 8 billion rupees from 6.64 billion rupees year-over-year. Revenue grew significantly to 96.5 billion rupees compared to 74.3 billion rupees in the same period last year. EBITDA rose to 11.46 billion rupees from 9.75 billion rupees year-over-year, though EBITDA margin declined to 11.88% from 13.11% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761813130674,
            "Source": "earnings"
        },
        {
            "Title": "Coromandel International Schedules Conference Call for Q2 & H1 FY26 Results Discussion",
            "Summary": "Coromandel International Limited has announced a conference call to discuss its financial results for the quarter and half year ended September 30, 2025. The call is scheduled for Friday, October 31, 2025, at 02:30 PM IST and will be organized and hosted by PhilipCapital. Key speakers include S. Sankarasubramanian, Managing Director & CEO, and Deepak Natarajan, Chief Financial Officer. The company will make the presentation, audio recordings, and transcripts available on its website following the call.",
            "Sentiment": "neutral",
            "PublishDate": 1761657579215,
            "Source": "earnings"
        },
        {
            "Title": "Coromandel International Seeks Stock Exchange Approval to Reclassify Two Promoter Group Entities",
            "Summary": "Coromandel International Limited has applied to the National Stock Exchange and BSE for no-objection to reclassify Coromandel Engineering Company Limited and Yanmar Coromandel Agrisolutions Private Limited from 'Promoter group' category to non-promoter status. Both entities currently hold zero equity shares in Coromandel International. The application was submitted on September 26, 2025, following previous communications dated August 30, September 17, and September 22, 2025. The reclassification is being sought under Regulation 31A of the SEBI Listing Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1758909006868,
            "Source": "corporate_action"
        },
        {
            "Title": "Coromandel International Board Approves Reclassification of Two Promoter Group Companies to Public Category",
            "Summary": "Coromandel International Limited's Board of Directors approved the application for reclassification of Coromandel Engineering Company Limited (CECL) and Yanmar Coromandel Agrisolutions Private Limited (YCAS) from 'promoter and promoter group' category to 'public' category shareholders. The board meeting was held on September 22, 2025, where directors approved submitting applications to NSE and BSE for obtaining No Objection Certificates for the reclassification. Both CECL and YCAS have committed to comply with requirements specified in Regulation 31A(4) of the Listing Regulations. The reclassification remains subject to receiving no objection from the stock exchanges under Regulation 31A of Listing Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1758548055114,
            "Source": "corporate_action"
        },
        {
            "Title": "Coromandel International Approves Technical Mono Ammonium Phosphate Plant in Visakhapatnam, Designates New Senior Management Personnel",
            "Summary": "Coromandel International Limited's Board of Directors approved the establishment of a Technical Mono Ammonium Phosphate (TMAP) plant in Visakhapatnam during their meeting on September 22, 2025. The board also designated Mr. Anirban Deb Ray as Senior Management Personnel in the role of General Counsel due to organizational changes. Mr. Ray holds a Post Graduate Diploma in Competition law from University of London, LLB and B.Com (Hons) from University of Calcutta, and is a member of the Institute of Company Secretaries of India. He brings over 24 years of experience in CS and Legal, having previously worked with companies including Tata Communications Limited, Birlasoft Limited, Vodafone Idea Limited, and Gabriel India Limited.",
            "Sentiment": "positive",
            "PublishDate": 1758524128743,
            "Source": "corporate_action"
        },
        {
            "Title": "Coromandel International Receives Reclassification Request from YCAS Following Shareholding Dilution",
            "Summary": "Coromandel International Limited received a request from Yanmar Coromandel Agrisolutions Private Limited (YCAS) to be reclassified from the promoter and promoter group category. The request follows a change in Coromandel's shareholding in YCAS from 40% to 10.60% after Yanmar Asia (Singapore) Corporation Pte Ltd infused Rs. 149.72 crores into YCAS in September 2024. This fund infusion resulted in the allotment of 11,09,00,741 equity shares to Yanmar Singapore. YCAS no longer qualifies as a promoter group entity since Coromandel holds less than 20% of YCAS's equity share capital. YCAS currently holds no shares in Coromandel International. The request will be presented to Coromandel's Board of Directors for approval, after which the company will seek no-objection from the stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1758096465611,
            "Source": "corporate_governance"
        },
        {
            "Title": "Coromandel International Increases Stake in NACL Industries to 53.08% Through Open Offer",
            "Summary": "Coromandel International Limited acquired 5,435 equity shares of NACL Industries Limited at Rs. 76.70 per share through an open offer from public shareholders. Following this acquisition, Coromandel now owns 10,69,12,581 equity shares, representing 53.08% of NACL's voting share capital. The acquisition was conducted in accordance with SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1757736130665,
            "Source": "order&deals"
        },
        {
            "Title": "Coromandel International Files Letter of Offer for NACL Industries Open Offer",
            "Summary": "Coromandel International Limited has filed a Letter of Offer with SEBI through JM Financial Limited for an open offer to acquire up to 5,24,62,320 equity shares (26% of voting share capital) of NACL Industries Limited at INR 76.70 per share. The offer follows Coromandel's acquisition of 52.98% stake through share purchase agreements with promoters and other shareholders. The total consideration for the open offer could reach INR 4,02,38,59,944 assuming full acceptance. The tendering period is scheduled from August 22, 2025 to September 8, 2025. Coromandel has deposited INR 405.10 crores in escrow, exceeding 100% of the maximum consideration required.",
            "Sentiment": "neutral",
            "PublishDate": 1755013569910,
            "Source": "corporate_action"
        },
        {
            "Title": "Coromandel International Acquires 53.08% Stake in NACL Industries, Becomes Promoter",
            "Summary": "Coromandel International Limited has completed the acquisition of 53.08% stake in NACL Industries Limited through multiple share purchase agreements dated March 12, 2025. The transaction involved acquiring 10,69,07,146 equity shares and was completed on August 8, 2025. As a result of this acquisition, Coromandel has become the promoter of NACL Industries and gained control of the company. NACL Industries has become a subsidiary of Coromandel International. The share purchase agreements were executed with various parties including KLR Products Limited, Mrs. Kanumuru Lakshmi Raju, Bright Town Investment Advisor Private Limited, Krishi Rasayan Export Private Limited, and Agro Life Science Corporation.",
            "Sentiment": "positive",
            "PublishDate": 1754639190275,
            "Source": "order&deals"
        },
        {
            "Title": "Coromandel International Receives SEBI Final Comments on Open Offer for NACL Industries Acquisition",
            "Summary": "Coromandel International Limited has received final comments from SEBI on its Draft Letter of Offer for an open offer to acquire up to 5,24,62,320 fully paid-up equity shares of NACL Industries Limited, representing 26% of the voting share capital. The shares have a face value of INR 1 each. SEBI issued its final comments under the SEBI Takeover Regulations on August 5, 2025. Coromandel will proceed with further steps as recommended by SEBI and as required under the open offer process pursuant to the SEBI Takeover Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1754409932644,
            "Source": "order&deals"
        },
        {
            "Title": "Coromandel International Reports 49% Revenue Growth in Q1 FY26, Driven by Volume Expansion and Higher Subsidy Rates",
            "Summary": "Coromandel International delivered strong quarterly results with consolidated revenue rising 49% to INR7,126 crores from INR4,783 crores in the previous year. EBITDA grew 55% to INR782 crores, driven by volume growth, higher subsidy rates, and margin expansion across business segments. The company achieved record primary sales volume of 11 lakh tons, marking 31% growth, with market share improving to 18% in the NPK segment. Crop Protection and Bio segments showed robust performance with revenue growing 31% to INR725 crores and EBIT increasing 77% to INR111 crores. The company operated plants at full capacity of 8.4 lakh tons, registering 6% volume growth. Phosphoric acid volumes increased 23% with the resumption of the Ennore plant. The company increased its stake in Baobab Mining and Chemicals Corporation by 17.7% to reach 71.5%. Backward integration projects for phosphoric acid and sulfuric acid are 70% complete and expected to commission in Q4. The retail business opened 73 new stores during the quarter and is on track to add 400 stores during the year. Government subsidy payments remained prompt, with INR1,300 crores received during the quarter. The company received Competition Commission approval for the NACL acquisition and awaits SEBI clearance.",
            "Sentiment": "positive",
            "PublishDate": 1754051515466,
            "Source": "earnings"
        },
        {
            "Title": "Coromandel International Faces Input Cost Pressures But Maintains Stable EBITDA Outlook",
            "Summary": "Coromandel International reported that rising costs for key inputs including sulfur and sulfuric acid impacted its margins. However, the company managed to offset some of these impacts through procurement efficiencies. The company expects to maintain stable EBITDA of 5,000 per metric ton for manufactured products this year. Additionally, BMCC aims to achieve rock phosphate output of 300,000-400,000 tons for FY26 and plans to double production within two years.",
            "Sentiment": "neutral",
            "PublishDate": 1753673737723,
            "Source": "stock"
        },
        {
            "Title": "Coromandel International Reports Strong Q1 Results with 63% Jump in Net Profit",
            "Summary": "Coromandel International delivered robust quarterly performance with consolidated net profit rising to 5.05 billion rupees from 3.1 billion rupees year-over-year. Revenue surged to 70.4 billion rupees compared to 47.3 billion rupees in the same period last year. EBITDA increased to 7.8 billion rupees from 5.1 billion rupees, while EBITDA margin improved to 11.11% from 10.7%. The company announced plans to establish a new facility with 3,888 MTPD capacity and 6 bagging machines at an investment of 137 crores rupees. Additionally, Coromandel acquired an additional 17.69% stake in BMCC, Senegal, raising its total ownership to 71.51%.",
            "Sentiment": "positive",
            "PublishDate": 1753345801377,
            "Source": "earnings"
        },
        {
            "Title": "Coromandel International Schedules Conference Call for Q1 FY26 Results Discussion",
            "Summary": "Coromandel International Limited has scheduled a conference call on July 25, 2025 at 2:30 PM IST to discuss their quarterly results for the period ended June 30, 2025. The call will be organized and hosted by Antique Stock Broking Limited, with the company's leadership team participating. The meeting will be conducted as a group meet format with dial-in access provided for India and multiple international locations. Audio recordings and transcripts of the conference call will be made available on the company's website at www.coromandel.biz. Contact persons for enquiries are Mr. Manish Mahawar and Mr. Riju Dalui from Antique Stock Broking Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1753158127590,
            "Source": "earnings"
        },
        {
            "Title": "Coromandel International: CCI Approves NACL Acquisition, Shares Surge 4%",
            "Summary": "Coromandel International's shares rose 4% to Rs 2,369.40 after the Competition Commission of India approved its acquisition of a 53.13% stake in NACL Industries. The deal involves purchasing 10.69 crore equity shares from various entities, with an additional 11,000 shares to be acquired from public shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1751520533000,
            "Source": "corporate_action"
        },
        {
            "Title": "Coromandel International's Unit Forms Joint Venture for Gypsum Products",
            "Summary": "Coromandel Chemicals, a unit of Coromandel International, has entered into a joint venture with Sakarni to manufacture and sell phospho-gypsum-based products. The partnership aims to capitalize on the growing gypsum plaster market. Coromandel Chemicals will hold a 60% equity share in the joint venture, while Sakarni will hold the remaining 40%.",
            "Sentiment": "positive",
            "PublishDate": 1746808007000,
            "Source": "default"
        },
        {
            "Title": "Coromandel International Aims for Margin Restoration and High Double-Digit Growth",
            "Summary": "Coromandel International plans to restore margins to levels from two years ago by improving procurement efficiencies, which is expected to significantly enhance EBITDA margins. The company anticipates high double-digit revenue growth for the next year, supported by healthy profitability margins due to a shift towards high-margin products. High-end double-digit growth is expected across three segments: domestic formulation, domestic B2C, and exports market.",
            "Sentiment": "positive",
            "PublishDate": 1746415537000,
            "Source": "default"
        },
        {
            "Title": "Coromandel International: Q4 Profit Soars, Declares Dividend and Subsidiary Investment",
            "Summary": "Coromandel International reported Q4 FY25 consolidated net profit of ₹579.7 crore, up from ₹160.3 crore YoY. Revenue grew 28% to ₹4,988.4 crore, EBITDA rose 56% to ₹426.4 crore. Final dividend of ₹6 and special dividend of ₹3 per share declared. Board approved ₹65 crore equity infusion into subsidiary for gypsum-based building material ventures.",
            "Sentiment": "positive",
            "PublishDate": 1746005764000,
            "Source": "earnings"
        },
        {
            "Title": "Coromandel International Reports Strong Q4 FY23 Results",
            "Summary": "Coromandel International has announced its Q4 FY23 financial results, showing significant year-over-year growth. The company's revenue increased to 50 billion rupees from 39.1 billion rupees in the same quarter last year. EBITDA rose to 4.26 billion rupees from 2.73 billion rupees, with the EBITDA margin improving to 8.54% from 6.98%. Profit before exceptional items grew to 3.84 billion rupees from 2.2 billion rupees. The company reported an exceptional item of 3.5 billion rupees. Consolidated net profit for Q4 reached 5.8 billion rupees, up from 1.6 billion rupees year-over-year. Additionally, the company declared a dividend of 6 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746003809000,
            "Source": "result"
        },
        {
            "Title": "Coromandel International Signs MoU with Ma'aden for Phosphatic Fertilizers",
            "Summary": "Coromandel International has entered into a Memorandum of Understanding (MoU) with Saudi Mining Company Ma'aden. The agreement focuses on the long-term supply of Di-ammonium Phosphate (DAP) and NP/NPK fertilizers. This partnership aims to strengthen Coromandel's position in the phosphatic fertilizer market and ensure a stable supply chain.",
            "Sentiment": "positive",
            "PublishDate": 1744330078000,
            "Source": "corporate_action"
        },
        {
            "Title": "Coromandel International and Ma'aden Sign MOU for Phosphatic Fertilizer Partnership",
            "Summary": "Coromandel International has signed a Memorandum of Understanding (MOU) with Saudi Mining Company Ma'aden. The agreement focuses on a long-term partnership for the supply of Di-Ammonium Phosphate (DAP) and NP/NPK fertilizers. This collaboration aims to strengthen Coromandel's position in the phosphatic fertilizer market and ensure a stable supply chain.",
            "Sentiment": "positive",
            "PublishDate": 1744201275000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Government Extends Urea Import Permission for India Potash",
            "Summary": "The Indian government has extended permission for India Potash to import urea until March 2026. This extension is relevant to Coromandel International, likely due to its involvement in the fertilizer industry.",
            "Sentiment": "neutral",
            "PublishDate": 1742355972000,
            "Source": "corporate_action"
        },
        {
            "Title": "Coromandel International Acquires Majority Stake in NACL Industries",
            "Summary": "Coromandel International has approved the acquisition of a 53.13% stake in NACL Industries. The acquisition price has been set at 76.70 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1741824298000,
            "Source": "corporate_action"
        },
        {
            "Title": "Coromandel International Acquires Majority Stake in NACL Industries",
            "Summary": "Coromandel International has approved the acquisition of a 53.13% stake in NACL Industries. The acquisition price has been set at 76.70 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1741794785000,
            "Source": "corporate_action"
        },
        {
            "Title": "Coromandel International Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade occurred for Coromandel International Ltd. on the National Stock Exchange (NSE). The transaction involved approximately 152,682 shares, valued at Rs. 26.43 crores. The shares were traded at a price of Rs. 1731.25 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1741682366000,
            "Source": "block_deals"
        },
        {
            "Title": "Coromandel International Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 103,868 shares of Coromandel International Ltd. was executed on the National Stock Exchange (NSE) at a price of Rs. 1635.00 per share. The total value of the transaction amounted to Rs. 16.98 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1740732171000,
            "Source": "block_deals"
        },
        {
            "Title": "Coromandel International: Lease Agreement Secures Rs 410 Crore",
            "Summary": "Coromandel International and its subsidiary signed a lease agreement for property in Thane, securing Rs 156.90 crore and Rs 253.10 crore respectively. The company also recently won a Rs 1,539-crore order from Andhra Pradesh government for fertiliser facility expansion.",
            "Sentiment": "positive",
            "PublishDate": 1739356147000,
            "Source": "corporate_action"
        },
        {
            "Title": "Andhra Pradesh Government Extends Subsidies for Coromandel International's Investment",
            "Summary": "The Government of Andhra Pradesh has extended subsidies for Coromandel International's investment of 15.39 billion rupees. The company will receive a 45% incentive on fixed capital investment, which is expected to boost its operations in the state.",
            "Sentiment": "positive",
            "PublishDate": 1739320350000,
            "Source": "corporate_action"
        },
        {
            "Title": "Coromandel International: Rs 1,539 Crore Order from Andhra Pradesh Government",
            "Summary": "Coromandel International received a Rs 1,539 crore order from the Andhra Pradesh government for expanding a fertiliser manufacturing facility in Kakinada. The state's Industries & Commerce Department offered a 45% incentive on eligible fixed capital investment, subject to project implementation timelines and employment commitments.",
            "Sentiment": "positive",
            "PublishDate": 1739273807000,
            "Source": "order&deals"
        }
    ]
}