{
    "Symbol": "COSMOFIRST",
    "ISIN": "INE757A01017",
    "News": [
        {
            "Title": "Cosmo First Board Meet Set for Feb 11 Q3 Results",
            "Summary": "Cosmo First Limited has scheduled a board meeting on February 11, 2026, to consider and approve unaudited financial results for the quarter ended December 31, 2025, as per SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770485254204,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cosmo First Challenges Gujarat Incentive Policy",
            "Summary": "Cosmo First Limited filed writ petition before Gujarat High Court seeking ₹58.34 crores tax incentive refund under Gujarat Industrial Policy 2015, with expected additional accrual of ₹33.53 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1769073785278,
            "Source": "stocks"
        },
        {
            "Title": "CosmoFirst Q2 FY26 Results: Revenue Jumps 21% to Rs 919 Crores Despite Margin Pressures",
            "Summary": "CosmoFirst Limited reported consolidated sales of Rs 919 crores for Q2 FY26, up 21% year-over-year, with EBITDA rising 19% to Rs 128 crores driven by higher volumes from new capacity additions. The company faced margin pressures from increased US tariffs (5% to 55%) and import competition in BOPP/BOPET films, while guiding for full-year revenue of Rs 3,500-3,800 crores with specialty films expected to contribute Rs 2,200-2,500 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1763545214274,
            "Source": "earnings"
        },
        {
            "Title": "CosmoFirst Announces Senior Management Changes in IT Department",
            "Summary": "CosmoFirst Limited appointed Anurag Chaube as Vice President-Information Technology on November 17, 2025, while General Manager-IT Sriram Arthanari resigned due to personal reasons and relocation to hometown. Arthanari will be relieved from duties on November 28, 2025, with Chaube bringing over 25 years of IT experience including enterprise business applications and cloud solutions.",
            "Sentiment": "neutral",
            "PublishDate": 1763381307112,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cosmo First Forms Joint Venture With Filmax In Korea For Packaging Distribution",
            "Summary": "Cosmo First has established a joint venture with Filmax in Korea. The partnership will focus on distribution, sales, and marketing of flexible packaging and other products in the Korean market.",
            "Sentiment": "positive",
            "PublishDate": 1762949872318,
            "Source": "order&deals"
        },
        {
            "Title": "CosmoFirst Reports Strong H1 FY26 Performance with 20% Sales Growth and Strategic Business Expansion",
            "Summary": "CosmoFirst Limited reported consolidated net sales of Rs 1,625 crores for H1 FY26, representing a 20% increase over the previous year. The company achieved an EBITDA margin of 14.2% for the period. The films business maintained its focus on specialty products, which comprised 71% of total volume in FY25, growing at 10% CAGR over the last six years. CosmoFirst commissioned a new BOPP line in June 2025, increasing capacity by 45% to 277,000 TPA. The company operates across multiple segments including specialty films, specialty chemicals, rigid packaging, window films, and D2C petcare through its Zigly brand. Specialty chemicals business posted highest ever EBITDA of Rs 25 crores with Rs 98 crores topline in H1 FY26. The company has a net debt to EBITDA ratio of 2.97 times and net debt to equity of 0.80 times as of September 2025. CosmoFirst achieved 50% renewable energy usage and plans to increase this to two-thirds in the next 12-18 months.",
            "Sentiment": "positive",
            "PublishDate": 1762912650672,
            "Source": "earnings"
        },
        {
            "Title": "Cosmo First Reports 2% Growth in Q2 Net Profit to 467 Million Rupees",
            "Summary": "Cosmo First reported consolidated net profit of 467 million rupees for Q2, compared to 458 million rupees in the same period last year. Revenue increased to 9.19 billion rupees from 7.58 billion rupees year-over-year. EBITDA rose to 1.03 billion rupees from 870.3 million rupees, though EBITDA margin declined slightly to 11.22% from 11.47% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762859992239,
            "Source": "earnings"
        },
        {
            "Title": "CosmoFirst Limited Schedules Q2 and H1 FY26 Earnings Call for November 12, 2025",
            "Summary": "CosmoFirst Limited has announced an investor earnings call to discuss its operational and financial performance for the quarter and half-year ended September 30, 2025. The call is scheduled for Wednesday, November 12, 2025, at 12:30 P.M. IST. The management participants will include Group CEO Pankaj Poddar and Group CFO Neeraj Jain. The company will also host an investor presentation on its website. Multiple dial-in numbers are provided for participants across different regions including India, USA, UK, Hong Kong, and Singapore, with a premium Diamond Pass service available for direct connection without waiting.",
            "Sentiment": "neutral",
            "PublishDate": 1762567790855,
            "Source": "corporate_action"
        },
        {
            "Title": "Cosmo First Acquires Films Inc as Wholly Owned Subsidiary",
            "Summary": "Cosmo First has acquired Films Inc, making it a wholly owned subsidiary of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1762261559470,
            "Source": "corporate_action"
        },
        {
            "Title": "Cosmo First Faces Income Tax Appeals Worth INR 7.79 Crores for FY 2003-08",
            "Summary": "Cosmo First Limited received five emails from the Income Tax Department's Standing Counsel regarding appeals being filed before the Delhi High Court. The appeals challenge a consolidated order dated July 26, 2023, passed by the Income Tax Appellate Tribunal in favor of Cosmo First for Financial Years 2003-04 to 2007-08. The dispute centers on two main issues: whether sales-tax subsidy received under the Government of Maharashtra Package Scheme of Incentives, 1993, should be reduced from asset costs for depreciation computation, and the validity of deduction claims under Section 10B of the Income-tax Act, 1961 for the company's EOU unit. The total tax impact amounts to INR 7.79 crores covering the specified financial years. The company stated it is taking appropriate steps and does not foresee any material impact on its financial, operational or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1761369245002,
            "Source": "stock"
        },
        {
            "Title": "Cosmo First Appoints Saurabh Jain as CEO of Petcare Division and Head Corporate Development",
            "Summary": "Cosmo First Limited appointed Mr. Saurabh Jain as CEO-Petcare Division ('Zigly') and Head Corporate Development on October 23, 2025. Jain brings over 16 years of experience across Films Industry, Investment Banking and Corporate Strategy. He holds an MBA from Faculty of Management Studies (FMS) and Mechanical Engineering degree from Delhi College of Engineering (DCE).",
            "Sentiment": "positive",
            "PublishDate": 1761320041176,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cosmo First Limited: Director Hoshang Sinor Retires from Independent Role, Transitions to Non-Executive Position",
            "Summary": "Hoshang Noshirwan Sinor retired as an Independent Director of Cosmo First Limited on May 21, 2025, after completing his second consecutive term. He transitioned to a Non-Executive Non-Independent Director role starting May 22, 2025, subject to rotation. The Board of Directors and shareholders had previously approved his appointment to the new position in February and March 2025 respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1757132117028,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cosmo First Expands Across Multiple Segments with BOPP Films, PET Recycling, and Specialty Chemicals",
            "Summary": "Cosmo First is expanding its operations across multiple business segments through capacity expansion in BOPP and specialty films, entry into PET recycling, and venturing into specialty chemicals. The company is focusing on value-added products and expanding its global reach as part of its strategy to enhance profit margins.",
            "Sentiment": "positive",
            "PublishDate": 1755102954082,
            "Source": "stock"
        },
        {
            "Title": "Cosmo First Limited Reports Strong Q1 FY26 Results with 38% Jump in Net Profit",
            "Summary": "Cosmo First Limited reported net revenue of Rs 800 crores for Q1 FY26, up from Rs 690 crores in Q1 FY25. Net profit increased to Rs 43 crores from Rs 31 crores in the same quarter last year. EBITDA improved to Rs 116 crores with margins at 14.5%, compared to 12.2% in Q1 FY25. The company attributed the performance to higher volumes (19%), better BOPP film margins, cost rationalization of Rs 4 crores, and enhanced performance of its Specialty Chemicals subsidiary. A new BOPP film line began operations in June, adding 45% to the company's BOPP capacity. The Window film business launched in May 2025 under the 'Sunshield' brand with over 50 distributors. The Specialty Chemical subsidiary posted Rs 12 crores EBITDA on Rs 49 crores revenue. Group CEO Pankaj Poddar stated the company will focus on leveraging new investments, growing specialty film sales, and reducing costs in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1755092403044,
            "Source": "earnings"
        },
        {
            "Title": "Cosmo First Reports Strong Q1 Growth with 36% Jump in EBITDA and Net Profit",
            "Summary": "Cosmo First delivered robust quarterly results with EBITDA rising to 922 million rupees from 677 million rupees year-over-year. The company's EBITDA margin improved to 11.52% compared to 9.82% in the same period last year. Consolidated net profit increased to 429 million rupees from 310 million rupees year-over-year. Revenue grew to 8 billion rupees from 6.9 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755084430709,
            "Source": "earnings"
        },
        {
            "Title": "Cosmo First Limited Approves Unaudited Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Cosmo First Limited's Board of Directors approved the company's unaudited financial results for the quarter ended June 30, 2025, during a board meeting held on August 13, 2025. The Audit Committee reviewed the financial results before board approval, which included a limited review report. The board meeting lasted from 2:15 PM to 4:15 PM. The company has informed BSE Limited and National Stock Exchange of India about this development.",
            "Sentiment": "neutral",
            "PublishDate": 1755084367096,
            "Source": "earnings"
        },
        {
            "Title": "Zigly Expands in Bengaluru with Strategic Acquisition and New Pet Care Centre",
            "Summary": "Zigly has expanded its presence in Bengaluru through a strategic acquisition and launched a multi-speciality pet care centre in Whitefield. The move represents the company's growth strategy in the pet care sector within the Bengaluru market.",
            "Sentiment": "positive",
            "PublishDate": 1753700726225,
            "Source": "stock"
        },
        {
            "Title": "Zigly Opens First Pet Hospital and Experience Center in Mumbai",
            "Summary": "Cosmo First's pet care brand Zigly has opened its first pet hospital and experience center in Mumbai, expanding its presence in Western India.",
            "Sentiment": "positive",
            "PublishDate": 1752741448000,
            "Source": "default"
        },
        {
            "Title": "Cosmo First: BOPP Manufacturing Capacity Expands with New Production Line",
            "Summary": "Cosmo First Ltd has launched a new BOPP film production line in Aurangabad, Maharashtra, increasing its annual BOPP capacity by 40% to 277,000 MTPA. The company's stock rose 5% on the BSE, trading at ₹1246.70.",
            "Sentiment": "positive",
            "PublishDate": 1748846961000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cosmo First Commissions New BOPP Film Line in Maharashtra",
            "Summary": "Cosmo First has announced that its new BOPP (Biaxially Oriented Polypropylene) film line at the company's existing manufacturing plant in Waluj, Maharashtra, has commenced commercial production from June 01, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1748836564000,
            "Source": "default"
        },
        {
            "Title": "Cosmo First Ltd: Stock Surges 60% Despite Red Flags",
            "Summary": "Cosmo First Ltd shares have risen 60% in four sessions, doubling since April 7. Despite 80% YoY profit growth, the company faces increased long-term borrowings, reduced cash flow, negative revenue CAGR, and lower profits compared to FY21-23. The stock is under short-term ASM surveillance. The company plans ₹1,180 crore capex over three years and is increasing BOPP capacity by 40%.",
            "Sentiment": "neutral",
            "PublishDate": 1748333793000,
            "Source": "normal_news"
        },
        {
            "Title": "Cosmo First's New BOPP Film Production Line Nears Commissioning",
            "Summary": "Cosmo First has announced that its new production line for BOPP (Biaxially Oriented Polypropylene) film at Aurangabad is in the final stages of commissioning. This indicates that the company is close to expanding its production capacity for BOPP film.",
            "Sentiment": "positive",
            "PublishDate": 1748321945000,
            "Source": "default"
        },
        {
            "Title": "Cosmo First Reports Q4 Results and Recommends Final Dividend",
            "Summary": "Cosmo First has announced its Q4 financial results and recommended a final dividend. The company's Q4 consolidated net profit increased to 271 million rupees from 154 million rupees year-over-year. Revenue rose to 7.46 billion rupees from 6.4 billion rupees in the same period. EBITDA improved to 703 million rupees from 441.2 million rupees, with EBITDA margin expanding to 9.43% from 6.88%. The company has recommended a final dividend of 4 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747756772000,
            "Source": "result"
        },
        {
            "Title": "Cosmo First Launches Commercial Production of Sunshield Window Films",
            "Summary": "Cosmo First has announced the commencement of commercial production for its new Cosmo Sunshield Window Films. This product launch leverages the company's four decades of experience in film innovation, expanding their product portfolio in the specialty films sector.",
            "Sentiment": "positive",
            "PublishDate": 1746159511000,
            "Source": "default"
        },
        {
            "Title": "Cosmo First Begins Commercial Production of Window Films",
            "Summary": "Cosmo First has announced the commencement of commercial production for their window films product line.",
            "Sentiment": "positive",
            "PublishDate": 1746100312000,
            "Source": "default"
        },
        {
            "Title": "Cosmo First to Acquire Mumbai's Small Animal Clinic for Petcare Division",
            "Summary": "Cosmo First has announced plans to acquire the 'Small Animal Clinic' in Mumbai through a slump sale. This acquisition is aimed at strengthening the company's petcare division, Zigly. The transaction is expected to be completed by May 15, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1745073430000,
            "Source": "default"
        },
        {
            "Title": "Cosmo First Subsidiary Launches COSEAL601 Heat Seal Coating Solution",
            "Summary": "A subsidiary of Cosmo First has introduced COSEAL601, an innovative heat seal coating solution. This product launch represents a new development in the company's offerings, potentially expanding its market presence in the coating industry.",
            "Sentiment": "positive",
            "PublishDate": 1742190312000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cosmo First Commissions New CPP Line at Maharashtra Plant",
            "Summary": "Cosmo First has announced the commencement of commercial production from its new Cast Polypropylene (CPP) line. The production line is located at the company's existing manufacturing plant in Waluj, Chhatrapati Sambhajinagar, Maharashtra. The commercial production is set to begin from March 01, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1740893879000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cosmo First Reports Significant Profit Growth in Q3",
            "Summary": "Cosmo First has announced its Q3 financial results, showing a substantial increase in net profit. The company's consolidated net profit rose to 296 million rupees, up from 114 million rupees in the same quarter last year. Revenue also saw growth, reaching 7.01 billion rupees compared to 6.25 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1739320512000,
            "Source": "earnings"
        },
        {
            "Title": "Cosmo First Reports Significant EBITDA Growth in Q3",
            "Summary": "Cosmo First has announced its Q3 financial results, showing substantial year-over-year improvement. The company's EBITDA increased to 634 million rupees from 423 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 9.04% from 6.77% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739278357000,
            "Source": "earnings"
        },
        {
            "Title": "Cosmo First Reports Significant Increase in Q3 Profit and Revenue",
            "Summary": "Cosmo First has announced its financial results for the third quarter. The company's consolidated net profit rose to 296 million rupees, up from 114 million rupees in the same period last year. Revenue also increased to 7.01 billion rupees from 6.25 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739278351000,
            "Source": "earnings"
        },
        {
            "Title": "Cosmo First Launches Innovative Paint Protection Films for Vehicles",
            "Summary": "Cosmo First has introduced a new line of paint protection films designed to safeguard vehicle exteriors. These revolutionary films come with a lifetime warranty, offering long-term protection for car owners. The product aims to enhance the durability and appearance of vehicle paintwork, potentially positioning Cosmo First as a significant player in the automotive aftermarket industry.",
            "Sentiment": "positive",
            "PublishDate": 1734654926000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cosmo First Launches Innovative Paint Protection Films for Vehicles",
            "Summary": "Cosmo First has introduced a new line of paint protection films designed to safeguard vehicle exteriors. These revolutionary films come with a lifetime warranty, offering long-term protection for automotive paint jobs. This product launch represents a significant addition to Cosmo First's automotive product portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1734608698000,
            "Source": "corporate_action"
        },
        {
            "Title": "COSMO FIRST Reports Strong Q2 Financial Performance",
            "Summary": "COSMO FIRST has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 860 million rupees from 610 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 11.33% from 9.19% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1731499771000,
            "Source": "result"
        },
        {
            "Title": "Cosmo First Reports Significant Profit Growth in Q2",
            "Summary": "Cosmo First announced its Q2 financial results, showing a substantial year-over-year increase in consolidated net profit from 216 million rupees to 458 million rupees. The company also reported a quarter-over-quarter increase from 310 million rupees. Revenue for Q2 rose to 7.6 billion rupees from 6.63 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731499715000,
            "Source": "result"
        }
    ]
}