{
    "Symbol": "COUNCODOS",
    "ISIN": "INE695B01025",
    "News": [
        {
            "Title": "Country Condos Board Meet Set for Feb 13 on Q3 Results",
            "Summary": "Country Condo's Limited schedules board meeting for February 13, 2026 to review Q3FY26 unaudited financial results and discuss merger proposal under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770643958963,
            "Source": "co_actions_results"
        },
        {
            "Title": "Country Condos Limited Reports Quarterly Financial Results for September 2025",
            "Summary": "Country Condos Limited approved unaudited financial results for the quarter ended September 30, 2025, showing net sales of ₹583.47 lakhs and profit after tax of ₹28.53 lakhs with basic earnings per share of ₹0.03. The real estate company's board meeting was held on November 14, 2025, with results reviewed by auditors P. Murali Co., and the company maintains total assets of ₹4,716.53 lakhs as of September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763133739831,
            "Source": "earnings"
        },
        {
            "Title": "Country Condo's Limited Reports Q1 FY2026 Financial Results with Net Profit of ₹13.82 Lakhs",
            "Summary": "Country Condo's Limited approved its unaudited financial results for the quarter ended June 30, 2025, during a board meeting held on August 14, 2025. The real estate company reported net sales of ₹354.40 lakhs compared to ₹120.24 lakhs in the same quarter last year. Net profit after tax stood at ₹13.82 lakhs versus ₹19.35 lakhs in the previous year quarter. Total income increased to ₹354.40 lakhs from ₹123.03 lakhs year-over-year. Basic and diluted earnings per share remained at ₹0.02. The company's paid-up equity share capital is ₹775.97 lakhs with a face value of ₹1 per share. The results were reviewed by M/s. P. Murali & Co., Chartered Accountants, and the company operates exclusively in real estate activities.",
            "Sentiment": "neutral",
            "PublishDate": 1755171071970,
            "Source": "earnings"
        }
    ]
}