{
    "Symbol": "CPCAP",
    "ISIN": "INE521J01018",
    "News": [
        {
            "Title": "CP Capital Reports Strong Q3FY26 Results",
            "Summary": "CP Capital Limited delivered robust Q3FY26 performance with consolidated PAT surging 43.9% YoY to Rs. 1,249.71 lakhs and standalone interest income growing 17.8% YoY to Rs. 1,387.14 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770910580797,
            "Source": "co_actions_results"
        },
        {
            "Title": "CP Capital Limited Reports Strong Q2 FY26 Results with Significant Profit Growth",
            "Summary": "CP Capital Limited announced quarterly results for the period ended September 30, 2025, showing standalone profit after tax of Rs. 819.72 lakhs and consolidated profit after tax of Rs. 1,016.36 lakhs. The company's board approved unaudited financial results along with asset-liability statements and cash flow statements, with earnings per share of Rs. 4.50 on standalone basis and Rs. 5.59 on consolidated basis.",
            "Sentiment": "positive",
            "PublishDate": 1763144056321,
            "Source": "earnings"
        },
        {
            "Title": "CP Capital's Subsidiary Forms Partnership Firm 'Sankalp Associates' for Real Estate Projects",
            "Summary": "Career Point Infra Limited (CPIL), a material subsidiary of CP Capital Limited, has entered into a partnership agreement with Mr. Pritam Singh to form 'Sankalp Associates'. CPIL holds a 99% partnership interest while Mr. Pritam Singh holds 1%. The partnership will operate as an independent business vertical for infrastructure and real estate development projects, aimed at strengthening CPIL's strategic presence in the sector. The initial capital contribution is INR 10 lakhs, with CPIL contributing up to INR 9.90 lakhs and Mr. Pritam Singh contributing INR 0.10 lakhs. CPIL will have primary management and decision-making authority. The transaction does not involve related parties and requires no regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1761400415257,
            "Source": "order&deals"
        },
        {
            "Title": "CP Capital's Subsidiary Forms Partnership Firm 'OPN Associates' for Infrastructure Projects",
            "Summary": "Career Point Infra Limited (CPIL), a material subsidiary of CP Capital Limited, has entered into a partnership agreement with Mr. Pritam Singh to form 'OPN Associates'. CPIL holds 99% partnership interest while Mr. Pritam Singh holds 1%. The partnership will operate as an independent business vertical for infrastructure and real estate development projects. Initial capital contribution is INR 10 lakhs, with CPIL contributing up to INR 9.90 lakhs and Mr. Pritam Singh contributing INR 0.10 lakhs. The partnership aims to strengthen CPIL's strategic presence and operational capabilities in the real estate and infrastructure development sector. CPIL will have primary management and decision-making authority in the partnership.",
            "Sentiment": "positive",
            "PublishDate": 1761400078673,
            "Source": "order&deals"
        },
        {
            "Title": "CP Capital Promoter Pramod Maheshwari Acquires 3,062 Equity Shares Through Open Market Purchase",
            "Summary": "Pramod Maheshwari, Promoter, Chairman & Managing Director of CP Capital Limited, acquired 3,062 equity shares through open market purchase on August 18, 2025. The acquisition increased his shareholding from 21,16,003 shares (11.630%) to 21,19,065 shares (11.647%) of the company's total diluted share capital. The transaction resulted in a change in the total shareholding of the promoter and promoter group. CP Capital Limited was formerly known as Career Point Limited and has a paid-up capital of ₹18,19,29,390 consisting of 1,81,92,939 equity shares of ₹10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1755596772564,
            "Source": "corporate_action"
        },
        {
            "Title": "CP Capital Limited Reports Q1 FY26 Results as Registered NBFC, Announces 25th AGM",
            "Summary": "CP Capital Limited reported its quarterly results for the period ended June 30, 2025, marking its first set of results as a registered NBFC after receiving Certificate of Registration on April 1, 2025. On consolidated basis, revenue from operations was ₹1,488.98 lakh (up 8.5% QoQ, down 12.2% YoY), while profit after tax increased to ₹1,077.99 lakh (up 25.3% QoQ, down 13.1% YoY). The company recognized ₹159.88 lakh of expected credit loss provisions during the quarter. The Board approved holding the 25th Annual General Meeting on September 29, 2025, with book closure from September 23-29, 2025. E-voting facility will be available from September 25-28, 2025. The company recommended appointment of new statutory auditor M/s S P Chopra & Co. and company secretary M/s Bharat Rathore & Associates for five-year terms, subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1755084095747,
            "Source": "earnings"
        },
        {
            "Title": "Career Point Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Career Point, an educational services company, has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased from 205 million rupees to 177 million rupees year-over-year. Additionally, the EBITDA margin fell from 77.21% to 65.92% compared to the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1739523914000,
            "Source": "earnings"
        },
        {
            "Title": "Career Point Reports Q3 Revenue of 268 Million Rupees",
            "Summary": "Career Point, an education company, has reported its third quarter revenue of 268 million rupees, compared to 265 million rupees in the same period last year. This represents a slight year-over-year increase in revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1739523874000,
            "Source": "earnings"
        },
        {
            "Title": "Career Point Reports Q3 Consolidated Net Profit of 132 Million Rupees",
            "Summary": "Career Point, an education company, has reported its third-quarter consolidated net profit at 132 million rupees, compared to 150 million rupees in the same period last year. This represents a year-over-year decrease in profit.",
            "Sentiment": "neutral",
            "PublishDate": 1739523804000,
            "Source": "earnings"
        }
    ]
}