{
    "Symbol": "CPEDU",
    "ISIN": "INE0P6P01016",
    "News": [
        {
            "Title": "Career Point Edutech Q3FY26: EBITDA Up 24% YoY",
            "Summary": "Career Point Edutech reports strong Q3FY26 results with consolidated revenue of ₹1,463.08 lacs and 879 bps EBITDA margin expansion in 9MFY26, demonstrating operating leverage in asset-light model.",
            "Sentiment": "positive",
            "PublishDate": 1770651929988,
            "Source": "co_actions_results"
        },
        {
            "Title": "Career Point Edutech Board Meet on Feb 9, 2026",
            "Summary": "Career Point Edutech Limited has scheduled its board meeting for February 09, 2026, to consider Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769796906915,
            "Source": "co_actions_results"
        },
        {
            "Title": "Career Point Edutech Reports 35% Jump in Net Profit, Declares Rs 2.50 Interim Dividend",
            "Summary": "Career Point Edutech Limited reported strong financial performance for the half-year period ended September 30, 2025. On a consolidated basis, the company achieved total revenue of Rs 28.34 crore with 8.3% year-on-year growth. Net profit surged 35.44% to Rs 12.25 crore, while EBITDA grew 38.25% to Rs 14.3 crore with margins expanding to 59.06%. The company's standalone results showed similar strength with revenue of Rs 27.47 crore and net profit of Rs 11.81 crore, up 34.20% year-on-year. The Board approved an interim dividend of Rs 2.50 per share (25% on face value of Rs 10) for FY 2025-26, with record date set for November 21, 2025. The company also adopted a dividend distribution policy allowing payouts of up to 40% of net profit. Performance was driven by growth in Formal Education and Student Support Services segments, along with strengthening of the Test Preparation segment through franchise model and hybrid delivery approach.",
            "Sentiment": "positive",
            "PublishDate": 1762990513804,
            "Source": "corporate_action"
        },
        {
            "Title": "Career Point Edutech Reports 21% Rise in Q2 Net Profit Despite Revenue Decline",
            "Summary": "Career Point Edutech posted a consolidated net profit of 50.7 million rupees in Q2, up from 41.9 million rupees in the same period last year. However, revenue declined to 114 million rupees from 121 million rupees year-on-year. EBITDA increased to 52.7 million rupees from 51.5 million rupees, while EBITDA margin improved to 46.13% from 42.47% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762958877090,
            "Source": "earnings"
        }
    ]
}