{
    "Symbol": "CPPLUS",
    "ISIN": "INE819V01029",
    "News": [
        {
            "Title": "Aditya Infotech Q3FY26 Earnings Call on Feb 13",
            "Summary": "Aditya Infotech Limited announces earnings conference call scheduled for February 13, 2026 at 11:30 AM IST to discuss Q3FY26 financial results with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1770657206908,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Infotech Incorporates Taiwan Subsidiary",
            "Summary": "Aditya Infotech Limited successfully incorporated its wholly owned subsidiary Aditya Infotech Taiwan Co. Ltd. on February 02, 2026, with initial investment of NT$ 5 million for R&D activities in security and surveillance equipment.",
            "Sentiment": "positive",
            "PublishDate": 1770044842218,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aditya Infotech Wins Major Tax Appeal Relief",
            "Summary": "Aditya Infotech receives substantial relief in income tax appeal with Commissioner allowing deletion of ₹36.78 crores from original ₹40.38 crore addition, reducing net liability to ₹3.60 crores for AY 2019-20.",
            "Sentiment": "positive",
            "PublishDate": 1768569493800,
            "Source": "stocks"
        },
        {
            "Title": "Aditya Infotech faces ₹30.86 cr customs penalty order",
            "Summary": "Aditya Infotech receives customs penalty order worth ₹30.86 crores from Chennai Customs for alleged incorrect duty exemption on 4G router imports. Company plans to appeal the order.",
            "Sentiment": "negative",
            "PublishDate": 1768466303848,
            "Source": "stocks"
        },
        {
            "Title": "Aditya Infotech partners with Vijay Sethupathi",
            "Summary": "Aditya Infotech Limited announces collaboration with acclaimed actor Vijay Sethupathi as Brand Ambassador to strengthen consumer presence in Tamil Nadu through integrated campaigns.",
            "Sentiment": "positive",
            "PublishDate": 1768457818051,
            "Source": "stocks"
        },
        {
            "Title": "Aditya Infotech Partners With Qualcomm For AI Solutions",
            "Summary": "Aditya Infotech Limited announces partnership with Qualcomm to deliver AI video intelligence solutions in India, combining CP Plus distribution network with Qualcomm's edge AI technology.",
            "Sentiment": "positive",
            "PublishDate": 1765440018370,
            "Source": "stocks"
        },
        {
            "Title": "Aditya Infotech Reports 37.5% Revenue Growth to INR 919.6 Crores in Q2 FY26",
            "Summary": "Aditya Infotech delivered strong quarterly results with revenue growing 37.5% year-on-year to INR 919.6 crores, driven by robust demand for CP PLUS branded IP cameras and certified models under new STQC norms. The company expanded EBITDA margins to 12% and PAT by 239% to INR 70 crores, while increasing manufacturing capacity to 1.8 million units per month and planning to launch two new brands - Eyra and Nexiview - at IFSEC 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763536490644,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Infotech Reports No Deviation in IPO Proceeds Utilization for Q2 FY2025-26",
            "Summary": "Aditya Infotech Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing no deviation from stated IPO objectives. The company raised INR 1,300 crores through its IPO, comprising INR 500 crores fresh issue and INR 800 crores offer for sale. Net proceeds of INR 471.616 crores were allocated for prepayment of borrowings (INR 375 crores) and general corporate purposes (INR 96.616 crores). The company has fully utilized INR 375 crores for debt repayment while INR 94.713 crores remains deployed in fixed deposits with Tamil Nadu Mercantile Bank Limited, earning 6.95% returns. Acuite Ratings Research Limited, the monitoring agency, confirmed no material deviation from the offer document objectives and no unfavorable events affecting project viability.",
            "Sentiment": "positive",
            "PublishDate": 1763030543407,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Infotech Reports Strong Growth in Quarterly Results Following Recent IPO",
            "Summary": "Aditya Infotech Limited announced its quarterly results for the quarter and half-year ended September 30, 2025. The company completed its Initial Public Offering (IPO) of 19,267,928 equity shares at Rs. 675 per share, comprising an offer for sale of 11,851,849 shares aggregating Rs. 8,000 million and a fresh issue of 7,416,079 shares aggregating Rs. 5,000 million. The equity shares were listed on NSE and BSE on August 5, 2025. The IPO proceeds are intended for repayment of certain borrowings availed by the company and general corporate purposes. The Board of Directors approved the unaudited financial results at their meeting held on November 12, 2025. The company operates in trading of security and surveillance equipment and related activities as its main business.",
            "Sentiment": "positive",
            "PublishDate": 1762974898277,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Infotech Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Aditya Infotech reported quarterly results showing net profit of 700 million rupees compared to 2.34 billion rupees in the same period last year. Revenue increased to 9.2 billion rupees from 6.69 billion rupees year-over-year. EBITDA rose to 1.26 billion rupees from 546 million rupees, while EBITDA margin improved to 13.71% from 8.16% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762955154959,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Infotech Schedules Q2FY26 Results Conference Call for November 13, 2025",
            "Summary": "Aditya Infotech Limited has announced an earnings conference call for investors and analysts to discuss Q2FY26 results. The call is scheduled for Thursday, November 13, 2025, at 15:30 hrs India Time. The company will be represented by Managing Director Aditya Khemka, President-Strategy Business Development Anup Nair, and Chief Financial Officer Yogesh Sharma. ICICI Securities is coordinating the conference call, which will provide universal access numbers and toll-free numbers for participants from Hong Kong, Singapore, UK, and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1762438905508,
            "Source": "earnings"
        },
        {
            "Title": "CP Plus Partners With L&T Semiconductor to Produce 9 Million IP Cameras Over Three Years",
            "Summary": "CP Plus has formed a partnership with L&T Semiconductor to develop next-generation IP cameras. The collaboration aims to produce 9 million CCTV IP cameras over a three-year period. The cameras will feature high-resolution imaging capabilities and enhanced cybersecurity features.",
            "Sentiment": "positive",
            "PublishDate": 1760521534707,
            "Source": "order&deals"
        },
        {
            "Title": "CP Plus Parent Aditya Infotech Targets 25-30% Revenue Growth in FY26",
            "Summary": "Aditya Infotech Ltd., parent company of security solutions brand CP Plus, expects to achieve 25-30% revenue growth and 10-11% EBITDA margin in FY26. Managing Director Aditya Khemka attributes the optimistic outlook to new government cybersecurity regulations for IP and Wi-Fi cameras that took effect April 9, which require stringent certification and ban Chinese semiconductors. These regulations have eliminated approximately 35% of the market previously held by Chinese brands. The company has restructured its supply chains away from China over two years, now sourcing semiconductors from Taiwanese and American companies. CP Plus aims to build capacity to serve half of India's surveillance solutions demand by March 2026 and is partnering with L&T Semiconductor Technologies to develop camera chips domestically. Company shares closed 3.18% lower at Rs 1,399.9.",
            "Sentiment": "positive",
            "PublishDate": 1758352604784,
            "Source": "stock"
        },
        {
            "Title": "Aditya Infotech Limited Approves Incorporation of Wholly Owned Subsidiary in Taiwan",
            "Summary": "Aditya Infotech Limited's Board of Directors approved the incorporation of a wholly owned subsidiary named 'Aditya Infotech Taiwan Co. Ltd.' during a board meeting held on September 18, 2025. The Taiwan-based subsidiary will operate in the industrial products sector, focusing on research and development activities related to security and surveillance equipment. The company plans an initial investment of NT$5 million in one or more tranches through cash consideration. Aditya Infotech Limited will hold 100% of the subsidiary's share capital. The incorporation is subject to regulatory approval from relevant authorities.",
            "Sentiment": "positive",
            "PublishDate": 1758195159613,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Infotech Reports 16.4% Revenue Growth in Q1 FY2026, Raises Rs. 1,300 Crores Through IPO",
            "Summary": "Aditya Infotech Limited reported revenue of Rs. 740 crores for the quarter ended June 30, 2025, marking 16.4% year-over-year growth. The company's EBITDA increased 47.5% to Rs. 64.9 crores with margin improvement of 180 basis points to 8.7%. PAT grew 46.1% to Rs. 32.9 crores with margin expanding 90 basis points to 4.4%. The company completed its IPO in August 2025, raising Rs. 1,300 crores and used Rs. 375 crores to reduce gross debt by 89% from Rs. 423 crores to Rs. 48 crores. Aditya Infotech holds 20.8% market share in India's video security and surveillance market and is the third largest manufacturer globally by units. The company provided revenue guidance of Rs. 3,900-4,100 crores for FY2026 with EBITDA margin guidance of 10-11% and PAT margin of 6-7%. Management plans Rs. 200 crores CAPEX over two years to expand manufacturing capacity from 1.5 million to 2.3-2.4 million units per month.",
            "Sentiment": "positive",
            "PublishDate": 1756131593856,
            "Source": "earnings"
        },
        {
            "Title": "Aditya Infotech Reports 16.4% Revenue Growth to Rs 7,400 Crores in Q1 FY2026, Profit Jumps 46.1%",
            "Summary": "Aditya Infotech Limited, a manufacturer and trader of security and surveillance equipment, reported consolidated revenue of Rs 7,400.37 crores for Q1 FY2026, marking a 16.4% year-on-year increase from Rs 6,360.20 crores in Q1 FY2025. However, revenue declined 24.3% sequentially from Q4 FY2025's Rs 9,774.35 crores. Consolidated profit after tax surged 46.1% year-on-year to Rs 328.78 crores compared to Rs 225.08 crores in the previous year, though it fell 40.2% from Q4 FY2025's Rs 549.60 crores. The company's PAT margin improved to 4.44% from 3.54% in the same quarter last year. Basic and diluted earnings per share stood at Rs 2.99. The company recently completed its IPO and got listed on NSE and BSE on August 5, 2025, raising Rs 500 crores through fresh share issuance. Aditya Infotech operates through two wholly-owned subsidiaries and is expanding manufacturing capacity with a new facility in Noida, having invested Rs 230.29 crores in the project. The company also acquired the remaining 50% stake in AIL Dixon Technologies Private Limited in September 2024, making it a wholly-owned subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1755608680455,
            "Source": "earnings"
        }
    ]
}