{
    "Symbol": "CRAFTSMAN",
    "ISIN": "INE00LO01017",
    "News": [
        {
            "Title": "Craftsman Automation Sets Up New Plant in Punjab",
            "Summary": "Craftsman Automation's board approves ₹60 crore investment for new manufacturing facility in Ludhiana, Punjab, with 90% loan funding and expected 5% capacity increase within 9-12 months.",
            "Sentiment": "positive",
            "PublishDate": 1769587723729,
            "Source": "stocks"
        },
        {
            "Title": "Craftsman Automation Q3 Net Profit Surges to ₹1.1B",
            "Summary": "Craftsman Automation reports remarkable Q3 consolidated net profit of ₹1.1 billion, representing significant year-on-year growth from ₹129 million in the previous year period.",
            "Sentiment": "positive",
            "PublishDate": 1769586931303,
            "Source": "co_actions_results"
        },
        {
            "Title": "Craftsman Automation faces ₹962.89 lakh GST demand",
            "Summary": "Commissioner (Appeals), Gurugram upholds GST tax demand and penalty of ₹962.89 lakhs each against Craftsman Automation. Company plans appeal, expects no material impact on operations.",
            "Sentiment": "negative",
            "PublishDate": 1768484474442,
            "Source": "stocks"
        },
        {
            "Title": "Craftsman Automation Block Trade Worth ₹29.57 Cr",
            "Summary": "Craftsman Automation executed a significant NSE block trade worth ₹29.57 crores involving 37,797 shares at ₹7,824.00 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768374500722,
            "Source": "co_actions_results"
        },
        {
            "Title": "Craftsman Automation Earnings Call on Jan 29 for Q3FY26",
            "Summary": "Craftsman Automation scheduled earnings conference call on January 29, 2026 at 4:00 PM IST to discuss Q3FY26 financial results. Board meeting set for January 28, 2026 to approve unaudited results.",
            "Sentiment": "neutral",
            "PublishDate": 1767592325958,
            "Source": "co_actions_results"
        },
        {
            "Title": "Craftsman Automation Completes First Asset Sale Tranche",
            "Summary": "Craftsman Automation's subsidiary Sunbeam completes first tranche of asset sale to Shriram Pistons & Rings for ₹10 crores, with remaining ₹18 crores expected by March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767176634533,
            "Source": "co_actions_results"
        },
        {
            "Title": "Craftsman Automation: Dr Axion Acquires Suprash For ₹145.85 Cr",
            "Summary": "Dr Axion, subsidiary of Craftsman Automation, completed acquisition of Suprash Developers and its subsidiary Srikara Technologies for ₹145.85 crore to establish new Chennai manufacturing facility.",
            "Sentiment": "positive",
            "PublishDate": 1766150227077,
            "Source": "co_actions_results"
        },
        {
            "Title": "Craftsman Automation Subsidiary Converts Securities",
            "Summary": "Craftsman Automation's wholly-owned subsidiary Sunbeam Lightweighting Solutions converts ₹97.60 crores worth of CCPS and OCDs into equity shares while maintaining 100% ownership structure.",
            "Sentiment": "neutral",
            "PublishDate": 1766147520519,
            "Source": "co_actions_results"
        },
        {
            "Title": "Craftsman Automation Gets Credit Rating Reaffirmation",
            "Summary": "CRISIL reaffirms AA-/Stable rating for Craftsman Automation and subsidiary DRAxion, enhancing bank facilities to ₹3,950 crores from ₹2,300 crores amid strong aluminum segment growth.",
            "Sentiment": "positive",
            "PublishDate": 1765601607680,
            "Source": "stocks"
        },
        {
            "Title": "Craftsman Automation Partners With Viksha Green Energy",
            "Summary": "Craftsman Automation announces strategic partnership with Viksha Green Energy for solar power investment, marking the company's entry into renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1765542014650,
            "Source": "stocks"
        },
        {
            "Title": "Craftsman Automation CTO for Aluminium Products Ajay Battu to Resign",
            "Summary": "Craftsman Automation announced that Ajay Battu will resign from his position as Chief Technical Officer for Aluminium Products, with the resignation taking effect on November 27, 2025. The departure affects the company's aluminium products division leadership structure and technical operations oversight.",
            "Sentiment": "neutral",
            "PublishDate": 1764248420800,
            "Source": "corporate_governance"
        },
        {
            "Title": "PI Opportunities AIF V LLP Acquires 1.48 Lakh Shares in Craftsman Auto",
            "Summary": "PI Opportunities AIF V LLP purchased 1.48 lakh shares of Craftsman Auto through open market transactions. The acquisition represents institutional investor activity in the company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1763391598191,
            "Source": "stock"
        },
        {
            "Title": "Craftsman Automation Reports Strong H1 Performance with Sales Rising to INR 3,786 Crores",
            "Summary": "Craftsman Automation Limited reported consolidated sales of INR 3,786 crores for H1 compared to INR 2,365 crores in the previous year. The Powertrain segment contributed INR 2,034 crores, Aluminum Products INR 2,275 crores, and Industrial Engineering INR 476 crores. EBITDA stood at INR 582 crores with margins at 15% and EBIT margins at 10%. The company's net debt-to-EBITDA ratio is 0.94 on consolidated basis and 2.46 annualized. The Kothavadi plant is operational at phase-I level for engineering products, with revenue streams for Powertrain portion expected to start in 2029. The company has an order book of 100 million with 50 million confirmed and products under development. Sunbeam business achieved quarterly run rate of INR 330 crores with management targeting double-digit EBITDA margins for FY27. The company plans CAPEX of around INR 1,000 crores for Craftsman with new CAPEX based on minimum 20% ROCE threshold. Commercial vehicles contribute 46% to Powertrain segment, off-highway 21%, tractors 19%, and passenger vehicles/SUVs 14%. The Hosur plant started commercial operations with capacity utilization improving in aluminum business.",
            "Sentiment": "positive",
            "PublishDate": 1762962298393,
            "Source": "earnings"
        },
        {
            "Title": "Craftsman Automation Reports Strong Q2 FY26 Results with 56% Revenue Growth",
            "Summary": "Craftsman Automation Limited released its investor presentation for the quarter and half year ended September 30, 2025. The company reported consolidated revenue of ₹2,002 crores in Q2 FY26, marking a 56% year-over-year growth from ₹1,284 crores in Q2 FY25. Half-yearly revenue reached ₹3,786 crores in H1 FY26, up 46% from ₹2,595 crores in H1 FY25. EBITDA for Q2 FY26 was ₹312 crores (47% YoY growth) with half-yearly EBITDA at ₹582 crores (45% YoY growth). The company operates across three main business segments: Powertrain (contributing ₹1,034 crores in H1 FY26), Aluminium Products (₹2,275 crores), and Industrial & Engineering (₹476 crores). Craftsman Automation is a diversified engineering company with 24 vertically integrated manufacturing facilities across 9 states in India and 1 plant in Germany, serving automotive, industrial, and engineering sectors.",
            "Sentiment": "positive",
            "PublishDate": 1762752427331,
            "Source": "earnings"
        },
        {
            "Title": "Craftsman Automation Reports 47% Jump in Q2 Net Profit to 908.6 Million Rupees",
            "Summary": "Craftsman Automation reported quarterly net profit of 908.6 million rupees compared to 616.9 million rupees in the same period last year. Revenue increased to 20.01 billion rupees from 12.14 billion rupees year-over-year. EBITDA rose to 3.02 billion rupees from 1.93 billion rupees, while EBITDA margin decreased to 15.08% from 15.88% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762590943791,
            "Source": "earnings"
        },
        {
            "Title": "Craftsman Automation Reports Q2 FY26 Financial Results",
            "Summary": "Craftsman Automation Limited announced its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The Board of Directors approved the results at their meeting held on November 8, 2025. The company operates through three reportable segments: Power Train, Aluminium Products, and Industrial Engineering. The results include financial data from subsidiaries across India, Netherlands, and Germany, as well as a joint venture. The statutory auditors have issued unmodified review conclusions on the financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1762590142991,
            "Source": "earnings"
        },
        {
            "Title": "Craftsman Automation Subsidiary Plans ₹280 Crore Chennai Plant to Boost Aluminium Capacity",
            "Summary": "Craftsman Automation's subsidiary Dr Axion India will establish a new manufacturing plant in Chennai with an investment of ₹280 crore. The facility aims to expand the company's aluminium product capacity by 15% over the next 24 months.",
            "Sentiment": "positive",
            "PublishDate": 1761739901911,
            "Source": "stock"
        },
        {
            "Title": "Craftsman Automation Commences Operations at New Shoolagiri Plant",
            "Summary": "Craftsman Automation Limited has started commercial operations at its new manufacturing plant located in Shoolagiri, Hosur. The plant began operations on October 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760595544874,
            "Source": "stock"
        },
        {
            "Title": "Craftsman Automation Invests Rs 2.6 Lakh in Solar Power Company for Group Captive Scheme",
            "Summary": "Craftsman Automation Limited has made an equity investment of Rs 2,60,000 in Eastsquare Energy India Private Limited (EEIPL), acquiring 26,000 equity shares with a face value of Rs 10 each. This investment gives Craftsman a 26% shareholding in EEIPL. The investment is made for purchasing solar power under the Group Captive Scheme in compliance with the Electricity Act, 2003. EEIPL is engaged in power generation and transmission business, was incorporated on September 26, 2023, and reported a turnover of Rs 61.76 crores for FY 2024-25. The transaction is not a related party transaction and no promoters or group companies have any interest in the acquired entity. The investment was made through cash consideration.",
            "Sentiment": "neutral",
            "PublishDate": 1757337012064,
            "Source": "order&deals"
        },
        {
            "Title": "Craftsman Automation Invests in Three Solar Power Companies Under Group Captive Scheme",
            "Summary": "Craftsman Automation Limited made equity investments totaling Rs. 3.74 lakh in three private companies - Silver Brook Farms Private Limited (Rs. 1.28 lakh for 20.50% stake), Dambo Farms Private Limited (Rs. 1.23 lakh for 20.50% stake), and Goldi Gold Private Limited (Rs. 1.23 lakh for 21.33% stake). The investments were made for solar power purchase under the Group Captive Scheme as required by the Electricity Act, 2003. All three entities are engaged in power generation and transmission business but have not commenced operations yet, with zero turnover reported. The transactions were completed through cash consideration and do not constitute related party transactions.",
            "Sentiment": "neutral",
            "PublishDate": 1757146711794,
            "Source": "stock"
        },
        {
            "Title": "Craftsman Automation Begins Operations at New Faridabad Unit-3",
            "Summary": "Craftsman Automation has started work at its Faridabad Unit-3 facility. The company is relocating operations to Units 2 and 3 as part of efforts to enhance operational efficiency and reduce costs.",
            "Sentiment": "positive",
            "PublishDate": 1754916051228,
            "Source": "stock"
        },
        {
            "Title": "Craftsman Automation Reports Strong Q1 Results with 15% EBITDA Margin, Maintains FY26 Revenue Guidance",
            "Summary": "Craftsman Automation delivered robust quarterly results with consolidated EBITDA margin of 15% and net debt to EBITDA ratio of 2.27. The company's subsidiaries showed strong performance with DR Axion generating INR408 crores revenue, Sunbeam at INR291 crores, and Craftsman Germany at INR67 crores. The aluminum segment demonstrated significant growth of 56% year-on-year in standalone business, driven by traditional aluminum operations and alloy wheel ramp-up at Bhiwadi facility. Powertrain margins improved to 15.2% despite industry slowdown, benefiting from optimized costs and stable operations. The company successfully completed Sunbeam's Gurgaon plant closure and equipment relocation. Management maintains full-year guidance of INR70 billion revenue and INR11 billion EBITDA, with consolidated capex planned at INR800 crores. The Kothavadi plant has secured over 50% of its $100 million revenue target for 2030, with production expected to commence in FY27. Net debt stands at INR2,400 crores consolidated, with land sale from Gurgaon operations expected to reduce debt levels.",
            "Sentiment": "positive",
            "PublishDate": 1754308707671,
            "Source": "earnings"
        },
        {
            "Title": "Craftsman Automation Invests in Two Solar Power Companies Under Group Captive Scheme",
            "Summary": "Craftsman Automation Limited has made equity investments in two solar power companies - Altilium Solar 1 Private Limited (ASPL1) and Altilium Solar 3 Private Limited (ASPL3) - for solar power under the Group Captive Scheme as required under the Electricity Act, 2003. The company invested Rs. 16,97,564 for 866 equity shares in ASPL1, acquiring an 8.66% shareholding. In ASPL3, Craftsman invested Rs. 1,34,35,500 for 2,600 equity shares, securing a 26% stake. ASPL1, incorporated in March 2023, reported a turnover of Rs. 5,42,40,000 for FY 2024-25. ASPL3, incorporated in May 2025, has not yet commenced operations and reported nil turnover. Both investments were made through cash consideration and do not constitute related party transactions. The entities are engaged in power generation and transmission.",
            "Sentiment": "neutral",
            "PublishDate": 1754307997148,
            "Source": "stock"
        },
        {
            "Title": "Craftsman Automation Reports Margin Decline to 14% While Maintaining Revenue Targets",
            "Summary": "Craftsman Automation reported a margin drop from 20-21% to approximately 14% due to product mix changes and growth in the aluminum business with pass-through pricing. The company projects Rs. 800 crore consolidated capex for FY26 and targets a 20-25% growth rate. It expects 20-25% CAGR in the aluminum segment over the next four years. The company maintains its full-year revenue target at Rs. 70 billion, EBITDA at Rs. 11 billion, and EBIT between Rs. 6.5-7 billion. The storage business is expected to achieve 15% revenue growth with EBITDA margins close to 4%.",
            "Sentiment": "neutral",
            "PublishDate": 1753932401061,
            "Source": "stock"
        },
        {
            "Title": "Craftsman Automation Reports 31% Jump in Q1 Net Profit to 696 Million Rupees",
            "Summary": "Craftsman Automation reported Q1 consolidated net profit of 696 million rupees compared to 532 million rupees in the same period last year. The company's revenue grew significantly to 17.8 billion rupees from 11.5 billion rupees year-over-year. EBITDA increased to 2.65 billion rupees from 1.97 billion rupees, though EBITDA margin declined to 14.85% from 17.14% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753776867599,
            "Source": "earnings"
        },
        {
            "Title": "Craftsman Automation Shareholders Approve All Resolutions at 39th AGM Including ₹5 Final Dividend and Subsidiary Property Sale",
            "Summary": "Craftsman Automation Limited held its 39th Annual General Meeting on July 21, 2025, via video conference, with all proposed resolutions receiving shareholder approval. Key approvals included adoption of financial statements for the year ended March 31, 2025, declaration of a final dividend of ₹5 per equity share (100% dividend), and reappointment of director Ravi Gauthamram who was retiring by rotation. Shareholders also approved the reappointment of Sharp & Tannan as statutory auditors for a second five-year term and appointed KSR & Co Company Secretaries LLP as secretarial auditors for five years. Additionally, they ratified cost auditor remuneration for the year ending March 31, 2026, and approved the sale of land and buildings belonging to wholly-owned subsidiary Sunbeam Lightweighting Solutions Private Limited located in Gurgaon, Haryana. A total of 312 shareholders participated in the remote e-voting process, with voting conducted both prior to and during the AGM.",
            "Sentiment": "positive",
            "PublishDate": 1753275700143,
            "Source": "corporate_action"
        },
        {
            "Title": "Craftsman Automation Invests in Two Solar Power Companies Under Group Captive Scheme",
            "Summary": "Craftsman Automation Limited made equity investments in Mastertex Export Private Limited and Tara Green Power Private Limited for solar power under the Group Captive Scheme as required by the Electricity Act, 2003. The company invested Rs. 2,60,000 for a 26% stake in MEPL and Rs. 22,000 for an 11% stake in TGPPL. Both investments were completed on July 23, 2025, through cash consideration. MEPL, incorporated in October 2023, is engaged in solar power generation and transmission but has not commenced operations. TGPPL, incorporated in May 2023, is also in power generation and transmission with a turnover of Rs. 1,19,96,639 for FY 2024-25. The investments do not fall under related party transactions, and no promoters or group companies have any interest in these entities.",
            "Sentiment": "neutral",
            "PublishDate": 1753274141290,
            "Source": "stock"
        },
        {
            "Title": "Craftsman Automation Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 30,513 shares of Craftsman Automation Ltd. occurred on the National Stock Exchange (NSE) for Rs. 18.15 Crores. The trade was executed at a price of Rs. 5949.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1751607410000,
            "Source": "block_details"
        },
        {
            "Title": "Craftsman Automation Invests in Green Energy Firms",
            "Summary": "Craftsman Automation has invested in three green energy companies under a group captive scheme for solar and wind power compliance. The investment is aimed at meeting the company's renewable energy requirements.",
            "Sentiment": "positive",
            "PublishDate": 1748228642000,
            "Source": "default"
        },
        {
            "Title": "Craftsman Automation: ICICI Securities Maintains 'Buy' Rating, Raises Target Price",
            "Summary": "Craftsman Automation invested Rs 10 billion in FY25, including acquisitions and stake purchases. The company expects capex to reduce to Rs 7.5-8 billion in FY26. They guide for revenue/Ebitda of Rs 70 billion in the future.",
            "Sentiment": "positive",
            "PublishDate": 1746798782000,
            "Source": "result"
        },
        {
            "Title": "Craftsman Automation Reports Q4 FY2023 Financial Results",
            "Summary": "Craftsman Automation announced its Q4 financial results. Revenue increased to 17 billion rupees from 11 billion rupees year-over-year. EBITDA rose to 2.44 billion rupees from 2.1 billion rupees, but EBITDA margin decreased to 13.93% from 18.72%. Consolidated net profit grew to 668 million rupees from 623 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1746607077000,
            "Source": "result"
        },
        {
            "Title": "Craftsman Automation Ltd. Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) for Craftsman Automation Ltd. The trade involved approximately 142,740 shares, valued at Rs. 59.61 crores. The shares were traded at a price of Rs. 4176.2 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1738308508000,
            "Source": "block_deals"
        },
        {
            "Title": "Craftsman Automation: Q3 Profit Plummets 82% Despite Revenue Surge",
            "Summary": "Craftsman Automation's Q3 FY25 results show revenue up 39.51% YoY to ₹1576.09 crore, but profit down 82.32% to ₹12.93 crore. EPS fell 77.21% to ₹7.98. Rising operational costs, including a 74.79% increase in SG&A expenses, impacted profitability. Operating income decreased 46.14% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1738217243000,
            "Source": "earnings"
        },
        {
            "Title": "Craftsman Automation Reports Inventory Loss of 1.9 Billion",
            "Summary": "Craftsman Automation has reported a change in inventories resulting in a loss of 1.9 billion. This indicates a significant decrease in the value of the company's inventory, which could impact its financial performance.",
            "Sentiment": "negative",
            "PublishDate": 1738138850000,
            "Source": "earnings"
        },
        {
            "Title": "Craftsman Automation Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Craftsman Automation has reported its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 1.99 billion rupees from 2.2 billion rupees in the same quarter last year. Additionally, the EBITDA margin dropped to 12.62% from 19.49% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738138738000,
            "Source": "earnings"
        },
        {
            "Title": "Craftsman Automation Reports Significant Revenue Growth in Q3",
            "Summary": "Craftsman Automation has announced its third-quarter revenue results, showing a substantial increase from 11.2 billion rupees to 15.8 billion rupees year-over-year. This represents a growth of approximately 41% in the company's revenue for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738138682000,
            "Source": "earnings"
        },
        {
            "Title": "Craftsman Automation Reports Significant Decline in Q3 Net Profit",
            "Summary": "Craftsman Automation, an Indian manufacturing company, has reported a substantial decrease in its consolidated net profit for the third quarter. The company's net profit fell to 129 million rupees, compared to 731 million rupees in the same period last year, representing a significant year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1738138637000,
            "Source": "earnings"
        },
        {
            "Title": "Craftsman Automation Outlines FY27 CAPEX and Debt Plans",
            "Summary": "Craftsman Automation has announced that its capital expenditure (CAPEX) for the fiscal year 2027 is expected to be at normal levels. The company also aims to maintain its debt at a level approximately equal to the EBITDA of Craftsman's standalone operations.",
            "Sentiment": "neutral",
            "PublishDate": 1729826782000,
            "Source": "corporate_action"
        },
        {
            "Title": "Craftsman Automation Expects Margin Improvement in Industrial Engineering Sector",
            "Summary": "Craftsman Automation anticipates improved margins in their Industrial Engineering sector starting from Q3. The company also expects significant margin growth from their Automated Solutions division in the future.",
            "Sentiment": "positive",
            "PublishDate": 1729826670000,
            "Source": "normal_news"
        },
        {
            "Title": "Craftsman Automation Sets EBITDA Targets for Subsidiaries",
            "Summary": "Craftsman Automation has announced EBITDA targets for its operations during a conference call. The company aims for an EBITDA range of 18-19% for Craftsman, 8-10% for Sunbeam, and a blended average of 17-18% overall.",
            "Sentiment": "positive",
            "PublishDate": 1729826611000,
            "Source": "normal_news"
        },
        {
            "Title": "Craftsman Automation Targets Growth in EBITDA and Revenue",
            "Summary": "Craftsman Automation has announced its financial targets for the upcoming year during a conference call. The company is aiming for high single-digit or low double-digit EBITDA growth. Additionally, they anticipate a slight increase in their revenue stream from the current Rs 1,200 crore level.",
            "Sentiment": "positive",
            "PublishDate": 1729826563000,
            "Source": "corporate_action"
        },
        {
            "Title": "Craftsman Automation Reports Q2 Revenue Growth",
            "Summary": "Craftsman Automation has reported a revenue of 12.13 billion rupees for the second quarter, showing an increase from 11.8 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1729671962000,
            "Source": "result"
        },
        {
            "Title": "Craftsman Automation Reports Q2 EBITDA Decline",
            "Summary": "Craftsman Automation's Q2 EBITDA decreased to 1.93 billion rupees from 2.38 billion rupees year-over-year. The company's EBITDA margin also fell to 15.9% from 20% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1729671941000,
            "Source": "result"
        },
        {
            "Title": "Craftsman Automation Reports Significant Profit Increase in Q2",
            "Summary": "Craftsman Automation has announced its Q2 consolidated net profit of 617 million rupees, showing a substantial year-over-year increase from 945 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1729671796000,
            "Source": "result"
        },
        {
            "Title": "Craftsman Automation Acquires Securities of Sunbeam Lightweighting Solutions",
            "Summary": "<p><span class=\"neutral\">Craftsman Automation</span> has subscribed to <span class=\"neutral\">Optionally Convertible Debentures (OCDs)</span> of <span class=\"neutral\">Sunbeam Lightweighting Solutions</span> for a consideration of <b>1.36 billion rupees</b>. The terms of the OCDs give Craftsman Automation the <span class=\"positive\">option to convert</span> these debentures into <span class=\"neutral\">shares</span> of Sunbeam.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728299447000,
            "Source": "corporate_action"
        }
    ]
}