{
    "Symbol": "CRAMC",
    "ISIN": "INE218I01013",
    "News": [
        {
            "Title": "Canara Robeco Reports 18% Revenue Growth in 9M FY26",
            "Summary": "Canara Robeco Asset Management Company delivered strong financial performance with total revenue of INR310.7 crores in 9M FY26, up 18% YoY, while AUM reached INR1.2 lakh crores with over 50 lakh investor folios.",
            "Sentiment": "positive",
            "PublishDate": 1769691458983,
            "Source": "co_actions_results"
        },
        {
            "Title": "Canara Robeco Q3FY26 PAT Rises 10.2% to ₹527.54 Cr",
            "Summary": "Canara Robeco Asset Management reported Q3FY26 PAT of ₹527.54 crores, up 10.2% YoY. Revenue from operations grew 14.3% to ₹1,097.70 crores. Board appointed new Chairman and granted 14.55 lakh stock options.",
            "Sentiment": "positive",
            "PublishDate": 1768917545511,
            "Source": "co_actions_results"
        },
        {
            "Title": "Canara Robeco: Chairman K Satyanarayana Raju Resigns",
            "Summary": "K Satyanarayana Raju has resigned from his position as Chairman of the Board at Canara Robeco Asset Management Company, marking a significant leadership change at the mid-cap asset management firm.",
            "Sentiment": "neutral",
            "PublishDate": 1767193271351,
            "Source": "mutualfunds"
        },
        {
            "Title": "Canara Robeco Chairman K Satyanarayana Raju Resigns",
            "Summary": "K Satyanarayana Raju resigned as Non-Executive Director and Chairman of Canara Robeco Asset Management Company due to superannuation from Canara Bank CEO role, effective December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767191205531,
            "Source": "stocks"
        },
        {
            "Title": "Canara Robeco Declares 1.50% Interim Dividend",
            "Summary": "Canara Robeco Asset Management Company declares interim dividend of ₹1.50 per equity share (15% of face value) with record date set for December 22, 2025, following board meeting held on December 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765383383972,
            "Source": "co_actions_results"
        },
        {
            "Title": "Canara Robeco Asset Management Board to Consider Interim Dividend Declaration",
            "Summary": "Canara Robeco Asset Management Company Limited's Board of Directors will meet on December 16, 2025, to consider declaring an interim dividend and setting a record date for payment. The company has closed its trading window from December 11-18, 2025, for designated persons and their immediate relatives in compliance with insider trading regulations.",
            "Sentiment": "positive",
            "PublishDate": 1765363850055,
            "Source": "corporate_action"
        },
        {
            "Title": "Canara Robeco Asset Management Shareholders Approve Employee Stock Option Scheme and Promoter Rights via Postal Ballot",
            "Summary": "Canara Robeco Asset Management Company completed a postal ballot voting process on December 7, 2025, where shareholders approved two special resolutions with overwhelming majorities exceeding 99%. The approved resolutions include ratification of the CRAMC Employee Stock Option Scheme 2025 and approval of promoters' rights post-listing of equity shares, affecting the company's employee compensation structure and promoter shareholding arrangements.",
            "Sentiment": "positive",
            "PublishDate": 1765195513667,
            "Source": "corporate_action"
        }
    ]
}