{
    "Symbol": "CREATIVEYE",
    "ISIN": "INE230B01021",
    "News": [
        {
            "Title": "Creative Eye Board Meet on Feb 16 for Director Changes",
            "Summary": "Creative Eye Limited schedules board meeting to appoint Sanjay Rane as additional non-executive director, accept Madan Gosavi's resignation, and reconstitute key committees.",
            "Sentiment": "neutral",
            "PublishDate": 1770822692447,
            "Source": "stocks"
        },
        {
            "Title": "Creative Eye Board Approves Key Management Changes",
            "Summary": "Creative Eye Limited's board approved multiple governance changes including MD designation change, new statutory auditor appointment, and key management appointments during January 20, 2026 meeting.",
            "Sentiment": "positive",
            "PublishDate": 1768899049618,
            "Source": "stocks"
        },
        {
            "Title": "Creative Eye Board Concludes Key Appointments Meeting",
            "Summary": "Creative Eye Limited completes board meeting, appointing Sachin Devare as CFO and Additional Director, accepting Amit Doshi's resignation, and addressing quarterly compliance matters.",
            "Sentiment": "neutral",
            "PublishDate": 1766158826154,
            "Source": "stocks"
        },
        {
            "Title": "Creative Eye Limited Appoints Three New Independent Directors, Accepts Resignation",
            "Summary": "Creative Eye Limited's Board accepted the resignation of Independent Director Ms. Sarita Soni and appointed three new Independent Directors - Dr. Madan Bhalchandra Gosavi, Mr. Charuhas Patil, and Mr. Amit Doshi - for a 3-year term starting December 8, 2025. The appointments are subject to shareholder approval and the Board reconstituted its Audit, Nomination & Remuneration, and Stakeholder Relationship Committees with the new directors.",
            "Sentiment": "neutral",
            "PublishDate": 1765192713881,
            "Source": "corporate_governance"
        },
        {
            "Title": "Creative Eye Limited's Statutory Auditor NGS & CO LLP Resigns Due to Commercial Unviability",
            "Summary": "NGS & CO LLP, Chartered Accountants, resigned as the statutory auditor of Creative Eye Limited with immediate effect from September 22, 2025. The auditing firm cited that professional effort and resources required for auditing a listed company have increased significantly while audit remuneration remains commercially unviable. NGS & CO LLP was appointed as statutory auditor at the AGM held on September 30, 2022, for a five-year term that was scheduled to expire at the conclusion of the AGM for FY 2026-27. The firm confirmed they completed the statutory audit for the year ended March 31, 2025, issuing the audit report on May 27, 2025, and the limited review report for the period ended June 30, 2025, on August 8, 2025. The auditor stated there are no material reasons for resignation other than the commercial viability concerns mentioned.",
            "Sentiment": "negative",
            "PublishDate": 1758545872758,
            "Source": "corporate_governance"
        },
        {
            "Title": "Creative Eye Limited Company Secretary Khushbu Shah Resigns to Pursue Career Opportunities",
            "Summary": "Ms. Khushbu Shah has resigned from her position as Company Secretary and Compliance Officer of Creative Eye Limited, effective October 6, 2025. Shah cited pursuing better career opportunities as the reason for her resignation and confirmed there are no other material reasons for her departure. The resignation takes effect from the close of business hours on the specified date. Shah holds membership number A40202 and served as Key Managerial Personnel of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1757150663714,
            "Source": "corporate_governance"
        },
        {
            "Title": "Creative Eye Limited Appoints New Executive Director and Sets 39th AGM Date",
            "Summary": "Creative Eye Limited's Board approved the appointment of Ashutosh Kochhar as Additional Director (Whole Time Executive Director) for 3 years starting August 28, 2025, subject to shareholder approval. Kochhar, who holds a Bachelor of Arts degree in Film, Television and New Media Production, is the son of Chairman and Executive Director Mrs. Zuby Kochhar. The Board also approved the re-appointment of Mrs. Sarita Gopal Soni as Independent Director for a second five-year term from December 23, 2025 to December 22, 2030. The company scheduled its 39th Annual General Meeting for September 30, 2025 via video conferencing, with member register closure from September 24-30, 2025. Additionally, the Board noted the resignation of M/s. Poddar A. & Associates as Internal Auditors effective August 28, 2025, citing preoccupation with other assignments.",
            "Sentiment": "neutral",
            "PublishDate": 1756383146443,
            "Source": "corporate_action"
        },
        {
            "Title": "Creative Eye Limited Re-designates Mrs. Zuby Kochhar as Chairman, Approves Q2 2025 Financial Results",
            "Summary": "Creative Eye Limited's Board of Directors held a meeting on August 8, 2025, approving three key matters. The board approved the standalone unaudited financial results for the quarter ended June 30, 2025, and reviewed the limited review report from statutory auditors for the same period. Additionally, on recommendation of the Nomination and Remuneration Committee, the board re-designated Mrs. Zuby Kochhar (DIN: 00019868) from Executive Director to Chairman of the Board, effective August 8, 2025. Mrs. Kochhar is described as a whole-time director actively involved in business activities who provides expertise across different areas of business and operations. The company trades on BSE under scrip code 532392 and on NSE under scrip code CREATIVEYE.",
            "Sentiment": "neutral",
            "PublishDate": 1754657930690,
            "Source": "corporate_action"
        }
    ]
}