{
    "Symbol": "CREDITACC",
    "ISIN": "INE741K01010",
    "News": [
        {
            "Title": "CreditAccess Grameen Promoter Explores Exit Options",
            "Summary": "CreditAccess India B.V., the promoter of CreditAccess Grameen Limited, is exploring opportunities to identify new investors to provide exit opportunities for long-term investors, as reported in The Economic Times on February 09, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770653391026,
            "Source": "stocks"
        },
        {
            "Title": "CreditAccess Grameen Allots 10,925 ESOP Shares",
            "Summary": "CreditAccess Grameen Limited allotted 10,925 equity shares under its Employee Stock Option Plan to 9 employees on February 05, 2026, following option exercises under the CAGL ESOP 2011 scheme.",
            "Sentiment": "neutral",
            "PublishDate": 1770374479520,
            "Source": "co_actions_results"
        },
        {
            "Title": "CreditAccess Grameen schedules investor meetings",
            "Summary": "CreditAccess Grameen Limited has scheduled investor meetings with Schroders and Motilal Oswal Financial Services on February 2, 2026, as per regulatory disclosure under Regulation 30.",
            "Sentiment": "neutral",
            "PublishDate": 1769845627110,
            "Source": "stocks"
        },
        {
            "Title": "HSBC Upgrades Credit Access to Buy, Target ₹1,630",
            "Summary": "HSBC has upgraded Credit Access Grameen to Buy rating with a revised target price of ₹1,630, signaling positive outlook for the microfinance company's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1768968206364,
            "Source": "stocks"
        },
        {
            "Title": "CLSA Upgrades Credit Access to Buy, Sets ₹1,450 Target",
            "Summary": "CLSA has upgraded Credit Access Grameen to Buy rating with a target price of ₹1,450, signaling positive outlook for the microfinance company's stock performance.",
            "Sentiment": "positive",
            "PublishDate": 1768968182825,
            "Source": "stocks"
        },
        {
            "Title": "CreditAccess Grameen Q3 FY26 Call Audio Available",
            "Summary": "CreditAccess Grameen Limited has made the audio recording of its Q3 FY26 results conference call available on its website for investor access and transparency.",
            "Sentiment": "neutral",
            "PublishDate": 1768930222138,
            "Source": "co_actions_results"
        },
        {
            "Title": "CreditAccess Grameen Q3FY26 Profit Surges 353% YoY",
            "Summary": "CreditAccess Grameen reported exceptional Q3FY26 results with net profit jumping 353% YoY to ₹252.09 crore. Revenue grew 8% while impairment provisions declined significantly, driving strong profitability recovery.",
            "Sentiment": "positive",
            "PublishDate": 1768914700142,
            "Source": "co_actions_results"
        },
        {
            "Title": "CreditAccess Grameen Allots 10,925 ESOP Shares",
            "Summary": "CreditAccess Grameen Limited allotted 10,925 equity shares under its Employee Stock Option Plan to 5 employees on January 20, 2026, following option exercise under the CAGL ESOP 2011 scheme.",
            "Sentiment": "neutral",
            "PublishDate": 1768901286612,
            "Source": "co_actions_results"
        },
        {
            "Title": "CreditAccess Grameen Q3FY26 Earnings Call on Jan 20",
            "Summary": "CreditAccess Grameen Limited has scheduled its Q3FY26 results conference call for January 20, 2026, at 6:30 PM IST, hosted by HDFC Securities with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1768300417738,
            "Source": "co_actions_results"
        },
        {
            "Title": "CreditAccess Grameen Allots 23,356 ESOP Shares",
            "Summary": "CreditAccess Grameen Limited allotted 23,356 equity shares under ESOP to 24 employees through its Executive, Borrowings and Investment Committee meeting on January 06, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767693706572,
            "Source": "co_actions_results"
        },
        {
            "Title": "Credit Access Grameen Allots $30M USD Bonds",
            "Summary": "Credit Access Grameen Limited allotted 3,000 USD-denominated non-convertible bonds worth $30 million to Blue Orchard Microfinance Fund on private placement basis on December 24, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766574841751,
            "Source": "co_actions_results"
        },
        {
            "Title": "CreditAccess Grameen Board Approves ₹1,500 Crore Bond Issuance Plan",
            "Summary": "CreditAccess Grameen Limited's board has approved the private issuance of foreign currency bonds and non-convertible debentures worth up to ₹1,500 crore. The company will offer both secured and unsecured options for these debt instruments to raise capital.",
            "Sentiment": "positive",
            "PublishDate": 1765346847449,
            "Source": "corporate_action"
        },
        {
            "Title": "CreditAccess Grameen Schedules Board Review of Non-Convertible Securities Fundraising Proposal",
            "Summary": "CreditAccess Grameen will review a proposal for fundraising through the issuance of non-convertible securities on December 10th. The board meeting will evaluate this debt fundraising initiative, which could impact the company's capital structure and funding capabilities.",
            "Sentiment": "neutral",
            "PublishDate": 1765026076115,
            "Source": "corporate_action"
        },
        {
            "Title": "Credit Access Grameen Allots 31,449 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Credit Access Grameen Limited allotted 31,449 equity shares of Rs. 10 each to 12 employees who exercised their options under the CAGL Employee Stock Option Plan-2011. The allotted ESOP shares will rank pari-passu with existing equity shares of the company in all respects.",
            "Sentiment": "neutral",
            "PublishDate": 1764862891677,
            "Source": "corporate_action"
        },
        {
            "Title": "Credit Access Grameen Allots 25,806 ESOP Shares to 16 Employees",
            "Summary": "Credit Access Grameen Limited allotted 25,806 equity shares of Rs. 10 each under its Employee Stock Option Plan-2011 to 16 employees, with Managing Director CEO Ganesh Narayanan receiving 11,050 shares. The allotted ESOP shares will rank pari-passu with existing equity shares in all respects.",
            "Sentiment": "positive",
            "PublishDate": 1763542433511,
            "Source": "corporate_action"
        },
        {
            "Title": "Credit Access Grameen Allots 41,537 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Credit Access Grameen Limited allotted 41,537 equity shares of Rs. 10 each to 17 employees who exercised their options under the CAGL Employees Stock Option Plan-2011. The allotment was approved by the Executive, Borrowings and Investment Committee of the Board of Directors. The allotted ESOP shares will rank pari-passu with existing equity shares of the company in all respects.",
            "Sentiment": "neutral",
            "PublishDate": 1762297884662,
            "Source": "corporate_action"
        },
        {
            "Title": "Credit Access Grameen Reports Q2 FY26 Results with Rising Credit Costs and Growth Guidance",
            "Summary": "Credit Access Grameen reported quarterly results with disbursements of Rs. 5,322 crore, up 32.9% year-on-year. The company added 2.2 lakh new borrowers in the quarter, with 39% being new-to-credit customers. Net interest income grew 4.2% quarter-on-quarter to Rs. 976 crore with portfolio yield at 20.7%. The company delivered PAT of Rs. 126 crore, resulting in ROA of 1.8% and ROE of 7.1%. Credit costs increased due to accelerated write-offs of Rs. 554.7 crore related to non-paying accounts. Management revised credit cost guidance upward by 70-100 basis points for FY26 and expects credit costs of 4-4.5% in FY27 due to ECL provisioning rate increases. The company raised pricing for group loans by 75 basis points and expects to meet AUM growth guidance of 12-14% for FY26. Retail finance portfolio share increased to 11.1% from 6.8% in the previous quarter. The company opened 96 new branches in the quarter, taking total branch count to 2,209.",
            "Sentiment": "neutral",
            "PublishDate": 1762092257591,
            "Source": "earnings"
        },
        {
            "Title": "CreditAccess Grameen Plans Recovery Strategy with 30%+ Disbursement Growth and Portfolio Expansion",
            "Summary": "CreditAccess Grameen has outlined strategic targets including strong recovery in H2 FY26 with stabilizing asset quality and over 30% disbursement growth. The company plans to expand its retail finance segment to 15% of portfolio share while strengthening rural credit penetration. These initiatives aim to sustain 18-20% AUM CAGR through FY28.",
            "Sentiment": "positive",
            "PublishDate": 1761668164767,
            "Source": "stock"
        },
        {
            "Title": "CreditAccess Grameen Reports Sequential Improvement in Q2 FY26 with Stabilizing Asset Quality",
            "Summary": "CreditAccess Grameen Limited reported sequential improvement in Q2 FY26 performance with profit after tax rising 109% quarter-on-quarter to INR 125.8 crore. The NBFC-MFI saw gross loan portfolio of INR 25,904 crore (3.1% YoY growth) and disbursements of INR 5,322 crore (32.9% YoY increase). Asset quality showed signs of stabilization with PAR 0+ declining from 5.9% to 4.7% quarter-on-quarter, while GNPA stood at 3.65%. The company added 2.20 lakh new borrowers with 39% being new-to-credit customers. Portfolio share of unique borrowers increased to 41% from 36% in the previous quarter. The company maintained strong liquidity of INR 2,175.5 crore and healthy capital adequacy ratio of 26.1%. Mr. Manoj Kumar was appointed as Chairman of the Board. Credit cost declined sequentially to INR 525.7 crore despite accelerated write-offs of INR 682.9 crore during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761657469147,
            "Source": "earnings"
        },
        {
            "Title": "CreditAccess Grameen Reports 34% Decline in Quarterly Net Profit Despite Revenue Growth",
            "Summary": "CreditAccess Grameen reported consolidated net profit of 1.25 billion rupees for the quarter, down from 1.9 billion rupees in the same period last year. The company's revenue increased to 15.1 billion rupees compared to 14.5 billion rupees year-over-year. While revenue grew by approximately 4%, net profit declined significantly by about 34%.",
            "Sentiment": "negative",
            "PublishDate": 1761656283758,
            "Source": "earnings"
        },
        {
            "Title": "CreditAccess Grameen Allots 11,250 Equity Shares to Employees Under ESOP",
            "Summary": "CreditAccess Grameen Limited has allotted 11,250 equity shares of Rs. 10 each to 5 employees who exercised their options under the CAGL Employees Stock Option Plan - 2011. The Executive, Borrowings and Investment Committee of the Board of Directors approved the allotment. The newly allotted ESOP shares will have the same rights as existing equity shares of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1761236387389,
            "Source": "corporate_action"
        },
        {
            "Title": "CreditAccess Grameen Schedules Q2 FY26 Results Conference Call",
            "Summary": "CreditAccess Grameen Limited has scheduled a conference call with investors and analysts to discuss Q2 FY26 results on Tuesday, October 28, 2025, at 6:30 PM IST. The call will be hosted by Motilal Oswal Financial Services Ltd. Key company participants include Managing Director and CEO Ganesh Narayanan, Chief Operating Officer Gururaj Rao, Chief Financial Officer Nilesh Dalvi, and DGM-Investor Relations Sahib Sharma. Dial-in numbers have been provided for India and international participants including Hong Kong, Japan, Singapore, UK, and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1761118054366,
            "Source": "earnings"
        },
        {
            "Title": "CreditAccess Grameen Reports Strong Disbursement Growth in Q2 and H1 FY26",
            "Summary": "CreditAccess Grameen reported 33% year-over-year growth in disbursements for Q2 FY26. The company also achieved 27% growth in disbursements for the first half of FY26.",
            "Sentiment": "positive",
            "PublishDate": 1759817906781,
            "Source": "stock"
        },
        {
            "Title": "CreditAccess Grameen Announces Leadership Change in Company Secretary Role",
            "Summary": "CreditAccess Grameen Limited announced the resignation of M. J. Mahadev Prakash as Company Secretary & Chief Compliance Officer, effective August 09, 2025. The company simultaneously appointed Deepti Ramani as the new Company Secretary & Compliance Officer, effective August 10, 2025. Ramani brings over 11 years of experience in corporate governance and regulatory compliance across listed companies in financial services and manufacturing sectors. She previously held key roles at Equitas Holdings Limited and Tamilnadu Petroproducts Limited, managing critical transactions including IPOs and QIPs. The board meeting approving these changes was held on August 09, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754740240540,
            "Source": "corporate_governance"
        },
        {
            "Title": "CreditAccess Grameen Receives RBI Approval for New MD & CEO and Non-Executive Director Appointments",
            "Summary": "CreditAccess Grameen Limited received Reserve Bank of India approval for the appointment of Ganesh Narayanan as Managing Director & CEO and Udaya Kumar Hebbar as Non-Executive (Nominee) Director, effective August 05, 2025. Both appointments were previously approved by the company's Board of Directors and shareholders at the Annual General Meeting held on July 30, 2025. Narayanan has been appointed for a five-year term and brings over 26 years of experience in banking and finance, having previously worked at ICICI Bank, Fullerton India Credit Company, and Yes Bank. He joined CreditAccess Grameen in 2020 as Chief Business Officer and was elevated to CEO in August 2023. Hebbar, a seasoned banking professional with over 35 years of experience in rural, agricultural, and micro-banking sectors, currently serves as Managing Director of CA Grameen and has twice served as Chairperson of the Microfinance Institutions Network.",
            "Sentiment": "positive",
            "PublishDate": 1754467400153,
            "Source": "corporate_governance"
        },
        {
            "Title": "CreditAccess Grameen Shareholders Approve All Resolutions at 34th AGM",
            "Summary": "CreditAccess Grameen Limited held its 34th Annual General Meeting on July 30, 2025, through video conferencing. All seven resolutions presented were approved by shareholders with the required majority. The approved resolutions included adoption of annual financial statements, appointment of Paolo Brichetti as director liable to retire by rotation, re-appointment of Lilian Jessie Paul as Independent Director for a second five-year term, appointment of Ganesh Narayanan as Director and Managing Director & CEO for five years (subject to RBI approval), appointment of Udaya Kumar Hebbar as Non-Executive Director (subject to RBI approval), and appointment of Sandeep & Associates as Secretarial Auditors for five years. The meeting had 97,874 total shareholders on record date, with 90 shareholders attending through video conferencing. Voting was conducted through e-voting, with all resolutions receiving over 99% approval rates from the votes cast.",
            "Sentiment": "positive",
            "PublishDate": 1753979832946,
            "Source": "corporate_action"
        },
        {
            "Title": "CreditAccess Grameen Reports Highest Q1 Disbursements Despite Asset Quality Challenges",
            "Summary": "CreditAccess Grameen achieved its highest ever first quarter disbursement while navigating credit quality issues. The company reported PAT of Rs. 60 crore with ROA of 0.9% and ROE of 3.4%. Asset quality showed gradual improvement with PAR 15+ accretion rate declining to 0.46% in June 2025 from 1.34% in November 2024. Karnataka remains a concern with PAR 15+ accretion at 0.58% in June, though improving from 2% in February 2025. The company undertook accelerated write-offs of Rs. 693 crore, including Rs. 603 crore related to 180+ days past due accounts, resulting in additional credit costs of Rs. 193 crore. Net interest income grew 7% quarter-on-quarter to Rs. 937 crore with portfolio yield at 20.3%. The retail finance portfolio increased significantly from 2.9% to 6.8% year-on-year. Employee base grew to 21,333 with reduced attrition rate of 27.1%. The company added 216,000 borrowers in Q1, with 43% being new-to-credit customers. Management expects robust profitability in the second half and maintains credit cost guidance of 5.5%-6% for the year.",
            "Sentiment": "neutral",
            "PublishDate": 1753677180778,
            "Source": "earnings"
        },
        {
            "Title": "CreditAccess Grameen Expects Positive FY26 Performance on Monsoon Forecasts",
            "Summary": "CreditAccess Grameen has expressed a positive outlook for FY26, citing good monsoon predictions and improving rural sentiment as key factors. The company appears optimistic about its prospects based on expected favorable weather conditions that typically benefit rural markets.",
            "Sentiment": "positive",
            "PublishDate": 1753197074568,
            "Source": "stock"
        },
        {
            "Title": "CreditAccess Grameen Projects Net Interest Margin of 12.6%-12.8% for FY26",
            "Summary": "CreditAccess Grameen has projected its Net Interest Margin to be between 12.6% and 12.8% for FY26. This guidance provides investors with the company's outlook on its interest income profitability for the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1753187497562,
            "Source": "stock"
        },
        {
            "Title": "CreditAccess Grameen Reports 85% Decline in Quarterly Profit to ₹60.19 Crore",
            "Summary": "CreditAccess Grameen Limited reported a net profit of ₹60.19 crore for the quarter ended June 30, 2025, compared to ₹397.66 crore in the same period last year. Total revenue from operations decreased to ₹1,462.89 crore from ₹1,512.03 crore year-on-year. The significant profit decline was primarily driven by higher impairment provisions on financial instruments, which increased to ₹571.85 crore from ₹174.59 crore in the previous year quarter. Interest income fell to ₹1,388.14 crore from ₹1,437.15 crore. The company's gross Stage III (non-performing assets) ratio stood at 4.70% with a provision coverage ratio of 63.16%. Basic earnings per share dropped to ₹3.77 from ₹24.95 in the corresponding quarter last year. The NBFC maintains a strong capital adequacy ratio of 25.55% and liquidity coverage ratio of 180.66%.",
            "Sentiment": "negative",
            "PublishDate": 1753185218823,
            "Source": "earnings"
        },
        {
            "Title": "CreditAccess Grameen: Shares Surge 9% Despite Market Weakness",
            "Summary": "CreditAccess Grameen shares rose up to 9% after Q1 update. Gross loans at ₹26,055 crore, down 0.9% YoY but up 0.4% QoQ. Write-offs of ₹693 crore impacted loan growth. PAR 90+ days stable at 3.3% QoQ. Company guides for 14-18% AUM growth by FY2026.",
            "Sentiment": "positive",
            "PublishDate": 1751611668000,
            "Source": "result"
        },
        {
            "Title": "CreditAccess Grameen Reports Improved Q1 Performance",
            "Summary": "CreditAccess Grameen has reported a significant decrease in PAR 15+ accretion during the first quarter. The company also demonstrated improved business trends and maintained steady asset quality. PAR 15+ refers to Portfolio at Risk, which is a measure of loan portfolio quality in microfinance, indicating the percentage of loans that are overdue by more than 15 days.",
            "Sentiment": "positive",
            "PublishDate": 1751594463000,
            "Source": "default"
        },
        {
            "Title": "CreditAccess Grameen Reports Strong Q1 FY26 Performance",
            "Summary": "CreditAccess Grameen has reported a record disbursement and robust business growth in the first quarter of FY26. The company added 200,000 new borrowers during this period, indicating significant expansion of its customer base.",
            "Sentiment": "positive",
            "PublishDate": 1751594134000,
            "Source": "default"
        },
        {
            "Title": "CreditAccess Grameen: Secures $100 Million Syndicated Loan from Asian Banks",
            "Summary": "CreditAccess Grameen, India's largest NBFC-MFI, has raised $100 million through external commercial borrowing from a group of Asian banks. The syndicated loan, led by Standard Chartered Bank, is structured in Japanese yen and US dollars. Initially launched at $70 million, it was upsized due to strong interest. The funds will be used for eligible social projects.",
            "Sentiment": "positive",
            "PublishDate": 1749610659000,
            "Source": "corporate_action"
        },
        {
            "Title": "CreditAccess Grameen: Secures $100 Million Syndicated Loan from Asian Banks",
            "Summary": "CreditAccess Grameen, India's largest NBFC-MFI, has raised $100 million through a syndicated loan from South Asian and Far East banks. The loan, led by Standard Chartered Bank, is structured in Japanese yen and US dollars. Initially planned for $70 million, it was upgraded to $100 million with investments from seven banks, primarily from Korea and Japan. The funds will be used for eligible social projects.",
            "Sentiment": "positive",
            "PublishDate": 1749564500000,
            "Source": "corporate_action"
        },
        {
            "Title": "CreditAccess Grameen Secures $100 Million Syndicated Social Loan",
            "Summary": "CreditAccess Grameen has successfully obtained a $100 million multi-currency syndicated social loan. This loan is described as being both multi-currency and social in nature, indicating it may be used for socially beneficial purposes. The syndicated nature of the loan suggests multiple lenders are involved in providing the funds.",
            "Sentiment": "positive",
            "PublishDate": 1749553001000,
            "Source": "default"
        },
        {
            "Title": "CreditAccess Grameen: Expects Recovery Amid Challenging Quarter",
            "Summary": "CreditAccess Grameen faced rising slippages, higher credit costs, and increased GNPA in Q4. PAR improved outside Karnataka. Credit cost expected to normalize to 3.5% in H2 FY26. Karnataka and Tamil Nadu showed higher delinquencies. Company projects improved RoA and RoE for FY26. Analysts have reduced FY27 earnings estimates.",
            "Sentiment": "neutral",
            "PublishDate": 1747837976000,
            "Source": "earnings"
        },
        {
            "Title": "CreditAccess Grameen: Analysts Project Significant Downside Potential",
            "Summary": "Goldman Sachs sets lowest price target of ₹700, implying 42% downside. CLSA downgrades to 'underperform' with ₹1,050 target. Nomura upgrades to 'neutral', raises target to ₹1,090. Q4 net profit at ₹47 crore, dragged by 9% credit cost. Company guides for 14-18% loan growth, 12-13% ROE for FY26, with elevated credit costs of 5.5-6%.",
            "Sentiment": "negative",
            "PublishDate": 1747630522000,
            "Source": "earnings"
        },
        {
            "Title": "Creditaccess Grameen Reports Q4 Results and Approves Fundraising",
            "Summary": "Creditaccess Grameen reported its Q4 consolidated net profit at 472 million rupees, down from 3.97 billion rupees year-over-year and a loss of 995 million rupees quarter-over-quarter. Q4 revenue was 14.1 billion rupees, compared to 14.57 billion rupees in the previous year. The company's Gross Non-Performing Assets (GNPA) increased to 4.76% from 3.99% in the previous quarter, while Net Non-Performing Assets (NNPA) rose to 1.73% from 1.28%. Additionally, the company approved fundraising of 20 billion rupees through non-convertible debentures.",
            "Sentiment": "negative",
            "PublishDate": 1747613608000,
            "Source": "default"
        },
        {
            "Title": "CreditAccess Grameen: Q4 Profit Turnaround and Leadership Change",
            "Summary": "CreditAccess Grameen reported Q4 net profit of Rs 47.2 crore, reversing previous quarter's loss. Annual profit declined to Rs 531 crore. MD Udaya Kumar Hebbar to step down, succeeded by Ganesh Narayanan from June 26. Gross NPA ratio increased to 4.76%.",
            "Sentiment": "neutral",
            "PublishDate": 1747410641000,
            "Source": "earnings"
        },
        {
            "Title": "CreditAccess Grameen Approves 20 Billion Rupee NCD Fundraising",
            "Summary": "CreditAccess Grameen has approved fundraising through non-convertible debentures (NCDs) worth 20 billion rupees. The company's board has given its approval for this financial decision.",
            "Sentiment": "positive",
            "PublishDate": 1747406194000,
            "Source": "default"
        },
        {
            "Title": "CreditAccess Grameen Reports Increase in Q4 NPAs",
            "Summary": "CreditAccess Grameen has reported an increase in its Non-Performing Assets (NPAs) for the fourth quarter. The Gross Non-Performing Assets (GNPA) rose to 4.76% from 3.99% in the previous quarter. Similarly, the Net Non-Performing Assets (NNPA) increased to 1.73% from 1.28% quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1747398706000,
            "Source": "result"
        },
        {
            "Title": "CreditAccess Grameen Reports Q4 Financial Results",
            "Summary": "CreditAccess Grameen announced its Q4 consolidated net profit of 472 million rupees, compared to 3.97 billion rupees year-over-year, and a loss of 995 million rupees quarter-over-quarter. The company's Q4 revenue was 14.1 billion rupees, down from 14.57 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1747398608000,
            "Source": "result"
        },
        {
            "Title": "CreditAccess Grameen to Consider Q4 Results on May 16",
            "Summary": "CreditAccess Grameen has announced that it will consider its fourth quarter financial results on May 16. This indicates that the company is preparing to release its latest earnings report, which will provide insights into its financial performance for the most recent quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746707013000,
            "Source": "default"
        },
        {
            "Title": "CreditAccess Grameen: AUM Declines, Portfolio at Risk Rises in Q4 FY25",
            "Summary": "CreditAccess Grameen reported a 2.9% YoY decline in AUM to ₹25,948 crore for Q4 FY25. PAR 90+ days increased significantly, with Karnataka at 2.4%, Tamil Nadu at 4.5%, and Bihar at 7.3%. Overall PAR 0+ days rose slightly to 6.9%. The company had previously cut its FY25 loan growth forecast to 8-12%.",
            "Sentiment": "negative",
            "PublishDate": 1744096505000,
            "Source": "result"
        },
        {
            "Title": "CreditAccess Grameen: Strategic Outlook and Industry Challenges",
            "Summary": "CreditAccess Grameen's senior leadership met with Motilal Oswal to discuss the microfinance industry, challenges in Karnataka, and the company's approach to customer acquisition, risk management, and future growth. The company expects to overcome current challenges by FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1741843181000,
            "Source": "normal_news"
        },
        {
            "Title": "CreditAccess Grameen: Microfinance Defaults Rise in Karnataka Amid Regulatory Changes",
            "Summary": "CreditAccess Grameen reports increased loan defaults in Karnataka following a new microfinance ordinance. Overall portfolio at risk rose to 7.5% by February-end, with Karnataka's risk at 7.9%. Despite this, assets under management grew, indicating business normalization. The company expects the situation to stabilize in 1-2 months.",
            "Sentiment": "neutral",
            "PublishDate": 1741286532000,
            "Source": "normal_news"
        },
        {
            "Title": "CreditAccess Grameen: Loan Growth Rises, Karnataka Portfolio Stabilizing",
            "Summary": "CreditAccess Grameen reported 2.4% gross loan portfolio growth as of February 2025. Karnataka portfolio grew 1%. Over 1.5 lakh new borrowers added in Jan-Feb 2025. Portfolio at risk excluding Karnataka at 7.3%, total at 7.5%. Karnataka situation expected to normalize in 1-2 months. Stock rose 10% to Rs 1,012.2 on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1741251381000,
            "Source": "result"
        },
        {
            "Title": "CreditAccess Grameen: Strong February Growth Despite Karnataka Challenges",
            "Summary": "CreditAccess Grameen reported robust loan growth in February 2025, with GLP reaching ₹25,395 crore and 1.5 lakh new borrowers added. While facing headwinds in Karnataka, the company showed resilience with stabilizing asset quality and improved collections in other states. Overall collection efficiency remained strong at over 99.5% excluding Karnataka. However, Goldman Sachs raised concerns about the Karnataka market due to regulatory changes affecting the microfinance sector.",
            "Sentiment": "positive",
            "PublishDate": 1741249934000,
            "Source": "normal_news"
        },
        {
            "Title": "CRED: Launches 'Svalbard' Suite for Enhanced Credit Card Management",
            "Summary": "CRED introduces 'Svalbard', a new suite of tools designed to revolutionize credit card management. Features include a redefined credit score system with predictive analytics, enhanced control over credit card management with a unified dashboard, and CRED Cash+ offering liquidity against mutual fund investments without liquidation.",
            "Sentiment": "positive",
            "PublishDate": 1740490963000,
            "Source": "normal_news"
        }
    ]
}