{
    "Symbol": "CREST",
    "ISIN": "INE559D01011",
    "News": [
        {
            "Title": "Crest Ventures Appoints Independent Director via Postal Ballot",
            "Summary": "Crest Ventures Limited successfully appointed Jagdish Mohan Kirpalani as Independent Director through postal ballot with 99.91% approval from shareholders on January 29, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769799804573,
            "Source": "co_actions_results"
        },
        {
            "Title": "Crest Ventures Acquires 100% Stake in Crest Prime",
            "Summary": "Crest Ventures Limited completes acquisition of 100% shares in Crest Prime Limited for ₹1.53 lakh, making it a wholly owned subsidiary focused on real estate development activities.",
            "Sentiment": "positive",
            "PublishDate": 1767796035476,
            "Source": "co_actions_results"
        },
        {
            "Title": "Crest Ventures Appoints Rajeev Sharma as Director",
            "Summary": "Crest Ventures Limited announces the appointment of Mr. Rajeev Sharma as Additional Director (Non-Executive, Non-Independent) effective January 07, 2026, following RBI approval.",
            "Sentiment": "positive",
            "PublishDate": 1767187472914,
            "Source": "stocks"
        },
        {
            "Title": "Crest Ventures Redeems ₹930 Cr NCDs on Dec 20",
            "Summary": "Crest Ventures Limited successfully redeemed 9,300 NCDs worth ₹930 crores along with applicable interest on December 20, 2025, completing full repayment of principal and interest obligations.",
            "Sentiment": "positive",
            "PublishDate": 1766218563745,
            "Source": "co_actions_results"
        },
        {
            "Title": "Crest Ventures Board Approves Demerger Scheme",
            "Summary": "Crest Ventures Limited board approved scheme of arrangement to demerge its Financial Services Business to Crest Capital and Investment Limited with 1:2 share ratio.",
            "Sentiment": "positive",
            "PublishDate": 1766068034454,
            "Source": "co_actions_results"
        },
        {
            "Title": "Crest Ventures Formalizes Chembur Development Partnership",
            "Summary": "Crest Ventures' subsidiary Crest Urban Living has officially entered into a Joint Development Agreement with Vensco Projects for a premium mixed-use project in Chembur, Mumbai, spanning 11,000 sq.m.",
            "Sentiment": "positive",
            "PublishDate": 1765781855394,
            "Source": "stocks"
        },
        {
            "Title": "Crest Ventures Allots ₹100 Cr NCDs on Dec 23",
            "Summary": "Crest Ventures completed allotment of 10,000 NCDs worth ₹100 crores with 12% interest rate, 18-month tenure, and June 2027 maturity date following committee approval.",
            "Sentiment": "positive",
            "PublishDate": 1765517543284,
            "Source": "co_actions_results"
        },
        {
            "Title": "Crest Ventures Gets CARE BBB Rating Reaffirmed",
            "Summary": "CARE Ratings reaffirmed Crest Ventures' issuer rating and existing NCDs at CARE BBB with stable outlook, while assigning the same rating to proposed ₹100 crore debentures based on adequate capitalisation and moderate financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1765465948496,
            "Source": "stocks"
        },
        {
            "Title": "Crest Ventures Provides Business Operations Update to Stock Exchanges",
            "Summary": "Crest Ventures Limited, a Mumbai-based NBFC listed on NSE and BSE, submitted a general business update to exchanges covering its real estate and financial services operations. The company operates through multiple verticals including property development, financial services, and strategic investments, with ongoing projects across Mumbai, Chennai, Raipur, and Jaipur.",
            "Sentiment": "neutral",
            "PublishDate": 1763562353847,
            "Source": "stock"
        },
        {
            "Title": "Crest Ventures Reports Q2 Results and Approves INR 100 Crore NCD Fundraising Plan",
            "Summary": "Crest Ventures Limited approved unaudited financial results for the quarter and half-year ended September 30, 2025, showing net profit after tax of INR 282.05 lakhs for the quarter. The Board also approved a proposal to raise funds up to INR 100 crore through issuance of Non-Convertible Debentures on a private placement basis.",
            "Sentiment": "positive",
            "PublishDate": 1763142526116,
            "Source": "earnings"
        },
        {
            "Title": "Crest Ventures Reports 78% Drop in Q2 Consolidated Net Profit",
            "Summary": "Crest Ventures reported Q2 consolidated net profit of 37 million rupees, down from 171 million rupees in the same quarter last year, marking a significant 78% decline. The company's Q2 revenue also decreased to 295 million rupees from 354 million rupees year-over-year, reflecting challenging operational performance.",
            "Sentiment": "negative",
            "PublishDate": 1763129230146,
            "Source": "earnings"
        },
        {
            "Title": "Crest Ventures Partners with Vensco Projects for 11,000 Square Meter Chembur Development",
            "Summary": "Crest Ventures has signed an agreement with Vensco Projects LLP for the joint development of a project in Chembur. The development will feature amalgamated land covering approximately 11,000 square meters and will be developed under DCPR 2034 regulations.",
            "Sentiment": "positive",
            "PublishDate": 1762849450399,
            "Source": "stock"
        },
        {
            "Title": "Crest Ventures Appoints Jagdish Mohan Kirpalani as Independent Director",
            "Summary": "Crest Ventures Limited appointed Jagdish Mohan Kirpalani as Additional Director in the Non-Executive and Independent category. The appointment is effective from November 1, 2025, for a first term of 5 consecutive years, subject to shareholder approval. Kirpalani brings nearly four decades of leadership experience across India and Singapore in private banking, wealth management, operational transformation, and governance. He has held senior roles at Standard Chartered Bank, Barclays Bank, Societe Generale, and ING Bank. The company's board approved the appointment on October 30, 2025, based on the Nomination and Remuneration Committee's recommendation. Kirpalani is not related to any other company directors and is not debarred from holding directorship positions.",
            "Sentiment": "positive",
            "PublishDate": 1761850401464,
            "Source": "corporate_governance"
        },
        {
            "Title": "Crest Ventures Establishes New Wholly-Owned Subsidiary Crest Prime Projects Private Limited",
            "Summary": "Crest Ventures has formed a new fully-owned subsidiary called Crest Prime Projects Private Limited. The company has established this new entity as part of its corporate structure expansion.",
            "Sentiment": "neutral",
            "PublishDate": 1760019147492,
            "Source": "stock"
        },
        {
            "Title": "Crest Residency Partners with Mumbai Housing Society for Development Project",
            "Summary": "Crest Residency Pvt. Ltd., associated with Crest Ventures, has entered into a partnership with Saidale Co-Operative Housing Society in Mumbai for a development deal. The partnership involves a development project in Mumbai's real estate sector.",
            "Sentiment": "positive",
            "PublishDate": 1759763376573,
            "Source": "order&deals"
        },
        {
            "Title": "Crest Ventures Reports Strong Q1 FY26 Results with Net Profit Surge of 353% YoY",
            "Summary": "Crest Ventures Limited announced its quarterly results for the period ended June 30, 2025. On a standalone basis, the company reported net profit after tax of ₹2,210.30 lakhs compared to ₹488.02 lakhs in the previous quarter, marking significant growth. Total income from operations reached ₹4,906.80 lakhs versus ₹3,645.17 lakhs in the prior quarter. On a consolidated basis, net profit after tax was ₹2,595.26 lakhs compared to ₹791.89 lakhs in the previous quarter, while total income was ₹6,310.83 lakhs versus ₹4,764.74 lakhs. The company's earnings per share on a standalone basis increased to ₹7.84 from ₹1.73 in the previous quarter. Key business segments include investing & financial activities, broking & related activities, and real estate & related activities. During the quarter, the company acquired 100% equity in Sutlej Housing Private Limited and received a refund of ₹2,800 lakhs deposit along with interest income of ₹1,423.05 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1754642678116,
            "Source": "earnings"
        },
        {
            "Title": "Crest Finserv Changes Statutory Auditors as Pathak H.D. & Associates Resigns, Chaturvedi and Shah LLP Appointed",
            "Summary": "Crest Finserv Limited, a material subsidiary of Crest Ventures Limited, announced changes to its statutory auditors. M/s. Pathak H.D. & Associates LLP resigned effective July 23, 2025, citing strategic downsizing of their professional operations. The auditors confirmed no concerns or issues were raised and had completed the statutory audit and limited review report for the quarter ended June 30, 2025. M/s. Chaturvedi and Shah LLP has been appointed as the new statutory auditors effective July 24, 2025, to fill the casual vacancy. The new auditors, founded in 1967, are a multi-disciplinary firm providing assurance, taxation, and advisory services. The appointment is subject to members' approval at the upcoming Annual General Meeting, with a proposed three-year term.",
            "Sentiment": "neutral",
            "PublishDate": 1753195003849,
            "Source": "corporate_governance"
        },
        {
            "Title": "Crest Ventures Reports Q4 Financial Results",
            "Summary": "Crest Ventures announced its Q4 consolidated net profit of 77 million rupees, compared to 101.8 million rupees year-over-year and 144 million rupees quarter-over-quarter. The company's Q4 revenue increased to 476 million rupees from 397.9 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1748439616000,
            "Source": "result"
        },
        {
            "Title": "Crest Ventures Subsidiary Incorporates New Entity in GIFT City",
            "Summary": "Crest Ventures Limited has announced that its subsidiary, Crest Finserv Ltd (CFL), has incorporated a new wholly-owned subsidiary named Crest Finserv Gift City IFSC Pvt Ltd. This new entity will be based in Gujarat International Finance Tec-City (GIFT City), India's first operational smart city and international financial services center.",
            "Sentiment": "positive",
            "PublishDate": 1744848315000,
            "Source": "default"
        },
        {
            "Title": "Crest Ventures Incorporates New Subsidiary in GIFT City IFSC",
            "Summary": "Crest Ventures Limited has announced that its subsidiary, Crest Finserv Ltd (CFL), has incorporated a new wholly-owned subsidiary named Crest Finserv GIFT City IFSC Pvt Ltd. This new entity will be based in Gujarat International Finance Tec-City (GIFT City), India's first operational smart city and international financial services center.",
            "Sentiment": "positive",
            "PublishDate": 1744819924000,
            "Source": "default"
        },
        {
            "Title": "Crest Ventures Reports Q3 Financial Results",
            "Summary": "Crest Ventures announced its Q3 consolidated financial results. The company reported a net profit of 144 million rupees, up from 119 million rupees in the same quarter last year. However, revenue decreased to 440 million rupees from 516 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739370473000,
            "Source": "earnings"
        },
        {
            "Title": "Crest Ventures Reports Q2 Revenue Decline",
            "Summary": "Crest Ventures has reported a revenue of 354 million rupees for the second quarter, compared to 612 million rupees in the same period last year, representing a significant year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731398154000,
            "Source": "result"
        },
        {
            "Title": "Crest Ventures Reports Decline in Q2 Consolidated Net Profit",
            "Summary": "Crest Ventures has announced its financial results for the second quarter. The company's consolidated net profit decreased to 171 million rupees, compared to 322 million rupees in the same quarter of the previous year, representing a significant year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1731398108000,
            "Source": "result"
        }
    ]
}