{
    "Symbol": "CRISIL",
    "ISIN": "INE007A01025",
    "News": [
        {
            "Title": "CRISIL Board Meeting Set for Feb 13 to Review Q4FY25",
            "Summary": "CRISIL Limited has scheduled its board meeting for February 13, 2026, to consider Q4FY25 audited financial results and final dividend proposal. Trading window closed from Dec 16, 2025 to Feb 17, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767625224303,
            "Source": "co_actions_results"
        },
        {
            "Title": "Crisil Independent Director Shyamala Gopinath Completes Term",
            "Summary": "Crisil Limited announces completion of Ms. Shyamala Gopinath's term as Independent Director on December 31, 2025, following regulatory compliance under SEBI Listing Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1767243202911,
            "Source": "stocks"
        },
        {
            "Title": "Crisil CTO Zak Murad Resigns to Pursue New Opportunities Within S&P",
            "Summary": "Zak Murad, Chief Technology and Information Officer at Crisil, tendered his resignation on December 1, 2025, with his last working day scheduled for December 24, 2025. Murad cited pursuing new career opportunities within S&P that will allow him to devote greater attention to his family as the reason for his departure.",
            "Sentiment": "neutral",
            "PublishDate": 1764590004611,
            "Source": "corporate_governance"
        },
        {
            "Title": "Crisil Shareholders Approve Dinesh Khara's Appointment as Independent Director via Postal Ballot",
            "Summary": "Crisil Limited shareholders approved the appointment of Mr. Dinesh Khara (DIN: 06737041) as an Independent Director through a postal ballot conducted via e-voting. The special resolution was passed with 99.92% votes in favor, with 6,47,21,447 total votes polled and only 51,308 votes against. The e-voting process ran from September 26 to October 25, 2025, with 73,693 shareholders eligible to vote as of the September 19 cut-off date. The resolution was deemed approved on October 25, 2025, the last date of remote e-voting. S.N. Vishwanathan served as the scrutinizer and confirmed all votes cast were valid.",
            "Sentiment": "positive",
            "PublishDate": 1761565306797,
            "Source": "corporate_action"
        },
        {
            "Title": "CRISIL Targets Double-Digit Growth While Building Analytics and AI Capabilities",
            "Summary": "CRISIL has announced plans to maintain double-digit growth trajectory while strengthening its global analytics and artificial intelligence capabilities. The company is pursuing this expansion strategy despite prevailing economic uncertainty in the market environment.",
            "Sentiment": "positive",
            "PublishDate": 1760967842201,
            "Source": "stock"
        },
        {
            "Title": "Crisil Reports 12.2% Revenue Growth and Declares Rs 16 Interim Dividend",
            "Summary": "Crisil Limited reported consolidated income from operations of Rs 911.2 crore for the quarter ended September 30, 2025, marking a 12.2% increase from Rs 811.8 crore in the corresponding quarter of the previous year. Profit before tax rose 14.8% to Rs 262.3 crore, while profit after tax increased 12.6% to Rs 193.1 crore. For the nine-month period, income from operations grew 9.4% to Rs 2,567.4 crore, with profit before tax up 13.1% to Rs 714.5 crore. The company declared an interim dividend of Rs 16 per share. The ratings services segment revenue grew 11.2% while the research, analytics and solutions segment revenue increased 12.7%. Crisil is expanding its global benchmarking offerings through a proposed acquisition of McKinsey PriceMetrix Co. for USD 38 million. The company expects India's GDP growth to remain steady at 6.5% this fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1760705972452,
            "Source": "earnings"
        },
        {
            "Title": "Crisil Limited Approves Q3 2025 Financial Results and Declares Rs. 16 Third Interim Dividend",
            "Summary": "Crisil Limited's Board of Directors approved unaudited standalone and consolidated financial results for the third quarter and nine months ended September 30, 2025. The board declared a third interim dividend of Rs. 16 per equity share with face value of Re. 1 each for the financial year ending December 31, 2025. The dividend will be paid on November 6, 2025. The board meeting was held on October 17, 2025, commencing at 3:45 p.m. IST and concluding at 5:05 p.m. IST. Walker Chandiok & Co LLP conducted the limited review of both standalone and consolidated quarterly financial results.",
            "Sentiment": "positive",
            "PublishDate": 1760704768168,
            "Source": "corporate_action"
        },
        {
            "Title": "Crisil Limited Completes Amalgamation with Bridge to India Energy Private Limited",
            "Summary": "The amalgamation scheme between Bridge to India Energy Private Limited and Crisil Limited has become effective following the filing of e-Form INC-28 with the Registrar of Companies. The scheme was previously sanctioned by the National Company Law Tribunal, Mumbai Bench on September 1, 2025. Bridge to India Energy Private Limited serves as the transferor company, while Crisil Limited is the transferee company in this merger arrangement.",
            "Sentiment": "neutral",
            "PublishDate": 1758816089860,
            "Source": "corporate_action"
        },
        {
            "Title": "CRISIL Seeks Shareholder Approval for Dinesh Khara's Appointment as Independent Director",
            "Summary": "CRISIL Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Dinesh Khara as an Independent Director. Khara, who served as Chairman of State Bank of India from October 2020 to August 2024, brings over 40 years of banking experience. The Board appointed him as Additional Director effective September 24, 2025, with the proposed term running until September 23, 2030. E-voting will be conducted from September 26 to October 25, 2025, with results to be announced by October 28, 2025. The cut-off date for voting eligibility is September 19, 2025. Khara holds an MBA from FMS New Delhi and has expertise in strategic orientation, financial markets knowledge, and governance. The appointment requires special resolution approval from shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1758795478928,
            "Source": "corporate_governance"
        },
        {
            "Title": "Crisil Acquires McKinsey PriceMetrix for USD 38 Million to Expand Wealth Management Analytics",
            "Summary": "Crisil Limited's Board approved the acquisition of McKinsey PriceMetrix Co., a Canadian wealth management software provider, for USD 38 million through its subsidiary Crisil Canada Inc. PriceMetrix, founded in 2000 and headquartered in Toronto, provides benchmarking and data-driven insights to wealth management firms across the US and Canada. The company maintains a proprietary database covering $8 trillion in assets under management and 30 million investment accounts. For the year ended December 2024, PriceMetrix reported revenue of INR 94.2 crores and profit after tax of INR 21.5 crores. The acquisition will integrate PriceMetrix with Crisil Coalition Greenwich and aligns with Crisil's strategy to strengthen its position in wealth management benchmarking. Post-transaction, PriceMetrix employees will transition to Crisil while McKinsey will continue using PriceMetrix insights for client engagements. The deal is expected to complete within 180 days subject to customary closing conditions.",
            "Sentiment": "positive",
            "PublishDate": 1758720151776,
            "Source": "order&deals"
        },
        {
            "Title": "Crisil Approves USD 30 Million Credit Line for UK Subsidiary",
            "Summary": "Crisil Limited has approved a line of credit of up to USD 30 million for its wholly owned subsidiary, Crisil Irevna UK Limited. The credit facility will be utilized in one or more tranches to support the subsidiary's general business needs and strategic initiatives. The loan agreement was signed on September 9, 2025, and is structured as an arm's length related party transaction. Currently, there are no outstanding loans from Crisil Irevna UK Limited, and no security is being provided for this credit line. The agreement does not include any special rights such as director appointment rights or share subscription preferences.",
            "Sentiment": "neutral",
            "PublishDate": 1757423152089,
            "Source": "corporate_action"
        },
        {
            "Title": "Crisil Incorporates New Step-Down Subsidiary in Canada",
            "Summary": "Crisil has incorporated a step-down subsidiary named 'Crisil Canada Inc' after receiving board approval for the establishment.",
            "Sentiment": "neutral",
            "PublishDate": 1755775062452,
            "Source": "stock"
        },
        {
            "Title": "Crisil Faces ₹8 Crore GST Penalty Over Export Services Classification",
            "Summary": "Credit rating agency Crisil has been penalized ₹7.94 crore by Chennai tax authorities under Section 74 of the CGST Act for GST assessment issues related to export of services during 2020-21. The penalty was imposed by the State Tax Officer of the Mandaveli Assessment Circle following an assessment order received by the company. Section 74 typically applies to cases involving alleged tax evasion or misclassification, while export of services under Indian GST law is generally treated as zero-rated subject to compliance conditions. Crisil stated it does not expect any material impact on its operations, financial performance, or business continuity. The company has not indicated whether it plans to contest the order legally.",
            "Sentiment": "negative",
            "PublishDate": 1753612809380,
            "Source": "stock"
        },
        {
            "Title": "Crisil Declares Rs 9 Interim Dividend, Reports 14.3% Jump in Net Profit",
            "Summary": "Crisil announced an interim dividend of Rs 9 per share for the financial year ending December 31, 2025, to be paid on August 8. The company reported strong quarterly results with consolidated net profit rising 14.3% year-on-year to Rs 171.57 crore in Q2CY25 from Rs 150.11 crore in Q2CY24. Total income increased 6.3% to Rs 866.55 crore, while revenue from operations climbed 5.7% to Rs 843.02 crore. Profit before tax grew 8.2% to Rs 224.97 crore. The company follows a calendar year for financial reporting and has previously paid interim dividends of Rs 8 and final dividend of Rs 26. Crisil shares were trading 0.47% higher at Rs 5,812 on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1753248051368,
            "Source": "corporate_action"
        },
        {
            "Title": "CRISIL Reports Strong Q2 FY2025 Results with 15.1% PAT Growth, Declares Rs 9 Interim Dividend",
            "Summary": "CRISIL Limited released its Q2 FY2025 financial results showing robust performance across key metrics. The company reported income from operations of Rs 843 crore for Q2 2025, up 5.7% from Rs 797.4 crore in Q2 2024. Profit before tax increased 8.2% to Rs 225 crore from Rs 208 crore, while profit after tax grew 14.3% to Rs 171.6 crore from Rs 150.1 crore. For H1 2025, income from operations reached Rs 1,656.2 crore (7.9% growth), with PBT at Rs 452.2 crore (12.1% growth) and PAT at Rs 331.4 crore (15.1% growth). The company declared an interim dividend of Rs 9 per share for Q2 FY25, compared to Rs 8 per share in the same quarter last year. CRISIL Ratings segment showed strong performance with 18% revenue growth in Q2 2025, driven by leadership in corporate bond ratings and growth in bank loan ratings. The Research, Analytics and Solutions segment demonstrated resilience with 1.3% growth despite curtailed discretionary spending by global clients. The company continues strategic investments in technology and talent while expanding its global presence across multiple business verticals.",
            "Sentiment": "positive",
            "PublishDate": 1753190138407,
            "Source": "earnings"
        },
        {
            "Title": "Crisil to Close Singapore Subsidiary Coalition Development Within 12 Months",
            "Summary": "Crisil Limited announced the closure of its wholly owned subsidiary Coalition Development Singapore Pte. Ltd. to streamline its global entity structure. The Board of Directors approved the closure, which is expected to be completed within 12 months. The subsidiary contributed revenue of 69,500,000 (0.42% of total) and net worth of 39,800,000 (0.22% of total) as of December 31, 2024. The company stated there will be no quantitative effect from this restructuring and no change to Crisil's shareholding pattern.",
            "Sentiment": "neutral",
            "PublishDate": 1753172176427,
            "Source": "corporate_action"
        },
        {
            "Title": "Crisil Reports 14.4% Jump in Net Profit Despite Share Price Decline",
            "Summary": "Crisil reported strong quarterly financial performance with net profit rising 14.4% to ₹171.6 crore compared to ₹150 crore in the same quarter last year. Revenue increased 5.7% to ₹843 crore from ₹797.4 crore year-on-year. EBITDA grew 15.5% to ₹238.7 crore versus ₹206.7 crore previously. Margins expanded significantly by 240 basis points to 28.3% from 25.9% in the year-ago quarter. Despite the positive financial results, Crisil shares traded lower and were flat at ₹5,816.35 following the earnings announcement. The stock has gained 9% over the past six months.",
            "Sentiment": "positive",
            "PublishDate": 1753170291033,
            "Source": "earnings"
        },
        {
            "Title": "CRISIL Reports Strong Q1 Performance with 13% Profit Growth and Declares Rs 9 Dividend",
            "Summary": "CRISIL delivered robust quarterly results with consolidated net profit rising to Rs 1.7 billion from Rs 1.5 billion year-over-year. Revenue increased to Rs 8.4 billion compared to Rs 8 billion in the same period last year. The company's EBITDA grew to Rs 2.4 billion from Rs 2.1 billion, while EBITDA margin expanded to 28.32% from 25.92%. The board approved a dividend of Rs 9 per share.",
            "Sentiment": "positive",
            "PublishDate": 1753168196568,
            "Source": "corporate_action"
        },
        {
            "Title": "CRISIL Ltd. Block Trade: 48,757 Shares at Rs. 6031.00 Each",
            "Summary": "A block trade of approximately 48,757 shares of CRISIL Ltd. occurred on the National Stock Exchange (NSE). The trade was valued at Rs. 29.41 Crores, with each share priced at Rs. 6031.00.",
            "Sentiment": "neutral",
            "PublishDate": 1751363119000,
            "Source": "block_details"
        },
        {
            "Title": "CRISIL Completes Purchase of Minor Stake in OPL",
            "Summary": "CRISIL has completed the purchase of a minor stake in OPL. No further details about the size of the stake or the financial terms of the deal were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1750326858000,
            "Source": "default"
        },
        {
            "Title": "CRISIL Ltd. Block Trade: 51,313 Shares at Rs. 5453.00",
            "Summary": "A block trade of approximately 51,313 shares of CRISIL Ltd. took place on the National Stock Exchange (NSE). The trade was valued at Rs. 27.98 crores, with each share priced at Rs. 5453.00.",
            "Sentiment": "neutral",
            "PublishDate": 1749538570000,
            "Source": "block_details"
        },
        {
            "Title": "CRISIL Reports Strong Q4 2023 Results and Declares Dividend",
            "Summary": "CRISIL has announced its Q4 2023 financial results, showing significant year-over-year growth. The company reported revenue of 8.13 billion rupees, up from 7.4 billion in the previous year. EBITDA increased to 2.32 billion rupees from 1.92 billion, with the EBITDA margin improving to 28.54% from 26.04%. Consolidated net profit rose to 1.6 billion rupees from 1.38 billion. Additionally, CRISIL declared a dividend of 8 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1746000466000,
            "Source": "result"
        },
        {
            "Title": "CRISIL: 2,600% Dividend Payout Announced, Ex-Dividend Date Set",
            "Summary": "CRISIL will trade ex-dividend for a final dividend of ₹26 per share (2,600%) on April 11. The record date is set for April 14. Investors can buy shares until April 11 to be eligible for the dividend.",
            "Sentiment": "positive",
            "PublishDate": 1744173384000,
            "Source": "corporate_action"
        },
        {
            "Title": "CRISIL to be Added to FTSE All World Index",
            "Summary": "CRISIL, an Indian analytics company, is set to be added to the FTSE All World Index. This inclusion is expected to result in an inflow of approximately 700 million rupees ($8.1 million) into CRISIL's stock.",
            "Sentiment": "positive",
            "PublishDate": 1742548455000,
            "Source": "corporate_action"
        },
        {
            "Title": "Crisil: Rating Agencies Rely on Audited Data, Not Forensic Accountants",
            "Summary": "Crisil CEO Amish Mehta clarifies that rating agencies depend on audited information and public disclosures, not forensic accounting. He emphasizes the importance of timely disclosures for material events and discusses the use of AI in rating models, which is still in testing phase due to high accuracy requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1742150396000,
            "Source": "normal_news"
        },
        {
            "Title": "Crisil Ltd: Q4 Profit Rises 7%, Revenue Dips Slightly",
            "Summary": "Crisil Ltd reported a 7% increase in Q4 net profit to Rs 224.7 crore, while revenue decreased marginally by 0.5% to Rs 912.9 crore. EBITDA rose 5.7% to Rs 287.1 crore, with margins expanding to 31.4%. The board recommended a final dividend of Rs 26 per share for FY 2024, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1739204547000,
            "Source": "earnings"
        },
        {
            "Title": "CRISIL Reports Improved Q3 Financial Performance",
            "Summary": "CRISIL, a leading analytics and ratings company, has announced its financial results for the third quarter. The company reported an EBITDA of 2.87 billion rupees, up from 2.7 billion rupees in the same quarter last year. Additionally, CRISIL's EBITDA margin improved to 31.43% from 29.30% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739198605000,
            "Source": "earnings"
        },
        {
            "Title": "CRISIL Reports Mixed Q3 Financial Results",
            "Summary": "CRISIL, a leading analytics company, has reported its third quarter financial results. The consolidated net profit increased to 2.25 billion rupees, up from 2.1 billion rupees in the same quarter last year. However, revenue slightly decreased to 9.1 billion rupees from 9.2 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739198600000,
            "Source": "earnings"
        },
        {
            "Title": "CRISIL to Consider Q3 Results on February 10",
            "Summary": "CRISIL, a leading analytics company, has announced that it will consider its third quarter (Q3) financial results on February 10. This indicates that the company is preparing to release its earnings report for the quarter ended December 31, 2023.",
            "Sentiment": "neutral",
            "PublishDate": 1735818890000,
            "Source": "corporate_action"
        },
        {
            "Title": "CRISIL to Invest 332.5 Million Rupees in Online PSB Loans",
            "Summary": "CRISIL has announced plans to invest 332.5 million rupees in Online PSB Loans, which will result in the acquisition of a 4.08% stake in the company. This investment represents a strategic move by CRISIL to expand its presence in the digital lending sector.",
            "Sentiment": "positive",
            "PublishDate": 1734012798000,
            "Source": "corporate_action"
        },
        {
            "Title": "CRISIL Appoints New Chief Financial Officer",
            "Summary": "CRISIL has announced that Dinesh Venkatasubramanian will be joining the company as its new Chief Financial Officer.",
            "Sentiment": "neutral",
            "PublishDate": 1730117275000,
            "Source": "corporate_action"
        },
        {
            "Title": "CRISIL Approves Merger with Bridge to India Energy",
            "Summary": "CRISIL has announced its approval to merge Bridge to India Energy with itself. This decision represents a significant corporate restructuring move for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1729086772000,
            "Source": "corporate_action"
        },
        {
            "Title": "CRISIL Announces Dividend of 15 Rupees per Share",
            "Summary": "CRISIL, a leading analytics company, has declared a dividend of 15 rupees per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1729080558000,
            "Source": "corporate_action"
        },
        {
            "Title": "CRISIL: Q3 Profit Jumps 13%, Declares ₹15 Interim Dividend",
            "Summary": "CRISIL reported a 12.9% YoY increase in Q3 net profit to ₹171.6 crore. Revenue rose 10.3% to ₹811.8 crore. EBITDA grew 16.7% to ₹223.8 crore with a margin of 27.6%. The board declared an interim dividend of ₹15 per share.",
            "Sentiment": "positive",
            "PublishDate": 1729079543000,
            "Source": "result"
        },
        {
            "Title": "CRISIL: Jumps 12 Spots in Global RiskTech Rankings",
            "Summary": "<p><span class='positive'>CRISIL Ltd</span> has <span class='positive'>risen</span> to <b>37th place</b> in the <span class='neutral'>Chartis RiskTech100 2025 report</span>, up <span class='positive'>12 positions</span> from last year. The company was also <span class='positive'>recognized</span> as a <span class='positive'>Category Leader</span> in <span class='neutral'>model validation</span> for the <b>third consecutive year</b>.<br/><br/>CRISIL's <span class='neutral'>risk management solutions</span>, including <span class='neutral'>Model Infinity</span> and <span class='neutral'>Credit+ platforms</span>, were <span class='positive'>highlighted</span> for their <span class='positive'>advanced analytics</span> and <span class='positive'>AI-driven capabilities</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728635770000,
            "Source": "normal_news"
        }
    ]
}