{
    "Symbol": "CRIZAC",
    "ISIN": "INE0S4R01014",
    "News": [
        {
            "Title": "Crizac Q3FY26 Earnings Call Recording Available",
            "Summary": "Crizac Limited has made available the audio recording of its Q3FY26 earnings conference call held on January 28, 2026, discussing unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769613351509,
            "Source": "co_actions_results"
        },
        {
            "Title": "Crizac Declares Dividend of Rs 8 Per Share",
            "Summary": "Crizac has announced a dividend payment of Rs 8 per share to its shareholders, marking a significant distribution to investors.",
            "Sentiment": "positive",
            "PublishDate": 1769582168542,
            "Source": "co_actions_results"
        },
        {
            "Title": "Crizac Reports 15.47% Growth in Q3 Net Profit",
            "Summary": "Crizac delivers strong Q3 performance with consolidated net profit rising to 500 million rupees from 433 million rupees in the previous year, marking robust year-on-year growth for the company.",
            "Sentiment": "positive",
            "PublishDate": 1769581947338,
            "Source": "co_actions_results"
        },
        {
            "Title": "Crizac Board Meet on Jan 28 for Q3 Results & Dividend",
            "Summary": "Crizac Limited has scheduled its board meeting for January 28, 2026, to approve Q3FY26 financial results and consider interim dividend declaration with record date set for February 4, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769084026260,
            "Source": "co_actions_results"
        },
        {
            "Title": "Crizac shares in focus as 60% equity unlocks",
            "Summary": "Around 104.9 million shares worth ₹2,885 crore of B2B education platform Crizac Ltd. become eligible for trading as six-month lock-in period ends on January 8.",
            "Sentiment": "neutral",
            "PublishDate": 1767828892439,
            "Source": "stocks"
        },
        {
            "Title": "Crizac Acquires 51% Stake in Global Tree Careers",
            "Summary": "Crizac Limited's board approves acquisition of 51.04% stake in Global Tree Careers Private Limited for ₹100.02 million through primary investment, marking strategic expansion in education sector.",
            "Sentiment": "positive",
            "PublishDate": 1767795698088,
            "Source": "co_actions_results"
        },
        {
            "Title": "Crizac Limited Announces Board Changes at UK Subsidiary",
            "Summary": "Crizac Limited has announced changes to the board of directors of its material foreign unlisted subsidiary, Crizac Ltd (UK). Christopher Flood Nagle has been appointed as a director, while Gaurav Agarwal has resigned from his directorship position due to preoccupation. Nagle has been serving as Chief Executive Officer of Crizac Ltd (UK) since March 21, 2024, and holds a Bachelor of Arts degree in European Social and Political Studies from University College London. The appointment of Nagle is currently under process with the regulatory authority, and Agarwal's resignation has been accepted.",
            "Sentiment": "neutral",
            "PublishDate": 1761849841968,
            "Source": "corporate_governance"
        },
        {
            "Title": "Crizac Limited's Subsidiary Acquires 51% Stake in UK-Based Studies Planet.Com Limited",
            "Summary": "Crizac Ltd, a wholly owned subsidiary of Crizac Limited, has acquired 51% equity share capital in Studies Planet.Com Limited, a UK-based company engaged in international student recruitment. Studies Planet.Com Limited, incorporated in 2007, reported a turnover of £138,613 and net loss of £26,337 as of September 30, 2024. The acquisition involves 510 shares and will be paid in cash through one or more tranches, with completion expected by March 31, 2026. The transaction is part of Crizac's strategy to expand into the South American market and enhance its presence in the education sector. The acquisition price has not been disclosed due to confidentiality reasons, and the transaction does not qualify as a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1761277282799,
            "Source": "order&deals"
        },
        {
            "Title": "Crizac Reports Strong Q2 Performance with 139% Jump in Net Profit",
            "Summary": "Crizac delivered robust quarterly results with consolidated net profit surging to 483 million rupees from 202 million rupees year-over-year. Revenue grew to 1.6 billion rupees compared to 1.3 billion rupees in the same period last year. EBITDA nearly doubled to 633 million rupees from 325 million rupees, while EBITDA margin expanded significantly to 38.99% from 25.04% year-over-year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1760661247556,
            "Source": "earnings"
        },
        {
            "Title": "Crizac Projects Strong Double-Digit Growth Through Global Service Expansion and Automation",
            "Summary": "Crizac projects strong double-digit growth through expansion of its education consulting, forex, and student loan services globally. The company plans to leverage automation to double its processing efficiency as part of its growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1760632368699,
            "Source": "stock"
        },
        {
            "Title": "Crizac Ltd Corrects Financial Results Error, Revises Figure from 860 Lakhs to 86,000 Lakhs",
            "Summary": "Crizac Ltd issued a correction to its unaudited financial results for the quarter and half year ended September 30, 2025. The company identified errors in both standalone and consolidated financial results where 860.00 Lakhs was incorrectly stated instead of 86,000 Lakhs in the notes section. The company clarified that this correction does not impact the company's profit and that the integrated financial results filed in XBRL format remain accurate. The errors were described as inadvertent and unintentional in nature.",
            "Sentiment": "neutral",
            "PublishDate": 1760626831301,
            "Source": "earnings"
        },
        {
            "Title": "Crizac Limited Reports Strong Q2 Performance with Revenue Growth and Successful IPO Listing",
            "Summary": "Crizac Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company, primarily engaged in international student recruitment, reported revenue from operations of Rs. 904.78 lakhs for the quarter and Rs. 1,361.46 lakhs for the half year. Net profit after tax reached Rs. 4,155.07 lakhs for the quarter and Rs. 8,681.75 lakhs for the half year. The company completed its IPO during the quarter, with 3,51,02,040 equity shares listed on NSE and BSE on July 9, 2025, at an issue price of Rs. 245.00 per share. The IPO comprised an offer for sale aggregating to Rs. 860.00 lakhs. Basic earnings per share stood at Rs. 2.62 for the quarter. The company implemented an Employee Stock Option Plan 2024, recognizing an expense of Rs. 55.55 lakhs for the quarter. Cash and cash equivalents increased to Rs. 609.37 lakhs. The business being seasonal in nature, quarterly results vary and are not representative of annual performance.",
            "Sentiment": "positive",
            "PublishDate": 1760615571040,
            "Source": "earnings"
        },
        {
            "Title": "Crizac Limited Reports 30% Revenue Growth in Q1 FY26 Earnings Call",
            "Summary": "Crizac Limited reported revenue of INR 209.53 crores for the quarter ended June 30, 2025, representing 30% growth compared to the previous year. The company's profit after tax increased 10% to INR 45.81 crores, accounting for 21% of revenue. Cost of services was 64% of revenue at INR 134.38 crores. The company processed 110,000 applications during the quarter, a 69% increase from 65,000 applications in the same period last year. Management indicated they expect similar growth rates to continue if market conditions remain stable. The company is expanding into new markets including Dubai, Ireland, and New Zealand to diversify from its UK-focused business. Management noted that Q4 typically represents about 40% of annual revenue, with Q2 being the leanest quarter at around 10%. The company maintains over 60 marketing managers and has agents who have been with the business since inception.",
            "Sentiment": "positive",
            "PublishDate": 1754660412800,
            "Source": "earnings"
        },
        {
            "Title": "Crizac Limited Schedules Earnings Conference Call for August 5, 2025",
            "Summary": "Crizac Limited has scheduled an earnings conference call for investors and analysts on August 5, 2025, at 4:00 PM IST to discuss the company's financial results and performance outlook for the quarter ended June 30, 2025. The call will be hosted by senior management including Dr. Vikash Agarwal (Chairman & MD), Mr. Manish Agarwal (CFO), and Mr. Christopher Flood Nagle (CEO of Crizac UK). Participants can join via universal access numbers or international toll-free numbers for USA, UK, Singapore, Hong Kong, and Japan. The company is listed on NSE with symbol CRIZAC and on BSE with scrip code 544439.",
            "Sentiment": "neutral",
            "PublishDate": 1753797300132,
            "Source": "earnings"
        },
        {
            "Title": "Crizac: Shares Surge 8% Post-Listing, Abakkus Acquires Stake",
            "Summary": "Crizac shares rose 8% to Rs 330.65 on its second trading day. Abakkus Asset Manager bought 36,72,914 shares at Rs 298.33 per share in a bulk deal. The company's IPO was oversubscribed 63 times and listed at a 14.7% premium on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1752133275000,
            "Source": "block_deals"
        },
        {
            "Title": "Crizac Ltd: Abakkus Asset Manager Acquires Significant Stake Post-IPO",
            "Summary": "Sunil Singhania's Abakkus Asset Manager bought 36.73 lakh shares of newly-listed Crizac Ltd at ₹298.33 per share, totaling ₹109.5 crore. Crizac, a B2B education platform, listed at a 14.71% premium on NSE and ended its debut 25% higher at ₹306. The company's recent IPO raised ₹860 crore through an offer for sale.",
            "Sentiment": "positive",
            "PublishDate": 1752114059000,
            "Source": "block_deals"
        }
    ]
}