{
    "Symbol": "CROMPTON",
    "ISIN": "INE299U01018",
    "News": [
        {
            "Title": "Crompton Greaves Reappoints P R Ramesh as Director",
            "Summary": "Crompton Greaves Consumer Electricals board approves re-appointment of Mr. P R Ramesh as Non-Executive Independent Director for second term from May 21, 2026 to January 16, 2030, subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1770397204931,
            "Source": "stocks"
        },
        {
            "Title": "Crompton Greaves Launches Insulated Cables Range",
            "Summary": "Crompton Greaves Consumer Electricals announces launch of new Insulated Wires & Cables product range for domestic market by end of March 2026 under Regulation 30 disclosure.",
            "Sentiment": "positive",
            "PublishDate": 1770394679464,
            "Source": "stocks"
        },
        {
            "Title": "Crompton Greaves Q3FY26 Results & Board Decisions",
            "Summary": "Crompton Greaves Consumer Electricals announced Q3FY26 financial results for quarter ended December 31, 2025, along with board approval for postal ballot notice regarding director appointment.",
            "Sentiment": "neutral",
            "PublishDate": 1770374019986,
            "Source": "co_actions_results"
        },
        {
            "Title": "Crompton Launches OZONEPAC Personal Air Cooler",
            "Summary": "Crompton Greaves Consumer Electricals Limited announces the launch of OZONEPAC personal air cooler for the domestic market on January 30, 2026, under Regulation 30 disclosure requirements.",
            "Sentiment": "positive",
            "PublishDate": 1769776022702,
            "Source": "stocks"
        },
        {
            "Title": "Crompton Greaves Gets CRISIL AA+/Stable Rating",
            "Summary": "CRISIL assigns AA+/Stable rating to Crompton Greaves for Rs. 975 crore long-term and A1+ for Rs. 975 crore short-term bank facilities, while withdrawing NCD rating post redemption.",
            "Sentiment": "positive",
            "PublishDate": 1769524845345,
            "Source": "stocks"
        },
        {
            "Title": "Crompton Greaves Launches Tablight 200W LED Flood Lights",
            "Summary": "Crompton Greaves Consumer Electricals Limited announces the launch of Tablight 200W LED Flood Lights for the domestic B2C lighting market on January 23, 2026, as part of good corporate governance practices.",
            "Sentiment": "positive",
            "PublishDate": 1769173470863,
            "Source": "stocks"
        },
        {
            "Title": "Crompton Greaves Q3FY26 Earnings Call on Feb 6",
            "Summary": "Crompton Greaves Consumer Electricals has scheduled its Q3FY26 earnings call for February 6, 2026, at 4:30 PM IST to discuss unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768825931038,
            "Source": "co_actions_results"
        },
        {
            "Title": "Crompton Greaves Faces Consumer Order for ₹12,620",
            "Summary": "District Consumer Commission orders Crompton Greaves to pay ₹12,620 compensation for defective pump complaint, with company stating no material financial impact expected.",
            "Sentiment": "negative",
            "PublishDate": 1768388839040,
            "Source": "stocks"
        },
        {
            "Title": "Crompton Launches New 70W & 80W Dynaray LED Lamps",
            "Summary": "Crompton Greaves Consumer Electricals Limited announced the launch of two new LED lamp variants under its Dynaray series for the domestic B2C lighting market on January 09, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767955006865,
            "Source": "stocks"
        },
        {
            "Title": "Crompton Greaves Faces ₹33.58L GST Demand Order",
            "Summary": "Crompton Greaves Consumer Electricals receives GST demand order of ₹33.58 lakhs from Deputy Commissioner, Bengaluru for alleged excess ITC claims during April 2021-March 2022. Company plans to appeal.",
            "Sentiment": "negative",
            "PublishDate": 1767178221544,
            "Source": "stocks"
        },
        {
            "Title": "Crompton Greaves Launches Star Lord Pro Panels",
            "Summary": "Crompton Greaves Consumer Electricals officially launched 15W Star Lord Pro Panels on December 29, 2025, targeting domestic B2C lighting market as disclosed under Regulation 30.",
            "Sentiment": "positive",
            "PublishDate": 1767089247115,
            "Source": "stocks"
        },
        {
            "Title": "Crompton Greaves Gets Buy Rating with ₹340 Target",
            "Summary": "Crompton Greaves Consumer Electricals receives Buy rating with ₹340 target price, driven by solar business expansion and Crompton 2.0 transformation strategy.",
            "Sentiment": "positive",
            "PublishDate": 1766757721942,
            "Source": "stocks"
        },
        {
            "Title": "Crompton Greaves Appoints Anita Pansar as CTO",
            "Summary": "Crompton Greaves Consumer Electricals appoints Ms. Anita Pansar as Head Innovation & Chief Technology Officer with effect from January 2, 2026, bringing 25+ years of global R&D experience.",
            "Sentiment": "positive",
            "PublishDate": 1766747140435,
            "Source": "stocks"
        },
        {
            "Title": "Crompton Greaves Wins ₹46.20 Cr Solar Pump Order",
            "Summary": "Crompton Greaves Consumer Electricals secures EPC contract from MSEDCL for 2000 solar water pumping systems worth ₹46.20 crore with 60-day completion timeline.",
            "Sentiment": "positive",
            "PublishDate": 1766553842956,
            "Source": "co_actions_results"
        },
        {
            "Title": "Crompton Greaves Faces ₹3.34 Cr GST Demand Appeal",
            "Summary": "Crompton Greaves Consumer Electricals receives partially adverse order from Commissioner (Appeals) on GST demand of ₹3.34 crores for FY 2019-20, plans further appeal.",
            "Sentiment": "negative",
            "PublishDate": 1766413365427,
            "Source": "stocks"
        },
        {
            "Title": "Crompton Greaves Gets Patent for Energy Efficient Cooling",
            "Summary": "Crompton Greaves Consumer Electricals receives patent for energy efficient cooling technology combining ceiling fan and air conditioner based on environmental conditions, valid for 20 years.",
            "Sentiment": "positive",
            "PublishDate": 1766234257450,
            "Source": "stocks"
        },
        {
            "Title": "Crompton Greaves Faces ₹1.47 Cr GST Demand",
            "Summary": "Crompton Greaves Consumer Electricals receives GST demand of ₹1.47 crores from Himachal Pradesh authorities for alleged excess ITC claims during April 2021-March 2022 period.",
            "Sentiment": "negative",
            "PublishDate": 1765967994482,
            "Source": "stocks"
        },
        {
            "Title": "Crompton Greaves Faces ₹1.50 Lakh GST Demand",
            "Summary": "Crompton Greaves Consumer Electricals receives GST demand of ₹1.50 lakh from Kerala authorities for alleged short liability under reverse charge mechanism for FY22. Company plans to appeal.",
            "Sentiment": "negative",
            "PublishDate": 1765535510513,
            "Source": "stocks"
        },
        {
            "Title": "Crompton Greaves Wins ₹287 Cr Solar Pump Order",
            "Summary": "Crompton Greaves Consumer Electricals secures major EPC contract from MSEDCL for 1,214 solar water pumping systems worth ₹287.18 crores under PM-KUSUM scheme across Maharashtra.",
            "Sentiment": "positive",
            "PublishDate": 1765460745914,
            "Source": "co_actions_results"
        },
        {
            "Title": "Crompton Opens Special Window for Share Transfers",
            "Summary": "Crompton Greaves Consumer Electricals opens 6-month special window till January 6, 2026 for re-lodgement of rejected physical share transfer requests under SEBI circular guidelines.",
            "Sentiment": "neutral",
            "PublishDate": 1765447440651,
            "Source": "stocks"
        },
        {
            "Title": "Crompton Greaves Consumer Electricals Reconstitutes Corporate Social Responsibility Committee",
            "Summary": "Crompton Greaves Consumer Electricals Limited's Board approved the reconstitution of its Corporate Social Responsibility Committee effective January 1, 2026, inducting Ms. Hiroo Mirchandani as a member and appointing her as Chairperson. The committee will comprise four members including the MD & CEO, with Ms. Mirchandani leading the corporate social responsibility oversight function.",
            "Sentiment": "neutral",
            "PublishDate": 1765005555702,
            "Source": "corporate_governance"
        },
        {
            "Title": "Crompton Greaves Consumer Electricals Faces Consumer Commission Order for ₹41,465",
            "Summary": "Crompton Greaves Consumer Electricals Limited received a consumer commission order directing payment of ₹41,465 (₹14,728 compensation, ₹22,737 interest, ₹5,000 other expenses) in a case involving a malfunctioning 3-H.P. submersible motor from CG Power and Industrial Solutions Limited. The company clarified that despite being distinct legal entities, the commission did not consider this distinction, though the financial impact is deemed non-material to operations.",
            "Sentiment": "negative",
            "PublishDate": 1764591097654,
            "Source": "stock"
        },
        {
            "Title": "Crompton Greaves Consumer Electricals Faces Financial Loss After Court Acquits Debtor",
            "Summary": "Crompton Greaves Consumer Electricals Limited disclosed that a Delhi court acquitted Mr. Satya Prakash Pandey, Proprietor of Harshu Enterprises, of charges under Section 138 of the Negotiable Instruments Act. The company had initiated proceedings against Pandey in connection with a bounced cheque worth Rs. 25,00,598 dated July 4, 2020. The court's acquittal resulted in a financial impact of Rs. 5,00,598 for the company. However, the company stated that there is no material impact on its financials, operations, or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1763015538145,
            "Source": "stock"
        },
        {
            "Title": "Crompton Greaves Reports Q2FY26 Results with Solar Business Expansion and Margin Pressures",
            "Summary": "Crompton Greaves Consumer Electricals reported steady revenue performance with 3% year-on-year volume growth in quarterly results. The company was certified by Euromonitor International as the world's number 1 ceiling fan company. The solar business showed significant momentum with rooftop orders worth Rs. 500 crores and solar pumps business growing at 100% year-on-year with current order pipeline of Rs. 255 crores. However, ECD margins faced pressure due to commodity price increases and adverse market conditions in LDA and TPW segments. The company took a 1.4% price increase in fans business and incurred Rs. 20 crores in exceptional restructuring costs for Baroda operations. Butterfly business delivered strong performance with 13.6% revenue growth and 21% EBITDA growth. Lighting segment showed robust performance with 3.1% revenue growth and 50% EBIT growth, with margins expanding 480 basis points to 15.5%. The company expects solar business to potentially become the second largest business within 1-2 years.",
            "Sentiment": "neutral",
            "PublishDate": 1762964938768,
            "Source": "earnings"
        },
        {
            "Title": "Crompton Greaves Consumer Management Provides Limited Guidance on Business Outlook",
            "Summary": "Crompton Greaves Consumer management declined to provide specific guidance on lighting margins sustainability, stating they plan to reinvest in growth. The company has solar rooftop orders worth INR 500 crores expected to be executed over 6-12 months, though management was reluctant to provide quarterly targets. While management explicitly stated they refrain from giving forward guidance, they indicated expectations for the solar business to reach INR 2,000 crores in 18-24 months.",
            "Sentiment": "neutral",
            "PublishDate": 1762487309534,
            "Source": "stock"
        },
        {
            "Title": "Crompton Greaves Targets ₹2,000 Crore Revenue from Solar Business in 18-24 Months",
            "Summary": "Crompton Greaves aims to generate ₹2,000 crore in revenue from solar pumps and rooftop projects over the next 18-24 months. The company is strengthening its solar EPC execution capabilities and direct-to-consumer channels, having secured over 50,000 rooftop orders. The company expects growth from GST 2.0 implementation, which is anticipated to boost sales across its fans, appliances, and lighting segments while improving margins in its premium product portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1762438426781,
            "Source": "stock"
        },
        {
            "Title": "Crompton Greaves Consumer Electricals Reports 43% Decline in Q2 Net Profit Despite Revenue Growth",
            "Summary": "Crompton Greaves Consumer Electricals reported Q2 consolidated net profit of 712 million rupees, down from 1.25 billion rupees year-over-year. Revenue increased to 19.16 billion rupees from 18.96 billion rupees in the same period last year. EBITDA declined to 1.58 billion rupees from 2.03 billion rupees year-over-year, with EBITDA margin compressing to 8.27% from 10.74% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762425322729,
            "Source": "earnings"
        },
        {
            "Title": "Crompton Greaves Consumer Electricals Secures ₹445 Crore Solar Rooftop Order",
            "Summary": "Crompton Greaves Consumer Electricals has secured a solar rooftop order worth ₹445 crores covering over 40,000 homes. This represents the largest solar rooftop project in the company's portfolio and demonstrates rapid growth in the solar segment just two months after entering the market.",
            "Sentiment": "positive",
            "PublishDate": 1761523705777,
            "Source": "order&deals"
        },
        {
            "Title": "Crompton Greaves Consumer Electricals Schedules Q2FY26 Earnings Call for November 6, 2025",
            "Summary": "Crompton Greaves Consumer Electricals Limited has announced an earnings call to discuss its unaudited financial results for the quarter and half year ended September 30, 2025. The call is scheduled for November 6, 2025, at 5:00 PM IST. The management team participating includes Managing Director & CEO Promeet Ghosh, CFO Kaleeswaran Arunachalam, Chief Business Officer of Butterfly Gandhimathi Appliances Swetha Sagar, and Head of Investor Relations Natasha Kedia. The earnings call is being facilitated by Kotak Institutional Equities.",
            "Sentiment": "neutral",
            "PublishDate": 1761290720385,
            "Source": "earnings"
        },
        {
            "Title": "Crompton Greaves Consumer Electricals Secures ₹445.04 Crore Solar Installation Contract in Andhra Pradesh",
            "Summary": "Crompton Greaves Consumer Electricals has won a ₹445.04 crore contract from NREDCAP to install solar systems for 38,699 SC & ST users in Andhra Pradesh. The project will be executed over a 5-year period.",
            "Sentiment": "positive",
            "PublishDate": 1761284050853,
            "Source": "order&deals"
        },
        {
            "Title": "Crompton Greaves Consumer Electricals Shareholders Approve Appointment of Sundaram Damodarannair as Director",
            "Summary": "Crompton Greaves Consumer Electricals Limited completed a postal ballot process with results announced on October 20, 2025. Shareholders approved the ordinary resolution to appoint Mr. Sundaram Damodarannair (DIN: 00016304) as Non-Executive Non-Independent Director. The voting period ran from September 20, 2025 to October 19, 2025. Out of 643,852,913 total shares, 502,341,443 votes were polled (78.021% of outstanding shares). The resolution passed with 491,219,112 votes in favor (97.786%) and 11,122,331 votes against (2.214%). Ms. Alifya Sapatwala from M/s. Mehta & Mehta served as the scrutinizer for the postal ballot process.",
            "Sentiment": "positive",
            "PublishDate": 1760977222998,
            "Source": "corporate_governance"
        },
        {
            "Title": "Crompton Greaves Consumer Electricals Ordered to Pay ₹1.1 Lakh in Consumer Dispute Over Defective Ceiling Fan",
            "Summary": "Crompton Greaves Consumer Electricals Limited has been directed by the District Consumer Disputes Redressal Commission, Coimbatore to pay ₹1,00,000 as compensation and ₹10,000 as costs for proceedings related to a consumer complaint about a defective ceiling fan. The order was dated August 4, 2025, and received by the company on October 15, 2025. The consumer had filed the complaint claiming compensation for the defect in the ceiling fan. The company stated there is no material impact on its financials, operations, or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1760533579474,
            "Source": "stock"
        },
        {
            "Title": "Crompton Greaves Secures ₹515.9 Million Order",
            "Summary": "Crompton Greaves has received an order worth ₹515.9 million. The company announced this order acquisition, though specific details about the nature of the order, client, or delivery timeline were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1759927482646,
            "Source": "order&deals"
        },
        {
            "Title": "Crompton Greaves Secures Order Worth ₹47.5 Million",
            "Summary": "Crompton Greaves has received an order valued at ₹47.5 million. The company announced this new business development, though specific details about the nature of the order, client, or delivery timeline were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1759457070082,
            "Source": "order&deals"
        },
        {
            "Title": "Crompton Greaves Consumer Electricals Wins Rs 4.28 Crore Solar Water Pumping Contract",
            "Summary": "Crompton Greaves Consumer Electricals Limited received a Letter of Award from Madhya Pradesh Urja Vikas Nigam Limited for solar water pumping systems. The contract involves design, manufacture, supply, transport, installation, testing and commissioning of 196 Off-grid DC & AC Solar Photovoltaic Water Pumping Systems under the PM KUSUM-B scheme. The work order value is approximately Rs 4.28 crores excluding GST, with completion required within 120 days from the work order issuance date. The project is being implemented in Madhya Pradesh as PM Krishak Mitra Surya Yojana. This is a domestic contract with no related party transactions or promoter group interests involved.",
            "Sentiment": "positive",
            "PublishDate": 1758359326876,
            "Source": "order&deals"
        },
        {
            "Title": "Crompton Greaves Seeks Shareholder Approval for Director Appointment via Postal Ballot",
            "Summary": "Crompton Greaves Consumer Electricals Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. Sundaram Damodarannair as a Non-Executive Non-Independent Director. Mr. Sundaram has served as an Independent Director for 10 years across two consecutive terms, with his current tenure ending September 17, 2025. The company proposes to retain his expertise and institutional knowledge by transitioning him to a Non-Executive Non-Independent role until he reaches the retirement age of 75 years on April 16, 2028. The e-voting period runs from September 20 to October 19, 2025, with results to be announced by October 21, 2025. The company cited the need for continuity during leadership transitions, as several senior directors have recently retired or stepped down. Mr. Sundaram will receive sitting fees and commission similar to other directors, with no change in compensation structure. The Board maintains that this appointment complies with applicable laws and will preserve board stability while maintaining a majority of Independent Directors.",
            "Sentiment": "neutral",
            "PublishDate": 1758281690182,
            "Source": "corporate_action"
        },
        {
            "Title": "Crompton Greaves Reappoints Sundaram Damodarannair as Chairman in Non-Independent Role",
            "Summary": "Crompton Greaves Consumer Electricals Ltd appointed Mr. Sundaram Damodarannair as Additional Non-Executive, Non-Independent Director and Chairman of the Board effective September 18, 2025. His tenure as Independent Director concludes on September 17, 2025, after serving two consecutive five-year terms since August 2015. The new appointment extends until he reaches 75 years of age on April 15, 2028, subject to shareholder approval through postal ballot. The Board reconstituted five committees including Audit, Nomination & Remuneration, Stakeholders' Relationship, Corporate Social Responsibility, and Risk Management committees to include Damodarannair in various roles. The company also approved a Board Diversity Policy to strengthen corporate governance framework. Damodarannair brings extensive experience from his career at Hindustan Unilever Limited, where he served as CFO and Vice Chairman, and currently serves on boards of Infosys Limited and other companies.",
            "Sentiment": "neutral",
            "PublishDate": 1757931765914,
            "Source": "corporate_governance"
        },
        {
            "Title": "Crompton Greaves Consumer Electricals Shareholders Approve Alteration of Memorandum Object Clause via Postal Ballot",
            "Summary": "Crompton Greaves Consumer Electricals Limited completed a postal ballot process on September 12, 2025, seeking shareholder approval for a special resolution to alter the Object Clause of the company's Memorandum of Association. The voting period ran from August 14 to September 12, 2025. Out of 643,852,913 total shares, 499,349,757 votes were polled (77.56% participation). The resolution received overwhelming support with 499,335,951 votes in favor (99.997%) and only 13,806 votes against (0.003%). The special resolution was passed with the required majority, as votes in favor exceeded three times the votes against. Ms. Alifya Sapatwala from Mehta & Mehta served as the scrutinizer for the postal ballot process.",
            "Sentiment": "positive",
            "PublishDate": 1757693459093,
            "Source": "corporate_action"
        },
        {
            "Title": "Crompton Greaves Consumer Electricals Receives Rs 4.76 Crore Solar Water Pumping Systems Order",
            "Summary": "Crompton Greaves Consumer Electricals Limited received a Letter of Empanelment from Madhya Pradesh Urja Vikas Nigam Limited for solar water pumping systems. The order covers 232 off-grid DC & AC Solar Photovoltaic Water Pumping Systems of 2 HP, 3 HP, 5 HP, and 7.5 HP capacity with a total value of approximately Rs 4.76 crores excluding GST. The work involves design, manufacture, supply, transport, installation, testing and commissioning under the PM KUSUM B scheme, implemented as PM Krishak Mitra Surya Yojana in Madhya Pradesh. The project must be completed within 120 days from the work order issuance date. This is a domestic contract with no related party transactions or promoter group interests involved.",
            "Sentiment": "positive",
            "PublishDate": 1757661322935,
            "Source": "order&deals"
        },
        {
            "Title": "Crompton Greaves Secures Solar Systems Order Worth ₹42.4 Million",
            "Summary": "Crompton Greaves has received approval for a solar systems order valued at ₹42.4 million. The company has secured this contract in the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1756822052032,
            "Source": "order&deals"
        },
        {
            "Title": "Crompton Greaves Seeks Shareholder Approval for Business Expansion via Postal Ballot",
            "Summary": "Crompton Greaves Consumer Electricals Limited has issued a postal ballot notice seeking shareholder approval to alter its Memorandum of Association's Object Clause. The company proposes to expand into new electrical and electronic products, renewable energy sources including solar, wind, and hydel power, along with associated products and services. The e-voting period runs from August 14 to September 12, 2025, with results expected by September 16, 2025. The company reported quarterly revenue of Rs. 1,819 crore with EBIT of Rs. 155 crore and 8.5% EBIT margin. Crompton became debt-free after repaying its Rs. 300 crore NCD. The ECD business declined 8% versus industry decline of 11%, with strong performance in solar pumps (doubled year-on-year) and small domestic appliances showing double-digit growth. The company announced sustainability goals to reduce greenhouse gas emissions by 50% and product emission intensity by 60% by 2035.",
            "Sentiment": "positive",
            "PublishDate": 1755096303971,
            "Source": "corporate_action"
        },
        {
            "Title": "Crompton Greaves Consumer Electricals Wins Rs 14.98 Crore Solar Water Pumping Contract in Madhya Pradesh",
            "Summary": "Crompton Greaves Consumer Electricals Limited received a Letter of Award from Madhya Pradesh Urja Vikas Nigam Limited for installing 452 off-grid Solar Photovoltaic Water Pumping Systems. The contract, valued at approximately Rs 14.98 crore excluding GST, involves installation of water pumping systems with capacities of 2HP, 3HP, 5HP, and 7.5HP under Component-B of the PM KUSUM B scheme, implemented in Madhya Pradesh as PM KrishakMitra Surya Yojana. The company must complete the installation within 120 days from the work order issuance date. The contract is with a domestic entity and does not involve any related party transactions or promoter group interests.",
            "Sentiment": "positive",
            "PublishDate": 1755092931004,
            "Source": "order&deals"
        },
        {
            "Title": "Crompton Greaves Secures 452 Solar Pump Systems Order Worth ₹149.8 Million",
            "Summary": "Crompton Greaves has received an order for 452 solar pump systems valued at ₹149.8 million. The order represents business in the renewable energy segment for the company's pump systems division.",
            "Sentiment": "positive",
            "PublishDate": 1755089138267,
            "Source": "order&deals"
        },
        {
            "Title": "Crompton Greaves Consumer Electricals Secures Rs 49 Crore Solar Water Pumping Contract from MSEDCL",
            "Summary": "Crompton Greaves Consumer Electricals Limited received a Letter of Empanelment from Maharashtra State Electricity Distribution Company Limited (MSEDCL) for solar water pumping systems under the PM Kusum Scheme B. The contract involves 1,884 off-grid solar photovoltaic water pumping systems with a total value of approximately Rs 49 crores excluding GST. The company will design, manufacture, supply, transport, install, test and commission standalone off-grid solar photovoltaic water pumping systems of 3 HP, 5 HP, and 7.5 HP capacity at identified farmer sites in Maharashtra districts. The contract includes complete system warranty, repair and maintenance, and remote monitoring system for 5 years under the Mangel Tyala Saur Krushi Pump Yojana/PM Kusum Scheme B. The work must be completed within 60 days from the work order issuance date.",
            "Sentiment": "positive",
            "PublishDate": 1755067339050,
            "Source": "order&deals"
        },
        {
            "Title": "Crompton Greaves Secures ₹49 Crore Order From MSEDCL",
            "Summary": "Crompton Greaves has secured a ₹49 crore order from Maharashtra State Electricity Distribution Company Limited (MSEDCL). The order represents a significant business win for the company.",
            "Sentiment": "positive",
            "PublishDate": 1755066376096,
            "Source": "order&deals"
        },
        {
            "Title": "Crompton Targets Higher Margins Through Premium Products and Bathroom Sector Expansion",
            "Summary": "Crompton is focusing on achieving higher margins and growth by expanding its premium product offerings and bathroom sector presence. The company plans to leverage its brand power, increase distribution channels, and improve operational efficiency to drive this strategic initiative.",
            "Sentiment": "positive",
            "PublishDate": 1754571428097,
            "Source": "stock"
        },
        {
            "Title": "Crompton Greaves Consumer Electricals Reports Decline in Q1 Financial Performance",
            "Summary": "Crompton Greaves Consumer Electricals reported Q1 consolidated net profit of 1.22 billion rupees, down from 1.5 billion rupees year-over-year and below analyst estimates of 1.54 billion rupees. Revenue declined to 20 billion rupees from 21.4 billion rupees in the previous year, missing estimates of 21.6 billion rupees. EBITDA fell to 1.9 billion rupees compared to 2.32 billion rupees year-over-year, significantly below the estimated 2.4 billion rupees. EBITDA margin compressed to 9.6% from 10.87% in the same period last year, underperforming analyst expectations of 11.1%.",
            "Sentiment": "negative",
            "PublishDate": 1754561982161,
            "Source": "earnings"
        },
        {
            "Title": "Crompton Greaves Consumer Electricals Inaugurates In-House NVH Lab to Enhance Product Quality",
            "Summary": "Crompton Greaves Consumer Electricals Limited inaugurated an in-house NVH (Noise, Vibration and Harshness) lab on August 01, 2025. The facility is designed to deliver quieter, refined, and high-performing products across all categories while improving turnaround time. The company expects the lab to accelerate innovation and deliver exceptional user experience by serving as a strategic enabler for product leadership. The lab aims to meet customer expectations and enrich customer lives through enhanced product quality.",
            "Sentiment": "positive",
            "PublishDate": 1754064063745,
            "Source": "stock"
        },
        {
            "Title": "Crompton Greaves Consumer Electricals Schedules Earnings Call for August 7, 2025",
            "Summary": "Crompton Greaves Consumer Electricals Ltd will host an earnings call on August 7, 2025, at 5:00 PM IST to discuss unaudited financial results for the quarter ended June 30, 2025. The call will feature a management discussion on earnings performance followed by a Q&A session. Key management participants include Managing Director and CEO Promeet Ghosh, CFO Kaleeswaran Arunachalam, Butterfly Gandhimathi Appliances CBO Swetha Sagar, and Head of Investor Relations Natasha Kedia. The conference call will be led by Deepak Agarwal from Axis Capital and will be accessible via Zoom.",
            "Sentiment": "neutral",
            "PublishDate": 1753357226926,
            "Source": "earnings"
        },
        {
            "Title": "Crompton Greaves Consumer Electricals Launches Star VegaNXT LED Lighting Products",
            "Summary": "Crompton Greaves Consumer Electricals Limited launched new B2C lighting products called Star VegaNXT 20W & 30W in the domestic market on July 22, 2025. The products fall under the B2C lighting category and are targeted at the domestic market. The company disclosed this product launch as part of good corporate governance practices, noting that the launch does not meet the materiality threshold for mandatory disclosure.",
            "Sentiment": "positive",
            "PublishDate": 1753277195362,
            "Source": "stock"
        }
    ]
}