{
    "Symbol": "CSBBANK",
    "ISIN": "INE679A01013",
    "News": [
        {
            "Title": "CSB Bank Holds Investor Meeting with Sundaram MF",
            "Summary": "CSB Bank participated in a virtual one-on-one meeting with Sundaram Mutual Fund on February 04, 2026, with no unpublished price sensitive information shared during the interaction.",
            "Sentiment": "neutral",
            "PublishDate": 1770220557982,
            "Source": "stocks"
        },
        {
            "Title": "CSB Bank Updates Fair Disclosure Code",
            "Summary": "CSB Bank's Board approved amendments to its Code of Practices and Procedures for Fair Disclosure of Unpublished Price Sensitive Information on January 28, 2026, in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769598913051,
            "Source": "stocks"
        },
        {
            "Title": "CSB Bank Q3 Asset Quality Shows Mixed Trends",
            "Summary": "CSB Bank reports Q3 GNPA at 1.96% vs 1.81% QoQ and NNPA at 0.67% vs 0.52% QoQ, indicating slight deterioration in asset quality metrics during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1769588541716,
            "Source": "co_actions_results"
        },
        {
            "Title": "CSB Bank Q3 Net Profit Rises to ₹1.53 Billion",
            "Summary": "CSB Bank reported net profit of ₹1.53 billion in Q3, marking growth from ₹1.50 billion in the same quarter previous year, reflecting steady financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1769588517300,
            "Source": "co_actions_results"
        },
        {
            "Title": "CSB Bank shareholders approve director appointment & pay hikes",
            "Summary": "CSB Bank shareholders passed all four resolutions via postal ballot on January 21, 2026, including appointment of Ms. Sheetal Sancheti as director and pay revisions for MD & CEO Pralay Mondal and Executive Director B K Divakara.",
            "Sentiment": "positive",
            "PublishDate": 1769076333295,
            "Source": "co_actions_results"
        },
        {
            "Title": "CSB Bank Q3FY26 Results Call on Jan 28, 2026",
            "Summary": "CSB Bank Limited announces conference call scheduled for January 28, 2026 at 5:30 PM IST to discuss Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768918408392,
            "Source": "co_actions_results"
        },
        {
            "Title": "CSB Bank transfers 15,516 shares to employees",
            "Summary": "CSB Bank Limited transferred 15,516 equity shares from its ESOS Trust to three eligible employees under the Employee Stock Option Scheme 2019 on January 9, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767968544785,
            "Source": "co_actions_results"
        },
        {
            "Title": "CSB Bank shares hit record high after strong Q3 update",
            "Summary": "CSB Bank shares surged over 6% to record high of ₹519.9 after reporting 29% loan book growth and 21% deposit growth in Q3. Stock now up 2.6x from IPO price of ₹191.",
            "Sentiment": "positive",
            "PublishDate": 1767576725790,
            "Source": "co_actions_results"
        },
        {
            "Title": "CSB Bank Q3 Update: 21% rise in deposits, 29% growth",
            "Summary": "CSB Bank reported strong Q3 performance with total deposits rising 21% YoY to ₹40,460 crores and gross advances growing 29% to ₹37,208 crores. Gold advances surged 46% to ₹19,023 crores.",
            "Sentiment": "positive",
            "PublishDate": 1767353156963,
            "Source": "co_actions_results"
        },
        {
            "Title": "CSB Bank Deposits Surge 21% to ₹40,460 Crores",
            "Summary": "CSB Bank reported strong deposit growth with total deposits reaching ₹40,460 crores by December 31, 2025, marking a significant 21% year-over-year increase, reflecting the bank's expanding customer base.",
            "Sentiment": "positive",
            "PublishDate": 1767352876685,
            "Source": "co_actions_results"
        },
        {
            "Title": "CSB Bank Faces ₹43.11 Lakh CGST Penalty",
            "Summary": "CSB Bank received a penalty of ₹43.11 lakh from CGST authorities for alleged excess input tax credit availment and short payment of GST liability under RCM for FY 2018-19 to 2022-23. The bank plans to appeal the order.",
            "Sentiment": "negative",
            "PublishDate": 1767015053604,
            "Source": "stocks"
        },
        {
            "Title": "CSB Bank Board Meet Set for Jan 28 for Q3FY26 Results",
            "Summary": "CSB Bank Limited has scheduled its board meeting for January 28, 2026, to consider and approve unaudited financial results for Q3FY26. Trading window remains closed until January 30, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766993689810,
            "Source": "co_actions_results"
        },
        {
            "Title": "CSB Bank Transfers 17,629 Shares from ESOS Trust",
            "Summary": "CSB Bank's ESOS Trust transferred 17,629 equity shares to two eligible grantees following exercise of vested stock options under ESOP 2019 scheme on December 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765515982166,
            "Source": "co_actions_results"
        },
        {
            "Title": "CSB Bank Reports Strong Q2 Performance with 16% YoY Net Profit Growth",
            "Summary": "CSB Bank delivered impressive quarterly results with net profit rising 16% year-on-year to INR 160 crores and 35% quarter-on-quarter. Operating profit grew 39% YoY to INR 279 crores. Net Interest Income increased 15% YoY and 12% QoQ, while other income surged 75% YoY, constituting 24% of total income. Net Interest Margin improved to 3.81%, up 27 basis points from the previous quarter. Return on Assets stood at 1.33%, up 30 basis points QoQ. On the business front, deposits grew 25% YoY compared to industry growth of 10%, while advances expanded 29% YoY against industry growth of 11.4%. Asset quality metrics showed GNPA at 1.81% and NNPA at 0.52%. The bank maintains a strong capital position with CRAR at 20.99% and Tier I ratio at 19.19%. Gold loans constitute 47% of advances portfolio. Management indicated the technology transformation is largely complete, positioning the bank for retail banking expansion from FY27. The bank operates 838 branches and 810 ATMs as of September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763032722247,
            "Source": "earnings"
        },
        {
            "Title": "CSB Bank Appoints New Director and Approves Quarterly Results",
            "Summary": "CSB Bank's Board of Directors approved unaudited financial results for the quarter and half year ended September 30, 2025. The bank appointed Ms. Sheetal Rupesh Sancheti as Additional Director in the Non-Executive Non-Independent category, nominated by promoter FIH Mauritius Investments Ltd. Sancheti, a Chartered Accountant with over 20 years of experience, serves as Vice President at Fairbridge Capital Private Limited, monitoring portfolio investments for Fairfax India Holdings Corporation. She previously held finance roles at ANZ Bank India, HSBC Bank India, Abu Dhabi Commercial Bank, and BSR Co. The appointment is effective November 5, 2025, and requires member approval within the prescribed timeframe. The bank also reconstituted its Board committees effective November 6, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762346579963,
            "Source": "corporate_governance"
        },
        {
            "Title": "CSB Bank Reports 16% Growth in Q2 Net Profit to 1.6 Billion Rupees",
            "Summary": "CSB Bank reported net profit of 1.6 billion rupees in Q2, up from 1.38 billion rupees year-over-year. Revenue increased to 11 billion rupees from 8.6 billion rupees compared to the same period last year. Provisions rose significantly to 636.5 million rupees from 139 million rupees year-over-year. Asset quality showed improvement with gross NPA declining to 1.81% from 1.84% quarter-over-quarter, while net NPA decreased to 0.52% from 0.66% quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762338327582,
            "Source": "earnings"
        },
        {
            "Title": "CSB Bank Reports Strong Growth in Deposits and Advances for Q2 FY26",
            "Summary": "CSB Bank reported total deposits of ₹39,651 crores, representing a 25% year-on-year growth for Q2 FY26. The bank's advances reached ₹34,730 crores, marking a 29% year-on-year increase during the same period.",
            "Sentiment": "positive",
            "PublishDate": 1759409012422,
            "Source": "earnings"
        },
        {
            "Title": "CSB Bank Reconstitutes Nomination and Remuneration Committee with Five Members",
            "Summary": "CSB Bank's Board of Directors reconstituted the Nomination and Remuneration Committee effective September 27, 2025. The new committee comprises five members: Mr. Sharad Kumar Saxena as Chairperson (Non-Executive & Independent), Mr. Sumit Maheshwari (Non-Executive & Non-Independent), Mr. Sudhin Choksey (Non-Executive & Independent), Ms. Renu Kohli (Non-Executive & Independent), and Mr. D N Narasimha Raju (Non-Executive & Independent). The decision was made during the Board meeting held on September 26, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758877900335,
            "Source": "corporate_governance"
        },
        {
            "Title": "CSB Bank Shareholders Approve All 9 Resolutions at 104th AGM Including CEO Reappointment",
            "Summary": "CSB Bank held its 104th Annual General Meeting on August 26, 2025, where shareholders approved all 9 resolutions through electronic voting. Key approvals included adoption of audited financial statements for the year ended March 31, 2025, re-appointment of Madhavan Menon as director, and fixation of joint statutory auditors' remuneration. The bank appointed BNP & Associates as secretarial auditors and Biswamohan Mahapatra as Non-Executive Part-time Chairman. Pralay Mondal was re-appointed as Managing Director & CEO for three years from September 15, 2025 to September 14, 2028. Shareholders also approved continuing material related party transactions with promoter FIH Mauritius Investments Ltd and its subsidiary FIH Private Investments Ltd. The meeting was conducted through video conferencing with 64 shareholders attending, including 1 from the promoter group and 63 public shareholders. FIH Mauritius Investments Ltd's voting rights remain capped at 26% despite holding 40% of paid-up capital due to banking regulations.",
            "Sentiment": "positive",
            "PublishDate": 1756223501600,
            "Source": "corporate_action"
        },
        {
            "Title": "CSB Bank Shares Plunge 18% Over Three Sessions After Quarterly Results",
            "Summary": "CSB Bank shares fell 8% on Thursday, extending losses for the third consecutive session to a total decline of 18%. The Kerala-based private lender reported quarterly results showing low single-digit growth in Net Interest Income and net profit, while asset quality deteriorated. The bank's margins dropped 82 basis points year-over-year, with MD & CEO Pralay Mondal expecting margins to remain between 3.5-4% and attributing the decline to higher-cost deposits. Trading volumes surged significantly, with Thursday seeing 9 lakh shares traded in the first hour compared to the usual 20-day average of 70,000 shares. Dolat Capital downgraded the stock from 'buy' to 'reduce' and cut its price target to ₹390 from ₹450. The stock is currently trading at ₹360, down from its 52-week high of ₹445.6 reached on August 5.",
            "Sentiment": "negative",
            "PublishDate": 1755147238956,
            "Source": "stock"
        },
        {
            "Title": "CSB Bank Reports Mixed Q1 Results with Higher Interest Income and Rising NPAs",
            "Summary": "CSB Bank reported quarterly interest income of 10.4 billion rupees, up from 8.3 billion rupees year-over-year. Net profit increased to 1.2 billion rupees from 1.13 billion rupees compared to the same period last year. However, asset quality showed deterioration with Gross Non-Performing Assets (GNPA) rising to 1.84% from 1.57% quarter-over-quarter, while Net Non-Performing Assets (NNPA) increased to 0.66% from 0.52% quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1755075338983,
            "Source": "earnings"
        },
        {
            "Title": "CSB Bank Reports Q1 Deposit and Advance Growth",
            "Summary": "CSB Bank reported a 20% increase in total deposits for Q1, reaching ₹35,990 crore. Term deposits rose by 22% to ₹27,525 crore. The bank also saw a 32% increase in gross advances to ₹33,142 crore, with gold loans growing by 36% to ₹14,928 crore.",
            "Sentiment": "positive",
            "PublishDate": 1751505779000,
            "Source": "default"
        },
        {
            "Title": "CSB Bank: CEO Pralay Mondal's Term Extended for Three Years",
            "Summary": "CSB Bank's board approved the reappointment of Pralay Mondal as Managing Director and CEO for an additional three years, from September 15, 2025 to September 14, 2028. The bank's shares rose following the announcement. In the recent quarter, CSB Bank reported a 25% year-on-year increase in net profit to ₹190 crore, with improved asset quality.",
            "Sentiment": "positive",
            "PublishDate": 1750755876000,
            "Source": "corporate_governance"
        },
        {
            "Title": "CSB Bank: RBI Approves Pralay Mondal's Reappointment as MD and CEO",
            "Summary": "RBI has approved Pralay Mondal's reappointment as MD and CEO of CSB Bank for three more years, effective September 15, 2025. The bank will seek shareholder approval for this reappointment. Mondal, who joined CSB Bank in 2020, has been working on enhancing the bank's retail franchise and building a future-ready technology platform.",
            "Sentiment": "positive",
            "PublishDate": 1749740199000,
            "Source": "corporate_governance"
        },
        {
            "Title": "CSB Bank: Q4 Profit Rises Despite NII Decline",
            "Summary": "CSB Bank reported Q4 net profit of ₹190 crore, up from ₹151.5 crore last year, despite a 3.9% YoY decline in NII to ₹371 crore. Other income surged to ₹381.5 crore. Gross NPA stood at 1.57%, while deposits grew 24% YoY to ₹36,861 crore. Gold loans comprise 44.3% of the loan book.",
            "Sentiment": "positive",
            "PublishDate": 1745835713000,
            "Source": "earnings"
        },
        {
            "Title": "CSB Bank Reports Q4 Financial Results",
            "Summary": "CSB Bank has released its Q4 financial results, showing improvements in key metrics. Interest earned increased to 9.8 billion rupees from 7.94 billion year-over-year. The bank's Gross Non-Performing Assets (GNPA) slightly decreased to 1.57% from 1.58% quarter-over-quarter, while Net Non-Performing Assets (NNPA) improved to 0.52% from 0.64%. The bank's net profit for Q4 rose to 1.9 billion rupees from 1.5 billion year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1745833013000,
            "Source": "result"
        },
        {
            "Title": "CSB Bank: Shares Surge on Strong Deposit and Advance Growth",
            "Summary": "CSB Bank's share price increased 5.46% following a business update showing 24% year-on-year growth in total deposits to Rs 36,861 crore and 29.6% growth in gross advances to Rs 31,843 crore for March.",
            "Sentiment": "positive",
            "PublishDate": 1743568905000,
            "Source": "normal_news"
        },
        {
            "Title": "CSB Bank Reports Strong Growth in Advances and Deposits for FY 2023",
            "Summary": "CSB Bank has announced significant year-over-year growth in both gross advances and total deposits as of March 31, 2023. The bank's gross advances increased by 29.6% compared to the previous year, while total deposits grew by 24.03% over the same period.",
            "Sentiment": "positive",
            "PublishDate": 1743552595000,
            "Source": "result"
        },
        {
            "Title": "CSB Bank Reports Strong Growth in Advances and Deposits",
            "Summary": "CSB Bank has announced significant year-over-year growth in both gross advances and total deposits as of March 31. The bank's gross advances increased by 29.6% compared to the previous year, while total deposits grew by 24.03% over the same period.",
            "Sentiment": "positive",
            "PublishDate": 1743519462000,
            "Source": "result"
        },
        {
            "Title": "CSB Bank to Consider Q4 Results on April 28",
            "Summary": "CSB Bank has announced that it will consider its fourth quarter (Q4) financial results on April 28. This is a routine corporate event where the bank's board will review and potentially approve the financial statements for the last quarter of their fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1743169293000,
            "Source": "corporate_action"
        },
        {
            "Title": "CSB Bank: No Near-Term Margin Pressure Expected",
            "Summary": "CSB Bank has indicated that it does not anticipate any immediate pressure on its margins.",
            "Sentiment": "neutral",
            "PublishDate": 1738129632000,
            "Source": "normal_news"
        },
        {
            "Title": "CSB Bank: Q3 Profit Flat, NII Dips, Asset Quality Improves",
            "Summary": "CSB Bank reported Q3 net profit of ₹152 crore, up 1.3% YoY. Net Interest Income fell 1.9% to ₹375.4 crore. Gross NPAs improved to 1.58% from 1.68% QoQ, while Net NPAs reduced to 0.64% from 0.69%.",
            "Sentiment": "neutral",
            "PublishDate": 1738057750000,
            "Source": "earnings"
        },
        {
            "Title": "CSB Bank Reports Increased Interest Earnings in Q3",
            "Summary": "CSB Bank has reported a significant increase in its interest earnings for the third quarter. The bank's interest earned rose to 9.2 billion rupees, up from 7.6 billion rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738054214000,
            "Source": "earnings"
        },
        {
            "Title": "CSB Bank Reports Improved Asset Quality in Q3",
            "Summary": "CSB Bank has reported an improvement in its asset quality for the third quarter. The Gross Non-Performing Assets (GNPA) ratio decreased to 1.58% from 1.68% in the previous quarter. Similarly, the Net Non-Performing Assets (NNPA) ratio improved to 0.64% from 0.69% quarter-on-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738053895000,
            "Source": "result"
        },
        {
            "Title": "CSB Bank Reports Q3 Net Profit of 1.51 Billion Rupees",
            "Summary": "CSB Bank has announced its financial results for the third quarter, reporting a net profit of 1.51 billion rupees. This represents a slight increase from the 1.5 billion rupees reported in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1738053888000,
            "Source": "earnings"
        },
        {
            "Title": "CSB Bank: CEO Expects Margin Pressure to Ease by FY26 End",
            "Summary": "CSB Bank's CEO Pralay Mondal anticipates margin pressures to alleviate by the end of FY26. The bank aims to grow loans 30-50% faster than the industry rate. Gold loans, currently 45% of the portfolio, will remain significant for the next two years. Q3 update shows 22% deposit growth and 26% advance growth year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1735890500000,
            "Source": "normal_news"
        },
        {
            "Title": "CSB Bank: Shares Surge on Strong Q3 Deposit and Advance Growth",
            "Summary": "CSB Bank's shares rose 6.65% to ₹334.90 after reporting 26.45% YoY growth in gross advances to ₹28,914 crore and 22.17% YoY increase in total deposits to ₹33,406 crore for Q3FY25. CASA deposits grew 5.69% YoY, while term deposits increased by 28.10%. The bank's gold loan business expanded by 36.28% YoY to ₹13,018 crore.",
            "Sentiment": "positive",
            "PublishDate": 1735793748000,
            "Source": "result"
        },
        {
            "Title": "CSB Bank: Q3 Update Shows Strong Deposit and Advance Growth",
            "Summary": "CSB Bank reported Q3 FY25 results with total deposits up 22.17% YoY to Rs 33,406 crore and gross advances increasing 26.45% YoY to Rs 28,914 crore. Term deposits rose 28.10% while advances against gold jumped 36.28%. CASA deposits grew 6.60% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1735789331000,
            "Source": "earnings"
        },
        {
            "Title": "CSB Bank Reports Growth in Deposits and Advances for December",
            "Summary": "CSB Bank has announced its financial figures for December. The bank's total deposits have increased to 334.1 billion rupees, up from 273.45 billion rupees in the previous year. Additionally, the bank's gross advances have grown to 289 billion rupees, compared to 228.7 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1735776472000,
            "Source": "result"
        },
        {
            "Title": "CSB Bank Reports Significant Growth in Gross Advances",
            "Summary": "CSB Bank has announced that its gross advances for December have reached 289 billion rupees, compared to 228.7 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1735744419000,
            "Source": "result"
        },
        {
            "Title": "CSB Bank Reports Significant Increase in Total Deposits",
            "Summary": "CSB Bank has announced that its total deposits for December have reached 334.1 billion, compared to 273.45 billion in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1735744198000,
            "Source": "result"
        },
        {
            "Title": "CSB Bank: Shares Rally After Meeting with WhiteOak Capital",
            "Summary": "CSB Bank shares rose 7.7% to Rs 331 on BSE following a one-on-one meeting with asset management firm WhiteOak Capital on December 16. The bank's shares have grown 9.91% over the past month, outperforming the Sensex.",
            "Sentiment": "positive",
            "PublishDate": 1734416143000,
            "Source": "normal_news"
        },
        {
            "Title": "CSB Bank: Q2 Margins Settle Lower",
            "Summary": "CSB Bank's Q2 results show margins settling at lower levels according to Dolat Capital's analysis.",
            "Sentiment": "neutral",
            "PublishDate": 1729832607000,
            "Source": "result"
        },
        {
            "Title": "CSB Bank Reports Increase in Q2 Interest Earned",
            "Summary": "CSB Bank has reported its second quarter (Q2) interest earned at 8.6 billion rupees, compared to 6.9 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729761180000,
            "Source": "result"
        },
        {
            "Title": "CSB Bank Q2 Asset Quality Update",
            "Summary": "CSB Bank reported its Q2 asset quality metrics. The Gross Non-Performing Assets (GNPA) ratio slightly improved to 1.68% from 1.69% in the previous quarter. The Net Non-Performing Assets (NNPA) ratio marginally increased to 0.69% from 0.68% quarter-on-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1729761145000,
            "Source": "result"
        },
        {
            "Title": "CSB Bank Reports Increase in Q2 Net Profit",
            "Summary": "CSB Bank has announced its second quarter financial results, reporting a net profit of 1.38 billion rupees, up from 1.3 billion rupees in the same quarter last year. This represents a year-over-year increase in profitability for the bank.",
            "Sentiment": "positive",
            "PublishDate": 1729761123000,
            "Source": "result"
        }
    ]
}