{
    "Symbol": "CSLFINANCE",
    "ISIN": "INE718F01018",
    "News": [
        {
            "Title": "CSL Finance AUM Grows 27.56% YoY to ₹1467 Crore in Q3",
            "Summary": "CSL Finance reports strong Q3 FY26 performance with AUM reaching ₹1467 crore, up 27.56% YoY. Company secured fresh sanctions of ₹198 crore from 9 lenders and disbursed ₹356 crore in new loans.",
            "Sentiment": "positive",
            "PublishDate": 1767259694674,
            "Source": "co_actions_results"
        },
        {
            "Title": "CSL Finance Appoints Prince Bhardwaj as Chief Business Officer",
            "Summary": "CSL Finance Limited has appointed Prince Bhardwaj as Chief Business Officer, designated as Senior Management Personnel, effective December 9, 2025. Bhardwaj brings over 20 years of experience in housing finance and financial services, having previously held leadership roles at companies including Sitara HFC, Aavas Financiers, and Indiabulls Housing Finance.",
            "Sentiment": "positive",
            "PublishDate": 1765265296149,
            "Source": "corporate_governance"
        },
        {
            "Title": "CSL Finance Reports 29% AUM Growth, Targets Rs 1,500-1,600 Crore by Year-End",
            "Summary": "CSL Finance Limited reported AUM of Rs 1,397 crores in Q2 FY26, marking 29% year-on-year growth and 8% sequential increase, with PAT rising 37% to Rs 24.5 crores driven by improved SME retail disbursements. The company targets AUM of Rs 1,500-1,600 crores by year-end while expanding branch network from current 45 to 60 branches, focusing on disciplined growth in secured lending segment.",
            "Sentiment": "positive",
            "PublishDate": 1763366980567,
            "Source": "earnings"
        },
        {
            "Title": "CSL Finance Reports 29% YoY AUM Growth to ₹1,397 Crore in Q2FY26",
            "Summary": "CSL Finance Limited achieved Assets Under Management of ₹1,397 crore with 29% year-on-year growth and 8% sequential growth, while Profit After Tax increased 37% YoY to ₹24.5 crore. The NBFC maintained strong asset quality with Gross NPA at 0.51% and collection efficiency at 98%, focusing on SME retail and wholesale lending segments.",
            "Sentiment": "positive",
            "PublishDate": 1763053949504,
            "Source": "earnings"
        },
        {
            "Title": "CSL Finance Targets 20%+ CAGR Through Multi-Year Expansion Strategy",
            "Summary": "CSL Finance outlined a multi-year expansion plan targeting 20%+ CAGR growth through AUM expansion in affordable housing and MSME segments, with enhanced focus on secured lending and Tier-II market penetration. The company is strengthening its digital credit platform for faster disbursals while implementing balanced risk management and cross-selling initiatives to drive growth.",
            "Sentiment": "positive",
            "PublishDate": 1763051743184,
            "Source": "stock"
        },
        {
            "Title": "CSL Finance Reports 27.40% AUM Growth to INR 1,380 Crore",
            "Summary": "CSL Finance Ltd reported Assets Under Management (AUM) growth of 27.40% year-over-year, reaching approximately INR 1,380 crore. The company raised fresh debt of INR 134.53 crore and maintains a liquidity surplus of INR 140 crore. The company's Capital Adequacy Ratio stands at 43%.",
            "Sentiment": "positive",
            "PublishDate": 1759306175074,
            "Source": "stock"
        },
        {
            "Title": "CSL Finance Approves Capital Amendment and Multiple Leadership Changes at 33rd AGM",
            "Summary": "CSL Finance Limited shareholders approved an amendment to the capital clause of the company's Memorandum of Association at the 33rd Annual General Meeting held on September 20, 2025. The authorized share capital was revised to Rs. 27 crore, divided into 2.7 crore equity shares of Rs. 10 each. The company also announced multiple leadership changes including the appointment of S.R. Dinodia & Co. LLP as statutory auditors for three years and Jasvinder Kaur & Co. as secretarial auditors for five years. Ms. Rachita Gupta was re-appointed as Whole Time Director for five years from December 30, 2025 to December 29, 2030. Mr. Ashok Kumar Kathuria's designation was changed from non-executive director to executive director. Two independent directors, Mr. Parmod Bindal and Mr. Subhash Chand Kwatra, were re-appointed for second terms of three years each.",
            "Sentiment": "neutral",
            "PublishDate": 1758626737484,
            "Source": "corporate_action"
        },
        {
            "Title": "CSL Finance Reports 15% Growth in Net Profit and Revenue",
            "Summary": "CSL Finance reported net profit of 213 million rupees compared to 185 million rupees in the same quarter last year, representing year-over-year growth. The company's revenue increased to 594 million rupees from 510 million rupees in the corresponding period of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755000706460,
            "Source": "earnings"
        },
        {
            "Title": "CSL Finance Approves Quarterly Results, Leadership Changes, and Employee Stock Option Plan",
            "Summary": "CSL Finance Limited's board approved un-audited financial results for the quarter ended June 30, 2025. The company made several key appointments subject to shareholder approval: Ms. Rachita Gupta was re-appointed as Whole Time Director for five years from December 30, 2025 to December 29, 2030, and Mr. Ashok Kumar Kathuria was appointed as executive director from non-executive director role. The board also approved new auditor appointments - M/s. Jasvinder Kaur & Co. as Secretarial Auditor for five years and S.R. Dinodia & Co. LLP as Statutory Auditors for three years, replacing M/s. S.P. Chopra & Co. whose term concluded. Additionally, the company approved the CSL Employee Stock Option Plan 2025 with an option pool of 22,78,262 stock options convertible into equity shares of Rs. 10 face value each. The ESOP aims to drive company growth, retain key management, and foster performance-driven culture with vesting contingent on achieving specific 5-year goals. The board also approved increasing authorized share capital and altering the Memorandum of Association.",
            "Sentiment": "positive",
            "PublishDate": 1755000079055,
            "Source": "corporate_action"
        },
        {
            "Title": "CSL Finance Reports Q1 FY25 Loan Disbursements and Asset Growth",
            "Summary": "CSL Finance has reported its Q1 FY25 performance. The company disbursed loans worth ₹356 crore and collected ₹245 crore. Additionally, CSL Finance's Assets Under Management (AUM) increased by 23% year-over-year, reaching ₹1,305 crore in Q1 FY26 compared to ₹1,065 crore in Q1 FY25.",
            "Sentiment": "positive",
            "PublishDate": 1751358308000,
            "Source": "default"
        },
        {
            "Title": "CSL Finance Reports Q4 Results",
            "Summary": "CSL Finance has reported its quarterly results. The company's net profit for Q4 was 190 million rupees, compared to 186 million rupees in the same period last year. Revenue for Q4 increased to 565 million rupees from 466 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747991956000,
            "Source": "result"
        },
        {
            "Title": "CSL Finance Reports Loan Disbursements and Collections",
            "Summary": "CSL Finance has disclosed its loan disbursement and collection figures. The company disbursed Rs 145 crore in the SME segment and Rs 955 crore in WSL. Collections amounted to Rs 169 crore from SME loans and Rs 708 crore from WSL.",
            "Sentiment": "neutral",
            "PublishDate": 1743578027000,
            "Source": "result"
        },
        {
            "Title": "CSL Finance Reports 16% Growth in Assets Under Management",
            "Summary": "CSL Finance has announced a year-over-year growth of 16% in its Assets Under Management (AUM). This increase indicates positive performance and expansion in the company's financial operations.",
            "Sentiment": "positive",
            "PublishDate": 1743577925000,
            "Source": "result"
        },
        {
            "Title": "CSL Finance Reports Marginal Increase in Q3 Net Profit, Revenue Growth",
            "Summary": "CSL Finance has reported its financial results for the third quarter. The company's net profit slightly increased to 168 million rupees from 167 million rupees in the same period last year. Revenue showed more significant growth, rising to 534 million rupees from 454 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739263261000,
            "Source": "earnings"
        },
        {
            "Title": "CSL Finance Reports Q3 FY24 Performance Metrics",
            "Summary": "CSL Finance has announced key financial metrics for the quarter ending December 24, 2023. The company's Assets Under Management (AUM) reached approximately 11.50 billion rupees. During the quarter, CSL Finance disbursed new loans totaling 3.36 billion rupees and collected 2.52 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1735721894000,
            "Source": "result"
        },
        {
            "Title": "CSL Finance Reports Q2 Profit and Revenue Growth",
            "Summary": "CSL Finance Ltd. has reported a net profit of 178 million rupees for Q2, showing an increase from 148 million rupees year-over-year and 184 million rupees quarter-over-quarter. The company's revenue for Q2 reached 495 million rupees, up from 354 million rupees year-over-year and 467 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731284294000,
            "Source": "result"
        },
        {
            "Title": "CSL Finance Reports Q2 AUM Growth and Debt Raising",
            "Summary": "<p>CSL Finance announced its Q2 <span class='neutral'>Assets Under Management (AUM)</span> reached approximately <span class='positive'>10.83 billion rupees</span>, a slight increase from 10.65 billion rupees in the previous quarter. The company also <span class='positive'>raised fresh debt</span> of <span class='positive'>1.85 billion rupees</span> during the quarter from existing and new banks and financial institutions. Of this newly raised debt, <span class='neutral'>1 billion rupees</span> is earmarked for <span class='positive'>utilization in the upcoming quarter</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728021685000,
            "Source": "result"
        },
        {
            "Title": "CSL Finance Reports Q2 AUM and Debt Raising",
            "Summary": "<p>CSL Finance announced its Q2 <span class='neutral'>Assets Under Management (AUM)</span> at approximately <span class='positive'>10.83 billion rupees</span>, a slight increase from 10.65 billion rupees in the previous quarter. The company also <span class='positive'>raised fresh debt</span> of <span class='positive'>1.85 billion rupees</span> during the quarter from existing and new banks and financial institutions. Of this new debt, <b>1 billion rupees</b> is earmarked for utilization in the upcoming quarter.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727973050000,
            "Source": "corporate_action"
        }
    ]
}