{
    "Symbol": "CTE",
    "ISIN": "INE627H01017",
    "News": [
        {
            "Title": "Cambridge Technology Board Meet Set for Feb 5, 2026",
            "Summary": "Cambridge Technology Enterprises Limited has scheduled a board meeting on February 05, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769791445900,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cambridge Technology Enterprises Seeks Strike-off of Wholly-owned Subsidiary N2T1 AI Solutions",
            "Summary": "Cambridge Technology Enterprises Limited's Board approved the proposal to apply for strike-off of its wholly-owned subsidiary N2T1 AI Solutions Private Limited, which has not commenced any business since incorporation. The strike-off process is expected to complete within 3-6 months from November 14, 2025, with no impact on the company's revenue, operations, or financial position as the subsidiary had nil turnover, income, and net worth.",
            "Sentiment": "neutral",
            "PublishDate": 1763748507440,
            "Source": "corporate_action"
        },
        {
            "Title": "Cambridge Technology Enterprises Approves Q2 Results and Key Leadership Appointments",
            "Summary": "Cambridge Technology Enterprises' board approved unaudited financial results for the quarter and half-year ended September 30, 2025, and appointed Dharani Swaroop Raghurama as CFO and Sreenivasa Sastry Tumuluru as Manager for 5 years, both effective November 14, 2025. The company also approved re-grant of 3,00,000 stock options under existing ESOP schemes at Rs. 40.50 per share and ratified borrowings totaling Rs. 194 million from Karur Vysya Bank and ConnectOne Finserve India.",
            "Sentiment": "neutral",
            "PublishDate": 1763174657433,
            "Source": "stock"
        },
        {
            "Title": "Cambridge Technology Enterprises Appoints New Director and Secretarial Auditor",
            "Summary": "Cambridge Technology Enterprises Limited shareholders approved two key appointments at their 26th Annual General Meeting held on September 15, 2025. Mr. Raj Kumar Sehgal was appointed as Non-Executive, Non-Independent Director effective June 15, 2025, liable to retire by rotation. Sehgal brings over 25 years of experience in corporate law, finance, taxation, mergers and acquisitions, and capital markets. He holds degrees in Industrial Chemistry and Law, and is a Fellow Member of the Institute of Company Secretaries of India. Additionally, M/s. Kashinath Sahu & Co. was appointed as Secretarial Auditor for five consecutive financial years from 2025-26 through 2029-30. Kashinath Sahu has 29 years of post-qualification experience and specializes in corporate legal matters, SEBI compliance, and corporate restructuring. Both appointments were approved through ordinary resolutions with requisite majority.",
            "Sentiment": "positive",
            "PublishDate": 1758101147697,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cambridge Technology Enterprises Reports Q1 Results and Appoints New Company Secretary",
            "Summary": "Cambridge Technology Enterprises Limited announced its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 1,542.77 lakhs and profit after tax of Rs 179.44 lakhs, with basic earnings per share of Rs 0.91. On a consolidated basis, revenue from operations was Rs 5,026.16 lakhs with profit after tax of Rs 59.47 lakhs and basic earnings per share of Rs 0.30. The company appointed Ms. Priyanka Chugh as Company Secretary and Compliance Officer effective August 12, 2025. Ms. Chugh brings over two decades of experience in corporate governance and regulatory compliance. The company also noted the resignation of Mr. Ashish Bhattad from the same position effective July 28, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755013592146,
            "Source": "earnings"
        }
    ]
}