{
    "Symbol": "CUB",
    "ISIN": "INE491A01021",
    "News": [
        {
            "Title": "City Union Bank Independent Directors Retire",
            "Summary": "City Union Bank announces retirement of two Independent Directors Shri V.N. Shivashankar and Dr. T.S. Sridhar effective February 06, 2026, following completion of 8-year tenure under Banking Regulation Act.",
            "Sentiment": "neutral",
            "PublishDate": 1770458778281,
            "Source": "stocks"
        },
        {
            "Title": "City Union Bank Q3 FY2026 Earnings Call on Feb 2",
            "Summary": "City Union Bank Limited has scheduled an earnings conference call for February 2, 2026, to discuss Q3 and 9M FY2026 financial results, organized by Ambit Capital.",
            "Sentiment": "neutral",
            "PublishDate": 1769613458976,
            "Source": "co_actions_results"
        },
        {
            "Title": "City Union Bank Opens New Branch in Jhansi",
            "Summary": "City Union Bank Limited has opened its 902nd branch in Jhansi, Uttar Pradesh, located at PP Plaza in Jhokan Bagh area, expanding its network presence across India.",
            "Sentiment": "positive",
            "PublishDate": 1769167494126,
            "Source": "stocks"
        },
        {
            "Title": "SBI Mutual Fund Reduces Stake in City Union Bank to 5.76%",
            "Summary": "SBI Mutual Fund sold 52,81,184 shares of City Union Bank, reducing its shareholding from 8.18% to 5.76% of the paid-up share capital. The transaction represents a 2.42 percentage point decrease in the mutual fund's holding across its various schemes, triggering regulatory disclosure requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1764307644099,
            "Source": "corporate_action"
        },
        {
            "Title": "City Union Bank Expands Network to 900 Branches with New Openings",
            "Summary": "City Union Bank converted an existing extension counter in Lucknow into its 897th branch and opened three new branches in Traniyam (Tamil Nadu), Rewa (Madhya Pradesh), and Agra (Uttar Pradesh). The bank now operates a total of 900 branches following this expansion across multiple states.",
            "Sentiment": "positive",
            "PublishDate": 1763983450941,
            "Source": "stock"
        },
        {
            "Title": "City Union Bank Allots 10.5 Lakh Equity Shares Under Employee Stock Option Scheme",
            "Summary": "City Union Bank's Compensation and Remuneration Committee allotted 1,049,475 equity shares to eligible employees under various ESOS series at prices ranging from Rs. 132.95 to Rs. 179.00. The bank's paid-up capital increased from Rs. 74.10 crores to Rs. 74.21 crores following the share allotment approved on November 23, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763891265286,
            "Source": "corporate_action"
        },
        {
            "Title": "City Union Bank Opens Three New Branches, Expands Network to 896 Branches",
            "Summary": "City Union Bank opened three new branches on November 21, 2025, located in Kattathi, Alambadi, and Veerankuppam across Tamil Nadu districts. The expansion brings the bank's total branch network to 896 branches, strengthening its presence in rural and semi-urban markets.",
            "Sentiment": "positive",
            "PublishDate": 1763730429393,
            "Source": "stock"
        },
        {
            "Title": "City Union Bank Receives Credit Rating Upgrade from ICRA Limited",
            "Summary": "ICRA Limited's Rating Committee upgraded City Union Bank's issuer rating to [ICRA]AA (Stable) from [ICRA]AA- (Positive), with the outlook revised to Stable from Positive. The rating upgrade affects the bank's creditworthiness assessment and potentially its borrowing costs and market perception.",
            "Sentiment": "positive",
            "PublishDate": 1763548414931,
            "Source": "stock"
        },
        {
            "Title": "City Union Bank Reports Financial Results for Quarter Ended September 30, 2025",
            "Summary": "City Union Bank Limited announced its standalone unaudited financial results for the quarter and half year ended September 30, 2025. The bank's Board of Directors approved the results at a meeting held on November 3, 2025. The results have been subject to limited review by the bank's Joint Statutory Central Auditors, who issued an unmodified opinion. The bank allotted 40,760 equity shares during the quarter and 63,108 equity shares during the six months under the employee stock option scheme. The financial statements include detailed segment reporting showing treasury, corporate/wholesale banking, digital banking, and other retail banking operations. The results were prepared in accordance with accounting standards and regulatory requirements including SEBI Listing Regulations and RBI guidelines.",
            "Sentiment": "neutral",
            "PublishDate": 1762207278105,
            "Source": "earnings"
        },
        {
            "Title": "City Union Bank Targets Double-Digit Growth in Advances with SME Focus and Digital Lending Expansion",
            "Summary": "City Union Bank plans to achieve steady double-digit compound annual growth rate in advances by focusing on SME/MSME lending and implementing a strong digital lending rollout. The bank is emphasizing granular retail deposits as part of its growth strategy. The bank maintains asset quality with gross non-performing assets below 1% while sustaining margin stability.",
            "Sentiment": "positive",
            "PublishDate": 1762181812510,
            "Source": "stock"
        },
        {
            "Title": "City Union Bank Reports 15% Growth in Net Profit to 3.28 Billion Rupees",
            "Summary": "City Union Bank reported net profit of 3.28 billion rupees compared to 2.85 billion rupees in the same quarter last year. Revenue increased to 16.53 billion rupees from 14.3 billion rupees year-over-year. The bank's asset quality improved with gross non-performing assets declining to 2.42% from 2.99% in the previous quarter, while net non-performing assets decreased to 0.90% from 1.20%. Provisions reduced to 570 million rupees from 700 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762170459806,
            "Source": "earnings"
        },
        {
            "Title": "City Union Bank Secures $50 Million Commitment from IFC for MSME Green Financing",
            "Summary": "City Union Bank Limited has secured a $50 million commitment from the International Finance Corporation (IFC), a member of the World Bank Group. The agreement was executed on October 31, 2025, to support Micro, Small, and Medium Enterprises (MSMEs) in transitioning to energy-efficient and cost-effective solutions. The financing aims to help MSMEs adopt renewable and efficient energy solutions, reducing operational expenses and improving productivity. MSMEs contribute nearly 30% of India's GDP but face challenges due to high energy costs. The partnership is expected to help India move closer to its net-zero emissions goal by 2070 while enhancing economic resilience through green financing initiatives. The drawdown of the loan will take place at a later date, as only the commitment has been secured currently with no amount outstanding at present.",
            "Sentiment": "positive",
            "PublishDate": 1761919968016,
            "Source": "order&deals"
        },
        {
            "Title": "City Union Bank Expands Network with New Ambala Sadar Branch, Total Reaches 890",
            "Summary": "City Union Bank has opened a new branch in Ambala Sadar, bringing the bank's total branch count to 890. This expansion represents the bank's continued growth in its branch network across different locations.",
            "Sentiment": "positive",
            "PublishDate": 1760597796721,
            "Source": "stock"
        },
        {
            "Title": "City Union Bank Opens Two New Branches in Tamil Nadu, Total Reaches 889",
            "Summary": "City Union Bank opened two new branches on September 26, 2025, located in Pananvayal and Sethupattu in Tamil Nadu. The Pananvayal branch is situated in Sivagangai District, while the Sethupattu branch is in Kancheepuram District. With these additions, the bank's total branch count has reached 889. The bank informed stock exchanges NSE and BSE about this expansion as part of regulatory disclosure requirements.",
            "Sentiment": "positive",
            "PublishDate": 1758874950485,
            "Source": "stock"
        },
        {
            "Title": "City Union Bank Expects Credit Growth Boost as GST Rate Cuts Benefit Half of Loan Portfolio",
            "Summary": "City Union Bank anticipates improved credit growth in upcoming quarters, with approximately 50% of its loan book positioned in segments expected to benefit from GST rate cuts. Managing Director N Kamakodi stated the bank is assessing policy impact and will present revised growth strategy with quarterly results. The MSME, agriculture, and trading segments, which form a significant portion of the portfolio, are expected to see enhanced demand. The bank projects system-wide credit growth to improve from 10-12% to low teens in FY26. City Union Bank targets maintaining its strategy of achieving 2-3% growth above industry levels, building on decent growth momentum from the first quarter. The MSME segment continues showing steady traction, representing around 40% of the loan book. Management remains confident about sustaining margins despite short-term pressure. The bank's market capitalization stands at ₹14,475 crore, with shares trading at ₹195.58 and gaining 14% over the past year.",
            "Sentiment": "positive",
            "PublishDate": 1757051156915,
            "Source": "stock"
        },
        {
            "Title": "City Union Bank Expands Network with New Delhi Branch Opening",
            "Summary": "City Union Bank opened a new branch at Rajouri Garden in New Delhi on August 21, 2025. With this expansion, the bank's total branch count has reached 887 branches.",
            "Sentiment": "positive",
            "PublishDate": 1755775414686,
            "Source": "stock"
        },
        {
            "Title": "City Union Bank Opens Three New Branches, Total Count Reaches 886",
            "Summary": "City Union Bank opened three new branches on August 11, 2025, expanding its network to 886 branches total. The new branches are located in Kanarpatti (Tirunelveli District, Tamil Nadu), Vengandur (Villupuram District, Tamil Nadu), and Panaji (North Goa District, Goa). The bank informed stock exchanges NSE and BSE about this expansion through a regulatory filing.",
            "Sentiment": "positive",
            "PublishDate": 1754920551301,
            "Source": "stock"
        },
        {
            "Title": "City Union Bank Reports Record PAT of ₹306 Crores in Q1 FY2026, Crosses ₹300 Crore Mark for First Time",
            "Summary": "City Union Bank achieved its highest quarterly profit after tax of ₹306 crores in Q1 FY2026, marking the first time in the bank's history to cross the ₹300 crore milestone. The bank reported strong operational performance with 16% credit growth (highest June-to-June growth), with advances increasing from ₹46,548 crores to ₹54,020 crores. Deposits grew 20% to ₹65,734 crores compared to ₹54,857 crores in the previous year. Asset quality improved significantly with gross NPA reducing to 2.99% from 3.88% year-on-year, while net NPA decreased to 1.2% from 1.87%. The bank maintained its net interest margin at 3.54% and expects to sustain around 3.5% for the full year despite repo rate cuts. Operating profit increased 21% to ₹451 crores, while ROA stood at 1.55%. Management expressed confidence in maintaining mid-teen growth rates and indicated that asset quality metrics remain stable with no unusual stress patterns observed.",
            "Sentiment": "positive",
            "PublishDate": 1754403949178,
            "Source": "earnings"
        },
        {
            "Title": "City Union Bank Participates in Q1 FY 2026 Earnings Call with Ambit Capital",
            "Summary": "City Union Bank participated in a Q1 FY 2026 earnings call organized by Ambit Capital on July 31, 2025. The call was attended by the bank's MD & CEO Dr. N. Kamakodi, Executive Directors Shri R. Vijay Anandh and Shri V. Ramesh, and Chief Financial Officer Shri J. Sadagopan. The bank notified stock exchanges NSE and BSE about this analyst conference call participation.",
            "Sentiment": "neutral",
            "PublishDate": 1754058166671,
            "Source": "earnings"
        },
        {
            "Title": "CUB Targets 12-14% Credit Growth in FY26 with Focus on MSME and Retail Segments",
            "Summary": "CUB has set a credit growth target of 12-14% for FY26, with emphasis on MSME and retail segments. The bank plans to reduce non-performing assets (NPAs) through technology implementation for collections and enhanced credit monitoring systems.",
            "Sentiment": "positive",
            "PublishDate": 1753971723217,
            "Source": "stock"
        },
        {
            "Title": "City Union Bank Reports 16% Net Profit Growth in Q1 FY26 with Strong Balance Sheet Expansion",
            "Summary": "City Union Bank announced its quarterly results with net profit rising 16% to Rs 306 crore compared to Rs 264 crore in the same quarter last year. The bank's deposits grew 20% year-on-year to Rs 65,734 crore, while advances increased 16% to Rs 54,020 crore, bringing total business to Rs 1,19,754 crore. Net interest income expanded 15% to Rs 625 crore. Asset quality improved with gross NPA declining to 2.99% from 3.88% and net NPA dropping to 1.20% from 1.87%. The bank maintained a strong capital adequacy ratio of 23.10% and return on assets of 1.55%. Net interest margin remained stable at 3.54%. Non-interest income surged 27% to Rs 244 crore, driven primarily by treasury profits of Rs 64 crore. Operating expenses increased 15% to Rs 418 crore. The bank's CASA deposits grew 11% to Rs 17,951 crore.",
            "Sentiment": "positive",
            "PublishDate": 1753965574394,
            "Source": "earnings"
        },
        {
            "Title": "City Union Bank Reports 16% Jump in Q1 Net Profit to 3.06 Billion Rupees",
            "Summary": "City Union Bank reported a net profit of 3.06 billion rupees in Q1, representing a 16% increase from 2.64 billion rupees in the same period last year. The bank's interest income grew to 16.05 billion rupees from 13.89 billion rupees year-over-year. Asset quality showed improvement with gross non-performing assets (GNPA) declining to 2.99% from 3.09% in the previous quarter, while net non-performing assets (NNPA) decreased to 1.20% from 1.25%. Provisions for bad loans reduced to 700 million rupees from 780 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753959810320,
            "Source": "earnings"
        },
        {
            "Title": "City Union Bank Opens New Branch in Latur, Maharashtra, Reaches 883 Total Branches",
            "Summary": "City Union Bank Limited opened a new branch in Latur, Maharashtra on July 31, 2025. The branch is located at Plot No. 10, Northline Complex, Barshi Road, opposite Hanuman Mandir, Latur - 413 531. With this addition, the bank now operates 883 branches in total. The bank informed stock exchanges NSE and BSE about the branch opening as part of regulatory disclosure requirements.",
            "Sentiment": "positive",
            "PublishDate": 1753954753906,
            "Source": "stock"
        },
        {
            "Title": "City Union Bank Opens Three New Branches, Total Reaches 882",
            "Summary": "City Union Bank opened three new branches on July 30, 2025, located in Patna (Bihar), Rewari (Haryana), and Malegaon (Maharashtra). With these additions, the bank's total branch network has reached 882 branches. The Patna branch is situated on Boring Road, the Rewari branch on Delhi Road, and the Malegaon branch in Mahesh Nagar area.",
            "Sentiment": "positive",
            "PublishDate": 1753877506425,
            "Source": "stock"
        },
        {
            "Title": "City Union Bank Schedules Board Meeting for Quarterly Results and Opens New Chennai Branch",
            "Summary": "City Union Bank has scheduled a Board of Directors meeting on July 31, 2025 to consider and approve the un-audited standalone financial results for the quarter ended June 30, 2025. The results will be subject to limited review by the Joint Statutory Central Auditors. Additionally, the bank opened a new branch on July 21, 2025, at Chamiers Road in Chennai, bringing its total branch count to 879. The new branch is located at Door No.23, Chamiers Road, opposite to Royal Thai Embassy, Nandanam, Chennai.",
            "Sentiment": "positive",
            "PublishDate": 1753160790158,
            "Source": "earnings"
        },
        {
            "Title": "City Union Bank: Targets Industry-Beating Growth by FY26",
            "Summary": "City Union Bank aims to outpace industry growth by 200-300 basis points in FY26. CEO N Kamakodi projects 13-15% growth over the next five years. The bank is expanding geographically outside Tamil Nadu and expects investments in retail banking to contribute to profitability from 2026-27. It aims to reduce its cost-to-income ratio to around 45% within five years.",
            "Sentiment": "positive",
            "PublishDate": 1749873082000,
            "Source": "normal_news"
        },
        {
            "Title": "City Union Bank: Board Approves ₹500 Crore QIP Fundraising and Dividend",
            "Summary": "City Union Bank's board approved raising ₹500 crore through QIP, subject to AGM approval on August 13. A dividend of ₹2 per share for FY 2024-25 was confirmed. Q4 results show NII up 9.8% YoY, GNPA at 3.09%, and NNPA at 1.25%.",
            "Sentiment": "positive",
            "PublishDate": 1749666933000,
            "Source": "corporate_action"
        },
        {
            "Title": "City Union Bank Board to Discuss Capital Increase",
            "Summary": "City Union Bank's board of directors is scheduled to meet on June 11 to discuss increasing the bank's capital.",
            "Sentiment": "neutral",
            "PublishDate": 1749128939000,
            "Source": "default"
        },
        {
            "Title": "City Union Bank: Share Price Hits 28-Month High, Up 10% in May",
            "Summary": "City Union Bank's share price reached ₹195, its highest level since December 2022, gaining 2% on May 14 and 10% since the start of May. The rally is attributed to improved investor sentiment following the bank's Q4 results showing a return to growth trajectory and ongoing digital transformation efforts.",
            "Sentiment": "positive",
            "PublishDate": 1747201435000,
            "Source": "normal_news"
        },
        {
            "Title": "City Union Bank: Strong Credit Growth Leads to 'Buy' Rating",
            "Summary": "City Union Bank reported 14% YoY credit growth in Q4, driven by traditional loan segments. MSME book grew 23% YoY. Management expects double-digit growth for FY26. IDBI Capital maintains 'Buy' rating with 24% upside potential.",
            "Sentiment": "positive",
            "PublishDate": 1746420206000,
            "Source": "result"
        },
        {
            "Title": "City Union Bank Reports Q4 FY23 Results with Improved Profitability and Asset Quality",
            "Summary": "City Union Bank announced its Q4 FY23 results, reporting a net profit of 2.88 billion rupees, up from 2.55 billion rupees year-over-year. Interest earned increased to 15.33 billion rupees from 13.74 billion rupees in the same period last year. The bank's asset quality improved with GNPA at 3.09% and NNPA at 1.25%, both down from the previous quarter. Provisions stood at 780 million rupees. The bank's Net Interest Margin was 3.60% for Q4. Additionally, the bank recommended a dividend of 2 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746403612000,
            "Source": "default"
        },
        {
            "Title": "City Union Bank Reports Q4 FY23 Results",
            "Summary": "City Union Bank announced its Q4 FY23 financial results. Net profit increased to 2.88 billion rupees, up from 2.55 billion rupees year-over-year. The bank's Net Interest Margin stood at 3.60%. Gross Non-Performing Assets (GNPA) improved to 3.09% from 3.36% quarter-on-quarter, while Net Non-Performing Assets (NNPA) decreased to 1.25% from 1.42%. The bank recommended a dividend of 2 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746187379000,
            "Source": "default"
        },
        {
            "Title": "City Union Bank: Q4 Profit Up 13%, Declares Dividend",
            "Summary": "City Union Bank reported a 13% YoY increase in Q4 net profit to ₹288 crore. NII rose 9.8% to ₹600.3 crore. GNPA improved to 3.09% from 3.36% QoQ. The bank declared a dividend of ₹2 per share for FY2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1746186035000,
            "Source": "earnings"
        },
        {
            "Title": "City Union Bank to Consider Q4 Results on May 2",
            "Summary": "City Union Bank has announced that it will consider and approve its financial results for the fourth quarter on May 2. This announcement indicates the bank is preparing to disclose its performance for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1745418349000,
            "Source": "default"
        },
        {
            "Title": "City Union Bank Reports Block Trade of 1,012,265 Shares",
            "Summary": "A block trade of approximately 1,012,265 shares of City Union Bank Ltd. was executed on the National Stock Exchange (NSE) for Rs. 16.70 Crores. The trade was conducted at a price of Rs. 164.98 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1744701856000,
            "Source": "block_deals"
        },
        {
            "Title": "City Union Bank: Asset Quality Improves Amid Expansion and Challenges",
            "Summary": "City Union Bank's shares fell 11% in the past month due to higher provisioning and margin pressure. However, the bank shows improvement in loan book growth and asset quality. GNPA ratio decreased to 3.4% in Q3 FY2025 from 4.5% a year ago. The bank is expanding beyond Tamil Nadu and focusing on MSME and agriculture loans. Icra revised the bank's outlook to 'positive' in November 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1741566969000,
            "Source": "earnings"
        },
        {
            "Title": "City Union Bank Reports Q3 Provisions of 750 Million Rupees",
            "Summary": "City Union Bank has reported provisions of 750 million rupees for the third quarter, representing an increase from 700 million rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738326378000,
            "Source": "earnings"
        },
        {
            "Title": "City Union Bank Reports Improved Asset Quality in Q3",
            "Summary": "City Union Bank has announced its Q3 financial results, showing improvements in asset quality. The Gross Non-Performing Assets (GNPA) ratio decreased to 3.36% from 3.54% in the previous quarter. Similarly, the Net Non-Performing Assets (NNPA) ratio improved to 1.42% from 1.62% quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738326349000,
            "Source": "result"
        },
        {
            "Title": "City Union Bank: Q3 Profit Rises 13%, Asset Quality Improves",
            "Summary": "City Union Bank reported a 13% YoY increase in Q3 FY25 net profit to ₹286 crore. Net interest income grew 14% to ₹587.7 crore. Gross NPA decreased to 3.36% from 3.54% QoQ, while Net NPA fell to 1.42% from 1.62% QoQ.",
            "Sentiment": "positive",
            "PublishDate": 1738326064000,
            "Source": "earnings"
        },
        {
            "Title": "City Union Bank to Consider Q3 Results",
            "Summary": "City Union Bank has announced that it will consider its third quarter (Q3) financial results on January 31. This indicates the bank is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737385443000,
            "Source": "earnings"
        },
        {
            "Title": "City Union Bank: Q2 Review Shows Positive Outcomes",
            "Summary": "City Union Bank's Q2 review, as analyzed by Yes Securities, indicates positive results following an upgrade in February.",
            "Sentiment": "positive",
            "PublishDate": 1729574084000,
            "Source": "result"
        },
        {
            "Title": "City Union Bank: Q2 Performance Boosts Stock 13%",
            "Summary": "City Union Bank shares rose 13.21% to ₹170.50 after strong Q2 FY25 results. GNPA reduced to 3.54%, NIM increased to 3.67%, and PAT grew to ₹285 crore. Brokerages Macquarie and Investec maintain bullish stance with target prices of ₹185 and ₹200 respectively.",
            "Sentiment": "positive",
            "PublishDate": 1729571940000,
            "Source": "result"
        },
        {
            "Title": "City Union Bank: Shares Surge 12% on Analyst Optimism",
            "Summary": "City Union Bank shares jumped 12% after Macquarie and Investec issued positive ratings. Macquarie set a price target of ₹185, while Investec targets ₹200. The bank's Q2 profit met expectations, with improving growth, profitability, and asset quality. Net profit grew 1.6% to ₹285 crore, and NII rose 8.2% to ₹582.5 crore.",
            "Sentiment": "positive",
            "PublishDate": 1729570652000,
            "Source": "normal_news"
        },
        {
            "Title": "City Union Bank: Q2 Results Show Strong Performance and Improved Growth",
            "Summary": "City Union Bank reported strong Q2 results with improved growth trends, according to a review by Dolat Capital.",
            "Sentiment": "positive",
            "PublishDate": 1729562082000,
            "Source": "result"
        },
        {
            "Title": "City Union Bank Reports Increased Provisions in Q2",
            "Summary": "City Union Bank has reported provisions of 700 million rupees in the second quarter, up from 390 million rupees in the previous quarter. This represents a significant increase in the bank's provisioning.",
            "Sentiment": "negative",
            "PublishDate": 1729508286000,
            "Source": "result"
        },
        {
            "Title": "City Union Bank Reports Improved Asset Quality in Q2",
            "Summary": "City Union Bank has reported a decrease in its Gross Non-Performing Assets (GNPA) and Net Non-Performing Assets (NNPA) for the second quarter. The GNPA has reduced to 3.54% from 3.88% in the previous quarter, while the NNPA has decreased to 1.62% from 1.87% quarter-on-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1729508275000,
            "Source": "result"
        },
        {
            "Title": "City Union Bank Reports Q2 Interest Earnings",
            "Summary": "City Union Bank has announced its second quarter interest earnings, which amount to 14.34 billion rupees. This represents an increase from 13.04 billion rupees in the same quarter of the previous year, indicating year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1729508264000,
            "Source": "result"
        },
        {
            "Title": "City Union Bank Reports Q2 Net Profit of 2.85 Billion Rupees",
            "Summary": "City Union Bank has announced its Q2 financial results. The bank reported a net profit of 2.85 billion rupees, showing a slight increase from 2.8 billion rupees year-over-year (YoY) and a more significant rise from 2.6 billion rupees quarter-over-quarter (QoQ).",
            "Sentiment": "positive",
            "PublishDate": 1729508251000,
            "Source": "result"
        }
    ]
}