{
    "Symbol": "CUMMINSIND",
    "ISIN": "INE298A01020",
    "News": [
        {
            "Title": "Cummins India Sees Strong Data Center Growth Ahead",
            "Summary": "Cummins India reports robust data center pipeline in India and expects sustained growth in the sector over the next 3-4 years, highlighting strong market opportunities ahead.",
            "Sentiment": "positive",
            "PublishDate": 1770266958129,
            "Source": "stocks"
        },
        {
            "Title": "Cummins India Eyes Double-Digit Growth in FY26",
            "Summary": "Cummins India anticipates achieving double-digit growth in the domestic market during FY26, as revealed in recent conference call discussions with stakeholders.",
            "Sentiment": "positive",
            "PublishDate": 1770266709384,
            "Source": "stocks"
        },
        {
            "Title": "Cummins India Declares ₹20 Interim Dividend",
            "Summary": "Cummins India announces interim dividend of ₹20 per share for shareholders, marking a significant distribution to investors during the current financial period.",
            "Sentiment": "positive",
            "PublishDate": 1770217279353,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cummins India Q3 Net Profit Drops 12.5% YoY to ₹4.5B",
            "Summary": "Cummins India reported Q3 net profit of ₹4.5 billion, down from ₹5.14 billion year-on-year, while revenue remained flat at ₹30 billion compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1770217226681,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cummins India Completes Clean Max Investment Deal",
            "Summary": "Cummins India Limited has completed its second and final tranche investment of Rs. 2,69,58,260 in Clean Max Yellowstone Private Limited, acquiring 8.78% equity stake through allotment of 22,372 shares.",
            "Sentiment": "positive",
            "PublishDate": 1769695537816,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cummins India schedules Q3FY26 results call",
            "Summary": "Cummins India Limited announces conference call on February 5, 2026 at 10:00 AM IST to discuss Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769518658006,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cummins India Board Meet on Feb 4 for Q3 Results",
            "Summary": "Cummins India Limited has scheduled its Board of Directors meeting for February 4, 2026, to consider Q3FY26 unaudited financial results and interim dividend proposal. Trading window closed until February 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767794111206,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cummins India Invests ₹2.70 Cr in Clean Energy",
            "Summary": "Cummins India announces investment of up to ₹2.70 crores in Clean Max Yellowstone Private Limited and signs renewable energy supply agreements to strengthen its clean energy portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1767626701395,
            "Source": "stocks"
        },
        {
            "Title": "Cummins India Faces ₹1.19 Cr IT Penalty, Plans Appeal",
            "Summary": "Cummins India received a penalty order of ₹1.19 crores from the Income Tax Department under Section 27(1)(c) without being heard. The company plans to file an appeal with appellate authority.",
            "Sentiment": "negative",
            "PublishDate": 1766416656141,
            "Source": "stocks"
        },
        {
            "Title": "Cummins India Wins ₹210.29 Cr Tax Relief from ITAT",
            "Summary": "Income Tax Appellate Tribunal grants favorable order for FY2017-18, providing substantial tax relief to the capital goods manufacturer with additional amounts under review.",
            "Sentiment": "positive",
            "PublishDate": 1766154446540,
            "Source": "stocks"
        },
        {
            "Title": "Cummins India Signs Agreements for Clean Max Investment",
            "Summary": "Cummins India enters Shareholders' Agreement for ₹2.70 crore investment and Energy Supply Agreement with Clean Max Yellowstone for renewable power procurement on January 5, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1766064142466,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cummins India Seeks Shareholder Approval for Additional Related Party Transactions Worth ₹290 Crores",
            "Summary": "Cummins India has issued a postal ballot notice seeking member approval for additional material related party transactions with Cummins Inc., USA (₹40 crores) and Cummins Limited, UK (₹250 crores) for FY2025-26. The e-voting period runs from December 7, 2025, to January 5, 2026, with transactions involving purchase and sale of engines, gensets, and components at arm's length pricing.",
            "Sentiment": "neutral",
            "PublishDate": 1764926129603,
            "Source": "corporate_action"
        },
        {
            "Title": "Cummins India Reports 28% Revenue Growth in Q2 FY2025-26, Driven by Strong Power Generation Demand",
            "Summary": "Cummins India Limited reported quarterly revenue of INR 3,122 crores, marking a 28% increase compared to INR 2,448 crores in the same quarter last year. Domestic sales grew 28% to INR 2,577 crores while exports increased 24% to INR 545 crores. Profit before tax before exceptional items rose 41% to INR 839 crores. The power generation segment led growth with 49% increase to INR 1,340 crores, with approximately 40% of power generation revenue coming from data center projects. Distribution business sales grew 21% to INR 796 crores, while industrial business declined 5% to INR 387 crores due to extended monsoons affecting construction and reduced mining tenders from Coal India. The company expects double-digit revenue growth for the full fiscal year 2025-26. Management noted increasing competitive intensity across all power generation segments and some softening in export order intake due to inventory corrections in channel markets.",
            "Sentiment": "positive",
            "PublishDate": 1762779831043,
            "Source": "earnings"
        },
        {
            "Title": "Cummins India Targets 21-22% EBITDA Margin for FY26-FY27",
            "Summary": "Cummins India reported an EBITDA margin of 21.9% in Q2FY26 and aims to maintain margins in the 21-22% range for FY26 and FY27. Managing Director Shveta Arya stated that sustaining these margins depends on volume levels, product mix, and cost reduction efforts. The company expects double-digit growth in its industrial business if government infrastructure spending continues. Exports increased 24% year-on-year in Q2FY26, though Arya warned that global headwinds including geopolitical conditions, credit issues, and inventory buildup in channels could affect future export performance. She noted that end-of-calendar-year corrections by global distributors and uncertainty around tariffs are creating challenges in international markets.",
            "Sentiment": "neutral",
            "PublishDate": 1762592635175,
            "Source": "stock"
        },
        {
            "Title": "Cummins Expects Double-Digit Revenue Growth in Q3",
            "Summary": "Cummins announced during an earnings call that the company anticipates double-digit revenue growth in the third quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762491348663,
            "Source": "earnings"
        },
        {
            "Title": "Cummins India Reports Strong Q2 Results with 42% Revenue Growth, Approves Postal Ballot for Related Party Transactions",
            "Summary": "Cummins India's Board approved unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported consolidated revenue of ₹3,832.22 crores for Q2 2025, up from ₹3,009.27 crores in Q2 2024. Consolidated profit after tax increased to ₹622.33 crores from ₹449.37 crores year-over-year. On a standalone basis, revenue grew to ₹3,121.58 crores from ₹2,448.40 crores, while profit after tax rose to ₹637.69 crores from ₹450.61 crores. The Board also approved a postal ballot notice to seek shareholder approval for additional material related party transactions and appointed M/s. Mehta Mehta, Company Secretaries, Pune, as scrutinizer for the postal ballot e-voting process. The company's earnings per share stood at ₹23.00 for the quarter compared to ₹16.26 in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1762438298061,
            "Source": "earnings"
        },
        {
            "Title": "Cummins India Seeks Shareholder Approval for Two Director Appointments via Postal Ballot",
            "Summary": "Cummins India Limited has issued a postal ballot notice seeking shareholder approval for the appointment of two directors through remote e-voting. The company is proposing the appointment of Mr. Thierry Bruno Pimi Nouyeuwe as a Non-Executive and Non-Independent Director through an ordinary resolution, and Ms. Vibha Paul Rishi as a Non-Executive Independent Director for a five-year term through a special resolution. Both directors were initially appointed as Additional Directors by the Board on August 9, 2025. The remote e-voting period runs from September 8, 2025 (9:00 AM IST) to October 7, 2025 (5:00 PM IST), with August 29, 2025 as the cut-off date for determining eligible shareholders. Mr. Pimi brings over 25 years of experience in power generation and manufacturing industries and currently leads Distribution Business Unit International Operations at Cummins Inc. Ms. Rishi is a marketing specialist with international experience and was previously associated with PepsiCo for 17 years. The voting process will be conducted electronically through the company's Registrar and Transfer Agent, MUFG Intime India Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1757071506773,
            "Source": "corporate_action"
        },
        {
            "Title": "Cummins India Pays Rs 43.36 Lakh Penalty for E-Invoice Supplier Details Issue",
            "Summary": "Cummins India Limited received a penalty order of Rs 43,36,081 from the Government of Karnataka Department of Commercial Taxes for alleged missing supplier details in an E-Invoice for a particular consignment. The penalty was imposed under Section 68(3) of Central Goods and Services Tax Act, 2017 and State Goods and Services Tax Act, 2017. The company has paid the penalty and plans to file an appeal for its withdrawal. Cummins India stated that the penalty will not have any material impact on the company's financials or operational activities.",
            "Sentiment": "negative",
            "PublishDate": 1756994672981,
            "Source": "stock"
        },
        {
            "Title": "Cummins India Reports Strong Q1 FY26 Results with 26% Sales Growth",
            "Summary": "Cummins India delivered robust quarterly results with sales reaching INR 2,859 crores, marking a 26% increase compared to INR 2,262 crores in the same quarter last year. Domestic sales grew 25% to INR 2,336 crores while exports surged 34% to INR 523 crores. Profit before tax increased 32% to INR 726 crores. The Powergen segment led growth with 31% increase to INR 1,056 crores, driven by demand from quick commerce, mission-critical segments including hospitals and airports, manufacturing, and pharma sectors. Distribution business sales rose 19% to INR 777 crores, while Industrial domestic business grew 12% to INR 418 crores. Managing Director Shveta Arya noted that market volumes have returned to pre-CPCB IV+ levels and the company anticipates double-digit growth for the full year. The company launched BESS (Battery Energy Storage System) solutions in India, targeting commercial and industrial customers. Export growth was broad-based across markets, with Latin America and Europe showing particular strength. Data centers continue contributing 15-20% of overall Powergen sales with steady demand. The company maintains cautious optimism on exports due to geopolitical uncertainties while expressing confidence in domestic market stability.",
            "Sentiment": "positive",
            "PublishDate": 1754922656074,
            "Source": "earnings"
        },
        {
            "Title": "Cummins India Reports Record Revenue of ₹10,166 Crores, Declares 2575% Dividend",
            "Summary": "Cummins India achieved its highest annual revenue of ₹10,166 crores in FY 2024-25, marking the fourth consecutive year of record sales driven by strong domestic demand across market segments. The company reported profit before interest and tax of ₹2,511 crores with a margin of 24.7%, and generated ₹1,689 crores in cash from operations. The company declared a dividend of 2575%. Revenue showed a compound annual growth rate of 19% over recent years, with domestic sales contributing ₹8,395 crores and exports ₹1,771 crores. Cummins India became among the first companies to produce CPCBIV+ gensets, selling over 23,000 units, and launched four new solutions including Power Management Solutions and Cummins Retrofit Aftertreatment System. The company strengthened its presence in railways, defence, marine, and mining sectors while maintaining focus on sustainability initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1754657817494,
            "Source": "corporate_action"
        },
        {
            "Title": "Cummins India Management Sets Double-Digit Growth Target for FY26",
            "Summary": "Cummins India management has confirmed their goal of achieving double-digit growth for FY26. This target was communicated during a management call update.",
            "Sentiment": "positive",
            "PublishDate": 1754635646770,
            "Source": "stock"
        },
        {
            "Title": "Cummins India Shares Rise 2.7% After Reporting 40% Jump in Quarterly Profit",
            "Summary": "Cummins India shares surged 2.7% to Rs 3,778.80 after the company reported a 40% year-on-year increase in standalone profit after tax to Rs 589 crore for the quarter ended June 30, 2025. Total sales rose 26% year-on-year to Rs 2,859 crore, with domestic sales growing 25% to Rs 2,336 crore and export sales increasing 34% to Rs 523 crore. Profit before tax reached Rs 726 crore, up 32% year-on-year. Managing Director Shveta Arya noted continued opportunities in India's stable economy supported by government infrastructure initiatives and recent interest rate reductions.",
            "Sentiment": "positive",
            "PublishDate": 1754633897074,
            "Source": "earnings"
        },
        {
            "Title": "Cummins India Appoints Two New Directors and Reports Strong Q1 Financial Results",
            "Summary": "Cummins India Limited appointed Thierry Bruno Pimi Nouyeuwe as Additional Director (Non-Executive and Non-Independent) and Vibha Paul Rishi as Additional Director (Non-Executive and Independent), both effective August 09, 2025. Nouyeuwe, aged 50, leads DBU International Operations at Cummins Inc. and has over 25 years of experience in power generation and manufacturing. Rishi, aged 65, is a marketing specialist with international experience and serves on boards of ICICI Bank Limited and Piramal Pharma Limited. The company reported quarterly results with consolidated revenue from operations of ₹2,858.71 crore compared to ₹2,273.87 crore in the same quarter last year. Consolidated profit after tax increased to ₹603.90 crore from ₹462.61 crore year-over-year. Standalone profit after tax rose to ₹589.27 crore from ₹419.80 crore in the previous year quarter. The company recorded exceptional income of ₹44.15 crore in standalone results from the sale of its wholly owned subsidiary Cummins Sales & Service Private Limited. Both director appointments require shareholder approval through postal ballot.",
            "Sentiment": "positive",
            "PublishDate": 1754571131153,
            "Source": "corporate_action"
        },
        {
            "Title": "Cummins India Reports Strong Q1 Growth with 40% Jump in Net Profit",
            "Summary": "Cummins India delivered robust quarterly performance with net profit rising to 5.9 billion rupees from 4.2 billion rupees year-over-year. Revenue increased to 29 billion rupees compared to 23 billion rupees in the same period last year. EBITDA grew to 6.24 billion rupees from 4.7 billion rupees, while EBITDA margin improved to 21.83% from 20.31% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754569611432,
            "Source": "earnings"
        },
        {
            "Title": "Cummins India Faces Rs 1.43 Crore Customs Penalty Over Import Classification Issues",
            "Summary": "Cummins India Limited received an Order-In-Original from the Office of the Principal Commissioner of Customs, Mumbai, imposing a total penalty of Rs. 1,43,46,400. This amount comprises differential customs duty of Rs. 71,73,200 and an equal penalty amount under Section 114A of the Customs Act, 1962, for alleged incorrect classification of imported goods using wrong HSN codes. The company received the order on July 22, 2025, and plans to file an appeal with CESTAT seeking withdrawal of the demand and penalty. Cummins India stated that the penalty will not have any material impact on the company's financials or operational activities.",
            "Sentiment": "negative",
            "PublishDate": 1753451496674,
            "Source": "stock"
        },
        {
            "Title": "Cummins India Appoints Soma Dilip Ghosh as Chief Financial Officer",
            "Summary": "Cummins India Limited appointed Ms. Soma Dilip Ghosh as Chief Financial Officer and Key Managerial Personnel effective July 21, 2025. The appointment was approved by the Board of Directors on recommendation of the Nomination and Remuneration Committee and Audit and Compliance Committee in their May 28, 2025 meeting. Following her appointment, Mr. Prasad Kulkarni ceased his role as Interim CFO and KMP but will continue as Director – Finance Controller Distribution Business Unit (DBU) - India within the company.",
            "Sentiment": "neutral",
            "PublishDate": 1753161263723,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cummins India to Consider Q1 Results on August 7",
            "Summary": "Cummins India has announced that it will consider its first quarter results on August 7.",
            "Sentiment": "neutral",
            "PublishDate": 1750929573000,
            "Source": "default"
        },
        {
            "Title": "Cummins India: Launches Battery Energy Storage Systems for Clean Energy Transition",
            "Summary": "Cummins India has introduced Battery Energy Storage Systems (BESS) to support India's clean energy transition. The BESS products are modular, scalable, and feature advanced LFP battery technology with efficient thermal management. They are designed to complement existing genset offerings and expand Cummins' sustainable solutions portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1750921695000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cummins India Launches Battery Energy Storage Systems",
            "Summary": "Cummins India has introduced Battery Energy Storage Systems to support India's transition to clean energy. The company aims to contribute to the country's renewable energy goals through this new product offering.",
            "Sentiment": "positive",
            "PublishDate": 1750918842000,
            "Source": "default"
        },
        {
            "Title": "Cummins India Expects Double-Digit Growth Across Businesses",
            "Summary": "Cummins India anticipates double-digit growth in its domestic market, specifically in power generation, industrial, and distribution businesses. The distribution business is expected to grow at double digits or better. The company maintains its double-digit revenue growth guidance for the financial year 2025-26. Additionally, Cummins India expressed a positive outlook on the rail market segment.",
            "Sentiment": "positive",
            "PublishDate": 1748574977000,
            "Source": "default"
        },
        {
            "Title": "Cummins India: Double-Digit Revenue Growth Targeted for FY26",
            "Summary": "Cummins India aims for double-digit revenue growth in FY26, driven by strong domestic demand across power generation, industrial, and aftermarket businesses. Data centers are emerging as a key growth driver. The company reports healthy demand in railways and construction sectors. New CPCB IV+ products are gaining acceptance, but pricing environment is competitive.",
            "Sentiment": "positive",
            "PublishDate": 1748565962000,
            "Source": "normal_news"
        },
        {
            "Title": "Cummins India: Shares Surge 6% on Strong FY26 Outlook",
            "Summary": "Cummins India's shares rose 6% after Q4 results. Management guided double-digit revenue growth for FY26 with stable margins. Exports showed strong growth, while domestic sales were flat. The company expects continued growth in data center segment and export demand.",
            "Sentiment": "positive",
            "PublishDate": 1748499303000,
            "Source": "earnings"
        },
        {
            "Title": "Cummins India Expects Double-Digit Growth in FY26",
            "Summary": "During a conference call, Cummins India expressed cautious optimism about their future performance. The company stated that they anticipate double-digit growth in the fiscal year 2026 (FY26).",
            "Sentiment": "positive",
            "PublishDate": 1748493974000,
            "Source": "default"
        },
        {
            "Title": "Cummins India: Q4 Profit Dips 7.2%, Revenue Rises 6.1%",
            "Summary": "Cummins India reported Q4 FY25 net profit of Rs 521.37 crore, down 7.2% YoY. Revenue increased 6.1% to Rs 2,457 crore. EBITDA fell 4.5% to Rs 519.9 crore. FY25 total sales rose 15% to Rs 10,166 crore. Board recommends final dividend of Rs 33.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1748490843000,
            "Source": "earnings"
        },
        {
            "Title": "Cummins India: Q4 Profit Dips 7% But Beats Estimates, Announces Rs 33.5 Dividend",
            "Summary": "Cummins India's Q4 standalone net profit fell 7% to Rs 521 crore, surpassing analyst estimates. Revenue increased 6.1% to Rs 2,457 crore. The company declared a final dividend of Rs 33.5 per share for FY25, in addition to the earlier interim dividend of Rs 18.",
            "Sentiment": "neutral",
            "PublishDate": 1748446060000,
            "Source": "earnings"
        },
        {
            "Title": "Cummins India Reports Q4 Results and Dividend Recommendation",
            "Summary": "Cummins India has announced its Q4 financial results and dividend recommendation. The company's Q4 net profit decreased to 5.2 billion rupees from 5.6 billion rupees year-over-year. Revenue increased to 24 billion rupees from 22.69 billion rupees year-over-year. EBITDA for Q4 was 5.2 billion rupees, down from 5.44 billion rupees year-over-year, with EBITDA margin decreasing to 21.54% from 23.99%. The company has recommended a dividend of 33.5 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1748445874000,
            "Source": "result"
        },
        {
            "Title": "Cummins India: Share Price Drops 7% as Parent Company Withdraws Guidance",
            "Summary": "Cummins India's share price fell over 7% to ₹2,774 on NSE after its parent company withdrew full-year guidance due to Trump's tariff measures.",
            "Sentiment": "negative",
            "PublishDate": 1746504356000,
            "Source": "normal_news"
        },
        {
            "Title": "Cummins Inc. Suspends Full-Year Guidance",
            "Summary": "Cummins Inc., the parent company of Cummins India, has suspended its financial guidance for the full year. Previously, the company had projected revenue growth between -2% and +3%.",
            "Sentiment": "negative",
            "PublishDate": 1746499538000,
            "Source": "default"
        },
        {
            "Title": "Cummins India: Parent Company Suspends Guidance, PowerGen Business Declines",
            "Summary": "Cummins Inc. suspended its full-year guidance due to trade war uncertainties. India region revenue, including JVs, declined 14% year-on-year in Q1. PowerGen business in India saw 11% revenue drop. This negatively impacts Cummins India, the listed entity.",
            "Sentiment": "negative",
            "PublishDate": 1746492812000,
            "Source": "earnings"
        },
        {
            "Title": "Cummins: Withdraws 2025 Forecast Amid Tariff Uncertainties",
            "Summary": "Cummins has withdrawn its 2025 financial forecast due to growing economic uncertainty caused by US import tariffs. The company reported Q1 net income of $824 million, or $5.96 per share, down from $2 billion last year. Net sales for Q1 were $8.17 billion, slightly below estimates.",
            "Sentiment": "negative",
            "PublishDate": 1746459441000,
            "Source": "earnings"
        },
        {
            "Title": "Cummins India Schedules Board Meeting for Q4 Results",
            "Summary": "Cummins India has announced a board meeting scheduled for May 28 to consider and approve the financial results for the fourth quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1744034340000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cummins Reports Strong Demand for Power Generation",
            "Summary": "Cummins, a multinational corporation specializing in power generation solutions, has stated that there is significant demand for their power generation products, as reported by CNBC TV18.",
            "Sentiment": "positive",
            "PublishDate": 1739851626000,
            "Source": "normal_news"
        },
        {
            "Title": "Cummins India Anticipates Double-Digit Growth in FY25 and FY26",
            "Summary": "Cummins India has announced its expectation of double-digit growth for the fiscal years 2025 and 2026, as reported by CNBC TV18. This projection suggests a positive outlook for the company's performance in the coming years.",
            "Sentiment": "positive",
            "PublishDate": 1739851580000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cummins India Maintains Double-Digit Growth Guidance for FY25",
            "Summary": "During a recent conference call, Cummins India reaffirmed its guidance for double-digit growth in the fiscal year 2025. This projection suggests the company's confidence in its future performance and market position.",
            "Sentiment": "positive",
            "PublishDate": 1738904712000,
            "Source": "earnings"
        },
        {
            "Title": "Cummins India Maintains Double-Digit Growth Guidance for FY25",
            "Summary": "Cummins India has reaffirmed its double-digit growth guidance for the fiscal year 2025 during a recent conference call. The company remains optimistic about its future performance, indicating strong confidence in its business outlook and market position.",
            "Sentiment": "positive",
            "PublishDate": 1738904705000,
            "Source": "earnings"
        },
        {
            "Title": "Cummins India: Shares Surge on 900% Interim Dividend Announcement",
            "Summary": "Cummins India's stock price jumped over 5% after announcing a 900% interim dividend of ₹18 per share. The company reported strong Q3 FY25 results with PAT up 11.9% YoY to ₹558 crore and revenue rising 21.8% to ₹3,096 crore. The dividend record date is set for February 14, 2025, with payment by March 3, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1738817668000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cummins India Reports Strong Q3 Results, Declares Interim Dividend",
            "Summary": "Cummins India announced its Q3 financial results, reporting a net profit of 5.14 billion rupees, up from 4.55 billion rupees year-over-year, surpassing estimates of 4.78 billion rupees. Revenue increased to 30.4 billion rupees from 25 billion rupees in the same period last year. The company declared an interim dividend of 18 rupees per equity share. Cummins India expressed optimism about recovery in export demand and remains cautiously optimistic about the near-term demand outlook.",
            "Sentiment": "positive",
            "PublishDate": 1738801214000,
            "Source": "earnings"
        },
        {
            "Title": "Cummins India Optimistic About Export Recovery and Cautious on Near-Term Demand",
            "Summary": "Cummins India has expressed optimism regarding the recovery in export demand. However, the company maintains a cautiously optimistic stance on the near-term demand outlook.",
            "Sentiment": "positive",
            "PublishDate": 1738766926000,
            "Source": "normal_news"
        },
        {
            "Title": "Cummins India Declares Interim Dividend",
            "Summary": "Cummins India has announced an interim dividend of Rs 18 per equity share for its shareholders. This corporate action reflects the company's decision to distribute a portion of its profits to its investors.",
            "Sentiment": "positive",
            "PublishDate": 1738765790000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cummins India Reports Strong Q3 EBITDA Growth",
            "Summary": "Cummins India has announced its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 6 billion rupees, up from 5.4 billion rupees in the same quarter last year. This figure exceeded analyst estimates of 5.26 billion rupees. However, the EBITDA margin decreased to 19.73% from 21.46% year-over-year, though it still surpassed the estimated 19%.",
            "Sentiment": "positive",
            "PublishDate": 1738765782000,
            "Source": "earnings"
        }
    ]
}