{
    "Symbol": "CUPID",
    "ISIN": "INE509F01029",
    "News": [
        {
            "Title": "Cupid Ltd Promoter Acquires 6.46 Lakh Shares",
            "Summary": "Aditya Kumar Halwasiya, promoter of Cupid Limited, acquired 6,46,513 equity shares through open market purchase, increasing his shareholding from 32.58% to 32.82%.",
            "Sentiment": "positive",
            "PublishDate": 1770356477315,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cupid Ltd: Santosh Desai Resigns As Independent Director",
            "Summary": "Cupid Ltd announces the resignation of Santosh Desai from his position as Independent Director of the company, marking a change in the board composition.",
            "Sentiment": "neutral",
            "PublishDate": 1770130174480,
            "Source": "stocks"
        },
        {
            "Title": "Cupid Limited Q3FY26 Results: Revenue Surges 101.7%",
            "Summary": "Cupid Limited reported strong Q3FY26 performance with revenue from operations rising 101.7% YoY to ₹9,351.23 lacs. Net profit jumped 196.6% to ₹3,286.86 lacs, while the company announced a 4:1 bonus issue.",
            "Sentiment": "positive",
            "PublishDate": 1769686385073,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cupid Gets EU IVDR Certification for HIV & Hepatitis B Kits",
            "Summary": "Cupid Limited receives CE (EU IVDR) certification for HIV 1&2 and Hepatitis B IVD test kits, expanding access to European markets and strengthening its global diagnostics portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1769599165163,
            "Source": "stocks"
        },
        {
            "Title": "Cupid Limited Allots 4.65 Lakh Shares Under ESOP 2022",
            "Summary": "Cupid Limited's Nomination and Remuneration Committee approved allotment of 4,65,000 equity shares to employees under ESOP 2022 at Rs. 7 per share exercise price on January 27, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769519251961,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cupid Limited Director Shaina Chudasama Resigns",
            "Summary": "Cupid Limited announces resignation of Non-Executive Director Ms. Shaina Chudasama effective January 27, 2026, citing political and social commitments as reason for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1769518799144,
            "Source": "stocks"
        },
        {
            "Title": "Cupid Limited Confirms Negotiations with Baazar Style",
            "Summary": "Cupid Limited clarifies ongoing negotiations with Baazar Style Retail Limited following BSE inquiry. Company received expression of interest invitation on January 14, 2026 and communicated participation intent subject to approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1768990562836,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cupid shares rise 3% ahead of bonus issue meet",
            "Summary": "Cupid Ltd shares gained 3% to ₹445.00 in early trading as investors await the board meeting on January 29 to consider the company's third bonus share proposal.",
            "Sentiment": "positive",
            "PublishDate": 1768281247259,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cupid to Consider Bonus Share Issue on January 29",
            "Summary": "Cupid Limited has scheduled a board meeting on January 29 to deliberate on a potential bonus share issue for its shareholders, marking a significant corporate action consideration.",
            "Sentiment": "positive",
            "PublishDate": 1768176509946,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cupid To Consider Bonus Issue On Jan 29",
            "Summary": "Cupid Ltd will consider bonus share issue at board meeting on Jan 29 alongside Q3 results. The multibagger stock has surged 452% in 12 months with recent Saudi expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1767963908199,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cupid Limited Board Meet on Jan 29 for Q3 Results",
            "Summary": "Cupid Limited announces board meeting scheduled for January 29, 2026, to consider Q3FY26 unaudited financial results and bonus shares proposal under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1767955800338,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cupid shares rebound after 36% correction, up 451% YoY",
            "Summary": "Cupid Ltd recovers swiftly after sharp selloff, with analysts divided on outlook. Stock found support near 50-day EMA following massive 451.60% annual gains before recent volatility.",
            "Sentiment": "neutral",
            "PublishDate": 1767765427000,
            "Source": "stocks"
        },
        {
            "Title": "Cupid shares surge 11% after steep correction",
            "Summary": "Cupid Limited shares rebounded 11% to ₹433 after a 25% decline over two sessions. Company clarified no material events behind volatility and reiterated confidence in FY26 guidance of ₹335 crore revenue.",
            "Sentiment": "positive",
            "PublishDate": 1767679100660,
            "Source": "stocks"
        },
        {
            "Title": "Cupid Shares Plunge 19% After Block Deal",
            "Summary": "Cupid Ltd shares fell over 19% to hit one-month low following a block deal of 2.13 million shares in pre-market trading, amid company's expansion plans in Saudi Arabia.",
            "Sentiment": "negative",
            "PublishDate": 1767589251813,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cupid falls 20% again; Tourism Finance jumps 15%",
            "Summary": "Cupid shares dropped another 20% to Rs 368 while Tourism Finance rebounded 15% to Rs 63.50 on Monday, showing contrasting movements after Friday's circuit decline.",
            "Sentiment": "neutral",
            "PublishDate": 1767583187261,
            "Source": "stocks"
        },
        {
            "Title": "Cupid Addresses Rumours, Reaffirms FY26 Guidance",
            "Summary": "Cupid Ltd addresses false rumours while reporting strong Q3 FY26 momentum. Management remains confident of exceeding revenue guidance of ₹335 cr and PAT target of ₹100 cr for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1767576602377,
            "Source": "stocks"
        },
        {
            "Title": "Cupid expects best-ever Q3, guides Rs 335cr FY26",
            "Summary": "Contraceptives manufacturer Cupid anticipates Q3 FY26 to be its best quarter yet, backed by record order book and strong demand momentum across FMCG portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1767367519932,
            "Source": "stocks"
        },
        {
            "Title": "Cupid's GII Healthcare Fund Investment Grows 1.2x",
            "Summary": "Cupid Ltd reports that its investment in GII Healthcare Fund has appreciated to approximately 1.2 times the initial amount invested, demonstrating positive returns on the company's strategic investment.",
            "Sentiment": "positive",
            "PublishDate": 1767358133077,
            "Source": "stocks"
        },
        {
            "Title": "Cupid Reports Record High Order Book Performance",
            "Summary": "Cupid Ltd achieves record-high order book levels, positioning the FMCG company for strong operational performance in upcoming periods with robust business fundamentals.",
            "Sentiment": "positive",
            "PublishDate": 1767357795587,
            "Source": "co_actions_results"
        },
        {
            "Title": "CUPID Reports Q3 FY26 Business Update",
            "Summary": "CUPID announces business update for Q3 FY26 highlighting operating growth and global expansion progress, though detailed financial metrics await disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1767357740127,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cupid expects to exceed FY26 targets of ₹335cr revenue",
            "Summary": "Cupid management believes it will surpass previous FY26 targets of ₹335 crore revenue and ₹100 crore profit, driven by better operations, steady demand, and improved execution progress.",
            "Sentiment": "positive",
            "PublishDate": 1767354612249,
            "Source": "stocks"
        },
        {
            "Title": "Cupid shares hit fresh high, surge 34% in 15 days",
            "Summary": "Cupid Ltd extends rally for 15th consecutive session, reaching all-time high of ₹526. Stock delivers 141% returns in three months amid Saudi Arabia expansion plans and reduced promoter pledging.",
            "Sentiment": "positive",
            "PublishDate": 1767247618169,
            "Source": "stocks"
        },
        {
            "Title": "Cupid Ltd Hits New High, Surges 58% in Month",
            "Summary": "Smallcap FMCG player Cupid Ltd touched all-time high of ₹519.90, delivering 58% monthly gains. Stock shows 584% yearly growth amid Saudi Arabia expansion plans and reduced promoter pledging.",
            "Sentiment": "positive",
            "PublishDate": 1767159770675,
            "Source": "stocks"
        },
        {
            "Title": "Cupid Shares Hit All-Time High on Saudi Expansion",
            "Summary": "Cupid shares surged 4.07% to record high of ₹506.40 after board approved plans for first overseas FMCG manufacturing facility in Saudi Arabia to strengthen GCC market presence.",
            "Sentiment": "positive",
            "PublishDate": 1767082615205,
            "Source": "stocks"
        },
        {
            "Title": "Cupid Limited Hits Fresh 52-Week High at ₹499.95",
            "Summary": "Cupid Limited shares surged 2.51% to ₹499.70, touching a new 52-week high of ₹499.95. The stock has gained 51.50% in the past month and delivered extraordinary returns of 555.37% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1767077861617,
            "Source": "stocks"
        },
        {
            "Title": "Cupid Gets Board Approval for Saudi FMCG Manufacturing Unit",
            "Summary": "Cupid Ltd's board approves in-principle establishment of FMCG manufacturing facility in Saudi Arabia to strengthen GCC market presence. Project funded through internal accruals.",
            "Sentiment": "positive",
            "PublishDate": 1767009496404,
            "Source": "stocks"
        },
        {
            "Title": "Cupid Reduces Promoter Pledged Stake to 20%",
            "Summary": "Cupid Ltd reports significant reduction in promoter group's pledged stake from 36.13% on September 30 to 20% currently, indicating improved financial position and reduced leverage.",
            "Sentiment": "positive",
            "PublishDate": 1766493442209,
            "Source": "stocks"
        },
        {
            "Title": "Cupid Limited Cuts Promoter Pledge to 20%",
            "Summary": "Cupid Limited announces significant reduction in promoter pledge from 36.13% to 20%, reflecting strengthened balance sheet and improved financial position of the wellness products manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1766493062443,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cupid Limited Reports Forfeiture of Rs 288.92 Crore from Convertible Warrants Issue",
            "Summary": "Cupid Limited's warrant holders failed to exercise conversion option for 22 lakh warrants by September 13, 2025 deadline, resulting in forfeiture of Rs 288.92 crore (75% of warrant proceeds). The company has utilized entire received proceeds of Rs 96.30 crore across manufacturing enhancement, working capital, and general corporate purposes as per CRISIL's monitoring report for quarter ended September 30, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1763063589602,
            "Source": "corporate_action"
        },
        {
            "Title": "CUPID Reports Strong Q2 Performance with 141% Revenue Growth",
            "Summary": "CUPID delivered robust quarterly results with net profit rising to 241 million rupees from 100 million rupees in the same period last year. Revenue increased significantly to 844 million rupees compared to 416 million rupees year-over-year. The company's EBITDA grew to 284 million rupees from 103 million rupees, while EBITDA margin expanded to 33.65% from 24.74% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762957123769,
            "Source": "earnings"
        },
        {
            "Title": "Cupid Limited Secures Maximum Allocation in South Africa's 5-Year National Condom Program Worth $12.98 Million Annually",
            "Summary": "Cupid Limited has secured a leading position in South Africa's five-year national procurement program for female and male condoms from 2025-2030. The company received allocation of 23.4 million female condom units annually (59% market share) and 0.77 million boxes of male condoms yearly. The total annual financial visibility is estimated at $12.98 million (Rs. 115 crores approximately), with female condoms contributing $8.89 million and male condoms $4.09 million. Procurement is expected to commence from December 2025. Chairman and Managing Director Aditya Kumar Halwasiya stated this represents the highest ever multi-year visibility milestone for the company and will allow them to exceed previously given annual guidance. The company is coordinating with South African distributors for phased deliveries and finalizing local labelling requirements. Cupid Limited manufactures male and female condoms, water-based lubricants, and other wellness products, exporting to over 110 countries.",
            "Sentiment": "positive",
            "PublishDate": 1762255077329,
            "Source": "stock"
        },
        {
            "Title": "Cupid Limited Receives CE Certification for Pregnancy and Syphilis Test Kits, Targeting Multi-Billion Dollar IVD Market",
            "Summary": "Cupid Limited announced it has received CE (EU IVDR) Certification for its CupiSURE Pregnancy (hCG) Test Kit and CupiKIT Syphilis Antibody Test Kit. The certifications allow Cupid to distribute these products across the European Economic Area and other CE-recognized global markets. The company targets the pregnancy test kit market valued at USD 1.7 billion in 2024 and projected to reach USD 2.9 billion by 2034, and the syphilis diagnostics market estimated at USD 611 million in 2025, expected to grow to USD 993 million by 2034. Cupid expects to receive CE certification for its HIV 1 & 2 Antibody and Hepatitis B Antigen IVD kits by December 2025. The certifications enable Cupid to participate in European, African, and Latin American tenders for maternal health and infectious disease screening. Chairman and Managing Director Aditya Kumar Halwasiya stated the certifications validate the company's global quality standards and open opportunities across Europe, Africa, and Asia.",
            "Sentiment": "positive",
            "PublishDate": 1760773061765,
            "Source": "stock"
        },
        {
            "Title": "Cupid Limited Receives Maharashtra State Export Award for Outstanding Export Performance",
            "Summary": "Cupid Limited received recognition at the Maharashtra State Export Award Ceremony 2025 held on October 13, 2025, at Taj Lands End, Mumbai. The Government of Maharashtra organized the event to acknowledge top-performing exporters for their contribution to the state's global trade leadership. Cupid Limited, a manufacturer and exporter of healthcare and wellness products, has demonstrated growth in international markets across Africa, Latin America, Asia, Europe and the Middle East. Chairman and Managing Director Aditya Kumar Halwasiya stated the award reflects the team's commitment to quality, innovation, and purpose-driven growth. The company exports to over 110 countries and holds WHO/UNFPA pre-qualification for both male and female condoms. In March 2024, Cupid completed a land acquisition in Palava, Maharashtra, to increase production capacity by 1.5 times, adding approximately 770 million male condoms and 75 million female condoms to annual capacity.",
            "Sentiment": "positive",
            "PublishDate": 1760359140130,
            "Source": "stock"
        },
        {
            "Title": "Cupid Breweries And Distilleries Plans to Raise 4.50 Billion Rupees Through Securities Issuance",
            "Summary": "Cupid Breweries And Distilleries announced plans to raise up to 4.50 billion rupees by issuing securities on October 4. The company is seeking to raise capital through this securities offering.",
            "Sentiment": "positive",
            "PublishDate": 1759245044885,
            "Source": "stock"
        },
        {
            "Title": "Cupid Limited Promoter Aditya Kumar Halwasiya Acquires Additional 5 Lakh Shares",
            "Summary": "Aditya Kumar Halwasiya, Promoter and Chairman and Managing Director of Cupid Limited, acquired 5,00,000 equity shares of face value Re. 1 each through open market transactions on September 26, 2025. Following this acquisition, his shareholding increased from 86,955,582 shares (32.39%) to 87,455,582 shares (32.58%) of the total voting capital. The combined promoter group holding, including Columbia Petro Chem Private Limited's 34,839,850 shares (12.98%), increased from 45.37% to 45.56% of the total voting capital. The company's equity share capital remains at Rs. 26,84,67,140 divided into 26,84,67,140 equity shares of Re. 1 each.",
            "Sentiment": "positive",
            "PublishDate": 1758892981417,
            "Source": "corporate_action"
        },
        {
            "Title": "Cupid Expects Record Q2 FY26 Performance Driven by New Products and FMCG Growth",
            "Summary": "Cupid anticipates record performance in Q2 FY26, building on strong FY25 results. The company's growth is being supported by new product introductions and expansion in the FMCG segment.",
            "Sentiment": "positive",
            "PublishDate": 1758877939948,
            "Source": "stock"
        },
        {
            "Title": "Cupid Limited Promoter Aditya Kumar Halwasiya Acquires Additional 5 Lakh Shares",
            "Summary": "Aditya Kumar Halwasiya, Promoter and Chairman and Managing Director of Cupid Limited, acquired 5,00,000 equity shares of face value Re. 1 each through open market transactions. Following this acquisition, Halwasiya's shareholding increased from 86,455,582 shares (32.20%) to 86,955,582 shares (32.39%) of the total voting capital. The combined promoter group holding, including Columbia Petro Chem Private Limited's 34,839,850 shares (12.98%), increased from 45.18% to 45.37%. The acquisition was disclosed in compliance with SEBI regulations on substantial acquisition of shares. Cupid Limited's equity share capital remains at Rs. 26,84,67,140 divided into 26,84,67,140 equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1758799075634,
            "Source": "corporate_action"
        },
        {
            "Title": "Cupid Limited Promoter Aditya Kumar Halwasiya Acquires Additional 11 Lakh Shares",
            "Summary": "Aditya Kumar Halwasiya, Promoter and Chairman and Managing Director of Cupid Limited, acquired 11,00,000 equity shares of face value Re. 1 each through open market transactions. Following this acquisition, his shareholding increased from 85,355,582 shares (31.79%) to 86,455,582 shares (32.20%) of the total share capital. The combined promoter group holding, including Columbia Petro Chem Private Limited's 34,839,850 shares (12.98%), now stands at 121,295,432 shares representing 45.18% of the company's total equity. The company's equity share capital remains at Rs. 26,84,67,140 divided into 26,84,67,140 equity shares of Re. 1 each.",
            "Sentiment": "positive",
            "PublishDate": 1758715077503,
            "Source": "corporate_action"
        },
        {
            "Title": "Cupid Limited Promoter Aditya Kumar Halwasiya Acquires 10 Lakh Shares in Open Market",
            "Summary": "Aditya Kumar Halwasiya acquired 10,00,000 equity shares of Cupid Limited through open market transactions on September 23, 2025. The acquisition increased his shareholding from 84,355,582 shares (31.42%) to 85,355,582 shares (31.79%) of the total share capital. Combined with other promoter group holdings including Columbia Petro Chem Private Limited's 34,839,850 shares (12.98%), the total promoter group holding increased from 44.40% to 44.77%. The shares have a face value of Re. 1 each, and Cupid Limited's equity share capital stands at Rs. 26,84,67,140 divided into 26,84,67,140 equity shares. The company is listed on BSE and NSE.",
            "Sentiment": "positive",
            "PublishDate": 1758626306512,
            "Source": "corporate_action"
        },
        {
            "Title": "Cupid Limited Promoter Aditya Kumar Halwasiya Acquires 10 Lakh Additional Shares",
            "Summary": "Aditya Kumar Halwasiya, Promoter and Chairman and Managing Director of Cupid Limited, acquired 10,00,000 equity shares of face value Re. 1 each through open market purchase on September 22, 2025. Following this acquisition, his shareholding increased from 83,355,582 shares (31.05%) to 84,355,582 shares (31.42%) of the total voting capital. The combined promoter group holding, including Columbia Petro Chem Private Limited's 34,839,850 shares (12.98%), now stands at 119,195,432 shares representing 44.40% of total voting capital. The company's equity share capital remains at Rs. 26,84,67,140 divided into 26,84,67,140 equity shares of Re. 1 each.",
            "Sentiment": "positive",
            "PublishDate": 1758549344463,
            "Source": "corporate_action"
        },
        {
            "Title": "Cupid Limited Promoter Aditya Kumar Halwasiya Acquires 10 Lakh Additional Shares",
            "Summary": "Aditya Kumar Halwasiya, Promoter and Chairman and Managing Director of Cupid Limited, acquired 10,00,000 equity shares of face value Re. 1 each through open market transactions on September 17, 2025. Following this acquisition, his shareholding increased from 82,355,582 shares (30.68%) to 83,355,582 shares (31.05%) of the total voting capital. The combined promoter group holding, including Columbia Petro Chem Private Limited's 34,839,850 shares (12.98%), now stands at 118,195,432 shares representing 44.03% of total voting capital. The company's equity share capital remains at Rs. 26,84,67,140 divided into 26,84,67,140 equity shares of Re. 1 each.",
            "Sentiment": "positive",
            "PublishDate": 1758108248139,
            "Source": "corporate_action"
        },
        {
            "Title": "Cupid Limited Promoter Aditya Kumar Halwasiya Acquires Additional 10 Lakh Shares",
            "Summary": "Aditya Kumar Halwasiya, Promoter and Chairman and Managing Director of Cupid Limited, acquired 10,00,000 equity shares of face value Re. 1 each through open market transactions on September 15, 2025. Following this acquisition, his shareholding increased from 81,355,582 shares (30.30%) to 82,355,582 shares (30.68%) of the total voting capital. The combined promoter group holding, including Columbia Petro Chem Private Limited's 34,839,850 shares (12.98%), now stands at 117,195,432 shares representing 43.66% of total voting capital. The company's equity share capital remains at Rs. 26,84,67,140 divided into 26,84,67,140 equity shares of Re. 1 each.",
            "Sentiment": "positive",
            "PublishDate": 1758013634755,
            "Source": "corporate_action"
        },
        {
            "Title": "Cupid Limited Promoter Aditya Kumar Halwasiya Acquires Additional 10 Lakh Shares",
            "Summary": "Aditya Kumar Halwasiya, Promoter and Chairman and Managing Director of Cupid Limited, acquired 10,00,000 equity shares of face value Re. 1 each through open market transactions on September 12, 2025. Following this acquisition, his shareholding increased from 80,355,582 shares (29.93%) to 81,355,582 shares (30.30%) of the total voting capital. The combined promoter group holding, including Columbia Petro Chem Private Limited's 34,839,850 shares (12.98%), now stands at 116,195,432 shares representing 43.28% of the total voting capital. The company's equity share capital remains at Rs. 26,84,67,140 divided into 26,84,67,140 equity shares of Re. 1 each.",
            "Sentiment": "positive",
            "PublishDate": 1757920000272,
            "Source": "corporate_action"
        },
        {
            "Title": "Cupid Limited Promoter Aditya Kumar Halwasiya Acquires 11 Lakh Equity Shares in Open Market",
            "Summary": "Aditya Kumar Halwasiya acquired 11,00,000 equity shares of Cupid Limited with face value of Re. 1 each through open market transactions on September 10, 2025. Following this acquisition, Halwasiya's shareholding increased from 79,255,582 shares (29.52%) to 80,355,582 shares (29.93%) of the total share capital. The combined promoter and promoter group holding, including Columbia Petro Chem Private Limited's 34,839,850 shares (12.98%), rose from 42.50% to 42.91%. The company's equity share capital remains at Rs. 26,84,67,140 divided into 26,84,67,140 equity shares. Cupid Limited is listed on BSE (scrip code: 530843) and NSE (scrip code: CUPID).",
            "Sentiment": "positive",
            "PublishDate": 1757668452080,
            "Source": "corporate_action"
        },
        {
            "Title": "Cupid Limited Signs Term Sheet to Acquire Strategic Stake in Saudi Arabian Luxury Fragrance Brand Mansam",
            "Summary": "Cupid Limited has entered into a Term Sheet to acquire a strategic stake in Mansam, a Saudi Arabian luxury fragrance brand, through a fund structure managed by GII Investment Management Limited. Mansam, founded in 2022, is positioned as the first Arabian luxury fragrance brand with a vision for global expansion. The investment aims to expand Cupid's presence in the lifestyle and consumer space, particularly in the high-growth Middle Eastern luxury market. Mansam is promoted by Key Notes Trading LLC.",
            "Sentiment": "positive",
            "PublishDate": 1757414892374,
            "Source": "order&deals"
        },
        {
            "Title": "Cupid Welcomes GST Rate Reductions for FMCG Sector",
            "Summary": "Cupid has welcomed changes to GST rates that will result in lower taxes for key FMCG categories. The company expects these rate changes to reduce input costs and improve product accessibility, supporting overall FMCG sector growth.",
            "Sentiment": "positive",
            "PublishDate": 1756964969034,
            "Source": "stock"
        },
        {
            "Title": "Cupid Secures Record $11.5M Export Order Book Through International Tender Wins",
            "Summary": "Cupid has secured a record export order book worth $11.5 million (₹100+ crores) through successful tender wins in Brazil, Tanzania, and South Africa. The orders span across the company's product portfolio including condoms, lubricants, and IVD kits, supporting its global market expansion.",
            "Sentiment": "positive",
            "PublishDate": 1756820193879,
            "Source": "order&deals"
        },
        {
            "Title": "Cupid Plans Growth Through Market Expansion and Product Diversification",
            "Summary": "Cupid is pursuing significant growth through a multi-pronged strategy that includes expanding into new markets and diversifying its product portfolio in condoms and female healthcare segments. The company plans to utilize global tenders as part of its approach to improve revenue and profit performance.",
            "Sentiment": "positive",
            "PublishDate": 1754665808051,
            "Source": "stock"
        },
        {
            "Title": "Cupid Limited Submits Q1FY2026 Investor Presentation and Strengthens IVD Test Kits Business",
            "Summary": "Cupid Limited submitted its quarterly investor presentation to stock exchanges and announced strengthening of its IVD Test Kits Business. The company reported quarterly revenue of ₹64.75 crores, up 47.06% year-over-year, with EBITDA of ₹16.47 crores and net profit of ₹15.01 crores. For FY25, the company achieved total income of ₹203.18 crores with EBITDA margin of 22.74% and net profit margin of 22.28%. The company operates across four segments: Male Condoms (64% of FY25 revenue), Female Condoms (15%), Other Consumer Products (14%), and IVD Kits (7%). Cupid exports to 110+ countries and is the first company globally to receive WHO/UNFPA prequalification for both male and female condoms. The IVD business includes 15 rapid test kits in production with 3 additional kits under development. Current IVD capacity is 1 lakh kits per day, targeting expansion to 4 lakh kits per day by end-2026. The company has completed country registrations in Tanzania, Ghana, Liberia, Bangladesh, Philippines, Sierra Leone, Bhutan, Nepal and Uganda for IVD products. A new manufacturing facility in Palava, Maharashtra is under development to increase production capacity by 1.5x by end-FY26. The company maintains zero debt with strong cash reserves and has achieved 1.2 lakh+ retail touchpoints within 15 months for its B2C FMCG business.",
            "Sentiment": "positive",
            "PublishDate": 1754659814574,
            "Source": "stock"
        },
        {
            "Title": "Cupid Reports 81% Jump in Net Profit to 150M Rupees in Q1",
            "Summary": "Cupid reported net profit of 150 million rupees in Q1, representing an 81% increase from 83 million rupees in the same period last year. The company's revenue grew 53% to 598 million rupees compared to 391 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754655150764,
            "Source": "earnings"
        }
    ]
}