{
    "Symbol": "CURAA",
    "ISIN": "INE117B01020",
    "News": [
        {
            "Title": "Cura Technologies Q3FY26 Results & Director Resignation",
            "Summary": "Cura Technologies reports ₹11.99 lakhs revenue in Q3FY26, turning profitable with ₹1.71 lakhs net profit. Independent Director Priyanka Agarwal resigns due to personal reasons.",
            "Sentiment": "positive",
            "PublishDate": 1769883248038,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cura Technologies Company Secretary Resigns Due to Personal Reasons",
            "Summary": "Mrs. Sharvari Swapnil Shinde has resigned from her position as Company Secretary and Compliance Officer at Cura Technologies Limited, with the resignation taking effect from December 4, 2025. The resignation was attributed to personal reasons and was formally communicated to BSE and NSE as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1764846831108,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cura Technologies Reports Mixed Quarterly Performance with Revenue Decline",
            "Summary": "Cura Technologies Limited announced its unaudited financial results for the quarter ended September 30, 2025. The IT services company reported revenue from operations of Rs 12.00 lakhs, with total income of Rs 12.00 lakhs. The company posted a loss before tax of Rs 1.38 lakhs for the quarter, compared to a profit of Rs 0.93 lakhs in the previous quarter. For the six-month period, the company reported revenue of Rs 26.06 lakhs and a profit before tax of Rs 2.31 lakhs. Total expenses for the quarter were Rs 13.38 lakhs, with employee benefit expenses being the largest component at Rs 6.35 lakhs. The company's cash and cash equivalents increased significantly to Rs 48.70 lakhs from Rs 10.19 lakhs. Equity share capital stood at Rs 990.00 lakhs with a face value of Rs 10 per share. The results were approved by the Board of Directors in their meeting held on November 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762996209461,
            "Source": "earnings"
        },
        {
            "Title": "Cura Technologies Reports 44% Revenue Decline Despite Reduced Losses in Q1 FY2026",
            "Summary": "Cura Technologies Limited reported total income of Rs. 3.16 crore for Q1 FY2026, declining from Rs. 5.66 crore in Q1 FY2025. The company's net loss narrowed to Rs. 0.56 crore compared to Rs. 1.24 crore in the previous year quarter. Earnings per share improved to Rs. -0.06 from Rs. -0.14 year-over-year. The company maintains a net worth of Rs. 75.40 crore as of June 30, 2025. While revenue faced significant pressure with a substantial year-over-year decline, the company managed to reduce its losses during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1755511322824,
            "Source": "earnings"
        },
        {
            "Title": "Cura Technologies Reports Loss in Q1 FY2026, Board Authorizes Management to Explore Acquisitions",
            "Summary": "Cura Technologies Limited reported a net loss of Rs 0.93 lakhs for the quarter ended June 30, 2025, compared to a loss of Rs 14.54 lakhs in the same period last year. The company generated revenue from operations of Rs 14.06 lakhs with total expenses of Rs 15.01 lakhs. The Board of Directors authorized the Managing Director and Whole Time Director to explore new business opportunities, identify companies for acquisition to achieve inorganic growth, and take necessary steps including appointing registered valuers. The company allotted 7,50,000 equity shares to a strategic investor on June 21, 2025, pursuant to a resolution plan approved by NCLT. Cura Technologies operates in the IT services segment.",
            "Sentiment": "neutral",
            "PublishDate": 1755171124168,
            "Source": "earnings"
        }
    ]
}