{
    "Symbol": "CYBERMEDIA",
    "ISIN": "INE278G01037",
    "News": [
        {
            "Title": "Cyber Media Q3 FY26 Rights Issue Monitoring Report",
            "Summary": "Cyber Media (India) Limited submits Q3 FY26 monitoring agency report for Rs. 4.08 crore rights issue proceeds utilization under SEBI regulations, showing compliance with disclosed objects.",
            "Sentiment": "neutral",
            "PublishDate": 1769688851822,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cyber Media Board Approves Merger with CMRSL",
            "Summary": "Cyber Media (India) Limited's board approved the merger scheme with Cyber Media Research & Services Limited on January 24, 2026, subject to regulatory approvals and NCLT sanction.",
            "Sentiment": "positive",
            "PublishDate": 1769237036242,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cyber Media Q3FY26 Results Show Strong Recovery",
            "Summary": "Cyber Media (India) Limited reported consolidated profit of ₹20.11 lakhs for Q3FY26 versus loss of ₹911.60 lakhs in Q3FY25. Revenue grew 5.14% YoY to ₹2,501.18 lakhs with Digital Services contributing ₹2,208.03 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1769236569614,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cyber Media Board Meet on Jan 24 for Q3 Results",
            "Summary": "Cyber Media India schedules board meeting for January 24, 2026 to approve Q3FY26 unaudited results and consider merger with subsidiary Cyber Media Research & Services Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1768394010967,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cyber Media Sets Record Date for Rights Issue Call",
            "Summary": "Cyber Media (India) Limited fixes January 14, 2026 as record date for first and final call on 51.62 lakh partly paid-up rights equity shares, requiring ₹7.90 per share payment.",
            "Sentiment": "neutral",
            "PublishDate": 1767951015845,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cyber Media Revises Record Date to Jan 14 for Final Call",
            "Summary": "Cyber Media revises record date to January 14, 2026 for ₹7.90 first and final call on partly paid-up equity shares following Rights Issue Committee meeting outcome.",
            "Sentiment": "neutral",
            "PublishDate": 1767609852666,
            "Source": "co_actions_results"
        },
        {
            "Title": "CyberMedia India Limited Reports Rights Issue Fund Utilization for September 2025 Quarter",
            "Summary": "CyberMedia India Limited submitted its monitoring agency report for fund utilization from its rights issue for the quarter ended September 30, 2025. The company had proposed to raise Rs 9.90 crore through the rights issue but received subscriptions worth Rs 8.16 crore. The company received Rs 4.08 crore as 50% application money, which includes Rs 2.76 crore from conversion of outstanding loans into equity. The funds were allocated for working capital (Rs 1.93 crore), loan conversion (Rs 3.80 crore), general corporate purposes (Rs 2.04 crore), and issue expenses (Rs 0.39 crore). During the quarter, Rs 2.76 crore was utilized for loan conversion and Rs 1.32 crore for general corporate purposes, specifically debt repayment. Brickwork Ratings India Private Limited served as the monitoring agency and reported no deviation from the stated objects of the issue.",
            "Sentiment": "neutral",
            "PublishDate": 1763010026044,
            "Source": "corporate_action"
        },
        {
            "Title": "CyberMedia India Approves Merger with CyberMedia Research Services",
            "Summary": "CyberMedia (India) Limited's Board of Directors approved a scheme of amalgamation to merge CyberMedia Research Services Limited (CMRSL) into the company. The merger involves a share exchange ratio of 35 fully paid-up equity shares of CyberMedia India for every 8 shares of CMRSL. The transaction is subject to approvals from shareholders, creditors, and the National Company Law Tribunal. CyberMedia India operates in print media and publishing magazines including Dataquest and PCQuest, while CMRSL provides digital marketing, social media campaigns, and market research services. The merger aims to consolidate business operations, create operational synergies, reduce compliance costs, and position the combined entity as a comprehensive marketing solutions provider. Post-merger, the promoter shareholding will decrease from 66.57% to 50.13%, while promoter group shareholding will increase from 33.43% to 49.87%.",
            "Sentiment": "positive",
            "PublishDate": 1762899106522,
            "Source": "corporate_action"
        },
        {
            "Title": "CyberMedia India Reports Mixed Q2 Results with Revenue Decline and Profit Recovery",
            "Summary": "CyberMedia (India) Limited announced its quarterly results ended September 30, 2025. The company reported consolidated revenue from operations of Rs 2,420.94 lakhs for the quarter, compared to Rs 2,584.53 lakhs in the previous quarter and Rs 2,065.02 lakhs in the same quarter last year. For the half-year period, consolidated revenue reached Rs 5,005.47 lakhs versus Rs 4,130.34 lakhs in the previous year. The company posted a consolidated profit after tax of Rs 87.09 lakhs for the quarter, reversing from a loss of Rs 128.10 lakhs in the previous quarter. On a standalone basis, the company reported revenue of Rs 371.50 lakhs for the quarter and Rs 747.42 lakhs for the half-year. The company operates through two main segments: Media Services and Digital Services, with Digital Services contributing Rs 2,049.04 lakhs to quarterly revenue. The board meeting was held on November 11, 2025, and commenced at 4:05 PM, concluding at 5:45 PM.",
            "Sentiment": "neutral",
            "PublishDate": 1762894753026,
            "Source": "earnings"
        },
        {
            "Title": "Cyber Media (India) Limited Board Approves Merger with Cyber Media Research & Services Limited",
            "Summary": "The Board of Directors of Cyber Media (India) Limited approved a proposal for the merger of Cyber Media Research & Services Limited into Cyber Media (India) Limited on September 30, 2025. The decision was made following a recommendation from the Audit Committee. The merger will be executed under Sections 230 to 232 of the Companies Act, 2013 and other applicable laws. The board meeting was held from 11:45 a.m. to 12:15 p.m., with Cyber Media (India) Limited serving as the transferee company and Cyber Media Research & Services Limited as the transferor company.",
            "Sentiment": "neutral",
            "PublishDate": 1759216357050,
            "Source": "corporate_action"
        },
        {
            "Title": "Cyber Media (India) Limited Schedules Board Meeting to Consider Merger with Subsidiary",
            "Summary": "Cyber Media (India) Limited has scheduled a Board of Directors meeting on September 30, 2025, to consider and approve the merger and amalgamation with its subsidiary, Cyber Media Research & Services Limited. The merger will be conducted under Sections 230 to 232 of the Companies Act, 2013, along with other relevant provisions and SEBI regulations. The company has informed BSE and NSE about the scheduled board meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1758801571699,
            "Source": "corporate_action"
        },
        {
            "Title": "Pradeep Gupta Increases Stake in Cyber Media Through Rights Issue Acquisition",
            "Summary": "Pradeep Gupta, a member of the Promoter & Promoter Group of Cyber Media (India) Limited, acquired equity shares through a Rights Issue under the exemption provided by SEBI regulations. His shareholding increased from 74,78,919 shares (47.74% of total share capital) to 1,12,85,971 shares (54.18% of total share capital). Gupta acquired 1.51% shares in excess of his rights entitlement, calculated on post-issue capital. The acquisition was made under Regulation 10(4)(b) of SEBI (Substantial Acquisition of Shares and Takeovers) Regulations, 2011, which exempted him from making an open offer. The disclosure was submitted to BSE Limited and National Stock Exchange of India Limited on September 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757932183727,
            "Source": "corporate_action"
        },
        {
            "Title": "Cyber Media Promoter Group Increases Shareholding to 66.57% Through Rights Issue",
            "Summary": "Pradeep Gupta, representing the Promoter & Promoter Group of Cyber Media (India) Limited, disclosed an increase in their collective shareholding from 61.79% to 66.57% following a rights issue allotment on September 10, 2025. The promoter group acquired 41,87,052 additional shares, representing 20.10% of the post-issue capital. Pradeep Gupta individually increased his holding from 47.74% to 54.18%, while Dhaval Gupta's stake rose from 12.27% to 11.05% after acquiring 3,80,000 shares. The company's equity share capital expanded from Rs. 15.67 crore to Rs. 18.25 crore, consisting of both fully paid and partly paid equity shares of Rs. 10 face value each.",
            "Sentiment": "positive",
            "PublishDate": 1757674473507,
            "Source": "corporate_action"
        },
        {
            "Title": "Cyber Media Reports 25.5% Revenue Growth in Q1, Launches Rs 10 Crore Rights Issue",
            "Summary": "Cyber Media (India) Limited reported quarterly revenue of Rs 26.08 crore, marking a 25.5% increase from Rs 20.77 crore in the previous year's corresponding quarter. The 43-year-old technology media company's EBITDA improved to Rs 1.58 crore from Rs 27 lakh, while profit before tax reached Rs 1.3 crore compared to a slight loss in the previous quarter. The company has launched a Rs 10 crore rights issue, with Rs 3.31 crore allocated for working capital, Rs 2.50 crore for future growth, and Rs 40 lakh for issue expenses. Chairman Pradeep Gupta stated that legacy issues including US business challenges, major litigations, and tax matters have been resolved. The company operates technology media brands including DataQuest, PCQuest, CIOL, Voice&Data, and DQ Channels, alongside digital marketing services through Google partnerships and data analytics through subsidiary CMRSL. The company reported over 11 million website users with 90% year-on-year traffic growth and maintains investments in approximately 20 startups. The founder group holds 61.79% entitlement but will contribute about 75% of the rights issue amount.",
            "Sentiment": "positive",
            "PublishDate": 1756106299318,
            "Source": "earnings"
        },
        {
            "Title": "Cyber Media (India) Limited Provides Video Recording Link for August 18, 2025 Earnings Conference Call",
            "Summary": "Cyber Media (India) Limited has made available the video recording of their earnings conference call held on August 18, 2025. The company provided a direct link to access the recording and notified both BSE Limited (Scrip Code: 532640) and National Stock Exchange of India Ltd. (Symbol: CYBERMEDIA) about the availability. The filing was made under Regulation 30 of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, and was signed by Company Secretary Anoop Singh. The recording is accessible through a provided web link and the company's website at www.cybermedia.co.in.",
            "Sentiment": "neutral",
            "PublishDate": 1755532904378,
            "Source": "earnings"
        },
        {
            "Title": "Cyber Media (India) Limited Approves Quarterly Financial Results",
            "Summary": "Cyber Media (India) Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025, during a meeting held on August 12, 2025. The board reviewed and approved both standalone and consolidated results along with the Limited Review Report from the Statutory Auditor. The board meeting lasted from 2:30 p.m. to 3:28 p.m., and the results have been submitted to BSE Limited and National Stock Exchange of India.",
            "Sentiment": "neutral",
            "PublishDate": 1754995359378,
            "Source": "earnings"
        },
        {
            "Title": "Cyber Media (India) Limited Announces Rights Issue of Up to ₹1,000 Crores",
            "Summary": "Cyber Media (India) Limited has announced a rights issue of up to 62,66,897 partly paid-up equity shares at ₹15.80 per share, aggregating up to ₹1,000 lakhs. The issue is offered to eligible equity shareholders in a 2:5 ratio (2 shares for every 5 shares held) with a record date of August 1, 2025. The issue opens on August 18, 2025, and closes on August 29, 2025. Proceeds will be used for working capital requirements (₹331.16 lakhs), conversion of outstanding loans to equity (₹379.84 lakhs), and general corporate purposes (₹250 lakhs). The company operates as a media and information services provider in the technology domain, producing ICT magazines and online content. The promoter and promoter group have committed to subscribe to their full rights entitlements.",
            "Sentiment": "neutral",
            "PublishDate": 1754464473958,
            "Source": "corporate_action"
        },
        {
            "Title": "Cyber Media (India) Limited Reports Net Loss of ₹11.92 Crore in FY25, Announces 43rd AGM",
            "Summary": "Cyber Media (India) Limited has submitted notice for its 43rd Annual General Meeting scheduled for August 25, 2025, along with its annual report for FY2024-25. The company reported a standalone net loss of ₹11.92 crore compared to ₹0.37 crore loss in the previous year. Revenue from operations declined 18.47% to ₹11.30 crore from ₹13.86 crore. On consolidated basis, the company recorded a net loss of ₹9.73 crore versus a net profit of ₹3.41 crore in the previous year, with consolidated revenue falling 14.81% to ₹86.72 crore. The company faced exceptional expenses of ₹890.84 crore, primarily due to a settlement amount related to a foreign arbitral award. Directors noted disappointment with FY25 performance after achieving 38% CAGR growth from FY21-24, and have initiated processes to reverse the trend. The Board has approved a rights issue of up to ₹10 crore and received in-principle approval from BSE.",
            "Sentiment": "negative",
            "PublishDate": 1754052716931,
            "Source": "corporate_action"
        },
        {
            "Title": "Cyber Media India Approves Rights Issue of Rs. 99 Crore at Rs. 15.80 Per Share",
            "Summary": "Cyber Media (India) Limited's Rights Issue Committee has approved a rights issue of 62,66,897 partly paid-up equity shares priced at Rs. 15.80 per share, raising Rs. 9,90,16,973. The shares have a face value of Rs. 10 each with a premium of Rs. 5.80 per share. The record date is August 1, 2025, with the issue opening on August 18 and closing on August 29, 2025. Eligible shareholders will receive 2 rights shares for every 5 existing shares held. Payment will be made in two installments of Rs. 7.90 each - on application and on call. Rights entitlements will be credited to shareholders' demat accounts in dematerialized form before the issue opens.",
            "Sentiment": "neutral",
            "PublishDate": 1753158579476,
            "Source": "corporate_action"
        },
        {
            "Title": "Cyber Media Reaches $1 Million Settlement Agreement",
            "Summary": "Cyber Media and involved parties have entered into a settlement agreement for $1 million. The news briefly mentions the resolution of a dispute or legal matter through this financial settlement.",
            "Sentiment": "neutral",
            "PublishDate": 1734048768000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cyber Media Reaches $1 Million Settlement Agreement",
            "Summary": "Cyber Media and involved parties have entered into a settlement agreement for $1 million. The specifics of the dispute and the other parties involved are not provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1734001328000,
            "Source": "corporate_action"
        }
    ]
}