{
    "Symbol": "CYBERTECH",
    "ISIN": "INE214A01019",
    "News": [
        {
            "Title": "CyberTech Systems Files Q3 Compliance Statement",
            "Summary": "CyberTech Systems and Software Limited confirms no deviation in use of proceeds from Rs. 40.27 crore Preferential Issue for quarter ended December 31, 2025, with funds temporarily parked in fixed deposits.",
            "Sentiment": "neutral",
            "PublishDate": 1770829227314,
            "Source": "co_actions_results"
        },
        {
            "Title": "CyberTech Q3FY26 Results: Profit Drops 28% YoY",
            "Summary": "CyberTech Systems & Software reported Q3FY26 consolidated profit of ₹653.35 lakhs, down 28% YoY. Revenue remained flat at ₹5,783.95 lakhs while board approved $100K incentive for Executive Director.",
            "Sentiment": "negative",
            "PublishDate": 1770828199977,
            "Source": "co_actions_results"
        },
        {
            "Title": "CyberTech Systems And Software Focuses On AI-Led Cloud Transformation And Strategic Partnerships For Growth",
            "Summary": "CyberTech Systems And Software is focusing on AI-led cloud transformation and SAP-GIS integration to drive long-term growth. The company is strengthening strategic partnerships with Esri and Microsoft Azure ArcGIS while expanding global delivery capabilities in SAP S/4HANA migrations and geospatial intelligence. CyberTech targets sustained margin improvement and double-digit growth through innovation and operational discipline.",
            "Sentiment": "positive",
            "PublishDate": 1762442090992,
            "Source": "stock"
        },
        {
            "Title": "Cybertech Systems Reports Mixed Q2 Results with Revenue Growth but Lower EBITDA",
            "Summary": "Cybertech Systems and Software reported Q2 consolidated net profit of 87 million rupees, up from 82 million rupees in the previous quarter. Revenue increased to 588 million rupees from 582 million rupees quarter-on-quarter. However, EBITDA declined to 46 million rupees from 49 million rupees, while EBITDA margin compressed to 7.84% from 8.48% in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762395318106,
            "Source": "earnings"
        },
        {
            "Title": "Cybertech Systems Reports No Deviation in Preferential Issue Fund Utilization",
            "Summary": "Cybertech Systems and Software Limited confirmed no deviation or variation in the use of proceeds from its preferential issue of equity shares for the quarter ended September 30, 2025. The company raised Rs. 40.27 crores through the preferential equity issue, with funds allocated for expanding existing business activities, general corporate purposes, investment in subsidiaries, and financing future growth opportunities including acquisitions. The company filed this confirmation pursuant to SEBI listing regulations, with both the Audit Committee and auditors providing no adverse comments on the fund utilization.",
            "Sentiment": "neutral",
            "PublishDate": 1762376057295,
            "Source": "corporate_action"
        },
        {
            "Title": "CyberTech Systems Approves Special Interim Dividend of Rs. 20 Per Share",
            "Summary": "CyberTech Systems and Software Limited's Board of Directors approved unaudited financial results for the quarter and half year ended September 30, 2025. The company declared a special interim dividend of Rs. 20 per equity share (face value Rs. 10) for FY 2025-26, resulting in an outflow of Rs. 6,226.12 lakhs. The consolidated results include three subsidiaries: CyberTech Systems and Software Inc. USA, Spatialtics LLC USA, and CyberTech Systems and Software Canada Inc. The company operates in a single reportable business segment of Information Technology Services. The Board meeting was held on November 5, 2025, and the financial results were reviewed by the Audit Committee and audited by Lodha Co. LLP.",
            "Sentiment": "positive",
            "PublishDate": 1762371254343,
            "Source": "earnings"
        },
        {
            "Title": "Cybertech Systems And Software Declares ₹20 Special Dividend Per Share for 30th Anniversary",
            "Summary": "Cybertech Systems And Software's board has declared a special dividend of ₹20 per share to celebrate the company's 30-year milestone. The total dividend payout amounts to ₹62.26 crores, with October 6, 2025 set as the record date for eligibility.",
            "Sentiment": "positive",
            "PublishDate": 1759133264064,
            "Source": "corporate_action"
        },
        {
            "Title": "CyberTech Systems Schedules Board Meeting to Consider Special Interim Dividend for FY 2025-26",
            "Summary": "CyberTech Systems and Software Limited has scheduled a Board of Directors meeting for September 29, 2025, to consider and approve a special interim dividend for the financial year 2025-26. The record date for the dividend, if declared, is set for October 6, 2025. The company has also closed the trading window for designated persons until October 1, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758629567416,
            "Source": "corporate_action"
        },
        {
            "Title": "Leela Ramani Sarita Kumar Appointed as Director with Digital Signature Authorization",
            "Summary": "Leela Ramani Sarita Kumar has been appointed as a director, with the appointment evidenced by a digital signature on an official document dated August 23, 2025. The document contains various regulatory references including SEBI LODR Regulations 2015 and multiple MCA circulars from 2020-2024. The filing includes details about Cybertech Systems and Software Limited's 30th Annual General Meeting scheduled for September 29, 2025, to be conducted via video conferencing. The document also contains information about e-voting procedures for shareholders and various administrative notices related to shareholder communications and dividend claims.",
            "Sentiment": "neutral",
            "PublishDate": 1755968566274,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cybertech Pursues Long-Term Growth Strategy in Cloud and Geospatial Solutions Amid Demand Headwinds",
            "Summary": "Cybertech is focusing on long-term growth opportunities in cloud SAP and geospatial solutions. The company's strategy involves building strategic technology alliances, leveraging AI-driven changes, and capitalizing on public sector digitization initiatives. However, the company is currently facing short-term demand challenges in its business environment.",
            "Sentiment": "neutral",
            "PublishDate": 1753449890382,
            "Source": "stock"
        },
        {
            "Title": "CyberTech Systems Reports Q1FY26 Revenue Growth of 4.9% YoY to ₹652.4 Million",
            "Summary": "CyberTech Systems and Software Limited reported Q1FY26 revenue of ₹652.4 million, representing a 4.9% year-over-year increase from ₹622.2 million in Q1FY25, though down 2.4% quarter-over-quarter from ₹668.3 million. Net profit improved 10.2% year-over-year to ₹81.7 million with a margin of 12.5%. Operating revenue grew modestly by 0.5% year-over-year to ₹581.9 million but declined 5.4% quarter-over-quarter. The company confirmed no deviation in the use of proceeds from its December 2023 preferential equity issue that raised ₹40.27 crores, with unutilized funds temporarily held in bank fixed deposits. The funds are intended for business expansion, general corporate purposes, and potential acquisitions. CyberTech maintains 80 active clients with the US market contributing 99% of operating revenue and the technology sector representing 70% of revenue. The company has 549 employees and continues focusing on AI-led transformation, data-driven solutions, and cloud architectures through partnerships with Esri, Microsoft, and SAP.",
            "Sentiment": "positive",
            "PublishDate": 1753441725991,
            "Source": "corporate_action"
        },
        {
            "Title": "CyberTech Systems Reports Q1 FY2025-26 Results and Approves USD 5 Million Investment for Microsoft Partnership",
            "Summary": "CyberTech Systems and Software Limited announced its unaudited financial results for the quarter ended June 30, 2025. On a consolidated basis, the company reported revenue from operations of ₹5,819.41 lakhs compared to ₹5,787.85 lakhs in the same quarter last year. Consolidated profit for the period stood at ₹817.34 lakhs versus ₹735.87 lakhs in the previous year quarter. Basic earnings per share increased to ₹2.63 from ₹2.36 year-over-year. The Board of Directors approved a USD 5 million investment in its wholly-owned US subsidiary, CyberTech Systems and Software Inc., USA, to establish a partnership with Microsoft focused on building and scaling Azure ArcGIS Geospatial Cloud solutions with backing from Esri. This investment will be funded from proceeds of a preferential allotment approved by shareholders in November 2023 and will be made in one or more tranches.",
            "Sentiment": "positive",
            "PublishDate": 1753372207652,
            "Source": "earnings"
        },
        {
            "Title": "CyberTech Systems and Software Reports Q4 Results and Dividend",
            "Summary": "CyberTech Systems and Software announced its Q4 financial results and a dividend recommendation. The company's Q4 revenue increased to 614.9 million rupees from 586 million rupees in the previous quarter. However, EBIT decreased to 38.7 million rupees from 72 million rupees, with EBIT margin declining to 11.18% from 12.31%. Consolidated net profit rose slightly to 96 million rupees from 90 million rupees. The company also recommended a dividend of 4 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1746550336000,
            "Source": "result"
        },
        {
            "Title": "CyberTech Systems and Software Reports Q3 Financial Results",
            "Summary": "CyberTech Systems and Software has announced its Q3 consolidated financial results. The company reported a net profit of 90 million rupees, slightly up from 89.4 million rupees in the previous quarter. Revenue for Q3 stood at 586 million rupees, compared to 580 million rupees in the previous quarter, showing a marginal increase.",
            "Sentiment": "neutral",
            "PublishDate": 1737731786000,
            "Source": "earnings"
        },
        {
            "Title": "CyberTech Systems and Software Reports Q2 Revenue",
            "Summary": "CyberTech Systems and Software has reported its Q2 revenue as 579.5 million rupees, compared to 579 million rupees in the previous quarter, showing a slight increase quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1729698049000,
            "Source": "result"
        },
        {
            "Title": "CyberTech Systems and Software Reports Q2 Profit Increase",
            "Summary": "CyberTech Systems and Software has reported a consolidated net profit of 89.4 million rupees for the second quarter, up from 74 million rupees in the previous quarter. This represents a quarter-over-quarter increase in profitability for the company.",
            "Sentiment": "positive",
            "PublishDate": 1729697907000,
            "Source": "result"
        }
    ]
}