{
    "Symbol": "CYIENTDLM",
    "ISIN": "INE055S01018",
    "News": [
        {
            "Title": "Cyient DLM to Participate in Axis Capital Conference",
            "Summary": "Cyient DLM Limited will participate in Advantage India - Axis Capital's Flagship India Conference on February 11, 2026, in Mumbai with multiple investor meetings scheduled.",
            "Sentiment": "neutral",
            "PublishDate": 1770608817705,
            "Source": "stocks"
        },
        {
            "Title": "Cyient DLM seeks shareholder nod for IPO fund reallocation",
            "Summary": "Cyient DLM Limited proposes to reallocate Rs. 36.85 crores from capital expenditure to working capital requirements through postal ballot voting, citing market shifts and business growth needs.",
            "Sentiment": "neutral",
            "PublishDate": 1770387554619,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nippon India MF Reduces Stake in Cyient DLM",
            "Summary": "Nippon India Mutual Fund sold 75,000 shares of Cyient DLM Limited, reducing its holding from 6.49% to 6.39% through open market transactions between January 21-29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769920533353,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cyient DLM Gets Accumulate Rating with ₹418 Target",
            "Summary": "Prabhudas Lilladher maintains Accumulate rating on Cyient DLM with revised target of ₹418, citing margin expansion and diversified growth prospects across multiple segments including aerospace and defense.",
            "Sentiment": "positive",
            "PublishDate": 1768982659326,
            "Source": "stocks"
        },
        {
            "Title": "Kotak cuts Cyient DLM target to ₹385",
            "Summary": "Kotak Securities maintains 'reduce' rating on Cyient DLM while lowering target price to ₹385, reflecting cautious outlook on the engineering services company's prospects.",
            "Sentiment": "negative",
            "PublishDate": 1768967388654,
            "Source": "stocks"
        },
        {
            "Title": "Cyient DLM Secures ₹387 Cr Multi-Sector Contracts",
            "Summary": "Cyient DLM announces new contracts worth ₹387 crores across medical, industrial, aerospace, and mobility sectors, with expectations of increased volume in Q4.",
            "Sentiment": "positive",
            "PublishDate": 1768923535166,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cyient DLM Q3FY26 Results: Revenue Falls 32% YoY",
            "Summary": "Cyient DLM reported consolidated revenue of ₹3,033.47 million for Q3FY26, down 32% from ₹4,442.36 million in Q3FY25. Net profit declined to ₹112.33 million from ₹109.91 million YoY.",
            "Sentiment": "negative",
            "PublishDate": 1768907617679,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cyient DLM Shareholders Approve Board Appointments",
            "Summary": "Cyient DLM Limited shareholders approved four special resolutions through postal ballot for appointment and re-appointment of independent directors with strong majority support.",
            "Sentiment": "positive",
            "PublishDate": 1768218418251,
            "Source": "stocks"
        },
        {
            "Title": "Cyient DLM Shareholders Approve Board Changes",
            "Summary": "Cyient DLM Limited shareholders approved four special resolutions through postal ballot, including appointment of two new independent directors and re-appointment of two existing directors for second terms.",
            "Sentiment": "positive",
            "PublishDate": 1768218246502,
            "Source": "stocks"
        },
        {
            "Title": "Cyient DLM Seeks Shareholder Approval for Director Appointments",
            "Summary": "Cyient DLM Limited has issued a postal ballot notice seeking member approval for appointment of two new independent directors and re-appointment of two existing directors for second terms.",
            "Sentiment": "neutral",
            "PublishDate": 1765547546352,
            "Source": "stocks"
        },
        {
            "Title": "Cyient DLM Appoints Former Defence Secretary Giridhar Aramane as Independent Director",
            "Summary": "Cyient DLM Limited's Board approved the appointment of Mr. Giridhar Aramane (DIN: 00483130) as Non-Executive Independent Director for a three-year term on 26 November 2025, subject to shareholder approval. Aramane, a retired Indian Administrative Service officer who served as Defence Secretary until 31 October 2024, brings 32 years of government experience to the company's board.",
            "Sentiment": "positive",
            "PublishDate": 1764166032404,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cyient DLM Reports No Material Deviation in IPO Fund Utilization for Q2 FY2026",
            "Summary": "Cyient DLM Limited submitted its monitoring agency report for the quarter ended September 30, 2025, prepared by ICRA Limited. The report confirms no material deviation from the objects of the IPO issue, with fund utilization aligned with stated objectives. The company raised INR 700 crore through its IPO in June 2023, with net proceeds of INR 663.154 crore after lower-than-estimated issue expenses. Out of INR 291.090 crore allocated for incremental working capital requirements, INR 286.867 crore has been utilized, with INR 8.223 crore remaining unutilized. The company has deployed INR 45.681 crore in fixed deposits and bank accounts, earning returns of 6.35%. There is a 6-month delay in completing the working capital funding object due to alignment with working capital cycle requirements, while other objectives including capital expenditure funding, debt repayment, and inorganic growth remain on schedule.",
            "Sentiment": "neutral",
            "PublishDate": 1762311383409,
            "Source": "corporate_action"
        },
        {
            "Title": "Minister M.B. Patil Visits Cyient DLM's Mysuru Facility, Praises Manufacturing Operations",
            "Summary": "Minister M.B. Patil visited Cyient DLM's facility in Mysuru and praised the company's advanced design and manufacturing capabilities for safety fields. The visit coincided with the graduation of the first batch from the 'Kaushal' skilling program conducted in partnership with Boeing.",
            "Sentiment": "positive",
            "PublishDate": 1761813498863,
            "Source": "stock"
        },
        {
            "Title": "Cyient DLM Limited Updates Senior Management Team Structure",
            "Summary": "Cyient DLM Limited announced updates to its Senior Managerial Personnel following a Board Meeting. The company's current senior management team includes Kaushal Jadia as Chief Technology Officer and Mujeeb Rahiman as Head of Operations. The information has been made available on the company's website at www.cyientdlm.com.",
            "Sentiment": "neutral",
            "PublishDate": 1761309265598,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cyient DLM Appoints R M Subramanian as Chief Financial Officer",
            "Summary": "Cyient DLM has appointed R M Subramanian as its new Chief Financial Officer. Subramanian previously served as Group CFO at Avalon Technologies.",
            "Sentiment": "positive",
            "PublishDate": 1761290920724,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cyient DLM Reports Strong Order Intake of Rs 500 Crores in Q2FY26 with Double-Digit EBITDA Margins",
            "Summary": "Cyient DLM Limited reported order intake of nearly Rs 500 crores in Q2FY26 with a book-to-bill ratio of 1.6, exceeding management expectations of maintaining above 1.0. Revenue stood at Rs 310.6 crores, reflecting a 20% year-on-year decline. The company achieved double-digit EBITDA margins of 10% (Rs 31.2 crores) despite revenue degrowth, with margins expanding 100 basis points sequentially and 192 basis points year-on-year. Order backlog increased to Rs 2,291 crores. The company secured new contracts including a build-to-spec order from a Japanese electric vertical take-off and landing company and won business from an automotive client specializing in EV charging solutions. Management expects year-on-year growth to resume from Q4FY26 and anticipates book-to-bill ratio of 1.4-1.5 for the full year. The revenue decline was attributed to the completion of one large defense order, while other business segments showed growth.",
            "Sentiment": "positive",
            "PublishDate": 1761040257721,
            "Source": "earnings"
        },
        {
            "Title": "Cyient DLM Secures ₹4,977 Million in New Orders, Plans EV and MedTech Expansion",
            "Summary": "Cyient DLM has secured new orders worth ₹4,977 million. The company is focusing on expanding its presence in electric vehicle (EV) and medical technology (MedTech) sectors through mergers and acquisitions. These M&A efforts are aimed at establishing global leadership in electronics design.",
            "Sentiment": "positive",
            "PublishDate": 1760456137772,
            "Source": "order&deals"
        },
        {
            "Title": "Cyient DLM Reports 130% YOY Growth in Order Intake for H1",
            "Summary": "Cyient DLM reported a 130% year-over-year growth in order intake for the first half. Company executives highlighted ongoing improvements in capabilities and customer base, with expectations for future growth driven by advanced deals.",
            "Sentiment": "positive",
            "PublishDate": 1760453906991,
            "Source": "stock"
        },
        {
            "Title": "Cyient DLM Reports ₹195.75 Million Gain from Fair Valuation of Earnout Liability",
            "Summary": "Cyient DLM recorded a gain of ₹195.75 million as other income from the fair valuation of earnout liability. This accounting adjustment contributed positively to the company's financial results.",
            "Sentiment": "positive",
            "PublishDate": 1760445452099,
            "Source": "stock"
        },
        {
            "Title": "Cyient DLM Appoints Dr. Ganesh Natarajan as Independent Director for Three-Year Term",
            "Summary": "Cyient DLM Limited appointed Dr. Ganesh Natarajan as Independent Director for a three-year term effective October 14, 2025. The appointment was approved by the Board following a recommendation from the Nomination and Remuneration Committee and is subject to shareholder approval. Dr. Natarajan serves as Chairman of 5F World, GTT Data Solutions, EPPS, Honeywell Automation India, and Lighthouse Communities. He previously led the growth of APTECH and Zensar, has authored several books, and has chaired NASSCOM and other industry bodies. The company confirmed that Dr. Natarajan is not related to any directors, key managerial personnel, or promoters of the company, and is not debarred from holding directorship by any regulatory authority.",
            "Sentiment": "positive",
            "PublishDate": 1760441619812,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cyient DLM Reports Mixed Q2 Results with Higher Profit Margin Despite Revenue Decline",
            "Summary": "Cyient DLM reported quarterly results showing EBITDA of 312 million rupees compared to 316 million rupees in the same period last year. The company's EBITDA margin improved to 10.04% from 8.12% year-over-year. Consolidated net profit increased significantly to 321.45 million rupees from 154.5 million rupees in the previous year. However, revenue declined to 3.11 billion rupees from 3.89 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1760439579038,
            "Source": "earnings"
        },
        {
            "Title": "Cyient DLM Shareholders Approve New Managing Director and Age Waiver for Director",
            "Summary": "Cyient DLM Limited announced that shareholders approved two resolutions through postal ballot. The first resolution appointed Mr. Rajendra Velagapudi as Managing Director and Chief Executive Officer, which passed with 99.95% votes in favor. The second resolution approved the continuation of Mr. B.V.R. Mohan Reddy as Non-Executive Director after attaining age 75, receiving 99.01% approval. The voting was conducted through remote e-voting from September 11 to October 10, 2025, with 109,523 shareholders on record. Both resolutions received overwhelming shareholder support with minimal opposition.",
            "Sentiment": "positive",
            "PublishDate": 1760184989452,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cyient DLM Schedules Investor Meetings and Factory Visits for September 2025",
            "Summary": "Cyient DLM Limited has scheduled two investor group meetings and factory visits on September 24 and 26, 2025. The first meeting on September 24 is with Wellington Team & CLSA, while the second on September 26 involves representatives from various mutual funds and financial institutions including Axis MF, Bandhan MF, HDFC MF, ICICI MF, Kotak, SBI MF, and others. Both meetings will be conducted in physical mode and will include company representation from MD & CEO Rajendra Velagapudi, CFO Shrinivas Kulkarni, and AVP Suresh Narayan. The company has clarified that no unpublished price sensitive information will be shared during these meetings.",
            "Sentiment": "neutral",
            "PublishDate": 1758098857060,
            "Source": "stock"
        },
        {
            "Title": "Cyient DLM Reports Record Order Intake of INR 515 Crores in Q1 FY26, Revenue Grows 8% YoY",
            "Summary": "Cyient DLM Limited reported quarterly revenue of INR 2,784 million, representing 8% year-on-year growth. The company achieved record order intake of INR 515 crores, the highest in 8 quarters, with a book-to-bill ratio of approximately 2. EBITDA grew 25.3% to INR 251 million with margins improving 125 basis points to 9%. The company generated positive free cash flow of INR 80 crores for the third consecutive quarter. Order backlog increased to INR 2,132 crores, with nearly 50% of new orders executable in the current year. Revenue growth was impacted by completion of a large customer order and supply chain disruptions due to Middle East conflict affecting delivery schedules. The Board appointed Rajendra Velagapudi as CEO in addition to his Managing Director role. Management expressed confidence in maintaining book-to-bill ratio above 1 and achieving double-digit EBITDA margins going forward. The company is benefiting from China Plus One trends and seeing increased RFQs from US customers seeking dual sourcing options.",
            "Sentiment": "positive",
            "PublishDate": 1753424406654,
            "Source": "earnings"
        },
        {
            "Title": "Cyient DLM Shares Drop 8% as Quarterly Net Profit Falls 30% Despite Revenue Growth",
            "Summary": "Cyient DLM Ltd. shares fell over 8% following the company's quarterly results announcement. The design-led manufacturing firm reported a consolidated net profit of Rs 7.5 crore for the April-June quarter, down nearly 30% from Rs 10.6 crore in the same period last year. Revenue grew 8% year-on-year to Rs 278 crore, though this fell short of analyst expectations of Rs 290 crore. The company attributed the profit decline to an unfavorable revenue mix and elevated input costs. EBITDA increased 25% to Rs 25 crore, beating street estimates, with margins improving to 9% from 7.8%. Cyient DLM noted that the completion of a large order in the previous fiscal year impacted revenue growth, while contributions from recent mergers and acquisitions provided some offset. The company expressed a positive outlook for the remainder of the fiscal year, citing a robust order book and healthy pipeline of opportunities.",
            "Sentiment": "negative",
            "PublishDate": 1753245613859,
            "Source": "earnings"
        },
        {
            "Title": "Cyient DLM Limited Approves Q1 2025 Results, Initiates Postal Ballot for New Managing Director",
            "Summary": "Cyient DLM Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of ₹2,784.27 million compared to ₹2,578.85 million in the same quarter last year. Net profit for the quarter was ₹74.63 million versus ₹105.96 million in the previous year quarter. The Board initiated a postal ballot to seek shareholder approval for appointing Rajendra Velagapudi as Managing Director and Chief Executive Director. Additionally, the company reconstituted its Nomination and Remuneration Committee and Stakeholder Relationship Committee with new member compositions. The company allotted 58,272 equity shares during the quarter under its Restricted Stock Unit Plan.",
            "Sentiment": "neutral",
            "PublishDate": 1753183032130,
            "Source": "earnings"
        },
        {
            "Title": "Cyient DLM: Q4 Results Lead to Downgrade and Target Price Cut",
            "Summary": "Cyient DLM's defense segment was impacted by the completion of a domestic client contract, with the order book declining 12% YoY to Rs 19 billion. The company expects a robust orderbook from Q2 FY26, mainly from international clients. New contracts with Boeing Global Services and Deutsche Aircraft, along with a new industrial segment client, are expected to drive growth.",
            "Sentiment": "neutral",
            "PublishDate": 1745493913000,
            "Source": "result"
        },
        {
            "Title": "Cyient DLM: Q4 PAT Jumps 36.5% YoY, EBITDA Margin Expands",
            "Summary": "Cyient DLM reported a 36.5% YoY increase in Q4 FY25 PAT to Rs 32 crore. Revenue grew 18.3% YoY to Rs 428 crore. EBITDA margin improved by 290 basis points to 13.4%. PAT margin reached a 12-quarter high of 7.3%. Order backlog stands at Rs 1,906.1 crore.",
            "Sentiment": "positive",
            "PublishDate": 1745379214000,
            "Source": "earnings"
        },
        {
            "Title": "Cyient DLM Reports Q4 FY2023 Financial Results",
            "Summary": "Cyient DLM, an Indian technology company, has announced its financial results for the fourth quarter of fiscal year 2023. The company reported a net profit of 349 million rupees, showing significant growth compared to 227 million rupees in the same quarter last year and 155.8 million rupees in the previous quarter. However, revenue for Q4 decreased to 3.4 billion rupees from 3.62 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1745367727000,
            "Source": "default"
        },
        {
            "Title": "Cyient DLM: Q4 Profit Soars 36.5% on Strong Revenue Growth",
            "Summary": "Cyient DLM reported a 36.5% YoY increase in Q4 net profit to ₹31 crore. Revenue rose 18.3% to ₹428 crore, driven by aerospace and defense demand. EBITDA margin expanded to 13.4%. Order backlog stood at ₹1,906 crore. The company is optimistic about FY2026 despite a slight decline in standalone revenue.",
            "Sentiment": "positive",
            "PublishDate": 1745325532000,
            "Source": "earnings"
        },
        {
            "Title": "CYIENT DLM Reports Q4 Financial Results",
            "Summary": "CYIENT DLM has announced its Q4 financial results. The company's EBITDA increased to 575.6 million rupees from 380 million rupees year-over-year, with the EBITDA margin improving to 16.91% from 10.52%. Revenue decreased to 3.4 billion rupees from 3.62 billion rupees year-over-year. Net profit rose to 349 million rupees, up from 227 million rupees year-over-year and 155.8 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745322828000,
            "Source": "result"
        },
        {
            "Title": "Cyient Group and Deutsche Aircraft Expand Partnership for D328eco Cabin Management System",
            "Summary": "Cyient Group and Deutsche Aircraft have expanded their strategic partnership to collaborate on developing an advanced cabin management system for the D328eco aircraft. This partnership aims to enhance the capabilities and features of the aircraft's interior systems.",
            "Sentiment": "positive",
            "PublishDate": 1744285753000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cyient DLM Secures Long-Term Avionics Manufacturing Contract from Thales",
            "Summary": "Cyient DLM has been awarded a long-term contract for avionics manufacturing by Thales, a global technology leader. This agreement signifies a significant business opportunity for Cyient DLM in the aerospace and defense sector, potentially boosting its revenue and market position in avionics manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1739773925000,
            "Source": "order&deals"
        },
        {
            "Title": "Cyient DLM: Diversifies Beyond Aerospace with $1.5 Billion Pipeline",
            "Summary": "Cyient DLM is expanding into medical, rail, and automotive sectors while leveraging its aerospace expertise. The company reported a $1.5 billion order book last quarter, with strong demand across design and manufacturing. Q3 revenue grew 38.4% YoY to Rs 444 crore, but net profit fell 40.8% to Rs 10.9 crore. The current order book stands at Rs 2,142 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1739343598000,
            "Source": "earnings"
        },
        {
            "Title": "Cyient DLM Secures Production Contract with Boeing",
            "Summary": "Cyient DLM has been awarded a production contract by Boeing, a major player in the aerospace industry. This contract represents a significant business opportunity for Cyient DLM and potentially strengthens its position in the aerospace manufacturing sector.",
            "Sentiment": "positive",
            "PublishDate": 1739268155000,
            "Source": "order&deals"
        },
        {
            "Title": "Cyient DLM Enhances Education Infrastructure in Mysuru Schools",
            "Summary": "Cyient DLM has improved the educational infrastructure in two government schools located in Mysuru. This initiative demonstrates the company's commitment to corporate social responsibility and its focus on supporting education in local communities.",
            "Sentiment": "positive",
            "PublishDate": 1738640817000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cyient DLM: Shares Hit 52-Week Low on Weak Q3 Results",
            "Summary": "Cyient DLM shares plummeted 13.5% to a 52-week low of ₹516.00 on the BSE following weak Q3 results.",
            "Sentiment": "negative",
            "PublishDate": 1737523395000,
            "Source": "earnings"
        },
        {
            "Title": "Cyient DLM Reports Mixed Q3 Financial Results",
            "Summary": "Cyient DLM, an Indian technology company, has reported its financial results for the third quarter. The company's consolidated net profit decreased to 110 million rupees from 184 million rupees in the same quarter last year. However, revenue increased significantly to 4.44 billion rupees from 3.2 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1737505373000,
            "Source": "earnings"
        },
        {
            "Title": "Cyient DLM: Q3 Profit Falls 41%, Revenue Surges 38%",
            "Summary": "Cyient DLM reported a 40.8% YoY decrease in Q3 net profit to ₹10.9 crore, while revenue increased 38.4% to ₹444.2 crore. EBITDA dropped 6.21% to ₹27.2 crore. The company secured a new global client and maintains a robust pipeline exceeding $1 billion in total contract value. Segment-wise, defence grew 31% YoY, aerospace 14%, and medtech 156%. The acquisition of Altek boosted the industrial segment by 47%.",
            "Sentiment": "neutral",
            "PublishDate": 1737460552000,
            "Source": "earnings"
        },
        {
            "Title": "Cyient DLM Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Cyient DLM, a technology solutions company, has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 281 million rupees from 295 million rupees in the same quarter last year. Additionally, the EBITDA margin declined to 6.33% from 9.19% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1737456404000,
            "Source": "earnings"
        },
        {
            "Title": "Cyient DLM Reports Q3 Financial Results",
            "Summary": "Cyient DLM has announced its Q3 financial results. The company reported a consolidated net profit of 110 million rupees, down from 184 million rupees in the same quarter last year. However, revenue increased to 4.44 billion rupees from 3.2 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1737456397000,
            "Source": "earnings"
        },
        {
            "Title": "Cyient DLM and Arcedo Systems to Establish Solar Power Plant in Mysore",
            "Summary": "Cyient DLM and Arcedo Systems have signed a Memorandum of Understanding (MOU) to set up a 500 kWp solar power plant at Cyient DLM's facility in Mysore. This initiative demonstrates the company's commitment to sustainable energy solutions and environmental responsibility.",
            "Sentiment": "positive",
            "PublishDate": 1733295853000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cyient DLM Secures Long-Term Deal with Honeywell Aerospace",
            "Summary": "Cyient DLM has won a long-term contract with Honeywell Aerospace Technologies to provide aircraft cooling technology. This partnership signifies a significant business opportunity for Cyient DLM in the aerospace sector, potentially enhancing its position in the industry.",
            "Sentiment": "positive",
            "PublishDate": 1730876383000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cyient DLM Targets 30% Multi-Year CAGR",
            "Summary": "Cyient DLM has announced a 30% multi-year CAGR (Compound Annual Growth Rate) target. This growth projection is organic and does not include any potential inorganic growth through acquisitions or mergers. The company disclosed this information during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1729566098000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cyient DLM Projects Double-Digit Growth for Fiscal Year",
            "Summary": "Cyient DLM, during a conference call, expressed confidence in achieving double-digit growth for the current fiscal year. The company also indicated potential for further optimization in the second half of the year, which could lead to meeting or exceeding their target.",
            "Sentiment": "positive",
            "PublishDate": 1729565898000,
            "Source": "result"
        },
        {
            "Title": "Cyient DLM: Q2 Profit Up 6%, Revenue Surges 33%",
            "Summary": "Cyient DLM reported Q2 FY2025 net profit of ₹15.4 crore, up 5.5% YoY. Revenue rose 33.4% to ₹389.4 crore. EBITDA increased 34.2% to ₹31.4 crore. Defence segment grew 82% YoY, aerospace 20%. Industrial segment declined 55% due to demand drop from key customer. Company added two global clients in defence and oilfield services.",
            "Sentiment": "positive",
            "PublishDate": 1729511633000,
            "Source": "result"
        },
        {
            "Title": "Cyient DLM Reports Q2 Financial Results",
            "Summary": "Cyient DLM has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 increased to 317 million rupees, up from 236 million rupees in the same quarter last year. The EBITDA margin also saw a slight improvement, rising to 8.15% from 8.07% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729510293000,
            "Source": "result"
        },
        {
            "Title": "Cyient DLM Reports Strong Q2 Revenue Growth",
            "Summary": "Cyient DLM has announced its second quarter revenue results, reporting 3.9 billion rupees compared to 2.9 billion rupees in the same quarter last year, representing a significant year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729510273000,
            "Source": "result"
        },
        {
            "Title": "Cyient DLM Reports Q2 Net Profit Increase",
            "Summary": "Cyient DLM, an engineering and technology solutions company, has reported a net profit of 155.5 million rupees for the second quarter. This represents a year-over-year increase from 147 million rupees and a quarter-over-quarter increase from 107 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1729510260000,
            "Source": "result"
        },
        {
            "Title": "Cyient DLM: Exploring Further Acquisitions Post $29M Altek Deal",
            "Summary": "<p>Cyient DLM's CFO Shrinivas Kulkarni confirms <span class='positive'>ongoing talks</span> for more <span class='positive'>acquisitions</span> following the recent <b>$29.2 million</b> Altek Electronics deal. The Altek acquisition <span class='positive'>diversifies</span> Cyient's portfolio into <span class='neutral'>industrial and medical sectors</span>, expected to <span class='positive'>add $40 million to topline</span> and <b>$4 million to EBITDA</b>. The deal is funded <b>50%</b> from IPO proceeds and <b>50%</b> through debt.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728295608000,
            "Source": "corporate_action"
        }
    ]
}