{
    "Symbol": "CYIENT",
    "ISIN": "INE136B01020",
    "News": [
        {
            "Title": "Cyient Appoints Two Senior Leaders to Drive Growth",
            "Summary": "Cyient Limited announces key leadership appointments with Rajkumar Ravindranathan as Chief Growth Officer and Harjott Atrii as Chief Business Officer Strategic Initiatives to accelerate technology-driven growth.",
            "Sentiment": "positive",
            "PublishDate": 1770288073087,
            "Source": "stocks"
        },
        {
            "Title": "Cyient targets high single-digit growth in FY27",
            "Summary": "Cyient CEO outlines FY27 growth ambitions of high single-digit revenue growth, positioning FY26 as stabilisation year with semiconductor business expected to turn EBIT neutral by FY27.",
            "Sentiment": "positive",
            "PublishDate": 1769149437077,
            "Source": "stocks"
        },
        {
            "Title": "Cyient Maintains No Guidance Policy on Financial Performance",
            "Summary": "Cyient reaffirms its policy of not providing formal financial guidance, stating it does not share guidance or visibility for FY'27 during recent concall discussions.",
            "Sentiment": "neutral",
            "PublishDate": 1769137855045,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cyient Grants 1.95 Lakh Stock Options to Associates",
            "Summary": "Cyient Limited's Leadership, Nomination and Remuneration Committee approved the grant of 1,94,700 stock options to company associates across three employee stock option plans on January 22, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769081415363,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cyient Independent Director Matangi Gowrishankar Resigns",
            "Summary": "Ms. Matangi Gowrishankar resigned as Independent Director of Cyient Limited effective January 22, 2026, citing personal reasons after serving nearly 7 years on the board.",
            "Sentiment": "neutral",
            "PublishDate": 1769081150217,
            "Source": "stocks"
        },
        {
            "Title": "Cyient Q3FY26 Net Profit Drops 24% to ₹918 Cr",
            "Summary": "Cyient Limited reported Q3FY26 consolidated net profit of ₹918 cr, down 24.9% YoY. Revenue declined 4.0% to ₹18,485 cr. Company faced exceptional charges of ₹423 cr due to new labour codes implementation.",
            "Sentiment": "negative",
            "PublishDate": 1769080731737,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cyient Schedules NDR for January 27-28, 2026",
            "Summary": "Cyient Limited announces Non-Deal Road Show in Mumbai with CEO participation. Physical meeting scheduled for two days with no price sensitive information sharing.",
            "Sentiment": "neutral",
            "PublishDate": 1768818627688,
            "Source": "stocks"
        },
        {
            "Title": "Cyient Founder Dr. B.V.R. Mohan Reddy Wins Living Legend Award",
            "Summary": "Dr. B.V.R. Mohan Reddy, Founder Chairman of Cyient, received the prestigious Living Legend Award from Geospatial World for his transformative contribution to India's geospatial industry and global R&D leadership.",
            "Sentiment": "positive",
            "PublishDate": 1768374396160,
            "Source": "stocks"
        },
        {
            "Title": "Cyient Allots 12,442 Shares Under Stock Option Plans",
            "Summary": "Cyient Limited has allotted 12,442 equity shares to company associates through exercise of stock options under ASOP 2015 and ARSUS 2020 schemes on January 8, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767885928996,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cyient Board Meet on Jan 22 for Q3FY26 Results",
            "Summary": "Cyient Limited has scheduled a board meeting on January 22, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767006015879,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cyient Plans to Double Semiconductor Business by FY27",
            "Summary": "Cyient announces ambitious growth strategy to double its semiconductor business operations by FY27, signaling strong expansion plans in the semiconductor sector.",
            "Sentiment": "positive",
            "PublishDate": 1766031674392,
            "Source": "stocks"
        },
        {
            "Title": "Cyient Conference Call Transcript Available for Kinetic Deal",
            "Summary": "Cyient releases detailed conference call transcript discussing strategic rationale and financial details of $93 million Kinetic Technologies acquisition for semiconductor expansion.",
            "Sentiment": "positive",
            "PublishDate": 1765982159853,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cyient Strengthens Middle East Operations",
            "Summary": "Cyient enhances Middle East presence to drive intelligent engineering solutions across energy, utilities, transportation and connectivity sectors for regional growth.",
            "Sentiment": "positive",
            "PublishDate": 1765448371102,
            "Source": "stocks"
        },
        {
            "Title": "Cyient Expands Middle East Operations with ADGCE Acquisition",
            "Summary": "Cyient strengthens Middle East presence through strategic acquisition of Abu Dhabi Gulf Computer Est., targeting USD 200 billion energy sector opportunities across utilities, transportation, and connectivity sectors.",
            "Sentiment": "positive",
            "PublishDate": 1765448107465,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cyient Launches Network Modernization Customer Experience Center in Lisbon",
            "Summary": "Cyient Limited inaugurated a new Customer Experience Center in Lisbon, Portugal, featuring cutting-edge solutions including multi-vendor O-RAN integration, AI-powered network operations, and automated fiber network capabilities. The center serves as an innovation hub for customers and partners to experience intelligent network modernization solutions, expanding Cyient's global network of experience centers.",
            "Sentiment": "positive",
            "PublishDate": 1765269148209,
            "Source": "stock"
        },
        {
            "Title": "Navitas Semiconductor and Cyient Semiconductors Form Strategic Partnership to Accelerate GaN Technology Adoption in India",
            "Summary": "Navitas Semiconductor Corporation and Cyient Semiconductors Private Limited announced a strategic long-term partnership to advance GaN technology adoption in India and establish a complete end-to-end GaN ecosystem. The partnership will co-develop GaN products, digital and mixed signal ICs, and system modules targeting India's AI datacenters, electric mobility, performance computing, energy grid infrastructure, and industrial electrification markets while building a robust local supply chain to support the Make in India initiative.",
            "Sentiment": "positive",
            "PublishDate": 1765178413114,
            "Source": "stock"
        },
        {
            "Title": "Cyient Semiconductors Qualifies for ₹4,500-Crore SCL Mohali Modernization Contract",
            "Summary": "Cyient Semiconductors has been qualified for a pivotal contract to supply and qualify technology IPs for the ₹4,500-crore modernization initiative at Semi-Conductor Laboratory, Mohali, under India's Semiconductor Mission. The company will provide three foundational process technologies - RF-CMOS, BCD (HVLDMOS), and CMOS Image Sensor for SCL's enhanced 8-inch manufacturing line, supporting India's semiconductor self-reliance goals.",
            "Sentiment": "positive",
            "PublishDate": 1764916271341,
            "Source": "stock"
        },
        {
            "Title": "Cyient's Singapore Unit Secures Semiconductor Modernization Project Contract",
            "Summary": "Cyient's Singapore semiconductor unit has won a portion of a modernization project involving Tata Semiconductor Manufacturing and Applied Materials' Singapore unit. The contract represents a business development for Cyient in the semiconductor sector through its Singapore operations.",
            "Sentiment": "positive",
            "PublishDate": 1764906184921,
            "Source": "order&deals"
        },
        {
            "Title": "Cyient Allots 8,637 Equity Shares Upon Exercise of Stock Options",
            "Summary": "Cyient Limited has allotted 8,637 equity shares to company associates following the exercise of stock options under Plan ASOP 2015 and ARSUS 2020 schemes. The share allotment represents routine employee stock option exercises and has been communicated to BSE and NSE for regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1764591089107,
            "Source": "corporate_action"
        },
        {
            "Title": "Cyient Postpones Investor Day Scheduled for December 11, 2025",
            "Summary": "Cyient has delayed its Investor Day that was scheduled for December 11, 2025, citing ongoing strategic corporate efforts as the reason for postponement. The company maintains that its business outlook remains unchanged despite the delay in the investor presentation.",
            "Sentiment": "neutral",
            "PublishDate": 1764402347242,
            "Source": "stock"
        },
        {
            "Title": "Cyient and CNH Industrial Expand Strategic Partnership for Autonomous Construction Equipment",
            "Summary": "Cyient Limited and CNH Construction Equipment have reinforced their strategic partnership to advance autonomous solutions across multiple vehicle platforms, building on their successful collaboration over the past two and a half years including the Advanced Perception System for Wheel Loaders unveiled at Bauma exhibition. The expanded partnership will focus on scaling autonomous solutions across various vehicle segments to drive improvements in safety, efficiency, and operational productivity in construction equipment.",
            "Sentiment": "positive",
            "PublishDate": 1764228356346,
            "Source": "stock"
        },
        {
            "Title": "Cyient Semiconductors and Azimuth AI Launch India's First-Generation IP Powered Silicon Chip ARKA GKT-1",
            "Summary": "Azimuth AI and Cyient Semiconductors launched ARKA GKT-1, India's first-generation intelligent-power platform-on-a-chip designed for high-efficiency edge AI and smart energy applications, unveiled by Union Minister Ashwini Vaishnaw. The chip integrates multicore custom computing, advanced analog sensing, memory and intelligent power management into a single energy-efficient SoC targeting smart utilities, advanced metering, battery management, smart cities and industrial automation markets.",
            "Sentiment": "positive",
            "PublishDate": 1763371869805,
            "Source": "stock"
        },
        {
            "Title": "Cyient Foundation Launches AI Future Skills Center of Excellence in Nagaland",
            "Summary": "Cyient Foundation, in collaboration with SIDBI Swavalamban Foundation, established an AI Future Skills Center of Excellence at Nagaland Tool Room Training Centre, inaugurated by Union Finance Minister Nirmala Sitharaman. The center will train 200-240 youth annually in AI-integrated programs across domains like handloom handicraft, software coding, and robotics, with 75% of graduates projected to find employment or become self-employed within three months.",
            "Sentiment": "positive",
            "PublishDate": 1763309153122,
            "Source": "stock"
        },
        {
            "Title": "Cyient Seeks Shareholder Approval for Sunil Bhumralkar's Independent Director Appointment",
            "Summary": "Cyient has issued a postal ballot notice seeking member approval for appointing Sunil Bhumralkar as Non-Executive Independent Director for a 3-year term from September 19, 2025 to September 18, 2028. The remote e-voting period runs from November 15, 2025 to December 14, 2025, with results to be announced by December 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763147910322,
            "Source": "corporate_action"
        },
        {
            "Title": "Cyient Expects Stronger H2 FY26 Performance on Semiconductor Recovery and Large Contracts",
            "Summary": "Cyient anticipates improved performance in the second half of FY26, driven by a semiconductor sector rebound, large aerospace and electric vehicle contracts, and margin improvements from cost optimization initiatives. The company is focusing on AI integration and design-led manufacturing strategies for sustained global growth.",
            "Sentiment": "positive",
            "PublishDate": 1760639849354,
            "Source": "stock"
        },
        {
            "Title": "Cyient Ltd Reconstitutes Board Committees and Forms New Technology & Transformation Committee",
            "Summary": "Cyient Ltd reconstituted its Board Committees effective October 16, 2025, including the Audit Committee, Risk Management Committee, and Leadership, Nomination & Remuneration Committee. The company also established a new Technology & Transformation Committee. Sunil Bhumaralkar chairs both the Audit Committee and Risk Management Committee, while Matangi Gowrishankar leads the Leadership, Nomination & Remuneration Committee. Debjani Ghosh heads the newly formed Technology & Transformation Committee. The committees comprise a mix of independent directors and non-executive non-independent directors in various member positions.",
            "Sentiment": "neutral",
            "PublishDate": 1760615094876,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cyient Limited Reports Quarterly Results, Declares Rs. 16 Interim Dividend, and Announces Board Changes",
            "Summary": "Cyient Limited's Board approved unaudited financial results for the quarter and half year ended September 30, 2025. The company declared an interim dividend of Rs. 16 per equity share (320% on par value of Rs. 5 per share) and fixed a record date. Consolidated revenue from contracts with customers was Rs. 17,810 million for the quarter, compared to Rs. 18,491 million in the same quarter last year. Net profit attributable to shareholders was Rs. 1,275 million for the quarter versus Rs. 1,791 million in the previous year quarter. The company announced the resignation of Mr. Vivek Gour as Independent Director and reconstituted its Audit Committee, Risk Management Committee, and Leadership, Nomination and Remuneration Committee. The company has reorganized its business structure by creating a separate Semiconductors segment under Cyient Semiconductors Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1760612647297,
            "Source": "corporate_action"
        },
        {
            "Title": "Cyient Limited Shareholders Approve Appointment of Two Independent Directors and Director Age Extension",
            "Summary": "Cyient Limited announced that shareholders approved three special resolutions through a postal ballot process. The company appointed P.R. Ramesh as Non-Executive Independent Director, which received 90.67% approval from shareholders. Prof. Madan Pillutla was also appointed as Non-Executive Independent Director with 99.99% shareholder approval. Additionally, shareholders approved the continuation of B.V.R. Mohan Reddy as Non-Executive Non-Independent Director beyond age 75, receiving 97.92% support. The voting was conducted through remote e-voting process with 73.79% of total shares participating across all three resolutions. All resolutions were passed with the requisite majority from the company's shareholder base.",
            "Sentiment": "positive",
            "PublishDate": 1760103998454,
            "Source": "corporate_action"
        },
        {
            "Title": "Cyient Appoints Utkarsh Srivastav as Chief Marketing Officer",
            "Summary": "Cyient Limited appointed Utkarsh Srivastav as Chief Marketing Officer effective October 3, 2025. Srivastav brings over 18 years of B2B marketing leadership experience in technology and engineering services firms. He previously worked at L&T Technology Services where he led brand positioning initiatives and won several awards including Best Brand Experience Award and Best Use of Social Media Award. Prior to that, he spent 11 years at HCL Tech leading cloud and infrastructure marketing, CXO programs, and sports marketing partnerships with Manchester United and the Volvo Ocean Race. The appointment is part of senior management changes at the company.",
            "Sentiment": "positive",
            "PublishDate": 1759511974478,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cyient Completes Korea Branch Closure and Subsidiary Obtains MSME Registration",
            "Summary": "Cyient Limited has completed the closure of its branch office in Korea, following a previous announcement made on October 24, 2025. Additionally, Cyient Semiconductors Private Limited, a wholly-owned subsidiary of Cyient Limited, has obtained registration under the Micro, Small and Medium Enterprises Development Act, 2006. Both developments were communicated to stock exchanges on September 26, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758888212857,
            "Source": "stock"
        },
        {
            "Title": "Cyient Says New $100,000 H-1B Visa Fee Won't Impact FY26 Financials",
            "Summary": "Cyient stated that the US government's new $100,000 one-time fee for each H-1B visa petition, effective September 21, 2025, will not materially impact its FY26 financials. The company deployed only six employees on H-1B visas in the previous year. Several other IT service providers including Mphasis, Persistent Systems, Sasken Technologies, Firstsource Solutions, and Coforge also issued similar clarifications. The new policy stems from US President Donald Trump's weekend order restricting entry of certain non-immigrant workers. The fee will not apply to existing H-1B visas or petitions filed before September 21, 2025. US-listed shares of Infosys and Wipro had dropped up to 4% on Friday following the announcement, though subsequent clarifications provided some relief to the sector.",
            "Sentiment": "neutral",
            "PublishDate": 1758505307438,
            "Source": "stock"
        },
        {
            "Title": "Cyient Appoints Sunil R. Bhumralkar as Independent Director for 3-Year Term",
            "Summary": "Cyient Limited has appointed Mr. Sunil R. Bhumralkar as an Independent Director for a 3-year term effective September 19, 2025, subject to shareholder approval. The appointment was approved by the Board of Directors based on the recommendation of the Leadership, Nomination and Remuneration Committee. Bhumralkar brings over 38 years of professional experience in Assurance and Financial Accounting Advisory services with Big 4 accounting and auditing firms and is a Fellow Member of the Institute of Chartered Accountants of India. He is not related to any Directors, Key Managerial Personnel, Promoters or Promoter group of the Company.",
            "Sentiment": "positive",
            "PublishDate": 1758264359472,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cyient Semiconductors Partners with Anora to Expand Turnkey Test and Validation Solutions",
            "Summary": "Cyient Semiconductors announced a strategic partnership with Anora, a global provider of semiconductor test and validation services. The collaboration will deliver expertise across the semiconductor value chain, spanning architecture, design, silicon bring-up, qualification, and testing. The companies will establish a semiconductor validation and production test floor in Bangalore, India, featuring clean room capabilities and production equipment including probers, handlers, automated test equipment platforms, and thermal solutions. This facility will complement Anora's existing clean room facility in Allen, Texas. The partnership aims to provide customers with end-to-end solutions from concept to final silicon production, reducing hand-offs and accelerating time-to-market while minimizing inefficiencies from working with multiple service providers.",
            "Sentiment": "positive",
            "PublishDate": 1758006413141,
            "Source": "order&deals"
        },
        {
            "Title": "Cyient Foundation Establishes AI Labs in 50 Government Schools in Andhra Pradesh",
            "Summary": "Cyient Foundation has launched AI labs across 50 government schools in Andhra Pradesh. The initiative aims to provide future-ready skills training to 25,000 students through these artificial intelligence laboratories.",
            "Sentiment": "positive",
            "PublishDate": 1756481242036,
            "Source": "stock"
        },
        {
            "Title": "NCLT Admits Insolvency Petition for Infotech HAL Limited, Joint Venture of Cyient and HAL",
            "Summary": "The National Company Law Tribunal Bengaluru bench has admitted a petition for corporate insolvency resolution process of Infotech HAL Limited, a 50:50 joint venture between Cyient Limited and HAL. The NCLT ordered commencement of the insolvency resolution process under Section 10 of the Insolvency and Bankruptcy Code, 2016, and appointed Mr. Vasudevan Gopu as the Interim Resolution Professional. The petition was filed under CP (IB) No. 99/BB/2024.",
            "Sentiment": "negative",
            "PublishDate": 1756379296838,
            "Source": "corporate_action"
        },
        {
            "Title": "Cyient Limited Appoints Two Independent Directors for Three-Year Terms",
            "Summary": "Cyient Limited's Board of Directors has approved the appointment of P.R. Ramesh and Madan Pillutla as Independent Directors for a three-year term effective from August 18, 2025. The appointments are subject to shareholder approval. P.R. Ramesh brings over 40 years of professional experience and was Chairman of Deloitte India and a member of Deloitte Global Board. He is a Fellow Member of the Institute of Chartered Accountants of India. Madan Pillutla served on the faculty of London Business School for twenty-two years in various leadership positions including Deputy Dean of Faculty. He currently serves as Dean & Professor of Organizational Behaviour at the Indian School of Business. Both appointees are not related to any existing Directors, Key Managerial Personnel, or Promoter group of the company.",
            "Sentiment": "positive",
            "PublishDate": 1755537503897,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cyient Receives Government Approval for Sukamal Banerjee's Appointment as CEO and Executive Director",
            "Summary": "Cyient Limited received approval from the Ministry of Corporate Affairs for the appointment of Sukamal Banerjee as Executive Director and Chief Executive Officer. The approval covers a five-year term from February 19, 2025 to February 18, 2030. The ministry conveyed its approval through a letter dated August 12, 2025, under section 196 of the Companies Act, 2013. This follows an earlier announcement made by the company on February 19, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755013052311,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cyient Semiconductors Partners with GlobalFoundries as Authorized Channel Partner",
            "Summary": "Cyient Semiconductors Private Limited announced a strategic Channel Partner Agreement with GlobalFoundries, making it an authorized reseller of GF's semiconductor manufacturing services and technologies. Under the partnership, Cyient Semiconductors will provide companies with fabrication access, technical consultation, design enablement, assembly, testing, and other value-added services to accelerate innovation and reduce time-to-market. The collaboration aims to expand access to GlobalFoundries' advanced semiconductor manufacturing capabilities and high-performance, energy-efficient process technologies. Cyient Semiconductors CEO Suman Narayan stated the partnership positions the company to serve fabless companies with world-class foundry capabilities, particularly in automotive, industrial, medical, and communication sectors. GlobalFoundries' Chief Customer Officer Samuel Vicari highlighted that the partnership aligns with GF's mission to expand strategic alliances and deliver innovative technologies for essential industries globally. A dedicated team has been established to ensure efficient coordination, technical support, and service delivery for the transition from concept to production.",
            "Sentiment": "positive",
            "PublishDate": 1754551186007,
            "Source": "order&deals"
        },
        {
            "Title": "Cyient Semiconductors Partners with GlobalFoundries as Authorized Reseller",
            "Summary": "Cyient Semiconductors has formed a strategic partnership with GlobalFoundries and has become an authorized reseller for GlobalFoundries' semiconductor manufacturing services and technologies.",
            "Sentiment": "positive",
            "PublishDate": 1754550371727,
            "Source": "stock"
        },
        {
            "Title": "Cyient and Zinier Form Strategic Partnership for Field Service Transformation",
            "Summary": "Cyient and Zinier have announced a strategic partnership aimed at accelerating field service transformation. The collaboration between the two companies focuses on advancing field service operations and capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1753969097282,
            "Source": "order&deals"
        },
        {
            "Title": "Cyient Partners With Zinier to Accelerate Field Services Transformation",
            "Summary": "Cyient has entered into a partnership with Zinier aimed at accelerating changes and improvements in field services operations. The collaboration is designed to enhance the speed of transformation in field service delivery.",
            "Sentiment": "positive",
            "PublishDate": 1753951693086,
            "Source": "stock"
        },
        {
            "Title": "Cyient Reports Q1 FY26 Results with Revenue Growth and Semiconductor Business Carve-out",
            "Summary": "Cyient Limited reported Q1 FY26 revenue of $162.7 million (INR 1,393 crores), representing 0.9% quarter-over-quarter growth and 1% year-over-year growth in US dollar terms. The company completed the carve-out of its Semiconductor business into a separate subsidiary, leading to revised reporting segments. The DET (Design, Engineering & Technology) segment, excluding semiconductors, showed EBIT margins of 12%, down 63 basis points quarter-over-quarter due to wage hikes. The company added 14 new client logos and secured notable deals including a $23 million contract with an APAC communication service provider and partnerships with Vodafone for AI-powered network solutions. Transportation & Mobility segment grew 2.5% quarter-over-quarter and 7.3% year-over-year, while Networks & Infrastructure declined 2.9% quarter-over-quarter. The company maintains its medium-term target of 15% EBIT margins for the DET business and continues its no-guidance policy. Cash position strengthened by INR 262 crores quarter-over-quarter with strong free cash flow conversion of 70%.",
            "Sentiment": "neutral",
            "PublishDate": 1753860080018,
            "Source": "earnings"
        },
        {
            "Title": "Cyient Launches New Semiconductor Subsidiary in Singapore",
            "Summary": "Cyient has established a new subsidiary called Cyient Semiconductors in Singapore. The company has expanded its operations by creating this specialized semiconductor-focused entity in the Southeast Asian market.",
            "Sentiment": "positive",
            "PublishDate": 1753789170271,
            "Source": "stock"
        },
        {
            "Title": "Cyient Semiconductors Establishes New Singapore Entity for Engineering Design and Research",
            "Summary": "Cyient Semiconductors Private Limited, a wholly owned subsidiary of Cyient Ltd, has incorporated a new entity called 'Cyient Semiconductors Singapore Pte. Limited' in Singapore. The new subsidiary will focus on engineering design, consultancy activities, and research and experimental development in the semiconductor industry. Cyient Semiconductors Private Limited holds 100% shareholding in the Singapore entity through cash subscription to share capital. The newly incorporated company currently has no turnover or size metrics as it is a fresh incorporation.",
            "Sentiment": "positive",
            "PublishDate": 1753788442412,
            "Source": "corporate_action"
        },
        {
            "Title": "Cyient Europe Limited Establishes Branch Operations in Italy",
            "Summary": "Cyient Europe Limited, a wholly owned subsidiary of Cyient, has established a branch in Italy. This expansion represents the company's move to strengthen its European presence through its subsidiary operations.",
            "Sentiment": "positive",
            "PublishDate": 1753708172420,
            "Source": "stock"
        },
        {
            "Title": "Cyient Shares Rise 5% Despite 10% Drop in Quarterly Profit, Emkay Cuts Target Price",
            "Summary": "Cyient's share price increased nearly 5% to Rs 1,301.70 despite reporting weak quarterly results. The company's consolidated net profit declined 10% sequentially to Rs 154 crore, while revenue fell 10.3% to Rs 1,712 crore. EBITDA dropped 31% to Rs 163 crore and profit margin decreased 280 basis points to 9.5%. Following these results, Emkay Global Research reduced earnings estimates by 5-9%, maintained a 'Reduced' rating, and lowered the target price to Rs 1,230. The stock has declined 34.15% over 12 months and 32.08% year-to-date. Trading volume reached 10 times the 30-day average. Among 24 analysts covering the stock, eight recommend 'buy', nine suggest 'hold', and seven advise 'sell', with an average consensus target implying 6.8% upside.",
            "Sentiment": "negative",
            "PublishDate": 1753430120172,
            "Source": "stock"
        },
        {
            "Title": "Cyient Plans Growth Strategy Through Semiconductor Carve-Out and AI-Led Expansion",
            "Summary": "Cyient is targeting robust growth through a semiconductor business carve-out, AI-led deal wins, and expansion across engineering, networks, and digital content sectors. The company is focusing on deep industry expansion as part of its strategic growth initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1753369972564,
            "Source": "stock"
        },
        {
            "Title": "Cyient Executive Highlights Strong Financial Position for Portfolio Growth",
            "Summary": "A co-executive at Cyient stated that the company's strong cash position and profitability are boosting confidence for growth across its diverse portfolio sectors.",
            "Sentiment": "positive",
            "PublishDate": 1753369136364,
            "Source": "stock"
        },
        {
            "Title": "Cyient Adds 14 New Clients in Q1 FY26, Reports Recovery Signs",
            "Summary": "Cyient gained 14 new clients across various industries during Q1 FY26, indicating a promising pipeline ahead. Company executives report strong signs of recovery with key deal wins and new client acquisitions. Management expressed optimism about future growth, citing strong leadership, solid fundamentals, and purpose-driven culture. The company also implemented leadership changes in its DET segment, which executives believe will drive stable and sustainable growth.",
            "Sentiment": "positive",
            "PublishDate": 1753368748555,
            "Source": "stock"
        },
        {
            "Title": "Cyient's Independent Director Vivek Narayan Gour Resigns, Steps Down from Key Committee Roles",
            "Summary": "Vivek Narayan Gour has resigned as Independent Director of Cyient Limited, effective from the end of the Q2/2025-26 Board meeting scheduled for October 2025. He will also cease to be Chairman of the Audit Committee and Risk Management Committee. Gour confirmed there are no material reasons for his resignation other than those mentioned in his resignation letter. He also serves as Independent Director on other listed entities including Affle (India) Limited and Indiamart Intermesh Limited, holding various committee positions.",
            "Sentiment": "neutral",
            "PublishDate": 1753360681640,
            "Source": "corporate_governance"
        }
    ]
}