{
    "Symbol": "DABUR",
    "ISIN": "INE016A01026",
    "News": [
        {
            "Title": "Delhi High Court Bars Dabur's Navratna-Like Packaging",
            "Summary": "Delhi High Court prohibits Dabur from using packaging similar to Emami's Navratna Oil, marking a significant trademark protection ruling in the FMCG sector.",
            "Sentiment": "negative",
            "PublishDate": 1770099436835,
            "Source": "stocks"
        },
        {
            "Title": "Dabur Plans Price Hikes Amid Recovery Expectations",
            "Summary": "Dabur India anticipates improved demand recovery and margin enhancement while preparing to implement price increases in the near term to strengthen its market position.",
            "Sentiment": "positive",
            "PublishDate": 1769752045592,
            "Source": "stocks"
        },
        {
            "Title": "Dabur India Q3FY26 Results: Revenue Up 6.07%",
            "Summary": "Dabur India reported Q3FY26 consolidated revenue of ₹3,558.65 crores, up 6.07% YoY. Net profit rose 7.32% to ₹553.61 crores with strong performance across consumer care business.",
            "Sentiment": "positive",
            "PublishDate": 1769687551804,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dabur India Block Trade Worth ₹40.56 Crores",
            "Summary": "Dabur India witnessed a significant block trade on NSE involving 801,885 shares valued at ₹40.56 crores, executed at ₹505.75 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768971979996,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dabur India Q3 FY26 Update Shows Mixed Performance",
            "Summary": "Dabur India reports mid-single digit revenue growth in Q3 FY26 with double-digit HPC growth, but healthcare and beverages segments underperform expectations.",
            "Sentiment": "neutral",
            "PublishDate": 1767784213573,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dabur India Block Trade Worth ₹26.93 Crores on NSE",
            "Summary": "Dabur India witnessed a significant block trade on NSE involving 515,416 shares worth ₹26.93 crores at ₹522.45 per share, indicating institutional investor activity in the FMCG major.",
            "Sentiment": "neutral",
            "PublishDate": 1767765589779,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dabur Q3 Update: Double-Digit Growth in Home & Personal Care",
            "Summary": "Dabur reports demand recovery in Q3FY26 with home & personal care expected to grow in double digits, driven by strong performance in hair oils and oral care categories amid improving consumer sentiment.",
            "Sentiment": "positive",
            "PublishDate": 1767617975077,
            "Source": "stocks"
        },
        {
            "Title": "Dabur Expects Q3 Profit To Grow Faster Than Revenue",
            "Summary": "Dabur India expects consolidated operating profit and net profit to grow faster than revenue in Q3, aided by GST rate revisions and demand recovery across urban and rural markets.",
            "Sentiment": "positive",
            "PublishDate": 1767617282792,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dabur India to Review Q3 FY25 Results on January 29",
            "Summary": "Dabur India has scheduled its third quarter financial results review for January 29, 2025. The FMCG major will present its Q3 FY25 performance to stakeholders and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1766468209343,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dabur India ESG Rating Improves to 77.3",
            "Summary": "Dabur India's ESG rating increased by 1.6 points to 77.3 from 75.7, as assigned by SESE ESG Research Private Limited based on publicly available data.",
            "Sentiment": "positive",
            "PublishDate": 1766399109387,
            "Source": "stocks"
        },
        {
            "Title": "Dabur India CGST Appeal Dismissed by Commissioner",
            "Summary": "Dabur India's appeal against ₹23.07 crore CGST tax demand dismissed by Commissioner of Appeals, Meerut. Company to file appeal with Tribunal while maintaining minimal financial impact expected.",
            "Sentiment": "negative",
            "PublishDate": 1765967402687,
            "Source": "stocks"
        },
        {
            "Title": "Delhi High Court Backs Dabur in Brand Protection Case",
            "Summary": "Delhi High Court prevents unauthorized use of 'Wellford Pudin Hara' brand name, supporting Dabur's intellectual property rights in a significant trademark protection ruling.",
            "Sentiment": "positive",
            "PublishDate": 1765791540686,
            "Source": "stocks"
        },
        {
            "Title": "Dabur India Receives ESG Rating of 72 from NSE Sustainability, Achieves 'Leader' Category",
            "Summary": "Dabur India has been assigned an ESG rating of 72 by NSE Sustainability Ratings & Analytics Limited, placing the company in the 'Leader' category based on its Environmental, Social and Governance performance parameters. The rating was prepared independently by NSE Sustainability using publicly available data without any engagement from Dabur India.",
            "Sentiment": "positive",
            "PublishDate": 1765346510604,
            "Source": "stock"
        },
        {
            "Title": "Dabur India Receives NSE No-Objection Letter for Sesa Care Private Limited Merger",
            "Summary": "Dabur India Limited has received a no-objection letter from the National Stock Exchange for its scheme of amalgamation with Sesa Care Private Limited, allowing the company to file the draft scheme with NCLT. The NSE letter includes detailed compliance requirements and conditions that must be met, with the observation letter valid for six months from December 05, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1764934319851,
            "Source": "corporate_action"
        },
        {
            "Title": "Dabur India Receives Credit Rating Reaffirmation from CRISIL",
            "Summary": "CRISIL Ratings Limited reaffirmed Dabur India's credit ratings across multiple instruments including CRISIL AAA/Stable for Rs.20 crore Non-Convertible Debentures and Rs.157.5 crore long-term bank loans, and CRISIL A1+ for Rs.200 crore Commercial Paper and short-term bank loans. The reaffirmation maintains the company's strong credit profile across its debt instruments and banking facilities.",
            "Sentiment": "positive",
            "PublishDate": 1763642273986,
            "Source": "stock"
        },
        {
            "Title": "Dabur India Reports 5.4% Revenue Growth Despite GST Transition Disruption in Q2",
            "Summary": "Dabur India Limited reported consolidated revenue growth of 5.4% year-on-year for the quarter ended September 30, 2025. The company's India FMCG business grew 5.7% while international business expanded 7.7% in INR terms. GST reforms impacted nearly 66% of Dabur's portfolio with rate reductions, including juices, toothpaste, hair oils, shampoos, glucose, and Ayurvedic medicines, bringing 86% of the portfolio to 5% GST. However, GST transition caused temporary trade disruption worth approximately Rs. 100 crore (3-4% impact) as channels anticipated price reductions. The HPC portfolio performed well with 8.9% growth, led by toothpaste segment's 14% growth driven by Dabur Red franchise and Meswak. Operating profit grew 6.4% and PAT increased 6.5% despite seasonal headwinds and high inflation. The company announced Dabur Ventures with Rs. 500 crore capital allocation over the next few years for investments in digital-first businesses. Management provided guidance of mid-to-high single-digit growth for the second half, backed by low-to-mid single-digit volume growth, supported by good monsoons, GST benefits, and expected strong winter season.",
            "Sentiment": "positive",
            "PublishDate": 1762469907722,
            "Source": "earnings"
        },
        {
            "Title": "Dabur India Reports Quarterly Results and Declares Interim Dividend of Rs 2.75 Per Share",
            "Summary": "Dabur India Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The Board of Directors declared an interim dividend of Rs 2.75 per equity share (275%) for the financial year 2025-26, with November 7, 2025 set as the record date and payment starting November 21, 2025. On a consolidated basis, the company reported revenue from operations of Rs 3,029.55 crores for the quarter compared to Rs 2,596.59 crores in the corresponding quarter of the previous year. Net profit for the quarter was Rs 449.50 crores versus Rs 392.29 crores in the same period last year. On a standalone basis, quarterly revenue was Rs 2,236.77 crores compared to Rs 2,043.85 crores in the corresponding previous quarter, with net profit of Rs 307.38 crores against Rs 256.09 crores. The company operates through consumer care business, food business, retail business and other segments. The Board meeting was held on October 30, 2025, and the results have been reviewed by statutory auditors.",
            "Sentiment": "positive",
            "PublishDate": 1761856337635,
            "Source": "earnings"
        },
        {
            "Title": "Dabur Targets 8-10% Revenue Growth for FY26 with Margin Expansion",
            "Summary": "Dabur has set a revenue growth target of 8-10% for FY26, along with a 20 basis points margin expansion. The company expects growth to be driven by GST-related consumption increases, strong performance from its premium product portfolio, recovery in rural markets, and expansion of its healthcare, home and personal care, and beverage categories benefiting from a lighter tax regime.",
            "Sentiment": "positive",
            "PublishDate": 1761835295630,
            "Source": "stock"
        },
        {
            "Title": "Dabur Reports Ongoing GST Transition Issues with Old Priced Stock Trading",
            "Summary": "Dabur's executive reported that old priced stock continues to be traded in the market. The company's GST transition process is extending into October, indicating ongoing adjustments to the new tax structure.",
            "Sentiment": "neutral",
            "PublishDate": 1761827340522,
            "Source": "stock"
        },
        {
            "Title": "Dabur Reports International Business Impact from Tariffs and Nepal Protests",
            "Summary": "Dabur's executive reported that tariffs and protests in Nepal negatively affected the company's international business operations. The executive also indicated that rural areas are expected to drive volume growth, while urban markets are showing gradual improvement.",
            "Sentiment": "neutral",
            "PublishDate": 1761826333251,
            "Source": "stock"
        },
        {
            "Title": "Dabur Executive Expresses Confidence in Demand Recovery, Toothpaste Sales Benefit from Indian Heritage Marketing",
            "Summary": "A Dabur executive has expressed confidence about an upturn in demand for the company's products. The company's marketing strategy focusing on the brand's Indian roots has contributed to boosted toothpaste sales.",
            "Sentiment": "positive",
            "PublishDate": 1761825945402,
            "Source": "stock"
        },
        {
            "Title": "Dabur Launches ₹5 Billion Investment Platform Named Dabur Ventures",
            "Summary": "Dabur has introduced a new investment platform called Dabur Ventures with a corpus of ₹5 billion. The platform represents the company's entry into the investment space.",
            "Sentiment": "positive",
            "PublishDate": 1761824848648,
            "Source": "stock"
        },
        {
            "Title": "Dabur India Reports Q2 Growth with 6.4% Rise in Net Profit, Declares Interim Dividend",
            "Summary": "Dabur India reported Q2 consolidated net profit of 4.52 billion rupees, up from 4.25 billion rupees year-over-year, slightly exceeding estimates of 4.50 billion rupees. Revenue reached 31.91 billion rupees compared to 30.28 billion rupees in the previous year, falling marginally short of the 32.10 billion rupee estimate. EBITDA grew to 5.88 billion rupees from 5.52 billion rupees year-over-year, surpassing estimates of 5.85 billion rupees. EBITDA margin improved to 18.43% from 18.24% in the same quarter last year, beating the estimated 18.2%. The company recommended an interim dividend of 2.75 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1761821816366,
            "Source": "corporate_action"
        },
        {
            "Title": "LIC Increases Stake in Dabur India to 6.985% Through Market Purchases",
            "Summary": "Life Insurance Corporation of India has increased its shareholding in Dabur India from 4.918% to 6.985% through market purchases. LIC acquired 36,662,597 shares representing 2.067% of the total share capital during the period from February 18, 2025 to October 23, 2025. The total holding now stands at 123,892,447 shares. The disclosure was made under SEBI regulations for substantial acquisition of shares, as LIC's stake crossed the 5% threshold. Dabur India's total equity share capital remains at 1,77,36,90,172 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1761319744939,
            "Source": "stock"
        },
        {
            "Title": "Dabur India Sets November 7, 2025 as Record Date for Interim Dividend",
            "Summary": "Dabur India Limited has fixed November 7, 2025 as the record date to determine shareholders eligible for interim dividend for Financial Year 2025-26. The interim dividend declaration is subject to Board approval at a meeting scheduled for October 30, 2025. The record date will identify members and beneficial owners entitled to receive the interim dividend on equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1761211201682,
            "Source": "corporate_action"
        },
        {
            "Title": "Dabur India Receives Reduced Income Tax Demand of ₹202.01 Crore",
            "Summary": "Dabur India received an income tax order reducing the amount due to ₹202.01 crore from the previous ₹279.13 crore. The company expects no financial impact from this development and plans to submit an application to correct the demand.",
            "Sentiment": "positive",
            "PublishDate": 1760524599910,
            "Source": "stock"
        },
        {
            "Title": "Dabur Reports Temporary Sales Slowdown in Q2 FY26 Due to GST Rate Cuts",
            "Summary": "Dabur experienced a temporary sales slowdown in Q2 FY26 attributed to GST rate reductions. The company anticipates mid-single digit growth in consolidated revenue for the quarter and expects revenue growth to accelerate in upcoming quarters. Operating profit is expected to rise nearly in line with revenue for Q2. Dabur projects solid growth in its oral care, healthcare, and culinary segments. The company's Indian operations are positioned to benefit from GST rate reductions from 12%/18% to 5%. International business is expected to grow at mid-single digits despite facing challenges in Nepal.",
            "Sentiment": "neutral",
            "PublishDate": 1759823030831,
            "Source": "earnings"
        },
        {
            "Title": "Dabur India Wins Golden Peacock Award for Sustainability 2025",
            "Summary": "Dabur India Limited has been awarded the Golden Peacock Award for Sustainability for 2025 by the Institute of Directors (IOD), India. The award jury was chaired by former Chief Justice of India Uday U. Lalit, with other prominent members including Justice Ritu Raj Awasthi and Prof. Mervyn E. King SC. The recognition acknowledges Dabur's commitment to sustainability and responsible business practices, strengthening its global positioning in sustainability.",
            "Sentiment": "positive",
            "PublishDate": 1758882542315,
            "Source": "stock"
        },
        {
            "Title": "Dabur India Schedules Board Meeting for October 30 to Review Q2 Results and Consider Interim Dividend",
            "Summary": "Dabur India Limited has scheduled a Board of Directors meeting on October 30, 2025, to consider and approve unaudited financial results for the quarter and half year ending September 30, 2025. The board will also consider declaring an interim dividend on equity shares for Financial Year 2025-26. The company has notified stock exchanges BSE and NSE about the scheduled meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1758882022963,
            "Source": "corporate_action"
        },
        {
            "Title": "Dabur India Shares Rise as Tax Demand Reduced to ₹272 Crore",
            "Summary": "Dabur India shares gained after the company announced its tax demand order was reduced to ₹272 crore from ₹321 crore. The company received orders from the jurisdictional assistant commissioner confirming the reduction in compliance with remand directions from the CGST Appeals Commissionerate, Chandigarh. Dabur stated it is seeking legal opinion and will take appropriate steps including filing an appeal with the tribunal. The company confirmed no impact on operations, with financial impact limited to final tax liability determined by higher forums plus interest and penalty. Shares traded 0.7% higher at ₹518.5, recovering 1.7% from the day's low. The stock has gained 2.2% over the last six months, with the move aligning with broader FMCG sector recovery including HUL, Britannia and Godrej Consumer Products.",
            "Sentiment": "positive",
            "PublishDate": 1758700496658,
            "Source": "stock"
        },
        {
            "Title": "Dabur Executive Expects GST 2.0 to Drive Higher Demand and Consumption",
            "Summary": "A Dabur executive has expressed the view that GST 2.0 implementation will lead to increased demand and consumption. The executive's statement suggests optimism about the potential positive impact of the updated goods and services tax framework on business performance.",
            "Sentiment": "positive",
            "PublishDate": 1758523749239,
            "Source": "stock"
        },
        {
            "Title": "Dabur Launches Nationalist Campaign Against American Brands Amid US-India Tariff Dispute",
            "Summary": "Dabur India launched a campaign urging Indians to avoid American brands following US President Donald Trump's tariffs of up to 50% on Indian imports. The $11-billion consumer goods company placed a front-page advertisement in Times of India targeting Colgate without naming it, showing unbranded toothpaste packs resembling Colgate's packaging with the tagline 'Born there, not here' in US flag colors. This coincides with Prime Minister Narendra Modi's renewed call to 'buy Indian' and his urging of children to list foreign goods. Colgate holds 43% of India's toothpaste market, while Dabur ranks third with 17%. Other companies including Amul and Rediff have also launched similar nationalist campaigns. Marketing experts describe this as 'moment marketing' where brands capitalize on nationalist sentiment. Dabur shares closed 1.02% lower at Rs 547.05.",
            "Sentiment": "neutral",
            "PublishDate": 1757074310101,
            "Source": "stock"
        },
        {
            "Title": "Dabur Toothpaste GST Rate Maintained at 18%",
            "Summary": "The GST rate for toothpaste remains unchanged at 18%. This affects Dabur, which operates in the oral care segment with toothpaste products.",
            "Sentiment": "neutral",
            "PublishDate": 1756194036190,
            "Source": "stock"
        },
        {
            "Title": "Dabur Shares Worth Rs 76.84 Crore Traded in NSE Block Deal",
            "Summary": "Dabur witnessed a block trade on NSE involving approximately 1,458,000 shares at Rs 527 per share, totaling Rs 76.84 crore. The transaction represents a significant bulk deal in the company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1755667493534,
            "Source": "order&deals"
        },
        {
            "Title": "Dabur Promoter Asha Burman Reports Changes in Indirect Shareholding Through Family Transfers",
            "Summary": "Asha Burman, a promoter of Dabur India Ltd, disclosed changes in her indirect shareholding in the company through her stake in Gyan Enterprises Private Limited, a promoter entity holding 10.90% of Dabur India. Through a series of family transfers between 2017 and 2025, Burman's indirect holding in Dabur changed from 9.18% to 1.91%. Key transactions included transferring 185,900 equity shares (59.97%) of Gyan to her son Amit Burman in December 2017, acquiring 15,482 shares (5%) back from him in December 2018, transferring 38,706 shares (12.50%) to her daughter Gauri Tandon in September 2023, and acquiring another 15,483 shares (5%) from her son in August 2025. Burman currently holds 54,189 equity shares representing 17.50% of Gyan Enterprises. All transactions were conducted through gifts and inter-family transfers. The overall promoter group shareholding in Dabur remains at 66.22%.",
            "Sentiment": "neutral",
            "PublishDate": 1755089068884,
            "Source": "corporate_action"
        },
        {
            "Title": "Dabur India Approves Rs 5.25 Final Dividend, Re-appoints Independent Director at 50th AGM",
            "Summary": "Dabur India held its 50th Annual General Meeting on August 7, 2025, where shareholders approved a final dividend of Rs 5.25 per equity share for financial year 2024-25, to be paid by August 12, 2025. The company had earlier paid an interim dividend of Rs 2.75 per share. Shareholders also approved the re-appointment of Mr. Mukesh Hari Butani as Non-Executive Independent Director for a second five-year term from January 1, 2026 to December 31, 2030. The AGM was conducted via video conferencing with 5,18,113 total shareholders eligible to vote as of the July 31, 2025 cut-off date. All seven resolutions presented at the meeting were passed with requisite majority, including adoption of audited financial statements and appointment of auditors.",
            "Sentiment": "positive",
            "PublishDate": 1754661952709,
            "Source": "corporate_action"
        },
        {
            "Title": "Dabur Targets Sustainable Growth Through Innovation and Rural Expansion",
            "Summary": "Dabur aims for sustainable growth by focusing on innovation, premium products, and rural distribution. The company is positioning itself as a leader in Ayurvedic healthcare with operations across 8.4 million outlets. Dabur's strategy includes global expansion while targeting double-digit return on invested capital (ROIC).",
            "Sentiment": "positive",
            "PublishDate": 1754577847382,
            "Source": "stock"
        },
        {
            "Title": "Dabur India Reports 1.7% Revenue Growth in Q1 FY26, Seasonal Portfolio Hit by Unseasonal Rains",
            "Summary": "Dabur India Limited reported consolidated revenue growth of 1.7% for Q1 FY26, with growth reaching 7% when excluding seasonal portfolio impact. The company's seasonal beverages and glucose segments were significantly affected by unseasonal rainfall and shortened summer season. India business revenue grew 4.3% excluding seasonal portfolio, while international business showed strong performance with 13.7% growth in constant currency terms. The Home Care portfolio delivered 10% growth, with Odonil achieving #1 position in air freshener category with 44% volume market share. Toothpaste portfolio grew 7.3% led by Red franchise, while Hair Oil segment achieved highest-ever market share of 19%. Healthcare portfolio saw mixed performance - Chyawanprash grew 28% and Honey grew 11%, but glucose declined 30% due to weather impact. The company maintained operating margins despite 7% commodity inflation through price increases of 3-4% and cost-saving initiatives. Management expects double-digit growth in the coming quarter due to favorable base effect and projects high single-digit growth for the full year. Rural markets continued outperforming urban markets for the fifth consecutive quarter, while the company gained market share across 95% of its portfolio.",
            "Sentiment": "neutral",
            "PublishDate": 1754475873168,
            "Source": "earnings"
        },
        {
            "Title": "Dabur India Reports Q1 FY26 Results with Revenue of ₹3,349 Crores",
            "Summary": "Dabur India Limited announced its quarterly results for the period ended June 30, 2025. The company reported consolidated revenue from operations of ₹3,349.11 crores compared to ₹2,830.14 crores in the corresponding quarter of the previous year. Net profit for the quarter stood at ₹508.29 crores versus ₹494.35 crores in the same period last year. On a standalone basis, revenue was ₹2,514.16 crores with net profit of ₹405.39 crores. The consumer care business segment generated revenue of ₹2,567.18 crores while the food business contributed ₹703.19 crores. Basic earnings per share was ₹2.82 for the quarter. The company's Board approved these results in a meeting held on July 31, 2025, and the results will be published in Mint and Deshbandhu newspapers on August 1, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753954849304,
            "Source": "earnings"
        },
        {
            "Title": "Dabur India Reports Q1 Consolidated Net Profit of 5.1 Billion Rupees, Beating Estimates",
            "Summary": "Dabur India reported a consolidated net profit of 5.1 billion rupees for Q1, representing growth from 5 billion rupees in the same period last year. The result exceeded analyst estimates of 4.97 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1753954268947,
            "Source": "earnings"
        },
        {
            "Title": "Dabur India: Q1 Update Indicates Low Single-Digit Revenue Growth",
            "Summary": "Dabur India projects low single-digit consolidated revenue growth for Q1 FY26. Urban markets show sequential demand recovery, particularly in Home and Personal Care. Healthcare brands post robust double-digit growth. International business delivers double-digit constant currency growth. Beverages portfolio declines due to unseasonal rains and short summer.",
            "Sentiment": "neutral",
            "PublishDate": 1751861444000,
            "Source": "earnings"
        },
        {
            "Title": "Dabur India Expects Low Single-Digit Q1 Revenue Growth",
            "Summary": "Dabur India anticipates low single-digit consolidated revenue growth for Q1, with operating profit growth expected to lag behind revenue growth. The company's international business is projected to achieve double-digit growth in Q1. Dabur expects revenue growth to regain momentum and trend higher in upcoming quarters. The Indian FMCG sector is seeing recovery with urban volume growth. However, Dabur's beverage portfolio was impacted during the quarter due to unseasonal rains and a short summer season.",
            "Sentiment": "neutral",
            "PublishDate": 1751846955000,
            "Source": "default"
        },
        {
            "Title": "Dabur India Expects Double-Digit Growth in International Business for Q1",
            "Summary": "Dabur India anticipates double-digit growth in its international business for the first quarter. The company expects revenue growth to accelerate and increase in the upcoming quarters.",
            "Sentiment": "positive",
            "PublishDate": 1751630089000,
            "Source": "default"
        },
        {
            "Title": "Dabur India Expects Low Single-Digit Q1 Revenue Growth",
            "Summary": "Dabur India anticipates low single-digit growth in consolidated revenue for the first quarter. The company also expects operating profit growth to be slower than the increase in revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1751629993000,
            "Source": "default"
        },
        {
            "Title": "Dabur India: Q1 Sees Demand Recovery, Led by Healthcare and Personal Care",
            "Summary": "Dabur India reports sequential demand recovery in Q1 FY24, with strong growth in urban markets. Home and personal care division shows robust performance, especially in oral care. Healthcare products like Honitus expected to grow over 40%. E-commerce and modern trade channels show strong momentum. International business projected for double-digit growth. Beverage segment faces challenges due to unseasonal rain. Overall revenue expected to grow in low single digits.",
            "Sentiment": "positive",
            "PublishDate": 1751628675000,
            "Source": "earnings"
        },
        {
            "Title": "Dabur India: Launches Digital-First Wellness Brand 'Siens' in Nutraceuticals Foray",
            "Summary": "Dabur India enters nutraceuticals segment with 'Siens by Dabur', a D2C wellness brand offering science-backed supplements in Beauty and Skin Health, Daily Wellness, and Gut Health categories. Products include Marine Collagen, multivitamins, Omega-3 softgels, and probiotics, available on major e-commerce platforms including DaburShop.",
            "Sentiment": "positive",
            "PublishDate": 1750253339000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dabur India: Board Approves Merger with Sesa Care",
            "Summary": "Dabur India's board has approved the amalgamation of Sesa Care Pvt. into the company, subject to regulatory and shareholder approvals. The merger aims to strengthen Dabur's position in the ayurvedic hair oil category and expand its product portfolio. The move is expected to create synergies, optimize costs, and improve operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1748273230000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dabur Approves Merger with Sesa Care",
            "Summary": "Dabur's board has approved a scheme of amalgamation to merge Sesa Care with the company. No further details about the merger or its implications were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1748265972000,
            "Source": "default"
        },
        {
            "Title": "Dabur India: Shares Fall on Weak Q4 Results, Analyst Downgrades",
            "Summary": "Dabur India's shares dropped nearly 4% after Q4 results showed flat revenue and declining profits. Domestic volume contracted 3%. Multiple analysts downgraded the stock or cut price targets due to weak performance across segments and low EBITDA margins. Management expects gradual recovery and margin expansion in FY26.",
            "Sentiment": "negative",
            "PublishDate": 1746678211000,
            "Source": "earnings"
        },
        {
            "Title": "Dabur India: Q4 Profit Falls 8.4%, Shares Decline Post-Results",
            "Summary": "Dabur India reported a consolidated net profit of ₹320.13 crore for Q4FY25, down 8.4% YoY. Revenue increased marginally by 0.5% to ₹2,830 crore. EBITDA declined 8.6% to ₹426.8 crore with margin compression. The company declared a final dividend of ₹5.25 per share. Dabur shares fell over 4% in early trade following the results announcement.",
            "Sentiment": "negative",
            "PublishDate": 1746676934000,
            "Source": "result"
        }
    ]
}