{
    "Symbol": "DALBHARAT",
    "ISIN": "INE00R701025",
    "News": [
        {
            "Title": "Dalmia Bharat Eyes High Growth in East Region",
            "Summary": "Dalmia Bharat anticipates high single-digit cement demand growth in East region, expects to outperform industry volume growth, and targets trade share in mid-60s to high-60s range.",
            "Sentiment": "positive",
            "PublishDate": 1769051035934,
            "Source": "stocks"
        },
        {
            "Title": "Dalmia Bharat Sets ₹200 Cr Incentive Target",
            "Summary": "Dalmia Bharat management expects incentive run rate of ₹200 crores next year while targeting net debt to EBITDA ratio within 2% during recent concall update.",
            "Sentiment": "positive",
            "PublishDate": 1769051010008,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dalmia Bharat Plans Major CapEx Expansion",
            "Summary": "Dalmia Bharat announces significant capital expenditure plans with ₹700 crores for FY26, ₹4,000 crores for FY27, and ₹8,000-9,000 crores over next two years during concall update.",
            "Sentiment": "positive",
            "PublishDate": 1769050980450,
            "Source": "stocks"
        },
        {
            "Title": "Dalmia Bharat Sets Ambitious Capacity Expansion Targets",
            "Summary": "Dalmia Bharat outlines aggressive growth plans targeting 75 million tons capacity by FY28 and 110-130 million tons by 2031, with current projects reaching 61.5 million tons.",
            "Sentiment": "positive",
            "PublishDate": 1769050950723,
            "Source": "stocks"
        },
        {
            "Title": "Dalmia Bharat Projects 7.3% GDP Growth, 6% Cement Demand",
            "Summary": "Dalmia Bharat management forecasts India's GDP growth at 7.3% for current fiscal and expects cement demand to grow 6% YoY in FY26, with Q4 momentum sustaining into next year.",
            "Sentiment": "positive",
            "PublishDate": 1769050919742,
            "Source": "stocks"
        },
        {
            "Title": "Dalmia Bharat Q3FY26 profit jumps 94% to ₹122 cr",
            "Summary": "Dalmia Bharat Limited reported strong Q3FY26 results with net profit rising 94% YoY to ₹122 crores. Revenue grew 10% to ₹3,506 crores despite exceptional items of ₹32 crores from new labour code impact.",
            "Sentiment": "positive",
            "PublishDate": 1768987593678,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dalmia Bharat Starts 3.6 MTPA Clinker Unit at Umrangso",
            "Summary": "Dalmia Bharat Limited commenced commercial production at its 3.6 MTPA clinkerisation facility in Umrangso, Assam, increasing total group clinker capacity to 27.1 MTPA.",
            "Sentiment": "positive",
            "PublishDate": 1768919188794,
            "Source": "stocks"
        },
        {
            "Title": "Dalmia Bharat ESG Rating Reaffirmed at Exceptional",
            "Summary": "ICRA ESG Ratings reaffirmed Dalmia Bharat's Combined ESG Rating at 80 (Exceptional) following annual surveillance review. The rating comprises Impact Rating of 74 (Good) and Transition Rating of 85 (Accelerating).",
            "Sentiment": "positive",
            "PublishDate": 1768826328106,
            "Source": "stocks"
        },
        {
            "Title": "Dalmia Bharat reschedules Q3FY26 earnings call",
            "Summary": "Dalmia Bharat Limited has revised the timing of its Q3FY26 earnings call scheduled for January 21, 2026, moving it 30 minutes earlier to 4:30 PM IST from the originally planned 5:00 PM IST.",
            "Sentiment": "neutral",
            "PublishDate": 1768568369414,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dalmia Bharat Unit Buys 26% Stake in Solar Project",
            "Summary": "Dalmia Bharat's cement subsidiary acquires 26% stake in TrueRe Surya for 128 MW solar power project, strengthening renewable energy portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1768407134374,
            "Source": "stocks"
        },
        {
            "Title": "Dalmia Bharat Q3FY26 Earnings Call on Jan 21",
            "Summary": "Dalmia Bharat Limited schedules investor conference call for January 21, 2026 at 5:00 PM IST to discuss Q3FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768305949826,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dalmia Bharat Subsidiary Faces ₹25.22L GST Demand",
            "Summary": "DCBL receives GST order imposing ₹11.16L tax demand plus ₹14.07L penalty for disallowed Input Tax Credit claims spanning FY2018-19 to FY2022-23. Company plans appeal citing strong grounds to contest.",
            "Sentiment": "negative",
            "PublishDate": 1767266311670,
            "Source": "stocks"
        },
        {
            "Title": "Dalmia Bharat Subsidiary Faces ₹21.28L Tax Demand",
            "Summary": "DCBL receives GST order with ₹10.59L tax demand and ₹10.69L penalty for service tax dispute on river water usage license for AY 2016-17 and 2017-18. Company plans to appeal.",
            "Sentiment": "negative",
            "PublishDate": 1766904745480,
            "Source": "stocks"
        },
        {
            "Title": "Dalmia Bharat Allots 792 Equity Shares Under ESOP",
            "Summary": "Dalmia Bharat Limited allotted 792 equity shares at par value under its stock option plan, increasing paid-up share capital to ₹37.51 crores with total equity shares reaching 18.76 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1766496162363,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dalmia Bharat Clarifies GST Relief for Subsidiary, Disputes Media Reports",
            "Summary": "Dalmia Bharat Limited clarified that its wholly owned subsidiary Dalmia Cement (Bharat) Limited received relief in GST proceedings with the entire demand of Rs 266.3 crore being waived by authorities, contradicting media reports suggesting outstanding notices. The company stated there is no financial impact on the subsidiary following the adjudication orders received on November 28, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1764518322947,
            "Source": "stock"
        },
        {
            "Title": "Dalmia Bharat Sees Rs. 46.54 Crore Block Trade on NSE",
            "Summary": "Dalmia Bharat Ltd. witnessed a significant block trade worth Rs. 46.54 crores involving approximately 231,067 shares at Rs. 2,014 per share on the NSE. The large-volume transaction indicates institutional investor activity in the cement company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1764055028228,
            "Source": "order&deals"
        },
        {
            "Title": "Dalmia Bharat's Subsidiary Gets Relief as Tax Department Drops Rs 106.7 Crore GST Demand",
            "Summary": "Dalmia Cement (Bharat) Limited, wholly owned subsidiary of Dalmia Bharat Limited, received relief as the Sales Tax Officer in Tamil Nadu dropped proposed GST demands totaling Rs 53.35 crore in tax and Rs 53.35 crore in penalties for assessment year 2019-20. The adjudication proceedings related to discrepancies in taxable turnover and tax liability declarations between GSTR1 and GSTR3B filings have been resolved with no financial impact on the subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1763722296330,
            "Source": "stock"
        },
        {
            "Title": "Dalmia Bharat Acquires Stakes in Solar Power SPVs for ₹7.8 Crore",
            "Summary": "Dalmia Bharat is purchasing shares in two special purpose vehicles (SPVs) - Velan Infra Projects for ₹6 crore and Arunachalam Solar Power for ₹1.8 crore. The acquisitions are aimed at procuring solar power as a captive user for the company's operations.",
            "Sentiment": "positive",
            "PublishDate": 1761583492449,
            "Source": "stock"
        },
        {
            "Title": "Dalmia Bharat Reports 60% EBITDA Growth in Q2 FY26, Maintains Four-Digit Per Ton Margins",
            "Summary": "Dalmia Bharat Limited reported quarterly results with revenue growth of 11% year-on-year to Rs. 3,417 crores and EBITDA growth of 60% to Rs. 696 crores, achieving Rs. 1,013 per ton EBITDA. This marks the second consecutive quarter of four-digit cement EBITDA per ton. Volume growth was 2.9% year-on-year with realization increasing 7.6%. The company's trade share stood at 62% while premium product share was 22%. Raw material costs increased marginally by 1% to Rs. 799 per ton and power & fuel costs rose 1% to Rs. 1,017 per ton. The company achieved 48% renewable energy share and commissioned 93 MW of RE capacity. EBITDA margin improved to 20.4% from 14.1% in the same quarter last year. Net debt stood at Rs. 1,602 crores with debt-to-EBITDA ratio at 0.56x. The company passed on the entire GST rate reduction benefit from 28% to 18% to consumers. Capacity expansion projects at Belgaum and Kadapa are progressing as planned, with trial runs commenced at the new 3.6 million ton clinker line in Umrangso, Assam. The Board declared an interim dividend of Rs. 4 per share. CAPEX guidance for the year was revised to Rs. 3,000 crores from earlier estimates due to favorable credit terms with equipment suppliers.",
            "Sentiment": "positive",
            "PublishDate": 1761134353530,
            "Source": "earnings"
        },
        {
            "Title": "Dalmia Bharat Reduces FY26 Capital Expenditure Guidance to INR 3,000 Crores",
            "Summary": "Dalmia Bharat has revised its FY26 capital expenditure estimate to INR 3,000 crores, down from previous guidance. The company projects FY27 capex at around INR 4,000 crores. The cement manufacturer has also lowered its FY26 incentive forecast to INR 240 crores from INR 300 crores, with FY27 incentives expected at INR 200 crores. Management anticipates better volume growth in the second half of FY26 compared to the first half, though no specific volume guidance was provided for FY26. The company believes cement sector growth follows 1.2 times GDP growth. Despite expansion plans, management assured that net debt to EBITDA will remain under 2:1.",
            "Sentiment": "neutral",
            "PublishDate": 1760930948216,
            "Source": "stock"
        },
        {
            "Title": "Dalmia Cement Acquires Stakes in Three Solar Power SPVs for Rs 4.2 Crore",
            "Summary": "Dalmia Cement (Bharat) Limited, a wholly owned subsidiary of Dalmia Bharat Limited, has entered into agreements to acquire stakes in three Special Purpose Vehicles (SPVs) of Velan Infra Projects for a total consideration of Rs 4.2 crore. The acquisition involves stakes in Apple India Solar Products Pvt Ltd (Rs 2.7 crore for 38.60% post-acquisition stake), Bijlee Kandasamy Private Limited (Rs 0.90 crore for 36.92% post-acquisition stake), and Kilavikulam Rajalakshmi Solar Power Developer Private Limited (Rs 0.60 crore for 37.90% post-acquisition stake). The purpose is to source solar power as a captive consumer for up to 14 MW capacity located in Tamil Nadu. The acquisitions support the group's commitment to achieve RE 100 by 2030 and carbon negative status by 2040. All three entities are SPVs for setting up solar power projects in Tamil Nadu. The transactions are subject to customary conditions and expected to complete within 3 months.",
            "Sentiment": "positive",
            "PublishDate": 1760708241002,
            "Source": "order&deals"
        },
        {
            "Title": "Dalmia Bharat Reports Strong Q2 Results with 33% Revenue Growth and Declares Rs 4 Interim Dividend",
            "Summary": "Dalmia Bharat Limited announced its quarterly results for the quarter ended September 30, 2025, showing consolidated revenue from operations of Rs 3,417 crore compared to Rs 3,087 crore in the same quarter last year. The company reported a consolidated profit after tax of Rs 239 crore for the quarter, up from Rs 49 crore in the previous year. For the half-year period, revenue reached Rs 7,053 crore versus Rs 6,708 crore last year, with profit after tax of Rs 634 crore compared to Rs 194 crore. The Board declared an interim dividend of Rs 4 per equity share (200% on face value of Rs 2) with October 25, 2025 as the record date. Earnings per share for the quarter stood at Rs 12.59 compared to Rs 2.46 in the same quarter last year. The company continues to face ongoing legal proceedings including disputes with Bawri Group regarding DCNEL shareholding and enforcement actions by regulatory authorities regarding certain land parcels.",
            "Sentiment": "positive",
            "PublishDate": 1760685655842,
            "Source": "earnings"
        },
        {
            "Title": "Dalmia Bharat Denies Reports of 5 Billion Rupee Cement Factory Acquisition",
            "Summary": "Dalmia Bharat has denied claims regarding the acquisition of a cement factory worth 5 billion rupees. The company has refuted these reports, clarifying that such acquisition claims are not accurate.",
            "Sentiment": "neutral",
            "PublishDate": 1760440901524,
            "Source": "stock"
        },
        {
            "Title": "Dalmia Bharat Acquires Cement Factory for ₹500 Crore, Plans 2 Million Ton Capacity Addition",
            "Summary": "Dalmia Bharat has acquired full ownership of a cement factory valued at ₹500 crore. The company expects this acquisition to increase its production capacity by 2 million tons annually.",
            "Sentiment": "positive",
            "PublishDate": 1760355197548,
            "Source": "stock"
        },
        {
            "Title": "Dalmia Bharat Shares Worth Rs. 67.41 Crores Traded in NSE Block Deal",
            "Summary": "Dalmia Bharat Ltd. witnessed a block trade on NSE involving approximately 303,679 shares at Rs. 2,219.80 per share, totaling Rs. 67.41 crores. The transaction represents a significant bulk deal in the cement company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1759215956282,
            "Source": "order&deals"
        },
        {
            "Title": "Dalmia Cement Land Attachment Order Confirmed Under Money Laundering Act",
            "Summary": "The Adjudicating Authority under the Prevention of Money Laundering Act confirmed a Provisional Attachment Order against Dalmia Cement (Bharat) Limited, a subsidiary of Dalmia Bharat Limited. The order confirms attachment of company land valued at Rs. 377.26 crores, stemming from a Rs. 793.34 crore provisional attachment order issued in March. The attachment relates to allegations regarding investments in Bharathi Cement Corporation Private Limited from a 2011 Central Bureau of Investigation case. The company states the order does not impact daily operations and plans to pursue legal remedies against the attachment order.",
            "Sentiment": "negative",
            "PublishDate": 1758716645511,
            "Source": "stock"
        },
        {
            "Title": "Dalmia Bharat Gets Stock Exchange Approval to Reclassify Birla Tyres from Promoter to Public Category",
            "Summary": "Dalmia Bharat Limited received approval from BSE and NSE to reclassify Birla Tyres Limited from 'Promoter and Promoter Group' category to 'Public' category. The company had submitted the application on July 24, 2025, and both stock exchanges approved the request on September 18, 2025. BSE sent their approval at 04:15 pm and NSE at 05:31 pm on the same day. This reclassification changes Birla Tyres Limited's status from being part of the promoter group to a public shareholder of Dalmia Bharat Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1758213999907,
            "Source": "corporate_action"
        },
        {
            "Title": "Dalmia Bharat Sees Two Large Block Trades Worth Rs. 183.29 Crores",
            "Summary": "Dalmia Bharat Ltd. witnessed two significant block trades on NSE. The first transaction involved 325,295 shares at Rs. 2,483.30 per share, totaling Rs. 80.78 crores. The second block trade comprised 412,949 shares at Rs. 2,482.50 per share, amounting to Rs. 102.51 crores. Combined, both transactions were worth Rs. 183.29 crores involving 738,244 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1758084427822,
            "Source": "order&deals"
        },
        {
            "Title": "Dalmia Bharat Shares Worth Rs. 57.15 Crores Traded in NSE Block Deal",
            "Summary": "Dalmia Bharat Ltd. witnessed a block trade on NSE involving approximately 234,996 shares at Rs. 2,432 per share, totaling Rs. 57.15 crores. The transaction represents a significant bulk deal in the cement company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1757995640510,
            "Source": "order&deals"
        },
        {
            "Title": "Dalmia Bharat Sees Block Trade Worth Rs. 85.79 Crores on NSE",
            "Summary": "Dalmia Bharat Ltd. witnessed a block trade on the National Stock Exchange involving approximately 355,066 shares at a price of Rs. 2,416.20 per share, totaling Rs. 85.79 crores. The transaction represents a significant institutional or bulk trading activity in the cement company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1757050711725,
            "Source": "order&deals"
        },
        {
            "Title": "Dalmia Bharat Block Trade Worth Rs. 85.25 Crores Executed on NSE",
            "Summary": "Dalmia Bharat Ltd. witnessed a block trade on the National Stock Exchange involving approximately 352,891 shares at a price of Rs. 2,415.90 per share, totaling Rs. 85.25 crores. The transaction represents a significant off-market deal for the cement company's shares.",
            "Sentiment": "neutral",
            "PublishDate": 1757047236936,
            "Source": "order&deals"
        },
        {
            "Title": "Dalmia Bharat Shares Worth Rs. 57.52 Crores Traded in NSE Block Deal",
            "Summary": "Dalmia Bharat Ltd. witnessed a block trade on NSE involving approximately 238,669 shares at Rs. 2,410 per share, totaling Rs. 57.52 crores. The transaction represents a significant bulk deal in the company's shares at the specified price point.",
            "Sentiment": "neutral",
            "PublishDate": 1756967584989,
            "Source": "order&deals"
        },
        {
            "Title": "Dalmia Bharat Shares Worth Rs. 21.40 Crores Traded in NSE Block Deal",
            "Summary": "Dalmia Bharat Ltd. witnessed a block trade on NSE involving approximately 88,884 shares at a price of Rs. 2,408.10 per share, totaling Rs. 21.40 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1756958166387,
            "Source": "order&deals"
        },
        {
            "Title": "Dalmia Bharat Sees ₹65.05 Crore Block Trade on NSE",
            "Summary": "Dalmia Bharat Ltd. witnessed a block trade worth ₹65.05 crores on the National Stock Exchange. The transaction involved approximately 276,532 shares at a price of ₹2,352.30 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1756369320900,
            "Source": "order&deals"
        },
        {
            "Title": "Dalmia Bharat Reports Record Q1 FY26 EBITDA of Rs 883 Cr, Targets 75 MnTPA Capacity by FY2028",
            "Summary": "Dalmia Bharat Limited, India's 4th largest cement manufacturer, achieved its highest ever quarterly EBITDA of Rs 883 Cr in Q1 FY26, up from Rs 669 Cr in Q1 FY25. Revenue per tonne increased to Rs 5,193 from Rs 4,622 year-on-year. The company operates 15 cement plants with 49.5 MnTPA capacity across 23 states and sold 29.4 MnT in FY25. Dalmia Bharat targets reaching 75 MnTPA capacity by FY2028 and 110-130 MnT by 2031, with ongoing expansion projects in Belgaum-Pune and Kadapa. The company maintains a strong balance sheet with Net Debt to EBITDA at 0.33x and commissioned 26 MW of renewable energy capacity. ICRA upgraded the company's ESG rating to 80 (Exceptional). The company aims to become carbon negative by 2040 and expects to gain Rs 150-200 per tonne through cost efficiency measures by FY27.",
            "Sentiment": "positive",
            "PublishDate": 1754976044773,
            "Source": "earnings"
        },
        {
            "Title": "Dalmia Cement Successfully Appeals GST Penalty, Saves Rs 5.64 Lakh in Interest and Penalties",
            "Summary": "Dalmia Cement (Bharat) Limited, a wholly owned subsidiary of Dalmia Bharat Limited, won an appeal against GST penalties related to delayed return filings. The Office of Additional Commissioner of State Tax (Appeal) in Dhanbad, Jharkhand waived off the entire demand of Rs 4,89,008 in interest and Rs 75,000 in penalty. The penalties were originally imposed for delays in filing GSTR-3B returns for July 2017 and November 2017 by Dalmia Cement East Limited, which has since merged with Dalmia Cement (Bharat) Limited. The appeal order was received on August 7, 2025, and the company confirmed there will be no financial impact on the subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1754632160223,
            "Source": "stock"
        },
        {
            "Title": "CCI Approves Dalmia Bharat's Acquisition Bid for Debt-Laden Jaiprakash Associates",
            "Summary": "India's Competition Commission approved Dalmia Bharat's proposal to fully acquire Jaiprakash Associates Ltd (JAL) through its wholly owned unit Dalmia Cement (Bharat) Ltd. JAL, which owes lenders ₹57,185 crore, is undergoing insolvency proceedings after being admitted to the corporate insolvency resolution process by NCLT Allahabad on June 3. The approval is a mandatory step under the Insolvency and Bankruptcy Code before resolution plans can be submitted to the Committee of Creditors. Other bidders including Adani Enterprises, Vedanta Group, Jindal Power, and PNC Infratech have also sought CCI clearance for their resolution plans. JAL operates across cement, real estate, hospitality, and engineering sectors, with assets including stalled real estate projects in Greater Noida, a sports city project near Jewar airport, and hospitality properties in Delhi-NCR, Agra, and Mussoorie. Its cement plants in Madhya Pradesh and Uttar Pradesh are non-operational. The National Asset Reconstruction Company Ltd is JAL's largest creditor after acquiring loans from a consortium led by State Bank of India.",
            "Sentiment": "neutral",
            "PublishDate": 1754406884906,
            "Source": "order&deals"
        },
        {
            "Title": "Dalmia Bharat Reports Highest Ever Quarterly EBITDA of ₹883 Crores, Announces Major Expansion Plans",
            "Summary": "Dalmia Bharat Limited achieved its highest ever quarterly EBITDA of ₹883 crores in Q1 FY26, representing a 32% year-on-year increase. EBITDA per ton reached ₹1,261, marking a 40% increase, while EBITDA margin improved to 24.3% from 18.5% in the previous year. The company's net sales realization improved 9% quarter-on-quarter due to better price positioning and improved sales quality. Sales volumes declined 6% year-on-year to 7 million tons, but remained flat when excluding tolling volumes from the previous year. The Board approved a ₹3,287 crore investment for a 3.6 million ton clinker unit and 6 million ton grinding unit at Kadapa, plus a 3 million ton bulk terminal in Chennai. The company outlined plans to reach 63.5-64 million tons cement capacity by FY28 through multiple expansion projects. Managing Director Puneet Dalmia emphasized the strategy of balancing volume growth with profit margins across different markets. The company expects cement demand to grow 6-7% in FY26, supported by government infrastructure spending. Net debt stood at ₹873 crores with a debt-to-EBITDA ratio of 0.33x. The Umrangso clinker unit is expected to begin trial runs in September 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753434233343,
            "Source": "earnings"
        },
        {
            "Title": "Dalmia Bharat Submits Application to Reclassify Promoter Group Entity to Public Shareholder",
            "Summary": "Dalmia Bharat Limited has submitted applications to NSE and BSE for reclassification of a promoter group entity from 'promoter and promoter group' category to 'public' category shareholder. The board approved this reclassification on July 22, 2025, and the applications were submitted to both stock exchanges on July 24, 2025. The company had previously received a request from the promoter group entity for this reclassification on July 3, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753374009116,
            "Source": "corporate_action"
        },
        {
            "Title": "Dalmia Bharat Holds 10.80% Stake in IEX, Stock Declines 1%",
            "Summary": "Dalmia Bharat holds a 10.80% stake in IEX. The company's stock declined by 1%.",
            "Sentiment": "negative",
            "PublishDate": 1753329737059,
            "Source": "stock"
        },
        {
            "Title": "Dalmia Bharat Targets Top-Decile EBITDA Per Ton Through Cost Leadership Strategy",
            "Summary": "Dalmia Bharat plans to balance volume growth with profit margins by exiting unprofitable business segments. The company aims to achieve top-decile EBITDA per ton in the industry through enhanced cost leadership and improved sales performance.",
            "Sentiment": "positive",
            "PublishDate": 1753328227461,
            "Source": "stock"
        },
        {
            "Title": "Dalmia Bharat Announces Rs 3,287 Cr Capacity Expansion at Kadapa Facility",
            "Summary": "Dalmia Cement (Bharat) Limited, a wholly owned subsidiary of Dalmia Bharat Limited, has approved a capacity expansion plan at its Kadapa facility. The expansion includes adding 3.6 MnT of clinker capacity and 6.0 MnT of cement capacity, along with a 3.0 MnT bulk terminal in Chennai. The Rs 3,287 crore project is expected to be completed by Q2 FY28, which will increase the company's total cement capacity to 61.5 MnT from the existing 49.5 MnT. The project will be financed through debt and internal accruals. The company reported quarterly results showing sales volume of 7.0 MnT, EBITDA of Rs 883 crore (32% increase year-on-year), and Net Debt/EBITDA ratio of 0.33x. The expansion aims to strengthen presence in Andhra Pradesh and Southern Karnataka markets, while the Chennai bulk terminal will address underserved markets in Northern Tamil Nadu. The company also divested 4.1% holding in IEX Ltd for Rs 742 crore and commissioned 26 MW of renewable energy capacity.",
            "Sentiment": "positive",
            "PublishDate": 1753194448285,
            "Source": "stock"
        },
        {
            "Title": "Dalmia Bharat Reports 32% EBITDA Growth and Announces 6 MnTPA Capacity Expansion at Kadapa",
            "Summary": "Dalmia Bharat Limited reported quarterly results for the period ended June 30, 2025, showing EBITDA growth of 31.9% year-on-year to Rs 883 crores and PAT increase of 172.4% to Rs 395 crores. Sales volume stood at 7.0 million tonnes during the quarter, with NSR per tonne increasing 6.6% to Rs 5,193. The company announced a strategic investment of Rs 3,287 crores to establish 3.6 MnTPA clinker unit with 6 MnTPA grinding unit at its existing Kadapa plant in Andhra Pradesh, expected to commission by Q2 FY28. This expansion is in addition to the previously announced 6 MnT expansion in Belgaum. The company's net debt to EBITDA ratio stood at 0.33x as of June 30, 2025. The Board also approved a request from Birla Tyres Limited for reclassification from promoter group category to public category, subject to stock exchange approval.",
            "Sentiment": "positive",
            "PublishDate": 1753191310028,
            "Source": "earnings"
        },
        {
            "Title": "Dalmia Bharat Reports Strong Q1 Performance with Net Profit Surging to 3.9 Billion Rupees",
            "Summary": "Dalmia Bharat delivered robust quarterly results with consolidated net profit jumping to 3.9 billion rupees compared to 1.4 billion rupees in the same period last year. Revenue remained relatively stable at 36.4 billion rupees versus 36.2 billion rupees year-over-year. The company's operational efficiency improved significantly, with EBITDA rising to 8.8 billion rupees from 6.7 billion rupees, while EBITDA margin expanded to 24.28% from 18.48% in the corresponding period.",
            "Sentiment": "positive",
            "PublishDate": 1753190201922,
            "Source": "earnings"
        },
        {
            "Title": "Dalmia Bharat Clarifies on CCI Proceedings",
            "Summary": "Dalmia Bharat has issued a clarification regarding news reports about Competition Commission of India (CCI) proceedings. The company states that reports of a penalty being imposed on DCBL (presumably Dalmia Cement Bharat Limited) are factually incorrect and misleading at this stage.",
            "Sentiment": "neutral",
            "PublishDate": 1751846881000,
            "Source": "default"
        },
        {
            "Title": "Dalmia Bharat Refutes News About CCI Proceedings and Penalties",
            "Summary": "Dalmia Bharat has issued a clarification stating that recent news reports regarding Competition Commission of India (CCI) proceedings and penalties against the company are incorrect and misleading.",
            "Sentiment": "neutral",
            "PublishDate": 1751636328000,
            "Source": "default"
        },
        {
            "Title": "CCI Imposes 10% Penalty on Dalmia Bharat's Annual Revenue in ONGC Tender Case",
            "Summary": "The Competition Commission of India (CCI) has completed its investigation into a case involving Dalmia Bharat and an ONGC tender. As a result, the CCI has imposed a penalty of 10% on Dalmia Bharat's annual revenue. The specific details of the ONGC tender case and the exact amount of the penalty are not provided in the given news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1751616189000,
            "Source": "default"
        },
        {
            "Title": "Dalmia Bharat: Last Day to Qualify for Rs 5 Dividend",
            "Summary": "June 23 is the last day to buy Dalmia Bharat shares to be eligible for the Rs 5 per share final dividend for FY2025. The record date is set for June 23, with T+1 settlement excluding buyers on this date from dividend eligibility.",
            "Sentiment": "neutral",
            "PublishDate": 1750392665000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dalmia Bharat Faces Potential Loss of Incentives in West Bengal",
            "Summary": "Dalmia Bharat could potentially lose ₹236 crore in incentives due to the West Bengal government's decision to eliminate various industrial subsidies in 2025.",
            "Sentiment": "negative",
            "PublishDate": 1749526118000,
            "Source": "default"
        },
        {
            "Title": "Court Order May Affect 2.36 Billion Rupees Incentives for Dalmia Bharat Unit",
            "Summary": "A court order is likely to impact incentives worth 2.36 billion rupees for a unit of Dalmia Bharat. The news suggests a potential legal challenge to previously granted incentives, which could have financial implications for the company.",
            "Sentiment": "negative",
            "PublishDate": 1749428079000,
            "Source": "default"
        }
    ]
}