{
    "Symbol": "DALMIASUG",
    "ISIN": "INE495A01022",
    "News": [
        {
            "Title": "Dalmia Bharat Approves ₹49 Cr Steam Saving Project",
            "Summary": "Dalmia Bharat Sugar & Industries approves ₹49 crore project at Jawaharpur unit targeting 10% steam reduction and saving 54,000 MT bagasse annually through efficiency improvements.",
            "Sentiment": "positive",
            "PublishDate": 1770308158993,
            "Source": "stocks"
        },
        {
            "Title": "Dalmia Bharat Approves ₹58 Crore Bio-Gas Project",
            "Summary": "Dalmia Bharat Sugar And Industries board approves ₹58 crore compressed bio-gas project using spent wash at Kolhapur distillery, marking expansion into renewable energy.",
            "Sentiment": "positive",
            "PublishDate": 1770308131520,
            "Source": "stocks"
        },
        {
            "Title": "Dalmia Bharat Sugar Q3FY26 Net Profit Rises 17.3%",
            "Summary": "Dalmia Bharat Sugar reports Q3FY26 net profit of ₹69.77 crore, up 17.3% YoY. Board declares interim dividend of ₹4.50 per share and approves ₹107 crore capex for CBG and steam saving projects.",
            "Sentiment": "positive",
            "PublishDate": 1770306840117,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dalmia Bharat Sugar Gets ICRA A1 Rating for Rs 500 Crore Commercial Paper Program",
            "Summary": "ICRA Limited has assigned an A1 rating to Dalmia Bharat Sugar and Industries Limited's commercial paper program worth Rs 500 crore. The rating validates the company's creditworthiness for short-term debt instruments with maximum maturity of twelve months from issuance date.",
            "Sentiment": "positive",
            "PublishDate": 1763642197619,
            "Source": "corporate_action"
        },
        {
            "Title": "Dalmia Bharat Sugar Unit Head Resigns Due to Personal Reasons",
            "Summary": "Agha Asif Beig, Unit Head of the Ramgarh Unit at Dalmia Bharat Sugar and Industries Limited, has resigned from his position due to personal reasons. Beig submitted his resignation on November 6, 2025, which has been accepted by the company and will become effective from November 25, 2025. He held the designation of Senior Management Personnel at the sugar company.",
            "Sentiment": "neutral",
            "PublishDate": 1762455277928,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dalmia Bharat Sugar Expects Healthy Sugarcane Crop, Seeks Policy Support for Industry Margins",
            "Summary": "Dalmia Bharat Sugar And Industries predicts a healthy sugarcane crop due to expected good rainfall. The company believes that quick actions on sugar exports, higher sugar minimum support price, and ethanol pricing will help the industry combat margin pressures.",
            "Sentiment": "positive",
            "PublishDate": 1762270954773,
            "Source": "stock"
        },
        {
            "Title": "Dalmia Bharat Sugar Reports Quarterly Results; Completes Demerger of Non-Core Businesses",
            "Summary": "Dalmia Bharat Sugar and Industries Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company completed the demerger of its non-core refractory and travel agency businesses into Dalmia Bharat Refractories Limited, with the National Company Law Tribunal approving the scheme on September 12, 2025, and an appointed date of July 1, 2023. Due to the demerger, the company's revenue from operations decreased by Rs. 1.99 crores for the quarter ended June 30, 2025, while assets decreased by Rs. 189.03 crores and liabilities decreased by Rs. 35.16 crores as of the appointed date. The company's current assets include inventories of Rs. 444.60 crores and cash and cash equivalents of Rs. 214.41 crores. The board meeting was held on November 4, 2025, with results approved after audit committee recommendation.",
            "Sentiment": "neutral",
            "PublishDate": 1762267696110,
            "Source": "earnings"
        },
        {
            "Title": "Dalmia Bharat Sugar Reports Mixed Q2 Results with Revenue Growth but Lower Profitability",
            "Summary": "Dalmia Bharat Sugar and Industries reported Q2 revenue of 9.9 billion rupees, up from 9.2 billion rupees year-over-year. However, the company's profitability declined with EBITDA falling to 560 million rupees from 670 million rupees, while EBITDA margin compressed to 5.66% from 7.28%. Net profit dropped significantly to 233 million rupees compared to 534 million rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1762263480951,
            "Source": "earnings"
        },
        {
            "Title": "Dalmia Bharat Sugar Demerger Scheme Becomes Effective, Record Date Set for October 31, 2025",
            "Summary": "Dalmia Bharat Sugar and Industries Limited announced that its demerger scheme with Dalmia Bharat Refractories Limited became effective on October 9, 2025, following the filing of the National Company Law Board Chennai Bench order with the Registrar of Companies. Under the scheme, shareholders will receive 1 fully paid-up equity share of face value INR 10 each in the resulting company for every 48.18 fully paid-up equity shares of face value INR 2 each held in the demerged company. The board has fixed October 31, 2025, as the record date to determine eligible shareholders entitled to receive shares in the resulting company. The appointed date for the scheme is July 1, 2023.",
            "Sentiment": "neutral",
            "PublishDate": 1760422755536,
            "Source": "corporate_action"
        },
        {
            "Title": "Madras High Court Dismisses ₹120 Crore Compensation Claim Against Dalmia Bharat Sugar",
            "Summary": "The Madras High Court has dismissed a compensation claim worth ₹120 crore that was filed against Dalmia Bharat Sugar. The court ruling favors the company by rejecting the substantial financial claim.",
            "Sentiment": "positive",
            "PublishDate": 1759236711489,
            "Source": "stock"
        },
        {
            "Title": "Dalmia Bharat Sugar Acquires 51% Stake in UAE-Based Eagle Agrotech Holdings for $1 Million",
            "Summary": "Dalmia Bharat Sugar and Industries Limited entered into a Share Subscription cum Shareholders Agreement with Eagle Agrotech Holdings Limited and H.E. Mr. Mohamed Ali Rashed Alabbar on September 26, 2025. The company will acquire a 51% shareholding in Eagle Agrotech Holdings Limited (EAHL) for cash consideration up to US $1 million through a mix of shares and other instruments at face value. EAHL is a UAE-incorporated company that serves as a holding company for Eagle Agrotech Tanzania Limited, which is establishing sugarcane plantation and sugar factory operations in Tanzania. The acquisition is aimed at extending Dalmia Bharat Sugar's operations outside India and is expected to complete within six months. No governmental or regulatory approvals are required for this transaction.",
            "Sentiment": "positive",
            "PublishDate": 1758888820257,
            "Source": "order&deals"
        },
        {
            "Title": "Dalmia Bharat Sugar Partners With Eagle Agrotech For Tanzania Sugarcane Operations",
            "Summary": "Dalmia Bharat Sugar And Industries has partnered with Eagle Agrotech to establish sugarcane plantation and factory operations in Tanzania. The collaboration aims to develop sugar production infrastructure in the East African country.",
            "Sentiment": "positive",
            "PublishDate": 1758888360379,
            "Source": "order&deals"
        },
        {
            "Title": "NCLT Chennai Approves Demerger of Dalmia Bharat Sugar's DMC and GT Units to Dalmia Bharat Refractories",
            "Summary": "The National Company Law Tribunal Chennai sanctioned a scheme of arrangement for the demerger of Dalmia Bharat Sugar and Industries Limited's DMC Unit and GT Unit into Dalmia Bharat Refractories Limited. The NCLT order was pronounced on September 12, 2025, with the appointed date being July 1, 2023. The share exchange ratio is set at 1 equity share of Dalmia Bharat Refractories for every 48.18 equity shares of Dalmia Bharat Sugar. The demerger aims to segregate non-core businesses from the sugar business and enable focused management. All statutory authorities including BSE, NSE, CSE, and MSE provided their observations and no-objection letters. The scheme will become effective once the certified copy of the NCLT order is filed with the Registrar of Companies, Chennai.",
            "Sentiment": "positive",
            "PublishDate": 1758289003240,
            "Source": "corporate_action"
        },
        {
            "Title": "Dalmia Bharat Sugar Seeks Exchange Approval for Birla Tyres Reclassification to Public Category",
            "Summary": "Dalmia Bharat Sugar and Industries Limited submitted an application to BSE and NSE on August 07, 2025, seeking approval for reclassifying Birla Tyres Limited from 'promoter and promoter group' category to 'public' category. The application follows the company's board approval of Birla Tyres' reclassification request. This disclosure continues previous communications dated July 03, 2025 regarding the initial request and August 05, 2025 regarding board meeting outcomes.",
            "Sentiment": "neutral",
            "PublishDate": 1754636219211,
            "Source": "corporate_action"
        },
        {
            "Title": "Dalmia Bharat Sugar Reports Q1 Results, Appoints New Unit Head and Approves Promoter Group Reclassification",
            "Summary": "Dalmia Bharat Sugar and Industries Limited approved its unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 942.87 crore compared to Rs 960.26 crore in the same quarter last year. Net profit after tax stood at Rs 38.37 crore versus Rs 54.73 crore in the previous year quarter. The board appointed Sanjeev Raghunathrao Desai as Unit Head of Ninaidevi Unit for a two-year term. Desai brings 35 years of experience in managing sugar units and holds a Master's degree in Commerce. The board also approved Birla Tyres Limited's request for reclassification from 'Promoter and Promoter Group' category to 'Public' category. Birla Tyres became a wholly owned subsidiary of Himadri Specialty Chemical Limited effective April 7, 2025, and holds no shares in Dalmia Bharat Sugar. The company's credit rating was upgraded to CARE AA+ with stable outlook.",
            "Sentiment": "neutral",
            "PublishDate": 1754402602554,
            "Source": "earnings"
        },
        {
            "Title": "Dalmia Bharat Sugar Reports Decline in Q1 Profitability and Margins",
            "Summary": "Dalmia Bharat Sugar and Industries reported Q1 EBITDA of 860 million rupees compared to 1.11 billion rupees in the same period last year. The company's EBITDA margin decreased to 9.12% from 11.56% year-over-year. Net profit fell to 384 million rupees from 547 million rupees in the previous year's corresponding quarter. Revenue declined slightly to 9.4 billion rupees from 9.6 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1754401878722,
            "Source": "earnings"
        },
        {
            "Title": "Dalmia Bharat Sugar Receives Court Relief to Move Industrial Alcohol Trucks Amid Fee Dispute",
            "Summary": "Dalmia Bharat Sugar and Industries Limited received an interim order from the Allahabad High Court allowing the company to move trucks containing industrial alcohol from its distillery. The order requires the company to maintain proper records and furnish an indemnity bond before the district's Excise Officer. This follows a demand from the Uttar Pradesh government for export pass fees of Rs. 21.10 crore on ethanol supply, covering the period from 2018-19 to 2025-26. The company had challenged this demand through the UP Sugar Mills Association. The court arrangement remains subject to further orders and the final result of the writ petition.",
            "Sentiment": "positive",
            "PublishDate": 1754107320681,
            "Source": "stock"
        },
        {
            "Title": "Dalmia Bharat Sugar Challenges Rs 21.10 Crore Export Pass Fee Demand in High Court",
            "Summary": "Dalmia Bharat Sugar and Industries Limited has challenged a Rs 21.10 crore demand for export pass fees on ethanol supply raised by the Uttar Pradesh government. The company filed a petition through the UP Sugar Mills Association in the Lucknow Bench of Allahabad High Court, contesting the retrospective fees covering 2018-19 to 2025-26. The demand follows a Supreme Court order dated October 23, 2024, which upheld states' authority to regulate import/export of denatured power alcohol/spirits. The company expects to get the demand quashed by the High Court and states there is no material impact on operations except for the amount of the demand itself.",
            "Sentiment": "negative",
            "PublishDate": 1753375834612,
            "Source": "stock"
        },
        {
            "Title": "Dalmia Bharat Reports 171% Jump in Net Profit Despite Missing Analyst Estimates",
            "Summary": "Cement maker Dalmia Bharat reported net profit of ₹393 crore for the quarter ended June 30, 2025, representing a 171% year-on-year increase from ₹145 crore, though falling short of analyst expectations of ₹425 crore. Revenue from operations grew marginally by 0.4% to ₹3,636 crore, missing estimates of ₹3,710 crore. EBITDA surged 32% to ₹883 crore, beating estimates of ₹831 crore and marking the company's highest recorded quarterly EBITDA. EBITDA margin expanded significantly to 24.3% from 18.5% in the previous year. The company announced a cement capacity expansion of 6 million tonnes per annum at its Kadapa plant and revealed strategic investments of ₹3,287 crore for a new clinker and grinding unit. Sales volume stood at 7 million tonnes with net sales realisation per tonne increasing 6.6% to ₹5,193. The company divested a 4.1% stake in Indian Energy Exchange, reducing its total holding to 10.8%. Shares closed up 2.46% at ₹2,319.15.",
            "Sentiment": "positive",
            "PublishDate": 1753192789796,
            "Source": "earnings"
        },
        {
            "Title": "Dalmia Bharat Sugar: Last Day to Buy Shares for Dividend Eligibility",
            "Summary": "June 27 is the last day to buy Dalmia Bharat Sugar shares to qualify for the Rs 1.50 per share final dividend. The record date is set for June 30. The company's Q4 profit doubled to Rs 206 crore, with revenue up 35.6% YoY to Rs 1,017 crore.",
            "Sentiment": "positive",
            "PublishDate": 1750996452000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dalmia Bharat Sugar and Industries Ltd: Q4 Profit Doubles, Shares Hit Five-Month High",
            "Summary": "Dalmia Bharat Sugar's Q4 consolidated net profit doubled to Rs 206 crore, with revenue up 35.6% YoY to Rs 1,017 crore. Distillery revenue jumped 43.15%, sugar segment revenue rose 32.42%. EBITDA increased 63.02% YoY, with margin expanding 320 bps. Sugar sales reached 1.5 LMT, with exports at 0.1 LMT. Average sugar selling price rose 5% YoY to Rs 38.9 per kg. Shares hit a five-month high, rising up to 12.29%.",
            "Sentiment": "positive",
            "PublishDate": 1747200546000,
            "Source": "earnings"
        },
        {
            "Title": "Dalmia Bharat Sugar Reports Q4 Results and Dividend Recommendation",
            "Summary": "Dalmia Bharat Sugar and Industries has recommended a dividend of 1.5 rupees per equity share. The company's Q4 EBITDA increased to 1.95 billion rupees from 1.39 billion rupees year-over-year. The EBITDA margin also improved to 19.16% from 18.56% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747147702000,
            "Source": "result"
        },
        {
            "Title": "Dalmia Bharat Sugar Q4 Profit Surges to 2.1B Rupees",
            "Summary": "Dalmia Bharat Sugar and Industries reported a significant increase in net profit for Q4, rising to 2.1 billion rupees from 913 million rupees year-over-year. The company's revenue also showed strong growth, reaching 10.2 billion rupees compared to 7.5 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747147618000,
            "Source": "result"
        },
        {
            "Title": "Dalmia Bharat Sugar Q3 EBITDA Declines Year-over-Year",
            "Summary": "Dalmia Bharat Sugar and Industries reported a decrease in Q3 EBITDA, falling to 1.03 billion rupees from 1.1 billion rupees in the same quarter last year. The company's EBITDA margin also contracted, dropping to 12.31% from 18.72% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739282471000,
            "Source": "earnings"
        },
        {
            "Title": "Dalmia Bharat Sugar and Industries Reports Q3 Financial Results",
            "Summary": "Dalmia Bharat Sugar and Industries has announced its financial results for the third quarter. The company reported a net profit of 703 million rupees, up from 621 million rupees in the same period last year. Revenue for Q3 increased to 8.4 billion rupees, compared to 5.84 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1739282465000,
            "Source": "earnings"
        },
        {
            "Title": "Bharat Seats Reports Improved Q3 EBITDA and Margin",
            "Summary": "Bharat Seats has announced its Q3 financial results, showing an increase in EBITDA from 146 million rupees to 186 million rupees year-over-year. The company's EBITDA margin also improved, rising from 5.86% to 6.06% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739171468000,
            "Source": "earnings"
        },
        {
            "Title": "Dalmia Bharat Sugar Reports Q2 FY25 Financial Results",
            "Summary": "Dalmia Bharat Sugar and Industries has reported its Q2 FY25 financial results. The company's profit before tax (PBT) decreased to 454 million rupees from 740 million rupees year-over-year. Additionally, the company has deferred tax of 404 million rupees in this quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1730122295000,
            "Source": "result"
        },
        {
            "Title": "Dalmia Bharat Sugar Reports Strong Q2 Financial Results",
            "Summary": "Dalmia Bharat Sugar and Industries has reported a significant increase in its Q2 net profit, rising to 737 million rupees from 549 million rupees year-over-year. The company also saw a quarter-over-quarter increase from 618 million rupees. Revenue for Q2 grew to 9.2 billion rupees, up from 7.32 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730122207000,
            "Source": "result"
        }
    ]
}