{
    "Symbol": "DAMCAPITAL",
    "ISIN": "INE284H01025",
    "News": [
        {
            "Title": "Dam Capital Advisors Q3 Results Show Decline",
            "Summary": "Dam Capital Advisors reports Q3 net profit of 200M rupees, down from 510M rupees year-over-year, while revenue declined to 699M rupees from 1B rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1770129413840,
            "Source": "co_actions_results"
        },
        {
            "Title": "DAM Capital Board Meet on Feb 3 for Q3FY26 Results",
            "Summary": "DAM Capital Advisors has scheduled a board meeting on February 3, 2026, to consider Q3FY26 financial results and approve amendments to its employee stock option scheme under regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1769162387742,
            "Source": "co_actions_results"
        },
        {
            "Title": "DAM Capital Advisors Reports Strong Q2 Performance with 52.15 Crore Net Profit",
            "Summary": "DAM Capital Advisors Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company reported a net profit of Rs. 52.15 crores for the quarter, compared to Rs. 21.67 crores in the previous quarter. For the half year, net profit reached Rs. 103.78 crores. Revenue from operations stood at Rs. 107.05 crores for the quarter, with fees and commission income contributing Rs. 103.43 crores. The company operates through two business segments: stock broking services and investment banking services. Investment banking segment generated Rs. 86.14 crores in revenue for the quarter, while stock broking contributed Rs. 17.34 crores. The Board of Directors approved these results at their meeting held on November 6, 2025. The company's earnings per share for the quarter was Rs. 7.38.",
            "Sentiment": "positive",
            "PublishDate": 1762438329613,
            "Source": "earnings"
        },
        {
            "Title": "DAM Capital Advisors Reports 97% Drop in Quarterly Profit to INR 0.23 Cr",
            "Summary": "DAM Capital Advisors Limited reported financial results for the quarter ended June 30, 2025, with total income of INR 31 Cr and profit after tax of INR 0.23 Cr. The company experienced significant declines with profit dropping 97.3% quarter-on-quarter and 99% year-on-year. Total income fell 15.7% from the previous quarter and 33.3% from the same quarter last year. Merchant banking revenue declined to INR 9 Cr from INR 16 Cr in the previous quarter, while broking services revenue increased slightly to INR 18 Cr. Despite financial challenges, the company executed significant deals including a INR 656 Cr OFS as lead banker, advised on a INR 3,000 Cr stake sale for Vedanta Limited, and completed a INR 150 Cr buyback deal. The company expanded its IPO mandate pipeline by adding 3 new mandates, bringing the total to 27 IPO mandates. Institutional equities business grew with 290 active clients and coverage of 206 stocks across 24 sectors. Managing Director Dharmesh Mehta attributed the subdued performance to cautious market conditions due to geopolitical tensions and macroeconomic uncertainties. The company maintains net cash of INR 234 Cr and expects higher execution volumes in coming quarters subject to market conditions.",
            "Sentiment": "negative",
            "PublishDate": 1753276203982,
            "Source": "earnings"
        },
        {
            "Title": "DAM Capital Advisors Receives Administrative Warning from SEBI",
            "Summary": "DAM Capital Advisors has been issued an administrative warning by the Securities and Exchange Board of India (SEBI) regarding certain matters of their broking operations. SEBI has advised the company to be vigilant in these areas. In response, DAM Capital Advisors states that they have already rectified the issues and implemented necessary compliance measures.",
            "Sentiment": "neutral",
            "PublishDate": 1742775399000,
            "Source": "corporate_governance"
        },
        {
            "Title": "DAM Capital Advisors Ltd: SEBI Issues Warning Over Client Fund Handling",
            "Summary": "DAM Capital Advisors Ltd received an administrative warning from SEBI on March 20, 2025, following a thematic inspection in January 2025. The warning addressed compliance issues in client fund handling during February-August 2024. DAM Capital has implemented measures to address these issues and states the warning will not impact its operations.",
            "Sentiment": "negative",
            "PublishDate": 1742554597000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dam Capital Advisors Reports Strong Q3 Financial Results",
            "Summary": "Dam Capital Advisors has announced its financial results for the third quarter. The company's net profit increased significantly to 510 million rupees, compared to 210 million rupees in the same period last year. Revenue also saw substantial growth, reaching 1.04 billion rupees, up from 450 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737936868000,
            "Source": "earnings"
        },
        {
            "Title": "DAM Capital Advisors Reports Significant Revenue Growth in Q3",
            "Summary": "DAM Capital Advisors has reported a substantial increase in its third-quarter revenue. The company's revenue for Q3 reached 1.04 billion rupees, compared to 450 million rupees in the same period last year, representing a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1737714633000,
            "Source": "earnings"
        },
        {
            "Title": "DAM Capital Advisors Reports Significant Increase in Q3 Net Profit",
            "Summary": "DAM Capital Advisors has reported a substantial increase in its third-quarter net profit. The company's net profit for Q3 stood at 510 million rupees, compared to 210 million rupees in the same period last year, representing a year-over-year growth of approximately 143%.",
            "Sentiment": "positive",
            "PublishDate": 1737714573000,
            "Source": "earnings"
        },
        {
            "Title": "DAM Capital Advisors: Strong Market Debut with 6% Gain on Listing Day",
            "Summary": "DAM Capital Advisors Ltd. shares closed 5.85% higher on the NSE and 5.73% higher on the BSE compared to the listing price. The stock debuted at a 38.87% premium on the NSE and 38.83% on the BSE over the issue price of Rs 283. Intraday, it reached a high of Rs 456.90. The IPO was subscribed 82.08 times, with strong demand from qualified institutional buyers.",
            "Sentiment": "positive",
            "PublishDate": 1735297062000,
            "Source": "result"
        },
        {
            "Title": "DAM Capital Advisors: Shares List with 39% Premium on NSE",
            "Summary": "DAM Capital Advisors shares debuted on the stock market with a strong 38.87% premium, listing at ₹393.00 on NSE and ₹392.90 on BSE. The IPO raised ₹840.25 crore and was oversubscribed 82.08 times. The company is one of India's fastest-growing investment banks, offering services in investment banking and institutional equities.",
            "Sentiment": "positive",
            "PublishDate": 1735273768000,
            "Source": "normal_news"
        }
    ]
}