{
    "Symbol": "DAMODARIND",
    "ISIN": "INE497D01022",
    "News": [
        {
            "Title": "Damodar Industries promoters acquire additional shares",
            "Summary": "Damodar Industries promoter group led by Arun Kumar Biyani acquired 5,000 additional shares through open market purchase, increasing their collective holding to 23.93% from 23.91%.",
            "Sentiment": "neutral",
            "PublishDate": 1770100150278,
            "Source": "co_actions_results"
        },
        {
            "Title": "Damodar Industries Postal Ballot Results Announced",
            "Summary": "Damodar Industries Limited announced postal ballot results concluded on January 22, 2026. Three resolutions on remuneration revisions failed while one on director re-appointment passed.",
            "Sentiment": "neutral",
            "PublishDate": 1769174062978,
            "Source": "stocks"
        },
        {
            "Title": "Damodar Industries Q3FY26 Net Profit Drops 38.4%",
            "Summary": "Damodar Industries reported Q3FY26 net profit of ₹98.88 lakhs, down 38.4% YoY from ₹160.54 lakhs. Revenue declined 22.4% to ₹9,328.91 lakhs amid challenging market conditions.",
            "Sentiment": "negative",
            "PublishDate": 1768571316372,
            "Source": "co_actions_results"
        },
        {
            "Title": "Damodar Industries Announces Postal Ballot for Key Resolutions",
            "Summary": "Damodar Industries Limited has issued a postal ballot notice seeking shareholder approval for revision of remuneration for key directors and re-appointments, with e-voting scheduled from December 24, 2025 to January 22, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766495310229,
            "Source": "stocks"
        },
        {
            "Title": "Damodar Industries Board Approves Key Leadership Changes and Remuneration Revisions",
            "Summary": "Damodar Industries' Board approved remuneration revisions for Managing Director Aman Arun Biyani and Director Aditya A Biyani effective November 28, 2025, subject to shareholder approval. The Board also approved re-appointments of Chairman Arunkumar Biyani for 3 years from March 31, 2026 and Independent Director Mamta Biyani for 5 years from February 8, 2026, both pending shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1764332956014,
            "Source": "corporate_governance"
        },
        {
            "Title": "Damodar Industries Promoter Pledges 24.7 Lakh Shares for Additional Financing",
            "Summary": "Arunkumar Biyani pledged 24,70,000 equity shares of Damodar Industries Limited to State Bank of India on November 17, 2025, representing 10.60% of total share capital. The pledge was created for additional securities towards term loan and working capital requirements, increasing his total encumbered shareholding to 21.20%.",
            "Sentiment": "neutral",
            "PublishDate": 1763466033855,
            "Source": "corporate_action"
        },
        {
            "Title": "Damodar Industries Reports Quarterly Results with Net Sales of ₹12,188.87 Lacs",
            "Summary": "Damodar Industries Limited approved its unaudited financial results for the quarter and half year ended September 30, 2025. The company reported net sales of ₹12,188.87 lacs for the quarter, compared to ₹10,335.24 lacs in the previous quarter and ₹9,671.63 lacs in the same quarter last year. For the half year, net sales reached ₹22,524.11 lacs versus ₹21,602.17 lacs in the previous period. The company posted a profit after tax of ₹174.68 lacs for the quarter, up from ₹232.19 lacs in the previous quarter. Earnings per share stood at ₹0.75 for the quarter. The Board also approved an advertisement for inviting fixed deposits. The company maintains a paid-up share capital of ₹1,165 lacs with total equity of ₹14,744.72 lacs.",
            "Sentiment": "positive",
            "PublishDate": 1760439521749,
            "Source": "earnings"
        },
        {
            "Title": "Damodar Industries Promoter Arunkumar Biyani Acquires 5.66% Stake Through Gift Transfer",
            "Summary": "Arunkumar Biyani, promoter of Damodar Industries Limited, acquired 1,320,000 equity shares representing 5.66% of the company's diluted share capital through an inter-se transfer in the nature of a gift. The shares were transferred from Mr. Anil D Biyani and Mrs. Sanju Biyani on August 26, 2025, at no consideration. Following this transaction, Arunkumar Biyani's shareholding increased from 12.50 lakh shares (5.37%) to 55.70 lakh shares (23.90%). The transferors' combined holding decreased from 38.40 lakh shares (16.49%) to 25.20 lakh shares (10.82%). The transaction was conducted under exemption provisions of SEBI takeover regulations and required disclosure was made within the specified timeline.",
            "Sentiment": "neutral",
            "PublishDate": 1756380727754,
            "Source": "corporate_action"
        },
        {
            "Title": "Damodar Industries Reports Net Profit of Rs 232.19 Lacs in Quarter Ended June 2025",
            "Summary": "Damodar Industries Limited reported net profit of Rs 232.19 lacs for the quarter ended June 30, 2025, compared to a net loss of Rs 150.65 lacs in the same quarter of the previous year. Net sales from operations stood at Rs 10,335.27 lacs versus Rs 11,930.54 lacs in the corresponding quarter last year. Total income from operations was Rs 10,633.34 lacs compared to Rs 12,325.78 lacs in the prior year quarter. The company's profit from operations before exceptional items was Rs 167.42 lacs against a loss of Rs 521.38 lacs in the same period last year. Earnings per share (basic and diluted) was Rs 1.00 for the quarter. The company operates in the textile goods segment and has a paid-up share capital of Rs 1,165 lacs.",
            "Sentiment": "positive",
            "PublishDate": 1754119199549,
            "Source": "earnings"
        },
        {
            "Title": "Damodar Industries Appoints Pankaj Srivastava as Independent Director, Schedules 37th AGM",
            "Summary": "Damodar Industries Limited appointed Mr. Pankaj Srivastava as an Additional Director in the Independent category, effective July 24, 2025, subject to shareholder approval. Srivastava brings experience in Financial, Sales & Marketing and Risk Management and is not related to any existing Director or Key Managerial Personnel of the company. The Board also approved convening the company's 37th Annual General Meeting for Financial Year 2024-25. These decisions were taken during a Board meeting held at the company's registered office in Mumbai.",
            "Sentiment": "positive",
            "PublishDate": 1753350747876,
            "Source": "corporate_governance"
        },
        {
            "Title": "Damodar Industries Schedules Board Meeting to Appoint Independent Director and Approve AGM Notice",
            "Summary": "Damodar Industries Limited has scheduled a Board of Directors meeting for July 24, 2025, at its registered office in Mumbai. The meeting agenda includes appointing Mr. Pankaj Srivastava (DIN-06716582) as an Additional Independent Director and approving the Annual General Meeting notice for Financial Year 2024-25. The company has notified both BSE and NSE about the board meeting in compliance with listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1753160974656,
            "Source": "corporate_action"
        }
    ]
}