{
    "Symbol": "DANISH",
    "ISIN": "INE0YU901016",
    "News": [
        {
            "Title": "Danish Power Secures ₹51.38 Cr Order from CPSE",
            "Summary": "Danish Power Limited's shares rose 2.3% after securing a ₹51.38 crore order from a Miniratna CPSE for Inverter Duty Transformers. The order involves design, manufacturing, and commissioning within 5-6 months.",
            "Sentiment": "positive",
            "PublishDate": 1768291952741,
            "Source": "co_actions_results"
        },
        {
            "Title": "Danish Power Secures Rs 19.50 Crore Order",
            "Summary": "Danish Power has received a new order worth Rs 19.50 crore. The order represents a business development for the SME company, though specific details about the nature of the order or client were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1764137700924,
            "Source": "order&deals"
        },
        {
            "Title": "Danish Power Reports 17% Growth in H1 EBITDA to 373M Rupees",
            "Summary": "Danish Power reported H1 EBITDA of 373 million rupees compared to 318 million rupees in the previous year, representing year-over-year growth. However, the company's EBITDA margin decreased to 17.63% from 19.3% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1762423258294,
            "Source": "earnings"
        },
        {
            "Title": "Danish Power Reports 45% Jump in H1 Consolidated Net Profit to 290M Rupees",
            "Summary": "Danish Power announced consolidated net profit of 290 million rupees for the first half, representing a significant increase from 200 million rupees in the same period last year. The company achieved a 45% year-on-year growth in profitability during this six-month period.",
            "Sentiment": "positive",
            "PublishDate": 1762422756044,
            "Source": "earnings"
        },
        {
            "Title": "Danish Power: SME Debut with 64% Premium Expected",
            "Summary": "Danish Power shares to list on NSE SME platform today. Grey market premium indicates potential 64% gain over IPO price of Rs 380. The company raised Rs 198 crore through fresh equity sale, the largest SME IPO this year. Funds to be used for manufacturing expansion, working capital, and debt repayment.",
            "Sentiment": "positive",
            "PublishDate": 1730172027000,
            "Source": "normal_news"
        }
    ]
}