{
    "Symbol": "DATAPATTNS",
    "ISIN": "INE0IX101010",
    "News": [
        {
            "Title": "Data Patterns Q3 Revenue Surges 48% YoY to Rs. 179 Cr",
            "Summary": "Data Patterns (India) Limited reports strong Q3 FY26 performance with revenue growth of 48% YoY to Rs. 179 Cr, EBITDA growth of 44% to Rs. 78 Cr, and order book reaching all-time high of Rs. 1,868 Cr.",
            "Sentiment": "positive",
            "PublishDate": 1770294248079,
            "Source": "co_actions_results"
        },
        {
            "Title": "Data Patterns Board Meet Set for Feb 5 for Q3 Results",
            "Summary": "Data Patterns (India) Limited has scheduled a board meeting on February 05, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769689037660,
            "Source": "co_actions_results"
        },
        {
            "Title": "Data Patterns Credit Rating Upgraded by ICRA",
            "Summary": "ICRA upgrades Data Patterns' long-term credit rating to A- (Stable) from A- (Positive), while reaffirming short-term rating at A1 for total bank facilities worth ₹775 crores.",
            "Sentiment": "positive",
            "PublishDate": 1766576127125,
            "Source": "stocks"
        },
        {
            "Title": "DataPatterns India Reports Strong Q2 FY26 Growth with Revenue Doubling to INR 407 Crores",
            "Summary": "DataPatterns India delivered robust quarterly results with revenue more than doubling year-on-year to INR 407 crores in H1 FY26, driven by strong execution across multiple programs including a strategic INR 180 crore contract. The company maintains a healthy order book of around INR 1,300 crores with fresh order inflows of INR 351 crores during H1, including significant orders from BrahMos and ECIL, positioning it well for continued growth in defense systems.",
            "Sentiment": "positive",
            "PublishDate": 1763555627408,
            "Source": "earnings"
        },
        {
            "Title": "Data Patterns India Submits Q2 FY2026 Monitoring Report for QIP Proceeds Utilization",
            "Summary": "Data Patterns (India) Limited submitted its monitoring agency report for Q2 FY2026, showing utilization of INR 438.091 crore out of INR 487.734 crore raised through QIP, with INR 49.643 crore remaining unutilized and invested in fixed deposits. ICRA Limited reported no deviation from the stated objects of the issue, with funds used for working capital, product development, debt repayment, capital expenditure, land acquisition, and general corporate purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1763132510670,
            "Source": "corporate_action"
        },
        {
            "Title": "Data Patterns India Raises Revenue Guidance, Maintains Profit Outlook",
            "Summary": "Data Patterns India management announced a slight increase in revenue guidance during a conference call. The company's bottom line guidance remains unchanged from previous projections.",
            "Sentiment": "neutral",
            "PublishDate": 1763011963488,
            "Source": "stock"
        },
        {
            "Title": "Data Patterns Reports ₹4,000 Cr Order Book Growth, Plans Chennai Facility Expansion",
            "Summary": "Data Patterns (India) reported a ₹4,000 crore order book, representing 30% year-over-year growth. The company is expanding its defence electronics capabilities across radar, electronic warfare, and missile systems. The firm is increasing its export activities and private sector defence collaborations. Data Patterns plans to establish a new facility in Chennai to enhance production capacity and integrate research and development operations.",
            "Sentiment": "positive",
            "PublishDate": 1762963516838,
            "Source": "stock"
        },
        {
            "Title": "Data Patterns Reports Strong Q2 Revenue Growth Despite Margin Decline",
            "Summary": "Data Patterns reported Q2 net profit of 492 million rupees, up from 303 million rupees in the same period last year. Revenue surged to 3.1 billion rupees compared to 910 million rupees year-over-year. EBITDA increased to 680 million rupees from 343 million rupees, though EBITDA margin declined to 22.08% from 37.69% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762955251126,
            "Source": "earnings"
        },
        {
            "Title": "Data Patterns Promoter Rekha Murthy Rangarajan's Shareholding Drops to 24.06% Following Pledge Release",
            "Summary": "Ms. Rekha Murthy Rangarajan, a promoter and Whole-time Director of Data Patterns (India) Limited, reported a decrease in her total shareholding from 26.65% to 24.06% of the company's share capital. The change occurred through the release of pledge on 14,48,122 shares (2.59% of share capital) between September 17-19, 2025, conducted off-market. Her voting rights holding remained unchanged at 1,06,49,948 shares (19.02%), while her encumbered shares decreased from 42,69,188 shares (7.63%) to 28,21,066 shares (5.04%). The company's total equity share capital remained constant at 1,06,49,948 shares. Data Patterns is listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1758607999188,
            "Source": "corporate_action"
        },
        {
            "Title": "Data Patterns Q1 FY26 Revenue Drops 4.6% to INR99 Crores Due to Customer Approval Delays",
            "Summary": "Data Patterns (India) Limited reported Q1 FY26 revenue of INR99 crores, down 4.6% year-on-year due to customer approval delays affecting dispatches and revenue recognition. Despite lower revenue, EBITDA stood at INR32 crores with 32.3% margin, while net profit was INR25.5 crores at 25.7% margin. The company maintains a strong order book of INR1,079 crores with over INR320 crores in new orders since the financial year began, including orders from BrahMos and Ministry of Defence. Export order book remains healthy at INR100 crores. Management expects revenue pickup from Q2 onwards and reaffirmed full-year growth guidance of 20-25% revenue growth while maintaining EBITDA margins of 35-40%. The company has invested over INR120 crores in new product development across radar systems, electronic warfare, communication systems and airborne systems. Employee costs increased 27% year-on-year due to headcount additions and wage revisions as the company scales operations.",
            "Sentiment": "neutral",
            "PublishDate": 1755088139442,
            "Source": "earnings"
        },
        {
            "Title": "Data Patterns Re-appoints Key Leadership and Names New Secretarial Auditor",
            "Summary": "Data Patterns (India) Limited shareholders approved the re-appointment of Srinivasagopalan Rangarajan as Chairman and Managing Director and Rekha Murthy Rangarajan as Whole-time Director, both for five-year terms from September 14, 2025 to September 13, 2030. The company also appointed Alagar & Associates LLP as Secretarial Auditor for five years starting FY 2025-26. The decisions were approved at the company's 27th Annual General Meeting held on August 8, 2025. Srinivasagopalan Rangarajan has been associated with the company since incorporation and holds engineering degrees from University of Madras and IIT Madras. Rekha Murthy Rangarajan, also with the company since incorporation, holds degrees from Bangalore University and Madras University. The two directors are spouses.",
            "Sentiment": "neutral",
            "PublishDate": 1754922365464,
            "Source": "corporate_governance"
        },
        {
            "Title": "Data Patterns Expects Rs. 2,000-3,000 Crore Orders Over Next 18-24 Months",
            "Summary": "Data Patterns anticipates receiving orders worth Rs. 2,000-3,000 crore over the next 18-24 months. The company expects over Rs. 1,000 crore in orders by year end or early next year.",
            "Sentiment": "positive",
            "PublishDate": 1754883172347,
            "Source": "stock"
        },
        {
            "Title": "Data Patterns Targets 20-25% Revenue Growth with 35-40% EBITDA Margin Guidance",
            "Summary": "Data Patterns expects 20-25% revenue growth for the whole year with EBITDA margin guidance between 35-40%. The company anticipates revenue growth to accelerate from Q2 onwards and aims to achieve 30,000 crore revenue within the next three years.",
            "Sentiment": "positive",
            "PublishDate": 1754882684245,
            "Source": "stock"
        },
        {
            "Title": "Data Patterns Targets ₹2,000-2,400 Crores Revenue in 2-3 Years with ₹150 Crores Investment Plan",
            "Summary": "Data Patterns has set a revenue target of ₹2,000-2,400 crores over the next 2-3 years. The company plans to invest ₹150 crores in technology and capital expenditure while maintaining EBITDA margins of 35-40%. The company reports having a strong order pipeline valued at ₹2,000-3,000 crores.",
            "Sentiment": "positive",
            "PublishDate": 1754577985279,
            "Source": "stock"
        },
        {
            "Title": "Data Patterns Reports Decline in Q1 Financial Performance",
            "Summary": "Data Patterns reported Q1 net profit of 255 million rupees, down from 328 million rupees in the same period last year. Revenue decreased to 993 million rupees from 1.04 billion rupees year-over-year. EBITDA fell to 321 million rupees compared to 372 million rupees previously, while EBITDA margin contracted to 32.30% from 35.72% in the prior year period.",
            "Sentiment": "negative",
            "PublishDate": 1754573491867,
            "Source": "earnings"
        },
        {
            "Title": "Data Patterns: Government of Singapore Reduces Stake Post Stock Rally",
            "Summary": "The Government of Singapore sold 2.85 lakh shares (0.5%) of Data Patterns Ltd. at ₹2,728.56 per share, totaling ₹78 crore. The sale follows a recent stock price run-up. Data Patterns aims for increased order inflow in FY2026. Nuvama brokerage maintains it as a top defense sector pick with a ₹3,700 price target.",
            "Sentiment": "neutral",
            "PublishDate": 1747876456000,
            "Source": "block_deals"
        },
        {
            "Title": "Data Patterns: Successful Q4 Results and Order Book Growth",
            "Summary": "Data Patterns secured major RADAR and EW orders from MoD and PSUs. The company developed and delivered transportable precision approach RADARs. BrahMos testing successful, with production orders expected this year. There's a mandate to replace imported seekers with Indian ones.",
            "Sentiment": "positive",
            "PublishDate": 1747712741000,
            "Source": "result"
        },
        {
            "Title": "Data Patterns Confident in Future Revenue Growth and EBITDA Margins",
            "Summary": "Data Patterns has expressed confidence in achieving revenue growth of 25% to 30% or 20% to 25% for FY26 while maintaining strong EBITDA margins between 35% to 40%, according to a concall update.",
            "Sentiment": "positive",
            "PublishDate": 1747711908000,
            "Source": "default"
        },
        {
            "Title": "Data Patterns: Jefferies Raises Target Price on Strong Q4 Performance",
            "Summary": "Jefferies increased Data Patterns' target price to Rs 3,400 from Rs 2,690 after Q4 results. Net profit rose 60.5% to Rs 114 crore, revenue up to Rs 396 crore. Company guides for FY26 orders of Rs 1,000-1,500 crore. Management maintains 20-25% medium-term revenue growth and 35-40% margin profile.",
            "Sentiment": "positive",
            "PublishDate": 1747707325000,
            "Source": "earnings"
        },
        {
            "Title": "Data Patterns (India) Ltd: Targets 20-25% Growth for FY26",
            "Summary": "Data Patterns (India) Ltd, a defence and aerospace electronics solutions provider, aims for 20-25% growth in revenue and profit for FY26. The company expects continued growth from product deliveries and completed trials, anticipating contract conversions.",
            "Sentiment": "positive",
            "PublishDate": 1747703395000,
            "Source": "normal_news"
        },
        {
            "Title": "Data Patterns (India) Ltd: Q4 Profit Surges 60%, Share Price Hits 8-Month High",
            "Summary": "Data Patterns reported a 60% increase in Q4 FY2025 profit to Rs 114 crore. Revenue more than doubled to Rs 396 crore. The company announced a final dividend of Rs 7.9 per share. Order book stands at Rs 729.84 crore as of March. Share price rose 9.54% to Rs 3,141.70, an 8-month high.",
            "Sentiment": "positive",
            "PublishDate": 1747631040000,
            "Source": "earnings"
        },
        {
            "Title": "Data Patterns Aims for 20-25% Revenue Growth and 35-40% EBITDA Margins",
            "Summary": "Data Patterns has announced its financial targets for the upcoming year in an investor presentation. The company aims to maintain a revenue growth of 20-25% and EBITDA margins between 35-40%. Additionally, Data Patterns reports a robust order pipeline valued at ₹20-30 billion over the next 18-24 months.",
            "Sentiment": "positive",
            "PublishDate": 1747621964000,
            "Source": "default"
        },
        {
            "Title": "Data Patterns Reports Q4 Results and Recommends Final Dividend",
            "Summary": "Data Patterns has announced its Q4 results and recommended a final dividend. The company's Q4 EBITDA increased to 1.48 billion rupees from 933 million rupees year-over-year, while the EBITDA margin decreased to 37.37% from 51.27%. Net profit for Q4 rose to 1.14 billion rupees from 711 million rupees in the previous year. Revenue for the quarter grew to 3.96 billion rupees from 2 billion rupees year-over-year. The company has recommended a final dividend of 7.90 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747493762000,
            "Source": "result"
        },
        {
            "Title": "Hindustan Adhesives Approves Investment in PT. Bagla Group Indonesia",
            "Summary": "Hindustan Adhesives Limited has approved an investment in PT. Bagla Group Indonesia. This decision represents a strategic move by the company to expand its presence in the Indonesian market, potentially enhancing its global footprint in the adhesives industry.",
            "Sentiment": "positive",
            "PublishDate": 1741592865000,
            "Source": "corporate_action"
        },
        {
            "Title": "Data Patterns Focuses on Future Product Development and Export Strategy",
            "Summary": "Data Patterns is working on products planned for Q1 of 2025-26 as a backup strategy. The company is also internally developing export-worthy products, which is part of their medium to long-term approach. This information was shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1738899360000,
            "Source": "corporate_action"
        },
        {
            "Title": "Data Patterns Anticipates Significant Contract Wins and Maintains Profit Margins",
            "Summary": "Data Patterns expects to secure contracts valued between Rs 2 billion to Rs 3 billion in the coming 5-8 months. The company plans to deliver a diverse product mix to maintain profit after tax (PAT) numbers in future quarters. Management has reaffirmed its commitment to retaining gross margins as previously forecasted.",
            "Sentiment": "positive",
            "PublishDate": 1738899032000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Data Patterns Reaffirms Revenue Growth and EBITDA Margin Targets for FY25",
            "Summary": "Data Patterns has confirmed its commitment to achieving its full-year revenue growth guidance of 20% to 25% for FY25 while maintaining strong EBITDA margins between 35% to 40%. The company anticipates a significant increase in performance during Q4 to meet these targets, as stated in a recent conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1738898919000,
            "Source": "earnings"
        },
        {
            "Title": "Data Patterns Reports Decline in Q3 Financial Performance",
            "Summary": "Data Patterns, an Indian company, has reported its financial results for the third quarter. The company's net profit decreased to 447 million rupees from 510 million rupees in the same quarter last year. Similarly, revenue declined to 1.17 billion rupees from 1.4 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738801256000,
            "Source": "earnings"
        },
        {
            "Title": "Data Patterns Reports Mixed Q3 Financial Results",
            "Summary": "Data Patterns, an Indian company, has released its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q3 was 541 million rupees, down from 597 million rupees in the same quarter last year. However, the EBITDA margin improved to 46.2% from 42.96% year-over-year, indicating better operational efficiency despite lower earnings.",
            "Sentiment": "neutral",
            "PublishDate": 1738760870000,
            "Source": "earnings"
        },
        {
            "Title": "Data Patterns Reports Decline in Q3 Financial Performance",
            "Summary": "Data Patterns, an Indian technology company, has reported a decrease in both net profit and revenue for the third quarter compared to the same period last year. The company's net profit fell to 447 million rupees from 510 million rupees, while revenue decreased to 1.17 billion rupees from 1.4 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738760863000,
            "Source": "earnings"
        },
        {
            "Title": "Data Patterns to Consider Q3 Results",
            "Summary": "Data Patterns has announced that it will consider its third quarter (Q3) financial results on February 5.",
            "Sentiment": "neutral",
            "PublishDate": 1738241666000,
            "Source": "result"
        },
        {
            "Title": "Data Patterns (India) Ltd.: Target Price Upgraded on Strong R&D and Growth Outlook",
            "Summary": "Nirmal Bang raises Data Patterns' target price to Rs 2,997 from Rs 2,881, maintaining a 'buy' rating. The upgrade is based on the company's strong R&D capabilities, diverse customer base, and solid order book. Management guides for 20-25% revenue growth and 35-40% Ebitda margins for FY25. The company plans to spend over Rs 150 crore on capex in the next two years to meet increasing demand.",
            "Sentiment": "positive",
            "PublishDate": 1734321333000,
            "Source": "normal_news"
        },
        {
            "Title": "Data Patterns: Q2 Performance Impacted by Revenue Deferment",
            "Summary": "Data Patterns experienced a setback in Q2 performance due to revenue deferment, according to a review by Motilal Oswal.",
            "Sentiment": "negative",
            "PublishDate": 1731389218000,
            "Source": "result"
        },
        {
            "Title": "Data Patterns Anticipates Initial Development Contracts Post-Demonstrations",
            "Summary": "Data Patterns, a company in the defense sector, expects to secure initial development contracts following demonstrations of their products. The company plans to proceed with various levels of trials after these demonstrations. This information was shared during a conference call update, suggesting the company is progressing in its business development efforts.",
            "Sentiment": "positive",
            "PublishDate": 1731383111000,
            "Source": "corporate_action"
        },
        {
            "Title": "Data Patterns Reports Strong Order Book and Future Targets",
            "Summary": "Data Patterns has secured orders worth INR 83.5 crores in the first half of the year, followed by additional orders of INR 82.7 crores in October. The company is aiming to secure further orders ranging from INR 2,000 crores to INR 3,000 crores over the next 18 to 24 months, as reported in a recent concall update.",
            "Sentiment": "positive",
            "PublishDate": 1731382950000,
            "Source": "result"
        },
        {
            "Title": "Data Patterns Reports Strong Order Book and Pipeline",
            "Summary": "Data Patterns announced that its order book stands at approximately INR971 crore as of September 30. The company has already received INR160 crore in October and has L1 orders worth around INR200 crore. Additionally, there are potential orders of INR300-400 crore in the pipeline, as revealed during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1731382868000,
            "Source": "result"
        },
        {
            "Title": "Data Patterns Aims for Significant Growth in Next 3-5 Years",
            "Summary": "Data Patterns has announced ambitious growth plans during a recent concall. The company is targeting to scale its business by 3-5 times its current size within the next 3-5 years. Additionally, Data Patterns is aiming to secure new orders worth Rs 2,000 crore to Rs 3,000 crore in the next 18 to 24 months.",
            "Sentiment": "positive",
            "PublishDate": 1731382006000,
            "Source": "corporate_action"
        },
        {
            "Title": "Data Patterns Announces Order Inflow Guidance",
            "Summary": "Data Patterns has provided its order inflow guidance for the current fiscal year, projecting Rs 7-8 billion. The company also anticipates orders worth Rs 20 billion in the fiscal year 2026.",
            "Sentiment": "positive",
            "PublishDate": 1731296542000,
            "Source": "corporate_action"
        },
        {
            "Title": "Data Patterns Reports Strong Order Book Outlook",
            "Summary": "Data Patterns, an Indian company, has announced a robust order book pipeline valued at Rs 20-30 billion (approximately $240-360 million) expected over the next 18 months. This indicates a positive business outlook for the company in the near future.",
            "Sentiment": "positive",
            "PublishDate": 1731296535000,
            "Source": "normal_news"
        },
        {
            "Title": "Data Patterns Projects 20-25% Revenue Growth",
            "Summary": "Data Patterns has announced its outlook for the next two to three years, projecting a revenue growth rate of 20-25%. The company also aims to maintain EBITDA margins around 35-40% for the full year. This forward-looking statement demonstrates the company's commitment to sustained growth and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1731296529000,
            "Source": "corporate_action"
        },
        {
            "Title": "Data Patterns Reports Mixed Q2 Results",
            "Summary": "Data Patterns, an Indian company, has released its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 was 343 million rupees, down from 403 million rupees in the same quarter last year. However, the EBITDA margin improved slightly to 37.69% from 37.29% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731288922000,
            "Source": "result"
        },
        {
            "Title": "Data Patterns: Q2 Profit Dips, H1 Shows Growth",
            "Summary": "Data Patterns (India) Ltd reported Q2 FY2024-25 profit after tax of ₹30.28 crore, down from ₹33.79 crore year-on-year. H1 profit increased to ₹63.07 crore. Q2 total income declined to ₹103.06 crore. Order book stands at ₹1,053.22 crore as of September 30, 2024. Management expects improved order inflow in H2.",
            "Sentiment": "neutral",
            "PublishDate": 1731240738000,
            "Source": "result"
        }
    ]
}