{
    "Symbol": "DATAMATICS",
    "ISIN": "INE365B01017",
    "News": [
        {
            "Title": "Datamatics Receives IT Dept Order on Transfer Pricing",
            "Summary": "Datamatics Global Services receives Income Tax Department order under Section 144C(1) for AY 2023-24 regarding transfer pricing adjustments. Company plans to appeal, expects no material impact on operations.",
            "Sentiment": "neutral",
            "PublishDate": 1769846893696,
            "Source": "stocks"
        },
        {
            "Title": "Datamatics Q3FY26 Net Profit Drops 65% to ₹36.34 Cr",
            "Summary": "Datamatics Global Services reported consolidated net profit of ₹36.34 crores for Q3FY26, down 51.28% from previous quarter. Revenue grew 19.89% YoY to ₹510.10 crores despite quarterly decline.",
            "Sentiment": "negative",
            "PublishDate": 1769606049009,
            "Source": "co_actions_results"
        },
        {
            "Title": "Datamatics Global Services Seeks Shareholder Approval for Mahesh Zurale's Independent Director Appointment",
            "Summary": "Datamatics Global Services Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mahesh Zurale (DIN: 10535033) as a Non-Executive Independent Director. The appointment is for a two-year term from October 30, 2025, to October 29, 2027. Zurale was previously appointed as Additional Director by the Board on October 30, 2025, based on the Nomination and Remuneration Committee's recommendation. He is a former Senior Managing Director at Accenture who led the company's Advanced Technology Centers Global Network until 2025 and was a member of Accenture's Global Management Committee. Prior to Accenture, he served as Chief Operating Officer at Datamatics Global Services. The e-voting period runs from November 11, 2025 (9:00 AM IST) to December 10, 2025 (5:00 PM IST), with results to be declared by December 12, 2025. The company has engaged NSDL for the remote e-voting facility, and the resolution requires special resolution approval from shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1762777973395,
            "Source": "corporate_action"
        },
        {
            "Title": "Datamatics Global Services Reports 4.8% Sequential Revenue Growth in Q2 FY26 with Strong Margin Expansion",
            "Summary": "Datamatics Global Services reported revenue of Rs. 490.2 crores for Q2 FY26, marking a 4.8% quarter-on-quarter increase and 20.5% year-on-year growth. EBITDA reached Rs. 88.8 crores with a 17% sequential growth and 82.2% annual growth, achieving an EBITDA margin of 18.1%. The company's PAT after non-controlling interest stood at Rs. 63.2 crores, up 25.5% quarter-on-quarter. Digital Technologies revenue grew 6.1% sequentially to Rs. 153.1 crores with EBIT margin improving to 10.8%. Digital Operations revenue increased 6.6% to Rs. 272.5 crores. Digital Experiences revenue declined 4.4% to Rs. 64.6 crores due to two clients transitioning work to their captive centers. The U.S. remains the largest geography contributing 56% of business, followed by U.K. and Europe at 21%. The company maintains net cash and investments of Rs. 509.4 crores and continues investing Rs. 40-50 crores annually in AI and emerging technologies. Management expects mid-teens growth for the full year including acquisitions.",
            "Sentiment": "positive",
            "PublishDate": 1762450375489,
            "Source": "earnings"
        },
        {
            "Title": "Datamatics Global Services Reports Q2 FY26 Results, Appoints New Independent Director",
            "Summary": "Datamatics Global Services Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company appointed Mr. Mahesh Zurale as Additional Director to serve as Independent Director for a 2-year term starting October 30, 2025, subject to shareholder approval. The board also approved a revised policy on Code of Conduct for regulating, monitoring and reporting of trading by insiders and code of practice for fair disclosure. The company operates through three business segments: Digital Operations (revenue of Rs. 272.48 crores for the quarter), Digital Technologies (Rs. 153.13 crores), and Digital Experiences (Rs. 64.62 crores). Total segment revenue for the quarter was Rs. 490.23 crores. The company has investments of Rs. 11.05 crores in preference shares and Rs. 36.14 crores in perpetual debentures in a step-down subsidiary that has negative net worth of Rs. 30.78 crores. Management expects this RPA business subsidiary to turn around given its growth stage and profit generation.",
            "Sentiment": "neutral",
            "PublishDate": 1761838918639,
            "Source": "earnings"
        },
        {
            "Title": "Datamatics Global Sets Growth Targets With 13-15% Revenue CAGR and 20%+ PAT Growth",
            "Summary": "Datamatics Global has announced growth targets of 13-15% revenue compound annual growth rate with profit after tax growth exceeding 20%. The company plans to achieve these targets through its AI-automation suites TruBot and TruAI, new enterprise deals in banking, financial services, insurance and manufacturing sectors. The company maintains EBITDA margins above 15% and holds a cash position of ₹509 crores to support inorganic growth initiatives through FY27.",
            "Sentiment": "positive",
            "PublishDate": 1761834730164,
            "Source": "stock"
        },
        {
            "Title": "Datamatics Global Services Reports Strong Q2 Growth with 49% Jump in Net Profit",
            "Summary": "Datamatics Global Services delivered robust quarterly performance with consolidated net profit rising to 632.4 million rupees from 423.6 million rupees year-over-year. Revenue increased to 4.9 billion rupees compared to 4.06 billion rupees in the same period last year. EBITDA surged to 888 million rupees from 487.6 million rupees, while EBITDA margin expanded significantly to 18.12% from 11.99% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1761826327042,
            "Source": "earnings"
        },
        {
            "Title": "Datamatics Partners with Well Pharmacy to Automate Medication Record Management",
            "Summary": "Datamatics Global Services Limited announced a partnership with Well Pharmacy, the UK's largest independent pharmacy chain, to automate medication record management. Well Pharmacy, which operates over 650 pharmacies across the UK and has annual revenue of approximately £800 million, signed a long-term contract with Datamatics to modernize medication record-keeping for patients in care homes. The solution will use Datamatics' AI-powered platforms TruCap+ for Intelligent Document Processing and TruBot for Robotic Process Automation to automate the Medication Administration Record (MAR) process. The automation aims to create reliable Monitored Dosage System records while reducing manual effort, minimizing errors, and enhancing patient safety. Well Pharmacy plans to scale the solution to support over 70,000 patients in care homes. The partnership reinforces Datamatics' position in the global healthcare sector, with its platform already empaneled by NHS Shared Business Services in the UK.",
            "Sentiment": "positive",
            "PublishDate": 1760423968397,
            "Source": "order&deals"
        },
        {
            "Title": "Datamatics Named Major Contender in Everest Group's Finance and Accounting Outsourcing Assessment for 6th Consecutive Year",
            "Summary": "Datamatics Global Services has been recognized as a Major Contender by Everest Group for the 6th consecutive year in the Finance and Accounting Outsourcing PEAK Matrix Assessment 2025. The company improved its scores on both Market Impact and Vision & Capabilities, and was recognized as a Tier 1 player under the IT+ BPS category. Datamatics' recognition is anchored by its FINATO platform, a comprehensive digital suite that delivers AI-powered finance transformation across Procure-to-Pay, Order-to-Cash, Record-to-Report, Travel & Expense, Contract Management, and Financial Planning & Analysis. Key strengths include AI-driven enhancements across modules, strategic partnerships with Microsoft and Google for AI-powered solutions, and notable experience serving SMB and mid-market clients with focus on the Manufacturing industry. The company is consistently ranked among the top 10 global vendors for Finance & Accounting by leading industry analysts.",
            "Sentiment": "positive",
            "PublishDate": 1758611190049,
            "Source": "stock"
        },
        {
            "Title": "Datamatics Global Services Completes De-registration of UAE Subsidiary",
            "Summary": "Datamatics Technologies FZ-LLC, a wholly owned subsidiary of Datamatics Global Services Limited, completed its de-registration process with Ras Al Khaimah Economic Zone Authority on August 24, 2025. The subsidiary has ceased to be part of Datamatics Global Services effective from that date. The parent company received notification of the completed de-registration on August 25, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1756130786894,
            "Source": "corporate_action"
        },
        {
            "Title": "Datamatics CEO Optimistic About Growth Despite Revenue Decline in Latest Quarter",
            "Summary": "Datamatics Global Services CEO Rahul Kanodia expressed confidence about the company's prospects, stating the next two to three years look promising due to their AI-first strategy and partnerships with Microsoft and Google. The company's stock has surged 60% over six months and 42% in the past month. For the first quarter of financial year 2026, consolidated revenue declined 6% to Rs 467.56 crore from Rs 497.15 crore in the previous quarter, with all three business segments showing declines. However, net profit increased 12% to Rs 50.38 crore due to improved cost management, and operating margins expanded to 12.1% from 11.0%. The US market contributed 55% of revenue while UK and Europe's share rose to 21%. Kanodia acknowledged ongoing customer uncertainty and slower decision-making, expecting these conditions to persist for the next six months, while targeting mid-single-digit organic growth.",
            "Sentiment": "neutral",
            "PublishDate": 1755067994500,
            "Source": "earnings"
        },
        {
            "Title": "Datamatics Global Projects Mid-Single Digit Organic Growth for FY26 with AI-Driven Expansion Plans",
            "Summary": "Datamatics Global has projected organic growth in the mid-single digits for FY26. When including the TNQ acquisition, total growth is estimated to be in the mid-teens range. The company expects EBITDA margins to improve by 50-100 basis points in FY26. Management expressed optimism about growth prospects over the next three years, citing AI initiatives as a key driver.",
            "Sentiment": "positive",
            "PublishDate": 1754623949363,
            "Source": "stock"
        },
        {
            "Title": "Datamatics Global Services Reports Strong Q1 Growth with 16% Revenue Jump",
            "Summary": "Datamatics Global Services delivered strong quarterly performance with consolidated net profit rising to 504 million rupees from 435 million rupees year-over-year. Revenue increased to 4.68 billion rupees compared to 3.94 billion rupees in the same period last year. EBITDA grew significantly to 759 million rupees from 514 million rupees year-over-year, while EBITDA margin expanded to 16.24% from 13.05% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754525648783,
            "Source": "earnings"
        },
        {
            "Title": "Datamatics Plans Global Expansion and AI Platform Focus to Sustain 15% Growth Rate",
            "Summary": "Datamatics has outlined its long-term growth strategy centered on expanding operations in the US and Europe. The company plans to strengthen partnerships with hyperscalers and accelerate adoption of its AI platforms including Trubot, Trucap+, and Finato. The strategy emphasizes high-profit digital operations as the company targets maintaining a compound annual growth rate of over 15%.",
            "Sentiment": "positive",
            "PublishDate": 1754490889187,
            "Source": "stock"
        },
        {
            "Title": "Datamatics Global Services Approves Q1 Financial Results and Reconstitutes Board Committee",
            "Summary": "Datamatics Global Services Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025, during a meeting held on August 6, 2025. The Board also reconstituted the Committee of the Board. The auditor's review highlighted that the company has investments of Rs 10.63 crores in preference shares and Rs 36.14 crores in perpetual debentures in a step-down subsidiary with negative net worth of Rs 33.93 crores. Management stated no provision for investments is necessary as the subsidiary is in growth stage and generating profit. The consolidated results included revenue of Rs 251.35 crores and net profit of Rs 32.70 crores from three subsidiaries reviewed by other auditors, while fifteen subsidiaries contributed Rs 21.46 crores in revenue with a net loss of Rs 0.77 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1754479834313,
            "Source": "earnings"
        },
        {
            "Title": "Datamatics Global Services Acquires Remaining 20% Stake in Dextara Digital",
            "Summary": "Datamatics Global Services has completed the acquisition of the remaining 20% equity stake in Dextara Digital Pvt Ltd for 335.5 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1750417010000,
            "Source": "default"
        },
        {
            "Title": "Datamatics Global Services: Q4 Profit Drops 15%, Declares ₹5/Share Dividend",
            "Summary": "Datamatics reported a 14.6% YoY decline in Q4 FY25 net profit to ₹44.9 crore. Revenue increased 20.5% to ₹497.2 crore. Full-year FY25 revenue rose 11.2% to ₹1,723.4 crore. The company recommended a final dividend of ₹5 per share for FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1747313941000,
            "Source": "earnings"
        },
        {
            "Title": "Datamatics Global Services Q4 Results and Dividend Announcement",
            "Summary": "Datamatics Global Services has recommended a dividend of 5 rupees per equity share. The company reported Q4 EBITDA of 750 million rupees, up from 647 million rupees year-over-year. However, the Q4 EBITDA margin decreased slightly to 15.09% from 15.66% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747310052000,
            "Source": "result"
        },
        {
            "Title": "Datamatics Global Services Reports Q4 Financial Results",
            "Summary": "Datamatics Global Services announced its Q4 financial results. The company's consolidated net profit for Q4 was 449 million rupees, compared to 525 million rupees year-over-year and 743 million rupees quarter-over-quarter. Revenue for Q4 increased to 4.97 billion rupees from 4.13 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747309748000,
            "Source": "result"
        },
        {
            "Title": "Datamatics Global Services to Consider Q4 Results on May 15",
            "Summary": "Datamatics Global Services has announced that it will consider its fourth quarter financial results on May 15. This indicates the company is preparing to release its earnings report for the last quarter of their fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1746452764000,
            "Source": "default"
        },
        {
            "Title": "Datamatics Secures Automatic Fare Collection Contract for Pune Metro Line 3",
            "Summary": "Datamatics has signed a contract to implement an Automatic Fare Collection system for Pune Metro Line 3. This development indicates the company's expansion into urban transportation infrastructure projects and showcases its technological capabilities in the public transit sector.",
            "Sentiment": "positive",
            "PublishDate": 1738737401000,
            "Source": "order&deals"
        },
        {
            "Title": "Datamatics Global Services Reports Q3 EBITDA Growth",
            "Summary": "Datamatics Global Services has reported an EBITDA of 540 million rupees for the third quarter, compared to 526 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738140642000,
            "Source": "earnings"
        },
        {
            "Title": "Datamatics Global Services Reports Q3 Revenue Growth",
            "Summary": "Datamatics Global Services has announced its third-quarter revenue results. The company reported revenue of 4.2 billion rupees, compared to 3.7 billion rupees in the same quarter of the previous year, indicating year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738140479000,
            "Source": "earnings"
        },
        {
            "Title": "Datamatics Global Services Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "Datamatics Global Services has reported a substantial year-over-year increase in its consolidated net profit for the third quarter. The company's net profit rose to 743 million rupees, compared to 413 million rupees in the same period last year, marking a significant improvement in financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1738140456000,
            "Source": "earnings"
        },
        {
            "Title": "Datamatics Expands Operations in the Philippines with New Delivery Center",
            "Summary": "Datamatics has inaugurated its fourth delivery center in the Philippines, located in Cebu City. This expansion demonstrates the company's commitment to growth in the region and potentially enhances its service delivery capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1734600883000,
            "Source": "corporate_action"
        },
        {
            "Title": "Datamatics Global Services Subsidiary to Acquire TNQ Tech",
            "Summary": "A subsidiary of Datamatics Global Services is set to acquire a 100% stake in TNQ Tech. The first tranche of the purchase consideration is valued at 3.36 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1733738301000,
            "Source": "corporate_action"
        },
        {
            "Title": "Datamatics Global Services Ltd: Secures UK Cybersecurity Certifications",
            "Summary": "Datamatics Global Services Ltd has obtained Cyber Essentials and Cyber Essentials Plus certifications from the UK government, validated by Techforce Cyber. The certification involved assessment of over 100 technical controls across five key security areas. The company also recently received ISO certification for its AI Management System framework.",
            "Sentiment": "positive",
            "PublishDate": 1733130357000,
            "Source": "normal_news"
        },
        {
            "Title": "Datamatics Achieves UK Cyber Essentials Certifications",
            "Summary": "Datamatics has obtained Cyber Essentials certifications, a UK government-backed cybersecurity standard. This achievement enhances the company's cybersecurity measures and provides greater protection for its customers. The certification demonstrates Datamatics' commitment to maintaining robust security practices and safeguarding client data.",
            "Sentiment": "positive",
            "PublishDate": 1733121352000,
            "Source": "corporate_action"
        },
        {
            "Title": "Datamatics Appoints New CFO",
            "Summary": "Datamatics has appointed Ankush Akar as Senior Vice President and Chief Financial Officer. Akar has previous experience working at major IT companies Wipro and Infosys.",
            "Sentiment": "positive",
            "PublishDate": 1732174613000,
            "Source": "corporate_action"
        },
        {
            "Title": "Datamatics Global Invests in AI Solutions, Impacting Margins",
            "Summary": "Datamatics Global is investing in AI solutions, which is affecting the margins in their Digital Technologies segment. However, the company is seeing positive traction from AI-related activities, including events in Europe and the U.S.",
            "Sentiment": "positive",
            "PublishDate": 1730861876000,
            "Source": "corporate_action"
        },
        {
            "Title": "Datamatics Global Expects Recovery in Coming Quarters",
            "Summary": "Datamatics Global Services has expressed an optimistic outlook for the next two to three quarters. The company anticipates recovering some of the losses experienced in the current quarter, as stated during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1730861797000,
            "Source": "normal_news"
        },
        {
            "Title": "Datamatics Global Services Reports Q2 Financial Results",
            "Summary": "Datamatics Global Services has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 was 488 million rupees, compared to 589 million rupees in the same quarter last year, showing a year-over-year decline. The EBITDA margin decreased to 11.99% from 15.63% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1730805963000,
            "Source": "result"
        },
        {
            "Title": "Datamatics Global Services Reports Q2 Revenue Growth",
            "Summary": "Datamatics Global Services has reported a revenue of 4.1 billion rupees for the second quarter, compared to 3.8 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730805954000,
            "Source": "result"
        },
        {
            "Title": "Datamatics Global Services Reports Q2 Financial Results",
            "Summary": "Datamatics Global Services has announced its Q2 consolidated net profit of 424 million rupees, showing a decrease from 493 million rupees year-over-year. However, it represents a slight increase from 434.9 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1730805935000,
            "Source": "result"
        },
        {
            "Title": "Datamatics Global Services to Consider Q2 Results",
            "Summary": "Datamatics Global Services has announced that it will consider its second quarter (Q2) financial results on November 5.",
            "Sentiment": "neutral",
            "PublishDate": 1729690636000,
            "Source": "corporate_action"
        }
    ]
}