{
    "Symbol": "DAVANGERE",
    "ISIN": "INE179G01029",
    "News": [
        {
            "Title": "Davangere Sugar Q3FY26 Results: Net Profit Falls 61.2%",
            "Summary": "Davangere Sugar Company reported Q3FY26 net profit of ₹262.27 lakhs, down 61.2% YoY. Revenue rose 13% to ₹8,268.61 lakhs despite higher material costs.",
            "Sentiment": "negative",
            "PublishDate": 1770729386126,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arihant Capital reduces stake in Davangere Sugar",
            "Summary": "Arihant Capital Markets sold 17,275,157 shares of Davangere Sugar Company through open market transactions, reducing its shareholding from 5.62% to 4.41% on January 28, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769749015207,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arihant Capital Increases Stake in Davangere Sugar",
            "Summary": "Arihant Capital Markets acquired additional 10.59 million shares in Davangere Sugar Company through open market transactions, increasing its total shareholding from 4.91% to 5.65%.",
            "Sentiment": "neutral",
            "PublishDate": 1769050495293,
            "Source": "co_actions_results"
        },
        {
            "Title": "Davangere Sugar Company's Internal Auditor B. Gangadhara Passes Away",
            "Summary": "M/s B. Gangadhara Co.'s proprietor Mr. B. Gangadhara, who served as Internal Auditor of Davangere Sugar Company Limited, passed away on November 30, 2025. The cessation of the internal auditor role affects the company's audit function, with the Board acknowledging his valuable contributions during his tenure.",
            "Sentiment": "negative",
            "PublishDate": 1764604605780,
            "Source": "corporate_governance"
        },
        {
            "Title": "Davangere Sugar Reports Rights Issue Fund Utilization for Quarter Ended September 2025",
            "Summary": "Davangere Sugar Company submitted its monitoring agency report for Rs. 149.19 crore rights issue proceeds utilization for the quarter ended September 30, 2025, with CARE Ratings noting a minor deviation of Rs. 0.01 crore held in non-scheduled bank account. The company utilized funds for debt repayment (Rs. 66.99 crore), unsecured loan adjustments (Rs. 44.25 crore), general corporate purposes (Rs. 32.70 crore), and issue expenses (Rs. 1.90 crore) as per board approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1763105798862,
            "Source": "corporate_action"
        },
        {
            "Title": "Davangere Sugar Company Reports Quarterly Financial Results with Mixed Performance Across Segments",
            "Summary": "Davangere Sugar Company Limited announced unaudited financial results for the quarter and half year ended September 30, 2025, showing total income of Rs 4,876.98 lakhs for the quarter with net profit after tax of Rs 262.99 lakhs. The company's distillery segment contributed significantly with Rs 4,402.78 lakhs in revenue while sugar operations generated Rs 387.89 lakhs, reflecting the seasonal nature of the sugar industry.",
            "Sentiment": "positive",
            "PublishDate": 1763067667050,
            "Source": "earnings"
        },
        {
            "Title": "Davangere Sugar Company Announces Major Expansion Plans Post-Rights Issue",
            "Summary": "Davangere Sugar Company Limited has announced growth-oriented expansion plans following its rights issue completion. The company plans to increase ethanol distillery capacity from 65 KLPD to 85 KLPD within this financial year, with further expansion to 110 KLPD planned for the next phase. The expansion includes establishing a 35 TPD CO₂ recovery plant and diversifying into broken rice and maize procurement along with grain trading operations. The company is implementing farmer-engagement initiatives including mechanised harvesting, contracted labour teams, enhanced transport logistics and subsidies to achieve annual cane crushing targets exceeding 5 lakh metric tonnes. Executive Director Abhijith G Shamanur stated the initiatives will enhance revenues, profitability and shareholder value through an integrated approach. Chairman Ganesh Shivashankarappa Shamanur described the expansion as a significant milestone aligning with India's energy transition priorities. The company operates a 4,750 TCD crushing capacity facility, 24 MW co-generation power plant, and follows a zero-waste philosophy across its integrated sugar, ethanol and renewable power operations.",
            "Sentiment": "positive",
            "PublishDate": 1758973463505,
            "Source": "stock"
        },
        {
            "Title": "Davangere Sugar Company Conducts Virtual Investor Meeting, Announces Rights Issue of ₹149 Crore",
            "Summary": "Davangere Sugar Company Limited held a virtual group meeting with analysts and institutional investors on August 19, 2025, from 4:00 PM to 5:00 PM with a Q&A session. The company confirmed no unpublished price sensitive information was shared. The company operates as a fully integrated sugar, ethanol, and renewable power manufacturer in Karnataka with sugar capacity of 4,750 TCD, ethanol capacity of 65 KLPD, and co-generation capacity of 24.45 MW. For FY25, the company reported revenue of ₹21,498.53 lakhs, EBITDA of ₹5,227.90 lakhs, and PAT of ₹1,083.11 lakhs. The company is proposing a rights issue of up to ₹14,921.80 lakhs at ₹3.05 per equity share with a ratio of 13 shares for every 25 shares held. The rights issue opens on August 14, 2025, and closes on August 29, 2025, with proceeds intended for loan repayment and general corporate purposes. The company is expanding ethanol capacity to 85 KLPD and plans to increase sugarcane cultivation by 15,000 acres.",
            "Sentiment": "positive",
            "PublishDate": 1755625831806,
            "Source": "stock"
        },
        {
            "Title": "Davangere Sugar Company Reports Q1 Results and Senior Management Changes",
            "Summary": "Davangere Sugar Company Limited's board approved unaudited financial results for the quarter ended June 30, 2025, showing revenue from operations of Rs. 2,407.01 lakhs and net profit of Rs. 130.42 lakhs. The company reported earnings per share of Rs. 0.14. In management changes, Mr. Anandan Palaniappan resigned as General Manager - Distillery citing personal grounds, while Mr. Sheshagiri Rao was appointed to the same position. Mr. Rao brings 19 years of distillery industry experience and holds qualifications in Industrial Fermentation & Alcohol Technology. The distillery segment contributed Rs. 2,353.90 lakhs to quarterly revenue, representing the largest business segment.",
            "Sentiment": "neutral",
            "PublishDate": 1755180426815,
            "Source": "earnings"
        },
        {
            "Title": "Davangere Sugar Company Announces Rights Issue Worth INR 14,921.80 Lakhs",
            "Summary": "Davangere Sugar Company Limited has announced a rights issue to eligible shareholders for an aggregate amount not exceeding INR 14,921.80 lakhs. The Board of Directors approved the rights issue on July 25, 2025, with Rights Issue Committee meetings held on July 31, 2025 and August 04, 2025. The record date for eligible shareholders is August 06, 2025. The company published newspaper advertisements on August 11, 2025 in Financial Express (English) and Jansatta (Hindi) in compliance with SEBI regulations. The rights issue involves offering equity shares to existing shareholders and follows SEBI ICDR Regulations and other applicable laws.",
            "Sentiment": "neutral",
            "PublishDate": 1754901611806,
            "Source": "corporate_action"
        },
        {
            "Title": "Davangere Sugar Company Approves ₹14,922 Crore Rights Issue at ₹3.05 Per Share",
            "Summary": "Davangere Sugar Company Limited has approved a rights issue of up to 48.92 crore equity shares at ₹3.05 per share, aggregating ₹14,921.80 lakhs. The rights issue will be offered in the ratio of 13 rights equity shares for every 25 existing shares held by eligible shareholders as of August 6, 2025. The issue opens on August 14, 2025 and closes on August 29, 2025. The company will utilize proceeds for repayment of bank loans (₹6,750 lakhs), adjustment of unsecured loans from promoter Ganesh Shivashankarappa Shamanur (₹4,425 lakhs), and general corporate purposes (₹3,521.80 lakhs). The rights issue price represents a 12.86% discount to the market price of ₹3.50 as of July 24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754291083531,
            "Source": "corporate_action"
        },
        {
            "Title": "Davangere Sugar Company Announces ISIN for Rights Issue Entitlements",
            "Summary": "Davangere Sugar Company Limited has announced the International Securities Identification Number (ISIN) INE179G20029 for rights entitlements related to their upcoming rights issue. The company has made arrangements with NSDL and CDSL to credit rights entitlements in dematerialized form to eligible equity shareholders' demat accounts. The rights entitlements for eligible shareholders as on the record date will be credited prior to the issue opening date under the specified ISIN.",
            "Sentiment": "neutral",
            "PublishDate": 1753972636596,
            "Source": "corporate_action"
        },
        {
            "Title": "Davangere Sugar Company Sets August 6, 2025 Record Date for ₹149.22 Crore Rights Issue",
            "Summary": "Davangere Sugar Company Limited has fixed August 6, 2025 as the record date for its rights issue of equity shares. The company will offer up to 48.92 crore fully paid-up equity shares at ₹3.05 per share, raising up to ₹14,921.80 lakhs. The rights entitlement ratio is set at 13:25, meaning shareholders will receive 13 new shares for every 25 existing shares held. The rights issue will open on August 14, 2025, with market renunciations allowed until August 25, 2025, and closing on August 29, 2025. The company's outstanding equity shares will increase from 94.08 crore to 143.01 crore shares assuming full subscription. The Rights Issue Committee approved these terms on July 31, 2025, following in-principle approval from NSE and BSE dated July 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753967009604,
            "Source": "corporate_action"
        },
        {
            "Title": "Davangere Sugar Company Postpones Rights Issue Committee Meeting by One Day",
            "Summary": "Davangere Sugar Company Limited has postponed its Rights Issue Committee meeting from July 30, 2025 to July 31, 2025. The meeting was scheduled to consider and approve the record date, issue price, entitlement ratio and other terms for the rights issue that was approved by the Board on July 25, 2025. The postponement is due to the in-principle approval from stock exchanges for the proposed rights issue still being under process.",
            "Sentiment": "neutral",
            "PublishDate": 1753801482887,
            "Source": "corporate_action"
        },
        {
            "Title": "Davangere Sugar Company Schedules Rights Issue Committee Meeting to Finalize Terms for ₹15,000 Crore Fundraising",
            "Summary": "Davangere Sugar Company Limited has scheduled a Rights Issue Committee meeting on July 30, 2025, to determine key parameters for its upcoming rights issue of equity shares. The committee will consider and approve the record date, price, entitlement ratio, and other terms and conditions for the rights issue, which will not exceed ₹15,000 lakhs. The meeting follows the Board of Directors' approval of the rights issue on July 25, 2025. The finalization of terms is subject to receiving in-principle approvals from stock exchanges and other required regulatory authorities.",
            "Sentiment": "neutral",
            "PublishDate": 1753526834434,
            "Source": "corporate_action"
        },
        {
            "Title": "Davangere Sugar Company Approves Rs 15,000 Crore Rights Issue, Supersedes Earlier Rs 40,000 Crore Approval",
            "Summary": "Davangere Sugar Company Limited's Board of Directors approved a rights issue to raise up to Rs 15,000 lakhs through fully paid-up equity shares with a face value of Re 1 each. This new approval supersedes a previous rights issue approval from September 6, 2024, which was for Rs 40,000 lakhs. The board clarified that this is not an additional offer but a fresh approval replacing the earlier decision. The rights issue will be offered to eligible equity shareholders as on a record date to be determined later. Detailed terms including issue price, rights entitlement ratio, record date, and payment terms will be decided by the board in due course, subject to necessary regulatory approvals. The board meeting was held on July 25, 2025, and lasted from 12:45 PM to 1:15 PM.",
            "Sentiment": "neutral",
            "PublishDate": 1753431267197,
            "Source": "corporate_action"
        },
        {
            "Title": "Davangere Sugar Company Reschedules Board Meeting for Rights Issue Fund Raising Proposal",
            "Summary": "Davangere Sugar Company Limited has rescheduled its Board of Directors meeting to July 25, 2025, after the previously scheduled meeting on July 09, 2025 was cancelled due to non-availability of directors. The board will consider a proposal for fund raising through a rights issue of fully paid-up equity shares to eligible shareholders. This proposal will supersede a previous board resolution from September 6, 2024, due to new SEBI regulations that have simplified the rights issue process, making it more time, process and cost efficient. The company also indicated there may be changes to the issue size.",
            "Sentiment": "neutral",
            "PublishDate": 1753160702579,
            "Source": "corporate_action"
        },
        {
            "Title": "Davangere Sugar Company: Q3 Profit Jumps 428% QoQ, Stock Surges 10%",
            "Summary": "Davangere Sugar Company reported a 428% QoQ increase in net profit to ₹6.76 crore for Q3FY25. Total income rose 85% QoQ to ₹73.58 crore. The stock jumped over 10% following the results announcement. The company plans a ₹400 crore rights issue for ethanol production expansion.",
            "Sentiment": "positive",
            "PublishDate": 1737350681000,
            "Source": "earnings"
        },
        {
            "Title": "Davangere Sugar Company Reports Q2 Profit Increase",
            "Summary": "Davangere Sugar Company Ltd. has reported a net profit of 12 million rupees for the second quarter, showing an increase from 9 million rupees year-over-year and quarter-over-quarter. The company's revenue for Q2 stood at 393 million rupees, up from 269 million rupees year-over-year, but down from 455 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731284281000,
            "Source": "result"
        }
    ]
}