{
    "Symbol": "DBCORP",
    "ISIN": "INE950I01011",
    "News": [
        {
            "Title": "DB Corp Shares Q3FY26 Earnings Call Audio Recording",
            "Summary": "DB Corp Limited has uploaded the audio recording of its Q3FY26 earnings conference call held on January 16, 2026, discussing financial performance for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768570713508,
            "Source": "co_actions_results"
        },
        {
            "Title": "DB Corp Board Approves Amendment to UPSI Disclosure Code",
            "Summary": "DB Corp Limited's Board of Directors approved amendments to its Code of Practices and Procedures for Fair Disclosure of Unpublished Price Sensitive Information during a meeting held on January 15, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768482514218,
            "Source": "stocks"
        },
        {
            "Title": "DB Corp Declares ₹2 Interim Dividend, Q3 Results",
            "Summary": "DB Corp announced Q3 FY26 results and declared second interim dividend of ₹2 per share. Company also appointed new CIO while previous CIO resigned from position.",
            "Sentiment": "positive",
            "PublishDate": 1768465297050,
            "Source": "co_actions_results"
        },
        {
            "Title": "DB Corp Declares ₹2 Interim Dividend, Q3 Results",
            "Summary": "DB Corp Limited announced Q3 FY26 results and declared second interim dividend of ₹2 per share for FY 2025-26. Company also appointed new CIO replacing outgoing technology head.",
            "Sentiment": "positive",
            "PublishDate": 1768465264730,
            "Source": "co_actions_results"
        },
        {
            "Title": "DB Corp Declares ₹2 Interim Dividend, Leadership Changes",
            "Summary": "DB Corp announces second interim dividend of ₹2 per share for FY26, appoints new CIO Rakesh Khetan while current CIO Amit Waghmare resigns effective January 31, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768464948119,
            "Source": "co_actions_results"
        },
        {
            "Title": "DB Corp Q3FY26: Revenue ₹6,293cr, EBITDA Margin 22.32%",
            "Summary": "DB Corp reported Q3FY26 consolidated revenue of ₹6,293.28cr vs ₹6,556.41cr YoY. EBITDA margin compressed to 22.32% from 27.58%. Company declared second interim dividend of ₹2 per share.",
            "Sentiment": "negative",
            "PublishDate": 1768464566283,
            "Source": "co_actions_results"
        },
        {
            "Title": "DB Corp Q3FY26 Results: Revenue ₹6,293cr, Declares ₹2 Dividend",
            "Summary": "DB Corp reported Q3FY26 consolidated revenue of ₹6,293.28 crores with net profit of ₹955.09 crores. Board declared second interim dividend of ₹2 per share and announced senior management changes.",
            "Sentiment": "neutral",
            "PublishDate": 1768463976722,
            "Source": "co_actions_results"
        },
        {
            "Title": "DB Corp schedules Q3FY26 earnings call for Jan 16",
            "Summary": "DB Corp Limited will host a conference call on January 16, 2026, at 10:30 AM IST to discuss Q3FY2026 financial performance for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767882029554,
            "Source": "stocks"
        },
        {
            "Title": "DB Corp Board Meet on Jan 15 for Q3FY26 Results",
            "Summary": "DB Corp Limited has scheduled a board meeting on January 15, 2026, to consider Q3FY26 unaudited financial results and potential second interim dividend declaration for FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1767876676401,
            "Source": "co_actions_results"
        },
        {
            "Title": "DB Corp Reports 12% YoY Growth in Q2 FY26 Advertising Revenue, Adds 14 New Radio Stations",
            "Summary": "DB Corp delivered advertising revenues of Rs. 4,478 million in Q2 FY26, marking 12% year-on-year growth compared to Rs. 4,014 million in the previous year. Total revenues grew 9% YoY to Rs. 6,347 million. The company reported EBITDA of Rs. 1,584 million (10% YoY growth) and PAT of Rs. 935 million (13% YoY growth) after adjusting for forex losses. Circulation revenues increased 3% YoY to Rs. 1,208 million. The growth was supported by early festival season benefits and positive macro trends including normal monsoon, interest rate reduction, and GST rate cuts. All major advertising categories except government and FMCG showed double-digit growth, with government advertising declining 12-13% due to new government transition. The company expanded its radio network with 14 new stations, expected to be operational by March 2026. Digital business maintained 20 million monthly active users on its app. Newsprint prices remained stable at Rs. 47,000 per metric tonne. For H1 FY26, total revenues grew 2% YoY to Rs. 12,219 million with EBITDA at Rs. 2,968 million and net profit at Rs. 1,743 million.",
            "Sentiment": "positive",
            "PublishDate": 1761309168556,
            "Source": "earnings"
        },
        {
            "Title": "D B Corp Reports Strong Q2 Performance with Revenue Growth to 6.14B Rupees",
            "Summary": "D B Corp reported quarterly revenue of 6.14 billion rupees, up from 5.6 billion rupees in the same period last year. The company's consolidated net profit increased to 935 million rupees from 826 million rupees year-over-year. EBITDA rose to 1.38 billion rupees compared to 1.2 billion rupees previously, while EBITDA margin improved to 22.48% from 21.57% in the corresponding period.",
            "Sentiment": "positive",
            "PublishDate": 1760598627679,
            "Source": "earnings"
        },
        {
            "Title": "NCLT Dismisses Insolvency Petition Against D.B. Corp Limited Due to Pre-Existing Dispute",
            "Summary": "The National Company Law Tribunal (NCLT), Ahmedabad Bench dismissed a petition filed by Go Paper GmbH & Co. KG seeking to initiate corporate insolvency resolution process against D.B. Corp Limited under Section 9 of the Insolvency and Bankruptcy Code, 2016. The petition, registered as C.P.(IB)/131(AHM)2025, was dismissed on September 15, 2025 on grounds of a pre-existing dispute between the parties. D.B. Corp Limited received the order via email on September 16, 2025. The company had previously informed stock exchanges about this petition on February 5, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758045032742,
            "Source": "stock"
        },
        {
            "Title": "D. B. Corp's 'My FM' Gets Approval for 14 New Radio Stations",
            "Summary": "D. B. Corp's radio brand 'My FM' has received approval to operate 14 new radio stations, expanding the company's radio broadcasting network.",
            "Sentiment": "positive",
            "PublishDate": 1755149967029,
            "Source": "stock"
        },
        {
            "Title": "DB Corp Reports Strong EBITDA Margin in Print Business",
            "Summary": "DB Corp has reported a 31% EBITDA margin in its print business. The company aims to achieve higher margins through business growth.",
            "Sentiment": "positive",
            "PublishDate": 1752721618000,
            "Source": "default"
        },
        {
            "Title": "DB Corp Optimistic About Growth, Reports Positive Q2 FY26 Outlook",
            "Summary": "DB Corp has expressed optimism for growth linked to economic trends. The company reports early positive signs for Q2 FY26, with stable newsprint costs. No specific financial figures or detailed performance metrics were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752721455000,
            "Source": "default"
        },
        {
            "Title": "DB Corp: Q1 Profit Plunges 31%, Revenue Down 5%",
            "Summary": "DB Corp reported a 31.4% drop in Q1 consolidated net profit to Rs 80.8 crore. Revenue fell 5.2% to Rs 559 crore. EBITDA declined 32.8% to Rs 111 crore, with margins contracting by 810 basis points to 19.8%.",
            "Sentiment": "negative",
            "PublishDate": 1752651587000,
            "Source": "earnings"
        },
        {
            "Title": "D B Corp Reports Q1 Financial Results and Approves Dividend",
            "Summary": "D B Corp has released its Q1 financial results, showing a decline in key metrics compared to the previous year. The company's EBITDA decreased to 1.1 billion rupees from 1.64 billion rupees year-over-year, with the EBITDA margin falling to 19.77% from 27.88%. Revenue dropped to 5.6 billion rupees from 6 billion rupees, and consolidated net profit decreased to 808 million rupees from 1.2 billion rupees. Despite the decline in financial performance, the company has approved a dividend payment of 5 rupees per share.",
            "Sentiment": "negative",
            "PublishDate": 1752649229000,
            "Source": "result"
        },
        {
            "Title": "D B Corp Targets 50 Million Monthly Active Users, Expects 3-4% Market Growth",
            "Summary": "D B Corp has set an internal target to reach 50 million monthly active users. The company anticipates a 3-4% growth in the market, which it considers a significant achievement given the current market conditions. This information was shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1746759956000,
            "Source": "default"
        },
        {
            "Title": "D B Corp Reports Decline in Q4 Financial Performance",
            "Summary": "D B Corp has released its Q4 financial results, showing a decline across key metrics. Revenue decreased to 5.5 billion rupees from 6.2 billion rupees year-over-year. EBITDA fell to 826 million rupees from 1.72 billion rupees, with EBITDA margin dropping to 15.1% from 27.89%. Consolidated net profit declined to 504 million rupees from 1.2 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1746688995000,
            "Source": "result"
        },
        {
            "Title": "Insolvency Petition Filed Against DB Corp by Go Paper GmbH & Co. KG",
            "Summary": "Go Paper GmbH & Co. KG has filed a petition for the initiation of a Corporate Insolvency Resolution Process against DB Corp. This legal action suggests that DB Corp may be facing financial difficulties or disputes with its creditor, Go Paper GmbH & Co. KG.",
            "Sentiment": "negative",
            "PublishDate": 1738756140000,
            "Source": "corporate_governance"
        },
        {
            "Title": "D.B. Corp: Q3 Net Profit Drops, Share Price Falls",
            "Summary": "D.B. Corp's Q3 consolidated net profit decreased 4.6% YoY to Rs 118 crore. Revenue fell 0.3% to Rs 643 crore, and operating profit declined 3.2% to Rs 177 crore. Margin contracted by 80 basis points to 27.6%. Advertising and circulation revenues both decreased. Share price fell 2.73% to Rs 262.35 post-results.",
            "Sentiment": "negative",
            "PublishDate": 1737014727000,
            "Source": "earnings"
        },
        {
            "Title": "D B Corp Reports Stable Q3 Consolidated Net Profit",
            "Summary": "D B Corp, an Indian media company, has reported a consolidated net profit of 1.2 billion rupees for the third quarter. This figure remains unchanged compared to the same period in the previous year, indicating stable financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1737011244000,
            "Source": "earnings"
        },
        {
            "Title": "D B Corp Reports Stable Q3 Revenue",
            "Summary": "D B Corp has announced its financial results for the third quarter, reporting revenue of 6.4 billion rupees. This figure remains unchanged compared to the same period in the previous year, indicating stable performance year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1737011205000,
            "Source": "earnings"
        },
        {
            "Title": "D B Corp Reports Slight Decline in Q3 EBITDA and Margin",
            "Summary": "D B Corp has reported its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 1.77 billion rupees from 1.83 billion rupees in the same quarter of the previous year. The EBITDA margin also saw a slight decline, dropping to 27.57% from 28.39% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1737011188000,
            "Source": "earnings"
        },
        {
            "Title": "DB Corp Schedules Board Meeting for Q3 Results",
            "Summary": "DB Corp has announced a board meeting scheduled for January 16 to consider and approve the company's financial results for the third quarter of the current fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1736430466000,
            "Source": "corporate_governance"
        },
        {
            "Title": "D B Corp Reports Decline in Q2 EBITDA and Margin",
            "Summary": "<p>D B Corp, an Indian media company, has reported its financial results for the second quarter. The company's <span class='neutral'>EBITDA</span> (Earnings Before Interest, Taxes, Depreciation, and Amortization) <span class='negative'>decreased</span> from <b>1.6 billion rupees</b> in the previous year to <b>1.2 billion rupees</b> this year. Additionally, the <span class='neutral'>EBITDA margin</span> <span class='negative'>fell</span> from <b>26.98%</b> to <b>21.57%</b> year-over-year.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728981732000,
            "Source": "result"
        },
        {
            "Title": "D B Corp Reports Q2 Revenue Decline",
            "Summary": "<p>D B Corp, an Indian media company, reported a <span class='negative'>decrease</span> in <span class='neutral'>revenue</span> for the second quarter. The company's revenue <span class='negative'>fell</span> to <b>5.6 billion rupees</b> from <b>5.9 billion rupees</b> in the same quarter of the previous year, representing a <span class='negative'>year-over-year decline</span>.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728981690000,
            "Source": "result"
        },
        {
            "Title": "D B Corp Reports Decline in Q2 Consolidated Net Profit",
            "Summary": "<p>D B Corp, an Indian media company, has reported a consolidated <span class='neutral'>net profit</span> of <b>825 million rupees</b> for the second quarter, down from <b>1 billion rupees</b> in the same period last year. This represents a <span class='negative'>year-over-year decrease</span> in profitability.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728981636000,
            "Source": "result"
        },
        {
            "Title": "D.B. Corp Board Meeting Scheduled for Q2 Results and Dividend Consideration",
            "Summary": "<p><span class='neutral'>D.B. Corp</span> has announced a <b>board meeting</b> on <span class='neutral'>October 15</span> to <b>review and consider</b> the company's <span class='neutral'>financial results</span> for the <span class='neutral'>second quarter</span>. The board will also <b>discuss</b> and potentially <span class='positive'>declare a dividend</span> during this meeting.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728382053000,
            "Source": "corporate_action"
        }
    ]
}