{
    "Symbol": "DBEIL",
    "ISIN": "INE0OPA01019",
    "News": [
        {
            "Title": "Deepak Builders Receives GST Summons from DGGI",
            "Summary": "Deepak Builders & Engineers India Limited received a GST summons on January 30, 2026, to appear before GST Officer on February 3, 2026, regarding inquiry into availment of ineligible Input Tax Credit.",
            "Sentiment": "negative",
            "PublishDate": 1770030028589,
            "Source": "stocks"
        },
        {
            "Title": "DGGI Conducts Search at Deepak Builders & Engineers' Ludhiana Office; Company Deposits ₹35 Million",
            "Summary": "The Directorate General of GST Intelligence (DGGI) conducted search proceedings at Deepak Builders & Engineers' Ludhiana office. The company voluntarily deposited ₹35 million in connection with the proceedings.",
            "Sentiment": "negative",
            "PublishDate": 1764893307080,
            "Source": "stock"
        },
        {
            "Title": "SEBI Issues Administrative Warning to Deepak Builders Engineers India Limited",
            "Summary": "Securities and Exchange Board of India issued an administrative warning letter to Deepak Builders Engineers India Limited on November 28, 2025, for alleged violation of disclosure regulations under SEBI Listing Regulations. The company stated there is no impact on its financial, operational or other activities from this regulatory action.",
            "Sentiment": "negative",
            "PublishDate": 1764334673992,
            "Source": "corporate_governance"
        },
        {
            "Title": "Deepak Builders Engineers India Reports Loss in Q2 FY2025 Results",
            "Summary": "Deepak Builders Engineers India Limited reported a net loss of Rs 498.26 lakhs for the quarter ended September 30, 2025, compared to a loss of Rs 607.77 lakhs in the previous quarter. The company attributed revenue decline to construction slowdown due to heavy rains during July-August 2025 and non-availability of blocked sites for running projects.",
            "Sentiment": "negative",
            "PublishDate": 1763173215077,
            "Source": "earnings"
        },
        {
            "Title": "Deepak Builders & Engineers India Limited Submits IPO Proceeds Monitoring Report for Quarter Ended June 30, 2025",
            "Summary": "Deepak Builders & Engineers India Limited submitted a monitoring agency report on the utilization of IPO proceeds for the quarter ended June 30, 2025. The company raised Rs 2,172.10 million through its IPO held from October 21-23, 2024, comprising a fresh issue of Rs 2,172.10 million and an offer for sale of Rs 428.33 million. CARE Ratings Limited served as the monitoring agency. The report shows that Rs 2,165.86 million of the gross proceeds have been utilized, with Rs 6.24 million remaining unutilized. The funds were allocated for repayment of borrowings (Rs 300 million - fully utilized), working capital requirements (Rs 1,119.56 million - fully utilized), general corporate purposes (Rs 539.68 million - fully utilized), and issue expenses (Rs 212.86 million - Rs 206.62 million utilized). The monitoring agency reported no deviations from disclosed objects and confirmed all utilization was as per the offer document disclosures.",
            "Sentiment": "neutral",
            "PublishDate": 1755184524027,
            "Source": "stock"
        },
        {
            "Title": "Deepak Builders & Engineers India Reports Q1 FY26 Results, Appoints Auditors and Approves AGM",
            "Summary": "Deepak Builders & Engineers India Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of ₹10,660.43 lakhs compared to ₹10,510.75 lakhs in the same quarter last year. Net profit for the quarter stood at ₹1,498.99 lakhs versus ₹1,421.30 lakhs in the previous year. Basic earnings per share increased to ₹3.22 from ₹3.96 in the corresponding quarter. The Board also appointed M/s Rajeev Bhambri & Associates as Secretarial Auditors for 5 consecutive financial years, subject to shareholder approval. M/s Gurvinder Chopra and Co. were re-appointed as Cost Auditors for FY 2025-26. The company approved its 8th Annual General Meeting notice to be conducted through video conferencing and approved the Board's report for FY 2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1755180485829,
            "Source": "earnings"
        },
        {
            "Title": "Deepak Builders & Engineers India Schedules Board Meeting for August 14 to Approve Quarterly Results",
            "Summary": "Deepak Builders & Engineers India Limited has scheduled a Board of Directors meeting on August 14, 2025, to consider and approve the unaudited standalone financial results for the quarter ended June 30, 2025. The trading window for company securities, which was previously closed for designated persons and their immediate relatives, will reopen 48 hours after the declaration of the quarterly results.",
            "Sentiment": "neutral",
            "PublishDate": 1754462088769,
            "Source": "corporate_action"
        },
        {
            "Title": "Deepak Builders And Engineers Wins ₹142 Crore Project Bid in Haryana",
            "Summary": "Deepak Builders And Engineers has emerged as the L1 (lowest) bidder for a Unity project in Haryana. The project is valued at ₹142 crore.",
            "Sentiment": "positive",
            "PublishDate": 1750920479000,
            "Source": "default"
        },
        {
            "Title": "Deepak Builders & Engineers India Secures Orders Worth ₹260 Crore",
            "Summary": "Deepak Builders & Engineers India has announced securing orders valued at over ₹260 crore. The company's current market capitalization stands at ₹700 crore.",
            "Sentiment": "positive",
            "PublishDate": 1748939064000,
            "Source": "default"
        },
        {
            "Title": "Deepak Builders & Engineers Reports Q4 Financial Results",
            "Summary": "Deepak Builders & Engineers has reported its Q4 financial results. The company's EBITDA for Q4 was 227 million rupees, down from 514 million rupees year-over-year. The EBITDA margin decreased to 10.11% from 27.20% in the same period last year. Net profit for Q4 was 112 million rupees, compared to 338 million rupees year-over-year and 163 million rupees quarter-over-quarter. Revenue for Q4 increased to 2.2 billion rupees from 1.9 billion rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748621011000,
            "Source": "result"
        },
        {
            "Title": "Deepak Builders & Engineers Reports Strong Q3 Financial Results",
            "Summary": "Deepak Builders & Engineers has announced its financial results for the third quarter. The company's net profit increased to 183 million rupees, up from 106 million rupees in the same period last year. Revenue also saw growth, reaching 1.3 billion rupees compared to 1.1 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739751496000,
            "Source": "earnings"
        },
        {
            "Title": "Deepak Builders & Engineers Reports Improved Q3 EBITDA and Margin",
            "Summary": "Deepak Builders & Engineers has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 301 million rupees from 225 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 23.08% from 21.04% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739539034000,
            "Source": "earnings"
        },
        {
            "Title": "Deepak Builders & Engineers Reports Strong Q3 Financial Results",
            "Summary": "Deepak Builders & Engineers has announced its financial results for the third quarter. The company's net profit increased to 183 million rupees, up from 106 million rupees in the same period last year. Revenue also saw growth, reaching 1.3 billion rupees compared to 1.1 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739539028000,
            "Source": "earnings"
        },
        {
            "Title": "Deepak Builders & Engineers India Secures 1.53 Billion Rupee Contract",
            "Summary": "Deepak Builders & Engineers India has been awarded a contract worth 1.53 billion rupees for the construction of a 150-bed critical care block at PGIMER, Chandigarh.",
            "Sentiment": "positive",
            "PublishDate": 1730722762000,
            "Source": "corporate_action"
        },
        {
            "Title": "Deepak Builders Engineers India: Shares Plummet 4.13% Amid Market Downturn",
            "Summary": "Deepak Builders Engineers India shares are trading at ₹154.3, down 4.13% from the previous close. The stock hit a high of ₹162.9 and a low of ₹153.0 during the day. Nifty and Sensex are also down by 1.57% and 1.59% respectively.",
            "Sentiment": "negative",
            "PublishDate": 1730700159000,
            "Source": "normal_news"
        },
        {
            "Title": "Deepak Builders Engineers India: Shares Surge 3.12% Amid Market Dip",
            "Summary": "Deepak Builders Engineers India shares are trading at ₹162.05, up 3.12% on October 30, 2024. The stock hit a high of ₹163.45 and a low of ₹158.5. It's trading above short and long-term moving averages. The company has 0% promoter holding, 0.81% MF holding, and 8.31% FII holding.",
            "Sentiment": "positive",
            "PublishDate": 1730266210000,
            "Source": "normal_news"
        },
        {
            "Title": "Deepak Builders Engineers India: Stock Plummets 15.94% Amid Market Rally",
            "Summary": "Deepak Builders Engineers India shares are trading at ₹170.65, down 15.94% from the previous close. The stock hit a high of ₹198.85 and a low of ₹168.95 during the day. This sharp decline comes despite the broader market indices, Nifty and Sensex, being up by 1.06% and 1.02% respectively.",
            "Sentiment": "negative",
            "PublishDate": 1730093537000,
            "Source": "normal_news"
        },
        {
            "Title": "Deepak Builders: IPO Debut Amid Falling Grey Market Premium",
            "Summary": "Deepak Builders & Engineers Ltd. will list on BSE and NSE on October 28 after a 41.54 times subscription. Grey market premium dropped to ₹32 from ₹50. NIIs led subscriptions at 82.47 times. IPO proceeds of ₹260.04 crore will fund working capital, debt repayment, and corporate purposes. The company's order book stands at ₹1,380 crore, with 66% in railways segment.",
            "Sentiment": "neutral",
            "PublishDate": 1730083851000,
            "Source": "normal_news"
        }
    ]
}