{
    "Symbol": "DBL",
    "ISIN": "INE917M01012",
    "News": [
        {
            "Title": "Dilip Buildcon schedules Q3FY26 earnings call",
            "Summary": "Dilip Buildcon Limited has scheduled an earnings call for February 10, 2026 at 5:00 PM IST to discuss Q3FY26 financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770272699430,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dilip Buildcon Shareholders Approve Related Party Deal",
            "Summary": "Dilip Buildcon Limited shareholders approved material related party transactions with subsidiary DBL ERCP Bandh Baretha Private Limited through postal ballot voting with 97.35% support.",
            "Sentiment": "positive",
            "PublishDate": 1768909621704,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dilip Buildcon Wins ₹1,850 Cr Karnataka Power Project",
            "Summary": "Dilip Buildcon Limited selected as L-1 bidder by RECPDCL for establishing 400kV sub-station at Mekhali with transmission lines in Karnataka under BOOT model for 35 years.",
            "Sentiment": "positive",
            "PublishDate": 1766731231440,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dilip Buildcon Shares Rally 5.58% on ₹3,400 Cr Order",
            "Summary": "Dilip Buildcon shares surged 5.58% to ₹491.70 after securing ₹3,400 crore EPC contract from Adani Road Transport for Bihar's Ganga Path project, with trading volumes 3.7x higher than average.",
            "Sentiment": "positive",
            "PublishDate": 1766728934372,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dilip Buildcon Wins ₹1,850 Crore Infrastructure Project",
            "Summary": "Dilip Buildcon Limited has secured a significant infrastructure project valued at ₹1,850 crores, marking a major milestone for the mid-cap infrastructure developer and operator in expanding its project portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1766722277301,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dilip Buildcon Receives LOA for ₹4,900 Cr Solar Project",
            "Summary": "Dilip Buildcon officially receives Letter of Award from MPUVNL for 1,363.55 MW solar project worth ₹4,900 crores under PM-KUSUM-C scheme with 18-month execution timeline.",
            "Sentiment": "positive",
            "PublishDate": 1766381823847,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dilip Buildcon clarifies on stock volume surge",
            "Summary": "Dilip Buildcon responds to BSE inquiry about significant trading volume increase, stating no material events or price-sensitive information warrant disclosure under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1766135367711,
            "Source": "stocks"
        },
        {
            "Title": "Dilip Buildcon Seeks Shareholder Approval for ₹1,625 Cr RPT",
            "Summary": "Dilip Buildcon Limited issues postal ballot notice seeking shareholder approval for material related party transactions worth up to ₹1,625 crores with subsidiary DBL ERCP Bandh Baretha Private Limited for project execution support.",
            "Sentiment": "neutral",
            "PublishDate": 1766051628894,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dilip Buildcon Receives Rs 5,000 Crore Contract from NALCO for Bauxite Mining Operations",
            "Summary": "Dilip Buildcon Limited has received a Letter of Award from National Aluminium Company Limited (NALCO) for a 25-year MDO contract worth Rs 5,000 crores (excluding GST) for development and operation of Pottangi Bauxite Mines along with Overland Conveyor Corridor and allied facilities. The project includes EPC work for the first 3 years involving 1.75 million tonnes and mining operations for the remaining 22 years covering 3.25 million tonnes at current mining charges of Rs 423 per ton.",
            "Sentiment": "positive",
            "PublishDate": 1765343475997,
            "Source": "order&deals"
        },
        {
            "Title": "Dilip Buildcon Secures Rs 879.30 Crore Highway Project in Tamil Nadu",
            "Summary": "Dilip Buildcon Limited received Letter of Award from National Highways Authority of India for 4-laning of Paramakudi to Ramanathapuram section highway project worth Rs 879.30 crore on Hybrid Annuity Mode. The project spans 46.665 km with 24 months execution period and 15 years operation period from Commercial Operation Date.",
            "Sentiment": "positive",
            "PublishDate": 1764313791015,
            "Source": "stock"
        },
        {
            "Title": "Dilip Buildcon Emerges as L-1 Bidder for Rs 5,000 Crore NALCO Bauxite Mining Contract",
            "Summary": "Dilip Buildcon Limited has emerged as the lowest bidder (L-1) for a 25-year MDO contract from National Aluminium Company Limited (NALCO) for development and operation of Pottangi Bauxite Mines along with Overland Conveyor Corridor and allied facilities. The contract is valued at Rs 5,000 crores excluding GST, involving mining operations of 5 million tonnes with current mining charges of Rs 423 per ton.",
            "Sentiment": "positive",
            "PublishDate": 1763963932242,
            "Source": "order&deals"
        },
        {
            "Title": "Dilip Buildcon Reports Q2 FY26 Results with Revenue Guidance Cut and Debt Reduction Delays",
            "Summary": "Dilip Buildcon reduced its revenue guidance for FY26 from INR 8,500 crores to INR 8,000 crores due to slower order inflows, while securing INR 5,500 crores in orders year-to-date against a target of INR 15,000 crores. The company's debt reduction timeline has been delayed with standalone debt expected to remain around INR 1,500 crores this year instead of the planned INR 500 crores reduction, though management expects INR 10,000 crores revenue next year enabling debt reduction to INR 1,000 crores by FY27.",
            "Sentiment": "neutral",
            "PublishDate": 1763634589486,
            "Source": "earnings"
        },
        {
            "Title": "Dilip Buildcon Cuts FY26 Revenue Guidance to INR 8,000 Crores, Sets Coal Production Targets",
            "Summary": "Dilip Buildcon reduced its FY26 revenue guidance from INR 8,500 crores to INR 8,000 crores due to slower than expected pace of new orders, while projecting FY27 revenue of INR 10,000 crores. The company targets order inflow of INR 15,000 crores for FY26 with INR 5,500 crores already secured, and expects coal production of 32 million metric tonnes across Siarmal and Pachhwara mines for FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1763202010678,
            "Source": "stock"
        },
        {
            "Title": "Dilip Buildcon Reports Q2FY26 Results with ₹214 Cr Consolidated PAT and Secures ₹5,665 Cr New Orders",
            "Summary": "Dilip Buildcon Limited announced consolidated profit after tax of ₹214 crore for Q2FY26 and ₹485 crore for H1FY26, while securing new projects worth ₹5,665 crore across irrigation, metro, renewable energy and road sectors. The company maintains a diversified order book of ₹18,610 crore with operations spanning roads, mining, irrigation, tunnels and metro projects, and completed three major highway projects during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1763069156205,
            "Source": "earnings"
        },
        {
            "Title": "Dilip Buildcon Secures ₹307.08 Crore Sub-Contracts for Barpali Loading Bulb Development",
            "Summary": "Dilip Buildcon has received two sub-contracts worth ₹307.08 crores for the Barpali Loading Bulb Development project at Kusara. The project is scheduled for completion within 24 months.",
            "Sentiment": "positive",
            "PublishDate": 1761746369811,
            "Source": "stock"
        },
        {
            "Title": "Dilip Buildcon Wins ₹879 Crore Highway Project in Tamil Nadu",
            "Summary": "Dilip Buildcon has been declared the L-1 bidder for a National Highways Authority of India project to develop a 46.665 km stretch from Paramakudi to Ramanathapuram in Tamil Nadu. The project, valued at ₹879.30 crore excluding GST, will be executed under Hybrid Annuity Mode with a 24-month construction period and 15-year operation phase. The company reported strong quarterly results with consolidated net profit jumping 93.6% to ₹271 crore, aided by an exceptional gain of ₹169.3 crore. EBITDA grew 8.7% to ₹520 crore with margins improving to 19.8% from 15.2%. However, revenue declined 16.4% to ₹2,620 crore due to slower EPC ordering activity. The company completed major projects including sections of the Bangalore-Chennai Expressway worth ₹925 crore and the Raipur-Visakhapatnam Economic Corridor worth ₹680 crore. Shares closed at ₹481, up 0.65%.",
            "Sentiment": "positive",
            "PublishDate": 1761574810184,
            "Source": "stock"
        },
        {
            "Title": "Dilip Buildcon Wins Rs 879.30 Crore Highway Project in Tamil Nadu",
            "Summary": "Dilip Buildcon Limited has been declared the L-1 bidder for a highway project awarded by the National Highways Authority of India. The project involves 4-laning of Paramakudi to Ramanathapuram section of NH49 New NH87 from Km 80.360 to Km 127.025 in Tamil Nadu. The contract is worth Rs 879.30 crores excluding GST and will be executed on a Hybrid Annuity Mode basis. The project spans 46.665 km in length with a completion period of 24 months and an operation period of 15 years from the commercial operation date. The company confirmed that promoter group companies have no interest in the awarding entity and the contract does not fall under related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1761572209548,
            "Source": "order&deals"
        },
        {
            "Title": "Dilip Buildcon's InvIT Targets ₹20,000-₹30,000 Crore Portfolio Expansion",
            "Summary": "Dilip Buildcon announced that its Infrastructure Investment Trust (InvIT) currently holds seven HAM road projects with an enterprise value of ₹4,500 crore. The company has set a target to expand its portfolio to ₹20,000-₹30,000 crore over the next 2-3 years.",
            "Sentiment": "positive",
            "PublishDate": 1760918870388,
            "Source": "stock"
        },
        {
            "Title": "Dilip Buildcon's Anantam Highways InvIT Lists on NSE and BSE, Raises ₹400 Crore",
            "Summary": "Anantam Highways InvIT, backed by Dilip Buildcon (74%) and Alpha Alternatives (26%), successfully listed on NSE and BSE. The public issue was oversubscribed 5.62 times overall, with QIB category subscribed 2.86 times and Non-Institutional Investor category 8.93 times. Marquee investors included WhiteOak Capital, SBI Capital Markets, Edelweiss Life Insurance, Reliance General Insurance, and Minerva Ventures Fund. The InvIT holds seven hybrid annuity model road projects with enterprise value of ₹4,500 crore and average residual concession life of 13 years. Anantam InvIT plans portfolio expansion targeting ₹20,000-₹30,000 crore enterprise value over the next 2-3 years through addition of operational highway assets across India. The launch aligns with Dilip Buildcon's capital recycling strategy to enhance balance sheet strength while creating long-term stakeholder value through structured monetization of operational assets.",
            "Sentiment": "positive",
            "PublishDate": 1760705366485,
            "Source": "corporate_action"
        },
        {
            "Title": "Dilip Buildcon Transfers 54% Stakes in Seven Highway Subsidiaries to Anantam Highways Trust",
            "Summary": "Dilip Buildcon Limited transferred its entire remaining 54% equity shareholding and NCDs in seven highway subsidiary companies to Anantam Highways Trust (InvIT). The subsidiaries include Bangalore Malur Highways Limited, Malur Bangarpet Highways Limited, Repallewada Highways Limited, Viluppuram Highways Limited, Narenpur Purnea Highways Limited, Dodaballapur Hoskote Highways Limited, and Dhrol Bhadra Highways Limited. In exchange, the company and its subsidiaries received 958,50,139 units of the InvIT with a face value of Rs.100 per unit. Additionally, Alpha Alternatives Infrastructure Fund, in which Dilip Buildcon has 98.48% beneficial interest, received 36,045,096 units of the InvIT. The total consideration received was Rs.958.50 crores, comprising Rs.850.51 crores for equity shares and Rs.107.99 crores for NCDs. The sale agreement was last amended on September 22, 2025, with completion dates for all transfers on October 10, 2025. The buyer, Anantam Highways Trust, does not belong to the promoter or group companies, and the transaction does not fall under related party transactions.",
            "Sentiment": "neutral",
            "PublishDate": 1760696794076,
            "Source": "corporate_action"
        },
        {
            "Title": "Income Tax Department Conducts Transaction Review at Dilip Buildcon Office",
            "Summary": "The Income Tax Department conducted checks at Dilip Buildcon's office to review transactions. The company stated it is fully cooperating with the department and emphasized that its business operations remain unchanged during this process.",
            "Sentiment": "neutral",
            "PublishDate": 1760518198742,
            "Source": "stock"
        },
        {
            "Title": "Dilip Buildcon Joint Venture Secures Approval for 100 MW Solar Power Project",
            "Summary": "Dilip Buildcon's joint venture has received approval for a 100 MW solar power project that will supply electricity to Madhya Pradesh Jal Nigam. The project represents the company's expansion into renewable energy infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1759759796811,
            "Source": "stock"
        },
        {
            "Title": "Dilip Buildcon Secures Rs 4,020 Crore Infrastructure Projects in Rajasthan and Kerala",
            "Summary": "Dilip Buildcon Limited has secured two major infrastructure projects through joint ventures totaling over Rs 4,020 crore. The DBL-RAMKY Consortium received a Letter of Acceptance for a Rs 2,905 crore water grid project in Rajasthan under the Hybrid Annuity Model, involving construction of feeder infrastructure with 20 years of operation and maintenance, to be completed in 27 months. The project was awarded by Rajasthan Water Grid Corporation Limited. Additionally, DBL-PSP joint venture won a Rs 1,115.37 crore EPC contract for industrial corridor infrastructure development at Pudussery Central and Kannambra of Palakkad Node in Kerala, part of the Chennai Bengaluru Industrial Corridor extension to Kochi via Coimbatore. This project has a 42-month completion timeline and was awarded by The Kerala Industrial Corridor Development Corporation Limited. Both contracts are with domestic entities and do not involve related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1758785829082,
            "Source": "order&deals"
        },
        {
            "Title": "Dilip Buildcon Wins Rs 1,115 Crore Kerala Industrial Corridor Project",
            "Summary": "Dilip Buildcon Limited, through its joint venture DBL-PSP (with 74% stake), has been declared the L-1 bidder for an industrial corridor project worth Rs 1,115.37 crores excluding GST. The project involves design, construction, testing, commissioning and operation & maintenance of infrastructure works at Pudussery Central & Kannambra of Palakkad Node in Kerala under extension of Chennai Bengaluru Industrial Corridor to Kochi via Coimbatore. The contract is awarded by Kerala Industrial Corridor Development Corporation Limited on EPC basis with a completion period of 42 months. The company has closed its trading window for insiders until 48 hours after the information becomes publicly available.",
            "Sentiment": "positive",
            "PublishDate": 1758626286297,
            "Source": "order&deals"
        },
        {
            "Title": "Dilip Buildcon Sets Book Closure and Record Date for 19th Annual General Meeting",
            "Summary": "Dilip Buildcon Limited announced that its Register of Members and Share Transfer Books will remain closed from September 10-16, 2025 for the 19th Annual General Meeting. The company has set September 9, 2025 as the record date to determine shareholder eligibility for dividend payment, if declared at the AGM scheduled for September 16, 2025. The dividend entitlement relates to the financial year ended March 31, 2025 and requires member approval.",
            "Sentiment": "neutral",
            "PublishDate": 1755951533619,
            "Source": "corporate_action"
        },
        {
            "Title": "Dilip Buildcon JV Secures ₹1503.63 Crore Gurugram Metro Project Contract",
            "Summary": "Dilip Buildcon, through a joint venture, has won a contract worth ₹1503.63 crore for a Gurugram Metro project. The infrastructure company secured this significant metro rail development contract.",
            "Sentiment": "positive",
            "PublishDate": 1755490542896,
            "Source": "order&deals"
        },
        {
            "Title": "Dilip Buildcon Wins Rs 2,952 Crore Rajasthan Water Grid Project Contract",
            "Summary": "Dilip Buildcon Limited, through its DBL-RAMKY Consortium, has been declared the L-1 bidder for a Rajasthan Water Grid Project worth Rs 2,952 crores including GST. The project involves construction of a feeder from Isarda to Khura Chainpura to Bandh Baretha Bharatpur with operation and maintenance responsibilities for 20 years. The contract is structured on a Hybrid Annuity Model with a completion period of 27 months. The project was awarded by Rajasthan Water Grid Corporation Limited. The company has implemented a trading window closure for insiders until 48 hours after the information becomes publicly available.",
            "Sentiment": "positive",
            "PublishDate": 1755489857799,
            "Source": "order&deals"
        },
        {
            "Title": "Dilip Buildcon Shares Rise 4% on Rs 1,500 Crore Gurugram Metro Contract Win",
            "Summary": "Dilip Buildcon shares surged 4.4% to Rs 478 after its joint venture with RBL Bank won a Rs 1,503.6 crore railway construction contract from Gurugram Metro Rail as the lowest bidder. The project involves building a viaduct, 14 elevated stations, and 27 total stations across multiple corridors, to be completed within 30 months. The company reported strong quarterly results with consolidated net profit jumping 94% to Rs 271 crore, aided by improved margins and exceptional gains. However, revenue declined 16% to Rs 2,620 crore due to slower EPC order inflows. The company maintains an order book of Rs 13,695 crore with mining contributing the largest share at 28.9%. The board approved raising up to Rs 1,000 crore each through NCDs and commercial papers. Despite the contract win, analyst consensus remains 'Sell' with an average target price of Rs 453.",
            "Sentiment": "positive",
            "PublishDate": 1754281281535,
            "Source": "stock"
        },
        {
            "Title": "Dilip Buildcon Emerges as L-1 Bidder for ₹1,503.63 Crore Gurugram Metro Project",
            "Summary": "Dilip Buildcon has been declared the L-1 bidder for the Gurugram Metro project in Haryana, valued at ₹1,503.63 crore. Being the L-1 bidder means the company has submitted the lowest qualifying bid for the infrastructure project.",
            "Sentiment": "positive",
            "PublishDate": 1754265748370,
            "Source": "order&deals"
        },
        {
            "Title": "Dilip Buildcon Reports Mixed Q1 FY26 Results Amid Order Book Challenges and Strategic Realignment",
            "Summary": "Dilip Buildcon Limited reported mixed quarterly results with stand-alone revenue declining 14.7% to INR 2,010 crores while profit after tax surged 61% to INR 123 crores. On consolidated basis, revenue fell 16.4% to INR 2,620 crores but PAT jumped 93.7% to INR 271 crores. The company faced challenges securing new orders due to slowdown in ordering activity and heightened competition from smaller unrecognized players. Management expects INR 12,000-15,000 crores of new order inflow for the year, with revenue guidance of INR 8,000-8,500 crores and EBITDA margin around 11%. The company completed partial divestment in 3 HAM projects to Alpha Alternatives fund for INR 125 crores and received in-principle approval from NSE, BSE and SEBI for InvIT formation, expected to launch within the quarter. Coal MDO operations showed strong performance with Siarmal achieving 5.4 million metric tons production and Pachhwara reaching 2.9 million metric tons in Q1. The company implemented cost-cutting measures including pausing capital expenditure and workforce adjustments while maintaining focus on profitable growth over order book size.",
            "Sentiment": "neutral",
            "PublishDate": 1754134367030,
            "Source": "earnings"
        },
        {
            "Title": "Dilip Buildcon Wins Rs 1,504 Crore Gurugram Metro Project Contract",
            "Summary": "Dilip Buildcon Limited, through its joint venture DBL-RBL JV, has been declared the lowest bidder for the Gurugram Metro Project by Gurugram Metro Rail Limited (GMRL). The contract is valued at Rs 1,503.63 crores including GST and involves construction of a 15.22 km viaduct and 14 elevated stations from Millennium City Centre to Sector 9, along with a spur to Dwarka Expressway and ramp to Depot at Sector 33. The project has a completion timeline of 30 months. The work excludes PEB and architectural finishing works and is part of the larger Gurugram Metro Corridor between Millennium City Centre and Cyber City spanning 26.65 km with a total of 27 stations.",
            "Sentiment": "positive",
            "PublishDate": 1754114833803,
            "Source": "order&deals"
        },
        {
            "Title": "Dilip Buildcon Completes Full Utilization of Rs 532.42 Crore Warrant Issue Proceeds",
            "Summary": "Dilip Buildcon Limited has fully utilized the entire Rs 532.42 crore raised through its preferential issue of convertible warrants. The company used Rs 400 crore for working capital loan repayment and Rs 132.42 crore for general corporate purposes during the quarter ended June 30, 2025. CRISIL Ratings Limited, serving as the monitoring agency, confirmed no deviations from the disclosed objects and noted this as their final monitoring report since all proceeds have been utilized. The original issue size was Rs 532.95 crore but was revised down due to undersubscription of warrants. The company received 25% of the warrant proceeds in December 2023 and the remaining 75% during the reported quarter upon conversion to equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1753957029218,
            "Source": "corporate_action"
        },
        {
            "Title": "Dilip Buildcon Targets ₹500 Crore Debt Reduction by March 2026",
            "Summary": "Dilip Buildcon has announced plans to reduce its debt by ₹500 crore by March 2026. The company aims to achieve net debt-free status by FY27. These targets were shared during a conference call.",
            "Sentiment": "positive",
            "PublishDate": 1753933162249,
            "Source": "stock"
        },
        {
            "Title": "Dilip Buildcon Targets ₹12,000-15,000 Crores Order Inflow for FY26",
            "Summary": "Dilip Buildcon anticipates receiving order inflows between ₹12,000-15,000 crores for FY26. The company projects revenue of ₹8,000-8,500 crores with an EBITDA margin near 11%.",
            "Sentiment": "positive",
            "PublishDate": 1753932792580,
            "Source": "stock"
        },
        {
            "Title": "Dilip Buildcon Targets Revenue Growth with ₹27,000 Crore Order Book for FY26",
            "Summary": "Dilip Buildcon aims for significant revenue increase backed by its ₹27,000 crore order book. The company anticipates margin improvement, asset monetization, and strong project execution across roads, mining, and urban infrastructure segments for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1753799721389,
            "Source": "stock"
        },
        {
            "Title": "Dilip Buildcon Reports 93.57% Jump in Consolidated PAT to ₹271 Cr in Q1 FY26",
            "Summary": "Dilip Buildcon Limited announced its audited financial results for the quarter ended June 30, 2025. The company reported consolidated profit after tax of ₹271 crores, representing a 93.57% year-on-year growth, while standalone PAT reached ₹123 crores, up 161.70% year-on-year. Consolidated revenue from operations was ₹2,620 crores, down 16.40% compared to the same quarter last year. EBITDA margin improved to 19.85% from 15.25% in the previous year. The company's order book stands at ₹13,695 crores as of June 30, 2025, with roads and highways projects constituting 17.81%, mining 28.86%, and irrigation projects 21.83%. The Board approved several decisions including re-appointment of Managing Director Devendra Jain, issuance of non-convertible debentures and commercial paper up to ₹1,000 crores each, and scheduled the Annual General Meeting for September 16, 2025. The company completed two major infrastructure projects during the quarter - a section of the Bangalore-Chennai Expressway worth ₹925 crores and the Sargi-Basanwahi Section worth ₹680 crores.",
            "Sentiment": "positive",
            "PublishDate": 1753797800644,
            "Source": "earnings"
        },
        {
            "Title": "Dilip Buildcon Approves 10 Billion Rupee Debenture Issuance, Reports Strong Q1 Profit Growth",
            "Summary": "Dilip Buildcon has approved the issuance of debentures worth up to 10 billion rupees. The company reported Q1 results showing EBITDA of 5.4 billion rupees compared to 4.78 billion rupees year-over-year, with EBITDA margin improving to 20.63% from 15.25%. Consolidated net profit increased significantly to 2.29 billion rupees from 1.2 billion rupees year-over-year. However, revenue declined to 26.2 billion rupees from 31.34 billion rupees year-over-year. The company recorded an exceptional item of 1.69 billion rupees compared to 360 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753797322510,
            "Source": "corporate_action"
        },
        {
            "Title": "CCI Approves Merger Involving Dilip Buildcon, Anantam Highways Trust, and Alpha Alternatives Fund Advisors",
            "Summary": "The Competition Commission of India has approved a merger transaction involving Dilip Buildcon, Anantam Highways Trust, Alpha Alternatives Fund Advisors LLP, and DBL Infraventures. The regulatory approval clears the way for the proposed corporate restructuring among these entities in the infrastructure sector.",
            "Sentiment": "positive",
            "PublishDate": 1753706539070,
            "Source": "order&deals"
        },
        {
            "Title": "Dilip Buildcon Schedules Board Meeting for July 29 to Approve Financial Results and Debt Issuance Plans",
            "Summary": "Dilip Buildcon Limited has scheduled a Board of Directors meeting for July 29, 2025, at its registered office in Bhopal. The board will consider and approve audited standalone and consolidated financial results for the quarter ended June 30, 2025. Other key agenda items include approval for issuance of non-convertible debentures and commercial paper, fixing the date and arrangements for the 19th Annual General Meeting to be held through video conferencing, and determining the record date for dividend eligibility for FY 2024-25. The trading window for insiders, designated persons and their relatives remains closed until 48 hours after the financial results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1753179737942,
            "Source": "corporate_action"
        },
        {
            "Title": "Dilip Buildcon: Rs 1,060 Crore Expressway Project Achieves Provisional Completion",
            "Summary": "Dilip Buildcon announced the provisional completion of a Rs 1,060 crore Bangalore-Chennai Expressway project in Andhra Pradesh under the Bharatmala Pariyojana. The 4-lane section from Bangarupalem to Gudipala was completed within 24 months and includes a 15-year operation and maintenance period. The project has been declared fit for commercial operation effective May 9.",
            "Sentiment": "positive",
            "PublishDate": 1750911557000,
            "Source": "order&deals"
        },
        {
            "Title": "Dilip Buildcon: Secures ₹1,341 Crore Order from Konkan Railway",
            "Summary": "Dilip Buildcon Ltd. won a ₹1,341 crore EPC order from Konkan Railway Corporation Ltd. for a twin tube unidirectional tunnel in Kerala, to be executed in 48 months. The company's shares gained nearly 4% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1750404365000,
            "Source": "order&deals"
        },
        {
            "Title": "Dilip Buildcon Secures Two Projects Worth ₹1,341 Crore",
            "Summary": "Dilip Buildcon has received two Letters of Award for projects valued at ₹1,341 crore. The company, which operates in the construction sector, has secured these new contracts, indicating potential growth in its project portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1750399034000,
            "Source": "default"
        },
        {
            "Title": "Dilip Buildcon Forecasts Revenue Decline and Growth Expectations",
            "Summary": "Dilip Buildcon anticipates a 5-7% decrease in standalone revenue for the current fiscal year, with an operating margin of 10-11%. However, the company expects a 10-15% growth in consolidated revenues. The company also projects continued growth in consolidated PAT (Profit After Tax) for the next year.",
            "Sentiment": "neutral",
            "PublishDate": 1747019438000,
            "Source": "default"
        },
        {
            "Title": "Dilip Buildcon Reports Strong Q4 Profit Growth and Declares Dividend",
            "Summary": "Dilip Buildcon announced its Q4 consolidated net profit of 1.7 billion rupees, a significant increase from 53.4 million rupees year-over-year and 1.1 billion rupees quarter-over-quarter. However, Q4 revenue decreased to 30.96 billion rupees from 33.66 billion rupees year-over-year. The company also declared a dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746749073000,
            "Source": "default"
        },
        {
            "Title": "Dilip Buildcon Reports Strong Q4 Results and Declares Dividend",
            "Summary": "Dilip Buildcon has announced its Q4 financial results, showing significant improvement in profitability. The company's EBITDA increased to 6.6 billion rupees from 3.3 billion rupees year-over-year, with EBITDA margin expanding to 21.35% from 9.8%. Consolidated net profit rose to 1.7 billion rupees, up from 53.4 million rupees in the same quarter last year. However, revenue slightly decreased to 30.96 billion rupees from 33.66 billion rupees. The company also declared a dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746716372000,
            "Source": "result"
        },
        {
            "Title": "Dilip Buildcon: Share Price Rises 6% Ahead of Q4 Results",
            "Summary": "Dilip Buildcon's share price jumped over 6% to ₹448.00 on BSE ahead of Q4 results announcement. The company is expected to report a net profit of ₹44.8 crore, down 60.9% YoY but up 106.5% QoQ. Revenue is estimated to fall 18.4% YoY to ₹2,391 crore. The board will consider dividend recommendation for FY 2024-25.",
            "Sentiment": "neutral",
            "PublishDate": 1746691583000,
            "Source": "earnings"
        },
        {
            "Title": "Dilip Buildcon Secures Major Construction Order",
            "Summary": "Dilip Buildcon has been awarded a significant construction contract valued at 2,631 crore rupees. This order represents a substantial business opportunity for the company and is likely to have a positive impact on its future revenue and growth prospects.",
            "Sentiment": "positive",
            "PublishDate": 1743064601000,
            "Source": "order&deals"
        },
        {
            "Title": "Dilip Buildcon Reaches Settlement Agreement with NHAI",
            "Summary": "Dilip Buildcon has signed a settlement agreement with the National Highways Authority of India (NHAI) for an amount of Rs 98.30 crore. This agreement likely resolves a dispute or finalizes a payment related to a highway project undertaken by the company.",
            "Sentiment": "positive",
            "PublishDate": 1739770581000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dilip Buildcon Reports Q3 FY24 Financial Results",
            "Summary": "Dilip Buildcon, an infrastructure company, has announced its Q3 financial results. The company reported a consolidated net profit of 1.15 billion rupees, showing a slight increase from 1.07 billion rupees in the same quarter last year. However, revenue decreased to 25.9 billion rupees from 28.77 billion rupees year-over-year. Compared to the previous quarter, net profit improved significantly from 2.35 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1739751376000,
            "Source": "earnings"
        },
        {
            "Title": "Dilip Buildcon: Q3 Profit Up 7.35% Despite Revenue Dip",
            "Summary": "Dilip Buildcon reported Q3 FY25 results with profit rising 7.35% YoY to ₹115.27 crore, despite revenue falling 9.98% to ₹2589.69 crore. EPS increased 126.38% YoY to ₹3.69. Operating income grew 23.81% YoY but fell 15.25% QoQ. Expenses rose, with SG&A up 8.45% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1739598923000,
            "Source": "earnings"
        }
    ]
}