{
    "Symbol": "DBOL",
    "ISIN": "INE0I3401014",
    "News": [
        {
            "Title": "Dhampur Bio Organics Resumes Full Operations",
            "Summary": "Dhampur Bio Organics Ltd announces complete resumption of manufacturing operations at its Unit Mansurpur from January 23, 2026, following earlier disruptions with no reported casualties.",
            "Sentiment": "positive",
            "PublishDate": 1769162999933,
            "Source": "stocks"
        },
        {
            "Title": "Dhampur Bio Organics Q3 FY26 Financial Results",
            "Summary": "Dhampur Bio Organics reports mixed Q3 FY26 performance with sugar segment EBIT margin improving to 11.26% from 3.11% YoY, while revenue declined 20.50%. Company operates across sugar, biofuels and country liquor segments.",
            "Sentiment": "neutral",
            "PublishDate": 1769104194817,
            "Source": "stocks"
        },
        {
            "Title": "Dhampur Bio Organics Q3FY26 Results & Mycoprotein Deal",
            "Summary": "Dhampur Bio Organics reports Q3FY26 consolidated net profit of ₹16.90 crores vs loss of ₹6.86 crores in Q3FY25. Company signs non-binding term sheet with Planetary SA for exclusive mycoprotein production in India.",
            "Sentiment": "positive",
            "PublishDate": 1769012563571,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dhampur Bio Organics Credit Rating Downgraded to BBB+",
            "Summary": "CARE Ratings downgrades Dhampur Bio Organics' long-term facilities from A- to BBB+ and short-term from A2+ to A2, citing subdued operational performance due to red rot infestation and low recovery rates.",
            "Sentiment": "negative",
            "PublishDate": 1768915272764,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dhampur Bio Organics Submits ESG Report for FY25",
            "Summary": "Dhampur Bio Organics Limited has submitted its Environmental, Social and Governance (ESG) Report for FY 2024-25 to BSE and NSE, making it available on the company website under sustainability section.",
            "Sentiment": "neutral",
            "PublishDate": 1768842241312,
            "Source": "stocks"
        },
        {
            "Title": "Dhampur Bio Organics Appoints Palakdhari Singh Pankaj as Vice President - Supply Chain",
            "Summary": "Dhampur Bio Organics Limited has appointed Mr. Palakdhari Singh Pankaj as Vice President - Supply Chain effective December 08, 2025. The appointment brings over 17 years of strategic procurement and supply chain expertise from IIM Lucknow and IIT Delhi alumnus to strengthen the company's supply chain operations.",
            "Sentiment": "positive",
            "PublishDate": 1765197045192,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dhampur Bio Organics Partially Resumes Operations at Unit Mansurpur",
            "Summary": "Dhampur Bio Organics Ltd announced partial resumption of manufacturing operations at Unit Mansurpur from early hours of November 14, 2025, with the company working to restore full capacity operations. The company confirmed no loss of life or injuries were reported, and assets are adequately covered under insurance with damage assessment and restoration steps being coordinated with the insurance company.",
            "Sentiment": "negative",
            "PublishDate": 1763134708636,
            "Source": "stock"
        },
        {
            "Title": "Dhampur Bio Organics Reports Mixed Q2FY26 Results with 12.89% Revenue Growth",
            "Summary": "Dhampur Bio Organics Limited achieved revenue growth of 12.89% to ₹526.03 crores in Q2FY26, driven by strong performance in Bio-fuel & Spirits (46.85% growth) and Country Liquor (54.22% growth) segments. However, profitability was impacted with PAT declining to negative ₹15.53 crores from negative ₹22.46 crores in Q2FY25, as lower margins in Sugar and Bio-Fuel Spirits segments offset the revenue gains.",
            "Sentiment": "negative",
            "PublishDate": 1763067609310,
            "Source": "earnings"
        },
        {
            "Title": "Dhampur Bio Organics Reports Reduced Net Loss in Q2",
            "Summary": "Dhampur Bio Organics reported a net loss of Rs 155 million in Q2, compared to a loss of Rs 225 million in the same quarter of the previous year, representing a year-over-year improvement of Rs 70 million.",
            "Sentiment": "positive",
            "PublishDate": 1763022920343,
            "Source": "earnings"
        },
        {
            "Title": "Dhampur Bio Organics Undergoes Income Tax Search Operation",
            "Summary": "Dhampur Bio Organics reported that Income Tax officials conducted a search operation at the company. The company stated it provided necessary clarifications to the officials during the process.",
            "Sentiment": "neutral",
            "PublishDate": 1762264306780,
            "Source": "stock"
        },
        {
            "Title": "Dhampur Bio Organics Reports Loss of Rs 19.37 Crores Despite 28.75% Revenue Growth in Q1 FY26",
            "Summary": "Dhampur Bio Organics Limited reported a loss after tax of Rs 19.37 crores in Q1 FY26 compared to a profit of Rs 1.11 crores in the same quarter last year, despite revenue growing 28.75% to Rs 821 crores from Rs 638 crores. The company's sugar recovery declined significantly to 9.55% from 10.48% in the previous year due to red rot infestation and pest issues affecting two factories in West Central UP. Sugar segment revenue increased 22% to Rs 523.49 crores with improved realizations of Rs 40.84 per kg versus Rs 39.15 per kg last year. Ethanol production surged to 21.67 million liters from 13.7 million liters, while country liquor sales grew 45.16% to 11.24 lakh cases. The company completed conversion of its 100 KLPD molasses-based distillery to dual-feed capability and repaid Rs 15 crores in long-term loans. Management attributed poor performance to lower sugar recoveries caused by pest infestation but expressed optimism about the upcoming sugar season based on healthier crop conditions and varietal replacement programs.",
            "Sentiment": "negative",
            "PublishDate": 1754315171777,
            "Source": "earnings"
        },
        {
            "Title": "Dhampur Bio Organics Faces Rs 14.17 Crore Export Fee Demand Following Supreme Court Order",
            "Summary": "Dhampur Bio Organics has been directed by the Assistant Excise Commissioner of Uttar Pradesh to calculate and deposit import/export fees on denatured/special denatured spirit for the period from FY 2018-19 to FY 2024-25. This follows a Supreme Court order dated October 23, 2024, which upheld the State's authority to regulate industrial alcohol. The company estimates the total amount at Rs 14.17 crores. Dhampur Bio Organics is contesting the matter through industry associations and has received an interim stay from the Lucknow Bench of Allahabad High Court.",
            "Sentiment": "negative",
            "PublishDate": 1754053490830,
            "Source": "stock"
        },
        {
            "Title": "Dhampur Bio Organics Makes Earnings Call Audio Recording Available on Company Website",
            "Summary": "Dhampur Bio Organics Ltd has made the audio recording of its earnings conference call available on its company website. The call discussed the unaudited financial results for the quarter ended June 30, 2025, and was held on July 29, 2025. The audio recording can be accessed at https://www.dhampur.com/investor/financials under the 'Conference Call' section.",
            "Sentiment": "neutral",
            "PublishDate": 1753791880476,
            "Source": "earnings"
        },
        {
            "Title": "Dhampur Bio Organics Targets Growth with Distillery Yield Improvements and Specialty Chemicals Expansion",
            "Summary": "Dhampur Bio Organics is targeting growth in FY26 by achieving distillery yields of 8.5-9.0%. The company plans a multi-year expansion in specialty chemicals and green chemistry sectors to enhance long-term profitability.",
            "Sentiment": "positive",
            "PublishDate": 1753720363088,
            "Source": "stock"
        },
        {
            "Title": "Dhampur Bio Organics Reports 28.75% Revenue Growth to ₹821 Crores in Q1 FY26 Despite Profitability Challenges",
            "Summary": "Dhampur Bio Organics Limited reported quarterly revenue of ₹821.19 crores, representing a 28.75% increase from ₹637.84 crores in the same period last year. The growth was driven by strong performance across all segments: Sugar revenue rose 22.09% to ₹523.49 crores with improved average realization of 4.30%, Bio-Fuel & Spirits revenue surged 83.55% to ₹127.66 crores due to 89.37% volume increase, and Country Liquor revenue grew 50.72% to ₹28.18 crores with 45.16% volume growth. However, profitability was significantly impacted as EBITDA declined 81.75% to ₹6.33 crores from ₹34.68 crores, with EBITDA margin dropping to 0.77% from 5.44%. The company reported a net loss of ₹19.37 crores compared to a profit of ₹1.11 crores in the previous year. Sugar segment EBIT margin turned negative at -0.91% from 5.19%, while Bio-Fuel & Spirits EBIT margin fell sharply to 0.50% from 11.55%. The company maintained its debt-to-equity ratio at 0.30x and repaid long-term loans of ₹14.96 crores during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1753719566561,
            "Source": "earnings"
        },
        {
            "Title": "Dhampur Bio Organics Reports Mixed Q1 Results with Revenue Growth but Profitability Decline",
            "Summary": "Dhampur Bio Organics reported quarterly revenue of ₹8.2 billion, representing growth from ₹6.4 billion in the same period last year. However, the company posted a net loss of ₹194 million compared to a profit of ₹11 million in the previous year. EBITDA declined significantly to ₹46 million from ₹339 million, while EBITDA margin compressed to 0.56% from 5.32% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1753684990815,
            "Source": "earnings"
        },
        {
            "Title": "Dhampur Bio Organics Receives Stock Exchange Approval for Promoter Shareholding Reclassification",
            "Summary": "Dhampur Bio Organics Ltd received approval from NSE and BSE for reclassifying three shareholders - Mrs. Aparna Jalan, Mrs. Shefali Poddar, and Mrs. Ritu Sanghi - from the Promoters and Promoter Group category to Public Category. The company had applied for this reclassification in November 2024. Following the approval, the promoter and promoter group shareholding decreased from 50.78% to 50.65%. The reclassified shareholders held a combined 85,360 shares, representing 0.13% of total shareholding.",
            "Sentiment": "neutral",
            "PublishDate": 1753367874944,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhampur Bio Organics Schedules Q1FY26 Earnings Conference Call for July 29, 2025",
            "Summary": "Dhampur Bio Organics Limited will conduct an earnings conference call with investors on July 29, 2025, at 16:00 IST to discuss its unaudited financial results for the quarter ended June 30, 2025. The call will be hosted by SKP Securities Limited and will feature Managing Director & CEO Gautam Goel and Chief Financial Officer Nalin Kumar Gupta as key participants. The company has provided registration links and access numbers for investor participation in the Q1FY26 results discussion.",
            "Sentiment": "neutral",
            "PublishDate": 1753194064727,
            "Source": "earnings"
        },
        {
            "Title": "Dhampur Bio Organics Schedules Board Meeting for July 28 to Approve Quarterly Financial Results",
            "Summary": "Dhampur Bio Organics Ltd has scheduled a Board of Directors meeting on July 28, 2025 to consider and approve the unaudited Standalone and Consolidated Financial Results for the quarter ended June 30, 2025. The trading window for company securities will remain closed until July 30, 2025. The closure applies to all concerned parties under the company's Code of Conduct for Prevention of Insider Trading, while the trading window remains open for general investors.",
            "Sentiment": "neutral",
            "PublishDate": 1753192618940,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhampur Bio Organics Launches New Product UPML",
            "Summary": "Dhampur Bio Organics has introduced a new product called UPML (Up Made Liquor). The company has expanded its product line with this alcoholic beverage launch.",
            "Sentiment": "positive",
            "PublishDate": 1751448474000,
            "Source": "default"
        },
        {
            "Title": "Dhampur Bio Organics Upgrades Distillery to Dual Feed Capability",
            "Summary": "Dhampur Bio Organics has converted its 100 KL daily molasses facility into a dual feed distillery. The upgraded facility can now process both molasses and grain as feedstock for production.",
            "Sentiment": "positive",
            "PublishDate": 1749129010000,
            "Source": "default"
        },
        {
            "Title": "Dhampur Bio Organics Reports Q4 Results and Declares Dividend",
            "Summary": "Dhampur Bio Organics announced its Q4 financial results, showing improved performance. The company's EBITDA increased to 985 million rupees from 825 million rupees year-over-year. The EBITDA margin slightly improved to 14% from 13.9%. Revenue grew to 7 billion rupees from 5.94 billion rupees in the same period last year. Additionally, the company declared a dividend of 1.25 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746169975000,
            "Source": "result"
        },
        {
            "Title": "Dhampur Bio Organics Reports Q4 Net Profit of 397M Rupees",
            "Summary": "Dhampur Bio Organics has announced its financial results for the fourth quarter. The company reported a net profit of 397 million rupees, compared to 412 million rupees in the same quarter of the previous year, indicating a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1746169868000,
            "Source": "result"
        },
        {
            "Title": "Dhampur Bio Organics to Consider Q4 Results on May 2",
            "Summary": "Dhampur Bio Organics has announced that it will consider and approve its financial results for the fourth quarter on May 2. This is a routine corporate announcement regarding the company's upcoming financial disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1745846530000,
            "Source": "default"
        },
        {
            "Title": "Dhampur Bio Organics Approves Capacity Expansion and Name Change",
            "Summary": "Dhampur Bio Organics has announced two significant developments. First, the company is enhancing the capacity of its country liquor plant to 8 million cases per year. Second, the company's board has approved a name change to Divija Bio Organics.",
            "Sentiment": "positive",
            "PublishDate": 1743639089000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhampur Bio Organics Announces Capacity Enhancement and Name Change",
            "Summary": "Dhampur Bio Organics has announced two significant developments. Firstly, the company is enhancing the capacity of its country liquor plant to 8 million cases per year. Secondly, the company's board has approved a name change to Divija Bio Organics.",
            "Sentiment": "positive",
            "PublishDate": 1743600810000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhampur Bio Organics Reports Profit in Q3 FY24",
            "Summary": "Dhampur Bio Organics has reported a significant turnaround in its financial performance for the third quarter. The company posted an EBITDA profit of 160 million rupees, compared to a loss of 20 million rupees in the same quarter of the previous year. The EBITDA margin for the quarter stood at 2.16%.",
            "Sentiment": "positive",
            "PublishDate": 1738651779000,
            "Source": "earnings"
        },
        {
            "Title": "Dhampur Bio Organics Reports Significant Revenue Growth in Q3",
            "Summary": "Dhampur Bio Organics has reported a substantial increase in its third-quarter revenue. The company's revenue for Q3 reached 7.2 billion rupees, compared to 4.2 billion rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738651452000,
            "Source": "earnings"
        },
        {
            "Title": "Dhampur Bio Organics Reports Increased Q3 Net Loss",
            "Summary": "Dhampur Bio Organics has reported a net loss of 62 million rupees for the third quarter, compared to a loss of 42 million rupees in the same period last year. This represents an increase in the company's net loss year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738651417000,
            "Source": "earnings"
        },
        {
            "Title": "Dhampur Bio Organics to Consider Q3 Results on February 4",
            "Summary": "Dhampur Bio Organics has announced that it will consider its financial results for the third quarter on February 4. This indicates that the company is preparing to release its quarterly earnings report, which will provide insights into its financial performance for the period.",
            "Sentiment": "neutral",
            "PublishDate": 1738239472000,
            "Source": "earnings"
        },
        {
            "Title": "Dhampur Bio Organics to Acquire Sonitron Bio Organics",
            "Summary": "Dhampur Bio Organics has announced its intention to acquire 100% shareholding of Sonitron Bio Organics. This acquisition represents a significant corporate action that could potentially expand Dhampur Bio Organics' market presence and capabilities in the bio-organics sector.",
            "Sentiment": "positive",
            "PublishDate": 1732753035000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhampur Bio Organics to Acquire Sonitron Bio Organics",
            "Summary": "Dhampur Bio Organics has announced its intention to acquire 100% shareholding of Sonitron Bio Organics. This acquisition represents a significant corporate action that could potentially expand Dhampur Bio Organics' market presence and capabilities in the bio-organics sector.",
            "Sentiment": "positive",
            "PublishDate": 1732713728000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhampur Bio Organics to Provide Guidance Update in Coming Months",
            "Summary": "Dhampur Bio Organics has announced that it will provide more detailed guidance on its business outlook within the next one to two months. The company plans to offer clarity specifically regarding exports, Minimum Support Price (MSP), and ethanol prices. This information was shared during a recent conference call update.",
            "Sentiment": "neutral",
            "PublishDate": 1730949548000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhampur Bio Organics Expects Increased Ethanol Supply and Higher Crushing",
            "Summary": "Dhampur Bio Organics anticipates an ethanol supply of approximately 6 crore liters this year. The company also expects to crush more than last year in specific areas, including West UP, Asmoli, and Meerganj, as revealed during a conference call.",
            "Sentiment": "positive",
            "PublishDate": 1730949310000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhampur Bio Organics Reports Q2 Net Loss",
            "Summary": "Dhampur Bio Organics reported a consolidated net loss of 234 million rupees in Q2, compared to a profit of 1 million rupees in the same quarter last year. The company's revenue decreased to 6.3 billion rupees from 6.7 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730731981000,
            "Source": "result"
        }
    ]
}