{
    "Symbol": "DBREALTY",
    "ISIN": "INE879I01012",
    "News": [
        {
            "Title": "Valor Estate Appoints New Independent Director",
            "Summary": "Valor Estate Limited announces cessation of Independent Director Mahesh Gandhi and appointment of Sundaram Rajagopal as new Independent Director for 5-year term.",
            "Sentiment": "neutral",
            "PublishDate": 1770823671455,
            "Source": "stocks"
        },
        {
            "Title": "Valor Estate Board Meet Set for Feb 11, 2026",
            "Summary": "Valor Estate Limited has scheduled a board meeting on February 11, 2026, to consider and approve Q3FY26 unaudited standalone and consolidated financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770364519485,
            "Source": "co_actions_results"
        },
        {
            "Title": "Valor Estate Gets NCLT Nod for Subsidiary Merger",
            "Summary": "Valor Estate Limited receives NCLT approval for merger of subsidiary companies Sahyadri Agro and Dairy Private Limited with Horizontal Ventures Private Limited, effective from April 1, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1769769972699,
            "Source": "co_actions_results"
        },
        {
            "Title": "Valor Estate Allots ₹645.75 Cr Preference Shares",
            "Summary": "Valor Estate Limited allotted 6.46 crore Compulsory Convertible Preference Shares worth ₹645.75 crores to Konark Realtech Private Limited following shareholder approval and stock exchange clearances.",
            "Sentiment": "neutral",
            "PublishDate": 1766737336280,
            "Source": "co_actions_results"
        },
        {
            "Title": "Valor Estate: Promoter Vinod Goenka Acquires Shares",
            "Summary": "Vinod K. Goenka acquired 1,00,000 equity shares of Valor Estate Limited through market purchase on December 18, 2025, increasing his shareholding to 0.4881% from 0.4696%.",
            "Sentiment": "neutral",
            "PublishDate": 1766210658183,
            "Source": "co_actions_results"
        },
        {
            "Title": "Valor Estate Clarifies CCPS Conversion Rumors, Reports Minimal Equity Dilution",
            "Summary": "Valor Estate addressed market rumors regarding CCPS conversion, stating that equity dilution is only 0.66% and the CCPS were issued as profit settlement rather than fresh investment. The company has filed a complaint with the cyber cell against those spreading the rumors.",
            "Sentiment": "negative",
            "PublishDate": 1763445831093,
            "Source": "stock"
        },
        {
            "Title": "Valor Estate Reports Strong Q2 Turnaround with 101m Rupees Net Profit",
            "Summary": "Valor Estate achieved a consolidated net profit of 101 million rupees in Q2, reversing from a 1.1 billion rupee loss in the same period last year, while revenue surged to 1.4 billion rupees from 35 million rupees year-over-year. The company's EBITDA turned positive at 448 million rupees compared to a 2.32 billion rupee loss previously, with EBITDA margin reaching 32.73%.",
            "Sentiment": "positive",
            "PublishDate": 1763337300797,
            "Source": "earnings"
        },
        {
            "Title": "Valor Estate Announces Listing of Advent Hotels Shares Following NCLT-Approved Demerger",
            "Summary": "Valor Estate Limited has announced the listing of 53,942,887 equity shares of Advent Hotels International Limited on BSE and NSE, effective November 13, 2025. The shares were issued following a composite scheme of amalgamation and arrangement sanctioned by NCLT Mumbai Bench on June 12, 2025. Under the scheme, Valor's hospitality undertaking was demerged and transferred to Advent Hotels. Existing Valor shareholders received 1 fully paid-up equity share of Advent for every 10 equity shares held in Valor as of the July 18, 2025 record date, with no cash consideration involved. BSE has admitted the shares for trading under scrip code 544446 in the trade-for-trade segment, while NSE has permitted trading under symbol ADVENTHTL.",
            "Sentiment": "neutral",
            "PublishDate": 1762931346754,
            "Source": "corporate_action"
        },
        {
            "Title": "Valor Estate Limited Creates New Step-Down Subsidiary for Real Estate Business",
            "Summary": "Valor Estate Limited (formerly DB Realty Limited) announced the incorporation of Blue Crest Realty Private Limited as a step-down wholly-owned subsidiary. The new company was incorporated on November 3, 2025, through Nine Paradise Erectors Private Limited, which is a wholly-owned subsidiary of Valor Estate. Blue Crest Realty has an authorized and paid-up share capital of Rs. 1,00,000 and will operate in the real estate and construction business. The company has not yet commenced operations and currently has zero turnover. Valor Estate acquired 100% shareholding through 10,000 equity shares of Rs. 10 each for a total consideration of Rs. 1,00,000 in cash.",
            "Sentiment": "neutral",
            "PublishDate": 1762257232679,
            "Source": "corporate_action"
        },
        {
            "Title": "Valor Estate Limited Incorporates Two Wholly Owned Subsidiaries for Real Estate Business",
            "Summary": "Valor Estate Limited (formerly D B Realty Limited) has incorporated two wholly owned subsidiary companies - Blue Crest Erectors Private Limited and Blue Crest Properties Private Limited. Both companies received their Certificate of Incorporation on October 28, 2025. Each subsidiary has an authorized and paid-up share capital of Rs. 1,00,000 consisting of 10,000 equity shares of Rs. 10 each. The subsidiaries are established to carry on real estate and construction business activities and have not yet commenced operations. Valor Estate acquired 100% shareholding in both entities through cash consideration of Rs. 1,00,000 each.",
            "Sentiment": "neutral",
            "PublishDate": 1761659172784,
            "Source": "order&deals"
        },
        {
            "Title": "Sahyadri Agro and Horizontal Ventures Sign Merger Agreement",
            "Summary": "Sahyadri Agro and Horizontal Ventures have signed a merger agreement. The announcement was made by Valor Estate.",
            "Sentiment": "positive",
            "PublishDate": 1759845659626,
            "Source": "order&deals"
        },
        {
            "Title": "Neelkamal Tower Construction Releases 1.5 Crore Pledged Shares After Loan Repayment",
            "Summary": "Neelkamal Tower Construction LLP, a promoter of Valor Estate Limited, released 1,50,00,000 pledged equity shares on September 3, 2025, following full repayment of a financial facility from Capri Global Capital Ltd. The shares were pledged in favor of Catalyst Trusteeship Ltd through Axis Bank Ltd. Post-release, Neelkamal Tower Construction's encumbered shareholding in Valor Estate reduced from 10.53% to 7.75% of total share capital. The company disclosed this information to BSE and NSE under SEBI regulations for substantial acquisition of shares and takeovers.",
            "Sentiment": "positive",
            "PublishDate": 1757416727693,
            "Source": "corporate_action"
        },
        {
            "Title": "Valor Estate Secures Approval for ₹2,000 Crore Affordable Housing Project",
            "Summary": "Valor Estate has received approval for a ₹2,000 crore project focused on affordable housing. The company has partnered with GHV Infrastructure for this development, with completion targeted for June 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755766169655,
            "Source": "stock"
        },
        {
            "Title": "Valor Estate Limited Completes Full Utilization of Rs 893.20 Crore QIP Proceeds",
            "Summary": "Valor Estate Limited (formerly D B Realty Limited) submitted its monitoring agency report for the quarter ended June 30, 2025, showing complete utilization of Rs 893.20 crore net proceeds from its Qualified Institutions Placement. The QIP, which raised Rs 920.20 crore gross, was conducted from March 7-13, 2024. All funds have been deployed across planned objectives including Rs 300 crore investment in associate company Bamboo Hotel and Global Centre for hotel developments, Rs 2 crore in unsecured loans to subsidiaries for debt repayment, Rs 225 crore for general corporate purposes, Rs 115 crore investment in Om Metals Consortium joint venture, Rs 250 crore in Lokhandwala DB Realty LLP for Jijamata Nagar projects, and Rs 1.20 crore in Lokhandwala DBS Realty for DB Hills development. The company made several board-approved changes to the original allocation plan. During the quarter, Rs 47.70 crore was recovered from a subsidiary due to a non-materialized contract and was redeployed for project-related expenses including loan interest payments and statutory dues. CARE Ratings Limited served as the monitoring agency and confirmed no material deviations from the offer document objectives.",
            "Sentiment": "positive",
            "PublishDate": 1755191886916,
            "Source": "corporate_action"
        },
        {
            "Title": "Valor Estate Reports Record ₹840 Crore Quarterly Revenue, Completes Hospitality Demerger",
            "Summary": "Valor Estate Limited delivered record quarterly revenue of ₹840.33 crore for Q1FY26, primarily driven by its 'Ten BKC' project which contributed ₹836.36 crore following receipt of partial occupancy certificate. Revenue surged 123x compared to ₹6.79 crore in Q1FY25, while EBITDA rose 8x to ₹45 crore. The company received ₹700 crore project advance for its Malad East PAP project development. The hospitality business demerger was completed with NCLT approval received on June 18, 2025, resulting in 5.39 crore Advent Hotels International shares being allotted to Valor shareholders. The hospitality segment generated ₹80.43 crore revenue with ₹25.11 crore EBITDA. The Board approved re-appointment of Vinod K. Goenka as Executive Chairman cum Managing Director for three years starting September 1, 2025, subject to shareholder approval. The company maintains a debt-to-equity ratio of 0.21:1 in real estate operations.",
            "Sentiment": "positive",
            "PublishDate": 1755189255673,
            "Source": "earnings"
        },
        {
            "Title": "Valor Estate Reports Strong Q1 Turnaround with 125M Rupees Net Profit",
            "Summary": "Valor Estate achieved a consolidated net profit of 125 million rupees in Q1, marking a significant turnaround from a loss of 136 million rupees in the same period last year. The company's total income surged to 8.99 billion rupees compared to 203 million rupees year-over-year. Other income also increased substantially to 583 million rupees from 135 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755184992456,
            "Source": "earnings"
        },
        {
            "Title": "Valor Estate Limited Issues Cost Apportionment Guidance Following Hospitality Business Demerger",
            "Summary": "Valor Estate Limited has provided shareholders with guidance on apportioning acquisition costs for equity shares following the demerger of its hospitality business into Advent Hotels International Limited. The National Company Law Tribunal sanctioned the composite scheme on June 12, 2025, which became effective July 1, 2025. Under the arrangement, shareholders received 1 AHIL share for every 10 VEL shares held as of July 18, 2025. The company advises shareholders to apportion their original acquisition costs with 81.47% attributed to VEL shares and 18.53% to AHIL shares. For example, if 1,000 VEL shares were acquired at ₹200 per share (₹2,00,000 total), the post-demerger cost would be ₹162,940 for VEL shares and ₹37,060 for AHIL shares. The scheme qualifies under Income Tax Act provisions, with AHIL share allotment not considered a transfer and original VEL acquisition dates applying to AHIL shares. The company emphasizes this is general guidance only and shareholders should consult tax advisors for specific implications.",
            "Sentiment": "neutral",
            "PublishDate": 1754474280783,
            "Source": "corporate_action"
        },
        {
            "Title": "Advent Hotels International Appoints Six New Directors in Board Restructuring",
            "Summary": "Advent Hotels International Limited appointed six new directors to its board effective July 21, 2025, as part of a composite scheme involving Valor Estate Limited and Esteem Properties Private Limited. The appointments include three independent directors: Ajoy Mehta (Chairman), Rajeev R A, and Maryam Khan (Woman Director), and three non-executive directors: Jayvardhan Goenka, Arshad Balwa, and Sanjana Goenka. Satish Agarwal resigned from his position as Non-Executive Director on the same date. The board now comprises eight directors total, including Managing Director and CEO Rahul Pandit and Mohammed Balwa who was appointed earlier. All appointments are subject to shareholder approval. The company has also constituted various statutory committees as per applicable laws.",
            "Sentiment": "neutral",
            "PublishDate": 1753160404437,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mukul Mahavir Agrawal Holds 1.21% Stake in Valor Estate",
            "Summary": "Investor Mukul Mahavir Agrawal has reported holding a 1.21% stake in Valor Estate for the first quarter. The disclosure indicates the investor's position in the real estate company during this period.",
            "Sentiment": "neutral",
            "PublishDate": 1753105743358,
            "Source": "stock"
        },
        {
            "Title": "Valor Estate Subsidiary Acquires Full Stake in Sahyadri Agro And Dairy",
            "Summary": "A subsidiary of Valor Estate has completed the acquisition of the entire stake in Sahyadri Agro And Dairy Pvt. Ltd. This acquisition represents a significant corporate action for Valor Estate, expanding its presence in the agro and dairy sector.",
            "Sentiment": "positive",
            "PublishDate": 1749569173000,
            "Source": "default"
        },
        {
            "Title": "Valor Estate Secures BMC Corrigendum for Mumbai Urban Resettlement Project",
            "Summary": "Valor Estate has obtained a corrigendum from the Brihanmumbai Municipal Corporation (BMC) for its urban resettlement housing initiative in Mumbai's Zone IV. The project is valued at ₹7,000 crore and involves the construction of 13,374 Project Affected Person (PAP) tenements. Valor Estate holds a 75% economic stake in the project.",
            "Sentiment": "positive",
            "PublishDate": 1749106242000,
            "Source": "default"
        },
        {
            "Title": "Valor Estate Reports Q4 Financial Results",
            "Summary": "Valor Estate has reported its Q4 financial results. The company's consolidated net loss for Q4 was 24 million rupees, compared to a loss of 65 million rupees in the same quarter last year, showing a year-over-year improvement. However, compared to the previous quarter, the company's performance declined, as it had reported a profit of 46 million rupees in Q3. Q4 revenue increased significantly to 6.5 billion rupees from 1.44 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1748618698000,
            "Source": "result"
        },
        {
            "Title": "Valor Estate Cleared to Proceed with ₹12,000 Crore Bandra Redevelopment Project",
            "Summary": "Valor Estate has received court clearance to move forward with a significant redevelopment project in Bandra, Mumbai, valued at ₹12,000 crore. This decision allows the company to proceed with its plans for a major real estate development in a prime location.",
            "Sentiment": "positive",
            "PublishDate": 1747181813000,
            "Source": "default"
        },
        {
            "Title": "Valor Estate to Proceed with ₹12,000 Crore Bandra Redevelopment Project",
            "Summary": "Valor Estate has received court clearance to move forward with a significant redevelopment project in Bandra, Mumbai, valued at ₹12,000 crore. This decision allows the company to commence work on what appears to be a large-scale real estate development in a prime location of Mumbai.",
            "Sentiment": "positive",
            "PublishDate": 1747147154000,
            "Source": "default"
        },
        {
            "Title": "Valor Estate Reports Mixed Q3 Financial Results",
            "Summary": "Valor Estate has announced its Q3 financial results. The company's consolidated net profit decreased significantly to 79 million rupees, compared to 4.6 billion rupees in the same quarter last year. However, revenue showed substantial growth, increasing to 3.3 billion rupees from 1.44 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739405740000,
            "Source": "earnings"
        },
        {
            "Title": "Valor Estate Reports Significant Decline in Q3 Net Profit",
            "Summary": "Valor Estate has released its Q3 financial results, showing a substantial decrease in net profit. The company reported a consolidated net profit of 79 million rupees, down from 4.6 billion rupees in the same quarter last year. However, revenue increased to 3.3 billion rupees from 1.44 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739372983000,
            "Source": "earnings"
        },
        {
            "Title": "Valor Estate to Consider Q3 Results on February 12",
            "Summary": "Valor Estate has announced that it will consider its third quarter (Q3) financial results on February 12. This indicates the company is preparing to review and potentially approve its quarterly financial performance before public disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1738756152000,
            "Source": "result"
        },
        {
            "Title": "Valor Estate Deals with Sahara Group's 106-Acre Land in Mumbai",
            "Summary": "Valor Estate has entered into a deal involving a 106-acre land parcel owned by the Sahara Group in Mumbai. The news indicates a significant real estate transaction, potentially impacting the property market in the city. However, specific details about the nature of the deal or its financial terms are not provided in the given information.",
            "Sentiment": "neutral",
            "PublishDate": 1736395720000,
            "Source": "corporate_action"
        },
        {
            "Title": "Supreme Court Directs SEBI to Examine Development Proposals for Sahara's Versova Property",
            "Summary": "The Supreme Court has instructed the Securities and Exchange Board of India (SEBI) to review development proposals from Oberoi Realty and Valor Estate for Sahara's Versova property. This development is seen as a positive indicator for Valor Estate, potentially impacting their future projects and market position.",
            "Sentiment": "positive",
            "PublishDate": 1736395706000,
            "Source": "corporate_action"
        },
        {
            "Title": "Valor Estates Announces Ambitious Growth Targets for FY26 and FY31",
            "Summary": "Valor Estates has set a residential sales goal of 4 million square feet (MSF) with revenue exceeding ₹1,600 crore for FY26. The company is also targeting a significant expansion to 27.7 MSF in residential sales, aiming for revenue of over ₹27,000 crore by FY31, according to their investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1731901150000,
            "Source": "corporate_action"
        },
        {
            "Title": "Valor Estate Reports Q2 Financial Results",
            "Summary": "Valor Estate announced its Q2 financial results, reporting a consolidated net loss of 1.1 billion rupees, compared to a loss of 8.8 billion rupees in the same quarter last year. This represents a significant reduction in losses year-over-year. Sequentially, the loss increased from 136 million rupees in the previous quarter. Revenue for Q2 stood at 790 million rupees, up from 680 million rupees in the same period last year, indicating a 16.2% year-over-year growth.",
            "Sentiment": "neutral",
            "PublishDate": 1731602673000,
            "Source": "result"
        },
        {
            "Title": "Valor Estate Receives MCGM Approval for Affordable Housing Project",
            "Summary": "<p><span class='positive'>Valor Estate</span> has been <span class='positive'>granted approval</span> by the <span class='neutral'>Municipal Corporation of Greater Mumbai (MCGM)</span> to <b>construct and deliver</b> approximately <span class='positive'>13,374 affordable housing units</span>. These units are part of the <span class='neutral'>Project-Affected Persons (PAP) scheme</span> and will be built on the company's land in <span class='neutral'>Malad East</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728664806000,
            "Source": "corporate_action"
        }
    ]
}