{
    "Symbol": "DBSTOCKBRO",
    "ISIN": "INE921B01025",
    "News": [
        {
            "Title": "DB International Stock Brokers Q3FY26 Results",
            "Summary": "DB International Stock Brokers reported Q3FY26 results with standalone net profit of ₹94.56 lakhs and consolidated net profit of ₹89.13 lakhs for quarter ended December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1769171253194,
            "Source": "co_actions_results"
        },
        {
            "Title": "Roopam Financiers Files Substantial Acquisition Report",
            "Summary": "Roopam Financiers Private Limited files disclosure under SEBI Regulation 29(2) for DB International Stock Brokers acquisition, with combined holding reaching 15.14%.",
            "Sentiment": "neutral",
            "PublishDate": 1766556973395,
            "Source": "co_actions_results"
        },
        {
            "Title": "DB (International) Stock Brokers Reports Q2 FY26 Results with Net Profit of ₹95.94 Lakh",
            "Summary": "DB (International) Stock Brokers Limited announced its unaudited financial results for the second quarter and half year ended September 30, 2025. The company reported a standalone net profit of ₹95.94 lakh for Q2, compared to ₹105.65 lakh in the previous quarter and ₹128.15 lakh in the same quarter last year. Total revenue from operations stood at ₹790.05 lakh for the quarter. For the six-month period, net profit reached ₹201.59 lakh with total revenue of ₹1,482.35 lakh. On a consolidated basis, the company posted a net profit of ₹98.26 lakh for Q2 and ₹199.11 lakh for the half-year period. The results were approved by the Board of Directors in their meeting held on October 17, 2025. The company operates in share broking and related services segment.",
            "Sentiment": "neutral",
            "PublishDate": 1760701977392,
            "Source": "earnings"
        },
        {
            "Title": "DB (International) Stock Brokers Completes 33rd AGM with All 9 Resolutions Passed",
            "Summary": "DB (International) Stock Brokers Limited held its 33rd Annual General Meeting on September 4, 2025, via video conferencing from 10:30 AM to 11:15 AM. The company passed all 9 resolutions with requisite majority, including adoption of audited financial statements for FY 2024-25, re-appointment of Ms. Shikha Mundra as director, and appointment of Ms. Sheetal Periwal as Joint Managing Director. Other approved resolutions included re-appointment of Mr. Shiv Narayan Daga as Chairman cum Managing Director, appointment of three independent directors (Mr. Navratan Soni, Mr. Varun Aggarwal, and Ms. Shila Rathi) for 5-year terms, appointment of secretarial auditors for 5 years, and alteration of Articles of Association. The meeting had 6,421 shareholders on record date, with 6 promoter group members and 6,415 public shareholders attending via video conferencing. Scrutinizer Suryakant Gupta from Surya Gupta & Associates oversaw the voting process.",
            "Sentiment": "positive",
            "PublishDate": 1756985218250,
            "Source": "corporate_governance"
        },
        {
            "Title": "DB (International) Stock Brokers Limited Submits Q1 FY2026 Financial Results",
            "Summary": "DB (International) Stock Brokers Limited has submitted its unaudited standalone and consolidated financial results for the first quarter ended June 30, 2025, along with the Limited Review Report to BSE and NSE. The results were approved during the company's board meeting held on July 29, 2025, at WASME House, Noida. The meeting commenced at 3:30 PM and concluded at 5:00 PM, with Managing Director Shiv Narayan Daga overseeing the submission process.",
            "Sentiment": "neutral",
            "PublishDate": 1753795149663,
            "Source": "earnings"
        },
        {
            "Title": "DB (International) Stock Brokers Announces Major Leadership Restructuring with New Joint MD and Independent Directors",
            "Summary": "DB (International) Stock Brokers Limited has implemented significant leadership changes effective July 29, 2025. The company appointed Ms. Sheetal Periwal as Joint Managing Director, who holds a 3.79% stake in the company and is the daughter of the Managing Director. Mr. Shiv Narayan Daga was re-appointed as Chairman cum Managing Director, maintaining his 18.89% shareholding. The board also added three new Non-Executive Independent Directors: Mr. Navratan Soni (40+ years experience, commerce and law graduate), Mr. Varun Aggarwal (Chartered Accountant with 15+ years experience), and Ms. Shila Rathi. Additionally, Ms. Prachi Sharma was re-designated as Manager-Secretarial and Listing Compliances, while Mr. Shiv Singh was re-designated as Company Secretary and Compliance Officer. All appointments are for five-year terms and require shareholder approval at the upcoming general meeting.",
            "Sentiment": "positive",
            "PublishDate": 1753792961263,
            "Source": "corporate_governance"
        },
        {
            "Title": "DB (International) Stock Brokers Board Approves Articles of Association Changes",
            "Summary": "DB (International) Stock Brokers Limited's Board of Directors has approved alterations to the company's Articles of Association, subject to shareholder approval at the upcoming Annual General Meeting. The key change involves adding a new clause under Article 130 that would allow the same individual to simultaneously serve as both Chairperson and Managing Director of the company. The board meeting was held on July 29, 2025, and the proposed amendment requires shareholder approval to become effective.",
            "Sentiment": "neutral",
            "PublishDate": 1753791990967,
            "Source": "corporate_governance"
        },
        {
            "Title": "DB International Stock Brokers Approves Q1 Results and Major Board Changes",
            "Summary": "DB (International) Stock Brokers Limited held its board meeting on July 29, 2025, approving several key decisions. The board approved unaudited standalone and consolidated financial results for the first quarter ended June 30, 2025. Major leadership changes include the appointment of Ms. Sheetal Periwal as Joint Managing Director for 5 years, who is the daughter of Managing Director Shiv Narayan Daga and holds 3.79% company shares. Mr. Shiv Narayan Daga was re-appointed as Chairman cum Managing Director, holding 18.89% shares with over 40 years of stock market experience. The company appointed three new independent directors: Mr. Navratan Soni, Mr. Varun Aggarwal, and Ms. Shila Rathi, all for 5-year terms. Additional changes include re-designation of Ms. Prachi Sharma as Manager-Secretarial and Listing Compliances and Mr. Shiv Singh as Company Secretary and Compliance Officer. The board also approved amendments to the Articles of Association allowing the same individual to serve as both Chairperson and Managing Director. An Annual General Meeting is scheduled for September 4, 2025, via video conferencing, with Mr. Suryakant Gupta appointed as scrutinizer. All appointments are subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1753790664603,
            "Source": "corporate_action"
        }
    ]
}