{
    "Symbol": "DCAL",
    "ISIN": "INE385W01011",
    "News": [
        {
            "Title": "Dishman Carbogen Amcis Q3FY26 Results Mixed Performance",
            "Summary": "Dishman Carbogen Amcis reports consolidated revenue of ₹719.80 crores for Q3FY26, up from ₹682.34 crores YoY, but posts net loss of ₹12.97 crores against ₹4.63 crores profit in Q3FY25.",
            "Sentiment": "mixed",
            "PublishDate": 1770127903985,
            "Source": "co_actions_results"
        },
        {
            "Title": "DCAL Allots ₹50 Crore Non-Convertible Debentures",
            "Summary": "Dishman Carbogen Amcis Limited successfully allotted 5,000 senior secured non-convertible debentures worth ₹50 crores through private placement with 3-year maturity period.",
            "Sentiment": "positive",
            "PublishDate": 1768893530437,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dishman Carbogen Amcis Approves ₹50 Cr NCD Issue",
            "Summary": "Dishman Carbogen Amcis Ltd approves issuance of up to ₹50 crores in non-convertible debentures with 10% coupon rate and quarterly payments, secured by properties and corporate guarantees.",
            "Sentiment": "positive",
            "PublishDate": 1766825622872,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dishman Carbogen Amcis Board Meet on Dec 27",
            "Summary": "Dishman Carbogen Amcis has scheduled a board meeting for December 27 to discuss funding arrangements through Non-Convertible Debentures (NCDs).",
            "Sentiment": "neutral",
            "PublishDate": 1766500845688,
            "Source": "stocks"
        },
        {
            "Title": "Dishman Carbogen Amcis Subsidiary Refinances Credit Facilities, Increases Capacity by CHF 40 Million",
            "Summary": "Dishman Carbogen Amcis subsidiary CARBOGEN AMCIS Holding AG has successfully refinanced its syndicated credit facilities. The refinancing added CHF 40 million in extra credit capacity with an additional CHF 30 million option available. Following this refinancing, the company's total credit capacity now stands at CHF 162.24 million and EUR 50 million.",
            "Sentiment": "positive",
            "PublishDate": 1762931988165,
            "Source": "stock"
        },
        {
            "Title": "DishmanCarbogenAmcis Reports Strong Q2 FY26 Results with 64% EBITDA Growth",
            "Summary": "DishmanCarbogenAmcis delivered robust quarterly results with revenue of INR 652.6 crores and EBITDA of INR 149 crores, achieving a 22.8% EBITDA margin. For the first half, EBITDA grew 64.4% to INR 289.5 crores compared to INR 176 crores in the previous year, with margins improving to 21.3% from 13.4%. The CDMO segment contributed 78% of quarterly revenue at INR 509 crores, while Marketable Molecules grew 85% to INR 143 crores. Strong performance was driven by late Phase 3 development work and supplies to a Japanese innovator for ADC molecules. The French subsidiary received GMP certification, enabling drug product manufacturing capabilities. The company expects 8-10% revenue growth for the full year and aims to achieve 20% EBITDA margins. Management confirmed plans for fundraising up to INR 1,000 crores primarily to retire Indian debt of approximately INR 700 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762899636403,
            "Source": "earnings"
        },
        {
            "Title": "Dishman Carbogen Amcis Reports 97% Jump in Q2 Net Profit Despite Revenue Decline",
            "Summary": "Dishman Carbogen Amcis reported Q2 consolidated net profit of 652.7 million rupees, nearly doubling from 331 million rupees in the same period last year. However, revenue declined to 6.53 billion rupees from 7.89 billion rupees year-over-year. EBITDA increased marginally to 1.49 billion rupees from 1.47 billion rupees, while EBITDA margin improved significantly to 22.81% from 18.65% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762274728302,
            "Source": "earnings"
        },
        {
            "Title": "Dishman Carbogen Amcis Schedules Q2 FY26 Results Conference Call",
            "Summary": "Dishman Carbogen Amcis Limited will announce its Q2 FY26 results on November 4, 2025, followed by an earnings conference call on November 5, 2025, from 15:00-16:00 hrs IST. The call will be hosted by management representatives Mr. Harshil Dalal (Global CFO) and the Chief Executive Officer of Carbogen Amcis Entities to discuss the company's financial results and performance for the quarter and half year ended September 30, 2025. The company is a fully integrated CDMO (Contract Development and Manufacturing Organisation) established in 1983, with global presence across Switzerland, UK, France, Netherlands, India, and China, providing end-to-end integrated CDMO offerings including APIs, High Potent APIs, and various pharmaceutical products.",
            "Sentiment": "neutral",
            "PublishDate": 1761931373864,
            "Source": "earnings"
        },
        {
            "Title": "Dishman Carbogen Amcis Completes Merger of Two Swiss Step-Down Subsidiaries",
            "Summary": "Dishman Carbogen Amcis Limited announced the merger of two material wholly-owned step-down subsidiaries in Switzerland. CARBOGEN AMCIS SPECIALITIES AG has been merged into CARBOGEN AMCIS INNOVATIONS AG following regulatory approval. Both companies were incorporated in Switzerland in 2019 and are wholly-owned subsidiaries of CARBOGEN AMCIS Holding AG. The entities had NIL turnover for the financial year ended March 31, 2025. Both companies operate in trading of raw materials, intermediate and finished products for chemical and pharmaceutical industries, as well as asset management and investments in related sectors. The merger aims to simplify the legal structure of the CARBOGEN AMCIS Group. No cash consideration or share exchange is involved in the transaction, and there is no change in the shareholding pattern of Dishman Carbogen Amcis Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1760621311758,
            "Source": "corporate_action"
        },
        {
            "Title": "Dishman Carbogen Amcis Partners with Celonic Group for ADC Platform Development",
            "Summary": "Dishman Carbogen Amcis has formed a partnership with Celonic Group to develop an ADC (Antibody-Drug Conjugate) platform. The collaboration focuses on advancing ADC technology development between the two companies.",
            "Sentiment": "positive",
            "PublishDate": 1759847409345,
            "Source": "order&deals"
        },
        {
            "Title": "Dishman Carbogen Amcis Increases Authorized Share Capital by Rs. 3.95 Crores",
            "Summary": "Dishman Carbogen Amcis Limited shareholders approved an alteration to the Capital Clause of the Memorandum of Association through a special resolution passed via postal ballot on September 19, 2025. The company increased its authorized share capital by creating an additional 1,97,50,000 equity shares of Rs. 2 each, totaling Rs. 3,95,00,000. This amendment raised the total authorized share capital from Rs. 34,05,00,000 (17,02,50,000 equity shares) to Rs. 38,00,00,000 (19,00,00,000 equity shares). The approval was confirmed through a scrutinizer's report dated September 19, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758293739325,
            "Source": "corporate_action"
        },
        {
            "Title": "Dishman Carbogen Amcis Submits Revised Investor Presentation to Correct Typographical Errors",
            "Summary": "Dishman Carbogen Amcis Limited submitted a revised investor presentation to stock exchanges to correct typographical and formatting errors on slides 20 and 23 of its previously submitted presentation. The company originally submitted the presentation on September 4, 2025, and has now provided the corrected version. The updated presentation is also available on the company's website. The revision was made to address inadvertent errors that occurred in the original submission.",
            "Sentiment": "neutral",
            "PublishDate": 1758082605364,
            "Source": "stock"
        },
        {
            "Title": "Dishman Carbogen Amcis Reports Revenue Growth to INR 28,958 Million with Strong Order Book",
            "Summary": "Dishman Carbogen Amcis Limited submitted an investor presentation showing revenue of INR 28,958 million in LTM Q1 FY26 with 9.1% CAGR from FY21-25. The company reported EBITDA margin of 20.1% and maintains a strong orderbook of INR 23,094 million for FY26. The global CDMO operates across 10 manufacturing sites with capabilities in drug substance, drug product, and specialty chemicals. The company serves 200+ customers and has a pipeline of 28 late-stage molecules and 19 commercial projects. Net debt to EBITDA ratio improved from 5.3x in FY23 to 2.8x in LTM Q1 FY26. DCAL focuses on high-value areas including high potency APIs and antibody-drug conjugates, with strategic initiatives including expansion into ADCs, co-investment models with pharmaceutical companies, and operational integration between India and CARBOGEN AMCIS operations.",
            "Sentiment": "positive",
            "PublishDate": 1757044359144,
            "Source": "stock"
        },
        {
            "Title": "Dishman Carbogen Amcis Receives US FDA Establishment Inspection Report for Naroda Facility",
            "Summary": "Dishman Carbogen Amcis Limited received an Establishment Inspection Report (EIR) from the US FDA for its Naroda facility, indicating successful closure of the inspection. The FDA inspection was conducted from June 9-13, 2025 and completed on June 12, 2025. The company's facilities in Bavla and Naroda in India, along with multiple facilities in Switzerland and the Netherlands, continue to maintain US FDA approval.",
            "Sentiment": "positive",
            "PublishDate": 1756220763563,
            "Source": "stock"
        },
        {
            "Title": "Dishman Carbogen Amcis Seeks Shareholder Approval for Capital Increase and Fund Raising Up to Rs 1,000 Crores",
            "Summary": "Dishman Carbogen Amcis Limited has submitted a postal ballot notice seeking shareholder approval for five key resolutions. The company proposes to increase its authorized share capital from Rs 34.05 crores to Rs 38 crores by creating additional 1.97 crore equity shares of Rs 2 each. The board seeks approval to raise funds up to Rs 1,000 crores through equity shares or other eligible securities via methods including preferential issue, qualified institutions placement, or other permissible modes. The funds will be used for debt repayment of the company and its subsidiaries, and general corporate purposes. Additionally, shareholders will vote on re-appointing Mrs. Deohooti J. Vyas as Whole-time Director for five years from September 3, 2026, with monthly remuneration of Rs 15 lacs, and confirming the appointment of Mr. Dhaval Rameshchandra Shah as Non-Executive and Non-Independent Director. The e-voting period runs from August 21, 2025, to September 19, 2025, with results to be announced by September 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755612516603,
            "Source": "corporate_action"
        },
        {
            "Title": "Dishman Carbogen Amcis Expands Complex API Capabilities and CDMO Partnerships",
            "Summary": "Dishman Carbogen Amcis is expanding its complex API capabilities and deepening CDMO partnerships. The company is leveraging regulatory clearances in the U.S. and EU to tap into high-value pharmaceutical outsourcing demand.",
            "Sentiment": "positive",
            "PublishDate": 1755102880157,
            "Source": "stock"
        },
        {
            "Title": "Dishman Carbogen Amcis Reports Q1 FY25 Results, Approves ₹10,000 Million Fundraising and Board Changes",
            "Summary": "Dishman Carbogen Amcis Limited's board approved quarterly results for Q1 ended June 30, 2025, showing consolidated net profit of ₹23.41 crores compared to a loss of ₹77.57 crores in the same quarter last year. Total income from operations increased to ₹708.05 crores from ₹523.78 crores year-on-year. The board approved a proposal to raise funds up to ₹10,000 million through various methods including preferential issue and qualified institutional placement, subject to shareholder approval. The company also approved increasing authorized share capital from ₹34.05 crores to ₹38 crores. Board changes include re-appointment of Mrs. Deohooti J. Vyas as Whole-time Director for five years effective September 2026, and appointment of Mr. Dhaval Rameshchandra Shah as Non-Executive and Non-Independent Director effective August 12, 2025. Both appointments require shareholder approval within three months through postal ballot.",
            "Sentiment": "positive",
            "PublishDate": 1755020227473,
            "Source": "earnings"
        },
        {
            "Title": "USFDA Inspection of Ishman Carbogen Amics Concludes with No Observations",
            "Summary": "Ishman Carbogen Amics has received positive news following a USFDA inspection. The inspection concluded without any observations or issuance of Form 483's, indicating that no issues were found during the inspection process.",
            "Sentiment": "positive",
            "PublishDate": 1749799289000,
            "Source": "default"
        },
        {
            "Title": "Dishman Carbogen Amcis' Swiss Unit Secures Co-Investment Agreement",
            "Summary": "Dishman Carbogen Amcis announced that its Swiss unit has entered into a co-investment agreement exceeding CHF 25 million (approximately 260 crore Indian Rupees) with a key Japanese client. The investment is aimed at enhancing the company's ADC (Antibody-Drug Conjugate) manufacturing facilities located in Aarau and Neuland, Switzerland.",
            "Sentiment": "positive",
            "PublishDate": 1749201134000,
            "Source": "default"
        },
        {
            "Title": "Dishman Carbogen Amcis Reports Profit in Q4, Revenue and EBITDA Increase",
            "Summary": "Dishman Carbogen Amcis reported a net profit of 431 million rupees in Q4, compared to a loss of 699 million rupees in the same quarter last year. The company's revenue increased to 7.16 billion rupees from 6.54 billion rupees year-over-year. EBITDA rose to 1.52 billion rupees from 629 million rupees, with the EBITDA margin improving to 21.3% from 9.6% in the corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747884681000,
            "Source": "result"
        },
        {
            "Title": "Dishman Carbogen Amcis Obtains First Drug Manufacturing License in Shanghai",
            "Summary": "Dishman Carbogen Amcis has announced that its Shanghai facility has successfully obtained its first Drug Manufacturing License (DML) from China's National Medical Products Administration (NMPA). This license is a significant milestone for the company's operations in China, allowing them to manufacture pharmaceutical products in their Shanghai facility.",
            "Sentiment": "positive",
            "PublishDate": 1745281554000,
            "Source": "default"
        },
        {
            "Title": "Dishman Carbogen Amcis Obtains First Drug Manufacturing License in Shanghai",
            "Summary": "Dishman Carbogen Amcis has announced that its facility in Shanghai has successfully obtained its first Drug Manufacturing License (DML) from China's National Medical Products Administration (NMPA). This achievement marks a significant milestone for the company's operations in China.",
            "Sentiment": "positive",
            "PublishDate": 1745245875000,
            "Source": "default"
        },
        {
            "Title": "Dishman Carbogen Amcis Subsidiary Receives Drug Manufacturing License in Shanghai",
            "Summary": "A subsidiary of Dishman Carbogen Amcis has been granted a drug manufacturing license by the National Medical Products Administration (NMPA) for its facility in Shanghai, China. This license allows the company to manufacture pharmaceutical products at the Shanghai site, potentially expanding its operations and capabilities in the Chinese market.",
            "Sentiment": "positive",
            "PublishDate": 1744330025000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dishman Carbogen Amcis Subsidiary Obtains Drug Manufacturing License in China",
            "Summary": "A subsidiary of Dishman Carbogen Amcis has received a drug manufacturing license from China's National Medical Products Administration (NMPA) for its Shanghai site. This license allows the company to manufacture pharmaceutical products in China, potentially expanding its operations in the Asian market.",
            "Sentiment": "positive",
            "PublishDate": 1744211240000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dishman Carbogen Amcis Subsidiary Secures GMP Certification for Aseptic Drug Manufacturing Site",
            "Summary": "Dishman Carbogen Amcis announced that its subsidiary, Carbogen Amcis SAS, has successfully obtained Good Manufacturing Practice (GMP) certification following an inspection by ANSM (French National Agency for Medicines and Health Products Safety) for its aseptic drug product manufacturing site. This certification is a significant achievement for the company's pharmaceutical manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1742861336000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dishman Carbogen Amcis Subsidiary Secures GMP Certification for Aseptic Drug Manufacturing",
            "Summary": "Dishman Carbogen Amcis announced that its subsidiary, Carbogen Amcis SAS, has successfully obtained Good Manufacturing Practice (GMP) certification following an inspection by ANSM (French National Agency for Medicines and Health Products Safety) for its aseptic drug product manufacturing site.",
            "Sentiment": "positive",
            "PublishDate": 1742829557000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dishman Carbogen Amcis' French Unit Receives GMP Compliance Certificate",
            "Summary": "Carbogen Amcis Sas, a French subsidiary of Dishman Carbogen Amcis, has been awarded a Certificate of GMP (Good Manufacturing Practice) Compliance for its Saint-beauzire site. The certification was issued by the National Agency for the Safety of Medicine and Health Products (ANSM) in France.",
            "Sentiment": "positive",
            "PublishDate": 1742429014000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dishman Carbogen Amcis Unit Receives GMP Compliance Certificate in France",
            "Summary": "Carbogen Amcis SAS, a unit of Dishman Carbogen Amcis located in France, has been awarded a Certificate of GMP (Good Manufacturing Practice) Compliance for its Saint-Beauzire site. The certification was issued by the National Agency for the Safety of Medicine and Health Products (ANSM), which is the French regulatory authority for pharmaceuticals.",
            "Sentiment": "positive",
            "PublishDate": 1742395229000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dishman Carbogen Amcis Approves Debenture Issue of Up to 500 Million Rupees",
            "Summary": "The board of Dishman Carbogen Amcis has approved the issuance of debentures with an aggregate value of up to 500 million rupees. This decision represents a significant financial move for the company, potentially aimed at raising capital for various corporate purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1741779782000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dishman Carbogen Amcis to Consider Fund Raising via Non-convertible Debentures",
            "Summary": "Dishman Carbogen Amcis has announced a board meeting scheduled for March 12 to discuss and potentially approve a proposal for raising funds through the issuance of non-convertible debentures via private placement.",
            "Sentiment": "neutral",
            "PublishDate": 1741565367000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dishman Carbogen Amcis to Consider Fund Raising via Private Placement of NCDs",
            "Summary": "Dishman Carbogen Amcis has scheduled a board meeting on March 12 to consider and approve a proposal for raising funds through the issuance of non-convertible debentures (NCDs) via private placement.",
            "Sentiment": "neutral",
            "PublishDate": 1741350726000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dishman Carbogen Amcis Renews GMP Certification for Facility",
            "Summary": "Dishman Carbogen Amcis has successfully renewed the Good Manufacturing Practice (GMP) certification for one of its facilities. This renewal indicates that the facility continues to meet the required quality standards for pharmaceutical manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1736496997000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dishman Carbogen's Swiss Subsidiary Passes Regulatory Inspection",
            "Summary": "Carbogen Amcis AG, a subsidiary of Dishman Carbogen, has successfully completed a Swissmedic inspection of its facility in Vionnaz, Switzerland. Swissmedic is the Swiss regulatory authority for therapeutic products, and passing their inspection indicates compliance with regulatory standards.",
            "Sentiment": "positive",
            "PublishDate": 1736496980000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dishman Carbogen Amcis Reports Profit in Q2 FY24",
            "Summary": "Dishman Carbogen Amcis has reported a consolidated net profit of 331 million rupees in Q2 FY24, compared to a loss of 409 million rupees in the same quarter last year. The company's revenue increased to 7.89 billion rupees from 5.8 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731551430000,
            "Source": "result"
        }
    ]
}