{
    "Symbol": "DCBBANK",
    "ISIN": "INE503A01015",
    "News": [
        {
            "Title": "DCB Bank Allots 38,400 Equity Shares Under ESOP",
            "Summary": "DCB Bank issued 38,400 equity shares to employees under ESOP on January 27, 2026, increasing paid-up capital from 321,744,917 to 321,783,317 shares of Rs.10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1769508077268,
            "Source": "co_actions_results"
        },
        {
            "Title": "DBS Bank advises maintaining equity exposure amid risks",
            "Summary": "DBS Bank's Senior Investment Strategist Joanne Goh recommends investors maintain equity exposure despite geopolitical risks, suggesting diversification with alternatives like private equity and gold instead of broad reduction.",
            "Sentiment": "neutral",
            "PublishDate": 1769173714911,
            "Source": "stocks"
        },
        {
            "Title": "DCB Bank Q3 FY26 Net Profit Jumps 22% to ₹184.74 Cr",
            "Summary": "DCB Bank reported strong Q3 FY26 results with net profit rising 22% YoY to ₹184.74 crore. Total income grew 12.3% to ₹2,082.30 crore while NPA ratios improved significantly.",
            "Sentiment": "positive",
            "PublishDate": 1769164335537,
            "Source": "co_actions_results"
        },
        {
            "Title": "DCB Bank Credit Ratings Reaffirmed by CRISIL",
            "Summary": "CRISIL reaffirmed DCB Bank's ratings at 'AA-/Stable/A1+' on January 21, 2026, with Certificate of Deposits programme enhanced from ₹1,500 crore to ₹2,000 crore, reflecting healthy capitalization and established SME market position.",
            "Sentiment": "positive",
            "PublishDate": 1769012024666,
            "Source": "stocks"
        },
        {
            "Title": "DCB Bank Earnings Call Set for Jan 23 Post Q3 Results",
            "Summary": "DCB Bank will host an earnings call on January 23, 2026, at 18:30 IST to discuss Q3FY26 unaudited financial results with analysts and investors, following the board meeting scheduled for the same day.",
            "Sentiment": "neutral",
            "PublishDate": 1768390647968,
            "Source": "co_actions_results"
        },
        {
            "Title": "DCB Bank Reports Consistent Growth with 21% Advances Growth and Improved Operational Efficiency",
            "Summary": "DCB Bank presented quarterly results showing consistent advances growth averaging 21.02% and deposits growth of 20.13% over the last 6 quarters, with significant improvement in cost-to-average assets ratio dropping 32 basis points from peak levels. The bank targets annual growth of 18-20% for the next two years while maintaining return on equity of 13.50%-14.50% and focusing on transitioning from a lender to a full-service banker for self-employed and MSME segments.",
            "Sentiment": "positive",
            "PublishDate": 1763128925281,
            "Source": "stock"
        },
        {
            "Title": "DCB Bank Allots 4.97 Lakh Equity Shares Under Employee Stock Option Plan",
            "Summary": "DCB Bank has issued and allotted 4,97,170 equity shares of Rs. 10 each to its employees under the Employee Stock Option Plan (ESOP) on November 6, 2025. Following this allotment, the bank's issued and paid-up share capital has increased from 321,215,127 equity shares to 321,712,297 equity shares of Rs. 10 each. The bank informed BSE and NSE about this development in compliance with SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762429801086,
            "Source": "corporate_action"
        },
        {
            "Title": "DCB Bank Reports Record Quarterly Profit of INR 184 Crores in Q2 FY26",
            "Summary": "DCB Bank announced its highest ever quarterly profit of INR 184 crores for Q2 FY26, with earnings per share reaching 5.84. Total deposits grew 18.79% year-on-year to INR 64,777 crores, while advances increased 19.14% to INR 52,975 crores, marking five consecutive quarters of high growth. The bank improved its net interest margin from 3.2% to 3.23% despite repo rate cuts, as cost of deposits decreased by 16 basis points to 6.96%. Credit costs remained low at 31 basis points for the quarter. The bank reduced its employee base by 9% (1,118 employees) while maintaining growth, leading to cost-to-average assets declining to 2.43%. Management expects full-year credit costs to remain below 45 basis points and projects ROE targets of 13.5% for FY27 and 14.5% for FY28. The co-lending book represents 16.22% of total advances, with management planning to reduce this to below 15% by year-end.",
            "Sentiment": "positive",
            "PublishDate": 1761296962609,
            "Source": "earnings"
        },
        {
            "Title": "DCB Bank Shares Surge 13.5% on Strong Quarterly Results, Achieving Best Single-Day Gain Since April 2022",
            "Summary": "DCB Bank shares jumped 13.5% following the release of its September quarter results. The bank reported 17% growth in Net Interest Income to ₹596 crore compared to ₹509 crore in the same quarter last year. Net profit increased 19% to ₹184 crore, while provisions nearly halved sequentially. Key performance drivers included credit costs declining to 0.31% from 0.59% in the June quarter, well below the bank's projected range of 45-55 basis points. Net Interest Margins expanded by 3 basis points to 3.23% despite rate cut pressures, with the bank targeting margins between 3.5%-3.65%. All 22 analysts covering the stock maintain buy ratings, with consensus price targets suggesting 15.6% upside potential. The stock closed 12.5% higher at ₹145.1, extending year-to-date gains to 20%.",
            "Sentiment": "positive",
            "PublishDate": 1760936181568,
            "Source": "stock"
        },
        {
            "Title": "DCB Bank Projects 18-20% Advances Growth with Enhanced MSME Focus",
            "Summary": "DCB Bank has projected sustained advances growth of 18-20% while strengthening its focus on the MSME segment. The bank plans to improve profitability through granular secured loans and a low credit cost model.",
            "Sentiment": "positive",
            "PublishDate": 1760718084905,
            "Source": "stock"
        },
        {
            "Title": "DCB Bank and Credilio Launch Novio Secured Credit Card for New-to-Credit Users",
            "Summary": "DCB Bank and fintech firm Credilio launched the Novio Secured Credit Card, a RuPay card targeting India's new-to-credit population. The card integrates with UPI and is backed by a fixed deposit, enabling individuals without prior credit history to access formal credit. India has 40 million unique credit card holders, while the Novio card targets around 300 million potential users, including middle-to-upper middle income individuals across metros and smaller cities. The card connects with the Novio App for applications, fixed deposit booking via UPI, and immediate transactions. During the beta phase, Credilio issued over 50,000 secured credit cards and targets 5 million cards over the next three years. The product offers rewards, lifestyle benefits, instant reward redemption, and digital account management through the app.",
            "Sentiment": "positive",
            "PublishDate": 1760703802156,
            "Source": "stock"
        },
        {
            "Title": "DCB Bank Board Approves Amendment to Articles of Association for Wholetime Directors",
            "Summary": "DCB Bank's Board of Directors approved an amendment to Article 140B of the Bank's Articles of Association. The amendment changes the special position of Wholetime Directors, allowing them to be made liable for retirement by rotation with Board approval. Previously, Wholetime Directors were not subject to retirement by rotation while holding office. The amendment requires approval from the Reserve Bank of India and the Bank's shareholders before implementation.",
            "Sentiment": "neutral",
            "PublishDate": 1760699369146,
            "Source": "corporate_governance"
        },
        {
            "Title": "DCB Bank Reports 18% Growth in Q2 FY2026 Profit at INR 184 Crores",
            "Summary": "DCB Bank announced its second quarter FY2026 results with Profit After Tax reaching INR 184 crores, marking an 18% increase from INR 155 crores in Q2 FY2025. The bank demonstrated strong growth momentum with both advances and deposits growing 19% year-on-year. Asset quality improved with Gross NPA declining to 2.91% and Net NPA at 1.21% as of September 30, 2025. The Provision Coverage Ratio stood at 74.15%. Capital Adequacy Ratio remained robust at 16.41% with Tier I at 13.97%. Managing Director & CEO Praveen Kutty highlighted continued strong growth in deposits and advances, reduction in cost of deposits and borrowing leading to NIM improvement, and lower credit costs due to improved collections and recovery.",
            "Sentiment": "positive",
            "PublishDate": 1760697293040,
            "Source": "earnings"
        },
        {
            "Title": "DCB Bank Announces Quarterly Results and Completes ₹83 Crore Preferential Share Allotment to AKFED",
            "Summary": "DCB Bank Limited announced its unaudited financial results for the second quarter and half year ended September 30, 2025. The Board of Directors approved the results at a meeting held on October 17, 2025, along with a Limited Review Report from Joint Statutory Auditors B S R & Co. LLP and Varma & Varma. Additionally, the bank completed a preferential allotment of 60,58,394 equity shares to promoter Aga Khan Fund for Economic Development S.A (AKFED) on October 10, 2025, at ₹137 per share for a total consideration of ₹83 crore. The allotment received prior approvals from shareholders and the Reserve Bank of India on September 29, 2025. The bank confirmed it has no subsidiary, associate, or joint venture companies as of September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760696394918,
            "Source": "earnings"
        },
        {
            "Title": "DCB Bank Co-MD Targets Balance Sheet Doubling in 3-3.5 Years",
            "Summary": "DCB Bank's Co-Managing Director has announced plans to double the bank's balance sheet within a timeframe of 3 to 3.5 years. This represents an ambitious growth target for the financial institution.",
            "Sentiment": "positive",
            "PublishDate": 1760673062341,
            "Source": "stock"
        },
        {
            "Title": "DCB Bank Chairman Farokh N. Subedar Retires After Completing Independent Director Term",
            "Summary": "Mr. Farokh N. Subedar has retired from his positions as Part Time Non-Executive Chairperson and Independent Director of DCB Bank Limited, effective October 14, 2025. His retirement follows the completion of his term as an Independent Director. DCB Bank acknowledged Mr. Subedar's contribution during his tenure with the organization.",
            "Sentiment": "neutral",
            "PublishDate": 1760446840245,
            "Source": "corporate_governance"
        },
        {
            "Title": "DCB Bank Raises INR 83 Crore Through Preferential Share Allotment to Promoter",
            "Summary": "DCB Bank Limited allotted 60,58,394 equity shares to Aga Khan Fund for Economic Development S.A., one of its promoters, through a preferential issue at INR 137 per share. The transaction raised INR 82.99 crore for the bank. Each share has a face value of INR 10 with a premium of INR 127 per share. Following this allotment, the bank's paid-up equity share capital increased from INR 315.16 crore to INR 321.22 crore, with the total number of equity shares rising from 31.52 crore to 32.12 crore shares. The newly allotted shares will rank equally with existing equity shares and will be listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "positive",
            "PublishDate": 1760099640422,
            "Source": "corporate_action"
        },
        {
            "Title": "DCB Bank Partners with ZET to Launch Secured Credit Card for First-Time Borrowers",
            "Summary": "DCB Bank and fintech platform ZET have launched a co-branded secured credit card on the RuPay network, targeting first-time borrowers and underserved customers. The card is backed by a fixed deposit and designed to help users build credit history while offering regular credit card benefits. Users can make UPI payments through RuPay and earn interest on deposits while accessing credit. ZET claims responsible usage can help users build a 700+ credit score within 30 to 45 days. The partnership aims to address India's credit gap, where nearly half of adults remain outside the formal credit system. With only around 90 million credit card users in a credit-eligible population of over 400 million, the secured model offers banks risk mitigation through fixed deposit collateral while providing customers an accessible entry point to formal credit. Digital onboarding through ZET enables reach across smaller towns and semi-urban markets.",
            "Sentiment": "positive",
            "PublishDate": 1759984220223,
            "Source": "order&deals"
        },
        {
            "Title": "RBI Approves AKFED's Acquisition of 60.58 Lakh DCB Bank Shares Through Preferential Issue",
            "Summary": "The Reserve Bank of India has approved AKFED's acquisition of 60.58 lakh shares in DCB Bank through a preferential issue. This transaction will increase promoter ownership in the bank and comes with a 5-year lock-in period for the acquired shares.",
            "Sentiment": "positive",
            "PublishDate": 1759201264490,
            "Source": "order&deals"
        },
        {
            "Title": "DCB Bank Ordered to Reverse Rs 30 Lakh and Pay Rs 1 Lakh Compensation by RBI Ombudsman",
            "Summary": "DCB Bank received an order from the Reserve Bank Integrated Ombudsman at Bhubaneswar directing the bank to reverse Rs 30,00,000 to a complainant's loan account and pay Rs 1,00,000 as compensation for mental agony and harassment due to deficiency in services. The Ombudsman concluded that DCB Bank failed to reconcile contradictions and submit a credible investigation report, reflecting gross operational lapses and serious deficiencies in internal control and compliance mechanisms. The bank is exploring filing an appeal against this order.",
            "Sentiment": "negative",
            "PublishDate": 1758132815912,
            "Source": "corporate_governance"
        },
        {
            "Title": "DCB Bank Appoints Krishna Ramasankaran as New Chief Internal Auditor",
            "Summary": "DCB Bank appointed Krishna Ramasankaran as Chief Internal Auditor effective September 17, 2025, for a three-year term. He replaces Anuradha T.P., who ceased to be the CIA on September 16, 2025. Ramasankaran will continue to serve as Senior Management Personnel of the bank. The bank acknowledged Anuradha T.P.'s contribution during her tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1758040278259,
            "Source": "corporate_governance"
        },
        {
            "Title": "DCB Bank Reports Record Operating Profit of Rs 327 Crores in Q1 FY26, Deposits Grow 20% YoY",
            "Summary": "DCB Bank achieved its highest-ever quarterly operating profit of Rs 327 crores and record fee income of Rs 236 crores in Q1 FY26. The bank maintained consistent growth with deposits increasing 20% and assets growing 21% year-on-year, marking the fourth consecutive quarter of 19-20% balance sheet growth. Bottom-line grew 19.72% in the quarter. Operating revenue increased 28% while operating costs rose only 13%, delivering 15% operating leverage. However, the bank took accelerated provisions, providing 100% coverage for the entire NPA stock of MFI and unsecured direct assignment loans as of March 31, 2025. Net Interest Margin declined 9 basis points to 2.99% despite three repo rate cuts totaling 100 basis points. Slippage ratio increased to 4.6% due to higher flows from MFI, unsecured direct assignments, and surprisingly, small-ticket secured direct assignments. The bank expects future credit costs to remain below 40 basis points. Management reduced headcount by 800 employees while maintaining growth, demonstrating improved productivity through technology adoption and process improvements.",
            "Sentiment": "neutral",
            "PublishDate": 1754398329867,
            "Source": "earnings"
        },
        {
            "Title": "DCB Bank Reports 71% Jump in Quarterly Provisions to 1.15 Billion Rupees",
            "Summary": "DCB Bank's provisions increased significantly to 1.15 billion rupees in the first quarter, compared to 672 million rupees in the previous quarter, representing a quarter-on-quarter rise of approximately 71%.",
            "Sentiment": "negative",
            "PublishDate": 1753946466199,
            "Source": "earnings"
        },
        {
            "Title": "DCB Bank Reports Quarterly Financial Results for Quarter Ended June 30, 2025",
            "Summary": "DCB Bank Limited released its unaudited financial results for the quarter ended June 30, 2025. The bank reported a net profit of ₹157.26 crore compared to ₹131.36 crore in the same quarter last year. Interest earned increased to ₹1,813.57 crore from ₹1,489.25 crore year-over-year. Total income rose to ₹2,049.69 crore from ₹1,632.25 crore in the previous year quarter. The bank's gross NPAs stood at ₹1,553.63 crore, representing 2.98% of gross advances, compared to 3.33% in the same quarter last year. Net NPAs were ₹625.40 crore or 1.22% of net advances. The capital adequacy ratio was 16.66% under Basel III norms. Basic earnings per share was ₹5.00 compared to ₹4.20 in the corresponding quarter of the previous year. The results were approved by the Board of Directors and reviewed by joint statutory auditors B S R & Co. LLP and Varma & Varma.",
            "Sentiment": "positive",
            "PublishDate": 1753946447337,
            "Source": "earnings"
        },
        {
            "Title": "DCB Bank Reports Marginal Improvement in Asset Quality with GNPA at 2.98%",
            "Summary": "DCB Bank's gross non-performing assets (GNPA) ratio improved slightly to 2.98% from 2.99% on a quarter-on-quarter basis. However, the net non-performing assets (NNPA) ratio increased to 1.22% from 1.12% quarter-on-quarter. The marginal improvement in GNPA indicates better asset quality management, while the rise in NNPA suggests higher net bad loans after accounting for provisions.",
            "Sentiment": "neutral",
            "PublishDate": 1753946054903,
            "Source": "earnings"
        },
        {
            "Title": "DCB Bank Schedules Board Meeting on July 31, 2025 to Approve Quarterly Financial Results",
            "Summary": "DCB Bank Limited has announced a Board of Directors meeting scheduled for July 31, 2025. The meeting will consider and approve the unaudited financial results for the quarter ended June 30, 2025. The bank has informed BSE and NSE about this board meeting through a formal communication dated July 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753185661039,
            "Source": "corporate_action"
        },
        {
            "Title": "DCB Bank: Soccer Shapes CEO Praveen Kutty's Leadership Style",
            "Summary": "DCB Bank's CEO Praveen Kutty draws leadership lessons from soccer, emphasizing teamwork, strategic thinking, and adaptability in banking. He applies sports principles to foster ownership, celebrate team success, and manage pressure in the corporate environment.",
            "Sentiment": "positive",
            "PublishDate": 1748668539000,
            "Source": "normal_news"
        },
        {
            "Title": "DCB Bank: Q4 Profit Rises 14%, Dividend Announced",
            "Summary": "DCB Bank reported a 14% YoY increase in Q4 FY25 net profit to Rs 177.07 crore. Net interest income grew 10% to Rs 557.96 crore. Asset quality improved with gross NPAs at 2.99% and net NPAs at 1.12%. The bank announced a dividend of Rs 1.35 per share. DCB Bank's stock surged over 10% following the results.",
            "Sentiment": "positive",
            "PublishDate": 1745824145000,
            "Source": "earnings"
        },
        {
            "Title": "DCB Bank Reports Q4 FY23 Results and Corporate Actions",
            "Summary": "DCB Bank announced its Q4 FY23 results, showing a net profit of 1.77 billion rupees, up from 1.56 billion year-over-year. Revenue increased to 17.42 billion rupees from 14.4 billion. The bank's asset quality improved with GNPA at 2.99% and NNPA at 1.12%. The bank recommended a dividend of 1.35 rupees per equity share and plans to raise funds through Tier II bonds and equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1745799450000,
            "Source": "default"
        },
        {
            "Title": "DCB Bank Plans to Raise Funds Through Bonds and Equity",
            "Summary": "DCB Bank has announced plans to raise capital through two methods. The bank intends to raise up to 5 billion rupees via Tier II bonds and up to 7.50 billion rupees through equity shares and other securities.",
            "Sentiment": "positive",
            "PublishDate": 1745581384000,
            "Source": "default"
        },
        {
            "Title": "DCB Bank Reports Q4 FY23 Results and Declares Dividend",
            "Summary": "DCB Bank announced its Q4 FY23 results, reporting a net profit of 1.77 billion rupees, up from 1.56 billion rupees year-over-year. The bank's revenue increased to 17.42 billion rupees from 14.4 billion rupees in the same period last year. The Gross Non-Performing Assets (GNPA) ratio improved to 2.99% from 3.11% in the previous quarter, while Net Non-Performing Assets (NNPA) ratio decreased to 1.12% from 1.18%. The bank's board recommended a dividend of 1.35 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1745581378000,
            "Source": "result"
        },
        {
            "Title": "DCB Bank: Q4 Profit Up 14%, Asset Quality Improves, Dividend Declared",
            "Summary": "DCB Bank reported a 13.7% YoY increase in Q4 net profit to ₹177 crore. Net interest income rose 9.9% to ₹558 crore. Gross NPA ratio improved to 2.99% from 3.11% QoQ, and net NPA ratio to 1.12% from 1.18%. The bank declared a dividend of ₹1.35 per share.",
            "Sentiment": "positive",
            "PublishDate": 1745579111000,
            "Source": "earnings"
        },
        {
            "Title": "DCB Bank to Consider Q4 Results on April 25",
            "Summary": "DCB Bank has announced that it will consider its fourth quarter (Q4) financial results on April 25. This is a routine quarterly event where the bank will review and potentially approve its financial performance for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1744893362000,
            "Source": "default"
        },
        {
            "Title": "DCB Bank: RBI Approves Praveen Kutty as New MD",
            "Summary": "The Reserve Bank of India has approved Praveen Kutty as the new Managing Director of DCB Bank. Kutty has been part of the bank's leadership team for the past 16 years, ensuring continuity of strategy.",
            "Sentiment": "positive",
            "PublishDate": 1737955194000,
            "Source": "corporate_governance"
        },
        {
            "Title": "DCB Bank Reports Q3 Financial Results",
            "Summary": "DCB Bank has announced its Q3 financial results. The bank's net profit increased to 1.5 billion rupees from 1.3 billion rupees year-over-year. Revenue rose to 16.7 billion rupees from 13.74 billion rupees. Gross Non-Performing Assets (GNPA) improved to 3.11% from 3.29% quarter-on-quarter, while Net Non-Performing Assets (NNPA) slightly increased to 1.18% from 1.17%. Provisions increased to 672 million rupees from 456 million rupees quarter-on-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737936832000,
            "Source": "earnings"
        },
        {
            "Title": "DCB Bank: Q3 Net Profit Rises 20%, NII Grows 14.5%",
            "Summary": "DCB Bank reported a 19.6% YoY increase in Q3 net profit to ₹151.4 crore. Net Interest Income grew 14.5% to ₹543 crore. Gross NPA ratio improved to 3.11% from 3.29% QoQ. Advances grew 23% YoY, while deposits increased 20%. The bank maintains a strong capital adequacy ratio of 16.29%.",
            "Sentiment": "positive",
            "PublishDate": 1737721590000,
            "Source": "earnings"
        },
        {
            "Title": "DCB Bank: Q2 Results Show NIM Decline, Strong Fee Income",
            "Summary": "DCB Bank's Q2 results reveal a decline in Net Interest Margins (NIMs), but profitability was supported by strong fee income. IDBI Capital provides a review of the bank's performance.",
            "Sentiment": "neutral",
            "PublishDate": 1729828733000,
            "Source": "result"
        },
        {
            "Title": "DCB Bank Reports Increased Provisions in Q2",
            "Summary": "DCB Bank's provisions for the second quarter have risen to 456 million rupees, up from 284 million rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1729771929000,
            "Source": "result"
        },
        {
            "Title": "DCB Bank Reports Slight Improvement in Asset Quality for Q2",
            "Summary": "DCB Bank has reported a marginal improvement in its asset quality for the second quarter. The Gross Non-Performing Assets (GNPA) ratio decreased to 3.29% from 3.33% in the previous quarter. Similarly, the Net Non-Performing Assets (NNPA) ratio slightly improved to 1.17% from 1.18% quarter-on-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1729771914000,
            "Source": "result"
        },
        {
            "Title": "DCB Bank Reports Q2 Interest Earnings Growth",
            "Summary": "DCB Bank has reported its interest earned for the second quarter. The bank's interest income increased to 15.7 billion rupees, up from 13.1 billion rupees in the same quarter of the previous year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1729771892000,
            "Source": "result"
        },
        {
            "Title": "DCB Bank Reports Q2 Net Profit Increase",
            "Summary": "DCB Bank has announced its Q2 financial results, reporting a net profit of 1.5 billion rupees. This represents a year-over-year increase from 1.3 billion rupees in the same quarter last year, and a quarter-over-quarter increase from 1.3 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1729771880000,
            "Source": "result"
        },
        {
            "Title": "DCB Bank Increases Investment in Saksham Gram Credit",
            "Summary": "<p><span class='neutral'>DCB Bank</span> has agreed to <span class='positive'>acquire or subscribe</span> to 321,420 equity shares of <span class='neutral'>Saksham Gram Credit Private Limited</span> for <b>13.1 million rupees</b>. This <span class='positive'>additional investment</span> will <span class='positive'>increase</span> DCB Bank's total shareholding in Saksham to <b>9.90%</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728648724000,
            "Source": "corporate_action"
        }
    ]
}