{
    "Symbol": "DCI",
    "ISIN": "INE0A1101019",
    "News": [
        {
            "Title": "DC Infotech Issues Warrant Exercise Reminder",
            "Summary": "DC Infotech & Communication Limited reminds warrant holders to exercise 4,00,000 equity share warrants by February 12, 2026, with exercise price of ₹235 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1768977249933,
            "Source": "co_actions_results"
        },
        {
            "Title": "DC Infotech FZCO Gets Gold Partner Status from Etihad",
            "Summary": "DC Infotech & Communication's FZCO subsidiary has been recognized as a Gold Local Content Partner by Etihad Aviation Group, marking a significant milestone in regional growth and local value creation.",
            "Sentiment": "positive",
            "PublishDate": 1767597411932,
            "Source": "stocks"
        },
        {
            "Title": "DC Infotech gets BBB credit rating upgrade from CRISIL",
            "Summary": "DC Infotech & Communication Limited receives BBB credit rating upgrade from CRISIL with stable outlook, reflecting improved financial strength and operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1767094131590,
            "Source": "stocks"
        },
        {
            "Title": "DC Infotech Reports Strong Q2 FY26 Performance with 18% Revenue Growth",
            "Summary": "DC Infotech and Communications Limited delivered robust quarterly results with total revenue growing 18% to Rs 153.42 crores in Q2 FY26 and 21% to Rs 301.52 crores in H1 FY26, driven by strong demand in networking and unified communication portfolios. The company achieved a 36% year-on-year increase in PAT with margin expansion of 43 basis points, supported by strategic product mix optimization and strengthened partnerships with key brands including Samsung (36% revenue share), Netgear (23%), and D-Link (19%).",
            "Sentiment": "positive",
            "PublishDate": 1764235430840,
            "Source": "earnings"
        },
        {
            "Title": "DC Infotech Partners With Sangfor Technologies For MEA Region Cybersecurity Expansion",
            "Summary": "DC Infotech And Communication Ltd has formed a strategic partnership with Sangfor Technologies to enhance cybersecurity and cloud services offerings. The collaboration targets the Middle East and Africa (MEA) region to strengthen technology infrastructure and security solutions.",
            "Sentiment": "positive",
            "PublishDate": 1764138006399,
            "Source": "order&deals"
        },
        {
            "Title": "DC Infotech Promoter Group Increases Stake to 63.75% Through Warrant Conversion",
            "Summary": "Chetankumar H Timbadia and persons acting in concert have increased their shareholding in DC Infotech and Communication Limited to 63.75% from 53.88% through conversion of warrants into equity shares. The group acquired 15,80,000 shares through preferential allotment, with trading approval received on September 24, 2025. The company's equity share capital increased from 1,44,20,000 shares to 1,60,00,000 shares of face value Rs. 10 each following the conversion. The promoter group includes nine individuals: Devansh Kamleshkumar Sayani, Madhuri Sayani, Aayush Sayani, Yash Devendra Sayani, Devendra Kishorkumar Sayani, Jayesh K Sayani, Dharmik Chetankumar Timbadia, Dhairya Chetankumar Timbadia, and Devansh Kamleshkumar Sayani. DC Infotech shares are listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1758865240393,
            "Source": "corporate_action"
        },
        {
            "Title": "DC Infotech Reports No Deviations in Warrant Proceeds Utilization for Quarter Ended June 30, 2025",
            "Summary": "DC Infotech & Communication Limited reported no deviations or variations in the utilization of proceeds from their preferential issue of warrants for the quarter ended June 30, 2025. The company received funds through three separate conversions of warrants into equity shares: Rs. 97.20 lakh from conversion of 2.40 lakh warrants on January 9, 2025; Rs. 2.71 crore from conversion of 6.70 lakh warrants on June 6, 2025; and Rs. 3.69 crore from conversion of 9.10 lakh warrants on June 27, 2025. All proceeds were utilized to meet the working capital requirements of the company as originally stated in the November 20, 2023 notice. The company confirmed that funds were used according to the original allocation with no modifications to objects or amounts.",
            "Sentiment": "neutral",
            "PublishDate": 1754574862167,
            "Source": "corporate_action"
        },
        {
            "Title": "DC Infotech & Communication Limited Approves Share Capital Increase and Reports Quarterly Results",
            "Summary": "DC Infotech & Communication Limited's Board of Directors approved increasing the company's authorized share capital from Rs. 17 crore to Rs. 36 crore, subject to shareholder approval at the upcoming Annual General Meeting. The company also approved its unaudited financial results for the quarter ended June 30, 2025. The quarterly results showed revenue from operations of Rs. 148.09 crore compared to Rs. 118.51 crore in the same quarter last year. Net profit for the quarter was Rs. 40.48 crore versus Rs. 30.57 crore in the previous year quarter. Basic earnings per share stood at Rs. 2.79 compared to Rs. 2.35 in the corresponding quarter. The company operates in two business segments: Products and Security Software and Services. The Board also approved the notice for the 7th Annual General Meeting for the financial year ended March 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754569007589,
            "Source": "corporate_action"
        }
    ]
}