{
    "Symbol": "DCM",
    "ISIN": "INE498A01018",
    "News": [
        {
            "Title": "DCM Limited Reports Q3FY26 Consolidated Loss",
            "Summary": "DCM Limited posted a consolidated net loss of Rs 30.00 lakh for Q3FY26 compared to a profit of Rs 2,056.00 lakh in Q3FY25, with revenue from operations at Rs 1,768.00 lakh.",
            "Sentiment": "negative",
            "PublishDate": 1770908571564,
            "Source": "co_actions_results"
        },
        {
            "Title": "DCM Shriram NCLT Approves Corporate Restructuring",
            "Summary": "NCLT sanctions DCM Shriram Industries' composite scheme involving amalgamation with Lily Commercial and demerger into two new entities. Shareholders to receive shares in resultant companies.",
            "Sentiment": "neutral",
            "PublishDate": 1770113933558,
            "Source": "co_actions_results"
        },
        {
            "Title": "DCM Shriram Industries Demerger Record Date Active",
            "Summary": "DCM Shriram Industries shares trade ex-demerger as December 26 record date takes effect. Shareholders to receive 1:1:1 ratio shares in two new entities DSFCL and DSIL alongside existing holdings.",
            "Sentiment": "neutral",
            "PublishDate": 1766717980877,
            "Source": "co_actions_results"
        },
        {
            "Title": "DCM Limited Company Secretary Arjit Gupta Resigns",
            "Summary": "DCM Limited announces resignation of Company Secretary and Compliance Officer Arjit Gupta effective December 12, 2025, as he pursues opportunities outside the organization.",
            "Sentiment": "neutral",
            "PublishDate": 1765548088640,
            "Source": "stocks"
        },
        {
            "Title": "DCM Limited Board Approves Settlement of Punjab VAT Dispute Under Government Recovery Scheme",
            "Summary": "DCM Limited's Board of Directors approved settling a pending VAT litigation matter with Punjab authorities under a one-time settlement scheme. The dispute involves Rs. 811.67 lacs in claims related to Entry Tax credit disallowance on HSD (High Speed Diesel) by the Assistant Commissioner of Sales Tax, Ropar. Under the settlement scheme notified by Punjab Government, DCM will pay Rs. 113.89 lacs (50% of basic tax amount) to resolve all claims including basic tax, penalty and interest. The company has already deposited Rs. 99 lacs during the appeal process and will pay the remaining Rs. 19.23 lacs under the settlement scheme. The Board meeting was held and the settlement was approved to avoid extended litigation and ongoing interest and penalty liabilities, despite legal advice suggesting the company had good merit in the case.",
            "Sentiment": "neutral",
            "PublishDate": 1762974674853,
            "Source": "stock"
        },
        {
            "Title": "DCM Limited Reports Q2 Profit of Rs 168 Lakhs Despite Ongoing Engineering Division Lockout",
            "Summary": "DCM Limited announced quarterly results for the period ended September 30, 2025, reporting a profit of Rs 168 lakhs compared to Rs 130 lakhs in the same quarter last year. Revenue from operations remained stable at Rs 1,762 lakhs versus Rs 1,663 lakhs in the previous year. The company continues to face challenges with its engineering division lockout that began in October 2019, with unpaid wages aggregating to Rs 7,719 lakhs. DCM has issued a notice for forfeiture and termination of its Joint Development Agreement with GCD Prime for land development in Hisar, following suspension of the development license. The company's current liabilities exceed current assets by Rs 745 lakhs as of September 30, 2025. Management believes it can continue operations through real estate operations management and engineering business restructuring plans.",
            "Sentiment": "neutral",
            "PublishDate": 1762973455199,
            "Source": "earnings"
        },
        {
            "Title": "DCM Shriram Industries Reports Q2 Net Loss of 31.2 Million Rupees",
            "Summary": "DCM Shriram Industries reported a consolidated net loss of 31.2 million rupees in Q2, compared to a profit of 229 million rupees in the same period last year. Revenue declined to 4.99 billion rupees from 5.33 billion rupees year-over-year. EBITDA dropped significantly to 95 million rupees from 459 million rupees, while EBITDA margin compressed to 1.83% from 8.72% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762388935664,
            "Source": "earnings"
        },
        {
            "Title": "DCM Limited Terminates Joint Development Agreement with GCD Prime Over License Suspension Issues",
            "Summary": "DCM Limited's board approved issuing a forfeiture and termination notice to developer GCD Prime regarding their joint development agreement for a 68.35-acre land parcel in Hisar, Haryana. The project, intended for affordable residential plotted colony development under Deen Dayal Jan Awas Yojana-2016, faced regulatory setbacks when the Haryana government suspended the development license in April 2023. The Haryana Real Estate Authority also placed the project registration in abeyance and directed HDFC Bank to freeze DCM's escrow account. Despite DCM's efforts to support the developer in getting the suspension revoked, the matter remained pending for over two years. The board cited continuing breaches of obligations by the developer to obtain license revocation from the Haryana government. Under the original agreement executed in August 2022, DCM was entitled to 55% of net sale revenue while the developer would receive 45%. The termination notice gives the developer 15 days to respond, after which amounts paid by the developer to DCM will be forfeited and all development rights will be revoked.",
            "Sentiment": "negative",
            "PublishDate": 1761985909964,
            "Source": "corporate_action"
        },
        {
            "Title": "DCM Limited Approves Q1 Results and Appoints New Secretarial Auditors for Five-Year Term",
            "Summary": "DCM Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing consolidated revenue of Rs 1,761 lakh and profit after tax of Rs 324 lakh, compared to a loss of Rs 29 lakh in the same quarter last year. The company reported earnings per share of Rs 1.74. The Board also appointed M/s. Pragnya Pradhan & Associates as Secretarial Auditors for five consecutive years from 2025-26 to 2029-30, subject to shareholder approval. The company continues to face challenges including an ongoing lockout at its engineering division since October 2019, with unprovided wages totaling Rs 7,584 lakh. Additionally, DCM's land development license in Hisar remains suspended, affecting a joint development project and keeping Rs 5,000 lakh in advances under current liabilities. Current liabilities exceed current assets by Rs 555 lakh as of June 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755175098295,
            "Source": "earnings"
        },
        {
            "Title": "DCM Shriram Industries Reports Decline in Q1 Revenue and Net Profit",
            "Summary": "DCM Shriram Industries reported Q1 revenue of 5 billion rupees compared to 5.54 billion rupees in the same period last year. The company's consolidated net profit for Q1 was 169 million rupees, down from 314 million rupees year-over-year. Both revenue and profit showed declines compared to the previous year's first quarter performance.",
            "Sentiment": "negative",
            "PublishDate": 1754990645912,
            "Source": "earnings"
        },
        {
            "Title": "DCM Limited to Establish Wholly-Owned Subsidiary in USA",
            "Summary": "DCM Limited has approved a proposal to incorporate a new wholly-owned subsidiary company in the United States of America. The subsidiary will be named DCM Infotech.",
            "Sentiment": "positive",
            "PublishDate": 1743842451000,
            "Source": "corporate_action"
        },
        {
            "Title": "Investor Anil Kumar Goel Increases Stake in DCM",
            "Summary": "<p>Investor <span class='neutral'>Anil Kumar Goel</span> has <span class='positive'>increased</span> his stake in <b>DCM</b> by <span class='positive'>1.13%</span> during the second quarter. His total shareholding in the company now stands at <span class='positive'>2.20%</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728884719000,
            "Source": "normal_news"
        }
    ]
}