{
    "Symbol": "DCMFINSERV",
    "ISIN": "INE891B01012",
    "News": [
        {
            "Title": "DCM Financial Services Reports Q3 FY26 Loss",
            "Summary": "DCM Financial Services Limited reported a net loss of Rs. 25.95 lakhs for Q3 FY26 ended December 31, 2025, compared to Rs. 23.77 lakhs loss in Q3 FY25. Nine-month loss widened to Rs. 89.85 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1770639720806,
            "Source": "co_actions_results"
        },
        {
            "Title": "DCM Financial Services Reports Quarterly Loss, Faces Audit Qualifications on Interest Provisions",
            "Summary": "DCM Financial Services Limited reported a net loss of Rs 38.57 lakhs for the quarter ended September 30, 2025, compared to a loss of Rs 7.33 lakhs in the previous quarter. The company's half-year loss stood at Rs 63.85 lakhs versus Rs 13.33 lakhs in the corresponding period last year. The statutory auditors highlighted significant concerns including non-provision of interest worth Rs 143.07 lakhs on debentures and fixed deposits for the quarter. The company operates under a court-appointed One Man Committee scheme for resolving depositor disputes, with Rs 1,683 lakhs in unprovided interest on debentures and fixed deposits. Total financial indebtedness stands at Rs 56.99 crores, including Rs 14.17 crores in bank loans and Rs 16.03 crores in unlisted debt securities. The auditors noted missing balance confirmations from various parties and ongoing legal disputes including arbitration with NBCC Ltd involving Rs 288.29 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1762954391762,
            "Source": "earnings"
        },
        {
            "Title": "DCM Financial Services Reports Rs 25.33 Lakh Loss in Q1 FY2026",
            "Summary": "DCM Financial Services Limited reported a standalone net loss of Rs 25.33 lakhs for the quarter ended June 30, 2025, compared to a loss of Rs 5.70 lakhs in the same period last year. The company generated other income of Rs 22.46 lakhs with no revenue from operations. Total expenses increased to Rs 48.06 lakhs from Rs 84.11 lakhs in the previous year quarter. On a consolidated basis, the company reported a net loss of Rs 25.57 lakhs. The auditors noted several qualifications including non-provision of interest on secured/unsecured loans totaling Rs 141.58 lakhs, which understated the reported loss. The company continues to operate under a court-appointed committee scheme for resolving depositor and debenture holder disputes. Basic and diluted earnings per share stood at negative Rs 0.11.",
            "Sentiment": "negative",
            "PublishDate": 1754659991707,
            "Source": "earnings"
        }
    ]
}