{
    "Symbol": "DCMNVL",
    "ISIN": "INE08KP01019",
    "News": [
        {
            "Title": "DCM Nouvelle seeks shareholder approval for director appointments",
            "Summary": "DCM Nouvelle Limited has issued a postal ballot notice seeking member approval for the appointment of two Independent Directors - Mr. Deepak Sood and Mr. Rajinder Khanna - through special resolutions.",
            "Sentiment": "neutral",
            "PublishDate": 1768546692729,
            "Source": "stocks"
        },
        {
            "Title": "DCM Nouvelle Reports Q2 Results and Appoints Two New Directors",
            "Summary": "DCM Nouvelle Limited announced its unaudited financial results for the quarter ended 30 September 2025 and appointed Mr. Deepak Sood as Independent Director and Mr. Rajinder Khanna as Non-Executive Non-Independent Director. The appointments are effective from 01 December 2025, with Mr. Sood serving a 5-year term until 30 November 2030 and Mr. Khanna liable to retire by rotation, both subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1763132628678,
            "Source": "corporate_action"
        },
        {
            "Title": "DCM Nouvelle Limited Appoints Shekher Kapoor as Company Secretary and Compliance Officer",
            "Summary": "DCM Nouvelle Limited has appointed Mr. Shekher Kapoor as Company Secretary and Compliance Officer (Key Managerial Personnel) with immediate effect, as approved by the Board of Directors on September 10th, 2025. The appointment was made based on the recommendation of the Nomination and Remuneration Committee. Mr. Kapoor is an Associate Member of the Institute of Company Secretaries of India with ICSI Membership Number 69198. He brings diverse corporate and secretarial experience in Companies Act, SEBI, and RBI Regulations. The company is listed on BSE with scrip code 542729 and on NSE with symbol DCMNVL.",
            "Sentiment": "positive",
            "PublishDate": 1757495572361,
            "Source": "corporate_governance"
        },
        {
            "Title": "DCM Nouvelle Reports 6.7% Revenue Decline in Q1 FY2026, Profit Drops to ₹666 Lakhs",
            "Summary": "DCM Nouvelle Limited reported quarterly results for the period ended June 30, 2025. Revenue from operations decreased to ₹24,969 lakhs from ₹27,439 lakhs in the previous quarter. Net profit declined to ₹666 lakhs compared to ₹714 lakhs in the prior quarter. On a year-over-year basis, revenue fell from ₹26,528 lakhs while profit increased significantly from ₹153 lakhs. The company operates in textiles as its primary business segment. On a consolidated basis, the company and its subsidiary DCM Nouvelle Specialty Chemicals Limited reported total revenue of ₹25,262 lakhs and net profit of ₹160 lakhs. The chemicals segment reported a loss of ₹510 lakhs during the quarter. The company also announced the re-appointment of Walker Chandiok & Co LLP as statutory auditors for five consecutive years, subject to shareholder approval.",
            "Sentiment": "negative",
            "PublishDate": 1755096453327,
            "Source": "earnings"
        },
        {
            "Title": "DCM Nouvelle Reports Improved Q3 EBITDA and Margin",
            "Summary": "DCM Nouvelle has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 88 million rupees to 128 million rupees. Additionally, the EBITDA margin expanded from 3.29% to 4.85%.",
            "Sentiment": "positive",
            "PublishDate": 1738679357000,
            "Source": "earnings"
        },
        {
            "Title": "DCM Nouvelle Reports Profit in Q3 FY2024, Revenue Slightly Down",
            "Summary": "DCM Nouvelle has turned profitable in the third quarter, reporting a net profit of 22 million rupees compared to a loss of 9.8 million rupees in the same quarter last year. However, the company's revenue slightly decreased to 2.6 billion rupees from 2.7 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738679253000,
            "Source": "earnings"
        },
        {
            "Title": "DCM Nouvelle Increases Investment in DCMSCL",
            "Summary": "DCM Nouvelle has invested 320.1 million rupees in DCMSCL, increasing its shareholding in the company to 87.08%.",
            "Sentiment": "positive",
            "PublishDate": 1735562681000,
            "Source": "corporate_action"
        }
    ]
}