{
    "Symbol": "DCMSHRIRAM",
    "ISIN": "INE499A01024",
    "News": [
        {
            "Title": "DCM Shriram Q3 FY26: Revenue up 13% to ₹3,811 cr",
            "Summary": "DCM Shriram reported 13% revenue growth to ₹3,811 crores in Q3 FY26, driven by strong performance in chemicals, sugar & ethanol segments. PBDIT increased 4% to ₹560 crores despite margin pressures.",
            "Sentiment": "positive",
            "PublishDate": 1769687233966,
            "Source": "co_actions_results"
        },
        {
            "Title": "DCM Shriram Cancels Executive Trading Plan",
            "Summary": "DCM Shriram Limited announces cancellation of trading plan by ED & Group CFO Amit Agarwal due to unpublished price sensitive information, approved by Audit Committee on January 20, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768913685402,
            "Source": "stocks"
        },
        {
            "Title": "DCM Shriram Q3FY26 Results: Revenue Up 13%, Dividend ₹3.60",
            "Summary": "DCM Shriram reported consolidated revenue of ₹4,003.27 crores in Q3FY26, up 13.76% YoY. Net profit declined to ₹212.64 crores due to ₹55 crore exceptional charge for new labour codes. Board declared second interim dividend of ₹3.60 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1768912895052,
            "Source": "co_actions_results"
        },
        {
            "Title": "DCM Shriram Declares ₹3.60 Dividend Per Share",
            "Summary": "DCM Shriram has announced a dividend of ₹3.60 per share for its shareholders, reflecting the company's commitment to returning value to investors through regular dividend distributions.",
            "Sentiment": "positive",
            "PublishDate": 1768912648283,
            "Source": "co_actions_results"
        },
        {
            "Title": "DCM Shriram Q3FY26 Earnings Call on Jan 23, 2026",
            "Summary": "DCM Shriram Limited announces Q3 FY26 earnings conference call scheduled for January 23, 2026 at 4:00 PM IST. Senior management including Chairman Ajay S. Shriram to participate in analyst call.",
            "Sentiment": "neutral",
            "PublishDate": 1768471438060,
            "Source": "co_actions_results"
        },
        {
            "Title": "DCM Shriram Board Meet on Jan 20 for Q3 Results",
            "Summary": "DCM Shriram Limited has scheduled a board meeting on January 20, 2026, to consider Q3FY26 unaudited financial results and potential second interim dividend declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1768226970948,
            "Source": "co_actions_results"
        },
        {
            "Title": "DCM Shriram Board Meet on Jan 20 for Q3 Results",
            "Summary": "DCM Shriram Limited has scheduled a board meeting for January 20, 2026, to consider Q3FY26 financial results and declare second interim dividend with record date set for January 24, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768225262890,
            "Source": "co_actions_results"
        },
        {
            "Title": "DCM Shriram Faces ₹19.84L GST Demand Order",
            "Summary": "DCM Shriram Limited received a GST demand order of ₹19.84 lakhs with equal penalty from Kota tax authorities for disallowed Input Tax Credit on factory canteen goods and services for FY2018-19 and 2019-20.",
            "Sentiment": "negative",
            "PublishDate": 1766577995155,
            "Source": "stocks"
        },
        {
            "Title": "DCM Shriram Gets ₹85.80 Lakh GST Demand Order",
            "Summary": "DCM Shriram Limited received GST demand order of ₹85.80 lakhs plus interest and penalty from CGST Kota for disallowed Input Tax Credit on cargo handling services related to coal purchases for FY2018-19 to FY2022-23.",
            "Sentiment": "negative",
            "PublishDate": 1766490910107,
            "Source": "stocks"
        },
        {
            "Title": "DCM Shriram subsidiary Bioseed Research USA liquidated",
            "Summary": "DCM Shriram Limited announced the liquidation of its wholly-owned step-down subsidiary Bioseed Research USA Inc. effective December 15, 2025, with net worth of USD 3,271.",
            "Sentiment": "neutral",
            "PublishDate": 1766139115728,
            "Source": "co_actions_results"
        },
        {
            "Title": "DCM Shriram Partners with Bayer for Sustainable Agriculture",
            "Summary": "DCM Shriram and Bayer CropScience Ltd have signed a strategic MoU to advance sustainable and future-ready agriculture practices through collaborative initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1765411962628,
            "Source": "stocks"
        },
        {
            "Title": "DCM Shriram and Bayer CropScience Sign MOU for Sustainable Agriculture",
            "Summary": "DCM Shriram has entered into a memorandum of understanding with Bayer CropScience Ltd focusing on sustainable agriculture initiatives. The partnership between the two companies aims to advance sustainable farming practices through their collaborative agreement.",
            "Sentiment": "positive",
            "PublishDate": 1765364971973,
            "Source": "order&deals"
        },
        {
            "Title": "DCM Shriram Reports 74% Jump in Q2 FY26 PBDIT to INR 408 Crore on Strong Chemical Segment Performance",
            "Summary": "DCM Shriram Limited reported net revenues of INR 3,272 crore for Q2 FY26, an 11% increase from INR 2,957 crore in Q2 FY25. PBDIT surged 74% year-on-year to INR 408 crore from INR 235 crore. The chemicals business drove growth with 50% revenue increase led by caustic soda volumes up 22% due to new 850 tons per day capacity utilization. The segment benefited from a INR 76 crore subsidy from Government of Gujarat. The company commissioned a 35,000 tons per annum Epichlorohydrin facility at Bharuch and took full control of Hindustan Speciality Chemicals Limited in August. Board approved acquisition of Saltworks with 2.1 lakh metric tons capacity for approximately INR 175 crore. Shriram Farm Solutions revenue grew 27% year-on-year with PBDIT up 47%. Net debt stood at INR 773 crore as of September 30, 2025. The Board announced an interim dividend of 180% amounting to INR 56.14 crore.",
            "Sentiment": "positive",
            "PublishDate": 1762455289261,
            "Source": "earnings"
        },
        {
            "Title": "DCM Shriram Industries Reports Q2 Loss of 31.2M Rupees, Revenue Drops to 4.99B",
            "Summary": "DCM Shriram Industries posted a consolidated net loss of 31.2 million rupees in Q2, compared to a profit of 229 million rupees in the same period last year. Revenue declined to 4.99 billion rupees from 5.33 billion rupees year-over-year. EBITDA fell significantly to 95 million rupees from 459 million rupees, while EBITDA margin compressed to 1.83% from 8.72% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762346598690,
            "Source": "earnings"
        },
        {
            "Title": "DCM Shriram Receives Rs 249.27 Crore Tax Demand for AY 2022-23",
            "Summary": "DCM Shriram received an Assessment Order for AY 2022-23 dated October 31, 2025, creating a tax demand of Rs 249.27 crore including penal interest. The Assessing Officer assessed total income at Rs 1,596.53 crore against the company's returned income of Rs 1,086.46 crore by making transfer pricing adjustments and other additions. The company claims the Assessing Officer failed to consider MAT credit brought forward, directions given by Dispute Resolution Panel on issues settled by Delhi High Court in the company's case for AY 2014-15, and incorrectly levied interest on the demand. DCM Shriram plans to take appropriate legal action against the assessment order and will file applications to rectify the computed demand and seek stay of demand.",
            "Sentiment": "negative",
            "PublishDate": 1762006130445,
            "Source": "stock"
        },
        {
            "Title": "DCM Shriram Executive Director Dr. Paresh Verma to Retire After 23 Years",
            "Summary": "DCM Shriram announced that Dr. Paresh Verma, Executive Director Research Director for the Bioseed Research Business, will retire from the company effective October 31, 2025. Dr. Verma has led the Bioseed Research Business for over 23 years and will cease to be Senior Management Personnel upon his retirement. The company expressed gratitude for his long association with the organization.",
            "Sentiment": "neutral",
            "PublishDate": 1761898761910,
            "Source": "corporate_governance"
        },
        {
            "Title": "DCM Shriram Considers Demerger of Business Segments for Value Enhancement",
            "Summary": "DCM Shriram is considering a demerger of certain business segments as part of its strategy to enhance shareholder value. The company is evaluating this corporate restructuring option to potentially unlock value across its different business divisions.",
            "Sentiment": "positive",
            "PublishDate": 1761794649818,
            "Source": "corporate_action"
        },
        {
            "Title": "DCM Shriram Expands Into High-Value Chemicals and Targets Growth Across Business Segments Through FY27",
            "Summary": "DCM Shriram is advancing into high-value chemicals through epichlorohydrin and epoxy expansion projects. The company is implementing salt backward integration and making CBG investments. DCM Shriram targets margin recovery in its sugar and ethanol business while aiming for steady growth in agri-input operations through FY27.",
            "Sentiment": "positive",
            "PublishDate": 1761667383822,
            "Source": "stock"
        },
        {
            "Title": "DCM Shriram Reports 151% Jump in Net Profit to ₹158 Crore, Declares ₹3.60 Interim Dividend",
            "Summary": "DCM Shriram Ltd reported a 151% year-on-year increase in consolidated net profit to ₹158 crore for the quarter ended September 30, 2025, compared to ₹63 crore in the same period last year. Revenue from operations grew 10.6% to ₹3,271 crore from ₹2,957 crore. EBITDA surged 70.8% to ₹308 crore from ₹180.7 crore, with operating margins improving to 9.4% from 6.1%. The Board declared an interim dividend of 180% or ₹3.60 per equity share for financial year 2025-26, with record date set for November 3, 2025. The company's shares closed at ₹1,305.60, up 2.19% on BSE.",
            "Sentiment": "positive",
            "PublishDate": 1761664593039,
            "Source": "earnings"
        },
        {
            "Title": "DCM Shriram Acquires Four Salt Companies for Rs 175 Crores",
            "Summary": "DCM Shriram's Board approved the acquisition of 100% equity in four industrial salt companies - Shree Raj Salt and Chemical Works, Devjagan Salt Farm, Maruti Salt Farm, and Manek Salt Works. The Rs 175 crore cash deal includes salt works with 1,077 acres of salt lease land in Gujarat. The acquisition aims to facilitate backward integration of DCM Shriram's chemical business into salt production. The four target companies generated combined turnover of Rs 35.49 crores in FY 2024-25, though all reported losses. The transaction is expected to complete by June 2026, subject to regulatory approvals including transfer of salt lease and manufacturing licenses.",
            "Sentiment": "positive",
            "PublishDate": 1761659745470,
            "Source": "order&deals"
        },
        {
            "Title": "DCM Shriram Reports Strong Q2 Performance, Declares ₹3.60 Dividend Per Share",
            "Summary": "DCM Shriram declared a dividend of ₹3.60 per share. The company reported Q2 EBITDA of ₹3.1 billion compared to ₹1.8 billion year-over-year, with EBITDA margin improving to 9% from 5.78%. Consolidated net profit increased to ₹1.6 billion from ₹629 million year-over-year. Revenue grew to ₹34.3 billion from ₹31.3 billion year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1761658671271,
            "Source": "corporate_action"
        },
        {
            "Title": "DCM Shriram Schedules Board Meeting for Q2 FY2026 Results and Interim Dividend Consideration",
            "Summary": "DCM Shriram Limited has scheduled a Board of Directors meeting on October 28, 2025, to consider unaudited financial results for the quarter and half year ended September 30, 2025, and potential interim dividend payment for FY 2025-26. The company has set November 3, 2025, as the record date for interim dividend eligibility if approved by the board. The trading window for the company's equity shares closed from October 1, 2025, and will remain closed until 48 hours after the financial results declaration, up to October 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760701944747,
            "Source": "corporate_action"
        },
        {
            "Title": "DCM Shriram Commissions 35,000 TPA Epichlorohydrin Plant in Gujarat",
            "Summary": "DCM Shriram Limited commissioned a 35,000 TPA Epichlorohydrin (ECH) plant at its chemical complex in Jhagadia, Bharuch District, Gujarat. The plant uses glycerine, a by-product of bio-diesel production, as raw material instead of propylene used by most other plants globally. The facility utilizes European technology and serves as a link between the company's chlor-alkali business and advanced materials vertical, with ECH being a chlorine-downstream product and key raw material for liquid epoxy resins. An additional 17,000 TPA capacity will be commissioned shortly.",
            "Sentiment": "positive",
            "PublishDate": 1760442872228,
            "Source": "stock"
        },
        {
            "Title": "DCM Shriram and Aarti Industries Form Long-Term Chlorine Supply Partnership",
            "Summary": "DCM Shriram and Aarti Industries have announced a long-term strategic partnership for chlorine supply. The agreement establishes a supply relationship between the two companies, though specific terms, duration, and financial details of the partnership were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1756812180707,
            "Source": "order&deals"
        },
        {
            "Title": "NCLT Schedules Hearing for DCM Shriram's Multi-Company Arrangement Scheme",
            "Summary": "The National Company Law Tribunal (NCLT) New Delhi has scheduled a physical hearing for September 23, 2025, regarding a Composite Scheme of Arrangement involving four entities: LCPL, DCMSR, DSFCL, and DSIL. The hearing will address the proposed corporate restructuring arrangement between these companies.",
            "Sentiment": "neutral",
            "PublishDate": 1755858905633,
            "Source": "corporate_action"
        },
        {
            "Title": "DCM Shriram Shareholders Approve Key Leadership and Auditor Appointments at 36th AGM",
            "Summary": "DCM Shriram Limited shareholders approved three key resolutions at their 36th Annual General Meeting held on August 12, 2025. The company secured approval for the re-appointment of Mr. Ajit S. Shriram as Joint Managing Director for a five-year term starting May 2, 2026, replacing his expiring tenure. Shareholders also approved the continuation of Justice Vikramajit Sen as Non-Executive Independent Director beyond age 75, with his directorship continuing from January 1, 2026 until his current tenure expires on August 8, 2026. Additionally, M/s. RMG & Associates was appointed as Secretarial Auditors for five consecutive years from the conclusion of the 36th AGM until the 41st AGM in 2030. Mr. Ajit S. Shriram, who has 34 years of experience and serves on multiple company committees, is the brother of the company's Chairman & Senior Managing Director and Vice Chairman & Managing Director.",
            "Sentiment": "positive",
            "PublishDate": 1755013003744,
            "Source": "corporate_governance"
        },
        {
            "Title": "DCM Shriram Industries Reports 29% Decline in Quarterly EBITDA",
            "Summary": "DCM Shriram Industries reported quarterly EBITDA of 436 million rupees, down from 617 million rupees in the same period last year. The company's EBITDA margin decreased to 8.8% from 11.14% year-over-year, reflecting reduced profitability compared to the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754990658393,
            "Source": "earnings"
        },
        {
            "Title": "DCM Shriram Reports 13% Revenue Growth in Q1 FY26, Driven by Chemicals Business Expansion",
            "Summary": "DCM Shriram Limited reported net revenues of Rs. 3,262 crore for Q1 FY26, up 13% from Rs. 2,876 crore in the previous year. PBDIT increased 19% to Rs. 326 crore from Rs. 274 crore. The chemicals business led growth with 43% revenue increase, driven by caustic soda volumes up 20% from the new 850 tons per day facility operational since May 2024. PBDIT in chemicals rose 68% due to lower input prices and efficiencies from the 120-megawatt power plant. The company acquired Hindustan Specialty Chemicals Limited to enter the epoxy resin segment and commissioned a compressed biogas plant operating at 90% capacity utilization. Shriram Farm Solutions grew 29% year-on-year with better volumes across verticals. However, sugar and ethanol business revenue declined 14% with PBDIT turning negative at Rs. 7 crore due to a Rs. 36 crore provision for UP government's retrospective export duty on ethanol. The company maintains revenue guidance of 10-15% growth for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1753776408125,
            "Source": "earnings"
        },
        {
            "Title": "DCM Shriram Uploads Q1 FY26 Earnings Call Audio Recording",
            "Summary": "DCM Shriram Limited has made available the audio recording of its analysts and investors call discussing unaudited financial results for Q1 FY26 on its website. The call covered both standalone and consolidated financial results for the quarter ended June 30, 2025, and was held on July 23, 2025. The company has provided a direct link to access the audio recording on their website.",
            "Sentiment": "neutral",
            "PublishDate": 1753277187185,
            "Source": "stock"
        },
        {
            "Title": "DCM Shriram Focuses on Growth Strategy Through Multiple Business Initiatives",
            "Summary": "DCM Shriram has outlined its growth strategy centered on four key areas: margin expansion, development of new products, import substitution opportunities, and transitioning to green energy solutions. The company is positioning these initiatives as drivers for future business growth.",
            "Sentiment": "positive",
            "PublishDate": 1753110076127,
            "Source": "stock"
        },
        {
            "Title": "DCM Shriram Reports Strong Q1 Performance with 21.6% Revenue Growth",
            "Summary": "DCM Shriram delivered robust quarterly results with revenue rising to 34.6 billion rupees from 30.7 billion rupees year-over-year. The company's consolidated net profit increased to 1.13 billion rupees compared to 1 billion rupees in the same period last year. EBITDA grew significantly to 3.04 billion rupees from 2.5 billion rupees, while EBITDA margin improved to 8.80% from 8.04% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1753098871114,
            "Source": "earnings"
        },
        {
            "Title": "DCM Shriram Reports ₹40 Crore Impact from Reinstated Fees on Denatured Alcohol",
            "Summary": "DCM Shriram has reported a ₹40 crore impact on its business due to the reinstatement of import and export fees on denatured alcohol. This change follows a ruling by the Supreme Court. The company has disclosed this information, indicating a significant financial effect from the regulatory decision.",
            "Sentiment": "negative",
            "PublishDate": 1752243811000,
            "Source": "default"
        },
        {
            "Title": "DCM Shriram Approved to Sell Bulk Fermented Organic Manure to Farmers",
            "Summary": "The government has granted approval to DCM Shriram to directly sell bulk fermented organic manure to farmers for a period of three years. This decision allows the company to expand its agricultural product offerings and potentially support sustainable farming practices.",
            "Sentiment": "positive",
            "PublishDate": 1752030797000,
            "Source": "default"
        },
        {
            "Title": "DCM Shriram to Acquire Hindusthan Speciality Chemicals for 3.75 Billion Rupees",
            "Summary": "DCM Shriram has announced plans to acquire Hindusthan Speciality Chemicals for 3.75 billion rupees. This acquisition represents an expansion into advanced materials for DCM Shriram. The move is likely aimed at diversifying the company's portfolio and entering new market segments.",
            "Sentiment": "positive",
            "PublishDate": 1749774454000,
            "Source": "default"
        },
        {
            "Title": "DCM Shriram to Acquire Hindusthan Speciality Chemicals for ₹3.75 Billion",
            "Summary": "DCM Shriram has announced plans to purchase Hindusthan Speciality Chemicals for ₹3.75 billion. This acquisition marks DCM Shriram's expansion into the advanced materials sector. The move is seen as a strategic step for the company to diversify its portfolio and enter a new market segment.",
            "Sentiment": "positive",
            "PublishDate": 1749740737000,
            "Source": "default"
        },
        {
            "Title": "DCM Shriram Industries Reports Q4 EBITDA Decline",
            "Summary": "DCM Shriram Industries has reported its quarterly results. The company's Q4 EBITDA decreased to 483 million rupees from 691 million rupees in the same period last year. The EBITDA margin also declined to 10.24% from 13.5% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748510272000,
            "Source": "result"
        },
        {
            "Title": "DCM Shriram: Q4 Profit Surges 52% YoY to Rs 179 Crore",
            "Summary": "DCM Shriram reported a 51.9% YoY increase in Q4 FY25 consolidated net profit to Rs 178.9 crore. Revenue rose 19.9% to Rs 2,876.7 crore, while EBITDA grew 52.8% to Rs 405.3 crore. EBITDA margin improved to 14.1% from 11.1%. The board recommended a final dividend of Rs 3.40 per share for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1746502711000,
            "Source": "earnings"
        },
        {
            "Title": "DCM Shriram Reports Q4 FY23 Results and Declares Dividend",
            "Summary": "DCM Shriram announced its Q4 FY23 consolidated net profit of 1.8 billion rupees, up from 1.18 billion rupees year-over-year. The company's Q4 revenue increased to 30.2 billion rupees from 25.31 billion rupees in the previous year. Additionally, DCM Shriram recommended a final dividend of 3.4 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746490172000,
            "Source": "default"
        },
        {
            "Title": "DCM Shriram: Q4 Profit Surges 52%, Dividend Declared",
            "Summary": "DCM Shriram's Q4 FY25 consolidated net profit rose 51.9% YoY to ₹178.9 crore. Revenue increased 19.9% to ₹2,876.7 crore. EBITDA grew 52.8% to ₹405.3 crore, with margin expanding to 14.1%. The company declared a final dividend of ₹3.40 per share for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1746454570000,
            "Source": "earnings"
        },
        {
            "Title": "DCM Shriram Reports Q4 Results and Dividend Announcement",
            "Summary": "DCM Shriram has announced its Q4 financial results, showing significant improvement in EBITDA and EBITDA margin compared to the previous year. The company's EBITDA increased from 2.65 billion rupees to 4.1 billion rupees year-over-year, while the EBITDA margin improved from 10.48% to 13.45%. Additionally, the company has recommended a final dividend of 3.4 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746453372000,
            "Source": "result"
        },
        {
            "Title": "DCM Shriram Reports Strong Q4 Financial Results",
            "Summary": "DCM Shriram has announced its Q4 consolidated net profit of 1.8 billion rupees, showing a significant increase from 1.18 billion rupees year-over-year. The company's Q4 revenue also rose to 30.2 billion rupees from 25.31 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1746453174000,
            "Source": "result"
        },
        {
            "Title": "DCM Shriram to Acquire 53% Stake in DNV Global",
            "Summary": "DCM Shriram has announced plans to acquire a 53% stake in DNV Global for ₹44 crore. This strategic move aims to strengthen the company's Fenesta division through backward integration in hardware production.",
            "Sentiment": "positive",
            "PublishDate": 1746412024000,
            "Source": "default"
        },
        {
            "Title": "DCM Shriram Ltd to Consider Q4 Results on May 5",
            "Summary": "DCM Shriram Ltd has announced that it will consider its fourth quarter (Q4) financial results on May 5. This indicates that the company is preparing to release its earnings report for the last quarter of its fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1745932309000,
            "Source": "default"
        },
        {
            "Title": "DCM Shriram: Largest Single Location Caustic Soda Flakes Plant Launched in Gujarat",
            "Summary": "DCM Shriram Ltd. commissioned a new 300 tonnes per day caustic soda flakes plant at its Jhagadia complex in Gujarat, increasing the total capacity to 900 tonnes per day. The flexi-fuel plant allows for multiple fuel choices, enhancing sustainability and efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1743425109000,
            "Source": "corporate_action"
        },
        {
            "Title": "DCM Shriram Commissions 12TPD Compressed Biogas Plant",
            "Summary": "DCM Shriram has announced the commissioning of a 12 tonnes per day (TPD) compressed biogas capacity plant at its Ajbapur unit. The company has invested 1.31 billion rupees in this new facility.",
            "Sentiment": "positive",
            "PublishDate": 1743082592000,
            "Source": "corporate_action"
        },
        {
            "Title": "DCM Shriram: CFO Anticipates Chemicals Recovery to Boost Q4 Earnings",
            "Summary": "DCM Shriram's Chief Financial Officer expects improved fourth quarter earnings due to a recovery in the chemicals sector.",
            "Sentiment": "positive",
            "PublishDate": 1737376086000,
            "Source": "earnings"
        },
        {
            "Title": "DCM Shriram Reports Q3 Financial Results",
            "Summary": "DCM Shriram has announced its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 5.37 billion rupees, up from 4.8 billion rupees in the same quarter of the previous year. However, the EBITDA margin slightly decreased to 15.26% from 15.30% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1737338453000,
            "Source": "earnings"
        },
        {
            "Title": "DCM Shriram Reports Increase in Q3 Net Profit and Revenue",
            "Summary": "DCM Shriram has announced its financial results for the third quarter. The company's consolidated net profit increased to 2.6 billion rupees, up from 2.42 billion rupees in the same period last year. Revenue also saw growth, rising to 35.18 billion rupees from 31.37 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1737338440000,
            "Source": "earnings"
        },
        {
            "Title": "DCM Shriram Ltd: Board Meeting to Consider Second Interim Dividend",
            "Summary": "DCM Shriram Ltd. has scheduled a Board meeting for January 18, 2025, to consider a second interim dividend for FY 2024-25, review Q3 financial results, and discuss private placement of non-convertible debentures. If approved, the dividend record date is set for January 24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1736775561000,
            "Source": "corporate_action"
        },
        {
            "Title": "DCM Shriram to Consider Q3 Results on January 18",
            "Summary": "DCM Shriram Limited has announced that it will consider its financial results for the third quarter of the fiscal year on January 18. This indicates that the company is preparing to disclose its performance for the latest quarter to shareholders and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1736516368000,
            "Source": "result"
        }
    ]
}