{
    "Symbol": "DCMSRIND",
    "ISIN": "INE843D01027",
    "News": [
        {
            "Title": "DCM Shriram Issues Cost Allocation Guidance Post-Demerger",
            "Summary": "DCM Shriram Industries provides shareholders guidance on apportioning acquisition costs following composite scheme completion, with specific allocation percentages for three entities.",
            "Sentiment": "neutral",
            "PublishDate": 1770133949704,
            "Source": "co_actions_results"
        },
        {
            "Title": "DCM Shriram Seeks Shareholder Approval for Board Changes",
            "Summary": "DCM Shriram Industries initiates postal ballot for appointing two independent directors and two executive directors, with e-voting from January 26 to February 24, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768986567361,
            "Source": "stocks"
        },
        {
            "Title": "DCM Shriram Industries Announces Demerger Record Date and Share Allotment Details",
            "Summary": "DCM Shriram Industries has set December 19, 2025 as the record date for its composite scheme of arrangement, where shareholders will receive one share each in DCM Shriram Fine Chemicals Limited and DCM Shriram International Limited for every share held. The demerger separates the chemical and rayon businesses into new entities while DCM Shriram continues with its sugar, power and alcohol business as a listed entity.",
            "Sentiment": "positive",
            "PublishDate": 1765364947434,
            "Source": "corporate_governance"
        },
        {
            "Title": "NCLT Approves Composite Arrangement Scheme for DCM Shriram Industries",
            "Summary": "The National Company Law Tribunal has approved a composite arrangement scheme involving DCM Shriram Industries and other companies, with the official order now received. This corporate restructuring approval affects DCM Shriram Industries and associated entities in the arrangement.",
            "Sentiment": "positive",
            "PublishDate": 1764934886538,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLT Approves Composite Scheme of Arrangement for DCM Shriram Industries and Associated Companies",
            "Summary": "The National Company Law Tribunal, New Delhi Bench, pronounced its order approving the composite scheme of arrangement involving Lily Commercial Private Limited, DCM Shriram Industries Limited, DCM Shriram Fine Chemicals Limited, and DCM Shriram International Limited. The scheme will become effective once the certified copy of the order is filed with the Registrar of Companies for National Capital Territory of Delhi Haryana.",
            "Sentiment": "positive",
            "PublishDate": 1763723411174,
            "Source": "corporate_action"
        },
        {
            "Title": "DCM Shriram Industries Reports Quarterly Results with Auditor Qualifications on Accounting Practices",
            "Summary": "DCM Shriram Industries Limited announced its quarterly results for the quarter and half-year ended September 30, 2025. The company's auditors issued qualified review reports for both standalone and consolidated results, highlighting two key issues: the company's discontinuation of deferring off-season sugar expenses (previously Rs. 3,200 lakhs were deferred in September 2024) and the non-recognition of an estimated impairment loss of Rs. 663 lakhs on investment in a subsidiary that surrendered its leasehold land. The Board of Directors approved these results in a meeting held on November 5, 2025. A subsidiary filed an application to surrender its leasehold land, resulting in reclassification as asset held for sale with an impairment loss of Rs. 533 lakhs in consolidated results. The company has a pending Composite Scheme of Arrangement for amalgamation and demerger of chemical and rayon businesses, which received stock exchange approvals and is awaiting NCLT approval after hearings concluded on September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762346535917,
            "Source": "earnings"
        },
        {
            "Title": "DCM Shriram Industries Receives NGT Directives on Wastewater Discharge; No Penalties Imposed",
            "Summary": "The National Green Tribunal's Central Zone Bench in Bhopal issued directives to Shriram Rayons, a unit of DCM Shriram Industries, regarding wastewater discharge into the Chambal River in Kota. The order was passed on October 16, 2025, in response to an application filed by Babu Lal Jajoo alleging violations in wastewater discharge. The tribunal found no specific violations against Shriram Rayons and noted that the unit operates with valid consents, discharges treated wastewater within permitted limits, and meets environmental standards most of the time according to RSPCB monitoring reports. The order focuses on city-wide environmental compliance and municipal sewage treatment infrastructure improvements. No penalties, fines, closure directions, or operational restrictions were imposed on the company. The company stated there is no material adverse financial or operational impact from this order and confirmed it will comply with the directives.",
            "Sentiment": "neutral",
            "PublishDate": 1760692562323,
            "Source": "stock"
        },
        {
            "Title": "NCLT Reserves Order on DCM Shriram's Composite Scheme of Arrangement",
            "Summary": "The NCLT New Delhi Bench has reserved its order on the Composite Scheme of Arrangement involving Lily Commercial Private Limited, DCM Shriram Industries Limited, DCM Shriram Fine Chemicals Limited, and DCM Shriram International Limited following a hearing held on September 30, 2025. The scheme is being processed under Section 230 to 232 of the Companies Act, 2013. The company will file a copy of the order with the stock exchanges once received.",
            "Sentiment": "neutral",
            "PublishDate": 1759233838911,
            "Source": "corporate_action"
        },
        {
            "Title": "DCM Shriram Industries Reports Quarterly Financial Results with Revenue of Rs 49,859 Lakhs",
            "Summary": "DCM Shriram Industries Limited submitted unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs 49,859 lakhs and net profit of Rs 1,779 lakhs. On a consolidated basis, revenue was Rs 49,859 lakhs with net profit of Rs 1,647 lakhs. Basic and diluted earnings per share stood at Rs 2.05 for standalone and Rs 1.94 for consolidated results. The company discontinued its practice of deferring off-season expenditure in interim reporting to align with industry practice. The Board approved a Composite Scheme of Arrangement for amalgamation and demerger of certain businesses, which is pending regulatory approvals. The results were reviewed by the Audit Committee and approved by the Board of Directors on August 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754991151756,
            "Source": "earnings"
        },
        {
            "Title": "DCM Shriram Industries Faces Rs 8.81 Crore Impact from Reinstated Denatured Alcohol Import/Export Fees",
            "Summary": "The Excise Commissioner of Uttar Pradesh has reinstated import/export fees on denatured alcohol, revoking a 2018 order that had suspended these fees. This action follows a Supreme Court order dated October 23, 2024, which upheld the state's authority to levy such fees. DCM Shriram Industries disclosed that the reinstatement creates a financial impact of Rs 8.81 crore on the company. The order was received at the company's Daurala distillery on July 15, 2025, with reporting delayed as the distillery examined the order's legality and potential for challenging its retrospective application. The company has requested the government to reconsider the levy. The Allahabad High Court (Lucknow Bench) issued an interim stay on July 30, 2025, on the UP Government's order following a writ petition by UP Sugar Mills Association. The next hearing is scheduled for August 28, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1754907776557,
            "Source": "stock"
        },
        {
            "Title": "DCM Shriram Industries Reports Q4 Financial Results",
            "Summary": "DCM Shriram Industries has released its quarterly financial results. The company's revenue for Q4 was 4.6 billion rupees, compared to 5 billion rupees in the same quarter last year. The consolidated net profit for Q4 was 237 million rupees, down from 386 million rupees in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748510110000,
            "Source": "result"
        },
        {
            "Title": "DCM Shriram Industries Reports Q3 Revenue Growth",
            "Summary": "DCM Shriram Industries has announced its third-quarter revenue, which stands at 4.9 billion rupees. This represents an increase from the previous year's figure of 4.6 billion rupees, indicating year-over-year growth for the company.",
            "Sentiment": "positive",
            "PublishDate": 1739350197000,
            "Source": "earnings"
        },
        {
            "Title": "DCM Shriram Industries Reports Q3 Consolidated Net Profit of 235 Million Rupees",
            "Summary": "DCM Shriram Industries has announced its financial results for the third quarter. The company reported a consolidated net profit of 235 million rupees, which is a decrease from 291 million rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1739350141000,
            "Source": "earnings"
        },
        {
            "Title": "DCM Shriram Industries Receives NCLT Approval for Demerger Scheme",
            "Summary": "DCM Shriram Industries has received approval from the National Company Law Tribunal (NCLT) for its scheme of arrangement involving the demerger of company units. The company has scheduled a shareholders meeting on January 27, 2025, to seek approval for the demerger scheme.",
            "Sentiment": "neutral",
            "PublishDate": 1733762826000,
            "Source": "corporate_action"
        },
        {
            "Title": "DCM Shriram Industries Reports Q2 Profit Increase",
            "Summary": "DCM Shriram Industries has reported a consolidated net profit of 229 million rupees for the second quarter, up from 206 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730967086000,
            "Source": "result"
        }
    ]
}