{
    "Symbol": "DCW",
    "ISIN": "INE500A01029",
    "News": [
        {
            "Title": "DCW Limited Reports Q3 FY26 Financial Results",
            "Summary": "DCW Limited published unaudited financial results for Q3 FY26 and nine months ended December 31, 2025, showing total income from operations of ₹51,981.38 lakhs for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1770792423546,
            "Source": "co_actions_results"
        },
        {
            "Title": "DCW Limited Board Meet on Feb 10 for Q3FY26 Results",
            "Summary": "DCW Limited has scheduled a board meeting for February 10, 2026, to consider Q3FY26 unaudited financial results and interim dividend proposal for equity shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1770134263142,
            "Source": "co_actions_results"
        },
        {
            "Title": "DCW Limited Gets NCLT Approval for Amalgamation Scheme",
            "Summary": "DCW Limited receives NCLT Ahmedabad approval for amalgamation of two transferor companies with appointed date July 1, 2024, streamlining promoter shareholding structure.",
            "Sentiment": "positive",
            "PublishDate": 1769173294348,
            "Source": "co_actions_results"
        },
        {
            "Title": "DCW Limited Receives ₹98 Lakh Penalty Notice for Delayed Mining Returns Filing",
            "Summary": "DCW Limited received a notice from the Department of Geology and Mining, Thoothukudi District, demanding ₹65.50 lakh for delayed filing of monthly Ilmenite Ore returns and ₹32.50 lakh penalty for delays spanning April 2022 to March 2023. The company plans to contest the matter and states there is no material impact on its financial, operational or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1763711326216,
            "Source": "stock"
        },
        {
            "Title": "DCW Limited's Amalgamation Scheme Approved by Secured and Unsecured Creditors",
            "Summary": "DCW Limited received unanimous approval from both secured creditors (7 creditors with ₹4,65,33,98,409) and unsecured creditors (195 creditors with ₹4,28,61,02,282) for its amalgamation scheme with Dhrangadhara Trading Company Private Limited and Sahu Brothers Private Limited through e-voting conducted on November 15, 2025. The scheme, which requires final sanction from the National Company Law Tribunal Ahmedabad Bench, will consolidate the three entities with DCW Limited as the transferee company.",
            "Sentiment": "neutral",
            "PublishDate": 1763221154939,
            "Source": "corporate_action"
        },
        {
            "Title": "DCW Limited Reports 51% EBITDA Growth in Q2 FY26 Despite Price Pressures",
            "Summary": "DCW Limited reported quarterly revenue of Rs. 539 crores, up 10.3% year-on-year, with EBITDA growing 51% to Rs. 62.6 crores. The company achieved its highest-ever CPVC sales volume after completing capacity expansion from 20,000 to 40,000 tonnes ahead of schedule. However, CPVC prices declined 15% during the quarter due to import competition. The specialty chemicals segment delivered EBITDA growth despite price erosion, while basic chemicals EBITDA turned positive at Rs. 14 crores from a loss of Rs. 9 crores in the previous year. Profit after tax reached Rs. 13.8 crores compared to a loss of Rs. 1.2 crores in Q2 FY25. The company reduced gross debt by Rs. 61 crores to Rs. 365 crores and expects net debt to EBITDA ratio to reach 0.4x by year-end. Management highlighted benefits from renewable power integration and expects stronger performance in the second half, with plans for additional CPVC capacity expansion to 50,000 tonnes.",
            "Sentiment": "positive",
            "PublishDate": 1762895328315,
            "Source": "earnings"
        },
        {
            "Title": "DCW Reports Strong Q2 Performance with Revenue Growth and Return to Profitability",
            "Summary": "DCW delivered improved financial results in Q2 with revenue increasing to 5.4 billion rupees from 4.9 billion rupees year-over-year. The company returned to profitability with a net profit of 138 million rupees compared to a loss of 12 million rupees in the same period last year. EBITDA grew significantly to 580 million rupees from 354 million rupees year-over-year, while EBITDA margin expanded to 10.76% from 7.25%.",
            "Sentiment": "positive",
            "PublishDate": 1762245656919,
            "Source": "earnings"
        },
        {
            "Title": "DCW Limited Schedules Earnings Conference Call for Q2/H1-FY26 Results",
            "Summary": "DCW Limited has announced an earnings conference call scheduled for November 5, 2025, at 4:00 PM IST to discuss the company's unaudited financial results for Q2/H1-FY26. The call will be attended by key management including President Saatvik Jain, CEO Amitabhbh Gupta, COO Sudarshan Ganapathy, and CFO Pradiptio Mukherjee. The company has provided dial-in details for investors and analysts, with access numbers for multiple countries including the US, UK, Singapore, and Hong Kong. The schedule is subject to potential changes due to exigencies.",
            "Sentiment": "neutral",
            "PublishDate": 1761845184315,
            "Source": "earnings"
        },
        {
            "Title": "DCW Limited Schedules Shareholder and Creditor Meetings for Amalgamation Scheme Approval",
            "Summary": "DCW Limited has scheduled meetings of equity shareholders, secured creditors, and unsecured creditors on November 15, 2025, to consider a proposed Scheme of Amalgamation. The scheme involves the amalgamation of Dhrangadhara Trading Company Private Limited and Sahu Brothers Private Limited with DCW Limited. The meetings are being held following directions from the National Company Law Tribunal, Ahmedabad Bench, dated September 26, 2025. The Board of Directors approved the scheme on February 13, 2025, subject to requisite majority approval from shareholders and creditors, and sanction from NCLT. The equity shareholders meeting is scheduled at 12:00 PM, secured creditors at 2:30 PM, and unsecured creditors at 3:30 PM, all conducted through video conferencing. Remote e-voting will be available from November 12-14, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760378998258,
            "Source": "corporate_action"
        },
        {
            "Title": "DCW Limited Receives Favorable VAT Appeal Order, Tax and Penalty Demands Significantly Reduced",
            "Summary": "DCW Limited received an appeal order from the Appellate Deputy Commissioner, Tirunelveli on August 22, 2025, regarding VAT assessments for years 2010-11 to 2013-14. The order substantially reduced the company's tax liability from Rs. 1.82 crores to Rs. 14.65 lakhs and penalty demands from Rs. 2.01 crores to Rs. 7.33 lakhs across the four assessment years. The company will pay the accepted liability of Rs. 14.65 lakhs in tax and Rs. 7.33 lakhs in penalty, which has been provided for in the books. DCW is contacting the Commercial Tax Officer to adjust these amounts against pre-deposits made and obtain refunds for the balance amount.",
            "Sentiment": "positive",
            "PublishDate": 1756125508416,
            "Source": "stock"
        },
        {
            "Title": "DCW Limited Reports 70% Jump in PAT Despite Revenue Decline in Q1 FY26",
            "Summary": "DCW Limited reported revenue of INR 475 crores in Q1 FY26, down 4.8% year-on-year from INR 499 crores, primarily due to lower PVC sales volumes as the company diverted production for internal C-PVC manufacturing. Despite the revenue decline, PAT surged 70% to INR 11.4 crores from INR 6.7 crores, driven by improved profitability in Basic Chemicals and disciplined cost control. EBITDA increased 12% to INR 58 crores, with margins improving to 11.3% from 9% in the previous year. Finance costs dropped to their lowest level in 32 quarters at INR 15 crores. The company commissioned a 20,000-ton C-PVC expansion ahead of schedule and a 44.5 MW solar project, which provided approximately INR 4.5-5 crores in power cost savings. Management expects to achieve net debt-to-EBITDA ratio of less than 0.5x by end of FY26 and highlighted that Specialty Chemicals now contribute a significant share of earnings.",
            "Sentiment": "positive",
            "PublishDate": 1755174922054,
            "Source": "earnings"
        },
        {
            "Title": "DCW Reports Mixed Q1 Results with Higher Profit Despite Revenue Decline",
            "Summary": "DCW reported Q1 net profit of 114 million rupees, up from 67 million rupees in the same period last year. However, revenue declined to 4.75 billion rupees from 5 billion rupees year-over-year. The company's EBITDA improved to 537 million rupees compared to 425 million rupees previously, while EBITDA margin expanded to 11.30% from 9.04% in the prior year period.",
            "Sentiment": "neutral",
            "PublishDate": 1754872064642,
            "Source": "earnings"
        },
        {
            "Title": "DCW Plans Growth Through Specialty Chemicals Expansion and Capacity Doubling",
            "Summary": "DCW has outlined growth plans focused on expanding its specialty chemicals business and doubling its C-PVC capacity to 50,000 tonnes per annum. The company also plans to increase SIOP output and implement solar power to reduce operational costs. DCW aims to achieve higher margins through valuable products, export growth, and improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1754667773702,
            "Source": "stock"
        },
        {
            "Title": "DCW Limited Reports Q1 FY26 Results; Approves Key Management Appointments",
            "Summary": "DCW Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs. 47,549.79 lakhs compared to Rs. 49,952.42 lakhs in the same quarter last year. Net profit stood at Rs. 1,138.94 lakhs versus Rs. 672.80 lakhs in the previous year quarter. Earnings per share was Rs. 0.39. The Board also approved the appointment of M/s. Mehta & Mehta as Secretarial Auditors for five years from FY 2025-26 to FY 2029-30. Additionally, the Board approved re-appointment of Mr. Vivek Shashichand Jain as Managing Director for three years from March 01, 2026, and Mr. Bakul Premchand Jain as Managing Director for three years from July 27, 2026, both subject to shareholder approval. The company faces several ongoing legal matters including electricity tax demand of Rs. 5,491.45 lakhs, customs duty demand of Rs. 3,164.60 lakhs, and income tax demand of Rs. 669.29 lakhs, for which no provisions have been made.",
            "Sentiment": "positive",
            "PublishDate": 1754662275600,
            "Source": "earnings"
        },
        {
            "Title": "DCW Reports Mixed Q1 Results with Higher Profitability Despite Revenue Decline",
            "Summary": "DCW reported quarterly results showing EBITDA of 537 million rupees compared to 425 million rupees in the same period last year. The company's EBITDA margin improved to 11.30% from 9.04% year-over-year. Net profit increased to 114 million rupees from 67 million rupees in the previous year. However, revenue declined to 4.75 billion rupees from 5 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1754660629265,
            "Source": "earnings"
        },
        {
            "Title": "DCW Limited Completes First Phase of CPVC Capacity Expansion, Doubles Production to 40,000 MT",
            "Summary": "DCW Limited has successfully commissioned the first milestone of its CPVC capacity expansion project, increasing capacity by 20,000 MT to a total of 40,000 MT. The expansion was completed ahead of schedule, with production ramp-up and financial benefits expected immediately. The project was originally scheduled for completion by September 30, 2025, but was commissioned earlier. The company expects commercial benefits from increased volumes to reflect in financials from the current quarter. An additional 10,000 MT expansion remains on track as previously communicated. The existing 20,000 MT capacity was operating at 100% utilization before this expansion.",
            "Sentiment": "positive",
            "PublishDate": 1753188981879,
            "Source": "stock"
        },
        {
            "Title": "DCW Reports Mixed Q4 Results",
            "Summary": "DCW Limited has reported its Q4 financial results. Revenue decreased to 5.4 billion rupees from 6.2 billion rupees year-over-year. EBITDA also declined to 559 million rupees from 634 million rupees. However, the EBITDA margin improved slightly to 10.38% from 10.2% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747041330000,
            "Source": "result"
        },
        {
            "Title": "DCW Reports Decline in Q4 Net Profit",
            "Summary": "DCW Limited has reported a net profit of 114 million rupees for the fourth quarter, down from 153 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1747041265000,
            "Source": "result"
        },
        {
            "Title": "DCW to Consider Q4 Results on May 12",
            "Summary": "DCW Limited has announced that it will consider its fourth quarter (Q4) financial results on May 12. This is a standard corporate procedure where the company's board will review and potentially approve the financial statements for the last quarter of their fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1746627271000,
            "Source": "default"
        },
        {
            "Title": "DCW Reports Significant Increase in Q3 EBITDA and Margin",
            "Summary": "DCW Limited has reported a substantial year-over-year improvement in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased from 194 million rupees to 570 million rupees. Additionally, DCW's EBITDA margin expanded from 4.88% to 12.02%, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1739437615000,
            "Source": "earnings"
        },
        {
            "Title": "DCW Reports 18% Increase in Q3 Revenue",
            "Summary": "DCW Limited has announced its financial results for the third quarter. The company's revenue increased to 4.7 billion rupees, up from 3.98 billion rupees in the same period last year, representing an 18% year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1739437560000,
            "Source": "earnings"
        },
        {
            "Title": "DCW Reports Profit in Q3 FY2024, Reversing Previous Year's Loss",
            "Summary": "DCW Limited has announced a net profit of 134 million rupees for the third quarter, compared to a loss of 123 million rupees in the same period last year. This represents a significant turnaround in the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1739437497000,
            "Source": "earnings"
        },
        {
            "Title": "DCW Reports Decline in Q2 EBITDA and Margin",
            "Summary": "DCW Limited has reported a decrease in its Q2 EBITDA to 354 million rupees, down from 415 million rupees in the same quarter last year. The company's Q2 EBITDA margin also declined to 7.25% from 10.04% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731487773000,
            "Source": "result"
        },
        {
            "Title": "DCW Reports 18% Revenue Growth in Q2",
            "Summary": "DCW Limited has reported a revenue of 4.9 billion rupees for the second quarter, compared to 4.15 billion rupees in the same period last year, representing an 18% year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731487710000,
            "Source": "result"
        },
        {
            "Title": "DCW Reports Q2 Net Loss of 12 Million Rupees",
            "Summary": "DCW, a company, has reported a net loss of 12 million rupees in the second quarter, compared to a profit of 27 million rupees in the same period last year. This represents a significant year-over-year decline in financial performance.",
            "Sentiment": "negative",
            "PublishDate": 1731487688000,
            "Source": "result"
        },
        {
            "Title": "DCW Expands CPVC Production Capacity",
            "Summary": "DCW Limited is investing in the expansion of its CPVC (Chlorinated Polyvinyl Chloride) production capacity. The company's CPVC division will increase its capacity by 30,000 metric tonnes. The investment required for this expansion is estimated to be up to 1.4 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1729157097000,
            "Source": "corporate_action"
        }
    ]
}