{
    "Symbol": "DCXINDIA",
    "ISIN": "INE0KL801015",
    "News": [
        {
            "Title": "DCX Systems Board Meet on Feb 12 for Q3FY26 Results",
            "Summary": "DCX Systems Limited has scheduled a board meeting on February 12, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770385374087,
            "Source": "co_actions_results"
        },
        {
            "Title": "DCX Systems Wins ₹11.33 Cr Order from Rafael Israel",
            "Summary": "DCX Systems Limited secured a purchase order worth ₹11.33 crores from Rafael Advanced Defence Systems Limited, Israel for manufacturing cable and wire harness assemblies in January 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767619423373,
            "Source": "co_actions_results"
        },
        {
            "Title": "DCX Systems Secures ₹113.3 Million in New Orders",
            "Summary": "DCX Systems Limited has announced securing new orders worth ₹113.3 million, marking a significant business development for the aerospace and defence company.",
            "Sentiment": "positive",
            "PublishDate": 1767619074719,
            "Source": "co_actions_results"
        },
        {
            "Title": "DCX Systems Secures Orders Worth ₹57.67 Crores",
            "Summary": "DCX Systems Limited receives purchase orders totaling ₹57.67 crores for cable and wire harness assemblies, with major order from Rafael Advanced Defence Systems Limited, Israel worth ₹52.42 crores.",
            "Sentiment": "positive",
            "PublishDate": 1767202684732,
            "Source": "co_actions_results"
        },
        {
            "Title": "DCX Systems' Material Subsidiary Raneal Advanced Systems Faces Statutory Auditor Resignation",
            "Summary": "Rajagopala and Co resigned as statutory auditors of DCX Systems' material subsidiary Raneal Advanced Systems Private Limited effective May 12, 2025, citing internal realignment of audit assignments within the group to maintain independence and avoid overlapping professional engagements. DCX Systems disclosed this resignation with a delay, acknowledging an inadvertent oversight in not submitting the intimation to stock exchanges within the prescribed timeline.",
            "Sentiment": "neutral",
            "PublishDate": 1764931438918,
            "Source": "corporate_governance"
        },
        {
            "Title": "DCX Systems Secures Purchase Orders Worth INR 16.45 Crores for Cable and Wire Harness Manufacturing",
            "Summary": "DCX Systems Limited received purchase orders worth INR 16.45 crores from international customers for manufacturing and supplying cable and wire harness assemblies. The company's wholly owned subsidiary Raneal Advanced Systems also secured orders worth INR 6.44 crores for printed circuit board assemblies from international customers.",
            "Sentiment": "positive",
            "PublishDate": 1763380902810,
            "Source": "stock"
        },
        {
            "Title": "DCX Systems Outlines Multi-Year Growth Strategy Through Defence Exports and Manufacturing Expansion",
            "Summary": "DCX Systems has outlined a multi-year growth strategy focused on defence exports and electronics manufacturing, supported by a robust order book from offset programs. The company is expanding its aerospace and cable assembly capabilities while targeting higher margins through backward integration and strategic partnerships with global OEMs.",
            "Sentiment": "positive",
            "PublishDate": 1763052070903,
            "Source": "stock"
        },
        {
            "Title": "DCX Systems Submits Monitoring Agency Reports for IPO and QIP Proceeds Utilization",
            "Summary": "DCX Systems Limited submitted monitoring agency reports from CARE Ratings for the quarter ended September 30, 2025, covering utilization of proceeds from its Rs. 400 crore IPO and Rs. 500 crore QIP. For the IPO, the company has fully utilized Rs. 289.8 crore across debt repayment (Rs. 110 crore), working capital (Rs. 160 crore), and subsidiary investment (Rs. 19.8 crore). The remaining Rs. 62.49 crore earmarked for general corporate purposes remains unutilized, with the company obtaining board approval to reallocate Rs. 65.99 crore towards working capital and capital expenditures. For the QIP, Rs. 209.72 crore has been utilized for subsidiary investment in NIART Systems, while Rs. 276.93 crore remains unutilized. The company signed a joint venture agreement with ELTAS Systems Limited for Rs. 200 crore investment, though establishment is pending regulatory approvals. Unutilized funds from both offerings are deployed in fixed deposits earning 6.65% to 7.75% returns.",
            "Sentiment": "neutral",
            "PublishDate": 1762967242890,
            "Source": "stock"
        },
        {
            "Title": "DCX Systems Reports 29% Decline in Q2 Net Profit to 72 Million Rupees",
            "Summary": "DCX Systems reported a net profit of 72 million rupees for Q2, down from 102 million rupees in the same quarter last year, representing a 29% year-over-year decline. The company's revenue for the quarter was 1.9 billion rupees compared to 1.95 billion rupees in the previous year, showing a marginal decrease of 2.6%.",
            "Sentiment": "negative",
            "PublishDate": 1762957159031,
            "Source": "earnings"
        },
        {
            "Title": "DCX Systems Secures Purchase Orders Worth INR 49.89 Crores",
            "Summary": "DCX Systems has received purchase orders valued at approximately INR 49.89 crores. The orders represent new business for the company.",
            "Sentiment": "positive",
            "PublishDate": 1759155690212,
            "Source": "stock"
        },
        {
            "Title": "DCX Systems Signs MOU with Tamil Nadu Government for Defense Manufacturing Facility in Hosur",
            "Summary": "DCX Systems Limited signed a non-binding Memorandum of Understanding with the Government of Tamil Nadu at the 'T N Rising Investment Conclave' held on September 11, 2025 in Hosur. The MOU establishes a manufacturing facility for a joint venture company in Hosur, Tamil Nadu, focusing on producing Airborne Maritime Radar Systems, Fire Control Radar Systems, and other Radar Systems for Airborne and Land applications under 'Make in India' projects. This follows DCX Systems' prior joint venture agreement with ELTA Systems Ltd, Israel dated April 21, 2025. The Tamil Nadu government's nodal agency 'Guidance' will provide infrastructural support and regulatory facilitation to help obtain necessary permissions, registrations, approvals, and incentives. The facility will be located in one of India's Defence Industrial Corridors under the Tamil Nadu Industrial Policy 2021 and Tamil Nadu Aerospace and Defence Industrial Policy 2022.",
            "Sentiment": "positive",
            "PublishDate": 1757671016258,
            "Source": "stock"
        },
        {
            "Title": "DCX India Announces CFO Resignation and New Director Appointment",
            "Summary": "DCX India announced significant leadership changes during its board meeting on August 18, 2025. Mr. Diwakaraiah N J resigned from his dual roles as Executive Director and Chief Financial Officer, with his resignation taking effect on August 31, 2025. He had submitted his resignation letter on July 31, 2025. The company will appoint a new CFO in due course. Simultaneously, the board approved the appointment of Mr. Gopinath Vedaprakash as Additional Whole-Time Director, effective September 1, 2025, subject to shareholder approval. Mr. Vedaprakash brings 37 years of experience in electronics industries serving Defence, Aerospace, Space, Industrial and Transportation sectors. He previously worked at Tata Advanced Systems Limited for over 5 years and had a 23-year tenure at Centum Electronics in various leadership positions. The appointment was recommended by the Nomination & Remuneration Committee and requires shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1755525386150,
            "Source": "corporate_governance"
        },
        {
            "Title": "DCX Systems Reports Strong Q1 Performance with Revenue Jump to 2.2B Rupees",
            "Summary": "DCX Systems delivered strong quarterly results with revenue rising to 2.2 billion rupees from 1.38 billion rupees year-over-year. The company's net profit increased significantly to 111 million rupees compared to 45 million rupees in the same period last year. EBITDA performance showed marked improvement, recording a gain of 11 million rupees versus a loss of 31 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754571476237,
            "Source": "earnings"
        },
        {
            "Title": "DCX Systems Receives 43.6 Million Rupee Order",
            "Summary": "DCX Systems has received an order valued at 43.6 million rupees. No further details about the order or the client were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1750862640000,
            "Source": "default"
        },
        {
            "Title": "DCX Systems Secures ₹286 Million Purchase Order",
            "Summary": "DCX Systems has received a purchase order valued at ₹286 million. The news briefly mentions the company securing this order but provides no further details about the nature of the order, the client, or the timeframe for delivery.",
            "Sentiment": "positive",
            "PublishDate": 1750166251000,
            "Source": "default"
        },
        {
            "Title": "DCX Systems Announces Agreement with BEL and Joint Venture with ELTA Systems",
            "Summary": "DCX Systems has entered into an agreement with Bharat Electronics (BEL) to supply electronic modules. Under this agreement, DCX Systems will receive a back-to-back order if BEL secures a contract. Additionally, DCX Systems is forming a joint venture with ELTA Systems Israel, which is expected to require Rs 150-200 crore in capital expenditure. The company aims to finalize and begin operations for this joint venture within 11 months.",
            "Sentiment": "positive",
            "PublishDate": 1748489284000,
            "Source": "default"
        },
        {
            "Title": "DCX Systems Outlines Growth Plans and Order Book Expectations",
            "Summary": "DCX Systems has provided updates on its business outlook during a conference call. The company expects to deliver its current order book over the next 2 years, targeting execution of orders worth Rs 500 crore in this period. DCX aims to transition into a product company, anticipating higher margins of 30-40% in the aerospace and defense industry. The company projects receiving orders for 1,750 units in other countries over the next 3 years. Additionally, DCX Systems expects to deploy its product on 5,000 to 6,000 locomotives in India over the next 5 years.",
            "Sentiment": "positive",
            "PublishDate": 1748489238000,
            "Source": "default"
        },
        {
            "Title": "DCX Systems Ltd: Q4 Earnings Miss Triggers 7% Stock Drop",
            "Summary": "DCX Systems reported a 26.3% fall in Q4 revenue to ₹549.96 crore and a 37.2% decline in net profit to ₹20.7 crore. Full-year revenue dropped 24% to ₹1,083.7 crore, missing company guidance. The order book stands at ₹2,855 crore as of March 31, 2025, up 3.5x from the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748404931000,
            "Source": "earnings"
        },
        {
            "Title": "DCX Systems Reports Q4 Financial Results",
            "Summary": "DCX Systems has released its Q4 financial results. The company's EBITDA for Q4 was 42 million rupees, down from 302 million rupees year-over-year. The EBITDA margin decreased to 0.85% from 4.05% in the same period last year. Net profit for Q4 was 93 million rupees, compared to 259 million rupees year-over-year and 117 million rupees quarter-over-quarter. Revenue for Q4 stood at 4.95 billion rupees, down from 7.46 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1748352112000,
            "Source": "result"
        },
        {
            "Title": "DCX Systems: Defence Stock Surges on New Export Orders",
            "Summary": "DCX Systems' shares jumped 4.12% to a two-month high after securing export orders worth ₹28.60 crore from Israeli defense majors and other overseas clients. The orders are for CIWS antennas and cable & wire harness assemblies. This follows a recent joint venture with Elta Systems for radar system development.",
            "Sentiment": "positive",
            "PublishDate": 1747111848000,
            "Source": "order&deals"
        },
        {
            "Title": "DCX Systems Secures Export Orders Worth ₹28.6 Crore",
            "Summary": "DCX Systems has received export orders valued at ₹28.6 crore from Israeli defense majors and other overseas clients. This development indicates the company's growing presence in the international defense market and its ability to secure contracts from prominent global players.",
            "Sentiment": "positive",
            "PublishDate": 1747103899000,
            "Source": "default"
        },
        {
            "Title": "DCX Systems Forms Joint Venture with ELTA Systems for Land and Radar Systems",
            "Summary": "DCX Systems has executed a joint venture agreement with ELTA Systems. The collaboration will focus on developing and producing land and radar systems.",
            "Sentiment": "positive",
            "PublishDate": 1745226048000,
            "Source": "default"
        },
        {
            "Title": "DCX Systems Secures Order Worth 47.9 Million Rupees",
            "Summary": "DCX Systems, a company in the defense and aerospace sector, has received a new order valued at 47.9 million rupees. This order represents a positive development for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1740615506000,
            "Source": "order&deals"
        },
        {
            "Title": "DCX Systems Secures 47.9 Million Rupee Order",
            "Summary": "DCX Systems has received a new order valued at 47.9 million rupees. This development indicates potential business growth and increased revenue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1740494733000,
            "Source": "order&deals"
        },
        {
            "Title": "DCX Systems Expands Operations and Secures New Orders",
            "Summary": "DCX Systems has established an additional unit under the Domestic Tariff Area in Bengaluru, India. The company has also received purchase orders totaling 245.1 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1739838557000,
            "Source": "corporate_action"
        },
        {
            "Title": "DCX Systems Secures Purchase Orders Worth 245.1 Million Rupees",
            "Summary": "DCX Systems has received purchase orders valued at 245.1 million rupees. This development indicates new business opportunities and potential revenue growth for the company.",
            "Sentiment": "positive",
            "PublishDate": 1739802828000,
            "Source": "order&deals"
        },
        {
            "Title": "DCX Systems Establishes New Unit in Bengaluru's Domestic Tariff Area",
            "Summary": "DCX Systems has set up an additional manufacturing unit within the Domestic Tariff Area in Bengaluru. This expansion suggests the company is increasing its production capacity or diversifying its operations within India's domestic market.",
            "Sentiment": "positive",
            "PublishDate": 1739798183000,
            "Source": "corporate_action"
        },
        {
            "Title": "DCX Systems Reports Significant Decline in Q3 EBITDA",
            "Summary": "DCX Systems has reported a substantial decrease in its Q3 EBITDA, which fell to 32 million rupees from 109 million rupees in the same quarter last year. The company's EBITDA margin also declined sharply, dropping to 1.13% from 5.51% year-over-year. This significant reduction in both EBITDA and EBITDA margin indicates a challenging quarter for the company's operational performance.",
            "Sentiment": "negative",
            "PublishDate": 1738850878000,
            "Source": "earnings"
        },
        {
            "Title": "DCX Systems Reports Q3 Financial Results",
            "Summary": "DCX Systems has announced its financial results for the third quarter. The company reported a net profit of 116 million rupees, slightly down from 119 million rupees in the same period last year. However, revenue showed significant growth, reaching 2.8 billion rupees compared to 1.98 billion rupees in the previous year, representing a year-over-year increase of approximately 41%.",
            "Sentiment": "positive",
            "PublishDate": 1738850873000,
            "Source": "earnings"
        },
        {
            "Title": "DCX Systems Secures $56.5 Million Export Order from Elta Systems",
            "Summary": "DCX Systems has received an export purchase order valued at $56.5 million from Elta Systems. This significant order demonstrates the company's ability to secure large international contracts and potentially indicates growth in their export business.",
            "Sentiment": "positive",
            "PublishDate": 1736122227000,
            "Source": "order&deals"
        },
        {
            "Title": "DCX Systems Secures $56.5 Million Export Order from ELTA Systems",
            "Summary": "DCX Systems has received an export purchase order valued at $56.5 million from ELTA Systems. This significant order demonstrates the company's ability to secure large international contracts and potentially boost its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1735904667000,
            "Source": "order&deals"
        },
        {
            "Title": "DCX Systems Secures Order Worth 193.3 Million Rupees",
            "Summary": "DCX Systems, a company in the defense and aerospace sector, has received a new order valued at 193.3 million rupees (approximately $2.3 million USD). This order represents a significant business development for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1735776615000,
            "Source": "order&deals"
        },
        {
            "Title": "DCX Systems Secures Order Worth 193.3 Million Rupees",
            "Summary": "DCX Systems has received a new order valued at 193.3 million rupees. This development indicates potential business growth and increased revenue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1735731870000,
            "Source": "order&deals"
        },
        {
            "Title": "DCX Systems in Talks for Additional Orders",
            "Summary": "DCX Systems is reportedly in discussions with various clients, both in domestic and international markets, to secure additional orders. This information was shared on CNBC TV18.",
            "Sentiment": "positive",
            "PublishDate": 1734596279000,
            "Source": "order&deals"
        },
        {
            "Title": "DCX Systems Secures New Orders from International Customers",
            "Summary": "DCX Systems has obtained new orders from prominent international clients, including ELTA Systems Limited (Israel), Lockheed Martin (USA), and an unnamed overseas customer. The company anticipates delivering these orders in the third and fourth quarters, with approximately 50% of the orders expected to be fulfilled within a 12-month timeframe.",
            "Sentiment": "positive",
            "PublishDate": 1731554453000,
            "Source": "normal_news"
        },
        {
            "Title": "DCX Systems Provides Business Update and Outlook",
            "Summary": "DCX Systems anticipates NIART (likely a new project or facility) to commence operations in 2026, which is expected to enhance visibility and contribute to revenue or EBITDA growth. The company currently has a substantial backlog of approximately INR 3000 crore, including recent large orders worth INR 1000 crore and INR 2500 crore. However, clearing this backlog will take time due to various requirements such as export licenses, clearances, and test setup procedures.",
            "Sentiment": "positive",
            "PublishDate": 1731554238000,
            "Source": "normal_news"
        },
        {
            "Title": "DCX Systems Reports Q2 Financial Results",
            "Summary": "DCX Systems has announced its Q2 financial results. The company's net profit for the quarter stood at 102 million rupees, down from 204 million rupees year-over-year and up from 45 million rupees quarter-over-quarter. Revenue for Q2 was reported at 1.95 billion rupees, a decrease from 3.1 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1731455834000,
            "Source": "result"
        },
        {
            "Title": "DCX Systems: Secures $54.8 Million Export Order from Lockheed Martin",
            "Summary": "DCX Systems has received a $54.8 million (₹460.3 crore) export order from Lockheed Martin Global Inc, USA. The contract involves supplying electronic assemblies and will be executed within 12 months. Additionally, DCX Systems' subsidiary recently obtained an industrial license for producing defense-related equipment.",
            "Sentiment": "positive",
            "PublishDate": 1731070016000,
            "Source": "normal_news"
        },
        {
            "Title": "DCX Systems Secures 4.6 Billion Rupee Order from Lockheed Martin",
            "Summary": "DCX Systems has received orders worth 4.6 billion rupees (approximately $55.3 million USD) from Lockheed Martin Global Inc., USA. The order is for the supply of electronic assemblies, indicating a significant business deal for DCX Systems in the defense and aerospace sector.",
            "Sentiment": "positive",
            "PublishDate": 1731066980000,
            "Source": "corporate_action"
        },
        {
            "Title": "DCX Systems Secures $1.23 Million in International Orders",
            "Summary": "DCX Systems has received orders totaling $1.23 million (approximately INR 10.31 crores) from overseas customers. This development indicates the company's success in securing international business and expanding its global presence.",
            "Sentiment": "positive",
            "PublishDate": 1730207655000,
            "Source": "corporate_action"
        },
        {
            "Title": "DCX Systems Subsidiary Secures Major Contract",
            "Summary": "A subsidiary of DCX Systems has been awarded a significant order valued at 379.67 crore rupees (approximately $45.5 million USD). This development indicates a substantial business opportunity for the company and potentially positive financial implications.",
            "Sentiment": "positive",
            "PublishDate": 1730116113000,
            "Source": "corporate_action"
        }
    ]
}