{
    "Symbol": "DDEVPLSTIK",
    "ISIN": "INE0HR601026",
    "News": [
        {
            "Title": "Ddev Plastiks Reports Strong Q3 & 9MFY26 Results",
            "Summary": "Ddev Plastiks delivered robust 9MFY26 performance with revenue of ₹2,182 crore (17% YoY growth), EBITDA of ₹234 crore (13% YoY growth), and PAT of ₹147 crore (11% YoY growth). Exports surged 33% YoY to ₹523 crore.",
            "Sentiment": "positive",
            "PublishDate": 1770716440685,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ddev Plastiks declares Rs 0.50 interim dividend",
            "Summary": "Ddev Plastiks Industries announces interim dividend of Rs 0.50 per share with record date February 20, 2026, representing 50% payout on face value of Re 1 per share.",
            "Sentiment": "positive",
            "PublishDate": 1770712674182,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bbigplas Poly Acquires Additional Stake in Ddev Plastiks",
            "Summary": "Bbigplas Poly Private Limited completes inter-se transfer of 849602 equity shares in Ddev Plastiks Industries Limited, increasing its shareholding from 74.17% to 74.99% at Rs. 380 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1770373932340,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ddev Plastiks schedules Q3FY26 earnings call",
            "Summary": "Ddev Plastiks Industries Limited announces earnings conference call for February 10, 2026 at 4:00 PM IST to discuss Q3FY26 financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768996332844,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ddev Plastiks Enters Battery Storage Business",
            "Summary": "Ddev Plastiks Industries announces entry into Battery Energy Storage System (BESS) business with ₹150-200 crores Phase 1 investment for 5 GWh manufacturing facility by FY 2026-27.",
            "Sentiment": "positive",
            "PublishDate": 1767615347828,
            "Source": "stocks"
        },
        {
            "Title": "Ddev Plastiks Appoints New CEO for Renewable Energy",
            "Summary": "Ddev Plastiks Industries announces key senior management appointments including Rakesh Kumar Tiwari as CEO-Renewable Energy and designation changes for existing personnel.",
            "Sentiment": "positive",
            "PublishDate": 1765545606130,
            "Source": "stocks"
        },
        {
            "Title": "Ddev Plastiks Industries Announces Capacity Expansion with 30,000 MTPA Addition",
            "Summary": "Ddev Plastiks Industries announced a capacity addition of 30,000 MTPA (metric tonnes per annum) with an investment of 5 million rupees. The expansion will increase the company's production capabilities and represents a significant capital investment in manufacturing infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1763679129403,
            "Source": "stock"
        },
        {
            "Title": "Ddev Plastiks Reports Q2FY26 Results with 17% Revenue Growth Despite Volume Challenges",
            "Summary": "Ddev Plastiks Industries achieved 17% year-on-year revenue growth to INR 680 crores in Q2FY26 with 11% EBITDA margin, though volumes declined 7% quarter-on-quarter due to extended monsoon and US tariff impacts. The company maintains FY26 guidance of INR 2,850-2,950 crores revenue and 210,000-220,000 tons volume target, with strong demand expected in H2 as monsoon effects subside.",
            "Sentiment": "positive",
            "PublishDate": 1763465655139,
            "Source": "earnings"
        },
        {
            "Title": "Ddev Plastiks Approves Investor Presentation for Earnings Call",
            "Summary": "Ddev Plastiks Industries' Board approved an investor presentation for their earnings call scheduled on November 17, 2025. The presentation covers quarterly results for Q2FY26 and H1FY26, highlighting the company's performance as India's largest polymer compound manufacturer with revenue of Rs. 75 crores and EBITDA of Rs. 47 crores for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1763116419555,
            "Source": "earnings"
        },
        {
            "Title": "Ddev Plastiks Industries Schedules Q2FY26 Earnings Call for November 17",
            "Summary": "Ddev Plastiks Industries Limited has announced it will host an earnings conference call on November 17, 2025 at 11:00 AM IST following the announcement of its financial results for the second quarter and half year ended September 30, 2025. The call will be led by key executives including Chairman and Managing Director Narrindra Surana, Whole Time Director and CEO Ddev Surana, Whole Time Director Rajesh Kothari, and Chief Financial Officer Arihant Bothra. The company will make audio/video recording and transcript of the call available subsequently. The call details will be uploaded on the company's website at www.ddevgroup.in.",
            "Sentiment": "neutral",
            "PublishDate": 1761652554909,
            "Source": "earnings"
        },
        {
            "Title": "Ddev Plastiks Industries Declares Final Dividend of Rs. 1.75 Per Share for FY2025",
            "Summary": "Ddev Plastiks Industries Limited announced a final dividend of Rs. 1.75 per equity share for the financial year ended March 31, 2025. The dividend represents a 175% payout on shares with a face value of Re. 1 each. Members approved the dividend declaration at the company's 5th Annual General Meeting held on September 22, 2025. The dividend will be paid by October 21, 2025, to shareholders on record as of September 15, 2025. Payment will be made electronically for members who have opted for this mode, while others will receive warrants or cheques. Tax will be deducted at source as per statutory requirements.",
            "Sentiment": "positive",
            "PublishDate": 1758553771818,
            "Source": "corporate_action"
        },
        {
            "Title": "DDev Plastiks Targets Rs 5,000 Crore Revenue By FY30 Driven By Cable Industry Growth",
            "Summary": "DDev Plastiks Industries aims to achieve revenue of Rs 4,500-5,000 crore by 2030 from its compounded business, driven by growth in the cable industry and renewable energy demand. The company expects to become debt-free by the last quarter of 2025. The cable industry is projected to grow at 15% CAGR, nearly double the country's GDP growth rate. DDev Plastiks has deployed Rs 110 crore in capital expenditure this year and plans additional investment of Rs 300-400 crore by 2027 to enhance technological capabilities and expand globally. The company is focusing on high-margin Halogen-Free Flame Retardant (HFFR) compounds, which currently represent 2% of revenue but offer 10-15% margins. The company has developed products previously imported and manufactures certain compounds exclusively worldwide through its in-house R&D. Shares closed 0.6% higher at Rs 350 on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1758007615553,
            "Source": "stock"
        },
        {
            "Title": "Ddev Plastiks Reports 23% Revenue Growth in Q1FY26, Plans Major Capacity Expansion",
            "Summary": "Ddev Plastiks Industries reported quarterly revenue of INR769 crores, marking 23% year-on-year growth driven by 13% volume growth and 9% increase in average selling price to INR148 per kg. EBITDA stood at INR79 crores with 10% margin, while PAT reached INR52 crores with 7% margin. Production volumes grew 11% to 52,000 tons with capacity utilization at 87%. The company added 5,000 metric tons capacity in the Eastern region, bringing total installed capacity to 2,38,400 metric tons per annum. Management announced plans to invest INR300 crores over the next three years to add 130,000 tons capacity across PVC, XLPE, and Halogen Free Flame Retardant compounds. The company targets revenue of INR4,500-5,000 crores by FY30 with EBITDA margins of 10-12%. Export revenue grew 3% to INR154 crores despite geopolitical challenges. The company expects 132 kV certification by end of FY26 and commercial operations by FY27.",
            "Sentiment": "positive",
            "PublishDate": 1755171289842,
            "Source": "earnings"
        },
        {
            "Title": "DDEV Plastiks Plans Capacity Expansion and EV Focus for Growth",
            "Summary": "DDEV Plastiks is pursuing growth through capacity expansion to meet increased automotive and industrial demand. The company is emphasizing electric vehicle parts production and lightweight innovations as key strategic areas. The company maintains low debt levels, which it expects will support sustainable profit margins and market share growth.",
            "Sentiment": "positive",
            "PublishDate": 1754923092196,
            "Source": "stock"
        },
        {
            "Title": "DDEV Plastiks Industries Reports Strong Q1 Growth with 23% Jump in Net Profit",
            "Summary": "DDEV Plastiks Industries delivered robust quarterly performance with net profit rising to 522 million rupees from 425 million rupees year-over-year, marking a 23% increase. Revenue grew significantly to 7.7 billion rupees compared to 6.25 billion rupees in the same period last year, representing a 23% growth. The company's EBITDA increased to 729 million rupees from 584 million rupees year-over-year, while EBITDA margin improved slightly to 9.48% from 9.34% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754914227472,
            "Source": "earnings"
        },
        {
            "Title": "Ddev Plastiks Industries Schedules Q1FY26 Earnings Conference Call for August 12",
            "Summary": "Ddev Plastiks Industries Limited has scheduled an earnings conference call for August 12, 2025, at 11:00 AM IST to discuss financial results for the quarter ended June 30, 2025. The call will be hosted by Go India Advisors and will feature key company executives including Chairman & Managing Director Narrindra Suranna, Whole Time Director and CEO Ddev Surana, Whole-Time Director Rajesh Kothari, and Chief Financial Officer Arihant Bothra. Call details are available on the company's website at www.ddevgroup.in, with audio/video recording and transcript to be made available later. The company trades on BSE with scrip code 543547 and on NSE with symbol DDEVPLSTIK.",
            "Sentiment": "neutral",
            "PublishDate": 1753782747584,
            "Source": "earnings"
        },
        {
            "Title": "Ddev Plastiks Industries Conducts Investor Meetings with Envision Capital and LIC Mutual Fund",
            "Summary": "Ddev Plastiks Industries Limited conducted analyst and investor meetings with representatives from Envision Capital and LIC Mutual Fund on July 24, 2025. The meetings were held physically at 2:00 PM and 3:30 PM respectively. The company has made the presentation materials used in these meetings available on their website at www.ddevgroup.in. The company confirmed that no unpublished price sensitive information was shared with the analysts or investors during these meetings.",
            "Sentiment": "neutral",
            "PublishDate": 1753362207508,
            "Source": "stock"
        },
        {
            "Title": "Ddev Plastiks Industries Reports Strong FY25 Performance with Revenue of Rs 2,603 Crore",
            "Summary": "Ddev Plastiks Industries Limited reported revenue of Rs 2,603 crore for FY25, representing 7% year-on-year growth. The company achieved EBITDA of Rs 287 crore with an 11% margin and PAT of Rs 185 crore with 7% margin. The polymer compounds manufacturer recorded its highest-ever quarterly volume of 51,000 MT in Q4FY25, contributing to annual volume of 190,000 MT with 14% growth. The company operates with installed capacity of 233,400 MTPA at 81% utilization and maintains strong financial metrics including ROE of 22%, ROCE of 32%, and zero net debt to equity ratio. Ddev Plastiks listed on NSE in January 2025 and received CRISIL rating upgrade to A+/Stable for long-term and A1+ for short-term. The company incurred Rs 55 crore capex in FY25 with planned outlay of Rs 110 crore for FY26, targeting Rs 5,000 crore revenue by FY2030.",
            "Sentiment": "positive",
            "PublishDate": 1753275688687,
            "Source": "stock"
        },
        {
            "Title": "Ddev Plastiks Reports 7% Revenue Growth to Rs 2,603 Cr in FY25, Targets Rs 5,000 Cr by FY30",
            "Summary": "Ddev Plastiks Industries Limited reported revenue of Rs 2,603 crore for FY25, marking a 7% year-on-year growth. The company achieved EBITDA of Rs 287 crore with an 11% margin and PAT of Rs 185 crore with 7% margin. The polymer compounds manufacturer recorded its highest quarterly volume of 51,000 MT in Q4FY25, contributing to annual volume of 190,000 MT (14% growth). The company operates with installed capacity of 233,400 MTPA at 81% utilization across five manufacturing units. Key financial metrics include ROE of 22%, ROCE of 32%, and net debt-to-equity ratio of 0.0x. The company listed on NSE in January 2025 and received CRISIL rating upgrade to A+/Stable. Management outlined expansion plans including Rs 110 crore capex for FY26 and targets revenue of Rs 5,000 crore by FY30. The company serves 400+ customers across 50+ countries, with major clients including Apar, Havells, KEC, KEI, Paramount and Polycab contributing 22% of total revenue.",
            "Sentiment": "positive",
            "PublishDate": 1753188431235,
            "Source": "earnings"
        },
        {
            "Title": "DDEV Plastiks Industries Reports Q4 Financial Results",
            "Summary": "DDEV Plastiks Industries has released its Q4 financial results. The company's EBITDA for Q4 was 765 million rupees, compared to 838.3 million rupees in the same quarter last year. The EBITDA margin decreased from 14.04% to 10.38% year-over-year. Net profit for Q4 was 517 million rupees, down from 615.3 million rupees year-over-year, but up from 466 million rupees quarter-over-quarter. Revenue for Q4 increased to 7.4 billion rupees from 5.97 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747320210000,
            "Source": "result"
        },
        {
            "Title": "DDEV Plastiks Industries Reports Q3 EBITDA Growth",
            "Summary": "DDEV Plastiks Industries has reported its Q3 financial results. The company's EBITDA increased to 704 million rupees, up from 601 million rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 10.65% from 10.86% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739192697000,
            "Source": "earnings"
        },
        {
            "Title": "DDEV Plastiks Industries Reports Q3 Financial Results",
            "Summary": "DDEV Plastiks Industries has announced its financial results for the third quarter. The company's net profit increased to 466 million rupees, up from 400 million rupees year-over-year and 447 million rupees quarter-over-quarter. Revenue for Q3 rose to 6.6 billion rupees, compared to 5.53 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739192607000,
            "Source": "earnings"
        },
        {
            "Title": "DDEV Plastiks Industries Reports Q2 EBITDA Growth",
            "Summary": "DDEV Plastiks Industries has reported its Q2 financial results. The company's EBITDA increased to 637 million rupees, up from 603 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 10.98% from 9.39% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731503393000,
            "Source": "result"
        },
        {
            "Title": "DDEV Plastiks Industries Reports Q2 Financial Results",
            "Summary": "DDEV Plastiks Industries has announced its Q2 financial results. The company reported a net profit of 447 million rupees, showing a year-over-year increase from 423 million rupees and a quarter-over-quarter increase from 425 million rupees. However, the company's revenue for Q2 decreased to 5.8 billion rupees from 6.4 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731503315000,
            "Source": "result"
        }
    ]
}