{
    "Symbol": "DECCANCE",
    "ISIN": "INE583C01021",
    "News": [
        {
            "Title": "Deccan Cements Q3FY26 Loss Widens to ₹55.76 Lakhs",
            "Summary": "Deccan Cements reported a net loss of ₹55.76 lakhs in Q3FY26 vs profit of ₹80.89 lakhs in Q3FY25, despite revenue growth of 13.34% to ₹13,085.02 lakhs. Nine-month profit surged to ₹2,385.88 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1770884489032,
            "Source": "co_actions_results"
        },
        {
            "Title": "Deccan Cements Declares Commercial Production at Line-3",
            "Summary": "Deccan Cements officially declares commercial production at Line-3 cement plant from December 15, 2025, increasing total cement production capacity to 4.00 million tonnes per annum.",
            "Sentiment": "positive",
            "PublishDate": 1765796495963,
            "Source": "stocks"
        },
        {
            "Title": "Fidelity International Increases Stake in Deccan Cements to 7.07%",
            "Summary": "Fidelity International has increased its shareholding in Deccan Cements Limited from 5.035% to 7.07% through open market acquisitions. The investment firm acquired 284,663 shares representing 2.03% of the company between November 22, 2023, and November 11, 2025. Following this acquisition, Fidelity now holds 989,902 shares in Deccan Cements. The company's total equity share capital remains unchanged at 14,007,500 shares. This disclosure was made under SEBI regulations for substantial acquisition of shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763026485953,
            "Source": "corporate_action"
        },
        {
            "Title": "Deccan Cements Reports Strong Q2 Performance with Revenue Growth and Return to Profitability",
            "Summary": "Deccan Cements delivered strong quarterly results with revenue increasing to 1.4 billion rupees from 1.2 billion rupees year-over-year. The company's EBITDA surged to 202 million rupees compared to 22 million rupees in the same period last year, while EBITDA margin expanded significantly to 14.36% from 1.82%. The company returned to profitability with a net profit of 91 million rupees, reversing from a loss of 40 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762847229987,
            "Source": "earnings"
        },
        {
            "Title": "Deccan Cements Board Approves Q1 2025 Results, Sets AGM Date and Appoints Cost Auditors",
            "Summary": "Deccan Cements Limited's Board of Directors approved standalone and consolidated unaudited financial results for the quarter ended June 30, 2025, during their meeting on August 12, 2025. The board set September 16, 2025, as the record date for final dividend payment for FY 2024-25, subject to shareholder approval. The 45th Annual General Meeting was scheduled for September 23, 2025, to be conducted through video conferencing, with the same date fixed as the cut-off for shareholder voting eligibility. Final dividend payment, if approved, will be made on October 13, 2025. The board also appointed M/s Aruna Prasad & Co, Cost Accountants from Chennai, as cost auditors for FY 2025-26. Aruna Prasad brings over 30 years of experience in cost audit and accounting for listed and unlisted companies.",
            "Sentiment": "neutral",
            "PublishDate": 1754987969654,
            "Source": "corporate_action"
        },
        {
            "Title": "Deccan Cements Reports Mixed Q1 Results with Profitability Surge Despite Revenue Decline",
            "Summary": "Deccan Cements reported Q1 revenue of 1.5 billion rupees, down from 1.72 billion rupees in the same period last year. The company's standalone net profit increased significantly to 154 million rupees compared to 28 million rupees year-over-year. EBITDA rose to 279 million rupees from 113 million rupees, while EBITDA margin expanded substantially to 18.52% from 6.58% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754986726663,
            "Source": "earnings"
        },
        {
            "Title": "Deccan Cements Schedules Board Meeting for Q1 FY2025-26 Results and Dividend Record Date",
            "Summary": "Deccan Cements Limited will hold a Board of Directors meeting on August 12, 2025, to consider and approve standalone and consolidated unaudited financial results for the quarter ended June 30, 2025. The board will also determine the record date for the final dividend for FY 2024-25. The company's trading window will remain closed until August 14, 2025, which is 48 hours after the financial results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1754056502218,
            "Source": "corporate_action"
        },
        {
            "Title": "Deccan Cements Reports Decline in Q4 EBITDA and Revenue",
            "Summary": "Deccan Cements has reported its latest quarterly results. The company's Q4 EBITDA decreased to 131 million rupees from 263 million rupees year-over-year. The Q4 EBITDA margin slightly declined to 11.04% from 11.79% year-over-year. Additionally, Q4 revenue fell to 1.2 billion rupees from 2.2 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1748331820000,
            "Source": "result"
        },
        {
            "Title": "Deccan Cements Reports Increased Q4 Net Profit",
            "Summary": "Deccan Cements has reported a net profit of 80 million rupees for the fourth quarter, compared to 30 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1748331739000,
            "Source": "result"
        },
        {
            "Title": "Deccan Gold Mines Begins Work on Nickel, Chromium, and PGE Block in Chhattisgarh",
            "Summary": "Deccan Gold Mines has commenced work on a composite licence for the Bhalukona-Jamnidih block in Chhattisgarh. The block is known for nickel, chromium, and platinum group elements (PGE) deposits. This development marks a significant step in the company's exploration and mining activities in the region.",
            "Sentiment": "positive",
            "PublishDate": 1745480385000,
            "Source": "default"
        },
        {
            "Title": "Deccan Cements Reports Significant Decline in Q3 EBITDA",
            "Summary": "Deccan Cements has reported a substantial decrease in its Q3 EBITDA, which fell to 88 million rupees from 286 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 7.58% from 13.18% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739261940000,
            "Source": "earnings"
        },
        {
            "Title": "Deccan Cements Reports Significant Revenue Decline in Q3",
            "Summary": "Deccan Cements has reported a substantial decrease in revenue for the third quarter. The company's revenue dropped to 1.15 billion rupees, compared to 2.2 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1739261871000,
            "Source": "earnings"
        },
        {
            "Title": "Deccan Cements Reports Significant Decline in Q3 Net Profit",
            "Summary": "Deccan Cements has reported a substantial decrease in its third-quarter net profit. The company's net profit for the quarter stood at 8 million rupees, compared to 154 million rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1739261804000,
            "Source": "earnings"
        },
        {
            "Title": "Deccan Cements Reports Q2 Net Loss",
            "Summary": "Deccan Cements has reported a net loss of 40 million rupees in Q2, compared to a profit of 47 million rupees in the same quarter last year. The company's revenue also decreased to 1.2 billion rupees from 1.7 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731395680000,
            "Source": "result"
        }
    ]
}