{
    "Symbol": "DEEDEV",
    "ISIN": "INE841L01016",
    "News": [
        {
            "Title": "DEE Development Engineers Rectifies Q3FY26 Auditor Report",
            "Summary": "DEE Development Engineers Limited submitted rectified Independent Auditor's Review Report for Q3FY26 unaudited financial results, adding missing UDIN while keeping all financial figures unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1770802731686,
            "Source": "co_actions_results"
        },
        {
            "Title": "DEE Development Engineers Updates Order Book Status",
            "Summary": "DEE Development Engineers Limited has submitted order book updates for January 2026 period to stock exchanges as part of regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1770606401914,
            "Source": "stocks"
        },
        {
            "Title": "DEE Development Engineers Subsidiary Wins ₹90 Crore Order",
            "Summary": "DEE Development Engineers' wholly-owned subsidiary secures major windmill tower order worth approximately ₹90 crores, with execution scheduled from May 2026 to January 2027.",
            "Sentiment": "positive",
            "PublishDate": 1770366056780,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dee Development Engineers Reports Q3 Turnaround",
            "Summary": "Dee Development Engineers achieved a consolidated net profit of ₹182 million in Q3, marking a significant turnaround from the ₹133 million loss recorded in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1770105866610,
            "Source": "co_actions_results"
        },
        {
            "Title": "DEE Development Engineers Q3 FY26 Earnings Call Feb 5",
            "Summary": "DEE Development Engineers Limited announces earnings conference call scheduled for February 05, 2026 at 12:00 PM IST to discuss Q3 & 9M FY26 operational and financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1769702082824,
            "Source": "co_actions_results"
        },
        {
            "Title": "DEE Development Engineers Order Book Hits ₹1,302.73 Cr",
            "Summary": "DEE Development Engineers closed December 2025 with order book of ₹1,302.73 crore after securing fresh orders worth ₹98.11 crore. The piping solutions provider has executed ₹792.92 crore orders in current financial year.",
            "Sentiment": "positive",
            "PublishDate": 1767874025039,
            "Source": "stocks"
        },
        {
            "Title": "DEE Development Engineers Reports December Order Updates",
            "Summary": "DEE Development Engineers Limited disclosed order book updates for December 2025, showing total order inflow of ₹98.11 crores and execution of ₹127.91 crores across its piping, fabrication, and power divisions.",
            "Sentiment": "positive",
            "PublishDate": 1767799356910,
            "Source": "co_actions_results"
        },
        {
            "Title": "DEE Development names Brham Prakash Yadav as new CFO",
            "Summary": "DEE Development Engineers appoints Brham Prakash Yadav as CFO effective January 7, 2026, replacing Sameer Agarwal who resigned. The company reported mixed Q2FY26 results with 39.1% revenue growth but 20.1% profit decline.",
            "Sentiment": "neutral",
            "PublishDate": 1767789062568,
            "Source": "stocks"
        },
        {
            "Title": "DEE Development Engineers Appoints New CFO",
            "Summary": "DEE Development Engineers announces CFO transition with Sameer Agarwal's resignation and Braham Prakash Yadav's appointment effective January 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767712296523,
            "Source": "stocks"
        },
        {
            "Title": "DEE Development Engineers Reports Order Book Updates and Power Tariff Developments",
            "Summary": "DEE Development Engineers Limited provided order book updates for November 2025, showing order inflows of 69.56 crores for piping activities and 24.09 crores for heavy fabrication, with closing orders of 401.45 crores and 42.07 crores respectively. The company received favorable court rulings on power tariff matters, with Punjab High Court staying a tariff revision order, allowing continued electricity supply at Rs. 7.47 per unit while PSERC extended PPA for subsidiary Malwa Power for 10 years.",
            "Sentiment": "positive",
            "PublishDate": 1765166041350,
            "Source": "stock"
        },
        {
            "Title": "DEE Development Engineers Reports 39% Revenue Growth in Q2 with Strong Order Pipeline",
            "Summary": "DEE Development Engineers Limited reported revenue from operations of Rs 2,700 million for Q2, marking 39.2% year-on-year growth. Operating EBITDA grew 47.9% to Rs 441 million with margins expanding to 16.3%. The company maintains a healthy order book of Rs 1,308 crores as of September 30, 2025, and secured Rs 170 crores in new orders from thermal power sector during the quarter. The company successfully commissioned 15,000 metric tons of process piping solutions capacity at its Anjar facility in September 2025, doubling total installed capacity to 30,000 metric tons per annum. A 7,000 metric ton seamless pipe line is expected to commence commercial production by January 2026. For H1, revenue rose 30.3% to Rs 4,938 million and operating EBITDA increased 46.4% to Rs 799 million. Management expects around 500 crores in power sector orders and 100 crores from oil and gas in the remaining fiscal year, with guidance of 40-45% revenue growth and EBITDA margins of 16-18%.",
            "Sentiment": "positive",
            "PublishDate": 1762998750395,
            "Source": "earnings"
        },
        {
            "Title": "DEE Development Engineers Reports Order Book Updates and Power Tariff Developments",
            "Summary": "DEE Development Engineers Limited provided order book updates for October 2025, showing order inflows of ₹351.78 crores for piping systems and ₹27.80 crores for heavy fabrication, with executed orders of ₹328.58 crores and ₹1.16 crores respectively. The company's closing order book stands at ₹141.12 crores for piping systems and ₹46.19 crores for heavy fabrication. In power business developments, Punjab State Electricity Regulatory Commission extended Malwa Power's PPA for 10 years with tariff determination scheduled for November 6, 2025. The Punjab and Haryana High Court stayed PSERC's order that revised DEE's power division tariff to ₹5.877 per unit, allowing the company to continue supplying electricity at the prevailing tariff of ₹27.47 per unit. The company acquired 70% equity shares of Molsieve Designs Limited in June 2025, with its order book now included in consolidated reporting.",
            "Sentiment": "positive",
            "PublishDate": 1762568059419,
            "Source": "stock"
        },
        {
            "Title": "DEE Development Engineers Reports Strong Q2 Performance with 39% Revenue Growth",
            "Summary": "DEE Development Engineers Limited reported operating income of ₹2,700 million for the quarter ended September 30, 2025, reflecting 39.2% year-on-year growth and 20.7% sequential increase. Operating EBITDA rose 47.9% year-on-year to ₹441 million with margins expanding by 96 basis points to 16.3%. PAT stood at ₹179 million with a margin of 6.5%. For H1FY26, revenue from operations grew 30.3% year-on-year to ₹4,938 million. The company commissioned its production capacity of 30,000 MT at its Anjar facility in September 2025. DEE received new orders worth ₹170 crores from thermal power players and maintains an order book of ₹1,308 crores as of September 30, 2025. The company operates seven strategically located manufacturing facilities with cumulative installed capacity of 1,27,500 MT per annum.",
            "Sentiment": "positive",
            "PublishDate": 1762376828368,
            "Source": "earnings"
        },
        {
            "Title": "Dee Development Reports Mixed Q2 Results with Lower Net Profit but Higher EBITDA",
            "Summary": "Dee Development reported consolidated net profit of 179 million rupees in Q2, down from 223 million rupees in the same quarter last year. However, the company's EBITDA increased to 441 million rupees from 298 million rupees year-over-year. EBITDA margin improved to 16.32% compared to 15.36% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762241544054,
            "Source": "earnings"
        },
        {
            "Title": "Dee Development Engineers Secures ₹63.17 Crore New Orders in September 2025",
            "Summary": "Dee Development Engineers Limited secured new orders worth ₹63.17 crore in September 2025, bringing the company's total order book to ₹1,308.09 crore. The company reported a cumulative order inflow of ₹598 crore for FY 2025-26.",
            "Sentiment": "positive",
            "PublishDate": 1759814579588,
            "Source": "order&deals"
        },
        {
            "Title": "DEE Development Engineers Secures High Court Stay on Electricity Tariff Revision Order",
            "Summary": "DEE Development Engineers Limited received a stay order from the Punjab & Haryana High Court on September 23, 2025, halting the implementation of a tariff revision order by the Punjab State Electricity Regulatory Commission (PSERC). The company will continue supplying electricity from its 8 MW Abohar Plant to PSPCL at the existing tariff of ₹7.47 per unit. Any recovery claims by PSPCL related to tariff differential remain suspended pending final court adjudication. The dispute stems from PSERC's order dated August 20, 2025, which revised the tariff to ₹5.672 per unit effective from January 1, 2024, entitling PSPCL to a retrospective recovery of ₹13.62 crores. The company had originally sought an upward tariff revision due to rising operational costs and market conditions under its 30-year power purchase agreement.",
            "Sentiment": "positive",
            "PublishDate": 1758731915193,
            "Source": "stock"
        },
        {
            "Title": "DEE Development Engineers' Subsidiary Wins Key Ruling on 10-Year Power Purchase Agreement Extension",
            "Summary": "DEE Development Engineers Limited's wholly owned subsidiary Malwa Power Private Limited (MPPL) received a favorable regulatory ruling from the Punjab State Electricity Regulatory Commission (PSERC). The commission established that MPPL's Power Purchase Agreement with Punjab State Power Corporation Limited (PSPCL) has been extended for 10 years, following the expiration of the previous agreement on April 27, 2025. PSERC ruled that PSPCL cannot unilaterally fix tariffs and confirmed the commission's authority to determine the tariff for the extended period. The matter is scheduled for hearing on November 6, 2025, to determine the new tariff rate. MPPL currently supplies electricity generated from biomass at ₹3.50 per unit under an interim order, though management expects a more favorable tariff determination based on PSERC's historical practice of considering both variable and fixed costs.",
            "Sentiment": "positive",
            "PublishDate": 1758380721288,
            "Source": "stock"
        },
        {
            "Title": "DEE Development Engineers Challenges Punjab Power Corporation's Tariff Revision in High Court",
            "Summary": "DEE Development Engineers Limited has filed a civil writ petition in the High Court of Punjab and Haryana challenging orders from the Punjab State Electricity Regulatory Commission. The orders reduced the variable cost component of tariff for the company's 8 MW Biomass Power Project from ₹5.89 per kWh to ₹3.897 per kWh with 5% escalation. The petition challenges PSERC orders dated May 15, June 12, August 20, and September 4, 2025, passed in relation to Petition No. 70 of 2023 and Review Petition No. 07 of 2025. The High Court has admitted the petition and issued notice of motion to respondents. The matter remains pending adjudication.",
            "Sentiment": "negative",
            "PublishDate": 1758294107702,
            "Source": "stock"
        },
        {
            "Title": "DEE Development Engineers Approves Rs. 300 Crore Fundraising and Share Capital Restructuring",
            "Summary": "DEE Development Engineers Limited's board approved raising up to Rs. 300 crores through equity shares and other eligible securities including convertible debentures and warrants. The fundraising can be executed through various methods including public issue, rights issue, preferential allotment, private placement, or Qualified Institutions Placement in one or more tranches. The board also approved reclassifying the company's authorized share capital from the existing structure of 7.875 crore equity shares and 62.5 lakh preference shares to 8.5 crore equity shares only, eliminating preference shares entirely while maintaining the total authorized capital at Rs. 85 crores. Both proposals require shareholder approval through an Extra-Ordinary General Meeting or Postal Ballot process. The board meeting was held on September 19, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758284584206,
            "Source": "corporate_action"
        },
        {
            "Title": "Dee Development Engineers Board to Discuss Fundraising Through Stocks and Bonds",
            "Summary": "Dee Development Engineers has scheduled a board meeting for September 19, 2025, to discuss fundraising plans through stocks and bonds. The company is exploring capital raising options through equity and debt instruments.",
            "Sentiment": "neutral",
            "PublishDate": 1758000608315,
            "Source": "corporate_action"
        },
        {
            "Title": "DEE Development Engineers Expands Gujarat Facility Capacity to 30,000 Metric Tons Annually",
            "Summary": "DEE Development Engineers has expanded capacity at its Anjar facility in Gujarat to 30,000 metric tons per year. The company reports having an order book worth ₹1,335 crores supporting this expansion.",
            "Sentiment": "positive",
            "PublishDate": 1757308212284,
            "Source": "stock"
        },
        {
            "Title": "DEE Development Engineers Reports Order Book Update with ₹1,334 Crore Closing Position",
            "Summary": "DEE Development Engineers Limited reported its order book status for August 2025, showing a closing position of ₹1,334.09 crores as of August 31, 2025, up from ₹1,226.66 crores at the beginning of the month. The company received new order inflows of ₹216.44 crores during August and executed orders worth ₹109.02 crores. The order book spans across pipings for power, oil & gas sectors, and heavy fabrication activities through its India and Thailand operations. For FY 2025-26, cumulative order inflow reached ₹534.86 crores while cumulative execution stood at ₹428.94 crores. The company also disclosed tariff revisions for its power generation business, with Malwa Power's tariff revised to ₹3.50 per unit and DEE's power division tariff set at ₹5.877 per unit by Punjab State Electricity Regulatory Commission. The company is pursuing legal measures against these tariff orders.",
            "Sentiment": "neutral",
            "PublishDate": 1757237647120,
            "Source": "stock"
        },
        {
            "Title": "Dee Development Secures ₹170 Crore Order",
            "Summary": "Dee Development has secured a new order worth ₹170 crores. The company announced this business development, which represents a significant contract value for the organization.",
            "Sentiment": "positive",
            "PublishDate": 1756801046140,
            "Source": "order&deals"
        },
        {
            "Title": "PSERC Cuts Tariffs for DEE Development Engineers' 8 MW Biomass Plant",
            "Summary": "The Punjab State Electricity Regulatory Commission (PSERC) has reduced tariffs for DEE Development Engineers' 8 MW Abohar biomass plant. The tariff reduction is expected to decrease the company's annual revenues by ₹8.2 crore. However, DEE Development Engineers anticipates a retrospective recovery of ₹13.02 crore from the tariff adjustment.",
            "Sentiment": "neutral",
            "PublishDate": 1755828118928,
            "Source": "stock"
        },
        {
            "Title": "DEE Development Engineers Reports Strong Q1 Results with 21% Revenue Growth and 314% Jump in Net Profit",
            "Summary": "DEE Development Engineers Limited reported revenue of INR 2,238 crores for the quarter, marking 21.0% year-over-year growth. The company's net profit surged 314.3% to INR 132 crores, while EBITDA grew 44.7% to INR 359 crores with a 16.0% margin. The piping solutions segment, contributing 86.9% of total revenue, drove growth with 30.4% year-over-year increase. The company maintains an order book of INR 12,267 crores as of July 31, 2025. DEE is expanding its Anjar facility capacity by 15,000 MT/annum, expected to be commissioned by end-August 2025, ahead of schedule. The company entered the green hydrogen sector through a partnership and acquired majority stake in Molsieve Designs Limited. However, the power generation segment faces challenges due to downward tariff revision for biomass projects. Management targets 19-20% EBITDA margins for the full year, subject to resolution of power business issues, and expects INR 1,200 crores in additional order inflow by March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1755599232715,
            "Source": "earnings"
        },
        {
            "Title": "DEE Development Reports Strong Q1 Growth with Revenue Rising to Rs 2.2B",
            "Summary": "DEE Development reported quarterly revenue of Rs 2.2 billion compared to Rs 1.85 billion in the same period last year. The company's consolidated net profit increased significantly to Rs 132 million from Rs 32 million year-over-year. EBITDA grew to Rs 359 million from Rs 248 million, while EBITDA margin improved to 16.03% from 13.4% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754895226061,
            "Source": "earnings"
        },
        {
            "Title": "DEE Development Engineers Reports Order Book Updates for July 2025",
            "Summary": "DEE Development Engineers Limited disclosed its order book status for July 2025. The company's total order book decreased from ₹1,261.64 crores at the beginning of July to ₹1,226.66 crores by month-end, with new order inflows of ₹53.96 crores and executions of ₹88.93 crores. The cumulative order inflow for fiscal year 2025-26 stands at ₹318.42 crores, while cumulative executions reached ₹319.91 crores. The company operates across multiple segments including power, oil & gas, and heavy fabrication through various subsidiaries. DEE India's power segment holds the largest portion with ₹184.60 crores, while oil & gas operations account for ₹942.32 crores. Additionally, the company noted tariff revisions for its power generation business, with DEE Development Engineers' power division receiving a revised tariff of ₹5.255 per unit and Malwa Power receiving ₹3.50 per unit. A review petition regarding these tariffs is pending before the Punjab State Electricity Regulatory Commission.",
            "Sentiment": "neutral",
            "PublishDate": 1754553846302,
            "Source": "stock"
        },
        {
            "Title": "Dee Development Engineers Secures 86.6 Crore Order",
            "Summary": "Dee Development Engineers has won an order valued at 86.6 crores. No further details about the order or the company's business were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1750824108000,
            "Source": "default"
        },
        {
            "Title": "DEE Development Engineers: MoU Signed for Green Hydrogen Solutions in India and Thailand",
            "Summary": "DEE Development Engineers Ltd (DDEL) has signed an MoU with International Clean-Tech Partner to develop and execute green hydrogen production projects in India and Thailand. The partnership combines DDEL's manufacturing and execution expertise with International Clean-Tech Partner's hydrogen technologies. This aligns with India's National Green Hydrogen Mission and Thailand's renewable energy roadmap.",
            "Sentiment": "positive",
            "PublishDate": 1749451095000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dee Development Engineers Partners with Global Clean-Tech Firm for Green Hydrogen Initiatives",
            "Summary": "Dee Development Engineers has formed a partnership with a global clean-tech firm to accelerate green hydrogen initiatives in India and Thailand. The collaboration aims to promote sustainable energy solutions in these countries.",
            "Sentiment": "positive",
            "PublishDate": 1749442190000,
            "Source": "default"
        },
        {
            "Title": "DEE DEVELOPMENT Reports Strong Q4 Financial Results",
            "Summary": "DEE DEVELOPMENT has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 635 million rupees from 346 million rupees in the same quarter last year. The EBITDA margin rose to 22.18% from 14.21%. Revenue grew to 2.8 billion rupees from 2.4 billion rupees. Consolidated net profit jumped to 315 million rupees from 119 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1748508346000,
            "Source": "result"
        },
        {
            "Title": "Dee Development Engineers Secures Major International Order",
            "Summary": "Dee Development Engineers has obtained a significant recurring international order from a leading U.S.-based oil and gas company. The order is for global process piping projects.",
            "Sentiment": "positive",
            "PublishDate": 1747492444000,
            "Source": "default"
        },
        {
            "Title": "DEE Development Engineers: Secures Rs 55 Crore Overseas Order for Power Station Piping",
            "Summary": "DEE Development Engineers Ltd. has received a Rs 55 crore order from an overseas company for supplying piping items to a thermal power station. The order is to be executed within 7-12 months, marking the company's expansion in international markets.",
            "Sentiment": "positive",
            "PublishDate": 1743779967000,
            "Source": "order&deals"
        },
        {
            "Title": "DEE Development Engineers: $2.4 Million Investment in Thai Subsidiary",
            "Summary": "DEE Development Engineers Limited is investing $2.4 million in its wholly owned subsidiary, DEE Piping Systems (Thailand) Co. Ltd., to help repay debt. The investment involves acquiring 161,61,616 equity shares, maintaining 100% ownership. The Thai subsidiary, despite revenue growth, posted a loss in FY 2023-2024.",
            "Sentiment": "neutral",
            "PublishDate": 1742555667000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dee Development Secures Order Worth Rs. 27 Crore",
            "Summary": "Dee Development has announced that it has received a new order valued at 27 crore rupees. This order represents a significant business development for the company, potentially boosting its revenue and project pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1740113152000,
            "Source": "order&deals"
        },
        {
            "Title": "Dee Development Engineers Reports Q3 Financial Results and Investment Plans",
            "Summary": "Dee Development Engineers reported a consolidated net loss of 133 million rupees in Q3, compared to a 90 million rupee loss in the same quarter last year and a 223 million rupee loss in the previous quarter. Revenue decreased to 1.6 billion rupees from 2.09 billion rupees year-over-year. The company plans to invest an additional 550 million rupees in its shop fabrication facility.",
            "Sentiment": "negative",
            "PublishDate": 1739751370000,
            "Source": "earnings"
        },
        {
            "Title": "Dee Development Engineers to Invest 550 Million Rupees in Shop Fabrication Facility",
            "Summary": "Dee Development Engineers has announced plans to invest 550 million rupees in their shop fabrication facility. This significant investment suggests the company is expanding its manufacturing capabilities, which could potentially lead to increased production capacity and improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739546315000,
            "Source": "corporate_action"
        },
        {
            "Title": "DEE DEVELOPMENT ENGINEERS Reports Significant Decline in Q3 EBITDA",
            "Summary": "DEE DEVELOPMENT ENGINEERS has reported a substantial decrease in its Q3 EBITDA, which fell to 57 million rupees from 299 million rupees year-over-year. The company's EBITDA margin also declined significantly, dropping to 3.5% from 14.28% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739542703000,
            "Source": "earnings"
        },
        {
            "Title": "Dee Development Engineers Reports Increased Q3 Net Loss",
            "Summary": "Dee Development Engineers has reported a consolidated net loss of 133 million rupees for the third quarter, compared to a loss of 90 million rupees in the same period last year. The loss has also increased from 223 million rupees in the previous quarter. The company's revenue for Q3 decreased to 1.6 billion rupees from 2.09 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739542631000,
            "Source": "earnings"
        },
        {
            "Title": "DEE Development Engineers: Revenue Tripling Plan and Expansion",
            "Summary": "DEE Development Engineers aims to triple revenue to Rs 2,400 crore in 3-5 years. The company has launched a new Rs 250 crore facility in Anjar with initial capacity of 12,000 tonnes per annum, to be ramped up to 27,000 tonnes. A Rs 90-crore seamless pipe manufacturing facility is planned for December. Q2 profit rose 125% to Rs 22.26 crore.",
            "Sentiment": "positive",
            "PublishDate": 1737453456000,
            "Source": "normal_news"
        },
        {
            "Title": "Dee Development Plans Capacity Expansion",
            "Summary": "Dee Development has announced that it has commissioned a capacity of 12,000 MT and is planning to enhance its capacity by an additional 15,000 MT, which is expected to be commissioned by October 2025.",
            "Sentiment": "positive",
            "PublishDate": 1737439444000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dee Development Expands Production Capacity",
            "Summary": "Dee Development has increased its operational capacity by 9,000 MT per annum, bringing the total operational capacity to 12,000 MT per annum.",
            "Sentiment": "positive",
            "PublishDate": 1737439422000,
            "Source": "corporate_action"
        },
        {
            "Title": "DEE Development Commissions New Manufacturing Facility in Gujarat",
            "Summary": "DEE Development has partially commissioned a new state-of-the-art manufacturing facility in Gujarat, India. The project represents an investment of ₹250 crore (approximately $30 million USD). This significant expansion of production capabilities is likely to enhance the company's manufacturing capacity and potentially its market position.",
            "Sentiment": "positive",
            "PublishDate": 1737439317000,
            "Source": "corporate_action"
        },
        {
            "Title": "DEE Development Engineers: Secures $16.5 Million International Order",
            "Summary": "DEE Development Engineers Ltd has received a $16.5 million purchase order from a new international customer for prefabricated pipe spools. The contract is to be executed by December 2026. The company is also expanding with a new facility in Anjar, expected to be operational by Q3 FY25.",
            "Sentiment": "positive",
            "PublishDate": 1733911887000,
            "Source": "order&deals"
        },
        {
            "Title": "Dee Development Secures 1.4 Billion Rupee Order",
            "Summary": "Dee Development has won a new order valued at 1.4 billion rupees. The company currently has a market capitalization of 23 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1733905426000,
            "Source": "order&deals"
        },
        {
            "Title": "DEE Development Expects Margin Improvement Due to New Capacities",
            "Summary": "DEE Development has announced that it anticipates its margin to improve from the current 15% to 20% as a result of new capacities coming online. This information was reported by CNBCTV18.",
            "Sentiment": "positive",
            "PublishDate": 1731909676000,
            "Source": "corporate_action"
        },
        {
            "Title": "DEE Development Engineers Reports Q2 Financial Results",
            "Summary": "DEE Development Engineers announced its Q2 financial results. The company's consolidated net profit increased to 223 million rupees, up from 99 million rupees year-over-year and 32 million rupees quarter-over-quarter. Revenue for Q2 rose to 1.94 billion rupees, compared to 1.78 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731335159000,
            "Source": "result"
        }
    ]
}