{
    "Symbol": "DEEPINDS",
    "ISIN": "INE0FHS01024",
    "News": [
        {
            "Title": "Deep Industries Q3 Net Profit Surges 56% YoY",
            "Summary": "Deep Industries reported consolidated net profit of ₹681 million in Q3, marking a significant 56% increase from ₹436 million in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1770278810211,
            "Source": "co_actions_results"
        },
        {
            "Title": "Deep Industries Board Meet Set for Feb 5, 2026",
            "Summary": "Deep Industries Limited has scheduled its board meeting for February 05, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769605022414,
            "Source": "co_actions_results"
        },
        {
            "Title": "Deep Industries Wins ₹108 Cr GAIL Contract",
            "Summary": "Deep Industries Limited secured a contract worth approximately ₹108 crores from GAIL (India) Limited for hiring compression facility at RT-USAR Plant, to be executed over 880 days.",
            "Sentiment": "positive",
            "PublishDate": 1769529301789,
            "Source": "co_actions_results"
        },
        {
            "Title": "DEEP Industries Resolves Gas Leak at Well Mori #5",
            "Summary": "DEEP Industries Limited successfully contained gas leak incident at Well Mori #5 in Andhra Pradesh during ONGC workover operations. No injuries or casualties reported in the incident.",
            "Sentiment": "positive",
            "PublishDate": 1768044387105,
            "Source": "stocks"
        },
        {
            "Title": "Deep Industries Reports Gas Leak at Andhra Well",
            "Summary": "Deep Industries Limited disclosed a gas leak incident during workover operations at Well Mori #5 in Andhra Pradesh. No injuries reported, area secured with cooling operations commenced.",
            "Sentiment": "negative",
            "PublishDate": 1767625868614,
            "Source": "stocks"
        },
        {
            "Title": "Dolphin Offshore Independent Director Passes Away",
            "Summary": "Dolphin Offshore Enterprises announced the sad demise of Independent Director Shri Ashokkumar Ratilal Patel on December 13, 2025. The company disclosed this information under SEBI regulations.",
            "Sentiment": "negative",
            "PublishDate": 1765791313506,
            "Source": "stocks"
        },
        {
            "Title": "Deep Industries Enters Tripartite Agreement with ONGC and Deep Exploration Services",
            "Summary": "Deep Industries has entered into a tripartite addendum involving ONGC and Deep Exploration Services Private. The agreement involves three parties in what appears to be a business collaboration in the oil and gas exploration sector.",
            "Sentiment": "positive",
            "PublishDate": 1764719975932,
            "Source": "corporate_action"
        },
        {
            "Title": "Deep Industries Acquires 70% Stake in DNRL, Making It a Subsidiary",
            "Summary": "Deep Industries has acquired a 70% stake in DNRL, converting the company into its subsidiary through this majority ownership transaction. The acquisition represents a strategic expansion move for Deep Industries, giving it controlling interest and operational oversight of DNRL's business operations.",
            "Sentiment": "positive",
            "PublishDate": 1764683226336,
            "Source": "order&deals"
        },
        {
            "Title": "Deep Industries Reports 69% Revenue Growth in Q2 FY26, Order Book Reaches Rs 3,050 Crores",
            "Summary": "Deep Industries delivered strong quarterly results with revenue rising 69.2% year-on-year to Rs 221 crores and EBITDA growing 74.7% to Rs 112.9 crores in Q2 FY26, maintaining healthy margins of 46.6%. The oil and gas services company's robust order book of Rs 3,050 crores, including a 15-year production enhancement contract worth Rs 1,402 crores, provides strong revenue visibility and positions it for continued growth trajectory.",
            "Sentiment": "positive",
            "PublishDate": 1763138358306,
            "Source": "earnings"
        },
        {
            "Title": "Deep Industries Reports Strong Q2 Growth with Revenue Up 70% and Net Profit Rising 75%",
            "Summary": "Deep Industries delivered robust quarterly performance with revenue increasing to 2.21 billion rupees from 1.3 billion rupees year-over-year. The company's consolidated net profit grew significantly to 674 million rupees compared to 384 million rupees in the same period last year. EBITDA rose to 916 million rupees from 575 million rupees year-over-year, though EBITDA margin declined slightly to 41.45% from 44.01% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762501683868,
            "Source": "earnings"
        },
        {
            "Title": "Deep Industries Reports 61.6% Revenue Growth in Q1 FY26, Order Book Surges 152%",
            "Summary": "Deep Industries Limited reported strong quarterly results with revenue rising 61.6% year-on-year to Rs. 199.5 crores in Q1 FY26. EBITDA grew 54.7% to Rs. 95 crores with margins at 44.6%, while net profit increased 59.3% to Rs. 61.7 crores. The company's order book expanded significantly by 152.15% to Rs. 3,051 crores. Key operational developments include taking charge of Rajahmundry field enhancement operations, securing Rs. 45 crores and Rs. 96.72 crores contracts from Oil India Limited for workover rigs, and the Prabha barge beginning revenue generation in May 2025. The company expects over 30% year-on-year growth based on existing order book and anticipates this momentum to continue for the next 2-3 years. Management highlighted strong demand in India's oil and gas support services sector driven by national energy security initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1754658040954,
            "Source": "earnings"
        },
        {
            "Title": "Deep Industries Approves Q1 FY26 Results and Multiple Board Re-appointments",
            "Summary": "Deep Industries Limited approved its unaudited financial results for the quarter ended June 30, 2025. The board approved several key re-appointments for 5-year terms: Mr. Paras Shantilal Savla as Chairman & Managing Director (effective September 1, 2025), Mr. Rupesh Kantilal Savla as Managing Director (effective September 1, 2025), Mr. Rohan Vasantkumar Shah as Whole-time Director (effective June 24, 2026), Dr. Kirit Nanubhai Shelat as Independent Director (effective November 10, 2025), and Mrs. Shaily Dedhia as Independent Director (effective June 24, 2026). The company also appointed M/s RPAP & Co. as Secretarial Auditors for 5 years from April 1, 2025. Additionally, the board approved substantial acquisition of ownership in Deep Natural Resources Limited, which will become a subsidiary, and alteration of the company's Memorandum of Association to integrate manufacturing business of chemicals and hydrocarbons fluids. The company set August 22, 2025 as the record date for final dividend declaration for Financial Year 2024-25. All appointments and major decisions are subject to shareholder approval at the upcoming Annual General Meeting.",
            "Sentiment": "positive",
            "PublishDate": 1754299942113,
            "Source": "earnings"
        },
        {
            "Title": "Deep Industries Board Approves Q1 2025 Results and Multiple Leadership Re-appointments",
            "Summary": "Deep Industries Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The Board re-appointed several key executives for 5-year terms: Mr. Paras Shantilal Savla as Chairman & Managing Director (effective September 1, 2025), Mr. Rupesh Kantilal Savla as Managing Director (effective September 1, 2025), Mr. Rohan Vasantkumar Shah as Whole-time Director (effective June 24, 2026), Dr. Kirit Nanubhai Shelat as Independent Director (effective November 10, 2025), and Mrs. Shaily Dedhia as Independent Director (effective June 24, 2026). The company appointed M/s RPAP & Co. as Secretarial Auditors for 5 years from April 1, 2025. The Board approved substantial acquisition of ownership in Deep Natural Resources Limited, which will become a subsidiary. The company also approved alteration of its Memorandum of Association to integrate manufacturing business of chemicals and hydrocarbons fluids for in-house sourcing. A record date of August 22, 2025 was fixed for final dividend declaration for Financial Year 2024-25. All appointments are subject to shareholder approval at the Annual General Meeting.",
            "Sentiment": "positive",
            "PublishDate": 1754299507596,
            "Source": "corporate_governance"
        },
        {
            "Title": "Deep Industries Approves Q1 FY26 Results and Multiple Board Reappointments",
            "Summary": "Deep Industries Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs. 1,408.43 lakhs and net profit of Rs. 4,676.23 lakhs for the quarter. On a consolidated basis, revenue from operations was Rs. 19,949.89 lakhs with net profit of Rs. 6,170.09 lakhs. The Board approved multiple reappointments including Mr. Paras Shantilal Savla as Chairman & Managing Director for five years effective September 1, 2025, Mr. Rupesh Kantilal Savla as Managing Director for five years from September 1, 2025, and Mr. Rohan Vasantkumar Shah as Whole-time Director for five years from June 24, 2026. The company also reappointed two Independent Directors - Dr. Kirit Nanubhai Shelat for five years from November 10, 2025, and Mrs. Shaily Dedhia for five years from June 24, 2026. Additionally, the Board approved substantial acquisition of ownership in Deep Natural Resources Limited, making it a subsidiary, and appointed M/s RPAP & Co. as Secretarial Auditors for five years. The company fixed August 22, 2025 as the record date for final dividend declaration, subject to shareholder approval at the Annual General Meeting.",
            "Sentiment": "positive",
            "PublishDate": 1754296746132,
            "Source": "corporate_action"
        },
        {
            "Title": "Deep Industries Reports 58% Jump in Quarterly Net Profit to 588 Million Rupees",
            "Summary": "Deep Industries reported consolidated net profit of 588 million rupees compared to 371 million rupees in the same quarter last year, marking a 58% increase. Revenue grew to 1.99 billion rupees from 1.23 billion rupees year-over-year, representing a 62% rise. EBITDA increased to 816 million rupees from 506 million rupees, while EBITDA margin remained relatively stable at 40.9% compared to 40.98% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754296185981,
            "Source": "earnings"
        },
        {
            "Title": "Deep Industries Secures ₹97 Crore Workover Rig Contract from Oil India",
            "Summary": "Deep Industries has received a ₹97 crore order from Oil India for charter hire of workover rig services in Assam and Arunachal Pradesh. The contract involves providing workover rig operations across these two northeastern states.",
            "Sentiment": "positive",
            "PublishDate": 1754127640549,
            "Source": "order&deals"
        },
        {
            "Title": "Deep Industries Limited Revises Q1 FY2026 Earnings Call Invite for August 5, 2025",
            "Summary": "Deep Industries Limited has issued a revised invitation for its earnings conference call scheduled for August 5, 2025 at 11:00 AM IST. The call will discuss the company's financial performance for the first quarter ended June 30, 2025. The company will be represented by Chairman & Managing Director Paras Savla and Whole-time Director (Finance) and CFO Rohan Shah. The call will be accessible through multiple international toll-free numbers and includes a Diamond Pass registration option for premium access without waiting time.",
            "Sentiment": "neutral",
            "PublishDate": 1753794596612,
            "Source": "earnings"
        },
        {
            "Title": "Deep Industries Approves Amalgamation of Wholly Owned Subsidiary",
            "Summary": "Deep Industries has approved the amalgamation of its wholly owned subsidiary, Kandla Energy and Chemicals. This corporate action involves the merging of the subsidiary into the parent company.",
            "Sentiment": "neutral",
            "PublishDate": 1751283822000,
            "Source": "default"
        },
        {
            "Title": "Deep Industries Secures 453.3 Million Rupee Contract",
            "Summary": "Deep Industries has received an award letter for a contract valued at approximately 453.3 million rupees. No further details about the nature of the contract or the awarding entity were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1750945703000,
            "Source": "default"
        },
        {
            "Title": "Deep Industries Expands into Offshore Services with Accommodation Barge Lease",
            "Summary": "Deep Industries announces its entry into offshore services with its DP2 barge 'Prabha'. The company reports high demand for such barges due to their features and capabilities. Prabha has secured a 3-year lease agreement, expected to generate significant daily rental revenues with an EBITDA margin of approximately 60%. This new venture will contribute to the company's growth starting from Q1 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1746188431000,
            "Source": "default"
        },
        {
            "Title": "Deep Industries Announces Dividend of ₹3.05 Per Share",
            "Summary": "Deep Industries has declared a dividend of ₹3.05 per share for its shareholders. This corporate action represents a distribution of the company's profits to its investors.",
            "Sentiment": "positive",
            "PublishDate": 1746180096000,
            "Source": "result"
        },
        {
            "Title": "Deep Industries Reports Mixed Q4 Results with Exceptional Item",
            "Summary": "Deep Industries announced its Q4 financial results, showing significant year-over-year improvements in EBITDA and EBITDA margin. However, the company reported a consolidated net loss due to an exceptional item of 2.5 billion rupees. Q4 EBITDA increased to 724 million rupees from 378 million rupees last year, with EBITDA margin improving to 43.31% from 31.62%. Profit before tax grew to 488 million rupees from 391 million rupees. Despite these positive indicators, the company posted a consolidated net loss of 2 billion rupees compared to a profit of 361 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1746179992000,
            "Source": "result"
        },
        {
            "Title": "Deep Industries Acquires 100% Equity of Kandla Energy and Chemicals",
            "Summary": "Deep Industries has announced the acquisition of 100% equity stake in Kandla Energy and Chemicals. This move represents a significant corporate action, potentially expanding Deep Industries' portfolio and market presence in the energy and chemicals sector.",
            "Sentiment": "positive",
            "PublishDate": 1743466160000,
            "Source": "corporate_action"
        },
        {
            "Title": "Deep Industries Acquires Full Ownership of Kandla Energy and Chemicals",
            "Summary": "Deep Industries has announced the acquisition of 100% equity stake in Kandla Energy and Chemicals. This strategic move represents a significant expansion of Deep Industries' portfolio and potentially its market presence in the energy and chemicals sector.",
            "Sentiment": "positive",
            "PublishDate": 1743423664000,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLT Ahmedabad Approves Acquisition of Kandla Energy by Deep Industries",
            "Summary": "Deep Industries has announced that the National Company Law Tribunal (NCLT) in Ahmedabad has granted reliefs for the company's acquisition of Kandla Energy. This approval from the NCLT paves the way for Deep Industries to proceed with the acquisition, potentially expanding its operations and market presence.",
            "Sentiment": "positive",
            "PublishDate": 1738714532000,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLT Ahmedabad Approves Acquisition of Kandla Energy by Deep Industries",
            "Summary": "Deep Industries has announced that the National Company Law Tribunal (NCLT) in Ahmedabad has granted reliefs for the company's acquisition of Kandla Energy. This approval from the NCLT paves the way for Deep Industries to proceed with the acquisition, potentially expanding its operations and market presence.",
            "Sentiment": "positive",
            "PublishDate": 1738679652000,
            "Source": "corporate_action"
        },
        {
            "Title": "Deep Industries Acquires 100% Stake in Indra Offshore Services",
            "Summary": "Deep Industries has announced the acquisition of a 100% stake in Indra Offshore Services. This strategic move is aimed at enhancing the company's operational efficiency. The acquisition is expected to strengthen Deep Industries' position in the offshore services sector.",
            "Sentiment": "positive",
            "PublishDate": 1736992977000,
            "Source": "corporate_action"
        },
        {
            "Title": "Deep Industries: Rs 550 Crore Revenue Target for FY25, 30% Annual Growth Projected",
            "Summary": "Deep Industries Ltd. aims for Rs 550 crore revenue in FY25, up from Rs 427 crore in FY24. CFO Rohan Shah projects 30% annual topline growth for the next 2-3 years. The company's order book exceeds Rs 2,700 crore, with a healthy bidding pipeline. A recent ONGC contract worth Rs 90 crore was secured. Margins are expected to remain above 40%.",
            "Sentiment": "positive",
            "PublishDate": 1736562600000,
            "Source": "earnings"
        },
        {
            "Title": "Deep Industries Secures 90.7 Crore Rupee Order",
            "Summary": "Deep Industries has won a significant order valued at 90.7 crore rupees. This development represents a substantial business opportunity for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1736122166000,
            "Source": "order&deals"
        },
        {
            "Title": "Deep Industries Secures 90.7 Crore Rupee Order",
            "Summary": "Deep Industries has announced winning a new order valued at 90.7 crore rupees. This represents a significant business development for the company, potentially boosting its revenue and order book.",
            "Sentiment": "positive",
            "PublishDate": 1735908755000,
            "Source": "order&deals"
        },
        {
            "Title": "Deep Industries to Raise Funds Through Qualified Institutional Placement",
            "Summary": "Deep Industries has announced its intention to raise funds by issuing equity shares through a Qualified Institutional Placement (QIP). The company aims to raise an aggregate amount not exceeding 350 crore rupees through this process.",
            "Sentiment": "positive",
            "PublishDate": 1735518052000,
            "Source": "corporate_action"
        },
        {
            "Title": "Deep Industries Approves Fund Raising Through QIP",
            "Summary": "Deep Industries has approved raising funds through the issuance of equity shares via Qualified Institutional Placement (QIP). The company plans to raise an aggregate amount not exceeding 350 crore rupees through this method.",
            "Sentiment": "positive",
            "PublishDate": 1735375876000,
            "Source": "corporate_action"
        },
        {
            "Title": "Deep Industries to Consider Fund Raising on December 28",
            "Summary": "The board of Deep Industries is scheduled to meet on December 28 to consider fund raising options for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1735049729000,
            "Source": "corporate_action"
        },
        {
            "Title": "Deep Industries Secures $7.30 Million Drilling Contract from Selan Exploration",
            "Summary": "Deep Industries has received a Letter of Award (LOA) from Selan Exploration for drilling services. The contract is valued at USD 7.30 million, which is approximately Rs 62 crore.",
            "Sentiment": "positive",
            "PublishDate": 1734654870000,
            "Source": "order&deals"
        },
        {
            "Title": "Deep Industries Secures Drilling Services Contract from Selan Exploration",
            "Summary": "Deep Industries has received a Letter of Award (LOA) from Selan Exploration for drilling services. The contract is valued at USD 7.30 million, which is approximately Rs 62 crore.",
            "Sentiment": "positive",
            "PublishDate": 1734615708000,
            "Source": "order&deals"
        },
        {
            "Title": "Deep Industries Reports Strong Q2 Financial Performance",
            "Summary": "Deep Industries has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased from 386 million rupees to 575 million rupees. Additionally, the EBITDA margin improved from 38.07% to 44.01% compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730108404000,
            "Source": "result"
        },
        {
            "Title": "Deep Industries Reports Q2 Revenue Growth",
            "Summary": "Deep Industries has announced its Q2 revenue of 1.3 billion rupees, compared to 1 billion rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730108338000,
            "Source": "result"
        },
        {
            "Title": "Deep Industries Reports 30.6% Increase in Q2 Consolidated Net Profit",
            "Summary": "Deep Industries has announced its Q2 financial results, reporting a consolidated net profit of 384 million rupees, up from 294 million rupees in the same quarter last year. This represents a year-over-year increase of approximately 30.6%.",
            "Sentiment": "positive",
            "PublishDate": 1730108318000,
            "Source": "result"
        }
    ]
}