{
    "Symbol": "DEEPAKNTR",
    "ISIN": "INE288B01029",
    "News": [
        {
            "Title": "Deepak Nitrite Q3 FY26: 16% EBITDA Growth Despite Challenges",
            "Summary": "Deepak Nitrite reports ₹219 crore EBITDA in Q3 FY26, up 16% YoY, with revenue at ₹1,983 crore. Company commissions new facilities while navigating pricing pressures from Chinese competition.",
            "Sentiment": "positive",
            "PublishDate": 1770917542792,
            "Source": "co_actions_results"
        },
        {
            "Title": "Deepak Nitrite Board Meet Set for Feb 12, 2025",
            "Summary": "Deepak Nitrite Limited announces board meeting on February 12, 2025, to consider Q3 FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769748584203,
            "Source": "co_actions_results"
        },
        {
            "Title": "Deepak Nitrite's Subsidiary Raises ₹80 Crores",
            "Summary": "Deepak Chem Tech Limited allots 80 lakh preference shares worth ₹80 crores to Deepak Phenolics Limited to strengthen capital base and support project expenses in Gujarat operations.",
            "Sentiment": "positive",
            "PublishDate": 1769670897150,
            "Source": "co_actions_results"
        },
        {
            "Title": "Deepak Nitrite shares fall 2.02% amid mixed results",
            "Summary": "Deepak Nitrite stock declined 2.02% to ₹1,567.90, ranking among top losers on Nifty Midcap 150. Company reported revenue growth to ₹8,281.93 crores in FY25 but net profit dropped to ₹697.37 crores.",
            "Sentiment": "negative",
            "PublishDate": 1769164900118,
            "Source": "stocks"
        },
        {
            "Title": "Deepak Nitrite Shows Bullish Technical Breakout",
            "Summary": "Deepak Nitrite breaks above ₹1,529 resistance after forming descending channel pattern, signaling potential near-term upward momentum with healthy buying volumes supporting the technical breakout.",
            "Sentiment": "positive",
            "PublishDate": 1769048486662,
            "Source": "stocks"
        },
        {
            "Title": "Deepak Nitrite Launches New Plant in Gujarat",
            "Summary": "Deepak Nitrite announces the launch of a new nitration and hydrogenation plant in Gujarat with planned capital expenditure of ₹85.00 crores for facility expansion.",
            "Sentiment": "positive",
            "PublishDate": 1768828395714,
            "Source": "stocks"
        },
        {
            "Title": "Deepak Nitrite Gets Relief in Stamp Duty Case",
            "Summary": "CCRA sets aside ₹21 lakh stamp duty order against Deepak Nitrite, remands ₹86.10 lakh case for reassessment. Company received favorable ruling on appeals filed against Deputy Collector orders.",
            "Sentiment": "positive",
            "PublishDate": 1767787830452,
            "Source": "stocks"
        },
        {
            "Title": "Deepak Nitrite's Unit Chem Tech Commences Nitric Acid Plant Operations in Gujarat",
            "Summary": "Deepak Nitrite's subsidiary Chem Tech has started operations at its new nitric acid manufacturing plant in Gujarat with a capital expenditure of approximately 5.15 billion rupees. This operational milestone expands the company's manufacturing capabilities in the chemical sector and represents a significant capital investment in production infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1764893250754,
            "Source": "stock"
        },
        {
            "Title": "Deepak Nitrite's Subsidiary Deepak Chem Tech Raises ₹35 Crores Through Preference Share Allotment",
            "Summary": "Deepak Chem Tech Limited allotted 35 lakh optionally convertible redeemable preference shares worth ₹35 crores to Deepak Phenolics Limited, both being wholly owned subsidiaries of Deepak Nitrite Limited. The fund infusion aims to strengthen Deepak Chem Tech's capital base and support project expenses for its fluorination plant operations and ongoing projects across Gujarat sites.",
            "Sentiment": "positive",
            "PublishDate": 1764331750605,
            "Source": "corporate_action"
        },
        {
            "Title": "Deepak Nitrite Reports Sequential Growth in Q2 FY26 with New Product Launches and Capacity Expansions",
            "Summary": "Deepak Nitrite reported consolidated revenues of INR 1,922 crore in Q2 FY26 with 5% quarter-on-quarter EBITDA growth to INR 224 crore, driven by improved Phenolics performance and record Isopropyl Alcohol production. The company commissioned its hydrogenation asset at Deepak Chem Tech and inaugurated a INR 100 crore R&D center at Savli, while launching 7 new products and progressing on its integrated polycarbonate project expected to be operational by March 2028.",
            "Sentiment": "positive",
            "PublishDate": 1763616161039,
            "Source": "earnings"
        },
        {
            "Title": "Deepak Nitrite Announces Major Capital Expenditure Plans Worth INR 9,000 Crores for Polycarbonate Project",
            "Summary": "Deepak Nitrite outlined significant capital expenditure guidance with INR 1,500 crores planned for FY26 and INR 3,000-4,000 crores annually over the next three years, including a total polycarbonate project outlay of INR 9,000 crores. Management expressed cautious optimism about H2 FY26 performance improvement compared to Q2, driven by better market sentiment and new investment commissioning, while declining to provide specific revenue and profitability guidance.",
            "Sentiment": "neutral",
            "PublishDate": 1763217947474,
            "Source": "stock"
        },
        {
            "Title": "Deepak Nitrite Reports 6% Revenue Decline in Q2FY26 Despite Sequential Growth",
            "Summary": "Deepak Nitrite posted quarterly results with revenue of ₹1,922 crore and EBITDA of ₹224 crore, showing 6% year-on-year decline but 5% sequential EBITDA growth. The chemical intermediates company faced headwinds from US tariff actions and Chinese competition in Advanced Intermediates segment, while Phenolics business delivered strong performance with 23% sequential EBIT growth.",
            "Sentiment": "negative",
            "PublishDate": 1763061714062,
            "Source": "earnings"
        },
        {
            "Title": "Deepak Nitrite Extends Chief Manufacturing Officer's Term Until March 2028",
            "Summary": "Deepak Nitrite Limited's Board of Directors approved the extension of Shri Anant Pande's term as Chief Manufacturing Officer for a period from November 23, 2025 to March 31, 2028. The decision was made upon recommendation of the Nomination and Remuneration Committee during a board meeting held on November 12, 2025. Pande, aged 62 years, holds a B.E. (Hons.) in Chemical and M.Sc. (Hons.) in Chemistry from Birla Institute of Technology & Science, Pilani, along with an Executive Diploma in Management. He brings 39 years of experience in life science chemicals and pharmaceutical companies. His previous roles include Chief Executive Officer at Dhampur Sugar Mills Limited and Wholetime Director & Chief of Operations at Jubilant Life Sciences. He has also held leadership positions at Atul Limited, Continental Carbon India Limited, Indo Greefuel Private Limited, and Aditya Birla Group. Pande co-chairs the Manufacturing Excellence Committee of Federation of Indian Chambers of Commerce & Industry (FICCI) and is not related to any Directors or Key Managerial Personnel of the Company.",
            "Sentiment": "positive",
            "PublishDate": 1762969605371,
            "Source": "corporate_governance"
        },
        {
            "Title": "Deepak Nitrite Subsidiary Raises ₹32 Crore Through Preference Share Allotment",
            "Summary": "Deepak Chem Tech Limited, a wholly owned subsidiary of Deepak Nitrite Limited, has issued and allotted 32 lakh optionally convertible redeemable preference shares (OCRPS) worth ₹32 crores to Deepak Phenolics Limited, another wholly owned subsidiary of Deepak Nitrite. The shares were allotted at face value of ₹100 each at par. The fund infusion aims to strengthen Deepak Chem Tech's capital base and support project expenses. Deepak Chem Tech operates a fluorination plant and is pursuing projects across various sites in Gujarat. The company reported a turnover of ₹9.43 crores in FY2024-25. Following this transaction, Deepak Nitrite continues to maintain 100% equity shareholding in Deepak Chem Tech, while holding 100% preference share capital indirectly along with Deepak Phenolics.",
            "Sentiment": "positive",
            "PublishDate": 1762527641572,
            "Source": "corporate_action"
        },
        {
            "Title": "Deepak Nitrite Opens New 5-Acre R&D Centre in Vadodara",
            "Summary": "Deepak Nitrite has opened a new research and development centre in Savli, Vadodara. The facility spans 5 acres and features advanced laboratories and pilot plants designed to enhance chemistry and sustainable innovations.",
            "Sentiment": "positive",
            "PublishDate": 1759743850300,
            "Source": "stock"
        },
        {
            "Title": "Deepak Nitrite's Subsidiary Commissions Hydrogenation Plant with ₹115 Crore Investment",
            "Summary": "Deepak Chem Tech Limited, a wholly owned subsidiary of Deepak Nitrite Limited, has commissioned its Hydrogenation Plant on September 26, 2025, at Dahej in Gujarat. The company invested approximately ₹115 crores in total capital expenditure for this plant commissioning.",
            "Sentiment": "positive",
            "PublishDate": 1758888234740,
            "Source": "stock"
        },
        {
            "Title": "Deepak Nitrite Shares Worth Rs. 61.53 Crores Traded in NSE Block Deal",
            "Summary": "Deepak Nitrite Ltd. witnessed a block trade on NSE involving approximately 344,418 shares at Rs. 1,786.60 per share, totaling Rs. 61.53 crores. The transaction represents a significant bulk deal in the company's shares.",
            "Sentiment": "neutral",
            "PublishDate": 1758016136710,
            "Source": "order&deals"
        },
        {
            "Title": "Deepak Nitrite Subsidiary Issues ₹34 Crore Preference Shares to Sister Company",
            "Summary": "Deepak Chem Tech Limited issued and allotted 34,00,000 9% Optionally Convertible Redeemable Preference Shares worth ₹34 crores to Deepak Phenolics Limited. Both companies are wholly owned subsidiaries of Deepak Nitrite Limited. The shares were issued at par value of ₹100 each on an arms-length basis. The fund infusion aims to strengthen Deepak Chem Tech's capital base and support project expenses and general corporate purposes. Deepak Chem Tech operates a fluorination plant and has been pursuing projects across various sites in Gujarat. The company reported a turnover of ₹9.43 crores in FY 2024-25, up from ₹0.86 crores in FY 2023-24. After this allotment, Deepak Nitrite continues to hold 100% equity share capital of Deepak Chem Tech.",
            "Sentiment": "positive",
            "PublishDate": 1756988520621,
            "Source": "corporate_action"
        },
        {
            "Title": "Deepak Nitrite Subsidiary Allocates ₹68 Crore to Deepak Phenolics for Capital Boost",
            "Summary": "Deepak Chem Tech, a subsidiary of Deepak Nitrite, has allocated ₹68 crore of 9% Optionally Convertible Cumulative Preference Shares (OCRPS) to Deepak Phenolics. The allocation aims to boost capital and support project costs. Deepak Chem Tech operates an advanced fluorination plant and is working on several projects in Gujarat. The investment is intended to prepare the company for growth in the specialty chemicals sector.",
            "Sentiment": "positive",
            "PublishDate": 1755519390989,
            "Source": "corporate_action"
        },
        {
            "Title": "Deepak Nitrite Reports Decline in Q1 Financial Performance",
            "Summary": "Deepak Nitrite reported consolidated net profit of 1.12 billion rupees for Q1, down from 2 billion rupees in the same period last year. Revenue decreased to 18.9 billion rupees from 21.7 billion rupees year-over-year. EBITDA fell to 1.9 billion rupees compared to 3.1 billion rupees previously, while EBITDA margin compressed to 10% from 14.26% in the prior year period.",
            "Sentiment": "negative",
            "PublishDate": 1755093145565,
            "Source": "earnings"
        },
        {
            "Title": "Deepak Nitrite Pays ₹8.37 Lakh in Interest and Damages for Delayed Provident Fund Remittances",
            "Summary": "Deepak Nitrite Limited received two orders from the Assistant Provident Fund Commissioner, Bharuch for delayed remittance of Provident Fund amounts during March 2013 to April 2025. The company was ordered to pay interest of ₹3.04 lakh under Section 7Q and damages of ₹5.32 lakh under Section 14B of the Employees Provident Fund Act. The orders were dated August 5, 2025 and received by the company on August 6, 2025. Deepak Nitrite has deposited both the interest and damages amounts. The company stated there will be no material financial impact beyond the mentioned payments.",
            "Sentiment": "negative",
            "PublishDate": 1754565726717,
            "Source": "stock"
        },
        {
            "Title": "Deepak Nitrite Subsidiary Issues 500 Million Rupees Worth of OCRPS",
            "Summary": "Deepak Nitrite's subsidiary has issued Optionally Convertible Redeemable Preference Shares (OCRPS) valued at 500 million rupees to the company. This represents a financial transaction between the parent company and its subsidiary involving preference share instruments.",
            "Sentiment": "neutral",
            "PublishDate": 1753964618289,
            "Source": "corporate_action"
        },
        {
            "Title": "Deepak Nitrite Schedules Q1 FY26 Earnings Conference Call for August 14, 2025",
            "Summary": "Deepak Nitrite Limited has scheduled its Q1 FY26 earnings conference call for Thursday, August 14, 2025, at 4:00 PM IST. The call will be hosted by IIFL Capital and will cover the company's financial performance for the quarter ended June 30, 2025. Senior management participating includes Executive Director and CEO Maulik Mehta, Director-Finance & Group CFO Sanjay Upadhyay, and CFO Somsekhar Nanda. The company has provided pre-registration options and multiple dial-in numbers including universal and international toll-free numbers for various countries.",
            "Sentiment": "neutral",
            "PublishDate": 1753426366185,
            "Source": "earnings"
        },
        {
            "Title": "Deepak Nitrite Allocates ₹55 Crore Preference Shares to Deepak Phenolics",
            "Summary": "Deepak Nitrite has reported the allocation of preference shares worth ₹55 Crore to Deepak Phenolics. The company has also stated that the transaction for ₹55 Crore OCRPS (Optionally Convertible Redeemable Preference Shares) has been completed.",
            "Sentiment": "neutral",
            "PublishDate": 1752219554000,
            "Source": "default"
        },
        {
            "Title": "Deepak Nitrite Subsidiary Issues Preference Shares to Deepak Phenolics",
            "Summary": "A subsidiary of Deepak Nitrite has issued Optionally Convertible Redeemable Preference Shares worth ₹176 Crores to Deepak Phenolics. This transaction represents a significant financial move between the two related entities.",
            "Sentiment": "neutral",
            "PublishDate": 1749199554000,
            "Source": "default"
        },
        {
            "Title": "Deepak Nitrite: Mixed Analyst Ratings Amid Valuation Concerns",
            "Summary": "Morgan Stanley maintains 'Overweight' rating with ₹2,421 target. Nuvama revises target to ₹2,073, retains 'Hold'. Motilal Oswal downgrades to 'Sell' with ₹1,650 target, citing expensive valuations. Emkay Global maintains 'Reduce' rating. Company reports strong volumes across segments, expects improved spreads in Q1FY26. Projects worth ₹2,200 crore set for FY26 commissioning.",
            "Sentiment": "neutral",
            "PublishDate": 1748573813000,
            "Source": "normal_news"
        },
        {
            "Title": "Deepak Nitrite Ltd: Q4 Revenue Grows, Net Profit Declines",
            "Summary": "Deepak Nitrite's Q4 FY2025 results show 2.5% revenue growth to Rs 2,179.69 crore and 5% Ebitda increase to Rs 316.51 crore. However, net profit declined 20% to Rs 202.41 crore. Share price gained 4.74% following the announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1748490928000,
            "Source": "earnings"
        },
        {
            "Title": "Deepak Nitrite Ltd: Q4 Profit Drops 20% Despite Marginal Revenue Growth",
            "Summary": "Deepak Nitrite reported a 20.3% YoY decline in Q4 consolidated net profit to ₹202.4 crore. Revenue rose 2.4% to ₹2,179.7 crore. EBITDA increased 5% to ₹316.5 crore with margins improving to 14.52%. Board recommends final dividend of ₹7.50 per share for FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1748436637000,
            "Source": "earnings"
        },
        {
            "Title": "Deepak Nitrite Q4 Results and Dividend Announcement",
            "Summary": "Deepak Nitrite has reported its Q4 financial results. The company's consolidated net profit was 2 billion rupees, down from 2.54 billion rupees year-over-year but up from 980 million rupees quarter-over-quarter. Revenue increased to 21.8 billion rupees from 21.26 billion rupees year-over-year. EBITDA rose to 3.2 billion rupees from 3.01 billion rupees year-over-year, with EBITDA margin improving to 14.50% from 14.16%. The company has recommended a dividend of 7.5 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1748435385000,
            "Source": "result"
        },
        {
            "Title": "Deepak Nitrite to Consider Q4 Results on May 28",
            "Summary": "Deepak Nitrite has announced that it will consider and approve its financial results for the fourth quarter on May 28.",
            "Sentiment": "neutral",
            "PublishDate": 1747048294000,
            "Source": "default"
        },
        {
            "Title": "Government Amends Ammonium Nitrate Manufacturing Rules",
            "Summary": "The Indian government has amended the rules for ammonium nitrate manufacturing. The key change is that manufacturing licenses can now be granted for 10 years instead of the previous 5-year term. This amendment affects companies involved in ammonium nitrate production, such as Deepak Nitrite.",
            "Sentiment": "positive",
            "PublishDate": 1745220960000,
            "Source": "default"
        },
        {
            "Title": "Deepak Nitrite's Subsidiary Issues Optionally Convertible Redeemable Preference Shares",
            "Summary": "Deepak Chem Tech, a subsidiary of Deepak Nitrite, has issued Optionally Convertible Redeemable Preference Shares (OCRPS) worth 1.63 billion rupees to Deepak Phenolics.",
            "Sentiment": "neutral",
            "PublishDate": 1744848341000,
            "Source": "default"
        },
        {
            "Title": "Deepak Nitrite Subsidiary Issues Optionally Convertible Redeemable Preference Shares",
            "Summary": "Deepak Chem Tech, a subsidiary of Deepak Nitrite, has issued Optionally Convertible Redeemable Preference Shares (OCRPS) worth 1.63 billion rupees to Deepak Phenolics.",
            "Sentiment": "neutral",
            "PublishDate": 1744816602000,
            "Source": "default"
        },
        {
            "Title": "Phenol Imports Surge Impacts Deepak Nitrite's Margins",
            "Summary": "Axis Capital reports a significant increase in phenol imports in 2025, leading to a demand-supply imbalance. The price divergence between domestic and global phenol prices is expected to negatively impact margins for companies like Deepak Nitrite.",
            "Sentiment": "negative",
            "PublishDate": 1744347714000,
            "Source": "normal_news"
        },
        {
            "Title": "Deepak Nitrite: Earnings Miss and Project Delays Impact Stock Performance",
            "Summary": "Deepak Nitrite's stock fell 22% in 2025, with a 13% drop after Q3 results. Q3 earnings were below expectations due to order deferrals, maintenance shutdowns, and lower margins. Key projects, including the nitric acid plant, are delayed to H1 FY26. Q3 revenue decreased 5.3% YoY, EBITDA fell 40%, and net profit declined 51%. Analysts have revised FY26 and FY27 EPS estimates downward by 16-17%.",
            "Sentiment": "negative",
            "PublishDate": 1742257633000,
            "Source": "earnings"
        },
        {
            "Title": "Deepak Nitrite Added to F&O Ban List",
            "Summary": "Deepak Nitrite (DEEPAKNTR) has been placed in the futures and options (F&O) ban list. This typically occurs when a stock crosses 95% of the market-wide position limit in F&O contracts, restricting further positions to be taken in its derivatives.",
            "Sentiment": "neutral",
            "PublishDate": 1739751749000,
            "Source": "normal_news"
        },
        {
            "Title": "Deepak Nitrite: Stock Plummets on Weak Q3 Results",
            "Summary": "Deepak Nitrite's shares hit a 15-month low, falling 13% after reporting disappointing Q3 earnings. Revenue decreased by 5.3% YoY, Ebitda dropped 44.7%, and net profit fell 51.5%. Ebitda margin contracted from 15.2% to 8.9%.",
            "Sentiment": "negative",
            "PublishDate": 1739511379000,
            "Source": "earnings"
        },
        {
            "Title": "Deepak Nitrite Reports Decline in Q3 Financial Performance",
            "Summary": "Deepak Nitrite has reported its financial results for the third quarter. The company's consolidated net profit decreased to 981 million rupees, compared to 2 billion rupees in the same quarter of the previous year. Revenue also saw a decline, falling to 19 billion rupees from 20.1 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739492203000,
            "Source": "earnings"
        },
        {
            "Title": "Deepak Nitrite Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Deepak Nitrite, a chemical manufacturing company, has reported a significant decrease in its third-quarter EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization). The EBITDA fell to 1.68 billion rupees from 3.06 billion rupees in the same quarter of the previous year. Additionally, the company's EBITDA margin contracted to 8.83% from 15.23% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739457818000,
            "Source": "earnings"
        },
        {
            "Title": "Deepak Nitrite Reports Decline in Q3 FY24 Financial Performance",
            "Summary": "Deepak Nitrite, a chemical manufacturing company, has reported its financial results for the third quarter of the fiscal year. The company's consolidated net profit decreased to 981 million rupees from 2 billion rupees in the same quarter of the previous year. Revenue also saw a decline, falling to 19 billion rupees from 20.1 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739457811000,
            "Source": "earnings"
        },
        {
            "Title": "Deepak Nitrite: Motilal Oswal Midcap Fund Halves Stake",
            "Summary": "Motilal Oswal Midcap Fund sold 7.6 lakh shares (0.55%) of Deepak Nitrite at ₹2,653.22 per share on Tuesday, reducing its stake by half. The stock closed 4.5% lower at ₹2,636.",
            "Sentiment": "negative",
            "PublishDate": 1733276493000,
            "Source": "block_deals"
        },
        {
            "Title": "Deepak Nitrite Ltd: Block Trade of 98,928 Shares Worth Rs. 27.26 Crores on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) involving Deepak Nitrite Ltd. The transaction involved approximately 98,928 shares, valued at Rs. 27.26 crores. The shares were traded at a price of Rs. 2,755.05 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1733207732000,
            "Source": "block_deals"
        },
        {
            "Title": "Deepak Nitrite: Phenolics Boost Q2 Results, AI Segment Lags",
            "Summary": "Deepak Nitrite's Q2 results show strong performance in the phenolics segment, while the AI (Advanced Intermediates) segment's turnaround is expected to take more time, according to a Systematix report.",
            "Sentiment": "neutral",
            "PublishDate": 1731901483000,
            "Source": "result"
        },
        {
            "Title": "Deepak Nitrite Announces ₹5,000 Crore Investment Project",
            "Summary": "Deepak Nitrite has announced a new project requiring an investment of approximately ₹5,000 crores. The project will involve developing greenfield infrastructure and other capital expenditures. Funding for the project will be raised through a combination of debt and equity. The company notes that the project is subject to the completion of detailed engineering work.",
            "Sentiment": "positive",
            "PublishDate": 1731506732000,
            "Source": "corporate_action"
        },
        {
            "Title": "Deepak Nitrite's Subsidiary to Acquire Polycarbonate Technology and Assets",
            "Summary": "Deepak Nitrite's subsidiary, Deepak Chem Tech, is set to acquire technology and manufacturing assets for polycarbonate resins. The company plans to undertake a project to manufacture these resins, indicating an expansion into new product lines.",
            "Sentiment": "positive",
            "PublishDate": 1731506719000,
            "Source": "corporate_action"
        },
        {
            "Title": "Deepak Nitrite Reports Q2 Financial Results",
            "Summary": "Deepak Nitrite has announced its Q2 financial results. The company's EBITDA for the quarter was 2.98 billion rupees, compared to 3 billion rupees in the same quarter last year. The EBITDA margin for Q2 was 14.64%, down from 17% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1731504850000,
            "Source": "result"
        },
        {
            "Title": "Deepak Nitrite Reports Q2 Revenue Growth",
            "Summary": "Deepak Nitrite, a chemical manufacturing company, has reported a revenue of 20.3 billion rupees for the second quarter, compared to 17.78 billion rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731504704000,
            "Source": "result"
        },
        {
            "Title": "Deepak Nitrite Reports Q2 Consolidated Net Profit",
            "Summary": "Deepak Nitrite announced its Q2 consolidated net profit of 1.94 billion rupees, showing a decrease from 2.1 billion rupees year-over-year and a slight decrease from 2 billion rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1731504664000,
            "Source": "result"
        },
        {
            "Title": "Deepak Nitrite Secures Long-Term Supply Agreement with Petronet LNG",
            "Summary": "Deepak Nitrite's subsidiary has finalized a 15-year agreement with Petronet LNG Limited for the supply of propylene and hydrogen. This long-term contract signifies a strategic partnership and ensures a stable supply chain for key raw materials.",
            "Sentiment": "positive",
            "PublishDate": 1730164735000,
            "Source": "corporate_action"
        }
    ]
}