{
    "Symbol": "DEEPAKFERT",
    "ISIN": "INE501A01019",
    "News": [
        {
            "Title": "Deepak Fertilisers Subsidiary Faces ₹3.46 Cr Tax Demand",
            "Summary": "DMSL receives income tax demand of ₹3,45,75,555 from Deputy Commissioner for AY 2024-25 over depreciation disallowance on intangible assets. Company plans to challenge order citing favorable tribunal precedent.",
            "Sentiment": "negative",
            "PublishDate": 1770038558254,
            "Source": "stocks"
        },
        {
            "Title": "Deepak Fertilisers Announces Postal Ballot Results",
            "Summary": "Deepak Fertilisers & Petrochemicals announces successful completion of postal ballot with all four special resolutions passed through remote e-voting on January 31st, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769882418487,
            "Source": "co_actions_results"
        },
        {
            "Title": "Deepak Fertilisers Independent Director Tenure Ends",
            "Summary": "Mrs. Varsha Vasant Purandare ceases to be Independent Director of Deepak Fertilisers & Petrochemicals on January 30, 2026, after completing her second consecutive two-year term.",
            "Sentiment": "neutral",
            "PublishDate": 1769792133778,
            "Source": "stocks"
        },
        {
            "Title": "Deepak Fertilisers Schedules Q3FY26 Earnings Call",
            "Summary": "Deepak Fertilisers & Petrochemicals has scheduled an earnings conference call for January 30, 2026, at 4:00 PM IST to discuss Q3FY26 financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768995379905,
            "Source": "co_actions_results"
        },
        {
            "Title": "Deepak Fertilisers Receives Tax Penalty Order",
            "Summary": "Deepak Fertilisers & Petrochemicals receives penalty order from Joint Commissioner of State Tax with total demand of ₹95.61 crores. Company plans to challenge the order at appropriate forum.",
            "Sentiment": "negative",
            "PublishDate": 1768381187749,
            "Source": "stocks"
        },
        {
            "Title": "Deepak Fertilisers Wins Tax Appeals Worth ₹215 Cr",
            "Summary": "Deepak Fertilisers & Petrochemicals Corporation receives favorable ruling from Commissioner of Income Tax (Appeals) for disputed taxable income of ₹215 crores covering assessment years 2013-14 to 2018-19.",
            "Sentiment": "positive",
            "PublishDate": 1767943505856,
            "Source": "stocks"
        },
        {
            "Title": "Deepak Fertilisers Resolves Regulatory Matter",
            "Summary": "Deepak Fertilisers and Petrochemicals Corporation receives final order from Regional Director after paying ₹35.50 lakh compounding fees, resolving alleged non-disclosure violations under Companies Act 2013.",
            "Sentiment": "positive",
            "PublishDate": 1767348910784,
            "Source": "stocks"
        },
        {
            "Title": "Deepak Fertilisers Subsidiary Faces ₹1.84 Cr Tax Demand",
            "Summary": "Mahadhan AgriTech Limited, wholly owned subsidiary of Deepak Fertilisers, receives tax demand order of ₹1.84 crores from Karnataka Commercial Tax authorities over input tax credit disallowance.",
            "Sentiment": "negative",
            "PublishDate": 1767181276293,
            "Source": "stocks"
        },
        {
            "Title": "Deepak Fertilisers Faces ₹5.28 Cr Tax Penalty Order",
            "Summary": "Deepak Fertilisers receives penalty order of ₹5.28 crores from Deputy Commissioner of State Tax for FY 2021-22, plans to challenge the demand citing no material impact on operations.",
            "Sentiment": "negative",
            "PublishDate": 1767176141790,
            "Source": "stocks"
        },
        {
            "Title": "Deepak Fertilisers shares surge 5% amid recovery",
            "Summary": "Deepak Fertilisers & Petrochemicals shares rallied 5.1% to ₹1,270.20 after recent decline, with Q2 FY26 revenue growing 10.1% YoY to ₹3,033 crore despite muted annual performance.",
            "Sentiment": "positive",
            "PublishDate": 1767158545880,
            "Source": "stocks"
        },
        {
            "Title": "Deepak Fertilisers Announces Postal Ballot for Directors",
            "Summary": "Deepak Fertilisers & Petrochemicals seeks shareholder approval for appointment of Dr. Purvi Mehta Bhatt as Independent Woman Director and re-appointment of three Independent Directors through postal ballot.",
            "Sentiment": "neutral",
            "PublishDate": 1767022201694,
            "Source": "stocks"
        },
        {
            "Title": "Deepak Fertilisers Subsidiary Faces ₹19.58 Cr IT Demand",
            "Summary": "Deepak Fertilisers' subsidiary Mahadhan AgriTech receives income tax demand order of ₹19.58 crores for AY 2022-23. Company expects to challenge the order successfully based on past ITAT rulings.",
            "Sentiment": "neutral",
            "PublishDate": 1766742745677,
            "Source": "stocks"
        },
        {
            "Title": "Deepak Fertilisers Receives Fresh IT Demand of ₹21.51 Cr",
            "Summary": "Deepak Fertilisers receives additional income tax demand of ₹21.51 crores from CPC Bengaluru for AY 2024-25, with company expecting no financial impact as assessment proceedings continue.",
            "Sentiment": "neutral",
            "PublishDate": 1766489972826,
            "Source": "stocks"
        },
        {
            "Title": "Deepak Fertilisers Receives Compounding Orders for Alleged Disclosure Violations, Pays Rs. 35.50 Lakh Fee",
            "Summary": "Deepak Fertilisers received interim compounding orders from the Regional Director for alleged non-disclosure of immovable property, investments and contingent liabilities under Section 129 of Companies Act 2013 for financial years 2017-18 to 2021-22. The company paid a total compounding fee of Rs. 35.50 lakh (Rs. 17.75 lakh each for Chairman Managing Director and ex-Chief Financial Officer) with the authority finding it an unintentional technical non-compliance issue.",
            "Sentiment": "neutral",
            "PublishDate": 1764763976170,
            "Source": "corporate_governance"
        },
        {
            "Title": "Deepak Fertilisers Receives Relief in CGST Appeal, Penalty Reduced by 90%",
            "Summary": "Joint Commissioner (CGST Appeals) Rajkot disposed of Deepak Fertilisers' appeals against a demand order for July 2017-March 2018, reducing penalty from Rs. 1,82,88,216 to Rs. 18,28,821 and setting aside interest of Rs. 4,57,129. The company plans to challenge the order before GST Tribunal, maintaining that the demand is not tenable and should be set aside in further appeal.",
            "Sentiment": "positive",
            "PublishDate": 1764746063473,
            "Source": "stock"
        },
        {
            "Title": "Deepak Fertilisers Subsidiary Approves Rs 75 Crore Investment in Agriculture-Focused Alternative Investment Fund",
            "Summary": "Mahadhan AgriTech Limited, a wholly owned subsidiary of Deepak Fertilisers, approved investment of up to Rs 75 crores in SOA Fund-Series I, a SEBI-registered Category II Alternative Investment Fund focused on agriculture. The investment aims to support MAL's transformation into a full-stack, farmer-centric agritech player while providing access to innovative agri-business models with lower capital outlay and risk.",
            "Sentiment": "positive",
            "PublishDate": 1764315604811,
            "Source": "corporate_action"
        },
        {
            "Title": "SBI Mutual Fund Acquires 5.03% Stake in Deepak Fertilisers & Petrochemicals",
            "Summary": "SBI Mutual Fund acquired 2,09,600 shares of Deepak Fertilisers & Petrochemicals Corporation Ltd on November 11, 2025, through market purchase. This acquisition increased SBI Mutual Fund's total holding to 63,48,107 shares, representing 5.0287% of the company's paid-up share capital. Prior to this acquisition, SBI Mutual Fund held 61,38,507 shares (4.9627% stake). The acquisition crossed the 5% threshold, triggering disclosure requirements under SEBI regulations. Deepak Fertilisers has a total equity share capital of Rs. 126.24 crore consisting of 12,62,37,825 equity shares with a face value of Rs. 10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1763011171699,
            "Source": "corporate_action"
        },
        {
            "Title": "Deepak Fertilisers Reports 9% Revenue Growth in Q2 FY26 Despite Margin Pressure",
            "Summary": "Deepak Fertilisers and Petrochemicals Corporation reported operating revenue of INR 3,006 crores for Q2 FY26, marking 9% year-on-year growth. However, operating EBITDA margins declined from 18% to 15%. The company's TAN business showed strong performance with 29% volume growth, while Crop Nutrition business grew 54%. For H1 FY26, operating revenue increased 13% to INR 5,665 crores with net profit rising 11% to INR 458 crores. The Chemicals segment faced challenges with IPA and Ammonia businesses declining 21% year-on-year due to global price volatility and oversupply issues. The company completed full acquisition of Platinum Blasting Services in Australia at 6.7x EBITDA multiple for INR 537 crores enterprise value. Two major projects are progressing - TAN project at Gopalpur reached 87% completion and Nitric Acid project at Dahej hit 70% completion, both expected to commission by end of Q4 FY26. Net debt-to-EBITDA stands at 1.74x with peak debt expected to reach INR 4,500 crores. The company's specialty products now contribute 22% of H1 revenues, with Crop Nutrition leading through crop-specific NPK grades.",
            "Sentiment": "neutral",
            "PublishDate": 1762964650583,
            "Source": "earnings"
        },
        {
            "Title": "Deepak Fertilisers Reports 9% Revenue Growth in Q2 FY26, Completes Full Acquisition of Australian Subsidiary",
            "Summary": "Deepak Fertilisers and Petrochemicals Corporation Limited reported 9% year-over-year growth in operating revenue for Q2 FY26, reaching Rs 3,006 crores. Half-year revenue grew 13% to Rs 5,665 crores. Net profit remained flat at Rs 214 crores for the quarter but increased 11% for the half-year to Rs 458 crores. The company completed full acquisition of Platinum Blasting Services, its Australian subsidiary, which delivered Rs 533 crores in revenue and Rs 80 crores in EBITDA in FY25. The fertilizer business showed strong performance with 36% year-over-year growth, while the chemicals segment declined 21% due to headwinds in IPA and Ammonia businesses. Specialty products now comprise 28% of the crop nutrition business revenue. The company's expansion projects at Gopalpur (TAN) and Dahej (Nitric Acid) are 87% and 70% complete respectively, with commissioning expected by end of FY26.",
            "Sentiment": "positive",
            "PublishDate": 1762337217446,
            "Source": "earnings"
        },
        {
            "Title": "Deepak Fertilizers Reports Mixed Q2 Results with Revenue Growth but EBITDA Decline",
            "Summary": "Deepak Fertilizers and Petrochemicals Corporation reported Q2 consolidated net profit of 2.13 billion rupees compared to 2.1 billion rupees in the same period last year. Revenue increased to 30 billion rupees from 27.47 billion rupees year-over-year. However, EBITDA declined to 4.64 billion rupees from 4.94 billion rupees, with EBITDA margin dropping to 15.42% from 17.99% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762335368311,
            "Source": "earnings"
        },
        {
            "Title": "Deepak Fertilisers Subsidiary Acquires Full Ownership of Australian Mining Company",
            "Summary": "Deepak Mining Solutions Limited (DMSL), a wholly owned subsidiary of Deepak Fertilisers and Petrochemicals Corporation Limited, has increased its shareholding in Australian subsidiary Platinum Blasting Services Pty Limited (PBSPL) from 85% to 100%. DMSL acquired the remaining shares from existing shareholders for 10,699,325 AUD (equivalent to INR 62.80 crores). The transaction was valued using an earnings multiple methodology based on a valuation report from a Big Four accounting firm in Australia. PBSPL, which operates in mining chemicals manufacturing and provides mining solutions across the mining value chain, has now become a wholly owned subsidiary of DMSL. The share transfer approval was received on November 5th, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762323978384,
            "Source": "corporate_action"
        },
        {
            "Title": "Deepak Fertilisers Subsidiary Faces Rs 28.79 Crore GST Demand Order",
            "Summary": "Deepak Fertilisers and Petrochemicals Corporation disclosed that its wholly owned subsidiary Mahadhan Agri Tech Limited received a GST demand order from Maharashtra's Joint Commissioner of State Tax. The order demands Rs 28.79 crore, comprising tax of Rs 12.94 crore, interest of Rs 14.56 crore, and penalty of Rs 1.29 crore for the period July 2017 to March 2018. The demand relates to inadmissibility of credit claimed in GSTR3B compared to credit quantum reflected on the GST portal. The company stated there is no material impact on financials or operations, and that the subsidiary believes the demand is not tenable and will challenge the order at an appropriate forum.",
            "Sentiment": "negative",
            "PublishDate": 1761928649904,
            "Source": "stock"
        },
        {
            "Title": "Deepak Fertilisers Invests ₹13.18 Crore in Renewable Energy Projects with Sunsure Energy",
            "Summary": "Deepak Fertilisers has signed agreements with Sunsure Energy for renewable energy investments totaling ₹13.18 crore. The investment comprises ₹4.78 crore for solar power and ₹8.40 crore for wind power projects. Through these investments, Deepak Fertilisers will secure a 26% stake in captive renewable projects intended for the company's power consumption needs.",
            "Sentiment": "positive",
            "PublishDate": 1757521190920,
            "Source": "stock"
        },
        {
            "Title": "Russia Could Supply 5 Million Tons of Fertilizers to India and China",
            "Summary": "Russia has the potential to provide 5 million tons of fertilizers to India and China, according to TASS reports. This development relates to Deepak Fertilizers in the context of potential fertilizer supply arrangements between Russia and these Asian markets.",
            "Sentiment": "neutral",
            "PublishDate": 1756713938898,
            "Source": "stock"
        },
        {
            "Title": "GST Council May Consider 12% Uniform Tax Rate on Fertilizers and Inputs",
            "Summary": "The GST Council could potentially consider implementing a uniform 12% tax rate on fertilizers and inputs by September. This development would affect Deepak Fertilizers and the broader fertilizer industry's tax structure.",
            "Sentiment": "neutral",
            "PublishDate": 1754468925057,
            "Source": "stock"
        },
        {
            "Title": "Deepak Fertilisers Reports 17% Revenue Growth and 22% Profit Jump in Q1 FY26",
            "Summary": "Deepak Fertilisers and Petrochemicals Corporation Limited reported strong quarterly results with operational revenue of Rs. 2,659 crores, marking a 17% year-on-year increase. Net profit grew 22% to Rs. 244 crores with a PAT margin of 9.1%. EBITDA reached Rs. 513 crores, up 10% year-on-year, with margins improving to 19.3%. The company reduced net debt by Rs. 225 crores, improving the net debt-to-EBITDA ratio from 1.72x to 1.5x. Specialty products now contribute 25% of revenue, with crop nutrition business showing strong traction. The company invested Rs. 377 crores in CAPEX during the quarter. Two major projects - Gopalpur TAN project (80% complete) and Dahej acid project (57% complete) - are expected to commence operations by Q4 FY26. The fertilizer segment delivered 125% year-on-year growth driven by higher value-added products. Export quota for TAN was increased to 50,000 metric tonnes per year. The company received a favorable ITAT ruling eliminating tax demand of Rs. 581 crores for Mahadhan Agritech Limited.",
            "Sentiment": "positive",
            "PublishDate": 1754311782085,
            "Source": "earnings"
        },
        {
            "Title": "Deepak Fertilisers Reports 17% Revenue Growth in Q1 FY26, Wins Tax Appeals Worth Rs 581 Crore",
            "Summary": "Deepak Fertilisers And Petrochemicals Corporation Limited reported quarterly results for the period ended June 30, 2025, showing operating revenue of Rs 2,659 crore, up 17% year-on-year. Operating EBITDA increased 10% to Rs 513 crore, while net profit grew 22% to Rs 244 crore. The company operates across three verticals: Industrial Chemicals (21% of revenue), Mining Chemicals (25% of revenue), and Crop Nutrition Business (48% of revenue). The Income Tax Appellate Tribunal in Mumbai ruled in favor of Mahadhan AgriTech Limited, the company's material subsidiary, for tax appeals covering assessment years 2016-17 to 2020-21, totaling Rs 581 crore. Two major capacity expansion projects are underway - a TAN project at Gopalpur with 376 KTPA capacity and a Nitric Acid project at Dahej with 300 KTPA WNA and 150 KTPA CNA capacity, both expected to commission in Q4 FY26. The company's market capitalization stood at approximately $2.51 billion as of June 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753782656367,
            "Source": "earnings"
        },
        {
            "Title": "Deepak Fertilisers Forecasts Strong Kharif 2025 Season",
            "Summary": "Deepak Fertilisers expects a strong Kharif 2025 season, attributing the positive outlook to favorable weather conditions and increased farmer engagement. The company's prediction suggests improved business prospects for the upcoming cropping season.",
            "Sentiment": "positive",
            "PublishDate": 1753780755515,
            "Source": "stock"
        },
        {
            "Title": "Deepak Fertilisers Reports Higher Q1 Profit and Revenue Growth",
            "Summary": "Deepak Fertilisers & Petrochemicals Corporation reported Q1 consolidated net profit of 2.4 billion rupees compared to 1.96 billion rupees in the same period last year. The company's Q1 revenue increased to 26.6 billion rupees from 22.8 billion rupees year-over-year. EBITDA rose to 5.13 billion rupees from 4.64 billion rupees, though EBITDA margin declined to 19.30% from 20.36% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753780245163,
            "Source": "earnings"
        },
        {
            "Title": "Deepak Mining Solutions Revises Technical Ammonium Nitrate Project Cost to ₹2,675 Crores",
            "Summary": "Deepak Mining Solutions Limited, a wholly owned subsidiary of Deepak Fertilisers, has revised the estimated cost of its Technical Ammonium Nitrate Project in Gopalpur from ₹2,223 Crores to ₹2,675 Crores. The cost increase is attributed to geopolitical issues causing material price rises (Stainless Steel from ₹250/kg to ₹370/kg, Carbon Steel from ₹43/kg to ₹77/kg), increased manpower and construction costs, and currency variation (USD to INR from 74.55 to 85.13). Additional factors include investments in safety, efficiency and quality improvements, extra costs for Ammonia Pipeline development due to port ownership change from Shapoorji to Adani, and investments in Effluent Treatment Plan and Zero Liquid Discharge systems. The project is over 90% complete with requirements ordered/arrived, and the company states that costs are unlikely to see further revisions. Despite the cost increase, the company maintains that the project's financial metrics remain robust with IRR above internal threshold benchmarks.",
            "Sentiment": "neutral",
            "PublishDate": 1753725731037,
            "Source": "stock"
        },
        {
            "Title": "Deepak Fertilisers Schedules Q1FY26 Earnings Conference Call for July 30, 2025",
            "Summary": "Deepak Fertilisers and Petrochemicals Corporation Ltd has scheduled an earnings conference call on July 30, 2025, at 4:00 PM IST to discuss the company's Q1FY26 financial results and business outlook. The call will be led by key management including Chairman and Managing Director S C Mehta, President and CFO Subhash Anand, and other senior executives. The company will discuss its business strategy and outlook following the declaration of quarterly results for the period ended June 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753338157327,
            "Source": "earnings"
        },
        {
            "Title": "Deepak Fertilisers Adjusts Project Cost for WNA and CNA Plants in Dahej",
            "Summary": "Deepak Fertilisers has revised the project cost for its WNA (Weak Nitric Acid) and CNA (Concentrated Nitric Acid) plants in Dahej. The new cost is ₹71,982.79 crore, which is a slight increase from the previously reported ₹71,950 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1749545628000,
            "Source": "default"
        },
        {
            "Title": "Deepak Fertilisers Provides Guidance on Capex, Growth, and Debt Expectations",
            "Summary": "Deepak Fertilisers has shared several guidance points during a concall update. The company expects total capex for FY26 to be around INR4,500 crore, with INR1,400 crore already capitalized. For the current year, they anticipate single-digit volume growth driven by debottlenecking, with margin expansions playing a larger role than volume growth. The company expects improved results in FY26 compared to FY25. Regarding debt, Deepak Fertilisers expects to reach peak debt levels of around INR5,000 crore. They project a normal ramp-up of 70% in the first year, with ROCE increasing to 80-85% thereafter.",
            "Sentiment": "positive",
            "PublishDate": 1748230401000,
            "Source": "default"
        },
        {
            "Title": "Deepak Fertilisers Reports Q4 Results and Declares Dividend",
            "Summary": "Deepak Fertilisers & Petrochemicals Corporation announced its Q4 financial results. The company's EBITDA increased to 4.8 billion rupees from 4.4 billion rupees year-over-year. However, the EBITDA margin decreased to 18% from 20.99% in the same period. Revenue rose to 27 billion rupees from 20.9 billion rupees year-over-year. Additionally, the company declared a dividend of 10 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747907033000,
            "Source": "result"
        },
        {
            "Title": "Deepak Fertilisers Reports Q4 Profit Increase",
            "Summary": "Deepak Fertilisers & Petrochemicals Corporation reported a consolidated net profit of 2.77 billion rupees for the fourth quarter, compared to 2.25 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1747906947000,
            "Source": "result"
        },
        {
            "Title": "Deepak Fertilisers to Consider Q4 Results on May 22",
            "Summary": "Deepak Fertilisers and Petrochemicals Corporation Limited has announced that it will consider its fourth quarter financial results on May 22. This indicates the company is preparing to disclose its performance for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1746532998000,
            "Source": "default"
        },
        {
            "Title": "Mahadhan Agritech Allots ₹400 Cr Shares to Parent Deepak Fertilisers",
            "Summary": "Mahadhan Agritech, a subsidiary of Deepak Fertilisers and Petrochemicals Corporation, has allocated shares worth ₹400 crore to its parent company on a rights basis. This move represents a significant corporate action, potentially strengthening the financial position of the subsidiary and demonstrating the parent company's commitment to its growth.",
            "Sentiment": "positive",
            "PublishDate": 1745945322000,
            "Source": "default"
        },
        {
            "Title": "Deepak Fertilisers Establishes New Subsidiary in Singapore",
            "Summary": "Deepak Fertilisers and Petrochemicals Corporation Limited has incorporated a wholly-owned subsidiary in Singapore. This strategic move suggests the company is expanding its international presence and potentially exploring new business opportunities in the Southeast Asian market.",
            "Sentiment": "positive",
            "PublishDate": 1745413551000,
            "Source": "default"
        },
        {
            "Title": "Government Extends Ammonium Nitrate Manufacturing License Duration",
            "Summary": "The Indian government has amended the Ammonium Nitrate Manufacturing Rules, extending the duration of manufacturing licenses from 5 years to 10 years. This change affects companies in the fertilizer and petrochemical industry, such as Deepak Fertilizers and Petrochemicals.",
            "Sentiment": "positive",
            "PublishDate": 1745221047000,
            "Source": "default"
        },
        {
            "Title": "Deepak Fertilisers & Petrochemicals Corp. Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) involving Deepak Fertilisers & Petrochemicals Corp. Ltd. The transaction involved approximately 509,612 shares, traded at a price of Rs. 1154.00 per share. The total value of the block trade amounted to Rs. 58.81 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1742794319000,
            "Source": "block_deals"
        },
        {
            "Title": "Deepak Mining Increases Stake in Platinum Blasting Services",
            "Summary": "Deepak Mining, a subsidiary of Deepak Fertilisers, has increased its stake in Platinum Blasting Services to 85%. The acquisition cost was reported to be 11.78 million Australian dollars.",
            "Sentiment": "positive",
            "PublishDate": 1739798369000,
            "Source": "corporate_action"
        },
        {
            "Title": "Deepak Fertilisers Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "Deepak Fertilisers and Petrochemicals Corporation Limited has reported a substantial increase in its consolidated net profit for the third quarter. The company's net profit rose to 2.5 billion rupees, compared to 605 million rupees in the same period last year, representing a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738139839000,
            "Source": "earnings"
        },
        {
            "Title": "Deepak Fertilisers to Consider Q3 Results on January 29",
            "Summary": "Deepak Fertilisers and Petrochemicals Corporation Limited has announced that it will consider its financial results for the third quarter of the current fiscal year on January 29. This meeting is likely to involve the company's board of directors reviewing and approving the quarterly performance figures.",
            "Sentiment": "neutral",
            "PublishDate": 1737385612000,
            "Source": "earnings"
        },
        {
            "Title": "Deepak Fertilizers: Rs 3,000-Crore Ebitda Target Set for Next Three Years",
            "Summary": "Deepak Fertilizers and Petrochemicals Corp. aims to achieve Rs 3,000-crore Ebitda over the next three years, driven by new plant commissioning. Q2 net profit jumped 237% to Rs 214 crore, with revenue up 13% to Rs 2,747 crore. The company's TAN and nitric acid projects are in fast execution mode, expected to boost top and bottom lines upon commissioning in 1.5-2 years.",
            "Sentiment": "positive",
            "PublishDate": 1730609145000,
            "Source": "result"
        },
        {
            "Title": "Deepak Fertilisers Anticipates Demand Recovery in Q3",
            "Summary": "Deepak Fertilisers expects a demand recovery in the third quarter, supported by growth in coal, cement, and steel production. The company projects an increase in production to 2.2-2.3 million tons per annum, driven by growth in infrastructure and mining activities.",
            "Sentiment": "positive",
            "PublishDate": 1730346534000,
            "Source": "normal_news"
        },
        {
            "Title": "Deepak Fertilisers to Expand Nitric Acid Production Capacity",
            "Summary": "Deepak Fertilisers is expanding its nitric acid production capacity with a new project. The expansion includes 300 KTPA of Weak Nitric Acid (WNA) and 150 KTPA of Concentrated Nitric Acid (CNA). The project is expected to be commissioned in the second half of FY2026. Upon completion, this expansion will make Deepak Fertilisers the largest nitric acid manufacturer in Asia.",
            "Sentiment": "positive",
            "PublishDate": 1730255731000,
            "Source": "corporate_action"
        },
        {
            "Title": "Deepak Fertilisers Announces Rs 4,500 Crore Expansion Plan",
            "Summary": "Deepak Fertilisers has unveiled plans for a significant capital expenditure of Rs 4,500 crore to expand its Technical Ammonium Nitrate (TAN) and Nitric Acid production capacities. This information was shared in an investor presentation, indicating the company's strategic move to enhance its manufacturing capabilities in key product areas.",
            "Sentiment": "positive",
            "PublishDate": 1730255529000,
            "Source": "corporate_action"
        },
        {
            "Title": "Deepak Fertilisers Reports Record Quarterly Sales Volume in Bulk Fertilizer",
            "Summary": "Deepak Fertilisers has achieved a significant milestone in its bulk fertilizer business, reporting an 83% year-over-year increase in sales volume for manufactured bulk fertilizer. This marks the highest sales volume the company has ever recorded in a single quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730194456000,
            "Source": "result"
        },
        {
            "Title": "Deepak Fertilisers Reports Strong Q2 EBITDA Growth",
            "Summary": "Deepak Fertilisers & Petrochemicals Corporation has reported a significant increase in its Q2 EBITDA, rising to 4.9 billion rupees from 2.9 billion rupees year-over-year. The company's EBITDA margin also improved, reaching 17.99% compared to 15.23% in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730194398000,
            "Source": "result"
        },
        {
            "Title": "Deepak Fertilisers Reports Q2 Revenue Increase",
            "Summary": "Deepak Fertilisers has reported a revenue of 27.5 billion rupees for the second quarter, compared to 24.2 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730194356000,
            "Source": "result"
        }
    ]
}