{
    "Symbol": "DELPHIFX",
    "ISIN": "INE726L01019",
    "News": [
        {
            "Title": "Delphi World Money Board Meet on Feb 14, 2026",
            "Summary": "Delphi World Money Limited has scheduled a board meeting for February 14, 2026, to consider Q3FY26 unaudited financial results and discuss strategic business integration initiatives.",
            "Sentiment": "neutral",
            "PublishDate": 1770821857734,
            "Source": "co_actions_results"
        },
        {
            "Title": "Delphi World Money sets Feb 14 record date for split",
            "Summary": "Delphi World Money Limited announces February 14, 2026 as record date for 5:1 equity share split and 2:1 bonus issue following shareholder approval at December EGM.",
            "Sentiment": "positive",
            "PublishDate": 1770036692645,
            "Source": "co_actions_results"
        },
        {
            "Title": "Delphi World Money Limited Shareholders Approve Share Capital Restructuring and Bonus Issue",
            "Summary": "Delphi World Money Limited shareholders approved three resolutions at an Extra-Ordinary General Meeting including increasing authorized share capital, splitting face value from Rs. 10 to Rs. 2, and issuing bonus shares in 2:1 ratio. All resolutions passed with over 99% approval from shareholders, with 56 shareholders attending the video conference meeting out of 10,483 total shareholders on record date.",
            "Sentiment": "positive",
            "PublishDate": 1765194911563,
            "Source": "corporate_action"
        },
        {
            "Title": "Delphi World Money Limited Conducts EGM to Approve Share Capital Restructuring and Bonus Issue",
            "Summary": "Delphi World Money Limited held an Extraordinary General Meeting on December 6, 2025, to deliberate on increasing authorized share capital, subdividing equity shares from Rs. 10 to Rs. 2, and issuing bonus shares in 2:1 ratio. The meeting was conducted through video conferencing with e-voting facilities, affecting shareholders through potential capital restructuring and bonus share distribution.",
            "Sentiment": "neutral",
            "PublishDate": 1765009625605,
            "Source": "corporate_action"
        },
        {
            "Title": "Delphi World Money Issues Clarification Against Unauthorized Communication and Market Manipulation Claims",
            "Summary": "Delphi World Money clarified that an unauthorized communication dated November 27, 2025, purportedly from Bull Value Incorporated VCC Sub-Fund, misrepresented judicial proceedings and was circulated using illegally obtained investor data. The company stated its rights issue was completed in full compliance with regulations, shares are freely tradable, and the case file related to the status quo order has been withdrawn and assigned to another court.",
            "Sentiment": "negative",
            "PublishDate": 1764671256323,
            "Source": "corporate_governance"
        },
        {
            "Title": "Delphi World Money Reports Quarterly Results and Announces Major Corporate Actions",
            "Summary": "Delphi World Money Limited approved unaudited financial results for the quarter ended September 30, 2025, and announced an extraordinary general meeting on December 6, 2025, to approve increase in authorized share capital from Rs. 30 crores to Rs. 50 crores, stock split from Rs. 10 to Rs. 2 per share, and bonus issue in 2:1 ratio. The company also completed acquisition of 34.08% stake in Ebix Travels Private Limited through conversion of inter-company deposits worth Rs. 1,711.89 million into equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1763174086034,
            "Source": "corporate_action"
        },
        {
            "Title": "Delphi World Money Completes Rights Issue, Raises ₹99.76 Crores",
            "Summary": "Delphi World Money Limited has completed its rights issue of 52,23,295 equity shares at ₹191 per share, raising ₹99.76 crores. The rights issue was open from October 27, 2025 to November 07, 2025. The Rights Issue Committee approved the allotment on November 10, 2025. Following the allotment, the company's paid-up equity share capital increased from ₹11.13 crores to ₹16.35 crores, with total equity shares rising from 1,11,27,890 to 1,63,51,185 shares.",
            "Sentiment": "positive",
            "PublishDate": 1762821360897,
            "Source": "corporate_action"
        },
        {
            "Title": "Delphi World Money Launches Rights Issue to Fund Travel-Fintech Expansion",
            "Summary": "Delphi World Money Limited opened a rights issue of 52.23 lakh equity shares priced at ₹191 per share (₹10 face value + ₹181 premium). Eligible shareholders can subscribe to 23 equity shares for every 49 shares held. The issue opens October 27, 2025 and closes November 7, 2025, with November 3, 2025 as the last date for on-market renunciation. The company plans to use proceeds to strengthen its capital structure, support investments in Ebix Travels, and drive digital transformation across travel, forex, and remittance verticals. Delphi is an RBI-authorized Category II Authorized Dealer expanding beyond traditional forex and remittance services into a comprehensive travel-fintech platform. The company has acquired management control of Ebix Travels Private Limited, gaining access to MICE services, airline ticketing, tours, hotel bookings, and car rentals. Chairperson TC Guruprasad stated the rights issue represents a defining milestone to accelerate growth and create shareholder value as the company advances toward becoming a leading force in India's financial and travel services landscape.",
            "Sentiment": "positive",
            "PublishDate": 1761544295769,
            "Source": "corporate_action"
        },
        {
            "Title": "Delphi World Money Announces Rights Issue Opening and Closing Dates Through Newspaper Advertisements",
            "Summary": "Delphi World Money Limited has published pre-issue newspaper advertisements for its ongoing Rights Issue of equity shares. The company informed stock exchanges BSE and NSE about the publication of these advertisements on October 22, 2025. The advertisements announce the opening and closing dates of the Rights Issue and were published in Business Standard (English and Hindi editions) and Pratahkal (Marathi edition). The Rights Issue involves up to 52,23,295 fully paid equity shares at ₹191 per share, offered to eligible shareholders in a 23:49 ratio. The issue opens on October 27, 2025, and closes on November 7, 2025, with the last date for on-market renunciations being November 3, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761115820716,
            "Source": "corporate_action"
        },
        {
            "Title": "Delphi World Money to Lead Ebix Inc.'s Global Travel & Hospitality Consolidation",
            "Summary": "Delphi World Money Limited announced its role in leading Ebix Inc.'s global travel and hospitality consolidation initiative. The company has acquired a substantial equity stake and management control in Ebix Travels Private Limited, with plans to further enhance shareholding and explore eventual amalgamation. This transforms Delphi from a financial services company into a comprehensive travel ecosystem integrating forex expertise with travel services including airline ticketing, luxury experiences, holiday packages, and MICE services. Delphi operates as an RBI-authorized Category II Authorized Dealer. Ebix Travels operates the VIA.COM e-commerce platform across India, Philippines, Indonesia, Singapore and UAE, serves over 18,000 clients through a network of more than 50,000 agents, and operates the luxury Deccan Odyssey train. The company's strategic roadmap includes strengthening its equity position in Ebix Travels, pursuing operational integration, and driving growth through technology-enabled platforms.",
            "Sentiment": "positive",
            "PublishDate": 1758612793381,
            "Source": "order&deals"
        },
        {
            "Title": "Delphi World Money Limited Approves Rs. 100 Crore Rights Issue",
            "Summary": "Delphi World Money Limited's Board of Directors approved a rights issue to raise up to Rs. 100 crores through fully paid-up equity shares with a face value of Rs. 10 each. The board constituted a Rights Issue Committee to determine terms including quantum, entitlement ratio, issue price, record date, and timing. CARE Ratings Limited was appointed as the Monitoring Agency for the proposed rights issue. The number of securities will be determined after receiving in-principle approval from stock exchanges.",
            "Sentiment": "positive",
            "PublishDate": 1756384344382,
            "Source": "corporate_action"
        },
        {
            "Title": "Delphi World Money Reports ₹45.14 Million Net Profit for Q1 FY26, Approves Strategic Initiative with Ebix Travel",
            "Summary": "Delphi World Money Limited reported net profit after tax of ₹45.14 million for the quarter ended June 30, 2025, compared to ₹35.66 million in the same quarter last year. Total income decreased to ₹165.51 million from ₹197.84 million year-over-year. The board approved a strategic initiative involving Ebix Travel Private Limited to integrate business verticals and enhance consolidated oversight, which may include recharacterization of existing Inter-Corporate Deposits and further capital deployment. The company faces regulatory challenges including a ₹329.07 million penalty from the Enforcement Directorate for alleged FEMA violations, though management believes there will be no financial impact due to indemnities from erstwhile promoters. Outstanding Inter-Corporate Deposits total ₹1,559.71 million as of June 30, 2025, with ₹1,129.10 million due from Ebix Travels Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1755008859760,
            "Source": "earnings"
        },
        {
            "Title": "Delphi World Money Limited Shareholders Approve All Resolutions at 40th AGM",
            "Summary": "Delphi World Money Limited held its 40th Annual General Meeting on August 1, 2025, through video conferencing with 54 public shareholders in attendance. All agenda items were approved with the required majority, receiving 100% votes in favor across all resolutions. The company has 9,943 total shareholders on record date, with 8,368,072 votes polled representing 75.20% of outstanding shares. Key approvals included adoption of audited financial statements for the year ended March 31, 2025, re-appointment of Whole-Time Director Hariprasad Meenoth Panichikkil, re-appointment of T R Chadha & Co. LLP as statutory auditors, amendment in object clause of memorandum, increase in authorized share capital, approval for raising funds and securities issuance, and multiple related party transaction approvals with EbixCash World Money Limited, Ebix Money Express Private Limited, and Ebix Travels Private Limited for financial years 2025-26 and 2026-27. The company also appointed SRC & Co. as secretarial auditors. The remote e-voting period was conducted from July 29-31, 2025, with CS Rahul Khadriya serving as scrutinizer.",
            "Sentiment": "positive",
            "PublishDate": 1754316193296,
            "Source": "corporate_action"
        }
    ]
}