{
    "Symbol": "DELTAMAGNT",
    "ISIN": "INE393A01011",
    "News": [
        {
            "Title": "Delta Manufacturing Board Meet Set for Feb 12",
            "Summary": "Delta Manufacturing Limited has scheduled a board meeting on February 12, 2026, to consider and approve Q3FY26 financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770301918899,
            "Source": "co_actions_results"
        },
        {
            "Title": "Delta Manufacturing receives GST scrutiny notice",
            "Summary": "Delta Manufacturing Limited received a GST scrutiny notice from Maharashtra tax authorities for FY 2023-24 returns, with potential financial impact of Rs. 2,39,363.43. Company to respond by February 16, 2026.",
            "Sentiment": "negative",
            "PublishDate": 1769851967994,
            "Source": "stocks"
        },
        {
            "Title": "Delta Manufacturing Completes Hard Ferrite Division Closure",
            "Summary": "Delta Manufacturing Limited has completed the closure of its hard ferrite division at Ambad, Nashik facility in all aspects, following regulatory disclosure requirements under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769799053911,
            "Source": "stocks"
        },
        {
            "Title": "Delta Manufacturing Closes Hard Ferrite Division",
            "Summary": "Delta Manufacturing Limited announces closure of its hard ferrite division at Ambad, Nashik due to continuous losses of ₹8.83 crores in FY24-25. The division contributed ₹5.16 crores turnover.",
            "Sentiment": "negative",
            "PublishDate": 1766491392500,
            "Source": "stocks"
        },
        {
            "Title": "Delta Manufacturing Reports Quarterly Loss as Operations Continue to Struggle",
            "Summary": "Delta Manufacturing Limited posted a net loss for the quarter ended September 30, 2025, with both standalone and consolidated operations showing negative results across continuing and discontinued segments. The company's board approved the unaudited financial results on November 13, 2025, revealing ongoing challenges in its hard ferrites and textile business segments.",
            "Sentiment": "negative",
            "PublishDate": 1763067430912,
            "Source": "earnings"
        },
        {
            "Title": "Delta Manufacturing Limited Reports Q1 FY2026 Results and Reappoints Dr. Ram H. Shroff as Managing Director",
            "Summary": "Delta Manufacturing Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported a standalone loss of ₹154.62 lakhs compared to a loss of ₹258.03 lakhs in the same quarter last year. Revenue from operations declined to ₹1,431.67 lakhs from ₹1,578.31 lakhs year-over-year. The Board reappointed Dr. Ram H. Shroff as Managing Director and Executive Vice Chairman for three years from October 1, 2025 to September 30, 2028, subject to shareholder approval. The company scheduled its 43rd Annual General Meeting for September 29, 2025. Dr. Shroff, a qualified medical doctor with over 17 years of experience at Charak Pharma, has been Managing Director of Delta Manufacturing since 2012 and led significant operational expansions including increasing soft ferrite facility capacity from 7 MT/month to 140 MT/month.",
            "Sentiment": "neutral",
            "PublishDate": 1755009372310,
            "Source": "earnings"
        },
        {
            "Title": "Delta Manufacturing to Transfer Soft Ferrites Business and Reduce Stake in MMG Ferrites",
            "Summary": "Delta Manufacturing has announced plans to transfer its soft ferrites business and reduce its stake in MMG Ferrites to 50%. This move suggests a significant restructuring of the company's operations and ownership in its ferrites business segment.",
            "Sentiment": "neutral",
            "PublishDate": 1734582891000,
            "Source": "corporate_action"
        }
    ]
}