{
    "Symbol": "DELTACORP",
    "ISIN": "INE124G01033",
    "News": [
        {
            "Title": "Delta Corp Files for Business Split Approval",
            "Summary": "Delta Corp has filed with NCLT for approval to split its operations into two separate companies - one focused on gaming operations and another on hospitality and real estate businesses.",
            "Sentiment": "neutral",
            "PublishDate": 1768535263931,
            "Source": "co_actions_results"
        },
        {
            "Title": "Delta Corp Q3FY26 Results: Revenue Falls 22% YoY",
            "Summary": "Delta Corp reported Q3FY26 standalone revenue of ₹117.86 cr, down 21.5% YoY. Net profit declined 53.4% to ₹19.38 cr. Gaming operations revenue dropped to ₹103.81 cr from ₹135.79 cr YoY.",
            "Sentiment": "negative",
            "PublishDate": 1768492516498,
            "Source": "co_actions_results"
        },
        {
            "Title": "Delta Corp Q3 EBITDA Falls 25% to ₹240M, Margin Drops",
            "Summary": "Delta Corp's Q3 EBITDA declined 25% year-on-year to ₹240 million from ₹321 million, while EBITDA margin compressed to 15% from 16.53% in the corresponding quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1768492032222,
            "Source": "co_actions_results"
        },
        {
            "Title": "Delta Corp Board Meet Set for Jan 15 for Q3FY26 Results",
            "Summary": "Delta Corp Limited has scheduled a board meeting on January 15, 2026, to consider and approve Q3FY26 unaudited standalone and consolidated financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767882078630,
            "Source": "co_actions_results"
        },
        {
            "Title": "Delta Corp Unit to Cease Zuri White Sands Operations",
            "Summary": "Delta Corp announces that its unit will discontinue operations at the Zuri White Sands Goa Resort, marking a significant operational change for the hospitality segment.",
            "Sentiment": "negative",
            "PublishDate": 1767870633999,
            "Source": "stocks"
        },
        {
            "Title": "Delta Corp's Subsidiary Completes Acquisition of 107-Room Hotel in Alibaugh",
            "Summary": "Delta Penland Limited, a wholly owned subsidiary of Delta Corp Limited, has completed the acquisition of approximately 107 rooms hotel in Alibaugh, Maharashtra spread over approximately 2,239 square meter area. The company plans to undertake complete regularization, upgradation and renovation to meet market needs and company standards before making the hotel operational.",
            "Sentiment": "positive",
            "PublishDate": 1763133843589,
            "Source": "stock"
        },
        {
            "Title": "Delta Corp Reports ₹24.1 Crores Quarterly Profit Despite ₹378 Crores Loss on Online Gaming Investments",
            "Summary": "Delta Corp Limited reported quarterly results with net profit of ₹24.1 crores for the quarter ended September 30, 2025, compared to ₹43.87 crores in the same period last year. Gaming operations revenue declined to ₹122.74 crores from ₹136.06 crores year-over-year, while hospitality revenue dropped to ₹8.31 crores from ₹9.72 crores. The company recorded ₹378.34 crores as reduction in fair value of online gaming investments due to the Promotion and Regulation of Online Gaming Act, 2025, which prohibits online games involving real-money stakes. This resulted in carrying amounts of investments in Deltatech Gaming Limited, Head Digital Works Private Limited and Openplay Technologies Private Limited being reduced to nil. The company faces GST show cause notices totaling ₹28,207.30 crores for alleged short payment from July 2017 to November 2022, though management believes the demands are arbitrary and has challenged them legally. Basic earnings per share stood at ₹0.84 for the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1760541099823,
            "Source": "earnings"
        },
        {
            "Title": "Delta Corp Reports Mixed Q2 Results with Revenue Growth but Lower Profitability",
            "Summary": "Delta Corp reported quarterly revenue of 1.83 billion rupees compared to 1.8 billion rupees in the same period last year. However, the company's EBITDA declined to 400 million rupees from 485 million rupees year-over-year, with EBITDA margin dropping to 21.86% from 26.65%. Consolidated net profit also decreased to 251 million rupees from 270 million rupees compared to the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1760540333721,
            "Source": "earnings"
        },
        {
            "Title": "Delta Corp and Nazara Technologies Shares Fall Up to 7% After GST Council Imposes 40% Tax on Gaming",
            "Summary": "Shares of Delta Corp and Nazara Technologies declined after the GST Council approved a 40% tax on casinos, betting, and online money games. Delta Corp shares fell 7.2% to Rs 88.35, while Nazara Technologies dropped 1.6%. The GST Council introduced a new tax structure reducing the current four-rate system to two slabs of 5% and 18%, while adding a 40% rate for luxury and demerit goods including gaming activities. The new rates take effect from September 22. Delta Corp had recently shelved plans for a Rs 2,000-2,500 crore integrated resort project in Goa citing GST framework uncertainty. The company reported a 36.1% rise in net profit to Rs 29.4 crore in the June quarter, though EBITDA fell 16.2% to Rs 39.6 crore.",
            "Sentiment": "negative",
            "PublishDate": 1756964270611,
            "Source": "stock"
        },
        {
            "Title": "Delta Corp Shares Drop 9% Following Real Money Gaming Ban",
            "Summary": "Delta Corp shares declined 9% over three sessions following news of a ban on real money gaming (RMG). The stock is trading below its 50-day and 200-day moving averages of Rs 88 and Rs 97 respectively, and has fallen 34% over the past year. The Promotion and Regulation of Online Gaming Bill, 2025 bans online money gaming, impacting games like rummy and poker. This affects Delta Corp significantly as 94% of its revenue comes from gaming operations. In quarterly results, the company earned Rs 173 crore from gaming operations out of Rs 184 crore total net sales. Technical analysts expect the stock to consolidate between Rs 82.80 - Rs 96.20, with strong support at Rs 81. The ban on RMG and potential sin tax are viewed as setbacks for online gaming companies, with India's online gaming market valued at USD 4 billion expected to take a hit.",
            "Sentiment": "negative",
            "PublishDate": 1756184094011,
            "Source": "stock"
        },
        {
            "Title": "Delta Corp Issues Dividend Tax Guidelines for FY 24-25 Final Dividend Payment",
            "Summary": "Delta Corp Limited has communicated tax deduction procedures to shareholders regarding its final dividend of Re. 1.25 per equity share for the year ended March 31, 2025. The Board recommended the dividend on April 22, 2025, subject to approval at the Annual General Meeting scheduled for September 11, 2025. The record date is August 8, 2025. Following the Finance Act 2020, dividend income is now taxable in shareholders' hands, requiring the company to deduct tax at source. For resident individuals, no TDS applies if annual dividend doesn't exceed Rs. 10,000, otherwise 10% TDS applies with valid PAN. Non-resident shareholders face 20% TDS (30% for notified jurisdictional areas) unless covered by Double Tax Avoidance Treaty benefits. The company has outlined specific documentation requirements for different shareholder categories and set August 27, 2025, as the deadline for submitting relevant tax forms and declarations.",
            "Sentiment": "neutral",
            "PublishDate": 1755096830991,
            "Source": "corporate_action"
        },
        {
            "Title": "Delta Corp Reports Q1 FY26 Results, Faces ₹23,207 Crore GST Demand, Schedules AGM",
            "Summary": "Delta Corp Limited announced its quarterly results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹130.90 crores, down from ₹142.63 crores in the same quarter last year. Gaming operations contributed ₹118.90 crores while hospitality segment generated ₹12.00 crores. Standalone profit for the quarter was ₹25.84 crores compared to ₹40.48 crores in the previous year quarter. On a consolidated basis, the company reported revenue of ₹184.17 crores and profit of ₹29.46 crores. The company faces significant GST litigation with show cause notices totaling ₹23,207.30 crores for alleged short payment of Goods and Service Tax for the period from July 2017 to November 2022. The Board has recommended a final dividend of ₹1.25 per share and set the record date as August 8, 2025. The company will hold its 34th Annual General Meeting on September 11, 2025 through video conferencing. The Board also approved amendments to the employee stock appreciation rights plan, subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1754316234604,
            "Source": "earnings"
        },
        {
            "Title": "Delta Corp Reports Q4 FY23 Results with Significant Profit Growth",
            "Summary": "Delta Corp announced its Q4 FY23 results, reporting a consolidated net profit of 1.65 billion rupees, up from 724 million rupees year-over-year and 357.3 million rupees quarter-over-quarter. Revenue slightly decreased to 1.83 billion rupees from 1.85 billion rupees year-over-year. The company reported an exceptional item of 2.12 billion rupees. Profit before tax (PBT) decreased to 426.6 million rupees from 480.8 million rupees year-over-year. Delta Corp recommended a final dividend of 1.25 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1745367710000,
            "Source": "default"
        },
        {
            "Title": "Delta Corp Announces Final Dividend and Reports Q4 Results",
            "Summary": "Delta Corp has recommended a final dividend of 1.25 rupees per equity share. The company reported an exceptional item of 2.12 billion rupees. For Q4, Delta Corp's profit before tax (PBT) was 426.6 million rupees, compared to 480.8 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1745339840000,
            "Source": "result"
        },
        {
            "Title": "Delta Corp Reports Q4 FY2023 Financial Results",
            "Summary": "Delta Corp has released its Q4 financial results. The company reported a revenue of 1.83 billion rupees, slightly down from 1.85 billion rupees year-over-year. EBITDA decreased to 425.3 million rupees from 483 million rupees, with the EBITDA margin declining to 23.28% from 26.13%. However, consolidated net profit significantly increased to 1.65 billion rupees, up from 724 million rupees year-over-year and 357.3 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1745339786000,
            "Source": "result"
        },
        {
            "Title": "Government Likely to Propose Mandatory FIU Registration for Online Gaming Platforms",
            "Summary": "According to CNBCTV18, the Indian government is expected to propose that online gaming platforms be required to register with the Financial Intelligence Unit (FIU). This potential regulation would affect companies in the online gaming sector, including Delta Corp, which operates in this space.",
            "Sentiment": "neutral",
            "PublishDate": 1745298730000,
            "Source": "default"
        },
        {
            "Title": "Delta Corp Announces Future Conversion of Peninsula Land Limited's Debentures",
            "Summary": "Delta Corp has announced that 77,27,000 unsecured compulsorily convertible debentures of Peninsula Land Limited will be converted into equity shares on April 16, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1744819037000,
            "Source": "default"
        },
        {
            "Title": "Delta Corp to Merge Subsidiary Deltatech Gaming with Head Digital Works",
            "Summary": "Delta Corp has announced plans to merge its subsidiary Deltatech Gaming Ltd with Head Digital Works Pvt Ltd. The transaction is valued at approximately 491 crore rupees and will be executed in two phases. This merger represents a significant corporate restructuring for Delta Corp in the gaming sector.",
            "Sentiment": "neutral",
            "PublishDate": 1740068722000,
            "Source": "corporate_action"
        },
        {
            "Title": "Delta Corp: Q3 Profit Up 3.63% Despite Revenue Decline",
            "Summary": "Delta Corp reported Q3 FY25 results with profit at ₹35.73 crore, up 3.63% YoY, despite revenue falling 16.14% to ₹194.33 crore. EPS increased 3.1% to ₹1.33. Operating income decreased 54.34% YoY, indicating operational challenges.",
            "Sentiment": "neutral",
            "PublishDate": 1736920504000,
            "Source": "earnings"
        },
        {
            "Title": "Delta Corp Reports Mixed Q3 Financial Results",
            "Summary": "Delta Corp has announced its Q3 consolidated financial results. The company's net profit increased to 357 million rupees, up from 345 million rupees in the same quarter last year. However, revenue decreased to 1.94 billion rupees from 2.1 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1736813570000,
            "Source": "earnings"
        },
        {
            "Title": "Delta Corp Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Delta Corp has reported a significant decrease in its third-quarter EBITDA, which fell to 319 million rupees from 555 million rupees in the same period last year. The company's EBITDA margin also declined, dropping to 16.42% from 26.44% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1736775183000,
            "Source": "earnings"
        },
        {
            "Title": "Delta Corp Reports Q3 Financial Results",
            "Summary": "Delta Corp announced its Q3 consolidated net profit of 357 million rupees, showing a slight increase from 345 million rupees in the same quarter last year. However, the company's Q3 revenue decreased to 1.94 billion rupees from 2.1 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1736775164000,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Court Stays GST Notices Worth ₹1.12 Lakh Crore for Online Gaming Companies",
            "Summary": "The Supreme Court has provided significant relief to online gaming companies by staying GST show cause notices totaling approximately ₹1.12 lakh crore. This decision particularly benefits Delta Corp, a major player in the online gaming industry.",
            "Sentiment": "positive",
            "PublishDate": 1736489936000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Delta Corp: Supreme Court to Hear Online Gaming Industry's GST Plea",
            "Summary": "The Supreme Court will hear online gaming industry's pleas against GST show cause notices on January 10. The industry faces a potential tax demand of ₹1.12 lakh crore, which could escalate to ₹2.3 lakh crore with penalties. Companies are challenging the retrospective application of a 28% tax on full face value of entry amounts introduced in August 2023.",
            "Sentiment": "positive",
            "PublishDate": 1736320220000,
            "Source": "normal_news"
        },
        {
            "Title": "Supreme Court to Hear Online Gaming Industry Pleas Against GST Notices",
            "Summary": "The Supreme Court of India has agreed to hear pleas from the online gaming industry, including Delta Corp, against GST show cause notices on January 10. This development is significant for the online gaming sector, which has been facing regulatory challenges related to taxation.",
            "Sentiment": "neutral",
            "PublishDate": 1736317924000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Delta Corp to Consider Q3 Results on January 13",
            "Summary": "Delta Corp has announced that it will consider its third quarter (Q3) financial results on January 13. This indicates the company is preparing to release its earnings report for the latest fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1736171774000,
            "Source": "earnings"
        },
        {
            "Title": "Delta Corp: Shares Surge 8% Following CEA's Comments on Gaming Regulation",
            "Summary": "Delta Corp shares rose 8% after Chief Economic Advisor V Anantha Nageswaran suggested regulators should not impede innovation in online gaming. The stock closed 5% higher at ₹127.73, despite being down 15% in 2024 and excluded from F&O trading.",
            "Sentiment": "positive",
            "PublishDate": 1733910688000,
            "Source": "normal_news"
        },
        {
            "Title": "Delta Corp to Revise Deal and Demerge Real Estate Business",
            "Summary": "Delta Corp has announced plans to revise the deal between the company and Deltin Hotel & Resorts. Additionally, the company's real estate business will be demerged into Delta Penland. This corporate restructuring appears to be a significant strategic move for Delta Corp, potentially aimed at streamlining operations and maximizing value for shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1733483821000,
            "Source": "corporate_action"
        },
        {
            "Title": "Delta Corp Reports Significant Decline in Q2 EBITDA",
            "Summary": "Delta Corp's Q2 EBITDA has dropped to 340 million rupees from 1 billion rupees year-over-year. The company's EBITDA margin has also decreased from 38.31% to 18.09% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730900142000,
            "Source": "result"
        },
        {
            "Title": "Delta Corp Reports Decline in Q2 FY24 Financial Performance",
            "Summary": "Delta Corp, an Indian gaming and hospitality company, has reported its Q2 FY24 financial results. The company's consolidated net profit decreased to 270 million rupees, down from 694 million rupees year-over-year and 217 million rupees quarter-over-quarter. Revenue also declined to 1.87 billion rupees from 2.6 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1730900003000,
            "Source": "result"
        },
        {
            "Title": "Delta Corp: Real Estate and Hospitality Demerger Announced",
            "Summary": "<p>Delta Corp plans to <span class='neutral'>demerge</span> its <span class='neutral'>real estate</span> and <span class='neutral'>hospitality</span> businesses. This <b>corporate action</b> could potentially <span class='neutral'>impact</span> the company's <span class='neutral'>structure</span> and <span class='neutral'>operations</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1727246273000,
            "Source": "corporate_action"
        }
    ]
}