{
    "Symbol": "DEN",
    "ISIN": "INE947J01015",
    "News": [
        {
            "Title": "DEN Networks Q3FY26: EBITDA Margin Falls to 5.24%",
            "Summary": "DEN Networks reported Q3FY26 EBITDA of ₹132 million vs ₹273 million YoY, with EBITDA margin declining to 5.24% from 10.4% in Q3FY25, reflecting operational challenges.",
            "Sentiment": "negative",
            "PublishDate": 1768397113282,
            "Source": "co_actions_results"
        },
        {
            "Title": "DEN Networks CTO Sanjay Kumar Jain Retires Due to Superannuation",
            "Summary": "Sanjay Kumar Jain, Chief Technical Officer at DEN Networks Limited, ceased to be a member of senior management effective November 30, 2025, due to superannuation. The leadership change affects the company's senior management structure as the CTO position becomes vacant following the retirement.",
            "Sentiment": "neutral",
            "PublishDate": 1764554200713,
            "Source": "corporate_governance"
        },
        {
            "Title": "DEN Networks Receives Exchange Approval for Access Equity Private Limited Reclassification",
            "Summary": "NSE and BSE approved DEN Networks' application to reclassify Access Equity Private Limited from promoter group to public category, effective November 28, 2025. The reclassification affects the company's shareholding structure, though Access Equity Private Limited holds no equity shares or voting rights in DEN Networks.",
            "Sentiment": "neutral",
            "PublishDate": 1764382029619,
            "Source": "corporate_action"
        },
        {
            "Title": "FMEL Completely Divests Ownership in Three Den Networks Subsidiaries",
            "Summary": "FMEL has divested its complete ownership stake in three subsidiaries of Den Networks. This divestment affects Den Networks' corporate structure and FMEL's investment portfolio in the cable and broadband services sector.",
            "Sentiment": "neutral",
            "PublishDate": 1764157954357,
            "Source": "corporate_action"
        },
        {
            "Title": "Den Networks Successfully Overturns ₹332.6 Million Tax Demand",
            "Summary": "Den Networks has successfully overturned a tax demand of ₹332.6 million that included tax, interest, and penalty components. The company has resolved this significant financial obligation through what appears to be a favorable ruling or decision.",
            "Sentiment": "positive",
            "PublishDate": 1761825377099,
            "Source": "stock"
        },
        {
            "Title": "DEN Networks Submits Application for Access Equity Private Limited's Reclassification from Promoter Group to Public Category",
            "Summary": "DEN Networks Limited has submitted an application to BSE Limited and National Stock Exchange of India Limited for reclassification of Access Equity Private Limited from promoter group category to public category. The board of directors had previously approved the request received from Access Equity Private Limited on October 13, 2025. The application was submitted under Regulation 31A of SEBI Listing Obligations and Disclosure Requirements Regulations, 2015. DEN Networks will continue to update stock exchanges on developments related to the reclassification application.",
            "Sentiment": "neutral",
            "PublishDate": 1760700943579,
            "Source": "corporate_action"
        },
        {
            "Title": "Den Networks Reports 32.5% Decline in Q2 Net Profit to 351.6 Million Rupees",
            "Summary": "Den Networks reported quarterly consolidated net profit of 351.6 million rupees, down from 521 million rupees in the same period last year. Revenue decreased to 2.41 billion rupees from 2.5 billion rupees year-over-year. EBITDA fell to 190 million rupees compared to 278 million rupees previously, while EBITDA margin compressed to 7.86% from 11.18% in the corresponding quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1760402091499,
            "Source": "earnings"
        },
        {
            "Title": "Den Networks Targets EBITDA Growth and Digital Expansion with ₹3,254 Crore Cash Reserves",
            "Summary": "Den Networks is pursuing steady EBITDA growth and digital expansion while maintaining a debt-free position. The company holds ₹3,254 crore in cash reserves, which it plans to use to enhance long-term profitability and accelerate broadband growth initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1760370035437,
            "Source": "stock"
        },
        {
            "Title": "DEN Networks Approves Access Equity Private Limited's Reclassification from Promoter Group to Public Category",
            "Summary": "DEN Networks Limited received a reclassification request from Access Equity Private Limited (AEPL), a promoter group entity, seeking to move from promoter group to public category. The company's board of directors approved this request on October 13, 2025. AEPL does not hold any equity shares or voting rights in DEN Networks. The reclassification is subject to stock exchange approval and compliance with applicable listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1760359906374,
            "Source": "corporate_action"
        },
        {
            "Title": "DEN Networks Reports Quarterly Results with Revenue of Rs 2,480 Million",
            "Summary": "DEN Networks Limited announced its standalone and consolidated unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported standalone revenue from operations of Rs 2,480.15 million for the quarter, compared to Rs 2,456.06 million in the previous quarter and Rs 2,447.12 million in the same quarter last year. Profit after tax stood at Rs 314.34 million for the quarter versus Rs 508.14 million in the previous quarter. On a consolidated basis, revenue from operations was Rs 2,414.26 million for the quarter. The results were reviewed by the Audit Committee and approved by the Board of Directors on October 13, 2025. The company operates primarily in cable distribution network and broadband segments.",
            "Sentiment": "neutral",
            "PublishDate": 1760357058506,
            "Source": "earnings"
        },
        {
            "Title": "Den Networks Reports Q1 Financial Results",
            "Summary": "Den Networks has released its Q1 financial results. The company reported a consolidated net profit of 542 million rupees, up from 455 million rupees in the same quarter last year. Revenue decreased to 2.4 billion rupees from 2.5 billion rupees year-over-year. EBITDA fell to 211 million rupees from 265 million rupees, with the EBITDA margin declining to 8.74% from 10.71% in the comparable period.",
            "Sentiment": "neutral",
            "PublishDate": 1752538934000,
            "Source": "default"
        },
        {
            "Title": "DEN NETWORKS Reports Q1 Financial Results",
            "Summary": "DEN NETWORKS has released its Q1 financial results. The company reported an EBITDA of 211 million rupees, down from 265 million rupees year-over-year. The EBITDA margin decreased to 8.74% from 10.71% in the same period last year. Consolidated net profit increased to 542 million rupees from 455 million rupees year-over-year. Revenue for Q1 was 2.4 billion rupees, down from 2.5 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1752495358000,
            "Source": "result"
        },
        {
            "Title": "Den Networks to Review Q1 Results on July 14",
            "Summary": "Den Networks has announced that it will review its first quarter (Q1) results on July 14. The company has scheduled a meeting to discuss and analyze its financial performance for the most recent quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1751888672000,
            "Source": "default"
        },
        {
            "Title": "Den Networks Reports Q4 FY2023 Financial Results",
            "Summary": "Den Networks has announced its consolidated financial results for the fourth quarter. The company reported a net profit of 621.8 million rupees, which is lower compared to 791 million rupees in the same quarter last year (YoY) but higher than 403 million rupees in the previous quarter (QoQ). The revenue for Q4 stood at 2.48 billion rupees, slightly down from 2.58 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1745453500000,
            "Source": "default"
        },
        {
            "Title": "DEN Networks Reports Decline in Q4 EBITDA and Margin",
            "Summary": "DEN Networks experienced a decrease in its Q4 EBITDA, which fell to 284.23 million rupees from 400 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 11.46% from 15.51% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1745410882000,
            "Source": "result"
        },
        {
            "Title": "DEN NETWORKS Reports Q4 Financial Results",
            "Summary": "DEN NETWORKS has released its Q4 financial results. The company reported revenue of 2.48 billion rupees, down from 2.58 billion rupees year-over-year. Consolidated net profit for Q4 was 621.8 million rupees, compared to 791 million rupees in the same quarter last year and 403 million rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1745410847000,
            "Source": "result"
        },
        {
            "Title": "DEN Networks to Consider Q4 Results on April 23",
            "Summary": "DEN Networks, a cable TV distribution company, has announced that it will consider its fourth quarter (Q4) financial results on April 23. This meeting will likely involve the company's board reviewing and potentially approving the financial statements for the quarter ending March 31, 2023.",
            "Sentiment": "neutral",
            "PublishDate": 1744805986000,
            "Source": "default"
        },
        {
            "Title": "Den Networks Reports Decline in Q3 Profit and Revenue",
            "Summary": "Den Networks has reported its financial results for the third quarter. The company's consolidated net profit decreased to 403 million rupees from 473 million rupees in the same period last year. Revenue also saw a decline, falling to 2.61 billion rupees from 2.7 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1736813607000,
            "Source": "earnings"
        },
        {
            "Title": "DEN NETWORKS Reports Decline in Q3 EBITDA and Margin",
            "Summary": "DEN NETWORKS has reported its Q3 financial results, showing a decrease in EBITDA from 407 million rupees to 276 million rupees year-over-year. The company's EBITDA margin also declined from 14.91% to 10.59% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1736769493000,
            "Source": "earnings"
        },
        {
            "Title": "DEN Networks Reports Q3 FY2024 Financial Results",
            "Summary": "DEN Networks, a cable TV distribution company, has announced its financial results for the third quarter. The company reported a consolidated net profit of 403 million rupees, down from 473 million rupees in the same quarter last year. Revenue for Q3 stood at 2.61 billion rupees, slightly lower than the 2.7 billion rupees reported in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1736769487000,
            "Source": "earnings"
        },
        {
            "Title": "Den Networks: Q2 Net Profit Drops 24% Amid Revenue Decline",
            "Summary": "<p>Den Networks reported a <span class='negative'>24.04% decrease</span> in <span class='neutral'>net profit</span> to <b>Rs 34.37 crore</b> for Q2 FY2025. <span class='neutral'>Sales</span> <span class='negative'>declined by 10.33%</span> to <b>Rs 244.71 crore</b> compared to the same quarter last year. <span class='neutral'>Operating profit margin</span> turned <span class='negative'>negative at -0.29%</span> from <span class='positive'>11.78%</span> in the previous year.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728559620000,
            "Source": "result"
        },
        {
            "Title": "DEN NETWORKS Reports Decline in Q2 EBITDA and Margin",
            "Summary": "<p>DEN NETWORKS has reported its Q2 financial results. The company's <span class='neutral'>EBITDA</span> (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 has <span class='negative'>decreased</span> to <b>278 million rupees</b> from <b>430 million rupees</b> in the same quarter last year. Additionally, the <span class='neutral'>EBITDA margin</span> has <span class='negative'>fallen</span> to <b>11.18%</b> from <b>15.55%</b> year-over-year.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728559171000,
            "Source": "result"
        },
        {
            "Title": "DEN Networks Reports Q2 Revenue Decline",
            "Summary": "<p><span class='neutral'>DEN Networks</span>, a <span class='neutral'>cable TV</span> and <span class='neutral'>broadband</span> service provider, has reported its <b>second quarter revenue</b> for the current fiscal year. The company's revenue stood at <span class='negative'>2.49 billion rupees</span>, down from <span class='positive'>2.77 billion rupees</span> in the same quarter of the previous year, indicating a <span class='negative'>year-over-year decline</span>.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728559157000,
            "Source": "result"
        },
        {
            "Title": "DEN Networks Reports Increased Q2 Profit",
            "Summary": "<p><span class=\"positive\">DEN Networks</span> has reported a <span class=\"positive\">consolidated net profit</span> of <b>520 million rupees</b> for the second quarter, up from <b>457 million rupees</b> in the same period last year, representing a <span class=\"positive\">year-over-year increase</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728559140000,
            "Source": "result"
        },
        {
            "Title": "DEN Networks Schedules Board Meeting for Q2 Results",
            "Summary": "<p><span class=\"neutral\">DEN Networks</span> has announced a <span class=\"neutral\">board meeting</span> to be held on <b>October 10</b> to <span class=\"neutral\">consider and approve</span> the <span class=\"neutral\">financial results</span> for the <span class=\"neutral\">second quarter</span> of the current <span class=\"neutral\">fiscal year</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1727976609000,
            "Source": "result"
        }
    ]
}