{
    "Symbol": "DENORA",
    "ISIN": "INE244A01016",
    "News": [
        {
            "Title": "De Nora India Board Meet Set for February 3, 2026",
            "Summary": "De Nora India Limited has scheduled a board meeting on February 3, 2026, to consider and approve unaudited financial results for Q3 FY26 ended December 31, 2025. Trading window to reopen 48 hours post results.",
            "Sentiment": "neutral",
            "PublishDate": 1769160001812,
            "Source": "stocks"
        },
        {
            "Title": "De Nora India Closes Trading Window Ahead of Q3 Results",
            "Summary": "De Nora India Limited announces trading window closure from January 1, 2026, until 48 hours after Q3 FY26 financial results declaration for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766555863463,
            "Source": "co_actions_results"
        },
        {
            "Title": "Denora India Reports 35% Decline in Quarterly Revenue to Rs 2,854 Lakhs",
            "Summary": "Denora India Limited reported total income from operations of Rs 2,854.28 lakhs for the quarter ended September 30, 2025, compared to Rs 4,402.68 lakhs in the previous quarter and Rs 1,978.09 lakhs in the same quarter last year. Net profit after tax stood at Rs 387.20 lakhs for the quarter, up from Rs 324.92 lakhs in the previous quarter and Rs 328.12 lakhs year-on-year. For the half-year period, total income reached Rs 6,786.91 lakhs versus Rs 3,388.18 lakhs in the corresponding previous period. Earnings per share for the quarter was Rs 7.29 compared to Rs 6.12 in the previous quarter. The company's equity share capital remained unchanged at Rs 530.86 lakhs. The results were reviewed by the Audit Committee and Board of Directors in their meeting held on November 5, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762417243010,
            "Source": "earnings"
        },
        {
            "Title": "De Nora India Reports Q2 Results, Announces Board Changes and Director Appointments",
            "Summary": "De Nora India Limited approved its unaudited financial results for the quarter and half year ended September 30, 2025. The company appointed Guido Picari as Additional Director (Non-Executive and Non-Independent) effective November 5, 2025. The board approved the re-appointment of Purushottam Mantri as Independent Director for a second five-year term from February 5, 2026 to February 4, 2031, subject to shareholder approval. Robert Scannell resigned as Non-Executive Director effective November 5, 2025, citing superannuation from De Nora Group. The company approved a postal ballot notice to seek shareholder approval for the appointment of Deepak Nagvekar as Whole-time Director and the formal appointments of Picari and re-appointment of Mantri. Remote e-voting will commence November 16, 2025 and end December 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762347979827,
            "Source": "corporate_action"
        },
        {
            "Title": "Francesco L'Abbate Retires as Non-Executive Director of DE NORA INDIA LIMITED",
            "Summary": "Francesco L'Abbate retired by rotation as Non-Executive Director of DE NORA INDIA LIMITED at the company's 36th Annual General Meeting held on September 18, 2025. He did not seek reappointment and ceased to be a Director effective from the conclusion of the AGM. The cessation of directorship was approved by shareholders at the AGM. The company disclosed that this intimation was submitted separately following the standalone reporting format prescribed under SEBI Listing Regulations, noting that the delay was inadvertent and unintentional with no impact on substantive disclosure to shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1760355136296,
            "Source": "corporate_governance"
        },
        {
            "Title": "De Nora India Appoints CFO Deepak Nagvekar as Whole-time Director",
            "Summary": "De Nora India Limited appointed Deepak Nagvekar as an Additional Director in the category of Whole-time Director, effective September 18, 2025. Nagvekar, who serves as the company's Chief Financial Officer, will hold a three-year term until September 17, 2028, subject to shareholder approval. The appointment was made based on the recommendation of the Nomination and Remuneration Committee. Nagvekar is a commerce graduate and qualified Chartered Accountant with a Diploma in Information Systems Audit. He joined De Nora India in November 2007 and has over 25 years of professional experience in finance, accounting, taxation, audit, strategy, risk management and corporate governance. During his 18-year tenure with the company, he has managed end-to-end financial operations including budgeting, forecasting, working capital management, and strengthening internal financial controls.",
            "Sentiment": "positive",
            "PublishDate": 1758193669601,
            "Source": "corporate_governance"
        },
        {
            "Title": "De Nora India Appoints Shrikant Pai as Company Secretary & Compliance Officer",
            "Summary": "De Nora India Limited has appointed Shrikant Pai as Company Secretary & Compliance Officer, effective August 7, 2025. The appointment was approved during a Board Meeting held on August 6, 2025. Pai holds a B.Com from Karnataka University, an LLB from Karnataka State Law University, and is an Associate Member of the Institute of Company Secretaries of India with membership number 440001. He brings 12 years of experience in Corporate Laws and SEBI matters to his new role as Key Managerial Personnel.",
            "Sentiment": "neutral",
            "PublishDate": 1754474815384,
            "Source": "corporate_governance"
        },
        {
            "Title": "De Nora India Reports Quarterly Results, Board Approves Director Changes",
            "Summary": "De Nora India Limited's Board approved unaudited financial results for the quarter and year ended June 30, 2025. The company reported revenue from operations of ₹1,196.94 lakhs for the quarter compared to ₹2,013.11 lakhs in the previous quarter. Net profit for the quarter was ₹334.92 lakhs versus ₹439.07 lakhs in the prior quarter. For the full year, revenue stood at ₹7,275.82 lakhs with net profit of ₹288.18 lakhs. The company recognized warranty provisions of ₹849.99 lakhs during the quarter. The Board noted Francesco L'Abbate's retirement by rotation as non-executive director at the upcoming annual general meeting and recommended appointing Guido Picari as a new director, subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1753884664249,
            "Source": "corporate_action"
        },
        {
            "Title": "De Nora India Reports Mixed Q1 Results with Revenue Growth and Margin Decline",
            "Summary": "De Nora India reported quarterly net profit of 32.5 million rupees compared to 28.8 million rupees in the same period last year. Revenue increased significantly to 420 million rupees from 127.6 million rupees year-over-year. However, EBITDA declined to 24.4 million rupees from 29.3 million rupees, while EBITDA margin contracted sharply to 5.83% from 22.99% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1753884262971,
            "Source": "earnings"
        },
        {
            "Title": "De Nora India Schedules Board Meeting for July 30 to Approve Quarterly Financial Results",
            "Summary": "De Nora India Limited has scheduled a Board of Directors meeting for July 30, 2025, at 3:00 P.M. at its registered office in Kundaim, Goa, to consider and approve the unaudited financial results for the quarter ended June 30, 2025. The company has informed stock exchanges NSE and BSE about the meeting. The trading window for dealing in the company's securities, which was closed from July 1, 2025, will reopen 48 hours after the declaration of financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1753178684958,
            "Source": "corporate_action"
        },
        {
            "Title": "De Nora India Reports Mixed Q4 Results",
            "Summary": "De Nora India's Q4 financial results show a mixed performance. The company's revenue increased to 201 million rupees from 162 million rupees year-over-year. However, EBITDA decreased to 38 million rupees from 63 million rupees, with the EBITDA margin falling to 19.08% from 38.63%. Net profit also declined to 33 million rupees from 57 million rupees year-over-year, while showing a loss of 78 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1745930396000,
            "Source": "result"
        },
        {
            "Title": "De Nora India Reports Q3 Financial Results",
            "Summary": "De Nora India has reported a net loss of 78 million rupees in Q3, compared to a profit of 65 million rupees in the same quarter last year. However, this represents an improvement from the previous quarter, where the company posted a profit of 32.8 million rupees. The company's revenue for Q3 stood at 175.6 million rupees, down from 294 million rupees in the corresponding period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738284207000,
            "Source": "earnings"
        },
        {
            "Title": "De Nora India Reports Significant Revenue Decline in Q3",
            "Summary": "De Nora India has reported a substantial decrease in its third-quarter revenue. The company's revenue for Q3 stood at 175.6 million rupees, compared to 294 million rupees in the same period last year, representing a significant year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1738250235000,
            "Source": "earnings"
        },
        {
            "Title": "De Nora India Reports Q3 Net Loss of 78 Million Rupees",
            "Summary": "De Nora India has reported a net loss of 78 million rupees for the third quarter, compared to a profit of 65 million rupees in the same period last year. This represents a significant year-over-year decline. However, when compared to the previous quarter, the company had reported a profit of 32.8 million rupees, indicating a sequential deterioration in financial performance.",
            "Sentiment": "negative",
            "PublishDate": 1738250228000,
            "Source": "earnings"
        }
    ]
}