{
    "Symbol": "DENTA",
    "ISIN": "INE0R4L01018",
    "News": [
        {
            "Title": "Denta Water Reports Q3 FY26 Results",
            "Summary": "Denta Water and Infra Solutions posted Q3 FY26 revenue of Rs. 535.20 million and net profit of Rs. 142.62 million, with order book at Rs. 841.48 crores.",
            "Sentiment": "positive",
            "PublishDate": 1770903526005,
            "Source": "co_actions_results"
        },
        {
            "Title": "Denta Water Board Meet Set for Feb 12 Q3FY26 Results",
            "Summary": "Denta Water and Infra Solutions Limited has scheduled its board meeting for February 12, 2026, to consider Q3FY26 unaudited financial results. Trading window closed from January 01, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769779151996,
            "Source": "co_actions_results"
        },
        {
            "Title": "Denta Water Shows Strong Growth Amid Working Capital Woes",
            "Summary": "Denta Water & Infra Solutions reports 54% YoY revenue growth in Q2FY26 with Rs. 734.74 crore order book, but faces working capital challenges as cash conversion cycle extends to 1,214 days from 88 days.",
            "Sentiment": "neutral",
            "PublishDate": 1769418799323,
            "Source": "stocks"
        },
        {
            "Title": "Denta Water Clarifies Abakkus Investment Error",
            "Summary": "Denta Water & Infra Solutions advises investors not to make trading decisions based on recently spread article about Abakkus Funds investment due to clerical mistake.",
            "Sentiment": "neutral",
            "PublishDate": 1765930384718,
            "Source": "stocks"
        },
        {
            "Title": "Denta Water Wins ₹106+ Cr Karnataka Water Projects",
            "Summary": "Denta Water secures four major water infrastructure projects worth over ₹106 crores from KUIDFC, covering sewage treatment plants across multiple Karnataka districts under government initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1765894519648,
            "Source": "co_actions_results"
        },
        {
            "Title": "Denta Water Reports 54% Revenue Growth in Q2FY26 with Strong Order Book",
            "Summary": "Denta Water and Infra Solutions achieved revenue of ₹742.69 million in Q2FY26, marking 54% year-on-year growth driven by accelerated project execution in water management contracts. The company maintains a robust order book of ₹7,347.39 million providing revenue visibility for the next 2-2.5 years, with EBITDA margin at 31.88% and PAT margin at 25.49%.",
            "Sentiment": "positive",
            "PublishDate": 1764065661045,
            "Source": "earnings"
        },
        {
            "Title": "Denta Water Reports 53.8% Revenue Growth in Q2 FY26, Targets Rs 1,000 Crore Order Book",
            "Summary": "Denta Water and Infra Solutions achieved revenue of Rs 742.69 million in Q2 FY26, up 53.8% year-on-year, with EBITDA margin at 35.42% and PAT margin at 24.61%. The company maintains an order book of Rs 734 crores and expects to secure additional orders worth Rs 1,000 crores by Q3-Q4, projecting 30% revenue growth for FY27 at Rs 375-400 crores.",
            "Sentiment": "positive",
            "PublishDate": 1763647361679,
            "Source": "earnings"
        },
        {
            "Title": "Denta Water and Infra Solutions Schedules Earnings Conference Call for Q2 H1-FY26 Results",
            "Summary": "Denta Water and Infra Solutions Limited will hold an earnings conference call on November 17, 2025, at 4:00 PM IST to discuss the company's financial results for the second quarter and half year ended September 30, 2025. The company, which operates as a civil engineering contractor providing water infrastructure solutions with expertise in groundwater recharge and operations maintenance, has announced its quarterly results and will host the call for analysts and investors. The audio recording and transcript will be published on the company's website following the call.",
            "Sentiment": "neutral",
            "PublishDate": 1763003947430,
            "Source": "earnings"
        },
        {
            "Title": "Denta Water Reports 70% Jump in Q2 Net Profit to 189M Rupees",
            "Summary": "Denta Water and Infra Solutions reported strong quarterly results with net profit rising to 189 million rupees from 111 million rupees year-over-year, representing a 70% increase. Revenue grew significantly to 743 million rupees compared to 483 million rupees in the same period last year. EBITDA increased to 227 million rupees from 151 million rupees year-over-year. However, EBITDA margin declined slightly to 30.61% from 31.33% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762776332482,
            "Source": "earnings"
        },
        {
            "Title": "Denta Water & Infra Solutions Secures ₹331.89 Million Sewage Project Contract",
            "Summary": "Denta Water & Infra Solutions has won a sewage project contract worth ₹331.89 million. Following this new contract, the company's total order book has reached ₹7,481.02 million.",
            "Sentiment": "positive",
            "PublishDate": 1756806410186,
            "Source": "order&deals"
        },
        {
            "Title": "Denta Water and Infra Solutions Makes Q1 FY26 Earnings Call Audio Recording Available",
            "Summary": "Denta Water and Infra Solutions Limited has made the audio recording of their Q1 FY26 earnings conference call available on their company website. The call was held on August 18, 2025, at 4:30 p.m. IST. The audio recording can be accessed through a web link provided on the company's website. The company notified both the National Stock Exchange of India Limited and BSE Limited about the availability of this recording.",
            "Sentiment": "neutral",
            "PublishDate": 1755522391048,
            "Source": "earnings"
        },
        {
            "Title": "DENTA Secures ₹5,936.8 Million Orders with Expansion Plans Across Four States",
            "Summary": "DENTA has secured orders worth ₹5,936.8 million and is expanding operations into Gujarat, Madhya Pradesh, Maharashtra, and Uttar Pradesh. The company is focusing on water management and government-supported water recycling projects, along with selective rail and road projects. With low debt levels, DENTA expects revenue and profit growth by FY26-28.",
            "Sentiment": "positive",
            "PublishDate": 1755016932000,
            "Source": "stock"
        },
        {
            "Title": "Denta Water Reports 35% Jump in Quarterly Profit to Rs 185.50 Million",
            "Summary": "Denta Water and Infra Solutions Limited reported a profit of Rs 185.50 million for the quarter ended June 30, 2025, compared to Rs 131.50 million in the same quarter last year. Revenue from operations increased to Rs 672.78 million from Rs 494.97 million year-over-year. The company's earnings per share stood at Rs 6.95. The water revitalizing and groundwater recharging company completed its IPO during March 2025, raising Rs 220.50 million through fresh equity shares at Rs 294 per share. The company was listed on NSE and BSE on January 29, 2025. Out of the IPO proceeds, Rs 544.90 million remains unutilized as of June 30, 2025, temporarily invested in fixed deposits. The board approved both standalone and consolidated financial results during a meeting held on August 12, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755000455911,
            "Source": "earnings"
        },
        {
            "Title": "Denta Water and Infra Solutions Approves Rs 2.50 Final Dividend, Secures New Orders Worth Rs 1,830 Million",
            "Summary": "Denta Water and Infra Solutions Limited's Board approved several key decisions including convening the 9th Annual General Meeting on August 22, 2025. The Board recommended a final dividend of Rs 2.50 per share for the year ended March 31, 2025, with August 14, 2025 set as the record date. The company secured 7 new projects worth Rs 1,830.06 million, including water management, road, and irrigation projects. With these additions, the company now has 21 ongoing projects and an outstanding order book of Rs 7,455.38 million. The Board also approved the re-appointment of Mr. Manish Jayasheel Shetty as Managing Director for a three-year term starting from the AGM date.",
            "Sentiment": "positive",
            "PublishDate": 1753190115291,
            "Source": "corporate_action"
        },
        {
            "Title": "Denta Water and Infra Solutions: Stock Plunges Below IPO Price",
            "Summary": "Denta Water and Infra Solutions' stock fell 9.4% to ₹293.25, dropping below its IPO price of ₹294 for the first time since its January 29, 2025 listing. The company's market cap is now ₹820 crore, with the stock currently trading at ₹303, down 6.4% from the previous close.",
            "Sentiment": "negative",
            "PublishDate": 1739256186000,
            "Source": "normal_news"
        },
        {
            "Title": "Denta Water & Infra Solutions: Shares List at 12% Premium on Market Debut",
            "Summary": "Denta Water and Infra Solutions Ltd. shares listed at ₹330 on BSE, a 12% premium over the IPO price of ₹294. The company's IPO was oversubscribed 221 times. Proceeds will be used for working capital requirements. The company specializes in water management infrastructure projects and has an order book of Rs. 752 crore.",
            "Sentiment": "positive",
            "PublishDate": 1738125290000,
            "Source": "normal_news"
        }
    ]
}