{
    "Symbol": "DEVIT",
    "ISIN": "INE060X01034",
    "News": [
        {
            "Title": "Dev Information Technology Q3FY26 Results Announced",
            "Summary": "Dev Information Technology Limited reported Q3FY26 financial results with revenue of ₹3,603.21 lakhs and net loss of ₹647.13 lakhs. Board approved acquisition of 19,000 equity shares in Scaleax Advisory.",
            "Sentiment": "negative",
            "PublishDate": 1770782199187,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dev Info Tech Wins ₹29 Lakh AutoCAD Order from GIFT City",
            "Summary": "Dev Information Technology secures ₹29 lakh order for AutoCAD license with 3-year subscription from Gujarat International Finance Tec-City for implementation in GIFT City's DTA area.",
            "Sentiment": "positive",
            "PublishDate": 1770097946770,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dev Information Technology Achieves CMMI Level 5 Rating",
            "Summary": "Dev Information Technology Limited has been successfully appraised at CMMI Maturity Level 5, Version 3.0 for Development, representing the highest level of organisational maturity under the CMMI framework.",
            "Sentiment": "positive",
            "PublishDate": 1769522053379,
            "Source": "stocks"
        },
        {
            "Title": "Dev Information Technology Wins ₹3.18 Crore NICSI Order",
            "Summary": "Dev Information Technology Limited secured a ₹3.18 crore order from NICSI for developing IFMS 3.0 Web and Mobile Applications for Rajasthan Government's Directorate of Treasuries and Accounts.",
            "Sentiment": "positive",
            "PublishDate": 1769508148929,
            "Source": "co_actions_results"
        },
        {
            "Title": "Govt Denies Smartphone Source Code Sharing Proposal",
            "Summary": "Government clarifies no proposal exists to force smartphone makers to share source code, contradicting earlier Reuters report. PIB fact-check unit calls Reuters claim fake amid ongoing stakeholder consultations.",
            "Sentiment": "neutral",
            "PublishDate": 1768152013711,
            "Source": "stocks"
        },
        {
            "Title": "IT Ministry Takes Charge of Mobile Safety Standards",
            "Summary": "Ministry of Electronics and Information Technology assumes responsibility for mobile device safety standards discussions from telecom department, engaging with manufacturers on ITSAR compliance through transparent consultations.",
            "Sentiment": "neutral",
            "PublishDate": 1768145221078,
            "Source": "stocks"
        },
        {
            "Title": "Dev Information Technology Wins ₹96 Lakh Order",
            "Summary": "Dev Information Technology secures ₹96 lakh contract from Ahmedabad Urban Development Authority for AutoCAD software supply and installation with 15-day completion timeline.",
            "Sentiment": "positive",
            "PublishDate": 1767776579854,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dev Information Technology Partners With Xduce",
            "Summary": "Dev Information Technology announces strategic partnership with Xduce to accelerate growth in North America, focusing on AI, cloud computing, and cybersecurity capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1767764870033,
            "Source": "stocks"
        },
        {
            "Title": "Dev Info Tech Wins ₹26L Defence Contract",
            "Summary": "Dev Information Technology secured a ₹26 lakh contract from Core Technologies for AutoCAD services under Ministry of Defence, with completion expected in 2 months.",
            "Sentiment": "positive",
            "PublishDate": 1767677795704,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dev Information Technology Promoters Sell 13.16% Stake",
            "Summary": "Promoters of Dev Information Technology Limited sold 74.13 lakh shares worth 13.16% stake through open market transactions on December 31, 2025, reducing their combined holding from 18.99% to 5.83%.",
            "Sentiment": "neutral",
            "PublishDate": 1767435301104,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dev Information Technology Wins ₹1.90 Cr Gujarat Order",
            "Summary": "Dev Information Technology secures ₹1.90 crore RDBMS software order from Food Civil Supplies Department Gujarat, expanding digital services to include DBT Portal and Jan Seva app with 2-month timeline.",
            "Sentiment": "positive",
            "PublishDate": 1767257323553,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dev Information Technology Withdraws ₹68.18 Cr Fundraise",
            "Summary": "Dev Information Technology withdraws its proposed ₹68.18 crore convertible warrants issue to focus on strategic business restructuring and potential collaborations.",
            "Sentiment": "neutral",
            "PublishDate": 1766740425899,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dev Information Technology Wins ₹71 Lakh Order",
            "Summary": "Dev Information Technology Limited secured a consolidated order worth approximately ₹71.00 lakhs from Vishakha Group entities for enterprise software license procurement and professional services.",
            "Sentiment": "positive",
            "PublishDate": 1766481081342,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dev Info Tech Wins ₹6.97 Cr Gujarat Education Order",
            "Summary": "Dev Information Technology secures ₹6.97 crore contract from Knowledge Consortium of Gujarat to implement Microsoft Office Suite across educational colleges, with project completion scheduled by February 2026.",
            "Sentiment": "positive",
            "PublishDate": 1766473983198,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dev Information Technology Wins ₹93 Lakh NICSI Order",
            "Summary": "Dev Information Technology secured a ₹93 lakh contract from NICSI for IT professionals deployment at Bureau of Indian Standards for software and website development services over 6 months.",
            "Sentiment": "positive",
            "PublishDate": 1766387847510,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dev Information Technology Reports 10.32% Revenue Growth Despite Margin Pressure in Q2 FY26",
            "Summary": "Dev Information Technology Limited posted consolidated revenue of Rs. 92.64 crore for H1 FY26, up 10.32% year-on-year, though EBITDA declined to Rs. 7.85 crore from Rs. 17.29 crore in the same period last year. The company reported exceptional gains of Rs. 93.55 crore from its subsidiary DevX's public listing, while focusing on AI, blockchain, cybersecurity investments and expanding presence in India's e-governance market amid geopolitical uncertainties in North American markets.",
            "Sentiment": "neutral",
            "PublishDate": 1764421498331,
            "Source": "earnings"
        },
        {
            "Title": "Dev Information Technology Reschedules Q2 H1 FY26 Earnings Call to November 27",
            "Summary": "Dev Information Technology Limited has rescheduled its Q2 H1 FY26 earnings conference call for unaudited financial results ended September 30, 2025 from November 26 to November 27, 2025 at 12:00 PM onwards. The earnings call will be conducted as a group meeting with management speakers including Mr. Jaimin Shah, with no unpublished price sensitive information to be shared during the meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1763827278078,
            "Source": "earnings"
        },
        {
            "Title": "Dev Information Technology Limited Shareholders Approve Issuance of 1.5 Crore Convertible Warrants",
            "Summary": "Dev Information Technology Limited held an Extraordinary General Meeting on November 18, 2025, where shareholders approved the issuance of up to 1,50,00,000 fully convertible warrants on preferential basis. The company revised its PCS certificate and valuation report based on stock exchange clarifications, correcting clerical errors while maintaining the per-share warrant price unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1763470967077,
            "Source": "corporate_action"
        },
        {
            "Title": "DEVIT Reports Consolidated Total Income of ₹92.64 Crore in H1 FY26",
            "Summary": "Dev Information Technology Limited posted consolidated total income of ₹92.64 crore for H1 FY26, including an exceptional gain of ₹92.36 crore, while securing multiple government and enterprise contracts worth over ₹4 crore. The IT services company expanded its project portfolio with wins from RajCOMP Info Services, Gujarat Informatics, and NICSI, and its subsidiary Dev Accelerator Limited completed a public issue of ₹143.35 crore to support growth plans.",
            "Sentiment": "positive",
            "PublishDate": 1763118399524,
            "Source": "earnings"
        },
        {
            "Title": "Dev Information Technology Reports Strong Q2 Results with Exceptional Gains from Associate Company Listing",
            "Summary": "Dev Information Technology Limited reported quarterly results for the period ended September 30, 2025. The company's revenue from operations increased to Rs. 4,453.98 lakhs compared to Rs. 3,202.04 lakhs in the same quarter last year. The company recorded an exceptional gain of Rs. 9,236.13 lakhs due to Dev Accelerator Limited's successful IPO listing on September 17, 2025. Following the listing, Dev Information Technology's holding in Dev Accelerator reduced to 16.19%, causing it to cease being an associate and be reclassified as a financial asset. The Board approved allotment of 1,50,00,000 convertible warrants to Aeroflex Enterprises Limited at Rs. 45.45 per equity share, aggregating to Rs. 6,817.5 lakhs, subject to regulatory approvals and shareholder approval at an Extra Ordinary General Meeting scheduled for November 18, 2025. The company operates in IT & IT Enabled Services segment and completed a share subdivision from Rs. 5 face value to Rs. 2 face value per share.",
            "Sentiment": "positive",
            "PublishDate": 1762952656746,
            "Source": "earnings"
        },
        {
            "Title": "Dev Information Technology to Issue 1.5 Crore Convertible Warrants Worth ₹68.18 Crore",
            "Summary": "Dev Information Technology Limited has scheduled an Extraordinary General Meeting on November 18, 2025, to seek shareholder approval for issuing up to 1.5 crore fully convertible warrants to Aeroflex Enterprises Limited on a preferential basis. The warrants are priced at ₹45.45 each, aggregating to ₹68.18 crore. Each warrant can be converted into one equity share of face value ₹2 within 18 months from allotment. The proposed allottee must pay 25% of the issue price upfront, with the remaining 75% payable upon conversion. Proceeds will be utilized for working capital (₹35 crore), investment in subsidiaries (₹11.78 crore), capital expenditure for R&D and expansion (₹5 crore), and general corporate purposes (₹16.40 crore). Post-conversion, Aeroflex Enterprises would hold 21.03% stake in the company. The relevant date for pricing is October 17, 2025, and the warrants will be subject to lock-in provisions as per SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1761570999819,
            "Source": "corporate_action"
        },
        {
            "Title": "DEV Information Technology to Raise Rs 681.75 Lakhs Through Warrant Issue to Aeroflex Enterprises",
            "Summary": "DEV Information Technology Limited's board approved raising funds through issuance of 1.5 crore warrants convertible into equity shares to Aeroflex Enterprises Limited on preferential basis. The warrants are priced at Rs 45.45 each with face value of Rs 2, totaling Rs 681.75 lakhs. The proposal requires regulatory and shareholder approvals, with an Extraordinary General Meeting scheduled for November 18, 2025. Aeroflex Enterprises Limited is identified as a non-promoter entity. The board meeting was held on October 18, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760773110627,
            "Source": "corporate_action"
        },
        {
            "Title": "Dev Information Technology Secures ₹82 Lakh Government Contract for WebMyWay Project",
            "Summary": "Dev Information Technology Ltd. has secured a work order worth approximately ₹82 lakhs from RajCOMP Info Services Ltd., a Government of Rajasthan undertaking. The contract involves development, maintenance, and support services for the WebMyWay project, which provides portal and website services for government departments. The WebMyWay system is an in-house Content Management System that includes centralized update mechanisms for creating websites and has already developed over 82 individual websites/macro portals and 742 microsites. The project has a completion timeline of approximately twelve months. The contract is classified as a fixed-cost domestic order and does not involve any related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1758879909252,
            "Source": "order&deals"
        },
        {
            "Title": "DEV Information Technology Secures ₹71 Lakh Contract from Guj Info Petro Ltd",
            "Summary": "DEV Information Technology Limited has been awarded a work order worth approximately ₹71 lakhs by Guj Info Petro Ltd (GIPL). The contract involves upgrading and migrating cluster infrastructure to support latest workloads with minimal downtime. The project includes provisioning e-Governance applications and deploying Microsoft Windows Server 2025 Data Centre Core and Standard Core at GIPL's Gandhinagar data center. The fixed-cost domestic contract aims to enhance performance, scalability, and operational efficiency while leveraging existing physical and virtual resources. The project timeline is 2-3 weeks for execution.",
            "Sentiment": "positive",
            "PublishDate": 1758791205662,
            "Source": "order&deals"
        },
        {
            "Title": "Dev IT Secures 6.5 Million Rupee Contract",
            "Summary": "Dev IT has secured a contract worth 6.5 million rupees. The company announced this contract acquisition, though specific details about the nature of the contract, client, or timeline were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1756791318420,
            "Source": "stock"
        },
        {
            "Title": "Dev Information Technology Secures ₹1.06 Crore Contract from Rajasthan Government Entity",
            "Summary": "Dev Information Technology Ltd. has secured a work order worth ₹1.06 crore from RajCOMP Info Services Ltd., a Government of Rajasthan undertaking. The 12-month project involves enhancing integrated web portals and applications for improved responsiveness and mobile compatibility across government digital platforms. The work includes IT/ITeS and software development services using Adobe Experience Manager platform along with mobile application components. The company holds active work orders valued at approximately ₹50 crores from various government entities across India.",
            "Sentiment": "positive",
            "PublishDate": 1756373823660,
            "Source": "order&deals"
        }
    ]
}