{
    "Symbol": "DEVX",
    "ISIN": "INE0VOV01021",
    "News": [
        {
            "Title": "Dev Accelerator IPO Proceeds Monitoring Report Q3FY26",
            "Summary": "Dev Accelerator Limited reports utilization of Rs. 31.89 crore from IPO proceeds during Q3FY26, with Rs. 39.94 crore remaining unutilized as of December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770726130356,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dev Accelerator Q3FY26 Results: Loss of ₹101.28 Lakhs",
            "Summary": "Dev Accelerator Limited reported consolidated net loss of ₹101.28 lakhs for Q3FY26 despite revenue growth to ₹5,919.80 lakhs. Company also announced divestment of 38% stake in Scaleax Advisory.",
            "Sentiment": "negative",
            "PublishDate": 1769846034547,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dev Accelerator schedules Q3 FY26 earnings call",
            "Summary": "Dev Accelerator Limited announces earnings conference call on February 02, 2026 at 02:00 PM IST to discuss Q3 & 9M FY26 operational and financial performance with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1769615922973,
            "Source": "co_actions_results"
        },
        {
            "Title": "DevX Expands Through Landowner First Model",
            "Summary": "Dev Accelerator Limited announces national expansion through innovative Development Management model, unlocking 8.6 lakh sq. ft. of premium workspace with INR 1780 Mn revenue for FY 25.",
            "Sentiment": "positive",
            "PublishDate": 1769525044935,
            "Source": "stocks"
        },
        {
            "Title": "Dev Accelerator Litigation Matter Adjourned to Jan 2026",
            "Summary": "Dev Accelerator Limited's commercial court case involving LRS Service Private Limited has been adjourned from December 20, 2025 to January 31, 2026. The company will provide updates on substantial developments.",
            "Sentiment": "neutral",
            "PublishDate": 1766222523198,
            "Source": "stocks"
        },
        {
            "Title": "Dev Accelerator Limited Reports 80% Revenue Growth in H1 FY26, Plans Major Expansion",
            "Summary": "Dev Accelerator Limited achieved revenue of INR 107.47 crores in H1 FY26, representing 80% year-on-year growth, with EBITDA rising 64% to INR 52.82 crores and margins maintained around 50%. The managed workspace provider is launching India's largest single managed office campus in tier-2 cities with 3.15 lakh square feet in Ahmedabad at 95% pre-occupancy, expecting to add INR 2.5 crores monthly revenue from January 2026.",
            "Sentiment": "positive",
            "PublishDate": 1763447612945,
            "Source": "earnings"
        },
        {
            "Title": "Dev Accelerator Limited Reports No Deviation in IPO Fund Utilization for Q2 FY26",
            "Summary": "Dev Accelerator Limited utilized Rs. 55.55 crore from its Rs. 143.35 crore IPO proceeds during the quarter ended September 30, 2025, with monitoring agency Infomerics confirming no deviations from stated objectives. The flexspace operator deployed funds across capital expenditure for new centers (Rs. 36.29 crore), debt repayment (Rs. 28.58 crore), and general corporate purposes (Rs. 19.26 crore), maintaining Rs. 72.92 crore in various investment instruments.",
            "Sentiment": "neutral",
            "PublishDate": 1763046578672,
            "Source": "corporate_action"
        },
        {
            "Title": "Dev Accelerator Reports 50.4% Revenue Growth in Q2FY26 with Strong Enterprise Demand",
            "Summary": "Dev Accelerator Limited reported revenue of ₹51.8 crore in Q2FY26, marking a 50.4% year-on-year increase. The flexible workspace provider expanded its operational footprint to 28 centers across 12 cities, covering 0.89 lakh sq.ft. with an occupancy rate of 88%. EBITDA margin remained healthy at 51%, reflecting strong operating leverage. Enterprise clients now constitute 65% of rental revenue, with an overall occupancy rate of 88% and committed occupancy rate of 90%. The company operates 0.86 million sq.ft. of area under management with 13,600 total seats across 28 centers in 12 cities. Dev Accelerator has 0.44 lakh sq.ft. under fit-out and maintains a strong demand pipeline. The company plans to set up 8 new centers covering approximately 799,179 sq.ft. under straight lease model, funded from IPO proceeds, with expansion focused on Tier-II cities.",
            "Sentiment": "positive",
            "PublishDate": 1762884571815,
            "Source": "earnings"
        },
        {
            "Title": "Dev Accelerator Limited Schedules Maiden Earnings Conference Call for Q2H1FY26",
            "Summary": "Dev Accelerator Limited has announced its maiden earnings conference call to discuss operational and financial performance for Q2H1FY26. The call is scheduled for Wednesday, November 12, 2025, at 3:30 PM IST. The company's management team will be represented by Chairman and Whole-Time Director Parth Shah, Managing Director Umesh Uttamchandani, Whole-Time Director Rushit Shah, and Joint Chief Financial Officers Parin Shah and Parthiv Panchal. The company trades on BSE with script code 544513 and on NSE with trading symbol DEVX.",
            "Sentiment": "neutral",
            "PublishDate": 1762372060033,
            "Source": "earnings"
        }
    ]
}