{
    "Symbol": "DEVYANI",
    "ISIN": "INE872J01023",
    "News": [
        {
            "Title": "Devyani International Approves Office Relocation",
            "Summary": "Devyani International shareholders approve shifting registered office from Delhi to Haryana with 99.998% votes in favor through postal ballot process.",
            "Sentiment": "positive",
            "PublishDate": 1770822149159,
            "Source": "co_actions_results"
        },
        {
            "Title": "Devyani International Begins Pizza Hut Turnaround",
            "Summary": "Devyani International management announces Pizza Hut business turnaround strategy by closing loss-making stores and focusing operations. Company will halt new store openings except replacements.",
            "Sentiment": "neutral",
            "PublishDate": 1770196604262,
            "Source": "stocks"
        },
        {
            "Title": "Devyani International Acquires 11.4% Sky Gate Stake",
            "Summary": "Devyani International's board approves acquisition of 11.4% additional stake in Sky Gate Hospitality for ₹57.5 crore, making it wholly-owned subsidiary through cash and preference shares.",
            "Sentiment": "positive",
            "PublishDate": 1770188876531,
            "Source": "co_actions_results"
        },
        {
            "Title": "Devyani International Q3FY26 Call on Feb 4",
            "Summary": "Devyani International Limited schedules investor conference call for February 4, 2026 at 2:30 PM IST to discuss Q3FY26 results. Company operates over 2,000 QSR stores across 280+ cities.",
            "Sentiment": "neutral",
            "PublishDate": 1769961484635,
            "Source": "co_actions_results"
        },
        {
            "Title": "Devyani International & Sapphire Foods Merge",
            "Summary": "Devyani International and Sapphire Foods announce merger creating India's largest F&B platform with 3,000+ stores and ₹8,000 crore turnover. Deal includes share swap at 177:100 ratio.",
            "Sentiment": "positive",
            "PublishDate": 1768304623948,
            "Source": "co_actions_results"
        },
        {
            "Title": "Devyani International Arm Sells Get-A-Whey Owner",
            "Summary": "Devyani International's subsidiary Sky Gate Hospitality sold its 51% stake in Peanut Butter and Jelly Ltd, owner of health-focused Get-A-Whey ice cream brand, to Heritage Foods through share purchase agreement.",
            "Sentiment": "neutral",
            "PublishDate": 1767933372144,
            "Source": "co_actions_results"
        },
        {
            "Title": "Devyani International Completes Sale of 51% Stake",
            "Summary": "Devyani International's subsidiary Sky Gate Hospitality completed the sale of its 51% equity stake in Peanutbutter and Jelly Private Limited to Heritage Foods Limited on January 8, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767884074016,
            "Source": "co_actions_results"
        },
        {
            "Title": "Devyani International Releases First Sustainability Report",
            "Summary": "Devyani International Limited published its inaugural Sustainability Report for FY2024-25, prepared with reference to GRI and SASB standards, highlighting environmental stewardship and social impact initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1767796480175,
            "Source": "stocks"
        },
        {
            "Title": "Devyani International seeks shareholder nod for office shift",
            "Summary": "Devyani International Limited has issued a postal ballot notice seeking shareholder approval to shift its registered office from Delhi to Haryana through remote e-voting from January 8 to February 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767793855529,
            "Source": "co_actions_results"
        },
        {
            "Title": "Brokerages Bullish on Devyani-Sapphire Merger Prospects",
            "Summary": "Macquarie maintains Outperform at ₹200 target, Goldman Sachs keeps Buy at ₹170. Both highlight Pizza Hut turnaround potential and ₹2.1-2.25 billion synergy benefits, though demand recovery remains key variable.",
            "Sentiment": "positive",
            "PublishDate": 1767693845072,
            "Source": "co_actions_results"
        },
        {
            "Title": "Devyani International faces ₹5.42 Mn GST demand",
            "Summary": "Devyani International receives GST demand order of ₹5.42 Mn from Karnataka tax authorities for alleged ITC violations during FY 2018-19 to FY 2022-23. Company states no material impact expected.",
            "Sentiment": "negative",
            "PublishDate": 1767291549102,
            "Source": "stocks"
        },
        {
            "Title": "Devyani International Schedules Investor Call Jan 6",
            "Summary": "Devyani International Limited announces conference call with investors and analysts scheduled for January 6, 2026 at 3:00 PM IST under SEBI Regulation 30 compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1767284945662,
            "Source": "stocks"
        },
        {
            "Title": "Devyani International sells 51% stake in subsidiary",
            "Summary": "Devyani International's subsidiary Sky Gate sells its 51% equity stake in Peanutbutter and Jelly Private Limited to Heritage Foods Limited for ₹9 crore, expected to complete by January 31, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767104814938,
            "Source": "co_actions_results"
        },
        {
            "Title": "Devyani International Senior Management Resignations",
            "Summary": "Two senior executives at Devyani International - CEO of Vaango and CEO of Costa Coffee & Airport Business - resigned effective December 12, 2025, citing personal reasons and career opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1765546402907,
            "Source": "stocks"
        },
        {
            "Title": "Devyani International Gets ESG Rating of 64",
            "Summary": "Devyani International Limited receives voluntary ESG rating of 64 from NSE Sustainability Ratings Analytics Limited, disclosed under SEBI regulations on December 11, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765461440861,
            "Source": "stocks"
        },
        {
            "Title": "Devyani International Reports 13% Revenue Growth to INR 1,377 Crore Despite Festive Season Challenges",
            "Summary": "Devyani International Limited posted consolidated revenue of INR 1,377 crore for the quarter, marking 13% year-on-year growth. The company expanded its store network with 30 new KFC outlets and 3 Pizza Hut stores, while test launching Tealive with 6 outlets. KFC India revenues grew 5.3% to INR 572 crore with average daily sales of INR 89,000, though brand contribution margin declined to 14.1%. Pizza Hut India recorded revenues of INR 186 crore with same-store sales growth at minus 4%. The international business demonstrated strong performance with revenues of INR 450 crore, up 14% year-on-year, achieving 16.7% brand contribution margins. Consolidated operating EBITDA was INR 93 crore with 6.8% margins. The company faced headwinds from unseasonable rains in eastern regions and the timing of Shravan and Navratri festivals falling in the same quarter, impacting out-of-home consumption. Management remains on track to achieve brand contribution breakeven for SkyGate acquisition by March 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1763029118417,
            "Source": "earnings"
        },
        {
            "Title": "Devyani International Reports Mixed Q2 Results with Revenue Growth but Swings to Loss",
            "Summary": "Devyani International reported Q2 revenue of 13.8 billion rupees, up from 12.2 billion rupees in the previous year. However, the company swung to a consolidated net loss of 220 million rupees compared to a profit of 2 million rupees in the same quarter last year. EBITDA declined to 1.92 billion rupees from 1.95 billion rupees, while EBITDA margin compressed to 13.97% from 16.01% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762412368416,
            "Source": "earnings"
        },
        {
            "Title": "Devyani International Plans 100-110 New KFC Store Openings",
            "Summary": "Devyani International announced plans to open approximately 100-110 new KFC stores. The company expects gross and brand contribution margins to improve after 1-2 months of ongoing promotional activities.",
            "Sentiment": "positive",
            "PublishDate": 1755142782985,
            "Source": "stock"
        },
        {
            "Title": "Devyani International Expands to 2,145 Stores with 106 New Additions in Q1 FY26",
            "Summary": "Devyani International added 106 new stores during Q1 FY26, bringing its total store count to 2,145. The expansion includes 105 stores from Sky Gate Hospitality.",
            "Sentiment": "positive",
            "PublishDate": 1755070446705,
            "Source": "stock"
        },
        {
            "Title": "Devyani International Reports Mixed Q1 Results with Major Sky Gate Acquisition",
            "Summary": "Devyani International Limited announced its quarterly results ended June 30, 2025. On a consolidated basis, the company reported revenue from operations of INR 49,510.52 million and a net profit of INR 167.63 million. On a standalone basis, revenue was INR 9,168.88 million with a profit of INR 62.06 million. The company completed a significant acquisition on June 10, 2025, purchasing an 80.72% equity stake in Sky Gate Hospitality Private Limited for INR 4,196.00 million through preferential equity shares. The company's equity stake in Sky Gate later increased to 84.34% and subsequently to 86.13% on a fully diluted basis. During the quarter, 1,952,500 equity shares were allotted to employees under the Employee Stock Option Scheme 2021. The results received unmodified opinions from joint statutory auditors Walker Chandiok & Co LLP and O P Bagla & Co LLP.",
            "Sentiment": "positive",
            "PublishDate": 1755070391886,
            "Source": "earnings"
        },
        {
            "Title": "Devyani International Reports 88% Drop in Q1 Net Profit Despite Revenue Growth",
            "Summary": "Devyani International reported quarterly net profit of 37 million rupees compared to 301 million rupees in the same period last year. Revenue increased to 13.6 billion rupees from 12.3 billion rupees year-over-year. EBITDA declined to 2.1 billion rupees from 2.16 billion rupees, while EBITDA margin compressed to 15.2% from 17.7% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1755069327599,
            "Source": "earnings"
        },
        {
            "Title": "Devyani International Sees Block Trade of Rs. 26.53 Crores on NSE",
            "Summary": "Devyani International Ltd. witnessed a block trade on the National Stock Exchange worth Rs. 26.53 crores. The transaction involved approximately 1,520,525 shares at a price of Rs. 174.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1753076897187,
            "Source": "order&deals"
        },
        {
            "Title": "Devyani International Increases Ownership in Sky Gate",
            "Summary": "Devyani International has increased its ownership stake in Sky Gate to 86.13%. The news indicates a significant increase in Devyani International's control over Sky Gate, though specific details about the previous ownership percentage or the reasons for this increase are not provided in the given information.",
            "Sentiment": "positive",
            "PublishDate": 1752839974000,
            "Source": "default"
        },
        {
            "Title": "Devyani International Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 5,025,344 shares of Devyani International Ltd. occurred on the National Stock Exchange (NSE) at a price of Rs. 175.85 per share. The total value of the transaction was Rs. 88.37 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1752814305000,
            "Source": "block_details"
        },
        {
            "Title": "Devyani International Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 2,048,068 shares of Devyani International Ltd. took place on the National Stock Exchange (NSE). The trade was valued at Rs. 35.60 Crores, with each share priced at Rs. 173.81.",
            "Sentiment": "neutral",
            "PublishDate": 1752651014000,
            "Source": "block_details"
        },
        {
            "Title": "Devyani International's Subsidiary Acquires Blackvelvet and Say Chefs",
            "Summary": "A subsidiary of Devyani International has completed the purchase of Blackvelvet and Say Chefs. No further details about the acquisition or the companies involved were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752237887000,
            "Source": "default"
        },
        {
            "Title": "Devyani International Clarifies No Merger with Sapphire Foods",
            "Summary": "Devyani International has issued a clarification stating that there is no merger planned with Sapphire Foods. The company is exploring growth opportunities that do not require major disclosure requirements. No specific details about these opportunities were provided in the news article.",
            "Sentiment": "neutral",
            "PublishDate": 1751629499000,
            "Source": "default"
        },
        {
            "Title": "Devyani International: Additional Stake Acquisition in Biryani by Kilo for Rs 106 Crore",
            "Summary": "Devyani International plans to increase its stake in Sky Gate Hospitality, parent of Biryani By Kilo, from 80.72% to 86.13% through a Rs 106.25 crore investment. The transaction involves subscribing to new equity shares and purchasing shares from the promoter group, to be completed by July 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1750737038000,
            "Source": "corporate_action"
        },
        {
            "Title": "Devyani International: Stake Increase in 'Biryani By Kilo' Operator to 86.13%",
            "Summary": "Devyani International to raise its stake in Sky Gate Hospitality from 80.72% to 86.13% through a ₹106.25 crore investment. The acquisition will be completed by July 31, 2025, via cash consideration in one or more tranches. Sky Gate owns brands like 'Biryani By Kilo' and 'Goila Butter Chicken'. The investment aims to strengthen operations and support further investments in subsidiaries.",
            "Sentiment": "positive",
            "PublishDate": 1750691912000,
            "Source": "corporate_action"
        },
        {
            "Title": "Devyani International Increases Stake in Sky Gate Hospitality",
            "Summary": "Devyani International has acquired additional equity in Sky Gate Hospitality for ₹1.06 billion. This acquisition has increased Devyani International's stake in Sky Gate Hospitality from 80.72% to 86.13%.",
            "Sentiment": "positive",
            "PublishDate": 1750686283000,
            "Source": "default"
        },
        {
            "Title": "Devyani International Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 4,569,957 shares of Devyani International Ltd. was executed on the National Stock Exchange (NSE) for Rs. 77.91 crores. The trade was conducted at a price of Rs. 170.48 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1748507554000,
            "Source": "block_details"
        },
        {
            "Title": "Devyani International: Citi Cuts Target Price After Slow Q4 Same Store Sales Growth",
            "Summary": "Citi maintains 'buy' rating but reduces price target for Devyani International to Rs 209 from Rs 210 due to slowdown in KFC's same store sales growth. Factors affecting growth include bird flu impact in some states and geopolitical situations. Citi forecasts margin expansion to 20% and addition of 110-120 KFC stores. Q4 results show narrowed net loss to Rs 16.76 crore and 15.8% revenue growth to Rs 1,212.6 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1748228840000,
            "Source": "earnings"
        },
        {
            "Title": "Devyani Executive Avoids Price Increase Due to Consumption Slowdown",
            "Summary": "During a conference call, an executive from Devyani International stated that the company does not want to implement a price increase at this time, citing the current consumption slowdown as the reason.",
            "Sentiment": "neutral",
            "PublishDate": 1747993215000,
            "Source": "default"
        },
        {
            "Title": "Devyani International: Q4 Loss Widens, Revenue and Margins Improve",
            "Summary": "Devyani International reported a wider net loss of ₹14.7 crore in Q4 compared to ₹7.5 crore last year. Revenue increased 16% to ₹1,213 crore. EBITDA grew 43% to ₹187 crore with margins expanding to 15.4%. The company opened 257 net new stores and acquired KFC stores in Thailand.",
            "Sentiment": "neutral",
            "PublishDate": 1747986178000,
            "Source": "earnings"
        },
        {
            "Title": "Devyani International Reports Q4 Financial Results",
            "Summary": "Devyani International has released its Q4 financial results. The company reported revenue of 12.1 billion rupees, up from 10.5 billion rupees in the same quarter last year. EBITDA for Q4 was 1.86 billion rupees, down from 2.06 billion rupees year-over-year. The EBITDA margin decreased to 15.34% from 19.69% in the previous year. The company reported a consolidated net loss of 147 million rupees, compared to a loss of 75 million rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1747982265000,
            "Source": "result"
        },
        {
            "Title": "Devyani International: Acquires Majority Stake in 'Biryani By Kilo' Owner for ₹419 Crore",
            "Summary": "Devyani International to acquire 80.72% stake in Sky Gate Hospitality for ₹419.31 crore. Sky Gate owns brands like Biryani By Kilo and Goila Butter Chicken. Acquisition to be completed within 15 days of approval. Devyani approves preferential issue of 2.37 crore shares at ₹176.78 each, subject to shareholder approval on May 17, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1745480620000,
            "Source": "corporate_action"
        },
        {
            "Title": "Devyani International: KFC Operator to Acquire Biryani by Kilo",
            "Summary": "Devyani International plans to acquire a controlling stake in Sky Gate Hospitality, which operates Biryani by Kilo. The board will meet on April 24 to consider the acquisition and issue equity shares. Analysts have upgraded the stock, citing potential value creation and growth opportunities in the biryani market.",
            "Sentiment": "positive",
            "PublishDate": 1745214982000,
            "Source": "corporate_action"
        },
        {
            "Title": "Devyani International Ltd. Experiences Large Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) for Devyani International Ltd. The transaction involved approximately 3,714,266 shares, traded at a price of Rs. 149.70 per share. The total value of this block trade amounted to Rs. 55.60 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1742803838000,
            "Source": "block_deals"
        },
        {
            "Title": "Devyani International: Brokerages Cut Target Price After Weak Q3 Earnings",
            "Summary": "Brokerages reduced Devyani International's target price following weak Q3 results in India. JPMorgan cut the target to Rs 195 from Rs 200, while CLSA lowered it to Rs 188 from Rs 196. The company missed topline and Ebitda estimates, with KFC and Pizza Hut showing muted performance. Despite challenges, Devyani plans to launch three new franchises in India and expand its food court presence. The company achieved its 2,000-store expansion target ahead of schedule.",
            "Sentiment": "negative",
            "PublishDate": 1739332977000,
            "Source": "earnings"
        },
        {
            "Title": "Devyani International Achieves Store Expansion Milestone and Plans Growth in Thailand",
            "Summary": "Devyani International has met its store expansion guidance, surpassing 2,000 stores in the recent quarter. The company is now targeting an expansion of 20 to 25 new stores in Thailand, representing approximately 8% to 9% growth in their Thai operations. Additionally, Devyani International aims for a same-store sales growth (SSSG) of about 3% to 4% in Thailand.",
            "Sentiment": "positive",
            "PublishDate": 1739331425000,
            "Source": "corporate_action"
        },
        {
            "Title": "Devyani International Surpasses 2,000 Store Milestone",
            "Summary": "Devyani International has achieved a significant milestone by expanding its store network to over 2,000 outlets in the third quarter of fiscal year 2025. The company's total store count now stands at 2,032, surpassing their previously announced guidance. This rapid expansion demonstrates Devyani International's strong growth trajectory and successful implementation of their expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1739255985000,
            "Source": "corporate_action"
        },
        {
            "Title": "Devyani International Reports Significant Revenue Growth in Q3",
            "Summary": "Devyani International has announced its financial results for the third quarter, reporting a substantial increase in revenue. The company's revenue rose to 12.9 billion rupees, up from 8.4 billion rupees in the same period last year, marking a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1739254971000,
            "Source": "earnings"
        },
        {
            "Title": "Devyani International Reports Q3 EBITDA Growth",
            "Summary": "Devyani International has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 2.13 billion rupees from 1.46 billion rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 16.48% from 17.00% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739254965000,
            "Source": "earnings"
        },
        {
            "Title": "Devyani International Reports Q3 Net Loss",
            "Summary": "Devyani International, a food and beverage retail company, has reported a consolidated net loss of 5 million rupees for the third quarter. This marks a significant shift from the 96 million rupees profit recorded in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739254810000,
            "Source": "earnings"
        },
        {
            "Title": "Devyani International: Q3 Results Announcement Date Set",
            "Summary": "Devyani International Ltd. will release Q3 FY2025 results on February 11, 2025. The company will host an earnings call at 2:30 PM on the same day. Trading window for designated persons closes until February 13.",
            "Sentiment": "neutral",
            "PublishDate": 1739173087000,
            "Source": "corporate_action"
        },
        {
            "Title": "Devyani International to Consider Q3 Results on February 11",
            "Summary": "Devyani International has announced that it will consider its third quarter (Q3) financial results on February 11. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738672360000,
            "Source": "earnings"
        },
        {
            "Title": "Devyani International: KFC Franchise Operator Surges 6% on Positive QSR Outlook",
            "Summary": "Devyani International stock rose 6% following a favorable Macquarie report on the QSR sector. The report highlights KFC's strong performance and positions Devyani as a top pick. Potential middle-class-focused budget measures could further boost QSR growth.",
            "Sentiment": "positive",
            "PublishDate": 1736938239000,
            "Source": "normal_news"
        },
        {
            "Title": "Devyani International Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade of approximately 2,588,450 shares of Devyani International Ltd. occurred on the National Stock Exchange (NSE) at a price of Rs. 166.17 per share. The total value of the transaction amounted to Rs. 43.01 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1733463511000,
            "Source": "block_deals"
        },
        {
            "Title": "Devyani International: Q2 Results Show Subdued Demand",
            "Summary": "Devyani International's Q2 results indicate subdued demand conditions, according to a review by Dolat Capital.",
            "Sentiment": "negative",
            "PublishDate": 1731380874000,
            "Source": "result"
        },
        {
            "Title": "Devyani International: Revenue Soars 49%, Signs Three New Franchise Deals",
            "Summary": "Devyani International reported a 49% increase in Q2 FY25 revenue to ₹1,220 crore. The company added 85 new stores in Q2, bringing the total to 1,921. It signed exclusive Master Franchise agreements for three new brands: Tealive, New York Fries, and Sanook Kitchen. However, EBITDA margin slightly decreased to 16.3% from 18.3% in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731313932000,
            "Source": "result"
        }
    ]
}