{
    "Symbol": "DGCONTENT",
    "ISIN": "INE03JI01017",
    "News": [
        {
            "Title": "Digicontent Q3FY26 Results: Loss Widens on Labour Code Impact",
            "Summary": "Digicontent Limited reported consolidated net loss of ₹728 lakhs in Q3FY26 vs profit of ₹659 lakhs in Q3FY25, impacted by exceptional items of ₹1,589 lakhs related to new labour codes.",
            "Sentiment": "negative",
            "PublishDate": 1769608625757,
            "Source": "co_actions_results"
        },
        {
            "Title": "Digicontent Limited Reports Strong Consolidated Revenue Growth of 15% in Q2 FY2025",
            "Summary": "Digicontent Limited announced its quarterly results for the quarter and six months ended September 30, 2025. On a consolidated basis, revenue from operations increased to INR 13,179 lakhs in Q2 FY2025 from INR 11,458 lakhs in Q2 FY2024, representing a 15% growth. For the six-month period, consolidated revenue grew to INR 24,226 lakhs from INR 21,885 lakhs in the previous year. The company reported consolidated profit after tax of INR 955 lakhs for Q2 FY2025 compared to INR 1,086 lakhs in Q2 FY2024. Basic earnings per share for the quarter stood at INR 1.64. On a standalone basis, the company reported a loss before tax of INR 177 lakhs for Q2 FY2025. The company operates in Entertainment Digital Innovation Business and has a wholly-owned subsidiary, HT Digital Streams Limited. During the quarter, the company granted 4.09 lakh Restricted Stock Units to eligible employees and received an interim dividend of INR 100 lakhs from its subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1762242052669,
            "Source": "earnings"
        },
        {
            "Title": "Digicontent Limited Reports Loss in Q1 2025, Expands Employee Stock Plan",
            "Summary": "Digicontent Limited reported a consolidated net loss of Rs 233 lakhs for the quarter ended June 30, 2025, compared to a profit of Rs 69 lakhs in the same period last year. Revenue from operations increased to Rs 11,045 lakhs from Rs 10,427 lakhs year-over-year. The company's Board approved expanding its Restricted Stock Units Plan 2025 by adding 26.4 lakh RSUs, increasing the total pool from 29.09 lakh to 55.49 lakh units, representing approximately 9.54% of paid-up equity share capital. The amendment requires shareholder approval. On a standalone basis, the company posted a loss of Rs 305 lakhs with revenue of Rs 31 lakhs. The company operates in the Entertainment & Digital Innovation Business segment.",
            "Sentiment": "negative",
            "PublishDate": 1753451480178,
            "Source": "earnings"
        },
        {
            "Title": "Digicontent: Q3 Profit Soars to ₹6.59 Crore, Revenue Up 1.37% YoY",
            "Summary": "Digicontent reported Q3 FY25 results with a profit of ₹6.59 crore, reversing a loss from the previous year. Revenue increased by 1.37% year-over-year but declined 4.45% quarter-on-quarter. Operating income rose 168.89% YoY despite a 38.19% QoQ drop. EPS reached ₹1.13, up 1230% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1737093445000,
            "Source": "earnings"
        },
        {
            "Title": "DIGICONTENT Reports Stable Q3 Revenue",
            "Summary": "DIGICONTENT has reported a Q3 revenue of 1.1 billion rupees, which remains unchanged compared to the same period last year (year-over-year).",
            "Sentiment": "neutral",
            "PublishDate": 1737015693000,
            "Source": "earnings"
        },
        {
            "Title": "DigiContent Reports Improved Q3 EBITDA and Margin",
            "Summary": "DigiContent has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 137 million rupees from 93.4 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 12.52% from 8.65% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1737015610000,
            "Source": "earnings"
        },
        {
            "Title": "DIGICONTENT Reports Profitable Q3 with 66M Rupees Net Profit",
            "Summary": "DIGICONTENT has reported a significant turnaround in its financial performance for the third quarter. The company posted a consolidated net profit of 66 million rupees, compared to a loss of 5.5 million rupees in the same period last year. This marks a positive shift in the company's financial health, moving from a loss-making position to profitability.",
            "Sentiment": "positive",
            "PublishDate": 1737015605000,
            "Source": "earnings"
        }
    ]
}