{
    "Symbol": "DHAMPURSUG",
    "ISIN": "INE041A01016",
    "News": [
        {
            "Title": "Dhampur Sugar Mills Board Meet Set for Feb 2",
            "Summary": "Dhampur Sugar Mills has scheduled a board meeting for February 2, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769605490576,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dhampur Sugar Mills CFO Confirms CP Proceeds Utilization",
            "Summary": "Dhampur Sugar Mills CFO certifies proper utilization of Commercial Paper proceeds for Q3FY26 under SEBI compliance requirements, following earlier ₹100 crore CP maturity announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1767354889465,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dhampur Sugar Mills Notifies Shareholders of Upcoming IEPF Transfer for Unclaimed 2018-19 Dividends",
            "Summary": "Dhampur Sugar Mills has informed shareholders that unclaimed interim dividends from Financial Year 2018-19 and corresponding equity shares will be transferred to the Investor Education and Protection Fund (IEPF) on March 6, 2026. The company has requested affected shareholders to submit their claims by February 28, 2026, to avoid the mandatory transfer of their Rs. 10 equity shares and dividend amounts to the IEPF demat account.",
            "Sentiment": "neutral",
            "PublishDate": 1764592032944,
            "Source": "corporate_action"
        },
        {
            "Title": "India Ratings Revises Dhampur Sugar Mills' Outlook to Negative, Affirms IND AA- Rating",
            "Summary": "India Ratings revised Dhampur Sugar Mills' outlook to negative from stable while affirming IND AA- rating on bank loan facilities worth INR 11,708.6 million, citing weaker-than-expected credit profile due to 35% decline in EBITDA to INR 1,695 million in FY25. The revision reflects concerns over reduced cane crushing, lower sugar recovery, decreased ethanol sales, and increased debt levels, with net leverage rising to 4.5x in FY25 from 3.4x in FY24.",
            "Sentiment": "negative",
            "PublishDate": 1763379126444,
            "Source": "stock"
        },
        {
            "Title": "Dhampur Sugar Plans Expansion with 350 KLPD Ethanol Capacity and Product Diversification",
            "Summary": "Dhampur Sugar is pursuing integrated growth through expanding its ethanol capacity to 350 KLPD and establishing new greenfield operations. The company is diversifying into value-added products including ethyl acetate and potable spirits. Key strategic initiatives include energy efficiency improvements, brand development with 'Mishti by Dhampur', and achieving revenue stability through a diversified sugar-ethanol product mix. The company expects strong margin expansion in FY26 supported by government policy measures.",
            "Sentiment": "positive",
            "PublishDate": 1762872005226,
            "Source": "stock"
        },
        {
            "Title": "Dhampur Sugar Mills Reports Reduced Net Loss and Higher Revenue in Q2",
            "Summary": "Dhampur Sugar Mills reported a net loss of 87.7 million rupees in Q2, an improvement from the previous year's loss of 135.2 million rupees. The company's revenue increased to 7.11 billion rupees compared to 5.8 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1762865954433,
            "Source": "earnings"
        },
        {
            "Title": "Dhampur Sugar Mills Undergoes Income Tax Search Operations",
            "Summary": "Dhampur Sugar Mills is facing income tax search operations at its offices and production sites. The company has stated it is providing full assistance to the authorities during the search process.",
            "Sentiment": "negative",
            "PublishDate": 1762178519386,
            "Source": "stock"
        },
        {
            "Title": "Dhampur Sugar Mills to Acquire 51% Stake in Venus India Asset-Finance for $5.5 Million",
            "Summary": "Dhampur Sugar Mills Limited's board approved a share purchase agreement to acquire 4,72,87,537 equity shares representing 51% of Venus India Asset-Finance Private Limited for USD 5,508,713 (approximately INR 50 crores). Venus India Asset-Finance is a non-banking financial company registered with RBI, classified as a 'Base Layer' NBFC, engaged in providing short and medium-term loans. The target company reported a net worth of INR 228.18 crores, turnover of INR 42.20 crores, and profit after tax of INR 14.94 crores for FY 2024-25. The acquisition aims to diversify Dhampur Sugar's business beyond agribusiness operations into financial services. Goel Investments Limited, part of Dhampur's promoter group, will separately acquire an additional stake to hold 45.01% of the target company. The transaction requires RBI approval and has a completion deadline of one year from October 28, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761646317161,
            "Source": "order&deals"
        },
        {
            "Title": "Dhampur Sugar Mills Issues ₹100 Crore Commercial Paper with 6.95% Interest Rate",
            "Summary": "Dhampur Sugar Mills Limited has issued and allotted commercial paper worth ₹100 crores. The commercial paper has a 91-day tenure with an interest rate of 6.95% and maturity date of January 9, 2026. The paper was issued in favor of Kotak Mahindra Bank Limited and carries a credit rating of IND A1+ from India Ratings and Research Private Limited. The commercial paper will be listed on BSE Limited with ISIN INE041A14118, comprising 2000 units with an issue value of ₹98.30 crores and redemption value of ₹100 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1760096753452,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhampur Sugar Mills Reports Mixed Q1 Results with Revenue Growth but Lower Profitability",
            "Summary": "Dhampur Sugar Mills reported quarterly results showing revenue growth to 7.4 billion rupees from 6.8 billion rupees in the same period last year. However, the company's profitability declined with EBITDA falling to 230 million rupees from 270 million rupees year-over-year. EBITDA margin compressed to 3.10% from 3.98% in the previous year. Net profit also decreased to 7 million rupees compared to 13 million rupees in the corresponding quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1754656985534,
            "Source": "earnings"
        },
        {
            "Title": "Dhampur Sugar Mills Faces ₹37.73 Crore Import/Export Fee Demand from UP Government",
            "Summary": "Dhampur Sugar Mills Limited has received a notice from the Assistant Excise Commissioner, Government of Uttar Pradesh, reinstating an import/export fee of ₹1 per bulk litre on denatured/special denatured spirit. The fee covers the period from FY 2018-19 to FY 2024-25, following a Supreme Court order dated October 23, 2024, which upheld the State's authority to levy such fees on denatured alcohol. The total financial impact amounts to ₹37.73 crores for the Dhampur unit. The company is contesting this decision and evaluating legal options through appropriate forums.",
            "Sentiment": "negative",
            "PublishDate": 1753449125957,
            "Source": "stock"
        },
        {
            "Title": "Dhampur Sugar Issues ₹100 Crore Commercial Paper",
            "Summary": "Dhampur Sugar has issued commercial paper worth ₹100 crore. No additional details about the terms, duration, or purpose of the commercial paper issuance were provided.",
            "Sentiment": "neutral",
            "PublishDate": 1753444701864,
            "Source": "stock"
        },
        {
            "Title": "Dhampur Sugar Mills Issues ₹100 Crore Commercial Paper with 6.95% Interest Rate",
            "Summary": "Dhampur Sugar Mills Limited has issued and allotted commercial paper worth ₹100 crores with a 77-day tenure, maturing on October 10, 2025. The commercial paper carries an interest rate of 6.95% and has been issued to Kotak Mahindra Bank Limited. The instrument has received an IND A1+ credit rating from India Ratings and Research Private Limited and will be listed on BSE Limited. The issue comprises 2,000 commercial paper units with an issue value of ₹98.56 crores and redemption value of ₹100 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1753444589365,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhampur Sugar Mills Approves Share Buyback and Reports Q4 Results",
            "Summary": "Dhampur Sugar Mills has approved a share buyback program with a total consideration not exceeding 200 million rupees. The company also reported its Q4 financial results. Revenue increased to 8.1 billion rupees from 6.7 billion rupees year-over-year. EBITDA rose to 1 billion rupees from 961 million rupees, but the EBITDA margin decreased to 12.37% from 14.41%. Net profit for Q4 was 493.8 million rupees, down from 517 million rupees year-over-year but up from 149.7 million rupees quarter-on-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747400146000,
            "Source": "default"
        },
        {
            "Title": "Dhampur Sugar Mills Ltd: Q4 Profit Dips, Revenue Rises 10% YoY",
            "Summary": "Dhampur Sugar Mills Ltd reported a 5.4% YoY decline in Q4 FY25 consolidated net profit to ₹49 crore. Revenue grew 10% YoY to ₹619 crore. EBITDA increased 4.9% to ₹100.7 crore, while EBITDA margin contracted to 16.3% from 17.1% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1747398457000,
            "Source": "earnings"
        },
        {
            "Title": "Dhampur Sugar Mills Issues Commercial Paper Worth 1 Billion Rupees",
            "Summary": "Dhampur Sugar Mills has issued commercial paper valued at 1 billion rupees (approximately $12 million USD). Commercial paper is a short-term, unsecured debt instrument typically used by corporations for financing short-term liabilities.",
            "Sentiment": "neutral",
            "PublishDate": 1741306874000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhampur Sugar Mills Issues Commercial Paper Worth 1 Billion Rupees",
            "Summary": "Dhampur Sugar Mills has issued commercial paper valued at 1 billion rupees. Commercial paper is a short-term unsecured promissory note, typically used by corporations to raise funds for immediate needs or to manage cash flow.",
            "Sentiment": "neutral",
            "PublishDate": 1741265682000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhampur Sugar Mills Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Dhampur Sugar Mills has reported a decrease in its third quarter EBITDA, which fell to 410 million rupees from 540 million rupees in the same period last year. The company's EBITDA margin also declined, dropping to 6.98% from 11.20% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738833848000,
            "Source": "earnings"
        },
        {
            "Title": "Dhampur Sugar Mills Reports Q3 Revenue Growth",
            "Summary": "Dhampur Sugar Mills has reported a revenue of 5.9 billion rupees for the third quarter, compared to 4.82 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738833735000,
            "Source": "earnings"
        },
        {
            "Title": "Dhampur Sugar Mills Reports Significant Drop in Q3 Net Profit",
            "Summary": "Dhampur Sugar Mills has reported a consolidated net profit of 15.2 million rupees for the third quarter, marking a substantial decrease from 316 million rupees in the same period last year. This represents a year-over-year decline of approximately 95% in the company's quarterly earnings.",
            "Sentiment": "negative",
            "PublishDate": 1738833706000,
            "Source": "earnings"
        }
    ]
}