{
    "Symbol": "DHANUKA",
    "ISIN": "INE435G01025",
    "News": [
        {
            "Title": "Dhanuka Agritech Gets Rs 14.96 Cr Entry Tax Demand",
            "Summary": "Dhanuka Agritech received entry tax demand orders totaling Rs 14.96 crore from Haryana's Excise & Taxation Department for FY2015-18. Company plans to challenge the orders, expects no financial impact.",
            "Sentiment": "negative",
            "PublishDate": 1770393423794,
            "Source": "stocks"
        },
        {
            "Title": "Dhanuka Agritech Q3FY26 Results Call on Feb 5",
            "Summary": "Dhanuka Agritech has scheduled a conference call on February 5, 2026 at 4:00 PM IST to discuss Q3FY26 and nine-month financial results with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1769767596050,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dhanuka Agritech Receives ₹1.64 Cr GST Demand Order",
            "Summary": "Dhanuka Agritech received a GST demand order worth ₹1.64 crores from Rajasthan government for alleged non-payment on directors' remuneration and miscellaneous receipts. Company plans to appeal.",
            "Sentiment": "negative",
            "PublishDate": 1766064820091,
            "Source": "stocks"
        },
        {
            "Title": "Dhanuka Agritech Appoints New General Manager",
            "Summary": "Dhanuka Agritech Limited announces the appointment of Mr. Mahesh Parshuram Sonawane as General Manager-Quality, effective December 15, 2025. The new appointee brings over 22 years of quality management experience.",
            "Sentiment": "positive",
            "PublishDate": 1765784572514,
            "Source": "stocks"
        },
        {
            "Title": "Dhanuka Agritech Faces ₹121.32 Cr GST Demand",
            "Summary": "Dhanuka Agritech receives GST demand order of ₹121.32 crore from Central GST Ahmedabad. Company considers the demand unjust and is exploring appeal options against the order.",
            "Sentiment": "negative",
            "PublishDate": 1765376689420,
            "Source": "stocks"
        },
        {
            "Title": "Dhanuka Agritech Receives ₹121.32 Crore GST Demand Order, Plans Appeal",
            "Summary": "Dhanuka Agritech received a GST demand order worth ₹121.32 crore from Central Goods & Service Tax, Ahmedabad. The company considers the demand unjustified and is evaluating appeal options against the order.",
            "Sentiment": "negative",
            "PublishDate": 1765351937509,
            "Source": "stock"
        },
        {
            "Title": "Dhanuka Agritech Q2 FY26 Revenue Falls 8.6% to ₹598 Crores Due to Weather Disruptions",
            "Summary": "Dhanuka Agritech reported revenue of ₹598.25 crores in Q2 FY26, down from ₹654.28 crores in Q2 FY25. EBITDA declined to ₹136.73 crores from ₹159.58 crores, while profit after tax dropped to ₹93.97 crores from ₹117.52 crores. The company attributed the decline to abnormal rainfall distribution causing crop losses and reduced agrochemical demand. Herbicides segment was most affected, contributing only 9% of turnover. The company received registration for Ipflufenoquin for paddy crops and started trial production of Difenoconazole at its Dahej plant. Biostimulant sales faced regulatory hurdles, impacting revenue by over ₹20 crores. Dahej plant generated ₹22 crores revenue with a marginal EBITDA loss of ₹46 lakhs. Bayer product royalty income was ₹4.5 crores in the quarter. Management expects flat revenue growth for FY26 due to weather challenges and delayed rabi season.",
            "Sentiment": "negative",
            "PublishDate": 1762284624300,
            "Source": "earnings"
        },
        {
            "Title": "Dhanuka Agritech Board Approves Nagpur Land Acquisition; Q2 Results Show Revenue and Profit Decline",
            "Summary": "Dhanuka Agritech's board has approved land acquisition in Nagpur for establishing a new formulation plant. The company reported Q2 financial results showing revenue of 6 billion rupees compared to 6.5 billion rupees in the previous year. EBITDA declined to 1.4 billion rupees from 1.6 billion rupees year-over-year, with EBITDA margin dropping to 22.86% from 24.39%. Net profit decreased to 940 million rupees from 1.18 billion rupees compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1761894489705,
            "Source": "stock"
        },
        {
            "Title": "Dhanuka Agritech Appoints Sujoy Chakrabarti as Vice President - Sales",
            "Summary": "Dhanuka Agritech Limited appointed Mr. Sujoy Chakrabarti as Vice President - Sales, effective August 11, 2025. The appointment is classified as a Senior Management Personnel position within the company. Chakrabarti brings 30 years of experience in the telecom and consumer industries in India, with expertise in strategic growth planning, product launches, digitization, and brand building. He has proven skills in driving revenue through B2B partnerships, D2C, retail, and freelance channels, and is experienced in leading marketing campaigns and engaging with top-tier stakeholders including chairpersons, CEOs, and MDs. The appointment is on a full-time employment basis.",
            "Sentiment": "positive",
            "PublishDate": 1754976849374,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dhanuka Agritech Reports 7% Revenue Growth to ₹528 Crores in Q1 FY26 Despite Monsoon Challenges",
            "Summary": "Dhanuka Agritech Limited reported revenue of ₹528.29 crores for Q1 FY26, representing 7% growth compared to ₹493.58 crores in the previous year. EBITDA increased to ₹83.19 crores from ₹71.72 crores, while profit after tax rose to ₹55.5 crores from ₹48.89 crores. The company faced challenges from delayed monsoon onset affecting Kharif crop sowing and elevated channel inventories in herbicide segments, particularly impacting soybean and cotton markets. Management maintains double-digit revenue growth guidance for the full year despite expecting a 100 basis point decline in EBITDA margins. The company launched one new product, Dinkar herbicide for paddy crops, and expects to introduce a second product from its Dahej plant in H2 FY26. Dahej plant reported ₹16.5 crores revenue with ₹3 crores EBITDA loss in Q1. The board declared a final dividend of 100% (₹2 per share) and completed a ₹100 crore share buyback program.",
            "Sentiment": "neutral",
            "PublishDate": 1754314021576,
            "Source": "earnings"
        },
        {
            "Title": "Dhanuka Agritech Reports 13.5% Revenue Growth in Q1 with Profit Rising to ₹555 Crore",
            "Summary": "Dhanuka Agritech Limited reported revenue from operations of ₹52,828.81 lacs for the quarter ended June 30, 2025, compared to ₹49,357.81 lacs in the same quarter last year. The company's profit for the period increased to ₹5,550.34 lacs from ₹4,889.51 lacs in the corresponding quarter of the previous year. Basic earnings per share stood at ₹12.31 compared to ₹10.73 in the same quarter last year. Total expenses for the quarter were ₹46,178.63 lacs, with cost of materials consumed being the largest component at ₹36,145.86 lacs. The company operates in a single business segment of agro chemicals and noted that demand for its products depends on monsoon, pest infestation and crop patterns, which may cause variations in results across periods.",
            "Sentiment": "positive",
            "PublishDate": 1754036727987,
            "Source": "earnings"
        },
        {
            "Title": "Dhanuka Agritech Reports Strong Q1 Growth with Revenue Up 8% to 5.3 Billion Rupees",
            "Summary": "Dhanuka Agritech delivered solid quarterly performance with revenue increasing to 5.3 billion rupees from 4.9 billion rupees year-over-year. Net profit rose to 555 million rupees compared to 489 million rupees in the same period last year. The company's EBITDA grew to 832 million rupees from 717 million rupees, while EBITDA margin improved to 15.8% from 14.5% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1754036394201,
            "Source": "earnings"
        },
        {
            "Title": "Dhanuka Agritech Independent Director Siraz Azmat Chaudhary to Step Down After Completing First Term",
            "Summary": "Dhanuka Agritech Limited announced that Mr. Siraz Azmat Chaudhary, Independent Director with DIN 00161853, will cease to be a director effective July 22, 2025, upon completion of his first term. The Board of Directors acknowledged his contributions during his tenure. The company has informed stock exchanges NSE and BSE about this cessation and will update the information on their website.",
            "Sentiment": "neutral",
            "PublishDate": 1753160641748,
            "Source": "corporate_governance"
        },
        {
            "Title": "Cabinet Expected to Approve PM Dhan Dhanya Krishi Yojana for 100 Low-Productivity Districts",
            "Summary": "The Indian Cabinet is anticipated to approve the PM Dhan Dhanya Krishi Yojana, a scheme targeting 100 low-productivity districts. This initiative is likely aimed at improving agricultural productivity in these areas. The news mentions Dhanuka Agritech in connection with this development, suggesting potential implications for the company.",
            "Sentiment": "positive",
            "PublishDate": 1752643193000,
            "Source": "default"
        },
        {
            "Title": "Dhanuka Agritech: Q4 Results Drive 12% Stock Surge",
            "Summary": "Dhanuka Agritech reported strong Q4 results with net profit up 28.8% to ₹76.6 crore and revenue up 20% to ₹442 crore. EBITDA increased 37% with margins expanding to 24.8%. The board approved a final dividend of ₹2 per share. The stock jumped 12.1% to ₹1,628 following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1747383559000,
            "Source": "earnings"
        },
        {
            "Title": "Dhanuka Agritech Reports Strong Q4 Results and Declares Dividend",
            "Summary": "Dhanuka Agritech announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 1.09 billion rupees from 801 million rupees, with EBITDA margin rising to 24.83% from 21.75%. Revenue grew to 4.4 billion rupees from 3.7 billion rupees. Net profit also saw an increase, reaching 755 million rupees compared to 590 million rupees in the previous year. Additionally, the company declared a dividend of 2 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747380373000,
            "Source": "result"
        },
        {
            "Title": "Dhanuka Agritech: Rs 2,000 Crore Revenue Target by FY26, Boosted by Bayer Deal",
            "Summary": "Dhanuka Agritech aims for Rs 2,000 crore revenue in FY26 and Rs 2,300 crore in FY27, driven by a Rs 165-crore deal with Bayer AG for marketing rights of two fungicides. The company expects 17% growth, with 15% from existing business and 2% from the Bayer acquisition. The deal covers over 20 countries, focusing on Europe and Asia markets.",
            "Sentiment": "positive",
            "PublishDate": 1743777394000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhanuka Agritech Reports Improved Q3 EBITDA and Margin",
            "Summary": "Dhanuka Agritech has announced its Q3 financial results. The company's EBITDA increased to 756 million rupees, up from 622 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 16.97% from 15.42% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738566747000,
            "Source": "earnings"
        },
        {
            "Title": "Dhanuka Agritech Reports Strong Q3 Financial Results",
            "Summary": "Dhanuka Agritech has announced its financial results for the third quarter. The company's net profit increased to 550 million rupees, up from 453 million rupees in the same period last year. Revenue also saw growth, reaching 4.45 billion rupees compared to 4 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738566730000,
            "Source": "earnings"
        },
        {
            "Title": "Dhanuka Agritech to Consider Q3 Results on February 3",
            "Summary": "Dhanuka Agritech has announced that it will consider its third quarter (Q3) financial results on February 3. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737983299000,
            "Source": "earnings"
        },
        {
            "Title": "Dhanuka Agritech Maintains Growth and Margin Improvement Guidance",
            "Summary": "In a management meeting, Dhanuka Agritech has reaffirmed its guidance for the second half of fiscal year 2025. The company expects to achieve 16% growth and a year-over-year EBITDA margin improvement of 100 basis points.",
            "Sentiment": "positive",
            "PublishDate": 1735184290000,
            "Source": "earnings"
        },
        {
            "Title": "Dhanuka Agritech: Targets 18% Revenue, 20% Volume Growth in FY25",
            "Summary": "Dhanuka Agritech aims for 18% revenue growth and 20% volume increase in FY25, driven by new product launches and a strategic partnership with Bayer AG. The company has launched three new products this fiscal year and plans to introduce more in the next 12 months. Dhanuka Agritech acquired international rights to Iprovalicarb and Triadimenol from Bayer AG, which had global revenue of Rs 200 crore for these products in 2023.",
            "Sentiment": "positive",
            "PublishDate": 1732941093000,
            "Source": "normal_news"
        },
        {
            "Title": "Dhanuka Agritech Acquires Crop Protection Ingredients from Bayer AG",
            "Summary": "Dhanuka Agritech has entered into an agreement with Bayer AG to acquire two crop protection active ingredients, Iprovalicarb and Triadimenol. This acquisition is aimed at expanding Dhanuka Agritech's business operations in both Indian and international markets.",
            "Sentiment": "positive",
            "PublishDate": 1732507497000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhanuka Agritech: Positive Q2 Outlook and Upgraded Margin Guidance",
            "Summary": "Dhanuka Agritech reports a positive outlook for the Rabi season in their Q2 review. Management has upgraded their margin guidance, indicating improved financial prospects.",
            "Sentiment": "positive",
            "PublishDate": 1730963480000,
            "Source": "result"
        },
        {
            "Title": "Dhanuka Agritech Announces FY 2024-25 Guidance",
            "Summary": "Dhanuka Agritech has released its financial guidance for the fiscal year 2024-25. The company is projecting a double-digit growth of approximately 16% in revenue from operations. Additionally, they expect an improvement of about 100 basis points in EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization).",
            "Sentiment": "positive",
            "PublishDate": 1730905849000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhanuka Agritech: Q2 Results Drive 8% Stock Surge",
            "Summary": "Dhanuka Agritech's Q2 FY25 results show 15.5% YoY net profit growth to ₹117 crore, 6% revenue increase to ₹654 crore, and EBITDA margin expansion to 42.2%. H1 FY25 revenue up 16% YoY to ₹1,148 crore. Company approved buyback of 5 lakh equity shares for ₹100 crore in August.",
            "Sentiment": "positive",
            "PublishDate": 1730882293000,
            "Source": "result"
        },
        {
            "Title": "Dhanuka Agritech Reports Improved Q2 Financial Performance",
            "Summary": "Dhanuka Agritech has announced its Q2 financial results, showing an increase in EBITDA to 1.6 billion rupees from 1.4 billion rupees year-over-year. The company's EBITDA margin also improved, rising to 24.39% from 22.91% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730878345000,
            "Source": "result"
        },
        {
            "Title": "Dhanuka Agritech Reports Q2 Revenue Growth",
            "Summary": "Dhanuka Agritech has announced its second quarter revenue, which amounts to 6.5 billion rupees. This represents an increase from the 6.2 billion rupees reported in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1730878338000,
            "Source": "result"
        },
        {
            "Title": "Dhanuka Agritech Reports Q2 Net Profit Increase",
            "Summary": "Dhanuka Agritech has reported a net profit of 1.18 billion rupees for the second quarter, compared to 1 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730878297000,
            "Source": "result"
        }
    ]
}