{
    "Symbol": "DHANBANK",
    "ISIN": "INE680A01011",
    "News": [
        {
            "Title": "Dhanlaxmi Bank Q3 Net Profit Rises 20.7% YoY",
            "Summary": "Dhanlaxmi Bank reported a net profit of ₹23.90 crores in Q3, marking a significant 20.7% year-on-year growth from ₹19.80 crores in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1768986662522,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dhanlaxmi Bank shares surge 8% on Q3 business update",
            "Summary": "Dhanlaxmi Bank shares jumped 8% following Q3 FY26 business update showing 20.76% total business growth, with advances up 23.90% and gold loans surging 50.89% year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1767590261366,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dhanlaxmi Bank Appoints Sujatha Jaganathan as Additional Director",
            "Summary": "Reserve Bank of India appointed Smt. Sujatha Jaganathan, General Manager at RBI, as Additional Director on Dhanlaxmi Bank's Board, replacing Shri. D.K Kashyap for a two-year term from November 19, 2025 to November 18, 2027. The appointment brings over 23 years of RBI experience in areas including Bank Supervision, Currency Management, and Financial Inclusion to the bank's leadership.",
            "Sentiment": "neutral",
            "PublishDate": 1763481012546,
            "Source": "corporate_governance"
        },
        {
            "Title": "Three Financial Institutions Report Mixed September Quarter Results",
            "Summary": "Capital Small Finance Bank reported a 5% increase in net profit to Rs 35 crore despite higher provisions of Rs 16 crore and gross NPAs rising to 2.70%. The bank's gross advances grew 18% to Rs 7,907 crore while deposits increased 20% to Rs 9,317 crore. Net interest margin declined to 4% from 4.10% in the previous quarter. Satin CreditCare posted a 19% jump in net profit to Rs 45 crore with net interest margins improving to 14.69% from 13.68% the previous year. Net interest income rose 12.8% to Rs 404 crore and disbursements grew 6.4% to Rs 2,275 crore. Dhanlaxmi Bank turned profitable with Rs 12.18 crore net profit compared to Rs 8 crore loss in the previous year. The bank's net interest income surged 39.3% to Rs 139 crore, though gross NPAs increased to 3.22% from 2.98%. Total deposits grew 17% to Rs 17,103 crore and gross advances rose 18% to Rs 12,779 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1761801657061,
            "Source": "earnings"
        },
        {
            "Title": "Dhanlaxmi Bank Reports Mixed Q2 Results with Revenue Growth but Lower Profit",
            "Summary": "Dhanlaxmi Bank reported quarterly net profit of 232 million rupees, down from 258 million rupees year-over-year. Revenue increased to 3.84 billion rupees from 3.3 billion rupees compared to the same period last year. The bank's asset quality showed improvement with Gross Non-Performing Assets (GNPA) declining to 3.10% from 3.22% quarter-over-quarter, while Net Non-Performing Assets (NNPA) decreased slightly to 1.12% from 1.13% quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1761731666643,
            "Source": "earnings"
        },
        {
            "Title": "Dhanlaxmi Bank Reports 17.5% Business Growth in Q2, Turns Profitable in Q1",
            "Summary": "Dhanlaxmi Bank reported total business growth of 17.5% year-on-year to ₹30,147 crore for the second quarter ended June 30, 2025. Total deposits increased 17% to ₹17,103 crore and gross advances grew 18% to ₹13,044 crore. CASA deposits rose 6.56% to ₹4,937 crore. The bank turned profitable in the first quarter with net profit of ₹12.18 crore compared to a net loss of ₹8 crore in the same quarter last year. Net interest income jumped 39.3% to ₹139 crore from ₹99.89 crore. However, asset quality deteriorated with gross NPAs rising to 3.22% from 2.98% in the March quarter, and net NPAs increasing to 1.13% from 1%. Bank shares closed 0.68% higher at ₹25.32 on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1759504242394,
            "Source": "earnings"
        },
        {
            "Title": "Dhanlaxmi Bank Reports Strong Q2 Growth with Deposits Rising to 171 Billion and Advances at 130 Billion",
            "Summary": "Dhanlaxmi Bank reported quarterly results showing total deposits expected at 171 billion, representing an increase from 146 billion in the same period last year. The bank's gross advances are projected at 130 billion, up from 110 billion year-over-year. The deposits grew by 25 billion while gross advances increased by 20 billion compared to the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1759499177063,
            "Source": "earnings"
        },
        {
            "Title": "Dhanlaxmi Bank Reports Turnaround with Q1 Net Profit of 122M Rupees After Previous Year Loss",
            "Summary": "Dhanlaxmi Bank achieved a net profit of 122 million rupees in Q1, marking a significant turnaround from a loss of 80 million rupees in the same quarter last year. The bank's revenue grew to 3.68 billion rupees compared to 3.06 billion rupees year-over-year. However, asset quality showed some deterioration with Gross Non-Performing Assets (GNPA) rising to 3.22% from 2.98% in the previous quarter, while Net Non-Performing Assets (NNPA) increased to 1.13% from 0.99% quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753106196241,
            "Source": "earnings"
        },
        {
            "Title": "Dhanlaxmi Bank to Review Q1 Results on July 21",
            "Summary": "Dhanlaxmi Bank has announced that it will review its first quarter (Q1) results on July 21. The bank has scheduled this review to assess its financial performance for the most recent quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1751977000000,
            "Source": "default"
        },
        {
            "Title": "Dhanlaxmi Bank Reports 15.8% YoY Growth in Total Business for Q1FY26",
            "Summary": "Dhanlaxmi Bank has reported a 15.8% year-over-year growth in total business, reaching ₹29,054 crore for the first quarter of fiscal year 2026.",
            "Sentiment": "positive",
            "PublishDate": 1751846872000,
            "Source": "default"
        },
        {
            "Title": "Dhanlaxmi Bank: Q1 Business Grows 16% YoY, Gold Loans Surge 28%",
            "Summary": "Dhanlaxmi Bank reported a 15.8% YoY increase in total business for Q1 FY26, reaching ₹29,054 crore. Gross advances grew 17.3% YoY to ₹12,484 crore, with gold loans jumping 28.1% YoY to ₹4,039 crore. Total deposits rose 14.7% YoY to ₹16,570 crore, while CASA deposits increased 3.8% YoY to ₹4,675 crore.",
            "Sentiment": "positive",
            "PublishDate": 1751707793000,
            "Source": "result"
        },
        {
            "Title": "Dhanlaxmi Bank Reports 15.8% Growth in Total Business for Q1",
            "Summary": "Dhanlaxmi Bank has reported a 15.8% year-on-year growth in total business, reaching ₹29,054 crores for the first quarter. The bank's performance indicates positive financial results for the specified period.",
            "Sentiment": "positive",
            "PublishDate": 1751702664000,
            "Source": "default"
        },
        {
            "Title": "Dhanlaxmi Bank Limited: Q4 Net Profit Soars 775.5%, Annual Profit Up 15.25%",
            "Summary": "Dhanlaxmi Bank reported a 775.53% increase in Q4 net profit to ₹28.98 crore. FY25 net profit rose 15.25% to ₹66.64 crore. Total operating income for FY25 grew 9.35% to ₹1,319.88 crore. Gross NPAs declined to 2.98% from 4.05%. Capital adequacy ratio improved to 16.12% following a rights issue.",
            "Sentiment": "positive",
            "PublishDate": 1746790296000,
            "Source": "earnings"
        },
        {
            "Title": "Dhanlaxmi Bank Reports Strong Q4 Financial Results",
            "Summary": "Dhanlaxmi Bank has announced its Q4 financial results, showing significant improvements. The bank's revenue increased from 3.06 billion rupees to 3.5 billion rupees year-over-year. Net profit saw a substantial rise from 33 million rupees to 290 million rupees compared to the same period last year. The Gross Non-Performing Asset (GNPA) ratio improved to 2.98% from 3.53% quarter-on-quarter, while the Net Non-Performing Asset (NNPA) ratio slightly increased to 0.99% from 0.86% quarter-on-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1746778581000,
            "Source": "result"
        },
        {
            "Title": "Dhanlaxmi Bank Approves Issue of Unsecured Non-convertible Debentures",
            "Summary": "Dhanlaxmi Bank's board has approved the issuance of unsecured non-convertible debentures up to 1.50 billion rupees. This decision represents a significant financial move for the bank, potentially aimed at raising capital or restructuring debt.",
            "Sentiment": "neutral",
            "PublishDate": 1742429107000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhanlaxmi Bank Approves Issuance of Unsecured Non-Convertible Debentures",
            "Summary": "Dhanlaxmi Bank's board has approved the issuance of unsecured non-convertible debentures up to 1.50 billion rupees. This decision represents a significant financial move for the bank, potentially aimed at raising capital or refinancing existing debt.",
            "Sentiment": "neutral",
            "PublishDate": 1742385267000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhanlaxmi Bank to Consider Fund Raising via Basel III Compliant Tier-II Bonds",
            "Summary": "Dhanlaxmi Bank has scheduled a board meeting on February 22 to consider and approve a proposal for raising funds through the issuance of non-convertible debentures. These debentures will be in the form of Basel III compliant Tier-II bonds, which are designed to strengthen the bank's capital structure and meet regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1739534001000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhanlaxmi Bank Reports Significant Profit Growth in Q3",
            "Summary": "Dhanlaxmi Bank has reported a substantial increase in net profit for the third quarter, rising to 199 million rupees from 30.5 million rupees year-over-year. The bank's revenue also grew to 3.35 billion rupees from 3.1 billion rupees in the same period last year. Additionally, the bank's asset quality improved, with Gross Non-Performing Assets (GNPA) decreasing to 3.53% from 3.82% quarter-over-quarter, and Net Non-Performing Assets (NNPA) reducing to 0.86% from 1.12%.",
            "Sentiment": "positive",
            "PublishDate": 1738714807000,
            "Source": "earnings"
        },
        {
            "Title": "Dhanlaxmi Bank: Q3 Profit Surges 6.5x, Plans Rights Issue",
            "Summary": "Dhanlaxmi Bank reported a Q3 net profit of Rs 19.85 crore, up 6.5 times year-over-year. The bank's board approved raising Rs 298 crore via a rights issue. Total income increased to Rs 377 crore, with net interest income rising 12%. Asset quality improved with gross NPA ratio falling to 3.53%.",
            "Sentiment": "positive",
            "PublishDate": 1738678656000,
            "Source": "earnings"
        },
        {
            "Title": "Dhanlaxmi Bank Reports Improved Asset Quality in Q3",
            "Summary": "Dhanlaxmi Bank has reported an improvement in its asset quality for the third quarter. The bank's Gross Non-Performing Assets (GNPA) ratio decreased to 3.53% from 3.82% in the previous quarter. Similarly, the Net Non-Performing Assets (NNPA) ratio improved to 0.86% from 1.12% quarter-on-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738674066000,
            "Source": "result"
        },
        {
            "Title": "Dhanlaxmi Bank Reports Significant Profit Growth in Q3",
            "Summary": "Dhanlaxmi Bank has announced its financial results for the third quarter. The bank's net profit increased substantially to 199 million rupees, compared to 30.5 million rupees in the same quarter last year, representing a year-over-year growth. The profit also showed a quarter-over-quarter increase from 326 million rupees. Revenue for Q3 rose to 3.35 billion rupees from 3.1 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738674009000,
            "Source": "earnings"
        },
        {
            "Title": "Dhanlaxmi Bank Reports Q3 Business Growth Across Key Metrics",
            "Summary": "Dhanlaxmi Bank has reported significant year-over-year growth in Q3 across various business segments. Total business grew by 7.26%, total deposits increased by 5.07%, and CASA (Current Account Savings Account) saw a 3.18% rise. Notably, gross advances expanded by 10.30%, while gold loans showed a substantial growth of 32.82%.",
            "Sentiment": "positive",
            "PublishDate": 1736122220000,
            "Source": "result"
        },
        {
            "Title": "Dhanlaxmi Bank Reports Q3 Growth in CASA, Advances, and Gold Loans",
            "Summary": "Dhanlaxmi Bank has announced its Q3 performance, showing year-over-year growth across key metrics. The bank's Current Account Savings Account (CASA) deposits grew by 3.18%, gross advances increased by 10.30%, and gold loans saw a significant rise of 32.82% compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1735904691000,
            "Source": "earnings"
        },
        {
            "Title": "Dhanlaxmi Bank Reports Growth in Q3 Total Business and Deposits",
            "Summary": "Dhanlaxmi Bank has announced its Q3 performance, showing positive growth trends. The bank's total business saw a year-over-year increase of 7.26%, while total deposits grew by 5.07% compared to the same period last year. These figures indicate a steady improvement in the bank's financial position and customer base.",
            "Sentiment": "positive",
            "PublishDate": 1735904683000,
            "Source": "earnings"
        },
        {
            "Title": "Dhanlaxmi Bank: Share Price Drops 9% on Rights Issue Ex-Date",
            "Summary": "Dhanlaxmi Bank's stock fell over 9% as it turned ex-date for a rights issue. The bank plans to raise Rs 297.54 crore by issuing 14.16 crore shares at Rs 21 per share. Eligible shareholders can receive 14 shares for every 25 held. The subscription window is from January 8 to January 28.",
            "Sentiment": "neutral",
            "PublishDate": 1735281421000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhanlaxmi Bank: Board Approves Rs 297-Crore Rights Issue",
            "Summary": "Dhanlaxmi Bank's board approved a rights issue of 14.16 crore shares at Rs 21 per share, aiming to raise Rs 297.54 crore. The record date is set for December 27, with eligible shareholders entitled to 14 shares for every 25 held. The subscription period is from January 8 to January 28, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1735183021000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhanlaxmi Bank Approves Rights Issue of Up to 2.98 Billion Rupees",
            "Summary": "Dhanlaxmi Bank has approved a rights issue to raise up to 2.98 billion rupees. The rights issue price is set at 21 rupees per share, with a rights entitlement ratio of 14 shares for every 25 shares held by existing shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1734654800000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhanlaxmi Bank Approves Rights Issue of Up to 2.98 Billion Rupees",
            "Summary": "Dhanlaxmi Bank has approved a rights issue to raise up to 2.98 billion rupees. The rights issue is priced at 21 rupees per share, with a rights entitlement ratio of 14 shares for every 25 shares held by existing shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1734623021000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhanlaxmi Bank Approves Rights Issue to Raise 3 Billion Rupees",
            "Summary": "The board of Dhanlaxmi Bank has passed a resolution to raise funds through a rights issue. The bank aims to raise 3 billion rupees (approximately $36 million) through this corporate action.",
            "Sentiment": "positive",
            "PublishDate": 1729597829000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhanlaxmi Bank Reports Q2 Interest Earnings Growth",
            "Summary": "Dhanlaxmi Bank has reported its second quarter interest earnings of 3.3 billion rupees, showing an increase from 3 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1729151144000,
            "Source": "result"
        },
        {
            "Title": "Dhanlaxmi Bank Reports Improved Asset Quality in Q2",
            "Summary": "Dhanlaxmi Bank has reported a decrease in both Gross Non-Performing Assets (GNPA) and Net Non-Performing Assets (NNPA) for the second quarter. The GNPA has reduced from 4.04% to 3.82% quarter-on-quarter, while the NNPA has decreased from 1.26% to 1.12% in the same period.",
            "Sentiment": "positive",
            "PublishDate": 1729151089000,
            "Source": "result"
        },
        {
            "Title": "Dhanlaxmi Bank Reports Q2 Net Profit Increase",
            "Summary": "Dhanlaxmi Bank has reported a net profit of 258 million rupees for the second quarter, compared to 232 million rupees in the same period last year, showing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729151064000,
            "Source": "result"
        },
        {
            "Title": "Dhanlaxmi Bank Schedules Board Meeting for Q2 Results",
            "Summary": "<p><span class='neutral'>Dhanlaxmi Bank</span> has announced a <b>board meeting</b> to be held on <span class='neutral'>October 17</span> to <b>consider and approve</b> the <span class='neutral'>financial results</span> for the <span class='neutral'>second quarter</span> of the current fiscal year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728289426000,
            "Source": "result"
        },
        {
            "Title": "Dhanlaxmi Bank Reports Growth in Gross Advances for Q2 FY2024",
            "Summary": "<p><span class='neutral'>Dhanlaxmi Bank</span> has reported its <span class='neutral'>gross advances</span> for the <span class='neutral'>September quarter (Q2)</span> of the fiscal year 2024. The bank's gross advances are expected to reach <b>110 billion rupees</b>, showing a <span class='positive'>year-over-year increase</span> from <b>103 billion rupees</b> in the same quarter last year. This also represents a <span class='positive'>quarter-over-quarter growth</span> from <b>104 billion rupees</b> in the previous quarter.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728119051000,
            "Source": "result"
        },
        {
            "Title": "Dhanlaxmi Bank Reports Increase in Total Deposits for September Quarter",
            "Summary": "<p>Dhanlaxmi Bank has reported its <span class='neutral'>total deposits</span> for the <span class='neutral'>September quarter</span>. The bank's deposits have <span class='positive'>increased</span> to <b>146 billion</b>, up from <b>138 billion</b> <span class='neutral'>year-over-year</span> and <b>143 billion</b> <span class='neutral'>quarter-over-quarter</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728118882000,
            "Source": "result"
        }
    ]
}