{
    "Symbol": "DHARAN",
    "ISIN": "INE278R01034",
    "News": [
        {
            "Title": "Dharan Infra-EPC Settles Dues, Seeks CIRP Withdrawal",
            "Summary": "Dharan Infra-EPC Limited cleared outstanding dues with Tata Capital Housing Finance on December 31, 2025, and is now filing for CIRP withdrawal under Section 12A following NCLAT directions.",
            "Sentiment": "positive",
            "PublishDate": 1768904291567,
            "Source": "stocks"
        },
        {
            "Title": "Dharan Infra-EPC Settles Dues, Seeks CIRP Withdrawal",
            "Summary": "Dharan Infra-EPC Limited settled ₹28.05 crore outstanding dues with Tata Capital Housing Finance on December 31, 2025. NCLAT directed IRP to file Section 12A application for CIRP withdrawal following complete settlement.",
            "Sentiment": "positive",
            "PublishDate": 1766225928516,
            "Source": "co_actions_results"
        },
        {
            "Title": "KBC Global Limited Reports Net Loss of ₹753.21 Lakhs in Q1 FY26 Amid FEMA Compliance Issues",
            "Summary": "KBC Global Limited posted a standalone net loss of ₹753.21 lakhs for the quarter ended June 30, 2025, compared to ₹1,530.04 lakhs loss in the same period last year, with revenue from operations at negative ₹5.84 lakhs. The company faces significant regulatory challenges including FEMA violations related to USD 80.62 million FCCB funds deployment, delayed statutory payments, non-operational construction sites, and a qualified audit opinion raising going concern uncertainties.",
            "Sentiment": "negative",
            "PublishDate": 1765300192257,
            "Source": "earnings"
        },
        {
            "Title": "Dharan Infra-EPC Limited Appoints New Secretarial and Cost Auditors",
            "Summary": "Dharan Infra-EPC Limited's Board of Directors appointed Ms. Bhavika Ghuntla of BYG Associates as Secretarial Auditor for five years and PRO Associates as Cost Auditor for FY 2025-2026 on December 5, 2025. The appointments strengthen the company's audit framework and compliance structure with experienced professionals handling secretarial and cost auditing functions.",
            "Sentiment": "neutral",
            "PublishDate": 1764938746547,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dharan Infra-EPC Limited Independent Director Resigns Due to Personal Commitments",
            "Summary": "Narendra Singh Kharayat resigned from his position as Independent Director of Dharan Infra-EPC Limited with effect from December 01, 2025, citing inability to devote sufficient time due to personal commitments. The resignation affects the company's board composition, with the director confirming no other material reasons for his departure and expressing appreciation for the cooperation received during his tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1764592366106,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dharan Infra-EPC Limited Reports Audited Financial Results with Qualified Opinion on FEMA Violations",
            "Summary": "Dharan Infra-EPC Limited (formerly KBC Global Limited) submitted revised audited standalone and consolidated financial results for the quarter and year ended March 31, 2025, following Board approval on May 30, 2025. The company received a qualified audit opinion due to FEMA regulation violations related to improper end-use of funds raised through Foreign Currency Convertible Bonds and delays in RBI compliance filings.",
            "Sentiment": "negative",
            "PublishDate": 1764241424951,
            "Source": "earnings"
        },
        {
            "Title": "Dharan Infra-EPC Limited Reports Net Loss of Rs 394 Crore with Qualified Audit Opinion",
            "Summary": "Dharan Infra-EPC Limited (formerly KBC Global Limited) reported a net loss of Rs 394.37 crore for the year ended March 31, 2025, compared to Rs 370.76 crore loss in the previous year. The company received a qualified audit opinion due to violations of Foreign Exchange Management Act (FEMA) regulations related to improper end-use of funds raised through Foreign Currency Convertible Bonds (FCCBs) worth USD 80.62 million. The auditors noted significant operational challenges including non-operational construction sites, delays in loan repayments, irregular payment of statutory dues including Income Tax and GST, and material uncertainty about the company's ability to continue as a going concern. The company has filed a compounding application with RBI for FEMA violations, which was returned and needs resubmission. Revenue from operations declined to Rs 179.92 crore from Rs 206.12 crore in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1763035745911,
            "Source": "earnings"
        },
        {
            "Title": "Dharan Infra-EPC Subsidiary Secures ₹215 Crore Solar Project Contract",
            "Summary": "Dharan Infra Solar Private Limited, a wholly-owned subsidiary of Dharan Infra-EPC Limited, has executed a supply agreement with Skymax Infrapower Limited for a solar power project worth ₹215 crore. The contract involves design, supply, and installation of plant equipment for a 75 MW (AC)/95.10 MWp (DC) grid-interactive, ground-mounted solar photovoltaic power project across nine sites in Nanded District, Maharashtra. The project will be executed in phases with completion expected within FY2025-26/FY2026-27. The agreement is considered a material contract in the ordinary course of business with direct impact on the company's consolidated financial and operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1761917061061,
            "Source": "order&deals"
        },
        {
            "Title": "Dharan Infra-EPC CEO Muthusubramanian Hariharan Resigns Due to Professional Commitments",
            "Summary": "Dharan Infra-EPC Limited announced that Muthusubramanian Hariharan has resigned from his position as Chief Executive Officer and director. His resignation was submitted on September 19, 2025, with the last working day being September 15, 2025. The Board of Directors formally accepted the resignation on September 22, 2025. Hariharan cited other professional commitments as the reason for his departure and will not continue with the company in any other capacity. The company experienced a delay in disclosure submission due to the time required for the Board's review and decision-making process.",
            "Sentiment": "neutral",
            "PublishDate": 1758553422594,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dharan Infra-Epc Limited Incorporates Wholly Owned Solar Energy Subsidiary",
            "Summary": "Dharan Infra-Epc Limited has incorporated a wholly owned subsidiary named Dharan Infra Solar Private Limited on August 27, 2025, following board approval on June 13, 2025. The subsidiary operates in the renewable energy and solar power sector, focusing on manufacturing, design, development of renewable energy modules, cells, and accessories, along with solar power projects and hybrid systems. The parent company subscribed to 100% of the initial paid-up share capital of Rs. 1,00,000, comprising 10,000 equity shares of Rs. 10 face value each at par. The subsidiary is registered in Nashik, Maharashtra, India.",
            "Sentiment": "positive",
            "PublishDate": 1756301786466,
            "Source": "corporate_action"
        },
        {
            "Title": "Dharan Infra-EPC Limited Announces Leadership Change as Naresh Karda Steps Down, Devesh Karda Appointed Managing Director",
            "Summary": "Dharan Infra-EPC Limited announced a change in leadership with Mr. Naresh Karda resigning from his position as Managing Director effective August 7, 2025, citing other professional commitments. Karda will continue as a director of the company. The Board of Directors unanimously approved the appointment of Mr. Devesh Karda as the new Managing Director with immediate effect, subject to statutory and shareholder approvals. The outgoing Managing Director's tenure was noted for shaping the company into a leading infrastructure and engineering organization. The new appointee has been actively involved with the company's key projects and strategic initiatives, with the Board expressing confidence in his ability to strengthen market position and deliver value to stakeholders.",
            "Sentiment": "neutral",
            "PublishDate": 1754560588984,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dharan Infra-EPC Limited Executes ₹4.30 Crore One-Time Settlement with Central Bank of India",
            "Summary": "Dharan Infra-EPC Limited has executed a One-Time Settlement (OTS) Agreement with Central Bank of India for resolving outstanding financial obligations. The settlement involves a total value of ₹4.30 Crore, with an initial payment of ₹43,00,000 and the remaining amount to be paid in three installments by January 31, 2026. The company states this settlement will positively impact its balance sheet and strengthen stakeholder credibility. While some loans remain classified under default, the company notes they are secured by collateral valued at approximately double the principal outstanding amount. The company continues pursuing structured solutions for remaining obligations.",
            "Sentiment": "positive",
            "PublishDate": 1753717966453,
            "Source": "stock"
        },
        {
            "Title": "KBC Global: Penny Stock Rebounds Amid Fundraising Plans",
            "Summary": "KBC Global share price rose 2.22% to ₹0.46 on BSE, recovering from recent losses. The company's UK subsidiary, Dharan International, plans to raise £69.975 million for a port development project in Liberia.",
            "Sentiment": "neutral",
            "PublishDate": 1746004705000,
            "Source": "corporate_action"
        },
        {
            "Title": "KBC Global Subsidiary to Raise £69.975M for Buchanan Port Project",
            "Summary": "A subsidiary of KBC Global is set to raise £69.975 million in funds. The capital will be used to finance the Buchanan Port project in Liberia, indicating a significant investment in infrastructure development in the West African nation.",
            "Sentiment": "positive",
            "PublishDate": 1745851369000,
            "Source": "default"
        },
        {
            "Title": "KBC Global: Record Date Set for 1:1 Bonus Share Issue",
            "Summary": "KBC Global has fixed April 4 as the record date for its 1:1 bonus share issue. The stock will trade ex-bonus this week.",
            "Sentiment": "positive",
            "PublishDate": 1743591576000,
            "Source": "corporate_action"
        },
        {
            "Title": "KBC Global: Name Change to Dharan Infra-EPC and 1:1 Bonus Share Issue",
            "Summary": "KBC Global's board approved a 1:1 bonus share issue and plans to rename the company to Dharan Infra-EPC Ltd. The company aims to reduce debt and expand operations. Recent investments of Rs 99.50 crore will be used for debt repayment. The company's order book stands at over Rs 260 crore.",
            "Sentiment": "positive",
            "PublishDate": 1739789877000,
            "Source": "corporate_action"
        },
        {
            "Title": "KBC Global: Five Foreign Firms Acquire Stakes in Sub-₹5 Stock",
            "Summary": "Five foreign companies, including Beacon Stone Capital Vcc, Global Focus Fund, Zeal Global Opportunities Fund, M7 Global Fund Pcc, and Nova Global Opportunities Fund Pcc, have purchased stakes in KBC Global during Q2 FY25. KBC Global's shares are currently priced below ₹5.",
            "Sentiment": "positive",
            "PublishDate": 1731317118000,
            "Source": "normal_news"
        },
        {
            "Title": "KBC Global: Penny Stock Hits 5% Upper Circuit on Project Handovers",
            "Summary": "KBC Global Ltd's share price hit a 5% upper circuit, reaching ₹2.44. The company announced successful handover of 12 units from its projects in October 2024, boosting revenue and earnings outlook. KBC Global also recently announced a preferential warrant issue to raise ₹99.50 crore.",
            "Sentiment": "positive",
            "PublishDate": 1730877715000,
            "Source": "normal_news"
        },
        {
            "Title": "KBC Global: Raises Rs 100 Crore Through Preferential Warrant Issue",
            "Summary": "KBC Global raised Rs 99.50 crore by issuing 45.23 crore warrants at Rs 2.20 each to investors including Falcone Peak Fund, Patanjali companies, and Foresight Holding. Falcone Peak Fund will be the largest investor with a potential 8.48% stake. Proceeds will be used for debt repayment.",
            "Sentiment": "positive",
            "PublishDate": 1729531034000,
            "Source": "corporate_action"
        },
        {
            "Title": "KBC Global: Rs 100 Crore Equity Raise for Debt Reduction",
            "Summary": "<p><span class='neutral'>KBC Global Ltd</span> plans to <span class='positive'>raise up to Rs 100 crore</span> through <b>equity share issuance</b>, with the board meeting on October 16 to approve the proposal. The funds will be used to <span class='positive'>repay debt</span>. The company's current <span class='negative'>outstanding loan is Rs 75.86 crore</span>. KBC Global recently <span class='positive'>regularized its default</span> with Capri Global Capital Ltd, with a <span class='neutral'>remaining balance of Rs 13.50 crore</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1729001636000,
            "Source": "corporate_action"
        }
    ]
}