{
    "Symbol": "DHARMAJ",
    "ISIN": "INE00OQ01016",
    "News": [
        {
            "Title": "Dharmaj Crop Guard Appoints Rohit Sharma as Brand Ambassador",
            "Summary": "Dharmaj Crop Guard Limited announces cricket captain Rohit Sharma as brand ambassador to strengthen domestic brand business division and enhance market presence across 24 states in India.",
            "Sentiment": "positive",
            "PublishDate": 1770829194123,
            "Source": "stocks"
        },
        {
            "Title": "Dharmaj Crop Guard Limited Faces Rs 2.25 Crore GST Penalty Over Tax Compliance Issues",
            "Summary": "Dharmaj Crop Guard Limited received a GST order imposing a penalty of Rs 2,24,92,044 for alleged wrongful ITC availment on solar systems and product misclassification covering April 2018 to March 2024. The company disputes the findings and plans to file an appeal within ninety days, stating no major financial implication expected.",
            "Sentiment": "negative",
            "PublishDate": 1763646426709,
            "Source": "stock"
        },
        {
            "Title": "Dharmaj Crop Guard Appoints Prakash Patel as President for Technical-Regulatory Affairs",
            "Summary": "Dharmaj Crop Guard Limited appointed Mr. Prakash Patel as President (Technical-Regulatory Affairs) effective November 20, 2025, bringing 34 years of agrochemicals experience from companies like Meghmani and Adama India. The appointment strengthens the company's senior managerial team with expertise in production and regulatory operations in the agrochemicals sector.",
            "Sentiment": "positive",
            "PublishDate": 1763619357957,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dharmaj Crop Guard Reports 26% Revenue Growth in H1 FY26 Despite Monsoon Challenges",
            "Summary": "Dharmaj Crop Guard Limited achieved revenue of INR 715 crores in H1 FY26, marking 26% year-on-year growth, with net profit rising to INR 49.9 crores from INR 36.1 crores in H1 FY25. The company faced sequential decline in Q2 due to erratic monsoon patterns affecting agrochemical demand, but remains confident of achieving 20-25% full-year growth guidance with optimistic outlook for the upcoming Rabi season.",
            "Sentiment": "positive",
            "PublishDate": 1763553480237,
            "Source": "earnings"
        },
        {
            "Title": "Dharmaj Crop Guard Reports 26% Revenue Growth in H1FY26, Driven by Strong Formulations Business",
            "Summary": "Dharmaj Crop Guard Limited reported revenue of ₹7,146 million for H1FY26, marking 26% YoY growth, with EBITDA rising 34% to ₹825 million and PAT increasing 38% to ₹499 million. The company's domestic active ingredients segment grew 44% YoY in H1FY26, while management remains optimistic about the upcoming Rabi season supported by favorable moisture and reservoir levels across the country.",
            "Sentiment": "negative",
            "PublishDate": 1763065517767,
            "Source": "earnings"
        },
        {
            "Title": "Dharmaj Crop Guard Limited Schedules Q2H1FY26 Earnings Conference Call",
            "Summary": "Dharmaj Crop Guard Limited has announced a conference call with management to discuss the company's Q2H1FY26 performance. The call is scheduled for Monday, November 17, 2025, at 12:00 PM IST. Management participants include Chairman and Managing Director Rameshbhai Talavia, Whole Time Director Jamankumar Talavia, Chief Executive Officer Vishal Domadia, and Chief Financial Officer Vikas Agarwal. The company has provided toll-free dial-in numbers for various regions including India, Hong Kong, Singapore, and USA. Investors and analysts may also interact with company officials at a later date for follow-up discussions.",
            "Sentiment": "neutral",
            "PublishDate": 1762499870660,
            "Source": "earnings"
        },
        {
            "Title": "Dharmaj Crop Guard Reports Strong Q1 Results, Appoints New Independent Directors",
            "Summary": "Dharmaj Crop Guard Limited reported quarterly results for the period ended June 30, 2025, with revenue from operations of ₹3,673.83 million and net profit of ₹325.87 million, compared to ₹2,552.81 million revenue and ₹150.67 million profit in the same quarter last year. The company's earnings per share increased to ₹9.64 from ₹4.46 in the previous year quarter. The Board appointed Mr. Umesh Menon and Mr. Bhupatray Khunt as Additional Independent Directors for five years, subject to shareholder approval. Mr. Bhaveshkumar Ponkiya resigned as Independent Director due to professional commitments. The company also appointed M/s. D. I. Somaiya and Associates as Strategic Advisor for two years. Dharmaj Crop Guard operates in the agri-inputs segment, manufacturing pesticides, insecticides, herbicides, and fertilizers.",
            "Sentiment": "positive",
            "PublishDate": 1755092475513,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dharmaj Crop Guard Reports Improved Q4 EBITDA",
            "Summary": "Dharmaj Crop Guard has reported a significant improvement in its quarterly EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization). The company's Q4 EBITDA increased to 39 million rupees, compared to a loss of 1 million rupees in the same quarter of the previous year. The Q4 EBITDA margin was reported at 1.86%.",
            "Sentiment": "positive",
            "PublishDate": 1748609962000,
            "Source": "result"
        },
        {
            "Title": "Dharmaj Crop Guard Reports Q4 Financial Results",
            "Summary": "Dharmaj Crop Guard has reported its latest quarterly financial results. The company's Q4 net loss decreased to 24.4 million rupees, compared to a loss of 34 million rupees in the same quarter last year. However, it shows a profit of 12 million rupees compared to the previous quarter. The Q4 revenue increased to 2.1 billion rupees from 1.16 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1748609820000,
            "Source": "result"
        },
        {
            "Title": "Dharmaj Crop Guard Reports Q3 Financial Results",
            "Summary": "Dharmaj Crop Guard has announced its financial results for the third quarter. The company reported a net profit of 12 million rupees, which is a decrease from 58 million rupees in the same quarter of the previous year. However, the company's revenue increased to 1.7 billion rupees from 1.2 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739233366000,
            "Source": "earnings"
        },
        {
            "Title": "Dharmaj Crop Guard Reports Mixed Q3 Results",
            "Summary": "Dharmaj Crop Guard has reported its Q3 financial results. The company's EBITDA increased to 96 million rupees from 88 million rupees in the same quarter last year. However, the EBITDA margin decreased to 5.49% from 7.15% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739192492000,
            "Source": "earnings"
        },
        {
            "Title": "Dharmaj Crop Guard Reports Q3 Financial Results",
            "Summary": "Dharmaj Crop Guard has announced its financial results for the third quarter. The company's net profit decreased to 12 million rupees from 58 million rupees in the same period last year. However, revenue increased to 1.7 billion rupees from 1.2 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739192486000,
            "Source": "earnings"
        },
        {
            "Title": "Dharmaj Crop Guard Optimistic About Rabi Season, Focuses on Unit 2 Expansion",
            "Summary": "The Managing Director of Dharmaj Crop Guard expresses a positive outlook for the upcoming Rabi season, anticipating bumper sowing. The company is actively working to increase production at Unit 2, which is expected to be a significant driver for future growth.",
            "Sentiment": "positive",
            "PublishDate": 1731295431000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dharmaj Crop Guard Reports Q2 Financial Results",
            "Summary": "Dharmaj Crop Guard Limited has announced its Q2 financial results. The company reported a net profit of 210 million rupees, down from 255 million rupees year-over-year, but up from 150 million rupees quarter-over-quarter. Revenue for Q2 stood at 3.11 billion rupees, significantly higher than 1.57 million rupees in the same quarter last year and 1.55 billion rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1731284278000,
            "Source": "result"
        }
    ]
}