{
    "Symbol": "DHRUV",
    "ISIN": "INE506Z01015",
    "News": [
        {
            "Title": "Dhruv Consultancy Wins Rs. 1.74 Cr CPWD Project",
            "Summary": "Dhruv Consultancy Services Limited secures consultancy contract worth Rs. 1,73,57,189 from Central Public Works Department for bridge construction project in West Bengal border areas with 9-month execution timeline.",
            "Sentiment": "positive",
            "PublishDate": 1769243914962,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dhruv Consultancy Wins ₹2.58 Cr NHAI DPR Project",
            "Summary": "Dhruv Consultancy Services receives Letter of Award from NHAI for preparing DPR of Dhule City Ring Road project connecting NH-53 to NH-52 in Maharashtra, valued at ₹2.58 crores with 7-month execution timeline.",
            "Sentiment": "positive",
            "PublishDate": 1768032617407,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dhruv Consultancy Wins ₹4.59 Cr NHAI Highway Project",
            "Summary": "Dhruv Consultancy Services secured a Letter of Award from NHAI for consultancy services worth ₹4.59 crores for preparing DPR for 4-laning of Malegaon-Manmad-Kopargaon highway in Maharashtra.",
            "Sentiment": "positive",
            "PublishDate": 1768032414547,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dhruv Consultancy Gets Credit Rating Reaffirmed",
            "Summary": "CARE Ratings reaffirmed Dhruv Consultancy's BBB- rating but revised outlook from Positive to Stable for bank facilities worth ₹39.50 crore, citing lower growth expectations.",
            "Sentiment": "neutral",
            "PublishDate": 1767874068510,
            "Source": "stocks"
        },
        {
            "Title": "Dhruv Consultancy Services Wins Rs 6.03 Crore NHAI Project Contract",
            "Summary": "Dhruv Consultancy Services Limited in association with Maark Civil Engineering Services has received a Letter of Acceptance for supervision consultancy services for operation and maintenance of Dindigul to Natham section highway project in Tamil Nadu. The contract is valued at Rs 6.03 crore (excluding GST) with a project duration of 60 months, awarded by NHAI's Regional Officer-Madurai.",
            "Sentiment": "positive",
            "PublishDate": 1765285244790,
            "Source": "order&deals"
        },
        {
            "Title": "Dhruv Consultancy Wins Rs 5.25 Crore NHAI Contract for Kerala Highway Projects",
            "Summary": "Dhruv Consultancy Services Limited in association with Dayanandaman Construction Consultant Private Limited has been appointed by National Highway Authority of India for consultancy services to prepare DPR/Feasibility Reports for five highway development projects in Kerala. The contract is valued at Rs 5,25,17,190 plus applicable GST with a project duration of 9 months, covering various highway sections including airport connectivity and bypass roads.",
            "Sentiment": "positive",
            "PublishDate": 1764928067655,
            "Source": "stock"
        },
        {
            "Title": "Dhruv Consultancy Services Wins Rs 450 Crore NHAI Highway Supervision Contract",
            "Summary": "Dhruv Consultancy Services Limited has been appointed by National Highway Authority of India (NHAI) as supervision consultant for four highway packages totaling 44.5km in Maharashtra for Rs 4,50,00,000 (excluding GST). The 60-month project covers supervision consultancy services for operation and maintenance sections across multiple highway segments including NH-4B and NH-348.",
            "Sentiment": "positive",
            "PublishDate": 1764075634644,
            "Source": "stock"
        },
        {
            "Title": "Dhruv Consultancy Reports Q2FY26 Results with Revenue of INR 19.40 Crores, Expands into Aviation Sector",
            "Summary": "Dhruv Consultancy Services achieved consolidated revenue of INR 19.40 crores in Q2FY26 with EBITDA margin of 10.95% and PAT margin of 5.19%, while securing empanelments with multiple government agencies and entering aviation sector through MADG appointment. The infrastructure consultancy company maintains an unexecuted order book of INR 200 crores to be executed over 2.5-3 years, with management expecting improved performance in Q3 and Q4 driven by new sector diversification and client expansion beyond traditional highway projects.",
            "Sentiment": "positive",
            "PublishDate": 1763710691877,
            "Source": "earnings"
        },
        {
            "Title": "Dhruv Consultancy Services Reports ₹40.80 Crore Revenue in H1 FY26",
            "Summary": "Dhruv Consultancy Services Limited announced unaudited financial results for Q2 and H1 FY26, reporting total income of ₹40.80 crore across core consultancy operations. The infrastructure consultancy company secured key empanelments with Public Works Department as ATCC Class-C Consultant and with MSIDC under A Category for DPR preparation, enabling it to bid for projects worth over ₹36,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1763197445988,
            "Source": "earnings"
        },
        {
            "Title": "Dhruv Consultancy Services Reports Joint Auditor Resignation and Q2 Financial Results",
            "Summary": "Dhruv Consultancy Services announced the resignation of joint statutory auditor Mittal & Associates due to their signing partner's departure, with S.N. Karani & Co. continuing as sole auditor. The company also reported quarterly results for the period ended September 30, 2025, with profit after tax of Rs. 100.74 lakhs compared to Rs. 188.79 lakhs in the previous year quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1763055455118,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dhruv Consultancy Services Schedules Q2 FY2025-26 Earnings Call for November 17",
            "Summary": "Dhruv Consultancy Services Limited will conduct an earnings call for Q2 of 2025-26 on Monday, November 17, 2025, at 1:00 PM IST. The call will discuss the company's un-audited financial results for the quarter and half year ended September 30, 2025. The earnings call will be accessible through universal dial-in numbers and Diamond Pass login. Management speakers include Director Pandurang Dandawate, Managing Director Tanvi Auti, and Chief Financial Officer Prashant Ghanekar. The company is listed on BSE with security code 541302 and NSE with scrip symbol DHRUV.",
            "Sentiment": "neutral",
            "PublishDate": 1762803617148,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhruv Consultancy Services Wins Rs 87.3 Crore Highway Engineering Contract from NHAI",
            "Summary": "Dhruv Consultancy Services Limited, in association with Maark Civil Engineering Services Pvt. Ltd, has been appointed as Independent Engineer by National Highway Authority of India (NHAI) for consultancy services during operation and maintenance of highway projects. The appointment covers two major projects: four-laning of Kundapur-Surathkal section and Mangalore to Kerala Border sections of NH-66 in Karnataka, and NH-66 and NH-73 projects under NMPRCL for New Mangalore port road connectivity. The contract is valued at Rs 8.73 crore (excluding GST) with a duration of 60 months. The appointment letter was dated November 6, 2025, and received by the company on November 10, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762774241844,
            "Source": "stock"
        },
        {
            "Title": "Dhruv Consultancy Services Empaneled for Roads and Bridge Projects Supervision with Odisha Bridge & Construction Corporation",
            "Summary": "Dhruv Consultancy Services Limited has been empaneled as a consulting agency for supervising roads and bridge projects with Odisha Bridge & Construction Corporation Limited. The empanelment is valid for 3 financial years until March 31, 2028. The empanelment order was issued on October 23, 2025, and received by the company on October 27, 2025. This empanelment was in response to an Expression of Interest invited by OB&CC Ltd.",
            "Sentiment": "positive",
            "PublishDate": 1761555195668,
            "Source": "stock"
        },
        {
            "Title": "Dhruv Consultancy Services Secures Rs 1.63 Crore Airport Consultancy Contract from MADC",
            "Summary": "Dhruv Consultancy Services Limited has been appointed as a consultant by Maharashtra Airport Development Company Ltd (MADC) for constructing link taxiways at MIHAN, Nagpur. The contract is valued at Rs 1,62,81,600 excluding GST and will span 20 months. The project involves construction of two link taxiways: one approximately 1400m from existing MIHAN Taxiway to 3 Lane Road at sector-10 within processing SEZ, and another approximately 550m from existing MIHAN Taxiway to Relocated IAF Land for Airport Operations. The consideration comprises Part A at Rs 50,10,000 as lump-sum and Part C at 1.01% of estimated or awarded work cost, whichever is lower. This appointment marks the company's entry into airport consultancy segment, expanding beyond its existing highways and infrastructure domain.",
            "Sentiment": "positive",
            "PublishDate": 1759333373540,
            "Source": "order&deals"
        },
        {
            "Title": "Dhruv Consultancy Reports 82% Net Profit Growth in Q1 FY26, Expands to Saudi Arabia",
            "Summary": "Dhruv Consultancy Services Limited reported strong financial performance for Q1 FY26 with consolidated net profit growing 81.81% to ₹1.60 crore compared to ₹0.88 crore in Q1 FY25. Revenue increased 6.89% to ₹21.40 crore from ₹20.02 crore year-over-year. EBITDA rose 30.18% to ₹3.58 crore with margins expanding to 16.72% from 13.75%. The infrastructure consultancy company secured its first international private sector project in Saudi Arabia valued at USD 22,000 for road infrastructure design work. Domestically, the company won a ₹1.94 crore railway infrastructure contract under the SAGARMALA initiative and secured consultancy projects from UPEIDA for expressway development including Jhansi Link Expressway and Ganga Expressway on a per lane km fee basis.",
            "Sentiment": "positive",
            "PublishDate": 1755096973999,
            "Source": "earnings"
        },
        {
            "Title": "Dhruv Consultancy Services Secures Rs 36,000 Crore Project Empanelment and Reports Q1 Results",
            "Summary": "Dhruv Consultancy Services Limited has been empaneled as a Consultant for preparing Detailed Project Reports for road projects of Maharashtra State Infrastructure Development Corporation under the A category. This three-year empanelment allows the company to bid for projects worth over Rs 36,000 crores. The company already acts as Project Management Consultant with MSIDC for 11 packages. The board approved quarterly financial results showing net profit of Rs 159.67 lakhs for Q1 ended June 30, 2025, compared to Rs 87.52 lakhs in the same period last year. The company scheduled its 22nd Annual General Meeting for September 22, 2025, and approved the re-appointment of Mrs. Jayashree P. Dandawate as Executive Director for three years from February 1, 2026 to January 31, 2029. The board also increased Managing Director Mrs. Tanvi Auti's remuneration from Rs 4 lakhs to Rs 5 lakhs per month effective August 1, 2025. Additionally, the board approved amendments to the company's Memorandum of Association to expand business opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1755012695725,
            "Source": "stock"
        },
        {
            "Title": "Dhruv Consultancy Services Appointed as Consultant for MSIDC Road Projects Worth Over 360 Billion Rupees",
            "Summary": "Dhruv Consultancy Services has been appointed as a consultant for MSIDC road projects. The appointment makes the company eligible to bid for projects valued at over 360 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1755009831404,
            "Source": "stock"
        },
        {
            "Title": "Dhruv Consultancy Services Gets 3-Year Empanelment for Traffic Census Services",
            "Summary": "Dhruv Consultancy Services Limited has been empaneled as Automatic Traffic Census and classification (ATCC) Class-I by the Public Works Department Office of Executive Engineer for various consultancy services. The empanelment is valid for a period of 3 years. The company received the empanelment letter on July 31, 2025, which referenced earlier correspondence from November 2024 and July 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753966360778,
            "Source": "stock"
        },
        {
            "Title": "Dhruv Consultancy Services Schedules Board Meeting for Q1 Financial Results on August 12, 2025",
            "Summary": "Dhruv Consultancy Services Limited has scheduled a Board of Directors meeting on August 12, 2025 to consider and approve the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025, along with the limited review report from auditors. The company has implemented a trading window closure for all employees, directors, and their immediate relatives from July 1, 2025 to August 14, 2025. The meeting will also address allied business matters.",
            "Sentiment": "neutral",
            "PublishDate": 1753427468527,
            "Source": "corporate_action"
        },
        {
            "Title": "NHAI Issues Two-Year Debarment Notice to Dhruv Consultancy Services",
            "Summary": "The National Highways Authority of India (NHAI) has issued a debarment notice to Dhruv Consultancy Services, prohibiting the company from participating in NHAI projects for two years. Dhruv Consultancy has stated that this notice will not impact their existing order book or ongoing projects. The company plans to explore possible recourse against the debarment notice.",
            "Sentiment": "negative",
            "PublishDate": 1741739418000,
            "Source": "corporate_governance"
        },
        {
            "Title": "NHAI Issues 2-Year Debarment Notice to Dhruv Consultancy Services",
            "Summary": "The National Highways Authority of India (NHAI) has issued a debarment notice to Dhruv Consultancy Services for a period of two years. The company has stated that this notice will not impact their existing order book or ongoing projects. Dhruv Consultancy Services plans to explore possible recourse against the debarment notice.",
            "Sentiment": "negative",
            "PublishDate": 1741701033000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dhruv Consultancy Services Secures NH-46 Project Contract",
            "Summary": "Dhruv Consultancy Services has received a Letter of Acceptance for a project on National Highway 46. The contract is valued at 63.7 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1740573124000,
            "Source": "order&deals"
        },
        {
            "Title": "Dhruv Consultancy Services Awarded 45 Million Rupee Contract by NHAI",
            "Summary": "Dhruv Consultancy Services has received a Letter of Award from the National Highways Authority of India (NHAI). The contract is valued at 45 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1740572766000,
            "Source": "order&deals"
        },
        {
            "Title": "Dhruv Consultancy Services Joint Venture Awarded 6-Lane Green Field Project",
            "Summary": "Dhruv Consultancy Services has announced that its joint venture has received a Letter of Award for a 6-lane green field project. The contract is valued at 78.5 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1736766370000,
            "Source": "order&deals"
        },
        {
            "Title": "Dhruv Consultancy Services Secures Mumbai Metro Line 5 Project",
            "Summary": "Dhruv Consultancy Services has received a Letter of Acceptance for the Mumbai Metro Line 5 project. The contract is valued at 13.5 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1736514971000,
            "Source": "order&deals"
        },
        {
            "Title": "Dhruv Consultancy Services Limited: Secures Rs2.20 Cr NHAI Contract for Maharashtra Infrastructure Projects",
            "Summary": "Dhruv Consultancy Services Ltd. has been awarded a Rs2.20 Cr contract by NHAI for consultancy services on various infrastructure projects in Maharashtra. The 18-month contract includes work on NH-65, NH-52, and NH-150, covering construction of ROBs, VUPs, service roads, and a flyover. The company will also handle removal of fatal accident spots in Solapur district.",
            "Sentiment": "positive",
            "PublishDate": 1732520101000,
            "Source": "order&deals"
        },
        {
            "Title": "Dhruv Consultancy Services Reports Q2 Financial Results",
            "Summary": "Dhruv Consultancy Services has announced its Q2 financial results. The company's net profit remained stable at 19 million rupees year-over-year, but increased by 9 million rupees quarter-over-quarter. Revenue saw significant growth, rising to 327 million rupees from 229 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731337180000,
            "Source": "result"
        },
        {
            "Title": "Dhruv Consultancy Services Shortlisted for Assam Bridge Program",
            "Summary": "Dhruv Consultancy Services has announced that it has been shortlisted for the Assam Resilient Rural Bridges Program. This program likely aims to improve rural infrastructure in the state of Assam, India, focusing on bridge construction or renovation.",
            "Sentiment": "positive",
            "PublishDate": 1730725712000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhruv Consultancy Services and MAPS Global Civiltech Secure Project Worth 234.6 Million Rupees",
            "Summary": "<p><span class='positive'>Dhruv Consultancy Services</span>, in collaboration with <span class='positive'>MAPS Global Civiltech</span>, has received a <b>Letter of Acceptance (LOA)</b> for a project <span class='positive'>valued at 234.6 million rupees</span>. This development indicates a <span class='positive'>significant business opportunity</span> for both companies in the consulting and civil engineering sectors.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727981234000,
            "Source": "corporate_action"
        }
    ]
}