{
    "Symbol": "DHUNINV",
    "ISIN": "INE320L01011",
    "News": [
        {
            "Title": "Dhunseri Investments CS Nikita Gupta Resigns",
            "Summary": "Dhunseri Investments Limited announces resignation of Company Secretary & Compliance Officer Ms. Nikita Gupta effective January 14, 2026, citing personal reasons for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1768395513458,
            "Source": "stocks"
        },
        {
            "Title": "Dhunseri Investments Reports Mixed Q2 Results with Standalone Loss Despite Consolidated Gains",
            "Summary": "Dhunseri Investments Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. On a standalone basis, the company reported a net loss of Rs 183.48 lakhs for the quarter compared to a profit of Rs 873.24 lakhs in the same period last year. However, the consolidated results showed a net loss of Rs 3,305.45 lakhs for the quarter against a profit of Rs 8,264.65 lakhs in the previous year. For the half year, standalone profit was Rs 595.11 lakhs while consolidated profit reached Rs 5,958.29 lakhs. The company's revenue from operations on a standalone basis was Rs 331.84 lakhs for the quarter, significantly lower than Rs 1,435.05 lakhs in the corresponding quarter last year. The results were impacted by unrealized losses on fair value changes of investments. The company completed the sale of specified assets and transfer of liabilities of Hatibari Tea Factory during the period, resulting in exceptional items of Rs 22.55 lakhs. Earnings per share on a standalone basis was Rs 3.01 for the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762973092909,
            "Source": "earnings"
        },
        {
            "Title": "Dhunseri Investments Independent Director Completes Final Term",
            "Summary": "Dhunseri Investments Limited announced that Mr. Purushottam Jagannath Bhide has completed his second and final term as an Independent Director and ceased to be an Independent Director of the company effective November 8, 2025, at the close of business hours. The cessation was due to completion of tenure as an Independent Director.",
            "Sentiment": "neutral",
            "PublishDate": 1762606751771,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dhunseri Investments Reports 13.7% Growth in Quarterly Net Profit",
            "Summary": "Dhunseri Investments reported consolidated net profit of 530 million rupees for Q1, representing growth from 466 million rupees in the same period last year. The company's revenue increased to 1.85 billion rupees compared to 1.7 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754982714568,
            "Source": "earnings"
        },
        {
            "Title": "Dhunseri Investments Completes Sale of Hatibari Tea Factory",
            "Summary": "Dhunseri Investments Limited has completed the sale of its Hatibari Tea Factory to Hatibari Tea Company through an Asset Transfer Cum Consent and Nomination Agreement dated July 31st, 2025. The company has handed over possession of the tea factory to the buyer. This transaction follows an earlier disclosure made by the company in February 2025 regarding the planned sale.",
            "Sentiment": "neutral",
            "PublishDate": 1753959327973,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhunseri Investments Reports Q4 Results and Dividend Recommendation",
            "Summary": "Dhunseri Investments has announced its Q4 financial results and dividend recommendation. The company's Q4 revenue was 412.6 million rupees, down from 2.79 billion rupees in the same quarter last year. The consolidated net loss for Q4 increased to 582 million rupees, compared to a loss of 142 million rupees in the previous year. However, the company reported a profit of 491 million rupees. Additionally, Dhunseri Investments has recommended a dividend of 3 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747756855000,
            "Source": "result"
        },
        {
            "Title": "Dhunseri Investments Increases Stake in Dhunseri Ventures",
            "Summary": "Dhunseri Investments has purchased 30,78,759 equity shares of Dhunseri Ventures, increasing its stake in the company to 65.23%.",
            "Sentiment": "neutral",
            "PublishDate": 1741651474000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhunseri Investments Increases Stake in Dhunseri Ventures",
            "Summary": "Dhunseri Investments has purchased 30,78,759 equity shares of Dhunseri Ventures, increasing its stake in the company to 65.23%.",
            "Sentiment": "neutral",
            "PublishDate": 1741609454000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhunseri Investments to Sell Hatibari Tea Factory for 63 Million Rupees",
            "Summary": "Dhunseri Investments has signed a Memorandum of Understanding (MoU) to sell its Hatibari Tea Factory. The sale consideration for this transaction is set at 63 million Indian Rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1740355777000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhunseri Investments to Sell Hatibari Tea Factory for 63 Million Rupees",
            "Summary": "Dhunseri Investments has signed a Memorandum of Understanding (MOU) to sell its Hatibari Tea Factory. The sale consideration for this transaction is set at 63 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1740139921000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhunseri Investments Reports Significant Profit Turnaround in Q3",
            "Summary": "Dhunseri Investments has reported a consolidated net profit of 491 million rupees in the third quarter, marking a substantial turnaround from a loss of 60 million rupees in the same period last year. The company's revenue also saw a significant increase, reaching 1.4 billion rupees compared to 721 million rupees in the previous year. Quarter-on-quarter, the net profit improved from 532 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1739405804000,
            "Source": "earnings"
        },
        {
            "Title": "Dhunseri Investments Reports Significant Profit Turnaround in Q3",
            "Summary": "Dhunseri Investments has reported a substantial improvement in its financial performance for the third quarter. The company posted a consolidated net profit of 491 million rupees, compared to a loss of 60 million rupees in the same period last year. This represents a significant turnaround in profitability. Additionally, the company's revenue for Q3 increased to 1.4 billion rupees, up from 721 million rupees in the previous year, indicating strong growth in its business operations.",
            "Sentiment": "positive",
            "PublishDate": 1739360138000,
            "Source": "earnings"
        },
        {
            "Title": "Dhunseri Investments Reports Q2 Financial Results",
            "Summary": "Dhunseri Investments announced its Q2 financial results. The consolidated net profit increased to 532 million rupees, up from 457 million rupees year-over-year and 467 million rupees quarter-over-quarter. Revenue for Q2 grew significantly to 1.6 billion rupees, compared to 608 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731592177000,
            "Source": "result"
        }
    ]
}