{
    "Symbol": "DIACABS",
    "ISIN": "INE989C01038",
    "News": [
        {
            "Title": "Diamond Power Infrastructure Board Meet on Feb 14",
            "Summary": "Diamond Power Infrastructure Limited has scheduled a board meeting for February 14, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770717805739,
            "Source": "co_actions_results"
        },
        {
            "Title": "Diamond Power Gets NSE Cautionary Email on FY25 Report",
            "Summary": "Diamond Power Infrastructure Limited received a cautionary email from NSE on January 27, 2026, regarding observations in its Annual Secretarial Compliance Report for FY25. Company states no financial impact expected.",
            "Sentiment": "negative",
            "PublishDate": 1769582339207,
            "Source": "stocks"
        },
        {
            "Title": "Diamond Power Wins ₹72.51 Cr Cable Order from L&T",
            "Summary": "Diamond Power Infrastructure secures Letter of Intent from Larsen & Toubro for power cables worth ₹72.51 crores, scheduled for execution from January 2026 to September 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767591645116,
            "Source": "co_actions_results"
        },
        {
            "Title": "Diamond Power Infrastructure Wins ₹66.18 Cr Cable Order",
            "Summary": "Diamond Power Infrastructure Limited secured a Letter of Intent from Hild Projects Private Limited for power cable supply worth ₹66.18 crores, to be executed between January-June 2026.",
            "Sentiment": "positive",
            "PublishDate": 1766819257009,
            "Source": "co_actions_results"
        },
        {
            "Title": "Diamond Power Infrastructure Wins ₹55.54 Cr Cable Order",
            "Summary": "Diamond Power Infrastructure receives intent letter from Bondada Engineering for power cable supply worth ₹55.54 crores, with project execution scheduled from January to July 2026.",
            "Sentiment": "positive",
            "PublishDate": 1765950545676,
            "Source": "co_actions_results"
        },
        {
            "Title": "Diamond Power Infrastructure Wins ₹57.58 Cr Cable Order",
            "Summary": "Diamond Power Infrastructure Limited secured a letter of intent from Rajesh Power Services Limited for supply of 11KV cables worth ₹57.58 crores, to be executed between January-June 2026.",
            "Sentiment": "positive",
            "PublishDate": 1765883019924,
            "Source": "co_actions_results"
        },
        {
            "Title": "Diamond Power Infrastructure Wins ₹75.14 Cr Cable Order",
            "Summary": "Diamond Power Infrastructure Limited secured a letter of intent from Amara Raja Infra Private Limited for supply of HT and LT cables worth ₹75.14 crores inclusive of GST, to be executed between January-March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1765450022332,
            "Source": "co_actions_results"
        },
        {
            "Title": "Diamond Power Infra Secures 7.48 Billion Rupee Cable Supply Order from Adani Green Energy",
            "Summary": "Diamond Power Infra received a 7.48 billion rupee order from Adani Green Energy for supplying 33kv HV and 3.3kv solar MV cables for a renewable energy project. This significant contract award strengthens Diamond Power Infra's position in the solar infrastructure supply chain and represents substantial revenue potential for the company.",
            "Sentiment": "positive",
            "PublishDate": 1764893223585,
            "Source": "order&deals"
        },
        {
            "Title": "Diamond Power Infrastructure Seeks Shareholder Approval for Rs 1,000 Crore QIP Fundraising",
            "Summary": "Diamond Power Infrastructure Limited has issued a postal ballot notice seeking shareholder approval through remote e-voting to raise up to Rs 1,000 crore via Qualified Institutions Placement (QIP) by issuing equity shares to qualified institutional buyers. The funds will be utilized for investments in subsidiaries, debt repayment, working capital needs, and general corporate purposes, with voting scheduled from November 18 to December 17, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763372268345,
            "Source": "corporate_action"
        },
        {
            "Title": "Diamond Power Infrastructure Reports Strong Q2 Results, Approves Rs 1,000 Crore QIP Fundraising",
            "Summary": "Diamond Power Infrastructure Limited approved unaudited financial results for the quarter and half year ended September 30, 2025. The company reported consolidated net profit of Rs 2,772.78 lakh for the quarter, compared to Rs 400.14 lakh in the same period last year. Half-year consolidated net profit reached Rs 4,783.47 lakh versus Rs 2,055.91 lakh previously. The board approved raising up to Rs 1,000 crores through Qualified Institutions Placement (QIP) to qualified institutional buyers, subject to shareholder approval. The company noted it is currently non-compliant with Minimum Public Shareholding requirements and intends to achieve compliance through the QIP. The board also approved appointment of senior managerial personnel and issuance of corporate guarantee worth Rs 173 crores to Bank of Maharashtra for term loan facility availed by wholly owned subsidiary DICABS Nextgen Special Alloys Private Limited. The auditors issued qualified opinions on both standalone and consolidated results due to ongoing property, plant and equipment register updation exercise.",
            "Sentiment": "positive",
            "PublishDate": 1762818101142,
            "Source": "earnings"
        },
        {
            "Title": "Diamond Power Infrastructure Reports Strong Q2 Growth with Net Profit Rising to 277.3M Rupees",
            "Summary": "Diamond Power Infrastructure delivered strong quarterly performance with consolidated net profit increasing to 277.3 million rupees compared to 40 million rupees in the same period last year. Revenue grew significantly to 4.38 billion rupees from 2.5 billion rupees year-over-year. EBITDA rose to 459.2 million rupees versus 130.3 million rupees previously, while EBITDA margin expanded to 10.48% from 5.21% in the comparable period.",
            "Sentiment": "positive",
            "PublishDate": 1762783188610,
            "Source": "earnings"
        },
        {
            "Title": "Diamond Power Infrastructure Commences Second Aluminium Rod Mill Production at Subsidiary",
            "Summary": "Diamond Power Infrastructure Limited has started commercial production at its second fully-integrated Aluminium Rod Mill at DICABS NextGen Special Alloys Private Limited, its wholly owned subsidiary in Vadodara. The new mill has a capacity of 2,500 MT per month and manufactures Next Generation AL 59 Wire Rods for power transmission. The company invested Rs. 20 crores through internal accruals for this expansion. With this addition, the company's total installed capacity for Wire Rods reaches 73,200 MT per annum. The company now operates three rod mills: one at Diamond Power with 1,200 MT monthly capacity, and two at DICABS Nextgen with capacities of 2,400 MT and 2,500 MT per month respectively. One additional rod mill remains to be commissioned at the Vadodara facility.",
            "Sentiment": "positive",
            "PublishDate": 1759220484785,
            "Source": "stock"
        },
        {
            "Title": "Diamond Power Infrastructure Secures ₹236.71 Crore Contract from Adani Energy Solutions",
            "Summary": "Diamond Power Infrastructure received a letter of intent from Adani Energy Solutions for supplying 5,403 km of Al-59 Zebra Conductor valued at ₹236.71 crore. The project is scheduled for completion by June 30, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1757895064308,
            "Source": "order&deals"
        },
        {
            "Title": "Diamond Power Infrastructure Secures Rs 237 Crore Contract from Adani Energy Solutions",
            "Summary": "Diamond Power Infrastructure Limited received a letter of intent from Adani Energy Solutions Limited for supplying 5,403 KM AL-59 Zebra Conductor for the Jamnagar Project. The contract is valued at Rs 2,36,71,39,357 including tax. The order has been awarded on a kilometers rate basis with PV formulae and is scheduled to be executed by June 30, 2026. The company confirmed that none of its promoters, promoter groups, or group companies have any interest in Adani Energy Solutions Limited, and the transaction does not fall under related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1757758057865,
            "Source": "order&deals"
        },
        {
            "Title": "Diamond Power Infrastructure Secures Rs 185 Crore Contract",
            "Summary": "Diamond Power Infrastructure has won a contract valued at Rs 185 crore. The company expects this order to boost its annual revenue by approximately 20%.",
            "Sentiment": "positive",
            "PublishDate": 1757312555858,
            "Source": "stock"
        },
        {
            "Title": "Diamond Power Infrastructure Appoints New Directors and Releases Q1 FY26 Financial Results",
            "Summary": "Diamond Power Infrastructure Limited's Board approved multiple key appointments including Mr. Samir Naik as Additional Director and Whole-time Director, and reappointment of two Non-Executive Independent Directors for 3-year terms. The company also appointed new Cost Auditors and Secretarial Auditors, and approved unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue of ₹30,358.62 lakhs and net profit of ₹1,917.02 lakhs for Q1 FY26. The 33rd Annual General Meeting is scheduled for September 26, 2025. The auditors issued qualified opinions due to ongoing Property, Plant & Equipment reconciliation exercises and noted that Enforcement Directorate attachments on company assets remain unreleased.",
            "Sentiment": "neutral",
            "PublishDate": 1754654798282,
            "Source": "corporate_action"
        },
        {
            "Title": "Diamond Power Infra Secures ₹116.71 Crore Order",
            "Summary": "Diamond Power Infra has secured a new order valued at ₹116.71 crores. This addition has resulted in the company's order book reaching a total of ₹1,554.08 crores.",
            "Sentiment": "positive",
            "PublishDate": 1749805979000,
            "Source": "default"
        },
        {
            "Title": "Diamond Power Infrastructure: Promoters to Sell Up to 5.98% Stake via OFS",
            "Summary": "Monarch Infraparks and GSEC Ltd, promoters of Diamond Power Infrastructure, announce an offer for sale of up to 3.15 crore equity shares, representing 5.98% of the company. The base offer is 3.99% with an oversubscription option. The floor price is set at Rs 95 per share. The OFS will be conducted over two trading days, starting June 5 for non-retail investors.",
            "Sentiment": "neutral",
            "PublishDate": 1749044175000,
            "Source": "corporate_action"
        },
        {
            "Title": "Diamond Power Infrastructure Reports Q4 Results and Announces Strategic Partnership",
            "Summary": "Diamond Power Infrastructure has reported its Q4 financial results. The company's Q4 EBITDA was 137.6 million rupees, down from 179.8 million rupees year-over-year. The Q4 EBITDA margin decreased to 4.12% from 13.38% in the previous year. Q4 revenue increased to 3.34 billion rupees from 1.34 billion rupees year-over-year. The consolidated net profit for Q4 was 76.6 million rupees, compared to 144 million rupees year-over-year and 62.7 million rupees quarter-over-quarter. Additionally, the company has entered into a strategic partnership with TS Conductors, USA to manufacture high performance transmission conductors.",
            "Sentiment": "neutral",
            "PublishDate": 1748622448000,
            "Source": "default"
        },
        {
            "Title": "Diamond Power Secures 71.4 Crore Rupee Order",
            "Summary": "Diamond Power has won a new order valued at 71.4 crore rupees. This represents a significant business development for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1745996551000,
            "Source": "default"
        },
        {
            "Title": "Diamond Power Infrastructure Secures 2.3 Billion Rupee Order",
            "Summary": "Diamond Power Infrastructure has received a significant order worth 2.3 billion rupees from Rajesh Power. This order represents a substantial business opportunity for the company and could potentially impact its financial performance positively.",
            "Sentiment": "positive",
            "PublishDate": 1745885372000,
            "Source": "default"
        },
        {
            "Title": "Diamond Power Infrastructure Secures 2.3 Billion Rupee Order",
            "Summary": "Diamond Power Infrastructure has received an order worth 2.3 billion rupees from Rajesh Power. This significant order is likely to boost the company's revenue and project pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1745843804000,
            "Source": "default"
        },
        {
            "Title": "Diamond Power Infrastructure: Secures ₹215 Crore Order from Adani Green Energy",
            "Summary": "Diamond Power Infrastructure received a ₹215 crore order from Adani Green Energy for supplying conductors to the Khavda Power Project in Gujarat. This follows a recent ₹175 crore order from Associated Power Structures Limited. The company's stock hit a 5% upper circuit, reaching ₹99 per share.",
            "Sentiment": "positive",
            "PublishDate": 1742812088000,
            "Source": "order&deals"
        },
        {
            "Title": "Diamond Power Infra Reports Profit in Q3 FY2024",
            "Summary": "Diamond Power Infra has reported a net profit of 64 million rupees in the third quarter, compared to a loss of 53 million rupees in the same period last year. The company's revenue increased significantly to 3.07 billion rupees from 599 million rupees year-over-year. Sequentially, the net profit improved from 40 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739233304000,
            "Source": "earnings"
        }
    ]
}