{
    "Symbol": "DIAMONDYD",
    "ISIN": "INE393P01035",
    "News": [
        {
            "Title": "Prataap Snacks Board Meet on Feb 6 for Q3FY26 Results",
            "Summary": "Prataap Snacks Limited has scheduled a board meeting on February 6, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770029241291,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prataap Snacks Board Meet on Jan 17 for Q3FY26 Results",
            "Summary": "Prataap Snacks Limited has scheduled a board meeting on January 17, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768038369604,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prataap Snacks Closes Bengaluru Unit, Shifts Operations",
            "Summary": "Prataap Snacks Limited has closed its Bengaluru manufacturing facility effective January 1, 2026, transitioning operations to another facility within the same region for operational efficiency.",
            "Sentiment": "neutral",
            "PublishDate": 1767274800378,
            "Source": "stocks"
        },
        {
            "Title": "Prataap Snacks Reports 5% Sequential Revenue Growth in Q2FY26 Despite YoY Decline",
            "Summary": "Prataap Snacks Limited reported revenue of Rs. 4,298 million in Q2FY26, showing 5% quarter-on-quarter growth but a 2% year-on-year decline. The company attributed the YoY decline to GST transition impact as channel partners hesitated to purchase inventory with old GST rates. EBITDA increased 20% YoY to Rs. 229 million, with margins improving by 100 basis points despite palm oil price inflation of 28%. Gross margins improved to 29.8% due to process optimization and grammage rationalization initiatives. Namkeen and pellet categories continued driving growth through wider retail reach. The company is planning a new automated facility in Indore to reduce overheads and enhance margin profile. Management expects improved demand in H2FY26 supported by distribution expansion and growth in quick commerce, modern trade, and export channels.",
            "Sentiment": "neutral",
            "PublishDate": 1762280270681,
            "Source": "earnings"
        },
        {
            "Title": "Prataap Snacks Targets 15% Revenue Growth Through Automation and Channel Expansion",
            "Summary": "Prataap Snacks has outlined growth targets including 15% revenue growth and 2-3% EBITDA margin improvement. The company plans to achieve these goals through cost optimization, automation, and setting up a new plant in Indore. The strategy focuses on premiumization, expanding into quick commerce and modern trade channels. Prataap Snacks aims to grow emerging channels from less than 1% to over 5% of revenue within 3 years while enhancing export presence and improving margin resilience.",
            "Sentiment": "positive",
            "PublishDate": 1762271349758,
            "Source": "stock"
        },
        {
            "Title": "Prataap Snacks Reports 573% Jump in Net Profit to ₹533 Crores for Half-Year",
            "Summary": "Prataap Snacks Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported a net profit of ₹463.87 crores for the quarter compared to ₹69.13 crores in the previous quarter. For the half-year period, net profit surged to ₹533 crores from ₹1,559.29 crores in the previous period. Revenue from operations for the quarter stood at ₹42,979.20 crores versus ₹40,894.18 crores in the prior quarter. Half-year revenue reached ₹83,873.38 crores compared to ₹85,787.35 crores previously. The company received an insurance claim of ₹77.17 lakhs during the quarter related to a fire incident at a co-manufacturing plant in West Bengal. Earnings per share for the quarter was ₹1.94 compared to ₹0.29 in the previous quarter. The Board meeting was held on November 4, 2025, and the results were reviewed by the Audit Committee and approved by the Board of Directors.",
            "Sentiment": "positive",
            "PublishDate": 1762270910867,
            "Source": "earnings"
        },
        {
            "Title": "Prataap Snacks Reports Mixed Q2 Results with Profit Decline and Margin Improvement",
            "Summary": "Prataap Snacks reported quarterly net profit of 46.4 million rupees, down from 61.5 million rupees in the same period last year. Revenue decreased to 4.3 billion rupees from 4.39 billion rupees year-over-year. However, EBITDA increased to 226.6 million rupees from 193 million rupees, with EBITDA margin improving to 5.27% from 4.41% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762265441988,
            "Source": "earnings"
        },
        {
            "Title": "Prataap Snacks CFO Sumit Sharma Wins CII Emerging CFO Award for Consumer Products",
            "Summary": "Prataap Snacks Limited announced that CFO Sumit Sharma received the 'Emerging CFO of the Year 2024-25 – Consumer Products' award from the Confederation of Indian Industry (CII) Southern Region. The award recognizes excellence in financial leadership, innovation in corporate finance, and ability to deliver long-term stakeholder value in the consumer products sector. Sharma expressed gratitude for the recognition and credited his team's dedication and senior leadership's guidance. Managing Director and CEO Amit Kumat praised Sharma's financial stewardship and commitment to governance. Prataap Snacks is a leading Indian snacks company offering products under Yellow Diamond and Avadh brands, operating across 27 states and 4 union territories with 16 manufacturing facilities and over 5,200 distributors.",
            "Sentiment": "positive",
            "PublishDate": 1757756991463,
            "Source": "stock"
        },
        {
            "Title": "Prataap Snacks Clarifies Mahi Madhusudhan Kela Continues Investment",
            "Summary": "Prataap Snacks has clarified that investor Mahi Madhusudhan Kela remains invested in the company, contradicting reports suggesting his exit from the investment.",
            "Sentiment": "positive",
            "PublishDate": 1755157652907,
            "Source": "stock"
        },
        {
            "Title": "Prataap Snacks Amends Corporate Documents to Enter Renewable Energy and Captive Power Generation",
            "Summary": "Prataap Snacks has amended its Memorandum of Association (MOA) and Articles of Association (AOA) to expand into renewable energy and enable captive power generation. The company describes this move as expanding its strategic horizons and future-proofing its operations.",
            "Sentiment": "positive",
            "PublishDate": 1754576653139,
            "Source": "stock"
        },
        {
            "Title": "Prataap Snacks Shareholders Approve MOA and AOA Amendments for Captive Power Generation",
            "Summary": "Prataap Snacks Limited shareholders approved amendments to the company's Memorandum of Association and Articles of Association at the 16th Annual General Meeting held on August 6, 2025. The amendments enable the company to generate, produce, and distribute electricity from renewable and conventional energy sources primarily for captive consumption. The changes include adding provisions for establishing power plants, substations, and transmission systems using solar, wind, hydel, biomass, and other energy sources. The amendments were made mandatory under the Electricity Act, 2003, and guidelines from the Government of Madhya Pradesh for captive power generation. The company also updated its MOA to align with the Companies Act, 2013, replacing provisions from the earlier Companies Act, 1956. The AOA amendments include new clauses defining Power Purchase Agreements and project structures for electricity supply to captive users or third-party power sales.",
            "Sentiment": "neutral",
            "PublishDate": 1754575141012,
            "Source": "corporate_action"
        },
        {
            "Title": "Prataap Snacks Reports Rs 69.13 Lakh Quarterly Profit, Allots 26,587 ESOP Shares",
            "Summary": "Prataap Snacks Limited reported a net profit of Rs 69.13 lakh for the quarter ended June 30, 2025, compared to Rs 943.91 lakh in the same quarter last year. Revenue from operations declined to Rs 40,894.18 lakh from Rs 41,912.56 lakh year-over-year. The company's Board approved the allotment of 26,587 equity shares with face value of Rs 5 each to eligible employees under the Employee Stock Appreciation Rights Plan 2018. Total comprehensive income for the quarter was Rs 65.77 lakh. Basic and diluted earnings per share stood at Rs 0.29 compared to Rs 3.95 in the previous year quarter. The Board has recommended a final dividend of 10% (Rs 0.50 per equity share) for financial year 2024-25, subject to shareholder approval at the Annual General Meeting scheduled for August 6, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753449799820,
            "Source": "earnings"
        },
        {
            "Title": "Prataap Snacks Reports Q4 FY23 Financial Results",
            "Summary": "Prataap Snacks announced its Q4 financial results. The company reported a net loss of 119 million rupees, slightly improved from a loss of 123.8 million rupees in the same quarter last year. However, the loss widened from 379 million rupees in the previous quarter. Revenue for Q4 increased to 3.98 billion rupees from 3.87 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1746490208000,
            "Source": "default"
        },
        {
            "Title": "Prataap Snacks: Q4 Loss of Rs 12 Crore, Revenue Up 3%",
            "Summary": "Prataap Snacks reported a Q4 FY25 consolidated net loss of Rs 12 crore, compared to a profit of Rs 12.4 crore last year. Revenue increased 3% to Rs 398 crore. EBITDA fell 86% to Rs 5 crore, with margins narrowing to 1.2%. The board recommended a dividend of Rs 0.50 per share.",
            "Sentiment": "negative",
            "PublishDate": 1746453155000,
            "Source": "earnings"
        },
        {
            "Title": "Prataap Snacks Reports Q4 Financial Results",
            "Summary": "Prataap Snacks has released its Q4 financial results, showing a significant decline in EBITDA and margins compared to the previous year. The company reported an EBITDA of 49 million rupees, down from 354.5 million rupees year-over-year, with EBITDA margin falling to 1.23% from 9.17%. The company also reported a net loss of 119 million rupees, slightly improved from a loss of 123.8 million rupees in the same quarter last year. However, the loss widened compared to the previous quarter's 379 million rupees. Revenue for Q4 increased marginally to 3.98 billion rupees from 3.87 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1746451743000,
            "Source": "result"
        },
        {
            "Title": "Prataap Snacks to Consider Q4 Results on May 5",
            "Summary": "Prataap Snacks Limited has announced that it will consider its fourth quarter financial results on May 5. This indicates the company is preparing to release its earnings report for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1745849953000,
            "Source": "default"
        },
        {
            "Title": "Mahi Madhusudan Kela Acquires 4.61% Stake in Prataap Snacks",
            "Summary": "According to the shareholding data for Q4, Mahi Madhusudan Kela has acquired a 4.61% stake in Prataap Snacks. This information suggests a significant investment by Kela in the snack food company.",
            "Sentiment": "positive",
            "PublishDate": 1744677329000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mahi Madhusudan Kela Acquires 4.61% Stake in Prataap Snacks",
            "Summary": "According to the shareholding data for Q4, Mahi Madhusudan Kela has acquired a 4.61% stake in Prataap Snacks. This information suggests a significant investment by Kela in the snack food company.",
            "Sentiment": "neutral",
            "PublishDate": 1744450888000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Authum Investment Acquires 42.33% Stake in Prataap Snacks",
            "Summary": "Authum Investment has acquired a significant 42.33% stake in Prataap Snacks. The acquisition was valued at approximately Rs 764.55 crore and was executed through a combination of open market purchases and a share purchase agreement.",
            "Sentiment": "neutral",
            "PublishDate": 1740615344000,
            "Source": "corporate_action"
        },
        {
            "Title": "Authum Investment and Mahi Kela Acquire 47.54% Stake in Prataap Snacks",
            "Summary": "Authum Investment And Infrastructure, along with Mahi Madhusudan Kela, have acquired a 47.54% stake in Prataap Snacks. The acquisition was made at a price of 746 rupees per share of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1740615277000,
            "Source": "block_deals"
        },
        {
            "Title": "Authum Investment and Mahi Kela Acquire Majority Stake in Prataap Snacks",
            "Summary": "Authum Investment and Infrastructure, along with Mahi Madhusudan Kela, have acquired a 47.54% stake in Prataap Snacks. The acquisition was made at a price of 746 rupees per share, representing a significant ownership change in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1740585830000,
            "Source": "corporate_action"
        },
        {
            "Title": "Prataap Snacks Reports Q3 Financial Results",
            "Summary": "Prataap Snacks has reported a net loss of 379 million rupees in the third quarter, compared to a profit of 108 million rupees in the same quarter last year. However, the company showed improvement from the previous quarter with a profit of 62 million rupees. The company's revenue for Q3 increased to 4.4 billion rupees from 4.06 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738023366000,
            "Source": "earnings"
        },
        {
            "Title": "Prataap Snacks Reports Q3 Financial Results",
            "Summary": "Prataap Snacks has reported a net loss of 379 million rupees in Q3, compared to a profit of 108 million rupees in the same quarter last year. However, the company showed improvement from the previous quarter with a profit of 62 million rupees. Q3 revenue increased to 4.4 billion rupees from 4.06 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1737990676000,
            "Source": "earnings"
        },
        {
            "Title": "Prataap Snacks: Open Offer for 26% Stake at Rs 865.66 per Share",
            "Summary": "Authum Investment & Infrastructure and Mahi Madhusudan Kela have made an open offer to acquire up to 26.01% stake in Prataap Snacks at Rs 865.66 per share. The offer includes a cash component of Rs 864 and an interest component of Rs 1.66 per share. The Competition Commission of India has approved the proposed acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1736394037000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cash Offer for 26.01% Stake in Prataap Snacks at 865.66 Rupees per Share",
            "Summary": "A cash offer has been made to acquire a 26.01% stake in Prataap Snacks Limited. The offer price is set at 865.66 rupees per equity share. This represents a significant corporate action that could potentially change the ownership structure of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1736341893000,
            "Source": "corporate_action"
        },
        {
            "Title": "Open Offer for Prataap Snacks: Authum Investment and Mahi Kela to Acquire Stake",
            "Summary": "Prataap Snacks has received a letter of offer for an open offer. Authum Investment & Infrastructure and Mahi Madhusudan Kela are set to acquire a stake in the company. This move indicates a potential change in ownership or significant shareholding in Prataap Snacks.",
            "Sentiment": "neutral",
            "PublishDate": 1736341887000,
            "Source": "corporate_action"
        },
        {
            "Title": "Competition Regulator Approves Acquisition of Prataap Snacks",
            "Summary": "The Competition Commission of India has approved the acquisition of a 72.8% stake in Prataap Snacks by Authum Investment & Infrastructure and Mahi Madhusudan Kela. This significant transaction represents a major change in ownership for the snack food company.",
            "Sentiment": "neutral",
            "PublishDate": 1735689814000,
            "Source": "corporate_action"
        },
        {
            "Title": "India Competition Regulator Approves Acquisition of Prataap Snacks",
            "Summary": "The Competition Commission of India has approved the acquisition of a 72.8% stake in Prataap Snacks by Authum Investment & Infrastructure and Mahi Madhusudan Kela. This regulatory approval marks a significant corporate action for Prataap Snacks, potentially leading to changes in the company's ownership structure and strategic direction.",
            "Sentiment": "neutral",
            "PublishDate": 1735652608000,
            "Source": "corporate_action"
        },
        {
            "Title": "Prataap Snacks Ltd: Fire Damages Jammu Manufacturing Unit",
            "Summary": "A fire occurred at Prataap Snacks' manufacturing unit in Kartholi, Jammu on December 30, 2024. No casualties reported, but inventories, plant, machinery, buildings, and furniture were damaged. The company has insurance coverage and will serve the northern market through third-party manufacturing units until operations resume.",
            "Sentiment": "negative",
            "PublishDate": 1735572351000,
            "Source": "normal_news"
        },
        {
            "Title": "Prataap Snacks Expands Distribution and Addresses Input Price Challenges",
            "Summary": "Prataap Snacks has expanded its distribution by onboarding its products onto a quick commerce platform in Q2, with plans to add more platforms in Q3 FY25. The company is facing challenges due to rising input prices, particularly palm oil, which is expected to increase further in Q3 FY25. To mitigate the impact, Prataap Snacks is implementing additional cost reduction and process optimization initiatives.",
            "Sentiment": "neutral",
            "PublishDate": 1731383095000,
            "Source": "corporate_action"
        },
        {
            "Title": "Prataap Snacks Reports Significant Drop in Q2 EBITDA",
            "Summary": "Prataap Snacks has reported a substantial decrease in its Q2 EBITDA, which fell to 192 million rupees from 379 million rupees in the same quarter last year. The company's EBITDA margin also declined, dropping to 4.36% from 8.80% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731336071000,
            "Source": "result"
        },
        {
            "Title": "Prataap Snacks Reports Q2 Financial Results",
            "Summary": "Prataap Snacks announced its Q2 financial results. The company's net profit decreased to 62 million rupees, down from 165 million rupees year-over-year and 94 million rupees quarter-over-quarter. However, revenue slightly increased to 4.4 billion rupees from 4.3 billion rupees compared to the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1731336021000,
            "Source": "result"
        }
    ]
}