{
    "Symbol": "DIAMINESQ",
    "ISIN": "INE591D01014",
    "News": [
        {
            "Title": "Diamines & Chemicals Files Fund Utilization Report",
            "Summary": "Diamines & Chemicals Limited disclosed fund utilization statement for Q3 FY26, showing ₹12.51 crores utilized from ₹50.58 crores raised through preferential issue in October 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1770911307217,
            "Source": "stocks"
        },
        {
            "Title": "Diamines & Chemicals Q3FY26 Loss Widens to ₹340.31 Crores",
            "Summary": "Diamines & Chemicals reported consolidated net loss of ₹340.31 crores for Q3FY26 vs profit of ₹75.19 crores in Q3FY25. Revenue declined 56.36% to ₹763.87 crores.",
            "Sentiment": "negative",
            "PublishDate": 1770882024166,
            "Source": "co_actions_results"
        },
        {
            "Title": "Diamines Gets GPCB Consent for Product Mix Amendment",
            "Summary": "Diamines and Chemicals Limited received Gujarat Pollution Control Board consent on January 21, 2026 for product mix amendment at existing manufacturing unit, enabling new product manufacturing until September 30, 2027.",
            "Sentiment": "positive",
            "PublishDate": 1769087595607,
            "Source": "stocks"
        },
        {
            "Title": "Diamines and Chemicals Reports Net Loss of ₹370 Lakhs in Q2 FY2025",
            "Summary": "Diamines and Chemicals Limited announced its quarterly results for the period ended September 30, 2025. The company reported revenue from operations of ₹930.23 lakhs compared to ₹2,153.18 lakhs in the same quarter last year. The company posted a net loss after tax of ₹370.04 lakhs versus a net loss of ₹623.47 lakhs in Q2 FY2024. For the half-year period, revenue stood at ₹2,153.18 lakhs against ₹3,598.32 lakhs in the previous year, with net loss of ₹459.33 lakhs compared to ₹623.47 lakhs. The company operates in two segments: Specialty Chemicals and Trading in Fruits and Vegetables. Basic earnings per share was negative ₹3.78 for the quarter. The Board meeting was held on November 5, 2025, and the trading window for directors and designated employees will reopen on November 8, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762384914369,
            "Source": "earnings"
        },
        {
            "Title": "Diamines and Chemicals Limited Revises Dividend Record Date to August 28, 2025",
            "Summary": "Diamines and Chemicals Limited has revised the record date for determining dividend entitlement to August 28, 2025, for the financial year ended March 31, 2025. The dividend is subject to approval at the upcoming Annual General Meeting. This revision corrects an earlier communication dated July 31, 2025, which had previously announced August 25, 2025 as the record date.",
            "Sentiment": "neutral",
            "PublishDate": 1754380592188,
            "Source": "corporate_action"
        },
        {
            "Title": "Diamines and Chemicals Limited Reports 75% Decline in Net Profit for FY2025",
            "Summary": "Diamines and Chemicals Limited reported a standalone net profit of ₹448.73 lakhs for FY2025, down 75% from ₹1,777.13 lakhs in the previous year. Total revenue declined to ₹7,514.57 lakhs from ₹10,676.05 lakhs. The company's operating profit margin dropped to 9.32% from 23.33% due to reduced sales prices and increased material costs. Sales volumes remained stable at 1,792.05 MT compared to 1,796.34 MT in FY2024. The Board recommended a final dividend of ₹1 per share, reduced from ₹2.50 per share in the previous year. The company allotted 9,06,390 warrants at ₹552 each on preferential basis, raising ₹12.51 crores as 25% subscription money. Raw material inventory increased significantly, impacting the inventory turnover ratio which declined to 1.47 times from 2.83 times.",
            "Sentiment": "negative",
            "PublishDate": 1753945385634,
            "Source": "corporate_action"
        },
        {
            "Title": "Anti-Dumping Investigation Initiated on Ethylene Diamine Imports",
            "Summary": "The government has initiated an anti-dumping investigation concerning imports of 'Ethylene Diamine' originating from or exported by China PR, European Union, Kingdom of Saudi Arabia, and Taiwan. This investigation affects Diamines & Chemicals, a company likely involved in the production or trade of ethylene diamine.",
            "Sentiment": "neutral",
            "PublishDate": 1743045898000,
            "Source": "corporate_action"
        },
        {
            "Title": "DIAMINES & CHEMICALS Reports Significant Decline in Q3 EBITDA",
            "Summary": "DIAMINES & CHEMICALS experienced a substantial decrease in its Q3 EBITDA, dropping from 50 million rupees to 16 million rupees year-over-year. The company's EBITDA margin also saw a significant reduction, falling from 21.84% to 9.19% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738828017000,
            "Source": "earnings"
        },
        {
            "Title": "Diamines & Chemicals Reports Decline in Q3 Profit and Revenue",
            "Summary": "Diamines & Chemicals Limited has reported a significant decrease in both net profit and revenue for the third quarter. The company's net profit fell to 11 million rupees from 34 million rupees in the same quarter last year. Similarly, revenue declined to 175 million rupees from 230 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738827864000,
            "Source": "earnings"
        },
        {
            "Title": "Diamines & Chemicals Reports Q2 Financial Results",
            "Summary": "Diamines & Chemicals has reported its second quarter financial results. The company's net profit decreased to 29 million rupees from 40 million rupees in the same quarter last year. Revenue also saw a slight decline, falling to 191 million rupees from 199 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1729757369000,
            "Source": "result"
        }
    ]
}