{
    "Symbol": "DICIND",
    "ISIN": "INE303A01010",
    "News": [
        {
            "Title": "India Claims Best U.S. Trade Deal Among Neighbors",
            "Summary": "India's Trade Minister asserts that the country has secured the most favorable trade agreement with the United States compared to other neighboring nations in the region.",
            "Sentiment": "positive",
            "PublishDate": 1770120846121,
            "Source": "global"
        },
        {
            "Title": "DIC India announces key leadership change in sales",
            "Summary": "DIC India Limited announces resignation of Head of Sales & Marketing Kuldeep Sharma due to health reasons, effective February 02, 2026, and appoints Manjusha Singh as replacement.",
            "Sentiment": "neutral",
            "PublishDate": 1770037320748,
            "Source": "stocks"
        },
        {
            "Title": "India Finalizes Lithium, Nickel Processing Incentives",
            "Summary": "India is in the final stages of developing incentive schemes for lithium and nickel processing plants, marking a significant step toward strengthening domestic critical mineral processing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1769678949848,
            "Source": "stocks"
        },
        {
            "Title": "India Plans Green Ammonia Exports by 2028-29",
            "Summary": "India is preparing to launch green ammonia exports starting in the fiscal year 2028-29, marking a significant step in the country's renewable energy and export strategy according to Bloomberg reports.",
            "Sentiment": "positive",
            "PublishDate": 1769675593431,
            "Source": "global"
        },
        {
            "Title": "India Projects GDP Growth Between 6.8% And 7.2% For FY27",
            "Summary": "India has projected its GDP growth to be between 6.8% and 7.2% for the fiscal year 2027, indicating the government's economic outlook for the medium term.",
            "Sentiment": "positive",
            "PublishDate": 1769669017984,
            "Source": "finance_general"
        },
        {
            "Title": "India Plans EV Import Tax Cut Extension After 5 Years",
            "Summary": "India will apply the same import tax reduction to electric vehicles priced over 20,000 euros after a five-year period, according to government official announcement.",
            "Sentiment": "positive",
            "PublishDate": 1769659169608,
            "Source": "finance_general"
        },
        {
            "Title": "India Cuts European Car Tariffs to 30-35%",
            "Summary": "India announces immediate tariff reduction on 100,000 European cars annually from 110% to 30-35%, marking significant trade policy shift for automotive imports.",
            "Sentiment": "positive",
            "PublishDate": 1769659100584,
            "Source": "global"
        },
        {
            "Title": "India Cuts EU Alcohol Tariffs Significantly",
            "Summary": "India reduces tariffs on European Union alcoholic beverages with beer tariffs cut to 50%, spirits to 40%, and wine reduced by 20-30%, marking a significant trade policy shift.",
            "Sentiment": "positive",
            "PublishDate": 1769497917951,
            "Source": "stocks"
        },
        {
            "Title": "India Emerges as Reliable Partner at Davos 2025",
            "Summary": "At Davos 2025, India positioned itself as a stabilizing force amid global uncertainty, with EU announcing historic trade deal creating 2 billion-person market and India showcasing AI readiness across all five architecture layers.",
            "Sentiment": "positive",
            "PublishDate": 1769416733333,
            "Source": "global"
        },
        {
            "Title": "India's Trade Prospects Brighten Amid Global Shifts",
            "Summary": "India shows optimism in trade relations with potential EU deal and US trade pact progress, while maintaining strategic autonomy amid changing global order and geopolitical complexities.",
            "Sentiment": "positive",
            "PublishDate": 1769391563200,
            "Source": "global"
        },
        {
            "Title": "India cuts US Treasury holdings to 5-year low",
            "Summary": "India's US Treasury holdings dropped 26% from 2023 peak to $174 billion, falling to five-year low as RBI diversifies reserves and supports rupee amid trade tensions with US.",
            "Sentiment": "neutral",
            "PublishDate": 1769143770390,
            "Source": "global"
        },
        {
            "Title": "CEO confidence in India rises to joint-second globally",
            "Summary": "India jumps to joint-second position with Germany and UK in global CEO investment preferences, with 13% of surveyed CEOs planning investments compared to US at 35%.",
            "Sentiment": "positive",
            "PublishDate": 1768959599422,
            "Source": "global"
        },
        {
            "Title": "India May Ease China Investment Curbs - Report",
            "Summary": "India is reportedly considering easing restrictions on Chinese investment and procurement as policy rethink gains momentum, potentially affecting companies like BHEL, ABB, and Siemens.",
            "Sentiment": "neutral",
            "PublishDate": 1768895450741,
            "Source": "stocks"
        },
        {
            "Title": "Sanctions Now Default Diplomacy Tool: India's Challenge",
            "Summary": "Economic sanctions have evolved from exceptional interventions to routine statecraft tools, creating structural challenges for middle powers like India through extraterritorial reach and spillover effects.",
            "Sentiment": "neutral",
            "PublishDate": 1768838180943,
            "Source": "global"
        },
        {
            "Title": "India Pivots Energy Strategy Amid Venezuela Crisis",
            "Summary": "India strategically diversifies crude oil imports away from Russian dependency as Venezuelan crisis opens new opportunities. Oil prices expected to fall to $50/bbl by June 2026, benefiting Indian economy with inflation relief and GDP boost.",
            "Sentiment": "positive",
            "PublishDate": 1768207948608,
            "Source": "global"
        },
        {
            "Title": "India at 100: Growth, Demographics & Cities Key to Future",
            "Summary": "Three structural forces - economic expansion, demographic transition, and urbanization - will shape India's path to becoming a $20 trillion economy by 2047, requiring strategic reforms and execution.",
            "Sentiment": "positive",
            "PublishDate": 1768207139997,
            "Source": "stocks"
        },
        {
            "Title": "DIC India Seeks Shareholder Approval for New Director",
            "Summary": "DIC India Limited has issued a postal ballot notice seeking member approval for the appointment of Mr. Avijit Mukerji as Independent Director through remote e-voting from January 15 to February 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768196463040,
            "Source": "stocks"
        },
        {
            "Title": "India Inc 2026: Tech Surge, Startup IPOs & Trade Shifts",
            "Summary": "Technology sector leads with $3B AI contracts, startup IPOs raise $22B, Reliance Jio prepares major listing, Tata Group undergoes strategic changes, and US-India tariff tensions impact exporters across sectors.",
            "Sentiment": "positive",
            "PublishDate": 1767262565982,
            "Source": "stocks"
        },
        {
            "Title": "DIC India Director Paul Koek Resigns Effective Jan 2026",
            "Summary": "DIC India Limited announces resignation of Non-Executive Non-Independent Director Paul Koek effective January 01, 2026, due to his retirement from parent company DIC Asia Pacific Pte Ltd.",
            "Sentiment": "neutral",
            "PublishDate": 1767252633833,
            "Source": "stocks"
        },
        {
            "Title": "DIC India receives GST demand of ₹6.61 lakh for FY22",
            "Summary": "DIC India Limited receives GST demand order of ₹6.61 lakh from UP tax authorities for alleged non-payment related to R&D fee recovery from foreign entity for FY 2021-22.",
            "Sentiment": "negative",
            "PublishDate": 1767189446551,
            "Source": "stocks"
        },
        {
            "Title": "India's GDP Growth Hits Decadal High Above 7% in 2026",
            "Summary": "India becomes world's fourth-largest economy at $4.18 trillion, with Q2 FY25 GDP surging 8.2%. RBI raises FY26 growth forecast to 7.3% while inflation drops to historic lows, creating ideal economic conditions.",
            "Sentiment": "positive",
            "PublishDate": 1767182663218,
            "Source": "stocks"
        },
        {
            "Title": "India's 2025 Foreign Policy: Crisis Management Era",
            "Summary": "India navigated US tariff shocks, China tensions, and global uncertainties in 2025, pursuing trade diversification through new deals with UK, Oman, and New Zealand while balancing strategic autonomy.",
            "Sentiment": "neutral",
            "PublishDate": 1767167059556,
            "Source": "global"
        },
        {
            "Title": "Sensex Surges 645 Points, Nifty Above 26,150 on Final Day",
            "Summary": "Markets rallied on year's final trading day with Sensex up 645 points to 85,320. Steel stocks led gains after govt imposed 12% safeguard duty on imports. Metal index gained over 1%.",
            "Sentiment": "positive",
            "PublishDate": 1767147345895,
            "Source": "stocks"
        },
        {
            "Title": "India Inc Commits ₹2.5 Lakh Crore to Green Energy",
            "Summary": "Major Indian companies including Tata Power, JSW Energy, and ONGC Green are allocating significant capital towards clean energy projects. Study projects ₹341 lakh crore green investment potential by 2047.",
            "Sentiment": "positive",
            "PublishDate": 1767113262833,
            "Source": "stocks"
        },
        {
            "Title": "India Becomes World's Fourth Largest Economy at $4.18T",
            "Summary": "India surpasses Japan with GDP of $4.18 trillion, recording 8.2% growth in Q2 FY26. Government projects India will overtake Germany by 2030 with $7.3 trillion GDP target.",
            "Sentiment": "positive",
            "PublishDate": 1767106502835,
            "Source": "stocks"
        },
        {
            "Title": "India Leverages Workforce as Strategic Export Asset",
            "Summary": "India positions its vast young workforce as exportable asset through structured labor mobility agreements, generating record ₹135 billion remittances in FY25.",
            "Sentiment": "positive",
            "PublishDate": 1766751568141,
            "Source": "global"
        },
        {
            "Title": "DIC India Receives ₹16.97 Lakh GST Demand Order",
            "Summary": "DIC India Limited received a GST demand order of ₹16.97 lakh from Gujarat tax authorities for alleged excess ITC claims and ineligible refunds during FY 2021-22. Company reviewing order for next steps.",
            "Sentiment": "negative",
            "PublishDate": 1766743180627,
            "Source": "stocks"
        },
        {
            "Title": "India Inc Records First Earnings Upgrade in 5 Quarters",
            "Summary": "Corporate India sees 2% FY26 profit upgrade led by mid and large-caps, while small-caps face continued downgrades. Oil & gas and telecom sectors lead gains.",
            "Sentiment": "positive",
            "PublishDate": 1766587815521,
            "Source": "stocks"
        },
        {
            "Title": "India Targets $2 Trillion Export Goal by 2030",
            "Summary": "Commerce Secretary Rajesh Agrawal announces India's ambitious plan to achieve $2 trillion in exports by 2030, marking a significant milestone for the country's trade objectives.",
            "Sentiment": "positive",
            "PublishDate": 1766504245878,
            "Source": "stocks"
        },
        {
            "Title": "DIC India Appoints Avijit Mukerji as Independent Director",
            "Summary": "DIC India Limited's Board approved the appointment of Avijit Mukerji, former PwC Partner and current Managing Partner at Tatva Sutra Solutions, as Additional Independent Director effective December 10, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765380388064,
            "Source": "stocks"
        },
        {
            "Title": "DIC India Receives Reduced GST Demand of INR 3.81 Lakh After Final Order",
            "Summary": "DIC India Limited received a final GST order from Karnataka tax authorities reducing the original demand from INR 6.71 crore to INR 3.81 lakh for F.Y. 2021-22, involving alleged input tax credit contraventions. The company states no impact on financial or operational activities and is reviewing the order to decide next steps.",
            "Sentiment": "positive",
            "PublishDate": 1764779417807,
            "Source": "stock"
        },
        {
            "Title": "DIC India Files Enforcement Petition for ₹2.09 Crore Arbitration Award Against Agam Agochars",
            "Summary": "DIC India Limited filed an enforcement petition under Section 36 of the Arbitration and Conciliation Act before the District Commercial Court, Jaipur, seeking to enforce an interim arbitration award dated August 20, 2025 against Agam Agochars Private Limited. The award includes ₹2,08,90,357 towards outstanding dues, ₹1,27,11,323 as interest at 18% per annum compounded monthly, and future interest at 6% per annum on the principal amount.",
            "Sentiment": "positive",
            "PublishDate": 1764397646022,
            "Source": "stock"
        },
        {
            "Title": "DIC India Receives Final GST Order with 91% Reduction in Demand to INR 4.67 Lakh",
            "Summary": "DIC India Limited received a final GST order from West Bengal authorities reducing the original demand from INR 5.54 crore to INR 4.67 lakh for alleged input tax credit violations in F.Y. 2021-22. The company states there is no impact on its financial or operational activities and is reviewing the order to decide on next steps.",
            "Sentiment": "positive",
            "PublishDate": 1764152830688,
            "Source": "stock"
        },
        {
            "Title": "India Inc Earnings Recovery Gains Momentum as BSE500 PAT Growth Accelerates to 15.5%",
            "Summary": "Indian corporate earnings showed strong improvement with BSE500 PAT growth reaching 15.5% year-on-year versus 11.1% in the previous quarter, with companies like Asian Paints reporting 47% profit surge and Eicher Motors posting 25% profit jump. The earnings trough appears to be over with H2FY26 expected to see further acceleration, while Indian markets remain attractively positioned after underperforming emerging markets by 25% over the past year.",
            "Sentiment": "positive",
            "PublishDate": 1763175796124,
            "Source": "earnings"
        },
        {
            "Title": "DIC India Limited Approves Quarterly Financial Results and Receives Penalty Waiver",
            "Summary": "DIC India Limited's Board approved unaudited financial results for the quarter and nine months ended September 30, 2025, during a meeting held on November 13, 2025. The company also received approval for its waiver application regarding a penalty imposed by NSE and BSE for a 2-hour delay in filing Related Party Transactions statement due to technical error.",
            "Sentiment": "positive",
            "PublishDate": 1763054854295,
            "Source": "earnings"
        },
        {
            "Title": "DIC India Limited Confirms Navapol Chuensiri as Non-Executive Non-Independent Director",
            "Summary": "DIC India Limited has appointed Mr. Navapol Chuensiri as a Non-Executive Non-Independent Director following postal ballot approval by members. Chuensiri was initially appointed as an Additional Director on August 13, 2025. He serves as Deputy Regional Managing Director of DIC Asia Pacific Pte Ltd and brings 30 years of leadership experience from global companies including SIG Combibloc, Tetra Pak, Amcor, Goodyear Tyre & Rubber, and O-I Glass. He previously served as a Board Member of SIG Combibloc and O-I Glass. Chuensiri holds Bachelor and Master degrees in Mechanical Engineering from Oregon State University and a Master's degree in Organizational Communication. He is not related to any existing directors on the company's board and is not debarred from holding directorship by any regulatory authority.",
            "Sentiment": "positive",
            "PublishDate": 1760445847645,
            "Source": "corporate_governance"
        },
        {
            "Title": "DIC India Limited Concludes Remote E-Voting for Appointment of Mr. Navapol Chuensiri as Non-Executive Director",
            "Summary": "DIC India Limited has concluded the remote e-voting period for a postal ballot seeking shareholder approval for the appointment of Mr. Navapol Chuensiri as a Non-Executive Non-Independent Director. The e-voting period ended on October 14, 2025 at 5:00 PM IST. The company conducted the postal ballot entirely through electronic means using NSDL's remote e-voting facility, with notices sent only to members whose email addresses are registered with the company. The voting results and scrutinizer's report will be disclosed separately in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1760443652576,
            "Source": "corporate_action"
        },
        {
            "Title": "DIC India Limited Receives GST Show Cause Notice Demanding Rs. 5.55 Crore",
            "Summary": "DIC India Limited received a show cause notice under section 73 of the West Bengal GST Act, 2017, from the Joint Commissioner of Revenue, Large Taxpayer Unit. The notice demands payment of Rs. 5,54,65,222, comprising GST of Rs. 3,43,76,114 and interest of Rs. 2,10,89,108. The allegations relate to F.Y. 2021-22 and include excess availment of Input Tax Credit, ITC taken on blocked credits, denial of ITC on imports, alleged imposition of GST on exempted and non-GST supplies, and mismatch in ITC claimed. No penalty has been imposed. The company states there is no material impact on its financial, operational or other activities. DIC India plans to reply to the show cause notice within the stipulated timeframe with relevant supporting documents.",
            "Sentiment": "negative",
            "PublishDate": 1757755946094,
            "Source": "stock"
        },
        {
            "Title": "DIC India Seeks Shareholder Approval for Navapol Chuensiri's Appointment as Non-Executive Director",
            "Summary": "DIC India Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. Navapol Chuensiri as a Non-Executive Non-Independent Director. The Board had appointed Chuensiri as Additional Director on August 13, 2025, and now requires shareholder ratification. Chuensiri serves as Deputy Regional Managing Director of DIC Asia Pacific Pte Ltd and brings 30 years of leadership experience from global companies including SIG Combibloc, Tetra Pak, Amcor, Goodyear Tyre & Rubber, and O-I Glass. He holds engineering degrees from Oregon State University and a Master's in Organizational Communication. The e-voting process will run from September 15 to October 14, 2025, with results to be declared by October 15, 2025. The cut-off date for voting eligibility is September 5, 2025. Karan Arora & Associates has been appointed as scrutinizer for the voting process.",
            "Sentiment": "neutral",
            "PublishDate": 1757405280636,
            "Source": "corporate_governance"
        },
        {
            "Title": "DIC India Receives 20.9 Million Rupees As Interim Award For Outstanding Dues",
            "Summary": "DIC India has received 20.9 million rupees as an interim award for outstanding dues. The award relates to dues that were owed to the company.",
            "Sentiment": "positive",
            "PublishDate": 1755780018289,
            "Source": "stock"
        },
        {
            "Title": "DIC India Approves Q1 FY2026 Results and Appoints New Director",
            "Summary": "DIC India Limited's Board of Directors approved unaudited financial results for the quarter and half year ended June 30, 2025, during a meeting held on August 13, 2025. The board appointed Mr. Navapol Chuensiri as an additional Non-Executive Non-Independent Director effective August 13, 2025. Mr. Chuensiri serves as Deputy Regional Managing Director of DIC Asia Pacific Pte Ltd and brings 30 years of leadership experience from global companies including SIG Combibloc, Tetra Pak, Amcor, Goodyear Tyre & Rubber, and O-I Glass. The company will seek shareholder approval for his appointment through postal ballot with a cut-off date of September 5, 2025. The board also authorized the Company Secretary and Chief Financial Officer to determine materiality of events for stock exchange disclosures and appointed Karan Arora & Associates as scrutinizer for the postal ballot.",
            "Sentiment": "positive",
            "PublishDate": 1755100794260,
            "Source": "corporate_governance"
        },
        {
            "Title": "DIC India Reports Decline in Q1 Financial Performance",
            "Summary": "DIC India reported quarterly net profit of 44 million rupees, down from 62 million rupees in the same period last year. Revenue decreased to 2.26 billion rupees from 2.4 billion rupees year-over-year. EBITDA fell to 94 million rupees compared to 116 million rupees previously, while EBITDA margin compressed to 4.13% from 4.78% in the prior year period.",
            "Sentiment": "negative",
            "PublishDate": 1755097955142,
            "Source": "earnings"
        },
        {
            "Title": "Income Tax Department Appeals Against DIC India in Kolkata High Court Over INR 2.96 Crore Tax Dispute",
            "Summary": "The Income Tax Department has filed an appeal against DIC India Limited in the Kolkata High Court, challenging a favorable ruling by the Income Tax Appellate Tribunal. The dispute involves royalty expenses and transfer pricing adjustments for the 2014-15 assessment year, with a contested tax amount of INR 2.96 crores. The Income Tax Department filed the appeal approximately 2 years after the ITAT ruling that favored DIC India. The company will prepare its response once the High Court admits the appeal and requests a submission.",
            "Sentiment": "negative",
            "PublishDate": 1753440760695,
            "Source": "stock"
        },
        {
            "Title": "DIC India Reports Q4 Financial Results",
            "Summary": "DIC India has announced its Q4 financial results. The company's net profit for the quarter stood at 26 million rupees, down from 42 million rupees year-over-year and 72 million rupees quarter-over-quarter. However, revenue increased to 2.1 billion rupees from 1.99 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1746713687000,
            "Source": "result"
        },
        {
            "Title": "Legal Metrology Office Conducts Search at DIC India Premises",
            "Summary": "DIC India reports that the Legal Metrology Office has conducted a search at their premises. During the search, an inspector seized a product for an alleged violation. The company has disclosed this information, but no further details about the nature of the violation or the seized product have been provided.",
            "Sentiment": "negative",
            "PublishDate": 1741274571000,
            "Source": "corporate_governance"
        },
        {
            "Title": "DIC India Reports Profit in Q2 FY2023",
            "Summary": "DIC India has reported a net profit of 20 million rupees in Q2, compared to a loss of 138 million rupees in the same quarter last year and a profit of 62 million rupees in the previous quarter. The company's revenue for Q2 stood at 2.2 billion rupees, slightly up from 2.16 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731512025000,
            "Source": "result"
        }
    ]
}