{
    "Symbol": "DIFFNKG",
    "ISIN": "INE184O01015",
    "News": [
        {
            "Title": "Diffusion Engineers Board Meet Set for Feb 6, 2026",
            "Summary": "Diffusion Engineers Limited has scheduled a board meeting on February 06, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770012644352,
            "Source": "co_actions_results"
        },
        {
            "Title": "3P Investment Managers Reduces Stake in Diffusion Engineers",
            "Summary": "3P Investment Managers disposed of 9.82 lakh shares in Diffusion Engineers, reducing its holding from 5.33% to 2.70% through open market transactions on December 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766569746287,
            "Source": "co_actions_results"
        },
        {
            "Title": "Diffusion Engineers Senior Management Role Change",
            "Summary": "Diffusion Engineers announces change in Senior Management Personnel designation for VP Exports due to internal restructuring, effective December 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765379725393,
            "Source": "stocks"
        },
        {
            "Title": "Diffusion Engineers Secures INR 7.98 Crore Domestic Order for Industrial Equipment",
            "Summary": "Diffusion Engineers Limited received a domestic order worth approximately INR 7.98 crores for supply of intermediate and concentrate thickeners for steel/mining industry beneficiation plant. The order involves supplying 6 intermediate thickeners and 2 concentrate thickeners with delivery scheduled up to August 2026.",
            "Sentiment": "positive",
            "PublishDate": 1764933497983,
            "Source": "order&deals"
        },
        {
            "Title": "Diffusion Engineers Limited Receives Reaffirmed Credit Ratings from Crisil",
            "Summary": "Diffusion Engineers Limited received reaffirmed credit ratings from Crisil Ratings Limited for its Rs. 65 crore bank facilities, with long-term rating at Crisil A-/Stable and short-term rating at Crisil A2. The ratings cover various banking facilities including cash credit, bank guarantees, and letters of credit across multiple banks including HDFC Bank, ICICI Bank, YES Bank, and DBS Bank.",
            "Sentiment": "positive",
            "PublishDate": 1764744688721,
            "Source": "stock"
        },
        {
            "Title": "Diffusion Engineers ESOP Trust Acquires 2.93 Lakh Equity Shares",
            "Summary": "Diffusion ESOP Trust acquired 2,93,959 equity shares of Diffusion Engineers Limited through NSE stock exchange on November 25, 2025, for Rs. 681,422.97. The trust now holds 3,00,000 equity shares representing 0.80% of the company's paid-up equity share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1764157390356,
            "Source": "corporate_action"
        },
        {
            "Title": "Diffusion Engineers Reports 7.6% Revenue Growth in Q2 FY26, Order Book Swells to Rs 209 Crores",
            "Summary": "Diffusion Engineers Limited posted revenue of Rs 799.61 million in Q2 FY26 versus Rs 743.15 million in Q2 FY25, with profit after tax rising 13.74% to Rs 99.13 million. The engineering solutions provider's order book reached Rs 209 crores driven by strong demand for Roll Press Rolls in cement sector, with new capacity expansions at Nimji and B33 plants expected online by Q4 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1763640852770,
            "Source": "earnings"
        },
        {
            "Title": "Diffusion Engineers Reports 19.5% Revenue Growth in Q2FY26 with Strong Order Book",
            "Summary": "Diffusion Engineers Limited achieved revenue of Rs 835.66 million in Q2FY26, marking a 19.48% increase over Q2FY25, with profit after tax rising 13.74% to Rs 99.13 million and EBITDA margin at 13.99%. The company maintains a robust order book of over Rs 170 crore driven by strong demand for Roll Press Rolls in the cement sector and heavy engineering applications, positioning it well for sustained growth.",
            "Sentiment": "positive",
            "PublishDate": 1763214084783,
            "Source": "earnings"
        },
        {
            "Title": "Diffusion Engineers Limited Schedules Earnings Conference Call for Q2 FY2025-26",
            "Summary": "Diffusion Engineers Limited announced it will host an earnings conference call on Monday, November 17, 2025 at 4:00 PM to discuss the company's operational and financial performance for Q2 FY2025-26. The call will be attended by key management representatives including Chairman Managing Director Prashant Garg, Chief Executive Officer Ramesh Kumar Narasinghbhan, Chief Financial Officer Abhishek Mehta, and Company Secretary Compliance Officer Chanchal Jaiswal. Access details and registration information have been provided for stakeholders to participate in the discussion.",
            "Sentiment": "neutral",
            "PublishDate": 1762965321222,
            "Source": "earnings"
        },
        {
            "Title": "Diffusion Engineers Secures INR 22.86 Crore Domestic Order for Power Industry Components",
            "Summary": "Diffusion Engineers Limited has received a domestic order worth approximately INR 22.86 crores for supplying ID, PA and FD Fan Statics, Rotary Air Preheater Statics and Rotor components to the power industry. The order is to be completed by May 31, 2027. The company confirmed that the awarding entity has no connection to promoters or group companies, and the transaction does not fall under related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1759317163324,
            "Source": "order&deals"
        },
        {
            "Title": "Diffusion Engineers Secures INR 7.6 Crore Domestic Order for Cement Mill Equipment",
            "Summary": "Diffusion Engineers Limited received a domestic order worth approximately INR 7.6 crores for supplying rollers for cement mill roller press. The order will be delivered over the next 10 months. The contract is with a domestic client and does not involve any promoter group interest or related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1758781458741,
            "Source": "order&deals"
        },
        {
            "Title": "Diffusion Engineers Makes Q1 FY 2025-26 Earnings Call Audio Available on Website",
            "Summary": "Diffusion Engineers Limited, listed on NSE (Symbol: DIFFNKG) and BSE (Scrip Code: 544264), has made the audio recording of their earnings conference call available on their company website. The call discussed un-audited financial results for Q1 FY 2025-26 ending June 30, 2025. The company operates in the engineering sector and conducted the call with investors and analysts. The audio recording is publicly accessible on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1755610469005,
            "Source": "earnings"
        },
        {
            "Title": "Diffusion Engineers Submits IPO Proceeds Monitoring Report for Quarter Ended June 30, 2025",
            "Summary": "Diffusion Engineers Limited submitted its monitoring agency report for the quarter ended June 30, 2025, detailing utilization of proceeds from its Initial Public Offer. The company raised Rs 1,579.64 million through its IPO held from September 26-30, 2024, with net proceeds of Rs 1,421.95 million after expenses. During the quarter, Rs 19.64 million was utilized, bringing total utilization to Rs 542.34 million, leaving Rs 1,037.30 million unutilized. The proceeds are allocated for expanding existing manufacturing facility at Unit IV (Rs 713.80 million), setting up new facility at Hingna (Rs 303.85 million), working capital requirements (Rs 220.00 million), and general corporate purposes (Rs 184.30 million). Working capital funding has been fully utilized, while no funds were used for general corporate purposes during the quarter. Unutilized proceeds of Rs 1,049.86 million are deployed in fixed deposits across various banks earning returns between 6.60% to 7.86%. CRISIL Ratings Limited, the monitoring agency, reported no deviations from disclosed objects and confirmed proceeds were utilized as per the offer document.",
            "Sentiment": "neutral",
            "PublishDate": 1755148724746,
            "Source": "stock"
        },
        {
            "Title": "Diffusion Engineers Focuses on Infrastructure and Industrial Demand Through Capacity Expansion",
            "Summary": "Diffusion Engineers is targeting infrastructure and industrial capital expenditure demand through its wear solutions and welding consumables business. The company is pursuing capacity expansion and new product development initiatives aimed at supporting margin improvement.",
            "Sentiment": "positive",
            "PublishDate": 1755102921123,
            "Source": "stock"
        },
        {
            "Title": "Diffusion Engineers Reports Strong Q1 Performance with 69% Jump in Net Profit",
            "Summary": "Diffusion Engineers reported quarterly results showing net profit of 122 million rupees compared to 72 million rupees in the same period last year. Revenue increased to 807 million rupees from 711 million rupees year-over-year. EBITDA rose to 106 million rupees from 92 million rupees, while EBITDA margin improved to 13.12% from 12.97%.",
            "Sentiment": "positive",
            "PublishDate": 1755009752902,
            "Source": "earnings"
        },
        {
            "Title": "Diffusion Engineers Establishes New Unit in UAE",
            "Summary": "Diffusion Engineers has set up a new unit in the United Arab Emirates (UAE) to expand its welding solutions offering.",
            "Sentiment": "positive",
            "PublishDate": 1752654090000,
            "Source": "default"
        },
        {
            "Title": "Multiple Companies: Last Day to Buy Shares for Dividend Eligibility",
            "Summary": "July 10 is the last day to buy shares of Dr. Reddy's Laboratories Ltd., Diffusion Engineers Ltd., LMW Ltd., and Wheels India to be eligible for dividend payment due to India's T+1 settlement system. Diffusion Engineers' stock rose 2.45%, Wheels India increased 0.37%, while Dr. Reddy's declined 0.39% in early trading.",
            "Sentiment": "neutral",
            "PublishDate": 1752036259000,
            "Source": "corporate_action"
        },
        {
            "Title": "Diffusion Engineers Secures 480 Million Rupees Order for HPGR Supply",
            "Summary": "Diffusion Engineers has received an order worth 480 million rupees for the supply of High Pressure Grinding Rolls (HPGR). The company has not provided any additional details about the client or the specific nature of the order.",
            "Sentiment": "positive",
            "PublishDate": 1751328357000,
            "Source": "default"
        },
        {
            "Title": "Diffusion Engineers Secures 480 Million Rupees Order for HPGR Supply",
            "Summary": "Diffusion Engineers has received an order worth 480 million rupees for the supply of High Pressure Grinding Rollers (HPGR). This significant order represents a substantial business opportunity for the company.",
            "Sentiment": "positive",
            "PublishDate": 1751288591000,
            "Source": "default"
        },
        {
            "Title": "Diffusion Engineers Reports Q4 Financial Results",
            "Summary": "Diffusion Engineers announced its Q4 financial results. The company's EBITDA increased to 147 million rupees from 105 million rupees year-over-year. The EBITDA margin improved to 14.34% from 13.23% in the same period. Consolidated net profit rose to 130 million rupees, up from 72 million rupees year-over-year and 92 million rupees quarter-over-quarter. Revenue for Q4 reached 1.02 billion rupees, compared to 711 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747322336000,
            "Source": "result"
        },
        {
            "Title": "Diffusion Engineers Reports Strong Q3 Financial Results",
            "Summary": "Diffusion Engineers announced its Q3 consolidated net profit of 229 million rupees, up from 157 million rupees year-over-year and 215 million rupees quarter-over-quarter. The company's Q3 revenue increased to 2.3 billion rupees from 1.5 billion rupees in the previous year. Additionally, Diffusion Engineers reported the incorporation of a wholly-owned subsidiary in the UAE.",
            "Sentiment": "positive",
            "PublishDate": 1739146377000,
            "Source": "earnings"
        },
        {
            "Title": "Diffusion Engineers Reports Q3 EBITDA Growth",
            "Summary": "Diffusion Engineers has reported a significant increase in its Q3 EBITDA, rising to 324 million rupees from 218 million rupees in the same quarter last year. However, the company's EBITDA margin slightly decreased to 13.92% from 14.19% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738936863000,
            "Source": "earnings"
        },
        {
            "Title": "Diffusion Engineers Reports Strong Q3 Financial Performance",
            "Summary": "Diffusion Engineers has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 229 million rupees, up from 157 million rupees in the same quarter last year. Sequentially, net profit rose from 215 million rupees in the previous quarter. Revenue for Q3 reached 2.3 billion rupees, compared to 1.5 billion rupees in the year-ago period, marking substantial top-line growth.",
            "Sentiment": "positive",
            "PublishDate": 1738936692000,
            "Source": "earnings"
        },
        {
            "Title": "Diffusion Engineers Announces Incorporation of Wholly-Owned Subsidiary in UAE",
            "Summary": "Diffusion Engineers has reported the incorporation of a new wholly-owned subsidiary in the United Arab Emirates. This strategic move suggests an expansion of the company's operations into the Middle Eastern market, potentially aiming to capitalize on new business opportunities and strengthen its global presence.",
            "Sentiment": "positive",
            "PublishDate": 1738934766000,
            "Source": "corporate_action"
        }
    ]
}