{
    "Symbol": "DIGIKORE",
    "ISIN": "INE0QJ901011",
    "News": [
        {
            "Title": "Digikore Studios Targets Revenue of Over 600 Million Rupees for FY25-26",
            "Summary": "Digikore Studios has set a revenue target of over 600 million rupees for FY25-26, aiming to achieve an 18% profit margin during this period.",
            "Sentiment": "positive",
            "PublishDate": 1759297285795,
            "Source": "stock"
        },
        {
            "Title": "Digikore Studios Enters AI Music Market",
            "Summary": "Digikore Studios has announced its entry into the $30 billion AI music market with an innovative technology. This move represents a significant expansion for the company into a rapidly growing sector of the technology and entertainment industry.",
            "Sentiment": "positive",
            "PublishDate": 1733978717000,
            "Source": "corporate_action"
        },
        {
            "Title": "Digikore Studios Introduces Revolutionary Ad Production Technology",
            "Summary": "<p><span class='neutral'>Digikore Studios</span> has unveiled a <span class='positive'>new technology</span> that has the potential to <span class='neutral'>significantly disrupt</span> the traditional advertising production industry. This <b>innovative system</b> is capable of creating <span class='positive'>customized, high-quality</span> video advertisements, which could <span class='positive'>revolutionize</span> how ads are produced and potentially <span class='positive'>reduce costs and time</span> in the advertising sector.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728375873000,
            "Source": "corporate_action"
        },
        {
            "Title": "Digikore Studios Creates World's First Fully AI-Generated 30-Second Video",
            "Summary": "<p><span class=\"positive\">Digikore Studios</span> has achieved a <b>significant milestone</b> by becoming the <b>first</b> visual effects (VFX) company globally to produce a <span class=\"positive\">fully AI-generated</span> 30-second video content. This <span class=\"positive\">breakthrough</span> demonstrates the company's <span class=\"positive\">innovative capabilities</span> in leveraging <span class=\"neutral\">artificial intelligence</span> for video production.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728375852000,
            "Source": "corporate_action"
        }
    ]
}