{
    "Symbol": "DIGISPICE",
    "ISIN": "INE927C01020",
    "News": [
        {
            "Title": "DIGISPICE Technologies Board Meet on Feb 12, 2026",
            "Summary": "DIGISPICE Technologies Limited has scheduled a Board of Directors meeting on February 12, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770799202533,
            "Source": "co_actions_results"
        },
        {
            "Title": "DiGiSPICE Allots 2 Lakh Equity Shares Under Employee Stock Option Plan",
            "Summary": "DiGiSPICE Technologies allotted 2,00,000 equity shares of Rs. 3 each to eligible employees who exercised options under the DTL Employees Stock Option Plan-2018 at an exercise price of Rs. 13.25 per share. The allotment increased the company's paid-up equity share capital from Rs. 70,28,13,318 to Rs. 70,34,13,318, with total issued shares rising to 23,44,71,106.",
            "Sentiment": "neutral",
            "PublishDate": 1764413574303,
            "Source": "corporate_action"
        },
        {
            "Title": "DiGiSPICE Reports Strong Q2 FY26 Results with 22% Revenue Growth and Second Consecutive Profitable Quarter",
            "Summary": "DiGiSPICE Technologies delivered Rs. 124 crore revenue for Q2 FY26, up 14% year-on-year, with PAT of Rs. 7.2 crores marking second consecutive quarter of profitability and 12.8% annualized ROCE. The fintech company's SpiceMoney platform now serves 100 million customers through 1.6 million BC agents across 250,000 small towns, with customer GTV growing 22% to Rs. 32,270 crores and credit distribution surging 2.6x to Rs. 176 crores.",
            "Sentiment": "positive",
            "PublishDate": 1763983150688,
            "Source": "earnings"
        },
        {
            "Title": "DiGiSPICE Reports Strong Q2 FY26 Performance with 23% Revenue Growth and New UPI Cash Point Launch",
            "Summary": "DiGiSPICE Technologies delivered robust quarterly results with customer GTV growing 23% year-over-year to ₹32,270 crores, revenues reaching ₹124.6 crores, and PAT from continued operations at ₹7.3 crores. The company launched UPI Cash Point feature at Global Fintech Fest 2025, enabling cash withdrawals at BC outlets through UPI, expanding its rural fintech platform serving over 100 million customers across 2.54 lakh small towns through 16.1 lakh registered agents.",
            "Sentiment": "positive",
            "PublishDate": 1763370768632,
            "Source": "earnings"
        },
        {
            "Title": "DiGiSPICE Technologies Reports Quarterly Results and Board Updates on Trust Share Disposal Plans",
            "Summary": "DiGiSPICE Technologies Limited's Board of Directors approved unaudited financial results for the quarter and half year ended September 30, 2025. The Board meeting was held on November 11, 2025, with results reviewed by the Audit Committee and audited by S.R. Batliboi & Co. LLP. Additionally, the Board noted intimations from Independent Non-Promoter Trust (holding 6.79%) and Independent Non-Promoter (Spice Employee Benefit) Trust (holding 4.33%) regarding their decision to dispose shares held in the company. The share disposal details will be communicated upon finalization by the trusts. This development relates to the ongoing Scheme of Amalgamation between DiGiSPICE Technologies and three other companies - SpiceMoney Limited, E-Arth Travel Solutions Private Limited, and Vikasni Fintech Private Limited. The scheme remains conditional upon NCLT approval and disposal of equity shareholding by the trusts.",
            "Sentiment": "neutral",
            "PublishDate": 1762916469992,
            "Source": "earnings"
        },
        {
            "Title": "DigiSpice Technologies Reports Growth in Q2 Financial Metrics",
            "Summary": "DigiSpice Technologies reported Q2 EBITDA of 69 million rupees compared to 63.9 million rupees in the previous quarter. The company's EBITDA margin improved to 5.55% from 5.17% quarter-over-quarter. Consolidated net profit reached 71 million rupees versus 68.5 million rupees in the prior quarter. Revenue for Q2 stood at 1.25 billion rupees compared to 1.24 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762876581367,
            "Source": "earnings"
        },
        {
            "Title": "DiGiSPICE Technologies Receives NSE No-Objection for Merger Scheme with Three Companies",
            "Summary": "DiGiSPICE Technologies Limited received a no-objection observation letter from the National Stock Exchange of India Limited for its proposed scheme of amalgamation with Spice Money Limited, E-Arth Travel Solutions Private Limited, and Vikasni Fintech Private Limited. The NSE letter, dated September 19, 2025, enables the company to file the draft scheme with NCLT. The approval comes with multiple conditions including disclosure of ongoing legal proceedings, compliance with SEBI circulars, ensuring financial information is not older than 6 months, and mandating that new equity shares be issued in demat form only. The scheme requires public shareholder approval where votes in favor must exceed votes against. The observation letter is valid for six months from September 19, 2025, within which the scheme must be submitted to NCLT. The scheme remains subject to other regulatory approvals and conditions.",
            "Sentiment": "positive",
            "PublishDate": 1758291373912,
            "Source": "corporate_action"
        },
        {
            "Title": "DiGiSPICE Technologies Receives No-Adverse Observations Letter from BSE for Merger Scheme",
            "Summary": "DiGiSPICE Technologies Limited received a no-adverse observations letter from BSE Limited regarding its proposed scheme of amalgamation with Spice Money Limited, E-Arth Travel Solutions Private Limited, and Vikasni Fintech Private Limited. The letter, dated September 18, 2025, includes specific conditions from SEBI that must be met, including disclosure of ongoing legal proceedings, compliance with regulatory circulars, and ensuring public shareholder votes in favor exceed those against. The scheme involves DiGiSPICE as the transferee company absorbing the three transferor companies. BSE's observation letter is valid for six months, within which the scheme must be submitted to the National Company Law Tribunal. The scheme remains subject to regulatory and other approvals.",
            "Sentiment": "positive",
            "PublishDate": 1758180137488,
            "Source": "corporate_action"
        },
        {
            "Title": "DiGiSPICE Technologies Reports Quarterly Results for June 30, 2025",
            "Summary": "DiGiSPICE Technologies Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs. 92.91 lakhs and total income of Rs. 92.91 lakhs. The company recorded a loss after tax of Rs. 97.21 lakhs from continuing operations. On a consolidated basis, revenue from operations was Rs. 12,375.66 lakhs with total income of Rs. 12,932.03 lakhs. Consolidated profit after tax was Rs. 693.24 lakhs. The company's Digital Technology Services business operations were completely discontinued on July 1, 2024, except for assets held for sale. During the quarter, the company acquired an additional 1.94% stake in subsidiary Spice Money Limited for Rs. 449.90 lakhs. Spice Digital FZCO, a step-down subsidiary, was wound up and dissolved on April 18, 2025. The results were reviewed by the Audit Committee and statutory auditors S.R. Batliboi & Co. LLP.",
            "Sentiment": "neutral",
            "PublishDate": 1755009065694,
            "Source": "earnings"
        },
        {
            "Title": "DigiSpice Technologies Reports Strong Q1 Performance with Revenue Growth and Return to Profitability",
            "Summary": "DigiSpice Technologies reported Q1 revenue of 1.24 billion rupees, showing growth from 1.12 billion rupees in the previous quarter. The company's EBITDA surged to 63.9 million rupees from 7 million rupees quarter-over-quarter, with EBITDA margin improving significantly to 5.17% from 0.59%. The company returned to profitability with consolidated net profit of 68.5 million rupees, compared to a loss of 124 million rupees in the previous quarter. Year-over-year revenue also increased to 1.24 billion rupees from 1.12 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1755005798064,
            "Source": "earnings"
        },
        {
            "Title": "DigiSpice Technologies Reports Q4 Financial Results",
            "Summary": "DigiSpice Technologies has reported its quarterly financial results. The company's consolidated net loss for Q4 decreased to 123 million rupees, compared to a loss of 195 million rupees in the previous quarter. Revenue for Q4 increased to 1.2 billion rupees from 1.13 billion rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748007571000,
            "Source": "result"
        },
        {
            "Title": "DigiSpice Technologies Acquires Stake in Spice Money",
            "Summary": "DigiSpice Technologies has acquired a 1.94% stake in Spice Money for 4.5 crore rupees. This acquisition represents a strategic investment by DigiSpice Technologies in the fintech sector.",
            "Sentiment": "neutral",
            "PublishDate": 1740106017000,
            "Source": "corporate_action"
        },
        {
            "Title": "DiGiSPICE Reports Increased Q3 Net Loss",
            "Summary": "DiGiSPICE, a digital technology company, reported a consolidated net loss of 195 million rupees for the third quarter, compared to a loss of 74 million rupees in the previous quarter. The company's revenue remained stable at 1.1 billion rupees quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1739542327000,
            "Source": "earnings"
        },
        {
            "Title": "DigiSpice Technologies Reports Q2 EBITDA Loss",
            "Summary": "DigiSpice Technologies has reported an EBITDA loss of 30 million rupees for the second quarter, compared to a gain of 38 million rupees in the same period last year. This represents a significant year-over-year decline in the company's operational performance.",
            "Sentiment": "negative",
            "PublishDate": 1731600695000,
            "Source": "result"
        },
        {
            "Title": "DigiSpice Technologies Reports Mixed Q2 Financial Results",
            "Summary": "DigiSpice Technologies announced its Q2 financial results. The company reported a consolidated net loss of 72 million rupees, compared to a loss of 45 million rupees in the same quarter last year. However, it showed improvement from the previous quarter, with a profit of 57 million rupees. The company's revenue remained stable at 1.1 billion rupees, unchanged from the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731600636000,
            "Source": "result"
        }
    ]
}