{
    "Symbol": "DIGIDRIVE",
    "ISIN": "INE0PSC01024",
    "News": [
        {
            "Title": "Digidrive Distributors Q3FY26 Profit Jumps to ₹619 Lakhs",
            "Summary": "Digidrive Distributors reported strong Q3FY26 results with standalone profit of ₹619 lakhs vs loss of ₹11 lakhs in Q3FY25. Nine-month profit reached ₹669 lakhs, up from ₹71 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770378116400,
            "Source": "co_actions_results"
        },
        {
            "Title": "Digidrive Distributors Reports Mixed Performance in Q2 FY26 Results",
            "Summary": "Digidrive Distributors Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. On a standalone basis, the company reported a net loss of Rs. 11 lakhs for the quarter compared to a profit of Rs. 15 lakhs in the previous quarter. However, on a consolidated basis, the company posted a net profit of Rs. 8 lakhs for the quarter versus a loss of Rs. 9 lakhs in the prior quarter. The company operates through three business segments: Trading, Publication, and Investment. Total assets on a consolidated basis stood at Rs. 33,464 lakhs as of September 30, 2025. The results were reviewed by the audit committee and approved by the Board of Directors in their meeting held on November 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762846197405,
            "Source": "earnings"
        },
        {
            "Title": "Digidrive Distributors Reports 95% Jump in Consolidated Net Profit to Rs 791 Lakhs for FY25",
            "Summary": "Digidrive Distributors Limited, a master distributor of Carvaan music players, reported consolidated net profit of Rs 791 lakhs for FY25, up 95% from Rs 406 lakhs in the previous year. Consolidated revenue increased to Rs 4,978 lakhs from Rs 4,763 lakhs. The company's operating profit margin improved to 18.98% from 9.25%. The company operates as exclusive master distributor for Carvaan digital music players from Saregama India Limited and also owns Open Media Network Private Limited which publishes OPEN magazine. The company has scheduled its Third Annual General Meeting for September 12, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755186975074,
            "Source": "corporate_action"
        },
        {
            "Title": "Digidrive Distributors Reports Loss in Q1 FY26 Despite Revenue Growth",
            "Summary": "Digidrive Distributors Limited reported a net loss of Rs 10 lakhs for the quarter ended June 30, 2025, compared to a profit of Rs 68 lakhs in the same period last year. Revenue from operations declined to Rs 506 lakhs from Rs 948 lakhs year-on-year. On a consolidated basis, the company posted a loss of Rs 3 lakhs versus a profit of Rs 136 lakhs in the previous year, while consolidated revenue decreased to Rs 959 lakhs from Rs 1,386 lakhs. The company operates through two main segments - Trading and Investment on a standalone basis, and includes Publication segment in consolidated results through its subsidiary Open Media Network Private Limited. Total comprehensive income remained positive at Rs 2,580 lakhs on both standalone and consolidated basis due to other comprehensive income of Rs 2,590 lakhs. The Board approved these unaudited financial results in a meeting held on August 12, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1754980613874,
            "Source": "earnings"
        },
        {
            "Title": "Digidrive Distributors: Q3 Profit Soars 1614% YoY",
            "Summary": "Digidrive Distributors reported Q3 FY25 results with profit at ₹1.2 crore, up 1614.29% YoY. Revenue increased 8.93% YoY to ₹14.39 crore. Operating income rose 1850% YoY. EPS for Q3 is ₹0.31, up 1450% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1739598957000,
            "Source": "earnings"
        }
    ]
}