{
    "Symbol": "DIGJAMLMTD",
    "ISIN": "INE731U01028",
    "News": [
        {
            "Title": "Digjam Limited Announces Un-Audited Financial Results for Quarter and Half Year Ended September 30, 2025",
            "Summary": "Digjam Limited has published its un-audited financial results for the quarter and half year ended September 30, 2025. The Board of Directors approved these results at their meeting held on November 5, 2025. The company has published the results in Financial Express (English) and Malai Malar (Tamil) newspapers on November 7, 2025. The results along with limited review report have been uploaded on the stock exchange website. Digjam Limited is a fine suitings company with CIN L17123TZ2015PLC036291, listed on BSE with code 539979 and NSE with symbol DIGJAMLMTD.",
            "Sentiment": "neutral",
            "PublishDate": 1762539439911,
            "Source": "earnings"
        },
        {
            "Title": "Digjam Limited Reports Net Loss of Rs 374.23 Lakhs in Q2 FY2026 Amid Manufacturing Shutdown",
            "Summary": "Digjam Limited reported a net loss of Rs 374.23 lakhs for the quarter ended September 30, 2025, compared to a net loss of Rs 78.29 lakhs in the previous year. The company's current liabilities exceeded current assets by Rs 2,192.12 lakhs as of September 30, 2025. Operations at the company's manufacturing facility in Jamnagar were discontinued effective March 31, 2025, with related assets classified as Non-Current Assets Held for Sale valued at Rs 5,339.42 lakhs. Revenue from operations was Rs 141.89 lakhs for the quarter. The Board approved a Scheme of Arrangement with Reid and Taylor International Private Limited for demerging textile undertaking, with an appointed date of July 1, 2025. The auditors highlighted material uncertainty regarding the company's ability to continue as a going concern due to working capital deficit and discontinued operations.",
            "Sentiment": "negative",
            "PublishDate": 1762364189538,
            "Source": "earnings"
        },
        {
            "Title": "Digjam Limited Shareholders Approve Key Board Appointments at 10th AGM",
            "Summary": "Digjam Limited held its 10th Annual General Meeting on September 30, 2025, where shareholders approved multiple board appointments and reappointments. The company appointed M/s. Viral Sanghavi and Associates as Secretarial Auditor for 5 years and Mr. Ruchit Patel as Non-Executive Non-Independent Director for 5 years. Shareholders also reappointed three Independent Directors for 5-year terms: Ms. Sudha Bhushan (qualified Chartered Accountant and Company Secretary), Mr. Duraiswamy Gunaseela Rajan (Chartered Accountant and management consultant), and Mr. Panchapakesan Swaminathan (Chartered and Cost Accountant with 23 years experience in debt syndication and private equity). Additionally, Mr. Hardik Bharat Patel was reappointed as Whole-Time Director for 5 years from February 7, 2026 to February 6, 2031. Mr. Patel holds an MBA from Crummer Graduate School of Business, Florida, and is founder of Finquest Group with experience at Merrill Lynch, PCE Investment Bankers, and Fidelity Investments.",
            "Sentiment": "positive",
            "PublishDate": 1759338076464,
            "Source": "corporate_governance"
        },
        {
            "Title": "DIGJAM LIMITED Approves Quarterly Results and Multiple Director Re-appointments",
            "Summary": "DIGJAM LIMITED's Board approved un-audited financial results for the quarter ended June 30, 2025, during a meeting held on August 14, 2025. The company reported a net profit of Rs. 96.05 lakhs for the quarter, compared to a net loss of Rs. 525.82 lakhs in the previous year quarter. The Board also approved re-appointments of three Non-Executive Independent Directors: Ms. Sudha Bhushan and Mr. Duraiswamy Gunaseela Rajan for second terms of 5 years effective July 14, 2025, and Mr. Panchapakesan Swaminathan for a second term effective June 24, 2026. Additionally, Mr. Hardik Bharat Patel was re-appointed as Whole-Time Director for 5 years effective February 06, 2026. The company appointed M/s. Viral Sanghavi & Associates as Secretarial Auditor for 5 financial years from 2025-2026 to 2029-2030. However, the auditor noted material uncertainty regarding the company's going concern status, as current liabilities exceeded current assets by Rs. 544.57 lakhs and manufacturing operations at Jamnagar were discontinued effective March 31, 2025. All appointments are subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1755164838955,
            "Source": "earnings"
        },
        {
            "Title": "DIGJAM Limited Appoints Ms. Daman Preet Kaur as Company Secretary & Compliance Officer",
            "Summary": "DIGJAM Limited has appointed Ms. Daman Preet Kaur as Company Secretary & Compliance Officer effective August 04, 2025. The appointment was approved at a board meeting held on the same date. Ms. Kaur is a qualified Company Secretary from the Institute of Company Secretaries of India with membership number ACS: A41941. She is not related to any Director of the Company. The board meeting commenced at 7:30 p.m. and concluded at 8:00 p.m. The company's trading window for designated persons remains closed from July 01, 2025, until 48 hours after declaration of unaudited financial results for the quarter ended June 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754319178926,
            "Source": "corporate_governance"
        }
    ]
}