{
    "Symbol": "DISHTV",
    "ISIN": "INE836F01026",
    "News": [
        {
            "Title": "Dish TV Amends Fair Disclosure Code for SEBI Compliance",
            "Summary": "Dish TV India Limited's Board approved amendments to its Fair Disclosure Code under SEBI PIT Regulations on February 06, 2026, enhancing procedures for handling unpublished price sensitive information.",
            "Sentiment": "neutral",
            "PublishDate": 1770396726258,
            "Source": "stocks"
        },
        {
            "Title": "Dish TV Board Responds to Stock Exchange Compliance Notices",
            "Summary": "Dish TV India Limited's Board addresses stock exchange notices regarding non-compliance with board composition requirements for Q2 FY26, citing regulatory constraints from MIB approval requirements.",
            "Sentiment": "negative",
            "PublishDate": 1770384851103,
            "Source": "stocks"
        },
        {
            "Title": "Dish TV Reports Q3 FY26 Loss of ₹50.34 Cr",
            "Summary": "Dish TV India posted consolidated net loss of ₹50.34 crores for Q3 FY26, with revenue declining to ₹91.95 crores from ₹122.39 crores in previous year period.",
            "Sentiment": "negative",
            "PublishDate": 1770382859768,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dish TV India Fined by NSE and BSE for Board Composition Non-Compliance",
            "Summary": "Dish TV India received fines from both NSE and BSE for violating board composition regulations during the quarter ended September 30, 2025, due to reduced board strength caused by shareholders not approving director appointments. The company stated the non-compliance was beyond board control and will pay the imposed fines within the required timeframe, with no impact on operations beyond the monetary penalty.",
            "Sentiment": "positive",
            "PublishDate": 1764338231290,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dish TV Q2 Loss Widens to Rs 133 Crore; Utkarsh Small Finance Bank Reports Rs 349 Crore Loss",
            "Summary": "Dish TV India's quarterly net loss expanded to Rs 133 crore from Rs 37 crore year-on-year as operating revenue declined 26% to Rs 291 crore, while the company launched VZY Smart TVs integrating DTH and OTT services. Utkarsh Small Finance Bank's net loss widened to Rs 349 crore with gross NPAs rising to 12.42% from 3.88% a year ago, reflecting deteriorating asset quality across both companies.",
            "Sentiment": "negative",
            "PublishDate": 1763134108421,
            "Source": "earnings"
        },
        {
            "Title": "Dish TV Fined Rs. 5.69 Lakh by Stock Exchanges for Board Composition Non-Compliance",
            "Summary": "NSE and BSE imposed fines totaling Rs. 5.69 lakh on Dish TV India for non-compliance with board composition and committee requirements for the quarter ended June 30, 2025. The company's board cited shareholder non-approval of director appointments and mandatory Ministry of Information and Broadcasting approvals as reasons beyond their control for maintaining only three directors instead of the required six.",
            "Sentiment": "negative",
            "PublishDate": 1763130235262,
            "Source": "earnings"
        },
        {
            "Title": "Tax Commissioner Appeals Tribunal Decision Favoring DISH TV India in ₹421.9 Million Case",
            "Summary": "The Tax Commissioner has filed an appeal in court challenging a tribunal's decision that favored DISH TV India. The litigation involves an amount of ₹421.9 million.",
            "Sentiment": "negative",
            "PublishDate": 1759848180114,
            "Source": "stock"
        },
        {
            "Title": "Dish TV India Wins CESTAT Ruling, Cancels ₹56.47 Lakh Duty Demand",
            "Summary": "Dish TV India received a favorable ruling from the Customs, Excise and Service Tax Appellate Tribunal (CESTAT), which resulted in the cancellation of a ₹56.47 lakh duty demand from the Directorate of Revenue Intelligence (DRI). This legal victory eliminates the financial liability for the direct-to-home television service provider.",
            "Sentiment": "positive",
            "PublishDate": 1759756033115,
            "Source": "stock"
        },
        {
            "Title": "Dish TV Subsidiary Launches VZY Smart TVs Combining DTH and Streaming Services",
            "Summary": "Dish TV's subsidiary Dish Infra has launched VZY Smart TVs in India. The new television products integrate DTH (Direct-to-Home) services with streaming capabilities, offering consumers a combined entertainment solution.",
            "Sentiment": "positive",
            "PublishDate": 1757327751526,
            "Source": "stock"
        },
        {
            "Title": "BSE and NSE Fine Dish TV Rs 5.69 Lakh Each Over Board Composition Issues",
            "Summary": "Dish TV India has been fined by BSE and NSE for non-compliance with board composition regulations during the quarter ended June 30. Each exchange imposed a fine of Rs 5.69 lakh, which must be paid within 15 days. The violations relate to Regulations 17(1) and 19(1)/(2) of SEBI Listing Regulations regarding board strength and quorum requirements. Dish TV attributed the non-compliance to shareholders not approving director appointments, stating this was beyond the company's control. The company has faced similar penalties in 2023 and 2024 for the same issues. Dish TV's board currently consists of seven members including Executive Director-Chairperson-CEO Manoj Dobhal and four independent directors. The company has been experiencing ongoing board-level disputes among promoters, with shareholders previously rejecting multiple proposals including director appointments and re-appointments in extraordinary general meetings. Subhash Chandra's promoter group holds around 4% stake and was involved in disputes with YES Bank over board reconstitution. YBL, formerly the largest shareholder with 24.2% stake, has sold its holding to JC Flowers Asset Reconstruction.",
            "Sentiment": "negative",
            "PublishDate": 1756635558561,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dish TV India Reports Widened Q1 Net Loss Despite Improved EBITDA Margin",
            "Summary": "Dish TV India reported a consolidated net loss of 945 million rupees in Q1 compared to a loss of 16 million rupees in the same period last year. Revenue declined to 3.3 billion rupees from 4.6 billion rupees year-over-year. However, EBITDA decreased to 728 million rupees from 1.6 billion rupees, while EBITDA margin improved to 50.01% from 36.12% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1755005868246,
            "Source": "earnings"
        },
        {
            "Title": "Dish TV India: Q4 Net Loss Narrows, Revenue Declines",
            "Summary": "Dish TV India reported a Q4 FY25 consolidated net loss of Rs 402.2 crore, improved from Rs 1,989.7 crore year-on-year. Total operating revenue fell 15.55% to Rs 343.7 crore. Subscription revenue declined 16.82% to Rs 295.9 crore. EBITDA dropped 41.1% to Rs 97.3 crore. The company elevated Manoj Dobhal to Chairman of the Board.",
            "Sentiment": "neutral",
            "PublishDate": 1748453514000,
            "Source": "earnings"
        },
        {
            "Title": "DISH TV India Reports Q4 EBITDA Decline",
            "Summary": "DISH TV India has reported its quarterly financial results. The company's Q4 EBITDA decreased to 973 million rupees from 1.7 billion rupees in the same quarter last year. The Q4 EBITDA margin also declined to 28.32% from 36.23% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748441391000,
            "Source": "result"
        },
        {
            "Title": "Dish TV India Reports Q4 Financial Results",
            "Summary": "Dish TV India has reported its latest quarterly financial results. The company's consolidated net loss for Q4 was 4 billion rupees, compared to a loss of 19.9 billion rupees in the same quarter last year, showing a year-over-year improvement. However, the loss increased from 465 million rupees in the previous quarter. Revenue for Q4 was 3.4 billion rupees, down from 4.1 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1748441330000,
            "Source": "result"
        },
        {
            "Title": "Dish TV India to Consider Q4 Results on May 28",
            "Summary": "Dish TV India has announced that it will consider its fourth quarter financial results on May 28. This indicates the company is preparing to release its latest earnings report, which will provide insights into its financial performance for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746627513000,
            "Source": "default"
        },
        {
            "Title": "Dish TV India Receives Non-Compliance Notices from NSE and BSE",
            "Summary": "Dish TV India has been issued notices by the National Stock Exchange (NSE) and Bombay Stock Exchange (BSE) for non-compliance with certain regulations. The specific details of the non-compliance are not provided in the given news snippet, but such notices typically indicate that the company has failed to meet certain listing or regulatory requirements set by the stock exchanges.",
            "Sentiment": "negative",
            "PublishDate": 1743001050000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dish TV India Reports Increased Q3 Net Loss and Revenue Decline",
            "Summary": "Dish TV India's financial results for the third quarter show a significant increase in net loss, rising to 465 million rupees from 28 million rupees in the same period last year. The company also experienced a substantial decline in revenue, dropping to 3.7 billion rupees from 4.7 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739751484000,
            "Source": "earnings"
        },
        {
            "Title": "DISH TV India Reports Decline in Q3 EBITDA and Margin",
            "Summary": "DISH TV India has reported its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 1.23 billion rupees from 1.7 billion rupees in the same quarter of the previous year. Additionally, the EBITDA margin declined to 32.90% from 36.23% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739539067000,
            "Source": "earnings"
        },
        {
            "Title": "DISH TV India Reports Increased Q3 Net Loss and Decreased Revenue",
            "Summary": "DISH TV India has reported a significant increase in its consolidated net loss for the third quarter, rising to 465 million rupees from 28 million rupees in the same period last year. The company's revenue also declined, falling to 3.7 billion rupees from 4.7 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739539061000,
            "Source": "earnings"
        },
        {
            "Title": "DISH TV Schedules Q3 Results Announcement",
            "Summary": "DISH TV has announced that it will consider and approve its third quarter financial results on February 14th. This indicates the company is preparing to disclose its performance for the latest fiscal quarter to shareholders and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1738160265000,
            "Source": "earnings"
        },
        {
            "Title": "DISH TV India Reports Decline in Q2 EBITDA and Margin",
            "Summary": "DISH TV India's Q2 EBITDA decreased to 1.4 billion rupees from 1.95 billion rupees year-over-year. The company's EBITDA margin also declined to 36.54% from 40.77% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731505347000,
            "Source": "result"
        },
        {
            "Title": "DISH TV India Reports Q2 Revenue Decline",
            "Summary": "DISH TV India has reported a revenue of 3.96 billion rupees for the second quarter, which represents a decrease from 4.8 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1731505245000,
            "Source": "result"
        },
        {
            "Title": "DISH TV India Reports Increased Q2 Net Loss",
            "Summary": "DISH TV India has reported a consolidated net loss of 374 million rupees for the second quarter, compared to a loss of 54 million rupees in the same period last year. This represents a significant year-over-year increase in losses. The company's loss also widened from 16 million rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1731505180000,
            "Source": "result"
        },
        {
            "Title": "DISH TV and SEI Robotics Launch 'DISH TV Smart+ Box'",
            "Summary": "<p>DISH TV has partnered with <span class=\"neutral\">SEI Robotics</span> to launch the '<span class=\"positive\">DISH TV Smart+ Box</span>', a new device that allows users to access both <b>traditional TV content</b> and <b>OTT (Over-The-Top) streaming services</b> on any screen, from any location. This product aims to <span class=\"positive\">enhance</span> the viewing experience by combining <b>conventional television programming</b> with <b>modern streaming capabilities</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728377190000,
            "Source": "corporate_action"
        }
    ]
}