{
    "Symbol": "DIVGIITTS",
    "ISIN": "INE753U01022",
    "News": [
        {
            "Title": "Divgi TTS Wins Exclusive M&M Transfer Case Order",
            "Summary": "Divgi TorqTransfer Systems secures exclusive order from Mahindra & Mahindra for 35,000 transfer case units for Scorpio Pik-Up Indonesia export programme in CY 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770815206753,
            "Source": "co_actions_results"
        },
        {
            "Title": "Divgi TorqTransfer Systems Plans Investor Roadshow",
            "Summary": "Divgi TorqTransfer Systems Limited announces Non-Deal Roadshow scheduled for January 12-13, 2026 in Mumbai to meet analysts and institutional investors through Centrum Broking Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1767787283585,
            "Source": "stocks"
        },
        {
            "Title": "Divgi TorqTransfer Systems Reports Record Q2 Revenue and Secures Major Japanese OEM Contract",
            "Summary": "Divgi TorqTransfer Systems achieved highest ever quarterly revenue of INR 88 crores in Q2 FY26, marking 49% year-on-year growth, with PAT rising 43% to INR 19.7 crores for H1. The company secured a strategic nomination from a leading Japanese OEM through Toyota Tsusho for transfer-case development on a global pickup truck platform, with production starting H1 FY28.",
            "Sentiment": "positive",
            "PublishDate": 1763633176511,
            "Source": "earnings"
        },
        {
            "Title": "Divgi Torq Transfer Systems Wins Rs 62 Crore Order from Toyota Tsusho India",
            "Summary": "Divgi Torq Transfer Systems Limited has received order confirmation from Toyota Tsusho India Pvt Ltd for transfer case business. The multi-year contract is valued at approximately Rs 62 crores of lifecycle revenue and will be executed over 6 years starting from H1FY28 after product validation and approval. The order involves supply of transfer case design for commercial pick-up truck products for India and international markets. This marks the company's first business award from Toyota Tsusho India. Managing Director Jitendra Divgi stated this achievement reflects confidence in their latest generation product and could open opportunities with other Japanese OEMs. The project involves technical challenges including integration of synchronizer technology, compatibility with In-Vehicle Networking, superior Noise Vibration Harshness standards, and integration with both manual and automatic transmissions.",
            "Sentiment": "positive",
            "PublishDate": 1762999594828,
            "Source": "order&deals"
        },
        {
            "Title": "Divgi TorqTransfer Systems Reports No Material Deviation in IPO Proceeds Utilization",
            "Summary": "Divgi TorqTransfer Systems Limited submitted its monitoring agency report through ICRA Limited for quarterly results ended September 30, 2025. The company reported no material deviation from IPO objects, with proceeds utilization in line with stated purposes. Out of total net proceeds of INR 169.662 crore, the company has utilized INR 79.208 crore, leaving INR 90.454 crore unutilized. The company deployed unused funds in fixed deposits with SBI Bank and HDFC Bank earning returns between 6.40% to 7.61%. For capital expenditure requirements, INR 60.374 crore has been spent out of INR 150.707 crore allocated for equipment and machinery purchases. General corporate purposes utilized INR 18.834 crore out of INR 18.955 crore allocated. The monitoring agency confirmed no major deviations from earlier reports and stated that utilization remains on track with disclosed objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1762978088044,
            "Source": "corporate_action"
        },
        {
            "Title": "Divgi TorqTransfer Systems Expands Into EV Transmission Systems and Hybrid Drivetrain Segments",
            "Summary": "Divgi TorqTransfer Systems is expanding its product portfolio by entering the EV transmission systems market and growing its presence in hybrid drivetrain and DCT segments. The company is working to increase its global OEM share while focusing on export ramp-up and backward integration strategies aimed at margin expansion.",
            "Sentiment": "positive",
            "PublishDate": 1762963325987,
            "Source": "stock"
        },
        {
            "Title": "Divgi TorqTransfer Systems Secures 620 Million Rupee Contract",
            "Summary": "Divgi TorqTransfer Systems has secured a contract worth approximately 620 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1762958776726,
            "Source": "order&deals"
        },
        {
            "Title": "Divgi TorqTransfer Systems Reports 38% Jump in Q2 Net Profit to 108M Rupees",
            "Summary": "Divgi TorqTransfer Systems reported Q2 net profit of 108 million rupees compared to 78 million rupees in the same period last year. Revenue increased to 830 million rupees from 540 million rupees year-over-year. EBITDA rose to 166 million rupees from 113 million rupees, though EBITDA margin declined slightly to 19.98% from 21.02% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762957030831,
            "Source": "earnings"
        },
        {
            "Title": "Divgi TorqTransfer Systems Revises Record Date to September 9 for Final Dividend and AGM Voting Rights",
            "Summary": "Divgi TorqTransfer Systems Limited has announced a revised record date of September 9, 2025 for determining shareholder eligibility for the final dividend of ₹2.60 per equity share for FY 2024-25 and voting rights at the Annual General Meeting scheduled for September 16, 2025. The revision was made following NSE's circular regarding a settlement holiday on September 8, 2025 due to EID. Shareholders registered on the cut-off date will be entitled to receive the dividend and participate in electronic voting for the AGM business.",
            "Sentiment": "neutral",
            "PublishDate": 1757050324804,
            "Source": "corporate_action"
        },
        {
            "Title": "Divgi TorqTransfer Systems Reports Record Quarterly Revenue of Rs 76.8 Crores with 29% YoY Growth",
            "Summary": "Divgi TorqTransfer Systems Limited achieved its highest ever quarterly revenue of Rs 76.8 crores in Q1 FY26, marking 29% year-on-year growth and 20% sequential increase. The company reported EBITDA of Rs 19.1 crores (up 37% YoY) and profit after tax of Rs 9 crores (50% YoY growth). Transfer case segment drove growth with 34% YoY increase due to strong volume offtake from key OEM customers. Components business surged 72% YoY, with export revenues climbing back to double-digit contribution levels. EV transmission segment declined 9% YoY due to industry challenges but management expects volume ramp-up in second half of FY26. The company maintained gross margins above 60%, EBITDA margins exceeding 24%, and PAT margins crossing 11%. Monthly average volumes in transfer cases have reached FY24 levels after prolonged softness. Management highlighted progress in automatic transmission development, with successful vehicle trials completed and proof-of-concept discussions underway with Indian OEMs. Export contribution grew from 1% in FY24 to 11% in Q1 FY26, with expectations to double export revenues in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1755164981033,
            "Source": "earnings"
        },
        {
            "Title": "Divgi TorqTransfer Systems Sets Record Date for ₹2.60 Final Dividend",
            "Summary": "Divgi TorqTransfer Systems Limited has set September 8, 2025 as the record date for determining shareholder eligibility to receive a final dividend of ₹2.60 per equity share for FY 2024-25. The company's Annual General Meeting is scheduled for September 16, 2025. Shareholders on record as of the specified date will be entitled to receive the dividend payment.",
            "Sentiment": "positive",
            "PublishDate": 1754914041986,
            "Source": "corporate_action"
        },
        {
            "Title": "Divgi Targets ₹1,500 Crores Annual Revenue Through Electric Vehicle Expansion",
            "Summary": "Divgi is positioning itself for long-term growth through multiple strategic initiatives. The company has built a strong order book and is expanding into the electric vehicle sector. Additionally, Divgi is pursuing hybrid technology development as part of its growth strategy, with an ambitious target of achieving ₹1,500 crores in annual revenue.",
            "Sentiment": "positive",
            "PublishDate": 1754583332448,
            "Source": "stock"
        },
        {
            "Title": "Divgi TorqTransfer Systems Reports Q1 2025 Results, Declares ₹2.60 Dividend and Sets AGM Date",
            "Summary": "Divgi TorqTransfer Systems approved its unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of ₹716.76 million, up from ₹542.29 million in the previous quarter and ₹582.20 million in the same quarter last year. Net profit for the quarter stood at ₹89.29 million compared to ₹53.52 million in the previous quarter and ₹59.61 million in the corresponding quarter of the previous year. The board declared a final dividend of ₹2.60 per equity share for FY 2024-25 with September 8, 2025 as the record date. The company scheduled its 60th Annual General Meeting for September 16, 2025. Additionally, the board appointed CS Rucha Kale as scrutinizer for e-voting, Kanj and Co. LLP as secretarial auditor for five years, and Kirtane & Pandit LLP as internal auditor for two years. The company operates in the auto components and parts segment and has unutilized IPO proceeds of ₹954.69 million as of June 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754575054511,
            "Source": "corporate_action"
        },
        {
            "Title": "Divgi TorqTransfer Systems Reports Strong Q1 Growth with 48% Revenue Increase",
            "Summary": "Divgi TorqTransfer Systems delivered robust Q1 performance with revenue rising to 717 million rupees from 542 million rupees year-over-year. Net profit increased to 89 million rupees compared to 60 million rupees in the same period last year. EBITDA grew to 141 million rupees from 88 million rupees, while EBITDA margin expanded to 19.67% from 16.24% year-over-year, indicating improved operational efficiency alongside revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1754573452969,
            "Source": "earnings"
        },
        {
            "Title": "Divgi TorqTransfer Aims to Boost Export Revenue Share",
            "Summary": "Divgi TorqTransfer has announced plans to increase its export share of business to 20% - 25% of the company's revenue over the next 4 to 5 years, according to an investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1748680687000,
            "Source": "default"
        },
        {
            "Title": "Divgi TorqTransfer Systems Declares Dividend",
            "Summary": "Divgi TorqTransfer Systems has announced a dividend of 2.6 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1748608786000,
            "Source": "result"
        },
        {
            "Title": "Divgi TorqTransfer Systems Reports Q4 Financial Results",
            "Summary": "Divgi TorqTransfer Systems has released its Q4 financial results. The company's EBITDA for Q4 was 86 million rupees, down from 132 million rupees in the same quarter last year. The EBITDA margin decreased to 14.78% from 20.21% year-over-year. Net profit for Q4 was 54 million rupees, compared to 92 million rupees in the previous year and 52 million rupees in the previous quarter. Q4 revenue stood at 582 million rupees, down from 651 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1748608751000,
            "Source": "result"
        },
        {
            "Title": "Divgi Torqtransfer Systems Reports Decline in Q3 Profit and Revenue",
            "Summary": "Divgi Torqtransfer Systems has reported its financial results for the third quarter. The company's net profit decreased to 52 million rupees from 94 million rupees in the same period last year. Revenue also declined to 5.25 billion rupees from 6.3 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739751563000,
            "Source": "earnings"
        }
    ]
}