{
    "Symbol": "DIVISLAB",
    "ISIN": "INE361B01024",
    "News": [
        {
            "Title": "Divi's Labs Board Meet on Feb 11 for Q3FY26 Results",
            "Summary": "Divi's Laboratories has scheduled a board meeting on February 11, 2026, to consider and approve Q3FY26 financial results. Trading window remains closed until February 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769749729636,
            "Source": "co_actions_results"
        },
        {
            "Title": "Divis Labs Dec Exports Surge 49% MoM to $117m",
            "Summary": "Divis Laboratories reported strong December export performance with $117 million in shipments, marking a significant 49% month-on-month growth and demonstrating robust international demand.",
            "Sentiment": "positive",
            "PublishDate": 1768289971792,
            "Source": "stocks"
        },
        {
            "Title": "Divi's Labs Sees ₹66.53 Cr NSE Block Trade",
            "Summary": "Divi's Laboratories witnessed a significant block trade on NSE worth ₹66.53 crores involving 103,549 shares at ₹6,424.50 per share, indicating substantial institutional activity in the pharmaceutical stock.",
            "Sentiment": "neutral",
            "PublishDate": 1768198308018,
            "Source": "co_actions_results"
        },
        {
            "Title": "Morgan Stanley Sets Overweight Rating on Divi's Labs",
            "Summary": "Morgan Stanley maintains overweight rating on Divi's Laboratories with price target of ₹7,541.00, reflecting positive outlook on the pharmaceutical company's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1766375326337,
            "Source": "stocks"
        },
        {
            "Title": "Divi's Labs Reports Strong Export Growth in December",
            "Summary": "Divi's Laboratories achieved remarkable 68% month-over-month and 17% year-over-year export growth in US dollar terms, demonstrating strong international market performance.",
            "Sentiment": "positive",
            "PublishDate": 1766118494892,
            "Source": "co_actions_results"
        },
        {
            "Title": "Divi's Labs Block Trade Worth ₹95.73 Crores on NSE",
            "Summary": "Divi's Laboratories executed a significant block trade on NSE involving 150,017 shares at ₹6,381.50 per share, totaling ₹95.73 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1766051501483,
            "Source": "co_actions_results"
        },
        {
            "Title": "Divi's Laboratories Passes US FDA Inspection Without Any Regulatory Observations",
            "Summary": "Divi's Laboratories successfully completed a US FDA inspection of its Unit-I facility from November 10 to November 14 with zero 483 observations, indicating full regulatory compliance. This clean inspection outcome eliminates potential regulatory concerns and supports the company's ability to continue manufacturing and exporting pharmaceutical products to the US market without disruption.",
            "Sentiment": "positive",
            "PublishDate": 1763337177071,
            "Source": "stock"
        },
        {
            "Title": "Divi's Laboratories Passes US-FDA Inspection With Zero Observations",
            "Summary": "Divi's Laboratories' Unit-I facility successfully completed a US-FDA inspection from November 10-14 with zero 483 observations, indicating no regulatory violations were found. This clean inspection outcome affects the pharmaceutical company's regulatory standing and manufacturing compliance status with US authorities.",
            "Sentiment": "positive",
            "PublishDate": 1763116731267,
            "Source": "stock"
        },
        {
            "Title": "Divis Laboratories Reports 17% Revenue Growth in Q2 FY2026, Custom Synthesis Business Drives Performance",
            "Summary": "Divis Laboratories achieved consolidated total income of ₹2,860 crores for Q2 FY2026, representing a 17% increase from ₹2,444 crores in the corresponding quarter of the previous year. The company reported profit before tax of ₹912 crores compared to ₹722 crores in Q2 FY2025, and profit after tax of ₹689 crores versus ₹510 crores. The product mix showed 44% generics and 56% custom synthesis for the quarter. Custom synthesis business continues to see high engagement levels with steady flow of RFPs and site visits from global innovators, with multiple projects advancing through development and validation stages. The generic business maintained consistent volumes despite ongoing pricing pressures, supported by the company's backward integration model. Exports accounted for 90% of total sales revenue, with Europe and United States contributing a combined 74%. The company recorded a forex gain of ₹63 crores for the quarter. On constant currency basis, revenue growth was 10.79%. The nutraceutical business contributed ₹242 crores during the quarter. For the half year ended September 30, 2025, consolidated total income rose to ₹5,389 crores, a 16% increase from ₹4,640 crores. The company has cash on books of ₹3,451 crores as of September 30, 2025. Divis is executing three major capex programs backed by long-term supply commitments and has inaugurated its peptide center of excellence where multiple customer projects are undergoing development.",
            "Sentiment": "positive",
            "PublishDate": 1762983938749,
            "Source": "earnings"
        },
        {
            "Title": "Divis Reports Sharp Export Decline with 59% Monthly and 38% Yearly Drop",
            "Summary": "Divis reported a significant decline in export performance, with dollar-denominated export values falling 59% on a monthly basis and 38% compared to the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762834055524,
            "Source": "stock"
        },
        {
            "Title": "Divi's Labs Beats Q2 Expectations with 4% Revenue Growth, Motilal Oswal Maintains Neutral Rating",
            "Summary": "Divi's Laboratories exceeded quarterly expectations with revenue growing 4%, while Ebitda and PAT both increased 10%. The company maintained steady gross margins for eight consecutive quarters and achieved improved Ebitda margins both year-over-year and quarter-over-quarter due to better operating leverage. Despite the strong performance, Motilal Oswal retained its 'Neutral' rating on the stock.",
            "Sentiment": "positive",
            "PublishDate": 1762738596890,
            "Source": "earnings"
        },
        {
            "Title": "Divi's Laboratories Reports Strong Q2 Results with 16% Revenue Growth",
            "Summary": "Divi's Laboratories reported quarterly revenue of 27.1 billion rupees, up from 23.3 billion rupees in the same period last year. The company's consolidated net profit reached 7 billion rupees compared to 5.1 billion rupees year-over-year, exceeding the estimated 6 billion rupees. EBITDA increased to 8.9 billion rupees from 7.2 billion rupees, surpassing the estimate of 8.1 billion rupees. The EBITDA margin improved to 32.7% from 30.6% in the previous year, also beating the estimated 32%.",
            "Sentiment": "positive",
            "PublishDate": 1762497697302,
            "Source": "earnings"
        },
        {
            "Title": "Divi's Lab Faces Potential Impact from Trump's Proposed 90% Price Cut on Weight Loss Drugs",
            "Summary": "Divi's Lab may face negative impact due to Trump's plans for a 90% price reduction on weight loss drugs. Trump has promised to lower Ozempic prices in the U.S., where the drug currently costs $1,300 compared to $130 in London.",
            "Sentiment": "negative",
            "PublishDate": 1760939831282,
            "Source": "stock"
        },
        {
            "Title": "Divi's Laboratories Sees Block Trade Worth Rs. 62.27 Crores on NSE",
            "Summary": "Divi's Laboratories executed a block trade on the National Stock Exchange involving approximately 103,332 shares at Rs. 6,026 per share, totaling Rs. 62.27 crores. The transaction represents a significant institutional trade in the pharmaceutical company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1757649354544,
            "Source": "order&deals"
        },
        {
            "Title": "Divi's Laboratories Sees Rs. 51.91 Crore Block Trade on NSE",
            "Summary": "Divi's Laboratories executed a block trade worth Rs. 51.91 crores on the National Stock Exchange. The transaction involved approximately 87,739 shares at a price of Rs. 5,916.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1757479291555,
            "Source": "order&deals"
        },
        {
            "Title": "Divi's Laboratories Sees Rs. 31.24 Crore Block Trade on NSE",
            "Summary": "Divi's Laboratories Ltd. recorded a block trade worth Rs. 31.24 crores on the NSE. The transaction involved approximately 52,119 shares at a price of Rs. 5,993.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1757303416165,
            "Source": "order&deals"
        },
        {
            "Title": "Divi's Laboratories General Manager Y.S. Koteswara Rao to Retire on September 5, 2025",
            "Summary": "Y.S. Koteswara Rao, General Manager (P&A) at Divi's Laboratories Limited, will retire and cease to be Senior Management Personnel effective September 5, 2025. The retirement will take effect from the close of business hours on that date. The company has notified stock exchanges NSE and BSE about this senior management change.",
            "Sentiment": "neutral",
            "PublishDate": 1757063293256,
            "Source": "corporate_governance"
        },
        {
            "Title": "Divi's Laboratories Reports 15% Revenue Growth in Q1 FY2026, Driven by Custom Synthesis Expansion",
            "Summary": "Divi's Laboratories achieved consolidated revenue of ₹2,529 crores in Q1 FY2026, up from ₹2,197 crores in the corresponding quarter of the previous year. Profit after tax increased to ₹545 crores from ₹430 crores year-over-year. The company maintained its product mix at 47% generics and 53% custom synthesis. Exports accounted for 88% of revenue, with Europe contributing 58% and the US 14%. The company's Unit 3 facility in Kakinada became operational in January 2025, focusing on key starting materials and intermediates to strengthen backward integration. Divi's is executing three major capex programs with long-term supply commitments and expects total capital expenditure of ₹2,000 crores for the financial year. The company has commissioned Solid Phase Peptide Synthesis capacity, attracting interest from pharmaceutical companies developing GLP-1 treatments. Generic business continues to face pricing pressures due to geopolitical situations and cost-cutting by insurance companies. The nutraceutical business grew to ₹250 crores from ₹178 crores in the previous year's quarter. Management indicated that several custom synthesis projects are progressing through R&D, pilot, and validation stages, with commercial scale expected within 12-24 months.",
            "Sentiment": "positive",
            "PublishDate": 1754971269245,
            "Source": "earnings"
        },
        {
            "Title": "Divi's Laboratories Reports Mixed Quarterly Results as Profit and Margins Fall Short of Estimates",
            "Summary": "Divi's Laboratories reported quarterly revenue of ₹2,410 crore, marking 14% year-on-year growth but missing the estimate of ₹2,437 crore. Net profit increased 27% to ₹545 crore, below the expected ₹573.25 crore. Operating profit (EBITDA) rose 16.3% to ₹756 crore, falling short of the ₹794.8 crore estimate. EBITDA margin improved to 31.4% from 30.7% previously, but remained below the projected 32.6%. Key focus areas include MSN's patent litigation win for cardiac drug Entresto, progress on long-term supply agreements, and GLP-1 space opportunities. The stock declined 3.3% to ₹6,208.50 and has dropped 10% over the past month.",
            "Sentiment": "negative",
            "PublishDate": 1754462727940,
            "Source": "earnings"
        },
        {
            "Title": "Divi's Laboratories Reports Higher Q1 EBITDA and Margin Growth",
            "Summary": "Divi's Laboratories reported Q1 EBITDA of 7.29 billion rupees compared to 6.2 billion rupees in the same period last year. The company's EBITDA margin improved to 30.25% from 29.37% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754461686219,
            "Source": "earnings"
        },
        {
            "Title": "Divi's Laboratories: Entresto Patent Litigation Outcome Threatens Earnings",
            "Summary": "MSN won patent litigation for Novartis' cardiac drug Entresto, allowing generic launch in US after July 15, 2025. This development could potentially reduce Divi's Laboratories' annual EBITDA by 12-13% over the next year. Entresto API contributes significantly to Divi's Custom Synthesis revenue and overall topline.",
            "Sentiment": "negative",
            "PublishDate": 1752459361000,
            "Source": "normal_news"
        },
        {
            "Title": "Divi's Laboratories Reports Significant Export Growth in June and Q1",
            "Summary": "Divi's Laboratories has reported a substantial increase in exports for June and the first quarter. In June, the company's exports reached USD 98.5 million, marking a 38% year-over-year increase. For the first quarter, exports totaled USD 238 million, representing a 12% growth compared to the same period last year. These figures indicate a positive trend in the company's export performance.",
            "Sentiment": "positive",
            "PublishDate": 1752120194000,
            "Source": "default"
        },
        {
            "Title": "Divi's Laboratories: Shares Rise as Novartis-MSN Settle Entresto Patent Dispute",
            "Summary": "Divi's Laboratories shares gained 1.7% following news of Novartis and MSN settling a patent dispute for heart failure drug Entresto. Divi's is expected to be a key API supplier for Entresto. The settlement's terms are unknown, but it could impact Divi's future earnings from Entresto API, estimated at ₹1,200 crore in FY25.",
            "Sentiment": "positive",
            "PublishDate": 1750233290000,
            "Source": "normal_news"
        },
        {
            "Title": "Divi's Labs Signs Major Supply Agreement with Global Pharma Company",
            "Summary": "Divi's Laboratories has entered into a long-term manufacturing and supply agreement with a global pharmaceutical company. The agreement is for the international supply of advanced intermediates and is valued at ₹650-750 crore.",
            "Sentiment": "positive",
            "PublishDate": 1748079242000,
            "Source": "default"
        },
        {
            "Title": "Divi's Laboratories: Q4 Performance Boosts Stock and Growth Outlook",
            "Summary": "Divi's Laboratories shares rose up to 4% after strong Q4 results. The company beat consensus estimates on revenue, EBITDA, and profit. Commercial operations began at Unit III, improving margins and capacity. Divi's aims for double-digit growth in FY26, with new opportunities in GLP-1s and peptides. Brokerages have mixed views, with price targets ranging from ₹5,800 to ₹7,225.",
            "Sentiment": "positive",
            "PublishDate": 1747627762000,
            "Source": "earnings"
        },
        {
            "Title": "Divi's Labs Expects Double-Digit Growth in Coming Years",
            "Summary": "Divi's Labs has shared its guidance during a conference call. The company adopts a conservative approach to projecting numbers and revenues, focusing on delivering promised results rather than being overly competitive or proactive in sharing growth projections. Despite this conservative stance, Divi's Labs expects double-digit growth and aims to maintain this pace consistently for the next few years.",
            "Sentiment": "positive",
            "PublishDate": 1747625963000,
            "Source": "default"
        },
        {
            "Title": "Divis Laboratories Reports Q4 Financial Results",
            "Summary": "Divis Laboratories has reported its Q4 financial results. The company's EBITDA increased to 8.86 billion rupees from 7.31 billion rupees year-over-year. The EBITDA margin improved to 34.27% from 31.74% in the same period. Consolidated net profit rose to 6.62 billion rupees from 5.38 billion rupees year-over-year. Revenue for Q4 increased to 25.85 billion rupees from 23.03 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747475609000,
            "Source": "result"
        },
        {
            "Title": "Divi's Laboratories Block Trade on NSE",
            "Summary": "A block trade of approximately 100,045 shares of Divi's Laboratories Ltd. was executed on the National Stock Exchange (NSE) for Rs. 60.77 crores. The trade was conducted at a price of Rs. 6074.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1746168878000,
            "Source": "block_details"
        },
        {
            "Title": "Divi's Laboratories Block Trade on NSE",
            "Summary": "A block trade of approximately 144,937 shares of Divi's Laboratories Ltd. was executed on the National Stock Exchange (NSE) at Rs. 6114.00 per share, totaling Rs. 88.61 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1746161973000,
            "Source": "block_details"
        },
        {
            "Title": "Divi's Laboratories Signs Long-term Manufacturing Agreement and Plans Expansion",
            "Summary": "Divi's Laboratories has entered into a long-term international manufacturing and supply agreement with a global pharmaceutical company for advanced intermediates. The company is also planning a capacity expansion project worth Rs 650-700 crore, which will be funded internally.",
            "Sentiment": "positive",
            "PublishDate": 1745194824000,
            "Source": "default"
        },
        {
            "Title": "Divi's Laboratories Signs Long-Term Manufacturing Agreement and Plans Expansion",
            "Summary": "Divi's Laboratories has entered into a long-term international manufacturing and supply agreement with a global pharmaceutical company for advanced intermediates. The company is also planning a capacity expansion project worth Rs 650-700 crore, which will be funded internally.",
            "Sentiment": "positive",
            "PublishDate": 1745057750000,
            "Source": "default"
        },
        {
            "Title": "Divi's Laboratories: Inks Long-Term Supply Agreement with Global Pharma Firm",
            "Summary": "Divi's Laboratories has signed a long-term supply agreement with an unnamed global pharmaceutical company to manufacture and supply advanced intermediates. The company expects significant revenue from this deal and plans to invest Rs 650-700 crore in capacity expansion, funded from internal accruals.",
            "Sentiment": "positive",
            "PublishDate": 1744962128000,
            "Source": "order&deals"
        },
        {
            "Title": "Divis Laboratories Reports Significant Increase in Exports",
            "Summary": "Divis Laboratories, an Indian CDMO (Contract Development and Manufacturing Organization) in the pharmaceutical sector, has reported a substantial increase in exports. The company's exports reached $85 million, marking a 22% year-over-year growth. Additionally, the fourth quarter exports also showed a significant jump of 23%.",
            "Sentiment": "positive",
            "PublishDate": 1744354123000,
            "Source": "earnings"
        },
        {
            "Title": "Divi's Laboratories Block Trade on NSE",
            "Summary": "A significant block trade of Divi's Laboratories Ltd. shares occurred on the National Stock Exchange (NSE). Approximately 203,922 shares were traded at a price of Rs. 5790.00 per share, totaling Rs. 118.07 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1740114313000,
            "Source": "block_deals"
        },
        {
            "Title": "Divi's Laboratories: Analyst Predicts 30% Downside Despite Strong Q3 Results",
            "Summary": "Elara Securities maintains a 'sell' rating on Divi's Laboratories with a price target of ₹4,098, implying a 30% downside. Despite Q3 revenue growth of 25% and profit increase of 65%, Elara cites concerns over valuation and future growth prospects. The firm expects growth rates to normalize and sees limited margin expansion potential. Conversely, Citi remains bullish, rating Divi's as a top pick with a ₹6,850 target.",
            "Sentiment": "negative",
            "PublishDate": 1738654766000,
            "Source": "earnings"
        },
        {
            "Title": "Divi's Labs Developing New Gadolinium Compounds",
            "Summary": "Divi's Laboratories is collaborating with innovators to develop new gadolinium compounds. These compounds are currently at various stages of development, as revealed during a company conference call.",
            "Sentiment": "positive",
            "PublishDate": 1738639676000,
            "Source": "corporate_action"
        },
        {
            "Title": "Divi's Labs Expects Growth from Generic Portfolio Expansion",
            "Summary": "Divi's Laboratories is anticipating significant growth driven by additions to its generic drug portfolio. The company is strategically positioning itself to capitalize on upcoming patent expirations in the pharmaceutical industry. This expansion of their generic offerings is expected to be a key factor in the company's future revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1738639460000,
            "Source": "corporate_action"
        },
        {
            "Title": "Divi's Laboratories Targets Double-Digit Growth and Expansion",
            "Summary": "Divi's Laboratories aims for double-digit year-over-year growth, focusing on maintaining stable double-digit growth. The company anticipates seeing results from the completion of Kakinada Phase 1 within the next six months, which is expected to positively impact nutraceutical volumes and production capacity.",
            "Sentiment": "positive",
            "PublishDate": 1738639390000,
            "Source": "corporate_action"
        },
        {
            "Title": "Divi's Laboratories Reports Strong Q3 Financial Performance",
            "Summary": "Divi's Laboratories has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 7.43 billion rupees from 5 billion rupees in the previous year, surpassing the estimated 6.99 billion rupees. Additionally, the EBITDA margin improved to 32.04% from 26.90% year-over-year, exceeding the estimated 31%.",
            "Sentiment": "positive",
            "PublishDate": 1738567940000,
            "Source": "earnings"
        },
        {
            "Title": "Divi's Laboratories Reports Strong Q3 Financial Results",
            "Summary": "Divi's Laboratories has announced its Q3 consolidated financial results. The company's net profit increased to 5.89 billion rupees, up from 3.58 billion rupees in the same quarter last year, surpassing the estimated 5.07 billion rupees. Revenue also saw growth, reaching 23 billion rupees compared to 18.6 billion rupees year-over-year, slightly above the estimated 22.87 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738567892000,
            "Source": "earnings"
        },
        {
            "Title": "Divi's Laboratories: Share Price Declines 1.83% in Tuesday Trading",
            "Summary": "Divi's Laboratories shares fell 1.83% to Rs 5886.75 during Tuesday's trading session. The company's market cap stood at Rs 156274.72 crore. For Q2 FY25, Divi's Labs reported a 22.51% YoY increase in sales to Rs 2444 crore and a 46.55% YoY growth in net profit to Rs 510 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1737442981000,
            "Source": "normal_news"
        },
        {
            "Title": "Divi's Laboratories: Shares Rise 0.97% Amid Sensex Gains",
            "Summary": "Divi's Laboratories shares traded at Rs 5971.35, up 0.97% from the previous session, as the Sensex rose 548.87 points. The stock's trading volume was 1981 shares with a turnover of Rs 1.17 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1737358632000,
            "Source": "normal_news"
        },
        {
            "Title": "Divi's Laboratories: Stock Fluctuates Amid Market Volatility",
            "Summary": "Divi's Laboratories shares traded at Rs 5896.75 on BSE, down 0.4% from the previous close. The stock saw a gap down opening and has a market value of Rs 156533.55 crore. Trading volume was 1,894 lakh shares as of 01:23PM IST.",
            "Sentiment": "neutral",
            "PublishDate": 1737100429000,
            "Source": "normal_news"
        },
        {
            "Title": "Divi's Laboratories: Shares Edge Up 0.3% Amid Nifty Gains",
            "Summary": "Divi's Laboratories shares rose 0.3% in intraday trading, with the stock touching a high of Rs 5950.00 and a low of Rs 5760.00. The company reported Q2 FY2025 consolidated sales of Rs 2444.00 crore, up 11.24% QoQ and 22.51% YoY. Net profit for the quarter stood at Rs 510.0 crore, a 46.55% increase YoY.",
            "Sentiment": "positive",
            "PublishDate": 1737014298000,
            "Source": "normal_news"
        },
        {
            "Title": "Divi's Laboratories: Stock Rises 1.75% Amid Market Fluctuations",
            "Summary": "Divi's Laboratories stock traded up 1.75% at Rs 5892.30 on Wednesday. The company reported consolidated sales of Rs 2444.0000 crore for Q2 FY2025, up 11.24% QoQ and 22.51% YoY. Net profit stood at Rs 510.0 crore. Promoters held 51.89% stake as of September 30, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1736930071000,
            "Source": "normal_news"
        },
        {
            "Title": "Divi's Laboratories: Shares Rise 2.26% Amid Positive Market Sentiment",
            "Summary": "Divi's Laboratories shares traded 2.26% higher, reaching an intraday high of Rs 5862.75. The stock opened at Rs 5731.70. The broader market also showed strength with Nifty50 up 122.4 points and BSE Sensex up 355.15 points.",
            "Sentiment": "positive",
            "PublishDate": 1736835102000,
            "Source": "normal_news"
        },
        {
            "Title": "Divi's Laboratories: Shares Rise 0.42% Amid Nifty Gains",
            "Summary": "Divi's Laboratories shares increased 0.42% to Rs 5798.00 in Friday's trade. The stock hit an intraday high of Rs 5840.45 and low of Rs 5719.00. It has seen a -5.42% change in the past month. The company reported consolidated sales of Rs 2444.0000 crore for Q2 FY2025, up 11.24% QoQ and 22.51% YoY. Net profit stood at Rs 510.0 crore, up 46.55% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1736488158000,
            "Source": "normal_news"
        },
        {
            "Title": "Divi's Laboratories: Stock Rises Marginally Amid Market Decline",
            "Summary": "Divi's Laboratories stock increased 0.39% to Rs 5839.75 despite overall market decline. The stock saw limited trading volume of 458 shares with a traded value of Rs 0.27 crore. The company reported Q2 FY25 consolidated sales of Rs 2444 crore, up 22.51% YoY, with net profit at Rs 510 crore, up 46.55% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1736409228000,
            "Source": "normal_news"
        },
        {
            "Title": "Divi's Laboratories: Share Price Dips Amid Broader Market Decline",
            "Summary": "Divi's Laboratories Ltd. stock fell 0.61% to Rs 5860.75 during Wednesday's trade as the Sensex dropped 496.64 points. The stock experienced a trading volume of Rs 0.55 crore on BSE. The company reported consolidated sales of Rs 2444 crore for Q2 FY2025, up 11.24% QoQ and 22.51% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1736317608000,
            "Source": "normal_news"
        },
        {
            "Title": "Divi's Laboratories: Stock Drops 2.5% in Monday Trading",
            "Summary": "Divi's Laboratories shares fell 2.5% to Rs 5894.45 during Monday's trading session. The company reported a market cap of Rs 156495.06 crore on the BSE. For Q2 FY2025, Divi's Labs reported consolidated sales of Rs 2444 crore, up 22.51% YoY, and net profit of Rs 510 crore, up 46.55% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1736150628000,
            "Source": "normal_news"
        }
    ]
}