{
    "Symbol": "DIXON",
    "ISIN": "INE935N01020",
    "News": [
        {
            "Title": "Dixon Technologies Appoints Josh Foulger as President",
            "Summary": "Dixon Technologies announces appointment of Josh Foulger as President- IT Hardware and New Projects in subsidiary Padget Electronics Private Limited, effective February 16th, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770621990547,
            "Source": "stocks"
        },
        {
            "Title": "Dixon Technologies Receives ESG Score of 76 from S&P Global",
            "Summary": "Dixon Technologies (India) Limited has been assigned an ESG Score of 76 out of 100 by S&P Global under the Corporate Sustainability Assessment for 2025, as part of the Dow Jones Sustainability Indices evaluation process.",
            "Sentiment": "positive",
            "PublishDate": 1770204330323,
            "Source": "stocks"
        },
        {
            "Title": "Dixon Faces Mobile Volume Projection Concerns",
            "Summary": "Morgan Stanley warns Dixon Technologies may face reduced mobile volume projections due to rising DRAM prices and potential regulatory approval delays affecting business operations.",
            "Sentiment": "negative",
            "PublishDate": 1770005568138,
            "Source": "stocks"
        },
        {
            "Title": "Dixon Tech PLI Allocation Cut to Rs 1,527 Cr",
            "Summary": "Dixon Technologies faces significant reduction in PLI scheme allocation for mobile and IT hardware manufacturing, dropping from Rs 9,000 crore to Rs 1,527 crore.",
            "Sentiment": "negative",
            "PublishDate": 1769930446785,
            "Source": "stocks"
        },
        {
            "Title": "Dixon Tech Plans ₹1,100-1,200 Cr Capex for FY26",
            "Summary": "Dixon Technologies projects capital expenditure between ₹1,100-1,200 crores for FY26, targeting display business, Q Tech camera modules, SFP optical transducers, and mechanical enclosures expansion.",
            "Sentiment": "positive",
            "PublishDate": 1769749878753,
            "Source": "stocks"
        },
        {
            "Title": "Dixon Tech Targets INR 2,000 Cr Camera Module Run Rate",
            "Summary": "Dixon Technologies projects INR 2,000 crores run rate for Q Tech camera modules with production scaling from 40 million to 180-190 million units. IT hardware revenue expected at INR 1,500 crores this fiscal.",
            "Sentiment": "positive",
            "PublishDate": 1769744761263,
            "Source": "stocks"
        },
        {
            "Title": "Dixon Tech Projects 7-7.5M Smartphone Units in Q4 FY26",
            "Summary": "Dixon Technologies forecasts smartphone sales of 7-7.5 million units in Q4 FY26, with mobile phone margins expected at 2.8-3.2% without PLI extension. FY27 projections under review pending Vivo JV approval.",
            "Sentiment": "neutral",
            "PublishDate": 1769744734556,
            "Source": "stocks"
        },
        {
            "Title": "Dixon Technologies Q3 Net Profit Surges 68.82%",
            "Summary": "Dixon Technologies reported consolidated net profit of ₹2.87 billion in Q3, marking a significant 68.82% year-on-year growth from ₹1.70 billion, surpassing analyst estimates of ₹1.90 billion.",
            "Sentiment": "positive",
            "PublishDate": 1769685191803,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dixon Technologies Board Meet on Jan 29 for Q3 Results",
            "Summary": "Dixon Technologies has scheduled its board meeting for January 29, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769102408442,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dixon May Benefit from Budget Boost to Mobile Component Scheme",
            "Summary": "Government reportedly planning significant enhancement to mobile electronics component manufacturing scheme in upcoming budget, potentially benefiting Dixon Technologies and other manufacturers in the sector.",
            "Sentiment": "positive",
            "PublishDate": 1769068677759,
            "Source": "stocks"
        },
        {
            "Title": "Investec Maintains Buy on Dixon Tech, Cuts Target",
            "Summary": "Investec maintains its Buy rating on Dixon Technologies while reducing the target price to ₹15,000. The brokerage continues to show confidence in the electronics manufacturing company despite the price adjustment.",
            "Sentiment": "neutral",
            "PublishDate": 1768880261975,
            "Source": "stocks"
        },
        {
            "Title": "EMS stocks crash up to 53% amid multiple headwinds",
            "Summary": "Leading EMS players Dixon Technologies, Kaynes Technology and PG Electroplast have corrected sharply from peaks due to memory chip price surge, regulatory concerns and valuation fatigue.",
            "Sentiment": "negative",
            "PublishDate": 1768797812461,
            "Source": "stocks"
        },
        {
            "Title": "Dixon Technologies faces headwinds from chip prices",
            "Summary": "Dixon Technologies stock hits 52-week low amid rising memory chip costs, regulatory delays, and PLI scheme concerns affecting India's largest Android handset maker.",
            "Sentiment": "negative",
            "PublishDate": 1768441298934,
            "Source": "stocks"
        },
        {
            "Title": "Dixon Technologies Falls 35% on Motorola Volume Drop",
            "Summary": "Dixon Technologies shares declined 35% in three months as key client Motorola's volumes dropped 20% YoY in Q3, with increased outsourcing to Karbonn affecting Dixon's revenue prospects.",
            "Sentiment": "negative",
            "PublishDate": 1768363409306,
            "Source": "stocks"
        },
        {
            "Title": "Dixon Tech shares hit 18-month low, down 40% from peak",
            "Summary": "Dixon Technologies shares fell over 5% to ₹11,254.00, marking an 18-month low as market cap drops below ₹70,000 crore. HSBC cuts target price citing memory price surge and mobile PLI concerns.",
            "Sentiment": "negative",
            "PublishDate": 1768292032119,
            "Source": "stocks"
        },
        {
            "Title": "Dixon Technologies Block Trade Worth ₹46.82 Crores",
            "Summary": "Dixon Technologies witnessed a significant NSE block trade of ₹46.82 crores involving 40,253 shares at ₹11,632 per share, indicating substantial institutional activity in the electronics manufacturing stock.",
            "Sentiment": "neutral",
            "PublishDate": 1768278988960,
            "Source": "co_actions_results"
        },
        {
            "Title": "HSBC Cuts Dixon Tech Target Price to ₹15,500",
            "Summary": "HSBC maintains Buy rating on Dixon Technologies but reduces target price from ₹19,600 to ₹15,500, reflecting revised valuation expectations for the electronics manufacturer.",
            "Sentiment": "neutral",
            "PublishDate": 1768189537491,
            "Source": "stocks"
        },
        {
            "Title": "Dixon Technologies schedules investor meetings Jan 9-14",
            "Summary": "Dixon Technologies has scheduled institutional investor meetings from January 9-14, 2026, with Aditya Birla Sun Life AMC, UTI Pension, and 360 One Wealth through virtual and in-person formats.",
            "Sentiment": "neutral",
            "PublishDate": 1767871658604,
            "Source": "stocks"
        },
        {
            "Title": "Dixon Technologies Block Trade Worth ₹46.70 Crores",
            "Summary": "Dixon Technologies (India) Ltd. witnessed a significant block trade on NSE worth ₹46.70 crores involving 39,509 shares at ₹11,820.00 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767850106254,
            "Source": "co_actions_results"
        },
        {
            "Title": "Goldman Sachs Cuts Dixon Revenue Estimates by 6-8%",
            "Summary": "Goldman Sachs reduces Dixon Technologies revenue forecasts due to weaker mobile phone volumes and potential market share losses, predicting the company will miss FY26 mobile production guidance.",
            "Sentiment": "negative",
            "PublishDate": 1767760986386,
            "Source": "stocks"
        },
        {
            "Title": "Dixon Technologies: ₹68.80 Cr NSE Block Trade",
            "Summary": "Dixon Technologies executed a major NSE block trade worth ₹68.80 crores involving 57,796 shares at ₹11,904.00 per share, showing increased institutional activity.",
            "Sentiment": "positive",
            "PublishDate": 1767694097909,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dixon Technologies Gets ESG Score of 63.7 from SES",
            "Summary": "Dixon Technologies receives an Environmental, Social and Governance score of 63.7 from SES ESG Research based on FY 2024-25 data, disclosed under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1767376664798,
            "Source": "stocks"
        },
        {
            "Title": "Dixon Technologies Sees ₹114.94 Cr NSE Block Trade",
            "Summary": "Dixon Technologies (India) Ltd. recorded a massive block trade on NSE worth ₹114.94 crores involving approximately 94,525 shares at ₹12,160.00 per share, indicating strong institutional activity.",
            "Sentiment": "positive",
            "PublishDate": 1767345930753,
            "Source": "co_actions_results"
        },
        {
            "Title": "India Approves $4.6B Electronics Component Investment",
            "Summary": "Government clears 22 electronics component projects worth ₹41,863 crore from Samsung, Tata Electronics, Dixon Technologies, and Foxconn, targeting ₹2.58 lakh crore output and 37,000 jobs.",
            "Sentiment": "positive",
            "PublishDate": 1767337663088,
            "Source": "stocks"
        },
        {
            "Title": "Dixon Technologies Block Trade Worth ₹16.87 Crores",
            "Summary": "Dixon Technologies (India) Ltd. witnessed a significant NSE block trade worth ₹16.87 crores involving approximately 14,116 shares at ₹11,951.00 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767165110310,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dixon Technologies Exports Surge 43% MoM in November",
            "Summary": "Dixon Technologies reported a significant 43% month-over-month increase in exports during November 2025, while successfully recovering market share from Xiaomi after experiencing five consecutive months of decline.",
            "Sentiment": "positive",
            "PublishDate": 1767153816999,
            "Source": "stocks"
        },
        {
            "Title": "Dixon Technologies Sees ₹22.14 Cr NSE Block Trade",
            "Summary": "Dixon Technologies (India) Ltd. recorded a significant NSE block trade worth ₹22.14 crores involving 18,814 shares at ₹11,767.00 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767069463226,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dixon Technologies Shares Hit 4-Month Low",
            "Summary": "Dixon Technologies shares fell 4% on Monday, marking sixth consecutive day of losses and hitting lowest levels since August 2024, now down 37% from 52-week high.",
            "Sentiment": "negative",
            "PublishDate": 1767052023759,
            "Source": "stocks"
        },
        {
            "Title": "India Smartphone Market Slowdown Expected",
            "Summary": "India's smartphone market anticipated to face slowdown next year due to ongoing global memory chip shortage driving component price increases, according to Dixon Technologies.",
            "Sentiment": "negative",
            "PublishDate": 1766552758622,
            "Source": "stocks"
        },
        {
            "Title": "Dixon Technologies Shareholders Approve Key Resolutions",
            "Summary": "Dixon Technologies shareholders approved four special resolutions via postal ballot, including increased managerial remuneration for top executives and key appointments with strong majority support.",
            "Sentiment": "positive",
            "PublishDate": 1766490007507,
            "Source": "co_actions_results"
        },
        {
            "Title": "Morgan Stanley Sets Dixon Technologies Target at ₹11,563",
            "Summary": "Morgan Stanley maintains underweight rating on Dixon Technologies with a target price of ₹11,563, reflecting the brokerage's cautious stance on the consumer durables manufacturer.",
            "Sentiment": "neutral",
            "PublishDate": 1766375162418,
            "Source": "stocks"
        },
        {
            "Title": "Dixon Technologies Sees ₹195.58 Cr NSE Block Trade",
            "Summary": "Dixon Technologies witnessed a significant block trade worth ₹195.58 crores on NSE, involving approximately 150,484 shares at ₹12,997 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1765376807636,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dixon Technologies Sees Rs. 195.58 Crore Block Trade on NSE",
            "Summary": "Dixon Technologies (India) Ltd. witnessed a significant block trade worth Rs. 195.58 crores involving approximately 150,484 shares at Rs. 12,997.00 per share on the NSE. The large-scale transaction indicates substantial institutional or bulk investor activity in the electronics manufacturing company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1765355343812,
            "Source": "order&deals"
        },
        {
            "Title": "Dixon Technologies Allots 46,960 Equity Shares Under Employee Stock Option Plans",
            "Summary": "Dixon Technologies allotted 46,960 equity shares of Rs. 2 each following exercise of stock options under its 2020 and 2023 employee stock option plans. The company's paid-up share capital increased from Rs. 12,12,77,566 to Rs. 12,13,71,486 following the allotment approved by the Share Allotment Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1765274034526,
            "Source": "corporate_action"
        },
        {
            "Title": "Dixon Tech Expects Vivo Joint Venture Approvals by December 2025",
            "Summary": "Dixon Tech anticipates receiving approvals for its joint venture with Vivo by December 2025. The company expects no significant effects from the formation of this new joint venture entity.",
            "Sentiment": "neutral",
            "PublishDate": 1764827660002,
            "Source": "stock"
        },
        {
            "Title": "SFIO To File Charges Against Vivo, Oppo, Xiaomi For Fund Diversion Over ₹2,000 Crore",
            "Summary": "The Serious Fraud Investigation Office (SFIO) plans to file charges against smartphone companies Vivo, Oppo, and Xiaomi for alleged fund diversion exceeding ₹2,000 crore. The charges are expected to be filed this month, affecting these major smartphone manufacturers operating in the Indian market.",
            "Sentiment": "negative",
            "PublishDate": 1764745797317,
            "Source": "stock"
        },
        {
            "Title": "Dixon Technologies Receives Reaffirmed Credit Ratings from ICRA",
            "Summary": "ICRA Limited reaffirmed Dixon Technologies' credit ratings including ICRA A1+ for short-term fund-based working capital facilities, ICRA A1+ for short-term non-fund based working capital facilities, and ICRA AA (Stable)/ICRA A1+ for long-term/short-term unallocated facilities. The reaffirmation maintains the company's existing credit profile across its various financing instruments.",
            "Sentiment": "positive",
            "PublishDate": 1764250226797,
            "Source": "corporate_action"
        },
        {
            "Title": "Top 5G Phone Makers Consider Reducing Budget Segment Presence Due to Rising Component Costs",
            "Summary": "Leading 5G smartphone manufacturers are looking to reduce their presence or completely exit the budget phone segment as increasing component costs are significantly impacting profit margins. This strategic shift affects the competitive landscape in the affordable smartphone market and could influence pricing and availability for budget-conscious consumers.",
            "Sentiment": "negative",
            "PublishDate": 1764042227857,
            "Source": "sectoral"
        },
        {
            "Title": "Dixon Technologies Seeks Shareholder Approval for Executive Pay Hikes and Key Appointments",
            "Summary": "Dixon Technologies is conducting a postal ballot to approve increased managerial remuneration for Executive Chairman Sunil Vachani and Vice Chairman Atul Lall, both up to INR 15 crores annually, exceeding statutory limits. The company also seeks approval for appointing Saurabh Gupta as Director-Finance for 5 years with remuneration up to INR 10 crores annually and re-appointing Dr. Rakesh Mohan as Independent Director for another 5-year term.",
            "Sentiment": "neutral",
            "PublishDate": 1763745683719,
            "Source": "corporate_action"
        },
        {
            "Title": "Dixon Technologies Allots 1.25 Lakh Equity Shares Under Employee Stock Option Plans",
            "Summary": "Dixon Technologies' Share Allotment Committee allotted 1,25,120 equity shares of Rs. 2 each under its Employee Stock Option Plans from 2020 and 2023. The company's paid-up share capital increased from Rs. 12,10,27,326 to Rs. 12,12,77,566 following the stock option exercises by employees.",
            "Sentiment": "neutral",
            "PublishDate": 1763470303718,
            "Source": "corporate_action"
        },
        {
            "Title": "India Plans to Scale Laptop Production to 30% of Global Output",
            "Summary": "Ashwini Vaishnaw announced plans to increase India's laptop production capacity to 30% of global production, signaling a major expansion in the country's electronics manufacturing sector. This initiative affects companies like Dixon Tech and represents India's push toward becoming a significant player in global laptop manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1763363538001,
            "Source": "stock"
        },
        {
            "Title": "India's Smartphone Exports Hit Record $2.4 Billion in October",
            "Summary": "India achieved record smartphone exports of $2.4 billion in October. The cumulative smartphone exports for the first seven months reached $16 billion. Dixon Tech is mentioned in connection with these export figures.",
            "Sentiment": "positive",
            "PublishDate": 1762928938346,
            "Source": "stock"
        },
        {
            "Title": "Dixon Reports 6% Monthly Decline in Export Performance",
            "Summary": "Dixon experienced a 6% decrease in exports on a month-over-month basis. The decline represents a contraction in the company's international sales performance compared to the previous month.",
            "Sentiment": "negative",
            "PublishDate": 1762838677283,
            "Source": "stock"
        },
        {
            "Title": "Dixon Technologies Reports 29% Revenue Growth to ₹14,858 Crores in Q2 FY26",
            "Summary": "Dixon Technologies reported consolidated adjusted revenues of ₹14,858 crores for Q2 FY26, up 29% from ₹11,528 crores in the same period last year. Consolidated adjusted EBITDA grew 34% to ₹564 crores, while PAT increased 27% to ₹323 crores. The company faced timing distortions due to GST rate reductions in mid-August, which led to deferred purchases in TVs, refrigerators, and washing machines until September 22. Mobile and EMS revenue reached ₹13,361 crores with 41% growth, while telecom segment saw 148% growth to ₹1,635 crores. The company maintains negative 6 days working capital cycle and reported return on capital employed of 49.1% and return on equity of 34.3%. Dixon acquired 51% stake in Q Tech India for camera and fingerprint modules manufacturing and received PN3 approval for joint venture with Longcheer. The company expects mobile phone volumes of 55-60 million units for next fiscal year and targets IT hardware business of ₹4,000-5,000 crores in next two years.",
            "Sentiment": "positive",
            "PublishDate": 1761284011540,
            "Source": "earnings"
        },
        {
            "Title": "Dixon Tech Reduces Smartphone Volume Forecast for FY26/27",
            "Summary": "Dixon Tech has revised its smartphone volume forecast for FY26/27 downward to 40-42 million units from its previous estimate of 40-45 million units. The company lowered the upper end of its projection by 3 million units.",
            "Sentiment": "negative",
            "PublishDate": 1760933066137,
            "Source": "stock"
        },
        {
            "Title": "Dixon Tech Targets ₹1 Lakh Crore Sales in 3-4 Years with Margin Expansion Plans",
            "Summary": "Dixon Tech management expressed confidence about achieving ₹1 lakh crore in sales within 3-4 years. The company expects margins to improve by 70-80 basis points to approximately 4-4.5% through backward integration and operating leverage. For specific product segments, Dixon Tech anticipates higher double-digit margins for display modules and below 10% EBITDA margins for camera modules through QTech India.",
            "Sentiment": "positive",
            "PublishDate": 1760929941654,
            "Source": "stock"
        },
        {
            "Title": "Dixon Technologies Reports Strong Q2 Results with Net Profit Surging 72% to 6.7 Billion Rupees",
            "Summary": "Dixon Technologies (India) delivered robust Q2 performance with consolidated net profit reaching 6.7 billion rupees, up from 3.9 billion rupees year-over-year, significantly exceeding analyst estimates of 2.62 billion rupees. Revenue grew to 148.55 billion rupees from 115.3 billion rupees, surpassing estimates of 145.35 billion rupees. EBITDA increased to 5.61 billion rupees from 4.3 billion rupees, beating expectations of 5.53 billion rupees. EBITDA margin improved slightly to 3.78% from 3.7% year-over-year, though marginally below the estimated 3.8%.",
            "Sentiment": "positive",
            "PublishDate": 1760919231978,
            "Source": "earnings"
        },
        {
            "Title": "Dixon Technologies Completes Joint Venture with Inventec Corporation for IT Hardware Manufacturing",
            "Summary": "Dixon Technologies (India) Limited has completed the closing formalities of its joint venture with Inventec Corporation. DTIL now holds 60% and Inventec holds 40% of the JV Company, Dixon IT Devices Private Limited, following investments of INR 20.51 crore and INR 13.68 crore respectively. The joint venture will manufacture Notebook PC Products, Servers, Desktop PC Products including Components in India. Dixon acquired 2.05 crore equity shares while Inventec acquired 1.37 crore equity shares of INR 10 each. The target company has authorized share capital of INR 200 crores and paid-up share capital of INR 34.20 crore, with nil turnover for FY 2024-25. Inventec Corporation, founded in 1975, is one of the world's top 5 PC ODMs. The partnership aims to expand Dixon's portfolio into high growth segments while leveraging Inventec's engineering and supply chain capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1760770120120,
            "Source": "order&deals"
        },
        {
            "Title": "Dixon Technologies Appoints Saurabh Gupta as Director-Finance for 5-Year Term",
            "Summary": "Dixon Technologies (India) Limited appointed Mr. Saurabh Gupta as an Additional Director in the capacity of Director-Finance for a period of 5 years, subject to shareholder approval. The appointment was approved by the Board of Directors on October 17th, 2025, based on the recommendation of the Nomination & Remuneration Committee. Mr. Gupta brings over 22 years of experience in finance and strategy across manufacturing, cinema, real estate, and consulting sectors. He holds Chartered Accountant and Company Secretary credentials, an MBA from MDI Gurgaon, and an Advanced Management Program certification from Harvard Business School. His expertise includes capital raising, risk and treasury management, investor relations, strategy, mergers and acquisitions, and corporate governance. He has previously worked at PVR Ltd., Unitech, and McKinsey & Company, and has received multiple professional honors including Best CFO awards from various institutions.",
            "Sentiment": "positive",
            "PublishDate": 1760699384631,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dixon Technologies Reports Strong Q2 FY2026 Results with 33% Revenue Growth and 81% PAT Surge",
            "Summary": "Dixon Technologies reported consolidated revenue of Rs 15,351 crores for the quarter ended September 30, 2025, marking a 33% increase compared to the same period last year. For the half-year period, consolidated revenue reached Rs 28,188 crores, up 56%. The company's profit after tax (PAT) grew significantly by 81% for the quarter to Rs 746 crores and 86% for the half-year to Rs 1,026 crores. EBITDA increased by 152% for the quarter to Rs 1,057 crores and 128% for the half-year to Rs 1,541 crores. The company's board also approved the grant of 7,000 stock options under its Employee Stock Option Plan 2023. During the period, Dixon incorporated two new entities - Lightanium Technologies Private Limited as a joint venture and Dixon Electrocorp Private Limited as a wholly owned subsidiary. The company also completed the acquisition of 51% stake in Kunshan Q Tech Microelectronics (India) Private Limited for a total consideration of Rs 55,300 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1760698911207,
            "Source": "earnings"
        }
    ]
}