{
    "Symbol": "DJML",
    "ISIN": "INE0B1K01014",
    "News": [
        {
            "Title": "DJ Mediaprint Posts Strong Q3 FY26 Results",
            "Summary": "DJ Mediaprint & Logistics reported net profit of ₹171.39 lakh for Q3 FY26, with revenue from operations at ₹2,250.08 lakh. Nine-month performance showed robust growth with net profit rising to ₹513.95 lakh.",
            "Sentiment": "positive",
            "PublishDate": 1769872191653,
            "Source": "co_actions_results"
        },
        {
            "Title": "DJ Mediaprint Clarifies Price Movement as Market-Driven",
            "Summary": "DJ Mediaprint & Logistics clarifies that recent stock price movements are purely market-driven with no undisclosed material information requiring disclosure under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1766220151845,
            "Source": "stocks"
        },
        {
            "Title": "DJ Mediaprint Logistics Converts 14 Lakh Warrants into Equity Shares",
            "Summary": "DJ Mediaprint Logistics Limited's board approved conversion of 14,00,000 warrants into equity shares at Rs. 114 per share, raising Rs. 11.97 crores from two allottees including promoter Dinesh Muddu Kotian and Jugal Kishore Bhagat. The company's paid-up share capital increased to Rs. 34.38 crores with 3.44 crore equity shares, while 63.39 lakh warrants from 45 allottees remain pending for conversion.",
            "Sentiment": "positive",
            "PublishDate": 1763725226695,
            "Source": "corporate_action"
        },
        {
            "Title": "DJ Mediaprint Logistics Reports 37% Revenue Growth in Q2 FY2026",
            "Summary": "DJ Mediaprint Logistics Limited announced quarterly results with revenue from operations increasing to Rs 2,592.62 lakhs compared to Rs 1,895.07 lakhs in the same quarter last year. Net profit for the quarter stood at Rs 196.77 lakhs versus Rs 125.05 lakhs in the previous year. For the half-year period, revenue reached Rs 4,744.85 lakhs against Rs 3,394.19 lakhs last year, with net profit of Rs 342.56 lakhs compared to Rs 245.68 lakhs. The company operates in two segments: Printing Business and Record Management Services. Basic earnings per share for the quarter was Rs 0.61 compared to Rs 0.39 in the corresponding quarter last year. The Board of Directors approved the unaudited financial results for the quarter and half-year ended September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762880722702,
            "Source": "earnings"
        },
        {
            "Title": "DJ Mediaprint & Logistics Reports 43.6% Revenue Growth in Q1 Results",
            "Summary": "DJ Mediaprint & Logistics Limited submitted rectified financial results showing revenue from operations of Rs. 2,152.24 lakhs, up 43.6% year-over-year from Rs. 1,499.12 lakhs. Net profit increased 37.5% to Rs. 165.79 lakhs compared to Rs. 120.61 lakhs in the same period last year. EBITDA margin improved to 19.1% from 12.1% previously. However, revenue declined 9.2% sequentially from the previous quarter, and net profit fell 27.4%. The company operates two main segments: Printing Business contributing 67% of revenue at Rs. 1,435.25 lakhs, and Services contributing 33% at Rs. 716.98 lakhs. The company acquired subsidiary Sai Links and expanded into Cab Services. Total assets stood at Rs. 8,839.64 lakhs. Auditors noted that trade receivables and payables balances are subject to confirmations and reconciliation.",
            "Sentiment": "positive",
            "PublishDate": 1755613239416,
            "Source": "earnings"
        },
        {
            "Title": "DJ Mediaprint & Logistics Reports 68% Revenue Growth in Q1 Results",
            "Summary": "DJ Mediaprint & Logistics Limited reported consolidated revenue growth of 68.4% year-over-year to Rs 25.24 crore for the quarter ended June 30, 2025. Consolidated net profit increased 48.7% to Rs 1.79 crore. On a standalone basis, total income from operations grew 43.6% to Rs 21.52 crore, while net profit rose 37.5% to Rs 1.66 crore. The company operates in two segments: Printing Business and Record Management & Services. A new subsidiary was acquired on January 22, 2025, contributing to the consolidated growth. Despite profit growth, diluted earnings per share declined to Rs 0.56 from Rs 1.12 due to equity dilution.",
            "Sentiment": "positive",
            "PublishDate": 1755338705838,
            "Source": "earnings"
        },
        {
            "Title": "DJ Mediaprint & Logistics Reports 43% Revenue Growth in Q1 FY26",
            "Summary": "DJ Mediaprint & Logistics Limited released its investor presentation for Q1 FY26, showing revenue growth of 43.42% to Rs 2,152.24 lakhs compared to Rs 1,499.12 lakhs in Q1 FY25. The company's EBITDA increased 7.42% to Rs 417.57 lakhs from Rs 388.73 lakhs, while profit after tax grew 37.45% to Rs 165.78 lakhs versus Rs 120.61 lakhs in the previous year. The presentation highlighted sustained momentum across business verticals supported by new contracts and client retention, margin expansion through operational efficiency, and successful onboarding of Sai Links acquisition. The company operates in printing, logistics, document management, and related services with facilities across multiple Indian cities and an international presence in Guangzhou, China.",
            "Sentiment": "positive",
            "PublishDate": 1755188497446,
            "Source": "earnings"
        },
        {
            "Title": "DJ Mediaprint & Logistics Reports Increased Q3 Profit and Revenue",
            "Summary": "DJ Mediaprint & Logistics has announced its financial results for the third quarter. The company's net profit increased to 18 million rupees, up from 15.3 million rupees in the same period last year. Revenue also saw significant growth, rising to 204 million rupees from 112.6 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739458505000,
            "Source": "earnings"
        },
        {
            "Title": "DJ Mediaprint & Logistics Acquires Majority Stake in Sai Links",
            "Summary": "DJ Mediaprint & Logistics has acquired a 51% stake in Sai Links for 78 million rupees. This acquisition represents a significant corporate action, potentially expanding DJ Mediaprint & Logistics' business operations or market presence.",
            "Sentiment": "positive",
            "PublishDate": 1737559506000,
            "Source": "corporate_action"
        }
    ]
}