{
    "Symbol": "DLF",
    "ISIN": "INE271C01023",
    "News": [
        {
            "Title": "DLF sells Kolkata properties for ₹669.86 crore",
            "Summary": "DLF Limited executed agreements to sell its Kolkata IT/ITeS SEZ business and vacant land to Srijan Group entities for a total consideration of ₹669.86 crore on February 3, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770130830871,
            "Source": "co_actions_results"
        },
        {
            "Title": "DLF enters senior living segment with ₹2,000-crore project",
            "Summary": "DLF announces entry into senior living housing with Gurugram project worth ₹2,000 crore this quarter. Company remains confident of meeting ₹20,000-22,000 crore pre-sales target despite Q3 booking decline.",
            "Sentiment": "positive",
            "PublishDate": 1769189049658,
            "Source": "stocks"
        },
        {
            "Title": "DLF Confident in Meeting Annual Targets",
            "Summary": "Real estate developer DLF expresses confidence in achieving its annual business targets while maintaining its planned schedule for upcoming product launches across various segments.",
            "Sentiment": "positive",
            "PublishDate": 1769094046959,
            "Source": "stocks"
        },
        {
            "Title": "DLF Reports Record Q3FY26 Collections of ₹5,100 Cr",
            "Summary": "DLF Limited achieves record gross collections of ₹5,100 crore in Q3FY26 with 29% YoY net profit growth and zero gross debt position. Company reports strong cash generation of ₹3,876 crore.",
            "Sentiment": "positive",
            "PublishDate": 1769088403645,
            "Source": "co_actions_results"
        },
        {
            "Title": "DLF Block Trade Worth ₹21.07 Crores on NSE",
            "Summary": "DLF Ltd. witnessed a significant block trade on NSE involving 342,759 shares worth ₹21.07 crores at ₹614.75 per share, indicating institutional investor activity in the real estate major.",
            "Sentiment": "neutral",
            "PublishDate": 1769065405464,
            "Source": "co_actions_results"
        },
        {
            "Title": "Motilal Oswal Maintains Buy Rating on DLF with ₹993 Target",
            "Summary": "Motilal Oswal reiterates BUY rating for DLF with target price of ₹993, citing strong luxury residential portfolio traction and 16% presales CAGR expected over FY25-28E.",
            "Sentiment": "positive",
            "PublishDate": 1768981990080,
            "Source": "stocks"
        },
        {
            "Title": "DLF Earnings Call Scheduled for January 23, 2026",
            "Summary": "DLF Limited announces investor/analyst call on January 23, 2026 at 16:00 hrs to discuss Q3FY26 unaudited financial results and business outlook following board meeting approval.",
            "Sentiment": "neutral",
            "PublishDate": 1768569722501,
            "Source": "co_actions_results"
        },
        {
            "Title": "DLF Gets NCLT Nod to Merge 16 Wholly-Owned Subsidiaries",
            "Summary": "NCLT Chandigarh approves DLF's scheme to consolidate 16 subsidiaries under parent company, part of ongoing restructuring to streamline operations and reduce costs.",
            "Sentiment": "positive",
            "PublishDate": 1768398149081,
            "Source": "co_actions_results"
        },
        {
            "Title": "DLF Pre-Sales Expected to Drop 92% YoY in Q3: Nomura",
            "Summary": "Nomura Securities forecasts a significant 92% year-on-year decline in DLF's pre-sales performance for the third quarter, indicating challenging market conditions for the real estate major.",
            "Sentiment": "negative",
            "PublishDate": 1767242128247,
            "Source": "stocks"
        },
        {
            "Title": "DLF Reports 92% Drop in Q3 Pre-Sales vs Last Year",
            "Summary": "Real estate major DLF anticipates a significant 92% decline in pre-sales for Q3 compared to the same period last year, marking a substantial downturn in the company's sales performance.",
            "Sentiment": "negative",
            "PublishDate": 1767242098585,
            "Source": "co_actions_results"
        },
        {
            "Title": "DLF Subsidiary DCCDL Allots ₹1,000 Cr NCDs",
            "Summary": "DLF Limited's material subsidiary DCCDL has allotted 1,00,000 NCDs worth ₹1,000 crores with a 6.98% coupon rate and 4.5-year tenure on private placement basis to eligible investors.",
            "Sentiment": "neutral",
            "PublishDate": 1765976399226,
            "Source": "co_actions_results"
        },
        {
            "Title": "DLF Reports Strong Q2 Performance with Rs 4,300 Crores New Sales Bookings Led by Mumbai Launch",
            "Summary": "DLF Limited reported new sales bookings of over Rs 4,300 crores for the quarter, driven by the successful launch of The Westpark project in Mumbai. Cumulative sales for the first half reached over Rs 15,750 crores, aligning with company guidance. Collections stood at Rs 2,672 crores with high collection efficiency across projects. The company repaid Rs 963 crores of debt, reducing outstanding debt to Rs 1,487 crores, and paid Rs 1,485 crores in dividends (Rs 6 per share, reflecting 20% year-over-year growth). Consolidated revenue was Rs 2,262 crores with EBITDA of Rs 902 crores and PAT of Rs 1,171 crores, including a one-time impact of approximately Rs 600 crores from Tulsiwadi project settlement. CRISIL upgraded DLF's credit rating to AA with Stable Outlook. The rental business showed strong performance with DCCDL rental income growing 15% year-over-year to Rs 1,362 crores. Gross cash balance exceeded Rs 9,200 crores with approximately Rs 8,350 crores in RERA accounts. The company outlined upcoming launches including projects in Goa, Arbour 2, Panchkula, and additional phases of existing developments over the next 18 months.",
            "Sentiment": "positive",
            "PublishDate": 1762265823251,
            "Source": "earnings"
        },
        {
            "Title": "DLF Sells 221 Super-Luxury Flats for Rs 16,000 Crore in Gurugram Project",
            "Summary": "DLF Ltd has sold 221 super-luxury flats worth Rs 15,818 crore in its 'The Dahlias' project in Gurugram through the September quarter. The 17-acre project, launched in October last year at DLF Phase 5, comprises 420 apartments and penthouses with an average price of Rs 72 crore per unit. A recent transaction involved a businessman purchasing 4 apartments totaling 35,000 sq ft for Rs 380 crore. The project contributed to DLF's record sales bookings of Rs 21,223 crore in 2024-25. DLF achieved sales bookings of Rs 15,757 crore during April-September, compared to Rs 7,094 crore in the same period last year. However, the company reported a 15% decline in consolidated net profit to Rs 1,180.09 crore for the second quarter, with revenue from operations falling to Rs 1,643.04 crore from Rs 1,975.02 crore year-over-year. DLF remains confident of meeting its annual pre-sales guidance of Rs 20,000-22,000 crore with existing inventories and upcoming launches.",
            "Sentiment": "positive",
            "PublishDate": 1762071048032,
            "Source": "stock"
        },
        {
            "Title": "DLF Reports Strong Q2 Performance with ₹1,180 Crores Net Profit, Reverses Impairment Loss",
            "Summary": "DLF Limited announced quarterly results with net profit of ₹1,180.09 crores compared to ₹314.81 crores in the previous quarter. Revenue from operations reached ₹1,690.85 crores versus ₹1,477.60 crores in the prior quarter. The company reversed a previously charged impairment loss of ₹235.19 crores as exceptional income following a consent award settlement with Twenty Five Downtown Reality Limited (formerly Joyous Housing Limited). DLF received ₹251.10 crores from the settlement amount of ₹801 crores, with the balance secured by mortgage over residential real estate units. The company declared a dividend of ₹6 per equity share amounting to ₹1,485.19 crores. DLF faces ongoing legal matters including a ₹630 crores penalty from Competition Commission of India currently under appeal at the Supreme Court, land cancellation cases related to IT SEZ projects, and SEBI restrictions that were overturned by Securities Appellate Tribunal but remain under Supreme Court review.",
            "Sentiment": "positive",
            "PublishDate": 1761836602897,
            "Source": "earnings"
        },
        {
            "Title": "DLF Targets ₹210 Bn Annual Pre-Sales with 20% Growth, Expands Rental Portfolio to ₹50 Mn Sft by FY27",
            "Summary": "DLF expects to achieve ₹210 billion in annual pre-sales with 20% yearly growth through an expanding launch pipeline across MMR, Gurgaon, and Chennai. The company plans to grow its rental portfolio to ₹50 million square feet by FY27. Rental income increased 15% year-over-year to ₹1,362 crore. CRISIL upgraded the company's rating to AA+. DLF maintains a strong net cash position of ₹7,700 crore, which supports dividend payments and new project expansion.",
            "Sentiment": "positive",
            "PublishDate": 1761834715919,
            "Source": "stock"
        },
        {
            "Title": "DLF Reports Q2FY26 Net Profit of Rs 1,171 Crore with Strong Cash Position",
            "Summary": "DLF Limited announced its quarterly results with consolidated revenue of Rs 2,262 crore and net profit of Rs 1,171 crore. The company reported EBITDA of Rs 902 crore and net operating cash surplus generation of Rs 1,137 crore. New sales bookings reached Rs 4,332 crore, driven by the maiden launch in Mumbai called The Westpark and continued momentum in the super-luxury segment. Cumulative new sales bookings for H1FY26 stood at Rs 15,757 crore. The company maintained a net cash position of Rs 7,717 crore despite dividend payout of Rs 1,485 crore and debt repayment of Rs 963 crore during the quarter. CRISIL upgraded DLF's credit rating to AA/Stable. The annuity business subsidiary DLF Cyber City Developers Limited reported consolidated revenue of Rs 1,822 crore and EBITDA of Rs 1,412 crore, reflecting 12% year-on-year growth, with consolidated profit of Rs 643 crore showing 23% year-on-year growth. Two new assets were added to the annuity portfolio totaling 2.3 million square feet, bringing the operational annuity portfolio to 49 million square feet.",
            "Sentiment": "positive",
            "PublishDate": 1761834022306,
            "Source": "earnings"
        },
        {
            "Title": "DLF Reports Significant Jump in Other Income to 6.2 Billion Rupees",
            "Summary": "DLF reported other income of 6.2 billion rupees in the second quarter, representing a substantial increase from 2 billion rupees in the same period last year. This marks a year-over-year growth in the company's other income segment.",
            "Sentiment": "positive",
            "PublishDate": 1761830788863,
            "Source": "earnings"
        },
        {
            "Title": "DLF Reports Decline in Quarterly Financial Performance Across Key Metrics",
            "Summary": "DLF reported quarterly consolidated net profit of 11.8 billion rupees, down from 13.8 billion rupees in the same period last year. Revenue decreased to 16.43 billion rupees from 19.75 billion rupees year-over-year. EBITDA fell to 2.83 billion rupees compared to 5.02 billion rupees previously, while EBITDA margin contracted to 17.26% from 25.42% in the corresponding period.",
            "Sentiment": "negative",
            "PublishDate": 1761830085861,
            "Source": "earnings"
        },
        {
            "Title": "DLF Cyber City Developers Raises ₹1,100 Crore Through Listed NCDs at 6.91% Interest Rate",
            "Summary": "DLF Cyber City Developers has issued ₹1,100 crore worth of listed Non-Convertible Debentures (NCDs) offering a 6.91% interest rate. The fundraising was conducted through private placement.",
            "Sentiment": "neutral",
            "PublishDate": 1759240046628,
            "Source": "corporate_action"
        },
        {
            "Title": "DLF Limited Holds Analysts/Investors Meet, Reports Strong Financial Performance and Growth Outlook",
            "Summary": "DLF Limited conducted an analysts/investors meet on March 21, 2025, presenting its corporate presentation. The company reported group revenue of Rs 12,856 crore and group EBITDA of Rs 7,133 crore for 9MFY25. DLF has maintained 17 consecutive years of dividend payouts with three consecutive years of dividend increases. The company's net debt has improved from Rs 24,028 crore in FY21 to Rs 14,679 crore in 9MFY25, with net debt-to-EBITDA ratio declining to approximately 2-2.5x for FY25. The development business reported new sales bookings of Rs 14,778 crore in 9MFY25 with embedded margins of 60%. DLF operates through two main segments: development business (residential/commercial sales) and annuity business (office/retail leasing). The company has a land bank sufficient for 20+ years of growth with total development potential of 287 msf across locations. The annuity business operates approximately 44 msf of rental assets at 93% occupancy. DLF targets achieving gross debt zero position in development business in the near term and group net debt zero by FY30 while investing in growth capex of Rs 26,000+ crore.",
            "Sentiment": "positive",
            "PublishDate": 1757132306928,
            "Source": "stock"
        },
        {
            "Title": "DLF Reports 78% Jump in Sales Bookings to ₹11,425 Crores in Q1 FY26",
            "Summary": "DLF Limited reported sales bookings of ₹11,425 crores for Q1 FY26, reflecting a 78% year-on-year growth driven by successful launches in the DLF Privana ecosystem. The company generated embedded margins of ₹4,500 crores from quarterly sales and achieved net cash surplus of over ₹1,100 crores. Collections stood at ₹2,794 crores while debt was reduced by ₹1,364 crores. Revenue reached ₹2,981 crores with gross margin of 28%, EBITDA of ₹628 crores, and PAT of ₹766 crores showing 19% year-on-year growth. The rental business DCCDL reported 15% year-on-year growth and 26% PAT growth. The company operates 46 million square feet of rental portfolio with 94% occupancy. Downtown Chennai and Midtown Plaza received occupancy certificates during the quarter. Management expects to maintain sales guidance of ₹20-22 thousand crores for the fiscal year, with upcoming launches including Dahlias experience center in March-April and potential Goa project launches pending approvals.",
            "Sentiment": "positive",
            "PublishDate": 1754569159747,
            "Source": "earnings"
        },
        {
            "Title": "DLF Plans Rs. 5,000 Crore Annual Investment in Rental Properties for FY26-27",
            "Summary": "DLF announced plans to invest approximately Rs. 5,000 crore annually in FY26 and FY27 for rental properties. The company is targeting 8-9 million square feet in offices and 1-1.5 million square feet in malls for leasing this year. DLF aims for Rs. 20,000-22,000 crore in pre-sales by FY26, having already achieved Rs. 11,500 crore in Q1. For its DCCDL rental business, exit rentals are expected at Rs. 5,900 crore by March 2026, with the total rental portfolio projected to reach Rs. 6,700 crore.",
            "Sentiment": "positive",
            "PublishDate": 1754451113611,
            "Source": "stock"
        },
        {
            "Title": "DLF Reports Strong Q1FY26 Performance with 78% Growth in Sales Bookings and Net Cash Position of Rs 7,980 Crore",
            "Summary": "DLF Limited reported robust quarterly results with new sales bookings reaching Rs 11,425 crore, marking a 78% year-on-year growth driven by successful launches in the DLF Privana ecosystem. The company generated collections of Rs 2,794 crore and maintained a strong net cash surplus of Rs 1,131 crore. DLF's gross cash balance stood at Rs 10,429 crore, including Rs 7,782 crore in RERA 70% accounts, while achieving a net cash positive position of Rs 7,980 crore after repaying Rs 1,364 crore in debt during the quarter. The company's rental portfolio maintained high occupancy at 94% across segments, with office non-SEZ at 98%, office SEZ at 87%, and retail at 98%. DCCDL rental income grew 15% year-on-year to Rs 1,326 crore, with net debt-to-EBITDA improving to 3.2x. Several new developments showed strong pre-leasing activity, including DLF Downtown Chennai achieving 99% occupancy and Atrium Place Gurugram reaching 73% pre-leasing ahead of completion.",
            "Sentiment": "positive",
            "PublishDate": 1754307936271,
            "Source": "earnings"
        },
        {
            "Title": "DLF Limited Approves Q1 FY26 Financial Results and Appoints New Cost Auditors",
            "Summary": "DLF Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025, and appointed M/s Sanjay Gupta & Associates as Cost Auditors for FY 2025-26. The company reported revenue from operations of ₹1,716.70 crores and net profit of ₹1,282.20 crores for the quarter. The board meeting was held on August 4, 2025, with the financial results including both standalone and consolidated statements. The company faces ongoing legal challenges including a ₹630 crore penalty from Competition Commission of India, land cancellation orders for IT SEZ projects in Gurugram, and SEBI-related matters, all currently under appeal at various court levels.",
            "Sentiment": "neutral",
            "PublishDate": 1754306423461,
            "Source": "earnings"
        },
        {
            "Title": "DLF Cyber City Developers Raises ₹1,100 Crore Through Non-Convertible Debentures at 6.92% Interest",
            "Summary": "DLF Cyber City Developers Limited, a material subsidiary of DLF Limited, has allotted 110,000 Non-Convertible Debentures worth ₹1,100 crore through private placement. The NCDs carry a face value of ₹1 lakh each and offer a coupon rate of 6.92% per annum, payable quarterly. The debentures are senior, rated, listed, secured, redeemable, transferable, and rupee-denominated, issued to eligible investors. The Securities Allotment Committee of DCCDL's Board of Directors approved the allotment, and the company has made the requisite disclosure to BSE Limited where its NCDs are listed.",
            "Sentiment": "neutral",
            "PublishDate": 1753720317745,
            "Source": "corporate_action"
        },
        {
            "Title": "DLF Enters Mumbai Residential Market with ₹2,300 Cr Sales from 'The Westpark' Project",
            "Summary": "DLF has made its entry into Mumbai's residential market with 'The Westpark' project, which has generated over ₹2,300 crore in sales. The project has experienced strong demand, marking a significant milestone for the real estate developer as it expands into the Mumbai market.",
            "Sentiment": "positive",
            "PublishDate": 1753412418788,
            "Source": "stock"
        },
        {
            "Title": "DLF Ltd: Luxury Housing Project Marks Re-entry into Mumbai Market",
            "Summary": "DLF Ltd launches 'The WestPark', a premium residential project in Andheri West, Mumbai. The project offers luxury amenities and is priced at Rs 6-9 crore per unit. DLF plans to expand further in Mumbai with new proposals in the pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1752800887000,
            "Source": "normal_news"
        },
        {
            "Title": "DLF Ltd: Re-enters Mumbai Real Estate Market with 'The Westpark' Project",
            "Summary": "DLF Ltd is launching 'The Westpark' in Mumbai's Andheri West after a decade-long absence. Apartments are priced between ₹4.2 crore to ₹7.2 crore, with carpet areas of 1,126 to 1,511 square feet. Analysts anticipate strong response due to aggressive pricing.",
            "Sentiment": "positive",
            "PublishDate": 1752721631000,
            "Source": "corporate_action"
        },
        {
            "Title": "DLF to Launch New Mumbai Project with High-End Apartment Prices",
            "Summary": "DLF is set to launch a new project in Mumbai tomorrow. The apartments in this project are priced between ₹37,270 and ₹47,875 per square foot. The total price range for these apartments is from ₹4.2 crore to ₹7.2 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1752657678000,
            "Source": "default"
        },
        {
            "Title": "DLF Ltd: Record Housing Sales and Strong Launch Pipeline for FY25",
            "Summary": "DLF Ltd reports record sales bookings of Rs 21,223 crore in FY25, up 44% from previous year. The company plans to launch housing projects worth over Rs 17,000 crore in the current fiscal year to meet market demand. DLF's rental business is growing steadily with new developments in multiple cities. The company aims for sales of Rs 20,000-22,000 crore in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1752426686000,
            "Source": "earnings"
        },
        {
            "Title": "DLF Receives First Payment of ₹100 Crore from Arbitration with TFDRL",
            "Summary": "DLF has received an initial payment of ₹100 crore from an arbitration settlement with TFDRL. The total payout is secured by a mortgage on a 1.5 lakh square feet project in Mumbai.",
            "Sentiment": "positive",
            "PublishDate": 1752248051000,
            "Source": "default"
        },
        {
            "Title": "DLF Ltd.: NSE Block Trade of Rs. 50.02 Crores",
            "Summary": "A block trade of DLF Ltd. shares occurred on the National Stock Exchange (NSE). The transaction involved approximately 600,741 shares and was valued at Rs. 50.02 crores. The trade was executed at a price of Rs. 832.65 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1752125163000,
            "Source": "block_details"
        },
        {
            "Title": "DLF Ltd.: Mumbai Expansion Plans Following RERA Approval for First Project",
            "Summary": "DLF Ltd. received RERA approval for its first Mumbai project, The Westpark in Andheri. The company is exploring opportunities in Mumbai's premium, luxury, and super luxury real estate segments. DLF is partnering with Trident Developers for this SRA scheme project. The firm aims to bring hotel-like amenities to residential spaces and is seeing increased demand for premium real estate post-pandemic.",
            "Sentiment": "positive",
            "PublishDate": 1751109010000,
            "Source": "normal_news"
        },
        {
            "Title": "DLF to Launch Bookings for High-End Mumbai Residential Project",
            "Summary": "DLF plans to begin bookings for a high-end residential project in Mumbai next month. The company is expanding its presence in the Mumbai real estate market with this upcoming luxury development.",
            "Sentiment": "positive",
            "PublishDate": 1750412026000,
            "Source": "default"
        },
        {
            "Title": "DLF Ltd: Mumbai Comeback with Premium Residential Project in July",
            "Summary": "DLF Ltd plans to launch bookings for a premium residential project in Mumbai next month, marking its return to the financial capital after 13 years. The project, West Park, will feature eight towers in two phases with apartments priced over 50 million rupees. The first phase includes 416 apartments across four towers, with completion expected by mid-2032.",
            "Sentiment": "positive",
            "PublishDate": 1750408890000,
            "Source": "corporate_action"
        },
        {
            "Title": "DLF Ltd: Luxury Project Sells Rs 11,000 Crore in One Week",
            "Summary": "DLF Ltd sold luxury homes worth Rs 11,000 crore in its new Gurugram project, DLF Privana North, within a week of launch. The project comprises 1,164 high-end residences in a 116-acre integrated township. This success follows two previous launches in the same township, bringing total sales to Rs 24,000 crore. DLF reported record sales bookings of Rs 21,223 crore in FY25 and plans to launch projects worth over Rs 17,000 crore in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1750226412000,
            "Source": "normal_news"
        },
        {
            "Title": "DLF Ltd: Luxury Project Sells Out for Rs 11,000 Crore in One Week",
            "Summary": "DLF Ltd's share price rose nearly 2% after announcing the complete sellout of its luxury project, DLF Privana North, in Gurugram for approximately Rs 11,000 crore within one week. The project includes six premium towers with 1,152 four-bedroom residences and 12 penthouses.",
            "Sentiment": "positive",
            "PublishDate": 1750223628000,
            "Source": "corporate_action"
        },
        {
            "Title": "DLF Expects to Exceed Annual Bookings Target, Receives RERA Approval for Mumbai Project",
            "Summary": "DLF anticipates surpassing its annual bookings target of ₹20,000–22,000 crore due to new launches. The company has also received RERA approval for its Mumbai project, with sales expected to commence soon.",
            "Sentiment": "positive",
            "PublishDate": 1750221647000,
            "Source": "default"
        },
        {
            "Title": "DLF's Privana Legacy North Phase Sells Out, Achieving Record Sales",
            "Summary": "DLF's Privana Legacy North Phase has completely sold out, generating over ₹11,000 crore in sales. This surpasses the previous records set by DLF Privana South and West phases, indicating strong demand for luxury homes in Gurugram.",
            "Sentiment": "positive",
            "PublishDate": 1750214774000,
            "Source": "default"
        },
        {
            "Title": "DLF's Privana North Project Sells Out Within a Week",
            "Summary": "DLF's premium development project, Privana North, has achieved sales ranging between ₹11,000 - ₹12,000 crores. The entire project was successfully sold out within just one week of its launch.",
            "Sentiment": "positive",
            "PublishDate": 1750143185000,
            "Source": "default"
        },
        {
            "Title": "ICRA Upgrades DLF Cyber City Developers Ltd's NCD Rating",
            "Summary": "ICRA has upgraded the rating for DLF Cyber City Developers Ltd's Non-Convertible Debentures (NCDs) to [ICRA] AAA (Stable) from AA+. This represents an improvement in the company's credit rating.",
            "Sentiment": "positive",
            "PublishDate": 1750126598000,
            "Source": "default"
        },
        {
            "Title": "DLF Ltd: ₹5,500 Crore Investment in New Luxury Housing Project",
            "Summary": "DLF Ltd plans to invest ₹5,500 crore to develop 'DLF Privana North', a luxury housing project in Gurugram. The project will comprise over 1,150 apartments on 18 acres in Sector 76/77. This is part of the larger 116-acre 'DLF Privana' township. DLF aims to achieve sales bookings of ₹20,000-22,000 crore in the current fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1749987335000,
            "Source": "corporate_action"
        },
        {
            "Title": "DLF Forms New Subsidiary for Aircraft Leasing in GIFT City",
            "Summary": "DLF has established a new subsidiary company focused on aircraft leasing operations in GIFT City. The company has not provided any additional details about the subsidiary or its specific plans for the aircraft leasing business.",
            "Sentiment": "neutral",
            "PublishDate": 1748448974000,
            "Source": "default"
        },
        {
            "Title": "DLF Ltd. Block Trade: 915,986 Shares Sold for Rs. 71.47 Crores",
            "Summary": "A block trade of approximately 915,986 shares of DLF Ltd. took place on the National Stock Exchange (NSE). The transaction was valued at Rs. 71.47 crores, with shares priced at Rs. 780.30 each.",
            "Sentiment": "neutral",
            "PublishDate": 1748324097000,
            "Source": "block_details"
        },
        {
            "Title": "DLF Plans Rs 10,000 Crore Investment in Premium Real Estate",
            "Summary": "DLF, a real estate company, has announced plans to invest Rs 10,000 crore over the current and next fiscal year to develop premium office spaces and shopping malls. This investment is aimed at increasing the company's rental income. The information was provided by a senior company official.",
            "Sentiment": "positive",
            "PublishDate": 1748169318000,
            "Source": "default"
        },
        {
            "Title": "DLF Ltd: Plans Rs 17,000 Crore Housing Project Launch in FY26",
            "Summary": "DLF Ltd aims to launch housing projects worth over Rs 17,000 crore in FY26, following strong demand for luxury homes. The company reported record sales bookings of Rs 21,223 crore in FY25, a 44% increase from the previous year. DLF's net profit for FY25 rose to Rs 4,366.82 crore, with total income reaching Rs 8,995.89 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747732732000,
            "Source": "corporate_action"
        },
        {
            "Title": "DLF Ltd: Analysts Project Share Price to Exceed ₹1,000",
            "Summary": "DLF's Q4 net profit rose 36% to ₹1,282 crore, with revenue up 46.5% to ₹3,127.6 crore. Jefferies maintains 'Buy' rating with ₹1,000 price target. Morgan Stanley keeps 'Overweight' rating with ₹910 target. FY25 pre-sales reached ₹21,200 crore, up 44% YoY. Company declared ₹6 per share dividend.",
            "Sentiment": "positive",
            "PublishDate": 1747709650000,
            "Source": "earnings"
        },
        {
            "Title": "DLF Reports Strong Q4 Results with Increased Profit and Revenue",
            "Summary": "DLF announced its Q4 consolidated net profit of 12.8 billion rupees, up from 9.2 billion rupees year-over-year, surpassing estimates of 8.03 billion rupees. The company's Q4 revenue reached 31.3 billion rupees, compared to 21.35 billion rupees in the previous year, exceeding estimates of 17.1 billion rupees. Additionally, DLF recommended a dividend of 6 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747700289000,
            "Source": "default"
        },
        {
            "Title": "DLF Ltd.: Q4 Profit Jumps 39%, Revenue Up 47%",
            "Summary": "DLF Ltd. reported a 39% year-on-year increase in consolidated net profit to Rs 1,282 crore for Q4. Revenue rose 47% to Rs 3,128 crore. EBITDA grew 30% to Rs 978.6 crore, though margin contracted to 31.3%. The company plans to pay a dividend of Rs 6 per share, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1747668274000,
            "Source": "earnings"
        },
        {
            "Title": "DLF Reports Strong Q4 Results and Recommends Dividend",
            "Summary": "DLF has announced its Q4 financial results and a dividend recommendation. The company's Q4 consolidated net profit increased to 12.8 billion rupees from 9.2 billion rupees year-over-year, surpassing estimates of 8.03 billion rupees. Revenue rose to 31.3 billion rupees from 21.35 billion rupees in the previous year, exceeding expectations of 17.1 billion rupees. EBITDA for Q4 was 9.8 billion rupees, up from 7.54 billion rupees year-over-year, though the EBITDA margin decreased to 31.30% from 35.32%. The company has recommended a dividend of 6 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747667177000,
            "Source": "result"
        }
    ]
}