{
    "Symbol": "DLINKINDIA",
    "ISIN": "INE250K01012",
    "News": [
        {
            "Title": "D-Link India Q3FY26 Results: Revenue Up 19.4% YoY",
            "Summary": "D-Link India reported strong Q3FY26 performance with revenue rising 19.4% YoY to ₹39,358.84 lakhs. Net profit reached ₹2,654.42 lakhs with EPS of ₹7.47. Board approved ₹6 interim dividend.",
            "Sentiment": "positive",
            "PublishDate": 1770296698776,
            "Source": "co_actions_results"
        },
        {
            "Title": "D-Link India faces ₹6.11 cr customs demand order",
            "Summary": "D-Link India receives customs adjudication order demanding ₹6.11 crores for alleged royalty valuation violations, with ₹1 crore voluntary payment already made against the demand.",
            "Sentiment": "negative",
            "PublishDate": 1768907579498,
            "Source": "stocks"
        },
        {
            "Title": "D-Link India Board Meeting Set for February 05, 2026",
            "Summary": "D-Link (India) Limited announces board meeting on February 05, 2026 to consider Q3FY26 unaudited financial results for quarter ended December 31, 2025. Trading window closed from January 01, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767694460408,
            "Source": "stocks"
        },
        {
            "Title": "D-Link Reports Mixed Q2 Results with Revenue Growth but Lower Profit",
            "Summary": "D-Link reported Q2 consolidated net profit of 254 million rupees, down from 267 million rupees in the same period last year. Revenue increased to 3.76 billion rupees from 3.36 billion rupees year-over-year. EBITDA rose slightly to 330 million rupees from 329 million rupees, while EBITDA margin declined to 8.75% from 9.76% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762341589400,
            "Source": "earnings"
        },
        {
            "Title": "D-Link India Reports Strong Q2 Results, Declares Rs 6 Interim Dividend and Board Changes",
            "Summary": "D-Link India Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company declared an interim dividend of Rs 6 per equity share (face value Rs 2), representing 300% of face value for financial year 2025-26. The record date for dividend eligibility is set for November 14, 2025, with payment within 30 days. The Board approved the appointment of Mr. Chih-Chang Chiang (Alex Chiang) as director, subject to regulatory approvals and obtaining Director Identification Number. Mr. Mukesh Lulla resigned from his position as Non-Executive Non-Independent Director effective November 5, 2025, citing other professional commitments after nearly ten years of service. The company operates in the networking products business segment and reconstituted various board committees following the directorial changes.",
            "Sentiment": "positive",
            "PublishDate": 1762337585984,
            "Source": "corporate_action"
        },
        {
            "Title": "D-Link Reports Marginal Growth in Q1 Financial Results",
            "Summary": "D-Link reported consolidated net profit of 244 million rupees in Q1, compared to 236 million rupees in the same period last year, representing year-over-year growth. The company's Q1 revenue reached 3.5 billion rupees, up from 3.45 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754577878955,
            "Source": "earnings"
        },
        {
            "Title": "D-Link Reports Improved Q3 EBITDA and Margin",
            "Summary": "D-Link has announced its Q3 financial results, showing an increase in EBITDA to 334 million rupees from 291 million rupees year-over-year. The company's EBITDA margin also improved slightly to 10.07% from 9.91% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738922156000,
            "Source": "earnings"
        },
        {
            "Title": "D-Link Reports Increased Q3 Profit and Revenue",
            "Summary": "D-Link has announced its financial results for the third quarter. The company's consolidated net profit increased to 265 million rupees from 230 million rupees in the same period last year. Revenue also saw growth, rising to 3.3 billion rupees from 2.9 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738922081000,
            "Source": "earnings"
        },
        {
            "Title": "D-Link Declares Interim Dividend of ₹5 Per Share",
            "Summary": "D-Link has announced and approved an interim dividend of ₹5 per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1730282299000,
            "Source": "corporate_action"
        },
        {
            "Title": "D-Link Reports Improved Q2 EBITDA",
            "Summary": "D-Link's Q2 EBITDA increased to 329 million rupees from 304 million rupees year-over-year. However, the EBITDA margin slightly decreased to 9.77% from 9.86% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730282010000,
            "Source": "result"
        },
        {
            "Title": "D-Link Reports Q2 Revenue Growth",
            "Summary": "D-Link, a networking equipment manufacturer, has reported its second quarter revenue of 3.4 billion rupees, showing an increase from 3.1 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1730281708000,
            "Source": "result"
        },
        {
            "Title": "D-Link Reports Increase in Q2 Consolidated Net Profit",
            "Summary": "D-Link's consolidated net profit for the second quarter rose to 267 million rupees, up from 236 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730281698000,
            "Source": "result"
        },
        {
            "Title": "D-Link Board Meeting Scheduled for Q2 Results",
            "Summary": "<p>D-Link has announced a <span class='neutral'>board meeting</span> on <span class='neutral'>October 30</span> to <span class='neutral'>consider and approve</span> the company's <span class='neutral'>financial results</span> for the <b>second quarter</b>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728624456000,
            "Source": "result"
        }
    ]
}