{
    "Symbol": "DMART",
    "ISIN": "INE192R01011",
    "News": [
        {
            "Title": "DMart Opens New Store in Tamil Nadu, Total Reaches 445",
            "Summary": "Avenue Supermarts Limited opened its new DMart store at Kelambakkam, Chengalpattu in Tamil Nadu on January 27, 2026, bringing the company's total store count to 445 outlets across India.",
            "Sentiment": "positive",
            "PublishDate": 1769518412702,
            "Source": "stocks"
        },
        {
            "Title": "DMart Opens 444th Store in Pali, Rajasthan",
            "Summary": "Avenue Supermarts Limited announces the opening of its new DMart store in Pali, Rajasthan on January 22, 2026, bringing the total store count to 444 across India.",
            "Sentiment": "positive",
            "PublishDate": 1769087383866,
            "Source": "stocks"
        },
        {
            "Title": "Avenue Supermarts Seeks Shareholder Approval for New MD",
            "Summary": "Avenue Supermarts initiates postal ballot for appointing Anshul Asawa as Managing Director from April 1, 2026, with e-voting scheduled from January 22 to February 20, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769005476946,
            "Source": "co_actions_results"
        },
        {
            "Title": "DMart Opens New Store in Ludhiana, Total Reaches 443",
            "Summary": "Avenue Supermarts Limited (DMart) inaugurated its new store at Pakhowal, Ludhiana on January 20, 2026, expanding its retail network to 443 stores across India.",
            "Sentiment": "positive",
            "PublishDate": 1768914497033,
            "Source": "stocks"
        },
        {
            "Title": "Avenue Supermarts Q3FY26 Results Show Strong Growth",
            "Summary": "Avenue Supermarts reported Q3FY26 total income of ₹17,642.89 crores, with net profit after tax rising to ₹923.05 crores. The company's standalone earnings per share increased to ₹14.19.",
            "Sentiment": "positive",
            "PublishDate": 1768220487142,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nuvama sees DMart stabilising with margin recovery",
            "Summary": "Abneesh Roy from Nuvama believes Avenue Supermarts is nearing bottom after sharp correction, citing 50 basis point margin improvement in Q3FY26 and oversold conditions creating rebound potential.",
            "Sentiment": "positive",
            "PublishDate": 1768210267568,
            "Source": "stocks"
        },
        {
            "Title": "DMart Q3 Results: Profit Up 18.3% Despite Flat Share Price",
            "Summary": "Avenue Supermarts reported 18.3% YoY profit growth to ₹855.92 crore in Q3 FY26, with revenue rising 13.3% to ₹18,100.88 crore. Mixed brokerage views emerge on growth concerns.",
            "Sentiment": "neutral",
            "PublishDate": 1768198259334,
            "Source": "co_actions_results"
        },
        {
            "Title": "DMart shares surge 3% to one-month high post Q3 results",
            "Summary": "Avenue Supermarts shares jumped 3.1% to ₹3,918.60 after Q3FY25 results showed 17% YoY net profit growth to ₹856 crores. Revenue grew 13.3% to ₹18,101 crores with EBITDA margins expanding to 8.1%.",
            "Sentiment": "positive",
            "PublishDate": 1768195692265,
            "Source": "co_actions_results"
        },
        {
            "Title": "DMart Gets Target Price Upgrade Despite Competition",
            "Summary": "Motilal Oswal upgrades DMart's target price following margin recovery, though quick commerce competition remains a concern for future sustainability.",
            "Sentiment": "neutral",
            "PublishDate": 1768193242580,
            "Source": "stocks"
        },
        {
            "Title": "DMart Q3 Earnings Beat Drives Share Price to 1-Month High",
            "Summary": "Avenue Supermarts reported strong Q3 results with 13.30% revenue growth to ₹15,973 crore and net profit rising to ₹856 crore. Shares hit one-month high despite analysts flagging margin expansion as temporary.",
            "Sentiment": "positive",
            "PublishDate": 1768192346273,
            "Source": "co_actions_results"
        },
        {
            "Title": "DMart Gets 'Hold' Rating on Strong Q3 Margins",
            "Summary": "Systematix maintains 'Hold' rating for DMart following better-than-expected Q3 margins despite revenue growth impact from staples deflation. Foods revenue grew 12% YoY while non-foods expanded 15.6%.",
            "Sentiment": "neutral",
            "PublishDate": 1768190711374,
            "Source": "co_actions_results"
        },
        {
            "Title": "DMart Q3 results spark cautious brokerage calls",
            "Summary": "Brokerages turn cautious on DMart despite Q3 earnings beat, with Citi issuing 'sell' rating on slowing same-store growth of 5.6% and margin sustainability concerns, while Jefferies and Nuvama maintain 'hold' ratings.",
            "Sentiment": "negative",
            "PublishDate": 1768190686690,
            "Source": "co_actions_results"
        },
        {
            "Title": "DMart Restructures Leadership with Leaner Team",
            "Summary": "Avenue Supermarts DMart announces streamlined four-member senior leadership team effective February 1, marking departure from 14-member structure as company focuses on category-led growth.",
            "Sentiment": "neutral",
            "PublishDate": 1768178133190,
            "Source": "stocks"
        },
        {
            "Title": "DMart CEO Transition: Anshul Asawa to Replace Noronha",
            "Summary": "Avenue Supermarts announces leadership transition as Ignatius Navil Noronha's term ends January 31, 2026, with Anshul Asawa appointed as new CEO. Company reports strong Q3 performance with 17% profit growth.",
            "Sentiment": "positive",
            "PublishDate": 1768054300085,
            "Source": "stocks"
        },
        {
            "Title": "DMart Q3FY26 Revenue Jumps 14.9% to ₹49,764 Crores",
            "Summary": "Avenue Supermarts reports strong Q3FY26 performance with revenue growth of 14.9% and EBITDA of ₹4,024 crores. Company expands to 442 stores across 12 states with improved operational metrics.",
            "Sentiment": "positive",
            "PublishDate": 1768046605022,
            "Source": "stocks"
        },
        {
            "Title": "DMart Q3FY26 Revenue Grows 13.2% to ₹17,613 Crores",
            "Summary": "Avenue Supermarts reports strong Q3FY26 results with standalone revenue up 13.2% at ₹17,613 crores and PAT growth of 17.6% at ₹923 crores. Company added 10 new stores during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1768046408155,
            "Source": "co_actions_results"
        },
        {
            "Title": "DMart Q3FY26 Results: Revenue Rises 13.1% YoY",
            "Summary": "Avenue Supermarts (DMart) reported strong Q3FY26 performance with revenue growing 13.1% YoY to ₹17,612.62 crores. Net profit increased 17.6% to ₹923.05 crores with improved margins.",
            "Sentiment": "positive",
            "PublishDate": 1768046158017,
            "Source": "co_actions_results"
        },
        {
            "Title": "DMart Q3FY26 Results: Revenue Rises 13.1% YoY to ₹17,613 Cr",
            "Summary": "Avenue Supermarts reported strong Q3FY26 performance with revenue growth of 13.1% YoY to ₹17,612.62 crores. Net profit increased 17.6% to ₹923.05 crores. Company announced leadership transition with Anshul Asawa appointed as new CEO.",
            "Sentiment": "positive",
            "PublishDate": 1768045881623,
            "Source": "co_actions_results"
        },
        {
            "Title": "V2 Retail Leads Q2 FY26 Same Store Sales Growth at 23.4%",
            "Summary": "V2 Retail topped Q2 FY26 same-store sales growth at 23.4%, followed by Baazar Style at 22%. Value-fashion retailers outperformed larger peers like DMart (6.8%), indicating stronger demand recovery at mass market level.",
            "Sentiment": "positive",
            "PublishDate": 1768017748879,
            "Source": "stocks"
        },
        {
            "Title": "Avenue Supermarts Issues ₹100 Cr Commercial Paper",
            "Summary": "Avenue Supermarts Limited has allotted commercial paper worth ₹100 crores with 80-day tenure at 6.00% interest rate, rated ICRA A1+ and proposed for BSE listing.",
            "Sentiment": "neutral",
            "PublishDate": 1767962697961,
            "Source": "co_actions_results"
        },
        {
            "Title": "DMart Q3 Preview: Revenue Growth Expected Amid Margin Pressure",
            "Summary": "Avenue Supermarts reports 13.15% revenue growth to ₹17,612.62 crore in Q3FY26 business update. Brokerages expect modest profit growth but anticipate EBITDA margin contraction due to elevated costs and competitive pressures.",
            "Sentiment": "neutral",
            "PublishDate": 1767961418382,
            "Source": "co_actions_results"
        },
        {
            "Title": "DMart Gets ₹6,105 Target With 63% Upside Potential",
            "Summary": "CLSA maintains bullish outlook on Avenue Supermarts despite target cut, citing robust low-cost model and private label expansion. Q3 revenue grows 13% YoY to ₹17,613 crore with 442 stores.",
            "Sentiment": "positive",
            "PublishDate": 1767958003873,
            "Source": "co_actions_results"
        },
        {
            "Title": "DMart Gets Enhanced ₹500 Cr Commercial Paper Rating",
            "Summary": "Avenue Supermarts receives ICRA A1+ rating reaffirmation with commercial paper limit enhanced from ₹300 crore to ₹500 crore, strengthening short-term funding capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1767615630821,
            "Source": "stocks"
        },
        {
            "Title": "Avenue Supermarts Block Trade Worth ₹37.67 Crores",
            "Summary": "Avenue Supermarts executed a larger NSE block trade involving 99,596 shares at ₹3,782.40 per share, totaling ₹37.67 crores in transaction value, significantly higher than previous trade.",
            "Sentiment": "neutral",
            "PublishDate": 1767077036890,
            "Source": "co_actions_results"
        },
        {
            "Title": "DMart Opens New Store in Surat, Total Count Reaches 442",
            "Summary": "Avenue Supermarts Limited inaugurated its latest DMart store in Vesu, Surat, Gujarat on December 14, 2025, expanding its retail network to 442 stores nationwide.",
            "Sentiment": "positive",
            "PublishDate": 1765718929843,
            "Source": "stocks"
        },
        {
            "Title": "DMart Opens New Store in Gujarat, Total Count Reaches 441",
            "Summary": "Avenue Supermarts Limited announced the opening of its new DMart store in Madhapar, Rajkot, Gujarat on December 12, 2025, bringing the total store count to 441 across India.",
            "Sentiment": "positive",
            "PublishDate": 1765541185624,
            "Source": "stocks"
        },
        {
            "Title": "DMart Sales Growth May Stay Low - Kotak Securities",
            "Summary": "Kotak Securities indicates that Avenue Supermarts DMart may continue experiencing subdued sales growth due to ongoing effects of fast-paced shopping trends affecting the retail sector.",
            "Sentiment": "negative",
            "PublishDate": 1765427106507,
            "Source": "stocks"
        },
        {
            "Title": "DMart Gets ESG Rating of 72 in Leader Category",
            "Summary": "Avenue Supermarts receives ESG rating of 72 for FY25 from NSE Sustainability, placing it in Leader category. Rating independently prepared based on public domain information.",
            "Sentiment": "positive",
            "PublishDate": 1765382679878,
            "Source": "stocks"
        },
        {
            "Title": "DMart Opens New Store in Tamil Nadu, Reaches 440 Outlets",
            "Summary": "Avenue Supermarts Limited announces the opening of its new DMart store in Kovilpatti, Thoothukudi district of Tamil Nadu, bringing the company's total store count to 440 outlets across India.",
            "Sentiment": "positive",
            "PublishDate": 1765379776083,
            "Source": "stocks"
        },
        {
            "Title": "Avenue Supermarts Opens New Store in Hassan, Karnataka, Reaches 434 Total Stores",
            "Summary": "Avenue Supermarts Limited opened a new store in Hassan, Karnataka. The company now operates 434 stores in total. The store opening was communicated to stock exchanges NSE and BSE by Company Secretary Ashu Gupta.",
            "Sentiment": "positive",
            "PublishDate": 1760531292062,
            "Source": "stock"
        },
        {
            "Title": "Avenue Supermarts Opens New Store in Andhra Pradesh, Total Count Reaches 433",
            "Summary": "Avenue Supermarts Limited opened a new store in Chirala, Bapatla, Andhra Pradesh on October 14, 2025. With this expansion, the company's total store count has reached 433 stores. The company notified stock exchanges BSE and NSE about the store opening through its Company Secretary & Compliance Officer, Ashu Gupta.",
            "Sentiment": "positive",
            "PublishDate": 1760445375168,
            "Source": "stock"
        },
        {
            "Title": "DMart Parent Avenue Supermarts Reports Mixed Quarterly Results with Margin Decline",
            "Summary": "Avenue Supermarts, DMart's parent company, reported 15.5% year-on-year revenue growth to ₹16,676 crore for the July-September period. However, EBITDA softened and profit after tax declined due to higher depreciation costs. The company's revenue mix remained stable with Foods at 57% and Non-Foods at 43%. Revenue per store increased 1% while bill cuts rose 14%. DMart shut operations in five cities and now operates in 19 cities. Analysts remain divided with HSBC maintaining a 'Reduce' rating at ₹3,700 price target, citing elevated operating expenses and 30 bps decline in EBITDA margin. Morgan Stanley kept 'Equal-Weight' rating with ₹4,552 target, calling the quarter a 'miss' with results 7% and 14% below estimates for EBITDA and PAT respectively. Like-for-like growth moderated to 6.8%, marking a 10-quarter low. Shares closed 0.53% higher at ₹4,328 and have gained 22% year-to-date.",
            "Sentiment": "negative",
            "PublishDate": 1760326014304,
            "Source": "earnings"
        },
        {
            "Title": "Avenue Supermarts Reports Q2 Net Profit Growth to 6.85 Billion Rupees",
            "Summary": "Avenue Supermarts reported Q2 consolidated net profit of 6.85 billion rupees compared to 6.6 billion rupees in the same period last year. Revenue increased to 167 billion rupees from 144 billion rupees year-over-year. EBITDA rose to 12.1 billion rupees from 10.9 billion rupees, while EBITDA margin declined to 7.3% from 7.6% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1760314583941,
            "Source": "earnings"
        },
        {
            "Title": "Avenue Supermarts (DMart) Reports 15% Revenue Growth in Q2 FY2026",
            "Summary": "Avenue Supermarts Limited reported revenue from operations of ₹16,218.79 crores for the quarter ended September 30, 2025, compared to ₹14,050.32 crores in the same quarter last year. Net profit after tax reached ₹746.55 crores versus ₹710.37 crores in the previous year quarter. For the six-month period, revenue grew to ₹32,150.91 crores from ₹27,762.19 crores year-on-year, with net profit increasing to ₹1,576.28 crores from ₹1,522.82 crores. The company's operating margin for the quarter was 7.58% compared to 7.87% in the same period last year. Basic earnings per share stood at ₹11.47 for the quarter. The company issued commercial papers worth ₹100 crores on September 29, 2025, with a 6% discount rate and maturity date of December 29, 2025. The Board of Directors approved these results at their meeting held on October 11, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760177110253,
            "Source": "earnings"
        },
        {
            "Title": "DMart Q2 Preview: Net Profit Expected to Rise 7-11% YoY, Revenue Growth of 15-16% Driven by Store Expansion",
            "Summary": "Avenue Supermarts, which operates DMart retail stores, is projected to report net profit between Rs 707-790 crore for Q2, representing 7-11% year-over-year growth but an 8% sequential decline. Revenue estimates range from Rs 16,200-16,720 crore, indicating 15-16% YoY growth and 2% quarter-over-quarter growth. The company added eight new stores during the quarter, bringing total count to 432. EBITDA margins are expected to soften to 7.2-7.8% range versus 7.6% a year ago due to higher employee and operational expenses from aggressive store rollouts and competitive pressures. Sales per square feet is projected to grow 1% YoY to Rs 36,400 annualized. Key factors to monitor include demand trends across different city tiers, same-store sales growth, competition impact from online and quick commerce players, and management guidance on store expansion. Earnings will be declared on Saturday, October 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760090614299,
            "Source": "earnings"
        },
        {
            "Title": "DMart Quarterly Results Preview: Revenue Growth Expected to Slow Amid Margin Pressures",
            "Summary": "Avenue Supermarts Ltd., which operates DMart, is set to announce its July-September quarterly results. Analysts expect revenue to rise 15% year-on-year to Rs 16,617.85 crore, driven primarily by 14% growth in store base with eight new stores added during the quarter, bringing total count to 432. However, profitability is expected to face pressure with Ebitda margin likely contracting to 7.5% from 7.6% previously, and net profit projected to fall 1.4% to Rs 650.33 crore. The performance reflects challenges from heavy rains, GST-related disruptions, rising competition from quick commerce players, and higher operating expenses. Sales per square foot growth moderated to around 1% year-on-year, below recent quarterly trends of 2-3%. Brokerages note weakness in general merchandise and apparel segments, with same-store sales growth of 6.5% indicating subdued momentum despite continued store expansion.",
            "Sentiment": "negative",
            "PublishDate": 1759942148335,
            "Source": "earnings"
        },
        {
            "Title": "DMart Shares Fall 1.5% Despite Reporting Strongest Q2 Revenue Growth in Four Years",
            "Summary": "Avenue Supermarts, which operates the DMart retail chain, saw its shares decline 1.5% to Rs 4,350 despite reporting strong quarterly results. The company posted a 15.4% year-on-year increase in standalone revenue for the September quarter, reaching Rs 16,218.79 crore compared to Rs 14,050.32 crore in the previous year. This marks the highest second-quarter revenue in four years and continues the company's trend of double-digit growth for the third consecutive year. DMart currently operates 432 stores across the country. The company's Board of Directors will meet on October 11 to approve detailed financial results for the quarter and half-year period.",
            "Sentiment": "neutral",
            "PublishDate": 1759723115991,
            "Source": "stock"
        },
        {
            "Title": "DMart Q2 Revenue Rises 15.4% to ₹16,219 Crore, Store Count Reaches 432",
            "Summary": "Avenue Supermarts Ltd, which operates D-Mart retail stores, reported standalone revenue of ₹16,218.79 crore for Q2 FY26, compared to ₹14,050.32 crore in the corresponding quarter of FY25. The company operates 432 stores as of September 30, 2025, including one temporarily closed store in Sanpada, Navi Mumbai for reconstruction. In Q1 FY26, the company reported revenue of ₹15,932.12 crore, a 16.2% increase from ₹13,711.87 crore in the same period last year. The company added six net new stores in the first quarter, including an opening in Agra. Avenue Supermarts shares closed at ₹4,420.00, down 0.66% on the BSE.",
            "Sentiment": "positive",
            "PublishDate": 1759501419812,
            "Source": "earnings"
        },
        {
            "Title": "Avenue Supermart Reports 15% Revenue Growth to ₹162 Billion",
            "Summary": "Avenue Supermart reported standalone revenue from operations of ₹162 billion, representing a 15% increase from ₹141 billion in the previous year. The retail company demonstrated solid revenue growth in its latest results.",
            "Sentiment": "positive",
            "PublishDate": 1759499191016,
            "Source": "earnings"
        },
        {
            "Title": "Avenue Supermarts Allots Rs. 200 Crore Commercial Paper with 6% Coupon Rate",
            "Summary": "Avenue Supermarts Limited has allotted commercial paper worth Rs. 200 crores with an 82-day tenure. The instrument carries a 6.00% coupon rate and is rated ICRA A1+. The commercial paper was allotted on October 3, 2025, with a maturity date of December 24, 2025. The unsecured instrument is proposed to be listed on BSE Limited. Payment will be made at maturity on December 24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1759497290834,
            "Source": "corporate_action"
        },
        {
            "Title": "Avenue Supermarts Raises Rs 100 Crore Through Commercial Paper, Opens New Delhi Store",
            "Summary": "Avenue Supermarts Ltd, operator of D-Mart retail chain, raised Rs 100 crore in short-term debt by issuing commercial paper on Monday. The commercial paper carries a 6% coupon rate, matures in 91 days on December 29, 2025, and holds an ICRA A1+ credit rating. The paper is proposed to be listed on BSE. Separately, the company opened a new D-Mart store in New Delhi at Epicah Mall & Business Centre, Moti Nagar on Tuesday, bringing the total store count to 431. Avenue Supermarts is promoted by Radhakishan Damani and his family, operating across Maharashtra, Gujarat, Andhra Pradesh, Madhya Pradesh, Karnataka, Telangana, Chhattisgarh, NCR, Tamil Nadu, Punjab and Rajasthan, retailing basic home and personal products.",
            "Sentiment": "positive",
            "PublishDate": 1759164883635,
            "Source": "stock"
        },
        {
            "Title": "Avenue Supermarts Opens New Store in Anantapur, Takes Total Count to 430",
            "Summary": "Avenue Supermarts Limited opened a new store in Anantapur, Andhra Pradesh on September 25, 2025. With this addition, the company's total store count has reached 430 stores.",
            "Sentiment": "positive",
            "PublishDate": 1758800534558,
            "Source": "stock"
        },
        {
            "Title": "DMart Opens Partnership Opportunities for Suppliers and Property Owners",
            "Summary": "DMart, the Indian supermarket chain owned by Avenue Supermarts Ltd., is inviting business partnerships through its official website. The company offers two partnership models: suppliers can provide quality products like sweets, groceries, or household items to gain shelf space across DMart's locations, while property owners can lease real estate for the company's storage and retail operations. Founded by Radhakishan Damani in 2002, DMart operates on a low-price model by negotiating with suppliers for lower costs and passing savings to customers. The company currently operates in over 70 cities across 11 states including Maharashtra, Gujarat, Andhra Pradesh, and others. Interested suppliers and property owners can apply through DMart's 'Partner With Us' section on their website, where they need to provide basic details and product or property information.",
            "Sentiment": "positive",
            "PublishDate": 1756295843630,
            "Source": "stock"
        },
        {
            "Title": "Avenue Supermarts Sees Rs. 124.64 Crore Block Trade on NSE",
            "Summary": "Avenue Supermarts Ltd. recorded a block trade worth Rs. 124.64 crores on the NSE. The transaction involved approximately 263,299 shares at a price of Rs. 4,733.90 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1756114204033,
            "Source": "order&deals"
        },
        {
            "Title": "Avenue Supermarts Opens New Store in Bikaner, Reaches 429 Total Stores",
            "Summary": "Avenue Supermarts has opened a new store in Bikaner, Rajasthan. With this expansion, the company's total store count has reached 429 locations.",
            "Sentiment": "positive",
            "PublishDate": 1755784086545,
            "Source": "stock"
        },
        {
            "Title": "Avenue Supermarts Sees Rs. 118.64 Crore Block Trade on NSE",
            "Summary": "Avenue Supermarts Ltd. witnessed a block trade worth Rs. 118.64 crores on the National Stock Exchange. The transaction involved approximately 252,672 shares at a price of Rs. 4,695.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1755759738060,
            "Source": "order&deals"
        },
        {
            "Title": "Avenue Supermarts Sees Rs. 48.78 Crore Block Trade on NSE",
            "Summary": "Avenue Supermarts Ltd. witnessed a block trade worth Rs. 48.78 crores on the NSE. The transaction involved approximately 105,737 shares at a price of Rs. 4,612.90 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1755597397709,
            "Source": "order&deals"
        },
        {
            "Title": "Avenue Supermarts Opens New Store in Nagpur, Total Count Reaches 428",
            "Summary": "Avenue Supermarts Limited opened a new store at Umred Road, Nagpur, Maharashtra. With this opening, the company's total store count stands at 428. The company secretary and compliance officer Ashu Gupta communicated this development to the stock exchanges.",
            "Sentiment": "positive",
            "PublishDate": 1755092132845,
            "Source": "stock"
        },
        {
            "Title": "Avenue Supermarts Reports 16.7% Revenue Growth, Plans Accelerated Store Expansion",
            "Summary": "Avenue Supermarts Limited held its annual conference call with analysts and institutional investors. The company reported standalone sales growth of 16.7% with revenue from operations at INR57,790 crores and EBITDA margin of 7.9%. The company opened 50 stores in the last year and recorded 35.3 crore bill cuts with like-for-like growth of 8.4% for stores aged 24 months plus. Managing Director Neville Noronha announced his transition, with Anshul Asawa designated as the incoming CEO. The company plans to accelerate store expansion, particularly focusing on North India including UP market entry. DMart Ready e-commerce business grew 21% despite transitioning from pickup plus home delivery to focused home delivery model. The company maintains its value retail positioning while competing with quick commerce platforms, emphasizing that brick-and-mortar expansion remains a key strategy to counter online competition.",
            "Sentiment": "positive",
            "PublishDate": 1754489663135,
            "Source": "corporate_governance"
        },
        {
            "Title": "Avenue Supermarts Opens New Store in Maharashtra, Total Count Reaches 427",
            "Summary": "Avenue Supermarts Limited opened a new store in Hinganghat, Wardha, Maharashtra. With this addition, the company's total store count has reached 427. The store opening was communicated to stock exchanges NSE and BSE by Company Secretary Ashu Gupta.",
            "Sentiment": "positive",
            "PublishDate": 1753970069565,
            "Source": "stock"
        }
    ]
}