{
    "Symbol": "DMCC",
    "ISIN": "INE505A01010",
    "News": [
        {
            "Title": "DMCC Speciality Chemicals postal ballot for director appointments",
            "Summary": "DMCC Speciality Chemicals issues postal ballot notice seeking shareholder approval for director appointments, remuneration revisions, and constitutional amendments through e-voting from February 13 to March 15, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770826596301,
            "Source": "stocks"
        },
        {
            "Title": "DMCC Speciality Chemicals Q3FY26 Results Announced",
            "Summary": "DMCC Speciality Chemicals reported Q3FY26 results with net sales of ₹15,083.27 lakhs and net profit of ₹616.04 lakhs. Board approved MD re-appointment and governance changes.",
            "Sentiment": "positive",
            "PublishDate": 1770372207384,
            "Source": "co_actions_results"
        },
        {
            "Title": "DMCC Specialty Chemicals Appoints New Independent Director",
            "Summary": "DMCC Specialty Chemicals has appointed Ms. Saloni Jhaveri as an independent director for a five-year term beginning January 10, 2026, strengthening its board composition.",
            "Sentiment": "positive",
            "PublishDate": 1768041659131,
            "Source": "stocks"
        },
        {
            "Title": "DMCC Speciality Chemicals Updates KMP Contact Details",
            "Summary": "DMCC Speciality Chemicals Limited disclosed contact details of four Key Managerial Personnel authorized by the Board for regulatory disclosures under SEBI LODR regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768035350635,
            "Source": "stocks"
        },
        {
            "Title": "DMCC Speciality Chemicals Appoints New Directors",
            "Summary": "DMCC Speciality Chemicals Limited announces key board appointments including Ms. Saloni Jhaveri as Independent Director and Ms. Pallavi Pednekar as Company Secretary effective January 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768034135813,
            "Source": "stocks"
        },
        {
            "Title": "DMCC Speciality Chemicals Appoints New Directors",
            "Summary": "DMCC Speciality Chemicals Limited announces appointment of Ms. Saloni Jhaveri as Non-Executive Independent Director and Ms. Pallavi Pednekar as Company Secretary & Compliance Officer.",
            "Sentiment": "positive",
            "PublishDate": 1768033585836,
            "Source": "stocks"
        },
        {
            "Title": "DMCC Speciality Chemicals Appoints New Director & CS",
            "Summary": "DMCC Speciality Chemicals Limited announced key leadership appointments including Ms. Saloni Jhaveri as Independent Director and Ms. Pallavi Pednekar as Company Secretary effective January 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768033355993,
            "Source": "stocks"
        },
        {
            "Title": "DMCC Speciality Chemicals Company Secretary Resigns to Pursue External Opportunities",
            "Summary": "Sonal Naik has resigned from her position as Company Secretary and Compliance Officer at DMCC Speciality Chemicals Limited, with her last working day being December 16, 2025, to explore opportunities outside the organization. Her resignation will also result in her ceasing to be Key Managerial Personnel under the Companies Act, 2013, while the company searches for a suitable replacement.",
            "Sentiment": "neutral",
            "PublishDate": 1764759639416,
            "Source": "corporate_governance"
        },
        {
            "Title": "Supreme Court Restores DMCC Speciality Chemicals' Ownership of 52-Acre Nalimbi Land",
            "Summary": "The Supreme Court has set aside the forest land classification and restored DMCC Speciality Chemicals' ownership rights over its 52-acre Nalimbi property. This legal victory resolves a land classification dispute that had affected the company's property rights and operational control over the asset.",
            "Sentiment": "positive",
            "PublishDate": 1764633550778,
            "Source": "stock"
        },
        {
            "Title": "DMCC Specialty Chemicals Reports Flat Q2 Revenue at INR 126 Crores Amid Boron Supply Chain Disruptions",
            "Summary": "DMCC Specialty Chemicals reported Q2FY26 revenue of INR 126 crores, flat quarter-on-quarter but 25% higher year-on-year, with profit before tax declining to INR 8.28 crores from INR 11 crores in the previous quarter due to boron business supply chain issues and reduced European exports. The company expects boron business recovery from second half of Q3 onwards after resolving distributor transition challenges that caused 90-100 day lead time delays, while exploring new markets in Latin America and China to replace declining European specialty chemicals demand.",
            "Sentiment": "neutral",
            "PublishDate": 1763358141575,
            "Source": "earnings"
        },
        {
            "Title": "DMCC Speciality Chemicals Reports Q2 FY26 Results with Standalone Net Profit of Rs 775 Lakhs",
            "Summary": "DMCC Speciality Chemicals Limited announced its unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025. The company reported standalone net profit of Rs 775.15 lakhs for Q2 FY26 compared to Rs 580.06 lakhs in the same quarter previous year. For the half-year period, standalone net profit reached Rs 1,350.74 lakhs versus Rs 718.42 lakhs in the corresponding previous period. Total income from operations on standalone basis was Rs 12,633.32 lakhs for the quarter. The consolidated results showed net profit of Rs 775.52 lakhs for the quarter and Rs 1,350.60 lakhs for the half-year. The company noted that planned maintenance shutdown of 21 days at Roha Plant in Q1 FY26 had impacted financial results. The Board meeting was held on November 11, 2025, and statutory auditors have expressed an unmodified review opinion on the results.",
            "Sentiment": "positive",
            "PublishDate": 1762857247221,
            "Source": "earnings"
        },
        {
            "Title": "DMCC Specialty Chemicals Switches Ampyr Contracts and Plans 8.3 Million Rupees Investment",
            "Summary": "DMCC Specialty Chemicals terminated its agreement with Ampyr Renewable Energy Resources Twelve B and signed a new contract with Ampyr Renewable Energy Resources Twelve A. The company also announced plans to invest 8.3 million rupees in Ampyr Renewable Energy.",
            "Sentiment": "neutral",
            "PublishDate": 1754925280935,
            "Source": "order&deals"
        },
        {
            "Title": "DMCC Speciality Chemicals Sets August 22 Record Date for 25% Dividend Payment",
            "Summary": "DMCC Speciality Chemicals Limited has announced August 22, 2025 as the record date for dividend payment of 25% (Rs 2.5 per equity share of Rs 10 each). The dividend recommendation requires approval at the Annual General Meeting scheduled for September 10, 2025. E-voting will commence at 9:00 am on September 7, 2025 and conclude at 5:00 pm on September 9, 2025, with the cut-off date set for September 3, 2025. Dividend payments will be made within 30 days of AGM approval, subject to tax deduction at source, to shareholders whose names appear in the Register of Members on the record date. Physical shareholders must update their KYC details to receive dividend payments, as amounts will be withheld for folios with incomplete KYC information.",
            "Sentiment": "positive",
            "PublishDate": 1754571000836,
            "Source": "corporate_action"
        },
        {
            "Title": "DMCC Speciality Chemicals Reports Strong Q1 Performance with Net Profit Surge",
            "Summary": "DMCC Speciality Chemicals delivered robust quarterly results with net profit jumping to 78 million rupees from 14 million rupees year-over-year. Revenue increased significantly to 1.27 billion rupees compared to 853 million rupees in the same period last year. The company's EBITDA rose to 169 million rupees from 88 million rupees year-over-year, while EBITDA margin improved to 13.29% from 10.36% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754563200541,
            "Source": "earnings"
        },
        {
            "Title": "DMCC Speciality Chemicals Reports Strong Q4 Results and Declares Dividend",
            "Summary": "DMCC Speciality Chemicals has announced its Q4 financial results, showing significant year-over-year growth. The company's revenue increased to 1.25 billion rupees from 840 million rupees in the previous year. EBITDA rose to 151.2 million rupees from 74 million rupees, with the EBITDA margin improving to 12.08% from 8.82%. Net profit for Q4 stood at 64.7 million rupees, up from 58 million rupees year-over-year. The company has also recommended a final dividend of 2.50 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746445544000,
            "Source": "result"
        },
        {
            "Title": "DMCC Speciality Chemicals Reports Significant Q3 EBITDA Growth",
            "Summary": "DMCC Speciality Chemicals has reported a substantial increase in its Q3 EBITDA, rising to 177 million rupees from 71 million rupees year-over-year. The company's EBITDA margin also improved significantly, reaching 15.03% compared to 8.84% in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1739353753000,
            "Source": "earnings"
        },
        {
            "Title": "DMCC Speciality Chemicals Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "DMCC Speciality Chemicals has announced its Q3 financial results, showing substantial year-over-year growth. The company's net profit increased to 79 million rupees, compared to 3 million rupees in the same quarter last year. Revenue also saw a significant rise, reaching 1.2 billion rupees, up from 805 million rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739353590000,
            "Source": "earnings"
        },
        {
            "Title": "DMCC Speciality Chemicals Reports Strong Q2 EBITDA Growth",
            "Summary": "DMCC Speciality Chemicals has reported a significant increase in its Q2 EBITDA, rising to 153 million rupees from 95 million rupees in the same quarter last year. The company's EBITDA margin also improved, reaching 14.89% compared to 12.45% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1730107487000,
            "Source": "result"
        },
        {
            "Title": "DMCC Speciality Chemicals Reports Q2 Revenue Growth",
            "Summary": "DMCC Speciality Chemicals has announced its Q2 revenue of 1 billion rupees, showing an increase from 765 million rupees in the same quarter last year. This represents a year-over-year growth in revenue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1730107409000,
            "Source": "result"
        },
        {
            "Title": "DMCC Speciality Chemicals Reports Significant Profit Growth in Q2",
            "Summary": "DMCC Speciality Chemicals has announced its Q2 financial results, reporting a net profit of 58 million rupees. This represents a substantial increase from the 24 million rupees reported in the same quarter of the previous year, indicating a year-over-year growth in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1730107388000,
            "Source": "result"
        }
    ]
}