{
    "Symbol": "DNAMEDIA",
    "ISIN": "INE016M01021",
    "News": [
        {
            "Title": "Diligent Media Reports Q3FY26 Loss of Rs 29.78 Lakhs",
            "Summary": "Diligent Media Corporation posted a net loss of Rs 29.78 lakhs in Q3FY26 compared to a profit of Rs 254.25 lakhs in Q3FY25, with revenue declining 17.81% to Rs 140.76 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1770812469335,
            "Source": "co_actions_results"
        },
        {
            "Title": "Diligent Media Senior News Editor Resigns",
            "Summary": "Diligent Media Corporation's Associate News Editor Ms. Srishti Choudhury resigned effective January 14, 2026, to pursue career opportunities outside the organization.",
            "Sentiment": "neutral",
            "PublishDate": 1768486096111,
            "Source": "stocks"
        },
        {
            "Title": "Diligent Media Gets ₹33.90 Cr GST Demand Order",
            "Summary": "Diligent Media Corporation receives GST demand order worth ₹33.90 crores from Mumbai tax authorities for alleged non-payment on leasehold rights assignment for FY 2018-19.",
            "Sentiment": "negative",
            "PublishDate": 1768390497951,
            "Source": "stocks"
        },
        {
            "Title": "Diligent Media Reports Loss and Complex Arbitration Settlement in Q2 FY26 Results",
            "Summary": "Diligent Media Corporation reported a net loss after tax for the second quarter and half year ended September 30, 2025, with accumulated losses exceeding paid-up capital and reserves, raising going concern uncertainties. The company received an arbitration award directing settlement of Rs 17,340.27 lakhs intercorporate deposits through cancellation of preference shares held by Veena Investments Private Limited, with auditors issuing a qualified review report.",
            "Sentiment": "negative",
            "PublishDate": 1763139537503,
            "Source": "earnings"
        },
        {
            "Title": "DNA Media Board Approves Scheme to Cancel 4.36 Billion Preference Shares Worth ₹436 Crores",
            "Summary": "DNA Media's Board of Directors approved a Scheme of Reduction of Preference Share Capital involving the reduction and cancellation of 4,36,26,56,265 6% Non-Cumulative, Non-Convertible Redeemable Preference Shares valued at ₹436.26 crores. The scheme provides for payment of ₹173.40 crores (₹0.3975 per share) to be adjusted against Inter Corporate Deposit Agreements, while the remaining ₹262.86 crores (₹0.6025 per share) will be reduced entirely. Post-implementation, the company's share capital will be reorganized from ₹448.03 crores to ₹11.77 crores, comprising only equity shares. The decision was based on an Arbitration Award dated August 20, 2025, and recommendations from the Audit Committee and Committee of Independent Directors. The scheme aims to preserve company liquidity through non-cash settlement, reduce future redemption liability, and bring commercial finality. No changes will occur to equity shareholding patterns or the number of equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1758207235276,
            "Source": "corporate_action"
        },
        {
            "Title": "Diligent Media Reports Loss in Q1 FY26, Appoints New CEO and Senior Management",
            "Summary": "Diligent Media Corporation Limited reported a net loss of Rs 188.60 lakhs for the quarter ended June 30, 2025, compared to a profit of Rs 245.26 lakhs in the same period last year. Revenue from operations declined to Rs 78.67 lakhs from Rs 296.30 lakhs year-over-year. The company's Board approved several key appointments: Chitresh Sehgal as Chief Executive Officer effective August 1, 2025, and elevated Ms. Kusum Lata and Ms. Srishty Choudhury to Senior Management positions. The Board also recommended the re-appointment of Mr. Ronak Jagdish Jatwala as Non-Executive Director, subject to shareholder approval at the Annual General Meeting scheduled for August 26, 2025. The company continues to face challenges with accumulated losses exceeding paid-up capital and reserves, though management maintains adequate liquidity to meet obligations. An ongoing arbitration matter involves inter-corporate deposits of Rs 17,340.27 lakhs with Veena Investments Private Limited, with the Board approving in-principle a setoff proposal against preference shares worth Rs 43,626.56 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1753883769163,
            "Source": "earnings"
        }
    ]
}