{
    "Symbol": "DODLA",
    "ISIN": "INE021O01019",
    "News": [
        {
            "Title": "Dodla Dairy Q3FY26 Results: Profit Jumps 8.2%",
            "Summary": "Dodla Dairy reported Q3FY26 net profit of ₹568.00 million vs ₹537.66 million in Q2FY26. Revenue declined to ₹8,215.26 million from ₹8,545.83 million sequentially.",
            "Sentiment": "positive",
            "PublishDate": 1769520279548,
            "Source": "co_actions_results"
        },
        {
            "Title": "HDFC Small Cap Fund Boosts Dodla Dairy Stake to 6.2%",
            "Summary": "HDFC Small Cap Fund has consistently increased its stake in Dodla Dairy from 3.7% in September to 6.2% in December 2025, signaling growing institutional confidence in the integrated dairy company.",
            "Sentiment": "positive",
            "PublishDate": 1768103694971,
            "Source": "stocks"
        },
        {
            "Title": "Dodla Dairy Wins GST Case, Gets ₹2.03 Cr Relief",
            "Summary": "Karnataka High Court rules in favor of Dodla Dairy on flavored milk GST classification, reducing tax rate from 12% to 5%. Company to reverse ₹2.03 crore provision and receive ₹1.47 crore refund with interest.",
            "Sentiment": "positive",
            "PublishDate": 1767179362193,
            "Source": "stocks"
        },
        {
            "Title": "HDFC Mutual Fund crosses 5% stake in Dodla Dairy",
            "Summary": "HDFC Mutual Fund's aggregate holdings in Dodla Dairy reached 5.34% of paid-up equity share capital as of December 10, 2025, triggering substantial acquisition disclosure requirements under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1765518834862,
            "Source": "mutualfunds"
        },
        {
            "Title": "Dodla Dairy Shareholders Approve Re-appointment of Independent Director Through Postal Ballot",
            "Summary": "Dodla Dairy Limited shareholders passed a special resolution through postal ballot to re-appoint Dr. Raja Rathinam (DIN: 09045647) as Non-executive Independent Director with continuation of his directorship under SEBI regulations. The e-voting process conducted from November 8 to December 7, 2025, saw 5,62,11,764 valid votes cast in favor of the resolution with 100% approval from participating shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1765185693594,
            "Source": "corporate_action"
        },
        {
            "Title": "Dodla Dairy Secures ₹22.24 Crore Tax Refund After Winning Appeal",
            "Summary": "Dodla Dairy successfully won an appeal on tax issues, resulting in a ₹22.24 crore refund for the company. This tax victory provides significant financial relief and improves the dairy firm's cash position.",
            "Sentiment": "positive",
            "PublishDate": 1764411534404,
            "Source": "stock"
        },
        {
            "Title": "Dodla Dairy Seeks Shareholder Approval for Dr. Raja Rathinam's Re-appointment as Independent Director",
            "Summary": "Dodla Dairy Limited has issued a postal ballot notice seeking member approval for the re-appointment of Dr. Raja Rathinam (DIN: 09045647) as a Non-executive Independent Director for a second term of five consecutive years from February 1, 2026 to January 31, 2031. Dr. Rathinam currently serves as Chairman of the Risk Management Committee and Member of the Audit Committee. The company also seeks approval for his continuation as Independent Director under Regulation 17(1A) of SEBI Listing Regulations, as he has attained the age of seventy-five years. The e-voting period runs from 9:00 AM on November 8, 2025 to 5:00 PM on December 7, 2025. Dr. Rathinam holds a doctorate in Dairy Science and has over 41 years of experience in the dairy industry. The Board has recommended his re-appointment based on his strong academic background and expertise in dairy sector, corporate governance, and business transformation. Results will be announced on or before December 9, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762486433241,
            "Source": "corporate_action"
        },
        {
            "Title": "Dodla Dairy Sets Growth Targets for India Operations and OSAM Expansion",
            "Summary": "Dodla Dairy management provided guidance for its business operations during a conference call. For standalone India operations, the company expects 5-6% growth in milk and milk products. For OSAM operations, management aims to scale volumes from 1.2 lakh liters per day to 2 lakh liters per day by FY27 and bring margins to Dodla consolidated level within 2-3 years. The company expects to maintain EBITDA margins between 8-10%.",
            "Sentiment": "positive",
            "PublishDate": 1762400132216,
            "Source": "stock"
        },
        {
            "Title": "Dodla Dairy Reports Quarterly Results and Reappoints Independent Director",
            "Summary": "Dodla Dairy Limited's Board approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company reported revenue from operations of Rs. 3,900.67 million for the quarter and Rs. 7,717.87 million for the half year. The Board also approved the reappointment of Dr. Raja Rathinam as Non-executive Independent Director for a second term of five consecutive years from February 1, 2026 to January 31, 2031, subject to shareholder approval. Dr. Rathinam brings over 41 years of experience in the dairy industry. The statutory auditors S.R. Batliboi Associates LLP issued limited review reports on the financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1762153930319,
            "Source": "corporate_action"
        },
        {
            "Title": "Dodla Dairy Reports Mixed Q2 Results with Revenue Growth but Lower EBITDA",
            "Summary": "Dodla Dairy reported Q2 revenue of 10.2 billion rupees compared to 10 billion rupees in the same quarter last year, showing growth. However, EBITDA declined to 928 million rupees from 962 million rupees year-over-year. The EBITDA margin also compressed to 9.11% from 9.64% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762151280452,
            "Source": "earnings"
        },
        {
            "Title": "Dodla Dairy Reports 3.6% Growth in Quarterly Consolidated Net Profit",
            "Summary": "Dodla Dairy's consolidated net profit increased to 657 million rupees in the second quarter, compared to 634 million rupees in the same period last year, representing a year-over-year growth of 23 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1762150868654,
            "Source": "earnings"
        },
        {
            "Title": "Dodla Dairy Completes 100% Acquisition of HR Food Processing Private Limited",
            "Summary": "Dodla Dairy Limited has completed the acquisition of 100% stake in HR Food Processing Private Limited (OSAM), including both equity shares and compulsory convertible preference shares, making OSAM a wholly owned subsidiary. The acquisition involved purchasing 2,11,152 fully paid-up equity shares of Rs.10 each (representing 100% equity share capital) and 4,99,303 compulsory convertible preference shares of Rs.100 each (representing 100% preference share capital). The transaction was completed for cash consideration, following an earlier intimation dated July 11, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753970161387,
            "Source": "order&deals"
        },
        {
            "Title": "Dodla Dairy Reports Record Revenue of ₹1,007 Crores in Q1 FY26 Despite Margin Pressure",
            "Summary": "Dodla Dairy achieved its highest quarterly revenue of ₹1,007 crores in Q1 FY26, marking 10.5% year-on-year growth. However, EBITDA margin compressed to 8.2% and PAT margin to 6.2% due to early monsoon affecting demand for value-added products like curd, flavored milk, and ice cream. The company's milk procurement reached record levels of 18.7 lakh liters per day, while average procurement costs rose to ₹37.38 per liter from ₹34.15 per liter in the same period last year. Curd sales declined 3.2% year-on-year, and bulk sales of SMP and butter increased to ₹57.7 crores from ₹35.5 crores as the company liquidated inventory amid declining prices. The Africa business grew 26.9% in revenue but saw lower EBITDA margins at 13% due to the new Kenya plant's strategic pricing. Orgafeed business performed strongly with 29.4% revenue growth and 84.4% EBITDA growth, achieving 17.6% margins. The company expects margin improvement in Q2 FY26 as lower procurement prices take effect and has approved acquisition of 100% stake in HR Food Processing (OSAM brand) for expansion in Bihar and Jharkhand markets.",
            "Sentiment": "neutral",
            "PublishDate": 1753426359188,
            "Source": "earnings"
        },
        {
            "Title": "Dodla Dairy Targets 8-10% Profit Growth in FY26 Despite Margin Pressures",
            "Summary": "Dodla Dairy expects revenue growth of 10-15% and profit growth of 8-10% in FY26, according to Managing Director Sunil Reddy. The company reported quarterly revenue of ₹1,006 crore, net profit of ₹62.8 crore, and margins at 8.2%. Gross margins faced pressure due to high procurement costs and seasonal weakness in value-added products, which comprise 36% of revenues. Procurement prices began easing in July, supporting margin recovery expectations without further consumer price increases. The recent Osam Foods acquisition is expected to contribute ₹150-200 crore to topline growth. The company holds 6-7% market share in southern markets and is increasing advertisement spending and hiring to deepen market presence. Current procurement capacity stands at 18 lakh litres per day, with plans to expand to 19-20 lakh litres. The stock trades at ₹1,334.10 with a market capitalization of ₹8,067 crore.",
            "Sentiment": "positive",
            "PublishDate": 1753161585948,
            "Source": "earnings"
        },
        {
            "Title": "Dodla Dairy Faces Margin Pressure in Q1 FY26 Due to Rising Procurement Costs",
            "Summary": "Dodla Dairy experienced margin strain during Q1 FY26 as procurement costs increased at a faster pace than milk prices. The company expects conditions to improve in Q2 with anticipated lower procurement costs.",
            "Sentiment": "negative",
            "PublishDate": 1753155625326,
            "Source": "earnings"
        },
        {
            "Title": "Dodla Dairy Projects 15-20% EBITDA and PAT Growth with Regional Business Expansion",
            "Summary": "Dodla Dairy expects 15-20% growth in absolute EBITDA and PAT, with revenue growth anticipated at 10-15%. The company forecasts its African business to grow in the higher teens, while the Indian business is expected to grow in the lower teens. The Orgafeed segment is also projected to achieve growth in the higher teens.",
            "Sentiment": "positive",
            "PublishDate": 1753154967313,
            "Source": "stock"
        },
        {
            "Title": "Dodla Dairy Reports Q1 Results and Appoints New Senior Management Personnel",
            "Summary": "Dodla Dairy Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs. 9,006.74 million and profit after tax of Rs. 623.64 million for the quarter. Consolidated revenue stood at Rs. 10,068.66 million with profit after tax of Rs. 809.77 million. The Board appointed Mr. Rajani Kumar KVVS as Senior Management Personnel and Head of Production & Maintenance effective July 21, 2025. Kumar brings over 28 years of experience in manufacturing and food technology. The company received dividend of Rs. 122.90 million from subsidiary Dodla Holdings Pte Ltd during the quarter. The Board also approved acquisition of 100% share capital of HR Food Processing Private Limited on July 11, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753096271986,
            "Source": "earnings"
        },
        {
            "Title": "Dodla Dairy Reports Mixed Q1 Results with Revenue Growth but Declining Profitability",
            "Summary": "Dodla Dairy reported Q1 revenue of 10 billion rupees, representing growth from 9.1 billion rupees in the previous year. However, the company's consolidated net profit declined to 629 million rupees from 650 million rupees year-over-year. EBITDA also decreased significantly to 825 million rupees from 1.05 billion rupees, while EBITDA margin compressed to 8.19% from 11.53% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1753076888911,
            "Source": "earnings"
        },
        {
            "Title": "Dodla Dairy: Board Approves ₹271 Crore Acquisition of HR Food Processing",
            "Summary": "Dodla Dairy's board has approved the acquisition of 100% stake in HR Food Processing Pvt Limited for ₹271 crore. The deal involves an enterprise value of ₹247.2 crore plus ₹23.8 crore net cash. The all-cash transaction is expected to complete within 1-2 months, making HR Food a wholly-owned subsidiary of Dodla Dairy.",
            "Sentiment": "positive",
            "PublishDate": 1752221980000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dodla Dairy to Acquire HR Food Processing for ₹271 Crores",
            "Summary": "Dodla Dairy has announced its intention to purchase the entire 100% stake in HR Food Processing Pvt Ltd for ₹271 Crores. This acquisition represents a significant corporate action for Dodla Dairy, potentially expanding its operations or market presence in the dairy industry.",
            "Sentiment": "positive",
            "PublishDate": 1752213493000,
            "Source": "default"
        },
        {
            "Title": "Dodla Dairy: Management Forecasts Sustained 15% Topline Growth",
            "Summary": "Dodla Dairy's management expects to maintain a topline CAGR of ~15% over the medium-term, with clear visibility of double-digit growth for the next four to five years. The company aims to double its revenues during this period. Systematix maintains a 'Buy' rating on the stock.",
            "Sentiment": "positive",
            "PublishDate": 1749131442000,
            "Source": "normal_news"
        },
        {
            "Title": "Dodla Dairy Outlines Growth Strategy and Targets in Concall",
            "Summary": "Dodla Dairy shared updates on its business strategy during a concall. The company is improving its product mix, focusing on ghee and other value-added products. It plans to expand its product reach in India and African territories. Dodla Dairy is targeting an average procurement of 18 lakh liters in FY25-26 in India and 20 lakh liters on a consolidated basis, including Africa. The company expects high double-digit growth rates but does not anticipate a significant jump like last year.",
            "Sentiment": "positive",
            "PublishDate": 1747797837000,
            "Source": "default"
        },
        {
            "Title": "Dodla Dairy Reports Q4 Results and Declares Dividend",
            "Summary": "Dodla Dairy has announced its Q4 financial results and declared a dividend. The company's Q4 revenue increased to 9.1 billion rupees from 7.9 billion rupees year-over-year. EBITDA rose to 835 million rupees from 754 million rupees, though the EBITDA margin decreased slightly to 9.18% from 9.58%. Consolidated net profit for Q4 grew to 680 million rupees from 468 million rupees year-over-year. Additionally, the company has declared a dividend of 2 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747636898000,
            "Source": "result"
        },
        {
            "Title": "Dodla Dairy: Shifting Focus to High-Margin Products for Summer Growth",
            "Summary": "Dodla Dairy anticipates a significant shift towards high-margin products like curd and buttermilk during a potentially hot summer. The company has passed on milk price increases to customers in February and March, with possible further adjustments in FY26. Dodla aims to expand its ghee sales and increase milk production capacity to 25 LLPD from 24 LLPD.",
            "Sentiment": "positive",
            "PublishDate": 1742568672000,
            "Source": "normal_news"
        },
        {
            "Title": "Dodla Dairy Sets Growth Targets for FY25",
            "Summary": "Dodla Dairy has announced its growth targets for the fiscal year 2025. The company aims to achieve a 10% increase in volume growth and a 15% increase in revenue growth. This information was reported by CNBC TV18.",
            "Sentiment": "positive",
            "PublishDate": 1740115065000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dodla Dairy Approves 2.8 Billion Rupees Capital Expenditure for New Plant in Maharashtra",
            "Summary": "Dodla Dairy has approved a capital expenditure of 2.8 billion rupees to establish a new plant and machinery in Maharashtra. This investment indicates the company's plans for expansion and increased production capacity in the region.",
            "Sentiment": "positive",
            "PublishDate": 1738218678000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dodla Dairy Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "Dodla Dairy has announced its financial results for the third quarter, reporting a consolidated net profit of 635 million rupees. This represents a substantial increase from the 413 million rupees reported in the same period last year, indicating strong year-over-year growth for the company.",
            "Sentiment": "positive",
            "PublishDate": 1738218551000,
            "Source": "earnings"
        },
        {
            "Title": "Dodla Dairy Ltd: Large Block Trade on NSE",
            "Summary": "A significant block trade of Dodla Dairy Ltd shares occurred on the National Stock Exchange (NSE). Approximately 200,721 shares were traded at a price of Rs. 1222.60 per share, totaling Rs. 24.54 crores in value.",
            "Sentiment": "neutral",
            "PublishDate": 1732607494000,
            "Source": "block_deals"
        },
        {
            "Title": "Dodla Dairy: Q2 Profit Jumps 45.3%, Declares Rs 3/Share Dividend",
            "Summary": "Dodla Dairy reported a 45.3% YoY increase in Q2 FY25 consolidated PAT to Rs 634 million. Operating revenue grew 29.9% YoY to Rs 9,976 million. The company declared an interim dividend of Rs 3 per share with a record date of October 31, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1729665177000,
            "Source": "result/corporate_action"
        },
        {
            "Title": "Dodla Dairy Declares Interim Dividend",
            "Summary": "Dodla Dairy has announced an interim dividend of 3 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1729659728000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dodla Dairy Reports Significant Revenue Growth in Q2",
            "Summary": "Dodla Dairy has announced its second quarter financial results, reporting a revenue of 10 billion rupees. This represents a substantial increase from the 7.7 billion rupees reported in the same quarter of the previous year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1729659017000,
            "Source": "result"
        },
        {
            "Title": "Dodla Dairy Reports Significant Increase in Q2 Profit",
            "Summary": "Dodla Dairy has announced its Q2 consolidated net profit of 634 million rupees, compared to 436 million rupees in the same period last year, representing a substantial year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729658983000,
            "Source": "result"
        },
        {
            "Title": "Dodla Dairy Acquires Land for Expansion in Maharashtra",
            "Summary": "Dodla Dairy has acquired 35.23 acres of land in Maharashtra as part of its expansion plans. This acquisition indicates the company's intent to grow its operations in the state.",
            "Sentiment": "positive",
            "PublishDate": 1729255186000,
            "Source": "corporate_action"
        }
    ]
}