{
    "Symbol": "DOLATALGO",
    "ISIN": "INE966A01022",
    "News": [
        {
            "Title": "Dolat Algotech Q3FY26 Results: Revenue Drops 9.7%",
            "Summary": "Dolat Algotech reported Q3FY26 revenue of ₹847.99 million, down 9.7% YoY, while net profit declined 4.0% to ₹388.88 million. Board declared interim dividend of ₹0.10 per share.",
            "Sentiment": "negative",
            "PublishDate": 1769606125439,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dolat Algotech Board Meet on Jan 28 for Q3 Results",
            "Summary": "Dolat Algotech Limited has scheduled a board meeting on January 28, 2026, to consider Q3FY26 unaudited financial results and interim dividend declaration for equity shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1768807024436,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dolat Algotech Redeems ₹54.90 Cr Commercial Paper",
            "Summary": "Dolat Algotech Limited successfully completed redemption of Commercial Paper worth ₹54.90 crore on December 30, 2025, as per SEBI Master Circular guidelines for non-convertible securities.",
            "Sentiment": "positive",
            "PublishDate": 1767092826441,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dolat Algotech Reports Sharp Decline in Q2 Financial Performance",
            "Summary": "Dolat Algotech reported consolidated net profit of 45.1 million rupees for Q2, down from 667 million rupees in the same period last year. Revenue fell to 589 million rupees from 1.45 billion rupees year-over-year. EBITDA decreased to 201 million rupees compared to 1.04 billion rupees previously, while EBITDA margin contracted to 34.1% from 71.62% in the prior year period.",
            "Sentiment": "negative",
            "PublishDate": 1762945353224,
            "Source": "earnings"
        },
        {
            "Title": "Dolat Algotech Reports Decline in Q1 Financial Performance",
            "Summary": "Dolat Algotech reported consolidated net profit of 388 million rupees in Q1, down from 717 million rupees in the same period last year. Revenue decreased to 1.1 billion rupees from 1.5 billion rupees year-over-year. EBITDA fell to 650 million rupees compared to 1.1 billion rupees in the previous year, with EBITDA margin declining to 58.77% from 72.63%.",
            "Sentiment": "negative",
            "PublishDate": 1755086428758,
            "Source": "earnings"
        },
        {
            "Title": "Dolat Algotech Reports Q4 Financial Results",
            "Summary": "Dolat Algotech has released its Q4 financial results. The company's EBITDA for Q4 was 686 million rupees, down from 920 million rupees year-over-year. The EBITDA margin decreased to 60.21% from 69.7% in the same period last year. Consolidated net profit for Q4 was 397 million rupees, compared to 681 million rupees year-over-year and 374 million rupees quarter-over-quarter. Q4 revenue stood at 1.13 billion rupees, down from 1.44 billion rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748524879000,
            "Source": "result"
        },
        {
            "Title": "Dolat Algotech Reports Q3 EBITDA Growth with Margin Decline",
            "Summary": "Dolat Algotech announced its Q3 financial results. The company's EBITDA increased to 647 million rupees from 521 million rupees in the same quarter last year, representing year-over-year growth. However, the EBITDA margin decreased to 54.51% from 59.82% compared to the previous year's Q3.",
            "Sentiment": "neutral",
            "PublishDate": 1739262205000,
            "Source": "earnings"
        },
        {
            "Title": "Dolat Algotech Reports Q3 Consolidated Net Profit of 373 Million Rupees",
            "Summary": "Dolat Algotech has announced its Q3 consolidated net profit of 373 million rupees, compared to 414 million rupees in the same quarter last year. This represents a year-over-year decrease in profit.",
            "Sentiment": "neutral",
            "PublishDate": 1739262138000,
            "Source": "earnings"
        },
        {
            "Title": "Dolat Algotech Reports Significant Revenue Growth in Q2",
            "Summary": "Dolat Algotech has announced its Q2 revenue, which stands at 1.5 billion rupees. This represents a substantial increase from the 761 million rupees reported in the same quarter of the previous year, indicating a year-over-year growth of approximately 97%.",
            "Sentiment": "positive",
            "PublishDate": 1731310530000,
            "Source": "result"
        },
        {
            "Title": "Dolat Algotech Reports Strong Q2 Financial Performance",
            "Summary": "Dolat Algotech has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 1.04 billion rupees, up from 453 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 71.63% from 59.53% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1731310496000,
            "Source": "result"
        },
        {
            "Title": "Dolat Algotech Reports Significant Profit Growth in Q2",
            "Summary": "Dolat Algotech has announced its Q2 consolidated net profit of 667 million rupees, showing a substantial increase from 350 million rupees in the same quarter of the previous year. This represents a year-over-year growth of approximately 90.6%.",
            "Sentiment": "positive",
            "PublishDate": 1731310428000,
            "Source": "result"
        }
    ]
}