{
    "Symbol": "DOLLAR",
    "ISIN": "INE325C01035",
    "News": [
        {
            "Title": "Dollar Industries Q3FY26 Results Show Mixed Performance",
            "Summary": "Dollar Industries reported Q3FY26 net profit of ₹1,920.85 lakhs, down from ₹1,945.47 lakhs YoY, while revenue grew 2.75% to ₹38,821.68 lakhs for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770820794965,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dollar Industries Q3FY26 Earnings Call on Feb 12",
            "Summary": "Dollar Industries Limited has scheduled an earnings call for February 12, 2026, at 4:00 pm IST to discuss Q3FY26 financial performance with analysts and institutional investors.",
            "Sentiment": "neutral",
            "PublishDate": 1770120627331,
            "Source": "co_actions_results"
        },
        {
            "Title": "US Dollar Records Significant Single-Day Surge",
            "Summary": "The US dollar achieved its largest one-day gain since May 2025, marking a notable movement in currency markets with significant implications for global trading.",
            "Sentiment": "positive",
            "PublishDate": 1769808404288,
            "Source": "currency"
        },
        {
            "Title": "Trump Comments on Dollar's Recent Performance",
            "Summary": "Trump states he doesn't believe the dollar has declined too much, offering his perspective on the currency's recent performance in global markets.",
            "Sentiment": "neutral",
            "PublishDate": 1769547151409,
            "Source": "currency"
        },
        {
            "Title": "Trump Claims Control Over Dollar Movements",
            "Summary": "Former President Trump makes bold statement about his ability to influence dollar movements, comparing his control to manipulating a yo-yo with precision.",
            "Sentiment": "neutral",
            "PublishDate": 1769547125250,
            "Source": "currency"
        },
        {
            "Title": "Trump Comments on US Dollar Strength",
            "Summary": "Trump makes positive statement about the US dollar's current performance and strength in the market.",
            "Sentiment": "positive",
            "PublishDate": 1769547054010,
            "Source": "currency"
        },
        {
            "Title": "US Dollar Faces Pressure in Early 2026 Market Turmoil",
            "Summary": "The US dollar experiences its largest three-day drop since April amid policy uncertainty, Fed rate cut expectations, and global market volatility as investors reassess greenback stability.",
            "Sentiment": "negative",
            "PublishDate": 1769490109412,
            "Source": "currency"
        },
        {
            "Title": "Dollar heads for worst weekly drop in a year",
            "Summary": "U.S. dollar set for biggest weekly decline in a year amid Trump's Greenland deal and geopolitical tensions. Yen weakens ahead of Bank of Japan policy decision as investors await rate guidance.",
            "Sentiment": "negative",
            "PublishDate": 1769135554524,
            "Source": "currency"
        },
        {
            "Title": "Trump Policies Challenge Dollar's Global Dominance",
            "Summary": "Morgan Stanley analysis reveals Trump's policies on debt, trade, and sanctions could accelerate gradual shift away from US dollar dominance, with gold emerging as strongest challenger.",
            "Sentiment": "neutral",
            "PublishDate": 1769066086074,
            "Source": "global"
        },
        {
            "Title": "Dollar Hits Week Low on Geopolitical Tensions",
            "Summary": "Dollar index slides 0.1% to 99.004 as Trump's tariff threats against EU trigger broad selloff across U.S. stocks and bonds, reviving 'Sell America' trade amid geopolitical uncertainty.",
            "Sentiment": "negative",
            "PublishDate": 1768877425765,
            "Source": "currency"
        },
        {
            "Title": "Dollar weakens as Trump threatens EU tariffs over Greenland",
            "Summary": "US dollar falls against safe-haven currencies as Trump announces 10% tariffs on European goods from Feb 1, demanding Greenland purchase rights. Euro and pound recover from initial lows.",
            "Sentiment": "negative",
            "PublishDate": 1768796030686,
            "Source": "currency"
        },
        {
            "Title": "Dollar Strengthens on Strong US Jobs Data, Fed Cut Hopes Fade",
            "Summary": "The US dollar is set for its third consecutive weekly gain as better-than-expected jobless claims data reduces expectations for Federal Reserve rate cuts. Weekly unemployment claims fell to 198,000, well below the 215,000 forecast.",
            "Sentiment": "positive",
            "PublishDate": 1768530451203,
            "Source": "currency"
        },
        {
            "Title": "Dollar Index Rises 0.3% as CPI Data Supports Fed Policy",
            "Summary": "U.S. dollar strengthened to near one-month high after December CPI data aligned with estimates, reinforcing expectations Fed will maintain current rates despite White House pressure on Powell.",
            "Sentiment": "neutral",
            "PublishDate": 1768356775346,
            "Source": "currency"
        },
        {
            "Title": "Dollar Industries Gets Credit Rating Reaffirmation from Acuite Ratings",
            "Summary": "Acuite Ratings Research Limited reaffirmed Dollar Industries Limited's credit ratings at ACUITE AA- (Stable outlook) for long-term instruments worth Rs 377.94 crores and ACUITE A1+ for short-term instruments worth Rs 0.73 crores. The rating covers the company's bank facilities including cash credit lines from major lenders like State Bank of India, Qatar National Bank, HDFC Bank, Yes Bank, and ICICI Bank with total facilities of Rs 378.67 crores.",
            "Sentiment": "positive",
            "PublishDate": 1765192996712,
            "Source": "corporate_action"
        },
        {
            "Title": "Dollar Industries Receives GST Demand Order Worth Rs 10.95 Lakhs",
            "Summary": "Dollar Industries received a demand order from the Commercial Tax Officer in Tiruppur regarding ITC availed and discrepancies claimed by GST authority, with financial impact of Rs 10.95 lakhs including GST, interest and penalty. The company states there is no material impact on financials or operations and plans to file an appeal under the GST Act before the Commissioner Appeals-GST Appellate Authority.",
            "Sentiment": "neutral",
            "PublishDate": 1764411793927,
            "Source": "stock"
        },
        {
            "Title": "Dollar Industries Reports Strong Q2 FY26 Results with 23.3% EBITDA Growth and Strategic Merger",
            "Summary": "Dollar Industries delivered robust quarterly performance with operating income growing 5.6% to Rs. 471 crores and EBITDA margins expanding 183 basis points to 12.8%, driven by operational leverage and cost optimization. The company announced a strategic merger of nine promoter group companies to eliminate structural overlaps and reduce related party transactions, while maintaining revenue growth guidance of 11-12% for the fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1763554865337,
            "Source": "earnings"
        },
        {
            "Title": "Dollar Industries Reports Strong Q2FY26 Performance with 32.7% PAT Growth",
            "Summary": "Dollar Industries Limited posted operating income of Rs 4,719 million with 5.6% YoY growth in Q2FY26, while profit after tax surged 32.7% YoY to Rs 352 million with margin expansion of 151 bps to 7.4%. The company's Board approved a composite scheme of arrangement to merge nine promoter group companies, including transfer of Dollar brand ownership directly to the listed entity, aimed at enhancing governance and operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1763058499867,
            "Source": "earnings"
        },
        {
            "Title": "Dollar Industries Shares Rise 8% on Merger Plan to Consolidate Nine Promoter Group Companies",
            "Summary": "Dollar Industries Ltd's share price jumped 8% following the announcement of a proposed merger with nine promoter group companies. The merger will consolidate entities that own the Dollar brand, real estate used for operations, and manufacturing units into the listed company. Post-merger, promoter group shareholding is expected to increase from 72.21% to 73.60%. The company expects the consolidation to provide brand ownership, greater production control, streamlined operations, reduced related party transactions, and improved governance. The integration aims to achieve vertical integration by merging manufacturing units, reducing reliance on external vendors and lowering administrative costs. The stock reached Rs 396 before settling at Rs 383.10, representing a 4.72% gain. The stock has declined 24.73% over the past 12 months.",
            "Sentiment": "positive",
            "PublishDate": 1759120459157,
            "Source": "corporate_action"
        },
        {
            "Title": "Dollar Industries Approves Composite Scheme for Demerger and Merger of Nine Companies",
            "Summary": "Dollar Industries Limited's Board of Directors approved a Composite Scheme of Arrangement involving the demerger of Dindayal Texpro Private Limited and merger of eight other companies into Dollar Industries. The scheme includes demerging DTPL's hosiery business undertaking and merging ADDS Projects, Amicable Properties, Bhawani Yarns, Dollar Brands, Goldman Trading, KPS Distributors, PHPL Properties, and Zest Merchants into Dollar Industries. The company will issue 29,80,138 new equity shares to shareholders of the demerged and transferor companies based on specified share exchange ratios. Post-arrangement, promoter shareholding will decrease from 73.60% to 72.21%, while public shareholding will increase from 26.40% to 27.79%. The scheme aims to simplify corporate structure, enhance vertical integration, consolidate the Dollar brand, reduce intercompany transactions, and improve operational efficiencies. All companies involved are part of the promoter group, making this a related party transaction conducted on arm's length basis. The scheme requires approvals from shareholders, regulatory authorities including SEBI, stock exchanges, and other statutory bodies, with an appointed date of April 1, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758888325869,
            "Source": "corporate_action"
        },
        {
            "Title": "Dollar Industries Plans to Evaluate Group Company Reorganization Scheme",
            "Summary": "Dollar Industries has announced plans to evaluate a scheme for arranging its group companies. The company is considering a reorganization structure that would involve its affiliated entities.",
            "Sentiment": "neutral",
            "PublishDate": 1758280033049,
            "Source": "corporate_action"
        },
        {
            "Title": "Dollar Industries Reports 19.6% Revenue Growth to INR 399.13 Crores in Q1 FY26",
            "Summary": "Dollar Industries Limited reported revenue from operations of INR 399.13 crores, marking 19.6% year-over-year growth for the quarter ended June 30, 2025. The company achieved 39.3% growth in profit after tax to INR 21.32 crores with a PAT margin of 5.3%. Volume growth reached 18.7% year-over-year. Modern trade, e-commerce and quick commerce channels showed strong performance with 65.2% value growth and 82% volume growth, contributing 12.2% to total revenue compared to 8.7% last year. The company's Project Lakshya contributed 32% to total revenue but implementation slowed due to market competition. Dollar Industries operates across multiple segments including innerwear, thermal wear, casual wear and athleisure with brands like Bigboss, Dollar Always, and Force NXT. Management expects 11-12% annual growth driven primarily by volume and targets becoming net debt-free by FY28. The company appointed Mahesh Babu as brand ambassador for South India expansion and is exploring export opportunities in African markets and Myanmar.",
            "Sentiment": "positive",
            "PublishDate": 1755599952845,
            "Source": "earnings"
        },
        {
            "Title": "Dollar Industries Targets ₹2,000 Crore Revenue By FY28 Through Premium Strategy",
            "Summary": "Dollar Industries has set a revenue target of ₹2,000 crore by FY28. The company plans to achieve this through premium offerings, athleisure products, and womenswear growth. The strategy includes boosting e-commerce and export sales, along with a brand-focused approach aimed at improving margins and strengthening its position in the innerwear and casual apparel sectors.",
            "Sentiment": "positive",
            "PublishDate": 1754930367972,
            "Source": "stock"
        },
        {
            "Title": "Dollar Industries Reports Strong Q1 Performance with 45% Jump in Net Profit",
            "Summary": "Dollar Industries delivered robust quarterly results with net profit surging to 196 million rupees from 135 million rupees year-over-year, representing a 45% increase. Revenue grew to 3.8 billion rupees compared to 3.2 billion rupees in the same period last year. EBITDA improved to 402 million rupees from 323 million rupees, while EBITDA margin expanded to 10.47% from 10.03% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754917297736,
            "Source": "earnings"
        },
        {
            "Title": "Dollar Industries Schedules Board Meeting on August 11 to Approve Quarterly Financial Results",
            "Summary": "Dollar Industries Limited has scheduled a Board of Directors meeting on August 11, 2025, to consider and approve the unaudited financial results for the quarter ended June 30, 2025. The trading window for company securities remains closed from July 1, 2025, until 48 hours after the results announcement. The meeting will be held at the company's registered office in Kolkata. The trading window closure applies to directors, key managerial personnel, designated persons, employees, connected persons and their immediate relatives.",
            "Sentiment": "neutral",
            "PublishDate": 1753872664596,
            "Source": "corporate_action"
        },
        {
            "Title": "Dollar Industries Announces Dividend",
            "Summary": "Dollar Industries has recommended a dividend of 3 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1747233625000,
            "Source": "result"
        },
        {
            "Title": "Dollar Industries Reports Q4 FY23 Financial Results",
            "Summary": "Dollar Industries has released its Q4 financial results. The company reported an EBITDA of 535 million rupees, down from 545 million rupees year-over-year. The EBITDA margin decreased to 9.97% from 11.15% in the same period last year. Net profit for Q4 stood at 309 million rupees, compared to 320 million rupees year-over-year and 195 million rupees quarter-on-quarter. Revenue for Q4 increased to 5.4 billion rupees from 4.88 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1747233594000,
            "Source": "result"
        },
        {
            "Title": "Dollar Industries Reports Q3 Financial Results",
            "Summary": "Dollar Industries has announced its financial results for the third quarter. The company's net profit increased to 195 million rupees, up from 177 million rupees year-over-year, but down from 264 million rupees quarter-over-quarter. Revenue for Q3 rose to 3.8 billion rupees, compared to 3.3 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739364995000,
            "Source": "earnings"
        },
        {
            "Title": "Dollar Industries to Raise Up to 3.50 Billion Rupees Through Share Issue",
            "Summary": "Dollar Industries has announced plans to raise up to 3.50 billion rupees through the issuance of shares. The company is considering various methods for this fund raise, including a Qualified Institutional Placement (QIP), private placement, or other modes of share issuance.",
            "Sentiment": "positive",
            "PublishDate": 1735806778000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dollar Industries Aims for 65-70% Revenue from Distributors by FY26",
            "Summary": "Dollar Industries' management has announced a strategic goal under Project Lakshya. They expect 65-70% of the company's revenue to come from distributors by the fiscal year 2026. This initiative is projected to drive market share expansion and improve profit margins for the company.",
            "Sentiment": "positive",
            "PublishDate": 1731382919000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dollar Industries Reports Q2 EBITDA Growth",
            "Summary": "Dollar Industries has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 488 million rupees, up from 418 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 10.94% from 10.15% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731331516000,
            "Source": "result"
        },
        {
            "Title": "Dollar Industries Reports Q2 FY24 Financial Results",
            "Summary": "Dollar Industries has announced its financial results for the second quarter of fiscal year 2024. The company reported a net profit of 264 million rupees, compared to 255 million rupees in the same quarter last year, showing a year-over-year increase. Sequentially, the net profit improved from 135 million rupees in the previous quarter. Revenue for Q2 stood at 4.4 billion rupees, up from 4.12 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1731331458000,
            "Source": "result"
        }
    ]
}