{
    "Symbol": "DOLPHIN",
    "ISIN": "INE920A01037",
    "News": [
        {
            "Title": "Dolphin Offshore Q3 Net Profit Drops to ₹133M",
            "Summary": "Dolphin Offshore Enterprises (India) reported a consolidated net profit of ₹133 million in Q3, down from ₹155 million in the same quarter last year, marking a year-on-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1769674854233,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dolphin Offshore Enterprises Reports Strong Q2 Performance with Net Profit of Rs 475.57 Lakhs",
            "Summary": "Dolphin Offshore Enterprises (India) Limited announced its quarterly results for the quarter and half-year ended September 30, 2025. The company reported a net profit of Rs 475.57 lakhs for the quarter, compared to a net loss of Rs 5.75 lakhs in the previous quarter. For the half-year period, net profit reached Rs 933.16 lakhs versus Rs 28.88 lakhs in the corresponding period last year. Revenue from operations stood at Rs 192.46 lakhs for the quarter. The company operates in the Oil & Gas Offshore Support Services segment. On a consolidated basis, the company reported significantly higher profits of Rs 1,560.83 lakhs for the quarter and Rs 2,694.09 lakhs for the half-year. The auditors noted that the company has old trade receivables from the period prior to acquisition through the NCLT resolution process, with current management evaluating their recoverability.",
            "Sentiment": "positive",
            "PublishDate": 1761989487826,
            "Source": "earnings"
        },
        {
            "Title": "Dolphin Offshore Reports Q1 FY26 Results and Announces Key Board Appointments",
            "Summary": "Dolphin Offshore Limited approved its unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs 40.00 lakhs and consolidated revenue of Rs 1,644.30 lakhs for the quarter. Net profit on standalone basis was Rs 124.08 lakhs, while consolidated net profit reached Rs 1,113.26 lakhs. The Board appointed Ms. Aishwarya Parekh as Secretarial Auditor for a 5-year term and Mrs. Shivangi Digant Shah as Additional Non-Executive Independent Director for a 5-year term from July 22, 2025 to July 21, 2030, subject to shareholder approval. The company operates in offshore support services segment, providing integrated services for offshore energy operations including specialized vessels, logistics, and subsea services.",
            "Sentiment": "positive",
            "PublishDate": 1753187917154,
            "Source": "earnings"
        },
        {
            "Title": "Dolphin Offshore Approves Q1 FY2026 Results and Makes Key Leadership Appointments",
            "Summary": "Dolphin Offshore Limited's Board of Directors approved the unaudited financial results for the quarter ended June 30, 2025. The company appointed Ms. Aishwarya Parekh as Secretarial Auditor for a 5-year term, subject to shareholder approval. Parekh is a practicing Company Secretary with over 6 years of experience in Company Law and Securities Market Law. Additionally, Mrs. Shivangi Digant Shah was appointed as Additional Non-Executive Independent Director until the next Annual General Meeting, with recommendation for a 5-year term from July 22, 2025 to July 21, 2030. Shah has over seven years of experience in secretarial and compliance sectors and holds an MBA from Gujarat University. Both appointments are subject to shareholder approval at the upcoming 46th Annual General Meeting.",
            "Sentiment": "positive",
            "PublishDate": 1753186947054,
            "Source": "corporate_action"
        }
    ]
}