{
    "Symbol": "DOMS",
    "ISIN": "INE321T01012",
    "News": [
        {
            "Title": "DOMS Industries Q3FY26 IPO Proceeds Monitoring Report",
            "Summary": "DOMS Industries submits quarterly monitoring report showing Rs 579.21 million utilized during Q3FY26, with Rs 254.20 million remaining unutilized from IPO proceeds of Rs 3,327.24 million.",
            "Sentiment": "neutral",
            "PublishDate": 1770030665461,
            "Source": "co_actions_results"
        },
        {
            "Title": "DOMS Industries Q3FY26 Revenue Grows 18.2% to ₹592.2 Cr",
            "Summary": "DOMS Industries reported strong Q3FY26 results with revenue up 18.2% YoY to ₹592.2 cr and EBITDA growing 17.7% to ₹103.4 cr, maintaining consistent margins at 17.5%.",
            "Sentiment": "positive",
            "PublishDate": 1769778541662,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dom Industries Plans ₹150M Joint Venture Investment",
            "Summary": "Dom Industries announces plans for an initial investment of up to ₹150 million in a new joint venture initiative, marking a significant strategic expansion move for the company.",
            "Sentiment": "positive",
            "PublishDate": 1769776268596,
            "Source": "co_actions_results"
        },
        {
            "Title": "DOMS Industries Grants 137,690 Stock Options to Employees",
            "Summary": "DOMS Industries Limited's Nomination and Remuneration Committee approved grant of 137,690 additional stock options under ESOP 2023 to eligible employees with exercise price of ₹250 per option.",
            "Sentiment": "positive",
            "PublishDate": 1769523241145,
            "Source": "stocks"
        },
        {
            "Title": "DOMS Industries Q3FY26 Results Call on Feb 2",
            "Summary": "DOMS Industries Limited announces conference call with institutional investors and analysts on February 2, 2026 at 16:30 IST to discuss Q3FY26 and nine months financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1769518494263,
            "Source": "co_actions_results"
        },
        {
            "Title": "DOMS Industries Block Trade Worth ₹16.18 Crores",
            "Summary": "DOMS Industries witnessed a significant NSE block trade worth ₹16.18 crores involving 60,564 shares at ₹2,671.70 per share, indicating substantial institutional activity in the stationery manufacturer's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1767590723510,
            "Source": "co_actions_results"
        },
        {
            "Title": "DOMS Industries Reports 24% Revenue Growth Despite GST Transition Disruption in Q2 FY26",
            "Summary": "DOMS Industries achieved consolidated revenue of INR 567.9 crores with 24.1% growth in Q2 FY26, driven by domestic market performance and volume growth across office supplies, despite temporary disruptions from GST 2.0 reforms in September. The company maintained EBITDA margins at 17.5% while progressing on its 44-acre expansion project, expecting first building possession in Q4 FY26 and commercial production from Q1 FY27.",
            "Sentiment": "positive",
            "PublishDate": 1763207206528,
            "Source": "earnings"
        },
        {
            "Title": "DOMS Industries Submits Monitoring Agency Report for IPO Proceeds Utilization",
            "Summary": "DOMS Industries Limited submitted a monitoring agency report from CRISIL Ratings for the quarter ended September 30, 2025, regarding utilization of IPO proceeds. The company raised Rs 3,327.24 million in net proceeds from its December 2023 IPO. During the quarter, Rs 500.34 million was utilized for establishing the proposed project, bringing total utilization to Rs 1,966.58 million with Rs 833.42 million remaining. Additionally, Rs 11.50 million was used for general corporate purposes, specifically for working capital requirements including raw material purchases. The remaining Rs 885.05 million in unutilized proceeds is deployed in fixed deposits with various banks earning returns between 4.75% to 7.40%. CRISIL reported no deviations from disclosed objects and confirmed all utilization aligns with the offer document requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1762929841356,
            "Source": "stock"
        },
        {
            "Title": "DOMS Industries Reports Strong Q2 Performance with 23% Revenue Growth and Strategic Acquisitions",
            "Summary": "DOMS Industries Limited reported consolidated revenue of ₹56,791.06 lakhs for the quarter ended September 30, 2025, compared to ₹46,383.68 lakhs in the same period last year. Net profit increased to ₹6,086.65 lakhs from ₹5,367.49 lakhs year-over-year. For the six-month period, consolidated revenue reached ₹1,13,018.78 lakhs versus ₹91,441.20 lakhs in the previous year, with net profit rising to ₹11,995.61 lakhs from ₹10,797.68 lakhs. The company completed acquisition of 51% stake in Super Treads Private Limited for ₹612.00 lakhs in June 2025, and increased its holding in Pioneer Stationery Private Limited to 57.50% through an additional investment of ₹553.80 lakhs in August 2025. The board also approved allotment of 225 equity shares under the Employee Stock Option Plan 2023 at an exercise price of ₹250 per share. Basic earnings per share stood at ₹9.60 for the quarter and ₹19.02 for the six-month period.",
            "Sentiment": "positive",
            "PublishDate": 1762829562630,
            "Source": "earnings"
        },
        {
            "Title": "Doms Industries Reports 24% Revenue Growth, Expands Manufacturing with 44-Acre Facility",
            "Summary": "Doms Industries reported 24% year-over-year revenue growth with margins of 17.5% in the first half. The company is investing in a 44-acre greenfield facility to increase manufacturing capacity and is scaling exports across more than 55 countries. The company is focusing on new product launches in writing instruments and scholastic stationery segments. Management expects GST 2.0 reforms to drive market consolidation favoring organized players in the industry.",
            "Sentiment": "positive",
            "PublishDate": 1762784657383,
            "Source": "stock"
        },
        {
            "Title": "DOMS Industries Reports Higher Q2 EBITDA Despite Margin Decline",
            "Summary": "DOMS Industries reported Q2 EBITDA of 995 million rupees compared to 859 million rupees in the same period last year, representing year-over-year growth. However, the company's EBITDA margin decreased to 17.53% from 18.8% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762777608015,
            "Source": "earnings"
        },
        {
            "Title": "DOMS Industries Reports 13.6% Growth in Quarterly Net Profit to 583M Rupees",
            "Summary": "DOMS Industries reported consolidated net profit of 583 million rupees compared to 513 million rupees in the same quarter last year, representing a year-over-year increase. The company's revenue grew to 5.7 billion rupees from 4.58 billion rupees in the corresponding period of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762777128019,
            "Source": "earnings"
        },
        {
            "Title": "DOMS Industries Receives Tax Penalty Reduction from ₹35.5 Lakh to ₹17.8 Lakh",
            "Summary": "DOMS Industries Limited disclosed that the Office of the State Tax Officer, State Tax Department, Enforcement South Kashmir has reduced a penalty from ₹35,51,578 to ₹17,75,790. The order was issued under Section 129 and Section 122 of the CGST Act, 2017, alleging 'transporting taxable goods without cover of specified documents.' The penalty demand was reduced from 200% to 100%. The company received the order on October 27, 2025, and stated there is no material impact on its financial operations or other activities. DOMS Industries is evaluating legal remedies and plans to file a response within the prescribed time limit.",
            "Sentiment": "neutral",
            "PublishDate": 1761659233863,
            "Source": "stock"
        },
        {
            "Title": "DOMS Industries Wins GST Appeal, ₹10.72 Crore Demand and Penalty Dropped",
            "Summary": "DOMS Industries Limited successfully appealed against a GST demand notice related to alleged misclassification of goods. The Commissioner of CGST & Central Excise (Appeals), Surat set aside the original order on September 19, 2025. The company had faced a GST demand of ₹5.36 crore along with an equal penalty of ₹5.36 crore plus applicable interest for alleged short payment of GST under the CGST Act. With the appeal being allowed, the entire demand, penalty and interest have been dropped.",
            "Sentiment": "positive",
            "PublishDate": 1758634651648,
            "Source": "stock"
        },
        {
            "Title": "DOMS Industries and Navneet Education Shares in Focus Ahead of Proposed GST Rate Cuts on Stationery Items",
            "Summary": "Shares of DOMS Industries and Navneet Education are expected to be in focus following reports that the Group of Ministers on rate rationalization may propose significant GST rate reductions on stationery products. The proposed changes include cutting GST on erasers from 5% to nil, reducing rates on maps, atlases, pencil sharpeners, pencils, and crayons from 12% to nil, and lowering GST on exercise books from 12% to nil. Mathematical boxes, geometry boxes, and color boxes could see rates reduced from 12% to 5%. The GST Council will make final decisions during its September 3-4 meeting in New Delhi. DOMS Industries manufactures stationery materials including pencils, drawing instruments, and writing products, while Navneet Education operates in educational publishing and stationery products. Navneet Education shares closed unchanged at ₹151.08, gaining 3% in 2025. DOMS Industries shares ended 0.7% lower at ₹2,445, down 10% in 2025 and trading 21% below its 52-week high of ₹3,115.",
            "Sentiment": "positive",
            "PublishDate": 1756425886896,
            "Source": "stock"
        },
        {
            "Title": "DOMS Industries Appoints Five New Directors Through Postal Ballot",
            "Summary": "DOMS Industries Limited announced the appointment of five directors through a postal ballot process. The appointments include Om Santosh Raveshia as Whole-time Director (ordinary resolution) and four Non-Executive Independent Directors: Piyush Mehta, Rohan Ghalla, Harsh Thakkar, and Nitesh Shah (special resolutions). All five resolutions were passed with requisite majority by shareholders. The postal ballot voting was conducted electronically from July 16, 2025 to August 14, 2025, with results scrutinized by CS Shreyans Jain. The company has 71,090 shareholders on record date of July 11, 2025, with voting participation of 93.56% of outstanding shares.",
            "Sentiment": "positive",
            "PublishDate": 1755341257393,
            "Source": "corporate_governance"
        },
        {
            "Title": "DOMS Industries Reports 26.4% Revenue Growth in Q1 FY26 Earnings Call",
            "Summary": "DOMS Industries held an investor conference call on August 11, 2025, discussing quarterly results ended June 30, 2025. The company reported consolidated operating revenues of Rs. 562.3 crores, representing 26.4% growth compared to the same quarter last year, driven by volume growth and marginal price increases due to product mix changes. Sequential growth was 10.5% from Q4 FY25. EBITDA grew 14.3% to Rs. 98.7 crores with margins at 17.6%, while profit after tax stood at Rs. 59.1 crores with 10.5% PAT margin. The company completed acquisition of Super Treads Private Limited to strengthen delivery capabilities in Eastern region. CAPEX of Rs. 70 crores was invested during the quarter, with full year CAPEX expected at Rs. 210-225 crores primarily for the 44-acre project and plant machinery. CFO Rahul Shah confirmed the company maintains its growth guidance of 18-20% for FY26 with EBITDA margins of 16.5-17.5%. Export sales to US represent 5.5-5.8% of gross sales, with potential tariff impacts expected to be offset by growth in other markets and domestic demand. The office supplies segment showed strong 77% year-on-year growth, primarily driven by pen sales.",
            "Sentiment": "positive",
            "PublishDate": 1755155897482,
            "Source": "earnings"
        },
        {
            "Title": "DOMS Industries Shares Surge 12% on Strong Quarterly Results",
            "Summary": "DOMS Industries shares jumped 12% on Monday after reporting quarterly results that exceeded market expectations. The company posted net profit of ₹57.3 crore, up 10.5% year-on-year, while revenue grew 26.4% to ₹562 crore. EBITDA increased 13.8% to ₹98.3 crore, though margins compressed to 17.5% from 19.4% in the same period last year. The core stationery business grew 18%, with additional growth from the recently acquired Uniclan business. Management projects consolidated sales growth of 18-20% and EBITDA margin of 16.5-17.5% for FY26E. JM Financial maintained a 'Buy' rating with price target of ₹2,845, while ICICI Securities kept an 'Add' rating but reduced price target to ₹2,550 from ₹2,675. The company is expanding pencil manufacturing capacity and targeting growth through new product categories including toys, bags, and baby care.",
            "Sentiment": "positive",
            "PublishDate": 1754896443510,
            "Source": "earnings"
        },
        {
            "Title": "DOMS Industries Plans Expansion Through New Facility, Acquisitions, and FILA Partnership",
            "Summary": "DOMS Industries is pursuing an aggressive growth strategy that includes establishing a 44-acre mega facility, making strategic acquisitions, and partnering with FILA for global market expansion. The company is also expanding its product range and production capacity to meet increasing domestic and export demand.",
            "Sentiment": "positive",
            "PublishDate": 1754665853721,
            "Source": "stock"
        },
        {
            "Title": "DOMS Industries Reports 22.6% Revenue Growth in Q1 FY26, Net Profit Rises 12.8%",
            "Summary": "DOMS Industries announced its quarterly results for the period ended June 30, 2025. The company's standalone revenue from operations increased to ₹50,769.78 lakhs compared to ₹41,381.71 lakhs in the same quarter last year. Net profit grew to ₹5,546.12 lakhs from ₹4,916.94 lakhs year-over-year. On a consolidated basis, revenue reached ₹56,227.72 lakhs versus ₹44,501.17 lakhs in the previous year, while consolidated net profit was ₹5,910.20 lakhs compared to ₹5,430.25 lakhs. The company acquired 51% equity shares in Super Treads Private Limited for ₹612.00 lakhs, making it a subsidiary from June 1, 2025. The board set September 15, 2025, as the record date for final dividend eligibility for FY 2024-25 and scheduled the 19th Annual General Meeting for September 22, 2025. Basic earnings per share on a standalone basis was ₹9.14 compared to ₹8.10 in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1754658359578,
            "Source": "earnings"
        },
        {
            "Title": "DOMS Industries Reports 10.6% Growth in Q1 Net Profit to 573M Rupees",
            "Summary": "DOMS Industries reported Q1 consolidated net profit of 573 million rupees compared to 518 million rupees in the same period last year. Revenue increased to 5.6 billion rupees from 4.5 billion rupees year-over-year. EBITDA rose to 988 million rupees from 864 million rupees, though EBITDA margin declined to 17.56% from 19.42% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754656790280,
            "Source": "earnings"
        },
        {
            "Title": "DOMS Industries Extends Deadline for Pioneer Stationery Stake Acquisition to December 2025",
            "Summary": "DOMS Industries Limited has extended the deadline for acquiring an additional 13% stake in its subsidiary Pioneer Stationery Private Limited from July 31, 2025 to December 31, 2025. The extension was mutually agreed upon between the Gala Group Shareholders and DOMS Industries. The acquisition involves purchasing the stake from certain existing shareholders of Pioneer Stationery. All other terms and conditions of the original acquisition agreement remain unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1753956627910,
            "Source": "corporate_action"
        },
        {
            "Title": "DOMS Industries: Q4 Results Show Growth, ICICI Securities Adjusts Target",
            "Summary": "DOMS Industries reported Q4 revenue growth of 26% YoY, with Ebitda up 16.2% and PAT increasing 7.3%. Excluding Uniclan acquisition, organic revenue growth was 13.4%. Gross margins remained flat, but Ebitda margin contracted 146 bps due to higher expenses. ICICI Securities maintains 'Add' rating but lowers target price.",
            "Sentiment": "neutral",
            "PublishDate": 1747918491000,
            "Source": "earnings"
        },
        {
            "Title": "DOMS Industries: Acquires 51% Stake in Super Treads, Reports Strong FY25 Results",
            "Summary": "DOMS Industries to acquire 51% stake in Super Treads Private Limited for ₹6.12 crore. FY25 consolidated revenue up 24.4% to ₹1,912.6 crore, PAT up 33.7% to ₹213.5 crore. Q4 FY25 revenue grew 26% to ₹508.7 crore. Final dividend of ₹3.15 per share proposed. New facility construction underway, expected operational by Q3 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1747750962000,
            "Source": "corporate_action"
        },
        {
            "Title": "Doms Industries: Q4 Profit Up 7.2%, Revenue Surges 26%",
            "Summary": "Doms Industries reported Q4 FY2025 consolidated net profit of Rs 48.4 crore, up 7.2% YoY. Revenue increased 26% to Rs 509 crore. The company recommended a final dividend of Rs 3.15 per share and appointed Om Santosh Raveshia as whole-time director. Doms also approved a 51% stake investment in Super Treads Pvt.",
            "Sentiment": "positive",
            "PublishDate": 1747661855000,
            "Source": "earnings"
        },
        {
            "Title": "DOMS Industries to Acquire 51% Stake in Super Treads",
            "Summary": "DOMS Industries has announced plans to invest up to 61.2 million rupees to acquire a 51% stake in Super Treads. This strategic investment represents a significant corporate action for DOMS Industries, potentially expanding its business portfolio or market presence.",
            "Sentiment": "positive",
            "PublishDate": 1747657935000,
            "Source": "default"
        },
        {
            "Title": "DOMS Industries Recommends Dividend of 3.15 Rupees per Share",
            "Summary": "DOMS Industries has recommended a dividend of 3.15 rupees per equity share. No additional details about the dividend period or company performance were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747655627000,
            "Source": "result"
        },
        {
            "Title": "DOMS Industries Reports Q4 Financial Results",
            "Summary": "DOMS Industries has released its Q4 financial results. The company's EBITDA for Q4 was 883 million rupees, compared to 759 million rupees in the same quarter last year. The EBITDA margin decreased to 17.35% from 18.81% year-over-year. The consolidated net profit for Q4 was 484 million rupees, up from 452 million rupees year-over-year, but down from 507 million rupees quarter-over-quarter. Q4 revenue increased to 5.1 billion rupees from 4.04 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1747655582000,
            "Source": "result"
        },
        {
            "Title": "DOMS Industries to Consider Q4 Results on May 19",
            "Summary": "DOMS Industries has announced that it will consider its fourth quarter (Q4) financial results on May 19. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747225769000,
            "Source": "default"
        },
        {
            "Title": "Doms Industries Acquires 13% Stake in Pioneer Stationery",
            "Summary": "Doms Industries has approved the acquisition of a 13.0% stake in Pioneer Stationery. This strategic move likely aims to expand Doms Industries' market presence or product portfolio in the stationery sector.",
            "Sentiment": "positive",
            "PublishDate": 1743120678000,
            "Source": "corporate_action"
        },
        {
            "Title": "DOMS Industries Approves Acquisition of 13% Stake in Pioneer Stationery",
            "Summary": "DOMS Industries has approved the acquisition of a 13.0% stake in Pioneer Stationery. This strategic move indicates DOMS Industries' intent to expand its presence in the stationery sector, potentially leading to increased market share and diversification of its product portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1743083085000,
            "Source": "corporate_action"
        },
        {
            "Title": "DOMS Industries: Expansion and Diversification Drive Growth",
            "Summary": "DOMS Industries shows resilience with 8% stock gain since Q3 results. The company is expanding capacity, diversifying product lines through acquisition, and forming international partnerships. Q3 revenue grew 35% YoY to ₹501.1 crore, with Uniclan acquisition contributing 10%. EBITDA margin at 17.5%, above guidance. Exports declined due to Middle East tensions. DOMS outperforms peers in stock performance.",
            "Sentiment": "positive",
            "PublishDate": 1741653724000,
            "Source": "normal_news"
        },
        {
            "Title": "Doms Industries Reports Strong Q3 Financial Results",
            "Summary": "Doms Industries has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 507 million rupees, up from 373 million rupees in the same quarter last year. This also represents a quarter-on-quarter increase from 513 million rupees. Revenue for Q3 reached 5 billion rupees, compared to 3.72 billion rupees in the previous year, indicating substantial top-line growth.",
            "Sentiment": "positive",
            "PublishDate": 1738627990000,
            "Source": "earnings"
        },
        {
            "Title": "DOMS Industries Reports Q3 EBITDA Growth",
            "Summary": "DOMS Industries has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 879 million rupees, up from 693 million rupees in the same quarter of the previous year. However, the EBITDA margin decreased to 17.54% from 18.66% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738592187000,
            "Source": "earnings"
        },
        {
            "Title": "DOMS Industries Reports Strong Q3 Financial Performance",
            "Summary": "DOMS Industries has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 507 million rupees, up from 373 million rupees in the same quarter last year. Quarter-on-quarter, net profit decreased slightly from 513 million rupees. Revenue for Q3 reached 5 billion rupees, a substantial increase from 3.72 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738592117000,
            "Source": "earnings"
        },
        {
            "Title": "DOMS Industries: Q3 Results Announcement and Earnings Call Scheduled",
            "Summary": "DOMS Industries to announce Q3 FY25 results on February 3, 2025. Earnings call with investors set for February 4 at 12 noon. Q2 FY25 saw 42.8% increase in net profit and 19.7% growth in revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1738316764000,
            "Source": "corporate_action"
        },
        {
            "Title": "DOMS Industries: Shares Surge 105% in 2024, Trading 233% Above IPO Price",
            "Summary": "DOMS Industries' stock has risen 105% year-to-date, now trading at ₹2,572 from ₹1,250. The company's shares are 233% above the IPO price of ₹790. Axis Securities maintains a 'buy' rating with a new target price of ₹3,120. The Indian stationery market is projected to grow at a 13% CAGR from FY23 to FY28.",
            "Sentiment": "positive",
            "PublishDate": 1734952184000,
            "Source": "normal_news"
        },
        {
            "Title": "Doms Industries: Italian Promoter FILA Group Reduces Stake by 4.56%",
            "Summary": "FILA Group, through its affiliate FILA Fabbrica Italiana Lapis Ed Affini SPA, sold 27.7 lakh shares (4.56% stake) of Doms Industries for Rs 798.54 crore. The sale aims to increase free float and enhance liquidity. Axis Mutual Fund acquired 1.21% equity for Rs 211.4 crore. FILA Group intends to maintain its position as the largest shareholder and 'relevant shareholder' status.",
            "Sentiment": "neutral",
            "PublishDate": 1734629248000,
            "Source": "block_deals"
        },
        {
            "Title": "DOMS Industries Limited: FILA Initiates 4.57% Stake Sale",
            "Summary": "Italian stationery maker FILA has begun selling up to 4.57% of its stake in DOMS Industries Limited through an accelerated book-building process. The sale aims to increase free float and improve share liquidity. FILA's stake will reduce from 30.58% to no less than 26.01%, maintaining its position as the largest shareholder. DOMS shares fell 5.4% to Rs 2,891.55 on BSE following the announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1734583660000,
            "Source": "corporate_action"
        },
        {
            "Title": "DOMS Industries Ltd Block Trade: 2.79 Million Shares Sold for Rs. 807.82 Crores",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) involving DOMS Industries Ltd. Approximately 2,785,586 shares of the company were traded at a price of Rs. 2,900.00 per share, resulting in a total transaction value of Rs. 807.82 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1734579995000,
            "Source": "block_deals"
        },
        {
            "Title": "DOMS Industries: Lock-in Period Ends and Potential Block Deal on Horizon",
            "Summary": "DOMS Industries' one-year shareholder lock-in period ends today, freeing up 45% of outstanding equity for trading. Additionally, a block deal worth ₹764 crore is expected, with F.I.L.A likely selling up to 4.5% equity at a floor price of ₹2,755 per share, a 9.6% discount to Wednesday's closing price.",
            "Sentiment": "neutral",
            "PublishDate": 1734565120000,
            "Source": "block_deals"
        },
        {
            "Title": "F.I.L.A. to Potentially Sell 3.05% Stake in DOMS Industries",
            "Summary": "F.I.L.A. is likely to sell a 3.05% stake in DOMS Industries through block deals, with a floor price set at ₹2,755 per share. The deal has an upsize option of an additional 1.52%. The base size of the deal is ₹509.7 crore, with a potential total size of ₹764 crore if the upsize option is exercised.",
            "Sentiment": "neutral",
            "PublishDate": 1734530503000,
            "Source": "block_deals"
        },
        {
            "Title": "DOMS Industries Reports Strong Q2 EBITDA Growth",
            "Summary": "DOMS Industries has reported a significant increase in its Q2 EBITDA, rising from 652 million rupees to 859 million rupees year-over-year. The company's EBITDA margin also improved, increasing from 17% to 18.8% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731237617000,
            "Source": "result"
        },
        {
            "Title": "DOMS Industries Reports Strong Q2 Financial Results",
            "Summary": "DOMS Industries has announced its Q2 financial results, showing significant year-over-year growth. The company's consolidated net profit increased from 360 million rupees to 513 million rupees. Revenue also saw a substantial rise, growing from 3.82 billion rupees to 4.58 billion rupees compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731237607000,
            "Source": "result"
        }
    ]
}