{
    "Symbol": "DONEAR",
    "ISIN": "INE668D01028",
    "News": [
        {
            "Title": "Donear Industries Q3FY26 Results & Compliance Update",
            "Summary": "Donear Industries announced Q3FY26 financial results for quarter ended December 31, 2025. Company paid Rs.48,600 fine each to BSE and NSE for regulatory non-compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1770628616009,
            "Source": "co_actions_results"
        },
        {
            "Title": "Donear Industries Shareholders Approve Appointment of Two Independent Directors Through Postal Ballot",
            "Summary": "Donear Industries Limited shareholders approved the appointment of Mrs. Harjeet Kaur Joshi and Mr. Hemant Raghunath Bharambe as Additional Non-Executive Independent Directors through remote e-voting postal ballot process concluded on November 27, 2025. Both resolutions passed with requisite majority, with 39,568,183 votes in favor for the first appointment and 39,560,683 votes for the second, strengthening the company's board governance structure.",
            "Sentiment": "positive",
            "PublishDate": 1764330765334,
            "Source": "corporate_action"
        },
        {
            "Title": "Donear Industries Board Approves Q2 & H1 FY26 Financial Results",
            "Summary": "Donear Industries Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025, during their meeting held on November 13, 2025. The statutory auditors ML Bhuwaania And Co LLP issued an unmodified opinion on the financial results, with the company's financial statements showing detailed asset, liability, and cash flow positions for both standalone and consolidated operations.",
            "Sentiment": "neutral",
            "PublishDate": 1763049940931,
            "Source": "earnings"
        },
        {
            "Title": "Donear Industries Reports Strong Q2 Performance with 17% Net Profit Growth",
            "Summary": "Donear Industries delivered robust quarterly results with net profit rising to 124M rupees from 106M rupees year-over-year, while revenue increased to 2.37B rupees from 2.1B rupees. The company's EBITDA surged to 303.6M rupees from 217.7M rupees, with EBITDA margin expanding to 12.82% from 10.38%, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1763047726216,
            "Source": "earnings"
        },
        {
            "Title": "Donear Industries Independent Director Govind Shrikhande Completes Tenure",
            "Summary": "Donear Industries Limited announced that Govind Shrikhande (DIN: 00029419) completed his second term of one year as an Independent Director and ceased to hold the position effective November 10, 2025. The Board of Directors expressed appreciation and gratitude for Shrikhande's extensive contribution and stewardship during his tenure. The cessation was due to completion of his tenure as an Independent Director.",
            "Sentiment": "neutral",
            "PublishDate": 1762839140263,
            "Source": "corporate_governance"
        },
        {
            "Title": "Donear Industries Seeks Shareholder Approval for Two Independent Director Appointments via Postal Ballot",
            "Summary": "Donear Industries Limited has issued a postal ballot notice seeking shareholder approval for the appointment of two independent directors. The company proposes to appoint Mrs. Harjeet Kaur Joshi (DIN: 07085755) as an independent director for a five-year term from October 18, 2025 to October 17, 2030, and Mr. Hemant Raghunath Bharambe (DIN: 05154422) as an independent director for five years from November 11, 2025 to November 10, 2030. Both appointments were recommended by the Nomination and Remuneration Committee and approved by the Board on October 18, 2025. The e-voting period runs from October 29, 2025 (9:00 AM) to November 27, 2025 (5:00 PM), with results to be declared by December 1, 2025. Mrs. Joshi brings 39 years of finance experience and previously served as Managing Director of The Shipping Corporation of India Ltd. Mr. Bharambe is a textile engineer with 43 years of experience in the textile and garment industry. Both directors will be entitled to sitting fees and profit-related commission as approved by members.",
            "Sentiment": "neutral",
            "PublishDate": 1761550408068,
            "Source": "corporate_governance"
        },
        {
            "Title": "Donear Industries Appoints Two New Independent Directors to Board",
            "Summary": "Donear Industries Limited appointed Mrs. Harjeet Kaur Joshi and Mr. Hemant Raghunath Bharambe as additional non-executive Independent Directors. Mrs. Joshi's five-year term begins October 18, 2025, while Mr. Bharambe's term starts November 11, 2025, both ending in 2030. The appointments were approved by the Board based on recommendations from the Nomination and Remuneration Committee and are subject to shareholder approval within three months. Mrs. Joshi is a Fellow Cost and Management Accountant with 39 years of finance experience and previously served as managing director of The Shipping Corporation of India Ltd. Mr. Bharambe is a Textile Engineer with 43 years of experience in the textile and garment industry. Both directors have no relationships with existing board members and are not debarred from holding directorial positions.",
            "Sentiment": "positive",
            "PublishDate": 1760788127534,
            "Source": "corporate_governance"
        },
        {
            "Title": "Donear Industries Approves Quarterly Results, Announces Key Leadership Changes and Dividend",
            "Summary": "Donear Industries approved its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025, at a board meeting held on August 14, 2025. The statutory auditors issued a limited review report with an unmodified opinion on the financial results. The company announced several key changes: Mrs. Sejal Shah resigned as Company Secretary effective August 14, 2025. The board approved the appointment of M/s M. L. Bhuwania & Co. LLP as statutory auditors for five years from the 39th AGM to the 44th AGM, and M/s Yogesh Sharma & Co as secretarial auditors for FY 2025-26 to FY 2029-30, both subject to shareholder approval. The company scheduled its 39th Annual General Meeting for September 27, 2025, via video conferencing. The board declared a dividend of Rs. 0.20 per equity share (10% on face value of Rs. 2) for FY 2024-25, with September 20, 2025 as the record date and payment by October 27, 2025, subject to shareholder approval and applicable tax deductions.",
            "Sentiment": "neutral",
            "PublishDate": 1755191897131,
            "Source": "earnings"
        },
        {
            "Title": "Donear Industries Reports Mixed Q1 Results with Improved Margins Despite Revenue Decline",
            "Summary": "Donear Industries reported quarterly results showing EBITDA of 212 million rupees compared to 206 million rupees in the same period last year. The company's EBITDA margin improved to 10.79% from 10.37% year-over-year. Net profit remained flat at 88 million rupees compared to the previous year's 88 million rupees. However, revenue declined to 1.96 billion rupees from 1.99 billion rupees in the corresponding period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1755188568318,
            "Source": "earnings"
        },
        {
            "Title": "Donear Industries Reports Q4 Financial Results",
            "Summary": "Donear Industries has released its Q4 financial results. The company's EBITDA decreased to 133 million rupees from 297.5 million rupees year-over-year. The EBITDA margin fell to 5.17% from 12.26% compared to the same period last year. Net profit for Q4 was 16 million rupees, down from 159 million rupees year-over-year and 109 million rupees quarter-on-quarter. Revenue for Q4 increased to 2.57 billion rupees from 2.43 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748357044000,
            "Source": "result"
        },
        {
            "Title": "Donear Industries Reports Improved Q2 EBITDA and Margin",
            "Summary": "Donear Industries has announced its Q2 financial results, showing an increase in EBITDA from 155 million rupees to 218 million rupees year-over-year. The company's EBITDA margin also improved, rising from 9.11% to 10.38% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731506983000,
            "Source": "result"
        },
        {
            "Title": "Donear Industries Reports Strong Q2 Financial Results",
            "Summary": "Donear Industries has announced its Q2 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's net profit increased to 106 million rupees, up from 49 million rupees in the same quarter last year and 88 million rupees in the previous quarter. Revenue also saw growth, reaching 2.1 billion rupees compared to 1.7 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731506917000,
            "Source": "result"
        }
    ]
}