{
    "Symbol": "DPABHUSHAN",
    "ISIN": "INE266Y01019",
    "News": [
        {
            "Title": "D P Abhushan Q3FY26 Revenue Grows 13% YoY to ₹1,222 Cr",
            "Summary": "D P Abhushan Limited reports strong Q3FY26 performance with 13% revenue growth, EBITDA surge of 89% YoY, and PAT jumping 96% despite elevated gold prices impacting industry volumes.",
            "Sentiment": "positive",
            "PublishDate": 1769239217294,
            "Source": "co_actions_results"
        },
        {
            "Title": "D. P. Abhushan Expects Selective Demand Impact",
            "Summary": "D. P. Abhushan anticipates selective near-term demand changes following recent price adjustments in their product portfolio.",
            "Sentiment": "neutral",
            "PublishDate": 1769181559146,
            "Source": "stocks"
        },
        {
            "Title": "D.P. Abhushan Q3FY26 Earnings Call on January 24",
            "Summary": "D.P. Abhushan Limited announces Q3FY26 results on January 23, 2026, followed by management earnings call on January 24 at 13:00 hrs IST to discuss quarterly performance.",
            "Sentiment": "neutral",
            "PublishDate": 1768896385002,
            "Source": "co_actions_results"
        },
        {
            "Title": "D.P. Abhushan Gets Credit Rating Reaffirmation",
            "Summary": "CARE Ratings reaffirmed D.P. Abhushan's CARE A- stable rating for bank facilities worth ₹339.95 crores, citing strong operational track record and healthy growth despite competitive industry challenges.",
            "Sentiment": "positive",
            "PublishDate": 1767943318613,
            "Source": "stocks"
        },
        {
            "Title": "D.P. Abhushan Limited Announces Investor Roadshows and Strong FY25 Performance",
            "Summary": "D.P. Abhushan Limited will participate in roadshows and investor meetings, sharing an investor presentation highlighting market opportunities and business performance. The company reported strong FY25 results with 42% YoY revenue growth to Rs 3,312 crores, 73% EBITDA growth to Rs 175 crores, and 82% PAT increase to Rs 113 crores, driven by wedding demand and strategic expansion including new showrooms in Ajmer, Neemuch, and a second Ratlam location.",
            "Sentiment": "positive",
            "PublishDate": 1764666929827,
            "Source": "stock"
        },
        {
            "Title": "D.P. Abhushan Reports 105% Jump in Q2 PAT Despite 4% Revenue Decline",
            "Summary": "D.P. Abhushan Limited reported quarterly results showing revenue from operations at ₹967.65 crore, down 4% year-on-year but up 79% quarter-on-quarter. The company achieved profit after tax of ₹51.46 crore, up 105% year-on-year, with PAT margin improving to 5.32% from 2.50% in the previous year. EBITDA increased 99% year-on-year to ₹75.80 crore with margins at 7.83%. The company experienced a 20% volume decline in the first half due to elevated gold prices impacting consumer demand. However, management reported 40% growth in October sales and projects 20-25% revenue growth for the full year. Gold contributed 91% of revenue, while silver grew 103% year-on-year. The company operates stores across Central India including Ratlam, Indore, Bhopal, Ujjain, Udaipur, Kota, Ajmer, and Neemuch. Management announced plans for 2-3 new store openings during the financial year and expects to launch an e-commerce platform before year-end. The company granted 62,300 employee stock options and has a QIP process underway.",
            "Sentiment": "positive",
            "PublishDate": 1762968839320,
            "Source": "earnings"
        },
        {
            "Title": "D.P. Abhushan Reports 99% EBITDA Growth Despite Gold Price Surge in Q2FY26",
            "Summary": "D.P. Abhushan Limited delivered strong quarterly results with EBITDA rising 99% year-on-year to ₹75.80 crore and Profit After Tax increasing 105% to ₹51.46 crore. PAT margin improved by 282 basis points to 5.32%. The company achieved record festive sales of ₹237 crore during Navratri and Dussehra 2025, registering 85% year-on-year growth across gold, silver, diamond, and other jewellery categories. Performance came despite challenging market conditions with gold prices surging nearly 45% year-on-year and 8% quarter-on-quarter, surpassing ₹100,000 per 10 grams in retail markets. The company expanded its retail footprint by opening new showrooms in Ajmer, Neemuch, and a second store in Ratlam. D.P. Abhushan operates 11 stores across Madhya Pradesh and Rajasthan, with plans to raise up to ₹600 crores through QIP route for further expansion into Gujarat, Chhattisgarh and other regions.",
            "Sentiment": "positive",
            "PublishDate": 1762421870145,
            "Source": "earnings"
        },
        {
            "Title": "D.P. Abhushan Limited Grants 62,300 Employee Stock Options Under ESOP-2024 Plan",
            "Summary": "D.P. Abhushan Limited's Nomination and Remuneration Committee approved the grant of 62,300 employee stock options under the company's Employee Stock Option Plan 2024. The options are exercisable into equity shares with a face value of Rs. 10 each. The vesting schedule spans 4 years with 25% vesting annually starting from the first year after grant letter issuance. The ESOP-2024 will be administered by the Nomination and Remuneration Committee, and the committee may impose lock-in provisions on allotted equity shares for up to five years from allotment date, with exceptions for cases of death or permanent disability.",
            "Sentiment": "positive",
            "PublishDate": 1762290944630,
            "Source": "corporate_action"
        },
        {
            "Title": "D.P. Abhushan Reports 105% Jump in Q2 Net Profit Despite Revenue Decline",
            "Summary": "D.P. Abhushan reported net profit of 515 million rupees for Q2, representing a significant increase from 251 million rupees in the same period last year. However, revenue declined to 9.7 billion rupees from 10 billion rupees year-over-year. The company's EBITDA doubled to 757 million rupees from 380 million rupees, while EBITDA margin expanded substantially to 7.82% from 3.8% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762152770451,
            "Source": "earnings"
        },
        {
            "Title": "D.P. Abhushan Reports 85% Growth in Festive Sales",
            "Summary": "D.P. Abhushan reported an 85% year-over-year growth in festive sales during Navratri and Dussehra 2025. The jewelry retailer experienced significant sales growth during the festive period compared to the same period in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1760014070524,
            "Source": "stock"
        },
        {
            "Title": "D.P. Abhushan Reports 7% Revenue Growth to ₹541 Crore in Q1 FY26, Plans ₹600 Crore QIP for Expansion",
            "Summary": "D.P. Abhushan Limited reported quarterly revenue of ₹541 crore compared to ₹505 crore in the same period last year, marking 7% year-on-year growth. EBITDA increased 44% to ₹55 crore with a margin of 10.21%, while Profit After Tax grew 45% to ₹36 crore with a 6.73% margin. Gold jewellery contributes 91% of sales, diamonds 6%, and silver 3%. The company operates 11 stores and plans to raise ₹600 crore through QIP for expansion. Strong performance came from Udaipur (+20% YoY), Banswara (+13% YoY), and Kota (+11% YoY) stores, along with contributions from newly launched stores in Ajmer, Neemuch, and Ratlam's second showroom. The company targets opening 6 stores in FY26 and aims to reach 50 stores by FY2030. Management expects revenue of ₹4,500 crore in FY26 and ₹6,000 crore in FY27. High gold prices impacted industry demand with volume decline of 10-12%, though wedding and festive buying provided market stability.",
            "Sentiment": "positive",
            "PublishDate": 1754400442867,
            "Source": "earnings"
        },
        {
            "Title": "D.P. Abhushan Limited Reports 45% Jump in Quarterly Profit to ₹36.4 Crore",
            "Summary": "D.P. Abhushan Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The jewelry company reported a profit of ₹36.4 crore compared to ₹25.1 crore in the previous year's same quarter, marking a 45% increase. Revenue from operations declined to ₹540.4 crore from ₹504.7 crore year-over-year. Basic earnings per share stood at ₹16.07 versus ₹11.27 in the corresponding quarter last year. The company operates in the gems and jewelry segment, including wholesale, retail trade, and manufacturing of jewelry and ornaments. Total expenses for the quarter were ₹492.7 crore. The results were reviewed by the Audit Committee and approved by the Board in meetings held on July 29, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753771654295,
            "Source": "earnings"
        },
        {
            "Title": "D.P. Abhushan Reports 45% Jump in Q1 Net Profit to Rs 364 Million",
            "Summary": "D.P. Abhushan reported quarterly net profit of Rs 364 million compared to Rs 251 million in the same period last year. The company's revenue increased to Rs 5.4 billion from Rs 5 billion year-over-year. EBITDA rose to Rs 543 million from Rs 382 million, while EBITDA margin improved to 10.1% from 7.58% in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753771254959,
            "Source": "earnings"
        },
        {
            "Title": "D.P. Abhushan Limited Schedules Q1FY26 Earnings Call for July 30, 2025",
            "Summary": "D.P. Abhushan Limited will announce its Q1FY26 results on July 29, 2025, followed by an earnings call on July 30, 2025 at 16:30 hrs IST. The 60-minute call will feature management representatives including Mr. Anil Kataria (Whole Time Director), Mr. Santosh Kataria (Managing Director), and Mr. Vikas Kataria (Promoter). The company operates 11 showrooms across various Indian cities and offers jewelry products in gold, silver, diamond, and platinum. The earnings call will allow investors to discuss the company's quarterly performance and financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1753449213660,
            "Source": "earnings"
        },
        {
            "Title": "DP Abhushan Reports Improved Q4 Financial Results",
            "Summary": "DP Abhushan has announced its Q4 financial results. The company's revenue increased to 7.2 billion rupees from 5.6 billion rupees year-over-year. EBITDA rose to 420 million rupees from 243 million rupees, with the EBITDA margin improving to 5.85% from 4.36%. Net profit for the quarter grew to 252 million rupees from 162 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747376637000,
            "Source": "result"
        },
        {
            "Title": "D.P. Abhushan Expands Presence with New Showroom in Ratlam",
            "Summary": "D.P. Abhushan has inaugurated its second showroom in Ratlam, Madhya Pradesh, as part of its expansion strategy in Central India. This new outlet strengthens the company's retail presence in the region and demonstrates its commitment to growth in key markets.",
            "Sentiment": "positive",
            "PublishDate": 1743994861000,
            "Source": "corporate_action"
        },
        {
            "Title": "D.P. Abhushan Reports Strong Q3 EBITDA Growth",
            "Summary": "D.P. Abhushan has reported significant year-over-year improvements in its third quarter financial results. The company's EBITDA increased to 548 million rupees from 288 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 5.05% from 3.76% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738908234000,
            "Source": "earnings"
        },
        {
            "Title": "D.P. Abhushan Reports 42% Revenue Growth in Q3",
            "Summary": "D.P. Abhushan Limited has reported a significant increase in its third-quarter revenue. The company's revenue for Q3 reached 10.8 billion rupees, compared to 7.6 billion rupees in the same period last year, representing a year-over-year growth of approximately 42%.",
            "Sentiment": "positive",
            "PublishDate": 1738908143000,
            "Source": "earnings"
        },
        {
            "Title": "D.P. Abhushan Reports Significant Increase in Q3 Net Profit",
            "Summary": "D.P. Abhushan Limited has reported a substantial year-over-year increase in its third-quarter net profit. The company's net profit for Q3 reached 373 million rupees, compared to 167 million rupees in the same period last year, marking a significant growth in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1738908105000,
            "Source": "earnings"
        },
        {
            "Title": "D.P. Abhushan Reports Significant EBITDA Growth in Q2",
            "Summary": "D.P. Abhushan, a jewelry company, has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 382 million rupees, up from 219 million rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 3.8% from 4% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730099420000,
            "Source": "result"
        },
        {
            "Title": "D.P. Abhushan Reports Strong Q2 Revenue Growth",
            "Summary": "D.P. Abhushan, a jewelry company, has reported a significant increase in its second quarter revenue. The company's revenue for Q2 reached 10 billion rupees, compared to 5.5 billion rupees in the same period last year, representing a year-over-year growth of approximately 82%.",
            "Sentiment": "positive",
            "PublishDate": 1730099375000,
            "Source": "result"
        },
        {
            "Title": "D.P. Abhushan Reports Significant Profit Growth in Q2",
            "Summary": "D.P. Abhushan, a jewelry company, has reported a substantial increase in its second-quarter net profit. The company's net profit rose to 251 million rupees, compared to 133 million rupees in the same quarter of the previous year, marking a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730099345000,
            "Source": "result"
        }
    ]
}