{
    "Symbol": "DPWIRES",
    "ISIN": "INE864X01013",
    "News": [
        {
            "Title": "DP Wires Board Meet Set for Feb 14 to Review Q3FY26",
            "Summary": "DP Wires Limited has scheduled a board meeting for February 14, 2026, to consider Q3FY26 unaudited financial results and approve related party transactions for FY 2026-27.",
            "Sentiment": "neutral",
            "PublishDate": 1770715277639,
            "Source": "co_actions_results"
        },
        {
            "Title": "DP Wires Limited Reports Quarterly Results and Reduces Director Remuneration",
            "Summary": "DP Wires Limited approved unaudited financial results for the quarter and half year ended September 30, 2025, showing quarterly profit of INR 119.50 lakhs. The board reduced annual remuneration for Managing Director Praveen Kataria and Whole-time Director Arvind Kataria from INR 84 lakhs to INR 60 lakhs each for financial year 2025-2026.",
            "Sentiment": "neutral",
            "PublishDate": 1763174724144,
            "Source": "earnings"
        },
        {
            "Title": "DP Wires Limited Approves Unaudited Financial Results for Quarter Ended June 30, 2025",
            "Summary": "DP Wires Limited held a board meeting on August 14, 2025, where directors considered and approved the company's standalone unaudited financial results for the quarter ended June 30, 2025. The meeting took place at the company's Industrial estate location in Ratlam from 4:30 PM to 5:00 PM. Along with the financial results, the company also approved a limited review report from auditors. The company has submitted these documents to both BSE and NSE as required under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1755174392684,
            "Source": "earnings"
        },
        {
            "Title": "D P WIRES Reports Q4 Financial Results",
            "Summary": "D P WIRES has announced its quarterly financial results. The company's Q4 net profit is 40 million rupees, compared to 98 million rupees year-over-year and 50 million rupees quarter-over-quarter. The Q4 revenue is reported at 1.37 billion rupees, down from 2.1 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1748618545000,
            "Source": "result"
        },
        {
            "Title": "D P WIRES Reports Decline in Q3 Profit and Revenue",
            "Summary": "D P WIRES has reported a decrease in both net profit and revenue for the third quarter. The company's net profit fell to 50 million rupees from 63 million rupees in the same period last year. Revenue also declined significantly, dropping to 1.5 billion rupees from 2.52 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739540075000,
            "Source": "earnings"
        },
        {
            "Title": "D.P. WIRES Reports Significant Decline in Q2 EBITDA",
            "Summary": "D.P. WIRES has reported a substantial decrease in its Q2 EBITDA, dropping from 105 million rupees in the previous year to 36 million rupees in the current quarter. The company's EBITDA margin also declined from 3.83% to 2.46% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731601868000,
            "Source": "result"
        },
        {
            "Title": "D.P. WIRES Reports Decline in Q2 Profit and Revenue",
            "Summary": "D.P. WIRES has reported a decrease in both net profit and revenue for the second quarter compared to the same period last year. The company's net profit fell to 61 million rupees from 91 million rupees, while revenue declined to 1.5 billion rupees from 2.7 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731601799000,
            "Source": "result"
        }
    ]
}