{
    "Symbol": "DRCSYSTEMS",
    "ISIN": "INE03RS01027",
    "News": [
        {
            "Title": "DRC Systems Files Q3FY26 Fund Utilization Report",
            "Summary": "DRC Systems India Limited confirms no deviation in Rs. 25 crore preferential issue fund utilization for Q3FY26, with funds deployed as per original allocation across working capital and debt repayment.",
            "Sentiment": "neutral",
            "PublishDate": 1770210601750,
            "Source": "stocks"
        },
        {
            "Title": "DRC Systems Q3 FY26 Results: Revenue Jumps 60% YoY",
            "Summary": "DRC Systems India Limited reports strong Q3 FY26 performance with consolidated revenue rising 60% YoY to ₹2,718.3 lakhs and net profit growing 41% YoY to ₹499.0 lakhs, driven by operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1770190258697,
            "Source": "co_actions_results"
        },
        {
            "Title": "DRC Systems Invests $1M in EMEA Expansion",
            "Summary": "DRC Systems approves up to $1 million investment in DRC Systems EMEA LLC to strengthen Middle East presence and expand IT services operations in the region.",
            "Sentiment": "positive",
            "PublishDate": 1767595606826,
            "Source": "stocks"
        },
        {
            "Title": "DRC Systems Reports 41% Revenue Growth in Q2 FY2026 with Strong International Expansion",
            "Summary": "DRC Systems India Limited announced its quarterly results for the quarter and six months ended September 30, 2025. On a consolidated basis, the company reported revenue from operations of INR 2,283.2 lakhs for Q2, representing 41% year-over-year growth. For the six-month period, revenue reached INR 4,112.4 lakhs, up 31% year-over-year. Net profit for Q2 was INR 416.7 lakhs (27% growth) while six-month net profit stood at INR 851.4 lakhs (20% growth). EBITDA margins were 28% for Q2 and 32% for the six-month period. The IT services and software consultancy company operates across India, Middle East, and the United States, serving clients globally with approximately 200 employees. Managing Director Hiten Barchha highlighted strong domestic performance and encouraging momentum from expanding businesses in the Middle East and United States. The company is integrating Artificial Intelligence across its development and delivery operations to enhance efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1762763665769,
            "Source": "earnings"
        },
        {
            "Title": "DRC Systems Raises Rs 25 Crores Through Preferential Share Allotment",
            "Summary": "DRC Systems India Limited allotted 1 crore equity shares to Shiv Minechem on a preferential basis at Rs 25 per share, raising Rs 25 crores. The shares have a face value of Re 1 each with a premium of Rs 24 per share. Following this allotment, the company's paid-up equity share capital increased from 13.41 crore shares to 14.41 crore shares. The allotment was approved by the Securities Allotment Committee and follows a special resolution passed at the Annual General Meeting held on September 25, 2025. The newly allotted shares will be listed on BSE and NSE and will be subject to lock-in requirements.",
            "Sentiment": "positive",
            "PublishDate": 1761652443993,
            "Source": "corporate_action"
        },
        {
            "Title": "DRC Systems India Approves Rs. 25 Crore Preferential Issue to Shiv Minechem and Reappoints Three Independent Directors",
            "Summary": "DRC Systems India Limited's board approved a preferential issue of 1 crore equity shares at Rs. 25 per share to Shiv Minechem, raising Rs. 25 crores. The shares have a face value of Re. 1 each with a premium of Rs. 24 per share. Post-allotment, Shiv Minechem will hold 6.94% stake in the company. The board also approved reappointment of three independent directors - Mr. Keyur Jagdishchandra Shah, Mr. Jigar Pradipchandra Shah, and Ms. Dipti Abhijeet Chitale - for second terms of five years each, effective December 2025. Additionally, the company approved increasing authorized share capital from Rs. 15 crores to Rs. 17.50 crores and scheduled its 13th Annual General Meeting for September 25, 2025. All decisions are subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1756192076285,
            "Source": "corporate_action"
        },
        {
            "Title": "DRC Systems India Reports 19% Revenue Growth in Q1 FY26, Secures NPCI Project",
            "Summary": "DRC Systems India Limited reported consolidated revenue from operations of INR 1,829.2 lakhs for the quarter ended June 30, 2025, marking a 19% year-on-year growth. Net profit increased 13% year-on-year to INR 434.7 lakhs, while EBITDA grew 23% to INR 649.2 lakhs with margins at 35%. The company secured a Learning Experience Platform development project from National Payments Corporation of India (NPCI), which will include AI-enabled LXP, mobile application, and advanced coding platform. The project will be executed in phases with integration to global learning platforms like Udemy and O'Reilly Media. DRC Systems operates in IT and IT-enabled services including web and mobile app development, maintenance, and testing services across three countries with approximately 200 employees.",
            "Sentiment": "positive",
            "PublishDate": 1754895632272,
            "Source": "earnings"
        },
        {
            "Title": "DRC Systems to Acquire 50.1% Stake in Inexture Solutions",
            "Summary": "DRC Systems has announced plans to acquire a 50.1% stake in Inexture Solutions. This acquisition will result in Inexture Solutions becoming a subsidiary of DRC Systems.",
            "Sentiment": "positive",
            "PublishDate": 1750144351000,
            "Source": "default"
        }
    ]
}