{
    "Symbol": "DREAMFOLKS",
    "ISIN": "INE0JS101016",
    "News": [
        {
            "Title": "DreamFolks Q3 FY26 Investor Call Scheduled",
            "Summary": "DreamFolks Services announces investor presentation for Q3 FY26 results on February 09, 2026 at 18:30 IST, highlighting strategic acquisitions and business transformation initiatives.",
            "Sentiment": "neutral",
            "PublishDate": 1770641031235,
            "Source": "co_actions_results"
        },
        {
            "Title": "DreamFolks Acquires 60% Stake in Dubai-Based Airport Services Platform EasytoTravel",
            "Summary": "DreamFolks Services Limited acquired a 60.24% stake in EasytoTravel (ETT), a Dubai-based airport services distribution platform with operations across 120 countries and 500 airports. The acquisition enhances DreamFolks' global expansion capabilities by integrating ETT's international network, advanced technology stack, and partnerships with major industry players including Amadeus, Sabre, Emirates and Turkish Airlines.",
            "Sentiment": "positive",
            "PublishDate": 1764575367946,
            "Source": "order&deals"
        },
        {
            "Title": "Dreamfolks Services Reports 35% Revenue Decline in Q2FY26 Amid Strategic Business Transition",
            "Summary": "Dreamfolks Services reported revenue of ₹205.5 crores in Q2FY26 compared to ₹316.9 crores in Q2FY25, with the company discontinuing its domestic airport lounge program while expanding global operations to 900 touchpoints. The company acquired 50.01% stake in Ten11 Hospitality for ₹11.46 crores to enter railway lounge operations and expects further revenue impact in coming quarters as it transitions to new business streams including global lounges, premium lifestyle services, and railway infrastructure.",
            "Sentiment": "negative",
            "PublishDate": 1763563052302,
            "Source": "earnings"
        },
        {
            "Title": "DreamFolks Services Outlines Multi-Year Growth Strategy With Global Expansion and Diversification Plans",
            "Summary": "DreamFolks Services has announced plans to expand its global lounge network to over 2,000 locations while scaling partnerships with fintechs and airlines for contactless travel solutions. The company is diversifying into rail and airport concierge services, targeting 20-25% revenue CAGR with margin expansion through value-added offerings including spa and F&B integration.",
            "Sentiment": "positive",
            "PublishDate": 1763137022966,
            "Source": "stock"
        },
        {
            "Title": "DreamFolks Reports Q2FY26 Results with Revenue of Rs 2,055 Million and Acquires Ten11 Hospitality",
            "Summary": "DreamFolks Services recorded quarterly revenue of Rs 2,055 million with gross profit of Rs 292 million (14.2% margin) and PAT of Rs 112 million (5.5% margin), expanding margins across all levels versus last year. The travel and lifestyle experience company acquired Ten11 Hospitality LLP to vertically integrate railway lounge operations at Chennai, Mumbai, and Vadodara locations, strengthening partnerships and reducing third-party dependencies.",
            "Sentiment": "negative",
            "PublishDate": 1763117334153,
            "Source": "earnings"
        },
        {
            "Title": "Dreamfolks Services Acquires Majority Stake in Ten11 Hospitality LLP",
            "Summary": "Dreamfolks Services Limited has completed the acquisition of a 50.01% partnership stake in Ten11 Hospitality LLP from its existing partners. Following this acquisition, Ten11 Hospitality LLP has become a subsidiary of Dreamfolks Services. The company disclosed this information to stock exchanges BSE and NSE on November 10, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762815120766,
            "Source": "corporate_action"
        },
        {
            "Title": "Dreamfolks Services to Acquire 50.01% Stake in Ten11 Hospitality LLP for INR 11.46 Crore",
            "Summary": "Dreamfolks Services Limited's Board of Directors approved a proposal to invest up to INR 11.46 crore to acquire a 50.01% partnership stake in Ten11 Hospitality LLP from existing partners. Upon completion, Ten11 Hospitality LLP will become a subsidiary of Dreamfolks Services. The acquisition aims to consolidate and strengthen Dreamfolks' value chain over its existing railway lounge service operations by acquiring one of its key current service partners. Ten11 Hospitality LLP operates premium lounges and will provide physical infrastructure and assets at key railway stations. The company was incorporated on September 11, 2019, and reported a turnover of INR 8.65 crore for FY2024-25, compared to INR 2.15 crore in FY2023-24 and INR 59.9 lakh in FY2022-23. The consideration will be paid through cash via online banking channels. The acquisition does not fall within related party transactions, and no promoter group companies have any interest in the entity being acquired.",
            "Sentiment": "positive",
            "PublishDate": 1762753745255,
            "Source": "order&deals"
        },
        {
            "Title": "Dreamfolks Services Shares Surge 40% in Seven Sessions Following Strategic Partnership Announcements",
            "Summary": "Dreamfolks Services shares rose 15% on Monday, marking the fifth consecutive trading session of gains and achieving a 40% increase over seven sessions. Trading volumes reached over 15 lakh shares compared to the 20-day average of 95,000 shares. The surge follows several strategic announcements: a collaboration with The Card Company to launch 'Alpha', India's first premium wallet integrating travel and lifestyle privileges; the introduction of DreamFolks Club Memberships at Global Fintech Fest 2025; and a partnership with WSFx Global Pay Ltd. to enhance travel payment services. The company discontinued domestic airport lounge services to clients on September 16 while maintaining other services. Earlier this year, multiple clients terminated lounge service contracts following pressure from airport operators entering the same business. CEO Liberatha Peter Kallat attributed client losses to pressure tactics by airport operators. Shares closed at ₹144.7, remaining 70% below the 52-week high of ₹469.9.",
            "Sentiment": "positive",
            "PublishDate": 1760335098041,
            "Source": "stock"
        },
        {
            "Title": "DreamFolks Services Partners With WSFx Global Pay to Enhance Travel Benefits for Indian Customers",
            "Summary": "DreamFolks Services announced a strategic alliance with WSFx Global Pay at the Global Fintech Festival 2025. The partnership will integrate travel services into GlobalPay's system, offering premium airport lounge access and enhanced travel benefits specifically for Indian customers.",
            "Sentiment": "positive",
            "PublishDate": 1759915633398,
            "Source": "order&deals"
        },
        {
            "Title": "Dreamfolks Services Partners with The Card Company to Launch India's First Premium Wallet 'Wallet α'",
            "Summary": "Dreamfolks Services has collaborated with The Card Company to introduce 'Wallet α', described as India's first premium wallet. The partnership aims to make elite travel, lifestyle, and entertainment benefits accessible to a broader audience through this new digital wallet offering.",
            "Sentiment": "positive",
            "PublishDate": 1759908758281,
            "Source": "stock"
        },
        {
            "Title": "DreamFolks Services Launches Club Memberships at Global Fintech Fest 2025",
            "Summary": "DreamFolks Services introduced exclusive DreamFolks Club memberships at Global Fintech Fest 2025. The memberships offer travel, lifestyle, and wellness services across three levels, with pricing ranging from ₹10,000 to ₹50,000.",
            "Sentiment": "positive",
            "PublishDate": 1759828003926,
            "Source": "stock"
        },
        {
            "Title": "Dreamfolks Shares Drop 5% for Second Day After Exiting Domestic Airport Lounges Business",
            "Summary": "Dreamfolks Services shares fell 5% to Rs 124.51 for the second consecutive session after announcing its immediate exit from the domestic airport lounges business. The company discontinued access to domestic airport lounges for clients, stating the impact is material, while other domestic services and global lounge business continue. This follows Travel Food Services terminating its contract to provide lounge access services to Dreamfolks customers effective September 15. The company has faced three order terminations recently, with Adani Digital, Semolina Kitchen and Encalm Hospitality discontinuing certain services last month. Major airport operators including Adani Airports and GMR Airports are now offering their own platforms, bypassing intermediaries like Dreamfolks. The company's shares are down nearly 70% year-to-date.",
            "Sentiment": "negative",
            "PublishDate": 1758175182474,
            "Source": "stock"
        },
        {
            "Title": "Dreamfolks Services Discontinues Domestic Airport Lounge Services with Material Impact",
            "Summary": "Dreamfolks Services Limited has discontinued domestic airport lounge services to its clients effective September 16, 2025. The company stated this discontinuation will have a material impact on its operations. Other domestic services and global lounge business will continue operating normally. The company emphasized that contracts with clients remain active and discussions are ongoing regarding alternative customer value propositions for affected clients.",
            "Sentiment": "negative",
            "PublishDate": 1758032167337,
            "Source": "stock"
        },
        {
            "Title": "Travel Food Services Terminates Airport Lounge Contract with DreamFolks, Effective September 2025",
            "Summary": "Travel Food Services announced the termination of its extended airport lounge access services agreement with DreamFolks Services, effective September 15, 2025, following unsuccessful attempts to renegotiate commercial terms. The company plans to engage directly with banks and networks through its subsidiary Eliteassist Technology. This follows a broader trend of partners distancing from DreamFolks, with Adani Airports launching its own lounge platform and reports indicating Adani Digital, Semolina Kitchens, and Encalm Hospitality have also discontinued services. Major operators including Adani Airport Holdings, GMR Airports, and TFS manage 80-85% of airport lounge traffic, with DreamFolks serving as third-party aggregator. ICICI Bank, Axis Bank, and Mastercard are reportedly considering disassociation. DreamFolks shares have declined almost 50% since June and 70% over one year. The company previously faced disruptions affecting 49 lounges at 34 airports, which led to threats of legal action from Travel Food Services.",
            "Sentiment": "negative",
            "PublishDate": 1757038646845,
            "Source": "stock"
        },
        {
            "Title": "Dreamfolks Services Reports 8.8% Revenue Growth to ₹349 Crores in Q1 FY26 Despite Banking Client Shifts",
            "Summary": "Dreamfolks Services delivered revenue of ₹349 crores for the quarter ended June 30, 2025, marking 8.8% year-on-year growth. Adjusted EBITDA increased 18.7% to ₹30 crores with margin of 8.7%, while PAT grew 24% to ₹21 crores. The company served 2.58 million passengers during the quarter. Two banks have shifted portions of their lounge programs away from Dreamfolks' platform, though contracts remain in place with some programs continuing. Management indicated other banking clients may face similar pressure. The company is accelerating diversification beyond airport lounges, targeting services like golf, railway lounges, wellness packages, and coffee at malls to contribute approximately one-third of total revenue. Non-lounge services currently represent 7% of revenue, similar to the previous quarter. Dreamfolks operates 850+ lounges globally and has onboarded over 40 new enterprise clients in the past year. The company is exploring strategic partnerships and acquisitions while expanding internationally in Southeast Asia and Middle East markets.",
            "Sentiment": "neutral",
            "PublishDate": 1755177329845,
            "Source": "earnings"
        },
        {
            "Title": "Dreamfolks Services Reports Strong Q1 Growth with Revenue Rising to 3.5 Billion Rupees",
            "Summary": "Dreamfolks Services delivered robust quarterly performance with revenue increasing to 3.5 billion rupees from 3.21 billion rupees year-over-year. The company's net profit grew to 222 million rupees compared to 182 million rupees in the same period last year. EBITDA improved to 278 million rupees from 241 million rupees, while EBITDA margin expanded to 7.97% from 7.51% year-over-year, indicating enhanced operational efficiency alongside revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1754561959796,
            "Source": "earnings"
        },
        {
            "Title": "Dreamfolks Services: Major Stakeholders Sell Rs 169 Crore Worth of Shares",
            "Summary": "Bajaj Finance, Motilal Oswal Mutual Fund, and HRTI Pvt Ltd sold a combined 841,181 shares of Dreamfolks Services in block deals worth Rs 169.13 crore. The stock price plunged 12% following the news.",
            "Sentiment": "negative",
            "PublishDate": 1751642297000,
            "Source": "block_deals"
        },
        {
            "Title": "DreamFolks Services Ltd: Share Price Drops 4% Amid Program Terminations",
            "Summary": "DreamFolks Services Ltd's share price settled 4% lower, marking the third consecutive session of losses. The decline follows announcements of program closures with Axis Bank and ICICI Bank, effective July 1, 2025. The company is evaluating the potential impact of these closures. DreamFolks' stock has fallen 44.44% year-to-date and 54.97% over the past 12 months.",
            "Sentiment": "negative",
            "PublishDate": 1751539427000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dreamfolks Services Ltd: Shares Fall as Adani Airports CEO Challenges Business Model",
            "Summary": "Dreamfolks Services shares dropped 6% after Adani Airports CEO stated lounge access no longer needs middlemen. Dreamfolks CEO accused airport operators of pressuring clients to switch services. The company announced closures of certain programmes with private lenders from July 1, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1751533107000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dreamfolks Services: CEO Criticizes Airport Operators' Pressure Tactics",
            "Summary": "Dreamfolks Services CEO Liberatha Peter Kallat accuses major airport operators of using pressure tactics to force clients to sign directly with them, affecting lounge access programs for Axis Bank and ICICI Bank. Dreamfolks maintains contracts are still active and other services unaffected. The company operates in 70+ lounges, with airport operators controlling only 35-40% of lounges.",
            "Sentiment": "negative",
            "PublishDate": 1751439572000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dreamfolks Services: Program Closures May Impact Financials",
            "Summary": "Dreamfolks Services announced the closure of certain programs for private lenders like Axis Bank and ICICI Bank from July 1, 2025. The company warns of a potential material impact on its financials, though contracts with these clients remain valid. Dreamfolks is evaluating the impact and committed to mitigating it.",
            "Sentiment": "negative",
            "PublishDate": 1751421807000,
            "Source": "corporate_action"
        },
        {
            "Title": "DreamFolks Services Ltd: Chairperson Refutes Reports of Major Clients Parting Ways",
            "Summary": "DreamFolks Chairperson Liberatha Kallat denies receiving any communication from major clients about ending partnerships, despite reports causing stock volatility. Kallat attributes recent business slowdown to changes in program structure, seasonal factors, and recent airport incidents. She expects 20% topline growth and improved margins of 14-16% in coming years.",
            "Sentiment": "neutral",
            "PublishDate": 1750419200000,
            "Source": "normal_news"
        },
        {
            "Title": "DreamFolks Co-Chairperson Addresses Media Reports and Business Operations",
            "Summary": "DreamFolks' Co-Chairperson has stated that the company's business operations are continuing normally. The executive emphasized that the company is focused on new partnerships and evaluations. Additionally, it was clarified that recent media reports about the company did not originate from DreamFolks. The company maintains strong and fully intact partnerships with over 50 clients.",
            "Sentiment": "positive",
            "PublishDate": 1750398445000,
            "Source": "default"
        },
        {
            "Title": "DreamFolks Services Ltd: Major Clients Reportedly Considering Disassociation",
            "Summary": "DreamFolks Services Ltd.'s shares dropped nearly 5% following reports that major clients like ICICI Bank, Axis Bank, and Mastercard are considering ending their partnerships with the travel services aggregator. The company denies these claims, stating all partner relationships remain intact. The potential client exodus is linked to a service disruption in September 2022.",
            "Sentiment": "negative",
            "PublishDate": 1750393340000,
            "Source": "corporate_governance"
        },
        {
            "Title": "DreamFolks Services: Major Clients Reportedly Moving Away",
            "Summary": "DreamFolks Services Ltd.'s shares closed 10.3% lower at Rs 236.05 on the NSE after reports that major clients including ICICI Bank, Axis Bank, and Mastercard are looking to establish direct partnerships with airport lounge operators, moving away from the aggregator. This shift follows a temporary service disruption in September 2022 that affected thousands of customers.",
            "Sentiment": "negative",
            "PublishDate": 1750328838000,
            "Source": "normal_news"
        },
        {
            "Title": "DreamFolks Affirms Strong Client Relationships",
            "Summary": "DreamFolks has announced that its relationships with all partners remain strong and fully intact. The company reports no cancellations in client partnerships.",
            "Sentiment": "positive",
            "PublishDate": 1750327176000,
            "Source": "default"
        },
        {
            "Title": "DreamFolks Introduces New Card Benefits Services",
            "Summary": "DreamFolks has launched two new services to enhance credit card benefits: a 'Members-Only' club entry and a 'Coffee at Malls' service. These offerings aim to transform the way cardholders can utilize their card benefits, potentially expanding the company's service portfolio in the credit card rewards sector.",
            "Sentiment": "positive",
            "PublishDate": 1750213819000,
            "Source": "default"
        },
        {
            "Title": "DreamFolks Services Reports Q4 EBITDA Decline",
            "Summary": "DreamFolks Services has reported its Q4 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 208 million rupees, compared to 247 million rupees in the same quarter of the previous year, representing a year-over-year decrease. The EBITDA margin for Q4 was 6.62%, down from 8.79% in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748003691000,
            "Source": "result"
        },
        {
            "Title": "DreamFolks Services Reports Q4 Financial Results",
            "Summary": "DreamFolks Services announced its Q4 financial results. The company reported a net profit of 158 million rupees, compared to 182 million rupees year-over-year and 183 million rupees quarter-over-quarter. Revenue for Q4 was 3.14 billion rupees, up from 2.8 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1748003622000,
            "Source": "result"
        },
        {
            "Title": "DreamFolks Services Reports Decline in Q3 EBITDA and Margin",
            "Summary": "DreamFolks Services has reported a decrease in its third-quarter EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) from 277 million rupees to 238 million rupees year-over-year. The company's EBITDA margin also declined from 9.08% to 7% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738933797000,
            "Source": "earnings"
        },
        {
            "Title": "DreamFolks Services Reports Q3 Financial Results",
            "Summary": "DreamFolks Services has announced its financial results for the third quarter. The company reported a net profit of 183 million rupees, down from 203 million rupees in the same period last year. However, revenue increased to 3.4 billion rupees from 3 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738933779000,
            "Source": "earnings"
        },
        {
            "Title": "DreamFolks Services Reports Q2 EBITDA and Margin Decline",
            "Summary": "DreamFolks Services announced its Q2 financial results. The company's EBITDA decreased to 241 million rupees from 249 million rupees year-over-year. The EBITDA margin also declined to 7.61% from 8.83% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731064327000,
            "Source": "result"
        },
        {
            "Title": "DreamFolks Services Reports Q2 Revenue Growth",
            "Summary": "DreamFolks Services has announced its Q2 revenue, which stands at 3.2 billion rupees, compared to 2.8 billion rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731064318000,
            "Source": "result"
        },
        {
            "Title": "DreamFolks Services Reports Q2 Net Profit of 171M Rupees",
            "Summary": "DreamFolks Services has announced its Q2 financial results. The company reported a net profit of 171 million rupees, which is lower compared to both the previous year (181 million rupees) and the previous quarter (184 million rupees).",
            "Sentiment": "neutral",
            "PublishDate": 1731064306000,
            "Source": "result"
        }
    ]
}