{
    "Symbol": "DREDGECORP",
    "ISIN": "INE506A01018",
    "News": [
        {
            "Title": "Dredging Corp Reports Q3 Loss of ₹246M vs Profit",
            "Summary": "Dredging Corporation of India swings to net loss of ₹246 million in Q3 compared to profit of ₹160 million in same quarter previous year, marking significant deterioration in financial performance.",
            "Sentiment": "negative",
            "PublishDate": 1770282898351,
            "Source": "co_actions_results"
        },
        {
            "Title": "DCIL Changes Registrar to KFin Technologies",
            "Summary": "Dredging Corporation of India Limited transitions from Alankit Assignments to KFin Technologies as Registrar and Share Transfer Agent effective January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769500653744,
            "Source": "stocks"
        },
        {
            "Title": "DCIL Board Meeting Set for Feb 5 to Review Q3FY26 Results",
            "Summary": "Dredging Corporation of India Limited has scheduled a board meeting on February 5, 2026, to consider and approve unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768547809737,
            "Source": "co_actions_results"
        },
        {
            "Title": "DCIL Gets Credit Rating Reaffirmation from Care Edge",
            "Summary": "Dredging Corporation of India receives reaffirmed CARE BBB+ stable rating for ₹453.64 crore bank facilities, supported by strong promoter backing and growing order book despite profitability challenges.",
            "Sentiment": "neutral",
            "PublishDate": 1768308979192,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dredging Corporation of India Appoints Divakar Sanamandra as Managing Director and CEO",
            "Summary": "Dredging Corporation of India shareholders approved the appointment of Divakar Sanamandra as Managing Director and CEO for six months from October 16, 2025 to April 15, 2026 through postal ballot voting. The resolution received overwhelming support with 99.99% of votes cast in favor, with 297 voters casting 21,872,777 votes.",
            "Sentiment": "positive",
            "PublishDate": 1764937835008,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dredging Corporation of India Changes Registrar and Share Transfer Agent",
            "Summary": "Dredging Corporation of India Limited has appointed KFin Technologies Limited, Hyderabad as its new Registrar and Share Transfer Agent effective January 1, 2026, replacing Alankit Assignments Limited whose tenure ends December 31, 2025. The change affects both physical and electronic registry forms for the company's shareholders, with the tripartite agreement still pending completion.",
            "Sentiment": "neutral",
            "PublishDate": 1764581052890,
            "Source": "corporate_action"
        },
        {
            "Title": "Dredging Corporation of India Discloses Related Party Transactions for Half Year Ended September 2025",
            "Summary": "Dredging Corporation of India Limited has disclosed its related party transactions for the half year ended September 30, 2025, in compliance with SEBI listing regulations. The disclosure includes transactions with related entities involving sale of goods and services. Key transactions include sales to Dredging Corporation subsidiaries and associated companies, with amounts ranging from approximately Rs. 7.86 crores to Rs. 13.41 crores. The company has submitted this information to both BSE and NSE as part of its regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1762962315843,
            "Source": "corporate_action"
        },
        {
            "Title": "Dredging Corporation of India Reports Mixed Q2 Results with Revenue Growth but Wider Losses",
            "Summary": "Dredging Corporation of India reported quarterly revenue of 2.12 billion rupees, up from 2 billion rupees in the same period last year. The company posted a net loss of 342 million rupees compared to a loss of 335 million rupees year-over-year. However, EBITDA turned positive at 249 million rupees versus a loss of 15.2 million rupees in the previous year, with an EBITDA margin of 11.78%.",
            "Sentiment": "neutral",
            "PublishDate": 1762942221058,
            "Source": "earnings"
        },
        {
            "Title": "Dredging Corporation of India Appoints New Director, Announces Board Changes",
            "Summary": "Dredging Corporation of India Limited announced the appointment of Shri Gaurav Dayal, IAS, as Additional Director (Promoter-Non Executive) effective November 7, 2025. Dayal serves as Chairman of Jawaharlal Nehru Port Authority and brings over two decades of administrative experience, including roles as Secretary (Home Vigilance) in Uttar Pradesh and Divisional Commissioner of Ayodhya. He is a Physics graduate and alumnus of the Lal Bahadur Shastri National Academy of Administration. The appointment requires formal approval at the next General Meeting or through Postal Ballot within three months. Simultaneously, Shri Unmesh Sharad Wagh, IRS ceased to be Director of the company on the same date as Dayal took charge as Chairperson of Jawaharlal Nehru Port Authority. The company confirmed that the new Director is not related to any existing Directors or Officers.",
            "Sentiment": "neutral",
            "PublishDate": 1762567645247,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dredging Corporation of India Surges 18% on ₹17,645 Crore MoUs and Modernisation Plans",
            "Summary": "Dredging Corporation of India's shares jumped 18% after the company signed 22 MoUs worth ₹17,645 crore with 16 organisations during India Maritime Week. The MoU value represents nearly seven times the company's market capitalisation of ₹2,500 crore. The agreements were signed with major ports including Visakhapatnam, Paradeep, Jawaharlal Nehru Port, Chennai, Mumbai and Kochi for dredging services over the next two to five years. Additionally, the government announced a ₹4,000 crore investment for modernisation, including construction of 11 new dredgers and fleet upgradation. The company expects these developments to help increase market share and strengthen its position in the dredging sector. The stock has gained 42% over four of the last five trading sessions.",
            "Sentiment": "positive",
            "PublishDate": 1762145286571,
            "Source": "stock"
        },
        {
            "Title": "Dredging Corporation of India Signs 22 MOUs Worth Rs. 17,645 Crore During India Maritime Week 2025",
            "Summary": "Dredging Corporation of India Limited (DCIL) entered into 22 Memorandums of Understanding with 16 organizations worth Rs. 17,645 crore during India Maritime Week 2025 held in Mumbai from October 27-31, 2025. The MOUs were signed with major ports including Visakhapatnam, Paradip, Jawaharlal Nehru, Deendayal, Shyama Prasad Mukherjee, Cochin, Chennai, and Mumbai ports for dredging requirements over the next 2-5 years. Additional partnerships include Cochin Shipyard for dredger construction and repair, NMOC Abu Dhabi for joint venture formation, Bharat Earth Movers Limited for indigenization of spares, IHC for modernizing existing dredgers, and National Technology Centre for Ports for bathymetry surveys and training modules. Prime Minister Narendra Modi announced a Rs. 4,000 crore investment for DCIL's modernization, including construction of 11 new dredgers and fleet upgradation. DCIL currently operates 10 Trailer Suction Hopper Dredgers with 60,000 cubic meters combined capacity, handling 50-60 million cubic meters of dredging annually, representing 55% of India's total dredging requirement of 110-120 million cubic meters per year. The initiative supports Maritime India Vision 2030 and Atmanirbhar Bharat 2047 goals.",
            "Sentiment": "positive",
            "PublishDate": 1761996829986,
            "Source": "order&deals"
        },
        {
            "Title": "Prime Minister Announces Rs. 4,000 Crore Modernization Initiative for Dredging Corporation of India",
            "Summary": "Prime Minister Narendra Modi announced a Rs. 4,000 crore investment for modernizing Dredging Corporation of India Limited (DCIL) during the inauguration of India Maritime Week 2025. DCIL operates under a consortium of four major ports - Visakhapatnam Port Authority, Paradip Port Authority, Jawaharlal Nehru Port Authority, and Deendayal Port Authority. The modernization initiative focuses on fleet modernization, construction of new dredgers in Indian shipyards under the Make in India initiative, adoption of digital and green dredging technologies, and skill development. The investment will fund procurement of 11 dredgers including Trailer Suction Hopper Dredgers, Cutter Suction Dredger, water injection dredger, and beaver dredgers. DCIL has already placed an order for one 12,000 CuM TSHD named DCI DREDGE GODAVARI, which was launched on October 18, 2025, with delivery expected in July 2026. The company currently operates 10 TSHDs with combined hopper capacity of approximately 60,000 cubic meters, handling 50-60 million cubic meters of dredging annually, accounting for 55% of India's total dredging requirement of 110-120 million cubic meters per year.",
            "Sentiment": "positive",
            "PublishDate": 1761972910845,
            "Source": "stock"
        },
        {
            "Title": "Dredging Corporation of India Inaugurates Pavilion at India Maritime Week 2025",
            "Summary": "Dredging Corporation of India Limited (DCIL) inaugurated its pavilion at India Maritime Week 2025 at Mumbai Exhibition Centre. Chairman Dr. M. Angamuthu, IAS, led the inauguration ceremony. The pavilion showcased the corporation's capabilities, ongoing projects, and technological advancements in the dredging sector. The display attracted attention from visitors, maritime professionals, and industry stakeholders. Dr. Angamuthu praised the pavilion's presentation, content, and professionalism, describing it as 'a great show, perfectly managed in all aspects.' The event represents DCIL's commitment to promoting innovation, sustainability, and excellence in dredging operations while supporting India's maritime infrastructure and blue economy initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1761634611510,
            "Source": "stock"
        },
        {
            "Title": "Dredging Corporation of India Seeks Shareholder Approval for CEO Appointment via Postal Ballot",
            "Summary": "Dredging Corporation of India Limited has initiated a postal ballot to seek shareholder approval for the appointment of Divakar Sanamandra as Managing Director & CEO (Additional Charge). The Board of Directors approved his appointment on October 10, 2025, with the position effective from October 16, 2025. The appointment is for six months until April 15, 2026, or until a regular incumbent joins. Sanamandra, who holds DIN 09675405, previously served as MD & CEO from October 13, 2022 to April 16, 2024. He started his career with DCI in 1987 as a cadet and has 38 years of experience in both onboard dredgers and onshore operations. He will not receive any additional remuneration for holding the additional charge. The e-voting period runs from November 5, 2025 at 9:00 AM to December 4, 2025 at 5:00 PM, with results to be announced by December 6, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761632703909,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dredging Corporation of India Appoints Capt. S. Divakar as Managing Director & CEO",
            "Summary": "Dredging Corporation of India Limited has appointed Capt. S. Divakar as Managing Director & Chief Executive Officer (Additional Charge) and Key Managerial Personnel effective October 16, 2025. The appointment follows the completion of Shri Durgesh Kumar Dubey's tenure on October 15, 2025. Capt. Divakar, who holds the position of Chief General Manager with DIN 09675405, brings 34 years of experience with the company, having started as a cadet in 1987. He served 22 years onboard dredgers in various capacities from Cadet to Captain, followed by 12 years in shore service at senior management level. He holds a Dredge Master Grade-I Certificate of Competency and owns 99 shares in the company. The appointment was approved by the Board of Directors.",
            "Sentiment": "neutral",
            "PublishDate": 1760595519904,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dredging Corporation of India Appoints Capt. S. Divakar as Managing Director & CEO",
            "Summary": "Dredging Corporation of India Limited appointed Capt. S. Divakar as Managing Director & CEO (Additional Charge), Additional Director, and Key Managerial Personnel effective from 16.10.2025. The appointment follows the completion of Shri Durgesh Kumar Dubey's tenure on 15.10.2025. The Board of Directors approved the appointment at its 365th Meeting held on 10.10.2025. Capt. Divakar will serve until a regular incumbent joins, for a period of six months, or until further orders, whichever is earlier. Capt. Divakar, aged 57, holds a Dredge Master Grade-I Certificate of Competency and has 34 years of experience with DCI, starting as a cadet in 1987. He served 22 years onboard dredgers rising to Master of Dredger, followed by 12 years in shore service at senior management level. He currently holds 99 shares in DCI and has no directorships in other companies.",
            "Sentiment": "neutral",
            "PublishDate": 1760097096607,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dr. Madhaiyaan Angamuthu Appointed Additional Chairman of Visakhapatnam Port Authority",
            "Summary": "Dr. Madhaiyaan Angamuthu, IAS, Chairperson of Mumbai Port Authority, has been assigned additional charge as Chairman of Visakhapatnam Port Authority effective September 22, 2025. The appointment is for six months or until a new chairperson is appointed, whichever is earliest. The assignment was made in anticipation of approval from the Appointments Committee of Cabinet and has received approval from the Minister for Ports, Shipping and Waterways. Dredging Corporation of India Limited informed stock exchanges about this development through regulatory disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1758626324787,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dr. Madhaiyaan Angamuthu Appointed as Chairperson of Mumbai Port Authority",
            "Summary": "Dr. Madhaiyaan Angamuthu, IAS (AM-2002), who serves as Chairperson of Visakhapatnam Port Authority, has been appointed as Chairperson of Mumbai Port Authority at JS level. The appointment was made by the Central Government under Section 3(1)(a) of the Major Port Authorities Act, 2021. The position comes with pay at level-14 (Rs.1.44.200 - 2.18,200) of the pay matrix for a combined tenure of seven years up to October 13, 2027 or until further orders, whichever is earlier. Dredging Corporation of India Limited informed stock exchanges about this appointment through a regulatory disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1758546832890,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dredging Corporation of India Approves ₹194 Crore Fundraising Through Non-Convertible Debentures",
            "Summary": "Dredging Corporation of India Limited's Board of Directors approved raising funds of ₹194 crore through the issuance of Non-Convertible Debentures (NCDs) on a private placement basis. The board meeting was held on August 13, 2025, commencing at 11:00 AM and concluding at 3:30 PM. The company informed stock exchanges BSE and NSE about this decision in continuation of their earlier letter dated August 7, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755088747930,
            "Source": "corporate_action"
        },
        {
            "Title": "Dredging Corporation of India Reports Loss of Rs 2,333 Lakhs in Q1 Results",
            "Summary": "Dredging Corporation of India Limited reported a net loss of Rs 2,333.24 lakhs for the quarter ended June 30, 2025, compared to a loss of Rs 3,140.48 lakhs in the same quarter last year. Revenue from operations decreased to Rs 15,079.61 lakhs from Rs 24,224.46 lakhs year-over-year. Total income fell to Rs 15,165.14 lakhs from Rs 24,330.87 lakhs. The company's earnings per share stood at negative Rs 8.33. Key financial ratios showed a debt-equity ratio of 0.87:1, current ratio of 0.96:1, and net profit margin of negative 0.10%. The Board of Directors approved these unaudited financial results in a meeting held on August 13, 2025. The statutory auditors provided an unqualified opinion on the results.",
            "Sentiment": "negative",
            "PublishDate": 1755082583904,
            "Source": "earnings"
        },
        {
            "Title": "Dredging Corporation of India: Q4 Results Spark 15% Share Price Surge",
            "Summary": "Dredging Corporation of India's share price rose up to 15% to Rs 779 after reporting a 42.5% increase in Q4 revenue to Rs 462 crore and a 33.8% rise in net profit to Rs 21.4 crore. EBITDA grew 46.7% to Rs 76.7 crore with margins expanding to 16.6%.",
            "Sentiment": "positive",
            "PublishDate": 1747808775000,
            "Source": "earnings"
        },
        {
            "Title": "Dredging Corporation Of India Reports Q4 Profit of 214m Rupees",
            "Summary": "Dredging Corporation Of India has reported its Q4 financial results. The company posted a net profit of 214 million rupees, compared to a loss of 259.7 million rupees in the same quarter last year. Revenue for Q4 was 4.62 billion rupees, up from 2.8 billion rupees year-over-year. The company also reported an exceptional item of 26.6 million rupees. Profit before tax (PBT) for Q4 was 237.7 million rupees, compared to a loss of 258 million rupees in the previous year's quarter. Sequentially, the profit increased from 160.6 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747786932000,
            "Source": "default"
        },
        {
            "Title": "Dredging Corporation of India: Turns Profitable in Q4 with Rs 21 Crore Net Profit",
            "Summary": "Dredging Corporation of India reported a net profit of Rs 21.39 crore for Q4 2025, compared to a loss of Rs 25.97 crore in Q4 2024. Total income increased by 67% to Rs 464.38 crore. The company is exploring business opportunities in Middle East, South East Asia, and South Asian markets.",
            "Sentiment": "positive",
            "PublishDate": 1747751558000,
            "Source": "earnings"
        },
        {
            "Title": "Dredging Corporation of India Reports Significant Improvement in Q4 Financial Results",
            "Summary": "Dredging Corporation of India has reported substantial improvements in its Q4 financial results. The company's EBITDA increased to 766.7 million rupees from 192.3 million rupees year-over-year, with EBITDA margin rising to 16.58% from 6.92%. Revenue grew to 4.62 billion rupees from 2.8 billion rupees. The company turned a profit, reporting a net profit of 214 million rupees compared to a loss of 259.7 million rupees in the same quarter last year. An exceptional item of 26.6 million rupees was also noted. Profit before tax (PBT) was 237.7 million rupees, compared to a loss of 258 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747747555000,
            "Source": "result"
        },
        {
            "Title": "Dredging Corporation of India Reports Q3 Financial Results",
            "Summary": "Dredging Corporation of India has announced its financial results for the third quarter. The company reported a net profit of 161 million rupees, down from 272 million rupees in the same period last year. However, revenue increased to 3.24 billion rupees from 2.7 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738627964000,
            "Source": "earnings"
        },
        {
            "Title": "Dredging Corporation of India Reports Decline in Q3 EBITDA",
            "Summary": "Dredging Corporation of India has reported a decrease in its Q3 EBITDA, which fell to 523 million rupees from 688 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 16.12% from 25.90% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738590711000,
            "Source": "earnings"
        },
        {
            "Title": "Dredging Corporation of India Reports Q3 Financial Results",
            "Summary": "Dredging Corporation of India has announced its financial results for the third quarter. The company reported a net profit of 161 million rupees, down from 272 million rupees in the same period last year. However, revenue increased to 3.24 billion rupees from 2.7 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738590705000,
            "Source": "earnings"
        },
        {
            "Title": "Dredging Corporation of India Reports Q2 FY25 Loss",
            "Summary": "Dredging Corporation of India has reported a loss before tax (LBT) of 552 million in Q2 FY25, compared to a profit of 182 million in the same quarter last year. The company also recorded an exceptional item of 223 million in this quarter.",
            "Sentiment": "negative",
            "PublishDate": 1731499604000,
            "Source": "result"
        },
        {
            "Title": "Dredging Corporation of India Reports Q2 EBITDA Loss",
            "Summary": "Dredging Corporation of India has reported an EBITDA loss of 15.2 million rupees in the second quarter, compared to a gain of 574 million rupees in the same period last year. This represents a significant year-over-year decline in the company's operational performance.",
            "Sentiment": "negative",
            "PublishDate": 1731499551000,
            "Source": "result"
        },
        {
            "Title": "Dredging Corporation of India Reports Q2 Revenue Growth",
            "Summary": "Dredging Corporation of India has announced its Q2 revenue, which stands at 2 billion rupees, compared to 1.98 billion rupees in the same quarter last year, indicating a slight year-over-year increase.",
            "Sentiment": "neutral",
            "PublishDate": 1731499515000,
            "Source": "result"
        },
        {
            "Title": "Dredging Corporation of India Reports Q2 Net Loss",
            "Summary": "Dredging Corporation of India has reported a net loss of 335 million rupees in the second quarter, compared to a profit of 168 million rupees in the same period last year. The loss has increased from 314 million rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1731499492000,
            "Source": "result"
        }
    ]
}