{
    "Symbol": "DRONE",
    "ISIN": "INE0P7201019",
    "News": [
        {
            "Title": "Drone Destination Establishes Subsidiary in Cyprus",
            "Summary": "Drone Destination has initiated the process of establishing a subsidiary in Cyprus. The company is expanding its operations internationally, with Cyprus being the chosen location for this new venture.",
            "Sentiment": "positive",
            "PublishDate": 1750140469000,
            "Source": "default"
        },
        {
            "Title": "Drone Destination Secures ₹1.34 Crore Contract for Aerial Survey",
            "Summary": "Drone Destination has been awarded a contract worth ₹1.34 crore by GarudaUAV Soft Solutions Private Limited for aerial survey and data processing services. This contract represents a significant business opportunity for Drone Destination in the growing field of drone-based surveying and data analysis.",
            "Sentiment": "positive",
            "PublishDate": 1739942680000,
            "Source": "order&deals"
        },
        {
            "Title": "Drone Destination Secures Contract from Survey of India for Urban Mapping",
            "Summary": "Drone Destination has been awarded a contract by the Survey of India for 2D/3D urban mapping services. This contract signifies a notable business development for the company, potentially enhancing its position in the drone services sector for surveying and mapping applications.",
            "Sentiment": "positive",
            "PublishDate": 1735637504000,
            "Source": "order&deals"
        },
        {
            "Title": "Drone Destination Secures First Defence Order from Bharat Electronics Limited",
            "Summary": "Drone Destination has entered the defence sector by securing its first drone supply order from Bharat Electronics Limited (BEL). This move is part of the company's strategy to diversify its operations and enhance its capabilities in the Unmanned Aerial Vehicle (UAV) domain.",
            "Sentiment": "positive",
            "PublishDate": 1735283875000,
            "Source": "order&deals"
        }
    ]
}