{
    "Symbol": "DRREDDY",
    "ISIN": "INE089A01031",
    "News": [
        {
            "Title": "Dr. Reddy's Russian Unit Faces Tax Penalty",
            "Summary": "Dr. Reddy's Russian subsidiary receives tax audit decision with penalty of Rub 20.09 million (INR 24.50 million) for VAT levy on marketing services reclassification.",
            "Sentiment": "negative",
            "PublishDate": 1769240033970,
            "Source": "stocks"
        },
        {
            "Title": "Dr. Reddy's Q3FY26 Results: Revenue Up 4.4% YoY",
            "Summary": "Dr. Reddy's Laboratories reported Q3FY26 consolidated revenues of ₹87,268 million, up 4.4% YoY, with net profit at ₹12,098 million. Growth driven by branded businesses and favorable forex, offsetting lower Lenalidomide sales.",
            "Sentiment": "positive",
            "PublishDate": 1768996180440,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dr. Reddy's Gets GST Orders Worth ₹8.38 Cr Penalty",
            "Summary": "Dr. Reddy's Laboratories receives five GST orders from Visakhapatnam authority demanding penalties totaling ₹8.38 crores for alleged excess input tax credit claims during FY 2018-19 to FY 2022-23.",
            "Sentiment": "negative",
            "PublishDate": 1767263427179,
            "Source": "stocks"
        },
        {
            "Title": "Dr. Reddy's Gets USFDA CRL for AVT03 Biosimilar",
            "Summary": "Dr. Reddy's Swiss subsidiary receives Complete Response Letter from USFDA for AVT03 denosumab biosimilar application, citing manufacturing facility inspection observations.",
            "Sentiment": "negative",
            "PublishDate": 1767191955565,
            "Source": "stocks"
        },
        {
            "Title": "Dr Reddy's Q3FY26 Results & Earnings Call on Jan 21",
            "Summary": "Dr Reddy's Laboratories will release Q3FY26 results on January 21, 2026, followed by an earnings call at 19:30 PM IST/9:00 AM ET to discuss financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1767070969834,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dr. Reddy's Gets USFDA Form 483 for Srikakulam Plant",
            "Summary": "USFDA completes GMP and PAI review at Dr. Reddy's Laboratories Srikakulam facility, issues Form 483 citing five regulatory concerns that require company attention.",
            "Sentiment": "negative",
            "PublishDate": 1765555770870,
            "Source": "stocks"
        },
        {
            "Title": "HC Refuses Stay on Dr Reddy's Semaglutide Export",
            "Summary": "High Court bench declines to halt Dr Reddy's Laboratories' export of semaglutide drug to certain international markets, allowing continued overseas sales operations.",
            "Sentiment": "positive",
            "PublishDate": 1765517229155,
            "Source": "stocks"
        },
        {
            "Title": "Dr. Reddy's Sets Science-Based Net Zero Targets by 2045",
            "Summary": "Dr. Reddy's Laboratories announces ambitious Net Zero climate targets approved by SBTi, committing to achieve Net Zero greenhouse gas emissions across its value chain by FY2045, becoming the first Indian pharma company to set such targets.",
            "Sentiment": "positive",
            "PublishDate": 1765508832710,
            "Source": "stocks"
        },
        {
            "Title": "Dr. Reddy's Sees ₹32.40 Cr NSE Block Trade",
            "Summary": "Dr. Reddy's Laboratories witnessed a significant block trade on NSE worth ₹32.40 crores involving 258,904 shares at ₹1,251.50 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1765425222976,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dr. Reddy's Allots 9,165 Equity Shares Under Employee Stock Option Plans",
            "Summary": "Dr. Reddy's Laboratories allotted 9,165 equity shares of Re. 1 each to eligible employees on December 9, 2025, under its Employee Stock Options Schemes from 2002 and 2007. The allotment was made at varying exercise prices ranging from Re. 1 to Rs. 735.80 per share, bringing the company's total issued share capital to Rs. 83,46,31,355.",
            "Sentiment": "neutral",
            "PublishDate": 1765278837909,
            "Source": "corporate_action"
        },
        {
            "Title": "Dr. Reddy's Secures Exclusive Rights to Develop Cancer Drug Eftilagimod Alfa in Key Markets",
            "Summary": "Dr. Reddy's Laboratories entered into a strategic collaboration with Immutep to develop and commercialize the innovative cancer immunotherapy Eftilagimod Alfa in all countries outside North America, Europe, Japan, and Greater China. Under the agreement, Immutep will receive USD 20 million upfront and is eligible for potential milestone payments up to USD 349.5 million plus double-digit royalties, while Dr. Reddy's gains exclusive licensing rights to advance this promising first-in-class cancer therapy across multiple markets.",
            "Sentiment": "positive",
            "PublishDate": 1765179009519,
            "Source": "order&deals"
        },
        {
            "Title": "Dr. Reddy's Laboratories Sees Rs. 113.93 Crore Block Trade on NSE",
            "Summary": "Dr. Reddy's Laboratories witnessed a significant block trade worth Rs. 113.93 crores involving approximately 888,017 shares at Rs. 1,283.00 per share on the NSE. The large-volume transaction indicates substantial institutional or bulk investor activity in the pharmaceutical company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1764735672556,
            "Source": "order&deals"
        },
        {
            "Title": "Delhi High Court Permits Dr Reddy's to Manufacture and Export Semaglutide Despite Novo Nordisk Patent Case",
            "Summary": "The Delhi High Court has allowed Dr Reddy's Laboratories to manufacture and export its version of Semaglutide in India, despite a patent infringement case filed by Novo Nordisk. This ruling enables Dr Reddy's to proceed with production and export operations of the diabetes medication while the legal dispute continues.",
            "Sentiment": "positive",
            "PublishDate": 1764731850491,
            "Source": "stock"
        },
        {
            "Title": "Dr. Reddy's Unit Aurigene Reports Positive Phase 1 Trial Results for Cancer Drug AUR112",
            "Summary": "Aurigene Oncology Limited, a unit of Dr. Reddy's, announced encouraging initial data from the first two cohorts of a Phase 1 study of AUR112, an oral small molecule inhibitor targeting relapsed/refractory lymphoid malignancies. The drug demonstrated safety and achieved a 63.6% response rate in lymphoma patients, showing objective responses in the trial.",
            "Sentiment": "positive",
            "PublishDate": 1764720003833,
            "Source": "stock"
        },
        {
            "Title": "Dr. Reddy's Subsidiary Aurigene Oncology Receives GST Tax Demand Order with Rs. 3.47 Lakh Penalty",
            "Summary": "Aurigene Oncology Limited, a wholly owned subsidiary of Dr. Reddy's Laboratories, received an order from GST Appellate Authority imposing a penalty of Rs. 3,46,998 for alleged short payment of output tax and excess claim of input tax credit. Dr. Reddy's stated there is no material impact on the company's financials or operations and will evaluate filing an appeal against the order.",
            "Sentiment": "negative",
            "PublishDate": 1764160839568,
            "Source": "stock"
        },
        {
            "Title": "Dr. Reddy's Receives European Commission Approval for Denosumab Biosimilar",
            "Summary": "Dr. Reddy's has obtained European Commission approval for AVT03 (Denosumab), a proposed biosimilar of Prolia® and Xgeva®. This regulatory approval allows the pharmaceutical company to market its biosimilar version in European markets.",
            "Sentiment": "positive",
            "PublishDate": 1764028980052,
            "Source": "stock"
        },
        {
            "Title": "Dr. Reddy's Srikakulam API Plant Passes USFDA Inspection Without Deficiencies",
            "Summary": "Dr. Reddy's Srikakulam API manufacturing plant successfully cleared a USFDA GMP inspection with zero observations. This regulatory clearance affects the pharmaceutical company's ability to continue manufacturing and supplying API products to US markets without compliance issues.",
            "Sentiment": "positive",
            "PublishDate": 1763125175940,
            "Source": "stock"
        },
        {
            "Title": "Dr. Reddy's Allots 7,430 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Dr. Reddy's Laboratories allotted 7,430 equity shares of Re. 1/- each to eligible employees on November 13, 2025, following exercise of stock options under the company's 2002 ESOP scheme. The allotment increased the company's total issued share capital to Rs. 83,46,22,190/- with shares exercised at Re. 1/- per share with no premium.",
            "Sentiment": "neutral",
            "PublishDate": 1763064020850,
            "Source": "corporate_action"
        },
        {
            "Title": "Dr. Reddy's Laboratories Clarifies No Financial Loss in Cyber Fraud Attempt",
            "Summary": "Dr. Reddy's Laboratories responded to a media report about hackers attempting to defraud the company of Rs 2.16 crore through vendor email impersonation. The pharmaceutical company clarified that the incident involved hackers impersonating a vendor's email address to redirect a legitimate payment. The company's teams and banking partners detected the fraud attempt promptly and froze the funds, resulting in no financial loss to either the company or the vendor. Dr. Reddy's stated that the incident is not considered material under SEBI regulations and therefore does not require formal disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1762864690653,
            "Source": "stock"
        },
        {
            "Title": "Dr. Reddy's Global Head of Biologics Jayanth Sridhar Resigns",
            "Summary": "Dr. Reddy's Laboratories announced that Jayanth Sridhar has resigned from his position as Global Head of Biologics to pursue aspirations outside the company. His employment and senior management role will end on January 31, 2026. Sridhar will remain available until January 2026 to ensure smooth transition of his responsibilities.",
            "Sentiment": "neutral",
            "PublishDate": 1762791352863,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dr. Reddy's Laboratories Sees Rs. 128.07 Crore Block Trade on NSE",
            "Summary": "Dr. Reddy's Laboratories experienced a significant block trade worth Rs. 128.07 crores on the NSE. The transaction involved approximately 1,068,662 shares traded at Rs. 1,198.40 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1762762918773,
            "Source": "order&deals"
        },
        {
            "Title": "Dr. Reddy's Laboratories Falls Victim to Rs 2.16 Crore Email Fraud",
            "Summary": "Dr. Reddy's Laboratories lost Rs 2.16 crore in a cyber fraud where hackers impersonated executives and diverted payment meant for Bengaluru-based Group Pharmaceutical Ltd. The fraudsters accessed unauthorized emails between the companies and sent fake payment instructions to Dr. Reddy's finance team using a spoofed email address 'KKeshav@Grouppharma.in' that mirrored the legitimate 'kkeshav@grouppharma.in'. The hackers provided false Bank of Baroda account details, leading Dr. Reddy's to transfer the payment to the fraudulent account. Group Pharmaceutical filed an FIR with Bengaluru City Cyber Crime Police, requesting immediate freezing of the fraudulent account and recovery of funds. Police registered the case under IT Act sections for identity theft and cheating by personation, with the accused's location listed as Vadodara, Gujarat.",
            "Sentiment": "negative",
            "PublishDate": 1762664123877,
            "Source": "stock"
        },
        {
            "Title": "Dr Reddy's Stock Falls 4% After Health Canada Issues Non-Compliance Notice for Semaglutide Generic",
            "Summary": "Dr Reddy's Laboratories shares declined 4% following Health Canada's notice of non-compliance for the company's Abbreviated New Drug Application (ANDA) for Semaglutide, a weight loss drug. Semaglutide is a complex peptide molecule that typically faces higher regulatory approval standards, with other Indian pharmaceutical companies like Cipla, Lupin, and Sun Pharma experiencing multiple review cycles with the US FDA for similar applications. The market reaction appears amplified due to Dr Reddy's significant investment in backend infrastructure for this launch and their plans to be the first launcher in several markets. The company has substantial expectations riding on the Semaglutide launch, making regulatory setbacks particularly impactful for investor sentiment.",
            "Sentiment": "negative",
            "PublishDate": 1762009539706,
            "Source": "stock"
        },
        {
            "Title": "Dr. Reddy's Reports 9.8% Revenue Growth Despite Lower Lenalidomide Sales in Q2 FY26",
            "Summary": "Dr. Reddy's Laboratories delivered consolidated revenues of ₹8,805 crores ($992 million) in Q2 FY26, marking 9.8% year-over-year growth despite pressure from lower Lenalidomide sales and product-specific price erosion in US generics. The growth was supported by the acquired consumer healthcare business and double-digit growth across other markets. EBITDA margins stood at 26.7%, while profit after tax grew 14% year-over-year to ₹1,437 crores ($162 million). The company made progress on key pipeline products with the Subject Expert Committee recommending approval for Semaglutide injection in India, and received positive opinion from European Medicines Agency for denosumab biosimilar. The India business reported strong 13% growth to ₹1,578 crores, moving up to 9th position in the Indian Pharmaceutical Market. North America generics declined 16% to $373 million due to Lenalidomide price erosion, while European generics grew 115% to €135 million driven by the acquired Nicotine Replacement Therapy portfolio. The company expects to submit Abatacept BLA by end of December 2025 and anticipates feedback on Semaglutide from Health Canada in coming weeks.",
            "Sentiment": "neutral",
            "PublishDate": 1761845903684,
            "Source": "earnings"
        },
        {
            "Title": "Dr Reddy's Receives Regulatory Notice from Canada Over Semaglutide Compliance",
            "Summary": "Dr Reddy's Laboratories has received a notice for not complying with Canadian regulations related to semaglutide, a diabetes and weight management medication.",
            "Sentiment": "negative",
            "PublishDate": 1761740666124,
            "Source": "stock"
        },
        {
            "Title": "Dr. Reddy's Labs Outlines Financial Targets and Product Pipeline Strategy",
            "Summary": "Dr. Reddy's Labs has outlined its financial projections and strategic targets during a conference call. The company anticipates SG&A costs will be 28-30% of sales, while R&D expenses are projected to stay around 7% of sales. The pharmaceutical company plans to achieve target margins within two years, depending on the success of key products like Semaglutide and Abatacept. Dr. Reddy's is aiming for Semaglutide approvals in 87 nations within 12-15 months. The company expects gross margins between 20-25% in pharmaceutical services and active ingredients, and aims to achieve 25% EBITDA margins by FY27 despite short-term challenges from Lenalidomide decrease.",
            "Sentiment": "positive",
            "PublishDate": 1761536665517,
            "Source": "earnings"
        },
        {
            "Title": "Dr. Reddy's Laboratories Reports Q2 Net Profit Growth to 13.47 Billion Rupees",
            "Summary": "Dr. Reddy's Laboratories reported quarterly net profit of 13.47 billion rupees, up from 12.55 billion rupees year-over-year, slightly exceeding estimates of 13.44 billion rupees. Revenue increased to 88.28 billion rupees from 80.3 billion rupees year-over-year. However, EBITDA declined to 20 billion rupees from 20.7 billion rupees year-over-year, though it marginally beat estimates of 20.17 billion rupees. EBITDA margin compressed to 22.77% from 25.83% year-over-year, falling short of the estimated 23.6%.",
            "Sentiment": "neutral",
            "PublishDate": 1761523719391,
            "Source": "earnings"
        },
        {
            "Title": "Dr. Reddy's Projects Growth Through Biosimilars and Global Expansion with 22% ROCE",
            "Summary": "Dr. Reddy's expects continued growth driven by its biosimilars portfolio, API pipeline, and global expansion strategy. The company reports a 22% return on capital employed (ROCE) and strong cash flow generation. Growth is anticipated from Europe and emerging markets, with high-margin products expected to enhance long-term profitability.",
            "Sentiment": "positive",
            "PublishDate": 1761324647356,
            "Source": "stock"
        },
        {
            "Title": "Dr Reddy's Lab Rules Out Partnership With Eli Lilly For Tirzepatide Launch In India",
            "Summary": "Dr Reddy's Laboratories has clarified that it has no plans to partner with Eli Lilly for launching Tirzepatide in India. The statement was made by a company executive, definitively ruling out any collaboration between the two pharmaceutical companies for this diabetes medication in the Indian market.",
            "Sentiment": "neutral",
            "PublishDate": 1761320571989,
            "Source": "stock"
        },
        {
            "Title": "Dr. Reddy's Laboratories Appoints Sanjay Sharma as Chief Human Resources Officer",
            "Summary": "Dr. Reddy's Laboratories has appointed Sanjay Sharma as Chief Human Resources Officer (CHRO), with his role beginning December 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761309565041,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dr. Reddy's Q2FY26 Results: Revenue Grows 9.8% YoY to ₹8,805 Cr, Profit Up 14%",
            "Summary": "Dr. Reddy's Laboratories reported Q2FY26 consolidated revenues of ₹8,805 crores, up 9.8% year-on-year and 3% quarter-on-quarter. Profit attributable to equity holders increased 14% YoY to ₹1,437 crores. The company's gross margin declined to 54.7% from 59.6% in the previous year, primarily due to reduced Lenalidomide sales and price erosion in North America. EBITDA margin stood at 26.7%. Growth was driven by momentum in branded markets and contributions from the acquired Nicotine Replacement Therapy portfolio, offsetting declines in US Lenalidomide sales. The company acquired the STUGERON brand portfolio for $50.5 million and launched novel drugs Linaclotide and Tegoprazan in India. North America revenues declined 13% YoY due to price erosion, while India grew 13% YoY and Europe surged 138% YoY mainly from the NRT acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1761309116452,
            "Source": "earnings"
        },
        {
            "Title": "Dr Reddy's Q2 Results Preview: Brokerages Expect 11-18% PAT Growth Despite US Pricing Pressures",
            "Summary": "Dr Reddy's Laboratories is expected to report steady quarterly results driven by healthy performance in India, Europe and non-US markets, while facing pricing pressure in US products like Revlimid. Brokerages project PAT growth of 11-18% year-on-year and 2-5.5% sequentially, with estimates ranging from Rs 1,454-1,495 crore. Revenue is expected to grow 10-14% YoY, with forecasts between Rs 8,810-9,115 crore, supported by strong India and Europe performance despite US segment moderation post-Revlimid. EBITDA estimates range from Rs 2,208-2,409 crore, though margins are expected to compress slightly due to higher price erosion in key US molecules and less favorable product mix. The company will announce earnings on October 24.",
            "Sentiment": "neutral",
            "PublishDate": 1761212641486,
            "Source": "earnings"
        },
        {
            "Title": "Dr. Reddy's Srikakulam Facility Receives FDA Inspection Report with Voluntary Action Indicated Status",
            "Summary": "Dr. Reddy's Laboratories received the USFDA's establishment inspection report for its Srikakulam facility. The inspection has been closed with a 'voluntary action indicated' status.",
            "Sentiment": "neutral",
            "PublishDate": 1761179475882,
            "Source": "stock"
        },
        {
            "Title": "Dr. Reddy's Receives USFDA Inspection Report with 'Voluntary Action Indicated' Classification for Srikakulam Facility",
            "Summary": "Dr. Reddy's Laboratories received an Establishment Inspection Report from the USFDA for its formulations manufacturing facility FTO 11 in Srikakulam, Andhra Pradesh. The inspection outcome was classified as 'Voluntary Action Indicated (VAI)' and the inspection has been officially closed. The company received the EIR on October 20, 2025, following a GMP and Pre-Approval Inspection conducted by the USFDA that was previously disclosed on July 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761028961094,
            "Source": "stock"
        },
        {
            "Title": "Dr Reddy's Laboratories Acquires Biopharmaceutical Firm",
            "Summary": "Dr Reddy's Laboratories has acquired a biopharmaceutical firm as part of its strategy to broaden its product range.",
            "Sentiment": "positive",
            "PublishDate": 1760609438569,
            "Source": "order&deals"
        },
        {
            "Title": "Dr Reddy's and Zydus Recall Drugs in US Due to Manufacturing Issues",
            "Summary": "Dr Reddy's Laboratories and Zydus Lifesciences are recalling pharmaceutical products in the US due to manufacturing problems. Dr Reddy's Princeton-based subsidiary is recalling 571 vials of Succinylcholine Chloride Injection after out-of-specification results during six-month stability testing. The nationwide Class II recall was initiated on September 26. Zydus Pharmaceuticals (USA) Inc is recalling over 1,500 boxes of Entecavir tablets used to treat chronic hepatitis B virus due to failed impurity/degradation specifications. This recall of 912 bottles of 0.5mg tablets and 600 bottles of 1mg tablets began on September 24. Both are Class II recalls, which the USFDA defines as situations where product use may cause temporary or medically reversible health consequences with minimal likelihood of serious adverse outcomes.",
            "Sentiment": "negative",
            "PublishDate": 1760250464562,
            "Source": "stock"
        },
        {
            "Title": "Dr Reddy's and Hetero to Launch Generic HIV Prevention Drug at $40 Annually by 2027",
            "Summary": "Dr Reddy's Laboratories and Hetero Labs announced they will sell generic versions of lenacapavir, an HIV prevention drug, for approximately $40 per year starting in 2027. The original drug, developed by Gilead Sciences and branded as Yeztugo, is a twice-yearly injection that showed nearly 100% effectiveness in preventing HIV during large trials, but costs around $28,000 annually in the US. Both companies received royalty-free licenses from Gilead to produce and sell the drug in 120 low- and lower-middle-income countries. Unitaid, Clinton Health Access Initiative, and Wits RHI are supporting Dr Reddy's efforts, while the Gates Foundation is working with Hetero. The generic pricing aims to match oral PrEP costs and could benefit millions in low-income countries. Experts estimate long-term demand could reach 10 million people or more, making affordable generics crucial for broader access.",
            "Sentiment": "positive",
            "PublishDate": 1758736197607,
            "Source": "stock"
        },
        {
            "Title": "Dr. Reddy's Receives Positive CHMP Opinion for Denosumab Biosimilar AVT03",
            "Summary": "Dr. Reddy's received a positive opinion from the European Medicines Agency's Committee for Medicinal Products for Human Use (CHMP) for AVT03, a denosumab biosimilar. AVT03 is planned as a biosimilar to Prolia and XGEVA. The positive CHMP opinion represents a regulatory milestone in the European approval process for the biosimilar product.",
            "Sentiment": "positive",
            "PublishDate": 1758543481242,
            "Source": "stock"
        },
        {
            "Title": "Dr. Reddy's Laboratories Schedules Q2 Results Review for October 24",
            "Summary": "Dr. Reddy's Laboratories has announced it will review its Q2 results on October 24. The pharmaceutical company has set this date for examining its quarterly financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1758537321993,
            "Source": "earnings"
        },
        {
            "Title": "Dr. Reddy's Promoters Transfer 20.58% Stake to Family Trusts",
            "Summary": "Dr. Reddy's Laboratories promoters Satish Reddy Kallam and G V Prasad transferred 17,17,26,540 equity shares (20.58% stake) to their respective family trusts through off-market transactions on September 17, 2025. Kallam transferred 9.06% to VSD Family Trust while Prasad transferred 11.51% to GVP Family Trust. The transfer was conducted under SEBI exemption for succession planning and streamlining family assets. The aggregate promoter group holding remains unchanged at 26.64%. Post-transfer, Kallam's individual holding reduced from 10.27% to 1.21%, while Prasad's stake dropped from 11.51% to zero as shares moved to their family trusts.",
            "Sentiment": "neutral",
            "PublishDate": 1758208445104,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Companies Prepare Generic Ingredients for Novo Nordisk Weight-Loss Drugs",
            "Summary": "Indian pharmaceutical companies are preparing to supply key ingredients for generic versions of Novo Nordisk's weight-loss medications. These drugs are set to lose patent protection next year in major markets. Dr. Reddy's Laboratories is among the companies involved in this preparation.",
            "Sentiment": "neutral",
            "PublishDate": 1758091223789,
            "Source": "stock"
        },
        {
            "Title": "Dr. Reddy's Launches Novel Acid Blocker Tegoprazan in India Under Brand PCAB",
            "Summary": "Dr. Reddy's Laboratories has launched Tegoprazan, a novel patented molecule for acid-related gastrointestinal diseases, in India under the brand name PCAB. The drug is a next-generation potassium-competitive acid blocker indicated for treating acid peptic diseases including Erosive GERD, Non-Erosive GERD, and Gastric Ulcer. The launch follows Dr. Reddy's exclusive partnership with South Korea-based HK inno.N Corporation established in 2022 to commercialize Tegoprazan in India and select emerging markets. In a multinational clinical trial conducted across India, South Africa and Russia, 99% of GERD patients achieved endoscopic healing by Week 8. Tegoprazan is already approved in 21 countries including South Korea and China, and has completed Phase-III trials in the United States. The drug addresses a significant market need as acid peptic diseases affect approximately 38% of the Indian population.",
            "Sentiment": "positive",
            "PublishDate": 1758023275986,
            "Source": "stock"
        },
        {
            "Title": "Dr Reddy's Laboratories Receives FDA Form 483 with Five Observations at Bachupally Biologics Facility",
            "Summary": "The US Food and Drug Administration issued a Form 483 with five observations to Dr Reddy's Laboratories following a Pre-Approval Inspection at the company's Bachupally biologics facility.",
            "Sentiment": "negative",
            "PublishDate": 1757895049070,
            "Source": "stock"
        },
        {
            "Title": "Dr Reddy's Receives 5 FDA Observations at Hyderabad Biologics Facility",
            "Summary": "Dr Reddy's Laboratories received a Form 483 with five observations from the US FDA following a pre-approval inspection at its biologics manufacturing facility in Bachupally, Hyderabad, conducted between September 4-12, 2025. The company stated it will address the observations within the stipulated timeline. This follows a previous inspection at the same facility in October 2023. Separately, Dr Reddy's announced acquiring Johnson & Johnson affiliate Janssen's Stugeron portfolio for $50.5 million, covering 18 markets across Asia-Pacific and EMEA. The company reported first quarter FY26 revenue of ₹8,542 crore versus ₹7,672.7 crore in the previous year, with net profit at ₹1,417.8 crore compared to ₹1,392 crore last year. The company has guided for double-digit topline growth and flat margins for the ongoing financial year. Shares closed 0.84% higher at ₹1,314 on the NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1757749298559,
            "Source": "stock"
        },
        {
            "Title": "Dr. Reddy's Receives Form 483 with Five Observations Following USFDA Inspection at Hyderabad Biologics Facility",
            "Summary": "Dr. Reddy's Laboratories completed a Pre-Approval Inspection by the USFDA at its biologics manufacturing facility in Bachupally, Hyderabad. The inspection was conducted from September 4, 2025 to September 12, 2025. The company received a Form 483 with five observations that need to be addressed within the stipulated timeline. This inspection follows a previous inspection and disclosure made to stock exchanges on October 12, 2023. The company is listed on multiple exchanges including NSE, BSE, NYSE, and NSE IFSC.",
            "Sentiment": "neutral",
            "PublishDate": 1757741618438,
            "Source": "stock"
        },
        {
            "Title": "Dr. Reddy's Acquires Stugeron Anti-Vertigo Brand for $50.5 Million",
            "Summary": "Dr. Reddy's Laboratories entered into an agreement with Janssen Pharmaceutica NV to acquire Stugeron and its brands Stugeron Forte and Stugeron Plus for $50.5 million. The deal covers 18 markets across APAC and EMEA regions, with India and Vietnam as key markets. Stugeron contains Cinnarizine, an antihistamine for treating vestibular disturbances and vertigo. In India, Stugeron holds the top position in the Cinnarizine pharmaceutical market and ranks second in the extended anti-vertigo market. The acquisition allows Dr. Reddy's to expand in the anti-vertigo segment and strengthen its Central Nervous System portfolio. Operations will be gradually transitioned for smooth integration. Dr. Reddy's shares closed 0.87% higher at ₹1,302.50, though the stock is down 5% in 2025.",
            "Sentiment": "positive",
            "PublishDate": 1757552827911,
            "Source": "order&deals"
        },
        {
            "Title": "Dr. Reddy's Laboratories Receives FDA Form 483 with 7 Observations Following UK Facility Inspection",
            "Summary": "Dr. Reddy's Laboratories announced that the USFDA completed a GMP inspection at their API Mirfield facility in West Yorkshire, UK from September 1 to September 5, 2025. The inspection resulted in a Form 483 with 7 observations. The company stated it will address these observations within the stipulated timeline.",
            "Sentiment": "negative",
            "PublishDate": 1757144973975,
            "Source": "stock"
        },
        {
            "Title": "Dr Reddy's Laboratories: Cancer Medications Might Be Excluded From GST",
            "Summary": "Dr Reddy's Laboratories may benefit from potential exclusion of cancer medications from GST. This development could impact the pharmaceutical company's cancer drug portfolio pricing and accessibility.",
            "Sentiment": "positive",
            "PublishDate": 1756869480748,
            "Source": "stock"
        },
        {
            "Title": "Dr Reddy's Gets Court Stay on Tax Proceedings, Cipla Recalls Asthma Medication, Biocon Receives FDA Approval",
            "Summary": "Dr Reddy's Laboratories received an interim stay from the Telangana High Court on income tax reassessment proceedings related to its merger with Dr. Reddy's Holding Ltd. The company had received a show cause notice with a proposed demand of over ₹2,395 crore related to the merger. Cipla is recalling over 20,000 packs of Ibuterol Sulfate Inhalation Aerosol, used to treat asthma and chronic obstructive pulmonary disease, in the US according to the USFDA's Enforcement Report. Biocon Pharma Ltd received tentative approval from the US FDA for its Sitagliptin Tablets USP in 25 mg, 50 mg and 100 mg strengths, which are indicated for improving glycemic control in adults with type 2 diabetes mellitus.",
            "Sentiment": "neutral",
            "PublishDate": 1756344806303,
            "Source": "stock"
        },
        {
            "Title": "Dr Reddy's Hopes New GST Framework Will Address Pharma Sector Tax Challenges",
            "Summary": "Dr Reddy's Laboratories expressed optimism that upcoming GST reforms will address structural challenges facing the pharmaceutical sector, including higher GST rates and inverted duty structure that impact domestic manufacturing costs and medicine affordability. Chairman Satish Reddy stated the reforms could introduce a rationalized, industry-friendly tax framework that would improve medicine accessibility and enhance India's global pharmaceutical competitiveness. The Association of Indian Medical Device Industry separately advocated for retaining 12% GST on most consumables while supporting 5% rates on high-value equipment, noting that current GST structures create margin pressures with devices taxed at 12% while inputs face 18% rates.",
            "Sentiment": "positive",
            "PublishDate": 1756225255373,
            "Source": "stock"
        }
    ]
}