{
    "Symbol": "DSSL",
    "ISIN": "INE417B01040",
    "News": [
        {
            "Title": "Dynacons Board Meeting Set for Feb 14 to Review Q3FY26",
            "Summary": "Dynacons Systems & Solutions Limited has scheduled a board meeting for February 14, 2026, to consider Q3FY26 unaudited financial results. Trading window remains closed until 48 hours post-results.",
            "Sentiment": "neutral",
            "PublishDate": 1770651265322,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dynacons Gets Credit Rating Reaffirmation from Acuite",
            "Summary": "Dynacons Systems & Solutions receives ACUITE A- rating reaffirmation and assignment for bank facilities totaling Rs. 377.00 crore from Acuite Ratings & Research Limited.",
            "Sentiment": "positive",
            "PublishDate": 1769614004244,
            "Source": "stocks"
        },
        {
            "Title": "Dynacons Wins Lenovo Asia Pacific DaaS Award",
            "Summary": "Dynacons Systems & Solutions receives Lenovo 360 TruScale DaaS Growth Partner of the Year Award for FY 2024-25 Asia Pacific region at Bangkok event, recognizing strong performance in device-as-a-service solutions.",
            "Sentiment": "positive",
            "PublishDate": 1769171104980,
            "Source": "stocks"
        },
        {
            "Title": "Dynacons Gets Credit Rating from Acuité Ratings",
            "Summary": "Dynacons Systems & Solutions receives new credit ratings from Acuité Ratings & Research Limited for long-term and short-term bank facilities, while appealing for rating upgrade.",
            "Sentiment": "neutral",
            "PublishDate": 1767193524714,
            "Source": "stocks"
        },
        {
            "Title": "Dynacons Stock Surges 13% on ₹249 Cr RBI Order Win",
            "Summary": "Dynacons Systems shares jumped 13.3% to ₹1,035 after securing prestigious ₹249.15 crore Enterprise Application Platform contract from RBI, delivering 1,500% returns over 5 years.",
            "Sentiment": "positive",
            "PublishDate": 1767107756326,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dynacons Wins ₹74.99 Cr DaaS Project from J&K Bank",
            "Summary": "Dynacons Systems & Solutions secures prestigious Device-as-a-Service project worth ₹74.99 crores from Jammu Kashmir Bank to deploy 9,851 advanced desktops across 1,019 branches nationwide over 5 years.",
            "Sentiment": "positive",
            "PublishDate": 1765476973129,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dynacons Systems Solutions Wins System Integration Partner Award from Versa Networks for SD-WAN Project",
            "Summary": "Dynacons Systems Solutions Limited received the System Integration Partner - Secure SD-WAN Transformation award from Versa Networks at the Versatility APAC 2025 summit for their outstanding performance in deploying SD-WAN solutions for the Central Board of Indirect Taxes Customs (CBIC), Government of India. The recognition highlights Dynacons' successful delivery of secure, scalable SD-WAN transformation covering 27,904 PAN India offices including data centers and various location types, strengthening their position in the enterprise networking solutions market.",
            "Sentiment": "positive",
            "PublishDate": 1763983127251,
            "Source": "stock"
        },
        {
            "Title": "Dynacons Systems Reports Strong Q2 FY26 Performance with 15% Revenue Growth",
            "Summary": "Dynacons Systems Solutions Limited posted consolidated net sales of Rs 35,239.39 lakhs for Q2 FY26, up from Rs 30,633.12 lakhs in Q2 FY25, with net profit after tax rising to Rs 2,268.27 lakhs compared to Rs 1,823.14 lakhs in the previous year. The IT systems integration and technology workforce augmentation services company's half-year consolidated revenue reached Rs 68,124.56 lakhs versus Rs 62,729.75 lakhs in the corresponding period last year.",
            "Sentiment": "positive",
            "PublishDate": 1763174887818,
            "Source": "earnings"
        },
        {
            "Title": "Dynacons Systems Solutions Shareholders Approve Director Appointment and Cost Auditor Remuneration via Postal Ballot",
            "Summary": "Dynacons Systems Solutions Limited completed a postal ballot process with voting concluding on November 6, 2025. Shareholders approved two resolutions: the appointment of Mrs. Falguni Shah (DIN: 00635202) as Non-Executive Independent Director for a five-year term effective September 27, 2025, and the remuneration of the cost auditor. The first resolution received 8,133,410 votes in favor (99.8991%) and 8,221 votes against (0.1009%). The second resolution garnered 8,132,780 votes in favor (99.8913%) and 8,851 votes against (0.1087%). The remote e-voting process was conducted between October 8, 2025, and November 6, 2025, with 42,394 shareholders on record as of the cut-off date of September 12, 2025. Both resolutions were passed with requisite majority.",
            "Sentiment": "positive",
            "PublishDate": 1762568286555,
            "Source": "corporate_action"
        },
        {
            "Title": "Dynacons Systems Appoints New Independent Director, Changes Cost Auditors",
            "Summary": "Dynacons Systems & Solutions Limited appointed Ms. Falguni H. Shah as Additional Director designated as Independent Director effective September 27, 2025, subject to shareholder approval through postal ballot. Shah, a qualified Chartered Accountant with extensive experience in accounting, auditing, and corporate advisory, will serve a five-year term until September 26, 2030. She has been appointed to multiple board committees and will become Chairperson of the Stakeholders Relationship & Grievance committee from October 1, 2025. The company also appointed M/s. Rajaram Madhav Walavalkar & Co. as new Cost Auditors for Financial Years 2024-25 and 2025-26, replacing M/s. Sarvottam Rege & Associates who resigned to pursue other professional assignments. Additionally, Mrs. Archana Phadke will cease to be Independent Non-Executive Director on September 30, 2025, due to completion of her second term. The e-voting period for shareholder approval is scheduled from October 8 to November 6, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758973872336,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dynacons Systems Secures ₹51.28 Crore Order",
            "Summary": "Dynacons Systems has won a new order valued at ₹51.28 crores. The company announced this contract win, though specific details about the nature of the order, client, or timeline were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1755681334235,
            "Source": "order&deals"
        },
        {
            "Title": "Dynacons Systems & Solutions Reports 10% Jump in Q1 FY2026 Net Profit, Declares Interim Dividend",
            "Summary": "Dynacons Systems & Solutions Limited reported strong Q1 FY2026 results with consolidated revenue of ₹32,977.12 lakhs, representing 2.3% year-on-year growth. Net profit after tax increased significantly by 10% to ₹1,959.72 lakhs compared to ₹1,781.99 lakhs in Q1 FY2025. EBITDA margin improved to 8.6% from 8.2% in the corresponding quarter last year. Earnings per share stood at ₹14.12. The company incorporated a new subsidiary, NAS Global Industries Private Limited, on June 9, 2025, and received ISO 27001:2022 certification for information security management systems. The Board declared an interim dividend with record date set for August 22, 2025. Management highlighted continued traction in cloud migration, digital transformation projects, and growth in managed services contracts, particularly in BFSI and manufacturing verticals.",
            "Sentiment": "positive",
            "PublishDate": 1755256824500,
            "Source": "earnings"
        },
        {
            "Title": "Dynacons Systems Reports Q1 FY2026 Results and Declares Rs. 0.50 Interim Dividend",
            "Summary": "Dynacons Systems & Solutions Limited announced its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported net sales of Rs. 32,869.26 lakhs and net profit of Rs. 1,961.17 lakhs, compared to Rs. 32,096.63 lakhs revenue and Rs. 1,767.52 lakhs profit in the same quarter last year. On a consolidated basis, net sales stood at Rs. 32,885.17 lakhs with net profit of Rs. 1,964.51 lakhs versus Rs. 32,096.63 lakhs revenue and Rs. 1,760.50 lakhs profit in the corresponding previous quarter. The Board declared an interim dividend of Rs. 0.50 per equity share of Rs. 10 each, representing 5% of face value. The dividend will be paid from August 29, 2025 to shareholders on record as of August 22, 2025. The company operates in two segments: System Integration and Technology Workforce Augmentation Services.",
            "Sentiment": "positive",
            "PublishDate": 1755102779147,
            "Source": "corporate_action"
        },
        {
            "Title": "Dynacons Systems & Solutions Schedules Board Meeting for Q1 Results and Interim Dividend Consideration",
            "Summary": "Dynacons Systems & Solutions Limited will hold a Board of Directors meeting on August 13, 2025, to adopt unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The board will also consider declaring an interim dividend for Financial Year 2025-26. If an interim dividend is declared, it will be paid to equity shareholders whose names appear on the Register of Members or in depositories' records as of the record date of August 22, 2025. The trading window for insiders, which closed on July 1, 2025, will remain closed until 48 hours after the financial results are announced.",
            "Sentiment": "neutral",
            "PublishDate": 1754490458845,
            "Source": "corporate_action"
        },
        {
            "Title": "Dynacons Systems & Solutions Limited Wins HPE Solution Provider of the Year 2025 Award",
            "Summary": "Dynacons Systems & Solutions Limited has been recognized by Hewlett Packard Enterprise as the HPE Solution Provider of the Year 2025. The award was announced at the HPE Discover Summit 2025 in Las Vegas. HPE's awards honor partners who have demonstrated outstanding dedication and success in providing value to customers during digital transformation journeys, achieving exceptional results in financial performance, innovative solutions, and business outcomes. Chairman cum Managing Director Shirish Anjaria stated the recognition reflects the team's commitment to innovation, service excellence, and customer success, highlighting their technological leadership and partnership with HPE. Dynacons is a 29-year-old IT company headquartered in Mumbai with operations across India, providing infrastructure services, cloud solutions, and enterprise IT services.",
            "Sentiment": "positive",
            "PublishDate": 1753101799778,
            "Source": "stock"
        },
        {
            "Title": "Dynacons Systems Secures ₹62.98 Crore Order",
            "Summary": "Dynacons Systems has secured an order valued at ₹62.98 crore. No further details about the nature of the order or the client were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752479130000,
            "Source": "default"
        },
        {
            "Title": "Dynacons Systems and Solutions: Penny Stock Surges 46,740% in 11 Years",
            "Summary": "Dynacons Systems and Solutions Ltd, once a penny stock at ₹2.50 in May 2014, now trades at ₹1,181 on NSE, marking a 46,740% growth over 11 years. The company reported strong Q3 FY2024 results with net sales up 36.25% YoY to ₹308.92 crore and net profit increasing 40.19% YoY to ₹18.31 crore. However, the stock has declined 19.30% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1745482755000,
            "Source": "normal_news"
        },
        {
            "Title": "Dynacons Systems and Solutions Ltd: Secures ₹138 Crore Contract from LIC, Stock Surges",
            "Summary": "Dynacons Systems won a ₹138.44 crore digital workplace solutions contract from LIC for supply, installation, and maintenance of desktop computers over three years. The stock surged 8.5% on April 21, marking a 23% gain over five sessions.",
            "Sentiment": "positive",
            "PublishDate": 1745211873000,
            "Source": "order&deals"
        },
        {
            "Title": "Dynacons Systems Secures Digital Workplace Solutions Contract from LIC",
            "Summary": "Dynacons Systems has been awarded a contract worth Rs. 138.44 crores from Life Insurance Corporation of India (LIC) for providing digital workplace solutions. This significant deal highlights Dynacons Systems' capabilities in the IT services sector and represents a major business opportunity for the company.",
            "Sentiment": "positive",
            "PublishDate": 1745209808000,
            "Source": "default"
        },
        {
            "Title": "Dynacons Systems & Solutions Reports Strong Q3 EBITDA Growth",
            "Summary": "Dynacons Systems & Solutions has reported significant year-over-year growth in its Q3 EBITDA. The company's EBITDA increased from 190.1 million rupees to 289.1 million rupees. Additionally, the EBITDA margin improved from 8.38% to 9.29%, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738340374000,
            "Source": "earnings"
        },
        {
            "Title": "Dynacons Systems & Solutions Reports Q3 Revenue Growth",
            "Summary": "Dynacons Systems & Solutions has reported a significant increase in its third-quarter revenue. The company's revenue for Q3 stood at 3.11 billion rupees, compared to 2.27 billion rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738340352000,
            "Source": "earnings"
        },
        {
            "Title": "Dynacons Systems & Solutions Reports Q3 Profit Growth",
            "Summary": "Dynacons Systems & Solutions has reported a consolidated net profit of 184.5 million rupees for the third quarter. This represents a year-over-year increase from 131 million rupees and a quarter-over-quarter increase from 182.3 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738340343000,
            "Source": "earnings"
        },
        {
            "Title": "Dynacons Systems & Solutions Secures Rs. 280 Crore Data Centre Project from Canara Bank",
            "Summary": "Dynacons Systems & Solutions has been awarded a significant turnkey project by Canara Bank for the augmentation of their data centre IT infrastructure. The project is valued at Rs. 280 crore, marking a substantial business win for the company.",
            "Sentiment": "positive",
            "PublishDate": 1735689858000,
            "Source": "order&deals"
        },
        {
            "Title": "Dynacons Systems & Solutions Secures Rs. 280 Crore Data Centre Project from Canara Bank",
            "Summary": "Dynacons Systems & Solutions has been awarded a turnkey data centre IT infrastructure augmentation project by Canara Bank. The project is valued at Rs. 280 crore, signifying a significant contract win for the company in the banking sector.",
            "Sentiment": "positive",
            "PublishDate": 1735646915000,
            "Source": "order&deals"
        },
        {
            "Title": "Dynacons Systems & Solutions Reports Q2 EBITDA Growth",
            "Summary": "Dynacons Systems & Solutions has reported its Q2 financial results. The company's EBITDA increased to 256 million rupees, up from 190 million rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 8.34% from 8.65% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731081158000,
            "Source": "result"
        },
        {
            "Title": "Dynacons Systems & Solutions Reports Strong Q2 Financial Results",
            "Summary": "Dynacons Systems & Solutions has announced its Q2 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's net profit increased to 183 million rupees, up from 126 million rupees in the same quarter last year and 177 million rupees in the previous quarter. Revenue also saw substantial growth, reaching 3.06 billion rupees compared to 2.2 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731081089000,
            "Source": "result"
        },
        {
            "Title": "Dynacons Systems Secures 108 Crore Rupee Order",
            "Summary": "Dynacons Systems has won a significant order worth 108 crore rupees (approximately $13 million USD). This represents a major business development for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1730252813000,
            "Source": "corporate_action"
        }
    ]
}