{
    "Symbol": "DTIL",
    "ISIN": "INE341R01014",
    "News": [
        {
            "Title": "Dhunseri Tea Q3FY26 Results: Profit Drops 79% YoY",
            "Summary": "Dhunseri Tea & Industries reported Q3FY26 standalone net profit of Rs 105.17 lakhs, down 79% from Rs 507.42 lakhs in Q3FY25. Revenue grew 7.9% to Rs 10,744.61 lakhs despite seasonal challenges.",
            "Sentiment": "negative",
            "PublishDate": 1770714735781,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dhunseri Tea Strikes Off Mauritius Subsidiary",
            "Summary": "Dhunseri Tea & Industries announces strike-off of step-down subsidiary Dhunseri Mauritius Pte Ltd, effective December 09, 2025, under SEBI compliance regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1766146760928,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dhunseritea Industries Enters USD 0.4 Million Debenture Agreement with Wholly-Owned Subsidiary",
            "Summary": "Dhunseritea Industries Limited has entered into a Debenture Subscription Agreement with its wholly-owned subsidiary Dhunseritea Petrochemical Tea Pte Ltd. to subscribe to Optional Convertible Debentures worth USD 0.4 million. The debentures carry a 7.50% annual interest rate and can be converted into equity shares within 7 years from allotment date, with the transaction being conducted at arm's length as a related party transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1764242522528,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhunseri Tea Signs MoU to Sell Balijan (North) Tea Estate for ₹35 Crore",
            "Summary": "Dhunseri Tea has signed a memorandum of understanding to sell its Balijan (North) Tea Estate for ₹35 crore. The transaction is targeted for completion by March 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1763125070875,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhunseri Tea Industries Reports Strong Q2 Performance with Asset Sale Boosting Profits",
            "Summary": "Dhunseri Tea Industries Limited announced its quarterly results for the quarter ended September 30, 2025. The company reported standalone profit after tax of Rs 2,799.88 lakhs compared to a loss of Rs 978.29 lakhs in the previous quarter. On a consolidated basis, profit after tax reached Rs 2,115.63 lakhs versus Rs 1,435.41 lakhs in the prior quarter. For the six-month period, standalone profit after tax was Rs 3,778.17 lakhs while consolidated profit stood at Rs 3,551.04 lakhs. The company recorded exceptional items of Rs 204.80 lakhs from the sale of specified assets of Deoball Tea Estate effective September 1, 2025, as part of efforts to rationalize operations and improve profitability. Total income on a standalone basis was Rs 12,840.34 lakhs for the quarter, while consolidated total income reached Rs 17,147.58 lakhs. The results were approved by the Board of Directors at their meeting held on November 12, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763001086591,
            "Source": "earnings"
        },
        {
            "Title": "Dhunseri Tea & Industries Gets Credit Rating Reaffirmation from CARE Ratings",
            "Summary": "CARE Ratings Limited has reaffirmed Dhunseri Tea & Industries Limited's long-term bank facilities rating at CARE A; Stable for Rs. 148.93 crore (reduced from Rs. 153.20 crore) and assigned a new short-term bank facilities rating of CARE A2+ for Rs. 0.50 crore. The ratings benefit from the promoters' extensive experience in the tea industry and the company's established track record. The company operates 10 tea estates and 10 tea factories in Assam, along with overseas subsidiaries in Malawi producing tea and macadamia nuts. Financial performance showed subdued results with consolidated revenue increasing 15% to Rs. 456.38 crore but operating losses of Rs. 8.06 crore due to production challenges from adverse weather and pest attacks. The company improved in quarterly results with PBILDT of Rs. 24.06 crore compared to a loss of Rs. 6.64 crore in the previous year quarter. CARE noted the company's moderate scale of operations, labor-intensive nature of the tea industry, and susceptibility to agro-climatic risks as rating constraints.",
            "Sentiment": "neutral",
            "PublishDate": 1761309051585,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhunseri Tea & Industries Approves USD 1 Million Debenture Subscription in Subsidiary",
            "Summary": "Dhunseri Tea & Industries Limited's board approved subscribing to Optional Convertible Debentures worth USD 1 million offered by its wholly owned subsidiary, Dhunseri Petrochem & Tea Pte Ltd. The company entered into a Debenture Subscription Agreement for USD 0.6 million of these debentures. The debentures carry a 7.50% annual interest rate and can be converted to equity shares within 7 years from allotment date. Interest will accrue yearly but becomes payable only upon redemption or conversion. The conversion price will be determined on an arm's length basis using accepted valuation methodology. The transaction is classified as a related party transaction conducted at arm's length.",
            "Sentiment": "neutral",
            "PublishDate": 1757591734181,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhunseri Tea & Industries Completes Sale of Deohall Tea Estate",
            "Summary": "Dhunseri Tea & Industries has completed the sale of its Deohall Tea Estate to Madhuting Tea Pvt. Ltd. The transaction represents a divestment of tea estate assets by the company.",
            "Sentiment": "neutral",
            "PublishDate": 1756726672824,
            "Source": "order&deals"
        },
        {
            "Title": "Dhunseri Tea & Industries Shareholders Approve Board Resolutions Including Executive Re-designation and Auditor Appointment",
            "Summary": "Dhunseri Tea & Industries Limited announced that shareholders approved resolutions at their 28th Annual General Meeting held on August 8, 2025. The approved resolutions, which were initially passed by the Board on May 22, 2025, included the re-designation of Ms. Bharati Dhanuka and the appointment of Secretarial Auditors for the company. These resolutions required shareholder approval and have now been formally ratified by the company's members.",
            "Sentiment": "neutral",
            "PublishDate": 1754922855269,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dhunseri Tea & Industries Reports Strong Q1 Growth, Approves USD 0.4 Million Subsidiary Investment",
            "Summary": "Dhunseri Tea & Industries Limited announced its quarterly results showing significant growth across key metrics. Standalone revenue increased 161.7% year-over-year to Rs. 7,242.89 lakhs, while net profit rose 63.5% to Rs. 379.85 lakhs. Consolidated revenue grew 17.4% to Rs. 11,497.98 lakhs with net profit of Rs. 1,435.41 lakhs compared to a loss in the previous year. The company operates tea estates in India and has subsidiaries with tea and macadamia nut plantations in Africa. The Board approved subscribing to Optional Convertible Debentures of wholly-owned subsidiary Dhunseri Petrochem & Tea Pte Ltd for USD 0.4 million. Additionally, the company decided to sell specified assets of Deohall Tea Estate for Rs. 2,350 lakhs. Operations in Malawi faced hyperinflationary accounting challenges resulting in a non-cash loss of Rs. 33 lakhs. The company noted that tea cultivation and production are seasonal, leading to quarter-to-quarter performance variations.",
            "Sentiment": "positive",
            "PublishDate": 1754918253279,
            "Source": "earnings"
        },
        {
            "Title": "Dhunseri Tea Reports Quarterly Loss, Approves $0.4 Million Investment in Subsidiary",
            "Summary": "Dhunseri Tea & Industries Limited approved its quarterly financial results for the quarter ended June 30, 2025, reporting a standalone net loss of Rs 605.76 lakhs compared to a profit of Rs 408.37 lakhs in the previous quarter. Revenue from operations declined to Rs 1,242.89 lakhs from Rs 2,767.80 lakhs in the prior quarter. On a consolidated basis, the company posted a net loss of Rs 1,212.41 lakhs versus a profit of Rs 1,435.41 lakhs in the previous quarter. The board also approved subscribing to Optional Convertible Debentures worth USD 0.4 million in its wholly owned subsidiary Dhunseri Petrochem & Tea Pte Ltd. The company noted that tea cultivation and production being seasonal in nature causes quarterly performance variations that are not representative of expected annual performance.",
            "Sentiment": "negative",
            "PublishDate": 1754917053407,
            "Source": "earnings"
        },
        {
            "Title": "Dhunseri Tea & Industries Reports Strong Q1 Turnaround with 143.5M Rupees Net Profit",
            "Summary": "Dhunseri Tea & Industries achieved a consolidated net profit of 143.5 million rupees in Q1, marking a significant turnaround from a loss of 30 million rupees in the same period last year. The company's revenue grew to 1.15 billion rupees compared to 979 million rupees year-over-year, representing substantial growth in both profitability and top-line performance.",
            "Sentiment": "positive",
            "PublishDate": 1754914997651,
            "Source": "earnings"
        },
        {
            "Title": "Dhunseri Tea & Industries to Subscribe to OCDs Worth $1 Million",
            "Summary": "Dhunseri Tea & Industries has entered into an agreement to subscribe to Optionally Convertible Debentures (OCDs) offered by DPTPL (likely a subsidiary or affiliated company) for a value of $1 million.",
            "Sentiment": "neutral",
            "PublishDate": 1733357058000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhunseri Tea & Industries to Subscribe to $1 Million OCD Offered by DPTPL",
            "Summary": "Dhunseri Tea & Industries has entered into an agreement to subscribe to Optionally Convertible Debentures (OCD) worth $1 million offered by DPTPL (likely Dhunseri Petrochem & Tea Pvt Ltd, though full name not specified in the news).",
            "Sentiment": "neutral",
            "PublishDate": 1733315169000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhunseri Tea Reports Significant Q2 EBITDA Improvement",
            "Summary": "Dhunseri Tea has reported a substantial improvement in its Q2 EBITDA, moving from a loss of 2.4 million rupees in the previous year to a gain of 467 million rupees. The company's Q2 EBITDA margin stands at 27.85%.",
            "Sentiment": "positive",
            "PublishDate": 1731569039000,
            "Source": "result"
        },
        {
            "Title": "Dhunseri Tea Reports Profitable Q2 with Revenue Growth",
            "Summary": "Dhunseri Tea has reported a significant turnaround in its financial performance for the second quarter. The company posted a consolidated net profit of 260 million rupees, compared to a loss of 38 million rupees in the same period last year. Additionally, the company's revenue increased to 1.68 billion rupees from 1.4 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731568667000,
            "Source": "result"
        }
    ]
}