{
    "Symbol": "DUCON",
    "ISIN": "INE741L01018",
    "News": [
        {
            "Title": "Ducon Infra Q3 FY26 Results: Revenue Dips 19.4% YoY",
            "Summary": "Ducon Infratechnologies reported Q3 FY26 standalone revenue of ₹5,105.24 lakhs, down from ₹6,251.17 lakhs in Q3 FY25. Net profit declined to ₹39.86 lakhs versus ₹115.95 lakhs year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1770914172868,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ducon Infratechnologies Reports Mixed Q2 Results and Company Secretary Resignation",
            "Summary": "Ducon Infratechnologies posted consolidated net profit of Rs. 383.77 lakhs for Q2 FY2025-26 with total revenue of Rs. 11,396.90 lakhs, while standalone operations showed net profit of Rs. 128.66 lakhs. The company's Company Secretary and Compliance Officer Mr. Darshit Parikh resigned with effect from November 13, 2025 to pursue better career opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1763174581135,
            "Source": "earnings"
        },
        {
            "Title": "Ducon Infratechnologies Receives Disclosure from Promoter Arun Govil Under SEBI Takeover Regulations",
            "Summary": "Ducon Infratechnologies Limited received a disclosure from promoter Arun Govil in compliance with SEBI regulations for substantial acquisition of shares and takeovers. The company informed BSE and NSE about this disclosure on January 17, 2023. The disclosure relates to Regulation 29(2) & 31(2) of SEBI (Substantial Acquisition of Shares and Takeovers) Regulations, 2011. Arun Govil holds 60,00,000 equity shares representing 4.64% of the company's total shareholding.",
            "Sentiment": "neutral",
            "PublishDate": 1761796089159,
            "Source": "corporate_action"
        },
        {
            "Title": "Ducon Infratechnologies Launches AI Platform IQ Energy AI for Power Generation Optimization",
            "Summary": "Ducon Infratechnologies Ltd launched IQ Energy AI, an artificial intelligence platform designed to help utilities and industries optimize power plant operations and maximize output efficiency. The platform addresses rising power demand from AI-driven data centers by providing predictive maintenance, efficiency optimization, probabilistic load forecasting, and renewable integration capabilities. Chairman Aron Govil stated the platform helps power producers meet rising demand while improving efficiency, reducing costs, and supporting cleaner grid transition. Ducon projects the AI energy optimization sector represents a multi-billion dollar revenue market over the next decade. The company estimates utilities and industries could realize over $100 billion in worldwide savings over ten years through reduced unplanned downtime by up to 30%, improved fuel efficiency by 10-15%, and cutting forecast error rates by 15-20%. The platform offers deployment across cloud, hybrid, and on-premises environments with open APIs for integration with existing systems, targeting power utilities and energy-intensive industries including chemicals, steel, and cement.",
            "Sentiment": "positive",
            "PublishDate": 1761648253845,
            "Source": "stock"
        },
        {
            "Title": "Ducon Infratechnologies Announces Leadership Changes at Annual General Meeting",
            "Summary": "Ducon Infratechnologies held its Annual General Meeting on September 30, 2025, approving several key appointments. Mr. Arun Govil was re-appointed as Managing Director for a 5-year term, with his continuation subject to Central Government approval due to attaining age 70. Mr. Harish Shetty was appointed as Executive Whole-Time Director & Chief Financial Officer for 5 years effective September 6, 2025. The company also appointed M/s. VRG & Associates as Secretarial Auditor for a five-year term from April 2025 to March 2030. Mr. Govil, a promoter with over 30 years of business management experience, holds degrees in chemical engineering and MBA in Finance. Mr. Shetty brings more than 30 years of experience in accounts, finance and taxation across manufacturing and EPC sectors. Both directors are confirmed as not being relatives of other board members.",
            "Sentiment": "positive",
            "PublishDate": 1759242085033,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ducon Infratechnologies Launches R&D Program for Solvent-Based Carbon Capture Technology",
            "Summary": "Ducon Infratechnologies has announced the launch of a research and development program to develop solvent-based carbon capture technology. The program aims to create scalable, cost-effective solutions to capture CO₂ from flue gas streams across power, cement, steel, oil & gas and other industries. The initiative builds on Ducon's experience in air pollution control, bulk material handling and clean energy. The R&D effort will focus on advanced solvent formulations, optimized mass-transfer equipment, and heat-integration schemes to reduce energy consumption and lifecycle costs. The initial phase includes bench-scale experimentation, process modeling, and partnerships with academic and industrial collaborators. The Indian carbon capture and storage market is projected to grow at 10.3% CAGR from 2025 to 2030. The company expects the initiative to create value through technology differentiation, high-margin EPC services, and strategic partnerships. Ducon plans to advance from bench-scale testing to pilot installation subject to validation milestones.",
            "Sentiment": "positive",
            "PublishDate": 1757496778353,
            "Source": "stock"
        },
        {
            "Title": "Ducon Infratechnologies Receives BSE Approval for Rs. 49.5 Crore Rights Issue",
            "Summary": "Ducon Infratechnologies Limited has received in-principle approval from BSE Limited for a proposed rights issue of equity shares worth up to Rs. 49.5 crores. The approval was granted through BSE's letter dated August 14, 2025. The rights issue will involve equity shares with a face value of Rs. 1 each, offered to eligible equity shareholders of the company. The company has informed the stock exchanges about this development through a regulatory communication signed by Company Secretary Darshit Parikh.",
            "Sentiment": "positive",
            "PublishDate": 1755488062772,
            "Source": "corporate_action"
        },
        {
            "Title": "Ducon Infratechnologies Reports Q1 Financial Results with Increased Revenue and Profit",
            "Summary": "Ducon Infratechnologies Limited announced its quarterly financial results for the period ended June 30, 2025. On a standalone basis, the company reported net sales of Rs 6,317.76 lakhs compared to Rs 6,112.15 lakhs in the same quarter last year, with net profit increasing to Rs 101.93 lakhs from Rs 96.97 lakhs. On a consolidated basis, net sales reached Rs 11,228.27 lakhs versus Rs 10,943.10 lakhs in the previous year, while net profit grew to Rs 313.14 lakhs from Rs 307.41 lakhs. The company operates primarily in Industrial EPC and Security Solution & AI segments, with Industrial EPC contributing the majority of revenue at Rs 11,192.27 lakhs. Basic earnings per share on a consolidated basis was Rs 0.10 compared to Rs 0.12 in the same quarter last year. The board meeting was held on August 12, 2025, and the results were reviewed by the Audit Committee.",
            "Sentiment": "positive",
            "PublishDate": 1755009539396,
            "Source": "earnings"
        },
        {
            "Title": "Ducon Infratechnologies Receives NSE Approval for Rs. 49.5 Crore Rights Issue",
            "Summary": "Ducon Infratechnologies Limited has received in-principle approval from the National Stock Exchange of India for a proposed rights issue of equity shares worth up to Rs. 49.5 crores. The rights issue involves equity shares with a face value of Rs. 1 each, to be offered to eligible equity shareholders. The NSE approval was granted on August 7, 2025, under reference number NSE/LIST/48472. The approval is subject to several conditions including filing the listing application from the date of allotment, obtaining statutory approvals from authorities including SEBI, RBI, and MCA, and compliance with listing regulations. Mark Corporate Advisors Private Limited will serve as the lead manager, while Bigshare Services Private Limited will act as the registrar for the issue.",
            "Sentiment": "positive",
            "PublishDate": 1754656453331,
            "Source": "corporate_action"
        },
        {
            "Title": "Ducon Infratechnologies' Credit Rating Reaffirmed at ACUITE B+ with Stable Outlook",
            "Summary": "Ducon Infratechnologies Limited received a revised credit rating from Acuite Ratings & Research Limited. The company's long-term bank facilities worth Rs. 45.49 crores have been reaffirmed at ACUITE B+ with a Stable outlook. The rating revision was based on the company's performance. The facilities include a cash credit facility from Bank of Baroda. The rating letter is valid until October 16, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753182533123,
            "Source": "stock"
        }
    ]
}