{
    "Symbol": "DVL",
    "ISIN": "INE477B01010",
    "News": [
        {
            "Title": "Dhunseri Ventures Board Meet on Feb 20 for Dividend",
            "Summary": "Dhunseri Ventures Limited has scheduled a board meeting on February 20, 2026, to consider declaration of interim dividend for FY 2025-26. Trading window closes from February 16-27, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770806922838,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dhunseri Ventures Reports Q2 Net Loss of 106.8M Rupees After Previous Year Profit",
            "Summary": "Dhunseri Ventures reported a consolidated net loss of 106.8 million rupees in Q2, compared to a profit of 605.8 million rupees in the same quarter of the previous year. The company's Q2 revenue was 1.48 billion rupees.",
            "Sentiment": "negative",
            "PublishDate": 1762862756949,
            "Source": "earnings"
        },
        {
            "Title": "Dhunseri Ventures Seeks Shareholder Approval for Winding Up Singapore Subsidiary Twelve Cupcakes",
            "Summary": "Dhunseri Ventures Limited has issued a postal ballot notice seeking shareholder approval for the voluntary winding up of its material subsidiary Twelve Cupcakes Pte Limited in Singapore. The company holds 81.83% stake in the subsidiary, which cannot continue business due to its liabilities and does not contribute significantly to consolidated turnover or profitability. The liquidation process will involve disposal of assets exceeding 20% of the subsidiary's assets and cessation of control over the material subsidiary. The board approved the proposal on October 29, 2025, following audit committee recommendation. Remote e-voting will be conducted from October 31 to November 29, 2025, with results to be announced by December 2, 2025. The liquidation aims to rationalize corporate structure, reduce administrative costs, and focus resources on core business activities.",
            "Sentiment": "neutral",
            "PublishDate": 1761854511478,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhunseri Ventures Approves ₹190 Crore BOPET Expansion Project in Panagarh",
            "Summary": "Dhunseri Ventures has announced approval for a BOPET (Biaxially Oriented Polyethylene Terephthalate) expansion project in Panagarh. The company plans to invest up to ₹190 crores in this expansion, with the project expected to take 2 years to complete.",
            "Sentiment": "positive",
            "PublishDate": 1761724328527,
            "Source": "stock"
        },
        {
            "Title": "Dhunseri Ventures Re-appoints Two Independent Directors and Names New Secretarial Auditor",
            "Summary": "Dhunseri Ventures Limited shareholders approved the re-appointment of Mrs. Anuradha Kanoria and Mr. Raj Vardhan Kejriwal as Independent Directors for five-year terms beginning August 8, 2025. The company also appointed M/s. Mamta Binani & Associates as Secretarial Auditor for five years from April 1, 2025 to March 31, 2030. These resolutions were approved at the company's 109th Annual General Meeting held on August 8, 2025, following initial Board approval in May 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754922587100,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dhunseri Ventures Reports Strong Q1 Performance with Revenue Growth and Doubled EBITDA",
            "Summary": "Dhunseri Ventures reported Q1 revenue of 1.7 billion rupees, up from 1.6 billion rupees in the previous year. The company's consolidated net profit increased to 713 million rupees from 700 million rupees year-over-year. EBITDA showed significant improvement, rising to 835 million rupees from 410 million rupees in the same period last year. The EBITDA margin expanded substantially to 48.12% compared to 25.4% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754897115550,
            "Source": "earnings"
        },
        {
            "Title": "NSE Receives SEBI Approval for Monthly Electricity Futures",
            "Summary": "The National Stock Exchange (NSE) has obtained approval from the Securities and Exchange Board of India (SEBI) to launch monthly electricity futures contracts. This development allows for trading in electricity futures on the NSE platform.",
            "Sentiment": "positive",
            "PublishDate": 1749687204000,
            "Source": "default"
        },
        {
            "Title": "Dhunseri Ventures' Unit Begins BOPP Plant Construction in Jammu & Kashmir",
            "Summary": "Dhunseri Ventures has announced that its unit has started construction of a BOPP (Biaxially Oriented Polypropylene) plant in Kathua, Jammu & Kashmir. This development indicates an expansion of the company's manufacturing capabilities in the region.",
            "Sentiment": "positive",
            "PublishDate": 1749445299000,
            "Source": "default"
        },
        {
            "Title": "Dhunseri Ventures Reports Q4 Net Loss of 870M Rupees",
            "Summary": "Dhunseri Ventures has reported its quarterly financial results. The company experienced a net loss of 870 million rupees in the latest quarter, compared to a profit of 243 million rupees in the same quarter of the previous year. Revenue for the quarter decreased to 1.5 billion rupees from 2.64 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1747732017000,
            "Source": "result"
        },
        {
            "Title": "Dhunseri Ventures Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "Dhunseri Ventures has reported a substantial increase in consolidated net profit for the third quarter, rising to 934 million rupees from 124 million rupees year-over-year. The company also saw a quarter-over-quarter increase from 678 million rupees. Revenue for Q3 grew to 1.26 billion rupees, up from 568 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739146407000,
            "Source": "earnings"
        },
        {
            "Title": "Dhunseri Ventures Reports Significant EBITDA Growth in Q3",
            "Summary": "Dhunseri Ventures has announced its Q3 financial results, showing substantial year-over-year improvement. The company's EBITDA increased to 355 million rupees, up from 127 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 28.11% from 22.32% in the previous year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738932268000,
            "Source": "earnings"
        },
        {
            "Title": "Dhunseri Ventures Reports Significant Profit Growth in Q3",
            "Summary": "Dhunseri Ventures has reported a substantial increase in its consolidated net profit for the third quarter. The company's net profit rose to 934 million rupees, compared to 124 million rupees in the same quarter last year, representing a year-over-year growth. The profit also increased quarter-over-quarter from 678 million rupees. Additionally, the company's revenue for Q3 reached 1.26 billion rupees, up from 568 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738932197000,
            "Source": "earnings"
        },
        {
            "Title": "Dhunseri Ventures Invests 300 Million Rupees in Subsidiary",
            "Summary": "Dhunseri Ventures has infused 300 million rupees (approximately $3.6 million USD) into its subsidiary, Dhunseri Poly Films. This investment indicates a significant financial commitment by the parent company to support and potentially expand the operations of its subsidiary in the polymer film industry.",
            "Sentiment": "positive",
            "PublishDate": 1736507256000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhunseri Investments to Increase Stake in Dhunseri Ventures",
            "Summary": "Dhunseri Investments is set to acquire an 8.79% stake in Dhunseri Ventures from Naga Dhunseri Group. This acquisition will increase Dhunseri Investment's ownership in Dhunseri Ventures from 56.44% to 65.23%.",
            "Sentiment": "neutral",
            "PublishDate": 1731679950000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dhunseri Ventures Reports Q2 Financial Results",
            "Summary": "Dhunseri Ventures Limited has reported its Q2 financial results. The company's net profit for the quarter stands at 526 million rupees, down from 1 billion rupees year-over-year and 833 million rupees quarter-over-quarter. Revenue for Q2 is 944 million rupees, decreased from 2.21 billion rupees year-over-year but increased from 230 million rupees quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1731284271000,
            "Source": "result"
        },
        {
            "Title": "Dhunseri Ventures Signs $4.7M Share Purchase Agreement with Subsidiary",
            "Summary": "<p><span class=\"neutral\">Dhunseri Ventures</span> has entered into a <span class=\"neutral\">share purchase agreement</span> with its <b>subsidiary</b>, <span class=\"neutral\">Dhunseri Overseas</span>, for <span class=\"positive\">$4.7 million</span>. This transaction represents a <span class=\"positive\">significant corporate action</span> involving the <span class=\"neutral\">transfer of shares</span> between the <b>parent company</b> and its <b>subsidiary</b>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728388261000,
            "Source": "corporate_action"
        }
    ]
}