{
    "Symbol": "DWARKESH",
    "ISIN": "INE366A01041",
    "News": [
        {
            "Title": "Dwarikesh Sugar Q3FY26 Results Show Strong Recovery",
            "Summary": "Dwarikesh Sugar Industries reported Q3FY26 PBT of Rs. 26.79 crore and PAT of Rs. 15.44 crore, marking significant improvement over previous year's Q3 performance with higher sugar sales and better realizations.",
            "Sentiment": "positive",
            "PublishDate": 1770809636550,
            "Source": "co_actions_results"
        },
        {
            "Title": "Marsons Limited Reports Q3FY26 Financial Results",
            "Summary": "Marsons Limited announced Q3FY26 unaudited financial results showing total income of Rs. 4658.07 lacs and net profit of Rs. 648.37 lacs for the quarter ended December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1770717981391,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dwarikesh Sugar Re-appoints Two Independent Directors",
            "Summary": "Dwarikesh Sugar Industries shareholders approve re-appointment of Shri Rajan Medhekar and Shri Gopal Hosur as Independent Directors for five-year terms through postal ballot voting.",
            "Sentiment": "neutral",
            "PublishDate": 1765618241612,
            "Source": "stocks"
        },
        {
            "Title": "Dwarikesh Sugar Industries Seeks Shareholder Approval for Re-appointment of Two Independent Directors",
            "Summary": "Dwarikesh Sugar Industries Limited has issued a postal ballot notice seeking shareholder approval for the re-appointment of two Non-Executive Independent Directors. The company proposes to re-appoint Shri Rajan Krishnanath Medhekar (DIN: 07940253) and Shri Gopal Bhimrao Hosur (DIN: 08884883) for a second term of five consecutive years from November 2, 2025 to November 1, 2030. Both directors are retired IPS officers whose current terms conclude on November 1, 2025. The e-voting facility will commence on November 13, 2025 at 9:00 a.m. IST and end on December 12, 2025 at 5:00 p.m. IST. Results will be declared on or before December 14, 2025. The postal ballot notice has been sent to shareholders through electronic means, with the company engaging CDSL for remote e-voting services and appointing VKM Associates as scrutinizer for the voting process.",
            "Sentiment": "neutral",
            "PublishDate": 1762892486878,
            "Source": "corporate_action"
        },
        {
            "Title": "Dwarikesh Sugar Plans Integrated Growth Through Cane Expansion and Ethanol Capacity Utilization",
            "Summary": "Dwarikesh Sugar is positioned for integrated growth through multiple strategic initiatives. The company is focusing on increased sugarcane acreage and productivity improvements while maximizing ethanol capacity utilization. Key areas include value-added ethanol blending opportunities, enhanced plant efficiency, and cost control measures. The expansion strategy is supported by strong domestic demand, firm sugar prices, and diversification into green energy initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1761918281730,
            "Source": "stock"
        },
        {
            "Title": "Dwarikesh Sugar Industries Reports Wider Net Loss in Q2 Results",
            "Summary": "Dwarikesh Sugar Industries reported a net loss of 326 million rupees in Q2, compared to a loss of 240 million rupees in the same period last year. The company's revenue remained flat at 2.5 billion rupees, unchanged from the previous year's Q2 figure of 2.5 billion rupees.",
            "Sentiment": "negative",
            "PublishDate": 1761904000145,
            "Source": "earnings"
        },
        {
            "Title": "Dwarikesh Sugar Industries Schedules Board Meeting for October 31 to Review Q2 Results and Director Appointments",
            "Summary": "Dwarikesh Sugar Industries Limited has scheduled a Board of Directors meeting for October 31, 2025, to be held via video conferencing. The meeting will consider unaudited financial results for the quarter and half year ended September 30, 2025. The board will also consider reappointment of Shri Rajan Madhekar and Shri Gopal Bhimrao Hosur as Non-Executive Independent Directors. Additionally, the board will take on record the retirement of Shri Prithviraj Natrajan Kokkarne and Ms. Nina Chatrath, which was previously communicated to stock exchanges on September 17, 2025. The company has implemented a trading window closure for designated persons from October 1, 2025, until 48 hours after the financial results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1760951446708,
            "Source": "corporate_action"
        },
        {
            "Title": "Dwarikesh Sugar Industries Appoints New Directors and Secretarial Auditor at 31st AGM",
            "Summary": "Dwarikesh Sugar Industries Limited held its 31st Annual General Meeting on August 19, 2025, where shareholders approved multiple key appointments and corporate matters. The company re-appointed Shri Vijay S. Banka as Director and appointed three new directors for five-year terms: Ms. Priyanka G. Morarka as Executive Director, Shri Arun K. Tulsian and Mrs. Bharati Balaji as Non-Executive Independent Directors. Ms. Morarka is the daughter of Chairman Shri Gautam R. Morarka and brings expertise in sustainability and ESG practices. The meeting also approved the appointment of M/s VKM & Associates as Secretarial Auditor for five years starting FY 2025-26. Other approved matters included adoption of financial statements for the year ended March 31, 2025, dividend declaration, and ratification of cost auditor remuneration for FY 2025-26. The AGM was attended by 74 shareholders, including 8 from the promoter group and 66 public shareholders, out of 187,195 total shareholders as of the record date.",
            "Sentiment": "neutral",
            "PublishDate": 1755599190657,
            "Source": "corporate_action"
        },
        {
            "Title": "Dwarikesh Sugar Plans Recovery Strategy with Ethanol Focus and Capacity Expansion",
            "Summary": "Dwarikesh Sugar is implementing a recovery plan centered on ethanol production as the company addresses red-rot disease issues. The strategy includes gradually switching sugar cane varieties, increasing capacity utilization, and improving operational efficiency across its integrated agro-energy platform that combines three business segments.",
            "Sentiment": "positive",
            "PublishDate": 1754579161699,
            "Source": "stock"
        },
        {
            "Title": "Dwarikesh Sugar Reports Reduced Losses in Q1 FY26, Reconstitutes Board Committees",
            "Summary": "Dwarikesh Sugar Industries Limited reported a loss after tax of Rs. 9.38 crore for the quarter ended June 30, 2025, compared to Rs. 9.73 crore in the same period last year. Total income increased to Rs. 405.97 crore from Rs. 341.85 crore. The company sold 6.63 lakh quintals of sugar at an average realization of Rs. 3,962 per quintal, while industrial alcohol sales rose to 21,649 KL from 12,358 KL. Financial performance was impacted by early conclusion of crushing operations and distillery operations ending in early June 2025. The company has cleared all cane dues for the 2024-25 sugar season and maintains outstanding long-term loans of Rs. 132.33 crore. The Board approved induction of new directors into various committees effective August 7, 2025, and reconstituted committees effective September 18, 2025, including Audit, Nomination and Remuneration, Stakeholders' Relationship, CSR, and Risk Management committees.",
            "Sentiment": "neutral",
            "PublishDate": 1754567708464,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dwarikesh Sugar Industries Reports Mixed Q1 Results with Revenue Growth and Reduced Losses",
            "Summary": "Dwarikesh Sugar Industries reported Q1 EBITDA of 39 million rupees compared to 23 million rupees in the same period last year. The company's EBITDA margin improved to 0.97% from 0.67% year-over-year. Revenue increased to 4 billion rupees from 3.4 billion rupees in the previous year's corresponding quarter. Despite the revenue growth, the company posted a net loss of 94 million rupees, though this was slightly lower than the 97 million rupees loss recorded in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1754559900700,
            "Source": "earnings"
        },
        {
            "Title": "Dwarikesh Sugar Industries Fined 200,000 Rupees After Fatal Accident",
            "Summary": "Dwarikesh Sugar Industries has been penalized with a fine of 200,000 Rupees following a fatal accident that resulted in the death of the company's Head Fitter. The company was found liable under the Uttar Pradesh Factories Rules for the incident. This tragic event highlights potential safety concerns within the company's operations.",
            "Sentiment": "negative",
            "PublishDate": 1752063004000,
            "Source": "default"
        },
        {
            "Title": "Dwarikesh Sugar Industries Reports Q4 Financial Results",
            "Summary": "Dwarikesh Sugar Industries has reported its Q4 financial results. The company's EBITDA increased to 1.07 billion rupees from 732 million rupees year-over-year. The EBITDA margin improved to 23.32% from 19.26% in the same period. Revenue rose to 4.6 billion rupees from 3.8 billion rupees year-over-year. Net profit for the quarter stood at 460 million rupees, up from 229 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747907746000,
            "Source": "result"
        },
        {
            "Title": "Dwarikesh Sugar Industries Reports Q3 Revenue",
            "Summary": "Dwarikesh Sugar Industries has reported a quarterly revenue of 3.1 billion rupees for Q3, compared to 3.13 billion rupees in the same quarter of the previous year, indicating a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1737967799000,
            "Source": "earnings"
        },
        {
            "Title": "Dwarikesh Sugar Industries Reports Q3 EBITDA Growth",
            "Summary": "Dwarikesh Sugar Industries has reported an increase in its Q3 EBITDA to 272 million rupees, up from 260 million rupees in the same quarter last year. The company's EBITDA margin also improved to 8.70% from 8.30% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1737967785000,
            "Source": "earnings"
        },
        {
            "Title": "Dwarikesh Sugar Industries Reports Increased Q3 Net Profit",
            "Summary": "Dwarikesh Sugar Industries has reported a net profit of 107 million rupees for the third quarter, compared to 98 million rupees in the same period last year, showing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1737967738000,
            "Source": "earnings"
        },
        {
            "Title": "Dwarikesh Sugar Industries Reports Q2 EBITDA Loss",
            "Summary": "Dwarikesh Sugar Industries has reported an EBITDA loss of 230 million rupees for the second quarter, compared to a loss of 287 million rupees in the same period last year. This represents a year-over-year improvement in the company's financial performance, despite still being in a loss position.",
            "Sentiment": "neutral",
            "PublishDate": 1730105527000,
            "Source": "result"
        },
        {
            "Title": "Dwarikesh Sugar Industries Reports Q2 Revenue Decline",
            "Summary": "Dwarikesh Sugar Industries has reported a significant decrease in its second-quarter revenue. The company's revenue for Q2 stood at 2.5 billion rupees, compared to 4.5 billion rupees in the same quarter of the previous year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1730105513000,
            "Source": "result"
        },
        {
            "Title": "Dwarikesh Sugar Industries Reports Q2 Net Loss",
            "Summary": "Dwarikesh Sugar Industries has reported a net loss of 240 million rupees in the second quarter, compared to a profit of 103 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730105487000,
            "Source": "result"
        }
    ]
}