{
    "Symbol": "DYCL",
    "ISIN": "INE600Y01019",
    "News": [
        {
            "Title": "Dynamic Cables Launches Green Building Wires",
            "Summary": "Dynamic Cables Limited announced the launch of PVC Insulated FR-LSH and HR-FRLSH Green Building Wires on February 12, 2026, targeting B2B markets through existing manufacturing facilities.",
            "Sentiment": "positive",
            "PublishDate": 1770905701641,
            "Source": "stocks"
        },
        {
            "Title": "Dynamic Cables Gets UL Certification & BIS License",
            "Summary": "Dynamic Cables Limited receives UL certification for PV solar cables enabling US market access and BIS license for PVC cable manufacturing at Reengus plant, expanding global reach and production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1769608657766,
            "Source": "stocks"
        },
        {
            "Title": "Dynamic Cables Eyes Solar Business Growth",
            "Summary": "Dynamic Cables expects its solar business sales to double in 3-4 years, with the segment currently contributing 15-20% to total revenue.",
            "Sentiment": "positive",
            "PublishDate": 1769571408677,
            "Source": "stocks"
        },
        {
            "Title": "Dynamic Cables Plans Rs 40-45 Cr Plant Investment",
            "Summary": "Dynamic Cables announces new manufacturing facility by FY2026 with Rs 40-45 crore capex, targeting Rs 250-260 crore annual turnover boost and 10-11% B2B gross margins.",
            "Sentiment": "positive",
            "PublishDate": 1769571386799,
            "Source": "stocks"
        },
        {
            "Title": "Dynamic Cables Q3 Net Profit Jumps 41.77% YoY",
            "Summary": "Dynamic Cables reported a strong Q3 performance with net profit rising to ₹224 million from ₹158 million in the previous year, marking significant year-on-year growth for the cable manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1769497399033,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dynamic Cables Q3FY26 Earnings Call on Jan 27",
            "Summary": "Dynamic Cables Limited announces earnings conference call scheduled for January 27, 2026 at 2:00 PM IST to discuss Q3FY26 financial results with investors and analysts through PhillipCapital.",
            "Sentiment": "neutral",
            "PublishDate": 1768909948056,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dynamic Cables Gets NABL Accreditation for QC Lab",
            "Summary": "Dynamic Cables Limited receives NABL accreditation for its Quality Control Laboratory at Reengus Unit under ISO/IEC 17025:2017 standards, valid until January 2030.",
            "Sentiment": "positive",
            "PublishDate": 1768223003102,
            "Source": "stocks"
        },
        {
            "Title": "Dynamic Cables Grants 2 Lakh ESOPs to Employees",
            "Summary": "Dynamic Cables Limited approved grant of 2,00,000 employee stock options under DCL-ESOP 2024 scheme at exercise price of ₹324 per option with 3-year exercise window post vesting.",
            "Sentiment": "positive",
            "PublishDate": 1765454846795,
            "Source": "stocks"
        },
        {
            "Title": "Dynamic Cables Secures UL 854 Certification for U.S. Market Entry",
            "Summary": "Dynamic Cables has obtained UL 854 certification from UL Solutions, a key regulatory approval for cable products. This certification enables the company to enter the U.S. market and other UL-regulated markets, expanding its business opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1764546987658,
            "Source": "stock"
        },
        {
            "Title": "Dynamic Cables Receives PowerGrid Approval for ACSR Conductor Manufacturing",
            "Summary": "Dynamic Cables Limited has received approval from Power Grid Corporation of India Limited for manufacturing and supply of ACSR AL59 conductors (up to 61 strands) at its Rajasthan facility. The approval establishes the company's manufacturing plant as technically suitable for conductor production and is expected to enhance eligibility for future PowerGrid projects and additional business development opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1764417999644,
            "Source": "stock"
        },
        {
            "Title": "Dynamic Cables Receives UL 854 Certification, Opens Access to U.S. Markets",
            "Summary": "Dynamic Cables has obtained UL 854 certification from UL Solutions, a regulatory approval that enables the company to access U.S. and other international markets. This certification represents a significant market expansion opportunity for Dynamic Cables by meeting required safety and quality standards for cable products in these regions.",
            "Sentiment": "positive",
            "PublishDate": 1764336580260,
            "Source": "stock"
        },
        {
            "Title": "Dynamic Cables Gets Credit Rating Upgrade to IND A from India Ratings",
            "Summary": "India Ratings and Research upgraded Dynamic Cables Limited's bank loan facilities rating to IND A from IND A-, maintaining a stable outlook. The upgrade covers bank loan facilities worth Rs 3,560 million. The rating improvement reflects enhanced operational scale and profitability during FY25 and first half of FY26. Dynamic Cables reported revenue of Rs 10,254 million in FY25 compared to Rs 7,680 million in FY24, with EBITDA margin of 10.28%. The company raised Rs 965 million through preferential share allotment in June 2024, which supported ongoing capex and reduced debt levels. The company has an unexecuted order book of Rs 7,210 million as of September 2025. A greenfield capex for renewable sector cables manufacturing in Rajasthan is expected to complete by March 2026. The rating agency expects credit metrics to remain comfortable with gross interest coverage improving to 6.90x in FY25 from 3.73x in FY24, and net adjusted leverage improving to 0.92x from 2.89x.",
            "Sentiment": "positive",
            "PublishDate": 1762810671517,
            "Source": "corporate_action"
        },
        {
            "Title": "Dynamic Cables Reports Record H1 Revenue and Profitability, Order Book at Rs 721 Crores",
            "Summary": "Dynamic Cables Limited reported its highest-ever first half revenue and profitability for H1 FY26. Sales increased 23% year-on-year while operating profit rose 27% to Rs 57.8 crores. Operating margins stood at 10.6% and profit after tax grew 49% to Rs 38 crores. The company's order book stands at Rs 721 crores as of September 30, 2025. Customer-wise contribution showed government sales at 12%, private sales at 78%, and exports at 10%. Product-wise breakdown included HV sales at 55%, LV cables at 37%, and conductors at 8%. Management noted demand slowdown due to extended monsoon affecting EPC execution, but expects improvement in third and fourth quarters. The company's capacity expansion plan remains on schedule for commissioning in the second half of FY26, with a new greenfield plant including E-beam facility for solar DC cables. Current monthly capacity stands at Rs 135 crores after debottlenecking initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1761909651206,
            "Source": "earnings"
        },
        {
            "Title": "Dynamic Cables Limited Reports Quarterly Results and Issues Bonus Shares",
            "Summary": "Dynamic Cables Limited's Board of Directors approved unaudited financial results for the quarter and half year ended September 30, 2025. The company reported revenue from operations of Rs 28,155.68 lakhs for the quarter, compared to Rs 23,414.50 lakhs in the same period last year. Net profit for the quarter stood at Rs 1,918.91 lakhs versus Rs 1,385.40 lakhs in the previous year. The company issued bonus equity shares in a 1:1 ratio on July 15, 2025, increasing paid-up capital to Rs 4,845.86 lakhs from Rs 2,422.93 lakhs. The Board also amended the Code of Practices and Procedures for Fair Disclosure of Unpublished Price Sensitive Information. Trading window for designated persons will open from October 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761634635452,
            "Source": "earnings"
        },
        {
            "Title": "Dynamic Cables Designates Manoj Chaturvedi as Head of Design Department",
            "Summary": "Dynamic Cables Limited has designated Manoj Chaturvedi as Head of the Design Department, categorizing him as Senior Management Personnel effective September 22, 2025. The move is part of an internal restructuring of departments. Chaturvedi, an existing employee, brings 34 years of experience in the Wire & Cable industry with expertise in process development and design of EHV, HT, LT, Control, and Instrumentation cables. He was previously associated with Universal Cables Ltd. The appointment has no specific term as he continues in full-time employment with the company.",
            "Sentiment": "positive",
            "PublishDate": 1758546816935,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dynamic Cables Receives BIS Licenses and Increases Production Capacity Assessment to Rs.135 Crores Monthly",
            "Summary": "Dynamic Cables Limited received regulatory approvals from the Bureau of Indian Standards for two manufacturing licenses. The company obtained licenses to manufacture High Conductivity Aluminium Alloy Stranded Conductors and Thermosetting Insulated Armoured Fire Survival Cables for voltages up to 1100V AC and 1500V DC. The licenses are valid until August 2026. Following debottlenecking initiatives and incremental capital expenditure over six months, the company reassessed its production capacity to support monthly turnover of up to Rs.135 crores, increased from the previous assessment of Rs.100 crores. The company noted that revenue utilization will depend on product mix, orders in hand, and delivery schedules which vary monthly.",
            "Sentiment": "positive",
            "PublishDate": 1755609658219,
            "Source": "stock"
        },
        {
            "Title": "Dynamic Cables Reports Record Q1 Revenue Growth of 26% YoY, Order Book Reaches Rs 734 Crores",
            "Summary": "Dynamic Cables Limited reported its highest ever Q1 revenue with 26% year-on-year growth and 28% volume growth. Operating profit increased 23% to Rs 26.9 crores while maintaining stable operating margins at 10.3%. Profit after tax grew 57%. The company's order book reached Rs 734 crores as of June 30, 2025, up 57% year-on-year. Customer mix comprised 82% private sector sales, 9% government sales, and 9% exports. Product mix included 51% high voltage cables, 39% low voltage cables, and 8% conductors. The company is proceeding with a Rs 35 crores capacity expansion project expected to be commissioned in the second half of FY26, focusing on solar cables and high voltage products. Management maintains EBITDA margin guidance of 10-10.5% and expects to be debt-free from long-term obligations by year-end.",
            "Sentiment": "positive",
            "PublishDate": 1753525395888,
            "Source": "earnings"
        },
        {
            "Title": "Dynamic Cables Limited Shares Audio Recording of Q1 FY26 Results Conference Call",
            "Summary": "Dynamic Cables Limited has made available the audio recording of its conference call held on July 23, 2025, which discussed the company's financial results for the quarter ended June 30, 2025. The recording can be accessed through a web link provided by the company. The disclosure was made by Company Secretary and Compliance Officer Naina Gupta as a continuation of their earlier communication dated July 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753269912342,
            "Source": "earnings"
        },
        {
            "Title": "Dynamic Cables Reports 57% Jump in Q1 Net Profit to 182 Million Rupees",
            "Summary": "Dynamic Cables reported strong Q1 financial results with net profit rising to 182 million rupees compared to 116 million rupees in the same period last year, marking a 57% increase. Revenue grew to 2.62 billion rupees from 2.1 billion rupees year-over-year, representing a 25% increase. EBITDA increased to 269 million rupees from 219 million rupees, though EBITDA margin declined slightly to 10.3% from 10.5% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753253915585,
            "Source": "earnings"
        },
        {
            "Title": "Dynamic Cables Plans Production Capacity Expansion",
            "Summary": "Dynamic Cables has announced plans to increase its yearly production capacity by 30,000 kilometers at its Reengus facility, expected to be completed in the second half of FY26. The company also intends to invest ₹35 crore to boost its cable and specialty conductor production capacity by 20%.",
            "Sentiment": "positive",
            "PublishDate": 1751269999000,
            "Source": "default"
        },
        {
            "Title": "Dynamic Cables Announces 1:1 Bonus Share Issue",
            "Summary": "Dynamic Cables has announced a bonus share issue in the ratio of 1:1. This means shareholders will receive one additional share for every share they currently hold.",
            "Sentiment": "positive",
            "PublishDate": 1748587364000,
            "Source": "default"
        },
        {
            "Title": "Dynamic Cables Reports Strong Q4 Profit Growth",
            "Summary": "Dynamic Cables has reported a significant increase in net profit for the fourth quarter. The company's net profit rose to 236 million rupees, up from 138 million rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1747117560000,
            "Source": "result"
        },
        {
            "Title": "Dynamic Cables Secures BIS License for Solar DC Cables",
            "Summary": "Dynamic Cables has announced the acquisition of a Bureau of Indian Standards (BIS) license for their solar DC cables. This approval is expected to bolster the company's growth prospects in the renewable energy sector, with a particular focus on the solar energy segment.",
            "Sentiment": "positive",
            "PublishDate": 1743466379000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dynamic Cables Receives BIS License for Solar DC Cables",
            "Summary": "Dynamic Cables has announced that it has been granted a Bureau of Indian Standards (BIS) license for solar DC cables. The company states that this approval will support its growth in the renewable energy sector, particularly in the solar energy segment.",
            "Sentiment": "positive",
            "PublishDate": 1743171536000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dynamic Cables Increases Production Capacity",
            "Summary": "Dynamic Cables has announced an increase in its turnover capacity from existing plants. The company's production capability has now risen to 11-11.5 billion rupees per annum.",
            "Sentiment": "positive",
            "PublishDate": 1738056162000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dynamic Cables to Consider Q3 Results",
            "Summary": "Dynamic Cables Limited has announced that it will consider its financial results for the third quarter on January 28.",
            "Sentiment": "neutral",
            "PublishDate": 1737549356000,
            "Source": "earnings"
        },
        {
            "Title": "Dynamic Cables Reports Strong Q2 Results and Launches DC Solar Cables",
            "Summary": "Dynamic Cables has reported significant year-over-year and quarter-over-quarter growth in Q2 net profit and revenue. The company's Q2 net profit increased to 138 million rupees, up from 51 million rupees year-over-year and 116 million rupees quarter-over-quarter. Q2 revenue rose to 2.34 billion rupees from 1.53 billion rupees year-over-year. Additionally, the company has announced the launch of direct current (DC) solar cables, which are extensively used in solar power plants, in response to the growing transition towards renewable energy.",
            "Sentiment": "positive",
            "PublishDate": 1729642666000,
            "Source": "result"
        },
        {
            "Title": "Dynamic Cable Launches DC Solar Cables for Renewable Energy Sector",
            "Summary": "Dynamic Cable has announced the launch of Direct Current (DC) solar cables, which are extensively used in solar power plants. This move is in response to the growing transition towards renewable energy sources.",
            "Sentiment": "positive",
            "PublishDate": 1729603060000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dynamic Cables Reports Strong Q2 Revenue Growth",
            "Summary": "Dynamic Cables has reported a significant increase in its second quarter revenue. The company's revenue for Q2 reached 2.34 billion rupees, compared to 1.53 billion rupees in the same quarter of the previous year, representing a substantial year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1729597562000,
            "Source": "result"
        },
        {
            "Title": "Dynamic Cables Reports Significant Profit Growth in Q2",
            "Summary": "Dynamic Cables has announced its Q2 financial results, showing a substantial increase in net profit. The company reported a net profit of 138 million rupees, up from 51 million rupees in the same quarter last year (YoY). This also represents an increase from 116 million rupees in the previous quarter (QoQ).",
            "Sentiment": "positive",
            "PublishDate": 1729597550000,
            "Source": "result"
        }
    ]
}