{
    "Symbol": "DYNAMIC",
    "ISIN": "INE0DZ701010",
    "News": [
        {
            "Title": "Dynamic Services & Security Secures 297 Million Rupee Payroll Services Contract",
            "Summary": "Dynamic Services & Security has signed a one-year payroll services deal valued at 297 million rupees. The contract represents a significant business development for the company's service operations.",
            "Sentiment": "positive",
            "PublishDate": 1762782383474,
            "Source": "order&deals"
        },
        {
            "Title": "Dynamic Services & Securities Ltd: Secures Rs 476-Crore Contract with Orion Security",
            "Summary": "Dynamic Services & Securities Ltd. signed an MoU with Orion Security for a Rs 476 crore work contract. The agreement, effective from Jan. 4, 2025 to March 31, 2027, involves DSSL assisting Orion in collecting receivables from clients. The company's share price rose to its upper circuit limit following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1736224952000,
            "Source": "order&deals"
        },
        {
            "Title": "Dynamic Services & Security Signs MoU for 4.76 Billion Rupee Contract",
            "Summary": "Dynamic Services & Security has entered into a Memorandum of Understanding (MoU) with Orion Security for a contract valued at 4.76 billion rupees. This agreement represents a significant business deal for Dynamic Services & Security, potentially impacting their future operations and financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1736208420000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dynamic Services & Security Signs MOU for 4.76 Billion Rupee Contract",
            "Summary": "Dynamic Services & Security has entered into a Memorandum of Understanding (MOU) with Orion Security for a contract valued at 4.76 billion rupees. This agreement represents a significant business deal for Dynamic Services & Security, potentially impacting their future operations and financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1736179442000,
            "Source": "order&deals"
        },
        {
            "Title": "Dynamic Services & Security to Set Up Solar PV Panel Manufacturing Project in Maharashtra",
            "Summary": "Dynamic Services & Security has received an offer letter from the Government of Maharashtra for a 'mega project' to establish a new manufacturing facility for Solar PV Panels with a capacity of 1800 MW. The company has decided to make a fixed capital investment of 10.8 billion rupees in this project.",
            "Sentiment": "positive",
            "PublishDate": 1733357062000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dynamic Services & Security Limited: Secures ₹1,080 Crore Solar Project from Maharashtra Government",
            "Summary": "Dynamic Services & Security Limited (DSSL) received an offer letter from the Maharashtra government for a ₹1,080-crore solar PV manufacturing project with 1,800 MW capacity in MIDC Villebhagad, Raigad district. The company's stock reached a 52-week high, closing at ₹373.65, up 1.96%.",
            "Sentiment": "positive",
            "PublishDate": 1733316752000,
            "Source": "order&deals"
        },
        {
            "Title": "Dynamic Services & Security to Manufacture Solar PV Panels in Maharashtra",
            "Summary": "Dynamic Services & Security has received an offer letter from the Government of Maharashtra for a 'Mega Project' to set up a new manufacturing facility for solar PV panels with a capacity of 1800 MW. The company has decided to make a fixed capital investment of 10.8 billion rupees in this project.",
            "Sentiment": "positive",
            "PublishDate": 1733314405000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mehai Technology Launches Rail Neer Plant in Andhra Pradesh",
            "Summary": "Dynamic Services & Security's subsidiary, Mehai Technology, has commenced operations of a Rail Neer plant in Andhra Pradesh. The plant has received operational approval from the Indian Railway Catering and Tourism Corporation (IRCTC).",
            "Sentiment": "positive",
            "PublishDate": 1729077738000,
            "Source": "corporate_action"
        }
    ]
}