{
    "Symbol": "DYNAMATECH",
    "ISIN": "INE221B01012",
    "News": [
        {
            "Title": "Dynamatic Technologies Q3FY26 Results & Dividend",
            "Summary": "Dynamatic Technologies reports Q3FY26 standalone revenue of ₹21,826 lakhs, up 44.76% YoY. Board declares interim dividend of ₹5 per share with record date February 13, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770653359044,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dynamic Technologies Board Meet Set for Feb 9, 2026",
            "Summary": "Dynamic Technologies Limited schedules board meeting on February 9, 2026 to review Q3FY26 unaudited financial results and consider interim dividend declaration for equity shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1769772848704,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dynamic Technologies Gets Income Tax Order for AY 2023-24",
            "Summary": "Dynamic Technologies Limited received an Income Tax Order under Section 92CA(3) for Assessment Year 2023-24, involving transfer pricing adjustments on delayed management fee receivables with a claim quantum of ₹10.91 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1768833328641,
            "Source": "stocks"
        },
        {
            "Title": "Dynamatic Technologies Seeks Shareholder Approval",
            "Summary": "Dynamatic Technologies initiates postal ballot for appointing Air Chief Marshal V.R. Chaudhari (Retd.) and Ms. Shyamala Venkatachalam as Independent Directors. E-voting commences January 19, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768559203162,
            "Source": "stocks"
        },
        {
            "Title": "Dynamatic Technologies Delivers Airbus A220 Doors Early",
            "Summary": "Dynamatic Technologies achieves early delivery of Airbus A220 doors with over 99% local content, marking a significant milestone for India's Make In India initiative in aerospace manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1768293871884,
            "Source": "stocks"
        },
        {
            "Title": "Dynamatic Technologies Delivers First Complete A220 Doors",
            "Summary": "Dynamatic Technologies Limited announces delivery of first complete ship-set of all eight doors for Airbus A220 aircraft, marking significant milestone for Make in India initiative with 99% indigenous content.",
            "Sentiment": "positive",
            "PublishDate": 1768293851742,
            "Source": "stocks"
        },
        {
            "Title": "Dynamatic Technologies Appoints Two New Independent Directors",
            "Summary": "Dynamatic Technologies Limited has appointed Air Chief Marshal V.R. Chaudhari (Retd.) and Ms. Shyamala Venkatachalam as Additional Independent Directors for five-year terms starting December 23, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766484762100,
            "Source": "stocks"
        },
        {
            "Title": "Dynamatic Tech Partners with Dassault Aviation for Falcon 6X Rear Fuselage Manufacturing",
            "Summary": "Dynamatic Tech has signed an agreement with Dassault Aviation to manufacture the complete rear fuselage for the Falcon 6X business jet. This partnership positions Dynamatic Tech as a key supplier in Dassault's latest business jet production program.",
            "Sentiment": "positive",
            "PublishDate": 1765151564630,
            "Source": "order&deals"
        },
        {
            "Title": "Dynamatic Tech Partners with Dassault Aviation for Falcon 6X Manufacturing",
            "Summary": "Dynamatic Tech has entered into an agreement with Dassault Aviation to manufacture the full rear fuselage for the Falcon 6X business jet. This manufacturing partnership positions Dynamatic Tech as a key supplier in the production of Dassault's business aircraft components.",
            "Sentiment": "positive",
            "PublishDate": 1765005599772,
            "Source": "order&deals"
        },
        {
            "Title": "Dynamatic Tech Reports Mixed Q2 Results, Approves New Subsidiary Creation",
            "Summary": "Dynamatic Tech approved the creation of a new wholly owned subsidiary. The company reported Q2 revenue of 3.9 billion rupees, up from 3.6 billion rupees year-over-year. EBITDA increased to 462 million rupees from 410 million rupees, with EBITDA margin improving to 11.78% from 11.36%. Profit before tax rose to 185 million rupees from 160 million rupees. However, consolidated net profit declined significantly to 33 million rupees from 120 million rupees year-over-year. The company recorded an exceptional item of 69 million rupees during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762788456893,
            "Source": "stock"
        },
        {
            "Title": "Dynamatic Technologies Partners Exclusively with L&T-BEL for 5th Generation Fighter Aircraft Program",
            "Summary": "Dynamatic Technologies Ltd has joined L&T-BEL's 5th Generation Fighter Aircraft Program as an exclusive partner. The partnership aims to enhance local skills in advanced aerospace production.",
            "Sentiment": "positive",
            "PublishDate": 1762236914156,
            "Source": "order&deals"
        },
        {
            "Title": "Airbus Board Makes First-Ever Visit to India, Strengthening Partnership with Dynamatic Tech",
            "Summary": "Airbus board members conducted their first-ever visit to India, highlighting Dynamatic Tech's significant role in Airbus' India operations. The visit signals a strengthening of the global partnership between the aerospace companies, with Dynamatic Tech positioned as a key player in Airbus' strategic goals for the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1759234474874,
            "Source": "stock"
        },
        {
            "Title": "Dynamatic Tech Reports Mixed Q1 Results with Revenue Growth but Lower Profitability",
            "Summary": "Dynamatic Tech announced quarterly results showing revenue growth to 3.7 billion rupees from 3.5 billion rupees year-over-year. However, the company's profitability metrics declined, with EBITDA falling to 378 million rupees from 401 million rupees, and EBITDA margin dropping to 10.19% from 11.57%. Consolidated net profit also decreased to 108 million rupees from 114 million rupees compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1754576616185,
            "Source": "earnings"
        },
        {
            "Title": "Dynamatic Tech Announces Dividend and Q4 EBITDA Results",
            "Summary": "Dynamatic Tech has recommended a dividend of 5 rupees per equity share. The company reported Q4 EBITDA of 379 million rupees, down from 429 million rupees in the same quarter last year. The Q4 EBITDA margin decreased to 9.97% from 11.57% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1748355388000,
            "Source": "result"
        },
        {
            "Title": "Dynamatic Tech Reports Q4 Financial Results",
            "Summary": "Dynamatic Tech has reported its Q4 consolidated net profit at 161 million rupees, compared to 571 million rupees year-over-year and 35 million rupees quarter-over-quarter. The company's Q4 revenue stands at 3.8 billion rupees, up from 3.7 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1748355296000,
            "Source": "result"
        },
        {
            "Title": "Dynamatic Technologies and Deutsche Aircraft Launch D328eco Rear Fuselage Assembly Line in Bangalore",
            "Summary": "Dynamatic Technologies and Deutsche Aircraft have inaugurated a new assembly line for the D328eco aircraft's rear fuselage in Bangalore, India. This collaboration strengthens the aerospace partnership between India and the European Union, showcasing India's growing capabilities in high-tech manufacturing for the aviation industry.",
            "Sentiment": "positive",
            "PublishDate": 1745194838000,
            "Source": "default"
        },
        {
            "Title": "Dynamatic Technologies Inaugurates Rear Fuselage Assembly Line for D328ECO Aircraft",
            "Summary": "Dynamatic Technologies has inaugurated a new rear fuselage assembly line for the 40-seater D328ECO turboprop aircraft at its advanced aerospace facility in Bangalore. This development signifies the company's expansion in the aerospace manufacturing sector and its capability to produce components for modern aircraft.",
            "Sentiment": "positive",
            "PublishDate": 1745057758000,
            "Source": "default"
        },
        {
            "Title": "Dynamatic Technologies Collaborates with Deutsche Aircraft at Aero India 2025",
            "Summary": "Dynamatic Technologies has announced a collaboration with Deutsche Aircraft at the upcoming Aero India 2025 event. This partnership likely aims to showcase their joint capabilities in the aerospace sector, potentially exploring new opportunities in aircraft manufacturing or related technologies.",
            "Sentiment": "positive",
            "PublishDate": 1739204847000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dynamatic Technologies Reports Decline in Q3 Net Profit and Revenue",
            "Summary": "Dynamatic Technologies has reported a significant decrease in its consolidated net profit for the third quarter, falling to 35 million rupees from 112 million rupees year-over-year. The company's revenue also declined to 3.15 billion rupees from 3.46 billion rupees in the same period last year. Compared to the previous quarter, net profit decreased from 120 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1739146370000,
            "Source": "earnings"
        },
        {
            "Title": "Dynamatic Technologies Reports Q3 EBITDA and Margin Results",
            "Summary": "Dynamatic Technologies has reported its Q3 EBITDA at 393 million rupees, compared to 407 million rupees in the same quarter last year. Despite the slight decrease in EBITDA, the company's EBITDA margin improved to 12.46% from 11.78% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738937760000,
            "Source": "earnings"
        },
        {
            "Title": "Dynamatic Technologies Reports Q3 FY24 Financial Results",
            "Summary": "Dynamatic Technologies has reported its Q3 financial results. The company's consolidated net profit decreased to 35 million rupees, compared to 112 million rupees year-over-year and 120 million rupees quarter-over-quarter. Revenue for Q3 stood at 3.15 billion rupees, down from 3.46 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1738937671000,
            "Source": "earnings"
        },
        {
            "Title": "Dynamatic Technologies: Aerospace Segment Drives Growth Amid Market Challenges",
            "Summary": "Dynamatic Technologies reported flat Q2FY25 revenue at ₹361 crore. Aerospace segment grew 14.9% YoY to ₹148 crore, while hydraulics increased 28.3% YoY to ₹130 crore. Metallurgy segment declined 31.3% YoY. The company secured orders potentially doubling its aerospace business in 30 months. ICICI Securities maintains a 'buy' rating with a target price of ₹10,250.",
            "Sentiment": "positive",
            "PublishDate": 1735799524000,
            "Source": "earnings"
        },
        {
            "Title": "Dynamatic Technologies Awarded Contract for Airbus A220 Door Components",
            "Summary": "Dynamatic Technologies has been awarded a contract by Aequs for the supply of complex door components for the Airbus A220 aircraft. This order represents a significant business opportunity for Dynamatic Technologies in the aerospace manufacturing sector.",
            "Sentiment": "positive",
            "PublishDate": 1734500801000,
            "Source": "order&deals"
        },
        {
            "Title": "Dynamatic Technologies Declares Interim Dividend",
            "Summary": "Dynamatic Technologies has announced an interim dividend of 2 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1731508799000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dynamatic Technologies Reports Q2 EBITDA Growth",
            "Summary": "Dynamatic Technologies has reported an increase in its Q2 EBITDA, rising to 410 million rupees from 389 million rupees year-over-year. The company's EBITDA margin also improved, reaching 11.36% compared to 11.08% in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731508725000,
            "Source": "result"
        },
        {
            "Title": "Dynamatic Technologies Reports Q2 Revenue Growth",
            "Summary": "Dynamatic Technologies has reported a revenue of 3.6 billion rupees for the second quarter, compared to 3.5 billion rupees in the same period last year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731508583000,
            "Source": "result"
        },
        {
            "Title": "Dynamatic Technologies Reports Q2 FY2024 Financial Results",
            "Summary": "Dynamatic Technologies Limited has announced its consolidated net profit for the second quarter of the fiscal year 2024. The company reported a net profit of 120 million rupees, which is slightly lower compared to 121 million rupees in the same quarter of the previous year (YoY). However, it shows an improvement from 113.9 million rupees in the previous quarter (QoQ).",
            "Sentiment": "neutral",
            "PublishDate": 1731508540000,
            "Source": "result"
        },
        {
            "Title": "Dynamatic Technologies in Contention for Defense Manufacturing Contracts",
            "Summary": "Dynamatic Technologies is reportedly in contention for manufacturing structural assemblies for three major Indian defense programs: AMCA (Advanced Medium Combat Aircraft), Tejas MK-2 fighter jet, and TEDBF (Twin Engine Deck Based Fighter) program. This indicates potential new business opportunities in the defense sector for the company.",
            "Sentiment": "positive",
            "PublishDate": 1730279551000,
            "Source": "normal_news"
        }
    ]
}