{
    "Symbol": "DYNPRO",
    "ISIN": "INE256H01015",
    "News": [
        {
            "Title": "Dynemic Products Reports Q2 FY2025-26 Results with Revenue Decline and Debt Reduction Progress",
            "Summary": "Dynemic Products Limited reported quarterly revenue of Rs. 8,935 lakhs, reflecting a 5% decline from the previous quarter, with product sales led by Rs. 6,013 lakhs from Food Colors and Rs. 2,776 lakhs from Dyes and Intermediates. The company achieved significant debt reduction by repaying Rs. 12,057 lakhs in term loans and improved EBITDA margin to 13.76%, demonstrating operational stability despite revenue moderation.",
            "Sentiment": "positive",
            "PublishDate": 1763727860473,
            "Source": "earnings"
        },
        {
            "Title": "Dynemic Products Ltd Completes Income Tax Department Search Operations",
            "Summary": "Income Tax Department officials conducted search operations at Dynemic Products Ltd's offices and manufacturing sites, which concluded on November 16, 2025. The company states the search had no impact on routine operations and maintains it follows highest standards of corporate governance and financial discipline.",
            "Sentiment": "neutral",
            "PublishDate": 1763362762949,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dynemic Products Postpones Board Meeting Due to Income Tax Department Search Operations",
            "Summary": "Dynemic Products Limited has postponed its board meeting scheduled to review unaudited financial results for the quarter ended September 30, 2025, due to ongoing search operations by the Income Tax Department at various company premises since November 12, 2025. The company is cooperating with tax officials and stated it cannot determine how long the operations will take. The company will inform stock exchanges of the new board meeting date and update them on the outcome of the search operations once received from the Income Tax Department.",
            "Sentiment": "negative",
            "PublishDate": 1763014868261,
            "Source": "stock"
        },
        {
            "Title": "Dynemic Products Re-appoints Key Leadership for Five-Year Terms",
            "Summary": "Dynemic Products Limited shareholders approved the re-appointment of Mr. Bhagwandas K. Patel as Managing Director and Mr. Rameshbhai B. Patel as Joint Managing Director at their 35th Annual General Meeting. Both appointments are for five-year terms effective September 1, 2025. Mr. Bhagwandas K. Patel, aged 70, is a B.Com and Inter C.A. with 37 years of experience in sales, marketing, operations, management and finance, and serves as the company's founder. Mr. Rameshbhai B. Patel, aged 62, holds a Bachelor of Science degree with over 35 years of experience in the color and chemical industry, and oversees production and R&D at the company's Ankleshwar unit.",
            "Sentiment": "positive",
            "PublishDate": 1758546825191,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dynemic Products Appoints Ms. Avani Patel as Independent Director for Three-Year Term",
            "Summary": "Dynemic Products Limited shareholders approved the appointment of Ms. Avani Patel as an Independent Director at their 35th Annual General Meeting. The appointment is effective from August 13, 2025, for a three-year period. Ms. Patel, who holds DIN 07774901, brings over 12 years of expertise in corporate governance, Company Secretarial services, trademark law, and valuation of securities. She meets the independence criteria under the Companies Act, 2013 and SEBI Listing Regulations, and has no relationships with other directors on the company's board.",
            "Sentiment": "positive",
            "PublishDate": 1758545454910,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dynemic Products Appoints New Independent Director and Secretarial Auditor, Reports Strong Q1 Results",
            "Summary": "Dynemic Products Limited's Board of Directors approved several key appointments on August 13, 2025. Ms. Avani Vishnubhai Patel was appointed as Independent Director for a 3-year term, while Mr. Ashok P. Pathak was named Secretarial Auditor for five consecutive years from FY 2025-26 to 2029-30. The company also re-appointed Mr. Bhagwandas K. Patel as Managing Director and Mr. Rameshbhai B. Patel as Joint Managing Director, both for 5-year terms starting September 1, 2025. All appointments are subject to shareholder approval. The company reported quarterly results for the period ended June 30, 2025, showing net profit of Rs. 482.05 lakhs compared to Rs. 278.85 lakhs in the same quarter last year. Total revenue increased to Rs. 9,447.08 lakhs from Rs. 8,009.98 lakhs year-over-year. The 35th Annual General Meeting is scheduled for September 22, 2025, via video conferencing.",
            "Sentiment": "positive",
            "PublishDate": 1755076267429,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dynemic Products Reports Significant Q2 EBITDA Growth",
            "Summary": "Dynemic Products has reported a substantial increase in its Q2 EBITDA, rising from 43 million rupees in the previous year to 125 million rupees this year. The company's EBITDA margin also improved significantly, increasing from 6.56% to 12.78% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731481533000,
            "Source": "result"
        },
        {
            "Title": "Dynemic Products Reports Strong Q2 Revenue Growth",
            "Summary": "Dynemic Products has announced its Q2 revenue results, showing a significant year-over-year increase. The company reported revenue of 978 million rupees for the quarter, compared to 653 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731481482000,
            "Source": "result"
        },
        {
            "Title": "Dynemic Products Reports Profit in Q2 FY2024",
            "Summary": "Dynemic Products has announced a consolidated net profit of 39 million rupees for the second quarter, compared to a loss of 36 million rupees in the same period last year. This represents a significant turnaround in the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1731481445000,
            "Source": "result"
        }
    ]
}