{
    "Symbol": "E2E",
    "ISIN": "INE255Z01019",
    "News": [
        {
            "Title": "E2E Networks Acquires NVIDIA B200 GPU Clusters",
            "Summary": "E2E Networks Limited has acquired NVIDIA B200 GPU clusters in Chennai, featuring 1,024 GPUs with approximately 184 TB RAM capacity to enhance AI computing facilities for Indian businesses and researchers.",
            "Sentiment": "positive",
            "PublishDate": 1767941901848,
            "Source": "stocks"
        },
        {
            "Title": "E2E Networks Secures ₹177 Crore GPU Resources Contract from IndiaAI Mission",
            "Summary": "E2E Networks Limited has been awarded a ₹177 crore contract by IndiaAI Mission to provide GPU resources, with work already commenced. The project is scheduled to launch by January 2026, positioning the company in India's artificial intelligence infrastructure development.",
            "Sentiment": "positive",
            "PublishDate": 1764834021340,
            "Source": "stock"
        },
        {
            "Title": "E2E Networks Reports Q2 Net Loss of 135M Rupees, Revenue Declines",
            "Summary": "E2E Networks reported a net loss of 135 million rupees in Q2, compared to a profit of 121 million rupees in the same quarter last year. Revenue decreased to 438 million rupees from 475 million rupees year-over-year. EBITDA fell to 180.1 million rupees from 314.4 million rupees, with EBITDA margin declining to 41.12% from 66.12% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762841085448,
            "Source": "earnings"
        },
        {
            "Title": "E2E Networks Plans to Raise Up to Rs 1,000 Crore Through QIP",
            "Summary": "E2E Networks has announced plans to raise up to Rs 1,000 crore through a Qualified Institutional Placement (QIP). The fundraising initiative represents a significant capital raising exercise for the company.",
            "Sentiment": "positive",
            "PublishDate": 1759124447549,
            "Source": "stock"
        },
        {
            "Title": "E2E Networks: OpenAI Exploring Partnerships with Indian Data Centers",
            "Summary": "E2E Networks reports that OpenAI is in discussions regarding potential partnerships with Indian data center operators. The talks suggest OpenAI's interest in expanding its infrastructure presence in the Indian market through local data center collaborations.",
            "Sentiment": "positive",
            "PublishDate": 1757388611238,
            "Source": "stock"
        },
        {
            "Title": "E2E Networks Secures ₹177 Crore AI Infrastructure Order from MeitY",
            "Summary": "E2E Networks Ltd secured a ₹177 crore order from the Ministry of Electronics and Information Technology under the IndiaAI Mission. The company will provide H100 SXM and H200 SXM GPU resources to GNANI AI for building India's foundational AI model over 360 days, totaling nearly 1.3 crore GPU hours. The GPUs will be deployed with InfiniBand network on a single fabric. E2E's board also approved acquisition of specific assets from Coimbatore-based Jarvis Labs AI Pvt Ltd, including IP, hardware, domain, and customer assets to expand AI/ML offerings. E2E Networks shares closed 5.86% higher at ₹2,403.10 on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1756815760694,
            "Source": "order&deals"
        },
        {
            "Title": "E2E Networks Reports Q1 Net Loss of 28M Rupees, Revenue Declines to 361M Rupees",
            "Summary": "E2E Networks reported a net loss of 28 million rupees in Q1, compared to a profit of 101 million rupees in the same quarter last year. The company's revenue decreased to 361 million rupees from 413 million rupees year-over-year, representing a decline in both profitability and top-line performance.",
            "Sentiment": "negative",
            "PublishDate": 1753183557788,
            "Source": "earnings"
        },
        {
            "Title": "E2E Networks Reports Significant Increase in Other Income",
            "Summary": "E2E Networks has reported other income of 254 million rupees, compared to 2 million rupees in the same period last year, representing a substantial year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1744878625000,
            "Source": "result"
        },
        {
            "Title": "E2E Networks Reports Significant Profit Growth in Q4",
            "Summary": "E2E Networks has announced its Q4 financial results, showing a substantial increase in net profit. The company's net profit rose to 136 million rupees, up from 35 million rupees in the same quarter last year. Revenue also saw growth, reaching 335 million rupees compared to 294 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1744877997000,
            "Source": "result"
        },
        {
            "Title": "E2E Networks Launches Advanced GPU Infrastructure on TIR AI/ML Platform",
            "Summary": "E2E Networks has announced the availability of state-of-the-art infrastructure featuring 2,048 H200 GPUs on their TIR AI/ML platform. This significant upgrade enhances the company's capabilities in providing high-performance computing resources for artificial intelligence and machine learning applications.",
            "Sentiment": "positive",
            "PublishDate": 1743664566000,
            "Source": "corporate_action"
        },
        {
            "Title": "E2E Cloud Deploys NVIDIA H200 Clusters in Delhi NCR & Chennai",
            "Summary": "E2E Networks' cloud division, E2E Cloud, has deployed large-scale NVIDIA H200 GPU clusters in Delhi NCR and Chennai. This deployment represents a significant advancement in AI computing capabilities in India, positioning E2E Cloud as a leader in providing high-performance AI infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1743664525000,
            "Source": "corporate_action"
        },
        {
            "Title": "E2E Cloud Launches Sovereign Cloud Platform",
            "Summary": "E2E Networks has introduced E2E Cloud, a sovereign cloud platform designed to provide nations and enterprises with complete control over their cloud infrastructure. This launch aims to empower organizations with enhanced data sovereignty and security measures.",
            "Sentiment": "positive",
            "PublishDate": 1741664540000,
            "Source": "corporate_action"
        },
        {
            "Title": "E2E Networks Empaneled by IndiaAI for Cloud-based AI Services",
            "Summary": "E2E Networks has been empaneled by IndiaAI, a division of the Digital India Corporation under the Ministry of Electronics & Information Technology, Government of India. The company will provide AI services on the cloud, including AI compute units, network services, and storage services.",
            "Sentiment": "positive",
            "PublishDate": 1739146310000,
            "Source": "corporate_action"
        },
        {
            "Title": "E2E Networks Empaneled by IndiaAI for Cloud-based AI Services",
            "Summary": "E2E Networks has been empaneled by IndiaAI, a division of the Digital India Corp under the Ministry of Electronics & Information Technology, Government of India. The company will provide AI services on the cloud, including AI compute units, network services, and storage services.",
            "Sentiment": "positive",
            "PublishDate": 1738929094000,
            "Source": "corporate_action"
        },
        {
            "Title": "E2E Networks: AI-Focused Cloud Platform Sees Massive Stock Growth",
            "Summary": "E2E Networks, an AI-focused hyperscale cloud platform, has seen its stock price surge 268% in the past year and 5,650% over six years. The company is benefiting from the growing global AI market, expected to reach $320-380 billion by 2027. India's government has approved a ₹104 billion IndiaAI mission to boost AI infrastructure and innovation.",
            "Sentiment": "positive",
            "PublishDate": 1738911024000,
            "Source": "normal_news"
        },
        {
            "Title": "E2E Networks Reports Strong Q3 FY24 Financial Results",
            "Summary": "E2E Networks has announced its financial results for the third quarter. The company's net profit increased to 116 million rupees, up from 56 million rupees in the same quarter last year. Revenue also saw significant growth, reaching 416 million rupees compared to 240 million rupees in the previous year. Additionally, the company reported other income of 128 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1737591238000,
            "Source": "result"
        },
        {
            "Title": "E2E Networks Reports Decline in Q3 EBITDA and Margin",
            "Summary": "E2E Networks has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 85.6 million rupees, down from 112 million rupees in the same quarter last year. The EBITDA margin also decreased significantly, falling to 20.58% from 46.93% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1737540886000,
            "Source": "earnings"
        },
        {
            "Title": "E2E Networks Reports Other Income of 128 Million Rupees",
            "Summary": "E2E Networks, a company in the technology sector, has reported other income amounting to 128 million rupees. This income is separate from the company's main operational revenue and could include sources such as interest income, gains from investments, or other non-core business activities.",
            "Sentiment": "positive",
            "PublishDate": 1737540873000,
            "Source": "earnings"
        },
        {
            "Title": "E2E Networks Reports Strong Q3 Financial Results",
            "Summary": "E2E Networks has announced its financial results for the third quarter, showing significant year-over-year growth. The company's net profit increased to 116 million rupees, up from 56 million rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 416 million rupees compared to 240 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737540429000,
            "Source": "earnings"
        },
        {
            "Title": "E2E Network Expands Data Center Capacity with Larsen & Toubro",
            "Summary": "E2E Network has entered into an arrangement with Larsen & Toubro Limited to expand its data center facilities. The company's existing capacity is 4,200KW, and the proposed capacity addition is 6,000KW, significantly increasing their total data center capacity.",
            "Sentiment": "positive",
            "PublishDate": 1733148367000,
            "Source": "corporate_action"
        },
        {
            "Title": "E2E Networks to Deploy NVIDIA H200 GPUs for AI in India",
            "Summary": "E2E Networks, an Indian technology company, is set to accelerate the adoption of generative AI in India by deploying NVIDIA H200 Tensor Core GPUs. This move signifies a significant step in enhancing AI capabilities and infrastructure within the country.",
            "Sentiment": "positive",
            "PublishDate": 1729834749000,
            "Source": "corporate_action"
        },
        {
            "Title": "E2E Networks Reports Strong Q2 Financial Performance",
            "Summary": "E2E Networks has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 314 million rupees from 112 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 66.11% from 51.61% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729517486000,
            "Source": "result"
        },
        {
            "Title": "E2E Networks Reports Significant Revenue Growth in Q2",
            "Summary": "E2E Networks has announced its Q2 revenue, which stands at 475.5 million rupees. This represents a substantial year-over-year increase from 216 million rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1729517473000,
            "Source": "result"
        },
        {
            "Title": "E2E Networks Reports Strong Q2 Profit Growth",
            "Summary": "E2E Networks has announced its Q2 financial results, showing significant year-over-year and quarter-over-quarter growth in net profit. The company's net profit for the second quarter reached 121 million rupees, compared to 58 million rupees in the same period last year, representing a year-over-year increase. The profit also grew from 101 million rupees in the previous quarter, indicating positive quarter-over-quarter performance.",
            "Sentiment": "positive",
            "PublishDate": 1729517461000,
            "Source": "result"
        },
        {
            "Title": "E2E Networks Partners with People+AI for Enhanced Computing Access",
            "Summary": "<p>E2E Networks has announced a <span class='positive'>partnership</span> with People+AI to provide <span class='positive'>improved access</span> to <b>large-scale computing resources</b>. This collaboration aims to make <span class='positive'>advanced computational power</span> more <span class='positive'>accessible</span>, potentially <span class='positive'>benefiting</span> businesses and researchers who require <b>significant computing capabilities</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728394727000,
            "Source": "corporate_action"
        }
    ]
}