{
    "Symbol": "EASEMYTRIP",
    "ISIN": "INE07O001026",
    "News": [
        {
            "Title": "EaseMyTrip Launches Valentine's Day Travel Sale",
            "Summary": "EaseMyTrip announces 'Swipe Right Travel Sale' from February 4-10, 2026, offering discounts up to ₹10,000 on flights, hotels, cabs, and holiday packages starting at ₹11,699 for Valentine's Day travel.",
            "Sentiment": "positive",
            "PublishDate": 1770183186736,
            "Source": "stocks"
        },
        {
            "Title": "EaseMyTrip Partners with ProXpense for Corporate Travel",
            "Summary": "Easy Trip Planners Limited announces strategic partnership with ProXpense to transform corporate travel and expense management through AI-powered automation and integrated booking solutions.",
            "Sentiment": "positive",
            "PublishDate": 1769748696088,
            "Source": "stocks"
        },
        {
            "Title": "Easy Trip Planners Board Approves Key Changes",
            "Summary": "Easy Trip Planners board approves new independent director appointment, raises authorized share capital to ₹750 crore, and plans subsidiary for upskilling services.",
            "Sentiment": "positive",
            "PublishDate": 1768810161373,
            "Source": "stocks"
        },
        {
            "Title": "Easy Trip Planners Board Meet on Jan 19 for Share Capital",
            "Summary": "Easy Trip Planners Limited has scheduled a board meeting on January 19, 2026, to consider increasing the company's authorized share capital under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768405465900,
            "Source": "stocks"
        },
        {
            "Title": "EaseMyTrip Launches Republic Day Travel Sale",
            "Summary": "EaseMyTrip announces Republic Day Travel Sale from January 13-17, 2026, offering up to ₹10,000 off on flights and hotels, plus deals on buses, cabs, and holiday packages starting at ₹9,999.",
            "Sentiment": "positive",
            "PublishDate": 1768285058102,
            "Source": "stocks"
        },
        {
            "Title": "EasyTrip Planners Promoter Pledges 18.94 Cr Shares",
            "Summary": "Nishant Pitti pledges 18.94 crore equity shares representing 20% of total shareholding to Mobil One Fuel Services Limited for personal use under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1765802175710,
            "Source": "stocks"
        },
        {
            "Title": "EaseMyTrip Partners as Official Travel Partner for World Tennis League India Debut",
            "Summary": "EaseMyTrip has announced its partnership as the official travel partner for the India debut edition of the World Tennis League. This strategic partnership positions the travel company as the exclusive travel services provider for the tennis tournament's inaugural Indian edition.",
            "Sentiment": "positive",
            "PublishDate": 1765277058315,
            "Source": "stock"
        },
        {
            "Title": "EaseMyTrip Shareholders Approve Preferential Equity Share Issuance Through Postal Ballot",
            "Summary": "EaseMyTrip's shareholders approved a special resolution for issuing equity shares on preferential basis through postal ballot voting that concluded on December 04, 2025. The resolution received overwhelming support with 174,36,58,167 shares voting in favor against 1,27,19,592 shares voting against, representing approval from 99.28% of valid votes cast.",
            "Sentiment": "positive",
            "PublishDate": 1765180097440,
            "Source": "corporate_action"
        },
        {
            "Title": "EaseMyTrip Launches Winter Carnival Sale with Discounts Up to 25% for Holiday Travel",
            "Summary": "EaseMyTrip announced its Winter Carnival Sale running from December 2-9, 2025, offering discounts of 14% on flights, 25% on hotels, 10% on buses, 12% on cabs, and holiday packages starting at INR 7,999. The sale targets Christmas and New Year travelers with promotional offers across multiple travel categories including partnerships with major airlines and hotel chains, accessible through promo code CARNIVAL.",
            "Sentiment": "positive",
            "PublishDate": 1764654904397,
            "Source": "stock"
        },
        {
            "Title": "EaseMyTrip Issues Corrigendum to Postal Ballot Notice for Preferential Share Allotment",
            "Summary": "EaseMyTrip issued a corrigendum on November 21, 2025, amending its postal ballot notice dated November 4, 2025, following directions from NSE, providing direct links to valuation reports and PCS certificates and updating beneficial owner details for SSL Nirvana Grand Golf Developers Private Limited. The amendment affects company members voting on the proposed preferential equity share issuance, with queries accepted until December 4, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763727848675,
            "Source": "corporate_action"
        },
        {
            "Title": "EaseMyTrip Named in Top 10 of Forbes India DGEMS 2025 Select 200 List",
            "Summary": "EaseMyTrip has been recognized among the Top 10 companies in Forbes India's DGEMS 2025 - The Select 200, a prestigious list that identifies organizations with global business potential. The recognition highlights the travel-tech platform's growing influence and strategic expansion across international markets including Brazil, New Zealand, Philippines, Saudi Arabia, Thailand, Singapore, UAE, UK, and USA while strengthening its position in India's travel market.",
            "Sentiment": "positive",
            "PublishDate": 1763701486822,
            "Source": "stock"
        },
        {
            "Title": "Easy Trip Planners Reports Q2 Loss of 327 Million Rupees, Revenue Drops 19%",
            "Summary": "Easy Trip Planners swung to a consolidated net loss of 327 million rupees in Q2 compared to a profit of 259 million rupees in the same period last year, while revenue declined to 1.18 billion rupees from 1.45 billion rupees. The company's EBITDA margin compressed significantly to 3.32% from 25.5% year-over-year, with EBITDA falling to 39 million rupees from 369 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1763337278598,
            "Source": "earnings"
        },
        {
            "Title": "Easy Trip Planners Reports Quarterly Loss of 327M Rupees, Revenue Drops to 1.18B",
            "Summary": "Easy Trip Planners swung to a consolidated net loss of 327 million rupees in Q2 from a profit of 259 million rupees in the same period last year, while revenue declined to 1.18 billion rupees from 1.45 billion rupees. The company's EBITDA margin compressed significantly to 3.32% from 25.5% year-on-year, with EBITDA falling to 39 million rupees from 369 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1763205129065,
            "Source": "earnings"
        },
        {
            "Title": "EaseMyTrip Reports Strong Q2 FY26 Performance with 93% YoY Growth in Gross Booking Revenue",
            "Summary": "EaseMyTrip delivered robust quarterly results with gross booking revenue reaching INR 1,958.7 crores and revenue from operations at INR 118.3 crores, while Dubai operations surged 109.7% YoY to INR 361.7 crores. The online travel platform demonstrated strong growth across non-air segments, with hotel bookings rising 93.3% YoY and continued expansion in international markets through strategic acquisitions and new subsidiaries.",
            "Sentiment": "negative",
            "PublishDate": 1763142072928,
            "Source": "earnings"
        },
        {
            "Title": "Easy Trip Planners Launches 'Unwrap Travel Deals Sale' Amid Stock Volatility",
            "Summary": "Easy Trip Planners launched its 'Unwrap Travel Deals Sale' offering discounts up to ₹10,000 on hotels and ₹7,500 on flights from November 11-15, 2025, targeting Christmas and New Year travel season. The stock traded at ₹7.95, down 0.25% with high trading volume of 43.99 lakh shares, while experiencing significant volatility with 52-week high of ₹19.00 and low of ₹7.82.",
            "Sentiment": "neutral",
            "PublishDate": 1763110395572,
            "Source": "stock"
        },
        {
            "Title": "EaseMyTrip Launches 'Unwrap Travel Deals Sale' for Winter Holiday Season",
            "Summary": "EaseMyTrip announced the launch of its 'Unwrap Travel Deals Sale' running from November 11 to November 15, 2025, targeting winter holiday travelers ahead of Christmas and New Year. The sale offers discounts across multiple travel categories: flights (up to INR 7,500 off), hotels (up to INR 10,000 off), buses (up to INR 200 off), cabs (up to INR 500 off), and holiday packages starting from INR 10,999. Customers can access deals using promo code EMTUNWRAP through the company's mobile app or website. The sale includes partnerships with major airlines like Air Canada, Air France, Air India, Lufthansa, Singapore Airlines, and others, along with hotel chains including OYO, Club Mahindra, and Sterling. Special discounts are available for AU Small Finance Bank and HSBC credit card users, with additional partner offers from brands like Marks & Spencer and Spykar. Chief Marketing Officer Manmeet Ahluwalia stated the initiative aims to deliver exceptional value during the popular travel period and make winter travel more accessible and affordable.",
            "Sentiment": "positive",
            "PublishDate": 1762882632810,
            "Source": "stock"
        },
        {
            "Title": "EaseMyTrip Approves ₹514 Crore Preferential Share Issue and Key Leadership Changes",
            "Summary": "EaseMyTrip's board approved the issuance of 55.94 crore equity shares at ₹9.19 per share through preferential allotment, raising ₹514.07 crore from seven non-promoter investors including individuals and companies. The largest allocation goes to Divyank Singhal (4.54% stake) and Dhankalash Distributors Private Limited (2.71% stake). The company also announced leadership changes with Sankalp Kaul appointed as Chief Technology Officer replacing Naimish Sinha, who resigned due to personal reasons. Additionally, Manmeet Ahluwalia was appointed as Chief Marketing Officer. Kaul brings 18 years of experience in digital transformation across travel and technology sectors, while Ahluwalia has over 20 years of experience in brand building and digital performance, previously scaling Expedia's India business to over $500M BV and $60M net revenue. The preferential issue requires regulatory approvals and shareholder consent through postal ballot.",
            "Sentiment": "positive",
            "PublishDate": 1762598353592,
            "Source": "corporate_governance"
        },
        {
            "Title": "EasyTrip Planners Seeks Shareholder Approval for ₹514 Crore Preferential Share Issue",
            "Summary": "EasyTrip Planners Limited has issued a postal ballot notice seeking shareholder approval for issuing 55.93 crore equity shares worth ₹514.07 crore through preferential allotment. The shares will be issued at ₹9.19 per share to seven non-promoter allottees including Mr. Ashish Begwani, Mr. Sunil Jain, Dhankalash Distributors Private Limited, Mr. Divyank Singhal, Levo Beauty Private Limited, SSL Nirvana Grand Golf Developers Private Limited, and Javaphile Hospitality Private Limited. The proceeds will be used to acquire stakes in five target companies: AB Finance Private Limited (100%), Three Falcons Notting Hill Limited (50%), Javaphile Hospitality Private Limited (49%), Levo Beauty Private Limited (49%), and SSL Nirvana Grand Golf Developers Private Limited (49%). The remote e-voting period runs from November 5, 2025 to December 4, 2025, with results to be announced by December 8, 2025. Post-allotment, promoter shareholding will decrease from 47.72% to 41.36%.",
            "Sentiment": "neutral",
            "PublishDate": 1762297926598,
            "Source": "corporate_action"
        },
        {
            "Title": "Easy Trip Planners Acquires Stakes in Multiple Companies for ₹194.44 Crore",
            "Summary": "Easy Trip Planners has signed agreements to acquire stakes in several companies, including AB Finance and Javaphile, through a share swap deal valued at ₹194.44 crore. The acquisitions are aimed at boosting the company's business growth.",
            "Sentiment": "positive",
            "PublishDate": 1762247341057,
            "Source": "order&deals"
        },
        {
            "Title": "Easy Trip Planners Wins Punjab Government Contract for Pilgrimage Travel Management",
            "Summary": "Easy Trip Planners has secured a government mandate from Punjab to manage pilgrimage travel for over 200,000 devotees under the Mukh Mantri Tirth Yatra Yojana. The project was launched by Punjab's Chief Minister and will involve operating tours from Bathinda to Amritsar for the next year.",
            "Sentiment": "positive",
            "PublishDate": 1761798852107,
            "Source": "stock"
        },
        {
            "Title": "EaseMyTrip Approves Four Strategic Acquisitions Worth INR 169.12 Crore Through Share Swaps",
            "Summary": "EaseMyTrip's Board of Directors approved investments in four companies totaling INR 169.12 crore through share swap arrangements. The company will acquire 49% stakes in Doodlesdodling Entertainment Private Limited for INR 24.5 crore, SSL Nirvana Grand Golf Developers Private Limited for INR 100.53 crore, Javaphile Hospitality Private Limited for INR 19.6 crore, and Levo Beauty Private Limited for INR 24.5 crore. All investments will be made by issuing EaseMyTrip's equity shares to the target companies on a preferential basis. The acquisitions span hospitality, entertainment, golf development, and beauty services sectors as part of EaseMyTrip's 2.0 strategy to build an integrated travel ecosystem. Javaphile is led by Suren Joshi and Pooja Joshi, Doodles by Amit Sharma, SSL Nirvana by Shashank Gulati, and Levo by Pranita Baveja. The transactions are subject to board and shareholder approvals and regulatory clearances.",
            "Sentiment": "positive",
            "PublishDate": 1760697796213,
            "Source": "order&deals"
        },
        {
            "Title": "Easy Trip Planners Schedules Board Meeting to Consider Acquisition Proposal",
            "Summary": "Easy Trip Planners Limited has scheduled a Board of Directors meeting for October 17, 2025, at 3:00 p.m. via video conferencing to consider an acquisition proposal. The meeting information will be available on the company's investor relations website.",
            "Sentiment": "neutral",
            "PublishDate": 1760446327646,
            "Source": "corporate_action"
        },
        {
            "Title": "Easy Trip Planners Partners With Raipur District Administration For Youth Tourism Training Program",
            "Summary": "Easy Trip Planners has partnered with Raipur District Administration to launch Project Paryatan Saathi, aimed at supporting young people and boosting tourism. The initiative offers 45 days of free training for youth aged 18 to 30 years.",
            "Sentiment": "positive",
            "PublishDate": 1760417109554,
            "Source": "stock"
        },
        {
            "Title": "EaseMyTrip Launches Travel Utsav Sale with Discounts Up to ₹10,000",
            "Summary": "EaseMyTrip launched its Travel Utsav Sale running from October 7 to October 14, 2025, offering discounts across flights, hotels, buses, cabs, and holiday packages. The sale provides discounts up to ₹7,500 on flights, ₹10,000 on hotels, ₹500 on buses and cabs, with holiday packages starting at ₹9,999. Customers can access deals using promo code 'EMTUTSAV' on the app or website. Additional discounts are available through credit cards from BOBCARD, RBL Bank, Yes Bank, AU Small Finance Bank, Punjab National Bank, IDBI Bank, and Axis Bank. The company partnered with over 30 airlines including Air India, IndiGo, SpiceJet, Air France, British Airways, Singapore Airlines, and Qatar Airways, along with hotel chains including Sterling, Club Mahindra, ITC, OYO, and Royal Orchid. Easy Trip Planners Limited shares closed at ₹7.99 on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1759841578886,
            "Source": "stock"
        },
        {
            "Title": "Easytrip Announces Dussehra Sale Event",
            "Summary": "Easytrip has announced a Dussehra sale scheduled to run from September 23 to September 26, 2025. The travel company is organizing this promotional event during the festive period.",
            "Sentiment": "positive",
            "PublishDate": 1758603716051,
            "Source": "stock"
        },
        {
            "Title": "Easy Trip Planners Receives Approval to Participate in Eco Hotels and Resorts Rights Issue",
            "Summary": "Easy Trip Planners has obtained approval to participate in the rights issue of Eco Hotels and Resorts. This approval allows the company to take part in the equity fundraising initiative.",
            "Sentiment": "positive",
            "PublishDate": 1758511122069,
            "Source": "corporate_action"
        },
        {
            "Title": "Easy Trip Planners Invests ₹15.2 Crore in Eco Hotels Rights Issue for 7.77% Stake",
            "Summary": "Easy Trip Planners Limited's Board approved participation in Eco Hotels and Resorts Limited's rights issue, subscribing to 10 lakh equity shares at ₹15.20 per share through cash payment in tranches. The investment will give Easy Trip Planners a 7.77% shareholding in Eco Hotels, a hotels and hospitality company incorporated in 1987. The investment is aimed at eco-friendly and green hotels. This constitutes a related party transaction due to an Independent Director's position in Eco Hotels, conducted on arm's length basis. Eco Hotels reported turnovers of ₹13.71 lakhs in FY 2024-25, ₹1.39 lakhs in FY 2023-24, and ₹0.78 lakhs in FY 2022-23.",
            "Sentiment": "positive",
            "PublishDate": 1758373867628,
            "Source": "corporate_action"
        },
        {
            "Title": "Easy Trip Planners Partners With HOI To Launch India's First Smart Kiosk Rewards Program At Airports",
            "Summary": "Easy Trip Planners has partnered with HOI to introduce India's first smart kiosk rewards program at airports. The program aims to provide instant travel rewards and enhance passenger experience through these airport kiosks.",
            "Sentiment": "positive",
            "PublishDate": 1758174585167,
            "Source": "stock"
        },
        {
            "Title": "EaseMyTrip Leadership Restructure: Prashant Pitti Steps Down as MD, Nishant Pitti Appointed Chairman and MD",
            "Summary": "EaseMyTrip announced a leadership change with Prashant Pitti stepping down as Managing Director with immediate effect. Nishant Pitti has been elevated to Chairman and MD, effective August 29, 2025, pending shareholder approval. Nishant Pitti had previously resigned as CEO citing personal reasons, after which Rikant Pitti was appointed as the new CEO. Nishant Pitti has served on the company's board since 2008 and was re-appointed for a five-year term in May. He had announced plans to sell his remaining 14% stake in Easy Trip Planners through block deals but managed to sell only 1.4% of that stake. Easy Trip Planners shares traded 1.42% lower at ₹8.36 following the announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1756460032754,
            "Source": "corporate_governance"
        },
        {
            "Title": "EaseMyTrip Partners with MoEngage to Enhance Customer Retention and Marketing Technology",
            "Summary": "EaseMyTrip announced a strategic partnership with MoEngage to enhance its marketing capabilities and boost customer retention. The travel platform, which has over 30 million customers globally, aims to transition from broad-based digital communication to personalized traveler engagement. Through MoEngage's Customer Data and Engagement Platform, EaseMyTrip will unify customer data from multiple sources to create a comprehensive view of each traveler, enabling real-time personalized cross-channel journeys. The partnership is designed to improve repeat bookings, increase ancillary revenue, and maximize customer lifetime value. EaseMyTrip is one of India's largest online travel platforms for air ticket bookings and has grown at a 47% CAGR in profits before tax during FY20-24.",
            "Sentiment": "positive",
            "PublishDate": 1755596495330,
            "Source": "stock"
        },
        {
            "Title": "Easy Trip Planners Shares Drop 4% as Quarterly Profit Falls 99% to Rs 0.44 Crore",
            "Summary": "Easy Trip Planners shares declined 4.2% to Rs 8.81 following the release of quarterly results showing profit after tax dropped 98.7% to Rs 0.44 crore from Rs 33.93 crore in the same quarter last year. Revenue from operations fell to Rs 113.79 crore from Rs 152.6 crore, while adjusted total income decreased to Rs 166.24 crore from Rs 208.16 crore. The company announced three strategic acquisitions: a 50% stake in Three Falcons Notting Hill Limited (owner of London boutique hotel The Knight of Notting Hill), 100% acquisition of AB Finance Private Limited for a Gurugram commercial property, and a strategic alliance with Vashu Bhagnani Industries Limited. These acquisitions will be executed through share swap arrangements to expand EaseMyTrip's international hospitality presence and domestic operations. Chairman Nishant Pitti stated the moves aim to create engaging traveler experiences while building future value, targeting the global hospitality industry projected to grow from USD 5.71 trillion to USD 7.23 trillion by 2029.",
            "Sentiment": "negative",
            "PublishDate": 1755494635640,
            "Source": "earnings"
        },
        {
            "Title": "EaseMyTrip Launches EMT 2.0 Strategy Focusing on Acquisitions and Business Diversification",
            "Summary": "EaseMyTrip announced its EMT 2.0 strategic growth plan aimed at expanding beyond flights into hotels, holidays, mobility, wellness and lifestyle services through acquisitions of profitable businesses. The company plans to acquire up to 49% stakes in established, profitable companies to add higher-margin revenue streams and reduce dependence on air travel. The strategy showed early results with Hotels and Packages business growing 81.2% year-over-year and Dubai operations increasing 151%. The company's profit decline in Q1 FY26 was attributed to planned investments in high-margin growth areas. Founder and Chairman Nishant Pitti stated that promoters have no intention of selling further stock and will draw zero salary to align with shareholders. The 17-year-old company operates with a debt-free balance sheet and over 72,000 travel agent partners, positioning it to leverage its brand and distribution network for the diversification strategy.",
            "Sentiment": "positive",
            "PublishDate": 1755335869106,
            "Source": "stock"
        },
        {
            "Title": "Easy Trip Planners Reports Sharp Decline in Q1 Profitability Amid Major Diversification Investments",
            "Summary": "Easy Trip Planners reported significantly weaker quarterly results with EBITDA falling to 9 million rupees from 471 million rupees year-over-year, while EBITDA margin dropped to 0.79% from 30.87%. Consolidated net profit declined to 13 million rupees compared to 325 million rupees in the previous year, and revenue decreased to 1.14 billion rupees from 1.53 billion rupees. The company announced a diversification strategy involving a ₹1.75 billion investment in Three Falcons' Notting Hill Project, a ₹1.94 billion acquisition of AB Finance, and a proposed equity infusion into Vashu Bhagnani Industries.",
            "Sentiment": "negative",
            "PublishDate": 1755185070684,
            "Source": "earnings"
        },
        {
            "Title": "EaseMyTrip Shares Surge 9.7% on Heavy Trading Volumes Ahead of Board Meeting",
            "Summary": "EaseMyTrip shares jumped 9.7% to an intraday high of Rs 9.68 on heavy trading volumes of 34.89 lakh shares with turnover of Rs 3.23 crore. The stock opened at Rs 8.80 and touched a low of Rs 8.78 before rebounding. Technical indicators show the stock is strongly oversold with a 14-day RSI of 12.2, while short-term EMAs at Rs 9.5 (10-day) and Rs 9.6 (12-day) provide support. However, medium to long-term EMAs remain above current price levels, indicating a broader downtrend. The stock has declined significantly over longer periods - down 52.22% over one year and 40.52% year-to-date. The company's board will meet on August 14, 2025, to approve quarterly results for the period ended June 30, 2025, and consider proposals for potential investments and acquisitions.",
            "Sentiment": "neutral",
            "PublishDate": 1754981447342,
            "Source": "stock"
        },
        {
            "Title": "Easy Trip Planners to Review Investment Proposals on August 14",
            "Summary": "Easy Trip Planners has scheduled to consider investment proposals on August 14. The company will review these investment opportunities during this meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1754920977591,
            "Source": "stock"
        },
        {
            "Title": "Easy Trip Planners Schedules Board Meeting to Consider Acquisition Proposal",
            "Summary": "Easy Trip Planners Limited has scheduled a Board of Directors meeting for August 08, 2025, at 07:00 P.M. via video conferencing. The meeting will consider a proposal for acquisition. The company has informed both NSE and BSE about the scheduled meeting, and the information will be available on the company's investor relations website.",
            "Sentiment": "neutral",
            "PublishDate": 1754377419841,
            "Source": "corporate_action"
        },
        {
            "Title": "EaseMyTrip Partners with Timbuckdo to Offer Exclusive Student Travel Discounts",
            "Summary": "EaseMyTrip has signed a Memorandum of Understanding with Timbuckdo, a student-focused social commerce platform, to provide exclusive travel discounts for students across India. The partnership will offer discounts on flights, buses, hotels, and travel experiences through Timbuckdo's student discount marketplace. According to the companies, Gen Z and Gen Alpha influence over 93% of family travel decisions, driving demand for experience-led and budget-conscious travel. Timbuckdo targets over one million student bookings in the next 12 months, with the Indian student travel market projected to surpass USD 10 billion by 2027. The collaboration includes campus activations, student travel festivals, and influencer-led campaigns to build awareness and engagement.",
            "Sentiment": "positive",
            "PublishDate": 1753331479526,
            "Source": "order&deals"
        },
        {
            "Title": "FreeAgent Partners with EaseMyTrip to Provide Travel Solutions for Cricket Industry",
            "Summary": "FreeAgent, a global athlete networking platform, has announced a strategic partnership with EaseMyTrip, one of India's leading travel providers. The collaboration will provide FreeAgent users access to EaseMyTrip's travel infrastructure, including flight bookings, visa support, and mobility solutions for athletes, coaches, and teams in the cricket industry. The partnership aims to simplify international travel and make global cricket opportunities more accessible. FreeAgent users will receive streamlined travel and visa support, enabling seamless movement across borders for players, coaches, and teams. EaseMyTrip is publicly listed on NSE and BSE and is described as one of India's largest online travel platforms for air ticket bookings. The company has grown at a 47% CAGR in profits before tax during FY20-24 and operates offices across multiple countries including India, Philippines, Singapore, Thailand, UAE, UK, USA, New Zealand and Brazil.",
            "Sentiment": "positive",
            "PublishDate": 1753167772180,
            "Source": "order&deals"
        },
        {
            "Title": "EaseMyTrip: Co-Founder Commits Rs 1 Crore to Tackle Bengaluru Traffic",
            "Summary": "EaseMyTrip Co-Founder Prashant Pitti has pledged Rs 1 crore to address Bengaluru's traffic issues using technology-driven solutions. He aims to identify traffic chokepoints using Google Maps data and satellite imagery, and is seeking collaboration with local authorities. The initiative has garnered interest from tech professionals offering pro-bono assistance.",
            "Sentiment": "positive",
            "PublishDate": 1752553554000,
            "Source": "normal_news"
        },
        {
            "Title": "EaseMyTrip Invests 600 Million Rupees in Rollins for 30% Stake",
            "Summary": "EaseMyTrip Planners has invested 600 million rupees to acquire a 30% stake in Rollins. This investment represents a significant corporate action by EaseMyTrip, potentially expanding its business interests or strategic partnerships.",
            "Sentiment": "positive",
            "PublishDate": 1750861132000,
            "Source": "default"
        },
        {
            "Title": "Easy Trip Planners Forms Strategic Partnership with ONEBANC",
            "Summary": "Easy Trip Planners has announced a new strategic alliance with ONEBANC. The partnership aims to strengthen Easy Trip's position in the travel industry, though specific details about the collaboration were not provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1750238561000,
            "Source": "default"
        },
        {
            "Title": "EaseMyTrip: Launches Strategic Investment Initiative 'EaseMyTrip 2.0'",
            "Summary": "EaseMyTrip announces 'EaseMyTrip 2.0', a strategic investment initiative to acquire up to 49% equity in high-potential businesses across travel and adjacent sectors. Partners retain operational control while gaining access to EaseMyTrip's 30 million user base and marketing ecosystem.",
            "Sentiment": "positive",
            "PublishDate": 1748856287000,
            "Source": "corporate_action"
        },
        {
            "Title": "Easy Trip Planners Reports Q4 Profit of 153.6 Million Rupees",
            "Summary": "Easy Trip Planners has reported its Q4 consolidated net profit at 153.6 million rupees, compared to a loss of 158 million rupees in the same quarter last year. The company's profit increased from 336.4 million rupees in the previous quarter. However, Q4 revenue decreased to 1.39 billion rupees from 1.64 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1748823133000,
            "Source": "default"
        },
        {
            "Title": "Easy Trip Planners Reports Q4 Financial Results",
            "Summary": "Easy Trip Planners has released its Q4 financial results. The company reported an EBITDA of 135.2 million rupees, down from 492 million rupees year-over-year. The EBITDA margin decreased to 9.69% from 29.97% in the same period last year. Revenue for Q4 was 1.39 billion rupees, compared to 1.64 billion rupees in the previous year. The company's consolidated net profit for Q4 was 153.6 million rupees, a turnaround from a loss of 158 million rupees year-over-year, and an increase from 336.4 million rupees quarter-over-quarter.",
            "Sentiment": "mixed",
            "PublishDate": 1748625066000,
            "Source": "result"
        },
        {
            "Title": "EaseMyTrip: CEO Denies Involvement in Mahadev Betting App Scam",
            "Summary": "EaseMyTrip CEO Nishant Pitti denies ED allegations of involvement in the Mahadev betting app scam. ED is investigating Pitti for allegedly facilitating financial transactions through shell companies and manipulating stock prices. Pitti claims the transactions were legitimate dividend payments to shareholders.",
            "Sentiment": "negative",
            "PublishDate": 1747739156000,
            "Source": "corporate_governance"
        },
        {
            "Title": "EaseMyTrip: Free Flight Rescheduling Extended Amid Kashmir Unrest",
            "Summary": "EaseMyTrip extends free rescheduling and cancellation waivers for all bookings to Srinagar until April 30, following the Pahalgam terror attack. The company is coordinating with airlines and local authorities to support customers. IndiGo also announces similar waivers and additional special flights.",
            "Sentiment": "neutral",
            "PublishDate": 1745395821000,
            "Source": "corporate_action"
        },
        {
            "Title": "EaseMyTrip Denies Connection to Mahadev Betting App Amid ED Investigation",
            "Summary": "EaseMyTrip has issued a clarification stating that it has no association with the Mahadev betting app. The company is fully cooperating with authorities following searches conducted by the Enforcement Directorate (ED) at multiple locations, including one of EaseMyTrip's premises. This statement comes in response to the ongoing investigation into the betting app.",
            "Sentiment": "neutral",
            "PublishDate": 1744863733000,
            "Source": "default"
        },
        {
            "Title": "EaseMyTrip: ED Probes Gurgaon Office in Mahadev Betting App Case",
            "Summary": "Enforcement Directorate searched over 50 locations, including EaseMyTrip's Gurugram office, in connection with the Mahadev Betting App case. EaseMyTrip denied any association with the betting app or platform.",
            "Sentiment": "negative",
            "PublishDate": 1744863355000,
            "Source": "corporate_governance"
        },
        {
            "Title": "EaseMyTrip: ED Raids Promoter's Premises in Betting App Case",
            "Summary": "The Enforcement Directorate is conducting searches at 15 locations across India linked to EaseMyTrip promoter Nishant Pitti in connection with the Mahadev Betting App case. The raids are part of an ongoing probe into alleged money laundering and illegal betting operations.",
            "Sentiment": "negative",
            "PublishDate": 1744794073000,
            "Source": "corporate_governance"
        },
        {
            "Title": "ED Conducts Raids on EaseMyTrip",
            "Summary": "The Enforcement Directorate (ED) has conducted raids on EaseMyTrip, an online travel company. No further details about the nature or scope of the raids are provided in the given news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1744788967000,
            "Source": "default"
        }
    ]
}