{
    "Symbol": "EBGNG",
    "ISIN": "INE18JU01028",
    "News": [
        {
            "Title": "GNG Electronics Q3FY26 IPO Proceeds Monitoring Report",
            "Summary": "GNG Electronics submitted Q3FY26 monitoring agency report showing ₹9.54 crore utilization towards issue expenses from ₹400.00 crore IPO proceeds, with ₹7.36 crore remaining unutilized.",
            "Sentiment": "neutral",
            "PublishDate": 1770311078522,
            "Source": "co_actions_results"
        },
        {
            "Title": "GNG Electronics Q3FY26 Results & Corporate Guarantees",
            "Summary": "GNG Electronics reports Q3FY26 results with consolidated revenue of Rs 4,872.23 million and profit of Rs 386.87 million. Board approves multiple corporate guarantee enhancements totaling AED 65 million for subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1770290075449,
            "Source": "co_actions_results"
        },
        {
            "Title": "GNG Electronics Reports 25% Revenue Growth in Q2 FY26, Expands AI-Ready Computing Focus",
            "Summary": "GNG Electronics delivered strong quarterly results with revenue reaching Rs. 4,399 million, marking a 41% sequential increase and 25% year-over-year growth. For the first half of FY26, consolidated revenue reached Rs. 7,522 million, representing 24% year-over-year growth. Gross margin improved to 19.9% in Q2 FY26 from 14.5% in Q2 FY25. EBITDA for Q2 FY26 rose to Rs. 467.81 million with a margin of 10.63%, while profit after tax stood at Rs. 326 million with a 7.4% margin, reflecting 42% year-over-year growth. The company expanded its global presence to 42 countries and increased its workforce from 1,194 to 1,500 employees. Electronics Bazaar brand now contributes 97% of revenue with comprehensive warranty coverage. The company is positioning itself to capitalize on AI-driven computing demand through refurbished high-end laptops and enterprise-grade systems. Net debt position improved to Rs. 158 crores following IPO proceeds utilization for debt repayment.",
            "Sentiment": "positive",
            "PublishDate": 1762756610439,
            "Source": "earnings"
        },
        {
            "Title": "GNG Electronics Maintains 20-25% Growth Guidance Despite US Tariff Challenges",
            "Summary": "GNG Electronics management has confirmed their growth guidance of 20-25% despite facing challenges from US tariffs. This guidance was communicated during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1762401213008,
            "Source": "stock"
        },
        {
            "Title": "Gng Electronics Targets 25%+ Revenue Growth with Global Expansion Strategy",
            "Summary": "Gng Electronics has outlined plans for robust global growth, targeting over 25% year-on-year revenue increase. The company is expanding its presence in ICT and consumer electronics sectors across new geographical markets. Gng Electronics is focusing on improving margins through enhanced operational efficiency and product diversification strategies.",
            "Sentiment": "positive",
            "PublishDate": 1762267813931,
            "Source": "stock"
        },
        {
            "Title": "GNG Electronics Reports 76% Jump in Q2 Net Profit to 326.6 Million Rupees",
            "Summary": "GNG Electronics reported consolidated net profit of 326.6 million rupees in Q2, up from 185.2 million rupees in the same period last year. Revenue increased to 4.4 billion rupees from 3.12 billion rupees year-over-year. EBITDA rose to 465.4 million rupees compared to 323.1 million rupees previously. The company's EBITDA margin improved slightly to 10.58% from 10.35% in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1762258227653,
            "Source": "earnings"
        },
        {
            "Title": "GNG Electronics Completes IPO Fund Utilization for Debt Repayment and Corporate Purposes",
            "Summary": "GNG Electronics Limited has utilized Rs. 383.11 crore out of its Rs. 400 crore IPO proceeds. The company repaid Rs. 220 crore in borrowings from various banks including Axis Bank, DBS Bank, Federal Bank, HDFC Bank, ICICI Bank, IDFC First Bank, and Kotak Mahindra Bank. Additionally, Rs. 100 crore was transferred to subsidiary Electronics Bazaar FZC for debt repayment of Rs. 72.45 crore to HDFC Bank and channel financing from RAK Bank and Emirates International Bank. The company spent Rs. 46.42 crore on vendor payments for raw materials under general corporate purposes and Rs. 16.69 crore on issue expenses. CARE Ratings Limited, serving as monitoring agency, reported no deviation from stated objectives and confirmed all fund utilization was completed ahead of the March 31, 2026 timeline. The remaining proceeds are deployed in fixed deposits with HDFC Bank.",
            "Sentiment": "positive",
            "PublishDate": 1762258199018,
            "Source": "corporate_action"
        },
        {
            "Title": "GNG Electronics Reports Quarterly Results, Approves HDFC Bank Credit Enhancement to Rs 2,283.50 Crores",
            "Summary": "GNG Electronics Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The Board approved several key decisions including enhancement of existing credit facilities from HDFC Bank Limited from Rs 272.50 crores to Rs 2,201.50 crores, along with additional Standby Letter of Credit of Rs 282.00 crores from Rs 277.00 crores, increasing overall sanctioned limits from Rs 2,149.50 crores to Rs 2,283.50 crores. The company also enhanced corporate guarantee from AED 10 million to AED 20 million in favor of Dubai Islamic Bank for its material subsidiary Electronics Bazaar (FZC). Other approvals included ratification of PRE-IPO ESOP Scheme, appointment of Ms. Ashita Pandya as Internal Auditor for FY 2025-26, and approval of material related party transaction with Electronics Bazaar FZC for sales of goods or services up to INR 300 crores. The Board also approved taking premises on lease from Raheja Universal for 60 months from November 1, 2025 to October 31, 2030.",
            "Sentiment": "positive",
            "PublishDate": 1762257224994,
            "Source": "earnings"
        },
        {
            "Title": "GNG Electronics Subsidiary Expands UAE Operations with New Ajman Facility Lease",
            "Summary": "Electronics Bazaar BLC, a branch of Electronics Bazaar (FZC) and material subsidiary of GNG Electronics Limited, has signed a Facility Lease Agreement with Free Zones Authority - Ajman for 1,017 sq.mt. of space in Ajman, UAE. The one-year lease runs from September 26, 2025 to September 25, 2026 and is renewable annually. The expansion aims to meet increasing operational requirements and enhance refurbishing and storage capacity in the region. The company has also secured additional refurbishment facilities at Sharjah airport international free zone totaling 750 sq.mt. With these additions, GNG Electronics' total UAE refurbishment facility size reaches 3,767 sq.mt., while global refurbishment facility size expands to 7,167 sq.mt.",
            "Sentiment": "positive",
            "PublishDate": 1759329028874,
            "Source": "stock"
        },
        {
            "Title": "GNG Electronics Reports 22% Revenue Growth and 55% Profit Jump in Q1 Results",
            "Summary": "GNG Electronics Limited, India's largest computer refurbisher, reported revenue of INR 3,123 million for the quarter ended June 30, 2025, marking 22% year-over-year growth. The company's profit after tax surged 55% to INR 185 million, with PAT margin reaching 5.94%. Gross margin improved to 21.4% from 20.2% previously, while EBITDA margin increased to 11.3% from 10.8%. The company processed 127,000 ICT devices during the quarter, representing 17% volume growth. GNG reduced debt by INR 320 crores using IPO proceeds and expanded its workforce from 1,200 to 1,370 employees. Management has set a 25% revenue growth target for the full year and expects 75-100 basis points margin improvement. The company operates across 39 countries and holds less than 10% market share in India's organized refurbished computer segment, which was valued at $1 billion and is expected to triple in the next 3-4 years.",
            "Sentiment": "positive",
            "PublishDate": 1756100877560,
            "Source": "earnings"
        },
        {
            "Title": "GNG Electronics Schedules Investor Call for August 19, 2025 Following Strong Financial Performance",
            "Summary": "GNG Electronics Limited has scheduled an investor and analyst call for August 19, 2025, and submitted its investor presentation to stock exchanges. The company, India's largest refurbisher of laptops and desktops, reported revenue of INR 1,411.11 crore in FY2025 with 24% year-over-year growth. EBITDA reached INR 126.14 crore with 48.6% growth, while profit after tax was INR 69.03 crore, growing 32%. The company operates across 38 countries with 590,787 devices refurbished and maintains 4,154 procurement partners. GNG expanded operations to Dallas, Texas in 2024 and received R2V3 certification for sustainable practices. The global used and refurbished electronics market is projected to grow from $207 billion in 2023 to $335 billion in 2028.",
            "Sentiment": "positive",
            "PublishDate": 1755607122569,
            "Source": "stock"
        },
        {
            "Title": "GNG Electronics Reports 52% Jump in Consolidated Net Profit, Enhances Subsidiary Guarantee",
            "Summary": "GNG Electronics Limited reported consolidated net profit of ₹18.52 crore for the quarter ended June 30, 2025, marking a 52.43% year-over-year increase and 25.56% quarter-over-quarter growth. Consolidated revenue from operations reached ₹312.28 crore, up 22.31% year-over-year but down 31.48% sequentially. The company's consolidated earnings per share rose to ₹2.03 from ₹1.12 in the same quarter last year. On a standalone basis, net profit grew 122.27% year-over-year to ₹10.18 crore, while revenue declined 4.11% to ₹172.14 crore. The Board approved increasing corporate guarantee from AED 10 million to AED 15 million for subsidiary Electronics Bazaar's working capital facility with Commercial Bank of Dubai. The ICT device company completed its IPO and listed on NSE and BSE on July 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755599969386,
            "Source": "earnings"
        },
        {
            "Title": "GNG Electronics Schedules Earnings Conference Call for August 19, 2025",
            "Summary": "GNG Electronics Limited has scheduled an earnings conference call with analysts and investors for August 19, 2025, at 6:00 PM IST, following their board meeting on the same day. The call will discuss Q1FY26 results and will be represented by Managing Director Sharad Khandelwal and Director Ajay Pancholi. Dial-in numbers have been provided for India and international participants including Hong Kong, Singapore, UK, and USA. The company operates under NSE symbol EBGNG and BSE scrip code 544455.",
            "Sentiment": "neutral",
            "PublishDate": 1755103891675,
            "Source": "earnings"
        },
        {
            "Title": "GNG Electronics Appoints Sarita Tufani Vishwakarma as Company Secretary and Compliance Officer",
            "Summary": "GNG Electronics Limited appointed Ms. Sarita Tufani Vishwakarma as Company Secretary effective October 8, 2024, and as Compliance Officer effective November 22, 2024. She holds a bachelor's degree in commerce from University of Mumbai and is an associate member of the Institute of Company Secretaries of India. Vishwakarma was previously associated with Magenta EV Solutions Private Limited and Paras Defence & Space Technologies Limited. She continues to serve as Compliance Officer following the company's share listing on stock exchanges on July 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753881807817,
            "Source": "corporate_governance"
        }
    ]
}