{
    "Symbol": "ECLERX",
    "ISIN": "INE738I01010",
    "News": [
        {
            "Title": "eClerx Services Announces Postal Ballot for Key Resolutions",
            "Summary": "eClerx Services seeks shareholder approval via postal ballot for director re-appointment, ESOP scheme amendment increasing loan limit to ₹6,000 million, and 1:1 bonus share issue.",
            "Sentiment": "positive",
            "PublishDate": 1770120982098,
            "Source": "co_actions_results"
        },
        {
            "Title": "eClerx Amends Insider Trading Code Post Board Approval",
            "Summary": "eClerx Services Limited's Board approved amendments to its Code of Conduct for Prohibition of Insider Trading, effective January 28, 2026, in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769611539626,
            "Source": "stocks"
        },
        {
            "Title": "eClerx Services Q3FY26 Results Show Strong Growth",
            "Summary": "eClerx Services reported consolidated revenue of Rs. 10,703.32 million for Q3FY26, up 25.38% YoY. Net profit surged 39.85% to Rs. 1,918.08 million. Board recommended 1:1 bonus issue.",
            "Sentiment": "positive",
            "PublishDate": 1769610149750,
            "Source": "co_actions_results"
        },
        {
            "Title": "eClerx Services Board Meet on Jan 28 for Q3FY26 Results",
            "Summary": "eClerx Services Limited announces board meeting on January 28, 2026, to approve Q3FY26 financial results and consider bonus share issuance proposal.",
            "Sentiment": "neutral",
            "PublishDate": 1768998515199,
            "Source": "co_actions_results"
        },
        {
            "Title": "eClerx Services Completes ₹3,000 Cr Share Buyback",
            "Summary": "eClerx Services successfully completed its share buyback program, purchasing 625,000 shares at ₹4,800 each for total consideration of ₹3,000 crores with 209.87% oversubscription response.",
            "Sentiment": "positive",
            "PublishDate": 1765891027392,
            "Source": "co_actions_results"
        },
        {
            "Title": "eClerx Services Announces ₹3,000 Million Share Buyback Through Tender Offer",
            "Summary": "eClerx Services Limited has announced a buyback of up to 666,666 equity shares at ₹4,500 per share for a maximum amount of ₹3,000 million, representing 1.40% of total paid-up capital. The buyback, approved by shareholders through postal ballot on December 4, 2025, will be conducted through tender offer route with 15% reserved for small shareholders, aiming to return surplus funds and enhance shareholder value.",
            "Sentiment": "positive",
            "PublishDate": 1765000662908,
            "Source": "corporate_action"
        },
        {
            "Title": "eClerx Services Shareholders Approve Equity Buyback Through Tender Offer Route",
            "Summary": "eClerx Services Limited shareholders passed a special resolution approving the buyback of equity shares through tender offer route via postal ballot and remote e-voting process. The resolution received overwhelming support with 99.9986% votes in favor, with 439 shareholders participating in the e-voting process that concluded on December 4, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1764915541505,
            "Source": "corporate_action"
        },
        {
            "Title": "eClerx Services Proposes ₹3,000 Million Share Buyback Through Tender Offer",
            "Summary": "eClerx Services Limited has announced a proposal to buy back up to 666,666 equity shares at ₹4,500 per share through a tender offer route. The buyback amount will not exceed ₹3,000 million, representing 1.40% of total equity shares and 21.08% of aggregate paid-up capital and free reserves based on standalone financials. The buyback price represents a premium of 7.71% over the volume weighted average market price on BSE for one month preceding the board meeting announcement date. The company will seek shareholder approval through postal ballot, with voting scheduled from November 5, 2025 to December 4, 2025. Results will be announced on December 5, 2025. The buyback aims to return surplus funds to shareholders and improve return on equity. Promoters and promoter group members have expressed their intention not to participate in the buyback.",
            "Sentiment": "positive",
            "PublishDate": 1762311335165,
            "Source": "corporate_action"
        },
        {
            "Title": "eClerx Services Announces Merger of Two Step-Down Subsidiaries",
            "Summary": "eClerx Services Limited announced the merger of two wholly-owned step-down subsidiaries effective November 3, 2025. Eclipse Global Holdings Inc merged with Personiv Eclipse Inc, both acquired by eClerx in December 2020. For the financial year ended March 31, 2025, Eclipse Global Holdings reported turnover of Rs 0.36 million while Personiv Eclipse reported Rs (26.20) million. The merger involves business process management entities and aims at consolidation for efficient corporate structure. No cash consideration or new share issuance is involved, and eClerx's shareholding pattern remains unchanged as it is not a direct party to the merger.",
            "Sentiment": "neutral",
            "PublishDate": 1762295321149,
            "Source": "corporate_action"
        },
        {
            "Title": "eClerx Reports Strong Q2 Performance with 5.7% Sequential Revenue Growth and 28.8% EBITDA Margin",
            "Summary": "eClerx Services delivered strong quarterly results with operating revenue of $115.5 million, up 5.7% sequentially, and INR 10,049 million, up 7.5% sequentially. EBITDA reached INR 2,983 million at a 28.8% margin, up 27% sequentially, while PAT was INR 1,832 million at 17.7% margin, up 29% sequentially. For H1, USD operating revenue was $225 million, showing 17% year-on-year growth. Deal wins for the quarter totaled $46 million. The company saw strong growth in emerging businesses due to operations going live for clients in the Financial Services subsegment, while growth was also strong in Communication, Media & Telecom and Hi-Tech verticals. BFSI grew modestly, and Fashion Luxury continues to face pressure. The Board approved a buyback of INR 300 crores, with promoters not participating. Management expects Q3 margins to be lower than Q2 due to recent INR appreciation, but maintains the full-year margin guidance of 24-28%. The company added 400 seats in Pune and reported 20% attrition. Days Sales Outstanding improved to 76 days from the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761852281580,
            "Source": "earnings"
        },
        {
            "Title": "EclecticX Services Sets Growth Target, Expects Margin Pressure in Q3",
            "Summary": "EclecticX Services has set a growth target in the top quartile and expects to surpass last year's annual contract value of around INR 140-142 million. The company anticipates weaker Q3 margins compared to Q2 due to recent INR strength. Despite the expected quarterly margin pressure, the company maintains its full-year EBITDA margin forecast at 24-28%.",
            "Sentiment": "neutral",
            "PublishDate": 1761622505255,
            "Source": "stock"
        },
        {
            "Title": "Eclerx Announces ₹300 Crore Share Buyback at ₹4,500 Per Share",
            "Summary": "Eclerx Services Ltd announced a buyback of up to 6.66 lakh equity shares worth ₹300 crore at ₹4,500 per share. The buyback represents 21.08% of total paid-up equity capital and 13.80% of consolidated reserves. The company will conduct the buyback through tender offer route with 15% shares reserved for small shareholders. Promoters and promoter group members will not participate in the buyback. The process requires shareholder approval through postal ballot and e-voting. Emkay Global Financial Services will manage the buyback process. Promoters currently hold 53.81% shareholding while public holds 44.69%.",
            "Sentiment": "positive",
            "PublishDate": 1761480425723,
            "Source": "corporate_action"
        },
        {
            "Title": "EclecticX Services Reports Strong Q2 Results and Announces 3 Billion Rupee Share Buyback",
            "Summary": "EclecticX Services received approval for a share buyback program worth up to 3 billion rupees at 4,500 rupees per share through a tender offer. The company reported strong quarterly financial performance with consolidated net profit rising to 1.8 billion rupees from 1.4 billion rupees year-over-year. Revenue increased to 10 billion rupees compared to 8.3 billion rupees in the same period last year. EBITDA grew to 2.7 billion rupees from 2.2 billion rupees year-over-year, while EBITDA margin improved to 26.98% from 25.93%.",
            "Sentiment": "positive",
            "PublishDate": 1761320383581,
            "Source": "corporate_action"
        },
        {
            "Title": "Eclerx Services Board to Review Share Buyback Plan on October 24",
            "Summary": "Eclerx Services has announced that its board will review a share buyback plan on October 24. The company has scheduled this board meeting to consider the proposed buyback initiative.",
            "Sentiment": "neutral",
            "PublishDate": 1760707090743,
            "Source": "corporate_action"
        },
        {
            "Title": "eClerx Reports Strong Q1FY26 Results with 17.1% YoY Revenue Growth and Margin Expansion",
            "Summary": "eClerx Services Limited delivered robust quarterly results with operating revenue of USD 109.2 million, up 4.2% sequentially and 17.1% year-over-year. In INR terms, operating revenue reached INR 9,346 million, growing 4% sequentially and 19.5% YoY. EBITDA stood at INR 2,346 million with a margin of 24.8%, declining 6.3% sequentially but rising 25.3% YoY. PAT was INR 1,417 million at 15% margin, down 6.9% sequentially but up 27% YoY. The company secured deal wins worth $32 million and reported strong growth across all verticals except Fashion and Luxury segment. Analytics and Automation services grew 6% over the previous quarter, outpacing overall firm growth. The company opened new operations in Lima during the quarter, with Cairo operations set to go live in Q2. Management expressed cautious optimism about demand environment while maintaining EBITDA margin guidance of 24-28%. The company has upskilled 8,000 employees (40% of workforce) in Gen AI training and is leveraging AI across its service offerings including compliance, KYC, and quality audit functions.",
            "Sentiment": "positive",
            "PublishDate": 1753879085917,
            "Source": "earnings"
        },
        {
            "Title": "eClerx Services Announces Tax Deduction Guidelines for Re. 1 Final Dividend",
            "Summary": "eClerx Services Limited has communicated tax deduction guidelines to shareholders for its final dividend of Re. 1 per equity share (10%) recommended by the Board of Directors at its meeting held on May 14, 2025. The dividend, subject to approval at the 25th Annual General Meeting, will be paid to shareholders registered as of August 22, 2025. Under the Income-tax Act provisions amended by Finance Act 2020, dividends are taxable in shareholders' hands, requiring the company to deduct tax at source. For resident individual shareholders, TDS will be deducted at 10% unless exempt, with no TDS applicable if total dividend doesn't exceed Rs. 10,000 during FY 2025-26. Non-resident shareholders face 20% TDS (plus surcharge and cess) unless they provide documentation for DTAA benefits. The company has specified various exemption categories for institutional investors and provided detailed documentation requirements. Shareholders must submit required documents by 5:00 p.m. on August 21, 2025, to avail applicable tax benefits.",
            "Sentiment": "neutral",
            "PublishDate": 1753857479305,
            "Source": "corporate_action"
        },
        {
            "Title": "eClerx Services Uploads Earnings Call Audio Recording for Quarter Ended June 30, 2025",
            "Summary": "eClerx Services Limited has uploaded the audio recording of its earnings call for the quarter ended June 30, 2025, to its website. The earnings call was held on July 25, 2025, and discussed the company's financial results for the quarter. The audio recording is accessible through the company's website. This disclosure was made to stock exchanges NSE and BSE as part of regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1753456660590,
            "Source": "earnings"
        },
        {
            "Title": "EclecticX Services Reports Strong Q1 Performance with 20% Revenue Growth",
            "Summary": "EclecticX Services delivered robust quarterly results with revenue rising to 9.35 billion rupees from 7.8 billion rupees year-over-year. The company's consolidated net profit increased to 1.4 billion rupees compared to 1.1 billion rupees in the same period last year. EBITDA grew to 2.2 billion rupees from 1.7 billion rupees year-over-year, while EBITDA margin expanded to 23.60% from 21.28% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753366929345,
            "Source": "earnings"
        },
        {
            "Title": "eClerx Services Limited Approves Quarterly Financial Results for Period Ended June 30, 2025",
            "Summary": "eClerx Services Limited's Board of Directors approved the un-audited financial results for the quarter ended June 30, 2025, during a meeting held on July 24, 2025. The board meeting commenced at 2:15 p.m. and concluded at 6:00 p.m., where directors unanimously approved both standalone and consolidated financial results. The approved financials, along with the Limited Review Report from the Statutory Auditor, were submitted to stock exchanges including BSE and NSE. The company trades under scrip codes BSE-532927 and NSE-ECLERX.",
            "Sentiment": "neutral",
            "PublishDate": 1753366829791,
            "Source": "earnings"
        },
        {
            "Title": "eClerx Services: Targets 24-28% EBITDA Margin for FY26, Focuses on BFSI and Cable Media Growth",
            "Summary": "eClerx Services aims to maintain 24-28% EBITDA margin for FY26, focusing on BFSI and cable media sectors. Growth strategies include strengthening sales, cross-selling portfolio, and targeting larger deals. The company is exploring acquisitions in data, analytics, or technology sectors, potentially representing 10-20% of current revenue.",
            "Sentiment": "positive",
            "PublishDate": 1748308908000,
            "Source": "normal_news"
        },
        {
            "Title": "eClerx Services Ltd: Q4 Revenue Soars 17.2%, Annual Revenue Hits Record High",
            "Summary": "eClerx Services Ltd reported a 17.2% YoY increase in Q4 FY25 revenue to ₹898.3 crore. Net profit rose 16.6% to ₹152.2 crore. FY25 annual revenue reached a record ₹3,439.6 crore, up 15%. The company expanded its global footprint with a new delivery centre in Lima, Peru.",
            "Sentiment": "positive",
            "PublishDate": 1747286240000,
            "Source": "earnings"
        },
        {
            "Title": "eClerx Services Reports Q4 Results and Dividend Announcement",
            "Summary": "eClerx Services has announced its Q4 financial results and a dividend recommendation. The company's Q4 consolidated net profit increased to 1.5 billion rupees from 1.3 billion rupees year-over-year. Revenue rose to 8.98 billion rupees from 7.7 billion rupees in the same period. EBITDA grew to 2.2 billion rupees, up from 1.96 billion rupees, although the EBITDA margin slightly decreased to 24.35% from 25.51%. The company has recommended a dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747227412000,
            "Source": "result"
        },
        {
            "Title": "eClerx Services to Consider Q4 Results on May 14",
            "Summary": "eClerx Services has announced that it will consider its fourth quarter (Q4) financial results on May 14. This indicates that the company is preparing to release its latest quarterly earnings report, which will provide insights into its financial performance for the most recent fiscal period.",
            "Sentiment": "neutral",
            "PublishDate": 1746628512000,
            "Source": "default"
        },
        {
            "Title": "Eclerx Services Reports Q3 Financial Results",
            "Summary": "Eclerx Services has announced its Q3 consolidated financial results. The company reported a net profit of 1.37 billion rupees, slightly down from 1.4 billion rupees year-over-year, but marginally lower than the previous quarter's 1.39 billion rupees. Revenue for Q3 increased to 8.5 billion rupees, up from 7.5 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738197188000,
            "Source": "earnings"
        },
        {
            "Title": "eClerx Services Reports Q3 Financial Results",
            "Summary": "eClerx Services has announced its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q3 was 2 billion rupees, compared to 2.1 billion rupees in the same quarter last year. The EBITDA margin for Q3 stood at 23.42%, down from 27.51% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1738161073000,
            "Source": "earnings"
        },
        {
            "Title": "eClerx Services Reports Q3 Financial Results",
            "Summary": "eClerx Services has announced its Q3 financial results. The company reported a consolidated net profit of 1.37 billion rupees, slightly down from 1.4 billion rupees year-over-year and 1.39 billion rupees quarter-over-quarter. However, revenue increased to 8.5 billion rupees from 7.5 billion rupees in the same quarter last year, showing a significant year-over-year growth.",
            "Sentiment": "neutral",
            "PublishDate": 1738161020000,
            "Source": "earnings"
        },
        {
            "Title": "eClerx Services to Consider Q3 Results",
            "Summary": "eClerx Services Limited has announced that it will be considering its financial results for the third quarter on January 29. This indicates the company is preparing to release its quarterly earnings report, which will provide insights into its financial performance for the most recent three-month period.",
            "Sentiment": "neutral",
            "PublishDate": 1737556058000,
            "Source": "earnings"
        },
        {
            "Title": "eClerx Services Focuses on Productizing Services for Top Clients and Emerging Markets",
            "Summary": "eClerx Services is strategically shifting towards productizing their services. The company aims to offer these productized services to their top clients and expand into emerging markets. Additionally, eClerx is emphasizing cross-selling opportunities to maximize their business potential.",
            "Sentiment": "positive",
            "PublishDate": 1730951428000,
            "Source": "corporate_action"
        },
        {
            "Title": "eClerx Services Explores Acquisition of KYC Advisory Assets",
            "Summary": "eClerx Services has expressed interest in acquiring assets that provide consulting or advisory services upstream of their current KYC (Know Your Customer) service in financial markets. This information was shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1730951388000,
            "Source": "corporate_action"
        },
        {
            "Title": "eClerx Services Reports Q2 FY24 Financial Results",
            "Summary": "eClerx Services announced its Q2 financial results. The company's EBITDA increased to 2.16 billion rupees from 2.04 billion rupees year-over-year. However, the EBITDA margin decreased to 25.93% from 28.36% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730813613000,
            "Source": "result"
        },
        {
            "Title": "eClerx Services Reports Q2 FY24 Financial Results",
            "Summary": "eClerx Services announced its Q2 FY24 financial results. The company's consolidated net profit increased to 1.4 billion rupees, up from 1.36 billion rupees year-over-year and 1.1 billion rupees quarter-over-quarter. Revenue for Q2 rose to 8.3 billion rupees, compared to 7.22 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730813524000,
            "Source": "result"
        }
    ]
}