{
    "Symbol": "ECOSMOBLTY",
    "ISIN": "INE06HJ01020",
    "News": [
        {
            "Title": "Ecos Mobility Shares Q3 FY26 Earnings Call Audio",
            "Summary": "Ecos (India) Mobility & Hospitality Limited has made available the audio recording of its Q3 FY26 earnings conference call held on February 11, 2026, discussing financial performance for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770911788929,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ecos Mobility Board Meet Set for Feb 11 for Q3 Results",
            "Summary": "Ecos (India) Mobility & Hospitality Limited has scheduled its board meeting for February 11, 2026, to approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768817079195,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bandhan MF Raises Stake in Ecos India to 9.35%",
            "Summary": "Bandhan Mutual Fund acquired 1 lakh equity shares of Ecos India Mobility and Hospitality on December 12, 2025, increasing its holding from 7.21% to 9.35% through its Large Mid Cap Fund scheme.",
            "Sentiment": "positive",
            "PublishDate": 1765875149936,
            "Source": "mutualfunds"
        },
        {
            "Title": "ECOS Mobility Reports 34% Revenue Growth in Q2 FY26 Despite Rs 79.14 Million Bad Debt Provision",
            "Summary": "ECOS (India) Mobility & Hospitality Limited achieved record quarterly revenue of Rs 2,142 million in Q2 FY26, driven by 33.5% volume growth and addition of 67 new enterprise clients across Employee Transport Services and Chauffeured Car Rentals segments. The company took a one-time doubtful debt provision of Rs 79.14 million related to previous years, impacting EBITDA margins which declined to 11.47% from 14.79% year-on-year, though management maintains 17-20% revenue growth guidance.",
            "Sentiment": "positive",
            "PublishDate": 1763198854416,
            "Source": "earnings"
        },
        {
            "Title": "Ecos India Mobility & Hospitality Appoints Vandana Chamaria as Independent Director",
            "Summary": "Ecos India Mobility & Hospitality Limited shareholders approved the appointment of Ms. Vandana Chamaria (DIN: 07131829) as Non-Executive Independent Director effective November 12, 2025, through postal ballot. The appointment follows regulatory compliance under SEBI LODR regulations and strengthens the company's board governance structure.",
            "Sentiment": "positive",
            "PublishDate": 1763055566850,
            "Source": "corporate_action"
        },
        {
            "Title": "Ecos India Mobility & Hospitality Approves Quarterly Financial Results for September 2025",
            "Summary": "Ecos (India) Mobility & Hospitality Limited's Board of Directors approved standalone and consolidated unaudited financial results for the quarter and half-year ended September 30, 2025. The board meeting was held on November 11, 2025, commencing at 12:15 P.M. and concluding at 2:50 P.M. The company submitted these results along with limited review reports in compliance with SEBI listing regulations. The financial statements include results from the holding company and its wholly owned subsidiaries. The company operates ground transportation services in 100 cities in India and 30 countries worldwide.",
            "Sentiment": "neutral",
            "PublishDate": 1762855417007,
            "Source": "earnings"
        },
        {
            "Title": "ECOS (India) Mobility & Hospitality Reports Mixed Q2 Results with Revenue Growth",
            "Summary": "ECOS (India) Mobility & Hospitality reported Q2 consolidated net profit of 146 million rupees compared to 157 million rupees in the same period last year, representing a decline. However, the company's Q2 revenue increased to 2 billion rupees from 1.59 billion rupees year-over-year, showing growth in top-line performance.",
            "Sentiment": "neutral",
            "PublishDate": 1762854407032,
            "Source": "earnings"
        },
        {
            "Title": "Ecos Mobility Schedules Q2 & H1 FY26 Earnings Conference Call",
            "Summary": "Ecos (India) Mobility & Hospitality Limited has scheduled an earnings conference call for November 11, 2025, at 6:00 PM IST to discuss operational and financial performance for Q2 and H1 FY26 ended September 30, 2025. The company issued a revised intimation after the earlier conference call link was not functioning. Key participants include Chairman & Managing Director Rajesh Loomba, Joint Managing Director Aditya Loomba, Chief Operating Officer Deepali Dev, and Chief Financial Officer Hem Kumar Upadhyay. The company provides ground transportation services in 100 cities in India and operates in 30 countries worldwide.",
            "Sentiment": "neutral",
            "PublishDate": 1762831752547,
            "Source": "earnings"
        },
        {
            "Title": "Ecos (India) Mobility & Hospitality Seeks Shareholder Approval for Independent Director Appointment via Postal Ballot",
            "Summary": "Ecos (India) Mobility & Hospitality Limited has issued a postal ballot notice seeking shareholder consent for the appointment of Ms. Vandana Chamaria as an Independent Director. The e-voting period runs from October 13, 2025, to November 11, 2025, facilitated by NSDL. Ms. Chamaria, who holds DIN 07131829, is proposed to serve a five-year term from November 12, 2025, to November 11, 2030. She brings 22 years of experience across consumer-facing industries including CPG, QSR, retail, healthcare, and technology sectors, having worked with companies like Blue Tokai, Google India, Hero MotoCorp, Yum Restaurants, and GSK Consumer Healthcare. The company has appointed Mr. Deepak Kukreja as scrutinizer for the voting process. The cut-off date for voting eligibility is October 3, 2025, and the postal ballot notice is being sent electronically to registered shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1760119528107,
            "Source": "corporate_action"
        },
        {
            "Title": "Ecos (India) Mobility & Hospitality Board Recommends Vandana Chamaria as Independent Director",
            "Summary": "Ecos (India) Mobility & Hospitality Limited's Board of Directors has recommended the appointment of Ms. Vandana Chamaria as an Independent Director for a five-year term, subject to shareholder approval through special resolution. The recommendation was made following advice from the Nomination and Remuneration Committee during a board meeting on September 16, 2025. Ms. Chamaria brings over 22 years of experience in consumer-facing industries, with educational qualifications including PGP in Marketing & Finance and B.Sc. Economics Hons. She has previously worked with companies including Blue Tokai, Google India, Hero MotoCorp Limited, Yum Restaurants, and GSK Consumer Healthcare. The appointment will become effective upon shareholder approval, and she is not related to any other company directors.",
            "Sentiment": "positive",
            "PublishDate": 1758035157003,
            "Source": "corporate_governance"
        },
        {
            "Title": "ECOS India Reports 21.65% Revenue Growth to Rs 1,811 Crore in Q1 FY26",
            "Summary": "ECOS (India) Mobility & Hospitality Limited reported revenue from operations of Rs 1,811.19 crore, marking a 21.65% year-on-year growth. The mobility company's EBITDA stood at Rs 218.55 crore with a margin of 12.07%, down from 13.9% in the previous year. PAT remained flat at Rs 132.87 crore. The company added 53 new clients during the quarter, bringing its total active client base to 1,189, and expanded its owned fleet by 113 vehicles to reach 946 vehicles. Trip volumes grew approximately 20% year-on-year. ECOS operates through Employee Transport Services and Chauffeured Car Rentals segments with a 60:40 revenue mix. The company maintains its revenue growth guidance of 15-18% for FY26 and targets EBITDA margins in the 13-15% range. Management highlighted strong performance in Bangalore, Mumbai, and Delhi NCR regions, with Global Capability Centers contributing around 60% of ETS segment revenue.",
            "Sentiment": "positive",
            "PublishDate": 1755513387561,
            "Source": "earnings"
        },
        {
            "Title": "Ecos (India) Mobility & Hospitality Shares Audio Recording Link for Q1 FY26 Earnings Call",
            "Summary": "Ecos (India) Mobility & Hospitality Limited has made available the audio recording of its earnings conference call held on August 13, 2025, discussing the company's financial and operational performance for the first quarter ended June 30, 2025. The call was conducted at 2:00 PM IST and focused on the company's unaudited financial results for both consolidated and standalone operations. The audio recording can be accessed through a provided link and is also available on the company's website. The company operates ground transportation services across 100+ cities in India and 30+ countries worldwide.",
            "Sentiment": "neutral",
            "PublishDate": 1755096869831,
            "Source": "earnings"
        },
        {
            "Title": "Ecos (India) Mobility & Hospitality Sets August 20, 2025 as Record Date for Final Dividend",
            "Summary": "Ecos (India) Mobility & Hospitality Limited has fixed Wednesday, August 20, 2025, as the record date for determining shareholder eligibility for final dividend payment for the financial year ended March 31, 2025. The company issued this clarification to correct an inadvertent record date mentioned in their previous board meeting outcome dated August 12, 2025, which shareholders should disregard.",
            "Sentiment": "neutral",
            "PublishDate": 1755078441146,
            "Source": "corporate_action"
        },
        {
            "Title": "Ecos (India) Mobility & Hospitality Reports Quarterly Results, Appoints Auditors and Sets AGM Date",
            "Summary": "Ecos (India) Mobility & Hospitality Limited's Board approved quarterly financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹1,776.43 million and net profit after tax of ₹132.64 million. Consolidated revenue from operations stood at ₹1,811.19 million with net profit after tax of ₹132.87 million. The Board appointed M/s Kapoor Tandon & Co as Internal Auditor for financial year 2025-26 and M/s. DMK Associates as Secretarial Auditor for five consecutive years from 2025-26 to 2029-30, subject to shareholder approval. The company scheduled its 29th Annual General Meeting for September 16, 2025, through video conferencing and set August 18, 2025 as the record date for final dividend eligibility. During the quarter, the company incorporated a wholly owned subsidiary named Ecos Fleet Management Services Private Limited on June 11, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755002266724,
            "Source": "earnings"
        },
        {
            "Title": "ECOS (India) Mobility & Hospitality Announces Q4 Results and Dividend",
            "Summary": "ECOS (India) Mobility & Hospitality has declared a dividend of 2.4 rupees per share. The company reported Q4 revenue of 1.77 billion rupees, up from 1.5 billion rupees in the same quarter last year. Q4 consolidated net profit remained stable at 180 million rupees compared to the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747647715000,
            "Source": "result"
        },
        {
            "Title": "ECOS (India) Mobility & Hospitality Reports Q2 Financial Results",
            "Summary": "ECOS (India) Mobility & Hospitality has released its Q2 financial results. The company reported a consolidated net profit of 157 million rupees, slightly down from 165 million rupees in the same quarter last year. However, revenue increased to 1.6 billion rupees from 1.4 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731313989000,
            "Source": "result"
        },
        {
            "Title": "ECOS (India) Mobility & Hospitality Expands Luxury Car Fleet",
            "Summary": "<p>ECOS (India) Mobility & Hospitality has announced an <span class='positive'>expansion</span> of its presence in the <span class='positive'>luxury segment</span>. The company is <span class='positive'>increasing</span> its fleet of <b>luxury cars</b> and will be offering <span class='positive'>premium mobility services</span> across <b>major cities</b> in India.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728645545000,
            "Source": "corporate_action"
        }
    ]
}