{
    "Symbol": "EDELWEISS",
    "ISIN": "INE532F01054",
    "News": [
        {
            "Title": "Edelweiss Financial Services Files Investor Presentation",
            "Summary": "Edelweiss Financial Services Limited filed an investor presentation titled 'Our journey, presented through numbers and charts' under Regulation 30, showcasing growth across seven business segments.",
            "Sentiment": "neutral",
            "PublishDate": 1770714650854,
            "Source": "stocks"
        },
        {
            "Title": "Edelweiss AMC Launches Financial Services Fund NFO",
            "Summary": "Edelweiss Asset Management launches new equity scheme focused on financial services sector. NFO open from January 27 to February 10 with ₹100 minimum investment.",
            "Sentiment": "positive",
            "PublishDate": 1769498239436,
            "Source": "mutualfunds"
        },
        {
            "Title": "Edelweiss Allots 5,300 Equity Shares Under ESOP",
            "Summary": "Edelweiss Financial Services allotted 5,300 equity shares of face value Re. 1 each under its Employee Stock Incentive Plan 2011 on January 20, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768909476330,
            "Source": "co_actions_results"
        },
        {
            "Title": "Edelweiss Sells 10% Stake in Two Subsidiaries",
            "Summary": "Edelweiss Financial Services divests 10% ownership in EAML and ETCL to Westbridge Capital Associates in strategic transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1765991474510,
            "Source": "co_actions_results"
        },
        {
            "Title": "Edelweiss Financial Services Closes ₹2,500 Million Debenture Issue Early",
            "Summary": "Edelweiss Financial Services Limited announced early closure of its public issue of secured redeemable non-convertible debentures on December 11, 2025, instead of the scheduled December 18, 2025. The issue was for up to 25,00,000 debentures of ₹1,000 each with a base size of ₹1,250 million and oversubscription option up to ₹2,500 million total.",
            "Sentiment": "positive",
            "PublishDate": 1765283717825,
            "Source": "corporate_action"
        },
        {
            "Title": "Edelweiss Financial Services Launches ₹2,500 Million NCD Issue With 10.10% Annual Yield",
            "Summary": "Edelweiss Financial Services plans to raise ₹2,500 million through non-convertible debentures offering up to 10.10% annual yield, with CRISIL A+/Stable rating. The subscription window opens December 5, 2025 and closes December 18, 2025, providing investors a debt investment opportunity in the financial services sector.",
            "Sentiment": "positive",
            "PublishDate": 1764911131929,
            "Source": "corporate_action"
        },
        {
            "Title": "Edelweiss Financial Services Approves ₹250 Crore Secured NCD Public Issue",
            "Summary": "Edelweiss Financial Services has approved a public issue of ₹250 crore secured non-convertible debentures (NCDs). The approval enables the company to raise funds through debt securities offered to public investors.",
            "Sentiment": "positive",
            "PublishDate": 1764295583576,
            "Source": "corporate_action"
        },
        {
            "Title": "SEBI Approves WestBridge Capital's Acquisition of Stakes in Edelweiss Subsidiaries",
            "Summary": "Edelweiss Financial Services announced that SEBI has granted no-objection to WestBridge Capital's proposed acquisition of up to 15% equity stakes in Edelweiss Asset Management Limited (EAML) and Edelweiss Trusteeship Company Limited. The acquisition will be conducted through WestBridge's affiliates - Setu AIF Trust, Konark Trust, and MMPL Trust. SEBI's approval was communicated through a letter dated November 11, 2025, in accordance with SEBI Mutual Fund Regulations, 1996. The original disclosure regarding this sale was made by Edelweiss on August 22, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762975823309,
            "Source": "corporate_action"
        },
        {
            "Title": "Edelweiss Financial Reports 28% Growth in Quarterly PAT, Approves Rs 1,000 Crore Debenture Issue",
            "Summary": "Edelweiss Financial Services reported consolidated pre-MI PAT of Rs 175 crores for the quarter, up 28% year-on-year. The Board approved unaudited financial results for the second quarter and half year ended September 30, 2025, and authorized raising funds through public issue of non-convertible debentures for up to Rs 1,000 crores. Alternative Asset Management AUM grew 14% YoY to Rs 65,460 crores with fundraise of Rs 5,182 crores in six months. Mutual Fund business equity AUM increased 30% YoY to Rs 77,100 crores. MSME loans disbursed Rs 168 crores in the quarter, up 2.5x YoY. Housing Finance disbursements reached Rs 564 crores, up 2x YoY. The company maintains strong capitalization with surplus liquidity of Rs 5,055 crores and net worth of Rs 5,636 crores. Chairman Rashesh Shah highlighted the company's focus on scaling profitability and reducing corporate net debt, with plans for EAAA IPO around April 2026.",
            "Sentiment": "positive",
            "PublishDate": 1762868074592,
            "Source": "earnings"
        },
        {
            "Title": "Edelweiss Financial Services Reports Tax Write-Back and Board Approves Fundraising Plans",
            "Summary": "Edelweiss Financial Services reported a tax write-back of ₹2.8 billion for the quarter. The company's board approved fundraising of up to ₹10 billion through Non-Convertible Debentures (NCDs). The company's Q2 revenue was ₹18.6 billion compared to ₹27.9 billion in the same period last year, representing a year-over-year decline.",
            "Sentiment": "neutral",
            "PublishDate": 1762845716805,
            "Source": "stock"
        },
        {
            "Title": "Edelweiss Financial Services Reports Higher Quarterly Net Profit",
            "Summary": "Edelweiss Financial Services reported a consolidated net profit of 1.3 billion rupees for the second quarter, compared to 1.1 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1762845231158,
            "Source": "earnings"
        },
        {
            "Title": "Edelweiss Financial Services Allots 3.67 Lakh Equity Shares Under Employee Stock Plans",
            "Summary": "Edelweiss Financial Services Limited has allotted 3,67,683 equity shares with a face value of Re. 1 each under two employee stock plans - the Edelweiss Employees Stock Incentive Plan, 2011 and Edelweiss Employees Stock Appreciation Rights Plan, 2019. The Share Allotment Committee approved this allotment at its meeting held on October 30, 2025. The company has informed BSE Limited and National Stock Exchange of India Limited about this allotment.",
            "Sentiment": "neutral",
            "PublishDate": 1761849949316,
            "Source": "corporate_action"
        },
        {
            "Title": "Edelweiss Subsidiary Settles SEBI Case for ₹61.4 Lakh Over AIF Regulation Violations",
            "Summary": "EAAA India Alternatives Limited, a wholly-owned subsidiary of Edelweiss Financial Services Limited, has settled an administrative proceeding with SEBI for alleged non-compliance with Alternative Investment Funds regulations. The settlement involves payment of ₹61,42,500 and an agreement not to engage with certain mentioned officials for 12 months. SEBI issued the Settlement Order on September 30, 2025. Edelweiss states the settlement is procedural in nature and the mentioned officials have not been associated with the company for many years, indicating no material impact on the financial position, operations, or ongoing activities of EAAA, Edelweiss, or its subsidiaries.",
            "Sentiment": "neutral",
            "PublishDate": 1759335353539,
            "Source": "stock"
        },
        {
            "Title": "Edelweiss Financial Services Completes Merger of Wholly Owned Subsidiaries",
            "Summary": "Edelweiss Financial Services Limited announced the completion of a merger between its wholly owned subsidiaries. Edelweiss Retail Finance Limited has been amalgamated into ECL Finance Limited, effective September 30, 2025, as sanctioned by the National Company Law Tribunal, Mumbai. The tribunal approved the scheme of amalgamation on September 12, 2025, and the certified copy was filed with the Ministry of Corporate Affairs on September 30, 2025. Following the merger's completion, Edelweiss Retail Finance Limited ceased to be a subsidiary of Edelweiss Financial Services Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1759301326738,
            "Source": "corporate_action"
        },
        {
            "Title": "Edelweiss Financial Services Discloses Voting Results from 30th Annual General Meeting",
            "Summary": "Edelweiss Financial Services Limited disclosed voting results from its 30th Annual General Meeting held on September 26, 2025. The company had 2,78,942 total shareholders on the cut-off date of September 20, 2025. The meeting was attended by 76 shareholders through video conferencing (7 promoter group members and 69 public shareholders). Four ordinary resolutions were voted upon: adoption of audited financial statements for the year ended March 31, 2025; declaration of dividend on equity shares; re-appointment of Mr. Rashesh Shah as Director; and appointment of M/s. SVVS & Associates Company Secretaries LLP as Secretarial Auditors. All resolutions were approved with over 99% votes in favor. The voting was conducted through remote e-voting, with 54.47% of total outstanding shares participating in the voting process across promoter group, public institutions, and public non-institutions categories.",
            "Sentiment": "neutral",
            "PublishDate": 1758903183464,
            "Source": "corporate_action"
        },
        {
            "Title": "Edelweiss Financial Services Plans ₹3,000 Million Debenture Public Offering",
            "Summary": "Edelweiss Financial Services plans to launch a public offering of secured redeemable non-convertible debentures worth ₹3,000 million. The debentures will be secured and redeemable, providing investors with a debt investment option from the financial services company.",
            "Sentiment": "neutral",
            "PublishDate": 1758693175621,
            "Source": "stock"
        },
        {
            "Title": "Edelweiss Financial Services Launches ₹3,000 Crore NCD Public Issue",
            "Summary": "Edelweiss Financial Services has approved a public issue of secured, redeemable, non-convertible debentures worth up to ₹3,000 crore. The issue has a base size of ₹1,500 crore with a green shoe option of additional ₹1,500 crore. The NCDs carry a face value of ₹1,000 each and will open for subscription on September 24, 2025, closing on October 8, 2025. The debentures offer coupon rates ranging from 9.00% to 10.25% per annum across ten different series with tenors of 24, 36, 60, and 120 months. CRISIL has rated the NCDs as 'A+/Stable' for ₹10,000 crore. The minimum application amount is ₹10,000 for 10 NCDs. The NCDs will be listed on BSE Limited and are secured by pari passu charge on various assets including loans, receivables, investments, and immovable properties, maintaining 100% security cover.",
            "Sentiment": "positive",
            "PublishDate": 1758216781017,
            "Source": "corporate_action"
        },
        {
            "Title": "Edelweiss Asset Management Reports Strong Growth with $16.6 Billion AUM and 44% Five-Year CAGR",
            "Summary": "Edelweiss Financial Services provided a business update on its wholly owned subsidiary, Edelweiss Asset Management Limited. The company reported total mutual fund assets under management of $16.6 billion, with equity AUM reaching $7.3 billion. The firm achieved a five-year compound annual growth rate of 44% compared to the industry average of 24%. Key performance metrics include a SIP book of $46 million with 62% five-year CAGR versus industry growth of 25%, and 2.6 million retail folios with 50% five-year CAGR against industry growth of 21%. The company's equity market share increased from 0.7% to 1.3% between FY20 and FY25. Revenue grew at a 40% CAGR, with the firm ranking 20th by total AUM. Edelweiss operates through a network of over 15,400 active distributors across 45 locations and 24,000+ pin codes. The company has launched several industry-first products including India's first Corporate Bond ETF (Bharat Bond) and various innovative fund offerings across fundamental investing, factor investing, and fixed income categories.",
            "Sentiment": "positive",
            "PublishDate": 1757079821963,
            "Source": "stock"
        },
        {
            "Title": "Edelweiss Financial Services Clarifies Block Deal Was Employee Welfare Trust Transaction, Not Promoter Sale",
            "Summary": "Edelweiss Financial Services has denied that promoters sold shares in a recent block deal. The company clarified that the block deal transaction was conducted by its Employee Welfare Trust, not by the promoters.",
            "Sentiment": "neutral",
            "PublishDate": 1756301294387,
            "Source": "stock"
        },
        {
            "Title": "Sunil Singhania's Abakkus Asset Manager Acquires 6.43 Million Shares in Edelweiss Financial Services",
            "Summary": "Sunil Singhania through Abakkus Asset Manager Pvt Ltd purchased 6.43 million shares of Edelweiss Financial Services via open market transactions. The acquisition represents a significant stake purchase in the financial services company.",
            "Sentiment": "positive",
            "PublishDate": 1756223518613,
            "Source": "order&deals"
        },
        {
            "Title": "Edelweiss to Sell 15% Stakes in EAML and ETCL to Westbridge Capital for ₹450 Crore",
            "Summary": "Edelweiss has announced plans to sell up to 15% stakes in EAML and ETCL to affiliates of Westbridge Capital. The transaction is valued at ₹450 crore. This deal involves the divestment of minority stakes in two of Edelweiss's subsidiaries to the investment firm.",
            "Sentiment": "neutral",
            "PublishDate": 1755847193269,
            "Source": "order&deals"
        },
        {
            "Title": "Westbridge Capital Leads Race to Acquire Minority Stake in Edelweiss Mutual Fund",
            "Summary": "Westbridge Capital, a $7 billion global investment firm, has emerged as the front-runner to acquire a minority stake in Edelweiss Mutual Fund, led by Radhika Gupta and owned by Edelweiss Financial Services. The deal is reportedly in its final stages, with potential completion within the next two weeks. Investment bank Nomura is serving as the sell-side advisor for the transaction. The exact stake size and deal value have not been disclosed. This transaction is part of Edelweiss's business evolution, with a potential listing planned in two to three years. Edelweiss Mutual Fund manages assets worth Rs 1.52 lakh crore with 20.70 lakh investors across 48 locations. Edelweiss Financial Services shares have declined 16% over the past month. Westbridge Capital has previously invested in various Indian financial services companies including HDFC Bank, ICICI Bank, Bajaj Finance, and Axis Bank.",
            "Sentiment": "neutral",
            "PublishDate": 1755701936016,
            "Source": "order&deals"
        },
        {
            "Title": "Venkat Ramaswamy to Step Down from Executive Role at Edelweiss Alternatives, Rashesh Shah Takes Over as Executive Chair",
            "Summary": "Venkat Ramaswamy will step down from his executive responsibilities at EAAA India Alternatives Limited effective September 30, 2025, due to personal reasons. He will continue serving on the Board of Edelweiss Financial Services Limited and maintain his association as a promoter. Rashesh Shah, Chairman of EAAA board, will assume the role of Executive Chair to provide strategic leadership as the business prepares for its IPO around April 2026. Amit Agarwal and Subahoo Chordia have already taken over as Chief Executive Officers of EAAA over the last two months, both having nearly two decades of experience with the firm. EAAA manages INR 62,970 crore in assets under management as of the quarter ended June 2025 and operates as a leading alternatives investment platform in India across private credit, real assets, and other non-traditional asset classes.",
            "Sentiment": "neutral",
            "PublishDate": 1755252986778,
            "Source": "corporate_governance"
        },
        {
            "Title": "Edelweiss Financial Services Makes Q1 FY2026 Earnings Call Transcript Available",
            "Summary": "Edelweiss Financial Services Limited notified stock exchanges that the transcript of their earnings call held on August 8, 2025, is now available on the company's website. The filing was made on August 11, 2025, in compliance with SEBI listing regulations. The earnings call covered the company's Q1 FY2026 performance, with the transcript accessible as a PDF document on their website for investors and analysts to review.",
            "Sentiment": "neutral",
            "PublishDate": 1754922227664,
            "Source": "earnings"
        },
        {
            "Title": "Edelweiss Financial Services Reports 20% YoY Growth in Consolidated PAT to INR 103 Cr for Q1 FY26",
            "Summary": "Edelweiss Financial Services Limited reported consolidated profit after tax of INR 103 crores for the quarter ended June 30, 2025, representing a 20% year-over-year increase. The company demonstrated strong performance across key business segments with Alternative Asset Management ARR AUM reaching INR 46,775 crores (up 12% YoY) and Mutual Fund Equity AUM growing 38% YoY to INR 72,600 crores. The company significantly reduced its consolidated net debt by INR 4,845 crores (31% YoY decline) to INR 10,920 crores, with corporate net debt falling by INR 2,260 crores (26% YoY). Customer reach expanded to 11 million, up 31% YoY, with total customer assets at INR 2.3 trillion. The insurance businesses showed improvement, with General Insurance losses declining 38% YoY and Life Insurance turning profitable at INR 2 crores from a loss of INR 49 crores in the previous year. The company announced plans to launch the EAAA IPO around April 2026, following completion of revenue reclassification exercises requested by SEBI. Net worth stood at INR 5,774 crores with book value per share at INR 48.",
            "Sentiment": "positive",
            "PublishDate": 1754558817292,
            "Source": "earnings"
        },
        {
            "Title": "Edelweiss Financial Services Reports 13% Growth in Net Profit Despite Revenue Decline",
            "Summary": "Edelweiss Financial Services reported consolidated net profit of 668 million rupees compared to 589 million rupees in the same quarter last year, representing a year-over-year increase. However, the company's revenue declined to 22.5 billion rupees from 23 billion rupees in the corresponding period of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754556564430,
            "Source": "earnings"
        },
        {
            "Title": "Avonmore Capital Reports Mixed Q1 Results with Revenue Growth and Profit Decline",
            "Summary": "Avonmore Capital & Management Services reported Q1 consolidated net profit of 73 million rupees, down from 86 million rupees in the same period last year. The company's Q1 revenue increased to 363 million rupees compared to 351 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1753951268577,
            "Source": "earnings"
        },
        {
            "Title": "Edelweiss Financial Services: Rs 300 Crore NCD Issue Launched with Up to 10.5% Yield",
            "Summary": "Edelweiss Financial Services has announced a public issue of secured redeemable NCDs worth up to Rs 300 crore, with a base size of Rs 150 crore and a green shoe option. The NCDs offer yields from 9.00% to 10.49% annually, with various tenure options. The issue opens on July 8, 2025, and closes on July 21, 2025. Funds will be used primarily for repayment of existing borrowings.",
            "Sentiment": "positive",
            "PublishDate": 1751956111000,
            "Source": "corporate_action"
        },
        {
            "Title": "Edelweiss Financial Services Announces Rs 3,000 Million Non-Convertible Debenture Offering",
            "Summary": "Edelweiss Financial Services has announced a public offering of Non-Convertible Debentures (NCDs) worth Rs 3,000 million. This move represents a significant corporate action by the company to raise funds through debt instruments. NCDs are fixed-income securities that cannot be converted into equity shares and typically offer higher interest rates compared to regular bonds.",
            "Sentiment": "neutral",
            "PublishDate": 1751951437000,
            "Source": "default"
        },
        {
            "Title": "Edelweiss Alternative Asset Advisors Plans IPO Refiling and Launch",
            "Summary": "Edelweiss Alternative Asset Advisors, a subsidiary of Edelweiss Financial Services, intends to refile its Initial Public Offering (IPO) Draft Red Herring Prospectus (DRHP) by the end of June. The company aims to launch the IPO by December, according to a report by CNBC TV18.",
            "Sentiment": "positive",
            "PublishDate": 1748248646000,
            "Source": "default"
        },
        {
            "Title": "Edelweiss Financial Services to Sell Stake in Mutual Funds Business",
            "Summary": "Edelweiss Financial Services plans to sell 25-30% of its mutual funds business, according to a report by CNBC TV18. No further details about the potential sale, such as the buyer or the expected value of the transaction, were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1748248578000,
            "Source": "default"
        },
        {
            "Title": "Edelweiss Financial Services: CLSA Sells 1.19% Stake in Bulk Deal",
            "Summary": "CLSA Global Markets sold 1.13 crore shares (1.19% stake) of Edelweiss Financial Services at Rs 88.55 per share, totaling Rs 100 crore. Miri Strategic Emerging Markets Fund LP acquired 1.11 crore shares (1.17% stake) for Rs 98 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1747244157000,
            "Source": "block_deals"
        },
        {
            "Title": "Edelweiss Financial Services Reports Q4 Results and Dividend",
            "Summary": "Edelweiss Financial Services has announced its Q4 financial results and a dividend declaration. The company reported a total revenue of 22 billion rupees, down from 29.7 billion rupees year-over-year. The consolidated net profit for Q4 stood at 1.05 billion rupees, compared to 1.7 billion rupees in the previous year. Additionally, the company has declared a dividend of 1.5 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1747213041000,
            "Source": "result"
        },
        {
            "Title": "Edelweiss Financial Services to Consider Q4 Results on May 14",
            "Summary": "Edelweiss Financial Services has announced that it will consider and approve its financial results for the fourth quarter on May 14. This is a standard corporate procedure where companies review and finalize their quarterly financial performance before making it public.",
            "Sentiment": "neutral",
            "PublishDate": 1746798141000,
            "Source": "default"
        },
        {
            "Title": "Edelweiss Financial Services Announces ₹2,000 Million NCD Public Issue",
            "Summary": "Edelweiss Financial Services has announced a public issue of Secured Redeemable Non-Convertible Debentures (NCDs) worth ₹2,000 million. This move is likely aimed at raising capital for the company's operations or expansion plans.",
            "Sentiment": "neutral",
            "PublishDate": 1744011648000,
            "Source": "corporate_action"
        },
        {
            "Title": "Edelweiss Financial Services: Rs 200 Crore NCD Issue Announced",
            "Summary": "Edelweiss Financial Services Ltd. plans to raise up to Rs 200 crore through Non-Convertible Debentures (NCDs) with a base size of Rs 100 crore and a green shoe option for an additional Rs 100 crore. The issue opens on April 8, 2025, and closes on April 24, 2025, with a CRISIL A+/Stable rating. Coupon rates range from 9.5% to 11%, with an additional 2% for delays. The company is focusing on scaling up retail lending through an asset-light model, emphasizing mortgages and MSME loans.",
            "Sentiment": "positive",
            "PublishDate": 1743171721000,
            "Source": "corporate_action"
        },
        {
            "Title": "Edelweiss Financial Services: Clarifies Rs 750 Crore Fraud Allegation",
            "Summary": "Edelweiss Financial Services denies fraud allegations by Ecstasy Realty, stating it's a civil dispute. Edelweiss claims Ecstasy owes them Rs 1,700 crore, including Rs 480 crore in principal. The company refutes misappropriation claims and explains Ecstasy's loan default history.",
            "Sentiment": "neutral",
            "PublishDate": 1742183046000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Edelweiss Financial Approves 10 Billion Rupee Fundraising",
            "Summary": "Edelweiss Financial Services has approved a plan to raise funds totaling 10 billion rupees. This decision indicates a significant financial move for the company, potentially aimed at strengthening its capital base or funding expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1738917184000,
            "Source": "corporate_action"
        },
        {
            "Title": "Edelweiss Financial Services Reports Q3 Revenue Decline",
            "Summary": "Edelweiss Financial Services has reported a revenue of 19.3 billion rupees for the third quarter, compared to 24 billion rupees in the same period last year, indicating a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1738916942000,
            "Source": "earnings"
        },
        {
            "Title": "Edelweiss Financial Services Reports Q3 Consolidated Net Profit",
            "Summary": "Edelweiss Financial Services announced its third-quarter consolidated net profit of 1.24 billion rupees, compared to 1.25 billion rupees in the same period last year. This represents a marginal year-over-year decrease in profit.",
            "Sentiment": "neutral",
            "PublishDate": 1738916812000,
            "Source": "earnings"
        },
        {
            "Title": "Edelweiss Financial Services to Consider Q3 Results",
            "Summary": "Edelweiss Financial Services has announced that it will consider its third quarter (Q3) financial results on February 7. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738242905000,
            "Source": "earnings"
        },
        {
            "Title": "Edelweiss Financial Services: Launches ₹100 Crore NCD Issue with Green Shoe Option",
            "Summary": "Edelweiss Financial Services has launched a ₹100 crore public issue of secured redeemable non-convertible debentures (NCDs) with a green shoe option for an additional ₹100 crore. The NCDs offer various tenures and interest options, with effective annual yields ranging from 9.50% to 11%. The issue opened on January 7, 2025, and will close on January 20, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1736260230000,
            "Source": "corporate_action"
        },
        {
            "Title": "Edelweiss Financial Services: Shifts Focus to Quality-Driven Growth",
            "Summary": "Edelweiss Financial Services aims for 18-25% growth over the next three years, prioritizing quality over rapid expansion. The company is reducing its wholesale lending business by 80% and focusing on MSME credit, asset management, and insurance segments. RBI recently lifted business restrictions on ECL Finance and Edelweiss Asset Reconstruction Co.",
            "Sentiment": "positive",
            "PublishDate": 1734577867000,
            "Source": "normal_news"
        },
        {
            "Title": "Edelweiss Financial Services: Unlocking Value Through Subsidiary IPOs and Stake Sales",
            "Summary": "Edelweiss Financial Services plans to unlock value over the next 12 months. EAAA India Alternatives has filed for an IPO, and Edelweiss Asset Management is preparing for a stake sale. The company aims to complete these by FY26. RBI has lifted business restrictions on ECL Finance and Edelweiss Asset Reconstruction. The insurance business is expected to break even in 18 months. Alternative asset management AUM has crossed Rs 50,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1734577581000,
            "Source": "corporate_action"
        },
        {
            "Title": "Edelweiss Financial Services: RBI Lifts Business Restrictions on Two Group Entities",
            "Summary": "The Reserve Bank of India has removed business restrictions on ECL Finance and Edelweiss Asset Reconstruction Company, two key Edelweiss Group entities, effective immediately. This decision follows the companies' implementation of remedial measures to address previous supervisory concerns.",
            "Sentiment": "positive",
            "PublishDate": 1734493242000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Edelweiss Group: RBI Lifts Business Restrictions on Two Subsidiaries",
            "Summary": "The Reserve Bank of India (RBI) has removed business restrictions on ECL Finance Ltd and Edelweiss Asset Reconstruction Company Ltd, effective immediately. The decision follows the companies' successful implementation of remedial measures to address regulatory concerns and their commitment to ongoing compliance.",
            "Sentiment": "positive",
            "PublishDate": 1734448416000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Edelweiss Financial: Debt Reduction Plan Unveiled",
            "Summary": "Rashesh Shah, likely the CEO of Edelweiss Financial, has announced plans to reduce the company's debt to below ₹1,000 crore within a year.",
            "Sentiment": "positive",
            "PublishDate": 1733990618000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Edelweiss Financial Services: Potential Minority Stake Sale in Mutual Fund Arm",
            "Summary": "Edelweiss Financial Services is considering selling a 25-35% stake in its mutual fund business, Edelweiss Mutual Fund, seeking a valuation of $600 million. The company is open to exploring opportunities with minority strategic partners to strengthen its international business. Edelweiss has clarified that it has disclosed all relevant details to the exchanges and will continue to do so.",
            "Sentiment": "positive",
            "PublishDate": 1732591862000,
            "Source": "corporate_action"
        },
        {
            "Title": "Edelweiss Financial Services Reports Q2 Financial Results",
            "Summary": "Edelweiss Financial Services has announced its Q2 financial results. The company's EBITDA increased to 10.17 billion rupees, up from 8 billion rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 35.91% from 36.64% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730190150000,
            "Source": "result"
        },
        {
            "Title": "Edelweiss Financial Services Reports Q2 Revenue Growth",
            "Summary": "Edelweiss Financial Services announced its Q2 revenue of 28.32 billion rupees, showing a significant increase from 21.56 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730190065000,
            "Source": "result"
        }
    ]
}