{
    "Symbol": "EFCIL",
    "ISIN": "INE886D01026",
    "News": [
        {
            "Title": "EFC (I) Limited Gets Promoter Reclassification Nod",
            "Summary": "EFC (I) Limited received no-objection letters from NSE and BSE for reclassifying two promoters from Promoter to Public category under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769686031391,
            "Source": "co_actions_results"
        },
        {
            "Title": "EFC (I) Limited Converts ₹15 Cr Loan to CCDs",
            "Summary": "EFC (I) Limited converts existing unsecured loan of ₹15.00 crores into 150 Compulsory Convertible Debentures in its wholly owned subsidiary EFC Limited, each valued at ₹10.00 lakh.",
            "Sentiment": "neutral",
            "PublishDate": 1769067295781,
            "Source": "co_actions_results"
        },
        {
            "Title": "EFC (I) Limited Acquires Additional Stakes in Two Entities",
            "Summary": "EFC (I) Limited has acquired additional stakes in Ek Design Industries Limited and Forty Two Ventures Limited, increasing its shareholding to 89.59% and 100% respectively through cash transactions.",
            "Sentiment": "positive",
            "PublishDate": 1766762581636,
            "Source": "co_actions_results"
        },
        {
            "Title": "EFC(I) Limited Completes Amalgamation with Whitehills Interior Limited",
            "Summary": "Umesh Kumar Sahay and persons acting in concert acquired shares in EFC(I) Limited through a scheme of amalgamation with Whitehills Interior Limited, sanctioned by NCLT Mumbai on November 12, 2025 and effective November 28, 2025. The group's shareholding increased from 45.44% to 60.44% through allotment of 3,77,29,230 equity shares of Rs. 2 each, with total share capital rising from Rs. 19.91 crores to Rs. 27.46 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1764660298461,
            "Source": "corporate_action"
        },
        {
            "Title": "EFC(I) Limited Completes Merger with Whitehills Interior Limited",
            "Summary": "EFC(I) Limited's Board approved the allotment of 3,77,30,000 equity shares of Rs.2 each to eligible shareholders of Whitehills Interior Limited following NCLT Mumbai Bench's merger approval dated November 12, 2025. The Scheme of Amalgamation became effective on November 28, 2025, with the newly allotted shares ranking equally with existing equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1764336830651,
            "Source": "corporate_action"
        },
        {
            "Title": "EFC(I) Limited Receives NCLT Approval for Merger with Whitehills Interior Limited",
            "Summary": "The National Company Law Tribunal Mumbai Bench approved the scheme of amalgamation between EFC(I) Limited and its subsidiary Whitehills Interior Limited on November 11, 2025, with an appointed date of April 1, 2023. EFC(I) Limited will issue 3,77,30,000 equity shares to Whitehills shareholders at a ratio of 385 shares for every 1 share held, while Whitehills will be dissolved without winding up.",
            "Sentiment": "positive",
            "PublishDate": 1763386011536,
            "Source": "corporate_action"
        },
        {
            "Title": "EFC India Reports 76.6% Revenue Growth in H1 FY26, Expands into Retail Leasing",
            "Summary": "EFC India Limited achieved consolidated revenue growth of 76.6% year-over-year in H1 FY26, with EBITDA jumping 69.4%, driven by strong performance across managed offices, design build, and furniture segments. The company announced expansion into retail leasing partnerships with large corporate chains and manages over 68,000 seats across 86 sites in 10 cities, while maintaining 90% occupancy rates.",
            "Sentiment": "positive",
            "PublishDate": 1763374282112,
            "Source": "earnings"
        },
        {
            "Title": "EFC Targets 50% Growth in Design-Build Business Over Next 2-3 Years",
            "Summary": "EFC's Whole-Time Director Nikhil Bhuta expressed confidence in achieving 50% topline growth in the design-and-build segment over the next two to three years, maintaining 24-26% net margins. The company plans to strengthen its leasing vertical by adding minimum 20,000 new seats annually, benefiting from increased Global Capability Centres influx and strong commercial real estate market conditions.",
            "Sentiment": "positive",
            "PublishDate": 1763175773385,
            "Source": "stock"
        },
        {
            "Title": "EFC(I) Limited Applies for Promoter Reclassification to Public Category",
            "Summary": "EFC(I) Limited has submitted applications to BSE and NSE seeking reclassification of promoter Shefal Chintan Parkh, holding 8,600 shares, from promoter category to public category under SEBI regulations. The reclassification application was made on November 14, 2025, following the company's earlier communication dated November 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763173266781,
            "Source": "corporate_action"
        },
        {
            "Title": "EFC(I) Limited Receives NCLT Approval for Scheme of Arrangement with Whitehills Interior Limited",
            "Summary": "EFC(I) Limited announced that the National Company Law Tribunal, Mumbai Bench has sanctioned the Scheme of Arrangement between EFC(I) Limited (Transferee Company) and Whitehills Interior Limited (Transferor Company) on November 12, 2025. The approval was granted under Company Scheme Petition No. CP(CAA)/217/MB/2025 in CA(CAA)/184/MB/2025, following the provisions of Sections 230 to 232 of the Companies Act, 2013. The company had previously made disclosures regarding this scheme in July 2023, September 2025, and October 2025. A copy of the NCLT order is awaited.",
            "Sentiment": "positive",
            "PublishDate": 1762990556823,
            "Source": "corporate_action"
        },
        {
            "Title": "EFC(I) Limited Reports No Deviation in Rs 242.44 Crore Preferential Issue Fund Utilization",
            "Summary": "EFC(I) Limited submitted its monitoring agency report for the quarter ended September 30, 2025, regarding the utilization of Rs 242.44 crore raised through preferential issue of equity shares. CARE Ratings Limited, serving as the monitoring agency, reported no deviation from the stated objects. The company utilized Rs 144.75 crore across three main objectives: Rs 127.68 crore for business growth through backward/forward integration including investments in subsidiaries, Rs 0.34 crore for technology and infrastructure investment, and Rs 16.75 crore for working capital requirements including subsidiary operations. The remaining Rs 97.67 crore remains unutilized, with Rs 100 crore deployed in fixed deposits earning 5.87% returns and the balance maintained in current accounts of various subsidiaries. The monitoring agency noted that the company has parked part of unutilized proceeds in subsidiaries' current accounts, which is not explicitly allowed under the offer document, though the Board had passed resolutions in May 2024 and members approved modifications in an extraordinary general meeting in July 2024 to allow fund utilization in subsidiaries for working capital requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1762986233792,
            "Source": "corporate_action"
        },
        {
            "Title": "EFC Reports 54% Jump in Q2 Net Profit to 446 Million Rupees",
            "Summary": "EFC delivered strong quarterly results with consolidated net profit rising to 446 million rupees from 289 million rupees in the same period last year. Revenue grew significantly to 2.54 billion rupees compared to 1.7 billion rupees year-over-year. EBITDA increased to 1.1 billion rupees from 793 million rupees, though EBITDA margin declined to 43.52% from 47.66% in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762913878095,
            "Source": "earnings"
        },
        {
            "Title": "EFC(I) Limited Reports Quarterly Results and Board Approves Promoter Reclassification Request",
            "Summary": "EFC(I) Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company reported standalone revenue from operations of Rs 1,096.42 lakhs for the quarter, with profit after tax of Rs 1,271.58 lakhs. Consolidated revenue from operations reached Rs 25,459.24 lakhs for the quarter, with profit after tax of Rs 5,671.19 lakhs. The Board also approved the request from promoters Ms. Shefali Chintan Parikhand and Mr. Niren Abhaykumar Jhaveri seeking reclassification from promoter category to public category, subject to stock exchange approvals. The company operates in rental, interior, and furniture segments, with rental being the primary revenue contributor.",
            "Sentiment": "positive",
            "PublishDate": 1762884995150,
            "Source": "earnings"
        },
        {
            "Title": "EFC Launches Retail Leasing Business Targeting Premium Properties in Metro Cities",
            "Summary": "EFC has started retail leasing operations focusing on high-end showrooms and shops across India. The company is targeting major commercial areas in metro and tier-1 cities. The first phase of these retail leasing projects is expected to launch by January 2026.",
            "Sentiment": "positive",
            "PublishDate": 1762418135179,
            "Source": "stock"
        },
        {
            "Title": "EFC(I) Limited Receives Reclassification Requests from Two Promoters to Public Category",
            "Summary": "EFC(I) Limited received requests from two promoters seeking reclassification from promoter category to public category. Ms. Shefali Chintan Parikh, holding 8,600 equity shares (0.01% of total equity), and Mr. Niren Abhaykumar Jhaveri, holding 600 equity shares (0.00% of total equity), submitted their requests on November 4, 2025. Both promoters stated they are not involved in day-to-day activities and do not exercise control over company affairs. They confirmed compliance with regulatory requirements including holding less than 10% voting rights, having no special rights, not being represented on the board, and not acting as key managerial personnel. The requests were made under Regulation 31A of SEBI LODR Regulations 2015.",
            "Sentiment": "neutral",
            "PublishDate": 1762384156107,
            "Source": "corporate_action"
        },
        {
            "Title": "EFC(I) Limited Shareholders Approve Increase in Authorised Share Capital via Postal Ballot",
            "Summary": "EFC(I) Limited shareholders have approved a resolution to increase the company's authorised share capital and make consequent alterations to the capital clause of the Memorandum of Association. The resolution was passed through remote e-voting conducted from October 7 to November 5, 2025, with 99.99% of votes cast in favor. The postal ballot process was scrutinized by Chirag Sachapara, a practicing company secretary, who confirmed the resolution was passed with requisite majority. The company informed BSE Limited and National Stock Exchange of India Limited about the voting results.",
            "Sentiment": "positive",
            "PublishDate": 1762358455990,
            "Source": "corporate_action"
        },
        {
            "Title": "EFC (I) Limited Converts Rs 20 Crore Loan into Compulsory Convertible Debentures",
            "Summary": "EFC (I) Limited has converted an existing unsecured loan of Rs 20 crore into 200 Compulsory Convertible Debentures (CCDs) in its wholly-owned subsidiary EFC Limited. Each CCD has a face value of Rs 10 lakh with a 0.001% conversion rate. EFC Limited operates in the managed office and co-working space sector, providing workspace services to enterprises and startups. The subsidiary reported a turnover of Rs 352.71 crore in FY 2024-25, showing significant growth from Rs 119.18 crore in FY 2022-23. This transaction represents a restructuring of existing debt into equity-convertible instruments within the group structure.",
            "Sentiment": "neutral",
            "PublishDate": 1761659855139,
            "Source": "corporate_action"
        },
        {
            "Title": "EFC (I) Limited Re-appoints Nikhil Bhuta as Whole-time Director for Five Years",
            "Summary": "EFC (I) Limited shareholders approved the re-appointment of Mr. Nikhil Dilipbhai Bhuta as Whole-time Director for a five-year term from October 1, 2025 to September 30, 2030, along with fixing his remuneration for three years. The decision was made at the company's 41st Annual General Meeting held on September 30, 2025 via video conferencing. Bhuta's previous term was set to expire on September 30, 2025. He is a qualified Chartered Accountant with over 26 years of experience across Real Estate, Infrastructure, Hospitality, Agritech, Mining, and Oil & Gas sectors, having held positions including CFO, Country Head, and CEO. He has experience raising capital on BSE, TSX, and AIM exchanges and is not related to any other Director or Key Managerial Personnel of the company.",
            "Sentiment": "positive",
            "PublishDate": 1759236238601,
            "Source": "corporate_governance"
        },
        {
            "Title": "EFC (I) Limited Awarded General Work Contract for Passport Seva Kendra in Pashan, Pune",
            "Summary": "EFC (I) Limited has been awarded a general work contract for a new Passport Seva Kendra at Pashan, Pune, under its ongoing Rate Contract for Passport Seva Kendras. The contract includes complete interior turnkey fit-outs for the facility. This project adds to EFC's existing portfolio of PSK projects, following successful execution of Ahmedabad and Hyderabad PSK projects. Managing Director Umesh Sahay expressed honor at receiving another PSK project under the Rate Contract. The company specializes in design and build solutions for commercial and corporate environments, providing integrated services from concept to completion.",
            "Sentiment": "positive",
            "PublishDate": 1758287383280,
            "Source": "stock"
        },
        {
            "Title": "EFC Limited's Furniture Segment Targets 20% Revenue Contribution Within Two Years",
            "Summary": "EFC Limited's Whole-Time Director Nikhil Bhuta outlined growth plans for the company's furniture division, which currently contributes 3-5% to total revenue. The division operates a three-acre manufacturing facility producing woodwork, metalwork, and seating systems for hospitality, residential, and commercial sectors, including exports and institutional projects. The company holds an order book of Rs 40-50 crore and expects to achieve 40-45% capacity utilization this financial year, with total production capacity valued at Rs 275-300 crore. Bhuta projects the furniture segment's revenue contribution will grow to 10-20% over the next two years, positioning it as a key component of EFC's real estate ecosystem.",
            "Sentiment": "positive",
            "PublishDate": 1758267237129,
            "Source": "stock"
        },
        {
            "Title": "EFC (I) Limited Shareholders Approve Merger with Whitehills Interior Limited",
            "Summary": "EFC (I) Limited held a meeting of equity shareholders on September 15, 2025, to vote on a scheme of amalgamation with Whitehills Interior Limited. The meeting was conducted via video conference as per NCLT order dated August 11, 2025. The company has 23,312 shareholders as of the record date of September 8, 2025. During the meeting, 3 promoters and promoter group members and 74 public shareholders attended through video conferencing. The company reported that the resolution was approved by shareholders with the requisite majority, based on the scrutinizer's report submitted by Mr. Chirag Sachapara of Sachapara & Associates.",
            "Sentiment": "positive",
            "PublishDate": 1757937268287,
            "Source": "corporate_action"
        },
        {
            "Title": "EFC (I) Limited Board Approves Re-appointment of Whole-time Director and New Secretarial Auditor",
            "Summary": "EFC (I) Limited's Board of Directors approved the re-appointment of Mr. Nikhil Dilipbhai Bhuta as Whole-time Director for five years, effective October 1, 2025 to September 30, 2030, subject to shareholder approval. His term was set to expire on September 30, 2025. The Board also appointed M/s. Sachapara & Associates as Secretarial Auditor for five consecutive financial years from FY 2025-26 to FY 2029-30, subject to shareholder approval. Mr. Bhuta is a Chartered Accountant with over 26 years of experience across Real Estate, Infrastructure, Hospitality, Agritech, Mining, and Oil & Gas sectors, having held positions including CFO, Country Head, and CEO. He has raised capital on BSE, TSX, and AIM exchanges. The Board meeting was held on September 8, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1757336390774,
            "Source": "corporate_governance"
        },
        {
            "Title": "EFC (I) Limited Announces Shareholder Meeting for Merger with Whitehills Interior Limited",
            "Summary": "EFC (I) Limited has scheduled a shareholder meeting on September 15, 2025, to approve a merger scheme with subsidiary Whitehills Interior Limited. The National Company Law Tribunal has directed the meeting to be held via video conferencing. Under the proposed merger, EFC will issue 3,77,30,000 equity shares to Whitehills shareholders, with the promoter shareholding increasing from 45.46% to 60.45%. Whitehills has shown strong financial growth, with revenue rising from ₹417.68 lakhs in FY23 to ₹25,478.63 lakhs in FY25, and profit after tax surging from ₹86.02 lakhs to ₹5,977.07 lakhs over the same period. The merger aims to create operational synergies and enhance EFC's earnings per share from ₹1.85 to ₹5.69. BSE Limited has issued a no-objection letter for the scheme.",
            "Sentiment": "positive",
            "PublishDate": 1755193103285,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLT Approves EFC (I) Limited's Scheme of Arrangement with Whitehills Interior Limited",
            "Summary": "The NCLT Mumbai Bench has directed EFC (I) Limited to convene a meeting of equity shareholders within 90 days to consider and approve a proposed Scheme of Arrangement with Whitehills Interior Limited. The scheme involves the amalgamation of Whitehills Interior Limited (transferor company) with EFC (I) Limited (transferee company) through merger by absorption. The Board of Directors of both companies approved the scheme on July 20, 2023, with an appointed date of April 1, 2023. Under the share exchange ratio, EFC (I) Limited will issue 385 fully paid-up equity shares of ₹2 each for every 1 fully paid-up equity share of ₹10 each held in Whitehills Interior Limited. The tribunal has dispensed with the requirement for meetings of Whitehills Interior's shareholders and unsecured creditors of both companies. EFC (I) Limited holds 51% of the issued and paid-up capital of Whitehills Interior Limited. The companies cited synergies, operational improvements, cost savings, and combined resources as key rationales for the merger.",
            "Sentiment": "positive",
            "PublishDate": 1754926050238,
            "Source": "corporate_action"
        },
        {
            "Title": "EFC India Reports 115% Revenue Growth to ₹220 Crores in Q1 FY26",
            "Summary": "EFC India Limited reported strong quarterly results with revenue growing 115% year-on-year to ₹220 crores and net profit surging 196% to ₹47 crores. The company operates through three business verticals: managed office solutions contributing 56% of revenue, design and build segment at 39%, and furniture manufacturing at 6%. The managed office division expanded to 63,389 seats across 82 sites in 10 cities with 90%+ occupancy. The design and build division secured new contracts including a ₹100 crore interior fit-out project and Passport Seva Kendra projects in Hyderabad. The furniture division, launched in September 2024, has manufacturing capacity of ₹250-300 crores with an order book of ₹22 crores. EBITDA reached ₹102 crores with margins improving by 110 basis points, while PAT margins jumped 580 basis points. The company plans to add 20,000-25,000 seats annually and is exploring property acquisitions through various structures including REITs.",
            "Sentiment": "positive",
            "PublishDate": 1753875504684,
            "Source": "earnings"
        },
        {
            "Title": "EFC (I) Limited Converts ₹15 Crore Loan into Debentures from Subsidiary EFC Limited",
            "Summary": "EFC (I) Limited has acquired 150 Compulsorily Convertible Debentures worth ₹15 crore from its wholly owned subsidiary EFC Limited. Each debenture has a face value of ₹10 lakh and carries a 0.001% rate. The transaction involves converting an existing unsecured loan of ₹15 crore into these debentures at arm's length pricing. EFC Limited operates in the managed office and co-working space sector, providing workspace services to enterprises and startups. The subsidiary reported a turnover of ₹352.71 crore for FY 2024-25, showing growth from ₹227.72 crore in FY 2023-24 and ₹119.18 crore in FY 2022-23. EFC (I) Limited maintains 100% shareholding in EFC Limited, which was incorporated in February 2014.",
            "Sentiment": "neutral",
            "PublishDate": 1753793943682,
            "Source": "corporate_action"
        },
        {
            "Title": "EFC (I) Limited Makes Q1 FY 2026 Earnings Call Audio Recording Available Online",
            "Summary": "EFC (I) Limited has made the audio recording of its Q1 FY 2026 earnings conference call available on its website. The call was held on July 24, 2025, and the recording can be accessed through the company's investor relations section. The company notified BSE Limited about the availability of this recording for investor access.",
            "Sentiment": "neutral",
            "PublishDate": 1753364261808,
            "Source": "earnings"
        },
        {
            "Title": "EFC (I) Limited Reports No Fund Utilization in Q1 FY26, Rs 99.87 Crore Remains Unutilized from Rs 242.44 Crore Preferential Issue",
            "Summary": "EFC (I) Limited submitted its monitoring agency report for the quarter ended June 30, 2025, showing zero utilization of proceeds from its Rs 242.44 crore preferential issue of equity shares to non-promoters. CARE Ratings Limited, serving as the monitoring agency, reported no deviation from stated objects. The company has utilized Rs 142.57 crore cumulatively across three main objectives: Rs 127.68 crore for business growth through subsidiaries investment, Rs 0.34 crore for technology and infrastructure, and Rs 14.55 crore for working capital. The remaining Rs 99.87 crore is deployed in fixed deposits with HDFC Bank earning 7.21% returns and current accounts. The company had previously revised its cost breakup and object definitions through a board resolution dated May 29, 2024, clarifying that business growth activities include investment in subsidiaries through securities, capital, loans, and advances.",
            "Sentiment": "neutral",
            "PublishDate": 1753363771320,
            "Source": "corporate_action"
        },
        {
            "Title": "EFC (I) Limited Reports Strong Q1 FY26 Results with 115% Revenue Growth",
            "Summary": "EFC (I) Limited reported consolidated revenue of ₹2,196 million for Q1 FY26, marking a 115% year-over-year increase from ₹1,021 million in Q1 FY25. EBITDA grew 120% to ₹1,023 million with margins improving to 46.6% from 45.5%. Profit After Tax surged 196% to ₹467 million, with PAT margins expanding to 21.3% from 15.5%. The company operates across three segments: Rental (55.6% of revenue), Design & Build (34.2%), and Furniture (2.3%). Total operational capacity reached 63,389 seats with 50,792 billed seats. The company secured new contracts worth ₹1,000 million in fit-out projects and was awarded two additional Passport Seva Kendra projects in Hyderabad. EFC also acquired Quantum Towers in Pune, a 122,000 sq. ft. facility, and secured its first international project in Saudi Arabia through subsidiary Ek Design Industries Limited.",
            "Sentiment": "positive",
            "PublishDate": 1753348090030,
            "Source": "earnings"
        },
        {
            "Title": "EFC Reports Strong Q1 Performance with Net Profit Doubling to 344M Rupees",
            "Summary": "EFC delivered robust quarterly results with consolidated net profit rising to 344 million rupees compared to 151 million rupees in the same period last year. The company's EBITDA more than doubled to 1.02 billion rupees from 464 million rupees year-over-year, while EBITDA margin improved to 46.56% from 45.45%. Revenue also showed strong growth, reaching 2.2 billion rupees versus 1 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753342594759,
            "Source": "earnings"
        },
        {
            "Title": "EFC (I) Limited Schedules Q1 FY26 Earnings Conference Call for July 24, 2025",
            "Summary": "EFC (I) Limited has scheduled an earnings conference call for analysts and investors to discuss Q1 FY26 results on Thursday, July 24, 2025 at 5:00 PM IST. The call will include participation from key company executives including Chairman & MD Umesh Sahay, Whole Time Director Nikhil Bhuta, CFO Uday Vora, and Company Secretary Aman Gupta. The company has provided dial-in numbers for domestic and international participants, with pre-registration available to avoid wait times. Contact details for investor relations have been shared through Company Secretary Aman Gupta.",
            "Sentiment": "neutral",
            "PublishDate": 1753101698056,
            "Source": "earnings"
        },
        {
            "Title": "EFC Secures INR 57 Crore Interior and Fit-Out Contract",
            "Summary": "EFC has been awarded an interior and fit-out contract valued at INR 57 crore. The contract involves work related to interior design and furnishing, though specific details about the project or client are not provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1751028111000,
            "Source": "default"
        },
        {
            "Title": "EFC Approves Application for NSE Listing",
            "Summary": "EFC (I) has considered and approved a proposal to make an application for listing the company's equity shares on the National Stock Exchange (NSE).",
            "Sentiment": "positive",
            "PublishDate": 1750031760000,
            "Source": "default"
        },
        {
            "Title": "EFC Board Approves Proposal for NSE Listing",
            "Summary": "The Board of Directors of EFC (I) has approved a proposal to apply for listing the company's equity shares on the National Stock Exchange (NSE). This decision indicates the company's intention to expand its presence in the Indian stock market.",
            "Sentiment": "positive",
            "PublishDate": 1749831717000,
            "Source": "default"
        },
        {
            "Title": "EFC (I) Acquires 99.99% Ownership in BigBox Serviced Office LLP",
            "Summary": "EFC (I) has acquired a 99.99% ownership stake in BigBox Serviced Office LLP. The acquisition is focused on the managed office and co-working space sector.",
            "Sentiment": "positive",
            "PublishDate": 1749128498000,
            "Source": "default"
        },
        {
            "Title": "EFC Awarded Two Additional PSK Projects in Hyderabad",
            "Summary": "EFC has been awarded two more Passport Seva Kendra (PSK) projects in Hyderabad, following a previous PSK project in Ahmedabad. These projects are part of a rate contract, suggesting a pre-established agreement for services or goods at specified prices.",
            "Sentiment": "positive",
            "PublishDate": 1748874781000,
            "Source": "default"
        },
        {
            "Title": "EFC Reports Significant Growth in Q4 Revenue and EBITDA",
            "Summary": "EFC has announced its Q4 financial results. The company's EBITDA increased to 1.1 billion rupees, up from 523 million rupees in the same quarter last year. The EBITDA margin, however, decreased to 52% from 56.13% year-over-year. Consolidated net profit rose to 308 million rupees from 280 million rupees in the previous year. Revenue showed substantial growth, reaching 2.1 billion rupees compared to 932 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1748571088000,
            "Source": "result"
        },
        {
            "Title": "EFC Secures 1.83 Billion Rupee Interior Turnkey Fit Out Contract",
            "Summary": "EFC (I) has been awarded an interior turnkey fit out contract worth 1.83 billion rupees. This significant contract suggests a major project in the interior design and construction sector for the company.",
            "Sentiment": "positive",
            "PublishDate": 1745453455000,
            "Source": "default"
        },
        {
            "Title": "EFC (I) Ltd and Pepperfry Form Joint Venture for Furniture and Logistics Business",
            "Summary": "EFC (I) Ltd has entered into a joint venture with Pepperfry for their furniture and logistics business. This partnership is described as 'game-changing,' suggesting it could have a significant impact on both companies and potentially the furniture retail and logistics sectors. The collaboration aims to combine EFC's strengths with Pepperfry's established presence in the furniture market.",
            "Sentiment": "positive",
            "PublishDate": 1738310125000,
            "Source": "corporate_action"
        },
        {
            "Title": "EFC Approves 1:1 Bonus Share Issue",
            "Summary": "The company EFC has approved a bonus share issue in the ratio of 1:1, meaning shareholders will receive one additional share for every share they currently hold. This corporate action aims to reward existing shareholders and potentially increase liquidity in the stock.",
            "Sentiment": "positive",
            "PublishDate": 1735274241000,
            "Source": "corporate_action"
        },
        {
            "Title": "Emberstone SM REIT Receives SEBI Registration, Plans INR 500 Crore IPO",
            "Summary": "EFC (I)'s subsidiary, Emberstone SM REIT, has received registration approval from the Securities and Exchange Board of India (SEBI). The company is now set to launch an Initial Public Offer (IPO) worth INR 500 crore.",
            "Sentiment": "positive",
            "PublishDate": 1730205824000,
            "Source": "corporate_action"
        },
        {
            "Title": "EFC Reports Strong Q2 Financial Results",
            "Summary": "EFC has announced its Q2 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 289 million rupees, up from 83 million rupees in the same quarter last year. Revenue also saw substantial growth, reaching 1.66 billion rupees compared to 977 million rupees in the previous year's Q2.",
            "Sentiment": "positive",
            "PublishDate": 1729819778000,
            "Source": "result"
        },
        {
            "Title": "EFC Reports Strong Q2 EBITDA Growth",
            "Summary": "EFC has announced its Q2 financial results, showing significant year-over-year improvement. The company's EBITDA increased from 401 million rupees to 793 million rupees. Additionally, the EBITDA margin expanded from 41.02% to 47.66%.",
            "Sentiment": "positive",
            "PublishDate": 1729819756000,
            "Source": "result"
        }
    ]
}