{
    "Symbol": "EICHERMOT",
    "ISIN": "INE066A01021",
    "News": [
        {
            "Title": "Eicher Motors Approves Rs 958 Cr Royal Enfield Expansion",
            "Summary": "Eicher Motors board approves Rs 958 crore capacity expansion for Royal Enfield at Cheyyar plant, targeting 20 lakh units annually by FY 2027-28 to meet rising demand.",
            "Sentiment": "positive",
            "PublishDate": 1770724213677,
            "Source": "stocks"
        },
        {
            "Title": "Eicher Motors Q3FY26 Net Profit Surges 22.1% to ₹1,290 Cr",
            "Summary": "Eicher Motors reports strong Q3FY26 performance with net profit rising 22.1% YoY to ₹1,289.99 crores. Revenue from operations grew 22.0% to ₹5,987.83 crores, driven by robust demand.",
            "Sentiment": "positive",
            "PublishDate": 1770723746071,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eicher Motors Allots 14,967 Equity Shares Under ESOP",
            "Summary": "Eicher Motors board approved allotment of 14,967 equity shares of Re. 1 face value each under ESOP 2006 and RSU Plan 2019 on February 10, 2026, following regulatory compliance under SEBI LODR Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770723059833,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eicher Motors Board Meet Set for Feb 10 for Q3 Results",
            "Summary": "Eicher Motors has scheduled a board meeting on February 10, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770104742599,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eicher Motors CV Sales Jump 25% to 10,601 Units in Jan",
            "Summary": "Eicher Motors reports strong commercial vehicle sales growth with 10,601 units sold in January compared to 8,489 units in the same period last year, marking a significant year-on-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1769937079635,
            "Source": "stocks"
        },
        {
            "Title": "Eicher Motors Reports 14.5% Jump in Jan Sales",
            "Summary": "Eicher Motors motorcycle division sold 1,04,322 units in January, up from 91,132 units year-on-year, exceeding analyst estimates of 102,100 units.",
            "Sentiment": "positive",
            "PublishDate": 1769926554705,
            "Source": "stocks"
        },
        {
            "Title": "Eicher Motors Shares Gain 2.05% on Strong Growth",
            "Summary": "Eicher Motors shares rose 2.05% to Rs 7,116 amid impressive financial performance. Revenue jumped 44.76% YoY to Rs 6,171.59 crore in Sep 2025, while net profit increased 25.15% to Rs 1,234.54 crore.",
            "Sentiment": "positive",
            "PublishDate": 1769506853534,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eicher Motors December Sales Jump 30% to 1.04 Lakh Units",
            "Summary": "Eicher Motors reported strong December motorcycle sales of 1,03,574 units, marking a 30% year-on-year growth with segment-wise performance breakdown.",
            "Sentiment": "positive",
            "PublishDate": 1767251258151,
            "Source": "stocks"
        },
        {
            "Title": "Eicher Motors CV Sales Rise 24.7% to 10,384 Units",
            "Summary": "Eicher Motors reported commercial vehicle sales of 10,384 units in December 2025, marking a 24.7% year-on-year growth from 8,324 units, with strong performance across domestic and export segments.",
            "Sentiment": "positive",
            "PublishDate": 1767242781596,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eicher Motors Gets GST Demand Order Worth ₹96.18 Cr",
            "Summary": "VE Commercial Vehicles receives GST demand order of ₹96.18 crores from Ujjain tax authorities for FY 2017-18 credit note reporting delays. Company plans to appeal the order.",
            "Sentiment": "negative",
            "PublishDate": 1767079191632,
            "Source": "stocks"
        },
        {
            "Title": "HSBC Upgrades Eicher Motors to Buy Rating",
            "Summary": "HSBC has upgraded Eicher Motors to a Buy rating with a target price of ₹8,000.00, signaling positive analyst sentiment for the automobile manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1765375618556,
            "Source": "stocks"
        },
        {
            "Title": "Royal Enfield Reports 22% Growth with 1,00,670 Motorcycles Sold in November 2025",
            "Summary": "Royal Enfield sold 1,00,670 motorcycles in November 2025, marking a 22% increase from 82,257 units sold in the same month last year, with exports reaching 10,265 units. The company celebrated its 125th anniversary at EICMA 2025, unveiling new models including Bullet 650 and Classic 650 Anniversary Edition, while concluding Motoverse 2025 in Goa and launching the Himalayan Mana Black Edition priced at INR 3,37,000.",
            "Sentiment": "positive",
            "PublishDate": 1764580307342,
            "Source": "stock"
        },
        {
            "Title": "Eicher Motors Receives Rs. 16.54 Lakh E-waybill Penalty Order from Uttar Pradesh Tax Authority",
            "Summary": "Eicher Motors received a penalty order of Rs. 16,54,341 from the Assistant Commissioner Jurisdiction, Sector 5, GB Nagar, Uttar Pradesh for alleged mismatch regarding place of unloading goods in E-waybill/E-Invoice and driver's statement. The company considers the demand not maintainable and is evaluating options including filing an appeal, stating no expected impact on its financials, operations or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1763720601696,
            "Source": "stock"
        },
        {
            "Title": "Eicher Motors Emphasizes Absolute Profit Growth Over Percentage Metrics",
            "Summary": "Eicher Motors highlighted its focus on absolute profit growth rather than percentage-based metrics during a conference call update. The company's strategic emphasis on absolute growth figures signals a shift in how it measures and communicates financial performance to stakeholders.",
            "Sentiment": "neutral",
            "PublishDate": 1763092682956,
            "Source": "earnings"
        },
        {
            "Title": "Eicher Motors Reports 24% YoY Jump in Q2 PAT to Rs 1,369 Crore",
            "Summary": "Eicher Motors reported a 24% year-on-year increase in consolidated net profit to Rs 1,369 crore for Q2, with revenue from operations surging 45% to Rs 6,172 crore. The Royal Enfield maker's joint venture VECV posted 5.4% YoY growth in Q2 volumes at 21,901 units, with heavy duty trucks achieving highest-ever Q2 sales of 5,915 units.",
            "Sentiment": "positive",
            "PublishDate": 1763090924457,
            "Source": "earnings"
        },
        {
            "Title": "Eicher Motors Guides Multi-Year Growth with Royal Enfield Expansion and New Model Launches",
            "Summary": "Eicher Motors outlined plans for strong multi-year growth driven by robust demand for Royal Enfield motorcycles, global expansion in LATAM and ASEAN markets, and launches of new 450cc and electric models. The company aims to maintain 24-26% EBITDA margins through technology-led differentiation while scaling commercial vehicle exports through its VECV joint venture.",
            "Sentiment": "positive",
            "PublishDate": 1763056265610,
            "Source": "stock"
        },
        {
            "Title": "Eicher Motors Maintains Current Pricing Strategy",
            "Summary": "Eicher Motors announced through a company executive that they are maintaining their current price levels. The statement indicates the company's decision to keep prices unchanged at this time.",
            "Sentiment": "neutral",
            "PublishDate": 1763037082082,
            "Source": "stock"
        },
        {
            "Title": "Eicher Motors Reports Strong Post-Festival Demand and Seeks Tax Relief for Premium Motorcycles",
            "Summary": "Eicher Motors reported good demand following the festival season with strong conversion rates from inquiries to bookings. The company expressed optimism about the commercial vehicle market improving in the second half of FY26. Additionally, Eicher Motors has requested a tax reduction to 18% for motorcycles in the over 350CC segments.",
            "Sentiment": "positive",
            "PublishDate": 1763036087070,
            "Source": "stock"
        },
        {
            "Title": "Eicher Motors Reports Strong Q2 Performance with Net Profit Rising to ₹1,208 Crores",
            "Summary": "Eicher Motors announced its quarterly results for the period ended September 30, 2025. The company reported a net profit after tax of ₹1,208.01 crores for the quarter, compared to ₹1,009.88 crores in the same quarter last year. Revenue from operations increased to ₹5,902.07 crores from ₹4,208.44 crores year-on-year. For the half-year period, net profit reached ₹2,514.50 crores versus ₹2,097.90 crores in the previous year, while revenue grew to ₹10,810.48 crores from ₹8,436.72 crores. The company's basic earnings per share for the quarter stood at ₹44.04 compared to ₹36.85 in the corresponding quarter last year. The Board of Directors approved these results at their meeting held on November 13, 2025. The company operates primarily in the automobile products and related components segment.",
            "Sentiment": "positive",
            "PublishDate": 1763030138295,
            "Source": "earnings"
        },
        {
            "Title": "Eicher Motors Reports Strong Q2 Results with 45% Revenue Growth",
            "Summary": "Eicher Motors reported quarterly consolidated revenue of 62 billion rupees, up from 42.6 billion rupees year-over-year, slightly exceeding estimates of 61.32 billion rupees. Net profit increased to 13.7 billion rupees from 11 billion rupees year-over-year, though falling short of estimates of 14.5 billion rupees. EBITDA rose to 15.12 billion rupees from 11 billion rupees year-over-year, marginally below estimates of 15.16 billion rupees. However, EBITDA margin compressed to 24.5% from 25.5% year-over-year, missing estimates of 24.7%.",
            "Sentiment": "positive",
            "PublishDate": 1763028268236,
            "Source": "earnings"
        },
        {
            "Title": "Eicher Motors Reports Mixed Q2 Results with Revenue Growth but Lower Margins",
            "Summary": "Eicher Motors reported quarterly revenue of 59 billion rupees, up from 42.6 billion rupees year-over-year, though below estimates of 61.32 billion rupees. EBITDA increased to 14.7 billion rupees from 11 billion rupees year-over-year but fell short of the 15.16 billion rupee estimate. EBITDA margin declined to 24.89% from 26.25% year-over-year, slightly above the estimated 24.7%. Net profit rose to 12 billion rupees from 11 billion rupees year-over-year but missed estimates of 14.5 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1763027298997,
            "Source": "earnings"
        },
        {
            "Title": "Eicher Motors Grants 2,126 Restricted Stock Units to Employees Under RSU Plan 2019",
            "Summary": "Eicher Motors' Nomination and Remuneration Committee approved the grant of 2,126 Restricted Stock Units under the company's RSU Plan 2019 to employees of the company and its subsidiaries. The grant is structured with 1,300 stock units becoming exercisable after 3 years and 826 stock units becoming exercisable after 2.5 years. Each stock unit will convert to one equity share with a face value of Re. 1 upon exercise.",
            "Sentiment": "neutral",
            "PublishDate": 1762990504838,
            "Source": "corporate_action"
        },
        {
            "Title": "Eicher Launches Pro X Diesel Range for Small Commercial Vehicle Segment",
            "Summary": "Eicher Trucks and Buses launched the Eicher Pro X Diesel range, adding a diesel-powered option to its small commercial vehicle portfolio for last-mile delivery. The range targets e-commerce, FMCG, cold chain, and local distribution applications. The vehicles feature a newly developed E449 diesel engine, 10-foot 8-inch cargo deck, and 30,000-kilometre service interval. Available in 3-ton and 3.5-ton variants, the range includes safety features like crash-test certified cabin, driver monitoring system, and connectivity through the My Eicher App with predictive diagnostics and real-time monitoring. The vehicles are manufactured at Eicher's Bhopal plant on an all-woman production line and can be booked through dealerships or the company website.",
            "Sentiment": "positive",
            "PublishDate": 1762756209345,
            "Source": "stock"
        },
        {
            "Title": "Royal Enfield Unveils New Motorcycle Lineup at EICMA 2025, Celebrates 125 Years of Operations",
            "Summary": "Royal Enfield showcased multiple new motorcycles at EICMA 2025 in Milan, marking its 125-year milestone. The company launched the Bullet 650 with a 650cc parallel twin engine, featuring vintage-inspired design elements and priced at €6,749-€7,499 across European markets. Other introductions include the Himalayan Mana Black Edition (priced at €6,400-€6,600), a Classic 650 125th Anniversary Special Edition with hypershift paint, and a limited-edition Shotgun 650 x Rough Crafts collaboration (100 units globally). The company's electric brand Flying Flea unveiled the scrambler-styled FF.S6, scheduled for launch by end of 2026. Royal Enfield operates through over 2,000 stores in India and nearly 850 stores across 65 countries globally, with production facilities near Chennai and assembly operations in seven countries.",
            "Sentiment": "positive",
            "PublishDate": 1762253936089,
            "Source": "stock"
        },
        {
            "Title": "Eicher Motors Commercial Vehicle Sales Rise 13% to 8,050 Units in October",
            "Summary": "Eicher Motors reported commercial vehicle sales of 8,050 units in October, representing a 13% increase from 7,112 units in the same period last year. The sales figure was marginally above the estimated 8,040 units.",
            "Sentiment": "positive",
            "PublishDate": 1762128864467,
            "Source": "stock"
        },
        {
            "Title": "Royal Enfield Achieves Record Festive Sales with 2.49 Lakh Motorcycles Sold in September-October 2025",
            "Summary": "Eicher Motors' Royal Enfield brand recorded its highest-ever festive performance, selling over 2.49 lakh motorcycles during September-October 2025, representing 26% growth over the same period last year. In October 2025 alone, the company sold 1,24,951 motorcycles, marking 13% growth compared to October 2024. The company exported 8,107 motorcycles during October. Models with engine capacity up to 350cc sold 1,10,874 units in October versus 96,837 units in the previous year, while models exceeding 350cc sold 14,077 units compared to 13,737 units. Managing Director B. Govindarajan attributed the performance to overwhelming customer response across the country. The company also announced the second edition of 'Journeying Across the Himalayas' festival scheduled for December 4-10, 2025, and a new partnership with Amazon to offer motorcycle purchases in 5 major cities including the entire 350cc range.",
            "Sentiment": "positive",
            "PublishDate": 1762007175870,
            "Source": "stock"
        },
        {
            "Title": "Eicher Motors Reports Mixed Performance for VE Commercial Vehicles in October 2025",
            "Summary": "Eicher Motors submitted sales volume data for its unlisted subsidiary VE Commercial Vehicles Limited for October 2025 to stock exchanges. The company's domestic truck and bus sales showed a 16.9% increase to 7,070 units in October compared to the previous year. For the year-to-date period, total domestic sales reached 46,200 units, up 5.9% from 43,625 units. However, heavy-duty trucks (above 18.5T) declined 4.9% to 1,004 units in October. Small commercial vehicles and light/medium-duty trucks performed well with 4,241 units sold in October, representing a 12.6% increase. Export volumes reached 948 units in October compared to 863 units in the previous year. Total VECV sales including electric vehicles were reported for both monthly and year-to-date periods.",
            "Sentiment": "neutral",
            "PublishDate": 1761986979521,
            "Source": "stock"
        },
        {
            "Title": "Eicher Motors Block Trade Worth Rs. 57.40 Crores Executed on NSE",
            "Summary": "Eicher Motors executed a block trade on the National Stock Exchange involving approximately 82,198 shares at a price of Rs. 6,983.50 per share. The total transaction value amounted to Rs. 57.40 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1761709763594,
            "Source": "order&deals"
        },
        {
            "Title": "Eicher Motors Plans EV Brand Merger Following Chief Growth Officer's Departure",
            "Summary": "Eicher Motors announced plans to merge its electric vehicle brand with its main operations. This decision follows the resignation of Mario Alvisi, who served as the EV division's Chief Growth Officer.",
            "Sentiment": "neutral",
            "PublishDate": 1760366467945,
            "Source": "stock"
        },
        {
            "Title": "Eicher Motors Unit Plans ₹544 Crore Investment for Volvo AMT Production in India",
            "Summary": "Eicher Motors' unit is planning to invest ₹544 crore for the production of Volvo's Automated Manual Transmission (AMT) systems in India. The production will serve the Asia-Oceania markets.",
            "Sentiment": "positive",
            "PublishDate": 1759977612752,
            "Source": "stock"
        },
        {
            "Title": "Eicher Motors Sees ₹76.19 Crore Block Trade on NSE",
            "Summary": "Eicher Motors executed a block trade worth ₹76.19 crores on the NSE involving approximately 109,220 shares at a price of ₹6,976 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1759903417461,
            "Source": "order&deals"
        },
        {
            "Title": "Eicher Motors September Motorcycle Sales Rise 43% YoY to 1.24 Lakh Units, Miss Estimates",
            "Summary": "Eicher Motors reported motorcycle sales of 1,24,328 units in September, representing a significant increase from 86,978 units in the same period last year. However, the sales figure fell short of market estimates of 1,35,100 units for the month.",
            "Sentiment": "neutral",
            "PublishDate": 1759312164865,
            "Source": "stock"
        },
        {
            "Title": "Eicher Motors Reports Marginal Sales Growth in September, Falls Short of Estimates",
            "Summary": "Eicher Motors sold 7,619 units in September, representing a slight increase from 7,609 units in the same month last year. The sales figure fell below market estimates of 8,010 units for the month.",
            "Sentiment": "neutral",
            "PublishDate": 1759311797287,
            "Source": "stock"
        },
        {
            "Title": "Royal Enfield Partners with Flipkart to Sell 350cc Motorcycles Online",
            "Summary": "Royal Enfield announced a partnership with Flipkart to sell its entire 350cc motorcycle portfolio online for the first time. Starting September 22, 2025, customers in Bengaluru, Gurugram, Kolkata, Lucknow, and Mumbai can purchase Royal Enfield's 350cc range including Bullet 350, Classic 350, Hunter 350, Goan Classic 350, and Meteor 350 through the e-commerce platform. The partnership offers flexible payment options and full GST benefits. While purchases will be made online, delivery and after-sales support will be handled by authorized Royal Enfield dealers in these cities. B. Govindarajan, Managing Director of Eicher Motors and CEO of Royal Enfield, stated the partnership aims to make motorcycles more accessible to digital-first customers while maintaining personalized service through dealer partners.",
            "Sentiment": "positive",
            "PublishDate": 1758269984728,
            "Source": "stock"
        },
        {
            "Title": "Eicher Motors Delivers 35,000% Returns Since 2004 Listing, Analysts Target Rs 7,800",
            "Summary": "Eicher Motors shares have generated 35,000% returns since listing on NSE in September 2004, turning a Rs 1 lakh investment into Rs 3.5 crore. The Royal Enfield maker has outperformed auto peers with 29% returns in the past three months, compared to industry returns of 18%. The stock closed at Rs 19.89 on listing date and currently trades above its 50-day and 200-day moving averages. Analysts see potential upside to Rs 7,800, representing 13% gains, with strong support at Rs 6,500 and resistance at Rs 7,200. The company announced it will pass full benefits of GST rate reduction from 28% to 18% on motorcycles up to 350cc to customers, potentially reducing prices by up to Rs 22,000. The GST implementation becomes effective from September 22, coinciding with the festive season.",
            "Sentiment": "positive",
            "PublishDate": 1758266495663,
            "Source": "stock"
        },
        {
            "Title": "Royal Enfield Launches Upgraded 2025 Meteor 350 Motorcycle Range Starting at ₹1.96 Lakh",
            "Summary": "Royal Enfield launched the refreshed 2025 Meteor 350 motorcycle lineup in India with enhanced features and new color options. The range includes four variants - Fireball, Stellar, Aurora, and Supernova - across seven new colorways, priced from ₹1,95,762 to ₹2,15,883. The motorcycles are powered by a 349cc engine producing 20.2 BHP and 27Nm torque. Standard upgrades include LED headlamps, Tripper pod, LED turn indicators, USB Type-C charging port, and assist-and-slip clutch. Test rides and bookings began September 15, 2025, with retail sales starting September 22, 2025. The Meteor 350 has over 5 lakh owners globally and is sold in more than 65 countries. Royal Enfield also offers extended warranty coverage up to 7 years with roadside assistance.",
            "Sentiment": "positive",
            "PublishDate": 1757925211561,
            "Source": "stock"
        },
        {
            "Title": "Eicher Motors Sees Block Trade Worth Rs. 68.91 Crores on NSE",
            "Summary": "Eicher Motors executed a block trade on the National Stock Exchange involving approximately 100,284 shares at Rs. 6,871.50 per share, totaling Rs. 68.91 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1757651164977,
            "Source": "order&deals"
        },
        {
            "Title": "VE Commercial Vehicles Reduces Eicher Truck and Bus Prices by Up to Rs. 6 Lakhs Following GST Cut",
            "Summary": "VE Commercial Vehicles has passed the complete GST reduction benefit to customers, resulting in price cuts of up to Rs. 6 lakhs on Eicher trucks and buses. The company transferred the full tax benefit directly to buyers rather than retaining any portion of the savings.",
            "Sentiment": "positive",
            "PublishDate": 1757511017477,
            "Source": "stock"
        },
        {
            "Title": "Royal Enfield Passes Full GST Benefits to Customers, Reduces 350cc Range Prices by Up to Rs. 22,000",
            "Summary": "Royal Enfield announced it will pass the complete GST rate reduction benefit to customers across its motorcycle business, service, apparel and accessories following recent GST Council reforms. The company's entire 350cc motorcycle range will see price reductions of up to Rs. 22,000, making these models more accessible to customers. For motorcycles above 350cc, prices will adjust according to new GST rates. The revised pricing will be effective from September 22, 2025. B Govindarajan, Managing Director of Eicher Motors and CEO of Royal Enfield, stated the move will make motorcycles more accessible to first-time buyers and open Royal Enfield to a larger community of riders. The 350cc segment represents the backbone of the mid-size motorcycle market, and this price reduction strengthens Royal Enfield's position in making motorcycle ownership more attainable.",
            "Sentiment": "positive",
            "PublishDate": 1757435690675,
            "Source": "stock"
        },
        {
            "Title": "Eicher Motors Reports 55% Jump in Motorcycle Sales for August",
            "Summary": "Eicher Motors recorded motorcycle sales of 114,000 units in August, representing a significant increase from 73,629 units in the same period last year. The sales figures exceeded estimates of 113,100 units for the month.",
            "Sentiment": "positive",
            "PublishDate": 1756713917227,
            "Source": "stock"
        },
        {
            "Title": "Eicher Motors Reports 27% Growth in Commercial Vehicle Sales for August",
            "Summary": "Eicher Motors recorded total commercial vehicle sales of 8,456 units in August, representing a significant increase from 6,652 units sold in the same month last year. This marks a growth of 1,804 units or approximately 27% year-over-year improvement in the company's commercial vehicle segment performance.",
            "Sentiment": "positive",
            "PublishDate": 1756698405627,
            "Source": "stock"
        },
        {
            "Title": "Royal Enfield's Siddhartha Lal Advocates for Uniform 18% GST on All Two-Wheelers",
            "Summary": "Siddhartha Lal, executive chairman of Eicher Motors, has appealed to the government to implement a uniform 18% GST rate for all two-wheelers. In an Instagram post, Lal argued that a common GST rate would help India maintain its competitive edge in the global two-wheeler market. He warned that punitive GST on motorcycles above 350cc would limit Indian brands to smaller capacity vehicles and undermine their ability to build strong dealer networks and brand equity internationally. The appeal comes before the GST Council meeting on September 3-4, where the Group of Ministers' proposal to restructure tax slabs will be considered. The GoM has proposed only two slabs of 5% and 18%, eliminating the current 12% and 28% slabs, with an additional 40% slab for luxury goods that may include two-wheelers above 350cc. Lal stated that differential rates would shrink the domestic above 350cc segment and reduce investment needed for India to compete globally, allowing rivals from countries without such tax distortions to capture market share.",
            "Sentiment": "negative",
            "PublishDate": 1756571038568,
            "Source": "stock"
        },
        {
            "Title": "Eicher Motors Faces Potential GST Increase on 350cc Bikes from 31% to 40%",
            "Summary": "Eicher Motors' 350cc motorcycles could face a GST rate increase to 40%, up from the current total tax burden of 31% which includes GST and cess combined. This potential tax restructuring would impact the pricing structure of the company's motorcycle segment.",
            "Sentiment": "negative",
            "PublishDate": 1756092695190,
            "Source": "stock"
        },
        {
            "Title": "Eicher Motors Reports 14.8% Revenue Growth in Q1 FY26, Royal Enfield Volumes Rise 14.7%",
            "Summary": "Eicher Motors achieved record Q1 revenue of INR 5,042 crores, up 14.8% from INR 4,393 crores in the previous year. PAT increased 9.4% to INR 1,205 crores from INR 1,101 crores. Royal Enfield sold 2,61,326 motorcycles with 14.7% growth, including 2,28,779 units in India (11.8% growth) and 32,547 international units (41.2% growth). The company maintains 87.3% market share in the middleweight motorcycle segment. International markets showed strong performance, particularly Brazil where a second CKD facility was established, and SAARC markets including Nepal and Bangladesh. The company launched the refreshed Hunter 350 with new colors and features. VECV recorded quarterly sales of 21,610 units with revenue of INR 5,671 crores and EBITDA of INR 511 crores. The company faced temporary production challenges due to rare earth material shortages affecting performance platforms but has resolved these issues with alternative materials. Management emphasized growth focus over margin percentages, with plans for aggressive marketing activations and new product launches ahead of the festive season.",
            "Sentiment": "positive",
            "PublishDate": 1754463109328,
            "Source": "earnings"
        },
        {
            "Title": "Eicher Motors Sees Rs. 28.23 Crore Block Trade on NSE",
            "Summary": "Eicher Motors executed a block trade worth Rs. 28.23 crores on the National Stock Exchange. The transaction involved approximately 50,243 shares at a price of Rs. 5,618 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1754371491606,
            "Source": "order&deals"
        },
        {
            "Title": "VE Commercial Vehicles Reports 7.4% Growth in July Sales Volume",
            "Summary": "VE Commercial Vehicles Limited, an unlisted subsidiary of Eicher Motors Limited, reported total sales volume of 7,115 units in July 2025, representing a 7.4% increase compared to 6,622 units in July 2024. The company's domestic sales grew 6.1% to 6,410 units, driven by strong performance in SCV/LMD trucks under 18.5T (8.0% growth) and HD trucks over 18.5T (12.6% growth). Export sales showed robust growth of 32.5% to 530 units. For the year-to-date period, total VECV sales reached 28,725 units, up 9.1% from 26,324 units in the previous year. Total Eicher Trucks and Buses segment recorded 6,940 units in July, marking 7.7% growth, while Volvo Trucks & Buses segment saw a slight decline of 1.7% to 175 units.",
            "Sentiment": "positive",
            "PublishDate": 1754034347056,
            "Source": "stock"
        },
        {
            "Title": "Eicher Motors July Commercial Vehicle Sales Rise 7.4% Year-on-Year to 7,115 Units",
            "Summary": "Eicher Motors reported July commercial vehicle sales of 7,115 units, representing an increase from 6,622 units sold in the same month last year. However, the sales figure fell short of the expected 7,400 units for the month.",
            "Sentiment": "neutral",
            "PublishDate": 1754033514531,
            "Source": "stock"
        },
        {
            "Title": "Eicher Motors Reports 31% Jump in July Motorcycle Sales to 88,045 Units",
            "Summary": "Eicher Motors sold 88,045 motorcycle units in July, representing a significant increase from 67,265 units in the same period last year. The sales figure came in slightly below market estimates of 90,090 units.",
            "Sentiment": "positive",
            "PublishDate": 1754030473864,
            "Source": "stock"
        },
        {
            "Title": "Eicher Motors Overcomes China's Rare Earth Magnet Ban with Alternative Materials",
            "Summary": "Eicher Motors faced production disruptions for its Royal Enfield motorcycles due to China's export ban on rare earth magnets, affecting models including Himalayan, Scram and Guerilla. The company began developing alternative materials three to four months ago and has resolved the import issues. Managing Director B. Govindarajan confirmed the shortage impacted first-quarter production of performance motorcycles. Other Indian manufacturers are also seeking alternatives, with TVS Motor looking for rare earth substitutes and Ola Electric developing rare-earth-free motors for December quarter deployment. China controls 90% of global rare earth production, and its export curbs have disrupted the global auto industry. Despite these challenges, Eicher reported quarterly profit of 12.05 billion rupees, beating analyst estimates of 11.17 billion rupees, driven by strong domestic and international demand for Royal Enfield motorcycles.",
            "Sentiment": "positive",
            "PublishDate": 1754028976872,
            "Source": "stock"
        },
        {
            "Title": "Eicher Motors to Launch First Electric Motorcycle 'Flying Flea' for Urban Markets",
            "Summary": "Eicher Motors announced it will introduce its first electric motorcycle called Flying Flea, targeting urban markets. The company is focusing on overall growth and profits rather than percentage metrics, while managing challenges from rising steel and aluminum costs that are impacting operations.",
            "Sentiment": "neutral",
            "PublishDate": 1754018640971,
            "Source": "stock"
        }
    ]
}