{
    "Symbol": "EIDPARRY",
    "ISIN": "INE126A01031",
    "News": [
        {
            "Title": "EID Parry Board Approves Promoter Group De-classification",
            "Summary": "EID Parry's board approved Algavista Greentech Private Limited's request for de-classification from promoter group category under SEBI Regulation 31A, subject to stock exchange approval.",
            "Sentiment": "neutral",
            "PublishDate": 1770913087522,
            "Source": "stocks"
        },
        {
            "Title": "EID Parry Board Meet on Feb 12 for Q3FY26 Results",
            "Summary": "EID Parry (India) Limited has scheduled a board meeting on February 12, 2026, to consider and approve Q3FY26 unaudited standalone and consolidated financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769592068411,
            "Source": "co_actions_results"
        },
        {
            "Title": "E.I.D.-Parry Allots 11,313 Equity Shares Under Employee Stock Option Plan",
            "Summary": "E.I.D.-Parry (India) Limited allotted 11,313 equity shares of face value Re. 1 each to Mr. Jayasankar R under its ESOP 2016 plan at an exercise price of Rs. 551.45 per share. The allotment increased the company's paid-up equity share capital from Rs. 17,78,61,404 to Rs. 17,78,72,717, comprising 17,78,72,717 equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763635237822,
            "Source": "corporate_action"
        },
        {
            "Title": "E.I.D.-Parry Reports Mixed Q2FY26 Results Amid Sugar Industry Challenges",
            "Summary": "E.I.D.-Parry's quarterly results showed sugar segment revenue flat at INR 368 crores while consumer products declined 30% to INR 169 crores due to lower pulse prices and sweetener quota restrictions. The company faces industry headwinds from expected 8 MMT sugar closing stocks, reduced ethanol allocations shifting to grain-based feedstock, and additional INR 50 per metric ton cane price burden in Karnataka.",
            "Sentiment": "negative",
            "PublishDate": 1763378677236,
            "Source": "earnings"
        },
        {
            "Title": "EID Parry India Reports Strong Q2 Performance with 39% Jump in Net Profit",
            "Summary": "EID Parry India delivered robust quarterly results with consolidated net profit rising to 4.24 billion rupees from 3.05 billion rupees year-over-year, marking a 39% increase. The company's EBITDA grew to 12 billion rupees compared to 9.7 billion rupees in the same period last year. However, EBITDA margin slightly declined to 10.3% from 10.4% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762847241994,
            "Source": "earnings"
        },
        {
            "Title": "EID Parry Receives Stock Exchange Approval for Promoter Declassification",
            "Summary": "EID Parry (India) Limited received approval from both BSE and NSE for the declassification of two promoter group entities - Coromandel Engineering Company Limited and Yanmar Coromandel Agrisolutions Private Limited. BSE granted approval through letter no. LIST/COMP/HG/518/2025-26 and NSE through letter no. NSE/LIST/COMP/EIDPARRY/521/2025-2026, both dated October 24, 2025. The approvals were granted under Regulation 31A of SEBI Listing Obligations and Disclosure Requirements Regulations, 2015. The company had initially applied for this reclassification on September 24, 2025, following earlier communications dating back to August 29, 2025. Both exchanges require the company to ensure compliance with subsequent relevant disclosures related to this reclassification.",
            "Sentiment": "neutral",
            "PublishDate": 1761320107225,
            "Source": "corporate_governance"
        },
        {
            "Title": "E.I.D.- Parry Applies for Declassification of Two Promoter Group Companies",
            "Summary": "E.I.D.- Parry (India) Limited has applied to BSE and NSE for declassification of Coromandel Engineering Company Limited and Yanmar Coromandel Agrisolutions Private Limited from the promoter category. Both companies currently hold zero equity shares in E.I.D.- Parry. The application seeks no-objection from the stock exchanges under Regulation 31A of the Listing Regulations as part of a corporate restructuring process.",
            "Sentiment": "neutral",
            "PublishDate": 1758728055097,
            "Source": "corporate_action"
        },
        {
            "Title": "E.I.D. Parry Dissolves Wholly Owned Subsidiary Alimtec S.A.",
            "Summary": "E.I.D. Parry (India) Limited announced the dissolution of its wholly owned subsidiary Alimtec S.A., effective September 22, 2025. The dissolution follows the Board of Directors' previous approval for the sale of assets in August 2023. Alimtec S.A. had ceased all operations since March 20, 2023, and contributed no revenue or income to the parent company during the last financial year. The company received a certificate from the competent authority confirming the dissolution.",
            "Sentiment": "neutral",
            "PublishDate": 1758645983978,
            "Source": "corporate_action"
        },
        {
            "Title": "E.I.D. Parry Sells 50% Stake in Algavista Greentech Joint Venture for Rs 8 Crores",
            "Summary": "E.I.D. Parry (India) Limited's Board approved the sale of its entire 50% stake in joint venture company Algavista Greentech Private Limited for Rs 8 crores. The buyer is Synthite Industries Private Limited, the other 50% joint venture partner, who does not belong to E.I.D. Parry's promoter group. The joint venture contributed revenue of Rs 1.46 crores (0.046% of total) and had a net worth of Rs 10.50 crores (0.4134% of total) in FY 2024-25. The transaction is expected to complete within three months, with definitive documents to be signed in due course.",
            "Sentiment": "neutral",
            "PublishDate": 1758263103353,
            "Source": "corporate_action"
        },
        {
            "Title": "Yanmar Coromandel Agrisolutions Requests De-classification from E.I.D. Parry's Promoter Group",
            "Summary": "E.I.D. Parry (India) Limited received a request from Yanmar Coromandel Agrisolutions Private Limited (YCAS) to be de-classified from the company's promoter and promoter group category. The request follows a change in Coromandel International Limited's shareholding in YCAS from 40% to 10.60%, resulting from a Rs. 149.72 crore fund infusion by Yanmar Asia (Singapore) Corporation Pte. Ltd. on September 27, 2024. Due to this shareholding reduction, YCAS no longer meets the definition of Promoter and Promoter Group under SEBI regulations. YCAS currently holds zero shares in E.I.D. Parry and has requested reclassification to the public category. The de-classification requires approval from E.I.D. Parry's Board of Directors and no-objection from the National Stock Exchange of India Limited and BSE Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1758114016714,
            "Source": "corporate_action"
        },
        {
            "Title": "EID Parry CEO Muthu Murugappan Shares Insights on Sustaining Family Business Legacy",
            "Summary": "Muthu Murugappan, CEO of EID Parry and fifth-generation member of the Murugappa group, discussed the challenges of leading a family business legacy. He emphasized the importance of putting in hard work and credited his journey from internship through working outside the family business before taking an executive role. Murugappan chose an active CEO position over a passive board member role, stating his company knowledge came from this executive involvement. He noted that legacies can be built on different paths, citing his filmmaker brother as an example. The Murugappa group, founded in the 1900s as a banking enterprise, now operates as a conglomerate in agri-solutions, financial services, and engineering sectors. Murugappan highlighted the importance of experience and self-awareness in navigating family business conversations and disagreements.",
            "Sentiment": "neutral",
            "PublishDate": 1755882292739,
            "Source": "stock"
        },
        {
            "Title": "E.I.D. Parry Reports Mixed Q1 FY26 Results with Sugar Revenue Declining 14% Despite Higher Distillery Performance",
            "Summary": "E.I.D. Parry (India) Limited reported mixed quarterly results with sugar segment revenue declining 14% to INR 347 crores from INR 404 crores due to lower release quota from the Department of Food and Public Distribution. The company crushed 2.11 lakh metric tons of cane compared to 1.93 lakh metric tons in the previous year, but recovery rates dropped to 8.02% from 8.6%. Sugar sales volume fell to 84,000 metric tons from 1.05 lakh metric tons, though average selling price improved to INR 41.99 from INR 38.60. The Consumer Product Group revenue declined 11% to INR 192 crores, mainly due to lower sweetener category quota, partially offset by 33% growth in staples segment. Distillery operations showed positive performance with sales of 413 lakh litres versus 390 lakh litres previously, at improved realization of INR 67.59 per litre. Revenue from distillery increased to INR 296 crores from INR 263 crores. The refinery subsidiary turned profitable with PBT of INR 67 lakhs against a loss of INR 6.79 crores previously. Management highlighted good monsoon conditions supporting cane crop prospects and noted the company is in a consolidation phase after completing ethanol capacity expansion.",
            "Sentiment": "neutral",
            "PublishDate": 1755078480719,
            "Source": "earnings"
        },
        {
            "Title": "E.I.D. Parry (India) Limited Announces Resignation of Head - Cane",
            "Summary": "E.I.D. Parry (India) Limited disclosed the resignation of Dr. Suresh Kumar RS from his position as Head - Cane. The resignation was tendered on July 4, 2025, citing personal pre-commitments, and became effective after close of business hours on August 8, 2025. The company's management has accepted the resignation and relieved him from his duties. The disclosure was made under SEBI listing regulations for changes in senior management personnel.",
            "Sentiment": "neutral",
            "PublishDate": 1754659823034,
            "Source": "corporate_governance"
        },
        {
            "Title": "EID Parry Reports Threefold Jump in Quarterly Profit Driven by Farm Inputs Division",
            "Summary": "EID Parry reported consolidated net profit of ₹246.3 crore, up nearly threefold from ₹91.3 crore in the same quarter last year. Revenue from operations grew 29% to ₹8,723.7 crore for the quarter ended June 30, 2025. Operating profit surged 67% to ₹806 crore with margins expanding to 9.2% from 7.2%. The farm inputs division was the primary growth driver, delivering profit before interest and tax of ₹741 crore versus ₹494 crore previously. Sugar operations posted a narrowed loss of ₹30 crore compared to ₹55 crore loss last year, while nutraceuticals reported a loss of ₹10 crore versus a marginal profit of ₹1 crore earlier. The company launched a premium range of super grains including millets, dals and rice under the branding 'Better Grains, Better Health' to enter the FMCG segment. Shares rose 1.4% to ₹1,212.10 following the results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1754470648719,
            "Source": "earnings"
        },
        {
            "Title": "E.I.D. Parry Reports Mixed Q1 Results with Consolidated Revenue Growth of 29%",
            "Summary": "E.I.D. Parry (India) Limited announced its quarterly results for the quarter ended June 30, 2025. The company's consolidated revenue from operations increased 29% to Rs. 8,724 crore compared to Rs. 6,747 crore in the corresponding quarter of the previous year. Consolidated EBITDA grew 70% to Rs. 895 crore versus Rs. 528 crore in the prior year quarter. Consolidated profit after tax and non-controlling interest was Rs. 246 crore compared to Rs. 91 crore in the previous year. However, the standalone performance showed challenges with revenue from operations at Rs. 760 crore compared to Rs. 751 crore in the previous year. Standalone EBITDA was Rs. 14 crore versus a loss of Rs. 29 crore in the prior year, while standalone loss after tax was Rs. 28 crore compared to Rs. 79 crore loss in the previous year. The Board also approved the dissolution of wholly owned subsidiary Parry International DMCC, Dubai, and appointed S. Ramakrishnan as Business Head - Nutraceuticals. The company made a further investment of Rs. 350 crore in its wholly owned subsidiary Parry Sugars Refinery India Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1754468759351,
            "Source": "corporate_action"
        },
        {
            "Title": "E.I.D.-Parry India Reports Strong Q1 Growth with Revenue Up 29% to 87 Billion Rupees",
            "Summary": "E.I.D.-Parry India delivered robust quarterly results with revenue increasing to 87 billion rupees from 67.5 billion rupees in the previous year. The company's consolidated net profit surged to 2.5 billion rupees compared to 913 million rupees year-over-year. EBITDA grew significantly to 8.1 billion rupees from 4.8 billion rupees, while EBITDA margin improved to 9.23% from 7.2% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1754468125207,
            "Source": "earnings"
        },
        {
            "Title": "EID Parry: Q4 Profit Jumps 30%, Revenue Up 23% Despite Margin Pressure",
            "Summary": "EID Parry reported a 30.3% YoY increase in Q4 consolidated net profit to ₹287 crore. Revenue rose 22.6% to ₹6,811 crore. EBITDA grew 13% to ₹530 crore, but margins narrowed. Farm inputs division led performance, while sugar division saw a sharp profit decline. Subsidiary Coromandel International declared dividends totaling ₹9 per share.",
            "Sentiment": "positive",
            "PublishDate": 1748344294000,
            "Source": "earnings"
        },
        {
            "Title": "E.I.D.-Parry Reports Q4 Results and Announces Investment in Subsidiary",
            "Summary": "E.I.D.-Parry (India) reported its Q4 financial results, showing improved performance. The company's Q4 revenue increased to 68 billion rupees from 55.6 billion rupees year-over-year. EBITDA rose to 5.3 billion rupees from 4.7 billion rupees, although the EBITDA margin decreased to 7.78% from 8.45%. Consolidated net profit for Q4 grew to 2.9 billion rupees from 2.2 billion rupees in the previous year. Additionally, the company announced plans to invest 350 crore rupees in its wholly-owned subsidiary, Parry Sugars Refinery India Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1748340066000,
            "Source": "result"
        },
        {
            "Title": "EID Parry to Consider Q4 Results on May 27",
            "Summary": "EID Parry has announced that it will consider its fourth quarter financial results on May 27. This indicates the company is preparing to release its earnings report for the last quarter of its fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1747141316000,
            "Source": "default"
        },
        {
            "Title": "E.I.D.-Parry Reports Significant Growth in Q3 EBITDA and Margin",
            "Summary": "E.I.D.-Parry (India) has announced its Q3 financial results, showing substantial year-over-year improvements. The company's EBITDA increased to 7.02 billion rupees from 4.21 billion rupees in the previous year. Additionally, the EBITDA margin expanded to 8.05% from 5.42% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739282911000,
            "Source": "earnings"
        },
        {
            "Title": "E.I.D.-Parry Reports Strong Q3 Financial Results",
            "Summary": "E.I.D.-Parry (India) has announced its financial results for the third quarter. The company's consolidated net profit increased to 1.95 billion rupees, up from 1.2 billion rupees in the same period last year. Revenue also saw growth, rising to 87.2 billion rupees from 77.7 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739282906000,
            "Source": "earnings"
        },
        {
            "Title": "EID Parry to Consider Q3 Results on February 11",
            "Summary": "EID Parry has announced that it will consider its third quarter (Q3) financial results on February 11. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738160495000,
            "Source": "earnings"
        },
        {
            "Title": "E.I.D.-Parry (India) Reports Q2 Financial Results",
            "Summary": "E.I.D.-Parry (India) has announced its Q2 financial results. The company's EBITDA for the quarter is 9.7 billion rupees, compared to 10.5 billion rupees in the same quarter last year, showing a year-over-year decrease. The EBITDA margin has also declined from 11.67% to 10.42% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731577362000,
            "Source": "result"
        },
        {
            "Title": "E.I.D.-Parry Reports Q2 Revenue Growth",
            "Summary": "E.I.D.-Parry (India) has reported a revenue of 93 billion rupees for the second quarter, compared to 90.6 billion rupees in the same quarter of the previous year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731577188000,
            "Source": "result"
        },
        {
            "Title": "E.I.D.-Parry Reports Decline in Q2 Consolidated Net Profit",
            "Summary": "E.I.D.-Parry (India) has reported a consolidated net profit of 3 billion rupees for the second quarter, down from 4.5 billion rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731577147000,
            "Source": "result"
        }
    ]
}