{
    "Symbol": "EIEL",
    "ISIN": "INE0LLY01014",
    "News": [
        {
            "Title": "Enviro Infra Engineers GST Proceedings Dropped",
            "Summary": "Punjab Tax Department drops GST proceedings against Enviro Infra Engineers, concluding matter with no demand of ₹1,32,94,078/- discrepancy and ₹76,36,264/- interest-penalty for FY 2022-23.",
            "Sentiment": "positive",
            "PublishDate": 1770643453660,
            "Source": "stocks"
        },
        {
            "Title": "Enviro Infra Engineers Q3 FY26 Results Approved",
            "Summary": "Enviro Infra Engineers Limited's Board of Directors approved unaudited financial results for Q3 FY26 and nine months ended December 31, 2025, following regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1770628753731,
            "Source": "co_actions_results"
        },
        {
            "Title": "Enviro Infra Engineers Shareholders Approve ESOP 2025",
            "Summary": "Enviro Infra Engineers Limited shareholders approved the EIEL Employees Stock Option Plan 2025 through postal ballot on January 1, 2026, covering up to 17.73 lakh stock options.",
            "Sentiment": "positive",
            "PublishDate": 1767364569227,
            "Source": "co_actions_results"
        },
        {
            "Title": "Enviro Infra Engineers GST Proceedings Dropped",
            "Summary": "Enviro Infra Engineers Limited announces closure of GST proceedings by Punjab Tax Department. The company successfully defended against ₹1.47 crore GST discrepancy allegations for FY 2021-22.",
            "Sentiment": "positive",
            "PublishDate": 1766740057612,
            "Source": "stocks"
        },
        {
            "Title": "Enviro Infra Engineers GST Proceedings Dropped",
            "Summary": "Enviro Infra Engineers Limited receives favorable order from GST Department dropping proceedings worth ₹5.07 crores. Company no longer liable for penalty and interest totaling ₹3.33 crores.",
            "Sentiment": "positive",
            "PublishDate": 1766149490190,
            "Source": "stocks"
        },
        {
            "Title": "Enviro Infra Engineers Appoints Internal Auditor",
            "Summary": "Enviro Infra Engineers Limited has appointed M/s Jain Bansal Gupta, Chartered Accountants as Internal Auditors for FY 2025-26 and 2026-27, following Board approval on December 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765541095524,
            "Source": "stocks"
        },
        {
            "Title": "Enviro Infra Engineers Seeks Shareholder Approval for Independent Director Appointment and Employee Stock Option Plan",
            "Summary": "Enviro Infra Engineers Limited has issued a postal ballot notice seeking shareholder approval for three special resolutions: appointing Dr. Mukul Jain as Non-Executive Independent Director for 5 years and implementing an Employee Stock Option Plan 2025 covering up to 17,73,031 equity shares. The e-voting period runs from December 3, 2025 to January 1, 2026, with results to be declared by January 5, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1764673668734,
            "Source": "corporate_action"
        },
        {
            "Title": "Enviro Infra Engineers Discloses Key Performance Indicators for FY2025",
            "Summary": "Enviro Infra Engineers Limited disclosed its Key Performance Indicators for the financial year ended March 31, 2025, showing revenue from operations of ₹106,605.60 lakhs with EBITDA margin of 25.12% and PAT margin of 16.62%. The company reported an order book of ₹118,550 lakhs and return on net worth of 17.83%, with the KPIs certified by independent chartered accountants MRKS and Associates.",
            "Sentiment": "positive",
            "PublishDate": 1764137094417,
            "Source": "corporate_action"
        },
        {
            "Title": "Enviro Infra Engineers Reports IPO Fund Utilization Progress for Quarter Ended September 2025",
            "Summary": "Enviro Infra Engineers Limited submitted its monitoring agency report for IPO proceeds utilization for the quarter ended September 30, 2025. The company raised Rs 650.30 crores through its IPO in November 2024, comprising a fresh issue of Rs 572.35 crores and an offer for sale of Rs 77.95 crores. During the reported quarter, the company utilized Rs 739.61 lakhs for working capital requirements, Rs 27.38 lakhs for subsidiary fund infusion, and Rs 2,500 lakhs toward investment in EIE Renewables Private Limited under general corporate purposes. The company has fully utilized Rs 120 crores for loan repayment and Rs 30 crores for subsidiary fund infusion. Unutilized proceeds of Rs 105.86 crores are invested in fixed deposits earning 13% interest. CRISIL Ratings Limited, the monitoring agency, reported no deviations from disclosed objectives and confirmed proceeds are being utilized as per the offer document.",
            "Sentiment": "neutral",
            "PublishDate": 1762829590077,
            "Source": "stock"
        },
        {
            "Title": "Enviro Infra Engineers Reports Strong Q2 Performance with 36% PAT Growth and Robust Order Book",
            "Summary": "Enviro Infra Engineers Limited reported revenue of INR 227 crores for Q2, reflecting 6.7% year-on-year growth. EBITDA increased 16.8% to INR 65 crores with margins at 28.56%. Profit after tax rose 36% to nearly INR 50 crores with PAT margin of 20.5%. For H1, revenue reached INR 468 crores (12% growth) with EBITDA of INR 129 crores (20.8% growth) and PAT of INR 92 crores (38.6% growth). The company's total execution order book stands at over INR 1,800 crores, supported by an operation and maintenance portfolio of INR 932 crores. A new order worth INR 248 crores was secured from Bhopal Municipal Corporation for EPC of 60 MLD STP and 273-kilometer sewer network. The company has submitted bids for projects worth over INR 8,000 crores and maintains guidance for fresh order book of INR 2,500 crores in FY26. Two solar assets totaling 69 megawatts are being developed, with revenue guidance of INR 200 crores from renewables for the current financial year.",
            "Sentiment": "positive",
            "PublishDate": 1762597340738,
            "Source": "earnings"
        },
        {
            "Title": "Enviro Infra Engineers Maintains EBITDA Margin Forecast at 22-24%, Sets Order Book Target of ₹2500 Crore for FY26",
            "Summary": "Enviro Infra Engineers management confirmed their EBITDA margin forecast of 22-24% and provided order book guidance of ₹2500 crore for FY26. These updates were shared during a conference call.",
            "Sentiment": "positive",
            "PublishDate": 1762401043293,
            "Source": "stock"
        },
        {
            "Title": "Enviro Infra Engineers Reports Quarterly Results Amid Cyber Fraud Recovery",
            "Summary": "Enviro Infra Engineers Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported revenue from operations of Rs 21,692.45 lakhs for the quarter, compared to Rs 23,241.06 lakhs in the previous quarter and Rs 20,882.72 lakhs in the same quarter last year. The company recorded a profit after tax of Rs 3,908.96 lakhs for the quarter. During the period, the company identified a cyber fraud incident involving fraudulent transfer of funds amounting to Rs 1,115.00 lakhs. Recovery efforts through legal proceedings resulted in Rs 264.05 lakhs being credited back to the company's account. An amount of Rs 355.95 lakhs was charged under exceptional items for the quarter related to this fraud. The company has diversified into the renewable energy sector and now operates two reportable segments: EPC and O&M Business, and Renewable Business. The Chairman and Managing Director have voluntarily relinquished their remuneration until the financial losses from the fraud are fully recovered.",
            "Sentiment": "neutral",
            "PublishDate": 1762293120241,
            "Source": "earnings"
        },
        {
            "Title": "Enviro Infra Engineers Reports 12% Revenue Growth and 21% EBITDA Rise in Half-Year Results",
            "Summary": "Enviro Infra Engineers Limited announced its unaudited consolidated financial results for the quarter and half year ended September 30, 2025. The company reported revenue from operations of ₹4,683 million for the half year, marking 12% year-over-year growth. EBITDA grew 20.8% to ₹1,292 million with margins expanding by 202 basis points to 27.6%. For the quarter ended September 30, 2025, revenue stood at ₹2,273 million with 6.7% growth, while EBITDA increased 16.8% to ₹649 million with a margin of 28.6%. The company maintains a healthy order book of ₹18,005 million in execution and ₹9,328 million in O&M portfolio. Net worth stands at ₹11,384 million with total debt of ₹2,946 million, resulting in a debt-to-equity ratio of 0.26. Chairman Sanjay Jain highlighted the company's operational efficiency and execution capabilities in delivering water and wastewater infrastructure projects under government initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1762275283176,
            "Source": "earnings"
        },
        {
            "Title": "Enviro Infra Engineers Reports Higher Q2 EBITDA and Margin Growth",
            "Summary": "Enviro Infra Engineers reported Q2 EBITDA of 649 million rupees compared to 556 million rupees in the same period last year. The company's EBITDA margin improved to 28.56% from 26.11% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762261984737,
            "Source": "earnings"
        },
        {
            "Title": "Enviro Infra Engineers Reports 37% Growth in Quarterly Net Profit",
            "Summary": "Enviro Infra Engineers reported consolidated net profit of 487 million rupees compared to 356 million rupees in the same quarter last year, representing a 37% increase. The company's revenue grew to 2.3 billion rupees from 2.13 billion rupees year-over-year, marking an 8% increase in quarterly revenue.",
            "Sentiment": "positive",
            "PublishDate": 1762261620226,
            "Source": "earnings"
        },
        {
            "Title": "Enviro Infra Secures ₹249 Crore Contract",
            "Summary": "Enviro Infra has won a contract worth ₹249 crore.",
            "Sentiment": "positive",
            "PublishDate": 1761717201434,
            "Source": "stock"
        },
        {
            "Title": "Enviro Infra Engineers Targets Four-Fold Revenue Growth in Water Business by FY30",
            "Summary": "Enviro Infra Engineers aims for at least four-fold revenue growth from its water and wastewater treatment business by FY30, with Managing Director Manish Jain projecting 35-40% CAGR growth. The company expects 2.5x to 3x current earnings growth over the next three years and targets 22-24% EBITDA margins by FY26 from its core water business. The company has expanded into renewable energy, acquiring two solar projects totaling 69 MW in Odisha and Maharashtra, with expected EBITDA margins of 18-20% and IRR of 13.5-14%. While the order book remains predominantly government-focused, the company plans to explore B2B opportunities including refineries and thermal power plants, as well as overseas markets. Shares closed 0.86% lower at Rs 242.8 on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1757386327072,
            "Source": "stock"
        },
        {
            "Title": "Enviro Infra Engineers Acquires Vento Power Infra for ₹115.6 Crore Through Subsidiary",
            "Summary": "Enviro Infra Engineers acquired Vento Power Infra Pvt. Ltd. for ₹115.6 crore through its subsidiary EIE Renewables. The acquisition includes a 40 MW solar project located in Odisha.",
            "Sentiment": "positive",
            "PublishDate": 1755774276809,
            "Source": "order&deals"
        },
        {
            "Title": "Enviro Infra Engineers Reports Strong Q1 Results with 17.4% Revenue Growth and Rs 1,178 Crores in Fresh Orders",
            "Summary": "Enviro Infra Engineers Limited, a water and waste treatment company, reported revenue of Rs 241 crores with 17.4% year-on-year growth. EBITDA reached Rs 64 crores with 25.2% growth and a margin of 26.7%. Profit after tax grew 41.8% to Rs 42 crores with a 17% margin. The company secured fresh orders worth Rs 1,178 crores and maintains a total execution order book of Rs 2,051 crores across 21 active projects. Key projects include a Rs 395 crores ZLD project in Maharashtra and solar power projects totaling 69 MW. The company reported a cyber fraud loss of Rs 11.15 crores. Management expects 35-40% CAGR growth for the next five years, targeting EBITDA margins of 22-24%. The company is expanding into advanced wastewater treatment technologies and renewable energy while shifting focus from Jal Jeevan Mission projects to AMRUT and Namami Gange initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1755615129749,
            "Source": "earnings"
        },
        {
            "Title": "Enviro Infra Engineers Invests Additional 250 Million Rupees in EIE Renewables",
            "Summary": "Enviro Infra Engineers has made an additional investment of 250 million rupees in EIE Renewables. This represents further capital allocation by the company into its renewable energy subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1755520830891,
            "Source": "stock"
        },
        {
            "Title": "Enviro Infra Engineers Reports IPO Proceeds Utilization for Quarter Ended June 30, 2025",
            "Summary": "Enviro Infra Engineers Limited submitted its monitoring agency report detailing the utilization of IPO proceeds for the quarter ended June 30, 2025. The company raised Rs 65,030.04 lakhs through its IPO in November 2024, with net proceeds of Rs 51,727.25 lakhs after expenses. During the quarter, Rs 8,767.62 lakhs were utilized across four key areas: Rs 2,500 lakhs for working capital requirements, Rs 1,472.62 lakhs for subsidiary fund infusion for Mathura sewage treatment plant construction, and Rs 4,795 lakhs for acquisition of EIE Renewables Private Limited. The debt repayment objective of Rs 12,000 lakhs was fully completed in an earlier quarter. Total utilization reached Rs 38,000.57 lakhs, leaving Rs 13,726.68 lakhs unutilized. The remaining funds are primarily invested in fixed deposits with HDFC Bank earning 6.30-6.55% returns. CRISIL Ratings Limited, the monitoring agency, reported no deviations from stated objectives and confirmed all utilizations align with the offer document disclosures.",
            "Sentiment": "neutral",
            "PublishDate": 1755077611932,
            "Source": "stock"
        },
        {
            "Title": "Enviro Infra Engineers Shares Audio Recording of Earnings Conference Call",
            "Summary": "Enviro Infra Engineers Limited provided a link to the audio recording of their earnings conference call held on August 12th, 2025. The call featured management discussing the company's financial results for the quarter ended June 30, 2025 with investors. The company shared the audio recording link with the National Stock Exchange of India Limited and BSE Limited for record purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1755004420361,
            "Source": "earnings"
        },
        {
            "Title": "Enviro Infra Engineers Reports Q1 FY26 Results with Cyber Fraud Impact",
            "Summary": "Enviro Infra Engineers Limited reported its quarterly results for the period ended June 30, 2025. The company posted standalone revenue from operations of Rs 23,241.06 lakhs and profit after tax of Rs 4,077.69 lakhs. On a consolidated basis, revenue from operations was Rs 20,920.20 lakhs with profit after tax of Rs 4,248.05 lakhs. The results were significantly impacted by a cyber fraud incident involving fraudulent transfer of Rs 1,115.00 lakhs, of which Rs 495.00 lakhs was charged as exceptional items in the current quarter. The company has recovered Rs 250.23 lakhs through court-directed bank liens and has filed complaints with cyber crime authorities. The Chairman & Whole-time Director and Managing Director have voluntarily relinquished their remuneration until the fraud losses are fully recovered. During the quarter, the company acquired one subsidiary and incorporated two step-down subsidiaries in the renewable energy sector.",
            "Sentiment": "negative",
            "PublishDate": 1754906012505,
            "Source": "earnings"
        },
        {
            "Title": "Enviro Infra Engineers Reports Strong Q1 Growth with 36% Jump in Net Profit",
            "Summary": "Enviro Infra Engineers delivered robust quarterly performance with consolidated net profit rising to 419 million rupees from 308 million rupees year-over-year. Revenue increased to 2.4 billion rupees compared to 2.05 billion rupees in the same period last year. EBITDA grew to 642 million rupees from 513 million rupees, while EBITDA margin improved to 26.7% from 25% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754905329204,
            "Source": "earnings"
        },
        {
            "Title": "Ecotech International Engineering Secures Two Water Treatment Projects Worth ₹85.22 Crore from GMDA",
            "Summary": "Ecotech International Engineering Limited has been awarded two sewage treatment projects by Gurugram Metropolitan Development Authority. The first project involves upgrading a 100 MLD Sewage Treatment Plant and constructing a 75 MLD Tertiary Treatment Plant at Dhanwapur, valued at ₹51.34 crore excluding taxes, with 24-month EPC completion timeline followed by 5-year operation and maintenance. The second project covers upgrading a 120 MLD STP and constructing a 90 MLD Tertiary Treatment Plant at Behrampur, worth ₹33.88 crore excluding taxes, with 15-month EPC timeline and 5-year O&M period. Both contracts are domestic Engineering, Procurement, and Construction projects with no related party transactions or promoter group interests involved.",
            "Sentiment": "positive",
            "PublishDate": 1754558895699,
            "Source": "order&deals"
        },
        {
            "Title": "Enviro Infra Engineers Secures ₹852.2 Million Order for Tertiary Treatment Plants",
            "Summary": "Enviro Infra Engineers has received an order worth ₹852.2 million for tertiary treatment plants. The company is targeting growth of 35-40% in FY26 and beyond.",
            "Sentiment": "positive",
            "PublishDate": 1754485735113,
            "Source": "order&deals"
        },
        {
            "Title": "Enviro Infra Engineers Files ₹6.25 Crore Arbitration Claim Against Karnataka Urban Water Supply Board",
            "Summary": "Enviro Infra Engineers Limited has initiated arbitration proceedings against Karnataka Urban Water Supply and Drainage Board at the Arbitration & Conciliation Centre in Bengaluru. The company is claiming ₹6,24,93,060 including interest for project-related disputes. The claims arise from multiple issues including KUWSDB's failure to provide requisite land, lack of project funding availability, non-approvals on price escalations, revised estimates, and withholding of various bills.",
            "Sentiment": "negative",
            "PublishDate": 1754121916262,
            "Source": "stock"
        },
        {
            "Title": "EIEL Secures Two Wastewater Treatment Projects Worth ₹221 Crores from Bangalore Water Board",
            "Summary": "Enviro Infra Engineers Limited (EIEL) received two Letter of Acceptances from Bangalore Water Supply and Sewerage Board for wastewater treatment projects. The first project in Byatarayanapura Zone is valued at ₹80.02 crores and involves design, construction, and maintenance of a wastewater treatment plant with tertiary treatment facility. The second project in Mahadevapura zone is worth ₹141.25 crores and includes wastewater treatment plants with tertiary treatment facility and solar panels, plus procurement and construction of sewage infrastructure. Both projects follow Engineering, Procurement, and Construction (EPC) model with Operation & Maintenance components. The construction period is 30 months followed by 10 years of operation and maintenance. Both projects are part of the Karnataka Water Security and Disaster Resilience Program covering 110 village areas in Phase-II.",
            "Sentiment": "positive",
            "PublishDate": 1753361154066,
            "Source": "order&deals"
        },
        {
            "Title": "Enviro Infra Engineers Reclassifies Soltrix Energy as Step-Down Subsidiary",
            "Summary": "Enviro Infra Engineers Limited has reclassified Soltrix Energy Solution Private Limited as a step-down subsidiary instead of an associate company, effective from June 23, 2025. The reclassification follows legal consultation and review of the Share Purchase and Options Agreement terms that grant EIE Renewables, Enviro Infra's wholly owned subsidiary, effective control over Soltrix's management and operations. EIE Renewables had previously acquired a 49% equity stake in Soltrix, with an agreement to acquire the remaining 51% after one year from project completion.",
            "Sentiment": "neutral",
            "PublishDate": 1753268192119,
            "Source": "corporate_action"
        },
        {
            "Title": "Enviro Infra Engineers Reclassifies Soltrix Energy as Step-Down Subsidiary Despite 49% Stake",
            "Summary": "Enviro Infra Engineers has reclassified Soltrix Energy as a step-down subsidiary following a legal review of control rights. This reclassification occurred despite Enviro Infra Engineers holding a 49% stake in Soltrix Energy. The decision was based on an assessment of control rights rather than the ownership percentage.",
            "Sentiment": "neutral",
            "PublishDate": 1753267690275,
            "Source": "corporate_governance"
        },
        {
            "Title": "Enviro Infra Engineers: Rs 2,500-Crore Order Inflow Target for FY26",
            "Summary": "Enviro Infra Engineers Ltd. aims for a Rs 2,500 crore order book in FY26, with Rs 900 crore already secured. The company recently won a Rs 395-crore project from Maharashtra Industrial Development Corp., entering the zero liquid discharge and water reuse systems market. The firm is shifting focus from Jal Jeevan Mission to AMRUT and Namami Gange schemes due to cash flow challenges in JJM projects.",
            "Sentiment": "positive",
            "PublishDate": 1752375502000,
            "Source": "order&deals"
        },
        {
            "Title": "Enviro Infra Engineers: Shares Hit Five-Month High on Rs 400-Crore Order Win",
            "Summary": "Enviro Infra Engineers Ltd.'s shares surged 11% to a five-month high after securing a Rs 400-crore order for a Zero Liquid Discharge (ZLD) project. This follows a recent Rs 395-crore order win from Maharashtra Industrial Development Corporation.",
            "Sentiment": "positive",
            "PublishDate": 1752211553000,
            "Source": "order&deals"
        },
        {
            "Title": "Enviro Infra Secures ₹400 Crore CETP EPC Contract",
            "Summary": "Enviro Infra has been awarded a ₹400 crore contract for a Common Effluent Treatment Plant (CETP) Engineering, Procurement, and Construction (EPC) project. The project is focused on Zero Liquid Discharge ventures, indicating an environmentally friendly approach to wastewater treatment.",
            "Sentiment": "positive",
            "PublishDate": 1752198087000,
            "Source": "default"
        },
        {
            "Title": "Enviro Infra Engineers: Secures Rs 395 Crore Pollution Control Project in Maharashtra",
            "Summary": "Enviro Infra Engineers, in a joint venture with AltoraPro Infrastructure, has won a Rs 395 crore contract from MIDC to upgrade common effluent treatment plants in Kolhapur district. The project, set to be completed in 24 months, includes zero liquid discharge systems for industrial estates in Ichalkaranji, Hatkanangale, and Yadrav.",
            "Sentiment": "positive",
            "PublishDate": 1752119725000,
            "Source": "order&deals"
        },
        {
            "Title": "Enviro Infra Engineers Ltd: Wins ₹395 Crore Pollution Control Project in Maharashtra",
            "Summary": "Enviro Infra Engineers Ltd, in a joint venture with AltoraPro Infrastructure, has been awarded a ₹395 crore project by MIDC to upgrade common effluent treatment plants in Kolhapur district. The project, part of the Panchganga River pollution control programme, will be executed over 24 months and includes design, construction, and maintenance of zero liquid discharge systems.",
            "Sentiment": "positive",
            "PublishDate": 1752062773000,
            "Source": "order&deals"
        },
        {
            "Title": "Enviro Infra Engineers Reports ₹11.15 Crore Cyber Fraud",
            "Summary": "Enviro Infra Engineers has reported a cyber fraud incident resulting in ₹11.15 crore being wrongly taken from the company's bank account. The company disclosed this information, indicating a significant financial loss due to unauthorized access or manipulation of their banking systems.",
            "Sentiment": "negative",
            "PublishDate": 1751465284000,
            "Source": "default"
        },
        {
            "Title": "Enviro Infra Engineers: Share Price Surges 11% on Stake Acquisition and New Projects",
            "Summary": "Enviro Infra Engineers' share price rose 11.15% following its subsidiary's 49% stake acquisition in Soltrix Energy Solution. The company received a Letter of Intent for a 40 MW solar project in Odisha worth Rs 115.6 crore and secured new projects valued at Rs 306 crore in the domestic market.",
            "Sentiment": "positive",
            "PublishDate": 1750739821000,
            "Source": "corporate_action"
        },
        {
            "Title": "Enviro Infra Engineers: Secures Rs 306 Crore Projects in Chhattisgarh",
            "Summary": "Enviro Infra Engineers has won new EPC contracts worth Rs 306.30 crore for sewage treatment infrastructure in multiple Chhattisgarh municipalities. The projects include STPs in Ambikapur, Rajnandgaon, and Korba, with 15-year O&M contracts.",
            "Sentiment": "positive",
            "PublishDate": 1750736170000,
            "Source": "order&deals"
        },
        {
            "Title": "Enviro Infra Engineers Expands into Solar Power and Wins EPC Contracts",
            "Summary": "Enviro Infra Engineers has entered the renewable energy sector by securing 69 MW solar power projects. Additionally, the company has won EPC (Engineering, Procurement, and Construction) contracts worth ₹306.30 Crore in Chhattisgarh.",
            "Sentiment": "positive",
            "PublishDate": 1750694465000,
            "Source": "default"
        },
        {
            "Title": "Enviro Infra Engineers' Subsidiary Acquires 49% Stake in Soltrix Energy",
            "Summary": "Enviro Infra Engineers has announced that its subsidiary has purchased a 49% stake in Soltrix Energy. The company plans to gain full control of Soltrix Energy after the completion of an unspecified project. No further details about the project, timeline, or financial terms of the acquisition were provided in the news article.",
            "Sentiment": "positive",
            "PublishDate": 1750691658000,
            "Source": "default"
        },
        {
            "Title": "Enviro Infra Engineers Reports Q4 Financial Results",
            "Summary": "Enviro Infra Engineers has announced its Q4 consolidated financial results. The company's net profit increased to 732 million rupees, up from 576 million rupees year-over-year and 367 million rupees quarter-over-quarter. Revenue for Q4 rose to 3.9 billion rupees, compared to 3 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1748477302000,
            "Source": "default"
        },
        {
            "Title": "Enviro Infra Engineers Reports Q4 Financial Results",
            "Summary": "Enviro Infra Engineers has released its Q4 financial results. The company's EBITDA increased to 994 million rupees from 859 million rupees year-over-year. However, the EBITDA margin decreased to 25.31% from 28.58% compared to the same period last year. The consolidated net profit rose to 732 million rupees from 576 million rupees year-over-year and 367 million rupees quarter-over-quarter. Revenue for Q4 grew to 3.9 billion rupees from 3 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748440879000,
            "Source": "result"
        },
        {
            "Title": "Enviro Infra Secures Order Worth ₹127 Crore",
            "Summary": "Enviro Infra has won an order valued at ₹127 crore. No further details about the nature of the order or the client were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1748415106000,
            "Source": "default"
        },
        {
            "Title": "Enviro Infra Engineers Approves Acquisition of EIE Renewables",
            "Summary": "Enviro Infra Engineers has approved the acquisition of EIE Renewables Pvt Ltd. This corporate action represents a significant strategic move for the company, potentially expanding its presence in the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1746511208000,
            "Source": "default"
        },
        {
            "Title": "Enviro Infra Engineers Secures New Projects Worth ₹76.96 Crore",
            "Summary": "Enviro Infra Engineers has announced the acquisition of new projects valued at ₹76.96 crore. This development represents a significant business expansion for the company, potentially boosting its project portfolio and future revenue streams.",
            "Sentiment": "positive",
            "PublishDate": 1746413610000,
            "Source": "default"
        },
        {
            "Title": "Enviro Infra Engineers Reports Significant Growth in Q3 EBITDA",
            "Summary": "Enviro Infra Engineers has announced its Q3 financial results, showing substantial year-over-year growth. The company's EBITDA increased to 539 million rupees from 277 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 21.80% from 18.46% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738835368000,
            "Source": "earnings"
        },
        {
            "Title": "Enviro Infra Engineers Reports Significant Revenue Growth in Q3",
            "Summary": "Enviro Infra Engineers has announced its third-quarter financial results, reporting a substantial increase in revenue. The company's Q3 revenue reached 3.5 billion rupees, compared to 1.5 billion rupees in the same period last year, representing a year-over-year growth of approximately 133%.",
            "Sentiment": "positive",
            "PublishDate": 1738835348000,
            "Source": "earnings"
        },
        {
            "Title": "Enviro Infra Engineers Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "Enviro Infra Engineers has announced its financial results for the third quarter, reporting a consolidated net profit of 367 million rupees. This represents a substantial increase from the 174 million rupees reported in the same period last year, indicating strong year-over-year growth for the company.",
            "Sentiment": "positive",
            "PublishDate": 1738835250000,
            "Source": "earnings"
        },
        {
            "Title": "Enviro Infra Engineers to Consider Q3 Results on February 6",
            "Summary": "Enviro Infra Engineers has announced that it will consider its third quarter (Q3) financial results on February 6. This meeting is likely to involve the company's board reviewing and potentially approving the financial statements for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737989182000,
            "Source": "earnings"
        },
        {
            "Title": "Enviro Infra Engineers: Stock Soars 143% Post-IPO, Reports Strong Q2 Results",
            "Summary": "Enviro Infra Engineers' stock is up 143% from its IPO price within 15 days of listing. The company reported a 78% YoY revenue increase to ₹213.1 crore in Q2, with EBITDA growing 148.7% to ₹55.7 crore. Net profit nearly tripled to ₹36.4 crore. The company aims for ₹10,000 crore revenue this fiscal year and targets 35-40% CAGR over the next 4-5 years.",
            "Sentiment": "positive",
            "PublishDate": 1734585724000,
            "Source": "earnings"
        }
    ]
}