{
    "Symbol": "EIHAHOTELS",
    "ISIN": "INE276C01014",
    "News": [
        {
            "Title": "EIH Associated Hotels Q3FY26 Results: Profit Surges 1.7%",
            "Summary": "EIH Associated Hotels reported strong Q3FY26 performance with profit after tax of Rs. 4,059.42 lakhs, up 1.7% YoY. Revenue from operations reached Rs. 12,946.65 lakhs despite seasonal challenges.",
            "Sentiment": "positive",
            "PublishDate": 1770650249846,
            "Source": "co_actions_results"
        },
        {
            "Title": "EIH Associated Hotels Board Meet on Feb 9, 2026",
            "Summary": "EIH Associated Hotels Limited has scheduled its Board of Directors meeting for February 09, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770032606496,
            "Source": "co_actions_results"
        },
        {
            "Title": "EIH Associated Hotels Reports Mixed Performance with Revenue Growth Amid Industry Challenges",
            "Summary": "EIH Associated Hotels submitted its quarterly results presentation showing 3% revenue growth and 1% EBITDA growth for H1 FY26, while Q2 FY26 saw revenue decline of 3% and EBITDA drop of 18% compared to previous year. The company maintains a healthy cash position of INR 247 crores and has pipeline projects including Trident Vishakhapatnam and renovations at Trident Jaipur, despite facing challenges from geo-political disruptions and adverse weather conditions affecting domestic travel.",
            "Sentiment": "neutral",
            "PublishDate": 1763561434499,
            "Source": "earnings"
        },
        {
            "Title": "EIH Associated Hotels Reports Quarterly Results for Period Ended September 30, 2025",
            "Summary": "EIH Associated Hotels Limited, a member of the Oberoi Group, announced its unaudited financial results for the quarter and six months ended September 30, 2025. The company reported a profit after tax of Rs. 1,184.74 lakhs for the quarter. Total assets stood at Rs. 64,067.63 lakhs while total equity was Rs. 52,366.45 lakhs. The company's Trident-Jaipur hotel was temporarily closed effective July 1, 2025 for renovation following board approval. During the quarter, the company realized a gain of Rs. 83.99 lakhs on disposal of property, plant and equipment at Trident Jaipur, recorded as an exceptional item. The company had previously paid a final dividend of Rs. 3.50 per share for financial year 2024-25, which was approved by members and paid in August 2025. The results were reviewed by the Audit Committee and approved by the Board of Directors on November 10, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762803200270,
            "Source": "earnings"
        },
        {
            "Title": "EIH Associated Hotels Reports Mixed Q2 Results with Higher Profit but Lower Revenue",
            "Summary": "EIH Associated Hotels reported quarterly net profit of 27.7 million rupees compared to 20.8 million rupees in the same period last year, representing a year-over-year increase. However, revenue declined to 583.2 million rupees from 708 million rupees year-over-year. EBITDA dropped significantly to 26.8 million rupees from 72.2 million rupees, while EBITDA margin compressed to 4.59% from 10.2% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762772136323,
            "Source": "earnings"
        },
        {
            "Title": "EIH Associated Hotels Reports 73% Jump in Quarterly Profit on Strong Luxury Travel Demand",
            "Summary": "EIH Associated Hotels Limited reported strong quarterly results with total income rising 6.8% to Rs. 73.7 crores. The company achieved significant profitability improvements with EBITDA growing 51.4% to Rs. 13.9 crores and profit after tax surging 73.1% to Rs. 6.2 crores. Operational metrics showed healthy performance with occupancy rates between 61-63% and average room rates increasing 9-11% to Rs. 7,600-7,800. Revenue per available room grew 11-13% during the quarter. The company operates 7 luxury properties under Oberoi and Trident brands across India with 784 total rooms. Management expressed confidence in capturing opportunities in the luxury hospitality segment, citing growing demand for high-end travel and the company's strategic positioning in premier destinations. The company maintains a strong balance sheet with net worth of Rs. 543 crores and fund position of Rs. 268 crores.",
            "Sentiment": "positive",
            "PublishDate": 1755528831704,
            "Source": "earnings"
        },
        {
            "Title": "EIH Associated Hotels Reports 72% Jump in Quarterly Profit Despite Exceptional Charges",
            "Summary": "EIH Associated Hotels Limited reported a profit after tax of Rs. 617.60 lakhs for the quarter ended June 30, 2025, compared to Rs. 357.98 lakhs in the same period last year. Revenue from operations increased to Rs. 6,874.35 lakhs from Rs. 6,448.16 lakhs year-over-year. The company recorded exceptional charges of Rs. 131.20 lakhs related to the temporary closure of Trident Jaipur hotel for renovation effective July 1, 2025. Basic earnings per share stood at Rs. 1.01 versus Rs. 0.59 in the previous year. The Board proposed a final dividend of Rs. 3.50 per share for financial year 2024-25, subject to shareholder approval. The company issued bonus shares in a 1:1 ratio in August 2024, doubling the paid-up share capital to Rs. 6,093.63 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1754299442956,
            "Source": "earnings"
        },
        {
            "Title": "EIH Associated Hotels Reports Strong Q1 Performance with 72% Jump in Net Profit",
            "Summary": "EIH Associated Hotels delivered robust quarterly results with net profit rising to 62 million rupees from 36 million rupees year-over-year, marking a 72% increase. Revenue grew to 687 million rupees compared to 645 million rupees in the same period last year. The company's EBITDA nearly doubled to 90 million rupees from 48 million rupees, while EBITDA margin expanded significantly to 13.1% from 7.42% year-over-year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754298632503,
            "Source": "earnings"
        },
        {
            "Title": "EIH Associated Hotels Reports Q4 Results and Plans New Banquet Facility",
            "Summary": "EIH Associated Hotels announced its Q4 financial results and investment plans. The company reported Q4 revenue of 1.4 billion rupees, up from 1.32 billion rupees in the same period last year. Q4 EBITDA was 505.7 million rupees, slightly higher than the previous year's 500 million rupees. However, the EBITDA margin decreased to 36.14% from 37.79% year-over-year. Additionally, the company plans to invest 290 million rupees for the development of a new banquet facility in Agra.",
            "Sentiment": "positive",
            "PublishDate": 1747400832000,
            "Source": "default"
        },
        {
            "Title": "EIH Associated Hotels Reports Q4 Net Profit Increase",
            "Summary": "EIH Associated Hotels has reported a net profit of 462.8 million rupees for the fourth quarter, compared to 368 million rupees in the same period last year (year-over-year) and 399 million rupees in the previous quarter (quarter-over-quarter).",
            "Sentiment": "positive",
            "PublishDate": 1747400618000,
            "Source": "result"
        },
        {
            "Title": "EIH Associated Hotels: Q3 Profit Up 5.4%, Stock Slides 5%",
            "Summary": "EIH Associated Hotels reported a 5.4% YoY increase in Q3 net profit to Rs 39.91 crore. Revenue rose 5% to Rs 133 crore. Despite earnings growth, the stock fell 5.1% to Rs 355.15 amid broader market selloff. EBITDA grew 3%, but margins contracted slightly to 40.5%.",
            "Sentiment": "neutral",
            "PublishDate": 1739248270000,
            "Source": "earnings"
        },
        {
            "Title": "EIH Associated Hotels Reports Stable Q3 Revenue",
            "Summary": "EIH Associated Hotels has reported a third-quarter revenue of 1.3 billion rupees, which remains unchanged compared to the same period last year (year-over-year).",
            "Sentiment": "neutral",
            "PublishDate": 1739174825000,
            "Source": "earnings"
        },
        {
            "Title": "EIH Associated Hotels Reports Q3 EBITDA Growth",
            "Summary": "EIH Associated Hotels has reported its Q3 financial results. The company's EBITDA increased to 538 million rupees from 523 million rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 40.46% from 41.27% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739174764000,
            "Source": "earnings"
        },
        {
            "Title": "EIH Associated Hotels Reports Q3 Net Profit Increase",
            "Summary": "EIH Associated Hotels has reported a net profit of 399 million rupees for the third quarter, compared to 380 million rupees in the same period last year. This represents a year-over-year increase in net profit for the company.",
            "Sentiment": "positive",
            "PublishDate": 1739174735000,
            "Source": "earnings"
        },
        {
            "Title": "EIH Associated Hotels to Consider Q3 Results",
            "Summary": "EIH Associated Hotels has announced that it will consider its third quarter financial results on February 10. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738587945000,
            "Source": "earnings"
        },
        {
            "Title": "EIH Associated Hotels Reports Significant Q2 EBITDA Growth",
            "Summary": "EIH Associated Hotels has reported a substantial increase in its Q2 EBITDA, rising from 4.7 million rupees in the previous year to 72 million rupees in the current year. The company's EBITDA margin also showed significant improvement, increasing from 0.80% to 10.18% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731315029000,
            "Source": "result"
        },
        {
            "Title": "EIH Associated Hotels Reports Q2 Revenue Increase",
            "Summary": "EIH Associated Hotels has reported a revenue of 708 million rupees for the second quarter, compared to 588 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731315015000,
            "Source": "result"
        },
        {
            "Title": "EIH Associated Hotels Reports Profit in Q2",
            "Summary": "EIH Associated Hotels has reported a net profit of 21 million rupees in the second quarter, compared to a loss of 9 million rupees in the same period last year. This represents a significant turnaround in the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1731314971000,
            "Source": "result"
        }
    ]
}