{
    "Symbol": "EIHOTEL",
    "ISIN": "INE230A01023",
    "News": [
        {
            "Title": "EIH Hotels Q3FY26 profit drops 9.7% to ₹198.51 crores",
            "Summary": "EIH Hotels reported Q3FY26 net profit of ₹198.51 crores, down 9.7% YoY, despite 12% revenue growth to ₹778.97 crores. Labour code implementation led to ₹29.09 crore exceptional charge.",
            "Sentiment": "neutral",
            "PublishDate": 1770729833201,
            "Source": "co_actions_results"
        },
        {
            "Title": "EIH Hotels faces ₹29.98 Cr penalty from Mumbai tax dept",
            "Summary": "EIH Limited receives penalty of ₹29.98 crores from Additional Commissioner of State Tax, Mumbai for FY 2016-17 related to Food & Beverage income enhancement despite earlier amnesty settlement.",
            "Sentiment": "negative",
            "PublishDate": 1770473292428,
            "Source": "stocks"
        },
        {
            "Title": "EIH Limited clarifies volume surge to BSE",
            "Summary": "EIH Limited responds to BSE inquiry about significant trading volume increase, confirming compliance with disclosure regulations and stating no undisclosed information affecting stock movement.",
            "Sentiment": "neutral",
            "PublishDate": 1770365142928,
            "Source": "stocks"
        },
        {
            "Title": "EIH Limited Q3FY26 earnings call set for Feb 12",
            "Summary": "EIH Limited announces earnings conference call on February 12, 2026 at 11:00 AM to discuss Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770212490999,
            "Source": "co_actions_results"
        },
        {
            "Title": "EIH Limited Faces Rs 90.69 Cr GST Penalty from Mumbai AC",
            "Summary": "EIH Limited disclosed penalty of Rs 90,69,113 levied by Assistant Commissioner Mumbai on Trident Nariman Point and The Oberoi Mumbai hotels for ITC claims on input services for FY 2018-19 to FY 2022-23.",
            "Sentiment": "negative",
            "PublishDate": 1766755740744,
            "Source": "stocks"
        },
        {
            "Title": "EIH Hotels Faces ₹57.98 Lakh GST Penalty",
            "Summary": "EIH Limited's Maidens Hotel penalized ₹57.98 lakh by Delhi GST authorities for non-payment under Reverse Charge Mechanism on foreign travel agent commissions during FY2019-2023.",
            "Sentiment": "negative",
            "PublishDate": 1766039273133,
            "Source": "stocks"
        },
        {
            "Title": "EIH Limited Announces Luxury Resort at Makaibari Tea Estate",
            "Summary": "EIH Limited signs management agreement for The Oberoi, Makaibari Tea Estate, Darjeeling - a 25-key luxury resort scheduled to open in 2030 at the historic 1,236-acre tea estate established in 1859.",
            "Sentiment": "positive",
            "PublishDate": 1765789838239,
            "Source": "co_actions_results"
        },
        {
            "Title": "EIH Limited Gets Commercial Paper Rating Withdrawn by CARE After Full Repayment",
            "Summary": "CARE Ratings has withdrawn the credit rating assigned to EIH Limited's Commercial Paper program as the company has no outstanding amount against the instrument. The Oberoi Group's flagship hospitality company, which operates 29 hotels with 4,144 rooms, requested the rating withdrawal after complete repayment of its commercial paper obligations.",
            "Sentiment": "positive",
            "PublishDate": 1764345881842,
            "Source": "corporate_action"
        },
        {
            "Title": "EIH Limited Reports Mixed Q2FY26 Results Amid Geopolitical Disruptions and Weather Challenges",
            "Summary": "EIH Limited reported 2% revenue growth but 9% EBITDA decline in Q2FY26, impacted by Operation Sindoor, Middle East conflicts, Air India crash sentiment, and excessive rainfall affecting domestic travel. The luxury hotel operator maintains strong cash reserves of Rs 1,050 crores and plans aggressive expansion with 27 properties by 2030, while Q3 outlook remains positive driven by wedding season and foreign travel recovery.",
            "Sentiment": "neutral",
            "PublishDate": 1763636422211,
            "Source": "earnings"
        },
        {
            "Title": "EIH Limited Reports Mixed Q2 FY26 Results with 9% Revenue Growth Despite Weather and Geopolitical Challenges",
            "Summary": "EIH Limited achieved 9% revenue growth in Q2 FY26 but saw EBITDA decline by 3% due to adverse weather conditions, extended monsoons, and geopolitical disruptions affecting international travel. The company maintains a healthy cash position of INR 1,057 crores and has outlined expansion plans with 27 new properties scheduled to open by 2030 across domestic and international markets.",
            "Sentiment": "neutral",
            "PublishDate": 1763097864411,
            "Source": "earnings"
        },
        {
            "Title": "EIH Reports Mixed Q2 Results with Revenue Growth but Lower Profitability",
            "Summary": "EIH reported Q2 revenue of 5.97 billion rupees compared to 5.9 billion rupees in the same period last year, showing growth. However, the company's EBITDA declined to 1.54 billion rupees from 1.74 billion rupees year-over-year, with EBITDA margin dropping to 25.75% from 29.54%. Consolidated net profit also decreased to 1.13 billion rupees from 1.3 billion rupees compared to the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762866621644,
            "Source": "earnings"
        },
        {
            "Title": "EIH Limited Schedules Q2 FY26 Results Conference Call for November 14",
            "Summary": "EIH Limited, a member of the Oberoi Group, has announced an earnings conference call scheduled for November 14, 2025, at 11:00 AM IST. The call will discuss the company's unaudited financial results for the quarter and six months ended September 30, 2025. The webinar will be represented by MD & CEO Mr. Vikram Oberoi and CFO Mr. Vineet Kapur. The company has informed stock exchanges NSE and BSE about this investor meeting as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1762332072637,
            "Source": "earnings"
        },
        {
            "Title": "EIH Limited Reports Strong EBITDA Performance Despite Geopolitical Headwinds in Q1 FY26",
            "Summary": "EIH Limited held an investor call discussing its quarterly results ended June 30, 2025. The company achieved its highest revenue and EBITDA for Q1 in recent years despite challenges from Operation Sindoor and Middle East geopolitical tensions. RevPAR grew 16% year-over-year to INR 11,350, driven by 18% ARR growth while occupancy remained flat at 70%. The company recorded a one-time exceptional charge of INR 110 crores related to the Mashobra court judgment, resulting in PAT declining 62%. Consolidated revenue grew 9% while expenditure increased only 6%, improving EBITDA margin to 32% from 30%. The company maintains an expansion pipeline of 25 new properties with 2,033 keys, primarily in India, to be operational by 2030. International hotels showed strong performance with 22% RevPAR growth, benefiting from recovery in Egypt and Marrakesh. Management remains optimistic about India's hospitality sector growth and continues focusing on driving average room rates in the premium segment.",
            "Sentiment": "positive",
            "PublishDate": 1755085872128,
            "Source": "earnings"
        },
        {
            "Title": "EIH Limited Reports Strong Q1FY26 Performance with 16% Revenue Growth and Expansion Plans",
            "Summary": "EIH Limited reported quarterly results with consolidated revenue growing 9% to ₹573.6 crores and standalone revenue increasing 14% to ₹518.8 crores. The company's EBITDA rose 16% to ₹195.3 crores on consolidated basis and 28% to ₹193.5 crores on standalone basis. However, profit after tax declined significantly due to exceptional items of ₹110.5 crores, resulting in consolidated PAT of ₹36.9 crores compared to ₹96.7 crores in the previous year. The hospitality company maintained strong operational performance with RevPAR (Revenue Per Available Room) showing 11-13% growth and average room rates increasing 9-11% year-over-year. EIH's luxury 'The Oberoi' hotels segment demonstrated particularly strong performance with 21% RevPAR growth. The company outlined ambitious expansion plans with 25 new properties scheduled to be operational by 2030, comprising 2,033 keys across domestic and international markets. EIH maintains a healthy liquidity position and continues to outperform industry benchmarks across key operational metrics.",
            "Sentiment": "positive",
            "PublishDate": 1754588197024,
            "Source": "earnings"
        },
        {
            "Title": "EIH Limited Announces Four New Hotel Projects Under Management Contracts Across India",
            "Summary": "EIH Limited announced the addition of four new hotel projects in India to be operated under management contracts during its 75th Annual General Meeting. The new properties include The Oberoi Gir (20-key luxury wildlife retreat), The Oberoi Hyderabad (220-key hotel at Knowledge City), Trident Nandi Hills (150-key hotel near Bengaluru), and Trident Fort Aguada (170-key hotel in Goa). These projects are part of EIH Limited's development pipeline of 25 properties scheduled for completion by 2030, including 22 hotels and three luxury boats spanning India and international markets. The pipeline will add 2,033 keys across 16 Indian hotels and nine international properties. In 2025, the company will launch The Oberoi Rajgarh Palace Khajuraho and two Oberoi Nile Dahabeyas. Oberoi Hotels & Resorts was recently named Best Hotel Group in the World at Telegraph Travel Awards UK 2025 and ranked second globally in Travel + Leisure USA's World's Best Awards.",
            "Sentiment": "positive",
            "PublishDate": 1754468837801,
            "Source": "earnings"
        },
        {
            "Title": "EIH Announces Four New Hotels Under Management Contracts Across India",
            "Summary": "EIH has announced the addition of four new hotels under management contracts across India. The expansion represents the company's growth in hotel management operations within the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1754468080827,
            "Source": "stock"
        },
        {
            "Title": "EIH Limited Elevates Rupesh Tomar to Head of Procurement Functions",
            "Summary": "EIH Limited elevated Rupesh Tomar to the position of Head of Procurement Functions (Vice President - Procurement) effective August 5, 2025. The elevation was approved by the Board of Directors based on the recommendation of the Nomination and Remuneration Committee. Following this elevation, Tomar will be classified as part of the Senior Management under SEBI Listing Regulations. Tomar is a Commerce Graduate with over 21 years of experience in sourcing and procurement across various industries including consumer goods, pharmaceutical, manufacturing, personal care and food industry. He has expertise in change management, risk management skills in procurement, and experience in Source-to-Settle processes.",
            "Sentiment": "positive",
            "PublishDate": 1754400355379,
            "Source": "corporate_governance"
        },
        {
            "Title": "EIH Limited Reports Rs 36.36 Crore Quarterly Profit Despite Rs 110.32 Crore Exceptional Loss",
            "Summary": "EIH Limited posted a standalone profit of Rs 36.36 crore for the quarter ended June 30, 2025, compared to Rs 85.35 crore in the same period last year. Revenue from operations increased to Rs 518.77 crore from Rs 455.94 crore year-on-year. The company faced exceptional items worth Rs 110.32 crore primarily due to adjustments related to Mashobra Resort Limited (MRL) following a High Court order dated June 2, 2025. These adjustments included writing down the investment in MRL to Rs 13.00 crore, reducing advances recoverable from MRL by 50% to Rs 68.09 crore, and reversing user fee obligations of Rs 85.99 crore. On a consolidated basis, the company reported a profit of Rs 36.88 crore with revenue from operations at Rs 573.58 crore. The board has proposed a final dividend of Rs 1.50 per share for FY 2024-25, subject to shareholder approval. Basic earnings per share stood at Rs 0.58 for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1754398426058,
            "Source": "earnings"
        },
        {
            "Title": "EIH Reports Mixed Q1 Results with Revenue Growth but Lower Net Profit",
            "Summary": "EIH reported quarterly results showing revenue growth to 5.74 billion rupees from 5.26 billion rupees year-over-year. EBITDA increased to 1.6 billion rupees from 1.35 billion rupees, with EBITDA margin improving to 27.86% from 25.61%. However, consolidated net profit declined significantly to 334 million rupees compared to 922 million rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1754397411551,
            "Source": "earnings"
        },
        {
            "Title": "EIH Limited Schedules Earnings Conference Call for Q1FY26 Results on August 8, 2025",
            "Summary": "EIH Limited has scheduled an earnings conference call on August 8, 2025, at 11:00 AM to discuss its unaudited financial results for the quarter ended June 30, 2025. The webinar will be represented by MD & CEO Vikram Oberoi and CFO Vineet Kapur. The company has notified stock exchanges NSE and BSE about this investor meeting schedule, with registration available through Microsoft Teams. The schedule is subject to change.",
            "Sentiment": "neutral",
            "PublishDate": 1753714146438,
            "Source": "earnings"
        },
        {
            "Title": "EIH Ltd: Q4 Profit Rises 6%, Declares Dividend",
            "Summary": "EIH Ltd reported a 5.7% YoY increase in Q4 net profit to ₹261.6 crore. Revenue surged 11.6% to ₹827.5 crore. EBITDA grew 15.4% to ₹350.9 crore with a margin of 42.4%. The board recommended a final dividend of ₹1.5 per share for FY 2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1747770279000,
            "Source": "earnings"
        },
        {
            "Title": "EIH Recommends Final Dividend of 1.5 Rupees Per Share",
            "Summary": "EIH has recommended a final dividend of 1.5 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1747759944000,
            "Source": "result"
        },
        {
            "Title": "EIH Reports Q4 Financial Results",
            "Summary": "EIH has announced its Q4 financial results. The company's EBITDA increased to 3.78 billion rupees from 3.17 billion rupees year-over-year. EBITDA margin improved to 45.63% from 42.72%. Revenue rose to 8.27 billion rupees from 7.4 billion rupees. The company reported an exceptional item loss of 221.2 million rupees compared to a profit of 166.3 million rupees in the previous year. Profit before tax (PBT) increased to 3.77 billion rupees from 3.22 billion rupees. Consolidated net profit for Q4 was 2.53 billion rupees, up from 2.2 billion rupees year-over-year and 2.64 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747759936000,
            "Source": "result"
        },
        {
            "Title": "Himachal Pradesh Government Takes Over Wildflower Hall Property in Shimla",
            "Summary": "EIH Limited has announced that the Himachal Pradesh state government has taken control of the Wildflower Hall property in Shimla. Additionally, the company's shareholding in Mashobra Resort will be transferred to the state of Himachal Pradesh.",
            "Sentiment": "negative",
            "PublishDate": 1743593178000,
            "Source": "corporate_action"
        },
        {
            "Title": "EIH Group Expands with Two New Resorts in Rishikesh",
            "Summary": "The EIH Group, in partnership with the Ladhani Group, has announced plans to open two new resorts in Rishikesh. This expansion marks a significant development for the company's presence in the hospitality sector, particularly in the popular tourist destination of Rishikesh.",
            "Sentiment": "positive",
            "PublishDate": 1740984510000,
            "Source": "corporate_action"
        },
        {
            "Title": "EIH Reports Increased Q3 Profit and Revenue",
            "Summary": "EIH Limited has announced its financial results for the third quarter. The company's consolidated net profit rose to 2.6 billion rupees, up from 2.2 billion rupees year-over-year and 1.3 billion rupees quarter-over-quarter. Revenue for Q3 increased to 8 billion rupees from 7.4 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739279550000,
            "Source": "earnings"
        },
        {
            "Title": "EIH to Consider Q3 Results on February 11",
            "Summary": "EIH Limited has announced that it will consider its third quarter (Q3) financial results on February 11. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738591258000,
            "Source": "earnings"
        },
        {
            "Title": "EIH Ltd: NCLAT Upholds NCLT Order on Golden Jubilee Hotels Sale",
            "Summary": "NCLAT dismissed EIH Ltd's appeal against NCLT's approval of Golden Jubilee Hotels' sale to Singapore-based BREP Asia II. EIH, holding 16% stake, was deemed ineligible under IBC Section 29A as a promoter. NCLAT reinforced the Committee of Creditors' commercial wisdom in the decision.",
            "Sentiment": "negative",
            "PublishDate": 1734256840000,
            "Source": "order&deals"
        },
        {
            "Title": "EIH Ltd: New CFO Appointed as Q2 Profits Surge",
            "Summary": "EIH Ltd. appointed Vineet Kumar as CFO, replacing Kallol Kundu. Q2 FY2024 standalone PAT increased 34% YoY to Rs 114 crore, with revenue up 14% to Rs 558 crore. EBITDA rose 27% YoY to Rs 189 crore.",
            "Sentiment": "positive",
            "PublishDate": 1734009029000,
            "Source": "corporate_governance"
        },
        {
            "Title": "EIH Ltd: Record Q2 Results and Ambitious Expansion Plans",
            "Summary": "EIH Ltd reported strong Q2FY25 results with standalone revenue up 14% YoY to ₹558 crore, EBITDA up 27% YoY to ₹189 crore, and PAT up 34% YoY to ₹114 crore. The company announced plans to expand with 20 new properties by 2029, including 17 hotels and 3 luxury boats across India and international locations.",
            "Sentiment": "positive",
            "PublishDate": 1731477901000,
            "Source": "result"
        },
        {
            "Title": "EIH to Invest in EIH London Investments Limited",
            "Summary": "The board of EIH has decided to invest up to 100% stake in EIH London Investments Limited, with a maximum investment of GBP 69 million.",
            "Sentiment": "positive",
            "PublishDate": 1729086858000,
            "Source": "corporate_action"
        }
    ]
}