{
    "Symbol": "EIMCOELECO",
    "ISIN": "INE158B01016",
    "News": [
        {
            "Title": "Eimco Elecon CIN Changed to L28249GJ1974PLC002574",
            "Summary": "Eimco Elecon (India) Limited announces change in Corporate Identification Number from L29199GJ1974PLC002574 to L28249GJ1974PLC002574 following MCA approval of special resolution for MOA alteration.",
            "Sentiment": "neutral",
            "PublishDate": 1769604606314,
            "Source": "stocks"
        },
        {
            "Title": "Eimco Elecon publishes Q3 FY26 financial results",
            "Summary": "Eimco Elecon (India) Limited has published its unaudited financial results for the quarter and nine months ended December 31, 2025, in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1767960312861,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eimco Elecon surges 16% on strong Q3FY26 results",
            "Summary": "Mining equipment manufacturer Eimco Elecon's stock jumped 16% after reporting 133% QoQ profit growth and 90% revenue increase in Q3FY26. Board also approved ₹47 crore land acquisition in Gujarat.",
            "Sentiment": "positive",
            "PublishDate": 1767934755930,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eimco Elecon Q3 Net Profit Surges 102.22% to ₹125.15 Cr",
            "Summary": "Eimco Elecon reports exceptional Q3 performance with revenue rising 37.66% to ₹630.57 crores, net profit jumping 102.22% to ₹125.15 crores, and announces land acquisition worth ₹473.3 crores.",
            "Sentiment": "positive",
            "PublishDate": 1767860055964,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eimco Elecon Seeks Shareholder Approval for MOA Changes and Promoter Reclassification",
            "Summary": "Eimco Elecon (India) Limited has issued a postal ballot notice seeking shareholder approval for adopting a new Memorandum of Association under Companies Act 2013 and expanding business objects to include construction machinery, defence platforms, and pharmaceuticals. The company also seeks approval to reclassify Tamrock Great Britain Holdings Limited from promoter group to public category after it sold its entire 24.68% stake through offer for sale in September 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764068791043,
            "Source": "corporate_action"
        },
        {
            "Title": "Eimco Elecon Receives Exchange Approval for Promoter Group Reclassification",
            "Summary": "Eimco Elecon (India) Limited received no-objection letters from BSE and NSE on November 14, 2025, for reclassifying Tamrock Great Britain Holdings Ltd from promoter group category to public category under SEBI regulations. The reclassification remains subject to shareholder approval and other required regulatory consents as per SEBI listing obligations.",
            "Sentiment": "neutral",
            "PublishDate": 1763174755915,
            "Source": "corporate_action"
        },
        {
            "Title": "Eimco Elecon Applies for Reclassification of Tamrock Great Britain Holdings from Promoter to Public Category",
            "Summary": "Eimco Elecon (India) Limited has submitted an application to BSE and NSE seeking reclassification of Tamrock Great Britain Holdings Limited from Promoter/Promoter Group category to Public category. The entity currently holds 0.00% shareholding (0 equity shares) in the company. The application was made on October 13, 2025, in compliance with SEBI (LODR) Regulations 2015, specifically Regulation 31A(8)(c). The company is seeking no objection from both recognized stock exchanges for this reclassification.",
            "Sentiment": "neutral",
            "PublishDate": 1760362412407,
            "Source": "corporate_action"
        },
        {
            "Title": "Vijay Kedia Questions AI Claims by Indian Companies, Invests in Data Centre Sector",
            "Summary": "Investor Vijay Kedia stated that no Indian company is genuinely utilizing AI, noting that businesses incorporate AI into presentations regardless of practical application. He emphasized that companies actually using AI in operations will benefit, while highlighting the data centre sector as having bright prospects in India. Kedia's firm acquired nearly 1% stake in Eimco Elecon Ltd. through Kedia Securities Ltd., purchasing 57,441 shares at Rs 1,906 per share for approximately Rs 10 crore. Eimco Elecon shares gained over 5% following the acquisition announcement. The stock has remained flat year-to-date but declined more than 28% over the past 12 months.",
            "Sentiment": "neutral",
            "PublishDate": 1760107993114,
            "Source": "stock"
        },
        {
            "Title": "EIMCO ELECON Reports 50% Decline in Q2 Revenue and Profits",
            "Summary": "EIMCO ELECON reported Q2 revenue of 332 million rupees, down from 666 million rupees year-over-year. The company's net profit fell to 53.5 million rupees from 131 million rupees in the same period last year. EBITDA decreased to 52 million rupees compared to 151 million rupees year-over-year, with EBITDA margin declining to 15.71% from 23.00%.",
            "Sentiment": "negative",
            "PublishDate": 1759999089925,
            "Source": "earnings"
        },
        {
            "Title": "Vijay Kedia Acquires Rs 11 Crore Stake in Eimco Elecon via Bulk Deal",
            "Summary": "Marquee investor Vijay Kedia purchased a Rs 11 crore stake in Gujarat-based Eimco Elecon (India) through his investment company Kedia Securities Private Ltd. The bulk deal involved acquiring over 57,400 shares at Rs 1,906.71 per share, representing a 4.4% premium to the previous day's closing price. The stock surged 5% following the transaction, closing at Rs 1,917.50. Eimco Elecon manufactures equipment for underground and opencast mines and has been operational since 1974. The investment appears to be a dip-buying strategy, as the stock has declined 34% over the past year and is down 77% from its 52-week high of Rs 3,394.75. Despite recent declines, the stock has delivered 426% returns over three years, significantly outperforming benchmark indices. The company reported net profit of Rs 14.48 crore and revenue of Rs 67.56 crore in the June quarter, with revenue increasing 5% sequentially but declining 3% year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1759851857486,
            "Source": "order&deals"
        },
        {
            "Title": "Eimco Elecon Receives Reclassification Request from Promoter Group Member Tamrock Great Britain Holdings",
            "Summary": "Eimco Elecon (India) Limited received a request from Tamrock Great Britain Holdings Limited to be reclassified from 'Promoter Group' to 'Public' category. Tamrock sold 14,23,875 equity shares representing 24.68% of the company's total issued and paid-up equity share capital on September 24 and 25, 2025, through an Offer for Sale mechanism. Following the sale, Tamrock no longer holds any equity shares in the company. The company's Board of Directors will consider this reclassification request in their meeting scheduled for October 9, 2025. Tamrock confirmed it does not hold more than 10% voting rights, does not exercise control over company affairs, has no special rights, is not represented on the board, and does not act as a key managerial person.",
            "Sentiment": "neutral",
            "PublishDate": 1759330997416,
            "Source": "corporate_action"
        },
        {
            "Title": "Tamrock Great Britain Holdings Sells Entire 24.68% Stake in Eimco Elecon Through Stock Exchange Offer",
            "Summary": "Tamrock Great Britain Holdings Limited, a promoter group entity of Eimco Elecon (India) Limited, sold 14,23,875 equity shares representing 24.68% of the company's total issued and paid-up equity share capital through an offer for sale mechanism on September 24 and 25, 2025. The sale was conducted through a designated window on BSE and NSE, with September 24 reserved for non-retail investors and September 25 for retail investors and non-retail investors carrying forward unallotted bids. Following the transaction, Tamrock Great Britain Holdings' shareholding in Eimco Elecon reduced to nil from its previous 24.68% stake. The shares have a face value of ₹10 each, and Eimco Elecon's total equity share capital remains at 57,68,385 shares worth ₹5,76,83,850.",
            "Sentiment": "neutral",
            "PublishDate": 1758886901590,
            "Source": "corporate_action"
        },
        {
            "Title": "Tamrock Great Britain Holdings Increases Eimco Elecon Share Offer to 24.68% of Total Equity",
            "Summary": "Tamrock Great Britain Holdings has exercised its oversubscription option in Eimco Elecon, increasing the offer for sale to 14,23,875 shares, which represents 24.68% of the company's total equity.",
            "Sentiment": "neutral",
            "PublishDate": 1758723555571,
            "Source": "corporate_action"
        },
        {
            "Title": "Eimco Elecon Shares Drop 15% as Promoter Announces Stake Sale",
            "Summary": "Eimco Elecon (India) Ltd. shares fell 15% in Wednesday's trading following an announcement by promoter group entity Tamrock Great Britain Holdings of a stake sale through Offer for Sale (OFS). Tamrock, holding a 24.68% stake in the company, is offering 7.23 lakh shares (12.55% of its holding) as the base offer, with an additional 7 lakh shares (12.14%) available through oversubscription. If fully exercised, Tamrock would completely exit its investment. The OFS opened for non-retail investors on September 24 and opens for retail investors on September 25. The floor price is set at ₹1,400 per share, representing a 31% discount to the previous day's closing price.",
            "Sentiment": "negative",
            "PublishDate": 1758707797703,
            "Source": "stock"
        },
        {
            "Title": "Eimco Elecon Submits Q1FY26 Investor Presentation Showing Revenue Decline and Reduced Order Book",
            "Summary": "Eimco Elecon (India) Limited submitted an investor presentation for Q1FY26 results. The company reported revenue of INR 68 crores, down 3.1% from INR 70 crores in Q1FY25. EBITDA decreased 18.3% to INR 12 crores with margins falling to 18.2% from 21.6%. PAT declined 2.0% to INR 14 crores. The open order book dropped significantly by 68.8% to INR 39 crores from INR 125 crores. The company manufactures underground mining equipment and construction machinery, operating from Gujarat with 51 years of experience. It has a network of sales and service centers across India and serves clients in coal mining and construction sectors.",
            "Sentiment": "negative",
            "PublishDate": 1757943933624,
            "Source": "stock"
        },
        {
            "Title": "Eimco Elecon Seeks Shareholder Approval for Kamlesh Nalin Shah's Appointment as Executive Director",
            "Summary": "Eimco Elecon (India) Limited has issued a postal ballot notice seeking shareholder approval for two resolutions regarding Mr. Kamlesh Nalin Shah (DIN: 08629181). The first resolution proposes his appointment as a Director, while the second seeks his appointment as Whole-time Director designated as Executive Director for a three-year term from September 10, 2025 to September 9, 2028. The proposed remuneration package includes a basic salary of Rs. 4.80 lakh per month, allowances of Rs. 8.55 lakh per month, and variable incentives up to Rs. 25 lakh per annum. Shah brings 27 years of experience in strategic financial operations, taxation, treasury management, and mergers & acquisitions. The remote e-voting period runs from August 7, 2025 at 9:00 AM to September 5, 2025 at 5:00 PM. The company has engaged MUFG Intime India Private Limited to facilitate the e-voting process, with J.J. Gandhi appointed as scrutinizer.",
            "Sentiment": "neutral",
            "PublishDate": 1754398205710,
            "Source": "corporate_action"
        },
        {
            "Title": "Elecon Engineering Reports Strong Demand in Indian and International Markets",
            "Summary": "The Managing Director of Elecon Engineering has reported strong demand for the company's products in both Indian and international markets. No specific details or figures were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752219032000,
            "Source": "default"
        },
        {
            "Title": "EIMCO ELECON Reports Q1 EBITDA Decline",
            "Summary": "EIMCO ELECON has reported its Q1 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 123 million rupees, compared to 151 million rupees in the same quarter of the previous year, representing a year-over-year decrease. The EBITDA margin for Q1 was 18.22%, down from 21.60% in the corresponding quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1752128801000,
            "Source": "result"
        },
        {
            "Title": "EIMCO ELECON Reports Q1 Financial Results",
            "Summary": "EIMCO ELECON has released its financial results for the first quarter. The company reported revenue of 676 million rupees, compared to 697 million rupees in the same period last year, indicating a slight year-over-year decrease. Net profit for the quarter stood at 145 million rupees, marginally lower than the 148 million rupees reported in the corresponding quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1752128705000,
            "Source": "result"
        },
        {
            "Title": "EIMCO ELECON Reports Q4 Financial Results",
            "Summary": "EIMCO ELECON has released its Q4 financial results. Revenue decreased to 643 million rupees from 843 million rupees year-over-year. However, EBITDA increased to 181 million rupees from 167 million rupees, with EBITDA margin improving to 28.23% from 19.82%. Net profit remained relatively stable at 149 million rupees compared to 148 million rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1745397839000,
            "Source": "result"
        },
        {
            "Title": "Eimco Elecon (India): Q3 Profit Drops 18.01% Amid Revenue Decline",
            "Summary": "Eimco Elecon (India) reported Q3 FY25 results with profit falling 18.01% YoY to ₹6.19 crore. Revenue decreased 4.99% YoY to ₹45.84 crore. QoQ, revenue declined 31.2% and profit fell 52.6%. EPS decreased to ₹10.73, down 17.97% YoY. Operating income declined 57.18% QoQ and 5.97% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1737523044000,
            "Source": "earnings"
        },
        {
            "Title": "EIMCO ELECO Reports Stable Q3 EBITDA with Improved Margin",
            "Summary": "EIMCO ELECO has announced its Q3 financial results. The company's EBITDA remained steady at 79 million rupees, matching the figure from the same period last year. However, the EBITDA margin showed improvement, increasing to 17.12% from 16.37% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1737447253000,
            "Source": "earnings"
        },
        {
            "Title": "EIMCO ELECON Reports Q3 Revenue Decline",
            "Summary": "EIMCO ELECON has reported a revenue of 458 million rupees for the third quarter, compared to 482 million rupees in the same period last year, indicating a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1737447231000,
            "Source": "earnings"
        },
        {
            "Title": "EIMCO ELECON Reports Q2 Financial Results",
            "Summary": "EIMCO ELECON has reported its Q2 financial results. The company's EBITDA increased to 151 million rupees from 128 million rupees year-over-year. However, the EBITDA margin decreased to 23% from 25% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1729153260000,
            "Source": "result"
        },
        {
            "Title": "EIMCO ELECON Reports Q2 Revenue Growth",
            "Summary": "EIMCO ELECON has reported a revenue of 666 million rupees for the second quarter, compared to 511 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729153216000,
            "Source": "result"
        },
        {
            "Title": "EIMCO ELECON Reports Q2 Net Profit Increase",
            "Summary": "EIMCO ELECON has reported a net profit of 130 million rupees for the second quarter, compared to 118 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729153159000,
            "Source": "result"
        }
    ]
}