{
    "Symbol": "EKC",
    "ISIN": "INE184H01027",
    "News": [
        {
            "Title": "Everest Kanto Cylinder Approves ₹30 Cr Capex Budget",
            "Summary": "Everest Kanto Cylinder's board approved ₹30 crore additional capex for Ratadiya Unit and Q3FY26 results. US subsidiary CP Industries received USD 5.50 million capex approval for expansion.",
            "Sentiment": "positive",
            "PublishDate": 1770896244765,
            "Source": "co_actions_results"
        },
        {
            "Title": "Everest Kanto Board Meet Set for Feb 12 Q3 Results",
            "Summary": "Everest Kanto Cylinder Limited schedules board meeting on February 12, 2026 to consider Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769681066157,
            "Source": "co_actions_results"
        },
        {
            "Title": "Everest Kanto Cylinder GM Operations Resigns",
            "Summary": "Everest Kanto Cylinder Limited announces resignation of Mr. Sanjay Patnaik, General Manager - Plant and Operations at Tarapur facility, effective January 12, 2026 due to personal reasons.",
            "Sentiment": "neutral",
            "PublishDate": 1768995001741,
            "Source": "stocks"
        },
        {
            "Title": "Everest Kanto Cylinder Starts Commercial Production",
            "Summary": "Everest Kanto Cylinder Limited has commenced commercial production and dispatches of cylinders at its new manufacturing line in Ratadiya Unit, Mundra, Gujarat on December 31, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1767177656240,
            "Source": "stocks"
        },
        {
            "Title": "Everest Kanto Cylinder Faces ₹1.02 Cr GST Demand",
            "Summary": "Everest Kanto Cylinder received GST order for ₹1.02 crore total demand including penalty and interest for ITC mismatch in FY 2021-22. Company plans rectification application.",
            "Sentiment": "negative",
            "PublishDate": 1767177478558,
            "Source": "stocks"
        },
        {
            "Title": "Everest Kanto Cylinder Reports Q2FY26 Results with ₹360.4 Cr Revenue, Eyes Egypt Plant Launch",
            "Summary": "Everest Kanto Cylinder delivered consolidated revenue of ₹360.4 crores with 11.9% EBITDA margin in Q2FY26, though CNG segment faced temporary softness due to GST transition impacts. The company expects Egypt plant to begin trial production by January 2026 and Mundra facility by March, with management providing revenue guidance of ₹900-1,000 crores for standalone business and 12-14% EBITDA margin.",
            "Sentiment": "neutral",
            "PublishDate": 1763723810623,
            "Source": "earnings"
        },
        {
            "Title": "Everest Kanto Cylinder Reports Q2FY26 Results with Revenue at Rs 360.4 Crore",
            "Summary": "Everest Kanto Cylinder Limited reported consolidated revenue of Rs 360.4 crore for Q2FY26 with EBITDA at Rs 42.9 crore (11.9% margin) and PAT at Rs 13.7 crore, showing decline from previous year's quarter. The company faced temporary demand impact in CNG segment due to GST transition in automotive industry, while progressing with new facilities at Mundra and Egypt for capacity expansion.",
            "Sentiment": "negative",
            "PublishDate": 1763206583301,
            "Source": "earnings"
        },
        {
            "Title": "Everest Kanto Cylinder Reports Mixed Q2 Results with Exceptional Loss from SEZ Penalty",
            "Summary": "Everest Kanto Cylinder Limited reported quarterly results for the period ended September 30, 2025, with an exceptional loss of ₹1,129 lakhs due to penalty imposed by Kandla Special Economic Zone for non-fulfillment of Net Foreign Exchange obligations for 2020-25. The company also approved closure of its Dubai branch office due to non-operation and filed unaudited standalone and consolidated financial results with statutory auditors providing unmodified opinion.",
            "Sentiment": "negative",
            "PublishDate": 1763126383134,
            "Source": "earnings"
        },
        {
            "Title": "Everest Kanto Cylinder Limited Schedules Q2FY26 Earnings Conference Call",
            "Summary": "Everest Kanto Cylinder Limited will host an earnings conference call on Tuesday, November 18, 2025, at 4:00 PM IST to discuss quarterly results and developments for the quarter ended September 30, 2025. The company's senior management will address investors and analysts during the call. Everest Kanto Cylinder Limited is India's largest manufacturer of high-pressure seamless gas cylinders and operates as a clean energy solutions company. The company operates manufacturing facilities in India at Tarapur (Maharashtra) and Kandla SEZ (Gujarat), plus international facilities in Dubai and Pittsburgh, USA, with aggregate capacity of about 1.5 million cylinders annually.",
            "Sentiment": "neutral",
            "PublishDate": 1762829129324,
            "Source": "earnings"
        },
        {
            "Title": "Everest Kanto Cylinder Faces ₹11.29 Crore Penalty for Net Foreign Exchange Shortfall",
            "Summary": "Everest Kanto Cylinder Limited received an order from the Office of the Development Commissioner, Kandla Special Economic Zone, imposing a penalty of ₹11.29 crores for non-achievement of cumulative positive Net Foreign Exchange (NFE) for the block period 2020-21 to 2024-25. The penalty, equivalent to 1% of the shortfall in FOB value, was levied under SEZ Rules 2006 for failing to meet NFE obligations by ₹1,129.03 crores. The company has been directed to deposit the penalty amount within the specified timeline. However, the proposed cancellation of Letter of Approval under Section 16 of SEZ Act 2005 has been dropped, with the company receiving a warning against future contraventions.",
            "Sentiment": "negative",
            "PublishDate": 1761856778459,
            "Source": "stock"
        },
        {
            "Title": "Everest Kanto Cylinder Reports Strong Q1 Results with 12.9% Revenue Growth and 47.8% EBITDA Jump",
            "Summary": "Everest Kanto Cylinder Limited reported consolidated revenue of Rs. 386.9 crore, up 12.9% year-on-year, with consolidated EBITDA rising 47.8% to Rs. 61.3 crore and an EBITDA margin of 15.8%. PAT increased 84.9% to Rs. 51.6 crore, including an exceptional gain of Rs. 12.6 crore. India operations generated revenue of Rs. 237 crore (up 21.1%) with EBIT of Rs. 34 crore (up 143%), while US operations posted revenue of Rs. 109 crore (up 21%) with EBIT of Rs. 27 crore (up 83%). The company maintains a US order book of USD 70 million and India order book of around Rs. 60 crore. Management expects 10-15% revenue growth for the year with conservative EBITDA margins of 13-14%. The company is expanding capacity with new facilities in Mundra (200,000 cylinders, Rs. 125 crore investment) and Egypt (120,000 cylinders, Rs. 120 crore investment), both expected to commission by the last quarter. However, the company faces a Rs. 352 crore GST contingent liability and headwinds in UAE operations.",
            "Sentiment": "positive",
            "PublishDate": 1756129578764,
            "Source": "earnings"
        },
        {
            "Title": "Everest Kanto Cylinder Makes Q1 FY26 Earnings Call Audio Recording Available",
            "Summary": "Everest Kanto Cylinder Limited has made available the audio recording of their Q1 FY26 Earnings Group Conference Call held on August 19, 2025. The call discussed the company's unaudited financial results for the quarter ended June 30, 2025. The audio recording is accessible on the company's website in compliance with SEBI regulations. The filing was signed by Vishal Totla, Company Secretary and Compliance Officer. The company trades on NSE under symbol EKC and on BSE with scrip code 532684.",
            "Sentiment": "neutral",
            "PublishDate": 1755615106471,
            "Source": "earnings"
        },
        {
            "Title": "Everest Kanto Cylinder Reports Strong Q1 FY2026 Results with Consolidated Profit Rising 85% YoY",
            "Summary": "Everest Kanto Cylinder Limited announced its quarterly results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of ₹23,698 lakhs compared to ₹19,601 lakhs in the same quarter last year, representing a 21% increase. Profit after tax grew to ₹2,609 lakhs from ₹1,171 lakhs year-over-year, marking a 123% increase. Earnings per share improved to ₹2.33 from ₹1.04. On a consolidated basis, revenue from operations reached ₹38,688 lakhs versus ₹34,280 lakhs in the previous year quarter, up 13%. Consolidated profit after tax increased significantly to ₹5,158 lakhs from ₹2,790 lakhs, representing an 85% growth. Consolidated earnings per share rose to ₹4.60 from ₹2.50. The consolidated results included an exceptional gain of ₹1,263 lakhs from an employee retention credit tax refund received by subsidiary CP Industries Holdings Inc. from the US Treasury. The company operates across geographical segments including India, UAE, USA and Hungary, and others, primarily manufacturing high-pressure seamless gas cylinders and related equipment.",
            "Sentiment": "positive",
            "PublishDate": 1755092713299,
            "Source": "earnings"
        },
        {
            "Title": "Everest Kanto Cylinder Faces Rs 66.29 Lakh Customs Duty Demand Over Import Classification Dispute",
            "Summary": "Everest Kanto Cylinder Limited received an order from the Principal Commissioner of Customs (Import), Air Cargo Complex, Mumbai regarding classification of imported raw materials. The customs authority rejected the company's declared classification under CTI 73072200 and ordered re-assessment under CTI 73072900, which attracts a higher Basic Customs Duty of 25%. This resulted in a differential duty demand of Rs 66,29,172 along with applicable interest under Sections 28(4) and 28AA of the Customs Act, 1962. Additionally, a penalty of Rs 66,29,172 has been imposed under Section 114A. The company plans to file an appeal against the order with the Customs, Excise, Service Tax Tribunal (CESTAT). The company stated there is no material impact on its financials, operations or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1753175053807,
            "Source": "stock"
        },
        {
            "Title": "Everest Kanto Sells Majority Stake in European Subsidiary",
            "Summary": "Everest Kanto has sold 80% of its shares in EKC Europe ZRT. The company cited geopolitical issues as the reason for this divestment.",
            "Sentiment": "neutral",
            "PublishDate": 1752650071000,
            "Source": "default"
        },
        {
            "Title": "Everest Kanto Cylinder Reports Q4 EBITDA and Margin Results",
            "Summary": "Everest Kanto Cylinder has reported its Q4 EBITDA as 379 million rupees, compared to 308 million rupees in the same quarter last year. The company's Q4 EBITDA margin was 8.98%, down from 9.45% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748010004000,
            "Source": "result"
        },
        {
            "Title": "Everest Kanto Cylinder Reports Q4 Financial Results",
            "Summary": "Everest Kanto Cylinder has reported its Q4 consolidated net profit at 133 million rupees, compared to 145 million rupees year-over-year and 181 million rupees quarter-over-quarter. The company's Q4 revenue increased to 4.2 billion rupees from 3.26 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1748009958000,
            "Source": "result"
        },
        {
            "Title": "Everest Kanto Cylinder Reports Q3 Financial Results",
            "Summary": "Everest Kanto Cylinder has announced its Q3 consolidated financial results. The company reported a net profit of 181 million rupees, down from 367 million rupees in the same quarter last year. However, revenue increased to 3.67 billion rupees from 3.3 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739405814000,
            "Source": "earnings"
        },
        {
            "Title": "Everest Kanto Cylinder Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Everest Kanto Cylinder has reported a decrease in its third quarter EBITDA, which fell to 400 million rupees from 515 million rupees in the same period last year. The company's EBITDA margin also declined, dropping to 10.90% from 15.64% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739369106000,
            "Source": "earnings"
        },
        {
            "Title": "Everest Kanto Cylinder Reports Q3 Financial Results",
            "Summary": "Everest Kanto Cylinder has announced its Q3 financial results. The company reported a consolidated net profit of 181 million rupees, down from 367 million rupees in the same quarter last year. However, revenue increased to 3.67 billion rupees from 3.3 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739369098000,
            "Source": "earnings"
        },
        {
            "Title": "Everest Kanto Cylinder's Manufacturing Expansion on Track",
            "Summary": "The Managing Director of Everest Kanto Cylinder has stated that the company's advanced manufacturing facilities in Egypt and Mundra are progressing as planned. This development is expected to position the company to capitalize on growth opportunities and maintain its long-term momentum in the market.",
            "Sentiment": "positive",
            "PublishDate": 1731758852000,
            "Source": "corporate_action"
        },
        {
            "Title": "Everest Kanto Cylinder Reports Improved Q2 EBITDA and Margin",
            "Summary": "Everest Kanto Cylinder has reported its Q2 financial results. The company's EBITDA increased to 531 million rupees, up from 413 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 14.46% from 13.8% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731596871000,
            "Source": "result"
        },
        {
            "Title": "Everest Kanto Cylinder Reports Q2 Profit and Revenue Growth",
            "Summary": "Everest Kanto Cylinder has announced its Q2 financial results. The company's consolidated net profit increased to 385 million rupees, up from 263 million rupees year-over-year and 281 million rupees quarter-over-quarter. Revenue for Q2 rose to 3.67 billion rupees, compared to 3 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731596823000,
            "Source": "result"
        }
    ]
}