{
    "Symbol": "ELDEHSG",
    "ISIN": "INE668G01021",
    "News": [
        {
            "Title": "Eldeco Housing Secures Rs 110 Cr Term Loan from Piramal",
            "Summary": "Eldeco Housing & Industries executed a Rs 110 crore term loan facility agreement with Piramal Finance Limited on February 11, 2026, for land acquisition and project expenses.",
            "Sentiment": "positive",
            "PublishDate": 1770820535970,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eldeco Housing Reports Strong H1 Performance with 91% Booking Growth, Plans Major Township Launch",
            "Summary": "Eldeco Housing Industries delivered robust H1 FY26 results with bookings of Rs. 309 crores (up 91% year-on-year), collections of Rs. 91.3 crores (up 76%), and 191 home deliveries totaling 2.03 lakh square feet. The company is preparing to launch its flagship Rs. 1,000 crore Eldeco Solano Gardens township project on 50 acres in Lucknow, pending final environmental clearance and RERA registration, which management expects will drive significant growth in the second half.",
            "Sentiment": "positive",
            "PublishDate": 1763552052402,
            "Source": "earnings"
        },
        {
            "Title": "Eldeco Housing Reports 76% Growth in Collections to ₹91.3 Crores in Q2FY26",
            "Summary": "Eldeco Housing and Industries Limited reported quarterly results with collections rising 76% year-on-year to ₹91.3 crores in Q2FY26. The company delivered 90 homes totaling 1.19 lakh sq.ft., marking a 95% increase in delivered area. Construction spend increased 11% to ₹37.3 crores. However, booking value declined 14.4% to ₹88.1 crores compared to ₹102.9 crores in Q2FY25, attributed to absence of major launches this quarter. Total income was ₹35.3 crores with EBITDA at ₹5.5 crores and PAT at ₹2.6 crores. For H1FY26, bookings reached ₹309.2 crores, up 91% year-on-year. The company is preparing to launch Eldeco Solano Gardens township on 54 acres with a GDV of ₹1,000 crores. Chairman Pankaj Bajaj highlighted continued momentum with strong collections and execution progress, expressing confidence for growth in H2FY26.",
            "Sentiment": "positive",
            "PublishDate": 1762987162200,
            "Source": "earnings"
        },
        {
            "Title": "Eldeco Housing Expands in Tier-2 and Tier-3 Cities with Affordable Housing Focus",
            "Summary": "Eldeco Housing & Industries is pursuing steady real estate expansion in tier-2 and tier-3 cities. The company has a pipeline of affordable and mid-income housing projects aimed at boosting sales visibility. Eldeco maintains a strong balance sheet with low leverage, which positions it to support land acquisitions and launch new township projects.",
            "Sentiment": "positive",
            "PublishDate": 1762960572523,
            "Source": "stock"
        },
        {
            "Title": "Eldeco Housing & Industries Reports Decline in Q2 Profitability and Margins",
            "Summary": "Eldeco Housing & Industries reported quarterly results showing a decline in key financial metrics. EBITDA dropped to 33 million rupees from 49 million rupees year-over-year, while EBITDA margin contracted to 9.98% from 14.77%. Consolidated net profit fell to 26 million rupees compared to 45 million rupees in the same period last year. Revenue remained relatively stable at 330 million rupees versus 334 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762953484525,
            "Source": "earnings"
        },
        {
            "Title": "Eldeco Housing and Industries Reports Quarterly Financial Results for September 2025",
            "Summary": "Eldeco Housing and Industries Limited's Board of Directors approved unaudited financial results for the quarter and half year ended September 30, 2025, on both standalone and consolidated basis. The results were reviewed by the Audit Committee and audited by M/s Doogar Associates, Chartered Accountants. The Board meeting was held on November 12, 2025, commencing at 3:00 p.m. and concluding at 5:45 p.m. The company operates primarily in Real Estate activities, which management considers as the only reportable segment. The financial results have been prepared in accordance with Indian Accounting Standards (IndAS) and are available on the company's website and stock exchange platforms. The consolidated results include 34 subsidiary companies.",
            "Sentiment": "neutral",
            "PublishDate": 1762953092570,
            "Source": "earnings"
        },
        {
            "Title": "Eldeco Housing Reports 274% YoY Jump in Bookings to ₹221 Crore Despite Margin Pressure",
            "Summary": "Eldeco Housing and Industries Limited reported strong operational performance with booking value reaching ₹221 crore, up 274% year-on-year, and collections of ₹78 crore, up 41% YoY. The company delivered 85,000 sq ft across 101 homes and incurred construction expenditure of ₹39.3 crore, up 10% YoY. However, EBITDA margin declined to 17.6% due to revenue recognition from low-margin affordable housing units and upfront marketing costs for new launches. The company successfully launched two projects - Eldeco Hanging Gardens sold 84% of inventory within a week of its April 15 launch, while Eldeco Skywalk launched in the second week of April with strong sales momentum. Management expects EBITDA margins to revert to the 30-40% range going forward and anticipates accelerated growth from FY27 as recent bookings translate to completions. The company plans to launch its flagship Eldeco Solano Garden township with gross development value over ₹1,000 crore, expecting the first phase to generate ₹300-400 crore GDV. Construction spend is projected to increase from ₹30 crore in Q1 to ₹50-60 crore per quarter by year-end.",
            "Sentiment": "positive",
            "PublishDate": 1755502502488,
            "Source": "earnings"
        },
        {
            "Title": "Eldeco Housing Makes Earnings Call Recording Available on Company Website",
            "Summary": "Eldeco Housing and Industries Limited has made the audio recording of their earnings conference call available on their company website. The call discussed the unaudited financial results for the quarter ended June 30, 2025. The earnings conference call was held on Wednesday, August 13, 2025 at 12:30 p.m. IST. The audio recording can be accessed on the company's website in the investor relations section under earnings call transcripts and recordings for 2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1755084124523,
            "Source": "earnings"
        },
        {
            "Title": "Eldeco Targets ₹7,743 Crore Pipeline to Capitalize on Housing Demand Through FY28",
            "Summary": "Eldeco has outlined plans to leverage high housing demand through its ₹7,743 crore saleable area pipeline. The company's strategy focuses on quick execution and quality project mix, with emphasis on Tier-2 and Tier-3 markets. Eldeco aims to utilize cash-flow efficiency and brand strength to boost revenue and maintain margins through FY26-28.",
            "Sentiment": "positive",
            "PublishDate": 1755016944235,
            "Source": "stock"
        },
        {
            "Title": "Eldeco Housing Reports 274% Jump in Booking Value to ₹221.1 Crore in Q1FY26",
            "Summary": "Eldeco Housing and Industries Limited reported strong operational performance in Q1FY26 with booking value surging 274% year-on-year to ₹221.1 crore compared to ₹59.1 crore in Q1FY25. Collections grew 41% to ₹78.0 crore while area booked increased 261% to 3.36 lakh square feet. The company delivered 84,636 square feet comprising 101 homes and spent ₹39.3 crore on construction, up 10.2% year-on-year. Financially, consolidated total income was ₹30.9 crore with profit after tax at ₹3.1 crore compared to ₹8.0 crore in the previous year. The company secured RERA registration and launched Eldeco Hanging Gardens in April 2025 with 84% inventory sold within a week, and also launched Eldeco Skywalk. Eldeco plans to launch its flagship integrated township Eldeco Solano Gardens on New Jail Road, Lucknow during FY26, spread over 50 acres with a Gross Development Value of over ₹1,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1755008755969,
            "Source": "earnings"
        },
        {
            "Title": "Eldeco Housing Reports Q1 FY2026 Results with Net Profit of Rs 362.23 Lacs",
            "Summary": "Eldeco Housing and Industries Limited announced its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 2,859.61 lacs compared to Rs 2,532.18 lacs in the same quarter last year. Net profit increased to Rs 362.23 lacs from Rs 787.49 lacs in the previous year quarter. On a consolidated basis, revenue from operations was Rs 2,868.12 lacs versus Rs 2,918.40 lacs in the corresponding quarter. Consolidated net profit stood at Rs 313.38 lacs compared to Rs 799.34 lacs in the same period last year. The company's earnings per share on standalone basis was Rs 3.68 for the quarter. The results were approved by the Board of Directors and reviewed by statutory auditors Doogar & Associates. The company operates primarily in the real estate segment and has 40 wholly owned subsidiaries.",
            "Sentiment": "neutral",
            "PublishDate": 1755005629500,
            "Source": "earnings"
        },
        {
            "Title": "Eldeco Housing Creates New Subsidiary for Real Estate Expansion",
            "Summary": "Eldeco Housing has established a new subsidiary named 'Golfshire Realtors Private Limited' with the aim of expanding its real estate business.",
            "Sentiment": "positive",
            "PublishDate": 1752764545000,
            "Source": "default"
        },
        {
            "Title": "Eldeco Housing & Industries Reports Q4 Results and Dividend Recommendation",
            "Summary": "Eldeco Housing & Industries has reported its Q4 financial results. The company's EBITDA decreased to 57 million rupees from 149 million rupees year-over-year, with EBITDA margin falling to 15.60% from 30.3%. Consolidated net profit for Q4 was 32 million rupees, down from 117 million rupees year-over-year but up from 58 million rupees quarter-on-quarter. Q4 revenue stood at 367 million rupees, compared to 492 million rupees in the same quarter last year. The company has recommended a dividend of 9 rupees per equity share.",
            "Sentiment": "negative",
            "PublishDate": 1747917326000,
            "Source": "result"
        },
        {
            "Title": "Eldeco Housing & Industries Reports Q3 Financial Results",
            "Summary": "Eldeco Housing & Industries has released its Q3 financial results. The company reported a consolidated net profit of 58 million rupees, which is lower compared to 81 million rupees in the same quarter last year (YoY) and 45 million rupees in the previous quarter (QoQ). The Q3 revenue stood at 347 million rupees, showing a significant increase from 216 million rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739363397000,
            "Source": "earnings"
        }
    ]
}