{
    "Symbol": "ELECTCAST",
    "ISIN": "INE086A01029",
    "News": [
        {
            "Title": "Electrosteel Castings Q3 FY26 Conference Call Audio",
            "Summary": "Electrosteel Castings Limited shares audio recording of February 06, 2026 conference call discussing Q3 & 9M FY26 earnings results under regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1770381841247,
            "Source": "co_actions_results"
        },
        {
            "Title": "Electrosteel Castings Board Meet Set for Feb 6, 2026",
            "Summary": "Electrosteel Castings Limited has scheduled its board meeting for February 6, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769773563339,
            "Source": "co_actions_results"
        },
        {
            "Title": "SC Upholds NCLAT Decision Favoring Electrosteel Castings",
            "Summary": "Supreme Court confirms NCLAT ruling dismissing UV Asset's IBC petition against Electrosteel Castings, reaffirming company cannot be treated as guarantor for ESL facilities.",
            "Sentiment": "positive",
            "PublishDate": 1767676868689,
            "Source": "stocks"
        },
        {
            "Title": "Electrosteel Castings Limited Completes Commercial Paper Redemption",
            "Summary": "Electrosteel Castings Limited fully redeemed and repaid its Commercial Paper worth Rs. 50 crores to holders on November 27, 2025, as scheduled. The redemption was completed through BSE Limited and affects the company's debt obligations and investor payments.",
            "Sentiment": "neutral",
            "PublishDate": 1764244129619,
            "Source": "corporate_action"
        },
        {
            "Title": "Electrosteel Castings Receives Final Compensation Order Worth Rs. 253.04 Crores from Ministry of Coal",
            "Summary": "Electrosteel Castings Limited received a Final Compensation Order dated November 19, 2025, from the Ministry of Coal's Nominated Authority, awarding Rs. 253.04 crores for GR cost and hard cost components of Shafts and Inclines related to Parbatpur Coal Mine. The compensation will have a material impact on the company's financials, though determination of land and soft cost components totaling Rs. 287.60 crores remains pending, along with Rs. 34.56 crores for updated GR preparation to be settled between JSW and ECL.",
            "Sentiment": "positive",
            "PublishDate": 1763705569709,
            "Source": "stock"
        },
        {
            "Title": "Electrosteel Castings Shareholders Approve Appointment of Bikramjit Ghosh as Independent Director",
            "Summary": "Electrosteel Castings Limited shareholders passed a special resolution through postal ballot on November 16, 2025, approving the appointment of Mr. Bikramjit Ghosh as an Independent Director with 99.49% votes in favor. The e-voting process saw participation from 334,940,224 valid votes out of 618,184,591 total shares, with promoters voting 100% in favor and public shareholders showing 96.72% support.",
            "Sentiment": "positive",
            "PublishDate": 1763381695230,
            "Source": "corporate_governance"
        },
        {
            "Title": "Electrosteel Castings Reports 28% Volume Decline in Q2 FY26 Amid JJM Funding Delays",
            "Summary": "Electrosteel Castings' DI pipe sales volume dropped 28% year-on-year to 1.39 lakh tons in Q2 FY26 due to government spending delays in the Jal Jeevan Mission, impacting profitability despite strong balance sheet position. The company expects demand recovery from calendar year 2026 and projects volumes of 8-8.5 lakh tons next year, supported by JJM extension to 2028 and recent valve business acquisition in Europe.",
            "Sentiment": "negative",
            "PublishDate": 1763123603080,
            "Source": "earnings"
        },
        {
            "Title": "Electrosteel Castings Reports Q2 Results, Acquires Arabian Water Tech and Incorporates Vietnam Subsidiary",
            "Summary": "Electrosteel Castings Limited announced its quarterly results for the quarter and half year ended September 30, 2025. The company approved the acquisition of 14,000 shares representing 70% shareholding in Arabian Water Tech LLC (AWT) based in Oman for approximately INR 50 lakh. AWT serves as an authorized agent for selling ductile iron pipes in the Oman market with a turnover of OMR 46,963.60 for 2024-25. The Board also noted that subsidiary Singardo International Pte Ltd incorporated a wholly-owned subsidiary named Electrosteel Vietnam Limited, making it a step-down subsidiary. Additionally, the Corporate Social Responsibility Committee was renamed to Corporate Social Responsibility and Sustainability Committee. The company's consolidated results show total income of Rs 307,663.13 lakh for the half year ended September 30, 2025, with profit after tax of Rs 16,736.53 lakh for the same period.",
            "Sentiment": "neutral",
            "PublishDate": 1762769527003,
            "Source": "earnings"
        },
        {
            "Title": "Electrosteel Castings Expects Execution Improvement From FY27",
            "Summary": "Electrosteel Castings anticipates improved execution starting from FY27, attributing this outlook to stabilized government funding and continued commitment to rural water supply and sustainability initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1762768130999,
            "Source": "stock"
        },
        {
            "Title": "Electrosteel Castings Reports Sharp Decline in Q2 Financial Performance",
            "Summary": "Electrosteel Castings reported significantly lower financial results for Q2. The company's EBITDA dropped to 928 million rupees from 2.67 billion rupees year-over-year, while EBITDA margin contracted to 6.7% from 14.64%. Revenue declined to 14 billion rupees compared to 18.3 billion rupees in the same period last year. Consolidated net profit fell to 783 million rupees from 1.55 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762767724245,
            "Source": "earnings"
        },
        {
            "Title": "Electrosteel Castings Limited Schedules Conference Call to Discuss Q2 H1 FY26 Earnings",
            "Summary": "Electrosteel Castings Limited has announced a conference call scheduled for November 10, 2025, at 4:00 PM IST to discuss the company's Q2 H1 FY26 earnings. The call will be attended by key management representatives including Whole-time Director Madhav Kejriwal, Whole-time Director and CEO Sunil Katial, and Whole-time Director CFO Ashutosh Agarwal, along with other senior management. The conference call is being hosted by EY and dial-in details have been provided for participants from various countries including India, UK, USA, Singapore, and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1762259960039,
            "Source": "earnings"
        },
        {
            "Title": "Electrosteel Castings Pursues Growth Through Italian Valve Acquisition and Water Infrastructure Opportunities",
            "Summary": "Electrosteel Castings is targeting long-term growth through the acquisition of an Italian valve manufacturer and development of energy-harvesting technology. The company operates with a 10.11 LTPA DI pipe capacity and is positioned to capitalize on government water infrastructure investments exceeding ₹3 lakh crores.",
            "Sentiment": "positive",
            "PublishDate": 1754477395529,
            "Source": "stock"
        },
        {
            "Title": "Electrosteel Castings Reports Sharp Decline in Q1 Profitability",
            "Summary": "Electrosteel Castings reported consolidated net profit of 890 million rupees in Q1, down significantly from 2.26 billion rupees in the same quarter last year. The company's EBITDA fell to 1.7 billion rupees from 3.53 billion rupees year-over-year. EBITDA margin compressed to 10.93% compared to 17.57% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754474325970,
            "Source": "earnings"
        },
        {
            "Title": "Electrosteel Castings Schedules Q1 FY26 Earnings Conference Call for August 6",
            "Summary": "Electrosteel Castings Limited has scheduled a conference call on August 6, 2025, at 4:00 PM IST to discuss their Q1 FY26 earnings results. The call will be hosted by E&Y and will feature key management representatives including Madhav Kejriwal (Whole-time Director), Sunil Katial (Whole-time Director and CEO), and Ashutosh Agarwal (Whole-time Director & CFO), along with other senior management. Dial-in details have been provided for domestic and international participants, with universal dial-in numbers and international toll-free options available for UK, USA, Singapore, and Hong Kong. The company has disclosed this information on stock exchanges and their website.",
            "Sentiment": "neutral",
            "PublishDate": 1753878599342,
            "Source": "earnings"
        },
        {
            "Title": "Electrosteel Castings Completes €11.50 Million Acquisition of Italian Company T.I.S Services",
            "Summary": "Electrosteel Castings Limited has completed the acquisition of T.I.S Services S.p.A, an Italy-based company, by purchasing 30,00,000 equity shares representing 100% shareholding for Euro 11.50 million. The company has received the share certificates and T.I.S Services S.p.A has become a wholly owned subsidiary of Electrosteel Castings Limited. The acquisition follows board approval and execution of a Share Purchase Agreement with T.I.S Group S.p.A in May 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753875028283,
            "Source": "order&deals"
        },
        {
            "Title": "Electrosteel Castings Receives Provisional Compensation Order from Ministry of Coal",
            "Summary": "Electrosteel Castings has received a provisional compensation order from the Ministry of Coal. The estimated compensation amount is 4.99 billion rupees. No further details about the nature of the compensation or the reasons behind it were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747613569000,
            "Source": "default"
        },
        {
            "Title": "Electrosteel Castings Receives Provisional Compensation Order",
            "Summary": "Electrosteel Castings has received a provisional compensation order from the Ministry of Coal. The compensation is estimated at 4.99 billion rupees. No further details about the nature of the compensation or the reason for it were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747402509000,
            "Source": "default"
        },
        {
            "Title": "Electrosteel Casting Declares Dividend, Reports Q4 EBITDA Decline",
            "Summary": "Electrosteel Casting has declared a dividend of 1.4 rupees per share. The company's Q4 EBITDA decreased to 1.6 billion rupees from 3 billion rupees year-over-year. The Q4 EBITDA margin also declined to 9.38% from 15.53% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1746873071000,
            "Source": "result"
        },
        {
            "Title": "Electrosteel Casting Reports Q4 Financial Results",
            "Summary": "Electrosteel Casting announced its Q4 consolidated net profit of 1.7 billion rupees, down from 2.3 billion rupees year-over-year and up from 1.6 billion rupees quarter-over-quarter. The company's Q4 revenue stood at 17 billion rupees, a decrease from 20 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1746872776000,
            "Source": "result"
        },
        {
            "Title": "Electrosteel Castings to Consider Q4 Results on May 10",
            "Summary": "Electrosteel Castings has announced that it will consider its fourth quarter (Q4) financial results on May 10. This indicates that the company is preparing to release its earnings report for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1746188173000,
            "Source": "default"
        },
        {
            "Title": "Electrosteel Castings: SEBI Settles Insider Trading Case with ₹18.64 Crore Fine",
            "Summary": "SEBI passed a settlement order in the Electrosteel Castings case, involving alleged insider trading during the amalgamation with Srikalahasthi Pipes. 15 applicants, including company officials and related entities, agreed to pay fines totaling ₹18.64 crore and face debarment periods of up to 6 months.",
            "Sentiment": "negative",
            "PublishDate": 1740058489000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Electrosteel Castings Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Electrosteel Castings has reported a decrease in its third-quarter EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) to 2.55 billion rupees, down from 4.06 billion rupees in the same period last year. The company's EBITDA margin also declined to 14.35% from 21.74% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738321841000,
            "Source": "earnings"
        },
        {
            "Title": "Electrosteel Castings Reports Q3 Revenue Decline",
            "Summary": "Electrosteel Castings has reported a year-over-year decrease in its third-quarter revenue. The company's Q3 revenue stood at 17.77 billion rupees, down from 18.7 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1738321836000,
            "Source": "earnings"
        },
        {
            "Title": "Electrosteel Castings Reports Q3 Financial Results",
            "Summary": "Electrosteel Castings has announced its consolidated net profit for the third quarter. The company reported a net profit of 1.6 billion rupees, which is lower compared to 2.6 billion rupees in the same quarter last year (year-over-year). However, it shows an improvement from 1.55 billion rupees in the previous quarter (quarter-over-quarter).",
            "Sentiment": "neutral",
            "PublishDate": 1738321825000,
            "Source": "earnings"
        },
        {
            "Title": "Electrosteel Castings: Planned Maintenance Shutdown of Mini Blast Furnace",
            "Summary": "Electrosteel Castings Ltd announces a 10-12 day planned shutdown of its Mini Blast Furnace facility at Srikalahasthi unit for maintenance, starting December 26, 2024. The company's Q2 profits dropped 11% year-over-year, with a 31.32% quarter-over-quarter decline. Stock closed at ₹137.98, down 1.2% on Thursday.",
            "Sentiment": "neutral",
            "PublishDate": 1735217621000,
            "Source": "corporate_action"
        },
        {
            "Title": "Electrosteel Castings Commences Production at New Rubber Gasket Plant",
            "Summary": "Electrosteel Castings has announced the start of commercial production at its new 12 TPD (tons per day) rubber gasket plant in Andhra Pradesh. The production commenced on November 28, 2024, marking a significant expansion in the company's manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1732779551000,
            "Source": "corporate_action"
        },
        {
            "Title": "Electrosteel Castings Reports Q2 Financial Results",
            "Summary": "Electrosteel Castings has reported its Q2 financial results. The company's EBITDA for Q2 was 2.67 billion rupees, down from 3 billion rupees in the same quarter last year. The EBITDA margin also decreased to 14.64% from 15.65% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730281870000,
            "Source": "result"
        },
        {
            "Title": "Electrosteel Castings Reports Q2 Revenue Decline",
            "Summary": "Electrosteel Castings has reported a year-over-year decrease in its second quarter revenue. The company's Q2 revenue stood at 18.3 billion rupees, down from 19.2 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1730281815000,
            "Source": "result"
        },
        {
            "Title": "Electrosteel Castings Reports Q2 Profit Decline",
            "Summary": "Electrosteel Castings has reported a consolidated net profit of 1.55 billion rupees for the second quarter, down from 1.75 billion rupees in the same period last year. This represents a year-over-year decrease in profit for the company.",
            "Sentiment": "negative",
            "PublishDate": 1730281789000,
            "Source": "result"
        },
        {
            "Title": "Electrosteel Castings Acquires Singardo International",
            "Summary": "<p><span class='neutral'>Electrosteel Castings</span> has <span class='positive'>remitted</span> <b>415 million rupees</b> for the <span class='positive'>acquisition</span> of shares of <span class='neutral'>Singardo International</span>. As a result of this transaction, Singardo International will become a <span class='positive'>wholly owned subsidiary</span> of Electrosteel Castings.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728301916000,
            "Source": "corporate_action"
        }
    ]
}