{
    "Symbol": "ELECON",
    "ISIN": "INE205B01031",
    "News": [
        {
            "Title": "Elecon Engineering Reports Modest Growth Amid Delays",
            "Summary": "Elecon Engineering posted ₹522 crore revenue with 4% YoY growth in Q3, facing order delays and execution deferrals. Management revised FY26 guidance downward by 5% to ₹2,650 crore while maintaining market leadership.",
            "Sentiment": "neutral",
            "PublishDate": 1768222441441,
            "Source": "co_actions_results"
        },
        {
            "Title": "Elecon Engineering Shares Q3FY26 Call Recording",
            "Summary": "Elecon Engineering Company Limited has made available the audio recording of its Q3FY26 earnings conference call held on January 9, 2026, on its investor website under regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1767962883956,
            "Source": "co_actions_results"
        },
        {
            "Title": "Elecon Engineering Shares Plunge 17% on Weak Q3 Results",
            "Summary": "Elecon Engineering shares fell 17% after reporting 33% decline in Q3 net profit to ₹61.89 crore and CFO resignation announcement. Revenue grew marginally by 1.7% to ₹454.16 crore.",
            "Sentiment": "negative",
            "PublishDate": 1767949512699,
            "Source": "co_actions_results"
        },
        {
            "Title": "Elecon Engineering Shares Tank 16% on Q3 Results",
            "Summary": "Elecon Engineering shares fell 16% to 9-month low after Q3 net profit dropped 33% to ₹72 crore despite 4.3% revenue growth to ₹552 crore.",
            "Sentiment": "negative",
            "PublishDate": 1767944724425,
            "Source": "co_actions_results"
        },
        {
            "Title": "Elecon Engineering shares fall 16% on weak Q3 results",
            "Summary": "Elecon Engineering shares dropped 16% after Q3FY26 results showed 33% YoY decline in net profit to ₹72 crore despite 4% revenue growth. Strong order book of ₹1,372 crore provides recovery visibility.",
            "Sentiment": "negative",
            "PublishDate": 1767944143474,
            "Source": "co_actions_results"
        },
        {
            "Title": "Elecon Engineering Shares Drop 13% on Weak Q3 Results",
            "Summary": "Elecon Engineering shares plunged over 13% to a nine-month low following disappointing Q3 results showing 33% decline in net profit and significant margin contraction despite 4.3% revenue growth.",
            "Sentiment": "negative",
            "PublishDate": 1767940099171,
            "Source": "co_actions_results"
        },
        {
            "Title": "Elecon Engineering Q3 profit drops 33% to ₹72 cr",
            "Summary": "Industrial gear solutions provider Elecon Engineering reported 33% decline in Q3 net profit to ₹72 crore, with shares falling 13.3% despite marginal revenue growth of 4.3% to ₹552 crore.",
            "Sentiment": "negative",
            "PublishDate": 1767938730072,
            "Source": "co_actions_results"
        },
        {
            "Title": "Elecon Engineering shares fall 13% on Q3 results",
            "Summary": "Elecon Engineering shares dropped 13% following Q3 results showing 33% decline in net profit to ₹72 crore despite 4.3% revenue growth, with EBITDA margin contracting to 19.8% from 26.9% year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1767938450879,
            "Source": "co_actions_results"
        },
        {
            "Title": "Elecon Engineering Q3 Net Profit Drops 35% YoY",
            "Summary": "Elecon Engineering reported Q3 consolidated net profit of ₹72.00 crores, down 35% YoY, while revenue grew 4% to ₹550 crores. EBITDA margin compressed to 19.79% from 26.96%.",
            "Sentiment": "negative",
            "PublishDate": 1767924797624,
            "Source": "co_actions_results"
        },
        {
            "Title": "ELECON Engineering CFO Narasimhan Raghunathan Resigns",
            "Summary": "ELECON Engineering Company announces the resignation of Chief Financial Officer Narasimhan Raghunathan from his position at the capital goods manufacturing company.",
            "Sentiment": "neutral",
            "PublishDate": 1767876290774,
            "Source": "stocks"
        },
        {
            "Title": "Elecon Engineering Q3FY26: Revenue ₹552Cr, EBITDA Drops 23%",
            "Summary": "Elecon Engineering reported Q3FY26 revenue of ₹552 crores (+4.3% YoY) but EBITDA declined 23.4% to ₹109 crores with margin compression to 19.8%. Order book stands strong at ₹1,372 crores.",
            "Sentiment": "negative",
            "PublishDate": 1767876227231,
            "Source": "co_actions_results"
        },
        {
            "Title": "Elecon Wins GST Appeal, Awaits ₹14.02L Refund",
            "Summary": "Elecon Engineering receives favorable order from Deputy Commissioner of State Tax (Appeal), Vadodara in GST transport vehicle detention case. Company paid ₹14.02 lakh penalty, now awaits refund.",
            "Sentiment": "positive",
            "PublishDate": 1767848094720,
            "Source": "stocks"
        },
        {
            "Title": "Elecon Engineering Q3FY26 Earnings Call on Jan 9",
            "Summary": "Elecon Engineering Company Limited announces earnings conference call scheduled for January 9, 2026 at 4:00 PM IST to discuss Q3FY26 financial performance for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767697788958,
            "Source": "co_actions_results"
        },
        {
            "Title": "Elecon Engineering Reports 14% Revenue Growth in Q2 FY26 Despite International Market Delays",
            "Summary": "Elecon Engineering Company Limited reported consolidated revenue of INR578 crores for Q2 FY26, up 14% year-on-year from INR508 crores. The Gear division contributed 76% of total revenue at INR441 crores (9% growth), while the MHE division grew 33% to INR137 crores. EBITDA stood at INR126 crores with a margin of 21.7%, compared to INR112 crores in the previous year. Order intake reached INR688 crores, showing 28% growth year-on-year. The company maintained its annual guidance of INR2,650 crores revenue and 24% EBITDA margin for FY26. International business remained flat due to geopolitical volatility causing delays in order receipt and execution, while domestic demand showed strength across power, steel, and cement sectors. The Board declared an interim dividend of INR0.50 per equity share. The company aims to increase export share to 50% of total revenue by FY30 and has planned capex of INR400 crores for FY26-28.",
            "Sentiment": "positive",
            "PublishDate": 1760703032581,
            "Source": "earnings"
        },
        {
            "Title": "Elecon Engineering Declares Interim Dividend of Rs 0.50 Per Share for FY 2025-26",
            "Summary": "Elecon Engineering Company Limited's Board of Directors approved an interim dividend of Rs 0.50 per equity share (50% on face value of Rs 1.00) for FY 2025-26. The dividend will be paid to shareholders holding shares as on the record date of October 16, 2025. The company has communicated detailed tax deduction at source (TDS) procedures to shareholders following the abolition of Dividend Distribution Tax from April 1, 2020. For resident shareholders, TDS will be deducted at 10% unless the total dividend is below Rs 10,000 or exemption forms are submitted. Non-resident shareholders will face 20% withholding tax unless they provide appropriate documentation for treaty benefits. Shareholders must submit required documents by October 16, 2025, to claim applicable exemptions or lower tax rates.",
            "Sentiment": "positive",
            "PublishDate": 1760106218775,
            "Source": "corporate_action"
        },
        {
            "Title": "Elecon Engineering Reports 14% Revenue Growth in Q2",
            "Summary": "Elecon Engineering Co reported quarterly revenue of Rs 5.8 billion compared to Rs 5.08 billion in the same period last year, representing a year-on-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1760081697607,
            "Source": "earnings"
        },
        {
            "Title": "Elecon Engineering Reports Flat Q2 Net Profit at 877M Rupees, EBITDA Grows to 1.26B Rupees",
            "Summary": "Elecon Engineering Co reported Q2 consolidated net profit of 877 million rupees, unchanged from the same period last year. The company's EBITDA increased to 1.26 billion rupees compared to 1.12 billion rupees in the previous year. However, EBITDA margin declined slightly to 21.7% from 22.1% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1760081356399,
            "Source": "earnings"
        },
        {
            "Title": "Elecon Engineering Faces Adverse Ruling in CENVAT Credit Dispute, Plans High Court Appeal",
            "Summary": "Elecon Engineering received an unfavorable order from the Commissioner (Appeal) regarding a disputed CENVAT credit case. The company plans to file a writ petition before the Gujarat High Court to challenge this decision.",
            "Sentiment": "negative",
            "PublishDate": 1755868597553,
            "Source": "stock"
        },
        {
            "Title": "Elecon Engineering Schedules Non-Deal Roadshow in Mumbai",
            "Summary": "Elecon Engineering Company Limited will participate in a Non-Deal Roadshow in Mumbai from July 28-30, 2025, hosted by Share India Securities Limited. The meetings will begin at 10:00 a.m. IST and will be conducted as in-person group meetings with investors and analysts. The discussions will be based on publicly available information with no presentation planned. The company confirmed that no unpublished price sensitive information will be shared during these meetings.",
            "Sentiment": "neutral",
            "PublishDate": 1753273593860,
            "Source": "stock"
        },
        {
            "Title": "Elecon Engineering Reports Open Orders for Gear Division",
            "Summary": "Elecon Engineering announced that its Gear Division had open orders worth Rs 710 Crores as of June 30, 2025, according to a concall update.",
            "Sentiment": "positive",
            "PublishDate": 1752464581000,
            "Source": "default"
        },
        {
            "Title": "Elecon Engineering Announces Capital Spending and Revenue Projections for FY26",
            "Summary": "Elecon Engineering has outlined its capital expenditure plans and revenue projections for FY26. The company plans to invest Rs 400 crores in its Gear Division and Rs 35 crores in its MHE Division. For the MHE Division, Elecon projects revenue of Rs 650 crores with a 23% sustainable profit margin. The company expects consolidated revenue of Rs 2,650 crores for FY26, excluding Rs 25 crores from an arbitration settlement.",
            "Sentiment": "positive",
            "PublishDate": 1752464549000,
            "Source": "default"
        },
        {
            "Title": "Elecon Engineering Responds to NSE Notice on RPT Disclosure Non-Compliance",
            "Summary": "Elecon Engineering has responded to a notice from the National Stock Exchange (NSE) regarding non-compliance in Related Party Transaction (RPT) disclosure. The company has requested a waiver from the NSE for this non-compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1752238235000,
            "Source": "default"
        },
        {
            "Title": "Elecon Engineering Aims for Margin Recovery and International Expansion",
            "Summary": "Elecon Engineering's Managing Director has stated that the company expects margin recovery following capacity increases and new revenue from capital expenditure. Additionally, the company is gradually progressing towards its goal of earning 50% of its total revenue from international markets by FY30.",
            "Sentiment": "positive",
            "PublishDate": 1752219178000,
            "Source": "default"
        },
        {
            "Title": "Elecon Engineering Reports Q1 Results with Exceptional Item",
            "Summary": "Elecon Engineering has reported its Q1 results. The company recorded an exceptional item of 804 million rupees. Profit before tax for Q1 was 1.27 billion rupees, compared to 917 million rupees in the same quarter last year, showing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1752218581000,
            "Source": "result"
        },
        {
            "Title": "Elecon Engineering Reports Strong Q1 Financial Performance",
            "Summary": "Elecon Engineering has reported its Q1 financial results. The company's revenue increased to 4.9 billion rupees from 3.9 billion rupees year-over-year. EBITDA rose to 1.3 billion rupees from 924 million rupees, with the EBITDA margin improving to 26.56% from 23.54%. The consolidated net profit for Q1 reached 1.75 billion rupees, up from 734 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1752217818000,
            "Source": "result"
        },
        {
            "Title": "Elecon Engineering Announces FY26 Financial Guidance",
            "Summary": "Elecon Engineering has provided financial guidance for FY26, projecting consolidated revenue of INR 2,650 crores with an EBITDA margin of 24%. This information was shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1745811480000,
            "Source": "default"
        },
        {
            "Title": "Elecon Engineering Reports Strong Q4 Financial Results",
            "Summary": "Elecon Engineering has announced its Q4 financial results, showing significant year-over-year growth. The company's revenue increased to 7.98 billion rupees from 5.6 billion rupees in the previous year. EBITDA rose to 1.95 billion rupees from 1.35 billion rupees, with the EBITDA margin improving to 24.49% from 23.97%. Consolidated net profit also saw a substantial increase, reaching 1.5 billion rupees compared to 1.03 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1745482924000,
            "Source": "result"
        },
        {
            "Title": "Elecon Engineering Co. Ltd. Experiences Large Block Trade on NSE",
            "Summary": "A significant block trade occurred for Elecon Engineering Co. Ltd. on the National Stock Exchange (NSE). Approximately 505,868 shares were traded at a price of Rs. 414.00 per share, resulting in a total transaction value of Rs. 20.94 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1741158783000,
            "Source": "block_deals"
        },
        {
            "Title": "Elecon Engineering Focuses on New OEM Contracts and Overseas Market Expansion",
            "Summary": "Elecon Engineering has announced its strategic focus on securing new Original Equipment Manufacturer (OEM) contracts and expanding its revenue share from international markets, as revealed in their investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1737550818000,
            "Source": "corporate_action"
        },
        {
            "Title": "Elecon Engineering: Shares Tumble on Sluggish Gear Division Growth",
            "Summary": "Elecon Engineering's shares fell up to 10.04% after reporting only 2.1% growth in its gear division, which accounts for half of total revenue. Q3 net profit rose 19% to Rs 107.5 crore, revenue up 11.7% to Rs 529 crore. The company faced domestic market sluggishness and delays in capex investments and order inflow for FY2025.",
            "Sentiment": "negative",
            "PublishDate": 1737538142000,
            "Source": "earnings"
        },
        {
            "Title": "Elecon Engineering Reports Q3 Revenue Growth",
            "Summary": "Elecon Engineering Company has reported a revenue of 5.3 billion rupees for the third quarter, compared to 4.7 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1737528430000,
            "Source": "earnings"
        },
        {
            "Title": "Elecon Engineering Reports Improved Q3 EBITDA and Margin",
            "Summary": "Elecon Engineering Company has reported an increase in its Q3 EBITDA to 1.42 billion rupees, up from 1.2 billion rupees in the same quarter last year. The company's EBITDA margin also improved, rising to 26.96% from 25.42% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1737528362000,
            "Source": "earnings"
        },
        {
            "Title": "Elecon Engineering Reports Increased Q3 Consolidated Net Profit",
            "Summary": "Elecon Engineering Co. has reported a consolidated net profit of 1.07 billion rupees for the third quarter, compared to 904 million rupees in the same period last year. This represents a year-over-year increase in the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1737528310000,
            "Source": "earnings"
        },
        {
            "Title": "Elecon Engineering: Vijay Kedia Reduces Stake in December Quarter",
            "Summary": "Ace investor Vijay Kedia has reduced his stake in Elecon Engineering from 1.29% to 1.09% in the December quarter, as per the latest shareholding pattern.",
            "Sentiment": "neutral",
            "PublishDate": 1737004600000,
            "Source": "normal_news"
        },
        {
            "Title": "Elecon Engineering Forecasts Higher Growth for Next Year",
            "Summary": "Elecon Engineering Company expects to see increased growth in the coming year, particularly in its material handling division and within the domestic market. The company has set a target of 2,225 crore rupees, as revealed during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1729568396000,
            "Source": "corporate_action"
        },
        {
            "Title": "Elecon Engineering Confident in Meeting FY25 Financial Targets",
            "Summary": "Elecon Engineering has expressed confidence in achieving its annual guidance for revenue and EBITDA margins for the fiscal year 2025, as stated in their investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1729321449000,
            "Source": "normal_news"
        },
        {
            "Title": "Elecon Engineering Anticipates Faster Execution and Growth in H2FY25",
            "Summary": "Elecon Engineering expects accelerated execution in the second half of FY25 to meet their overall guidance for the fiscal year. The company's focus on product supply and aftersales services in the Material Handling Equipment (MHE) segment is showing positive results, leading to optimism for growth in upcoming quarters.",
            "Sentiment": "positive",
            "PublishDate": 1729321329000,
            "Source": "normal_news"
        },
        {
            "Title": "Elecon Engineering Reports Revenue Decline, Remains Optimistic for FY25",
            "Summary": "Elecon Engineering's Managing Director reported a 5.9% decline in revenue due to delayed order inflows. The company views this as a temporary setback and expects recovery in upcoming quarters. They maintain a positive outlook for overall revenue growth in the fiscal year 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1729237425000,
            "Source": "result"
        },
        {
            "Title": "Elecon Engineering Reports Q2 EBITDA and Margin Decline",
            "Summary": "Elecon Engineering Company has reported its Q2 financial results. The company's EBITDA decreased to 1.12 billion rupees from 1.18 billion rupees year-over-year. The EBITDA margin also declined to 22.1% from 24.49% compared to the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1729236097000,
            "Source": "result"
        },
        {
            "Title": "Elecon Engineering Reports Q2 Revenue Growth",
            "Summary": "Elecon Engineering Company has reported a revenue of 5.1 billion rupees for the second quarter, compared to 4.8 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729236070000,
            "Source": "result"
        },
        {
            "Title": "Elecon Engineering Reports Slight Dip in Q2 Profit",
            "Summary": "Elecon Engineering Company has reported a consolidated net profit of 877 million rupees for the second quarter, compared to 886 million rupees in the same period last year. This represents a marginal year-over-year decrease in profit.",
            "Sentiment": "neutral",
            "PublishDate": 1729236035000,
            "Source": "result"
        }
    ]
}