{
    "Symbol": "ELGIEQUIP",
    "ISIN": "INE285A01027",
    "News": [
        {
            "Title": "Elgi Equipments Q3 FY26 Results Show Strong Growth",
            "Summary": "Elgi Equipments reports 18% revenue growth to INR 10,034 Mn in Q3 FY26, with PBT rising 30% to INR 1,439 Mn. Company maintains strong global presence across 120+ countries.",
            "Sentiment": "positive",
            "PublishDate": 1770869515780,
            "Source": "co_actions_results"
        },
        {
            "Title": "Elgi Equipments Board Meet on Feb 11 for Q3FY26 Results",
            "Summary": "Elgi Equipments Limited has scheduled its Board of Directors meeting for February 11, 2026, to consider Q3FY26 unaudited financial results. Trading window remains closed until February 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768818495439,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wasatch Advisors reduces stake in Elgi Equipments",
            "Summary": "Wasatch Advisors LP sold 43,837 shares of Elgi Equipments on December 12, 2025, reducing its shareholding from 5.211% to 5.197% through open market transactions.",
            "Sentiment": "neutral",
            "PublishDate": 1765782646955,
            "Source": "stocks"
        },
        {
            "Title": "SBI Mutual Fund Crosses 5% Stake Threshold in Elgi Equipments",
            "Summary": "SBI Mutual Fund acquired 55,62,002 shares of Elgi Equipments on November 25, 2025, through market purchase, increasing its total holding to 1,91,91,939 shares representing 6.0560% of the company's paid-up share capital. The acquisition triggered regulatory disclosure requirements as the mutual fund's stake crossed the 5% threshold, up from its previous holding of 4.3009%.",
            "Sentiment": "neutral",
            "PublishDate": 1764314585946,
            "Source": "stock"
        },
        {
            "Title": "MUFG Reduces Stake in Elgi Equipments to 2.11% Through Subsidiary Sale",
            "Summary": "Mitsubishi UFJ Financial Group sold its indirect interest in Elgi Equipments Limited by divesting First Sentier Investors entities on November 25, 2025, reducing its shareholding from 5.08% to 2.11%. The transaction involved sale of 1,380,405 shares, with MUFG now holding 6,674,650 shares out of total voting capital of 315,701,778 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764308962929,
            "Source": "corporate_action"
        },
        {
            "Title": "Elgi Equipments Sees Rs. 51.96 Crore Block Trade on NSE",
            "Summary": "Elgi Equipments Ltd. witnessed a block trade worth Rs. 51.96 crores involving 1,028,838 shares executed at Rs. 505.00 per share on NSE. The transaction represents a significant institutional or bulk investor activity in the company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1764306078998,
            "Source": "order&deals"
        },
        {
            "Title": "Elgi Equipments Sees Rs. 123.93 Crore Block Trade on NSE",
            "Summary": "Elgi Equipments Ltd. witnessed a significant block trade worth Rs. 123.93 crores involving approximately 2,566,614 shares at Rs. 482.85 per share on NSE. The large-volume transaction indicates substantial institutional or bulk investor activity in the company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1764048571347,
            "Source": "order&deals"
        },
        {
            "Title": "Elgi Equipments Reports Flat EBITDA Despite 11% Sales Growth in Q2 2025-26",
            "Summary": "Elgi Equipments' quarterly results showed 11% sales growth but EBITDA remained flat at 14.9% versus 16.3% last year, impacted by 15% increase in employee costs and strategic initiatives consuming 1.2% of EBITDA. The company expects no impact from US tariffs at consolidated level due to cost mitigation measures, while implementing cost reduction strategies in Europe and preparing to launch low-cost compressor range and DemandMatch product for new machines.",
            "Sentiment": "neutral",
            "PublishDate": 1763558863230,
            "Source": "earnings"
        },
        {
            "Title": "Elgi Equipments Reports 11% Consolidated Sales Growth in Q2 2025-26",
            "Summary": "Elgi Equipments Limited, an air compressor manufacturer, reported consolidated sales of Rs. 968 crores for the quarter compared to Rs. 869 crores in the corresponding quarter of 2024-25, marking 11% growth. Standalone sales reached Rs. 568 crores versus Rs. 531 crores in the same quarter of 2024-25, showing 7% growth. Consolidated profit after tax increased 27% to Rs. 121 crores from Rs. 95 crores in the same period of 2024-25, while standalone PAT was Rs. 91 crores compared to Rs. 98 crores in the previous year. The company experienced continued growth momentum across India, Middle Eastern, and South American markets, with double-digit growth in USA and Australia. European performance remained subdued due to economic headwinds. The automotive business achieved expected growth compared to the same period in 2024-25. For the third quarter of 2025-26, the company expects to grow at similar levels as the second quarter, subject to resolution and stabilization of import tariffs between USA and India.",
            "Sentiment": "positive",
            "PublishDate": 1762991159525,
            "Source": "earnings"
        },
        {
            "Title": "Elgi Equipments Reports Mixed Q2 Results with Revenue Growth and Margin Decline",
            "Summary": "Elgi Equipments reported Q2 consolidated net profit of 1.2 billion rupees compared to 947 million rupees in the same period last year. Revenue increased to 9.7 billion rupees from 8.7 billion rupees year-over-year. EBITDA remained flat at 1.4 billion rupees compared to the previous year, while EBITDA margin declined to 14.45% from 16.29% in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1762954977225,
            "Source": "earnings"
        },
        {
            "Title": "ELGi Equipments Grants 16,100 Stock Options to Subsidiary Employee",
            "Summary": "ELGi Equipments Limited's Nomination and Remuneration Committee approved the grant of 16,100 stock options to an eligible employee of the company's subsidiary under the ELGi Equipments Limited Employees Stock Option Plan, 2019. Each stock option can be converted into one equity share with a face value of Re. 1. The exercise price was set at Rs. 478.25 per stock option, determined based on market price. The options have a maximum vesting period of three years from the grant date, with specific vesting conditions outlined in individual grant letters. Once vested, the options must be exercised within three months. The committee meeting was held on November 12, 2025, lasting from 1:00 PM to 2:35 PM.",
            "Sentiment": "neutral",
            "PublishDate": 1762943128914,
            "Source": "corporate_action"
        },
        {
            "Title": "Elgi Equipments Launches New Demand-Match System for Fixed-Speed Compressors",
            "Summary": "Elgi Equipments has launched the Elgi Demand-Match System for fixed-speed compressors. The system provides energy savings similar to variable frequency drives while offering enhanced reliability. The product is initially available in India, with the company planning a global rollout.",
            "Sentiment": "positive",
            "PublishDate": 1758275434575,
            "Source": "stock"
        },
        {
            "Title": "Elgi Rubber Company Pledges Shares Worth ₹33.57 Crore to RBL Bank for ₹42.31 Crore Loan",
            "Summary": "Elgi Rubber Company Limited has pledged 6,64,160 shares (0.21% of total share capital) of Elgi Equipments Limited to RBL Bank Limited to secure a loan of ₹42.31 crore. The pledged shares are valued at ₹33.57 crore, representing a security cover ratio of 0.80. The encumbrance was created on August 21, 2025, for business requirements of Elgi Rubber Company Limited. The pledged shares represent 0.67% of the total promoter shareholding of 9,88,54,180 shares (31.19% of Elgi Equipments' total share capital). Elgi Equipments Limited is listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1756185551060,
            "Source": "corporate_action"
        },
        {
            "Title": "Elgi Equipments Reports 8% Revenue Growth in Q1 FY2026 Despite US Tariff Challenges",
            "Summary": "Elgi Equipments Limited reported 8% year-over-year revenue growth in Q1 FY2026, driven primarily by volume growth, exchange rate changes, and price increases. EBITDA reached 1200 million rupees, falling short of the expected 1500 million rupees, while PBT grew 18% year-over-year. The company maintained a healthy net cash position and remains on track to achieve its $450 million revenue guidance for FY2026. Geographically, India continued strong performance, the US market remained profitable despite tariff concerns, while Europe faced challenges with economic conditions. The Middle East & Africa region showed strong revenue and profitability. The company is launching new stabilizer technology across India in September and plans to expand in-house motor manufacturing from 40-45% to 70-75% by year-end. Key challenges include US tariff uncertainty, European economic slowdown, and competitive pressure in low-end segments. Management expects 5-10% price increases in the US market to offset tariffs and anticipates recovery in portable compressors within 6-8 months.",
            "Sentiment": "neutral",
            "PublishDate": 1755602142823,
            "Source": "earnings"
        },
        {
            "Title": "Elgi Equipments Appoints Rohit Gupte as Company Secretary and Compliance Officer",
            "Summary": "Elgi Equipments Limited appointed Mr. Rohit Gupte as Company Secretary and Compliance Officer, effective August 12, 2025. The appointment was approved by the Board of Directors based on recommendations from the Nomination and Remuneration Committee. Mr. Gupte holds qualifications as a Company Secretary (ACS), Cost Accountant (AICWA), and a law degree from Mumbai University. He brings over three decades of experience in finance, operations, compliance and leadership roles across organizations including Siemens, Fidelity, PineBridge Investments, Deutsche Bank, and NSE where he held the Company Secretary position. For the past 5 years, he led governance, compliance and secretarial functions at NSE, playing a key role in regulatory compliance, market regulation, and policy formation.",
            "Sentiment": "positive",
            "PublishDate": 1755008725726,
            "Source": "corporate_governance"
        },
        {
            "Title": "Elgi Equipments Reports 18% Growth in Q1 Net Profit to 856 Million Rupees",
            "Summary": "Elgi Equipments reported consolidated net profit of 856 million rupees in Q1, up from 728 million rupees in the same period last year. Revenue increased to 8.7 billion rupees from 8 billion rupees year-over-year. EBITDA rose to 1.2 billion rupees compared to 1.13 billion rupees previously, though EBITDA margin declined slightly to 13.97% from 14.22% in the prior year period.",
            "Sentiment": "positive",
            "PublishDate": 1755002860956,
            "Source": "earnings"
        },
        {
            "Title": "Elgi Equipments Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade has occurred for Elgi Equipments Ltd. on the National Stock Exchange (NSE). The trade involved approximately 1,560,073 shares at a price of Rs. 534.70 per share, totaling Rs. 83.42 crores in value.",
            "Sentiment": "neutral",
            "PublishDate": 1751946351000,
            "Source": "block_details"
        },
        {
            "Title": "ELGI Equipments Reports Q4 Results and Dividend Recommendation",
            "Summary": "ELGI Equipments has announced its quarterly results and dividend recommendation. The company's Q4 consolidated net profit increased to 1.02 billion rupees, up from 762 million rupees year-over-year. Revenue for Q4 rose to 9.9 billion rupees from 8.7 billion rupees in the previous year. EBITDA for Q4 improved to 1.5 billion rupees, compared to 1.25 billion rupees year-over-year, with the EBITDA margin expanding to 15.10% from 14.43%. The company has recommended a dividend of 2.2 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748441037000,
            "Source": "result"
        },
        {
            "Title": "ELGI EQUIPMENTS Reports Q3 Financial Results",
            "Summary": "ELGI EQUIPMENTS has released its Q3 financial results. The company reported an EBITDA of 1.19 billion rupees, compared to 1.3 billion rupees in the same quarter last year. The EBITDA margin for Q3 stood at 14.10%, down from 15.75% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1739196245000,
            "Source": "earnings"
        },
        {
            "Title": "ELGI Equipments Reports Q3 Financial Results",
            "Summary": "ELGI Equipments announced its Q3 consolidated financial results. The company reported a net profit of 806 million rupees, compared to 839 million rupees in the same quarter last year. Revenue for Q3 increased to 8.47 billion rupees from 8.22 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739196240000,
            "Source": "earnings"
        },
        {
            "Title": "ELGI Equipments to Consider Q3 Results on February 10",
            "Summary": "ELGI Equipments has announced that it will consider its third quarter (Q3) financial results on February 10. This indicates the company is preparing to release its earnings report for the latest fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737461500000,
            "Source": "earnings"
        },
        {
            "Title": "ELGI Equipments to Launch New Product Line",
            "Summary": "ELGI Equipments has announced plans to introduce a new product line for air compressors, vacuum products, and blowers. The company is set to commence the product launch within the next six months, expanding its offerings in the industrial equipment sector.",
            "Sentiment": "positive",
            "PublishDate": 1737451102000,
            "Source": "corporate_action"
        },
        {
            "Title": "ELGI Equipments Reports Q2 Financial Results",
            "Summary": "ELGI Equipments announced its Q2 financial results. The company reported an EBITDA of 1.4 billion rupees, slightly down from 1.43 billion rupees in the same quarter last year. The EBITDA margin decreased to 16.29% from 17.71% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731328147000,
            "Source": "result"
        },
        {
            "Title": "ELGI Equipments Reports Q2 Revenue Growth",
            "Summary": "ELGI Equipments announced its second quarter revenue, which increased to 8.7 billion rupees from 8 billion rupees in the same period last year, representing year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731328012000,
            "Source": "result"
        },
        {
            "Title": "ELGI Equipments Reports Q2 FY24 Financial Results",
            "Summary": "ELGI Equipments announced its Q2 financial results. The company's consolidated net profit increased to 947 million rupees, up from 913 million rupees year-over-year and 728 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731327955000,
            "Source": "result"
        }
    ]
}