{
    "Symbol": "ELIN",
    "ISIN": "INE050401020",
    "News": [
        {
            "Title": "Elin Electronics Allots 50,000 Shares Under ESOP 2024",
            "Summary": "Elin Electronics Limited allotted 50,000 equity shares under Employee Stock Option Plan 2024 at Rs. 78 per share, increasing paid-up capital to Rs. 24,85,46,100.",
            "Sentiment": "positive",
            "PublishDate": 1770728061413,
            "Source": "co_actions_results"
        },
        {
            "Title": "Elin Electronics Q3 Net Profit Jumps 157% YoY",
            "Summary": "Elin Electronics reported consolidated net profit of 36 million rupees in Q3, marking significant growth from 14 million rupees in the same quarter last year, representing a 157% year-on-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1770362997017,
            "Source": "co_actions_results"
        },
        {
            "Title": "Elin Electronics Board Meet Set for Feb 6 for Q3FY26",
            "Summary": "Elin Electronics Limited has scheduled a board meeting on February 6, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768988175380,
            "Source": "co_actions_results"
        },
        {
            "Title": "Elin Electronics Reports 23% Revenue Growth to INR 375 Crores in Q2 FY26",
            "Summary": "Elin Electronics Limited reported operating revenue of INR 375 crores for the quarter, up 23% from INR 305 crores in the same period last year. The growth was driven by strong performance in appliance and fan business, attributed to new product launches, customer acquisition, and earlier Diwali timing. Consolidated EBITDA increased 80% to INR 20.4 crores from INR 11.3 crores year-on-year. Consolidated PAT rose to INR 10.3 crores from INR 4.8 crores. The company maintains strong liquidity with net cash of INR 94 crores as of September 2025. Working capital position improved to net 53 days. Fan business showed strong growth of almost 100% year-on-year, primarily driven by BLDC ceiling fan business. Home Appliance segment revenue increased from INR 83 crores to INR 140 crores. The company faced elevated power costs due to unseasonal rain and higher international air freight charges. Export business to USA has been stalled since August 2025 due to tariff situation uncertainty. The company is constructing a new facility at Rewari with total project cost of INR 100 crores, expected to be operational by March-April 2026.",
            "Sentiment": "positive",
            "PublishDate": 1763034945611,
            "Source": "earnings"
        },
        {
            "Title": "Elin Electronics Reports 29% Jump in Q2 Profit to Rs 103 Million",
            "Summary": "Elin Electronics Limited reported a net profit of Rs 102.99 million for the quarter ended September 30, 2025, representing a 29% increase from Rs 79.69 million in the same period last year. Revenue from operations grew to Rs 2,969.28 million compared to Rs 2,670.40 million in the previous year quarter. For the half-year period, net profit increased to Rs 196.91 million from Rs 107 million in the corresponding period of the previous year. The company operates in electronics manufacturing services and has fully utilized its IPO proceeds of Rs 1,651.52 million as of September 30, 2025. The Board also approved an Employee Stock Option Plan with 250,000 shares granted to employees. The results include consolidated figures of Elin Electronics Limited and its wholly owned subsidiary Elin Appliances Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1762783634338,
            "Source": "earnings"
        },
        {
            "Title": "Elin Electronics Cuts Margin Forecast and Expects Revenue Impact from Tariff Issues",
            "Summary": "Elin Electronics anticipates up to 3% impact on annual revenue due to tariff issues. The company has revised its margin forecast downward to 5.5-6% from the previous guidance of 6-6.5%.",
            "Sentiment": "negative",
            "PublishDate": 1762763304151,
            "Source": "stock"
        },
        {
            "Title": "Elin Electronics Reports Strong Q2 Growth with Revenue Rising to 3.66 Billion Rupees",
            "Summary": "Elin Electronics reported Q2 revenue of 3.66 billion rupees, up from 2.96 billion rupees in the same quarter last year. The company's consolidated net profit increased to 103 million rupees compared to 47.8 million rupees year-over-year. EBITDA rose to 204 million rupees from 113 million rupees, while EBITDA margin improved to 5.6% from 3.82% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762762419471,
            "Source": "earnings"
        },
        {
            "Title": "Elin Electronics Reports Complete Utilization of IPO Proceeds Worth ₹1,651.52 Million",
            "Summary": "Elin Electronics Limited has fully utilized ₹1,651.52 million from its December 2022 IPO proceeds according to its quarterly monitoring report. The electronics manufacturing services company allocated ₹880 million for debt repayment, ₹375.89 million for facility upgrades at Ghaziabad and Verna locations, and ₹395.63 million for general corporate purposes. Axis Bank Limited, serving as the monitoring agency, reported no deviations from the stated objectives. The company's promoters include the Sethia family members. The monitoring report confirms all fund utilization aligned with the original offer document disclosures.",
            "Sentiment": "positive",
            "PublishDate": 1755102743907,
            "Source": "corporate_action"
        },
        {
            "Title": "Elin Electronics Reports 1% Revenue Growth to Rs 295 Crores in Q1 FY2026 Despite Lighting Segment Decline",
            "Summary": "Elin Electronics Limited reported Q1 FY2026 revenue of Rs 295 crores, representing 1% year-over-year growth. The company's consolidated EBITDA increased to Rs 17.6 crores from Rs 13.3 crores in Q1 FY2025, with adjusted EBITDA margin improving to 6.3%. Consolidated PAT rose to Rs 9.4 crores from Rs 5.9 crores. The lighting, fans and switches segment faced challenges with revenue declining to Rs 80.1 crores from Rs 89.4 crores, primarily due to key customer Signify moving business to a joint venture. However, the company added three new lighting customers including a top 5 player. Home appliances segment showed growth with revenue increasing to Rs 68.6 crores, while FHP motors remained flat at Rs 47-48 crores due to unseasonal rains. The company maintains strong financial position with net cash of Rs 103 crores and is constructing a new plant in Bhiwandi expected to be operational by March/April 2026. Management reaffirmed guidance of Rs 1,350 crores revenue for FY2026 representing 15% growth, with EBITDA margin target of 6-6.5%.",
            "Sentiment": "neutral",
            "PublishDate": 1754935699831,
            "Source": "earnings"
        },
        {
            "Title": "Elin Electronics Reports Growth in Q1 Revenue and Profitability",
            "Summary": "Elin Electronics reported Q1 revenue of 2.9 billion rupees compared to 2.86 billion rupees in the same period last year. The company's consolidated net profit increased to 94 million rupees from 59 million rupees year-over-year. EBITDA rose to 176 million rupees from 132 million rupees, while EBITDA margin improved to 5.94% from 4.51% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754554738734,
            "Source": "earnings"
        },
        {
            "Title": "CRISIL Reaffirms Elin Electronics' Credit Ratings at CRISIL A/A1 with Stable Outlook",
            "Summary": "CRISIL Ratings Ltd. has reaffirmed Elin Electronics Limited's long-term credit rating at CRISIL A and short-term rating at CRISIL A1 for bank loan facilities worth Rs. 134.00 Crore. The outlook on the long-term rating remains Stable. The company informed stock exchanges BSE and NSE about this credit rating update through a regulatory filing.",
            "Sentiment": "positive",
            "PublishDate": 1753279748272,
            "Source": "stock"
        },
        {
            "Title": "Elin Electronics Provides Revenue and EBITDA Margin Guidance for FY26",
            "Summary": "Elin Electronics has announced its financial guidance for FY26. The company expects revenue growth of 15-18% and an EBITDA margin of 6-6.5% for that fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1748253773000,
            "Source": "default"
        },
        {
            "Title": "Elin Electronics Reports Significant Profit Growth in Q4",
            "Summary": "Elin Electronics has announced its quarterly results. The company's consolidated net profit for Q4 increased to 172 million rupees from 35 million rupees in the same quarter last year. Revenue for the quarter rose to 3.1 billion rupees from 2.7 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748250905000,
            "Source": "result"
        },
        {
            "Title": "Elin Electronics Begins Phase 1 Construction of Rajasthan Plant",
            "Summary": "Elin Electronics has announced the commencement of Phase 1 construction for its new manufacturing plant in Rajasthan. This development marks a significant step in the company's expansion plans and is expected to enhance its production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1744634233000,
            "Source": "corporate_action"
        },
        {
            "Title": "Appliances Sells 1.57% Stake in Elin Electronics",
            "Summary": "Elin Electronics has announced that Appliances has sold a 1.57% stake in the company for 92 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1741694946000,
            "Source": "corporate_action"
        },
        {
            "Title": "Elin Electronics Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Elin Electronics has reported a decrease in its Q3 EBITDA, which fell to 76 million rupees from 85 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 2.92% from 3.66% in the same period last year. This indicates a potential squeeze on the company's profitability and operational efficiency.",
            "Sentiment": "negative",
            "PublishDate": 1739012688000,
            "Source": "earnings"
        },
        {
            "Title": "Elin Electronics Reports Q3 Financial Results",
            "Summary": "Elin Electronics has announced its Q3 financial results. The company's consolidated net profit decreased to 14 million rupees from 26 million rupees in the same quarter last year. However, revenue increased to 2.6 billion rupees from 2.3 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739012683000,
            "Source": "earnings"
        }
    ]
}