{
    "Symbol": "ELLEN",
    "ISIN": "INE236E01022",
    "News": [
        {
            "Title": "Ellenbarrie Q3FY26 Results: 36% Revenue Growth",
            "Summary": "Ellenbarrie Industrial Gases reported Q3FY26 revenue of ₹813.46 million, up 19.6% YoY, with net profit rising 35.9% to ₹260.87 million. Company also commissioned new 220 TPD plant at Uluberia.",
            "Sentiment": "positive",
            "PublishDate": 1769870683638,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ellenbarrie Industrial Gases Auditor Firm Converts to LLP",
            "Summary": "Ellenbarrie Industrial Gases Limited announces that its statutory auditor M S K A & Associates has converted into a Limited Liability Partnership while continuing audit obligations.",
            "Sentiment": "neutral",
            "PublishDate": 1768477039408,
            "Source": "stocks"
        },
        {
            "Title": "Ellenbarrie Signs Power Deal with Pattikonda Renewables",
            "Summary": "Ellenbarrie Industrial Gases executed a 25-year Power Delivery and Offtake Agreement with Pattikonda Renewables for a 6.00 MW wind-solar hybrid facility, investing ₹7.08 crores for 26% stake.",
            "Sentiment": "positive",
            "PublishDate": 1768030591925,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pace Digitek, Ellenbarrie shares fall post lock-in end",
            "Summary": "Shares of Pace Digitek and Ellenbarrie Industrial Gases declined as shareholder lock-ins ended on December 30, freeing up ₹103.88 crore and ₹780.78 crore worth of shares respectively for trading.",
            "Sentiment": "negative",
            "PublishDate": 1767069030821,
            "Source": "stocks"
        },
        {
            "Title": "Ellenbarrie Industrial Gases Reports Strong Q2 Performance with 96% PAT Growth and Expansion Plans",
            "Summary": "Ellenbarrie Industrial Gases achieved Rs 892 million revenue with 6.7% sequential growth and 96% year-on-year increase in profit after tax to Rs 367 million, maintaining stable 38% EBITDA margins. The company is expanding capacity to 1910 tons per day by end of FY26 through new plants in East India and targeting 20-25% CAGR growth in core gases business while exploring opportunities in solar and semiconductor sectors.",
            "Sentiment": "positive",
            "PublishDate": 1763122601855,
            "Source": "earnings"
        },
        {
            "Title": "Ellenbarrie Industrial Gases Reports IPO Proceeds Utilization for Quarter Ended September 30, 2025",
            "Summary": "Ellenbarrie Industrial Gases Limited submitted its monitoring agency report for IPO proceeds utilization covering the quarter ended September 30, 2025. The company raised Rs 4,000 million through fresh issue from its IPO conducted from June 24-26, 2025. CRISIL Ratings Limited reported that Rs 2,479.76 million has been utilized out of total net proceeds of Rs 3,704.51 million, leaving Rs 1,224.75 million unutilized. The company fully repaid Rs 2,100 million in outstanding borrowings as planned. For the air separation unit project at Uluberia-II plant, Rs 234.53 million was spent on civil work, installation, and machinery purchases out of the allocated Rs 1,045 million. General corporate purposes consumed Rs 145.23 million of the budgeted Rs 559.51 million, including IT needs, plant maintenance, brand building, and acquisition of a Bengaluru entity. Issue-related expenses utilized Rs 114.71 million for payments to merchant bankers and legal counsels. Unutilized funds of Rs 1,405.53 million are deployed in fixed deposits and bank accounts earning returns between 6.85% to 7.00%. The monitoring agency found no deviations from disclosed objectives and confirmed proceeds were utilized as per the offer document.",
            "Sentiment": "neutral",
            "PublishDate": 1762925689595,
            "Source": "stock"
        },
        {
            "Title": "Ellenbarrie Industrial Gases Reports Mixed Q2 Results with Higher Profit Despite Revenue Decline",
            "Summary": "Ellenbarrie Industrial Gases reported net profit of 367.1 million rupees for Q2, up from 296.5 million rupees in the same period last year. However, revenue declined to 891.7 million rupees from 947.1 million rupees year-over-year. EBITDA decreased to 334.8 million rupees from 362.2 million rupees, while EBITDA margin compressed to 37.54% from 38.25% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762780628770,
            "Source": "earnings"
        },
        {
            "Title": "Motilal Oswal Mutual Fund Schemes Acquire Additional 2.5 Lakh Shares in Ellenbarrie Industrial Gases",
            "Summary": "Three schemes of Motilal Oswal Mutual Fund acquired 2,50,000 additional shares in Ellenbarrie Industrial Gases Ltd through market transactions on September 4, 2025. The acquisition increased their total holding from 1.175 crore shares (8.3371%) to 1.20 crore shares (8.5145%) of the company's equity capital. The acquiring schemes include Motilal Oswal Balanced Advantage Fund, Multi Cap Fund, and Business Cycle Fund. Ellenbarrie Industrial Gases has an equity share capital of 14.09 crore shares with a face value of Rs. 2 each and is listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1757480080249,
            "Source": "order&deals"
        },
        {
            "Title": "Ellenbarrie Industrial Gases Reports 24% Revenue Growth and 40% EBITDA Growth in Q1 FY26",
            "Summary": "Ellenbarrie Industrial Gases Limited reported strong quarterly results with revenue growing 24% year-on-year and EBITDA increasing 40% year-on-year. The company's EBITDA margin improved to 37% from 30% in the same period last year. The Kurnool plant is operating at 60-65% capacity utilization and is expected to reach 85-90% by the second half of FY26, while all other facilities are running at full capacity. The company plans to commission a merchant plant in East India by October 2025, an on-site plant for Forest Steel Mill by March 2026, and another merchant plant in North India by Q1 FY27. Argon revenue increased to 9% of total revenue from 7% previously, with the company targeting 15%+ in the future. Ellenbarrie holds approximately 4% market share and is the 4th or 5th largest player in India's industrial gases sector. The company repaid INR 210 crores of borrowings in July 2025 using IPO proceeds and plans capital expenditure of INR 250 crores over the next 1.5 years. Management expects at least 25% revenue growth annually for the next 2-3 years and aims to sustain the 37% EBITDA margin. The company is expanding its capacity from 1,370 tons per day in FY25 to a target of 1,910 tons per day by FY26 end and 2,130 tons per day by FY27.",
            "Sentiment": "positive",
            "PublishDate": 1754983099379,
            "Source": "earnings"
        },
        {
            "Title": "Ellenbarrie Industrial Gases Reports 24.2% Revenue Growth in Q1FY26, Schedules Investor Call",
            "Summary": "Ellenbarrie Industrial Gases Limited reported quarterly results showing revenue increased 24.2% year-on-year to ₹836 million with 1.3% sequential growth. EBITDA grew 40.2% year-on-year to ₹307 million with margin expansion to 36.7%. Profit After Tax rose 15.6% year-on-year to ₹187 million, achieving a PAT margin of 22.4%. The margin improvement was driven by higher utilization of newly commissioned plants and cost rationalization measures. The company has scheduled an investors/analysts call for August 07, 2025, and released an investor presentation. Two major projects are progressing as planned: Uluberia 2 merchant plant (220 TPD) operational since October 2024, and an onsite plant (320 TPD) set for Q4 FY26 launch. The company announced acquisition of Truair Industrial Gases, a Bengaluru-based partnership firm, for ₹5.40 crore to add retail presence in the Bangalore market. Ellenbarrie has deployed IPO funds to reduce debt and is now in a net cash position.",
            "Sentiment": "positive",
            "PublishDate": 1754492194716,
            "Source": "earnings"
        }
    ]
}