{
    "Symbol": "EMAMILTD",
    "ISIN": "INE548C01032",
    "News": [
        {
            "Title": "Emami Reports Strong Q3FY26 Growth of 11%",
            "Summary": "Emami Limited delivered robust Q3FY26 performance with 11% growth, recovering from earlier challenges. Company showcased resilient FY25 results with 7% domestic sales growth and expanding margins.",
            "Sentiment": "positive",
            "PublishDate": 1770400489818,
            "Source": "stocks"
        },
        {
            "Title": "Emami Q3 Net Profit Rises 14.3% to ₹3.2 Billion",
            "Summary": "Emami reported consolidated net profit of ₹3.20 billion in Q3, marking a 14.3% year-on-year increase from ₹2.80 billion in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1770196659323,
            "Source": "co_actions_results"
        },
        {
            "Title": "Emami Board Meet on Feb 4 for Q3 Results & Dividend",
            "Summary": "Emami Limited has scheduled a board meeting on February 4, 2026, to consider Q3FY26 unaudited financial results and potential second interim dividend declaration for FY2025-26. The company will also hold an investor conference call at 4:00 PM IST on the same day.",
            "Sentiment": "neutral",
            "PublishDate": 1767785076756,
            "Source": "co_actions_results"
        },
        {
            "Title": "Emami Ltd Sees ₹107.15 Cr NSE Block Trade",
            "Summary": "Emami Ltd witnessed a significant block trade on NSE worth ₹107.15 crores involving 2,019,854 shares at ₹530.50 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767158870792,
            "Source": "co_actions_results"
        },
        {
            "Title": "Emami Faces GST Order Worth ₹40.38 Lakh",
            "Summary": "Emami Limited receives GST order from Bihar authorities demanding tax, interest, and penalty totaling ₹40.38 lakh over ITC discrepancies. Company plans to explore appeal options.",
            "Sentiment": "negative",
            "PublishDate": 1766214654393,
            "Source": "stocks"
        },
        {
            "Title": "Emami Ltd Gets CARE AA+ Rating Reaffirmed",
            "Summary": "CARE Ratings reaffirmed Emami Limited's CARE AA+ Stable/CARE A1+ rating for ₹168 crore bank facilities on December 17, 2025, citing strong FMCG presence and robust financial performance despite H1 FY26 moderation.",
            "Sentiment": "positive",
            "PublishDate": 1766142178356,
            "Source": "stocks"
        },
        {
            "Title": "Emami Ltd Sees Rs. 51.85 Crore Block Trade on NSE",
            "Summary": "Emami Ltd witnessed a block trade worth Rs. 51.85 crores involving approximately 1,000,358 shares at Rs. 518.35 per share on the NSE. The transaction represents a significant institutional or bulk investor activity in the company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1764918151335,
            "Source": "order&deals"
        },
        {
            "Title": "Diwakar Finvest Private Limited Files Disclosure Under SEBI Takeover Regulations",
            "Summary": "Diwakar Finvest Private Limited submitted a disclosure under SEBI's Substantial Acquisition of Shares and Takeover Regulations to stock exchanges NSE and BSE. The filing involves pledge and release of shares transactions with various lenders including Bajaj Finance Limited and IIFL Infrastructure Debt Fund.",
            "Sentiment": "neutral",
            "PublishDate": 1764651276247,
            "Source": "corporate_action"
        },
        {
            "Title": "Diwakar Finvest Releases Share Encumbrance on Emami Limited Shares",
            "Summary": "Diwakar Finvest Private Limited disclosed the release of share encumbrance under SEBI takeover regulations, with the release executed in favor of Aditya Dislaa Capital Limited. The disclosure affects Emami Limited shareholders and was filed with NSE and BSE as per regulatory requirements for substantial shareholding changes.",
            "Sentiment": "neutral",
            "PublishDate": 1763550666637,
            "Source": "corporate_action"
        },
        {
            "Title": "Emami Q2FY26 Revenue Drops 10% to ₹799 Crores Due to GST Rate Changes and Weather Impact",
            "Summary": "Emami Limited reported a 10% decline in consolidated revenue to ₹799 crores for Q2FY26, with domestic business falling 15% due to GST rate reduction disruptions and heavy rains affecting summer portfolio demand. The company declared an interim dividend of ₹4 per share (400%) and expects recovery in Q3 with winter loading resuming and normalized trade post-GST reforms.",
            "Sentiment": "neutral",
            "PublishDate": 1763115781388,
            "Source": "earnings"
        },
        {
            "Title": "Emami Expects Margin Growth in Q3 with Strong Performance Outlook",
            "Summary": "Emami management expects margin growth in Q3 with better EBITDA and net margins. The company predicts strong growth in Q3, anticipating high single to double digit increase, driven by winter season recovery and normalization after GST changes. Management expressed optimism about FY27 performance improving compared to FY26, attributed to GST rate cuts and a lower starting point in summer portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1762832740703,
            "Source": "earnings"
        },
        {
            "Title": "Emami Limited Reports Strong Q2 Results, Declares Rs 4 Per Share Interim Dividend",
            "Summary": "Emami Limited's Board approved unaudited financial results for the quarter and half-year ended September 30, 2025. The company declared a first interim dividend of Rs 4 per equity share (400%) for financial year 2025-26, payable on or before December 9, 2025, with November 14, 2025 as the record date. The dividend will be paid on 43.65 crore equity shares. During the period, the company converted loan receivables into equity investments in subsidiaries Brillare Science Limited (Rs 2,153 lacs) and Helios Lifestyle Limited (Rs 855 lacs). Additionally, Emami converted Rs 820 lacs of loan receivables into Optionally Convertible Debentures of Cannis Lupus Services India Private Limited and made further investments of Rs 400 lacs in the same entity. The company's Assam manufacturing facility continues to benefit from income tax advantages under section 80IE, resulting in MAT credit recognition of Rs 3,775 lacs for the six-month period.",
            "Sentiment": "positive",
            "PublishDate": 1762806578134,
            "Source": "earnings"
        },
        {
            "Title": "Emami Reports Decline in Quarterly Financial Performance, Announces Dividend",
            "Summary": "Emami reported quarterly revenue of 7.98 billion rupees, down from 8.9 billion rupees in the same period last year. The company's consolidated net profit fell to 1.5 billion rupees from 2.1 billion rupees year-over-year. EBITDA decreased to 1.78 billion rupees compared to 2.5 billion rupees previously, with EBITDA margin contracting to 22.36% from 28.12%. Despite the decline in financial metrics, the company announced it would approve a dividend of 4 rupees per share.",
            "Sentiment": "negative",
            "PublishDate": 1762764180791,
            "Source": "earnings"
        },
        {
            "Title": "India Ratings Assigns IND AA/Stable Rating to Emami's INR 1,800 Million Bank Loan Facilities",
            "Summary": "India Ratings and Research has assigned IND AA/Stable/IND A1 rating to Emami Limited's bank loan facilities worth INR 1,800 million. The rating reflects Emami's strong business profile with leading market positions across niche product categories including Navratna (68% market share), Boro Plus (60% share), and Smart and Handsome (74% share). The company reported consolidated revenue of INR 38 billion in FY25, up from INR 35.8 billion in FY24, with EBITDA margins of 26.9%. Emami maintains a net cash position of INR 6.3 billion and has expanded its international business to 17% of revenue across over 70 countries. The rating agency highlighted the company's strong distribution network reaching 5.4 million outlets, healthy balance sheet with minimal debt, and focus on strategic acquisitions. Key challenges include susceptibility to competition in the FMCG sector and exposure to seasonal products which constitute 43% of the portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1761837139758,
            "Source": "corporate_action"
        },
        {
            "Title": "Diwakar Finvest Releases and Pledges Emami Shares with Multiple Lenders",
            "Summary": "Diwakar Finvest Private Limited disclosed share encumbrance activities involving Emami Limited shares on October 16-17, 2025. The company released 17,360 shares from pledge with Bajaj Finance Limited, then pledged 4,00,000 shares to Bajaj Finance Limited and 70,000 shares to HSBC InvestDirect Financial Services (India) Ltd. Post-transaction, Diwakar Finvest holds 9,87,94,786 shares representing 22.63% of Emami's total share capital. The total encumbered shares amount to 1,90,05,957 shares (4.35% of share capital). All transactions were conducted as per agreements with the respective lenders.",
            "Sentiment": "neutral",
            "PublishDate": 1761554139043,
            "Source": "corporate_action"
        },
        {
            "Title": "Diwakar Finvest Pledges 25,000 Emami Shares to HSBC InvestDirect",
            "Summary": "Diwakar Finvest Private Limited pledged 25,000 shares of Emami Limited to HSBC InvestDirect Financials Services (India) Ltd on October 7, 2025. The pledge represents 0.01% of Emami's total share capital and was made as per an agreement with the lender. Following this transaction, Diwakar Finvest's total pledged shares in Emami increased to 18,553,317 shares, representing 4.25% of the company's share capital. Diwakar Finvest holds 98,794,786 shares in Emami, which constitutes 22.63% of the total share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1760159784719,
            "Source": "corporate_action"
        },
        {
            "Title": "Emami Limited Schedules Board Meeting for November 10, 2025 to Consider Q2 Results and Interim Dividend",
            "Summary": "Emami Limited has scheduled a Board of Directors meeting for November 10, 2025, to consider and approve unaudited standalone and consolidated financial results for the second quarter ended September 30, 2025. The board will also consider declaring an interim dividend for the financial year 2025-26. The company's trading window for share dealings remains closed from October 1, 2025, and will continue until November 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760102746330,
            "Source": "corporate_action"
        },
        {
            "Title": "Diwakar Finvest Pledges Additional Emami Shares to Bajaj Finance",
            "Summary": "Diwakar Finvest Private Limited has pledged additional shares of Emami Limited to Bajaj Finance Limited in two separate transactions. On September 22, 2025, the company pledged 300,000 shares (0.07% of total share capital), bringing its total pledged shares to 18,048,317 shares (4.13%). On September 26, 2025, it pledged another 480,000 shares (0.11%), increasing the total pledged shares to 18,528,317 shares (4.24%). Diwakar Finvest holds 98,794,786 shares in Emami Limited, representing 22.63% of the total share capital. The pledging was done as per agreement with the lender.",
            "Sentiment": "neutral",
            "PublishDate": 1758949474327,
            "Source": "corporate_action"
        },
        {
            "Title": "Emami Plans International Expansion to Accelerate Growth",
            "Summary": "Emami Ltd announced plans to enter new overseas markets to accelerate international growth. Chairman R S Goenka reported that the company's international business achieved an 11% compound annual growth rate over five years. The company has expanded manufacturing operations in Bangladesh, Middle East and Africa. Goenka noted that improving economic conditions including tapering inflation, moderating interest rates and resilient rural sentiment will create a more favorable operating environment. Emami recorded revenue of Rs 3,809 crore for fiscal 2024-25 and aims to drive strong revenue growth through health and wellness segments.",
            "Sentiment": "positive",
            "PublishDate": 1756476697041,
            "Source": "stock"
        },
        {
            "Title": "Emami Ltd Sees Block Trade Worth Rs. 135.61 Crores on NSE",
            "Summary": "Emami Ltd witnessed a block trade on the National Stock Exchange involving approximately 2,300,402 shares at a price of Rs. 589.50 per share. The total transaction value amounted to Rs. 135.61 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1756106996066,
            "Source": "order&deals"
        },
        {
            "Title": "Emami Promoter Entities Release Pledged Shares Worth ₹996K from Multiple Lenders",
            "Summary": "Diwakar Finvest Private Limited and Suraj Finvest Private Limited released pledged shares of Emami Limited from three financial institutions. Diwakar Finvest released 500,000 shares (0.11% stake) from Bajaj Finance Limited and 296,000 shares (0.07% stake) from Aditya Birla Finance Ltd. Suraj Finvest released 200,000 shares (0.05% stake) from IndusInd Bank Limited. The releases occurred between August 12-14, 2025, as per agreements with the respective lenders. Post-release, Diwakar Finvest's encumbered shares reduced from 18.64 million to 17.85 million shares, while Suraj Finvest's encumbered holdings decreased from 5.75 million to 5.55 million shares. Diwakar Finvest holds 22.63% in Emami while Suraj Finvest holds 24.20%.",
            "Sentiment": "positive",
            "PublishDate": 1755606726965,
            "Source": "corporate_action"
        },
        {
            "Title": "Emami Focuses on Premium Products and Global Expansion Strategy",
            "Summary": "Emami is targeting growth through premium product offerings, expanding rural market reach, and pursuing global expansion. The company is focusing on healthy living products, online brands, and new product innovations as key strategies to drive revenue growth, enhance profitability, and build long-term value for stakeholders.",
            "Sentiment": "positive",
            "PublishDate": 1755528855885,
            "Source": "stock"
        },
        {
            "Title": "Emami Limited Reports Revenue of ₹3,809 Crore with 26.9% EBITDA Margin in Company Overview Presentation",
            "Summary": "Emami Limited submitted a corporate presentation detailing its performance and business overview. The personal care and healthcare company reported revenue of ₹3,809 crore with a 7.5% five-year CAGR and EBITDA margin of 26.9%. The company operates across multiple segments including Navratna Range (₹850 crore revenue), Pain Management Range (₹850+ crore), BoroPlus Range (₹600+ crore), Kesh King Range (₹300+ crore), and Male Grooming Range (₹200+ crore). Emami maintains market leadership positions in cool oils (67.5% volume share) and antiseptic creams (60.1% volume share). The company has presence across 145+ countries and reaches 5.4 million retail outlets in India. International business contributes 17% of revenue while acquired brands account for 28% of revenue. The debt-free company achieved ROE and ROCE of 33.4% and 32.6% respectively on adjusted PAT of ₹899 crore.",
            "Sentiment": "positive",
            "PublishDate": 1755512563820,
            "Source": "stock"
        },
        {
            "Title": "Emami Plans 10-12 New Male Grooming Product Launches to Revive Declining Segment",
            "Summary": "Emami Ltd. announced plans to launch 10-12 new male grooming products starting from the second quarter of fiscal 2026, following a 9% decline in the segment during quarterly results. The company's haircare brand Kesh King declined 5% while strategic investments reduced 4%. Management described the male grooming market as underexploited with huge potential, acknowledging that brand rejuvenation is required. The company is extending its 'Smart & Handsome' skin brightening cream into other male grooming categories and reimagining the Kesh King brand. The Man Company, Emami's male grooming brand, returned to growth in June 2025. For quarterly results, Emami reported revenue down 0.2% at Rs 904 crore, EBITDA down 1.1% at Rs 214 crore with margins at 23.7%, while net profit increased 7.6% to Rs 164 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1754709288084,
            "Source": "stock"
        },
        {
            "Title": "Emami Q1 Revenue Flat as Summer Portfolio Hit by Weather; Pain Management Grows 17%",
            "Summary": "Emami Limited reported flat revenue growth for the quarter ended June 30, 2025, as unusually soft summer conditions and early monsoons impacted consumption. The talcum powder and prickly heat powder category declined 17% due to shortened summer season, though this follows a 54% growth in the same quarter last year. Excluding talc and prickly heat powders, core domestic business delivered 6% revenue growth and 3% volume growth. Pain management range grew robustly by 17% due to early monsoons, while BoroPlus antiseptic creams grew 60%. Healthcare range maintained 4% growth, but Male Grooming declined 9% and Kesh King declined 5%. Gross margins expanded 170 basis points to 69.4%, while EBITDA declined marginally by 1% to INR 214 crores. Profit after tax grew 9% to INR 164 crores. International business grew modestly by 2% despite challenges in Bangladesh, with other markets growing around 14%. The company launched several product innovations and plans strategic transformations for Kesh King and Smart & Handsome brands. Quick commerce scaled rapidly at nearly 3x year-on-year growth.",
            "Sentiment": "neutral",
            "PublishDate": 1754315158593,
            "Source": "earnings"
        },
        {
            "Title": "Emami Expects Stable Costs and Margin Optimism Despite Talc Segment Challenges",
            "Summary": "Emami anticipates no major cost increases in the near term and remains optimistic about margins. The company faced challenges in Q1 and Q2 due to weakness in its talc business segment. However, Emami maintains a positive outlook on its non-talc operations.",
            "Sentiment": "positive",
            "PublishDate": 1754019034818,
            "Source": "stock"
        },
        {
            "Title": "Emami Vice Chairman Emphasizes Focus on Sustained, Profitable Growth",
            "Summary": "Emami's Vice Chairman has affirmed the company's commitment to sustained and profitable growth moving forward.",
            "Sentiment": "positive",
            "PublishDate": 1753950089934,
            "Source": "stock"
        },
        {
            "Title": "Emami Limited Reports Q1 Results, Reappoints Two Directors and Names New Company Secretary",
            "Summary": "Emami Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of Rs 90,409 lacs compared to Rs 90,607 lacs in the same quarter last year. Consolidated profit after tax stood at Rs 16,426 lacs versus Rs 15,060 lacs in the previous year quarter. On standalone basis, revenue was Rs 75,646 lacs against Rs 75,530 lacs last year, with profit after tax of Rs 16,309 lacs compared to Rs 17,598 lacs. The Board reappointed Mohan Goenka as Vice-Chairman & Whole-time Director and Sushil Kumar Goenka as Whole-time Director, both for five-year terms starting January 2026 and April 2026 respectively, subject to shareholder approval. The company appointed Ravi Varma as Company Secretary & Compliance Officer effective August 1, 2025, replacing interim appointee Ashok Purohit.",
            "Sentiment": "neutral",
            "PublishDate": 1753949215026,
            "Source": "earnings"
        },
        {
            "Title": "Emami Reports Mixed Q1 Results with Higher Net Profit but Lower Revenue",
            "Summary": "Emami reported consolidated net profit of 1.64 billion rupees in Q1, up from 1.53 billion rupees in the same period last year. However, revenue declined to 9 billion rupees from 9.1 billion rupees year-over-year. EBITDA decreased to 2.14 billion rupees from 2.2 billion rupees, while EBITDA margin slightly compressed to 23.7% from 23.9% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1753948783055,
            "Source": "earnings"
        },
        {
            "Title": "Emami Launches Updated Corporate Identity with New Name Styles",
            "Summary": "Emami has launched an updated corporate identity featuring new unique name styles. The rebranding initiative is designed to showcase the company's changing vision and worldwide goals.",
            "Sentiment": "positive",
            "PublishDate": 1753876579034,
            "Source": "stock"
        },
        {
            "Title": "Emami Plans to Launch New Male Grooming Products",
            "Summary": "Emami has announced plans to introduce new male grooming products in the second quarter, according to a concall update. No specific details about the products or exact launch dates were provided in the given information.",
            "Sentiment": "positive",
            "PublishDate": 1747624573000,
            "Source": "default"
        },
        {
            "Title": "Emami Launches New Products and Sets Growth Expectations",
            "Summary": "Emami has launched new products in the pain management segment under the Zandu brand and plans to introduce one or two more offerings this year. The company expects mid-single digit growth overall, acknowledging challenges in repeating the base. For FY26, Emami anticipates high double-digit growth in both Brillare and The Man Company (TMC) businesses.",
            "Sentiment": "positive",
            "PublishDate": 1747624550000,
            "Source": "default"
        },
        {
            "Title": "Emami Ltd: Q4 Profit Up 9%, Declares Special Dividend",
            "Summary": "Emami Ltd reported Q4FY25 net profit of ₹162 crore, up 8.7% YoY. Revenue grew 8.1% to ₹963 crore. EBITDA increased 4.1% to ₹219.4 crore. The company declared a special dividend of ₹2 per share for its 50th year.",
            "Sentiment": "positive",
            "PublishDate": 1747389545000,
            "Source": "earnings"
        },
        {
            "Title": "Emami Reports Q4 Financial Results and Dividend Declaration",
            "Summary": "Emami has announced its Q4 financial results. The company's EBITDA increased to 2.2 billion rupees from 2.1 billion rupees year-over-year. However, the EBITDA margin decreased to 22.79% from 23.67% in the same period. Revenue grew to 9.6 billion rupees from 8.9 billion rupees year-over-year. Consolidated net profit rose to 1.62 billion rupees from 1.5 billion rupees year-over-year. Additionally, Emami declared a dividend of 2 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747385688000,
            "Source": "result"
        },
        {
            "Title": "Emami Ltd: Q4 Revenue Expected to Decline, Summer Portfolio to Drive Growth",
            "Summary": "Emami Ltd's Q4 results are expected to show a 10% YoY revenue decline to Rs 944 crore. Analysts predict 3-5% volume growth, driven by summer products. Ebitda may fall 34% YoY, with margin contraction due to promotional spending and employee costs. Rural demand shows gradual recovery, while urban demand remains weak.",
            "Sentiment": "neutral",
            "PublishDate": 1747295182000,
            "Source": "earnings"
        },
        {
            "Title": "Emami Ltd to Consider Q4 Results on May 16",
            "Summary": "Emami Ltd, an Indian consumer goods company, has announced that it will consider its fourth quarter (Q4) financial results on May 16. This is a standard corporate procedure where the company's board of directors will review and approve the financial statements for the last quarter of their fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1744205182000,
            "Source": "earnings"
        },
        {
            "Title": "Emami Ltd. Block Trade: 1.1 Million Shares Sold for Rs. 57.90 Crores",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) involving Emami Ltd. Approximately 1,099,783 shares of the company were traded at a price of Rs. 526.50 per share, resulting in a total transaction value of Rs. 57.90 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1741079764000,
            "Source": "block_deals"
        },
        {
            "Title": "Emami Ltd. Sees Block Trade of 378,216 Shares on NSE",
            "Summary": "A block trade of approximately 378,216 shares of Emami Ltd. was executed on the National Stock Exchange (NSE) at a price of Rs. 539.50 per share. The total value of the transaction amounted to Rs. 20.40 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1739951723000,
            "Source": "block_deals"
        },
        {
            "Title": "Emami Ltd: Q3 Profit Rises 8%, Revenue Up 5.3%, Declares Dividend",
            "Summary": "Emami Ltd reported Q3 FY25 net profit of Rs 278.99 crore, up 8% YoY. Revenue increased 5.3% to Rs 1,049.5 crore. EBITDA grew 6% to Rs 386.5 crore with margin at 36.8%. The company declared a second interim dividend of Rs 4 per share. Emami also completed acquisitions, including full ownership of Helios Lifestyle and increased stake in Cannis Lupus Services.",
            "Sentiment": "positive",
            "PublishDate": 1737985863000,
            "Source": "earnings"
        },
        {
            "Title": "Emami Declares Second Interim Dividend",
            "Summary": "Emami Limited has announced a second interim dividend of 4 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1737980306000,
            "Source": "corporate_action"
        },
        {
            "Title": "Emami Reports Q3 Financial Results",
            "Summary": "Emami Limited has announced its financial results for the third quarter. The company's consolidated net profit increased to 2.78 billion rupees, up from 2.6 billion rupees year-over-year and 2.12 billion rupees quarter-over-quarter. Revenue for Q3 rose to 10.5 billion rupees, compared to 9.96 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1737980158000,
            "Source": "earnings"
        },
        {
            "Title": "Emami Ltd: Rebrands 'Fair and Handsome' to 'Smart and Handsome' for Market Expansion",
            "Summary": "Emami Ltd has renamed its male grooming brand from 'Fair and Handsome' to 'Smart and Handsome' to tap into the growing male grooming market, expected to reach ₹32,000 crore. The company plans to introduce more face, body, and hair care products. Actor Kartik Aaryan is the new brand ambassador. Emami's male grooming portfolio currently contributes 10% of revenue, with potential to reach 15% within two years.",
            "Sentiment": "positive",
            "PublishDate": 1736422915000,
            "Source": "corporate_action"
        },
        {
            "Title": "Emami to Consider Q3 Results and Potential Dividend on January 27",
            "Summary": "Emami Limited has announced that it will hold a meeting on January 27 to review and consider its financial results for the third quarter. Additionally, the company will discuss the possibility of declaring a dividend during this meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1735297582000,
            "Source": "corporate_action"
        },
        {
            "Title": "Emami: Fined Rs 15 Lakh for Misleading 'Fair and Handsome' Ads",
            "Summary": "A district consumer forum in Delhi has imposed a Rs 15 lakh fine on Emami Ltd for unfair trade practices related to its 'Fair and Handsome' cream advertisements. The forum found the product claims to be deceptive and misleading, ordering Emami to discontinue the unfair practice and withdraw related packaging and advertisements.",
            "Sentiment": "negative",
            "PublishDate": 1733914188000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Emami: Q2 Results Show Seasonal Volatility",
            "Summary": "Emami's Q2 results have been reviewed by HDFC Securities, highlighting seasonal volatility in the company's performance.",
            "Sentiment": "neutral",
            "PublishDate": 1731295187000,
            "Source": "result"
        },
        {
            "Title": "Emami: Targets 10% Growth in Second Half, Optimistic About Winter Season",
            "Summary": "Emami's CEO of Finance, Naresh Bhansali, expects high single-digit growth for the current fiscal year, with a 10% growth target for the second half. The company reported a 19% YoY increase in Q2 net profit to Rs 213 crore and a 3% rise in revenue to Rs 891 crore. Gross margins improved by 60 basis points to 70.7% despite operational challenges.",
            "Sentiment": "positive",
            "PublishDate": 1731213831000,
            "Source": "result"
        },
        {
            "Title": "Emami Expects Stronger H2 FY25 Performance",
            "Summary": "Emami's Managing Director has expressed optimism for the second half of fiscal year 2025, anticipating stronger product offtakes. This expectation is based on projected improvements in urban demand and stable seasonal conditions.",
            "Sentiment": "positive",
            "PublishDate": 1731035892000,
            "Source": "normal_news"
        },
        {
            "Title": "Emami Expects Strong H2 Growth with Product Relaunch and Winter Portfolio",
            "Summary": "Emami's Co-Chairman expresses confidence in driving second-half growth, citing the Q3 relaunch of Fair and Handsome and focused efforts on Kesh King. The company anticipates strong performance from its winter portfolio due to a favorable winter forecast.",
            "Sentiment": "positive",
            "PublishDate": 1731035885000,
            "Source": "normal_news"
        },
        {
            "Title": "Emami: Q2 Profit Surges 31% Despite Muted Revenue Growth",
            "Summary": "Emami Ltd reported a 31% YoY increase in standalone net profit to Rs 214.1 crore in Q2, with revenue up 1.1% to Rs 709 crore. Domestic business grew 2.6% in value and 1.7% in volume, while international business grew 6%. High food inflation impacted mass consumer spending. The company increased its stake in The Man Company's Helios Lifestyle to 98.3%.",
            "Sentiment": "positive",
            "PublishDate": 1730991216000,
            "Source": "result"
        },
        {
            "Title": "Emami Announces Interim Dividend",
            "Summary": "Emami Limited has declared an interim dividend of 4 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1730978601000,
            "Source": "corporate_action"
        }
    ]
}