{
    "Symbol": "EMAMIREAL",
    "ISIN": "INE778K01012",
    "News": [
        {
            "Title": "Emami Realty Gets IND A-/Stable Rating Affirmation",
            "Summary": "India Ratings affirms Emami Realty's bank facilities at IND A-/Stable rating for ₹365 crores, reduced from ₹410 crores. Company notifies exchanges under Regulation 30 compliance.",
            "Sentiment": "positive",
            "PublishDate": 1768206683488,
            "Source": "stocks"
        },
        {
            "Title": "Emami Realty Board Approves Material Related Party Transactions with Two Companies",
            "Summary": "Emami Realty's Board of Directors approved related party transactions with Orbit Projects Private Limited and Swanhousing Infra Private Limited that exceed materiality thresholds under SEBI regulations. The company will seek shareholder approval through postal ballot and e-voting for these transactions.",
            "Sentiment": "neutral",
            "PublishDate": 1763554510675,
            "Source": "corporate_action"
        },
        {
            "Title": "Emami Realty Reports Net Loss of ₹65.58 Crores in Q2 FY26, Makes Impairment Provision of ₹55.88 Crores",
            "Summary": "Emami Realty Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported a standalone net loss of ₹65.58 crores for the quarter, compared to a loss of ₹13.21 crores in the same period last year. For the half-year period, the standalone net loss was ₹66.37 crores versus ₹27.21 crores in the previous year. On a consolidated basis, the quarterly net loss was ₹35.54 crores compared to ₹13.27 crores last year, while the half-year consolidated loss stood at ₹63.45 crores against ₹27.09 crores previously. The company made a significant impairment provision of ₹55.88 crores during the half-year period for loans given, based on assessment of realizable value. Revenue from operations remained minimal at ₹0.82 crores for the quarter. The company raised ₹103.31 crores through allotment of equity shares and warrants to promoter group entities in April 2025. Emami Realty operates in the real estate development segment.",
            "Sentiment": "negative",
            "PublishDate": 1763022808979,
            "Source": "earnings"
        },
        {
            "Title": "Emami Realty Appoints Two Senior Management Personnel",
            "Summary": "Emami Realty Limited has appointed two senior management personnel effective November 6, 2025. Jawahar Shaikh has been appointed as Head of Projects, bringing 29 years of experience including 13 years in the Middle East, with expertise in project lifecycle management and having directed projects exceeding USD 6 billion across diverse sectors. He holds a Bachelor of Engineering (Civil) degree and an MBA in Project Management and Construction Management. Tarun Kanti Mukherjee has been appointed as National Head - Sales Marketing, with over 25 years of experience in the real estate sector and an MBA in Marketing Finance completed in 1997. Mukherjee has demonstrated success in delivering multi-billion dollar residential, commercial, township and mixed-use developments across India, having worked with organizations including Hiranandani Communities, CapitaLand (India) Limited, and Adani Realty.",
            "Sentiment": "positive",
            "PublishDate": 1762468100688,
            "Source": "corporate_governance"
        },
        {
            "Title": "Emami Realty Shareholders Approve All Resolutions at 17th AGM, Re-appoint CEO for Five Years",
            "Summary": "Emami Realty Limited announced that all six resolutions were passed at its 17th Annual General Meeting held on September 24, 2025. Key approvals include the re-appointment of Dr. Nitesh Kumar Gupta as Managing Director & CEO for five years effective June 30, 2025, and the appointment of M/s. MKB & Associates as Secretarial Auditors for a five-year term from FY 2025-26 to FY 2029-30. The meeting was conducted through video conferencing with 83 shareholders attending virtually. Other approved resolutions included adoption of audited financial statements for the year ended March 31, 2025, re-appointment of director Mr. Basant Kumar Parakh, approval of related party transactions, and ratification of cost auditor remuneration for FY 2025-26. The company has 26,868 total shareholders on record date September 17, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758806031421,
            "Source": "corporate_action"
        },
        {
            "Title": "Emami Realty Appoints Priyankar Dasgupta as Vice President - Legal",
            "Summary": "Emami Realty Limited appointed Mr. Priyankar Dasgupta as Vice President - Legal effective August 19, 2025. Dasgupta holds an LL.B. degree from the University of Kolkata (1997) and a Post Graduate Diploma in Industrial Relations and Personnel Management from Bharatiya Vidya Bhavan (1993). He brings over 25 years of experience in legal practice and corporate legal affairs, including land acquisition, real estate regulatory compliance, litigation management, and corporate advisory. He previously held senior leadership positions at organizations including Siddha Group, Shrachi Group, DLF Universal Limited, Indus Towers Ltd, and Citigroup Global Services.",
            "Sentiment": "positive",
            "PublishDate": 1755608686991,
            "Source": "corporate_governance"
        },
        {
            "Title": "Emami Realty Reports Rs 5,079 Crore Loss in Q1 FY26, Approves Delisting from Calcutta Stock Exchange",
            "Summary": "Emami Realty Limited reported a standalone net loss of Rs 5,078.65 crore for the quarter ended June 30, 2025, compared to Rs 1,399.72 crore loss in the same quarter last year. Total revenue declined to Rs 1,415.69 crore from Rs 1,741.99 crore year-on-year. The company's board approved voluntary delisting from Calcutta Stock Exchange and appointed V.K. Jain & Co. as cost auditors for FY 2025-26. The company provided Rs 85 crore as impairment loss on loans given during the quarter. Basic earnings per share stood at negative Rs 11.85. The 17th Annual General Meeting has been scheduled for September 24, 2025, to be conducted through video conferencing.",
            "Sentiment": "negative",
            "PublishDate": 1754986506345,
            "Source": "earnings"
        },
        {
            "Title": "Emami Realty to Consider Equity Share or Convertible Security Issuance",
            "Summary": "Emami Realty has announced a board meeting scheduled for February 26 to discuss and potentially approve the issuance of equity shares or convertible securities. This decision could have significant implications for the company's capital structure and funding strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1740138506000,
            "Source": "corporate_action"
        },
        {
            "Title": "Emami Realty: Stock Surges 28% in a Week on Ambitious Development Plans",
            "Summary": "Emami Realty's stock hit the 5% upper circuit for the fifth consecutive day, reaching a seven-week high of ₹123.17. The company plans to develop 22 million sq ft of residential and commercial projects with an estimated revenue potential of ₹15,000 crore, investing approximately ₹10,000 crore across multiple states.",
            "Sentiment": "positive",
            "PublishDate": 1733300485000,
            "Source": "normal_news"
        },
        {
            "Title": "Emami Realty Launches Ultra-Luxe Residential Project",
            "Summary": "Emami Realty has unveiled a new luxury residential project called 'Emami Aamod Ultra Luxe Bespoke Residences'. The development aims to offer high-end city amenities while also providing the tranquility of a natural waterbody, combining urban comfort with natural surroundings.",
            "Sentiment": "positive",
            "PublishDate": 1732968648000,
            "Source": "corporate_action"
        },
        {
            "Title": "Emami Realty: Shares Surge on Rs 15,000 Crore Development Plan",
            "Summary": "Emami Realty Ltd. shares hit 5% upper circuit after announcing a Rs 15,000 crore revenue potential development plan. The company plans to invest Rs 10,000 crore in residential and commercial projects across India, with Rs 4,500 crore allocated for West Bengal and Rs 5,500 crore for other states.",
            "Sentiment": "positive",
            "PublishDate": 1732789343000,
            "Source": "corporate_action"
        },
        {
            "Title": "Emami Realty Plans 100 Billion Rupee Investment",
            "Summary": "Emami Realty Ltd has announced a total estimated investment of 100 billion rupees (approximately $1.2 billion USD). This significant investment plan suggests a major expansion or development project for the real estate company, though specific details about the investment's purpose or timeline were not provided in the brief news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1732785366000,
            "Source": "corporate_action"
        },
        {
            "Title": "Emami Realty Announces Ambitious Development Plan",
            "Summary": "Emami Realty Ltd has unveiled plans for a significant real estate development project. The company aims to develop 22 million square feet of property, which is expected to generate a potential revenue of 150 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1732785307000,
            "Source": "corporate_action"
        }
    ]
}