{
    "Symbol": "EMAMIPAP",
    "ISIN": "INE830C01026",
    "News": [
        {
            "Title": "Emami Paper Mills Board Meet on Feb 12 for Q3FY26",
            "Summary": "Emami Paper Mills Limited has scheduled a board meeting on February 12, 2026, to consider and approve unaudited financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770221468862,
            "Source": "co_actions_results"
        },
        {
            "Title": "Emami Paper Mills Appoints Sushil Kumar Khetan as CEO",
            "Summary": "Emami Paper Mills shareholders approve appointment of Sushil Kumar Khetan as Whole-time Director & CEO for 3 years through postal ballot. The seasoned CA brings 37+ years experience.",
            "Sentiment": "positive",
            "PublishDate": 1767960832886,
            "Source": "stocks"
        },
        {
            "Title": "Emami Paper Mills Appoints Sushil Kumar Khetan as CEO",
            "Summary": "Emami Paper Mills shareholders approve appointment of Sushil Kumar Khetan as Whole-time Director and CEO through postal ballot with 99.99% votes in favor. The appointment is effective from December 6, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767960342338,
            "Source": "co_actions_results"
        },
        {
            "Title": "Emami Paper Mills Seeks Shareholder Approval for Sushil Kumar Khetan's Appointment as Whole-time Director & CEO",
            "Summary": "Emami Paper Mills has initiated a postal ballot process for shareholders to approve the appointment and remuneration of Sushil Kumar Khetan as Whole-time Director and CEO for three years starting December 6, 2025, with a monthly salary of Rs. 8.20 lakh plus perquisites. The remote e-voting period runs from December 10, 2025, to January 8, 2026, with Khetan currently serving as CEO since September 2025 and bringing over three decades of experience in paper mill operations.",
            "Sentiment": "neutral",
            "PublishDate": 1765284346968,
            "Source": "corporate_action"
        },
        {
            "Title": "Emami Paper Mills Announces Leadership Changes and Preference Share Redemption",
            "Summary": "Emami Paper Mills' board approved the redemption of 4,80,000 preference shares worth Rs. 28.8 crores to promoter group companies, with redemption due on January 20, 2026. The company also witnessed key leadership transitions with Whole-time Director Vivek Chawla resigning and CEO Sushil Kumar Khetan being appointed as Additional Director and Whole-time Director, subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1764672293347,
            "Source": "corporate_governance"
        },
        {
            "Title": "Emami Paper Mills Reports Quarterly Results and Authorizes Key Personnel for Regulatory Disclosures",
            "Summary": "Emami Paper Mills Limited's Board of Directors approved unaudited financial results for the quarter and half year ended September 30, 2025. The company reported revenue from operations of ₹450.61 crores for the quarter compared to ₹459.76 crores in the previous quarter, with profit after tax of ₹6.58 crores versus ₹6.31 crores. For the half year, revenue stood at ₹910.37 crores with profit after tax of ₹12.89 crores. The company operates solely in the paper and paperboard segment including newsprint. The Board also authorized Key Managerial Personnel including Whole-time Director Vivek Chawla, CEO Sushil Kumar Khetan, CFO Mukesh Kumar Agarwal, and Company Secretary Debendra Banthiya for determining materiality of events and making regulatory disclosures. Additionally, the company extended the tenure of its Series II Tranche I preference shares by four years, reclassifying them as non-convertible non-cumulative preference shares.",
            "Sentiment": "neutral",
            "PublishDate": 1761901365928,
            "Source": "earnings"
        },
        {
            "Title": "Anti-Dumping Duties Imposed on Virgin Multi-Layer Paperboards from Chile and China",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has imposed anti-dumping duties on virgin multi-layer paperboards imported from Chile and China. This development affects Emami Paper Mills and the broader paperboard import market from these two countries.",
            "Sentiment": "neutral",
            "PublishDate": 1759202492312,
            "Source": "stock"
        },
        {
            "Title": "Emami Paper Mills Receives Extension of Court Order Restraining Arbitration Proceedings",
            "Summary": "Emami Paper Mills Limited received an extension of an interim court order from the Calcutta High Court restraining arbitration proceedings against the company. The court extended the order until December 24, 2025, preventing defendants from proceeding with arbitration before the London Maritime Arbitrators Association. This extends a previous order that was set to expire on November 11, 2025. The company stated there is no material impact on its financial operations or other activities due to this order.",
            "Sentiment": "neutral",
            "PublishDate": 1758622515870,
            "Source": "stock"
        },
        {
            "Title": "Emami Paper Mills Gets Extension of Interim Injunction Until November 2025",
            "Summary": "Emami Paper Mills Limited received an extension of an interim injunction from the Calcutta High Court. The court order, dated August 26, 2025, extends the injunction until November 11, 2025, or further orders, whichever is earlier. The injunction restrains defendants from proceeding with arbitration against the company before the London Maritime Arbitrators Association (LMAA) and prevents them from taking further steps in the arbitration proceeding. This extends a previous interim order that was set to expire on August 20, 2025. The company states that this court order has no material impact on its financial operations or other activities.",
            "Sentiment": "neutral",
            "PublishDate": 1756300895357,
            "Source": "stock"
        },
        {
            "Title": "Diwakar Finvest Withdraws Share Transfer Disclosure for Emami Paper Mills",
            "Summary": "Diwakar Finvest Private Limited, representing the promoter and promoter group of Emami Paper Mills Limited, has withdrawn their disclosure filed on August 21, 2025 regarding an inter-se transfer of shares. The acquirer and transferor have decided not to proceed with the proposed share transfer on the originally planned date. The company has assured that any future inter-se transfers will comply with all required formalities under relevant regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1756124665140,
            "Source": "corporate_action"
        },
        {
            "Title": "Emami Paper Mills Reports 69% Drop in Profit to ₹26 Crore for FY25 Amid Import Pressures",
            "Summary": "Emami Paper Mills Limited reported a profit after tax of ₹26.01 crore for FY 2024-25, down 69% from ₹84.30 crore in the previous year. Revenue declined 3.3% to ₹1,928.04 crore from ₹1,993.84 crore. EBITDA fell 38.56% to ₹147.55 crore. The company faced challenges from increased low-cost imports from China and ASEAN countries, which doubled over four years to 2.05 million tons. Despite difficulties, sales volume improved and export earnings grew 30% to ₹149 crore. The company expanded its value-added product portfolio, with specialty grades contributing 5% to revenues versus 2% previously. The Board recommended a dividend of ₹1.60 per equity share. The company maintained its credit rating at IND A-/Stable and reduced finance costs by 9%.",
            "Sentiment": "negative",
            "PublishDate": 1754921728926,
            "Source": "corporate_action"
        },
        {
            "Title": "Emami Paper Mills Shareholders Approve Re-appointment of Mamta Binani as Independent Director",
            "Summary": "Emami Paper Mills Limited shareholders approved the re-appointment of Smt. Mamta Binani as Independent Director for a second term of 5 consecutive years effective from August 13, 2025. The approval was obtained through postal ballot held on August 2, 2025. Binani, who holds DIN 00462925, is a B.Com and Law Graduate, Fellow Member of the Institute of Company Secretaries of India, and practices as an Advocate. She serves as a consultant on restructuring, corporate and legal matters and is a registered Insolvency Professional. Binani holds leadership positions including Vice President of Kolkata National Company Law Tribunal Bar Association and Chairperson of Merchant Chamber of Commerce-Legal Affairs Council. She has received multiple awards including the IWIRC Women of the Year in Restructuring (Asia) Award 2021 and AsiaOne Women Empowerment Principles Leadership Awards 2020-21. The company confirmed that Binani meets independence criteria under Section 149 of the Companies Act 2013 and is not related to any other company director.",
            "Sentiment": "positive",
            "PublishDate": 1754319172896,
            "Source": "corporate_governance"
        },
        {
            "Title": "Emami Paper Mills Reports 51% Decline in Quarterly Profit to ₹6.31 Crores",
            "Summary": "Emami Paper Mills Limited reported a profit after tax of ₹6.31 crores for the quarter ended June 30, 2025, compared to ₹12.80 crores in the same quarter last year, representing a 51% decline. Revenue from operations decreased to ₹459.76 crores from ₹503.69 crores year-over-year. The company's profit before tax also fell to ₹9.35 crores from ₹17.46 crores in the previous year quarter. Basic earnings per share dropped to ₹0.84 from ₹1.91 in the corresponding period. Total expenses decreased to ₹452.01 crores compared to ₹486.88 crores in the same quarter last year. The Board approved variation in terms of Tranche-I of Series-II Optionally Convertible Redeemable Preference Shares and its conversion into Non-Convertible Redeemable Preference Shares, subject to shareholder approval. The company operates in a single business segment of paper and paperboard including newsprint.",
            "Sentiment": "negative",
            "PublishDate": 1753787952075,
            "Source": "earnings"
        },
        {
            "Title": "Emami Paper Mills Reports Decline in Q1 Financial Performance",
            "Summary": "Emami Paper Mills reported quarterly revenue of 4.59 billion rupees, down from 5 billion rupees in the same period last year. The company's net profit fell to 63 million rupees compared to 128 million rupees year-over-year. EBITDA decreased to 377 million rupees from 433 million rupees, while EBITDA margin contracted to 8.2% from 8.6% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1753780252083,
            "Source": "earnings"
        },
        {
            "Title": "Emami Paper Mills Secures Temporary Injunction to Halt Arbitration Proceedings",
            "Summary": "Emami Paper Mills has obtained a temporary injunction that stops arbitration proceedings against the company. The company expects no major impact on its financial operations from this development.",
            "Sentiment": "positive",
            "PublishDate": 1753273657890,
            "Source": "stock"
        },
        {
            "Title": "Anti-dumping Probe on Virgin Multi-layer Paperboard Imports from Indonesia",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has initiated an anti-dumping investigation on Virgin Multi-layer Paperboard imports from Indonesia. This probe has been launched due to allegations that these imports are causing harm to local producers in India.",
            "Sentiment": "neutral",
            "PublishDate": 1751426386000,
            "Source": "default"
        },
        {
            "Title": "Emami Paper Mills Reports Q4 Results and Dividend",
            "Summary": "Emami Paper Mills has announced its Q4 financial results and dividend. The company's Q4 revenue decreased to 4.75 billion rupees from 4.84 billion rupees year-over-year. EBITDA fell to 311.1 million rupees from 700 million rupees, with the EBITDA margin dropping to 6.55% from 14.45%. Net profit declined to 39.2 million rupees from 272 million rupees year-over-year and 17 million rupees quarter-over-quarter. The company has recommended a dividend of 8 rupees per share.",
            "Sentiment": "negative",
            "PublishDate": 1747748705000,
            "Source": "result"
        },
        {
            "Title": "Emami Paper Mills Reports Significant Drop in Q3 Net Profit",
            "Summary": "Emami Paper Mills has reported a substantial decrease in its third-quarter net profit, which fell to 17 million rupees from 394 million rupees in the same period last year. The company's revenue also declined, dropping to 4.5 billion rupees from 5.15 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739492192000,
            "Source": "earnings"
        },
        {
            "Title": "Emami Paper Mills Reports Significant Decline in Q3 EBITDA",
            "Summary": "Emami Paper Mills has reported a substantial decrease in its third-quarter EBITDA, which fell to 293 million rupees from 809 million rupees year-over-year. The company's EBITDA margin also contracted sharply, dropping to 5.37% from 15.73% in the same period last year. This significant reduction in both EBITDA and EBITDA margin indicates a challenging quarter for the company's operational performance.",
            "Sentiment": "negative",
            "PublishDate": 1739454615000,
            "Source": "earnings"
        },
        {
            "Title": "Emami Paper Mills Reports Significant Decline in Q3 Profit and Revenue",
            "Summary": "Emami Paper Mills has reported a substantial decrease in both net profit and revenue for the third quarter. The company's net profit dropped to 17 million rupees from 394 million rupees in the same period last year. Revenue also declined to 4.5 billion rupees from 5.15 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739454610000,
            "Source": "earnings"
        },
        {
            "Title": "Emami Paper Mills Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Emami Paper Mills has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 372.6 million rupees, down from 500 million rupees in the same quarter last year. The EBITDA margin also decreased to 7.53% from 11.00% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730968582000,
            "Source": "result"
        },
        {
            "Title": "Emami Paper Mills Reports Q2 Revenue Growth",
            "Summary": "Emami Paper Mills has announced its second quarter revenue for the current fiscal year. The company reported revenue of 4.9 billion rupees, compared to 4.5 billion rupees in the same quarter of the previous year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730968384000,
            "Source": "result"
        },
        {
            "Title": "Emami Paper Mills Reports Decline in Q2 Net Profit",
            "Summary": "Emami Paper Mills has reported a net profit of 76 million rupees for the second quarter, down from 164 million rupees in the same period last year, representing a significant year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1730968367000,
            "Source": "result"
        }
    ]
}