{
    "Symbol": "EMBDL",
    "ISIN": "INE069I01010",
    "News": [
        {
            "Title": "Embassy Developments Grants Fresh Stock Options to Employees",
            "Summary": "Embassy Developments Limited approved fresh grant of 9,15,265 stock options and 7,25,301 performance stock units to eligible employees under its Employee Stock Option Scheme 2025, while noting lapse of earlier grants.",
            "Sentiment": "neutral",
            "PublishDate": 1770648098254,
            "Source": "co_actions_results"
        },
        {
            "Title": "Embassy Developments Q3FY26 Results Show Losses",
            "Summary": "Embassy Developments Limited reported standalone loss of Rs 739.63 millions for Q3FY26, with revenue dropping to Rs 405.22 millions. Consolidated loss reached Rs 2,337.17 millions.",
            "Sentiment": "negative",
            "PublishDate": 1770642592075,
            "Source": "co_actions_results"
        },
        {
            "Title": "Embassy Developments Allots ₹250 Cr NCDs",
            "Summary": "Embassy Developments Limited successfully allotted 25,000 non-convertible debentures worth ₹250 crores under first tranche of ₹400 crore issue on private placement basis with 11% annual coupon rate.",
            "Sentiment": "positive",
            "PublishDate": 1769771282971,
            "Source": "co_actions_results"
        },
        {
            "Title": "Embassy Developments strikes off two subsidiaries",
            "Summary": "Embassy Developments Limited has voluntarily struck off two non-operational wholly owned subsidiaries - Serpentes Constructions Limited and Albasta Developers Limited - to simplify corporate structure and reduce costs.",
            "Sentiment": "neutral",
            "PublishDate": 1769699847258,
            "Source": "co_actions_results"
        },
        {
            "Title": "Embassy Development Shares Pledged for ₹285 Crore Debentures",
            "Summary": "Catalyst Trusteeship discloses pledge of 10.31 crore Embassy Development shares to secure ₹255 crore Tranche I and ₹30 crore Tranche II debentures issued by Serenesummit Realty.",
            "Sentiment": "neutral",
            "PublishDate": 1769241104814,
            "Source": "co_actions_results"
        },
        {
            "Title": "Embassy Developments NCLAT hearing adjourned to Feb 5",
            "Summary": "Embassy Developments Limited informed exchanges that NCLAT proceedings scheduled for January 22, 2026 were adjourned due to time constraints. NCLT order remains stayed, company operations continue normally.",
            "Sentiment": "neutral",
            "PublishDate": 1769153884134,
            "Source": "stocks"
        },
        {
            "Title": "Embassy Developments expands into Mumbai with ₹12,000 cr GDV",
            "Summary": "Embassy Developments Ltd. announces three residential projects in Mumbai Metropolitan Region worth over ₹12,000 crore GDV, marking first residential developments under Embassy brand in the city.",
            "Sentiment": "positive",
            "PublishDate": 1768905514211,
            "Source": "stocks"
        },
        {
            "Title": "Embassy Developments Records ₹13.92b Q3 Pre-sales",
            "Summary": "Embassy Developments achieved significant pre-sales of ₹13.92 billion during the third quarter, demonstrating strong market performance in the real estate sector.",
            "Sentiment": "positive",
            "PublishDate": 1768176822497,
            "Source": "co_actions_results"
        },
        {
            "Title": "Embassy Developments Q3 pre-sales surge 240% QoQ",
            "Summary": "Embassy Developments reports strong Q3FY26 performance with pre-sales jumping 240% QoQ to ₹1,392 crore. Company receives RERA approvals for four projects worth over ₹12,800 crore GDV.",
            "Sentiment": "positive",
            "PublishDate": 1767968315297,
            "Source": "co_actions_results"
        },
        {
            "Title": "Embassy Developments Q3FY26 pre-sales surge 240% QoQ",
            "Summary": "Embassy Developments reports strong Q3FY26 pre-sales of ₹1,392 crore, up 240% QoQ, with RERA approvals for four projects worth over ₹12,800 crore GDV. Collections rise 15% to ₹415 crore.",
            "Sentiment": "positive",
            "PublishDate": 1767955888009,
            "Source": "stocks"
        },
        {
            "Title": "Embassy Developments shares pledged for ₹255 cr debentures",
            "Summary": "Catalyst Trusteeship Limited disclosed pledge of 4 crore Embassy Developments shares to secure ₹255 crore debenture issuance by Serenesummit Realty, increasing total encumbered shares to 10.31 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1767242211688,
            "Source": "co_actions_results"
        },
        {
            "Title": "Embassy Developments seeks removal from ASM Framework",
            "Summary": "Embassy Developments requests stock exchanges to remove its shares from Additional Surveillance Measure Framework after NCLAT stay order on bankruptcy proceedings, clarifying operational status.",
            "Sentiment": "positive",
            "PublishDate": 1765424995191,
            "Source": "stocks"
        },
        {
            "Title": "Embassy Developments Sells Over 450 Units Worth ₹860 Crore in Five Days",
            "Summary": "Embassy Developments achieved strong sales of over 450 residential units valued at approximately ₹860 crore during the launch of Embassy Greenshore project. The positive market response occurred within just five days for the 14-acre development featuring 878 apartments.",
            "Sentiment": "positive",
            "PublishDate": 1765185456883,
            "Source": "stock"
        },
        {
            "Title": "Embassy Developments Grants 1.37 Crore Stock Options and 75 Lakh Performance Stock Units to Employees",
            "Summary": "Embassy Developments Limited granted an aggregate of 1,37,26,627 stock options and 75,04,957 performance stock units to eligible employees under its Employee Stock Option Scheme-2025 after receiving in-principle approvals from NSE and BSE. The stock options will vest uniformly over 4 years while performance stock units will vest immediately upon meeting respective milestones between year 3 and 4, with each option convertible into one equity share of face value INR 2.",
            "Sentiment": "positive",
            "PublishDate": 1764779923292,
            "Source": "corporate_action"
        },
        {
            "Title": "Embassy Developments Limited Forfeits INR 132.49 Crores from Lapsed Convertible Warrants",
            "Summary": "Embassy Developments Limited reported that 4,75,27,464 convertible warrants issued to public shareholders have lapsed as warrant-holders failed to exercise their conversion rights within the prescribed period. The company forfeited INR 132,49,46,877.66 representing the 25% upfront consideration paid at the time of warrant allotment, in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764680425840,
            "Source": "corporate_action"
        },
        {
            "Title": "Embassy Developments Plans Six Housing Projects Worth ₹10,300 Crore in North Bengaluru",
            "Summary": "Embassy Developments announced plans to introduce six housing projects valued at ₹10,300 crore in North Bengaluru. The development represents a significant expansion initiative by the company in the residential real estate segment.",
            "Sentiment": "positive",
            "PublishDate": 1763968196748,
            "Source": "stock"
        },
        {
            "Title": "Embassy Developments Allots 4.14 Crore Equity Shares Worth INR 34.59 Crore Through Warrant Conversion",
            "Summary": "Embassy Developments Limited allotted 41,35,512 equity shares at INR 111.51 per share to three investors including Sankhya Financial Services Private Limited, Mr. Utpal Seth, and Mr. Vikas Khandelwal following warrant conversion on November 20, 2025. The allotment increased the company's paid-up equity share capital to INR 278.13 crore comprising 139.06 crore equity shares, with the new shares ranking equally with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763652951854,
            "Source": "corporate_action"
        },
        {
            "Title": "Embassy Developments Allots 4.82 Crore Equity Shares Through Warrant Conversion",
            "Summary": "Embassy Developments Limited allotted 48,22,891 equity shares at INR 111.51 per share following warrant conversion by Chanakya Corporate Services Private Limited and Mr. Manish Kumar Sinha, raising INR 40.34 crores. The allotment increased the company's paid-up equity share capital to INR 277.30 crores comprising 138.65 crore equity shares, with the new shares ranking equally with existing shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763375078862,
            "Source": "corporate_action"
        },
        {
            "Title": "Embassy Developments Reports 102% Jump in Quarterly Pre-Sales to ₹409 Crore",
            "Summary": "Embassy Developments Limited reported pre-sales of ₹409 crore for the quarter ended September 30, 2025, marking a 102% increase from the previous quarter's ₹198 crore. The company sold 407,000 square feet during the quarter, up 96% quarter-on-quarter. For the half-year period, pre-sales reached ₹607 crore, representing a 24% year-on-year growth. The company launched Embassy Paradiso in Bengaluru in September 2025, achieving 90% sales at launch with pre-sales of ₹183 crore. Embassy Developments completed delivery of two legacy projects to 1,000 families across MMR and Vizag during the half-year. The company received sanction for ₹1,370 crore in growth capital from Kotak Real Estate Fund to support upcoming launches. Collections for the quarter stood at ₹286 crore with a collection efficiency of 80%. The company has upcoming launches worth ₹28,000 crore GDV planned for FY2026, including 10 residential and 3 commercial projects. Net debt stands at ₹2,600 crore with a debt-to-equity ratio of 0.25x.",
            "Sentiment": "positive",
            "PublishDate": 1762485048780,
            "Source": "earnings"
        },
        {
            "Title": "Embassy Developments Reports No Deviations in ₹3,908 Crore Preferential Issue Fund Utilization",
            "Summary": "Embassy Developments Limited submitted its monitoring agency report for the quarter ended September 30, 2025, regarding the utilization of ₹3,908.14 crore raised through preferential issue. CARE Ratings Limited, serving as the monitoring agency, reported no deviations from stated objectives. The company has utilized ₹3,341.42 crore with ₹14.06 crore remaining unutilized. Major acquisitions including Embassy Residency, Embassy East Avenue, Embassy Eden, and Blu Annex FSI rights have been completed. The company issued 9.13 crore equity shares and 25.91 crore convertible warrants at ₹111.51 per share. During the quarter, 53.80 lakh warrants were converted to equity shares, with 6.61 crore warrants still pending conversion worth ₹552.66 crore. The monitoring agency noted that current share prices below warrant subscription price may impact future conversions of unexercised warrants.",
            "Sentiment": "neutral",
            "PublishDate": 1762449364027,
            "Source": "corporate_action"
        },
        {
            "Title": "Embassy Developments Reports Quarterly Loss, Board Decides Against ₹2,000 Crore Fund Raising",
            "Summary": "Embassy Developments Limited reported unaudited financial results for the quarter and half-year ended September 30, 2025. The company posted a net loss of ₹408.79 million for the quarter compared to a profit of ₹380.97 million in the previous year. Revenue from operations stood at ₹1,662.45 million for the quarter. The Board reviewed an enabling resolution approved by shareholders in March 2025 to raise funds up to ₹2,000 crore through equity shares and convertible securities via qualified institutional placement. After assessing the current business environment, financial position, and liquidity status, the Board decided not to implement the fund raising at this stage, keeping the resolution inoperative. The company maintains it has sufficient resources to meet operational and strategic requirements with adequate liquidity for ongoing obligations. The trading window for company securities remains closed until November 9, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762438247108,
            "Source": "earnings"
        },
        {
            "Title": "Embassy Developments Reports Widened Net Loss Despite Revenue Growth in Q2",
            "Summary": "Embassy Developments reported a net loss of 1.5 billion rupees in Q2, significantly higher than the 343 million rupee loss in the same period last year. Revenue increased to 4.9 billion rupees from 4.75 billion rupees year-over-year. The company's EBITDA shifted from a gain of 762 million rupees in the previous year to a loss of 523 million rupees in the current quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762437810250,
            "Source": "earnings"
        },
        {
            "Title": "Embassy Developments Allots 1.04 Crore Shares Worth ₹87.36 Crore Through Warrant Conversion",
            "Summary": "Embassy Developments has allotted 1.04 crore shares valued at ₹87.36 crore following the conversion of warrants. This share allotment represents a capital raising exercise through the conversion of existing warrants into equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1760352916428,
            "Source": "corporate_action"
        },
        {
            "Title": "Embassy Developments Completes Six Delayed Projects, Delivers Homes to 3,000 Families",
            "Summary": "Embassy Developments has completed six previously delayed real estate projects, providing housing solutions for 3,000 families. The company has obtained occupation certificates for these developments, marking a recovery in its stalled project portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1759742790029,
            "Source": "stock"
        },
        {
            "Title": "Bombay High Court Upholds Stay on MIDC Eviction Order Against Embassy Developments",
            "Summary": "The Bombay High Court upheld an interim order from Nashik Court that stayed an eviction order against Embassy Developments Limited and its subsidiary Indiabulls Industrial Infrastructure Limited. The eviction order was issued by the Executive Engineer of Maharashtra Industrial Development Corporation in relation to a Special Economic Zone development dispute. The court has directed MIDC to consider the revised plan submitted by the companies.",
            "Sentiment": "positive",
            "PublishDate": 1759333389281,
            "Source": "stock"
        },
        {
            "Title": "Embassy Developments' Paradiso Project in North Bengaluru Sells Out Completely for ₹204 Crore",
            "Summary": "Embassy Developments has completely sold out its new residential project called 'Paradiso' located in North Bengaluru. The project generated total revenue of ₹204 crore from the sales. The complete sellout indicates strong demand for the company's real estate offering in the North Bengaluru market.",
            "Sentiment": "positive",
            "PublishDate": 1757389022732,
            "Source": "stock"
        },
        {
            "Title": "Embassy Developments Board Recommends Director Re-appointments and Auditor Changes for AGM Approval",
            "Summary": "Embassy Developments Limited's board recommended several key appointments for shareholder approval at the upcoming Annual General Meeting. The board recommended re-appointing CEO and Executive Director Sachin Shah, who retires by rotation. Three Non-Executive Independent Directors - Javed Tapia, Shyamm Mariwala, and Tarana Lalwani - were recommended for re-appointment for second terms of 3 years each, with terms commencing from February 27, 2026 for Tapia and March 1, 2026 for Mariwala and Lalwani. The board also recommended re-appointing Agarwal Prakash & Co. as Statutory Auditors for a second 5-year term from FY 2026 to FY 2030, and appointing GDR & Partners LLP as Secretarial Auditors for 5 years from FY 2026 to FY 2030. Additionally, the board approved appointing Gurvinder Chopra & Co. as Cost Auditors for FY 2025-26. All director and auditor appointments require shareholder approval except the cost auditor appointment.",
            "Sentiment": "neutral",
            "PublishDate": 1756214557666,
            "Source": "corporate_governance"
        },
        {
            "Title": "Embassy Developments Allots 53.8 Lakh Equity Shares to Bellanza Developers Worth ₹45 Crore",
            "Summary": "Embassy Developments has allotted 53.8 lakh equity shares to Bellanza Developers through warrant conversion valued at ₹45 crore. This share allotment represents the conversion of existing warrants into equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1755698192004,
            "Source": "corporate_action"
        },
        {
            "Title": "Embassy Developments Targets Rs 560 Crore Revenue from Two Housing Project Management Deals",
            "Summary": "Embassy Developments Ltd signed agreements to manage development and marketing activities for two housing projects in Mumbai's Juhu area and Bengaluru's Hebbal location. The company expects Rs 560 crore revenue from these deals, representing a 10% development management fee on the projects' total estimated revenue of Rs 5,600 crore. The company reported a consolidated net loss of Rs 165.84 crore in the April-June quarter, compared to a net profit of Rs 122.49 crore in the same period last year. Total income increased to Rs 694.05 crore from Rs 557.52 crore year-over-year. Embassy Developments is the flagship company of Embassy Group, which also promotes WeWork India and sponsors Embassy Office Parks REIT.",
            "Sentiment": "neutral",
            "PublishDate": 1755598001786,
            "Source": "stock"
        },
        {
            "Title": "Embassy Developments Reports Monitoring Agency Update on ₹3,908 Crore Preferential Issue Fund Utilization",
            "Summary": "Embassy Developments Limited submitted a monitoring agency report from CARE Ratings Limited for the quarter ended June 30, 2025, regarding the utilization of funds raised through a preferential issue worth ₹3,908.14 crore. The company issued 9,13,55,606 equity shares and 25,91,19,201 warrants at ₹111.51 per share. As of June 30, 2025, the company had received ₹3,303.38 crore from the preferential issue, with ₹604.76 crore remaining to be received upon warrant conversion. The funds were utilized for various acquisitions including Embassy Residency (₹119.56 crore), Embassy East Avenue (₹117.28 crore), Embassy Eden (₹465.70 crore), FSI rights in Blu Annex (₹1,233.25 crore), discharge of obligations to Sky Forest Projects (₹86.71 crore), growth initiatives (₹491.47 crore), and general corporate purposes (₹562.12 crore). The monitoring agency reported no deviations from the disclosed objects, with ₹227.29 crore remaining unutilized and deployed in bank accounts and mutual funds. All major acquisitions were completed by May 2024, ahead of the October 2024 deadline.",
            "Sentiment": "neutral",
            "PublishDate": 1755174500485,
            "Source": "corporate_action"
        },
        {
            "Title": "Embassy Developments Reports 18% Pre-Sales Growth in Q1FY26, Adds Four New Projects Worth ₹2,830 Crore",
            "Summary": "Embassy Developments Limited reported pre-sales of ₹198 crore in Q1FY26, up 18% year-on-year from ₹167 crore. The company added four new projects with a total gross development value of ₹2,830 crore and development management fees of ₹560 crore, including developments in Whitefield Bengaluru, Juhu Mumbai, and North Bengaluru. Revenue increased 24% to ₹694 crore from ₹558 crore year-on-year, while EBITDA declined to ₹2 crore from ₹43 crore. The company reported a loss after tax of ₹166 crore compared to a profit of ₹121 crore in the previous year. Collections dropped to ₹322 crore from ₹459 crore year-on-year. The company delivered 1.3 million square feet across two projects and strengthened its capital structure through conversion of warrants, allotting 14.3 crore new shares to Blackstone, Microlabs and Embassy promoters. Embassy Developments maintains a pre-sales target of ₹5,000 crore for FY2026 with a launch pipeline exceeding ₹22,000 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1754926030778,
            "Source": "earnings"
        },
        {
            "Title": "Embassy Developments Reports Q1 Net Loss of 1.66B Rupees Despite Revenue Growth",
            "Summary": "Embassy Developments reported a consolidated net loss of 1.66 billion rupees in Q1, compared to a profit of 1.2 billion rupees in the same period last year. The company's revenue increased to 6.8 billion rupees from 4.9 billion rupees year-over-year, showing growth of approximately 39% despite the shift from profit to loss.",
            "Sentiment": "negative",
            "PublishDate": 1754923125262,
            "Source": "earnings"
        },
        {
            "Title": "Embassy Developments Acquires Squadron Developers",
            "Summary": "Embassy Developments has acquired a 100% stake in Squadron Developers for ₹456.61 crore. The acquisition represents a significant corporate action involving a complete takeover of Squadron Developers by Embassy Developments.",
            "Sentiment": "neutral",
            "PublishDate": 1750983010000,
            "Source": "default"
        },
        {
            "Title": "Embassy Developments Ltd: Signs ₹1,600 Crore Joint Development Deal in Bengaluru",
            "Summary": "Embassy Developments Ltd has entered a joint development agreement for a 17.9-acre land parcel in Whitefield, Bengaluru. The project has an estimated gross development value of ₹1,600 crore and will include 1,000 apartments across 1.6 million square feet. The residential development is set to launch in FY27, targeting young professionals and IT workers.",
            "Sentiment": "positive",
            "PublishDate": 1750661507000,
            "Source": "corporate_action"
        },
        {
            "Title": "Embassy Developments Signs Joint Development Agreement for Bengaluru Project",
            "Summary": "Embassy Developments has entered into a Joint Development Agreement for a 17.9-acre project in Whitefield, Bengaluru. The project has a reported Gross Development Value of ₹1,600 Crores.",
            "Sentiment": "positive",
            "PublishDate": 1750646392000,
            "Source": "default"
        },
        {
            "Title": "Embassy Developments Reports Q4 Profit of 1.2 Billion Rupees",
            "Summary": "Embassy Developments announced its Q4 financial results. The company reported a consolidated net profit of 1.2 billion rupees, compared to a loss of 990 million rupees in the same quarter last year and a loss of 212 million rupees in the previous quarter. Revenue for Q4 increased to 8.9 billion rupees from 3.8 billion rupees in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1748559761000,
            "Source": "default"
        },
        {
            "Title": "Embassy Developments Reports Q4 Financial Results",
            "Summary": "Embassy Developments announced its Q4 financial results. The company's EBITDA increased to 83 million rupees from 81 million rupees year-over-year. However, the EBITDA margin decreased to 0.93% from 2.13% in the same period last year. The consolidated net profit for Q4 was 1.2 billion rupees, compared to a loss of 990 million rupees in the previous year and a loss of 212 million rupees in the previous quarter. Q4 revenue significantly increased to 8.9 billion rupees from 3.8 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1748531306000,
            "Source": "result"
        },
        {
            "Title": "Embassy Developments Signs ₹1,125 Crore Land Deal with Lam Research in Bengaluru",
            "Summary": "Embassy Developments has entered into a significant land deal with Lam Research, a leading global semiconductor equipment manufacturer. The agreement involves 25 acres of land in Bengaluru, valued at ₹1,125 crore. This landmark deal represents a major investment in India's semiconductor industry and highlights Bengaluru's growing importance as a tech hub.",
            "Sentiment": "positive",
            "PublishDate": 1742516385000,
            "Source": "corporate_action"
        },
        {
            "Title": "Embassy Developments Signs ₹1,125 Crore Land Deal with Lam Research in Bengaluru",
            "Summary": "Embassy Developments has entered into a significant land agreement with Lam Research, a leading global semiconductor equipment manufacturer. The deal involves 25 acres of land in Bengaluru and is valued at ₹1,125 crore. This landmark transaction signifies a major investment in India's semiconductor industry infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1742479992000,
            "Source": "corporate_action"
        },
        {
            "Title": "Equinox India Developments Announces Major Expansion Plans",
            "Summary": "Equinox India Developments (EDL) has revealed plans for a significant expansion, with eight new projects worth Rs. 15,000 crore scheduled for fiscal year 2026. This ambitious growth strategy indicates the company's confidence in the Indian real estate market and its own capabilities to execute large-scale developments.",
            "Sentiment": "positive",
            "PublishDate": 1741064286000,
            "Source": "corporate_action"
        },
        {
            "Title": "Embassy Developments Limited Announces Leadership Changes and Growth Plans",
            "Summary": "Embassy Developments Limited has appointed Jitendra Virwani as Chairman and Aditya Virwani as Managing Director. The company has also announced growth initiatives and plans for fundraising, signaling a strategic shift in its leadership and future direction.",
            "Sentiment": "positive",
            "PublishDate": 1741064169000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Supreme Court Rejects Plea Against Embassy Group's Merger with Equinox India",
            "Summary": "The Supreme Court of India has rejected a plea challenging the merger scheme between Embassy Group and Equinox India. This decision follows the National Company Law Appellate Tribunal's (NCLAT) approval of the merger between the two entities. The rejection of the plea by the Supreme Court effectively clears a significant legal hurdle for the merger to proceed.",
            "Sentiment": "positive",
            "PublishDate": 1739173038000,
            "Source": "corporate_action"
        },
        {
            "Title": "Equinox India Achieves Significant Booking Value for Embassy Verde Project",
            "Summary": "Equinox India has reported a successful launch of its Embassy Verde project, achieving a booking value of ₹619 crores. The company sold 700 units within just 5 days of the project's launch. Additionally, Equinox India Developments will provide a corporate guarantee for 9.50 billion rupees in Non-Convertible Debentures (NCDs).",
            "Sentiment": "positive",
            "PublishDate": 1738284174000,
            "Source": "corporate_action"
        },
        {
            "Title": "Equinox India: Raises ₹950 Crore via NCD Issue for Real Estate Project",
            "Summary": "Equinox India Developments raised ₹950 crore through 48-month NCDs at 13% interest rate to fund Indiabulls Greens & Park in Panvel. The NCDs are backed by corporate guarantees and have an IVR A- (CE)/stable rating. The company recently underwent management changes and raised ₹3,911 crore via preferential allotment in April 2024.",
            "Sentiment": "positive",
            "PublishDate": 1738282481000,
            "Source": "corporate_action"
        },
        {
            "Title": "Equinox India to Provide Corporate Guarantee for 9.50 Billion Rupees NCDs",
            "Summary": "Equinox India Developments has announced that it will provide a corporate guarantee for Non-Convertible Debentures (NCDs) worth 9.50 billion rupees. This move suggests that Equinox India is backing a significant debt issuance, potentially to support business operations or expansion plans.",
            "Sentiment": "neutral",
            "PublishDate": 1738250622000,
            "Source": "corporate_action"
        },
        {
            "Title": "Equinox India Achieves ₹619 Crore Booking Value for Embassy Verde Project",
            "Summary": "Equinox India has reported a successful launch of their Embassy Verde project, achieving a booking value of ₹619 crores. The company managed to sell 700 units within just 5 days of the project's launch, indicating strong demand for their real estate offerings.",
            "Sentiment": "positive",
            "PublishDate": 1738242555000,
            "Source": "corporate_action"
        },
        {
            "Title": "Embassy Group Becomes New Promoter of Equinox India Developments",
            "Summary": "Equinox India Developments has announced that Embassy Group has acquired a 41.4% stake in the company, making it the new promoter. This significant change in ownership structure represents a major shift in the company's leadership and potentially its strategic direction.",
            "Sentiment": "neutral",
            "PublishDate": 1737978163000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Equinox India Completes Merger with Nam Estates",
            "Summary": "Equinox India has announced the successful completion of its merger with Nam Estates, an entity of Embassy Group. This corporate action represents a significant development for Equinox India, potentially impacting its market position and operational structure.",
            "Sentiment": "positive",
            "PublishDate": 1737936662000,
            "Source": "corporate_action"
        },
        {
            "Title": "Equinox India Completes Merger with NAM Estates",
            "Summary": "Equinox India Developments has announced the successful completion of its merger with NAM Estates, an entity of Embassy Group. The merger involves NAM Estates being incorporated into Equinox India, signifying a significant corporate restructuring event.",
            "Sentiment": "positive",
            "PublishDate": 1737729609000,
            "Source": "corporate_action"
        },
        {
            "Title": "Equinox India Developments: Baillie Gifford Acquires Over 6 Million Shares",
            "Summary": "UK-based FII Baillie Gifford has acquired voting rights for 6,000,000 equity shares of Equinox India Developments Limited on January 22, 2025, crossing the 2% threshold under Takeover Regulations. This acquisition, combined with previously held shares, increases Baillie Gifford's stake in the mid-cap realty company.",
            "Sentiment": "positive",
            "PublishDate": 1737702317000,
            "Source": "block_deals"
        }
    ]
}