{
    "Symbol": "EMCURE",
    "ISIN": "INE168P01015",
    "News": [
        {
            "Title": "Emcure Pharmaceuticals Reports Fire at Pune Plant",
            "Summary": "Emcure Pharmaceuticals experienced a fire incident at its Hinjawadi manufacturing plant on February 07, 2026, causing temporary operations disruption for 5-7 days with no casualties reported.",
            "Sentiment": "negative",
            "PublishDate": 1770482044570,
            "Source": "stocks"
        },
        {
            "Title": "Emcure Pharma Re-appoints 3 Independent Directors",
            "Summary": "Emcure Pharmaceuticals board approves re-appointment of three independent directors for second consecutive terms ranging from 3-5 years, effective April-June 2026, subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1770196325359,
            "Source": "stocks"
        },
        {
            "Title": "Emcure Pharmaceuticals Q3 Net Profit Jumps 49%",
            "Summary": "Emcure Pharmaceuticals reported consolidated net profit of ₹2.30 billion in Q3, marking a significant 49.35% year-on-year growth from ₹1.54 billion in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1770192571134,
            "Source": "co_actions_results"
        },
        {
            "Title": "Emcure Pharma Q3FY26 Earnings Call on Feb 4, 2026",
            "Summary": "Emcure Pharmaceuticals announces earnings call for February 4, 2026 at 4:00 PM IST to discuss Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769080080199,
            "Source": "co_actions_results"
        },
        {
            "Title": "Emcure Pharma Lock-in Expires, ₹5,862 Cr Worth Shares",
            "Summary": "Around 38 million shares or 20% of Emcure Pharmaceuticals' outstanding equity becomes tradeable as six-month lock-in period ends, valued at ₹5,862 crores based on Friday's closing price.",
            "Sentiment": "neutral",
            "PublishDate": 1768182011082,
            "Source": "stocks"
        },
        {
            "Title": "Emcure Gets USFDA NAI Classification for Gujarat Plant",
            "Summary": "Emcure Pharmaceuticals receives No Action Indicated (NAI) classification from USFDA for its Kadu, Gujarat manufacturing facility following inspection completion.",
            "Sentiment": "positive",
            "PublishDate": 1766494361826,
            "Source": "stocks"
        },
        {
            "Title": "Emcure Launches Poviztra® Weight Control Drug",
            "Summary": "Emcure Pharmaceuticals becomes first Indian company to launch Novo Nordisk's semaglutide injection for weight control, available in five strengths with starting price ₹8,790 per month.",
            "Sentiment": "positive",
            "PublishDate": 1766384369160,
            "Source": "stocks"
        },
        {
            "Title": "Emcure Allots 7,700 Equity Shares Under ESOP Scheme",
            "Summary": "Emcure Pharmaceuticals allotted 7,700 equity shares to employees under its ESOP scheme on December 16, 2025, increasing paid-up share capital to ₹189.57 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1765902539416,
            "Source": "co_actions_results"
        },
        {
            "Title": "GST Department Conducts Search at Emcure Pharmaceuticals Offices",
            "Summary": "The GST Department conducted a search operation at Emcure Pharmaceuticals' offices. The company stated that the search will have no material impact on its financials.",
            "Sentiment": "neutral",
            "PublishDate": 1764288401528,
            "Source": "stock"
        },
        {
            "Title": "Emcure Pharmaceuticals Company Secretary Chetan Sharma Resigns",
            "Summary": "Chetan Sharma has resigned from his position as Company Secretary and Compliance Officer at Emcure Pharmaceuticals Limited, effective November 24, 2025, to pursue opportunities outside the organization. The resignation affects a key managerial personnel position at the pharmaceutical company, requiring the company to find a replacement for this statutory role.",
            "Sentiment": "neutral",
            "PublishDate": 1763728695371,
            "Source": "corporate_governance"
        },
        {
            "Title": "Emcure Pharmaceuticals Shares Investor Presentation for November 2025 Conferences",
            "Summary": "Emcure Pharmaceuticals submitted an investor presentation to stock exchanges for upcoming investor conferences on November 19-20, 2025. The presentation highlights the company's INR 7,896 crore revenue, 18% growth, margin expansion, and strategic partnerships including deals with Sanofi India and Novo Nordisk for diabetes and weight loss products.",
            "Sentiment": "neutral",
            "PublishDate": 1763531387089,
            "Source": "corporate_action"
        },
        {
            "Title": "Emcure Pharmaceuticals Reports 13% Revenue Growth and Partners with Novo Nordisk for Semaglutide Launch",
            "Summary": "Emcure Pharmaceuticals delivered quarterly revenue growth of 13% to INR 2,270 crores with highest quarterly profits of INR 251 crores, representing 25% PAT growth driven by strong performance across domestic and international segments. The company announced an exclusive partnership with Novo Nordisk to launch Poviztra (semaglutide) for obesity treatment in India, targeting the 250 million obese/overweight population and positioning for early market entry ahead of patent expiry.",
            "Sentiment": "positive",
            "PublishDate": 1763378242217,
            "Source": "earnings"
        },
        {
            "Title": "Novo Nordisk India Cuts Wegovy Prices by 37%",
            "Summary": "Novo Nordisk India has reduced the prices of Wegovy by 37%. The price reduction affects the diabetes and weight management medication.",
            "Sentiment": "positive",
            "PublishDate": 1762917514356,
            "Source": "stock"
        },
        {
            "Title": "Emcure Pharma Reports Strong Q2 Growth with Revenue Rising to 22.7B Rupees",
            "Summary": "Emcure Pharma reported Q2 revenue of 22.7 billion rupees, up from 20 billion rupees in the same quarter last year. The company's consolidated net profit increased to 2.44 billion rupees compared to 1.9 billion rupees in the prior year period.",
            "Sentiment": "positive",
            "PublishDate": 1762848266509,
            "Source": "earnings"
        },
        {
            "Title": "Emcure Pharmaceuticals Partners with Novo Nordisk India as Sole Distributor for Weight Loss Drug",
            "Summary": "Emcure Pharmaceuticals has entered into a partnership with Novo Nordisk India to distribute Povitra® in India as a second brand of Wegovy®. Under this agreement, Emcure becomes the sole distributor for Semaglutide Injection 2.4 mg, which is used for weight loss treatment.",
            "Sentiment": "positive",
            "PublishDate": 1762754145967,
            "Source": "order&deals"
        },
        {
            "Title": "EMCURE Pharmaceuticals Receives Clean Bill After FDA Inspection at Kadu Facility",
            "Summary": "EMCURE Pharmaceuticals has received a clean bill following an FDA inspection at its Kadu facility. The inspection concluded without any regulatory concerns or violations being identified at the manufacturing site.",
            "Sentiment": "positive",
            "PublishDate": 1760084128095,
            "Source": "stock"
        },
        {
            "Title": "Emcure Pharma Acquires Remaining 20.42% Stake in Zuventus Healthcare",
            "Summary": "Emcure Pharma has acquired the remaining 20.42% stake in Zuventus Healthcare, making it a wholly owned subsidiary. This acquisition completes Emcure's full ownership of the healthcare company.",
            "Sentiment": "positive",
            "PublishDate": 1759499527145,
            "Source": "order&deals"
        },
        {
            "Title": "Emcure Pharmaceuticals Approves Incorporation of Wholly-Owned Subsidiary Emcure Wellness",
            "Summary": "Emcure Pharmaceuticals' Board of Directors approved the incorporation of a wholly-owned subsidiary named Emcure Wellness Private Limited in Pune, Maharashtra. The new entity will have an authorized share capital of Rs. 10 crores and initial paid-up capital of Rs. 1 lakh. The subsidiary will operate in the pharmaceuticals industry to manufacture, promote, sell and distribute pharmaceuticals and related products. Emcure will subscribe to 100% of the initial share capital through cash consideration at face value of Rs. 10 per share.",
            "Sentiment": "positive",
            "PublishDate": 1757146532783,
            "Source": "corporate_action"
        },
        {
            "Title": "Emcure Pharmaceuticals Reports Strong Q1 FY26 Results with 15.7% Revenue Growth and Record Quarterly Profit",
            "Summary": "Emcure Pharmaceuticals delivered robust quarterly results with revenue growing 15.7% year-on-year to INR 2,101 crores. The company reported its highest quarterly profit of INR 215 crores, representing 41% growth. EBITDA increased 20% to INR 404 crores with margins at 19.2%. Domestic business grew 9.4% to INR 995 crores, while international markets expanded 22% to INR 1,106 crores. Emerging markets showed impressive 42% growth to INR 360 crores. The company expanded its partnership with Sanofi, adding diabetes portfolio brands Amaryl and Cetapin worth INR 200 crores annually. Management outlined a 5-year vision focusing on innovation, partnerships, and geographical expansion, targeting growth 2% above industry rates. Key product developments include ongoing trials for Asparaginase and wet AMD treatments, with approvals expected this financial year. The company appointed R.S. Vasan as President - India business and remains insulated from US market risks with less than 3% exposure.",
            "Sentiment": "positive",
            "PublishDate": 1755082793114,
            "Source": "earnings"
        },
        {
            "Title": "Emcure Pharma Reports Strong Q1 Growth with Revenue Rising to 21B Rupees",
            "Summary": "Emcure Pharma delivered robust quarterly results with revenue increasing to 21 billion rupees from 18.15 billion rupees in the same period last year. The pharmaceutical company's consolidated net profit grew significantly to 2.15 billion rupees compared to 1.4 billion rupees year-over-year. EBITDA rose to 4.2 billion rupees from 3.37 billion rupees, while EBITDA margin improved to 19.8% from 18.6% in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754554060282,
            "Source": "earnings"
        },
        {
            "Title": "Emcure Pharmaceuticals Schedules Q1 FY26 Earnings Call for August 7, 2025",
            "Summary": "Emcure Pharmaceuticals Limited will hold an earnings call for investors and analysts on August 7, 2025, at 3:30 p.m. IST to discuss the company's unaudited financial results and performance for the quarter ended June 30, 2025. The call will cover both standalone and consolidated financial results. The transcript and audio recording will be made available on the company's website at www.emcure.com. Dial-in numbers have been provided for participants from various countries including India, Hong Kong, Singapore, UK, and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1753706321076,
            "Source": "earnings"
        },
        {
            "Title": "Emcure Pharma's Sanand Facility Passes FDA Inspection with Zero Observations",
            "Summary": "Emcure Pharmaceuticals has announced that the U.S. Food and Drug Administration (FDA) conducted a pre-approval inspection at the company's Sanand facility. The inspection concluded without the issuance of Form 483, indicating that there were zero observations or concerns raised by the FDA inspectors. This outcome is generally considered positive for pharmaceutical companies, as it suggests compliance with FDA regulations and good manufacturing practices.",
            "Sentiment": "positive",
            "PublishDate": 1752106190000,
            "Source": "default"
        },
        {
            "Title": "Emcure Pharmaceuticals: Ahmedabad Facility Passes US FDA Inspection",
            "Summary": "Emcure Pharmaceuticals' oncology manufacturing facility in Ahmedabad cleared a US FDA pre-approval inspection without any observations. The inspection was conducted at the GIDC plant in Sanand from June 30 to July 8, resulting in zero Form 483 observations.",
            "Sentiment": "positive",
            "PublishDate": 1752066189000,
            "Source": "normal_news"
        },
        {
            "Title": "US FDA Inspection at EMCURE Pharma's Sanand Facility Concludes with No Observations",
            "Summary": "EMCURE Pharma has reported that the United States Food and Drug Administration (US FDA) inspection at their Sanand facility has been completed. The inspection concluded with no observations noted, which is a positive outcome for the pharmaceutical company.",
            "Sentiment": "positive",
            "PublishDate": 1752064132000,
            "Source": "default"
        },
        {
            "Title": "Bain Capital Affiliate Sells 2.4% Stake in Emcure Pharmaceuticals",
            "Summary": "BC Investments IV, affiliated with Bain Capital, has sold a 2.4% stake in Emcure Pharmaceuticals through a block deal. The transaction involved 45.5 lakh shares sold at ₹1,262 per share, totaling ₹574 crore. The sale price was slightly below the floor price of ₹1,279.80 initially announced. Following the news, Emcure Pharmaceuticals' stock declined by 1.63%.",
            "Sentiment": "neutral",
            "PublishDate": 1751604991000,
            "Source": "block_deals"
        },
        {
            "Title": "Emcure Pharmaceuticals Ltd. Reports Block Trade of Rs. 572.94 Crores",
            "Summary": "A significant block trade has been reported for Emcure Pharmaceuticals Ltd. on the National Stock Exchange (NSE). The trade involved approximately 4,534,554 shares at a price of Rs. 1263.50 per share, totaling Rs. 572.94 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1751600730000,
            "Source": "block_details"
        },
        {
            "Title": "Emcure Pharmaceuticals: Bain Capital to Sell 2.4% Stake in ₹551 Crore Block Deal",
            "Summary": "Bain Capital-backed BC Investments IV is launching a block deal to sell 2.4% stake in Emcure Pharmaceuticals for ₹551 crore. The floor price is set at ₹1,279.80 per share. Emcure recently reported a 63% rise in Q4 PAT to ₹197 crore and 19.5% increase in revenue to ₹2,116 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1751562085000,
            "Source": "block_deals"
        },
        {
            "Title": "Emcure Pharmaceuticals: BC Investments to Sell 2.4% Stake in Block Deal",
            "Summary": "BC Investments plans to sell 45.5 lakh shares (2.4% stake) in Emcure Pharmaceuticals through a block deal on Friday. The offer price is Rs 1,225 per share, a 4% discount to the current market price, with a total offer size of Rs 551 crore. Kotak Securities will be the book runner for the deal.",
            "Sentiment": "neutral",
            "PublishDate": 1751556083000,
            "Source": "block_deals"
        },
        {
            "Title": "Emcure Pharmaceuticals: Acquiring Remaining 20% Stake in Zuventus Healthcare",
            "Summary": "Emcure Pharmaceuticals to acquire the remaining 20.42% stake in Zuventus Healthcare Ltd for Rs 724.9 crore, making it a wholly owned subsidiary. The transaction is expected to close in Q2 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1750515059000,
            "Source": "corporate_action"
        },
        {
            "Title": "Emcure Pharma Establishes New Subsidiary",
            "Summary": "Emcure Pharma has created a new fully-owned subsidiary called Emcure Lifesciences Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1750172116000,
            "Source": "default"
        },
        {
            "Title": "Emcure Pharmaceuticals Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 249,387 shares of Emcure Pharmaceuticals Ltd. took place on the National Stock Exchange (NSE) at a price of Rs. 1375.00 per share. The total value of the trade amounted to Rs. 34.29 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1749800705000,
            "Source": "block_details"
        },
        {
            "Title": "Emcure Pharmaceuticals: Q4 Profit Surges 64%, Announces Dividend",
            "Summary": "Emcure Pharmaceuticals reported a 64% increase in Q4 net profit to Rs 189 crore. Revenue rose to Rs 2,116 crore, with margins expanding to 19%. The company announced a dividend of Rs 3 per share and plans to incorporate a wholly-owned subsidiary, Emcure Generics Pvt.",
            "Sentiment": "positive",
            "PublishDate": 1747984758000,
            "Source": "earnings"
        },
        {
            "Title": "Emcure Pharmaceuticals: Kotak Raises Price Target by 39% Post Q4 Results",
            "Summary": "Kotak Institutional Equities increased its price target for Emcure Pharma to ₹1,625 from ₹1,515, maintaining a 'buy' rating. Emcure's Q4 results showed 19.5% YoY revenue growth and 29.5% YoY EBITDA increase. The stock hit a 10% upper circuit at ₹1,284.4, up 27% from its IPO price.",
            "Sentiment": "positive",
            "PublishDate": 1747975086000,
            "Source": "earnings"
        },
        {
            "Title": "Emcure Pharmaceuticals: Q4 Profit Surges 64%, Stock Rises 8%",
            "Summary": "Emcure Pharmaceuticals reported a 64% year-on-year increase in Q4 net profit to ₹189 crore. Revenue grew 20% to ₹2,116 crore. The board recommended a final dividend of ₹3 per share. Stock price rose 8% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1747906647000,
            "Source": "earnings"
        },
        {
            "Title": "Emcure Pharma Reports Q4 Financial Results",
            "Summary": "Emcure Pharma has announced its Q4 financial results. The company's EBITDA increased to 4.02 billion rupees from 3.10 billion rupees year-over-year. The EBITDA margin improved to 19.01% from 17.54% in the same period. Revenue rose to 21.2 billion rupees from 17.7 billion rupees. The consolidated net profit for Q4 grew to 1.9 billion rupees from 1.15 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747904415000,
            "Source": "result"
        },
        {
            "Title": "Emcure Pharmaceuticals: Q4 Results and FY25 Earnings Call Scheduled for May 22",
            "Summary": "Emcure Pharmaceuticals will announce Q4 and FY25 results on May 22. The board will consider final dividend recommendation. An earnings call is scheduled for the same day. Trading window for insiders is closed until May 24.",
            "Sentiment": "neutral",
            "PublishDate": 1747799461000,
            "Source": "corporate_action"
        },
        {
            "Title": "Emcure Pharma to Consider Q4 Results on May 22",
            "Summary": "Emcure Pharmaceuticals has announced that it will consider and approve its financial results for the fourth quarter on May 22.",
            "Sentiment": "neutral",
            "PublishDate": 1747148005000,
            "Source": "default"
        },
        {
            "Title": "Emcure Pharma Receives EIR from USFDA for API Facility",
            "Summary": "Emcure Pharmaceuticals has received an Establishment Inspection Report (EIR) from the U.S. Food and Drug Administration (USFDA) for its Active Pharmaceutical Ingredient (API) facility located in Kurkumbh, Pune. The facility has been classified as 'Voluntary Action Indicated' (VAI), which suggests that while some objectionable conditions were found, they do not warrant further regulatory action.",
            "Sentiment": "positive",
            "PublishDate": 1745194818000,
            "Source": "default"
        },
        {
            "Title": "Emcure Pharma Receives EIR from USFDA for API Facility",
            "Summary": "Emcure Pharmaceuticals has received an Establishment Inspection Report (EIR) from the U.S. Food and Drug Administration (USFDA) for its Active Pharmaceutical Ingredient (API) facility located in Kurkumbh, Pune. The facility has been classified as 'Voluntary Action Indicated' (VAI), which suggests that while some objectionable conditions were found, they do not warrant further regulatory action.",
            "Sentiment": "positive",
            "PublishDate": 1745063327000,
            "Source": "default"
        },
        {
            "Title": "Emcure's European Subsidiary Tillomed Acquires Pharma Portfolio from Manx",
            "Summary": "Emcure Pharmaceuticals' European subsidiary, Tillomed, has acquired a strategic pharmaceutical portfolio from Manx for approximately £19.7 million. This acquisition is likely aimed at expanding Tillomed's product offerings and market presence in Europe.",
            "Sentiment": "positive",
            "PublishDate": 1743749065000,
            "Source": "corporate_action"
        },
        {
            "Title": "Emcure's European Subsidiary Tillomed Acquires Pharma Portfolio from Manx",
            "Summary": "Emcure Pharmaceuticals' European subsidiary, Tillomed, has acquired a strategic pharmaceutical portfolio from Manx. This acquisition is likely aimed at expanding Tillomed's product offerings and strengthening its position in the European market.",
            "Sentiment": "positive",
            "PublishDate": 1743749005000,
            "Source": "corporate_action"
        },
        {
            "Title": "Emcure Pharmaceuticals: Subsidiary Partners with Italian Firm for Skin Tightening Product",
            "Summary": "Emcure Pharmaceuticals' subsidiary, Emcutix Biopharmaceuticals, has signed an exclusive agreement with Italian company WiQo to import and sell 'PRX-PLUS', a skin tightening product, in India. The partnership grants Emcutix rights to promote and distribute the non-invasive, painless treatment alternative. The Indian dermatology market is expected to reach $1.8 billion with 11-12% growth rate.",
            "Sentiment": "positive",
            "PublishDate": 1743506660000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gennova Biopharmaceuticals Secures $13.38 Million for Nipah Virus Vaccine Development",
            "Summary": "Gennova Biopharmaceuticals Ltd., a subsidiary of Emcure Pharma, has expanded its partnership with the Coalition for Epidemic Preparedness Innovations (CEPI). The collaboration involves funding of up to $13.38 million to advance the development of a self-amplifying mRNA (saRNA) vaccine targeting the Nipah virus.",
            "Sentiment": "positive",
            "PublishDate": 1743492578000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gennova Biopharmaceuticals Partners with CEPI to Develop Nipah Virus Vaccine",
            "Summary": "Gennova Biopharmaceuticals, a unit of Emcure Pharma, has entered into a partnership with CEPI (Coalition for Epidemic Preparedness Innovations) to develop an AI-enhanced self-amplifying mRNA vaccine against the deadly Nipah virus. This collaboration aims to leverage advanced technology to create a potentially life-saving vaccine for a serious viral infection.",
            "Sentiment": "positive",
            "PublishDate": 1743492570000,
            "Source": "corporate_action"
        },
        {
            "Title": "Emcure Pharmaceuticals' Subsidiary Signs Exclusive Licensing Deal with WIQO for Derma-Cosmetic Treatments in India",
            "Summary": "Emcutix, a subsidiary of Emcure Pharmaceuticals, has entered into an exclusive licensing partnership with WIQO, an Italian derma-cosmetic brand. This collaboration aims to introduce WIQO's innovative derma-cosmetic treatments to the Indian market, potentially revolutionizing skincare solutions for Indian consumers.",
            "Sentiment": "positive",
            "PublishDate": 1743492063000,
            "Source": "corporate_action"
        },
        {
            "Title": "Emcure Pharmaceuticals Expands Arth Range into Daily Supplements Market",
            "Summary": "Emcure Pharmaceuticals has announced its entry into the daily supplements market by expanding its Arth range of products. This move represents a strategic expansion of the company's product portfolio, potentially targeting a growing consumer base interested in daily health supplements.",
            "Sentiment": "positive",
            "PublishDate": 1741651532000,
            "Source": "corporate_action"
        },
        {
            "Title": "Emcure Pharmaceuticals Expands into Daily Supplements Market",
            "Summary": "Emcure Pharmaceuticals has announced its entry into the daily supplements space by expanding its Arth range of products. This move represents a strategic diversification for the company, potentially opening up new revenue streams in the growing health and wellness sector.",
            "Sentiment": "positive",
            "PublishDate": 1741606877000,
            "Source": "corporate_action"
        },
        {
            "Title": "USFDA Inspection Results in Two Observations for Emcure Pharmaceuticals",
            "Summary": "The U.S. Food and Drug Administration (USFDA) conducted an inspection at Emcure Pharmaceuticals' API manufacturing facility in Maharashtra, India. Following the inspection, the company received two observations in Form 483. Form 483 is issued by the USFDA when inspectors observe conditions that may violate the Food Drug and Cosmetic Act and related regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1740615420000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Emcure Pharmaceuticals: USFDA Issues Form 483 with Two Observations",
            "Summary": "The USFDA conducted a cGMP inspection of Emcure Pharmaceuticals' API plant in Pune from February 19-25, resulting in two observations in Form 483. The company plans to address these observations and respond within the stipulated timeframe.",
            "Sentiment": "neutral",
            "PublishDate": 1740566016000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Emcure Pharmaceuticals Ltd: Q3 Profit Surges 30%, Revenue Up 17.7%",
            "Summary": "Emcure Pharmaceuticals reported a 30.3% YoY increase in Q3FY25 net profit to ₹156 crore. Revenue grew 17.7% to ₹1,962.6 crore. EBITDA rose 15.5% to ₹354.5 crore, though margin slightly decreased to 18%. The company's diverse portfolio across multiple geographies contributes to its earnings stability.",
            "Sentiment": "positive",
            "PublishDate": 1738838779000,
            "Source": "earnings"
        }
    ]
}