{
    "Symbol": "EMIL",
    "ISIN": "INE02YR01019",
    "News": [
        {
            "Title": "Electronics Mart India Q3FY26 Call Audio Available",
            "Summary": "Electronics Mart India Limited has made available the audio recording of its Q3FY26 earnings conference call held on February 9, 2026, discussing financial performance for the third quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770643393047,
            "Source": "co_actions_results"
        },
        {
            "Title": "Electronics Mart Opens New Store in Telangana",
            "Summary": "Electronics Mart India Limited commenced commercial operations of new 8,190 sq ft Multi-Brand Store 'BAJAJ ELECTRONICS' in Telangana on January 24, 2026, expanding retail presence.",
            "Sentiment": "positive",
            "PublishDate": 1769251885420,
            "Source": "stocks"
        },
        {
            "Title": "Electronics Mart Opens New Store in Andhra Pradesh",
            "Summary": "Electronics Mart India Limited commenced commercial operations of a new 5,800 sq ft Multi Brand Store under the Bajaj Electronics brand in Pileru, Andhra Pradesh on January 14, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768392393993,
            "Source": "stocks"
        },
        {
            "Title": "Electronics Mart Board Grants Expansion Authority",
            "Summary": "Electronics Mart India's Board authorizes key individuals to explore organic growth and inorganic opportunities including acquisitions, joint ventures, and strategic alliances in India and overseas.",
            "Sentiment": "positive",
            "PublishDate": 1766746041565,
            "Source": "stocks"
        },
        {
            "Title": "Electronics Mart Opens New Delhi Store",
            "Summary": "Electronics Mart India Limited commenced commercial operations of a new 9,100 sq ft multi-brand store in North West Delhi on December 17, 2025, expanding its retail footprint.",
            "Sentiment": "positive",
            "PublishDate": 1765975945095,
            "Source": "stocks"
        },
        {
            "Title": "Electronics Mart India Gets Stable Credit Outlook",
            "Summary": "India Ratings revises Electronics Mart India's outlook to Stable from Positive while affirming IND A rating on bank loan facilities worth ₹8,030.65 million and ₹1,100 million.",
            "Sentiment": "neutral",
            "PublishDate": 1765456332263,
            "Source": "stocks"
        },
        {
            "Title": "Electronics Mart India Reports Q2 FY26 Results with Revenue Growth Amid Margin Pressures",
            "Summary": "Electronics Mart India Limited reported quarterly revenue of INR 1,591 crores with EBITDA margin of 5.1%, impacted by GST rate announcement-related discounting and rapid store expansion costs. The company operates 215 stores with mature stores (84 units) delivering 6.8% EBITDA margin while newer stores (131 units) operate at 3% margin, expecting gradual improvement as stores stabilize.",
            "Sentiment": "neutral",
            "PublishDate": 1763123788104,
            "Source": "earnings"
        },
        {
            "Title": "Electronics Mart India Reports Mixed Q2 Results with Revenue Growth but Margin Pressure",
            "Summary": "Electronics Mart India Limited reported revenue from operations of Rs. 1,591 crores for Q2, representing 19% growth. The company achieved same store sales growth of 11.4% and opened 8 net new stores during the quarter. However, EBITDA margin compressed to 5.1% from previous levels, and profit after tax was Rs. 16 crores with a 1.0% PAT margin. The company attributed margin pressure to GST-related slowdown in large appliances for 22 days and a shift in sales mix toward mobiles and IT devices. For the first half, revenue reached Rs. 3,330 crores with same store sales declining 4.8%. The company operates 215 stores across 95 cities and maintains partnerships with major brands. Average ticket size increased to Rs. 22,757. The company recovered losses from a fire incident through insurance and recorded an exceptional gain of Rs. 8 crores from the sale of Apple stores.",
            "Sentiment": "neutral",
            "PublishDate": 1762804962324,
            "Source": "earnings"
        },
        {
            "Title": "Electronics Mart Reports 34% Decline in Q2 Net Profit to 161M Rupees",
            "Summary": "Electronics Mart reported a net profit of 161 million rupees for Q2, down from 245 million rupees in the same period last year. The company's EBITDA decreased slightly to 816 million rupees from 824 million rupees year-over-year. EBITDA margin compressed to 5.13% compared to 6.17% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762761887656,
            "Source": "earnings"
        },
        {
            "Title": "Electronics Mart India Schedules Q2 FY26 Earnings Conference Call",
            "Summary": "Electronics Mart India Limited has announced an earnings conference call to discuss its un-audited financial results for the second quarter and first half-year ended September 30, 2025. The call is scheduled for November 10, 2025, at 5:00 PM IST. Key participants include CEO Karan Bajaj and CFO Premchand Devarakonda. The company has provided dial-in details for multiple regions including India, United States, United Kingdom, Singapore, and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1762294059841,
            "Source": "earnings"
        },
        {
            "Title": "Electronics Mart India Opens New 8,700 Sq Ft Store in Vijayawada",
            "Summary": "Electronics Mart India Limited commenced commercial operations of a new multi-brand store under the 'BAJAJ ELECTRONICS' brand on October 22, 2025. The store is located at Enikepadu, Vijayawada, Andhra Pradesh, spanning 8,700 square feet. This expansion adds to the company's retail footprint in the electronics segment.",
            "Sentiment": "positive",
            "PublishDate": 1761134670885,
            "Source": "stock"
        },
        {
            "Title": "Electronics Mart India Opens New 5,700 Sq Ft Bajaj Electronics Store in Andhra Pradesh",
            "Summary": "Electronics Mart India has commenced operations at a new Bajaj Electronics store in Bapulapadu, Andhra Pradesh. The new store spans 5,700 square feet, representing the company's retail expansion in the region.",
            "Sentiment": "positive",
            "PublishDate": 1760698948565,
            "Source": "stock"
        },
        {
            "Title": "Electronics Mart India Settles Fire Incident Claim for ₹75.4 Million with Insurance Company",
            "Summary": "Electronics Mart India has reported settling a fire incident claim with its insurance company for ₹75.4 million. The settlement relates to a fire incident that occurred at the company's operations.",
            "Sentiment": "neutral",
            "PublishDate": 1759232428619,
            "Source": "stock"
        },
        {
            "Title": "Electronics Mart India Launches New Multi-Brand Store in Andhra Pradesh",
            "Summary": "Electronics Mart India has launched a new 'Bajaj Electronics' multi-brand store in Chittoor, Andhra Pradesh. This represents the company's expansion of its retail footprint in the region.",
            "Sentiment": "positive",
            "PublishDate": 1758798547413,
            "Source": "stock"
        },
        {
            "Title": "Electronics Mart India Opens New 6,000 Sq Ft BAJAJ ELECTRONICS Store in Telangana",
            "Summary": "Electronics Mart India Limited commenced commercial operations of a new multi-brand store under the 'BAJAJ ELECTRONICS' brand on September 23, 2025. The 6,000 square feet outlet is located in Malreddypally Village, Tandur, K. V. Ranga Reddy, Telangana. This expansion represents the company's continued retail presence growth in the region.",
            "Sentiment": "positive",
            "PublishDate": 1758631693472,
            "Source": "stock"
        },
        {
            "Title": "Electronics Mart India Opens Three New Bajaj Electronics Stores in Andhra Pradesh and Telangana",
            "Summary": "Electronics Mart India Limited commenced commercial operations of three new Multi Brand Stores under the 'BAJAJ ELECTRONICS' brand on September 22, 2025. The stores are located in Mandapeta, Andhra Pradesh (5,700 square feet), Chilakaluripet, Andhra Pradesh (5,000 square feet), and Bachupally Village, Telangana (7,500 square feet). The expansion adds a total of 18,200 square feet of retail space across the two states.",
            "Sentiment": "positive",
            "PublishDate": 1758543850314,
            "Source": "stock"
        },
        {
            "Title": "Electronics Mart India Opens New 6,000 Sq Ft Store in Andhra Pradesh",
            "Summary": "Electronics Mart India Limited commenced commercial operations of a new multi-brand store under the 'BAJAJ ELECTRONICS' brand on September 18, 2025, in Adoni, Andhra Pradesh. The outlet spans 6,000 square feet and is located at NGOS Colony, expanding the company's retail footprint in the region.",
            "Sentiment": "positive",
            "PublishDate": 1758194708953,
            "Source": "stock"
        },
        {
            "Title": "Electronics Mart India Opens New Bajaj Electronics Store in Andhra Pradesh",
            "Summary": "Electronics Mart India Limited opened a new multi-brand store under the 'Bajaj Electronics' brand in Tadipatri, Andhra Pradesh. The 6,750 square feet store began commercial operations on September 9, 2025, located at C.B. Road, Tadipatri. This expansion increases the company's retail footprint in the region.",
            "Sentiment": "positive",
            "PublishDate": 1757425350683,
            "Source": "stock"
        },
        {
            "Title": "Electronics Mart India Opens New Bajaj Electronics Store in Nalgonda, Telangana",
            "Summary": "Electronics Mart India Limited has commenced commercial operations of a new multi-brand store under the 'BAJAJ ELECTRONICS' brand in Nalgonda, Telangana. The store spans 8,760 square feet and is located on Hyderabad Road. The company opened the outlet on September 7, 2025, expanding its retail footprint in the state.",
            "Sentiment": "positive",
            "PublishDate": 1757242083121,
            "Source": "stock"
        },
        {
            "Title": "Electronics Mart India Approves Annual Report and Appoints V'S S K & Associates as Secretarial Auditor for Five Years",
            "Summary": "Electronics Mart India Limited's Board of Directors met on August 28, 2025, and approved several key items. The Board approved the company's Integrated Annual Report for FY 2024-25, including the Board's Report and Business Responsibility and Sustainability Reporting. Following the Audit Committee's recommendation, the Board approved the appointment of V'S S K & Associates as Secretarial Auditor for five years from FY 2025-2026 to FY 2029-2030, subject to shareholder approval. The Board also approved holding the 7th Annual General Meeting on September 25, 2025, at 12:30 p.m. via video conferencing, with September 18, 2025, set as the cut-off date for determining eligible shareholders for remote e-voting and AGM attendance. V'S S K & Associates is a peer-reviewed practicing company secretaries firm registered with ICSI, offering services in management advisory, corporate taxation, statutory compliance, and audit assurance.",
            "Sentiment": "neutral",
            "PublishDate": 1756385437568,
            "Source": "corporate_action"
        },
        {
            "Title": "Electronics Mart India Sells Four IQ Apple Retail Stores for ₹8 Crores",
            "Summary": "Electronics Mart India Limited has sold four IQ retail stores located in Telangana and Andhra Pradesh to Angel Teletech Pvt. Ltd. for ₹8 crores. The stores being sold are IQ Attapur, IQ Madhapur in Telangana, and IQ Rajahmundry and IQ Kurnool in Andhra Pradesh. These IQ stores specialized in retail sales of Apple products. The sale agreement was signed on August 23, 2025, with completion expected by September 10, 2025. The company cited strategic realignment to focus on strengthening its own retail brands and innovative retail concepts as the primary reason for the disposal. The IQ division contributed ₹2.11 crores in revenue (0.89% of total revenue) and had a net worth of ₹0.69 crores (0.045% of total net worth) in the last financial year. Electronics Mart plans to focus on proprietary retail formats including Audio & Beyond, Easy Kitchen, and Kitchen Stories. Angel Teletech is described as a leading Apple Authorized Reseller operating exclusive outlets across Rajasthan under the iaccord brand since 2015.",
            "Sentiment": "neutral",
            "PublishDate": 1755966719810,
            "Source": "corporate_action"
        },
        {
            "Title": "Electronics Mart India Opens New 5,000 Sq Ft Bajaj Electronics Store in Andhra Pradesh",
            "Summary": "Electronics Mart India Limited commenced commercial operations of a new multi-brand store under the brand name 'Bajaj Electronics' on August 16, 2025. The store is located in Palasa, Andhra Pradesh, with a retail area of 5,000 square feet. The store operates under the company's trademark brand Bajaj Electronics.",
            "Sentiment": "positive",
            "PublishDate": 1755346701554,
            "Source": "stock"
        },
        {
            "Title": "Electronics Mart India Reports 6.3% EBITDA Margin Despite Weather-Hit Summer Quarter",
            "Summary": "Electronics Mart India Limited reported revenue of Rs. 1,739 crores for the first quarter ended June 30, 2025, with EBITDA of Rs. 110 crores and EBITDA margin of 6.3%. The company faced challenges from unusually cool summer weather and widespread rainfall during April and May, which significantly impacted air conditioner and cooler sales. Telangana saw 50% higher rainfall than normal in key AC sales months, while Andhra Pradesh recorded 148% increase in May rainfall. The company's store count reached 208 stores, adding 8 new stores during the quarter. North cluster showed improvement with 21% year-on-year growth and EBITDA margins rising to 3.6% from 2.6%. A fire incident at the Guntur warehouse caused Rs. 5 crores inventory damage, covered under insurance. Like-to-like sales growth was negative 18% for the quarter. The company maintains guidance for 15% revenue growth for the full year and plans to open 25-30 new stores in FY26. Management reported strong performance in July across categories and expects recovery in upcoming festive season.",
            "Sentiment": "neutral",
            "PublishDate": 1755009001346,
            "Source": "earnings"
        },
        {
            "Title": "Electronics Mart Reports Decline in Q1 Financial Performance",
            "Summary": "Electronics Mart reported Q1 revenue of 17 billion rupees, down from 19.7 billion rupees in the same period last year. The company's EBITDA fell to 1.1 billion rupees from 1.6 billion rupees year-over-year, with EBITDA margin declining to 6.33% from 8.3%. Net profit dropped significantly to 216 million rupees compared to 770 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754381221076,
            "Source": "earnings"
        },
        {
            "Title": "Electronics Mart India Schedules Q1 FY26 Earnings Conference Call for August 5, 2025",
            "Summary": "Electronics Mart India Limited has scheduled an earnings conference call on August 5, 2025, at 4:00 PM IST to discuss its un-audited financial results for the first quarter ended June 30, 2025. The call will be led by CEO Karan Bajaj and CFO Premchand Devarakonda. The company has provided dial-in details for participants from multiple countries including India, United States, United Kingdom, Singapore, and Hong Kong, with pre-registration available through a provided link.",
            "Sentiment": "neutral",
            "PublishDate": 1753797204201,
            "Source": "earnings"
        },
        {
            "Title": "Electronics Mart India: Q1 Growth Expected Despite AC Sales Slump",
            "Summary": "Electronics Mart India Ltd. anticipates higher single-digit growth in large appliances for Q1 FY26, despite weak AC demand. Strong sales in washing machines, refrigerators, and TVs are offsetting the AC slowdown. The company expects Q1 performance to surpass last year's. A recent fire at their Guntur godown is not expected to cause significant loss due to insurance coverage.",
            "Sentiment": "positive",
            "PublishDate": 1750483805000,
            "Source": "earnings"
        },
        {
            "Title": "Fire Accident at Electronics Mart India's Godown in Guntur",
            "Summary": "Electronics Mart India reported a fire accident at their godown in Guntur. The company estimates the damage to be between 60 million to 70 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1748507759000,
            "Source": "default"
        },
        {
            "Title": "Electronics Mart Reports Q4 Financial Results",
            "Summary": "Electronics Mart has released its Q4 financial results. The company's EBITDA for Q4 was 1.13 billion rupees, compared to 1.08 billion rupees in the same quarter last year. The EBITDA margin decreased to 6.63% from 7.06% year-over-year. Net profit for Q4 was 315 million rupees, down from 406 million rupees in the previous year. However, revenue increased to 17.2 billion rupees from 15 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747731086000,
            "Source": "result"
        },
        {
            "Title": "Electronics Mart India Opens New Bajaj Electronics Store in Telangana",
            "Summary": "Electronics Mart India has expanded its retail presence by opening a new 'Bajaj Electronics' multi-brand store in Nagaram, Telangana. The new store spans 7,200 square feet, offering customers a wide range of electronic products and appliances.",
            "Sentiment": "positive",
            "PublishDate": 1745073436000,
            "Source": "default"
        },
        {
            "Title": "Electronics Mart India: Margin Recovery Expected Through Product Mix Optimization",
            "Summary": "Electronics Mart India's CFO Premchand Devarakonda anticipates Ebitda margin recovery to 7% by the end of next financial year, with improvements starting in Q4. The company plans to open 30 new stores, including 6 in NCR, and may consider property acquisition for strategic locations.",
            "Sentiment": "positive",
            "PublishDate": 1739617447000,
            "Source": "earnings"
        },
        {
            "Title": "EMIL Revises FY25 Topline Growth Target Downward",
            "Summary": "EMIL (Essel Mining & Industries Limited) has significantly reduced its fiscal year 2025 topline growth target from 15% to 12%. This sharp downward revision indicates a more conservative outlook for the company's revenue growth in the coming financial year.",
            "Sentiment": "negative",
            "PublishDate": 1739425880000,
            "Source": "corporate_action"
        },
        {
            "Title": "Electronics Mart India: Q3 Profit Drops 31%, Revenue Up 5.37%",
            "Summary": "Electronics Mart India reported Q3 FY25 results with revenue of ₹1884.84 crore, up 5.37% YoY. Profit fell 31.07% YoY to ₹31.55 crore. QoQ performance improved with revenue up 35.98% and profit up 28.57%. EPS declined to ₹0.82. Analysts maintain Strong Buy ratings.",
            "Sentiment": "neutral",
            "PublishDate": 1739255634000,
            "Source": "earnings"
        },
        {
            "Title": "Electronics Mart Reports Q3 Revenue Growth",
            "Summary": "Electronics Mart has announced its third-quarter revenue results, reporting 18.8 billion rupees compared to 17.7 billion rupees in the same quarter of the previous year, indicating year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1739176391000,
            "Source": "earnings"
        },
        {
            "Title": "Electronics Mart Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Electronics Mart has reported a decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 990 million rupees from 1.15 billion rupees in the same quarter last year. Additionally, the EBITDA margin decreased to 5.25% from 6.45% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739176380000,
            "Source": "earnings"
        },
        {
            "Title": "Electronics Mart India Reports Q3 Net Profit Decline",
            "Summary": "Electronics Mart India Limited has reported a net profit of 316 million rupees for the third quarter, compared to 458 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1739176331000,
            "Source": "earnings"
        },
        {
            "Title": "Electronics Mart India: Ambitious Expansion Plans for Delhi-NCR",
            "Summary": "Electronics Mart India aims to increase revenue contribution from Delhi-NCR from 5% to 20% in three years. The company plans to add 25 stores annually, with 10 in NCR and 15 in the Southern cluster. CFO Premchand Devarakonda states that internal resources are sufficient for expansion without external funding. The company expects 15% year-on-year revenue growth through new store additions.",
            "Sentiment": "positive",
            "PublishDate": 1732941129000,
            "Source": "normal_news"
        },
        {
            "Title": "Electronics Mart India: Festive Sales Drive Double-Digit Growth, Wedding Season Promising",
            "Summary": "Electronics Mart India CFO reports double-digit growth from festive sales and expects strong performance in upcoming wedding season. Q2 sales were affected by monsoons and Shradh period. The company targets 8% same-store sales growth and 15% topline growth for the year. No plans for own e-commerce portal, but continues selling on Amazon and Flipkart.",
            "Sentiment": "positive",
            "PublishDate": 1731729324000,
            "Source": "normal_news"
        },
        {
            "Title": "Electronics Mart Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Electronics Mart has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 839 million rupees from 966 million rupees in the same quarter last year. Additionally, the EBITDA margin fell to 6.05% from 7.36% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731311550000,
            "Source": "result"
        },
        {
            "Title": "Electronics Mart Reports Q2 Revenue Growth",
            "Summary": "Electronics Mart has announced its second quarter revenue for the current fiscal year. The company reported revenue of 13.8 billion rupees, compared to 13.1 billion rupees in the same quarter of the previous year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731311531000,
            "Source": "result"
        },
        {
            "Title": "Electronics Mart Reports Q2 Net Profit Decline",
            "Summary": "Electronics Mart has reported a net profit of 245 million rupees for the second quarter, down from 374 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731311489000,
            "Source": "result"
        },
        {
            "Title": "Electronics Mart India Opens New Multi-Brand Store in Andhra Pradesh",
            "Summary": "Electronics Mart India has announced the commencement of commercial operations for a new multi-brand store located in Andhra Pradesh. This expansion represents a strategic move to strengthen the company's retail presence in the region.",
            "Sentiment": "positive",
            "PublishDate": 1729170193000,
            "Source": "corporate_action"
        }
    ]
}