{
    "Symbol": "EMKAY",
    "ISIN": "INE296H01011",
    "News": [
        {
            "Title": "Emkay Global Updates Fair Disclosure Code",
            "Summary": "Emkay Global Financial Services Limited has amended its Code of Practices and Procedures for Fair Disclosure of UPSI, approved by the Board on January 27, 2026, ensuring compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769519063390,
            "Source": "stocks"
        },
        {
            "Title": "Emkay Global Q3FY26 Results & Leadership Changes",
            "Summary": "Emkay Global Financial Services reports Q3FY26 financial results with consolidated net profit of ₹430.15 lakhs. Board approves appointment of Raunak Karwa as Whole Time Director and issues 4,420 NCDs worth ₹44.20 crores.",
            "Sentiment": "positive",
            "PublishDate": 1769501359520,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mahi Madhusudan Kela acquires 1.12% stake in Emkay Global",
            "Summary": "Prominent investor Mahi Madhusudan Kela acquired 1.12% stake in Emkay Global Financial Services during Q3, translating to 2.9 lakh equity shares amid recent stock underperformance.",
            "Sentiment": "neutral",
            "PublishDate": 1769417993176,
            "Source": "co_actions_results"
        },
        {
            "Title": "EMKAY Global Gets Approval for 278,300 Equity Shares",
            "Summary": "EMKAY Global Financial Services receives regulatory approval to list 278,300 equity shares following warrant conversion, expanding its equity base through the exercise of existing warrants.",
            "Sentiment": "positive",
            "PublishDate": 1768892585171,
            "Source": "co_actions_results"
        },
        {
            "Title": "Madhu Kela picks up 1.12% stake in Emkay Global",
            "Summary": "Veteran investor Madhu Kela acquired 1.12% stake in Emkay Global during Q3, while Dolly Khanna trimmed her holding to 2.3%. Stock closed 8% higher following the disclosure.",
            "Sentiment": "positive",
            "PublishDate": 1768570659559,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mahi Madhusudan Kela Acquires 1.12% Stake in Emkay",
            "Summary": "Prominent investor Mahi Madhusudan Kela's name appears in Emkay Global Financial Services with a 1.12% stake during Q3, marking a notable investment in the brokerage firm.",
            "Sentiment": "positive",
            "PublishDate": 1768555800303,
            "Source": "co_actions_results"
        },
        {
            "Title": "Emkay Global Appoints Ajay Mahajan as Independent Director",
            "Summary": "Emkay Global Financial Services successfully completed postal ballot process with 99.99% approval for appointing Mr. Ajay Mahajan as Independent Director. The e-voting concluded on January 9, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767965948156,
            "Source": "stocks"
        },
        {
            "Title": "Emkay Global Appoints Ajay Mahajan as Independent Director",
            "Summary": "Emkay Global Financial Services successfully completed postal ballot process with 99.99% shareholder approval for appointing Mr. Ajay Mahajan as Independent Director through remote e-voting.",
            "Sentiment": "positive",
            "PublishDate": 1767965405897,
            "Source": "co_actions_results"
        },
        {
            "Title": "Emkay Global sees steady Q3 growth for insurers",
            "Summary": "Life, general and health insurers expected to post healthy premium growth in Q3 FY26 despite margin pressures from GST ITC losses and higher commissions, according to Emkay Global report.",
            "Sentiment": "neutral",
            "PublishDate": 1767752789297,
            "Source": "stocks"
        },
        {
            "Title": "Emkay Global Allots ₹442 Cr NCDs for Growth",
            "Summary": "Emkay Global Financial Services allots 4,420 non-convertible debentures worth ₹442 crores with 2-year tenure for general corporate purposes and working capital requirements.",
            "Sentiment": "positive",
            "PublishDate": 1766054525098,
            "Source": "co_actions_results"
        },
        {
            "Title": "Emkay Global Seeks Shareholder Nod for Director Appointment",
            "Summary": "Emkay Global Financial Services initiates postal ballot for appointing Ajay Mahajan as Independent Director. Remote e-voting opens December 11, 2025 through January 9, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1765381924026,
            "Source": "stocks"
        },
        {
            "Title": "Emkay Global Seeks Shareholder Approval for Ajay Mahajan's Independent Director Appointment",
            "Summary": "Emkay Global Financial Services has issued a postal ballot notice seeking shareholder approval for appointing Ajay Mahajan as Independent Director for five years from December 1, 2025 to November 30, 2030. The remote e-voting period runs from December 11, 2025 to January 9, 2026, with results to be announced by January 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1765357588928,
            "Source": "corporate_action"
        },
        {
            "Title": "Emkay Global Financial Services Approves ₹54 Crore Non-Convertible Debentures Issue",
            "Summary": "Emkay Global Financial Services' Management Committee approved the issuance of 5,400 senior unsecured non-convertible debentures with face value of ₹1 lakh each, totaling ₹54 crore through private placement. The NCDs will be listed on BSE's Wholesale Debt Market Segment with proposed allotment on December 18, 2025, featuring a 2-year tenure with half-yearly interest payments and bullet repayment at maturity.",
            "Sentiment": "neutral",
            "PublishDate": 1765262644942,
            "Source": "corporate_action"
        },
        {
            "Title": "Emkay Global Financial Services Closes Trading Window for NCD Issuance",
            "Summary": "Emkay Global Financial Services has closed its trading window from December 5, 2025 for the second tranche of unsecured Non-Convertible Debentures issuance on private placement basis. The closure affects all designated persons, directors, promoters and employees who are prohibited from trading company securities until 48 hours after the Management Committee meeting outcome on December 9, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764846582434,
            "Source": "corporate_action"
        },
        {
            "Title": "Emkay Global Financial Services Reports Strong H1-FY26 Performance with 19% PAT Growth",
            "Summary": "Emkay Global Financial Services achieved operational revenue of INR 1,998 million in H1-FY26 with PAT margins of 16.89%, demonstrating strong growth across its capital markets, wealth management, and asset management verticals. The Mumbai-based financial services company, completing 30 years of operations, serves over 40,000 clients with total assets of INR 1,99,776 million and maintains research coverage of 200 companies.",
            "Sentiment": "positive",
            "PublishDate": 1764592009452,
            "Source": "stock"
        },
        {
            "Title": "Emkay Global Financial Services Appoints Ajay Mahajan as Independent Director",
            "Summary": "Emkay Global Financial Services Limited appointed Mr. Ajay Mahajan as Additional Director designated as Independent Director for a five-year term from December 1, 2025 to November 30, 2030, subject to shareholder approval. Mahajan brings over three decades of experience in banking, financial markets, credit ratings, and fintech, and currently serves on boards of multiple financial services companies including ASK Asset Management and FICC Capital.",
            "Sentiment": "positive",
            "PublishDate": 1764331650671,
            "Source": "corporate_governance"
        },
        {
            "Title": "Emkay Global Allots 26,789 Equity Shares Under ESOP Schemes, Increases Share Capital",
            "Summary": "Emkay Global Financial Services Limited allotted 26,789 equity shares (10,500 under ESOP 2007 and 16,289 under ESOP 2018) to employees who exercised stock options, while granting 10,000 new stock options under ESOP 2018. The allotment increased the company's paid-up equity share capital from 2,56,05,674 shares to 2,56,32,463 shares of Rs. 10 each, with exercise prices ranging from Rs. 72.40 to Rs. 75.60 per share.",
            "Sentiment": "positive",
            "PublishDate": 1764160497196,
            "Source": "corporate_action"
        },
        {
            "Title": "Emkay Global Reports ₹2,275 Million Capital Infusion in Q2 FY26 Amid Market Challenges",
            "Summary": "Emkay Global Financial Services received a significant capital infusion of ₹2,275 million during the quarter from Mr. Kirti Doshi through Antique Securities Private Limited, along with additional promoter participation. The company reported consolidated revenue of ₹771 million and PAT of ₹5 million for the quarter. PMS & AIF assets under management grew 25% year-on-year to ₹15,627 million, driven by strong performance of existing strategies and the newly launched Emkay SMID Cap Growth Engine, which garnered nearly ₹1,000 million within three months of launch. The company successfully transitioned from Self-Clearing Member to Clearing Member status across key exchange segments. During the quarter, Emkay organized its flagship conference Emkay Confluence 2025 with participation from 200 companies and 250 funds, facilitating over 5,000 meetings. The management noted challenging market conditions with Nifty 50 declining 3.20% during the quarter, but expressed optimism about potential India-US trade deal benefits and expects stronger recovery in the latter half of FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1761901355768,
            "Source": "earnings"
        },
        {
            "Title": "Emkay Global Financial Services Reports Sharp Decline in Q2 Revenue and Net Profit",
            "Summary": "Emkay Global Financial Services reported Q2 revenue of 721 million rupees, down from 1.1 billion rupees in the same period last year. The company's consolidated net profit dropped significantly to 4.6 million rupees compared to 259 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1761894899680,
            "Source": "earnings"
        },
        {
            "Title": "EMKAY Global Financial Services Receives Approval to Issue 9.5 Million Convertible Warrants Worth ₹227.52 Crore",
            "Summary": "EMKAY Global Financial Services has received approval to issue 9.5 million convertible warrants priced at ₹239.50 each. The total value of this warrant issuance amounts to ₹227.52 crore.",
            "Sentiment": "positive",
            "PublishDate": 1761302804589,
            "Source": "corporate_action"
        },
        {
            "Title": "Emkay Global Financial Services Shareholders Approve Articles Alteration and Convertible Warrants Issue",
            "Summary": "Emkay Global Financial Services Limited held an Extraordinary General Meeting on October 17, 2025, where shareholders passed two special resolutions. The first resolution approved alterations to the company's Articles of Association. The second resolution approved the issue and allotment of convertible warrants on a preferential basis. The meeting lasted 15 minutes, commencing at 11:30 a.m. and concluding at 11:45 a.m.",
            "Sentiment": "neutral",
            "PublishDate": 1760685255273,
            "Source": "corporate_action"
        },
        {
            "Title": "Emkay Global Financial Services Receives Equity Investment from Kirti Doshi",
            "Summary": "Emkay Global Financial Services Limited announced an equity investment by industry veteran Kirti Doshi. The company issued a press release titled 'Emkay Global Welcomes Equity Investment by Industry Veteran Kirti Doshi' and notified stock exchanges BSE and NSE about the development. The press release has been uploaded on the company's website.",
            "Sentiment": "positive",
            "PublishDate": 1758542999294,
            "Source": "stock"
        },
        {
            "Title": "Emkay Global Board Approves Rs 227 Crore Convertible Warrant Issue",
            "Summary": "Emkay Global Financial Services Limited's Board of Directors approved the issuance of up to 9.5 million convertible warrants at Rs 239.50 per warrant on a preferential basis, raising up to Rs 227.52 crores. The warrants can be converted to equity shares within 18 months of allotment. Three investors will participate: Antique Securities Private Limited (7.5 million warrants for Rs 179.62 crores), promoter Krishna Kumar Karwa (1.25 million warrants for Rs 29.94 crores), and promoter Prakash Kacholia (750,000 warrants for Rs 17.96 crores). The Board also approved amendments to the Articles of Association to enable further securities issuance. An Extraordinary General Meeting has been scheduled for October 17, 2025, to seek shareholder approval. The warrant price is above the calculated floor price of Rs 239.36 per equity share. Upon conversion, Antique Securities would hold 21.36% stake, while existing promoters Krishna Kumar Karwa and Prakash Kacholia would see their holdings adjust to 17.58% and 15.67% respectively.",
            "Sentiment": "positive",
            "PublishDate": 1758537305885,
            "Source": "corporate_action"
        },
        {
            "Title": "Emkay Global Financial Services Schedules Board Meeting to Consider Preferential Securities Issue",
            "Summary": "Emkay Global Financial Services Limited has scheduled a Board meeting on September 22, 2025 to consider raising funds through a preferential issue of securities to one or more persons. The proposal is subject to shareholder approval and compliance with SEBI regulations and the Companies Act, 2013. The company has closed its trading window for directors, promoters, designated persons, connected persons and their immediate relatives, which will remain closed until 48 hours after the meeting outcome is announced. The Board will also consider convening an Extraordinary General Meeting or Postal Ballot process to seek shareholder approval for the fund raising proposal.",
            "Sentiment": "neutral",
            "PublishDate": 1758108628450,
            "Source": "corporate_action"
        },
        {
            "Title": "Emkay Global Submits Investor Presentation Highlighting 30-Year Legacy and Strong Financial Performance",
            "Summary": "Emkay Global Financial Services Limited submitted its latest investor presentation to NSE and BSE. The Mumbai-based financial services company, established in 1995, operates across three business verticals: Capital Markets (56% revenue), Wealth Management (22% revenue), and Asset Management (7% revenue). The company reported operational revenue of INR 3,362 million in Q1-FY26 with PAT margins of 16.89%. Key highlights include 30 years of market presence, 19 branches across India, 500+ employees, total assets of INR 2,15,206 million, net worth of INR 3,097 million, and a client base of 38,800+. The company covers 200+ companies under research coverage and maintains ROE of 19% and 3-year revenue CAGR of 7%+. Recent achievements include executing a QIP worth INR 20,059 million for IREDA as Merchant Banker and expanding operations with a new office in Dubai. The presentation covers the company's comprehensive financial services including institutional equities, investment banking, asset management, and wealth management services.",
            "Sentiment": "positive",
            "PublishDate": 1757934423155,
            "Source": "stock"
        },
        {
            "Title": "Emkay Global Financial Services Reports 83% Drop in Quarterly Profit to Rs 275.88 Lakhs",
            "Summary": "Emkay Global Financial Services announced its quarterly results for the period ended June 30, 2025. The company reported a standalone profit after tax of Rs 275.88 lakhs, significantly down from Rs 1,353.46 lakhs in the same quarter last year. Total revenue from operations declined to Rs 6,530.45 lakhs from Rs 7,654.30 lakhs year-on-year. On a consolidated basis, the company posted a profit of Rs 478.30 lakhs compared to Rs 1,387.20 lakhs in the previous year quarter. The company's basic earnings per share dropped to Rs 1.09 from Rs 5.49 in the corresponding quarter. Employee benefits expense increased to Rs 3,756.79 lakhs from Rs 3,615.53 lakhs. The company granted 25,000 stock options to employees and allotted 1,15,180 equity shares during the quarter. ICRA Limited reaffirmed its BBB+ rating with positive outlook for the company's Non-Convertible Debentures.",
            "Sentiment": "negative",
            "PublishDate": 1754908961573,
            "Source": "earnings"
        },
        {
            "Title": "Emkay Global Announces Flagship Institutional Equities Conference for August 2025",
            "Summary": "Emkay Global Financial Services announced its flagship institutional equities conference, Emkay Confluence 2025, scheduled for August 12-14, 2025, in Mumbai. The event, themed 'India Ascending – The Next Leap', will feature over 200 companies and institutional investors, focusing on India's growth opportunities across sectors. The three-day conference expects over 3,000 business-investor meetings, main track sessions with high-profile speakers, and curated panel discussions on emerging themes. Managing Director Krishna Kumar Karwa emphasized the conference's dual focus on presenting diverse companies across sectors and sizes while ensuring top management representation for strategic insights. The event will bring together senior leaders, CXOs, fund managers, economists, and policy experts at the Trident, BKC, Mumbai.",
            "Sentiment": "positive",
            "PublishDate": 1754477248848,
            "Source": "stock"
        },
        {
            "Title": "Emkay Investment Managers: Launches SMID Cap Growth Engine Fund",
            "Summary": "Emkay Investment Managers has launched the 'Emkay SMID Cap Growth Engine Fund', targeting ₹500–1,000 crore AUM in FY26. The open-ended fund focuses on small- and mid-cap companies, available through AIF and PMS routes. It aims for long-term capital appreciation using a bottom-up stock-picking approach.",
            "Sentiment": "positive",
            "PublishDate": 1748938791000,
            "Source": "corporate_action"
        },
        {
            "Title": "Emkay Global Financial Services Reports Q4 Results and Dividend Recommendation",
            "Summary": "Emkay Global Financial Services has announced its Q4 consolidated net profit of 85 million rupees, compared to 106 million rupees year-over-year and 86 million rupees quarter-over-quarter. The company's Q4 revenue stood at 710 million rupees, down from 910 million rupees in the same quarter last year. Additionally, the company has recommended a dividend of 4 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747832640000,
            "Source": "result"
        },
        {
            "Title": "Emkay Mutual Fund Trustee Struck Off and Dissolved",
            "Summary": "Emkay Global Financial Services has announced that its unit, Emkay Mutual Fund Trustee, has been struck off and dissolved. This action suggests a significant change in the company's mutual fund operations or structure.",
            "Sentiment": "neutral",
            "PublishDate": 1741565333000,
            "Source": "corporate_action"
        },
        {
            "Title": "Emkay Global Financial Services Subsidiary Dissolved",
            "Summary": "Emkay Global Financial Services has announced that its subsidiary, Emkay Mutual Fund Trustee, has been struck off and dissolved. This indicates a significant change in the company's mutual fund operations or structure.",
            "Sentiment": "neutral",
            "PublishDate": 1741356647000,
            "Source": "corporate_action"
        },
        {
            "Title": "Emkay Global Financial Services Reports Q3 FY24 Financial Results",
            "Summary": "Emkay Global Financial Services has announced its Q3 consolidated financial results. The company reported a net profit of 99 million rupees, which is lower compared to 123 million rupees in the same quarter last year (YoY) and 246 million rupees in the previous quarter (QoQ). However, the company's revenue increased to 718 million rupees from 691 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738239127000,
            "Source": "earnings"
        },
        {
            "Title": "Dolly Khanna Increases Stake in Emkay Global Financial",
            "Summary": "Investor Dolly Khanna has increased her stake in Emkay Global Financial by 0.28% during the third quarter. Following this increase, her total shareholding in the company now stands at 2.76%.",
            "Sentiment": "positive",
            "PublishDate": 1736900116000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dolly Khanna Increases Stake in Emkay Global Financial",
            "Summary": "Investor Dolly Khanna has increased her stake in Emkay Global Financial by 0.28% during the third quarter. Following this increase, Khanna's total shareholding in the company now stands at 2.76%.",
            "Sentiment": "positive",
            "PublishDate": 1736859766000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Emkay Global Financial Services Reports Strong Q2 Results",
            "Summary": "Emkay Global Financial Services has reported a significant increase in both net profit and revenue for the second quarter. The company's net profit rose to 246 million rupees, up from 75 million rupees in the same period last year. Revenue also saw substantial growth, reaching 1 billion rupees compared to 635 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1730104927000,
            "Source": "result"
        },
        {
            "Title": "Dolly Khanna Increases Stake in Emkay Global Financial",
            "Summary": "<p>Investor <span class='neutral'>Dolly Khanna</span> has <span class='positive'>increased</span> her stake in <span class='neutral'>Emkay Global Financial</span> from <b>1.63%</b> to <b>2.48%</b> during the <span class='neutral'>second quarter</span> of the fiscal year.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728622168000,
            "Source": "normal_news"
        }
    ]
}