{
    "Symbol": "EMMBI",
    "ISIN": "INE753K01015",
    "News": [
        {
            "Title": "Emmbi Industries Appoints Mahipal Singh Chouhan as Company Secretary and Compliance Officer",
            "Summary": "Emmbi Industries Limited's Board of Directors appointed Mr. Mahipal Singh Chouhan as Company Secretary and Compliance Officer with effect from November 24, 2025. Chouhan, an Associate Member of the Institute of Company Secretaries with over 9 years of experience in corporate law and regulatory compliance, has been designated as Key Managerial Personnel and authorized to make disclosures to stock exchanges regarding material events.",
            "Sentiment": "positive",
            "PublishDate": 1763984711107,
            "Source": "corporate_governance"
        },
        {
            "Title": "Emmbi Industries Reports Mixed Quarterly Performance with Revenue Growth but Profit Decline",
            "Summary": "Emmbi Industries announced unaudited financial results for the quarter ended September 30, 2025, showing revenue growth to Rs. 1,221.62 million but net profit declined to Rs. 28.63 million compared to previous periods. The company's board meeting on November 14, 2025, approved both standalone and consolidated results, with basic earnings per share at Rs. 1.54 for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1763120591128,
            "Source": "earnings"
        },
        {
            "Title": "Emmbi Industries Approves Formation of Wholly Owned Subsidiary in UAE for FIBC Manufacturing",
            "Summary": "Emmbi Industries Limited's Board of Directors approved the formation and incorporation of a wholly owned subsidiary named Zastian EZ-LLC in Ras Al Khaimah, United Arab Emirates. The subsidiary will be registered with the Ras Al Khaimah Economic Zone Authority (RAKEZ) and will carry out the business of manufacturing FIBC Jumbo Bags. The board meeting was held on October 17th, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760688741810,
            "Source": "corporate_action"
        },
        {
            "Title": "Emmbi Industries Reports 4% Increase in Quarterly Net Profit to Rs 16.99 Million",
            "Summary": "Emmbi Industries Limited reported net profit of Rs 16.99 million for the quarter ended June 30, 2025, compared to Rs 16.33 million in the previous quarter. Net sales decreased to Rs 1,041.63 million from Rs 1,075.17 million in the prior quarter. The company's profit before tax remained relatively stable at Rs 22.82 million versus Rs 22.59 million. Basic earnings per share stood at Rs 0.88 compared to Rs 0.91 in the previous quarter. The company received Rs 26 crore towards balance warrants for conversion of 566,667 warrants into equivalent equity shares during the quarter. The consolidated results include subsidiary companies Zastian PTE Limited (Singapore) and Zastian Europe GmbH (Germany). The company operates in a single segment of polymer-based products.",
            "Sentiment": "neutral",
            "PublishDate": 1754995494082,
            "Source": "earnings"
        }
    ]
}