{
    "Symbol": "EMMVEE",
    "ISIN": "INE1C6T01020",
    "News": [
        {
            "Title": "Emmvee Photovoltaic Power Submits Q3FY26 Monitoring Report",
            "Summary": "Emmvee Photovoltaic Power Limited submitted its Q3FY26 monitoring agency report showing utilization of Rs 1977.10 crore from its Rs 2143.86 crore IPO proceeds, with Rs 166.76 crore remaining unutilized.",
            "Sentiment": "neutral",
            "PublishDate": 1770730786691,
            "Source": "stocks"
        },
        {
            "Title": "Emmvee Gets Favorable GST Order, No Financial Liability",
            "Summary": "Emmvee Photovoltaic Power receives favorable order from Deputy Commissioner on GST matter involving ₹121.32 million discrepancies, concluding without any demand or financial liability.",
            "Sentiment": "positive",
            "PublishDate": 1770486205879,
            "Source": "stocks"
        },
        {
            "Title": "Emmvee Photovoltaic Gets Credit Rating Upgrade",
            "Summary": "ICRA upgrades Emmvee Photovoltaic Power's long-term credit rating from A-(Stable) to A(Stable) and reaffirms ratings for subsidiary Emmvee Energy Private Limited on January 23, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769167253065,
            "Source": "stocks"
        },
        {
            "Title": "Emmvee Photovoltaic Power Shares Q3FY26 Call Audio",
            "Summary": "Emmvee Photovoltaic Power Limited makes Q3FY26 earnings conference call audio recording available on company website following regulatory compliance under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768569992046,
            "Source": "co_actions_results"
        },
        {
            "Title": "Emmvee Photovoltaic Q3FY26 Results Show Strong Growth",
            "Summary": "Emmvee Photovoltaic Power reported robust Q3FY26 performance with revenue of ₹11,679 mn, EBITDA of ₹4,134 mn at 35.9% margin, and PAT of ₹2,636 mn. Company maintains strong order book of 9.3 GW.",
            "Sentiment": "positive",
            "PublishDate": 1768483200565,
            "Source": "co_actions_results"
        },
        {
            "Title": "Emmvee Q3 FY26: Revenue Jumps 118% YoY to ₹11,523 Cr",
            "Summary": "Emmvee Photovoltaic Power reports exceptional Q3 FY26 results with revenue rising 118% YoY to ₹11,523 crores. PAT surged 166% to ₹2,636 crores with expanded margins.",
            "Sentiment": "positive",
            "PublishDate": 1768482410374,
            "Source": "co_actions_results"
        },
        {
            "Title": "Emmvee Photovoltaic Power Q3FY26 Results Announced",
            "Summary": "Emmvee Photovoltaic Power Limited announced its Q3FY26 quarterly results for the quarter ended December 31, 2025, with consolidated revenue reaching ₹1,15,225.17 lakhs and net profit of ₹26,363.78 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1768472893452,
            "Source": "co_actions_results"
        },
        {
            "Title": "Emmvee Updates CIN Post Stock Exchange Listing",
            "Summary": "Emmvee Photovoltaic Power Limited announces Corporate Identification Number change from U26101KA2007PLC042197 to L26101KA2007PLC042197 following BSE and NSE listing compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1768466575399,
            "Source": "stocks"
        },
        {
            "Title": "Emmvee Photovoltaic Power Q3FY26 Earnings Call Jan 16",
            "Summary": "Emmvee Photovoltaic Power Limited announces Q3FY26 earnings conference call scheduled for January 16, 2026 at 4:00 PM IST via Microsoft Teams platform for investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1768315357490,
            "Source": "stocks"
        },
        {
            "Title": "Emmvee Photovoltaic shares surge 17% in 2 sessions",
            "Summary": "Emmvee Photovoltaic shares gained 17% over two sessions after Jefferies initiated coverage with Buy rating and ₹320 target price, citing strong growth visibility and attractive valuations.",
            "Sentiment": "positive",
            "PublishDate": 1767761837420,
            "Source": "stocks"
        },
        {
            "Title": "Emmvee Photovoltaic Surges on Jefferies Buy Rating",
            "Summary": "Jefferies initiates coverage on Emmvee Photovoltaic with buy rating and ₹320 price target, citing 73% upside potential as India's solar installations expected to grow at 24% CAGR over FY25-28.",
            "Sentiment": "positive",
            "PublishDate": 1767672843379,
            "Source": "stocks"
        },
        {
            "Title": "Emmvee Starts 2.5 GW Solar Module Production Unit",
            "Summary": "Emmvee Photovoltaic Power commences operations at its new 2.5 GW solar module manufacturing facility at Unit VI in Bengaluru, expanding total production capacity to 10.3 GW.",
            "Sentiment": "positive",
            "PublishDate": 1766214595152,
            "Source": "stocks"
        },
        {
            "Title": "EMMVEE Gets 100-Acre Land Certificate from KIADB",
            "Summary": "EMMVEE Photovoltaic Power receives possession certificate from Karnataka Industrial Areas Development Board for 100 acres of land, marking significant expansion milestone.",
            "Sentiment": "positive",
            "PublishDate": 1765980642508,
            "Source": "stocks"
        },
        {
            "Title": "Emmvee Energy Plans ₹8.54 Cr Clean Energy Investment",
            "Summary": "Emmvee Energy announces investment plans worth ₹8.54 crores in clean renewable energy sector through partnership with KK 1C Pvt Ltd, marking expansion in sustainable energy initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1765975067688,
            "Source": "stocks"
        },
        {
            "Title": "Emmvee Subsidiary Invests ₹8.54 Cr in Clean Energy SPV",
            "Summary": "Emmvee Energy Private Limited, wholly owned subsidiary of Emmvee Photovoltaic Power, invests up to ₹8.54 crores in Clean Renewable Energy KK1C Private Limited for group captive power procurement.",
            "Sentiment": "positive",
            "PublishDate": 1765967120261,
            "Source": "co_actions_results"
        },
        {
            "Title": "Emmvee Photovoltaic Reports 181% Revenue Growth in Q2 FY26 Earnings Call",
            "Summary": "Emmvee Photovoltaic Power Limited reported quarterly revenue of ₹1,131 crore (up 181% year-on-year) with EBITDA of ₹399 crore at 35% margin and PAT of ₹238 crore at 21% margin. The company repaid ₹1,621 crore of long-term debt from IPO proceeds, maintains over 5GW confirmed order book, and expects new 6GW integrated cell and module facility to be operational by March-April 2027.",
            "Sentiment": "positive",
            "PublishDate": 1765204796670,
            "Source": "earnings"
        },
        {
            "Title": "Emmvee Photovoltaic Power's Subsidiary Secures 4.5 GWp Solar Cell Supply Agreement",
            "Summary": "Emmvee Energy Private Limited, a wholly owned subsidiary of Emmvee Photovoltaic Power Limited, entered into a supply agreement with a domestic buyer to supply TOPCon crystalline silicon photovoltaic cells with a contracted offtake of 4.5GWp. The agreement involves no promoter group interest and does not constitute a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1765186685370,
            "Source": "stock"
        },
        {
            "Title": "Emmvee Energy Subsidiary Completes Rs. 211.58 Crore Land Payment for 6GW Solar Facility",
            "Summary": "Emmvee Photovoltaic Power, a subsidiary of Emmvee Energy, has completed a payment of Rs. 211.58 crore to KIADB for land acquisition at Devanahalli, Bengaluru. The land will be used to develop a 6GW solar facility, representing a significant expansion in the company's renewable energy infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1765151673379,
            "Source": "stock"
        },
        {
            "Title": "Emmvee Energy Completes Rs. 211.58 Crore Land Payment for 6GW Solar Manufacturing Facility",
            "Summary": "Emmvee Energy Private Limited, a wholly owned subsidiary of Emmvee Photovoltaic Power Limited, paid Rs. 211.58 crore to Karnataka Industrial Areas Development Board for land allotment at Devanahalli, Bengaluru. The payment completes the entire land acquisition process for the proposed 6GW integrated solar module and cell manufacturing facility.",
            "Sentiment": "positive",
            "PublishDate": 1765021078236,
            "Source": "stock"
        },
        {
            "Title": "Emmvee Photovoltaic Power Resubmits Financial Results Due to Typographical Errors in Previous Reporting Periods",
            "Summary": "Emmvee Photovoltaic Power Limited resubmitted its standalone and consolidated financial results for the quarter and six months ended September 30, 2025, after discovering typographical errors in previously filed standalone financial numbers for March 2025 and September 2024 periods. The company reported consolidated profit after tax of Rs 23,786.10 lakhs for the quarter ended September 30, 2025, with no changes to consolidated results or XBRL versions, affecting only the print version of standalone financial statements.",
            "Sentiment": "neutral",
            "PublishDate": 1764946556393,
            "Source": "earnings"
        },
        {
            "Title": "Emmvee Photovoltaic Reports Strong Q2FY26 Performance with 181% Revenue Growth",
            "Summary": "Emmvee Photovoltaic Power Limited achieved revenue of ₹11,310 million in Q2FY26, marking 181% year-on-year growth, with EBITDA margin improving to 35% from 23% in Q2FY25. The solar module and cell manufacturer's strong performance was driven by new capacity commissioning and increased capacity utilization, with order book standing at 5.07 GW providing revenue visibility for 12-18 months.",
            "Sentiment": "positive",
            "PublishDate": 1764682694694,
            "Source": "earnings"
        },
        {
            "Title": "EMMVEE Photovoltaic Power Plans to Nearly Double Renewable Capacity with Solar Target of 34% by FY30",
            "Summary": "EMMVEE Photovoltaic Power has announced plans to nearly double its growth in renewable capacity, targeting significant expansion in its solar energy portfolio. The company projects that solar power will account for approximately 34% of total installed capacity by FY30, indicating a substantial shift toward renewable energy infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1764679885824,
            "Source": "stock"
        },
        {
            "Title": "EMMVEE Photovoltaic Power Reports 5.07 GW Order Book in Q2 FY26",
            "Summary": "EMMVEE Photovoltaic Power announced an order book of 5.07 GW for Q2 FY26, positioning the solar equipment manufacturer with substantial contracted business. The company expects this order book to provide strong revenue visibility for the next 12-18 months, indicating sustained business momentum in the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1764679564852,
            "Source": "earnings"
        },
        {
            "Title": "Emmvee Photovoltaic Seeks Shareholder Ratification for Employee Stock Option Scheme Post-Listing",
            "Summary": "Emmvee Photovoltaic Power Limited has issued a postal ballot notice seeking shareholder approval to ratify its Employee Stock Option Scheme 2025 (ESOS-2025) involving up to 35 lakh stock options and extend benefits to subsidiary company employees. The ratification is required under SEBI regulations following the company's listing on NSE and BSE on November 18, 2025, with remote e-voting scheduled from December 2025 to January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1764679213331,
            "Source": "corporate_action"
        },
        {
            "Title": "Emmvee Photovoltaic Power Reports 193% Revenue Growth in H1 FY26, PAT Jumps Nearly 7x to ₹426 Crore",
            "Summary": "Emmvee Photovoltaic Power Limited reported consolidated revenue of ₹2,159 crore for H1 FY26, marking 193% year-on-year growth, while profit after tax surged nearly 7x to ₹426 crore driven by strong demand for high-efficiency solar modules. The solar energy company successfully completed its IPO raising ₹2,900 crore and listed on BSE and NSE on November 18, 2025, using proceeds to repay ₹1,621 crore of long-term debt and strengthen its balance sheet.",
            "Sentiment": "positive",
            "PublishDate": 1764612217075,
            "Source": "earnings"
        }
    ]
}