{
    "Symbol": "EMSLIMITED",
    "ISIN": "INE0OV601013",
    "News": [
        {
            "Title": "EMS Limited Board Meet Set for Feb 13 to Review Q3 Results",
            "Summary": "EMS Limited has scheduled a board meeting on February 13, 2026, to approve Q3FY26 and nine months unaudited financial results for the period ended December 31, 2025, with trading window closed until 48 hours post-publication.",
            "Sentiment": "neutral",
            "PublishDate": 1770383908556,
            "Source": "stocks"
        },
        {
            "Title": "EMS stocks face profitability test in 2026: JP Morgan",
            "Summary": "JP Morgan identifies 2026 as decisive year for India's electronics manufacturing services sector, with stock recovery dependent on improved profitability after sharp 2025 underperformance.",
            "Sentiment": "neutral",
            "PublishDate": 1767932520124,
            "Source": "stocks"
        },
        {
            "Title": "EMS Limited Forms Strategic Partnerships in Key Sectors",
            "Summary": "EMS Limited announces two new partnerships - with Neercare India for sewage treatment operations and Gajendra Parihar for concrete business, holding majority stakes in both ventures.",
            "Sentiment": "positive",
            "PublishDate": 1767233937192,
            "Source": "stocks"
        },
        {
            "Title": "EMS Forms Strategic Partnerships in Sewage & Concrete",
            "Summary": "EMS Limited announces two new business partnerships - collaborating with Neercare India for sewage treatment solutions and joining forces with Gajendra Parihar for concrete business operations, holding majority stakes in both ventures.",
            "Sentiment": "positive",
            "PublishDate": 1767179964976,
            "Source": "stocks"
        },
        {
            "Title": "EMS Limited Forms Two Strategic Partnerships",
            "Summary": "EMS Limited enters partnership agreements with Neercare India Private Limited and Mr. Gajendra Parihar to expand business operations in sewage treatment and ready-mix concrete segments.",
            "Sentiment": "positive",
            "PublishDate": 1767178256306,
            "Source": "co_actions_results"
        },
        {
            "Title": "EMS Limited Promoter Pledges 1.66% Stake",
            "Summary": "EMS Limited promoter Mr. Ramveer Singh pledged 9.24 lakh shares (1.66% stake) to SG Finserve Limited for personal use on December 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767171547569,
            "Source": "stocks"
        },
        {
            "Title": "EMS Limited Q2 FY26 Revenue Drops 26-27% Due to Heavy Monsoon Rains Affecting Underground Operations",
            "Summary": "EMS Limited reported a 26-27% decline in quarterly revenue as pan-India heavy monsoon rains disrupted underground sewerage and pipeline work across six operational states, forcing suspension of digging operations for safety reasons. Despite the revenue decline, the company maintained margins with only a 2% drop and reaffirmed its annual growth guidance of 18-20% with an unexecuted order book of INR 2,388 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1763640799521,
            "Source": "earnings"
        },
        {
            "Title": "EMS Limited Reports Decline in Q2 and H1 FY26 Results, Appoints New CEO",
            "Summary": "EMS Limited reported a 43.41% decline in standalone net profit to Rs. 28.03 crore for Q2 FY26 and 24.27% decline to Rs. 65.41 crore for H1 FY26, primarily due to prolonged rainfall disrupting sewerage construction activities. The company appointed Harish Kumar Kansal as CEO and secured new contracts worth Rs. 287.87 crore from UP Jal Nigam for water supply and sewerage projects.",
            "Sentiment": "negative",
            "PublishDate": 1763137922741,
            "Source": "earnings"
        },
        {
            "Title": "EMS Reports 43% Decline in Q2 Net Profit to 282M Rupees",
            "Summary": "EMS reported Q2 consolidated net profit of 282M rupees, down from 497M rupees year-over-year, with revenue declining to 1.7B rupees from 2.3B rupees. The company's EBITDA fell to 362M rupees from 685M rupees, while EBITDA margin compressed to 20.97% from 29.36% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1763129197311,
            "Source": "earnings"
        },
        {
            "Title": "EMS Secures ₹184 Crore Order",
            "Summary": "EMS has secured an order worth ₹184 crore. The company announcement indicates a significant contract win for the business.",
            "Sentiment": "positive",
            "PublishDate": 1760604893705,
            "Source": "order&deals"
        },
        {
            "Title": "EMS Limited Reports 3.73% Revenue Growth in Q1, Cites Early Monsoon Impact on Underground Operations",
            "Summary": "EMS Limited reported revenue of Rs. 211.32 crores for the quarter ended June 30, 2025, compared to Rs. 203.72 crores in the same period last year, representing 3.73% growth. PAT increased 1.46% to Rs. 37.38 crores from Rs. 36.84 crores. The company attributed lower-than-expected growth to early monsoon rains affecting underground sewerage and water supply line work in the last 15 days of June. Management maintains guidance of 20-25% revenue growth for the full year, expecting to reach Rs. 1,250 crores. The company holds an unexecuted order book of Rs. 2,500 crores with Rs. 4,000 crores in pipeline bids. EMS operates primarily in water and wastewater projects (75% of business) and remains debt-free. The company expects stronger performance in the second half as underground work resumes post-monsoon season.",
            "Sentiment": "neutral",
            "PublishDate": 1757413298403,
            "Source": "earnings"
        },
        {
            "Title": "EMS Limited Secures Rs. 10,405.52 Crore Water Infrastructure Contract from UP Jal Nigam",
            "Summary": "EMS Limited has received a Letter of Acceptance from UP Jal Nigam (Urban) for a water infrastructure project valued at approximately Rs. 10,405.52 lakhs excluding GST. The project involves surveying, soil investigation, engineering, design, and construction of an intake well cum pump house, approach bridge, raw water rising main, and a 55 MLD water treatment plant under the Agra Water Supply Re-Organization Scheme. The contract is to be executed within 24 months. The company had previously received lowest bidder status for this tender in June 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755181105085,
            "Source": "order&deals"
        },
        {
            "Title": "EMS Limited Acquires 100% Stake in EMS Realtech, Reports Q1 Growth Despite Weather Challenges",
            "Summary": "EMS Limited's Board approved the acquisition of 100% stake in EMS Realtech Private Limited, making it a wholly owned subsidiary. The company reported standalone PAT growth of 1.46% to Rs 37.38 crore and consolidated PAT growth of 2.42% to Rs 38.06 crore for the quarter ended June 30, 2025. Revenue from operations increased 3.73% to Rs 211.32 crore on standalone basis and 15.81% to Rs 238.89 crore on consolidated basis. The company attributed slower growth to weather-related delays in Uttarakhand during June 2025, particularly affecting sewerage system progress. EMS Limited received L1 status for contracts worth Rs 18,381.49 lakhs and Rs 10,405.52 lakhs from UP Jal Nigam, and was awarded contracts worth Rs 1,946.11 lakhs and Rs 9,879.72 lakhs in July 2025. The Board also accepted the resignation of M/s Rishi Kapoor & Company as Statutory Auditors due to pre-occupation in other assignments.",
            "Sentiment": "positive",
            "PublishDate": 1755009288557,
            "Source": "earnings"
        },
        {
            "Title": "EMS Receives Approval for 194.6 Million Rupee Project",
            "Summary": "EMS has received approval for a project valued at 194.6 million rupees. No further details about the nature of the project or the approving authority were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752755581000,
            "Source": "default"
        },
        {
            "Title": "EMS Reports Q4 Results and Recommends Dividend",
            "Summary": "EMS has announced its quarterly results and a dividend recommendation. The company's Q4 EBITDA was 608 million rupees, compared to 676 million rupees in the same quarter last year. The Q4 EBITDA margin decreased to 22.88% from 27.57% year-over-year. EMS has recommended a dividend of 1.5 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1748438025000,
            "Source": "result"
        },
        {
            "Title": "EMS Reports Q4 Financial Results",
            "Summary": "EMS has announced its Q4 financial results. The company's consolidated net profit for the quarter was 466 million rupees, compared to 474 million rupees year-over-year and 505 million rupees quarter-over-quarter. Revenue for Q4 stood at 2.65 billion rupees, up from 2.45 billion rupees in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1748437910000,
            "Source": "result"
        },
        {
            "Title": "EMS Reports Strong Q3 EBITDA Growth",
            "Summary": "EMS has announced its Q3 financial results, showing significant year-over-year improvement. The company's EBITDA increased to 711 million rupees from 468 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 28.98% from 23.47% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1737726907000,
            "Source": "earnings"
        },
        {
            "Title": "EMS Reports Strong Q3 Financial Results",
            "Summary": "EMS has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 505 million rupees from 373 million rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 2.45 billion rupees compared to 1.99 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1737726890000,
            "Source": "earnings"
        },
        {
            "Title": "EMS to Consider Q3 Results on January 24",
            "Summary": "EMS (Electrical Manufacturing Services) has announced that it will consider its third quarter (Q3) financial results on January 24. This indicates that the company is preparing to review and potentially approve its financial performance for the most recent quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737117604000,
            "Source": "earnings"
        },
        {
            "Title": "EMS Ltd: Secures ₹416.46 Crore Order in Joint Venture with Indore Municipal Corporation",
            "Summary": "EMS Ltd has won a ₹416.46 crore order from Indore Municipal Corporation as part of a joint venture, with EMS holding a 26% share. The project involves designing and constructing sewage treatment plants and includes a 15-year Operations and Maintenance period under a DBOT model.",
            "Sentiment": "positive",
            "PublishDate": 1736328366000,
            "Source": "order&deals"
        },
        {
            "Title": "EMS Limited Secures Order Worth 416 Crore Rupees",
            "Summary": "EMS Limited has announced that it has won a new order valued at 416 crore rupees. This significant contract represents a substantial business opportunity for the company.",
            "Sentiment": "positive",
            "PublishDate": 1736319932000,
            "Source": "order&deals"
        }
    ]
}