{
    "Symbol": "EMUDHRA",
    "ISIN": "INE01QM01018",
    "News": [
        {
            "Title": "eMudhra Partners with LankaPay for Sri Lanka Digital Sigs",
            "Summary": "eMudhra Limited announces strategic partnership with LankaPay to enable national digital signatures across Sri Lanka's financial and public sector ecosystems, accelerating the country's paperless transformation.",
            "Sentiment": "positive",
            "PublishDate": 1770920108495,
            "Source": "stocks"
        },
        {
            "Title": "eMudhra seeks shareholder approval for director appointments",
            "Summary": "eMudhra Limited has issued a postal ballot notice seeking member approval for re-appointment of Executive Chairman Venkatraman Srinivasan beyond 70 years and appointments of Kaushik and Arvind Srinivasan as directors.",
            "Sentiment": "neutral",
            "PublishDate": 1770736600087,
            "Source": "stocks"
        },
        {
            "Title": "eMudhra Refutes 3I Infotech Financial Fraud Claims",
            "Summary": "eMudhra strongly denies financial fraud allegations made by 3I Infotech and announces plans to pursue legal action to address the accusations through appropriate legal channels.",
            "Sentiment": "negative",
            "PublishDate": 1770210005003,
            "Source": "stocks"
        },
        {
            "Title": "eMudhra Board Approves Key Director Appointments",
            "Summary": "eMudhra Limited's board approves re-appointment of Executive Chairman Venkatraman Srinivasan and appointments of Kaushik and Arvind Srinivasan as directors, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1770037489266,
            "Source": "stocks"
        },
        {
            "Title": "eMudhra Q3 Net Profit Surges 36.67% to ₹287M",
            "Summary": "eMudhra reports strong Q3 performance with consolidated net profit rising to ₹287 million from ₹210 million year-on-year, while revenue grows to ₹1.9 billion from ₹1.4 billion.",
            "Sentiment": "positive",
            "PublishDate": 1770037072148,
            "Source": "co_actions_results"
        },
        {
            "Title": "eMudhra Q3FY26 earnings call set for February 3, 2026",
            "Summary": "eMudhra Limited announces earnings call scheduled for February 3, 2026, at 4:00 PM IST to discuss Q3FY26 financial results. Senior management including Executive Chairman will participate.",
            "Sentiment": "neutral",
            "PublishDate": 1768890998848,
            "Source": "co_actions_results"
        },
        {
            "Title": "eMudhra Board Meeting Set for February 2, 2026",
            "Summary": "eMudhra Limited has scheduled a board meeting on February 2, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window for designated persons closed until February 4, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768202417108,
            "Source": "co_actions_results"
        },
        {
            "Title": "eMudhra Reports 22.6% Revenue Growth in Q2 FY26, Integrates Cryptas Acquisition",
            "Summary": "eMudhra Limited reported total income of INR 174.95 crores for Q2 FY26, marking a 22.6% year-on-year increase. EBITDA reached INR 43.33 crores with a margin of 24.8%, while net profit was INR 26.44 crores at 15.1% margin. For the first half of FY26, total income reached INR 325.57 crores, representing 37% year-on-year growth. The company consolidated Cryptas acquisition from July 1, contributing approximately INR 22 crores to quarterly revenue. eMudhra completed acquisition of AI CyberForge Inc., a US-based key and secrets management solutions company. The company established data centers in New Jersey and Salt Lake City and created CERTInext Inc. as a separate US subsidiary. Management projects full-year revenue guidance of INR 675-700 crores with PAT margin of 15.5-16%. Key project wins included implementations across North America, Malaysia, UAE, Qatar, and India spanning government and BFSI sectors. The company expects Cryptas to turn profitable within the next 2 quarters while integration efforts continue.",
            "Sentiment": "positive",
            "PublishDate": 1762839660955,
            "Source": "earnings"
        },
        {
            "Title": "eMudhra Limited Reports Quarterly Financial Results and Completes Two Strategic Acquisitions",
            "Summary": "eMudhra Limited's Board approved unaudited financial statements for the quarter and half year ended September 30, 2025. The company completed two acquisitions during the quarter: eMudhra BV acquired 51% ownership of Cryptas International GmbH, an Austria-based cybersecurity company, for EUR 5.0 million cash consideration with additional upside payments based on enterprise value. eMudhra Inc acquired 100% ownership of AI CyberForge Inc, a cybersecurity software provider, for USD 4.80 million cash consideration. Both acquisitions were effective from July 1, 2025. The consolidated financial results include revenue from operations of Rs. 1,749.48 million for the quarter and Rs. 3,285.68 million for the half year. Net profit for the quarter was Rs. 157.23 million and Rs. 271.32 million for the half year. The company maintains operations across multiple subsidiaries and step-down subsidiaries globally.",
            "Sentiment": "positive",
            "PublishDate": 1762270462757,
            "Source": "earnings"
        },
        {
            "Title": "eMudhra Reports 15% Growth in Q2 Net Profit to 253 Million Rupees",
            "Summary": "eMudhra reported consolidated net profit of 253 million rupees in Q2, up from 219 million rupees in the same quarter last year. Revenue increased to 1.73 billion rupees compared to 1.4 billion rupees year-over-year. EBITDA rose to 412.5 million rupees from 323 million rupees, while EBITDA margin improved to 23.86% from 22.93% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762264699125,
            "Source": "earnings"
        },
        {
            "Title": "eMudhra Limited Completes 100% Acquisition of AI Cyberforge Inc",
            "Summary": "eMudhra Limited has completed the acquisition of 100% interest in AI Cyberforge Inc, a USA-based company, through its subsidiary eMudhra Inc on July 30, 2025. The acquisition follows a previous communication dated July 24, 2025, regarding the planned purchase. Johnson Xavier, Company Secretary & Compliance Officer, confirmed the completion of the transaction to stock exchanges BSE and NSE.",
            "Sentiment": "positive",
            "PublishDate": 1753876436894,
            "Source": "order&deals"
        },
        {
            "Title": "eMudhra Reports 58.5% Revenue Growth in Q1 FY26, Completes Strategic Acquisitions",
            "Summary": "eMudhra Limited reported total income of INR 1,506 million for Q1 FY26, marking 58.5% year-on-year growth. EBITDA reached INR 380 million with 25.2% margin, while net profit was INR 250 million at 16.6% margin. The company completed acquisition of Austria-based Cryptas to strengthen European presence in DACH region and signed agreement to acquire AI CyberForge for secure credential management capabilities. Enterprise Solutions segment generated INR 1,181.2 million revenue while Trust Services contributed INR 291.8 million. Growth was driven by contributions from US (approximately INR 60 crores), Middle East Africa (INR 34-35 crores), and India (INR 55 crores). The company expanded operations to Kazakhstan and formed partnerships with LankaPay and Pacific Technology for Sri Lanka and Nepal markets. Management provided revenue guidance of INR 675-700 crores for the full year, maintaining PAT margin expectations around 16-16.5%.",
            "Sentiment": "positive",
            "PublishDate": 1753859240338,
            "Source": "earnings"
        },
        {
            "Title": "eMudhra Subsidiary Acquires AI Cyber Forge Inc for USD 4.8 Million to Expand Cybersecurity Portfolio",
            "Summary": "eMudhra Inc, a subsidiary of eMudhra Limited, has agreed to acquire 100% stake in AI Cyber Forge Inc, USA for USD 4.8 million in cash. The target company, promoted by technology entrepreneur Rishi Patel, specializes in secrets management, just-in-time credentials, PKI automation, and encryption services. AI Cyber Forge reported consolidated revenue of USD 600,000 for the year ended March 31, 2025. The acquisition aims to expand eMudhra's cybersecurity product offerings, particularly adding secrets management capabilities to complement its existing digital trust and security solutions. The transaction will enhance eMudhra's customer base in the USA and position it as a comprehensive provider of PKI-based cybersecurity products. The deal is expected to close within 2-3 weeks and does not require regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1753366796461,
            "Source": "order&deals"
        },
        {
            "Title": "eMudhra Reports 59% Revenue Growth in Q1 with Consolidated Revenue of Rs 1,473 Million",
            "Summary": "eMudhra Limited reported consolidated revenue of Rs 1,472.99 million for the quarter ended June 30, 2025, representing a 59% increase from Rs 924.42 million in the same quarter last year. Net profit rose to Rs 250.24 million compared to Rs 181.97 million in the previous year quarter. The company's standalone revenue reached Rs 555.13 million, up from Rs 394.30 million year-over-year. Earnings per share on a consolidated basis improved to Rs 3.05 from Rs 2.20 in the prior year quarter. During the quarter, eMudhra's subsidiary signed agreements to acquire 51% ownership in Cryptas International GmbH, a European encryption and trust services provider, for EUR 5 million with additional performance-based payments. The Board of Directors approved both standalone and consolidated unaudited financial statements prepared in accordance with Indian Accounting Standards.",
            "Sentiment": "positive",
            "PublishDate": 1753364856233,
            "Source": "earnings"
        },
        {
            "Title": "eMudhra to Review Q1 Results on July 24",
            "Summary": "eMudhra has announced that it will review its Q1 results on July 24. The company has scheduled this review to assess its financial performance for the first quarter of the current fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1751977183000,
            "Source": "default"
        },
        {
            "Title": "Emudhra Unit to Acquire 51% Stake in Cryptas International GmbH",
            "Summary": "Emudhra's subsidiary is set to acquire a 51% stake in Cryptas International GmbH for €5 million plus additional benefits. The deal is expected to be completed within 3-4 weeks.",
            "Sentiment": "positive",
            "PublishDate": 1751025509000,
            "Source": "default"
        },
        {
            "Title": "Emudhra Reports Q4 FY23 Results and Declares Dividend",
            "Summary": "Emudhra announced its Q4 FY23 consolidated financial results. Net profit increased to 239 million rupees, up from 210 million rupees year-over-year. Revenue grew to 1.5 billion rupees, compared to 997 million rupees in the same quarter last year. The company also declared a final dividend of 1.25 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746576821000,
            "Source": "default"
        },
        {
            "Title": "eMudhra Reports Q4 FY23 Results and Declares Dividend",
            "Summary": "eMudhra has announced its Q4 FY23 financial results. The company's consolidated net profit increased to 239 million rupees from 210 million rupees year-over-year. Revenue grew to 1.5 billion rupees from 997 million rupees in the same period last year. However, the EBITDA margin decreased to 23.69% from 31.91% year-over-year. The company has also declared a final dividend of 1.25 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746537584000,
            "Source": "result"
        },
        {
            "Title": "eMudhra Ltd: Q3 Profit Dips, Stock Hits Seven-Month Low",
            "Summary": "eMudhra's Q3 net profit fell 4.6% to Rs 20.9 crore, with revenue down 1.7% YoY to Rs 139 crore. EBITDA decreased 9.88% YoY to Rs 23.7 crore. The stock plummeted 18.49% to Rs 683.20, its lowest since June 2024, before recovering slightly to Rs 730.50.",
            "Sentiment": "negative",
            "PublishDate": 1738130199000,
            "Source": "earnings"
        },
        {
            "Title": "eMudhra Reports Mixed Q3 FY24 Results",
            "Summary": "eMudhra, a digital security and IT solutions company, has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 299 million rupees, up from 246.3 million rupees in the same quarter last year. However, the EBITDA margin decreased to 21.54% from 25.29% year-over-year, indicating a decline in profitability despite higher earnings.",
            "Sentiment": "neutral",
            "PublishDate": 1738065492000,
            "Source": "earnings"
        },
        {
            "Title": "eMudhra Reports Strong Q3 Revenue Growth",
            "Summary": "eMudhra Limited has announced its financial results for the third quarter, reporting a revenue of 1.39 billion rupees. This represents a significant year-over-year increase from 974 million rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738065479000,
            "Source": "earnings"
        },
        {
            "Title": "eMudhra Reports Q3 FY2024 Financial Results",
            "Summary": "eMudhra Limited announced its consolidated net profit for the third quarter of the fiscal year. The company reported a net profit of 209.73 million rupees, showing a year-over-year increase from 201 million rupees. However, there was a slight decrease from the previous quarter's profit of 219.3 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738065471000,
            "Source": "earnings"
        },
        {
            "Title": "eMudhra Reports Q2 FY2024 Financial Results",
            "Summary": "eMudhra, a digital security and IT solutions company, has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 323 million rupees, up from 282 million rupees in the same quarter last year. However, the EBITDA margin decreased to 22.88% from 29.20% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730213275000,
            "Source": "result"
        },
        {
            "Title": "eMudhra Reports Q2 FY2024 Financial Results",
            "Summary": "eMudhra Limited announced its Q2 FY2024 financial results. The company's consolidated net profit increased to 219 million rupees, up from 184 million rupees year-over-year and 179 million rupees quarter-over-quarter. Revenue for the quarter reached 1.4 billion rupees, compared to 963 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730213218000,
            "Source": "result"
        },
        {
            "Title": "eMudhra Schedules Board Meeting for Q2 Results",
            "Summary": "<p><span class='neutral'>eMudhra Limited</span> has announced a <b>board meeting</b> scheduled for <span class='neutral'>October 29</span> to consider and approve the company's <span class='neutral'>financial results</span> for the <b>second quarter</b> of the current fiscal year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728293589000,
            "Source": "result"
        }
    ]
}