{
    "Symbol": "ENDURANCE",
    "ISIN": "INE913H01037",
    "News": [
        {
            "Title": "Endurance Technologies Promoters Sign Shareholding Pact",
            "Summary": "Endurance Technologies' promoter group members executed an Inter Se Shareholders' Agreement on February 11, 2026, establishing conditions for share transfers and ensuring ownership stability.",
            "Sentiment": "neutral",
            "PublishDate": 1770803572182,
            "Source": "stocks"
        },
        {
            "Title": "Endurance Technologies Gets ₹858.29 Cr Subsidy Boost",
            "Summary": "Endurance Technologies receives addendum increasing industrial promotion subsidy eligibility to ₹858.29 crore, up ₹252.26 crore from previous ₹606.03 crore under Maharashtra's Package Scheme of Incentives - 2019.",
            "Sentiment": "positive",
            "PublishDate": 1768310543855,
            "Source": "stocks"
        },
        {
            "Title": "Endurance Technologies Insider Share Purchase",
            "Summary": "Designated person Srihari Kanthamani purchases 800 equity shares worth ₹20.51 lakh on December 30, 2025, increasing holding to 825 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1767249534247,
            "Source": "stocks"
        },
        {
            "Title": "Endurance Technologies Reports Cybersecurity Incident",
            "Summary": "Endurance Technologies Limited disclosed a cybersecurity incident affecting its IT infrastructure on December 23, 2025. The company has isolated affected systems and initiated remediation measures with no material impact on operations.",
            "Sentiment": "neutral",
            "PublishDate": 1766497991718,
            "Source": "stocks"
        },
        {
            "Title": "Endurance Technologies Reports 16.2% Standalone Revenue Growth in Q2 FY26 Amid Margin Pressures",
            "Summary": "Endurance Technologies achieved standalone revenue growth of 16.2% to Rs. 2,692.2 crores in Q2 FY26, though EBITDA margins compressed to 12.5% due to aluminum price increases and strategic investments in R&D and aftermarket expansion. The company announced major capacity expansions including 2.4 million units ABS capacity increase and new Chennai plant for disc brake systems, while winning Rs. 909 crores of new orders during H1 FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1763642848791,
            "Source": "earnings"
        },
        {
            "Title": "Endurance Technologies Reports 21.9% EBITDA Growth in Q2 with Strong Order Wins",
            "Summary": "Endurance Technologies reported consolidated total income of Rs 3,604 crore in Q2, with EBITDA growing 21.9% year-on-year to Rs 498 crore. The company's standalone business grew 16.2% driven by industry recovery, while Europe operations showed 47.1% growth in INR terms. The company won new orders worth Rs 909 crore in India including Rs 300 crore for battery packs, and Euro 12.7 million in Europe. Key developments include production commencement at the Alloy Wheel plant with 3.6 million wheels annual capacity, setting up lithium-ion battery pack plant in Pune, and acquiring 100% stake in Maxwell. The company has Rs 4,209 crore of RFQs under discussion with various customers. For the half-year period, consolidated income reached Rs 6,958 crore with EBITDA of Rs 977 crore, up 19.7% year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1762991227607,
            "Source": "earnings"
        },
        {
            "Title": "Endurance Technologies Reports 20% Growth in Consolidated Income for Half Year",
            "Summary": "Endurance Technologies Limited reported consolidated total income growth of 20.0% year-on-year for the half year ended September 30, 2025. The company's standalone business, representing India operations, grew 13.3%. Consolidated PAT increased 11.5% to INR 454 crore compared to the previous year. The company's consolidated EBITDA margin was 14.0% versus 14.1% last year. European operations growth was largely attributed to the acquisition of Stoferle entities in Germany. Indian operations contributed 72.5% of consolidated total income, with the balance from European operations. Aftermarket sales from Indian operations reached INR 243 crore versus INR 230 crore in the corresponding period last year. Consolidated basic and diluted EPS stood at INR 32.25 per share compared to INR 28.92 per share in the previous year. Managing Director Anurang Jain noted that Endurance outperformed industry growth, recording 16.2% topline growth in standalone business while Indian two-wheeler volumes grew 10.3% year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1762988777386,
            "Source": "earnings"
        },
        {
            "Title": "Endurance Technologies Plans Expansion with EV-Ready Components and Die-Casting Capacity Investment",
            "Summary": "Endurance Technologies reported revenue growth and outlined expansion plans focused on EV-ready auto components and aluminum die-casting capacity. The company is investing in lightweight solutions for global original equipment manufacturers (OEMs) and has developed a capital expenditure plan to support growth in European and Indian markets. The company highlighted strength in its export pipeline as part of its steady expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1762963697300,
            "Source": "stock"
        },
        {
            "Title": "Endurance Technologies Reports Strong Q2 Growth with 12% Revenue Jump",
            "Summary": "Endurance Technologies delivered robust quarterly performance with consolidated net profit rising to 2.27 billion rupees from 2.03 billion rupees year-over-year. Revenue grew significantly to 35.83 billion rupees compared to 29.13 billion rupees in the same period last year. EBITDA increased to 4.77 billion rupees from 3.82 billion rupees, while EBITDA margin improved marginally to 13.31% from 13.12% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762957249007,
            "Source": "earnings"
        },
        {
            "Title": "Endurance Technologies Conducts Postal Ballot for Shyamak Ramyar Tata's Independent Director Appointment",
            "Summary": "Endurance Technologies Limited conducted a postal ballot through remote e-voting to seek shareholder approval for the appointment of Mr. Shyamak Ramyar Tata as an Independent Director effective 1st November, 2025. The company sent the postal ballot notice on 11th September, 2025 to members whose names appeared in the register as of the cut-off date of 5th September, 2025. The remote e-voting period ran from 9:00 a.m. on 15th September, 2025 to 5:00 p.m. on 14th October, 2025, with NSDL providing the e-voting facility. Mrs. Sarika Kulkarni was appointed as scrutinizer to conduct the postal ballot process. The appointment is for a period of five consecutive years, and the results will be declared by 16th October, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760444855586,
            "Source": "corporate_governance"
        },
        {
            "Title": "Endurance Technologies Begins Commercial Production at New Alloy Wheels Plant in AURIC, Bidkin",
            "Summary": "Endurance Technologies Limited has commenced commercial production of alloy wheels for two-wheelers at its new manufacturing facility in AURIC, Bidkin. The plant has an installed capacity of 150,000 sets per month, with potential for future expansion. The company had previously announced plans for this greenfield project with an envisaged capacity of 180,000 sets per month and a planned capital expenditure of Rs. 3,000 million. The facility is strategically designed to support future capacity expansion when the company secures additional orders from OEM customers. Endurance already operates an existing alloy wheels manufacturing plant in Chakan, Pune, with a capacity of 230,000 sets per month.",
            "Sentiment": "positive",
            "PublishDate": 1760163804748,
            "Source": "stock"
        },
        {
            "Title": "Endurance Technologies Designated Person Sells 1,500 Equity Shares",
            "Summary": "Endurance Technologies Limited disclosed that Mr. Aswinsriram Alagarsamy, a designated person and Deputy General Manager, sold 1,500 equity shares of the company valued at Rs. 40.71 lakh through on-market transactions on the National Stock Exchange on September 30, 2025. Following the sale, his shareholding reduced to zero equity shares (0.00% shareholding). The disclosure was made in compliance with SEBI Insider Trading Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1759301861085,
            "Source": "corporate_action"
        },
        {
            "Title": "Endurance Technologies Acquires 8.9 Acres in Tamil Nadu for Manufacturing Expansion",
            "Summary": "Endurance Technologies Limited acquired a leasehold plot of approximately 8.9 acres in Kancheepuram District, Tamil Nadu from the State Industrial Promotion Corporation of Tamil Nadu Limited (SIPCOT). The acquisition aims to expand manufacturing operations in southern India to serve two and four-wheeler OEM customers in the region. The company signed a Memorandum of Understanding with the State Government for infrastructural and regulatory support. Endurance is evaluating setting up a manufacturing facility for two-wheeler disc brake components and assemblies to meet growing OEM demand. The disclosure was made following a Times of India article and subsequent share price movement.",
            "Sentiment": "positive",
            "PublishDate": 1757649707559,
            "Source": "stock"
        },
        {
            "Title": "Endurance Technologies Seeks Shareholder Approval for Shyamak Ramyar Tata's Independent Director Appointment",
            "Summary": "Endurance Technologies Limited has issued a postal ballot notice seeking shareholder approval for appointing Mr. Shyamak Ramyar Tata as an Independent Director effective November 1, 2025, for a five-year term until October 31, 2030. The e-voting period runs from September 15 to October 14, 2025, with results to be declared by October 16, 2025. Mr. Tata, who holds DIN 07297729, was previously Chairperson of Deloitte India from 2019 to 2021 and has over 35 years of experience. He currently serves as an independent director on the boards of Siemens Limited, Thermax Limited, and Hawkins Cookers Limited, holding chairman positions on multiple audit committees. The Board recommends his appointment based on his expertise in strategy, business management, financial knowledge, and governance, believing it will strengthen oversight capabilities in governance, risk management, audit and ESG areas.",
            "Sentiment": "positive",
            "PublishDate": 1757592651974,
            "Source": "corporate_action"
        },
        {
            "Title": "Endurance Technologies Block Trade Worth Rs. 21.01 Crores on NSE",
            "Summary": "Endurance Technologies Ltd. executed a block trade on the National Stock Exchange involving approximately 69,856 shares at a price of Rs. 3,008.30 per share. The total transaction value amounted to Rs. 21.01 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1757049592447,
            "Source": "order&deals"
        },
        {
            "Title": "Endurance Technologies Approves Expansion of ABS and Brake System Operations",
            "Summary": "Endurance Technologies has approved expansion plans for its ABS (Anti-lock Braking System), disc brake systems, and brake discs operations. The company has given the green light to expand these automotive component manufacturing segments.",
            "Sentiment": "positive",
            "PublishDate": 1755612878472,
            "Source": "stock"
        },
        {
            "Title": "Endurance Technologies Anticipates Growth in EV Components and European Operations",
            "Summary": "Endurance Technologies expects long-term growth across three key areas: electric vehicle components, aftermarket business, and European operations. The company plans capacity additions and aims to improve margins through a premium product mix.",
            "Sentiment": "positive",
            "PublishDate": 1755102966000,
            "Source": "stock"
        },
        {
            "Title": "Endurance Technologies Appoints Shyamak Ramyar Tata as Independent Director, Reports Q1 Results",
            "Summary": "Endurance Technologies Limited appointed Mr. Shyamak Ramyar Tata as an Independent Director for a five-year term starting November 1, 2025, subject to shareholder approval via postal ballot. Tata is a Fellow Member of the Institute of Chartered Accountants of India and served as Chairperson of Deloitte India from 2019 to 2021. The company reported quarterly results with standalone revenue from operations of ₹2,334.56 crore compared to ₹2,120.40 crore in the same quarter last year. Standalone profit for the quarter was ₹165.82 crore versus ₹162.86 crore in the previous year quarter. On a consolidated basis, revenue from operations reached ₹3,318.89 crore compared to ₹2,825.50 crore in the corresponding quarter. Consolidated profit was ₹226.35 crore against ₹203.86 crore in the same period last year. The company completed acquisition of remaining 38.50% stake in Maxwell Energy Systems Private Limited for ₹7.50 crore, making it a wholly-owned subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1755082508729,
            "Source": "corporate_governance"
        },
        {
            "Title": "Endurance Technologies Announces Merger of Three Italian Subsidiaries",
            "Summary": "Endurance Technologies Limited announced a proposed merger of its wholly-owned step-down subsidiaries in Italy. Endurance Engineering S.r.l and Endurance S.p.A will merge with Endurance Castings S.p.A, with the appointed date set for April 1, 2025. The merger requires approval from parent company Endurance Overseas S.p.A and regulatory authorities. The three entities operate in automotive manufacturing - EESrl produces plastic components, ESpA handles aluminum die casting and machining, while ECSpA manufactures high pressure die casting components. For the financial year ended March 31, 2025, the combined turnover of the three entities was Rs 23,532.19 million with total profit after tax of Rs 1,527.19 million. The consolidation aims to create operational synergies, achieve economies of scale, and reduce administrative costs. No cash consideration or share exchange is involved, and Endurance Technologies' shareholding pattern remains unchanged.",
            "Sentiment": "positive",
            "PublishDate": 1753970664270,
            "Source": "corporate_action"
        },
        {
            "Title": "Endurance Tech to Announce Q1 Results on August 13",
            "Summary": "Endurance Tech has scheduled the announcement of its first quarter results for August 13.",
            "Sentiment": "neutral",
            "PublishDate": 1750769271000,
            "Source": "default"
        },
        {
            "Title": "Endurance Technologies Acquires Remaining Stake in Maxwell Energy Systems",
            "Summary": "Endurance Technologies has completed the acquisition of the remaining 38.50% equity stake in Maxwell Energy Systems Pvt Ltd. This acquisition makes Maxwell Energy Systems a wholly-owned subsidiary of Endurance Technologies.",
            "Sentiment": "positive",
            "PublishDate": 1747412200000,
            "Source": "default"
        },
        {
            "Title": "Endurance Technologies: Q4 Profit Up 17%, Declares ₹10 Dividend",
            "Summary": "Endurance Technologies reported a 16.7% YoY increase in Q4 FY25 net profit to ₹245 crore. Revenue rose 10.4% to ₹2,963.5 crore. The company declared a dividend of ₹10 per share for FY 2024-25, with August 1, 2025, set as the record date.",
            "Sentiment": "positive",
            "PublishDate": 1747325796000,
            "Source": "earnings"
        },
        {
            "Title": "Endurance Tech Reports Q4 Results and Dividend Recommendation",
            "Summary": "Endurance Tech announced its Q4 financial results. Revenue increased to 29.63B rupees from 26.85B rupees year-over-year. EBITDA rose to 4.22B rupees from 3.9B rupees, with a margin of 14.26% compared to 14.5% last year. Consolidated net profit grew to 2.45B rupees from 2.1B rupees year-over-year and 1.84B rupees quarter-on-quarter. The company reported an exceptional loss of 121.8M rupees. PBT increased to 3.02B rupees from 2.75B rupees year-over-year. The company has recommended a dividend of 10 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747325557000,
            "Source": "result"
        },
        {
            "Title": "Endurance Technologies Increases Stake in Maxwell Energy Systems",
            "Summary": "Endurance Technologies has acquired the remaining 38.50% stake in Maxwell Energy Systems for 75.01 million rupees, increasing its ownership in the company.",
            "Sentiment": "positive",
            "PublishDate": 1746705236000,
            "Source": "default"
        },
        {
            "Title": "Endurance Technologies: New Lithium-Ion Battery Pack Plant in Maharashtra",
            "Summary": "Endurance Technologies Ltd is establishing a new manufacturing facility in Pune, Maharashtra for lithium-ion battery packs. The project involves a ₹47.3 crore investment, funded through internal accruals. Production capacity is expected to be 35,000 battery packs per month, with operations starting in January 2026.",
            "Sentiment": "positive",
            "PublishDate": 1745997946000,
            "Source": "corporate_action"
        },
        {
            "Title": "Endurance Technologies to Establish New Battery Pack Facility in Maharashtra",
            "Summary": "Endurance Technologies has announced plans to set up a new battery pack facility in Maharashtra, India. The company will invest approximately 473 million rupees in this expansion. The proposed facility is expected to have a production capacity of 35,000 battery packs per month.",
            "Sentiment": "positive",
            "PublishDate": 1745972668000,
            "Source": "default"
        },
        {
            "Title": "Endurance Technologies to Establish New Battery Pack Facility in Maharashtra",
            "Summary": "Endurance Technologies has announced plans to set up a new battery pack manufacturing facility in Maharashtra. The company will invest approximately 473 million rupees in this expansion. The proposed facility is expected to have a production capacity of 35,000 battery packs per month.",
            "Sentiment": "positive",
            "PublishDate": 1745928702000,
            "Source": "default"
        },
        {
            "Title": "Endurance Technologies: Auto Ancillary Firm Leads in EV Component Orders",
            "Summary": "A Maharashtra-based mid-cap auto ancillary company, established in 1985, secured EV and hybrid vehicle component orders in Europe in late 2017, ahead of its Indian peers. The company, which started with die-castings, has expanded into suspensions and brakes, and is currently trading at 4 times its IPO price despite challenging market conditions.",
            "Sentiment": "positive",
            "PublishDate": 1745085926000,
            "Source": "normal_news"
        },
        {
            "Title": "Endurance Technologies Eligible for Government Incentives",
            "Summary": "Endurance Technologies has received an Eligibility Certificate from the Directorate of Industries, Government of Maharashtra. The company is now eligible to receive incentives of up to Rs. 6,060.32 million for investments made in fixed assets at its units in Waluj, Chhatrapati Sambhajinagar, between April 2019 and August 2024.",
            "Sentiment": "positive",
            "PublishDate": 1743984536000,
            "Source": "corporate_action"
        },
        {
            "Title": "Endurance Technologies Receives Eligibility Certificate for Government Incentives",
            "Summary": "Endurance Technologies has been granted an Eligibility Certificate by the Directorate of Industries, Government of Maharashtra. This certificate makes the company eligible to receive incentives of up to Rs. 6,060.32 million for investments made in fixed assets at its units in Waluj, Chhatrapati Sambhajinagar, between April 2019 and August 2024.",
            "Sentiment": "positive",
            "PublishDate": 1743773289000,
            "Source": "corporate_action"
        },
        {
            "Title": "Endurance Technologies Schedules Analyst/Investor Meeting",
            "Summary": "Endurance Technologies has announced a meeting with analysts and investors scheduled for March 26 at 11:00 AM. This suggests the company is preparing to engage with financial stakeholders, potentially to discuss company performance, strategy, or other relevant business matters.",
            "Sentiment": "neutral",
            "PublishDate": 1742821530000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Endurance Technologies Announces Change in Equity Shareholding of EOSPA",
            "Summary": "Endurance Technologies has announced a change in the equity shareholding of its subsidiary, EOSPA (Endurance Overseas S.p.A.). EOSPA has bought back 5% of its equity shares for €8.5 million. This move represents a significant corporate action that affects the company's ownership structure.",
            "Sentiment": "neutral",
            "PublishDate": 1742516347000,
            "Source": "corporate_action"
        },
        {
            "Title": "Endurance Technologies Announces Change in Equity Shareholding of EOSPA",
            "Summary": "Endurance Technologies has announced a change in the equity shareholding of EOSPA (Endurance Overseas S.p.A.). EOSPA has repurchased 5% of its equity shares for €8.5 million. This buyback represents a corporate action that affects the company's ownership structure.",
            "Sentiment": "neutral",
            "PublishDate": 1742482196000,
            "Source": "corporate_action"
        },
        {
            "Title": "Endurance Technologies Accepts Voluntary Separation of 57 Workmen",
            "Summary": "Endurance Technologies has accepted the voluntary separation of 57 workmen under a Voluntary Separation Scheme (VSS). The company will pay out approximately 106.35 million rupees towards this scheme.",
            "Sentiment": "neutral",
            "PublishDate": 1742210600000,
            "Source": "corporate_action"
        },
        {
            "Title": "Endurance Technologies Reports Q3 Financial Results",
            "Summary": "Endurance Technologies has announced its Q3 consolidated net profit of 1.84 billion rupees, showing an increase from 1.52 billion rupees year-over-year. The company's Q3 revenue also rose to 28.6 billion rupees from 25.61 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739405753000,
            "Source": "earnings"
        },
        {
            "Title": "Endurance Technologies Reports Improved Q3 EBITDA and Margin",
            "Summary": "Endurance Technologies has reported a significant improvement in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 3.7 billion rupees, up from 2.99 billion rupees in the same quarter of the previous year. Additionally, the EBITDA margin expanded to 13.03% from 11.67% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739371705000,
            "Source": "earnings"
        },
        {
            "Title": "Endurance Technologies Reports Q3 FY24 Financial Results",
            "Summary": "Endurance Technologies has announced its Q3 financial results. The company's consolidated net profit increased to 1.84 billion rupees, up from 1.52 billion rupees year-over-year. Sequentially, it decreased from 2.02 billion rupees in the previous quarter. Revenue for Q3 rose to 28.6 billion rupees, compared to 25.61 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739371405000,
            "Source": "earnings"
        },
        {
            "Title": "Endurance Technologies Announces Voluntary Separation Scheme",
            "Summary": "Endurance Technologies has announced a Voluntary Separation Scheme (VSS) for eligible workmen at its Waluj plant. This move suggests the company is implementing workforce restructuring measures, potentially to optimize operations or reduce costs. The scheme is voluntary, indicating that employees have the choice to opt for the separation package.",
            "Sentiment": "neutral",
            "PublishDate": 1739233161000,
            "Source": "corporate_action"
        },
        {
            "Title": "Endurance Technologies Announces Voluntary Separation Scheme",
            "Summary": "Endurance Technologies has announced a Voluntary Separation Scheme (VSS) for eligible workmen at its Waluj plant. This move suggests the company is looking to restructure its workforce, potentially to optimize operations or reduce costs. The scheme, being voluntary, allows eligible employees to opt for separation from the company, likely with some financial incentives.",
            "Sentiment": "neutral",
            "PublishDate": 1739196999000,
            "Source": "corporate_action"
        },
        {
            "Title": "Endurance Technologies Ltd: Large Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) for Endurance Technologies Ltd. The trade involved approximately 476,869 shares at a price of Rs. 2,192.10 per share, totaling Rs. 104.53 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1735897706000,
            "Source": "block_deals"
        },
        {
            "Title": "Endurance Technologies to Consider Q3 Results on February 12",
            "Summary": "Endurance Technologies Limited has announced that it will consider its third quarter (Q3) financial results on February 12. This indicates the company is preparing to release its earnings report for the latest fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1735557251000,
            "Source": "corporate_action"
        },
        {
            "Title": "Endurance Technologies Announces Merger Approval of Italian Subsidiaries",
            "Summary": "Endurance Technologies has reported that the merger of its Italian subsidiary units has been approved by the Italian Chamber of Commerce. This corporate action signifies a consolidation of the company's operations in Italy, potentially streamlining its business structure and improving operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1734654864000,
            "Source": "corporate_action"
        },
        {
            "Title": "Endurance Technologies Announces Merger Approval of Italian Subsidiaries",
            "Summary": "Endurance Technologies has reported that the merger of its Italian subsidiary units has been approved by the Italian Chamber of Commerce. This corporate action signifies a consolidation of the company's operations in Italy, potentially streamlining its business structure in the European market.",
            "Sentiment": "positive",
            "PublishDate": 1734615716000,
            "Source": "corporate_action"
        },
        {
            "Title": "Endurance Technologies Acquires Majority Stake in German Automotive Companies",
            "Summary": "Endurance Technologies has acquired a 60% stake in Stoferle Automotive and Stoferle GmbH for 37.74 million euros (approximately 328 crore rupees). This acquisition is aimed at strengthening Endurance's European automotive casting business.",
            "Sentiment": "positive",
            "PublishDate": 1734054683000,
            "Source": "corporate_action"
        },
        {
            "Title": "Endurance Technologies Ltd: Block Trade of Rs. 23.24 Crores on NSE",
            "Summary": "A block trade of approximately 100,356 shares of Endurance Technologies Ltd was executed on the National Stock Exchange (NSE) at a price of Rs. 2315.60 per share. The total value of the transaction amounted to Rs. 23.24 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1732863752000,
            "Source": "block_deals"
        },
        {
            "Title": "Endurance Technologies Reports Q2 FY24 Financial Results",
            "Summary": "Endurance Technologies has announced its Q2 financial results. The company's EBITDA increased to 3.7 billion rupees from 3.2 billion rupees year-over-year. The EBITDA margin also improved to 12.77% from 12.51% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730902772000,
            "Source": "result"
        },
        {
            "Title": "Endurance Technologies Reports Strong Q2 Financial Results",
            "Summary": "Endurance Technologies has announced its Q2 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 2.03 billion rupees, up from 1.54 billion rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 29 billion rupees compared to 25.4 billion rupees in the previous year. Quarter-on-quarter performance was also positive, with net profit slightly increasing from 2.04 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730902697000,
            "Source": "result"
        },
        {
            "Title": "Endurance Technologies Ltd: Large Block Trade on NSE",
            "Summary": "A significant block trade occurred for Endurance Technologies Ltd on the National Stock Exchange (NSE). Approximately 186,775 shares were traded at a price of Rs. 2365.15 per share, totaling Rs. 44.18 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1729496824000,
            "Source": "block_deals"
        },
        {
            "Title": "Endurance Technologies Approves Capex for New Alloy Wheel Facility",
            "Summary": "<p>Endurance Technologies has approved <span class='positive'>capital expenditure</span> for a <span class='positive'>greenfield project</span> to set up a <b>new manufacturing facility</b>. The facility will produce <span class='neutral'>alloy wheels</span> for two-wheelers, with a planned <span class='positive'>investment</span> of <b>3 billion rupees</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728561197000,
            "Source": "corporate_action"
        }
    ]
}