{
    "Symbol": "ENERGYDEV",
    "ISIN": "INE306C01019",
    "News": [
        {
            "Title": "Energy Development Company Reports Mixed Q2 Results Amid Auditor Concerns",
            "Summary": "Energy Development Company Limited posted a profit of Rs. 10.04 lakhs for the quarter ended September 30, 2025, compared to a loss of Rs. 272.61 lakhs in the previous quarter, though auditors issued adverse conclusions citing unresolved issues including Rs. 18,817.47 lakhs in income tax demands and doubtful receivables. The company's power generation increased to 2.30 million units from 0.76 million units in the previous quarter, but faces significant regulatory and recovery challenges across its subsidiaries and associate companies.",
            "Sentiment": "negative",
            "PublishDate": 1763124484007,
            "Source": "earnings"
        },
        {
            "Title": "Energy Development Company Limited Reports Loss of Rs 172.61 Lakhs in Q1 FY26 Amid Multiple Auditor Qualifications",
            "Summary": "Energy Development Company Limited reported a standalone net loss of Rs 172.61 lakhs for the quarter ended June 30, 2025, compared to a loss of Rs 197.11 lakhs in the same period last year. Revenue from operations increased to Rs 298.64 lakhs from Rs 43.58 lakhs year-on-year. The company recorded exceptional items of Rs 122.59 lakhs related to provision for impairment against investments and outstanding balances from subsidiary EDCL Arunachal Hydro Projects Private Limited. On a consolidated basis, the company reported a profit of Rs 164.68 lakhs versus a loss of Rs 45.81 lakhs in the previous year. The auditors issued adverse conclusions citing multiple concerns including non-determination of loan recovery terms worth Rs 2,624.08 lakhs from subsidiaries, potential impairment of investments worth Rs 5,600.00 lakhs, doubtful trade receivables of Rs 656.10 lakhs, and pending income tax demands of Rs 18,817.47 lakhs. The company operates in electricity generation through hydel and wind power projects, with generation increasing to 7.63 million units from 1.28 million units year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1754397197758,
            "Source": "earnings"
        },
        {
            "Title": "Energy Development Company Limited: Penny Stock Surges on Strong Q2 Results",
            "Summary": "EDCL stock rose 5% to Rs 25.24, hitting upper circuit after reporting 37% increase in Q2FY25 net sales to Rs 15.09 crore and 123% increase in net profit to Rs 6.55 crore. The company aims to expand its renewable energy capacity from 19 MW to 500 MW in 5-7 years.",
            "Sentiment": "positive",
            "PublishDate": 1731313440000,
            "Source": "result"
        }
    ]
}