{
    "Symbol": "ENGINERSIN",
    "ISIN": "INE510A01028",
    "News": [
        {
            "Title": "Engineers India Q3FY26 Earnings Call on Feb 13",
            "Summary": "Engineers India Limited announces earnings call scheduled for February 13, 2026 at 3:00 PM IST to discuss Q3FY26 and nine-month results ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770377059013,
            "Source": "co_actions_results"
        },
        {
            "Title": "Engineers India secures $360M overseas order",
            "Summary": "Engineers India wins largest-ever overseas contract worth $360 million from Nigeria's Dangote Group for refinery expansion, boosting order book to record ₹15,800 crore with 65% orders from international markets.",
            "Sentiment": "positive",
            "PublishDate": 1768976770966,
            "Source": "co_actions_results"
        },
        {
            "Title": "Engineers India announces senior management change",
            "Summary": "Engineers India Limited announces retirement of Executive Director (Engineering) Shri Mainak Nandi effective January 1, 2026, following superannuation on December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767181658567,
            "Source": "stocks"
        },
        {
            "Title": "Engineers India Limited Declares Interim Dividend of ₹1 Per Share for FY 2025-26",
            "Summary": "Engineers India Limited's Board of Directors declared an interim dividend of ₹1 per share (face value ₹5) for financial year 2025-26, with record date set for December 4, 2025. The dividend will be payable from December 19, 2025, within 30 days of declaration as per Companies Act provisions.",
            "Sentiment": "positive",
            "PublishDate": 1764315330201,
            "Source": "corporate_action"
        },
        {
            "Title": "Engineers India Limited Reports Strong Q2 FY26 Results with 33% Revenue Growth and Record Order Book",
            "Summary": "Engineers India Limited achieved revenue of INR 900 crore in Q2 FY26 versus INR 676 crore in Q2 FY25, with profit before tax rising 50% to INR 150 crore and order book reaching all-time high of INR 13,131 crore. The company guided for 25%+ annual revenue growth and expects to exceed INR 8,000 crore order inflow target, driven by strong performance in both consultancy and turnkey segments.",
            "Sentiment": "positive",
            "PublishDate": 1763464668011,
            "Source": "earnings"
        },
        {
            "Title": "Engineers India Projects 25%+ Revenue Growth, Targets Order Inflow Above INR 8,000 Crores",
            "Summary": "Engineers India expects revenue growth of over 25% and aims to exceed its previous order inflow target of INR 8,000 crores, maintaining a balanced 50-50 split between consultancy and turnkey business segments. The company targets profit margins of around 25% for its consultancy segment and 6-7% for its LSTK (turnkey) segment.",
            "Sentiment": "neutral",
            "PublishDate": 1763217332468,
            "Source": "earnings"
        },
        {
            "Title": "Engineers India Signs Initial Agreement with UAE's NMDC Energy for Saudi Arabia Oil and Gas Projects",
            "Summary": "Engineers India has entered into an initial agreement with UAE-based NMDC Energy for onshore oil and gas projects in Saudi Arabia. The partnership focuses on developing energy infrastructure in the Saudi market.",
            "Sentiment": "positive",
            "PublishDate": 1762769045243,
            "Source": "order&deals"
        },
        {
            "Title": "Engineers India Limited Announces Retirement of Two Executive Directors",
            "Summary": "Engineers India Limited announced the retirement of two senior executives due to superannuation. Shri N S Vasudev, Executive Director (Projects), and Shri Alok Singhal, Executive Director (Construction), will be retiring effective September 30, 2025. The changes in senior management will take effect from October 1, 2025. Both executives are retiring upon reaching the age of superannuation.",
            "Sentiment": "neutral",
            "PublishDate": 1759235787222,
            "Source": "corporate_governance"
        },
        {
            "Title": "Engineers India Secures Order Worth 6.18 Billion Rupees",
            "Summary": "Engineers India has received an order valued at 6.18 billion rupees. The company announced this new contract award, though specific details about the nature of the project, client, or timeline were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1757895013403,
            "Source": "order&deals"
        },
        {
            "Title": "Engineers India Limited Wins Project Management Contract for New Fertilizer Plant in Africa",
            "Summary": "Engineers India Limited (EIL) has been awarded a contract to provide Project Management Consultancy (PMC) Services and Engineering Procurement and Construction Management (EPCM) Services for establishing a new fertilizer plant in Africa. The international project has a contract value of approximately Rs 618 crore and is scheduled for completion within 24 months. The contract was awarded by a fertilizer company in Africa. EIL stated that specific details cannot be shared due to confidentiality requirements. The contract does not involve any promoter or group company interests and does not fall under related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1757679179744,
            "Source": "order&deals"
        },
        {
            "Title": "Engineers India Limited Promotes Seven Executives to Executive Director Positions",
            "Summary": "Engineers India Limited promoted seven executives to Executive Director positions across different directorates. The promotions were approved by the Competent Authority on August 26, 2025. Five executives - Shri Sanjay Kumar Singh (Projects), Shri Anil Kumar (Technical), Ms. Gopa Swain (HR), Shri Manish Shandilya (Technical), and Shri Naveen Parashar (C&MD Directorate) - were promoted effective July 1, 2025. Shri Neeraj Mathur was promoted to Executive Director (Commercial) effective August 1, 2025, while Shri Rajiv Ranjan was promoted to Executive Director (on CEIL Deputation) effective September 1, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1756272866609,
            "Source": "corporate_governance"
        },
        {
            "Title": "Engineers India Limited Approves Undertaking for Bank Guarantee of Joint Venture RFCL",
            "Summary": "Engineers India Limited's Board of Directors approved providing an undertaking for a Bank Guarantee taken by Ramagundam Fertilizers & Chemicals Limited, a joint venture between EIL, National Fertilizers Limited, and Fertilizer Corporation of India Limited. RFCL established a Rs. 175 crore Bank Guarantee with IndusInd Bank for Debt Service Reserve Account facility as required by project lenders. The undertaking commits EIL to maintain its 26% shareholding in RFCL and not pledge shares without bank permission until the facility expires on March 31, 2026. RFCL operates a urea and ammonia production plant that became commercial in March 2021. The board meeting was held on August 26, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1756211951652,
            "Source": "corporate_action"
        },
        {
            "Title": "Engineers India MD Sets ₹5,000 Crore Revenue Target by 2028",
            "Summary": "Engineers India's Managing Director has announced a target to achieve ₹5,000 crore in turnover by 2028. The company has set this revenue milestone as part of its growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1755664073258,
            "Source": "stock"
        },
        {
            "Title": "Engineers India Limited Conducts Earnings Call for Q1 FY2026 Results",
            "Summary": "Engineers India Limited held an earnings call on August 18, 2025 to discuss the financial results for the first quarter ended June 30, 2025. The company has made the audio recording of the call available on their website for investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1755517798867,
            "Source": "earnings"
        },
        {
            "Title": "Engineers India Partners with NPCIL for Bharat Small Modular Reactor Engineering Services",
            "Summary": "Engineers India has signed an agreement with Nuclear Power Corporation of India Limited (NPCIL) to provide engineering services for the development of Bharat Small Modular Reactor. The partnership focuses on advancing India's small modular reactor technology development through specialized engineering support.",
            "Sentiment": "positive",
            "PublishDate": 1755150322730,
            "Source": "order&deals"
        },
        {
            "Title": "Engineers India Positioned to Benefit from Hydrocarbon and Green Energy Investment Cycle",
            "Summary": "Engineers India is expected to capitalize on increased capital expenditure in both hydrocarbon and green energy sectors. The company's growth strategy involves leveraging its strong order pipeline, expanding into overseas markets, and developing clean energy consultancy services. These initiatives are anticipated to support steady revenue growth and margin expansion for the engineering services company.",
            "Sentiment": "positive",
            "PublishDate": 1755102972330,
            "Source": "stock"
        },
        {
            "Title": "Engineers India Limited Reports Q1 FY 2025-26 Financial Results with 37.6% Revenue Growth",
            "Summary": "Engineers India Limited reported total income of Rs 8,921.11 million for Q1 FY 2025-26, representing a 37.6% increase from Rs 6,483.19 million in Q1 FY 2024-25. Consultancy revenue grew to Rs 4,081.28 million from Rs 3,465.42 million, while turnkey revenue increased significantly to Rs 4,490.20 million from Rs 2,640.81 million. Segment profits rose to Rs 931.88 million compared to Rs 733.25 million in the previous year quarter. The company secured new business worth Rs 14,292 million during the quarter and maintained an order book of Rs 121,443 million as of June 2025. Notable project wins include engineering consultancy services for Saudi Arabian Chevron Inc-Kuwait Gulf Oil Company valued at Rs 3,913 million and project management consultancy for JNPA Office Building Complex worth Rs 6,480 million.",
            "Sentiment": "positive",
            "PublishDate": 1755097410272,
            "Source": "earnings"
        },
        {
            "Title": "Engineers India Reports Mixed Q1 Results with Revenue Growth but Lower Net Profit",
            "Summary": "Engineers India reported quarterly EBITDA of 721 million rupees compared to 510 million rupees in the same period last year. The EBITDA margin improved to 8.28% from 8.18% year-over-year. Revenue increased significantly to 8.7 billion rupees from 6.2 billion rupees in the previous year. However, consolidated net profit declined to 654 million rupees from 916 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1755086434492,
            "Source": "earnings"
        },
        {
            "Title": "Engineers India Limited Schedules Board Meeting on August 13, 2025 for Q1 Financial Results",
            "Summary": "Engineers India Limited will hold a Board of Directors meeting on August 13, 2025 to consider and approve unaudited standalone and consolidated financial results for the first quarter ended June 30, 2025. The company has closed its trading window for securities from July 1, 2025 to August 15, 2025 under its insider trading prevention code. The trading window will reopen on August 18, 2025. All concerned parties and their immediate relatives are prohibited from trading EIL securities during the closure period.",
            "Sentiment": "neutral",
            "PublishDate": 1754039096340,
            "Source": "earnings"
        },
        {
            "Title": "Engineers India Limited Announces Executive Director Retirement",
            "Summary": "Engineers India Limited announced the retirement of Shri Asheesh Sengupta, Executive Director (Supply Chain Management), due to superannuation effective August 1, 2025. Sengupta reached the age of superannuation on July 31, 2025. The company notified stock exchanges NSE and BSE about this senior management change.",
            "Sentiment": "neutral",
            "PublishDate": 1753962910903,
            "Source": "corporate_governance"
        },
        {
            "Title": "Engineers India Invests 345.8 Million Rupees in Numaligarh Refinery",
            "Summary": "Engineers India Limited has made an additional investment in Numaligarh Refinery Ltd (NRL) for a total amount of 345.8 million rupees. The news article does not provide further details about the nature of the investment or its purpose.",
            "Sentiment": "neutral",
            "PublishDate": 1748869291000,
            "Source": "default"
        },
        {
            "Title": "Engineers India Reports Significant Growth in Q4 Results",
            "Summary": "Engineers India has announced its Q4 financial results, showing substantial year-over-year growth. The company's consolidated net profit increased to 3 billion rupees from 1.16 billion rupees in the same quarter last year. Revenue rose to 10 billion rupees from 8.05 billion rupees. EBITDA saw a significant jump to 3 billion rupees from 775 million rupees, with the EBITDA margin expanding to 29.8% from 9.62% in the previous year's quarter.",
            "Sentiment": "positive",
            "PublishDate": 1748513516000,
            "Source": "result"
        },
        {
            "Title": "Engineers India Ltd: Q4 Revenue Soars 25%, Margins Expand Significantly",
            "Summary": "Engineers India Ltd reported Q4 revenue growth of 25.5% to ₹1,010.2 crore. EBITDA tripled to ₹301 crore, with margin expanding to 29.79%. Net profit increased to ₹279.8 crore. Stock surged 5% post-earnings announcement.",
            "Sentiment": "positive",
            "PublishDate": 1748512741000,
            "Source": "earnings"
        },
        {
            "Title": "Engineers India Secures Orders Worth 2.45 Billion Rupees",
            "Summary": "Engineers India Limited has announced winning new orders valued at 2.45 billion rupees (approximately $29.5 million USD). This development indicates positive business growth and potential increased revenue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1743466239000,
            "Source": "order&deals"
        },
        {
            "Title": "Engineers India Ltd: Targets 25% Revenue Growth in FY26",
            "Summary": "Engineers India Ltd expects 25% revenue growth in FY26, with Ebitda margin of 13-14%. Current year order inflows are Rs 8,400-8,500 crore. The company is expanding into the defense sector.",
            "Sentiment": "positive",
            "PublishDate": 1743398930000,
            "Source": "earnings"
        },
        {
            "Title": "Engineers India Secures Two Orders Worth ₹730 Crore",
            "Summary": "Engineers India Limited has announced winning two new orders with a combined value of ₹730 crore (approximately $88 million). This development represents significant new business for the company, potentially boosting its project portfolio and future revenue streams.",
            "Sentiment": "positive",
            "PublishDate": 1742873093000,
            "Source": "order&deals"
        },
        {
            "Title": "Engineers India Secures 253 Crore Rupee Order",
            "Summary": "Engineers India Limited has won a new order valued at 253 crore rupees. This significant contract represents a positive development for the company, potentially boosting its project portfolio and revenue stream.",
            "Sentiment": "positive",
            "PublishDate": 1742274560000,
            "Source": "order&deals"
        },
        {
            "Title": "Engineers India Ltd: Eyes Nuclear Expansion and Middle East Push",
            "Summary": "Engineers India Ltd (EIL) is seeking to enter nuclear projects and expand business in the Middle East and North Africa. The company is in talks for nuclear energy projects, including small modular reactors. EIL has been empanelled by Saudi Aramco and secured orders from ADNOC. The firm is also exploring renewable energy acquisitions and investments in energy technology startups.",
            "Sentiment": "positive",
            "PublishDate": 1739431446000,
            "Source": "normal_news"
        },
        {
            "Title": "Engineers India Ltd: Secures ₹106 Crore Contract from Indian Oil Corporation",
            "Summary": "Engineers India Ltd has been awarded a ₹106 crore project management consultancy contract by Indian Oil Corporation for the Paradip Petrochemical Complex project in Odisha. The contract, to be completed in 10 months, involves overall project management and specific services for various units within the complex.",
            "Sentiment": "positive",
            "PublishDate": 1739429075000,
            "Source": "order&deals"
        },
        {
            "Title": "Engineers India Explores Nuclear Projects and Overseas Expansion",
            "Summary": "Engineers India Limited is planning to expand its operations into nuclear projects, leveraging its extensive experience in the hydrocarbon sector. The company is also seeking to increase its business presence in international markets, with a particular focus on the Middle East and North Africa regions.",
            "Sentiment": "positive",
            "PublishDate": 1739428006000,
            "Source": "corporate_action"
        },
        {
            "Title": "Engineers India Secures 1.06 Billion Rupee Order",
            "Summary": "Engineers India Limited has won a new order valued at 1.06 billion rupees. This significant contract represents a positive development for the company, potentially boosting its project portfolio and revenue stream.",
            "Sentiment": "positive",
            "PublishDate": 1739416120000,
            "Source": "order&deals"
        },
        {
            "Title": "Engineers India Ltd: Shares Rise 5% on Strong Project Pipeline and Margin Expansion",
            "Summary": "Engineers India Ltd (EIL) shares gained 5% over the past month, outperforming the broader market. The company reported its highest margin in years at 11% last quarter. EIL is expanding its presence in domestic and international markets, with projects in the Emirates, Saudi Arabia, and Guyana. The company is actively bidding for FEED and EPCM contracts to boost order inflows. EIL remains a major player in Indian refinery expansions and is strengthening its presence in infrastructure projects.",
            "Sentiment": "positive",
            "PublishDate": 1739359360000,
            "Source": "normal_news"
        },
        {
            "Title": "Engineers India Signs MOU with BP for Technical Support",
            "Summary": "Engineers India has signed a Memorandum of Understanding (MOU) with BP to form joint working teams. These teams will explore opportunities to provide technical support for BP's global assets, including refining, terminals and pipelines, oil and gas, and offshore/subsea portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1739265263000,
            "Source": "corporate_action"
        },
        {
            "Title": "Engineers India and BP Collaborate on Oil, Gas, and Refining Activities",
            "Summary": "Engineers India Limited (EIL) has signed an agreement with BP to collaborate on oil, gas, and refining activities. This partnership aims to combine EIL's expertise in engineering and project management with BP's global experience in the energy sector. The collaboration is expected to enhance capabilities and drive innovation in the oil and gas industry.",
            "Sentiment": "positive",
            "PublishDate": 1739265221000,
            "Source": "corporate_action"
        },
        {
            "Title": "Engineers India Ltd: Strong Q3 Profit Growth and Interim Dividend Announced",
            "Summary": "Engineers India Ltd reported a 78% YoY increase in Q3 FY25 net profit to ₹93.8 crore. Despite a 12% revenue decline, EBITDA surged 95.8% YoY to ₹98 crore. The company declared an interim dividend of ₹2 per share for FY 2024-25, with a record date of February 14, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1739178562000,
            "Source": "earnings"
        },
        {
            "Title": "Engineers India Reports Significant EBITDA Growth in Q3",
            "Summary": "Engineers India Limited has reported a substantial increase in its EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the third quarter. The company's EBITDA rose to 978 million rupees, compared to 500 million rupees in the same period last year, marking a significant year-over-year improvement in financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1739173496000,
            "Source": "earnings"
        },
        {
            "Title": "Engineers India Reports Q3 Revenue Decline",
            "Summary": "Engineers India Limited has reported a decrease in revenue for the third quarter. The company's revenue stood at 7.6 billion rupees, down from 8.7 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739173426000,
            "Source": "earnings"
        },
        {
            "Title": "Engineers India Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "Engineers India Limited has announced its financial results for the third quarter, reporting a consolidated net profit of 1.09 billion rupees. This represents a substantial increase from the 630 million rupees reported in the same quarter of the previous year, indicating a year-over-year growth in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1739173397000,
            "Source": "earnings"
        },
        {
            "Title": "Engineers India Secures 540 Million Rupee Order",
            "Summary": "Engineers India Limited has been awarded a new order valued at 540 million rupees. This order represents a significant business development for the company, potentially boosting its project portfolio and revenue stream.",
            "Sentiment": "positive",
            "PublishDate": 1738928855000,
            "Source": "order&deals"
        },
        {
            "Title": "Engineers India Secures 1200 Crore Rupee Order",
            "Summary": "Engineers India Limited has won a significant order valued at 1200 crore rupees. This substantial contract represents a major business development for the company, potentially boosting its project portfolio and financial outlook.",
            "Sentiment": "positive",
            "PublishDate": 1738558087000,
            "Source": "order&deals"
        },
        {
            "Title": "HPCL Awards PMC Services Project to Engineers India",
            "Summary": "Engineers India Limited has been awarded a Project Management Consultancy (PMC) services project by Hindustan Petroleum Corporation Limited (HPCL). The project is valued at 2.22 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738328529000,
            "Source": "order&deals"
        },
        {
            "Title": "Engineers India Reports Q2 EBITDA Decline",
            "Summary": "Engineers India Limited has reported a significant decrease in its Q2 EBITDA, which fell to 624 million rupees from 985 million rupees year-over-year. The company's Q2 EBITDA margin also saw a substantial drop, declining to 9.06% from 1248% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1730194924000,
            "Source": "result"
        },
        {
            "Title": "Engineers India Reports Q2 Revenue Decline",
            "Summary": "Engineers India Limited reported a revenue of 6.9 billion rupees for the second quarter, down from 7.9 billion rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1730194841000,
            "Source": "result"
        },
        {
            "Title": "Engineers India Reports Q2 Consolidated Net Profit",
            "Summary": "Engineers India Limited has reported a consolidated net profit of 1 billion rupees for the second quarter, compared to 1.3 billion rupees in the same period last year, indicating a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1730194819000,
            "Source": "result"
        },
        {
            "Title": "Engineers India Board Meeting for Q2 Results",
            "Summary": "<p><span class=\"neutral\">Engineers India Limited</span> has scheduled a <b>board meeting</b> on <span class=\"neutral\">October 29</span> to <b>consider and approve</b> the <span class=\"neutral\">financial results</span> for the <span class=\"neutral\">second quarter</span> of the current fiscal year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728648885000,
            "Source": "result"
        }
    ]
}