{
    "Symbol": "ENIL",
    "ISIN": "INE265F01028",
    "News": [
        {
            "Title": "ENIL Board Approves Q3FY26 Financial Results",
            "Summary": "Entertainment Network (India) Limited's Board of Directors approved unaudited standalone and consolidated financial results for quarter and nine months ended 31 December 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770731851811,
            "Source": "co_actions_results"
        },
        {
            "Title": "ENIL Gets NCLT Approval for BCCL-THPL Scheme",
            "Summary": "Entertainment Network (India) Limited announces NCLT Mumbai Bench approval of composite scheme of arrangement between promoter BCCL and Times Horizon Private Limited dated 4 February 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770271886159,
            "Source": "co_actions_results"
        },
        {
            "Title": "ENIL Board Meet on Feb 10 for Q3FY26 Results",
            "Summary": "Entertainment Network (India) Limited announces board meeting scheduled for February 10, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770120173078,
            "Source": "co_actions_results"
        },
        {
            "Title": "ENIL Expands FM Station Asset Sale to Include Hyderabad",
            "Summary": "Entertainment Network India adds Hyderabad 104.8 FM to its asset transfer deal with Abhijit Realtors, bringing total consideration to Rs. 19.60 crore for four FM stations with 0.64% revenue contribution.",
            "Sentiment": "neutral",
            "PublishDate": 1769176397363,
            "Source": "co_actions_results"
        },
        {
            "Title": "Entertainment Network India Sells Three FM Radio Stations for Rs. 12.60 Crores",
            "Summary": "Entertainment Network (India) Limited signed an MOU to transfer assets of three FM radio stations in Kanpur, Lucknow, and Nagpur to Abhijit Realtors Infraventures Private Limited for Rs. 12.60 crores plus taxes. The transaction, expected to complete by September 30, 2026, involves stations that contributed Rs. 284.90 lakhs (0.55% of total turnover) in FY2024-25 and requires regulatory approvals including from the Ministry of Information and Broadcasting.",
            "Sentiment": "neutral",
            "PublishDate": 1763282736962,
            "Source": "corporate_action"
        },
        {
            "Title": "Entertainment Network India Reports 23.7% Revenue Growth in Q2FY26, Digital Business Surges 149.5%",
            "Summary": "Entertainment Network India Limited (ENIL) recorded domestic revenues of Rs. 135.4 crores in Q2FY26, marking a 23.7% year-on-year growth. The company's digital business delivered exceptional performance with revenues of Rs. 31.5 crores, growing 149.5% year-on-year and now contributing 33% of existing traditional business compared to 15.9% in the same quarter last year. The non-FCT segment grew 42.2% to Rs. 34.5 crores, with events and IP business expanding 101.1%. Radio advertising segment faced headwinds due to muted advertiser sentiment and campaign deferrals ahead of anticipated GST benefits. EBITDA excluding digital stood at Rs. 20 crores with a margin of 19.3%. International business grew 35% to Rs. 5.9 crores. The company maintains a cash balance of Rs. 344.7 crores as of September 30, 2025. Gaana platform generated Rs. 20.54 crores in revenue, nearly double from last year, while investment in digital business reduced to Rs. 9.8 crores from Rs. 12.9 crores in Q2FY25. Management expects Gaana to reach breakeven by June-September next year and anticipates single-digit growth for radio business in coming quarters.",
            "Sentiment": "positive",
            "PublishDate": 1762879094059,
            "Source": "earnings"
        },
        {
            "Title": "Entertainment Network India Approves Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "Entertainment Network (India) Limited's Board of Directors held a meeting on November 4, 2025, where they approved the unaudited financial results for the quarter and six months ended September 30, 2025. The board considered and approved both standalone and consolidated financial results and took on record the Limited Review Report for these results. The meeting was held at the company's registered office in Mumbai from 2:30 p.m. to 7:50 p.m. The financial results will be available on the company's website and stock exchange platforms. The trading window for the company's securities will reopen after 48 hours once the financial results are made generally available.",
            "Sentiment": "neutral",
            "PublishDate": 1762278983564,
            "Source": "earnings"
        },
        {
            "Title": "Entertainment Network Reports Mixed Q2 Results with EBITDA Growth but Margin Decline",
            "Summary": "Entertainment Network reported Q2 EBITDA of 114 million rupees compared to 112 million rupees in the same period last year, representing a year-over-year increase. However, the company's EBITDA margin decreased to 8.06% from 9.82% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762268202743,
            "Source": "earnings"
        },
        {
            "Title": "Entertainment Network Reports Narrower Loss Despite Revenue Growth in Q2",
            "Summary": "Entertainment Network posted a consolidated net loss of 41 million rupees in Q2, compared to a loss of 42 million rupees in the same period last year. The company's revenue increased to 1.4 billion rupees from 1.12 billion rupees year-over-year, representing growth in the top line while losses remained relatively stable.",
            "Sentiment": "neutral",
            "PublishDate": 1762267773745,
            "Source": "earnings"
        },
        {
            "Title": "Entertainment Network (India) Limited Announces Promoter Reorganization as BCCL Transfers Stake to Times Horizon",
            "Summary": "Entertainment Network (India) Limited disclosed a proposed reorganization involving its promoter Bennett Coleman and Company Limited (BCCL) and Times Horizon Private Limited (THPL). BCCL plans to demerge its non-publishing business, including education, investment, broadcasting, media, entertainment and allied activities, to THPL through a scheme of arrangement. As part of this reorganization, BCCL's 71.15% shareholding in ENIL (3,39,18,400 equity shares) will be transferred to THPL, making THPL the new promoter of ENIL. The companies entered into a reorganization agreement on September 23, 2025. Under the scheme, THPL will issue one equity share to each BCCL shareholder for every BCCL share held. Additionally, THPL will allot 2,86,955 equity shares to Sanmati Properties Limited on a preferential basis. Following the allotment, certain entities including Sanmati Properties Limited, Arth Udyog Limited, TM Investments Limited, Vineet Jain and Bharat Nidhi Limited will collectively hold 50.05% voting rights in THPL. The reorganization requires approvals from the National Company Law Tribunals and Competition Commission of India.",
            "Sentiment": "neutral",
            "PublishDate": 1758887750426,
            "Source": "corporate_action"
        },
        {
            "Title": "Entertainment Network India's Appeal Against Music Association Gets Stay from Madras High Court",
            "Summary": "Entertainment Network (India) Limited received a favorable development in its litigation with The South Indian Music Companies Association. The Madras High Court division bench stayed a previous single judge order and tagged the company's appeal to be heard alongside a related appeal involving Phonographic Performance Limited. The interim stay will remain in effect until the next hearing date, which has not yet been scheduled. This follows earlier litigation initiated by SIMCA before the Madras High Court.",
            "Sentiment": "positive",
            "PublishDate": 1758353895784,
            "Source": "stock"
        },
        {
            "Title": "Entertainment Network (India) Limited Ordered to Produce Music Logs and Compute Royalties for SIMCA Members",
            "Summary": "The Madras High Court has directed Entertainment Network (India) Limited to produce music logs for SIMCA members covering the period from August 2010 to December 2020. The company must also compute royalties payable at the needle-per-hour rate according to individual agreements with SIMCA members and furnish this computation to the court within four weeks. The order does not require the company to make any payments. The matter is scheduled for compliance reporting on 26 September 2025. Entertainment Network plans to appeal the order and is currently seeking legal advice to assess potential impact and implications on the company.",
            "Sentiment": "negative",
            "PublishDate": 1756281124707,
            "Source": "stock"
        },
        {
            "Title": "Entertainment Network India Reports 3.2% Revenue Growth in Q1FY26, Digital Business Surges 41%",
            "Summary": "Entertainment Network (India) Limited reported domestic revenue of Rs. 113 crores for Q1FY26, marking a 3.2% year-on-year growth. The company's digital segment led growth with a 41.2% increase, while the non-FCT segment grew 33%. However, radio FCT advertising declined 12.1% to Rs. 66.1 crores due to high base from previous year's political advertising and geopolitical headwinds. EBITDA stood at Rs. 6.2 crores with 3.6% growth, while PAT was Rs. 1 crore. Gaana revenue reached Rs. 18 crores with 87.6% year-on-year growth, contributing 40.7% of total radio revenues. Digital investments decreased to Rs. 9.8 crores from Rs. 14.2 crores in the previous year. The company maintains a cash balance of Rs. 336 crores and expects Gaana to break even by early next year. Event business grew 58% despite cancellations due to geopolitical situations. Management expects modest growth in radio business and significant expansion in events business for the remainder of FY26.",
            "Sentiment": "positive",
            "PublishDate": 1754393144745,
            "Source": "earnings"
        },
        {
            "Title": "Entertainment Network (India) Reports Q1FY26 Results with 3.2% Revenue Growth",
            "Summary": "Entertainment Network (India) Limited released its Q1FY26 investor presentation showing mixed financial performance. On a standalone basis, total income increased 3.2% to Rs 1,129.6 million compared to Rs 1,094.6 million in Q1FY25. EBITDA grew 3.6% to Rs 61.9 million from Rs 59.7 million. However, the company reported losses with PAT at negative Rs 51.4 million, though this improved from negative Rs 53.7 million in the previous year. Digital revenue contributed Rs 256.6 million, representing 40.7% of radio revenue. The company maintains a strong cash position with net cash of Rs 3.35 billion. On consolidated basis, total income rose 3.0% to Rs 1,169.4 million with EBITDA at Rs 75.7 million. The company's digital platform Mirchi Digital reported over 92 million monthly active users with strong social media presence across platforms including 39.7 million YouTube followers and 20.8 million Facebook followers. The presentation highlighted various solution business activities and international operations across UAE, Qatar, and Bahrain.",
            "Sentiment": "neutral",
            "PublishDate": 1753870873907,
            "Source": "earnings"
        },
        {
            "Title": "Entertainment Network India Focuses on Digital and Events for Growth Transformation",
            "Summary": "Entertainment Network (India) is accelerating its multimedia transformation strategy with digital platforms and events identified as key drivers for its next growth phase. The company's Gaana platform and solutions business are positioned to deliver scalable and cost-efficient operations for future content delivery.",
            "Sentiment": "positive",
            "PublishDate": 1753804703764,
            "Source": "stock"
        },
        {
            "Title": "Entertainment Network (India) Reports Quarterly Loss of ₹514.70 Lakhs",
            "Summary": "Entertainment Network (India) Limited announced its quarterly results for the period ended June 30, 2025. The company reported a standalone net loss of ₹514.70 lakhs compared to a loss of ₹536.56 lakhs in the same quarter last year. Revenue from operations increased to ₹11,114.84 lakhs from ₹10,943.33 lakhs year-over-year. On a consolidated basis, the company posted a net loss of ₹526.24 lakhs versus ₹544.84 lakhs in the previous year's quarter. Consolidated revenue from operations rose to ₹11,512.55 lakhs from ₹11,346.60 lakhs. The company's earnings per share stood at negative ₹1.08 for standalone results and negative ₹1.10 for consolidated results. The Board of Directors approved these results on July 29, 2025. The company continues to face ongoing legal proceedings with Phonographic Performance Limited, with the matter pending before the Supreme Court of India.",
            "Sentiment": "negative",
            "PublishDate": 1753798830578,
            "Source": "earnings"
        },
        {
            "Title": "Entertainment Network (India) Limited Schedules Q1 FY26 Earnings Conference Call for July 30, 2025",
            "Summary": "Entertainment Network (India) Limited has announced its quarterly earnings conference call scheduled for Wednesday, July 30, 2025, at 4:00 PM IST. The call will be led by CEO Yatish Mehrishi and CFO Sanjay Ballabh to discuss the company's financial performance. Investors and analysts can participate through multiple dial-in numbers including universal access numbers for India, as well as international toll-free numbers for USA, UK, Singapore, and Hong Kong. The company has also provided pre-registration options for participants.",
            "Sentiment": "neutral",
            "PublishDate": 1753383048875,
            "Source": "earnings"
        },
        {
            "Title": "Entertainment Network Reports Q4 Results and Recommends Dividend",
            "Summary": "Entertainment Network has announced its Q4 results and recommended a final dividend. The company's Q4 EBITDA increased to 295 million rupees from 277 million rupees year-over-year. The EBITDA margin also improved to 18.61% from 18.37% in the same period. Additionally, the company has recommended a final dividend of 2 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747409629000,
            "Source": "result"
        },
        {
            "Title": "Entertainment Network Reports Q4 Profit and Revenue Growth",
            "Summary": "Entertainment Network has reported its Q4 consolidated net profit at 121 million rupees, up from 87 million rupees year-over-year and 91 million rupees quarter-over-quarter. The company's Q4 revenue stood at 1.6 billion rupees, compared to 1.5 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747409540000,
            "Source": "result"
        },
        {
            "Title": "Entertainment Network Reports Decline in Q3 Net Profit",
            "Summary": "Entertainment Network has reported a significant decrease in its third-quarter consolidated net profit, which fell to 91 million rupees from 239 million rupees in the same period last year. The company's revenue remained stable at 1.6 billion rupees for the quarter, showing no year-over-year change.",
            "Sentiment": "negative",
            "PublishDate": 1739146438000,
            "Source": "earnings"
        },
        {
            "Title": "Entertainment Network India Reports Decline in Q3 EBITDA",
            "Summary": "Entertainment Network India Limited has reported a significant decrease in its third-quarter EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization). The company's EBITDA for Q3 fell to 305 million rupees from 458 million rupees in the same period last year. Additionally, the EBITDA margin contracted to 19.17% from 28.51% year-over-year, indicating a substantial reduction in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1738932660000,
            "Source": "earnings"
        },
        {
            "Title": "Entertainment Network Reports Decline in Q3 Net Profit",
            "Summary": "Entertainment Network has reported a significant decrease in its consolidated net profit for the third quarter. The company's net profit fell to 91 million rupees, down from 239 million rupees in the same period last year. However, the revenue remained stable at 1.6 billion rupees, showing no year-over-year change.",
            "Sentiment": "negative",
            "PublishDate": 1738932654000,
            "Source": "earnings"
        },
        {
            "Title": "Entertainment Network to Acquire 50% Stake in Saudi Arabian Media Company",
            "Summary": "Entertainment Network has signed an agreement to acquire up to 50% equity in Ninety-Nine Audiovisual Media Production LLC, a Saudi Arabian company. The investment will be made through a share subscription worth up to SAR 5 million (approximately Rs. 11 crore).",
            "Sentiment": "positive",
            "PublishDate": 1729349295000,
            "Source": "corporate_action"
        }
    ]
}