{
    "Symbol": "ENRIN",
    "ISIN": "INE1NPP01017",
    "News": [
        {
            "Title": "Siemens Energy India Board Meet Set for Feb 13",
            "Summary": "Siemens Energy India Limited has scheduled a board meeting for February 13, 2026, to consider Q1FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770739665645,
            "Source": "co_actions_results"
        },
        {
            "Title": "Siemens Energy Sets Record Date for FY25 Dividend",
            "Summary": "Siemens Energy India Limited fixes January 30, 2026 as record date for dividend entitlement for FY25, with 2nd AGM scheduled for February 13, 2026 via video conferencing.",
            "Sentiment": "neutral",
            "PublishDate": 1768022354783,
            "Source": "co_actions_results"
        },
        {
            "Title": "Siemens Energy India Sets Record Date for FY25 Dividend",
            "Summary": "Siemens Energy India Limited announces January 30, 2026 as record date for dividend eligibility for FY25, with payment scheduled from February 18, 2026 subject to AGM approval.",
            "Sentiment": "neutral",
            "PublishDate": 1767968805436,
            "Source": "co_actions_results"
        },
        {
            "Title": "Siemens Energy India Share Transfer Among Promoters",
            "Summary": "Siemens Energy India Limited announces inter-promoter transfer of 17.81 million shares (5% stake) worth ₹712.24 crores between group entities on December 16, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765947816581,
            "Source": "co_actions_results"
        },
        {
            "Title": "Siemens Ltd promoter group share transfer",
            "Summary": "Siemens Energy Holdco B.V. sold 14,503,026 equity shares (4.07%) to Siemens International Holding B.V. through inter-se transfer on December 16, 2025, maintaining overall promoter group holding at 75.00%.",
            "Sentiment": "neutral",
            "PublishDate": 1765945900143,
            "Source": "co_actions_results"
        },
        {
            "Title": "Siemens Energy India Holds Analyst Meet, Reports Strong FY25 Performance with 67% Order Growth",
            "Summary": "Siemens Energy India conducted an analyst and investor meet presenting its FY25 results, showing order entry of INR 131.1 billion (67% growth) and revenue of INR 78.3 billion with 19.3% EBITDA margin. The company highlighted its position as a leading energy infrastructure provider with INR 162.1 billion order backlog and outlined growth opportunities in India's expanding power sector driven by electrification and renewable energy transition.",
            "Sentiment": "positive",
            "PublishDate": 1765338711703,
            "Source": "stock"
        },
        {
            "Title": "Siemens Energy India Reports Strong Q4 Results with 27% Revenue Growth and 200% Dividend",
            "Summary": "Siemens Energy India Limited announced quarterly results with revenue up 27% to Rs 2,646 crore and profit after tax rising 31% to Rs 360 crore, while order backlog increased 47% to Rs 16,205 crore. The Board recommended a dividend of Rs 4 per equity share of Rs 2 each (200%) and approved the appointment of Parikh Parekh & Associates as Secretarial Auditors for five years from FY 2025-26 to 2029-30.",
            "Sentiment": "positive",
            "PublishDate": 1763995238948,
            "Source": "corporate_action"
        },
        {
            "Title": "Siemens Energy India: Seven Siemens Entities Execute Shareholders' Agreement",
            "Summary": "Seven Siemens entities executed a shareholders' agreement on July 31, 2025, to regulate their relationship as shareholders of Siemens Energy India Limited. The parties include Siemens AG, Siemens International Holding B.V., Siemens Metals Technologies Vermögensverwaltungs GmbH, Siemens Energy AG, Siemens Energy Global GmbH & Co. KG, Siemens Energy Holding B.V., and Siemens Energy Holdco B.V. The agreement establishes board composition rights, with Siemens Energy Global GmbH & Co. KG entitled to nominate one non-independent director and Siemens AG nominating all remaining non-independent directors. Siemens AG will nominate the CEO after consultation with Siemens Energy Global GmbH & Co. KG and will nominate the CFO. The agreement includes provisions for the Siemens Energy parties to potentially acquire majority control, which would alter certain governance arrangements. The agreement remains valid until August 31, 2030, unless terminated earlier under specified conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1753974405504,
            "Source": "corporate_governance"
        },
        {
            "Title": "Siemens Energy India Faces ₹443.76 Million Arbitration Ruling Loss in Russian Contract Dispute",
            "Summary": "Siemens Energy India Limited received an unfavorable ruling from the arbitration court of St. Petersburg, Russia regarding a disputed supply contract with Siemens Energy LLC Russia (now Neftegaz & Energetika LLC). The court declared the supply contract dated July 16, 2021, and advance payments made under it as invalid. The court awarded ₹443.76 million (USD 5,165,129.62) plus 8% annual interest from May 30, 2025, to be paid by Siemens Energy India. The dispute originated from a contract awarded in June 2020, with an advance payment of ₹349.96 million received in July 2020. Siemens Energy India issued a force majeure notice in September 2022 and terminated the contract in October 2022. The company believes the ruling is unsustainable in law and contract and intends to file an appeal.",
            "Sentiment": "negative",
            "PublishDate": 1753179705863,
            "Source": "stock"
        },
        {
            "Title": "Siemens Energy India: Q2 Profit Surges 37%, Shares Hit New High",
            "Summary": "Siemens Energy India reported a 57% increase in Q2 revenue to Rs 1,879 crore and a 37% rise in net profit to Rs 246 crore. The company's shares reached a fresh high of Rs 3,106.5, up 3.6% intraday. Jefferies expects 50% EPS growth CAGR till FY2027. The company is investing Rs 460 crore to double power transformer capacity by December 2025.",
            "Sentiment": "positive",
            "PublishDate": 1751956485000,
            "Source": "earnings"
        },
        {
            "Title": "Siemens Energy India: Analysts Bullish on Power Capex Play",
            "Summary": "Jefferies initiates 'Buy' rating with ₹3,500 target price, implying 17% upside. Motilal Oswal raises target to ₹3,300. Q2FY25 results show 24% QoQ revenue growth and 19.1% EBITDA margin. Analysts expect 50% EPS CAGR and 30% revenue CAGR over FY24-27.",
            "Sentiment": "positive",
            "PublishDate": 1751944120000,
            "Source": "earnings"
        },
        {
            "Title": "Siemens Energy: Q2 Profit Surges 37%, Revenue Up 57% Despite Margin Pressure",
            "Summary": "Siemens Energy India Ltd. reported Q2 revenue of Rs 1,879 crore, up 57% YoY. Net profit increased 37% to Rs 246 crore. EBITDA rose 32.3%, but margin contracted to 19% from 22.6% due to higher raw material costs. Power transmission revenue surged 67.6% to Rs 1,014 crore, while power generation rose 46.3% to Rs 866 crore. Stock price increased 3.4% post-results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1751877038000,
            "Source": "earnings"
        },
        {
            "Title": "Siemens Energy India Reports Q4 Financial Results",
            "Summary": "Siemens Energy India has released its Q4 financial results. The company's EBITDA increased to 3.59 billion rupees from 2.70 billion rupees year-over-year. However, the EBITDA margin decreased to 19.07% from 22.52% in the same period. Revenue rose to 18.79 billion rupees from 11.97 billion rupees year-over-year. The company's net profit also improved, reaching 2.46 billion rupees compared to 1.81 billion rupees in the previous year's quarter.",
            "Sentiment": "positive",
            "PublishDate": 1751872957000,
            "Source": "result"
        }
    ]
}