{
    "Symbol": "ENTERO",
    "ISIN": "INE010601016",
    "News": [
        {
            "Title": "Entero Healthcare Q3FY26 Revenue Rises to ₹1,067.36 Million",
            "Summary": "Entero Healthcare Solutions reported Q3FY26 standalone revenue of ₹1,067.36 million, up from ₹1,011.52 million in Q3FY25. However, net profit declined to ₹8.05 million from ₹107.83 million due to exceptional items worth ₹44.97 million related to new labour codes.",
            "Sentiment": "neutral",
            "PublishDate": 1770907974827,
            "Source": "co_actions_results"
        },
        {
            "Title": "Entero Healthcare Completes 51.51% Stake Acquisition",
            "Summary": "Entero Healthcare Solutions Limited has successfully completed the acquisition of a majority 51.51% equity stake in Anand Chemiceutics Private Limited, as announced in regulatory filing.",
            "Sentiment": "positive",
            "PublishDate": 1770469882849,
            "Source": "co_actions_results"
        },
        {
            "Title": "Entero Healthcare Q3FY26 Earnings Call on Feb 7",
            "Summary": "Entero Healthcare Solutions announces earnings call on February 07, 2026 to discuss Q3FY26 financial results with analysts and investors, hosted by DAM Capital Advisors.",
            "Sentiment": "neutral",
            "PublishDate": 1770372029997,
            "Source": "co_actions_results"
        },
        {
            "Title": "Entero Healthcare unit faces 3-day license suspension",
            "Summary": "Entero Healthcare's subsidiary Atreja Healthcare Solutions gets temporary drug license suspension from Jan 30-Feb 1, 2026, with potential revenue loss of ₹1.88 million for regulatory violations.",
            "Sentiment": "negative",
            "PublishDate": 1769524876773,
            "Source": "stocks"
        },
        {
            "Title": "Entero Healthcare Auditor Firm Converts to LLP",
            "Summary": "Entero Healthcare Solutions' statutory auditor M S K A & Associates has converted to M S K A & Associates LLP effective January 13, 2026, with no change in audit engagement or obligations.",
            "Sentiment": "neutral",
            "PublishDate": 1768453351981,
            "Source": "stocks"
        },
        {
            "Title": "SMALLCAP World Fund exits Entero Healthcare stake",
            "Summary": "SMALLCAP World Fund, Inc. completely disposed of its 5.24% stake in Entero Healthcare Solutions through open market transactions on December 29, 2025, selling 2,277,083 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1767166352331,
            "Source": "co_actions_results"
        },
        {
            "Title": "Entero Healthcare Solutions Grants 73,060 Stock Options to Employees",
            "Summary": "Entero Healthcare Solutions Limited granted 73,060 employee stock options under its 2023 ESOP plan with an exercise price of INR 804 per option. The options will vest between 1-4 years from the grant date and are available to eligible employees of the company.",
            "Sentiment": "positive",
            "PublishDate": 1765028569727,
            "Source": "corporate_action"
        },
        {
            "Title": "Entero Healthcare Solutions Receives Rating Affirmation from India Ratings",
            "Summary": "India Ratings and Research affirmed Entero Healthcare Solutions Limited's Long-Term Issuer Rating at IND A/Stable. The rating affirmation was communicated to stock exchanges BSE and NSE as part of regulatory compliance requirements.",
            "Sentiment": "positive",
            "PublishDate": 1764850013947,
            "Source": "corporate_action"
        },
        {
            "Title": "Entero Healthcare Reports 20.8% Revenue Growth, Announces INR 1,000 Crore MedTech Acquisition Strategy",
            "Summary": "Entero Healthcare Solutions delivered quarterly revenue growth of 20.8% year-on-year to INR 1,571 crores with EBITDA margins expanding to 4%, while announcing plans to complete seven MedTech acquisitions worth INR 1,000 crores in proforma revenues. The company expects these acquisitions to boost gross margins by 70-90 basis points and EBITDA margins by 50-75 basis points, with 60% of M&A activity focused on the higher-margin MedTech segment.",
            "Sentiment": "positive",
            "PublishDate": 1763642166159,
            "Source": "earnings"
        },
        {
            "Title": "Entero Healthcare Reports 21% Revenue Growth in Q2FY26, Expands MedTech Operations Through Acquisitions",
            "Summary": "Entero Healthcare Solutions reported quarterly revenue of Rs. 1,571 crore, marking 21% year-on-year growth. The company achieved 4% EBITDA margin and 2.3% PAT margin for the quarter. Revenue growth adjusted for net margin basis impact was 23.4% year-on-year, with organic growth at 13.4%. The company improved gross margins by 29 basis points quarter-on-quarter to 10.2% and reduced net working capital days to 63 from 66 in the previous quarter. Return on capital employed increased to 13.8% from 11.5% in the last quarter. Entero announced margin-accretive acquisitions in the MedTech segment expected to generate Rs. 1,000 crore in annualized revenue. The acquisitions are projected to improve gross margins by 70-90 basis points and EBITDA margins by 50-75 basis points. The company operates 113 warehouses across 47 cities, serves 85,300 retail pharmacies and 2,800 hospitals, and maintains relationships with 2,800 healthcare product manufacturers.",
            "Sentiment": "positive",
            "PublishDate": 1763003257746,
            "Source": "corporate_action"
        },
        {
            "Title": "Entero Healthcare Promotes Abhitesh Kumar to Chief Growth Officer",
            "Summary": "Entero Healthcare Solutions Limited's Board of Directors approved the promotion of Abhitesh Kumar from President-Retail Business New Initiatives to Chief Growth Officer. Kumar, who holds a B.Tech in Mechanical Engineering from BITS Pilani and a Post Graduate program in Business Management from IIM Calcutta, has over a decade of experience with 4 years in the pharmaceutical industry. The company stated that Kumar has been instrumental in scaling Entero's retail business since inception and expects this elevation to further accelerate the company's growth journey.",
            "Sentiment": "positive",
            "PublishDate": 1762988768661,
            "Source": "corporate_governance"
        },
        {
            "Title": "Entero Healthcare Allots 2,030 Equity Shares Under ESOP and Reports IPO Proceeds Monitoring",
            "Summary": "Entero Healthcare Solutions Limited allotted 2,030 equity shares of Rs. 10 each to eligible employees under its Employee Stock Option Plan 2023 at an exercise price of Rs. 804 per share. The allotment increased the company's paid-up equity share capital from Rs. 43.51 crore to Rs. 43.51 crore, with total shares rising to 4.35 crore. The shares are freely transferable without lock-in restrictions. Additionally, ICRA Limited submitted a monitoring agency report for the quarter ended September 30, 2025, regarding utilization of IPO proceeds. The report showed no material deviation from stated objectives, with Rs. 930.07 crore utilized out of Rs. 951.33 crore net proceeds. The company has Rs. 21.26 crore in unutilized funds, with Rs. 21.73 crore deployed in fixed deposits and current accounts. Key utilization areas included Rs. 142.50 crore for debt repayment, Rs. 468.74 crore for working capital requirements, Rs. 237 crore for acquisitions, and Rs. 81.83 crore for general corporate purposes including salary payments and rent expenses.",
            "Sentiment": "neutral",
            "PublishDate": 1762987806295,
            "Source": "corporate_action"
        },
        {
            "Title": "Entero Healthcare Solutions Reports Quarterly Financial Results for September 2025",
            "Summary": "Entero Healthcare Solutions Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The Board of Directors approved these results at a meeting held on November 12, 2025. On a standalone basis, the company reported total income of Rs. 1,074.46 million for the quarter and profit for the period of Rs. 56.97 million. On a consolidated basis, total income was Rs. 4,757.99 million for the quarter with profit of Rs. 361.78 million. During the period, the company entered into share purchase agreements with several entities, making them subsidiaries. The company also allotted 1,200 equity shares at a premium of Rs. 794 per share under employee stock options. The company operates in pharmaceutical and surgical products trading and has expanded through various acquisitions during the reporting period.",
            "Sentiment": "neutral",
            "PublishDate": 1762979888793,
            "Source": "earnings"
        },
        {
            "Title": "Entero Healthcare Solutions Reports Strong Q2 Growth, Plans Strategic Acquisitions",
            "Summary": "Entero Healthcare Solutions announced plans to acquire an 80% stake in BioAide Technologies and a 51% stake in Anand Chemiceutics. The company reported Q2 consolidated net profit of 316 million rupees compared to 236 million rupees year-over-year. Revenue increased to 15.71 billion rupees from 13 billion rupees year-over-year. EBITDA rose to 621 million rupees from 425 million rupees year-over-year, with EBITDA margin improving to 3.95% from 3.26% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762955050461,
            "Source": "order&deals"
        },
        {
            "Title": "Entero Healthcare Solutions Schedules Earnings Call for Q2FY26 Results",
            "Summary": "Entero Healthcare Solutions Limited has announced an earnings call scheduled for November 13, 2025, at 15:00 hrs IST to discuss its unaudited financial results for the quarter and half year ended September 30, 2025. The call will be hosted by DAM Capital Advisors Limited and will feature key management speakers including Managing Director CEO Prabhat Agrawal, Whole Time Director COO Prem Sethi, and Group CFO Balakrishnan Natesan Kaushik. The earnings call will be accessible through provided dial-in numbers for analysts and investors, with discussions based on publicly available information.",
            "Sentiment": "neutral",
            "PublishDate": 1762541354797,
            "Source": "earnings"
        },
        {
            "Title": "Entero Healthcare Solutions Approves Sale of Suprabhat Pharmaceutical and Plans Majority Stake Acquisition in Ace Cardiopathy Solutions",
            "Summary": "Entero Healthcare Solutions' board has approved the complete sale of its subsidiary Suprabhat Pharmaceutical. Additionally, the company plans to acquire a 60% stake in Ace Cardiopathy Solutions. These strategic moves represent significant portfolio restructuring for the healthcare company.",
            "Sentiment": "neutral",
            "PublishDate": 1759132849316,
            "Source": "order&deals"
        },
        {
            "Title": "Entero Healthcare Solutions Reports 28% Revenue Growth to Rs 1,404 Crores in Q1 FY26",
            "Summary": "Entero Healthcare Solutions Limited reported revenue of Rs 1,404 crores for the quarter ended June 30, 2025, representing a 28% year-over-year increase. The healthcare distribution company achieved gross profit of Rs 140 crores, up 40% year-over-year, with gross margin expanding to 9.9%. EBITDA grew 66% to Rs 50 crores with margin improving to 3.6%, while profit after tax increased 47% to Rs 30 crores. The company serves over 71,000 retail pharmacies and 2,500+ hospitals across 469 districts through 102 warehouses, offering 74,700+ SKUs from 2,600+ manufacturers. Net working capital improved from 71 days to 66 days. Management targets 30% revenue growth for FY26, EBITDA margin above 4%, and working capital reduction to 60 days. The company added 11,000 customers during the quarter and announced Rs 400+ crores of acquisitions in the previous quarter, targeting Rs 500 crores of inorganic revenue addition in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1755599249763,
            "Source": "earnings"
        },
        {
            "Title": "GIC Private Limited Reduces Stake in Entero Healthcare Solutions to 3.141%",
            "Summary": "GIC Private Limited, acting on behalf of the Government of Singapore, sold 9,846 equity shares in Entero Healthcare Solutions Limited through open market transactions. The sale reduced GIC's shareholding from 3.164% to 3.141% of the total share capital. The transaction was completed on August 11, 2025. Entero Healthcare Solutions is listed on both the National Stock Exchange of India Limited and BSE Limited. The company's total equity share capital stands at 43,508,907 shares. GIC previously held 5.16% stake in the company and has been gradually reducing its position through multiple transactions since February 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1755061621097,
            "Source": "corporate_action"
        },
        {
            "Title": "Entero Healthcare Solutions Reports Strong Q1 FY2026 Results with Revenue Up 19.3% and Net Profit Surging 115.8%",
            "Summary": "Entero Healthcare Solutions delivered robust financial performance in Q1 FY2026. Total revenue increased 19.3% year-over-year to ₹5,059.50 crores from ₹4,239.30 crores in the previous year. Net profit showed significant growth of 115.8% to ₹173.93 crores compared to ₹80.60 crores in Q1 FY2025. Profit before tax more than doubled, rising 115.4% to ₹232.95 crores from ₹108.15 crores. The company's profitability metrics improved substantially with EBITDA margin expanding to 5.3% from 3.7% in the prior year quarter. Earnings per share increased to ₹31.05 from ₹14.40 year-over-year. The healthcare distribution company's strong performance indicates successful execution of growth and efficiency initiatives across its business operations.",
            "Sentiment": "positive",
            "PublishDate": 1754822940892,
            "Source": "earnings"
        },
        {
            "Title": "Entero Healthcare Solutions Reports Q1 FY2026 Results, Extends Pharma Acquisition Deadline",
            "Summary": "Entero Healthcare Solutions Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, and extended the deadline for acquiring equity shares in four pharma companies through an SPV from August 15, 2025 to November 30, 2025. On a standalone basis, the company reported revenue from operations of Rs. 793.52 million and profit of Rs. 69.57 million for the quarter. On a consolidated basis, revenue from operations reached Rs. 14,038.19 million with profit of Rs. 302.32 million. The company acquired a 70% stake in Ramson Medical Distributors Private Limited on June 30, 2025, and increased its stake in Peerless Biotech Private Limited to 76%. Three non-operating subsidiaries were struck off during the quarter. The acquisition extension covers Well Wisher Pharma Private Limited, Khera Medisolutions Private Limited, AV Medisolutions Private Limited, and Anand Medical Distributors.",
            "Sentiment": "positive",
            "PublishDate": 1754658251275,
            "Source": "earnings"
        },
        {
            "Title": "Entero Healthcare Solutions Reports Strong Q1 Growth with 39% Jump in Net Profit",
            "Summary": "Entero Healthcare Solutions delivered robust quarterly results with consolidated net profit rising to 278 million rupees from 200 million rupees year-over-year. Revenue increased significantly to 14 billion rupees compared to 10.97 billion rupees in the same period last year. The company's EBITDA grew to 501 million rupees from 302 million rupees year-over-year, while EBITDA margin improved to 3.57% from 2.75% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754656781515,
            "Source": "earnings"
        },
        {
            "Title": "Entero Healthcare Solutions Reports Q4 Financial Results",
            "Summary": "Entero Healthcare Solutions has announced its Q4 financial results. The company's EBITDA increased to 489 million rupees from 289 million rupees year-over-year. The EBITDA margin improved to 3.65% from 2.79% in the same period. Consolidated net profit rose to 257 million rupees, up from 210 million rupees year-over-year and 254 million rupees quarter-over-quarter. Revenue for Q4 reached 13.4 billion rupees, compared to 10.34 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748355528000,
            "Source": "result"
        },
        {
            "Title": "Entero Healthcare Solutions Acquires Aayu Chemist App and Medcords Platform",
            "Summary": "Entero Healthcare Solutions has announced the acquisition of the Aayu Chemist app and Medcords platform from Medcords Healthcare. This strategic move is likely aimed at expanding Entero's digital healthcare capabilities and enhancing its market presence in the healthcare technology sector.",
            "Sentiment": "positive",
            "PublishDate": 1742363394000,
            "Source": "corporate_action"
        },
        {
            "Title": "Entero Healthcare Solutions Invests 170 Million Rupees in Getwell Medicare",
            "Summary": "Entero Healthcare Solutions has made a significant investment of 170 million rupees in Getwell Medicare shares. This move indicates a strategic financial decision by Entero Healthcare Solutions to expand its portfolio or strengthen its position in the healthcare sector.",
            "Sentiment": "positive",
            "PublishDate": 1741264528000,
            "Source": "corporate_action"
        },
        {
            "Title": "Entero Healthcare Solutions Reports Strong Q3 Financial Results",
            "Summary": "Entero Healthcare Solutions has announced its Q3 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit reached 254 million rupees, compared to 68 million rupees in the same quarter last year and 236 million rupees in the previous quarter. Revenue also saw a substantial increase, rising to 13.6 billion rupees from 9.9 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739405790000,
            "Source": "earnings"
        },
        {
            "Title": "Entero Healthcare Solutions Reports Improved Q3 EBITDA and Margin",
            "Summary": "Entero Healthcare Solutions has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 500 million rupees from 304 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 3.68% from 2.88% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739362463000,
            "Source": "earnings"
        },
        {
            "Title": "Entero Healthcare Solutions Reports Strong Q3 Financial Results",
            "Summary": "Entero Healthcare Solutions has announced its Q3 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit increased to 254 million rupees, up from 68 million rupees in the same quarter last year and 236 million rupees in the previous quarter. Revenue also saw substantial growth, reaching 13.6 billion rupees compared to 9.9 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739362394000,
            "Source": "earnings"
        },
        {
            "Title": "Entero Healthcare to Consider Q3 Results on February 12",
            "Summary": "Entero Healthcare Solutions Limited has announced that it will consider and approve its financial results for the third quarter on February 12. This meeting will likely provide insights into the company's performance for the latest fiscal period.",
            "Sentiment": "neutral",
            "PublishDate": 1738591516000,
            "Source": "result"
        },
        {
            "Title": "Entero Healthcare to Acquire Radha Swami Medico House",
            "Summary": "Entero Healthcare has announced plans to acquire a 100% stake in Radha Swami Medico House for 51 million rupees. This acquisition is aimed at expanding Entero Healthcare's pharmaceutical distribution business.",
            "Sentiment": "positive",
            "PublishDate": 1731465544000,
            "Source": "corporate_action"
        },
        {
            "Title": "Entero Healthcare to Acquire Shree Enterprises",
            "Summary": "Entero Healthcare has announced plans to acquire a 100% stake in Shree Enterprises for 231 million rupees. This strategic move is aimed at expanding Entero Healthcare's pharmaceutical distribution reach.",
            "Sentiment": "positive",
            "PublishDate": 1731463593000,
            "Source": "corporate_action"
        },
        {
            "Title": "Entero Healthcare Solutions Reports Strong Q2 Financial Results",
            "Summary": "Entero Healthcare Solutions has announced its Q2 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 236 million rupees from 52 million rupees in the same quarter last year. Revenue grew to 13 billion rupees from 9.96 billion rupees. EBITDA rose to 425 million rupees from 285 million rupees, with the EBITDA margin improving to 3.27% from 2.86%.",
            "Sentiment": "positive",
            "PublishDate": 1731455706000,
            "Source": "result"
        },
        {
            "Title": "Entero Healthcare Solutions: Poised for Pharma Distribution Consolidation",
            "Summary": "HDFC Securities reports that Entero Healthcare Solutions is well-positioned to consolidate the pharmaceutical distribution sector. The full analysis is available to NDTV Profit subscribers.",
            "Sentiment": "positive",
            "PublishDate": 1729513241000,
            "Source": "normal_news"
        }
    ]
}