{
    "Symbol": "EPACKPEB",
    "ISIN": "INE0MLS01022",
    "News": [
        {
            "Title": "EPack Prefab maintains FY26 guidance despite Q3 dip",
            "Summary": "EPack Prefab Technologies maintains ₹1,500-1,550 crore revenue guidance for FY26 despite Q3 sequential decline. Company expects strong Q4 recovery with ₹450-500 crore revenue as delayed projects resume.",
            "Sentiment": "positive",
            "PublishDate": 1769057697372,
            "Source": "co_actions_results"
        },
        {
            "Title": "Epack Prefab Q3 EBITDA Rises 21% to ₹326 Crores",
            "Summary": "Epack Prefab Technologies reports strong Q3 EBITDA growth of 21.2% year-on-year to ₹326 crores, though margin slightly compressed to 10.02% from previous year's 10.11%.",
            "Sentiment": "positive",
            "PublishDate": 1769006619956,
            "Source": "co_actions_results"
        },
        {
            "Title": "EPack Prefab schedules Q3FY26 earnings call",
            "Summary": "EPack Prefab Technologies has scheduled its Q3FY26 earnings call for January 22, 2026, to discuss unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768564378411,
            "Source": "co_actions_results"
        },
        {
            "Title": "EPack Prefab Technologies CS Nikita Singh Resigns",
            "Summary": "EPack Prefab Technologies announces resignation of Company Secretary and Compliance Officer Ms. Nikita Singh, effective January 15, 2026, to explore new career opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1768480062644,
            "Source": "stocks"
        },
        {
            "Title": "EPack Prefab Seeks Shareholder Approval for ESOP Ratification",
            "Summary": "EPack Prefab Technologies has issued a postal ballot notice seeking shareholder approval for ratification of its Employee Stock Option Scheme 2024 and extension of benefits to subsidiary employees through remote e-voting.",
            "Sentiment": "neutral",
            "PublishDate": 1765812999144,
            "Source": "co_actions_results"
        },
        {
            "Title": "EPack Prefab Technologies GM Sales Resigns",
            "Summary": "EPack Prefab Technologies announces resignation of General Manager Sales Sandeep Mourya, effective December 15, 2025, citing professional growth opportunities outside the organization.",
            "Sentiment": "neutral",
            "PublishDate": 1765810718238,
            "Source": "stocks"
        },
        {
            "Title": "Epack Prefab Technologies Director Ram Grovher Purchases Additional Equity Shares",
            "Summary": "Ram Grovher, an Independent Director at Epack Prefab Technologies Limited, acquired 15,376 equity shares worth Rs 47.93 lakh through market purchase on NSE, increasing his total holding to 53,063 shares. The company disclosed this transaction under SEBI insider trading regulations as part of mandatory reporting requirements for designated persons.",
            "Sentiment": "positive",
            "PublishDate": 1764952384003,
            "Source": "corporate_action"
        },
        {
            "Title": "Epack Prefab Technologies Director Ram Grovher Purchases 16,700 Equity Shares",
            "Summary": "Ram Grovher, Independent Director at Epack Prefab Technologies Limited, acquired 16,700 equity shares worth Rs. 50,67,900 through market purchase on NSE, increasing his total holding to 22,800 shares. The transaction was disclosed under SEBI insider trading regulations, representing routine share acquisition by a designated person of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1764144162594,
            "Source": "corporate_governance"
        },
        {
            "Title": "Epack Prefab Technologies Signs MOU with MASCOT South Asia for Gujarat Capacity Expansion",
            "Summary": "Epack Prefab Technologies Limited entered into a Memorandum of Understanding with MASCOT South Asia LLP to facilitate capacity addition in Gujarat state. The first phase involves increasing PEB capacity by approximately 50 thousand tonnes with a proposed investment of INR 110 crores including land investment, aimed at enhancing capacity with latest technology automation for organic growth opportunities in West Region of India.",
            "Sentiment": "positive",
            "PublishDate": 1763614646140,
            "Source": "order&deals"
        },
        {
            "Title": "EPACK Prefab Technologies Signs MOU with Andhra Pradesh for INR 333 Crore Capacity Expansion",
            "Summary": "EPACK Prefab Technologies Limited has entered into a non-binding MOU with the Andhra Pradesh Economic Development Board for a proposed capacity addition requiring an investment of INR 333 crores. The expansion aims to enhance capacity with latest technology automation to achieve organic growth opportunities in the South Region of India.",
            "Sentiment": "positive",
            "PublishDate": 1763117270558,
            "Source": "stock"
        },
        {
            "Title": "Epack Prefab Technologies Receives Purchase Orders Worth ₹1,755 Crores",
            "Summary": "Epack Prefab Technologies Limited disclosed receiving material purchase orders totaling ₹1,755.03 crores from two major clients. Inox Neo Energies Limited awarded a contract worth ₹837.38 crores for supply and erection of Pre-Engineered Buildings (PEB) for a 5GW solar cell project in Odisha. Reliance Industries Limited placed an order valued at ₹917.64 crores for prefab structures including staff colonies for their Khavada facility near Kutch, Gujarat. The orders were considered material by the company's Key Managerial Personnel and disclosed to stock exchanges NSE and BSE in compliance with listing regulations.",
            "Sentiment": "positive",
            "PublishDate": 1762462275208,
            "Source": "order&deals"
        },
        {
            "Title": "EPACK Prefab Technologies Faces GST Department Search at Multiple Premises",
            "Summary": "EPACK Prefab Technologies Limited disclosed that the Department of Goods and Service Tax conducted searches at the company's registered office and adjoining factory premises in Greater Noida on October 30, 2025, and at its corporate office and adjoining factory premises on October 30-31, 2025. The search was conducted by the Joint Director, DGGI, Gurugram Zonal Unit to ascertain GST evasion, if any. The company stated that there is no impact on its financial, operational or other activities. The searches concluded on October 30, 2025 at the registered office premises and on October 31, 2025 at the corporate office premises.",
            "Sentiment": "negative",
            "PublishDate": 1761905749054,
            "Source": "stock"
        },
        {
            "Title": "EPACK Prefab Technologies Secures Purchase Orders Worth 1.40 Billion Rupees",
            "Summary": "EPACK Prefab Technologies has received purchase orders valued at 1.40 billion rupees. The company operates in the prefab construction technology sector.",
            "Sentiment": "positive",
            "PublishDate": 1761570384361,
            "Source": "stock"
        },
        {
            "Title": "EPACK Prefab Technologies Reports 36% Revenue Growth and 46% EBITDA Growth in H1 FY'26",
            "Summary": "EPACK Prefab Technologies Limited reported strong financial performance in H1 FY'26 with revenue growth of 36% and EBITDA growth of 46% year-on-year. The company, which listed on October 1, 2025, maintains an order book of Rs. 920 crores providing 7-8 months revenue visibility. The prefab business achieved 46% CAGR over FY'22 to FY'25. Plant capacity utilization reached 80-90% from June onwards across three prefab facilities. The company booked Rs. 650 crores in new orders during the first half from sectors including solar, renewable, semiconductor, FMCG, warehousing, and automotive. EPACK inaugurated an insulated Sandwich Panel Line at its Andhra Pradesh plant in June. The company commenced brownfield expansion work for structural steel fabrication in Mambattu with Rs. 58 crores investment, targeting Q4 FY'26 commercial production. Greenfield expansion for insulated sandwich panels in Ghiloth, Rajasthan with Rs. 102 crores investment is underway, targeting Q2 FY'27 production start. Management maintains EBITDA margin guidance of 10.5-11.5% and expects second half to contribute 55% of annual revenue versus 45% in first half. The company operates with 21-day net working capital cycle and repaid Rs. 70 crores of term loans using IPO proceeds.",
            "Sentiment": "positive",
            "PublishDate": 1761393129966,
            "Source": "earnings"
        },
        {
            "Title": "EPACK Prefab Tech Wins ₹130 Crore Glass Factory Project Contract from Avaada Ventures",
            "Summary": "EPACK Prefab Technologies received purchase orders worth ₹130 crore from Avaada Ventures for designing, fabricating, supplying, and erecting a pre-engineered steel building for a glass factory project in Butibori, Nagpur, Maharashtra. The orders were dated October 13 and executed on October 24. The company classified these purchase orders as material and the disclosure was signed by Managing Director and CEO Sanjay Singhania.",
            "Sentiment": "positive",
            "PublishDate": 1761369013354,
            "Source": "order&deals"
        },
        {
            "Title": "Epack Prefab Technologies Reports 64.4% PAT Growth, Lists on NSE and BSE",
            "Summary": "Epack Prefab Technologies Limited reported strong financial performance with revenue growth of 35.8% to INR 7,293 million and PAT growth of 64.4% to INR 455 million for the half-year period. The company successfully listed on NSE and BSE on October 1, 2025, after raising INR 1,300 million from GEF Capital Partners in December 2024. The company commissioned a new Continuous Sandwich Panel Line at its Mambattu facility, adding 8 lakh sqm capacity with revenue potential of approximately INR 150 crore per annum. PEB installed capacity now stands at 133,922 MTPA across three locations. ICRA upgraded the company's rating to A+. Order book stands at INR 9,200 million as of September 30, 2025. The company operates manufacturing facilities in Greater Noida, Ghiloth, and Mambattu, with expansion plans including brownfield expansion at Mambattu scheduled for completion in Q4 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1761238043853,
            "Source": "earnings"
        },
        {
            "Title": "Bank of America Acquires Rs 13 Crore Stake in EPack Prefab Following Strong Q2 Results",
            "Summary": "Bank of America purchased over 5.62 lakh shares worth Rs 13 crore in EPack Prefab Technologies through a bulk deal at Rs 233.82 per share, representing a 15% premium to the previous closing price. The stock surged 20% to hit a 52-week high of Rs 244.12 before closing 13% higher at Rs 229.90. The rally followed EPack Prefab's strong quarterly results, which showed net profit jumping 104.2% year-on-year to Rs 29.5 crore and revenue rising 61.9% to Rs 433.9 crore. For the first half of FY26, the company reported total income of Rs 734.6 crore with EBITDA growing 45.6% and profit after tax surging 64.4% to Rs 45.4 crore. The company operates in PreFab Business and EPS Packaging segments, maintains an order book of Rs 655.6 crore, and recently received an upgraded ICRA rating to A+. EPack Prefab's stock had initially debuted at a discount in October following its Rs 504 crore IPO.",
            "Sentiment": "positive",
            "PublishDate": 1761230991129,
            "Source": "order&deals"
        },
        {
            "Title": "Epack Prefab Technologies Reports Strong Q2 Growth with Net Profit Doubling Year-on-Year",
            "Summary": "Epack Prefab Technologies delivered robust quarterly performance with net profit surging to 294.7 million rupees from 136.7 million rupees in the same period last year. Revenue grew significantly to 4.34 billion rupees compared to 2.68 billion rupees year-on-year. EBITDA increased to 499.4 million rupees from 285.3 million rupees, while EBITDA margin improved to 11.51% from 10.65% in the previous year period.",
            "Sentiment": "positive",
            "PublishDate": 1761143811155,
            "Source": "earnings"
        },
        {
            "Title": "EPACK Prefab Technologies Reports Strong Quarterly Results and Board Changes",
            "Summary": "EPACK Prefab Technologies' Board approved unaudited financial results for quarters ended June 30, 2025 and September 30, 2025. The company reported revenue from operations of Rs 433.94 crores for Q2 FY26 compared to Rs 295.34 crores in Q1 FY26. Profit for the period increased to Rs 238.85 crores in Q2 FY26 from Rs 160.04 crores in Q1 FY26. The Board also approved a designation change for Mr. Krishnan Ganesan from Nominee Director to Non-executive Non-independent Director following the termination of the Shareholders' Agreement after the company's listing. The company completed its IPO of 2.47 crore equity shares at Rs 204 per share, with shares listed on NSE and BSE on October 1, 2025. The paid-up share capital increased from Rs 155 crores to Rs 200.9 crores.",
            "Sentiment": "positive",
            "PublishDate": 1761138349304,
            "Source": "earnings"
        }
    ]
}