{
    "Symbol": "EPACK",
    "ISIN": "INE0G5901015",
    "News": [
        {
            "Title": "EPACK Durable opens new Hisense facility in Sri City",
            "Summary": "EPACK Durable Limited inaugurates USD 30 million manufacturing facility for Hisense at Sri City, Andhra Pradesh, with 0.75 million RAC annual capacity and 2,000 employment opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1770719271378,
            "Source": "stocks"
        },
        {
            "Title": "EPACK Durable Gets ₹7.36 Cr M-SIPS Phase III Incentive",
            "Summary": "EPACK Durable Limited received Phase III incentive of ₹7.36 crore under Modified Special Incentive Package Scheme from Ministry of IT & Electronics to promote electronics manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1770383463491,
            "Source": "stocks"
        },
        {
            "Title": "EPACK Durable Q3FY26 Revenue Grows 13.5% to INR427.8 Cr",
            "Summary": "EPACK Durable reports Q3FY26 revenue of INR427.8 crores with 13.5% YoY growth. EBITDA increased 31.5% to INR31.7 crores while margin expanded to 7.41%. Company diversifies beyond AC with strong growth in components and appliances segments.",
            "Sentiment": "positive",
            "PublishDate": 1769579881542,
            "Source": "co_actions_results"
        },
        {
            "Title": "Epack Durable Targets 25-30% AC Growth Until 2030",
            "Summary": "Epack Durable aims for 25-30% growth in air conditioning segment until 2030, outpacing industry's expected 15-20% growth for current calendar year.",
            "Sentiment": "positive",
            "PublishDate": 1769048290151,
            "Source": "stocks"
        },
        {
            "Title": "Epack Durable Sets Revenue Mix Targets Till FY29",
            "Summary": "Epack Durable outlines medium-term revenue projections with AC segment at 55%, SDA/LDA at 25%, and Components contributing 20-25% till FY28-29 during recent concall.",
            "Sentiment": "neutral",
            "PublishDate": 1769048260677,
            "Source": "stocks"
        },
        {
            "Title": "Epack Durable Plans ₹450 Crore Investment",
            "Summary": "Epack Durable announces ambitious expansion plan with ₹450 crore investment over 12-18 months, having already spent ₹218 crore in nine months of FY26.",
            "Sentiment": "positive",
            "PublishDate": 1769048228668,
            "Source": "stocks"
        },
        {
            "Title": "Epack Durable Q3 Net Profit Rises 4% to ₹26 Crores",
            "Summary": "Epack Durable reported Q3 consolidated net profit of ₹26 crores versus ₹25 crores year-on-year, while revenue grew 14.36% to ₹4.30 billion from ₹3.76 billion in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1768922598445,
            "Source": "co_actions_results"
        },
        {
            "Title": "EPACK Durable schedules Q3FY26 earnings call",
            "Summary": "EPACK Durable Limited has scheduled an earnings conference call for January 21, 2026, at 10:00 AM IST to discuss Q3FY26 unaudited financial results with analysts and institutional investors.",
            "Sentiment": "neutral",
            "PublishDate": 1768388923887,
            "Source": "co_actions_results"
        },
        {
            "Title": "EPACK Durable Board Approves New Facility & Legal Action",
            "Summary": "EPACK Durable's board approved setting up another manufacturing facility at Bhiwadi for air cooler production and initiated legal proceedings against Gangnam Steel for ₹19.61 crores unpaid dues.",
            "Sentiment": "neutral",
            "PublishDate": 1766497037687,
            "Source": "stocks"
        },
        {
            "Title": "EPACK Durable Promoter Group Member Files Share Acquisition Disclosure",
            "Summary": "Rajjat Bothra, a member of EPACK Durable Limited's promoter group, submitted mandatory disclosure under SEBI regulations for share acquisition through open market purchase on November 25, 2025. The disclosure relates to changes in shareholding pattern of the company which has an equity share capital of Rs. 96,22,84,770 divided into 9,62,28,477 equity shares of Rs. 10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1764312993593,
            "Source": "corporate_action"
        },
        {
            "Title": "EPACK Durable Promoter Group Member Rajjat Bothra Files Share Transaction Disclosure",
            "Summary": "Rajjat Bothra, a promoter group member of EPACK Durable Limited, submitted regulatory disclosures under SEBI takeover regulations regarding share transactions through open market sale. The disclosure covers details of shareholding before and after the transaction, with the company's equity share capital standing at Rs. 96,22,84,770 divided into 9,62,28,477 equity shares of Rs. 10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1763988318398,
            "Source": "corporate_action"
        },
        {
            "Title": "EPACK Durable Signs MOU with Andhra Pradesh Economic Development Board for INR 1,083 Crore Investment",
            "Summary": "EPACK Durable Limited and its wholly owned subsidiary EPACK Manufacturing Technologies Private Limited have entered into a non-binding MOU with the Andhra Pradesh Economic Development Board for an investment of approximately INR 1,083 crore. The investment is intended to facilitate the expansion plans of the company and its subsidiary in the state of Andhra Pradesh in collaboration with APEDB.",
            "Sentiment": "positive",
            "PublishDate": 1763134761099,
            "Source": "order&deals"
        },
        {
            "Title": "EPACK Durable Reports 43% Revenue Decline in Q2 FY26, Posts Net Loss of INR 22 Crores",
            "Summary": "EPACK Durable Limited reported revenue from operations of INR 213 crores in Q2 FY26, declining 43% quarter-on-quarter. The company posted a net loss of INR 22 crores with EBITDA at INR 0.5 crores (0.23% margin), down 95% quarter-on-quarter. For H1 FY26, revenue stood at INR 876 crores, declining 24% year-on-year, with net profit of INR 0.6 crores. The RAC segment witnessed a 76% decline quarter-on-quarter due to unseasonal rains and timing gap between GST rate reduction announcement and implementation (from 28% to 18%). However, diversification segments showed strong momentum - Small Domestic Appliances grew 45% quarter-on-quarter led by air fryers, Components segment grew 73%, and Large Domestic Appliances segment reported 466% growth. The company incurred approximately INR 129 crores in capex during Q2 FY26 for capacity expansion. Management expects the AC industry to be flat for FY26 due to 35% degrowth in H1, but remains optimistic about calendar year 2026 with strong order books. The Hisense facility is ready with mass production expected to start by end of December or first week of January.",
            "Sentiment": "negative",
            "PublishDate": 1762894290426,
            "Source": "earnings"
        },
        {
            "Title": "Epack Durables Shares Drop 10% as Quarterly Loss Widens Despite Revenue Growth",
            "Summary": "Epack Durables shares fell over 10% following quarterly results showing a widened net loss of ₹8.5 crore compared to ₹6.1 crore in the same quarter last year. Revenue increased significantly to ₹377 crore from ₹178 crore, but higher total expenses offset this growth. Gross margins compressed by 210 basis points to 14.6% due to inventory mix changes. The company announced a $30 million investment for the first phase of a new manufacturing facility in Sricity, Andhra Pradesh, with plans for washing machine and refrigerator production in the second phase. Management expects $1 billion in additional revenue over five years. The company also approved incorporating a wholly-owned subsidiary named Epack Manufacturing Technologies. Shares traded 8.3% lower at ₹306.1, compared to its January 2024 listing price of ₹230 per share.",
            "Sentiment": "negative",
            "PublishDate": 1762408730346,
            "Source": "earnings"
        },
        {
            "Title": "Epack Durable Plans to Double Manufacturing Capacity by FY27 with New Plants",
            "Summary": "Epack Durable has outlined growth plans for its ODM air-conditioner and small appliance manufacturing business. The company is establishing new manufacturing plants in Sri City and Bhiwadi as part of its expansion strategy. Epack Durable aims to double its production capacity by FY27 while expanding its export operations and implementing backward integration initiatives. The company expects these scale-driven expansions to result in margin improvements.",
            "Sentiment": "positive",
            "PublishDate": 1762269186369,
            "Source": "stock"
        },
        {
            "Title": "EPACK DURABLE Reports Widened Q2 Loss and Revenue Decline",
            "Summary": "EPACK DURABLE reported a consolidated net loss of 223 million rupees in Q2, significantly higher than the 85.5 million rupees loss in the same period last year. Revenue declined to 2.13 billion rupees from 3.77 billion rupees year-over-year. EBITDA dropped substantially to 5.4 million rupees compared to 96.1 million rupees in the previous year, while EBITDA margin compressed to 0.25% from 2.55%.",
            "Sentiment": "negative",
            "PublishDate": 1762262710967,
            "Source": "earnings"
        },
        {
            "Title": "EPACK Durable Announces Senior Management Changes with VP Resignations",
            "Summary": "EPACK Durable Limited announced two senior management personnel changes effective October 27, 2025. Mr. Nandkishor Shivprasad Khandelwal, Vice President - Supply Chain Management, resigned from his position to pursue new challenges and opportunities. Additionally, Mr. Krishan Dhiman, Vice President - Manufacturing Excellence, ceased to be a senior management personnel due to changes in the company's reporting structure. Both executives held senior management personnel designations at the company.",
            "Sentiment": "neutral",
            "PublishDate": 1761566550586,
            "Source": "corporate_governance"
        },
        {
            "Title": "Epack Durable Faces Tax Search Proceedings at Uttarakhand Unit",
            "Summary": "Epack Durable is undergoing search proceedings conducted by the Additional Commissioner State Tax at its Uttarakhand unit. The company has stated that no impact from these search proceedings can be quantified at this stage.",
            "Sentiment": "negative",
            "PublishDate": 1756686509683,
            "Source": "stock"
        },
        {
            "Title": "EPACK Durable Faces Tax Authority Search at Uttarakhand Facility",
            "Summary": "The Additional Commissioner State Tax has initiated search procedures at EPACK Durable's Uttarakhand unit. The company reports no immediate impact has been detected from these search operations.",
            "Sentiment": "neutral",
            "PublishDate": 1756471201473,
            "Source": "stock"
        },
        {
            "Title": "Epack Durable Plans Multi-Area Expansion and Partners with Hisense for ODM Leadership",
            "Summary": "Epack Durable has announced expansion plans across multiple areas and entered into a partnership with Hisense. The company is focusing on backward integration to achieve Original Design Manufacturer (ODM) leadership. The strategy emphasizes research and development, manufacturing growth, and expanding product variety for long-term success.",
            "Sentiment": "positive",
            "PublishDate": 1754912181359,
            "Source": "stock"
        },
        {
            "Title": "EPACK Durable Prepares Investor Presentation for Emkay Confluence 2025",
            "Summary": "EPACK Durable Limited has prepared an investor presentation for the upcoming Emkay Confluence 2025 event, where Mr. Narayan Lodha will be participating. The presentation will be shared with institutional investors and analysts, and will also be made available on the company's website. The company is a leading Original Design Manufacturer in India's consumer durables and electronics industry, specializing in room air conditioners, small domestic appliances, large domestic appliances, and components. EPACK operates 4 pan-India manufacturing locations and serves 55+ trusted brands as an ODM partner. The company reported revenue of ₹2,190+ crore in FY25 and is targeting diversification with SDA segment contribution expected to reach 35% by FY26, while reducing dependency on top 2 customers from 72% to 46%.",
            "Sentiment": "neutral",
            "PublishDate": 1754911729413,
            "Source": "stock"
        },
        {
            "Title": "Augusta Investments Zero Reduces Stake in EPACK Durable Limited by 4.86%",
            "Summary": "Augusta Investments Zero Pte. Ltd. disposed of 4,664,824 equity shares in EPACK Durable Limited through open market transactions. The disposal reduced Augusta's shareholding from 10.98% to 6.12% of the company's total equity. The sales occurred in multiple tranches between February 25, 2025 and August 8, 2025, with the final transaction on August 8 triggering disclosure requirements. EPACK Durable's total equity share capital remains at 95,967,729 shares of INR 10 each. Augusta Investments Zero is not part of the promoter group.",
            "Sentiment": "neutral",
            "PublishDate": 1754887751033,
            "Source": "corporate_action"
        },
        {
            "Title": "EPACK Durable Receives INR 6.84 Crore Phase II Incentive Under Government Electronics Manufacturing Scheme",
            "Summary": "EPACK Durable Limited received a Phase II incentive of INR 6.84 crore under the Modified Special Incentive Package Scheme (M-SIPS) from the Ministry of IT & Electronics, Government of India. The scheme promotes electronics manufacturing in the country and offers incentives in three phases for investments in capital expenditure for setting up electronic manufacturing units. The company applied and invested in the scheme to align with the Government of India's 'Make in India' and 'Aatmanirbhar Bharat' initiatives. This follows a previous communication from the company dated January 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754555878100,
            "Source": "stock"
        },
        {
            "Title": "India Advantage Fund S4 I Completely Exits Epack Durables Limited Stake",
            "Summary": "India Advantage Fund S4 I, managed by ICICI Venture Funds Management Company Limited, has sold its entire 3.79% stake in Epack Durables Limited. The fund disposed of 36,38,455 shares through open market transactions between March 24, 2025 and July 31, 2025. Following the sale, the fund's holding in the company has reduced to zero from its previous 3.79% stake. Epack Durables has an equity share capital of Rs. 95,96,77,290 divided into 9,59,67,729 equity shares of Rs. 10 each, and its shares are listed on both BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1754286445813,
            "Source": "corporate_action"
        },
        {
            "Title": "EPACK Durable Reports 14% Revenue Growth Despite 34% Decline in RAC Business in Q1 FY26",
            "Summary": "EPACK Durable Limited reported revenue from operations of INR 662 crores for Q1 FY26, representing a 14% year-on-year growth. EBITDA stood at INR 55 crores with a 6% increase and margin expansion of 156 basis points to 8.24%. Net profit declined 2% to INR 23 crores, though net profit margin improved by 43 basis points to 3.46%. The company's Room Air Conditioner (RAC) segment witnessed a 34% decline due to unseasonal rains and surplus inventory from Q4 FY25. However, other segments showed strong performance: Small Domestic Appliances grew 16%, Components segment delivered 556% growth, and Large Domestic Appliances reported 29% growth. The company added 14 new customers during the quarter, with supplies commenced to 3 of them. EPACK incurred approximately INR 50 crores in capex for capacity expansion, including washing machine lines and component facilities. The company targets EBITDA margin of 7.5% plus for FY26 with medium-term ambition of 8%. Management expects the overall AC market to grow 10-15% for the full year despite Q1 challenges, with production ramping up in Q3-Q4 for the next season.",
            "Sentiment": "neutral",
            "PublishDate": 1753443145695,
            "Source": "earnings"
        },
        {
            "Title": "EPACK Durable Partners with South Korean Firm Bumjin Electronics in 66.67% Joint Venture for Audio Device Manufacturing",
            "Summary": "EPACK Durable Limited has signed a joint venture agreement with Bumjin Electronics Co. Limited, a South Korean company, to establish a new entity for manufacturing and selling television speakers, soundbars, AI speakers, Bluetooth speakers, and smart speakers. EPACK will hold a 66.67% stake while Bumjin will own 33.33% of the joint venture. The new company will have an initial authorized share capital of INR 140 million divided into 14 million equity shares of INR 10 each. The joint venture will focus primarily on the Indian market with potential for international expansion. EPACK will appoint three directors to the board while Bumjin will nominate two directors. The partnership aims to bring advanced manufacturing capabilities for audio devices to India, leveraging EPACK's existing electronics manufacturing strengths and distribution network while facilitating technology transfer and supporting import substitution in the consumer electronics sector.",
            "Sentiment": "positive",
            "PublishDate": 1753358896842,
            "Source": "order&deals"
        },
        {
            "Title": "EPACK Durable Expands Operations with New Electronic Parts Division",
            "Summary": "EPACK Durable has established a new division focused on manufacturing electronic parts, representing an expansion of the company's operational capabilities into the electronics manufacturing sector.",
            "Sentiment": "positive",
            "PublishDate": 1753323085279,
            "Source": "stock"
        },
        {
            "Title": "EPACK Durable Limited Incorporates Wholly Owned Subsidiary for Electronic Components Manufacturing",
            "Summary": "EPACK Durable Limited has incorporated a wholly owned subsidiary named EPACK Electronic Component Private Limited, which received its Certificate of Incorporation on July 23, 2025. The new entity has an authorized and paid-up capital of ₹1,00,000, divided into 10,000 equity shares of ₹10 each. The subsidiary will focus on manufacturing electronic components including display module sub-assembly, camera module sub-assembly, and related processes such as Film on Glass (FOG) and Chip on Glass (COG). The company stated this strategic move aims to support business growth in the manufacturing industry. Ms. Avishi Singhania and Mr. Nitin Bothra from the promoter group serve as directors in the new subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1753292990248,
            "Source": "corporate_action"
        },
        {
            "Title": "EPACK Durable Limited Reports Q1 FY2025 Financial Results",
            "Summary": "EPACK Durable Limited published its unaudited standalone and consolidated financial results for the first quarter ended June 30, 2025. The company notified stock exchanges BSE and NSE about the newspaper publication of these quarterly results and confirmed the results would also be posted on the company's website at www.epackdurable.com. The communication was signed by Company Secretary and Compliance Officer Jyoti Verma on July 21, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753158715892,
            "Source": "earnings"
        },
        {
            "Title": "Epack Durable Expands Into Energy Meter Sector With Key Components Supply",
            "Summary": "Epack Durable is expanding its business operations into the energy meter sector by providing key components. This represents a strategic move for the company to diversify beyond its traditional consumer durable products segment.",
            "Sentiment": "positive",
            "PublishDate": 1753156867658,
            "Source": "stock"
        },
        {
            "Title": "Epack Durable Outlines Growth Strategy with $1B Hisense Revenue Target and Rs 450-500 Crore Capex Plan",
            "Summary": "Epack Durable has outlined its strategic roadmap during a conference call. The company forecasts its FY26 revenue distribution to be dominated by air conditioners at 60-65%, followed by components at 20-25%, small domestic appliances at 10-15%, and large domestic appliances up to 10%. The company plans to achieve $1 billion revenue from its Hisense partnership over the next 4-5 years. Epack Durable has begun trial and mass production of air fryers, targeting 1 million units in Phase 1 while developing its own ODM models. The company plans total capital expenditure of Rs 450-500 crores over the next 12-18 months, with Rs 50 crores already utilized in Q1. For profitability targets, Epack Durable aims for EBITDA margin over 7.5% in FY26, with a medium-term goal of 8%.",
            "Sentiment": "positive",
            "PublishDate": 1753155610337,
            "Source": "stock"
        },
        {
            "Title": "EPACK Durable Plans INR 4,500-5,000 Million Capital Investment for Capacity Expansion",
            "Summary": "EPACK Durable has announced plans for a capital expenditure of INR 4,500-5,000 million aimed at increasing production capacity and introducing new products. The company expects to complete this expansion by Q1 FY26-27 to address anticipated market demand for FY27 and beyond.",
            "Sentiment": "positive",
            "PublishDate": 1753015834478,
            "Source": "stock"
        },
        {
            "Title": "EPACK DURABLE Reports Mixed Q1 Results with Revenue Decline and EBITDA Growth",
            "Summary": "EPACK DURABLE reported Q1 consolidated net profit of 229 million rupees compared to 234 million rupees in the previous year, representing a slight decline. The company's Q1 revenue fell to 6.6 billion rupees from 7.7 billion rupees year-over-year. However, Q1 EBITDA increased to 546 million rupees from 517 million rupees, while EBITDA margin improved to 8.25% from 6.68% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1753014516866,
            "Source": "earnings"
        },
        {
            "Title": "Epack Durable Begins Washing Machine Production at Sri City Factory",
            "Summary": "Epack Durable has commenced the manufacturing of washing machines at its factory located in Sri City. This marks a significant step for the company as it expands its product line and production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1751978529000,
            "Source": "default"
        },
        {
            "Title": "Epack Durable Adds Bumjin India Audio Products as Wholly Owned Subsidiary",
            "Summary": "Epack Durable has incorporated Bumjin India Audio Products as a wholly owned subsidiary. This move is aimed at boosting the company's manufacturing growth.",
            "Sentiment": "positive",
            "PublishDate": 1751033451000,
            "Source": "default"
        },
        {
            "Title": "EPACK Durable Ltd.: Targets 35%+ Topline Growth, Faces Import Duty Challenges",
            "Summary": "EPACK Durable Ltd. aims for over 35% topline growth in FY26 through portfolio diversification. The company projects up to 10% growth in AC segment despite Q1 industry challenges. EPACK, along with other AC manufacturers, faces regulatory issues regarding import duties on copper tubes from ASEAN countries.",
            "Sentiment": "neutral",
            "PublishDate": 1750301773000,
            "Source": "normal_news"
        },
        {
            "Title": "EPACK DURABLE Provides Growth and EBITDA Margin Guidance for FY '26",
            "Summary": "EPACK DURABLE has shared its financial outlook during a conference call. The company expects to deliver positive growth in FY '26. They have provided revenue growth guidance of over 35% for FY '26. Additionally, the company's EBITDA margin guidance for FY '26 is set at 7.5% or higher.",
            "Sentiment": "positive",
            "PublishDate": 1748489250000,
            "Source": "default"
        },
        {
            "Title": "Epack Durable: Diversification Strategy to Boost FY26 Growth",
            "Summary": "Epack Durable aims to reduce AC segment's revenue contribution to 65% through product diversification. The company plans to accelerate growth in washing machines, coolers, and component manufacturing to optimize capacity utilization during off-peak AC seasons. This strategy is expected to improve overall profitability in FY26 and FY27.",
            "Sentiment": "positive",
            "PublishDate": 1748481063000,
            "Source": "normal_news"
        },
        {
            "Title": "EPACK Durable Ltd: Q4 Profit Surges 35.5%, Revenue Up 22%",
            "Summary": "EPACK Durable Ltd reported a 35.54% YoY increase in Q4 FY25 consolidated net profit to ₹37.71 crore. Revenue from operations grew 22.36% YoY to ₹643.24 crore. For FY25, net profit rose 55.9% to ₹55.14 crore, with total consolidated income up 53.44% to ₹2,191.92 crore.",
            "Sentiment": "positive",
            "PublishDate": 1748362802000,
            "Source": "earnings"
        },
        {
            "Title": "EPACK Durable Reports Q4 Financial Results",
            "Summary": "EPACK Durable has announced its Q4 consolidated financial results. The company's net profit for the quarter was 377 million rupees, showing a year-over-year increase from 278 million rupees and a quarter-over-quarter increase from 25 million rupees. Revenue for Q4 was 6.4 billion rupees, up from 5.3 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748356231000,
            "Source": "result"
        },
        {
            "Title": "EPACK DURABLE Subleases Premises to Subsidiary",
            "Summary": "EPACK DURABLE has entered into a 10-year related-party agreement to sublease a portion of its Sri City premises to its wholly owned subsidiary, EPACK Manufacturing Technologies.",
            "Sentiment": "neutral",
            "PublishDate": 1745073491000,
            "Source": "default"
        },
        {
            "Title": "EPACK Durable Announces Capacity Expansion for New Product",
            "Summary": "EPACK Durable has proposed a capacity addition of approximately 600,000 units per annum to enhance its production capacity. This expansion is aimed at meeting the production requirements for a newly launched product.",
            "Sentiment": "positive",
            "PublishDate": 1744182070000,
            "Source": "corporate_action"
        },
        {
            "Title": "Epack Durable Ltd.: Targets Rs 5,000 Crore Revenue, 7.5% Margin in Three Years",
            "Summary": "Epack Durable Ltd. aims to achieve over 7.5% Ebitda margin and Rs 5,000 crore revenue in the next three fiscal years. The company plans to expand washing machine production and introduce smaller appliances in FY26. A recent deal with Hisense for manufacturing appliances and potential new partnerships are expected to drive growth.",
            "Sentiment": "positive",
            "PublishDate": 1740029212000,
            "Source": "normal_news"
        },
        {
            "Title": "EPACK Durable Reports Mixed Q3 Results",
            "Summary": "EPACK Durable has released its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased slightly to 241 million rupees, compared to 237 million rupees in the same quarter last year. However, the EBITDA margin decreased to 6.4% from 8.5% year-over-year, indicating a decline in profitability despite the marginal increase in EBITDA.",
            "Sentiment": "neutral",
            "PublishDate": 1738330211000,
            "Source": "earnings"
        },
        {
            "Title": "EPACK Durable Reports Mixed Q3 Financial Results",
            "Summary": "EPACK Durable announced its Q3 financial results. The company's consolidated net profit decreased to 25 million rupees from 49 million rupees year-over-year. Compared to the previous quarter, it reported a loss of 85 million rupees. However, Q3 revenue increased to 3.76 billion rupees from 2.79 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738330121000,
            "Source": "earnings"
        },
        {
            "Title": "Epack Durable to Consider Q3 Results on January 31",
            "Summary": "Epack Durable Limited has announced that it will consider its third quarter (Q3) financial results on January 31. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738070920000,
            "Source": "earnings"
        },
        {
            "Title": "Epack Durable Ltd: Components Business Set for Significant Growth",
            "Summary": "Epack Durable's components business is expected to contribute 8-10% of total revenues in 2-3 years, up from 3% in FY24. CEO Ajay DD Singhania anticipates significant growth in this high-margin segment. The company has begun supplying components like cross-flow fans to other manufacturers. By FY27-28, Epack aims for a revenue mix of 60-65% from AC business, 10-15% from large home appliances, and the balance from small domestic appliances and components.",
            "Sentiment": "positive",
            "PublishDate": 1737184488000,
            "Source": "normal_news"
        },
        {
            "Title": "Epack Durable: Shares Surge 150% in 2024 Amid Potential Stake Sale",
            "Summary": "Epack Durable Ltd. shares hit a 5% upper circuit, extending their 150% rally in 2024. The company is in preliminary talks with a top Chinese TV company for a potential stake acquisition in its subsidiary. Epack Durable, an ODM for air conditioners, has a current market cap of ₹4,798 crore.",
            "Sentiment": "positive",
            "PublishDate": 1735193080000,
            "Source": "corporate_action"
        },
        {
            "Title": "SIIB Officials Conclude Visit to Epack Durable Without Seizing Documents",
            "Summary": "Officials from the Securities and Intelligence Branch of India (SIIB) have completed their visit to Epack Durable's premises. The company reports that the officials left without seizing any documents or items during their inspection.",
            "Sentiment": "neutral",
            "PublishDate": 1733270635000,
            "Source": "corporate_governance"
        },
        {
            "Title": "SIIB Officials Conclude Visit to EPACK Durable Without Seizing Documents",
            "Summary": "Officials from the State Investigation and Intelligence Bureau (SIIB) have completed their visit to EPACK Durable. The company reports that no documents or items were seized during the visit.",
            "Sentiment": "neutral",
            "PublishDate": 1733231526000,
            "Source": "corporate_governance"
        }
    ]
}