{
    "Symbol": "EPIGRAL",
    "ISIN": "INE071N01016",
    "News": [
        {
            "Title": "Epigral Wins EcoVadis Silver Medal for Sustainability",
            "Summary": "Epigral Limited receives EcoVadis Silver Medal, placing the chemical manufacturer in the top 15% of over 150,000 companies globally assessed for sustainability performance across environment, ethics, and procurement.",
            "Sentiment": "positive",
            "PublishDate": 1770118689655,
            "Source": "stocks"
        },
        {
            "Title": "Epigral Q3 FY26 Results: Revenue Falls 7.5% YoY",
            "Summary": "Epigral Limited reported Q3 FY26 revenue of ₹597.12 crore, down from ₹645.24 crore in Q3 FY25. Net profit declined 62.2% YoY to ₹39.15 crore despite improved operational efficiency.",
            "Sentiment": "negative",
            "PublishDate": 1769765081692,
            "Source": "co_actions_results"
        },
        {
            "Title": "Epigral Limited Q3FY26 Results Call on Jan 30",
            "Summary": "Epigral Limited announces conference call scheduled for January 30, 2026 at 5:00 PM IST to discuss Q3FY26 financial results with senior management team including CMD and CFO.",
            "Sentiment": "neutral",
            "PublishDate": 1769154730067,
            "Source": "co_actions_results"
        },
        {
            "Title": "Epigral Receives ₹52.52 Cr Tax Demand Notice",
            "Summary": "Epigral Limited received assessment order from Deputy Commissioner of Income Tax, Vadodara for AY 2022-23 with demand notice of ₹52.52 crores including interest. Company plans to file appeal.",
            "Sentiment": "negative",
            "PublishDate": 1767265442791,
            "Source": "stocks"
        },
        {
            "Title": "Epigral Q2FY26 Results: Revenue Drops 4% to Rs 589 Cr Despite Volume Growth",
            "Summary": "Epigral Limited reported Q2FY26 revenue decline of 4% to Rs 589 crores despite 2% volume growth, as price realizations dropped for CPVC, hydrogen peroxide and caustic soda products. The company maintained healthy EBITDA margin at 25% with plant utilization at 78%, while its CAPEX projects for doubling CPVC and Epichlorohydrin capacity remain on schedule for commissioning.",
            "Sentiment": "neutral",
            "PublishDate": 1763057330851,
            "Source": "earnings"
        },
        {
            "Title": "Epigral Management Forecasts Volume Growth and Better Performance in H2 FY26",
            "Summary": "Epigral's management expects volume growth and improved performance in the second half of FY26 compared to the first half. The anticipated improvement is attributed to the end of monsoon season and completion of plant maintenance activities. The company expects higher plant utilization rates in H2 FY26, which should lead to better overall results.",
            "Sentiment": "positive",
            "PublishDate": 1762832749145,
            "Source": "stock"
        },
        {
            "Title": "Epigral Limited Reports Strong Q2 Results and Appoints New CFO",
            "Summary": "Epigral Limited approved its unaudited financial results for the second quarter and half year ended September 30, 2025. The company appointed Mr. Rakesh Agrawal as Chief Financial Officer and Key Managerial Personnel effective November 10, 2025. Agrawal is a Chartered Accountant with over 29 years of experience in accounts, finance, taxation, and cost management. For the quarter ended September 30, 2025, the company reported standalone revenue from operations of Rs. 387.36 crores and profit after tax of Rs. 51.82 crores. Basic earnings per share stood at Rs. 11.87 for the quarter. The company operates primarily in manufacturing and selling of Chloro Alkali and its derivatives. During the quarter, Epigral invested Rs. 0.13 crores in equity share capital and Rs. 2.13 crores in optionally convertible debentures of Pro-Zeal Green Power Ten Private Limited as part of a renewable energy initiative.",
            "Sentiment": "positive",
            "PublishDate": 1762765254077,
            "Source": "earnings"
        },
        {
            "Title": "EPIGRAL Reports Decline in Q2 Financial Performance Across Key Metrics",
            "Summary": "EPIGRAL reported quarterly consolidated net profit of 512 million rupees, down from 813 million rupees in the same period last year. Revenue decreased to 5.9 billion rupees from 6.26 billion rupees year-over-year. EBITDA fell to 1.32 billion rupees compared to 1.78 billion rupees previously, with EBITDA margin contracting to 22.53% from 28.35% in the corresponding quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1762761506278,
            "Source": "earnings"
        },
        {
            "Title": "Epigral Limited Reports 6% Revenue Decline in Q1 FY26 Despite Maintaining 27% EBITDA Margin",
            "Summary": "Epigral Limited reported revenue of INR 615 crores in Q1 FY26, down 6% year-on-year, primarily due to lower volumes caused by plant maintenance work and early monsoon. Despite the decline, the company maintained its EBITDA margin at 27% through operational efficiency and better product mix. Plant utilization stood at 73% versus 76% in the previous quarter. The company shifted to a new tax regime of 25.17%, resulting in a one-time credit of INR 81 crores and PAT of INR 160 crores. Revenue contribution from derivatives and specialty business was 50%, which the company expects to increase to 70% by FY28. The Chlorotoluene value chain plant commissioned in March 2025 is at the product approval stage with customers, with sizable revenue expected by end of the financial year. Ongoing capex projects include doubling capacity of CPVC resin and Epichlorohydrin plants, and a 19.80 megawatt wind-solar hybrid power plant. The company spent INR 122 crores on expansion in the quarter and expects total capex of INR 450 crores for FY26. Management indicated maintenance work will complete by end of Q2, with optimum utilization expected from Q3 onwards.",
            "Sentiment": "neutral",
            "PublishDate": 1754478786301,
            "Source": "earnings"
        },
        {
            "Title": "Epigral Projects Stronger H2 Performance, Plans Rs 450 Crore Capex for FY26",
            "Summary": "Epigral expects the second half of FY26 to perform better than the first half. The company projects net debt of approximately Rs 600 crores and has planned capital expenditure of Rs 450 crores for FY26, with Rs 120 crores already utilized in the first quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754365435232,
            "Source": "stock"
        },
        {
            "Title": "Epigral Limited Makes Q1 FY2026 Results Conference Call Audio Recording Available",
            "Summary": "Epigral Limited has made the audio recording of their Q1 FY2026 results conference call available online. The conference call was held on August 4, 2025 at 4:00 p.m. The company provided web links where the recording can be accessed and notified both BSE Limited and National Stock Exchange of India Limited about the availability of this recording. The communication was signed by Gaurang Trivedi, Company Secretary & Compliance Officer.",
            "Sentiment": "neutral",
            "PublishDate": 1754312298190,
            "Source": "earnings"
        },
        {
            "Title": "Epigral Co Plans to Raise ₹4 Billion Through Bond Issuance",
            "Summary": "Epigral Co has announced plans to raise up to ₹4 billion through the issuance of bonds. The company is pursuing this debt financing route to raise capital.",
            "Sentiment": "neutral",
            "PublishDate": 1754121586175,
            "Source": "stock"
        },
        {
            "Title": "Epigral Limited Approves Q1 2025 Results and Plans Rs 400 Crore Debt Fundraising",
            "Summary": "Epigral Limited's Board approved unaudited financial results for Q1 2025 ended June 30, 2025. The company reported standalone revenue from operations of Rs 606.54 crores compared to Rs 651.20 crores in the corresponding quarter of the previous year. Profit after tax increased significantly to Rs 160.41 crores from Rs 86.01 crores in the same period last year. Earnings per share stood at Rs 37.18 compared to Rs 20.70 in Q1 2024. The Board also approved a proposal to raise funds up to Rs 400 crores through issuance of non-convertible debentures, bonds and other debt securities in one or more tranches. The company operates primarily in manufacturing and selling Chloro Alkali & its Derivatives. During the quarter, Epigral entered into agreements to invest Rs 21.38 crores in a wind-solar hybrid power project and committed to purchase minimum 51% of the power generated for 20 years.",
            "Sentiment": "positive",
            "PublishDate": 1754120865052,
            "Source": "earnings"
        },
        {
            "Title": "Epigral Limited Schedules Conference Call to Discuss Q1 FY26 Results",
            "Summary": "Epigral Limited has scheduled a conference call on August 4, 2025, at 4:00 PM IST to discuss their Q1 FY26 financial results. The call will be hosted by Emkay Global Financial Services and will feature key company executives including Chairman and Managing Director Maulik Patel, Executive Director Kaushal Soparkar, Chief Financial Officer Sanjay Jain, and Milind Kotecha from Investor Relations and Strategy. The company has provided dial-in numbers for both domestic and international participants across multiple countries.",
            "Sentiment": "neutral",
            "PublishDate": 1753868021823,
            "Source": "earnings"
        },
        {
            "Title": "Epigral Schedules Board Meeting on August 2 to Discuss Fundraising Plans",
            "Summary": "Epigral has scheduled a board meeting for August 2 to discuss fundraising plans. The meeting will focus on the company's capital raising initiatives.",
            "Sentiment": "neutral",
            "PublishDate": 1753699653110,
            "Source": "corporate_action"
        },
        {
            "Title": "Epigral Signs Agreements for Wind Solar Hybrid Power",
            "Summary": "Epigral has announced the execution of two agreements to source 19.80 MW of wind solar hybrid power. The company is moving towards renewable energy sources, combining wind and solar power in a hybrid model.",
            "Sentiment": "positive",
            "PublishDate": 1749015561000,
            "Source": "default"
        },
        {
            "Title": "EPIGRAL Projects Long-Term EBITDA Margin of 25%",
            "Summary": "EPIGRAL has announced its financial outlook during a conference call, stating that the company expects to achieve an average EBITDA margin of 25% in the long term. This projection is based on their current business model and revenue mix. For the near term, the company has provided guidance for a margin of around 25%.",
            "Sentiment": "positive",
            "PublishDate": 1746501976000,
            "Source": "default"
        },
        {
            "Title": "Epigral Reports Lower-Than-Expected Volume Growth",
            "Summary": "Epigral has reported a volume growth of 11%, which falls short of their previously provided guidance range of 20%.",
            "Sentiment": "negative",
            "PublishDate": 1746438309000,
            "Source": "default"
        },
        {
            "Title": "EPIGRAL Reports Q4 FY2023 Financial Results and Dividend Declaration",
            "Summary": "EPIGRAL announced its Q4 financial results, showing a year-over-year revenue increase from 5.25B to 6.28B rupees. EBITDA slightly improved from 1.72B to 1.74B rupees, although the EBITDA margin decreased from 32.8% to 27.7%. The company declared a dividend of 3.5 rupees per share. Consolidated net profit rose from 773M to 870M rupees compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1746437394000,
            "Source": "result"
        },
        {
            "Title": "Epigral Commissions India's First Chlorotoluenes Value Chain Facility",
            "Summary": "Epigral has successfully commissioned India's first Chlorotoluenes Value Chain Facility at its Dahej location. This marks a significant milestone in the country's chemical manufacturing capabilities, potentially enhancing Epigral's product offerings and market position.",
            "Sentiment": "positive",
            "PublishDate": 1742803874000,
            "Source": "corporate_action"
        },
        {
            "Title": "Epigral Ltd.: Shares Surge 9% on Strong Q3 Results and Dividend Announcement",
            "Summary": "Epigral Ltd. reported robust Q3 FY2025 results with net profit doubling to Rs 104 crore and revenue increasing by 36.8% to Rs 645 crore. The company declared an interim dividend of Rs 2.5 per share. Shares jumped 9.1% to Rs 1,843.95 on NSE following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1737968838000,
            "Source": "result"
        },
        {
            "Title": "Epigral Announces Expansion Plans for CPVC Resin and Epichlorohydrin Production",
            "Summary": "Epigral has announced plans to double its production capacity for CPVC resin and epichlorohydrin. The company expects these expansion projects to contribute to increased volume from the fiscal year 2027 onwards.",
            "Sentiment": "positive",
            "PublishDate": 1737967579000,
            "Source": "corporate_action"
        },
        {
            "Title": "Epigral Announces Upcoming Project Contributions",
            "Summary": "Epigral reports that several projects will contribute to their financial performance in FY2026. Additionally, their chlorotoluenes value chain is expected to be commissioned in the current quarter, further enhancing their future prospects.",
            "Sentiment": "positive",
            "PublishDate": 1737967550000,
            "Source": "corporate_action"
        },
        {
            "Title": "EPIGRAL Reports Significant Revenue Growth in Q3",
            "Summary": "EPIGRAL has announced its third-quarter revenue results, showing a substantial increase from 4.7 billion rupees to 6.45 billion rupees year-over-year. This represents a significant growth in the company's financial performance for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737966156000,
            "Source": "earnings"
        },
        {
            "Title": "EPIGRAL Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "EPIGRAL has announced its Q3 consolidated net profit, which stands at 1.04 billion rupees. This represents a substantial increase from the 491 million rupees reported in the same quarter of the previous year, indicating a year-over-year growth in the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1737966042000,
            "Source": "earnings"
        },
        {
            "Title": "Epigral Ltd: CMD Projects Double-Digit Volume Growth Over Five Years",
            "Summary": "Epigral's CMD Maulik Patel anticipates double-digit volume growth over the next five years, driven by increased production capacity and strong domestic demand for CPVC resin and Epichlorohydrin. The company plans to double CPVC resin capacity to 150,000 tonnes and Epichlorohydrin to 100,000 tonnes annually. Expansion will be funded through internal accruals, recent QIP proceeds, and minimal debt. Q3 and Q4 are expected to show improved performance in quantity and value.",
            "Sentiment": "positive",
            "PublishDate": 1732417977000,
            "Source": "normal_news"
        },
        {
            "Title": "Epigral: Chemical Giant's Stock Soars 120% in a Year",
            "Summary": "Epigral's stock price surged 120% in the past year, trading at ₹2,057. Q2 earnings exceeded expectations with PAT up 111% to ₹81 crore and revenue up 32% to ₹632 crore. The company plans to expand CPVC resin and Epichlorohydrin capacities at its Dahej facility, making it the largest CPVC resin facility globally and largest Epichlorohydrin facility in India.",
            "Sentiment": "positive",
            "PublishDate": 1731910303000,
            "Source": "result"
        },
        {
            "Title": "EPIGRAL Reports Strong Q2 Financial Performance",
            "Summary": "EPIGRAL has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 1.78 billion rupees from 1.08 billion rupees in the same quarter last year. Additionally, EPIGRAL's EBITDA margin expanded to 28.35% from 22.57% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1731141612000,
            "Source": "result"
        },
        {
            "Title": "EPIGRAL Reports Strong Q2 Financial Results",
            "Summary": "EPIGRAL has announced its Q2 financial results, showing significant year-over-year growth. The company's consolidated net profit increased from 380 million rupees to 813 million rupees. Revenue also saw a substantial rise, growing from 4.8 billion rupees to 6.26 billion rupees compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731141593000,
            "Source": "result"
        },
        {
            "Title": "Epigral Approves Major Capacity Expansion for CPVC Resin and Epichlorohydrin",
            "Summary": "Epigral has approved a significant capacity expansion project at their Dahej facility. The plan includes increasing production capacity by 75,000 TPA for CPVC Resin and 50,000 TPA for Epichlorohydrin. This expansion is scheduled to be completed by the first half of FY2027 and involves an investment of Rs. 780 crore. The company aims to enhance its market penetration through this initiative.",
            "Sentiment": "positive",
            "PublishDate": 1731141023000,
            "Source": "corporate_action"
        },
        {
            "Title": "Epigral Ltd: Chemical Manufacturer Raises Rs 333 Crore via QIP",
            "Summary": "Epigral Ltd completed a Qualified Institutional Placement (QIP), raising Rs 333.05 crore at Rs 2,093.13 per share. The QIP attracted major investors like HSBC AMC, Bandhan AMC, and Morgan Stanley. Funds will support growth plans and market expansion. The company issued 15.91 lakh new shares, increasing total outstanding shares to 4.31 crore.",
            "Sentiment": "positive",
            "PublishDate": 1729848757000,
            "Source": "corporate_action"
        },
        {
            "Title": "Epigral Launches Qualified Institutional Placement",
            "Summary": "Epigral has initiated a Qualified Institutional Placement (QIP) with a floor price set at ₹2,203.29 per share. The QIP opens today, allowing the company to raise capital from qualified institutional buyers.",
            "Sentiment": "neutral",
            "PublishDate": 1729530569000,
            "Source": "corporate_action"
        }
    ]
}