{
    "Symbol": "EPL",
    "ISIN": "INE255A01020",
    "News": [
        {
            "Title": "EPL Limited Q3FY26 Results Call on Feb 13",
            "Summary": "EPL Limited announces investor conference call on February 13, 2026 at 5:30 PM IST to discuss Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770396286448,
            "Source": "co_actions_results"
        },
        {
            "Title": "EPL Limited Issues ₹60 Crore Commercial Papers",
            "Summary": "EPL Limited successfully issued and allotted commercial papers worth ₹60 crore on January 22, 2026, with a maturity period of three months and discount rate of 6.977% per annum.",
            "Sentiment": "positive",
            "PublishDate": 1769087264193,
            "Source": "co_actions_results"
        },
        {
            "Title": "EPL Limited Files Q3 FY26 Commercial Paper Compliance",
            "Summary": "EPL Limited submitted CEO/CFO certificate to BSE and NSE confirming proper utilisation of Commercial Papers proceeds for Q3 FY26 ended December 31, 2025, in compliance with SEBI Master Circular requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1769078682161,
            "Source": "stocks"
        },
        {
            "Title": "EPL Limited Sets Record Date for Commercial Papers",
            "Summary": "EPL Limited announces January 22, 2026 as record date for maturity of ₹50 crore Commercial Papers due January 23, 2026, issued in October 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768556668174,
            "Source": "co_actions_results"
        },
        {
            "Title": "EPL Limited Invests ₹14.8 Cr in Thailand Expansion",
            "Summary": "EPL Limited announces strategic investment of ₹14.8 crores to expand laminated tube production capacity in Thailand, strengthening its international manufacturing footprint.",
            "Sentiment": "positive",
            "PublishDate": 1765375379989,
            "Source": "stocks"
        },
        {
            "Title": "EPL Limited Invests ₹14.8 Crores in Thailand Laminated Tube Production Expansion",
            "Summary": "EPL Limited has made an investment of ₹14.8 crores to expand its laminated tube production capabilities in Thailand. The investment aims to grow the company's manufacturing capacity in the Thai market.",
            "Sentiment": "positive",
            "PublishDate": 1765334454145,
            "Source": "stock"
        },
        {
            "Title": "EPL Limited Successfully Redeems Rs. 30 Crore Commercial Papers on Maturity",
            "Summary": "EPL Limited has fulfilled its payment obligations by fully redeeming Commercial Papers worth Rs. 30 crore that matured on December 8, 2025. The Commercial Papers were originally issued and allotted by the company on September 11, 2025, with ISIN INE255A14684.",
            "Sentiment": "positive",
            "PublishDate": 1765267886089,
            "Source": "corporate_action"
        },
        {
            "Title": "EPL Limited Allots 17,415 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "EPL Limited's Security Committee approved allotment of 17,415 equity shares of Rs. 2 face value each following exercise of stock options under the Employee Stock Option Scheme 2020. The company's paid-up equity share capital increased from Rs. 64,04,02,980 to Rs. 64,04,37,810, with total equity shares rising to 32,02,18,905.",
            "Sentiment": "neutral",
            "PublishDate": 1764781996063,
            "Source": "corporate_action"
        },
        {
            "Title": "EPL Limited Issues Rs. 45 Crore Commercial Papers with 6.45% Discount Rate",
            "Summary": "EPL Limited issued and allotted commercial papers worth Rs. 45 crore on December 3, 2025, with a maturity date of March 2, 2026, carrying a discount rate of 6.45% per annum and yield rate of 6.55% per annum. The company is in the process of listing these commercial papers with the National Stock Exchange of India Limited, though the allotment is stated to be non-material in nature to the company.",
            "Sentiment": "neutral",
            "PublishDate": 1764781740001,
            "Source": "corporate_action"
        },
        {
            "Title": "EPL Limited Redeems Rs. 55 Crore Commercial Papers on Maturity",
            "Summary": "EPL Limited successfully fulfilled its payment obligations by fully redeeming Commercial Papers worth Rs. 55 Crore that matured on December 3, 2025. The Commercial Papers were originally issued and allotted by the company on September 4, 2025, with a record date of December 2, 2025 for maturity purposes.",
            "Sentiment": "positive",
            "PublishDate": 1764780985188,
            "Source": "corporate_action"
        },
        {
            "Title": "EPL Limited Sets Record Date for Rs. 30 Crore Commercial Paper Maturity",
            "Summary": "EPL Limited has announced that its commercial papers worth Rs. 30 crore, issued on September 11, 2025, will mature on December 8, 2025, with a record date of December 5, 2025. The company has informed stock exchanges BSE and NSE about the maturity details as per regulatory requirements for listed commercial papers.",
            "Sentiment": "neutral",
            "PublishDate": 1764310356537,
            "Source": "corporate_action"
        },
        {
            "Title": "EPL Limited Receives Credit Rating Affirmation from India Ratings",
            "Summary": "India Ratings and Research affirmed EPL Limited's credit ratings at IND AA/Stable for facilities and IND A1+ for commercial paper on November 27, 2025. The rating affirmation maintains the company's existing credit profile and provides continued access to debt markets at current terms.",
            "Sentiment": "positive",
            "PublishDate": 1764309628354,
            "Source": "corporate_action"
        },
        {
            "Title": "EPL Limited Sets Record Date for Rs. 55 Crore Commercial Paper Maturity",
            "Summary": "EPL Limited has announced December 2, 2025 as the record date for its commercial papers worth Rs. 55 crore that are scheduled to mature on December 3, 2025. The commercial papers were originally issued on September 4, 2025 and the company has informed stock exchanges about the maturity timeline as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1764085963398,
            "Source": "corporate_action"
        },
        {
            "Title": "EPL Limited Reports Strong Q2 FY26 Results with 11% Revenue Growth and Leadership Transition",
            "Summary": "EPL Limited delivered robust quarterly performance with 11% revenue growth, 16.1% EBITDA growth, and 19.9% PAT growth, driven by 26.3% growth in Beauty Cosmetics category and strong momentum in Americas region. Managing Director Anand Kripalu will retire at year-end with Hemant Bakshi taking over as MD and Global CEO from January 1, 2026, while the company announced an interim dividend of INR 2.50 per share.",
            "Sentiment": "positive",
            "PublishDate": 1763385690709,
            "Source": "earnings"
        },
        {
            "Title": "EPL Limited Seeks Shareholder Approval for Employee Stock Option Scheme 2025",
            "Summary": "EPL Limited is conducting a postal ballot seeking member approval for its Employee Stock Option Scheme 2025, offering up to 80,05,037 stock options to eligible employees of the company and its subsidiaries. The remote e-voting period runs from November 15, 2025 to December 14, 2025, with options exercisable at market price with up to 20% discount as determined by the Nomination and Remuneration Committee.",
            "Sentiment": "positive",
            "PublishDate": 1763058386225,
            "Source": "corporate_action"
        },
        {
            "Title": "EPL Management Forecasts Double-Digit Sales Growth and Quarterly Recovery",
            "Summary": "EPL management expressed confidence in achieving double-digit sales growth going forward. The company expects growth to rebound in the coming quarters.",
            "Sentiment": "positive",
            "PublishDate": 1762939386167,
            "Source": "stock"
        },
        {
            "Title": "EPL Limited Reports Strong Q2FY26 Results with 11% Revenue Growth and 16.1% EBITDA Increase",
            "Summary": "EPL Limited delivered robust quarterly results with revenue growth of 11.0% and EBITDA growth of 16.1%. The company's EBITDA margin expanded to 20.9%, representing a 91 basis points year-over-year improvement. Profit After Tax grew by 19.9%, with earnings per share increasing to Rs. 3.26 from Rs. 2.73 in the previous year. The Personal Care and Beyond segment showed strong momentum with 19.4% growth, powered by Beauty and Cosmetics growth of 26.3%. This segment now represents 50% of the company's mix. The Net Debt to EBITDA ratio improved significantly to 0.51x from 0.76x year-over-year. Return on Capital Employed reached 18.7%, marking a 220 basis points year-over-year increase. Regional performance varied with Americas delivering 27.4% revenue growth, EAP achieving 10.6% growth, Europe recording 2.8% growth, and AMESA experiencing a marginal decline of 0.7%. EPL achieved EcoVadis Platinum certification, placing it among the top 1% of over 150,000 companies assessed globally for sustainability performance. The company has been certified as Great Place to Work across 7 countries.",
            "Sentiment": "positive",
            "PublishDate": 1762874717352,
            "Source": "earnings"
        },
        {
            "Title": "EPL Limited Declares Interim Dividend of Rs. 2.50 Per Share",
            "Summary": "EPL Limited's Board of Directors approved an interim dividend of Rs. 2.50 per equity share with a face value of Rs. 2 each for the financial year ending March 31, 2026. The company has set Monday, November 17, 2025, as the record date to determine shareholder eligibility for the interim dividend payment.",
            "Sentiment": "positive",
            "PublishDate": 1762863169612,
            "Source": "corporate_action"
        },
        {
            "Title": "EPL Limited Allots 24,600 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "EPL Limited has allotted 24,600 equity shares with a face value of Rs. 2 each following the exercise of stock options under its Employee Stock Option Scheme 2020. The Security Committee of the Board of Directors approved the allotment. The newly allotted shares rank equally with existing fully paid-up equity shares. Following this allotment, the company's paid-up equity share capital increased from Rs. 64,03,53,780 (comprising 32,01,76,890 equity shares) to Rs. 64,04,02,980 (comprising 32,02,01,490 equity shares). The company clarified that this allotment is not material in nature.",
            "Sentiment": "neutral",
            "PublishDate": 1762855363165,
            "Source": "corporate_action"
        },
        {
            "Title": "EPL Reports Strong Q2 Performance with 19.5% Jump in Net Profit",
            "Summary": "EPL reported quarterly net profit of 1.04 billion rupees compared to 870 million rupees in the same period last year. Revenue increased to 12 billion rupees from 10.9 billion rupees year-over-year. EBITDA rose to 2.52 billion rupees from 2.2 billion rupees, while EBITDA margin improved to 20.86% from 20.3% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762845723559,
            "Source": "earnings"
        },
        {
            "Title": "EPL Limited Issues Rs. 50 Crore Commercial Paper with 6.58% Yield",
            "Summary": "EPL Limited issued and allotted commercial paper worth Rs. 50 crore on October 27, 2025, with listing approval received on October 28, 2025. The commercial paper consists of 1,000 units with a face value of Rs. 5 lakh per unit, carrying a discount rate of 6.48% per annum and yield rate of 6.58% per annum. The paper has a maturity date of January 23, 2026. The company clarified that this allotment is not material in nature to the company.",
            "Sentiment": "neutral",
            "PublishDate": 1761646250418,
            "Source": "corporate_action"
        },
        {
            "Title": "EPL Limited CEO Anand Kripalu to Retire, Hemant Bakshi Named Successor",
            "Summary": "Anand Kripalu announced his retirement from executive responsibilities at EPL Limited, stepping down as Managing Director and Global CEO at the end of 2025. Hemant Bakshi has joined as CEO-Designate and will take over from January 1, 2026. Kripalu will continue as Non-Executive Director and support the transition until March 31, 2026. During Kripalu's tenure, EPL's margins expanded by 500 basis points over 12 quarters, with Beauty & Cosmetics and Personal Care contributing over 50% of revenue. The company expanded to Brazil and Thailand and achieved EcoVadis Platinum status, ranking in the top 1% of 150,000 assessed companies. Bakshi brings over 30 years of FMCG experience, including roles as CEO of Unilever Indonesia and founder of GroNext Technologies. EPL targets double-digit revenue growth and improving ROCE from 18% to over 25% by FY 2029. Indorama holds a 24.9% stake and supported EPL's Thailand plant launch.",
            "Sentiment": "positive",
            "PublishDate": 1760939484182,
            "Source": "corporate_governance"
        },
        {
            "Title": "EPL Issues ₹55 Crore Commercial Paper",
            "Summary": "EPL has issued and allotted commercial paper worth ₹55 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1757072273367,
            "Source": "corporate_action"
        },
        {
            "Title": "EPL Limited Shareholders Approve Aloke Lohia's Appointment as Non-Executive Director",
            "Summary": "EPL Limited announced that shareholders approved the appointment of Mr. Aloke Lohia as Non-Executive, Non-Independent Director effective May 27, 2025, through a postal ballot conducted via remote e-voting. The voting took place from July 19 to August 17, 2025, with 99.71% of votes cast in favor of the resolution. Out of 31.97 crore total shares, 25.33 crore shares participated in the voting process, representing 79.23% participation. The Promoter and Promoter Group voted 100% in favor, while Public-Institutions and Public-Non Institutions voted 99.98% and 99.00% in favor respectively. Mr. Mehul Pitroda served as the scrutinizer for the voting process.",
            "Sentiment": "positive",
            "PublishDate": 1755529253246,
            "Source": "corporate_governance"
        },
        {
            "Title": "EPL Limited Reports Strong Q1 FY26 Results with 10% Revenue Growth and 55.8% PAT Surge",
            "Summary": "EPL Limited delivered robust quarterly results with consolidated revenue growing 10% driven by strong double-digit growth in three of four regions. Europe grew 15%, Americas 13%, and EAP 10%, while AMESA showed modest 1.7% growth amid macroeconomic headwinds and sluggish FMCG demand. Beauty & Cosmetics segment posted exceptional 35% year-on-year growth. EBITDA margins expanded to 20.5%, marking the 12th consecutive quarter of margin expansion, with EBITDA growing 18.1%. PAT surged 55.8% with EPS improving from INR 2.02 to INR 3.13 per share. Net debt-to-EBITDA ratio improved to 0.45 while ROCE increased to 18.9%. Sustainable tube formats contributed 38% of total sales. The company received top A rating from CDP for supplier engagement for the third consecutive year. Brazil capacity expansion is performing ahead of plan, and Thailand greenfield facility will start contributing in the second half. Management expressed confidence in sustaining double-digit revenue growth with strong operating margins, citing recovery expectations in oral care volumes and continued momentum in beauty & cosmetics. The company is actively exploring M&A opportunities in the beauty & cosmetics space globally.",
            "Sentiment": "positive",
            "PublishDate": 1754922614003,
            "Source": "earnings"
        },
        {
            "Title": "EPL Management Expects H2 Growth Through Thailand Operations and Brazil Expansion",
            "Summary": "EPL management anticipates acceleration in the second half through the ramp-up of their Thailand plant operations and expansion in Brazil. The company is also continuing its strategic shift toward a high-margin, sustainable product portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1754403340077,
            "Source": "stock"
        },
        {
            "Title": "EPL Limited Reports Q1 FY2026 Results with Mixed Performance Across Standalone and Consolidated Operations",
            "Summary": "EPL Limited announced its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs. 3,340 million compared to Rs. 3,297 million in the same quarter last year, with net profit after tax of Rs. 316 million versus Rs. 386 million in the previous year. On a consolidated basis, revenue from operations increased to Rs. 11,079 million from Rs. 10,074 million year-over-year, while net profit after tax rose to Rs. 1,014 million from Rs. 657 million. The company's consolidated operations showed stronger performance with earnings per share of Rs. 3.13 compared to Rs. 2.02 in the corresponding quarter. During the quarter, EPL allotted 228,818 equity shares under its Employee Stock Option Scheme and invested Rs. 153 million in a newly incorporated subsidiary, EPL Packaging (Thailand) Co., Ltd. The company also raised funds through Commercial Papers listed on the National Stock Exchange.",
            "Sentiment": "neutral",
            "PublishDate": 1754395090929,
            "Source": "earnings"
        },
        {
            "Title": "EPL Limited Invests Rs 150 Crores in Brazilian Subsidiary for Additional Shares",
            "Summary": "EPL Limited has invested Rs 150 crores (USD 16.99 million) in its wholly-owned subsidiary EPL Brasil Ltda for acquiring approximately 96,337,471 additional equity shares with face value of R$1.00 each. The investment was approved by the company's internal sub-committee of the Board of Directors. EPL Brasil operates in manufacturing and trading of packaging products including laminated tubes, laminates and plastic tubes. The subsidiary was incorporated on May 25, 2022, and reported turnover of Rs 151.08 crores in FY 2024-25, compared to Rs 76.78 crores in FY 2023-24 and nil in FY 2022-23. EPL Limited will continue to hold 100% shareholding in EPL Brasil after this additional investment. The investment formalities are expected to be completed by August 31, 2025, and the company expects this to have a favorable impact on EPL Brasil's financial outlook.",
            "Sentiment": "positive",
            "PublishDate": 1754329871231,
            "Source": "stock"
        },
        {
            "Title": "EPL Allocates ₹114.81 Million to Thailand Subsidiary EPTL",
            "Summary": "EPL has allocated ₹114.81 million to its Thailand-based subsidiary, EPTL, to enhance its global lamitube production network. This investment aims to strengthen EPL's manufacturing capabilities and expand its international presence in the lamitube market.",
            "Sentiment": "positive",
            "PublishDate": 1749090411000,
            "Source": "default"
        },
        {
            "Title": "CCI Approves Indorama's Acquisition of EPL Limited Shareholding",
            "Summary": "The Competition Commission of India (CCI) has granted approval for Indorama Netherlands B.V. to acquire shareholding in EPL Limited. This decision represents a significant corporate action that could potentially impact the ownership structure and future operations of EPL Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1747140855000,
            "Source": "default"
        },
        {
            "Title": "EPL Reports Strong Q4 Results and Announces Dividend",
            "Summary": "EPL has reported a significant increase in net profit for Q4, rising to 1.14 billion rupees from 223 million rupees year-over-year and 935 million rupees quarter-over-quarter. The company's revenue for Q4 also increased to 11 billion rupees from 10.3 billion rupees year-over-year. Additionally, EPL has declared a final dividend of 2.5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746749118000,
            "Source": "default"
        },
        {
            "Title": "EPL Reports Q4 Financial Results and Dividend Declaration",
            "Summary": "EPL has announced its Q4 financial results, showing improved performance. The company reported an EBITDA of 2.3 billion rupees, up from 1.9 billion rupees year-over-year. The EBITDA margin also increased to 20.63% from 18.55% in the same period last year. Additionally, EPL declared a final dividend of 2.5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746706822000,
            "Source": "result"
        },
        {
            "Title": "EPL Reports Significant Profit Growth in Q4",
            "Summary": "EPL has announced its Q4 financial results, showing a substantial increase in consolidated net profit. The company reported a net profit of 1.14 billion rupees, up from 223 million rupees year-over-year and 935 million rupees quarter-over-quarter. Revenue also saw growth, reaching 11 billion rupees compared to 10.3 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1746706730000,
            "Source": "result"
        },
        {
            "Title": "EPL Acquires Majority Stake in Thai Packaging Subsidiary",
            "Summary": "EPL has acquired 99% ownership of EPL Packaging Thailand for 4.90 million rupees, expanding its presence in the Southeast Asian packaging market.",
            "Sentiment": "positive",
            "PublishDate": 1746099580000,
            "Source": "default"
        },
        {
            "Title": "Epsilon to Sell 24.90% Stake to Indorama for ₹1,907.86 Crore",
            "Summary": "Epsilon has announced plans to sell a 24.90% stake to Indorama at a price of ₹240 per share. The total transaction value is ₹1,907.86 crore. This move represents a significant corporate action that will likely impact Epsilon's ownership structure and potentially its future strategic direction.",
            "Sentiment": "neutral",
            "PublishDate": 1740368593000,
            "Source": "corporate_action"
        },
        {
            "Title": "EPL Reports Mixed Q3 Financial Results",
            "Summary": "EPL has announced its Q3 financial results, showing a significant year-over-year decrease in EBITDA from 1.83 billion rupees to 202 million rupees. However, the company's EBITDA margin improved slightly, rising from 18.81% to 19.88% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739278310000,
            "Source": "earnings"
        },
        {
            "Title": "EPL Reports Increased Q3 Profit and Revenue",
            "Summary": "EPL has announced its Q3 financial results, showing improvements in both profit and revenue. The company's consolidated net profit rose to 941 million rupees from 861 million rupees in the same quarter last year. Revenue also increased to 10 billion rupees from 9.75 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739278302000,
            "Source": "earnings"
        },
        {
            "Title": "Blackstone Maintains Majority Stake in EPL",
            "Summary": "Blackstone, the promoter of EPL (formerly known as Essel Propack Limited), currently holds a 51.47% stake in the company. This indicates that Blackstone maintains a controlling interest in EPL, a significant position that allows them to influence major company decisions.",
            "Sentiment": "neutral",
            "PublishDate": 1735897497000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Blackstone Seeks to Sell Controlling Stake in EPL",
            "Summary": "Private equity firm Blackstone has engaged Morgan Stanley to facilitate the sale of its controlling stake in EPL, a packaging company. This move indicates Blackstone's intention to divest its investment in the packaging sector.",
            "Sentiment": "neutral",
            "PublishDate": 1735897442000,
            "Source": "corporate_action"
        },
        {
            "Title": "EPL Incorporates New Subsidiary in Thailand",
            "Summary": "EPL has established a new subsidiary in Thailand to expand its manufacturing and trading operations for laminated tubes. This move is part of the company's strategy to pursue growth opportunities in the region.",
            "Sentiment": "positive",
            "PublishDate": 1734606116000,
            "Source": "corporate_action"
        },
        {
            "Title": "EPL Limited Increases Stake in Clean Max Aria for Renewable Energy",
            "Summary": "EPL Limited has invested an additional 4.16 crore rupees in Clean Max Aria Private Limited to increase its equity stake. This investment aims to enhance captive renewable power generation for EPL's manufacturing plants in Maharashtra and Gujarat, demonstrating the company's commitment to sustainable energy practices.",
            "Sentiment": "positive",
            "PublishDate": 1731463903000,
            "Source": "corporate_action"
        },
        {
            "Title": "EPL Declares Interim Dividend of ₹2.50 Per Share",
            "Summary": "EPL has announced an interim dividend of ₹2.50 per equity share. This corporate action represents a distribution of profits to shareholders, indicating positive financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1731330591000,
            "Source": "corporate_action"
        },
        {
            "Title": "EPL Reports Improved Q2 Financial Performance",
            "Summary": "EPL announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 1.8 billion rupees to 2.2 billion rupees. Additionally, the EBITDA margin expanded from 18.07% to 20.30% compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731330408000,
            "Source": "result"
        },
        {
            "Title": "EPL Reports 9% Year-over-Year Revenue Growth in Q2",
            "Summary": "EPL has announced its second quarter revenue, which stands at 10.9 billion rupees. This represents a 9% increase compared to the same period last year when the revenue was 10 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1731330282000,
            "Source": "result"
        },
        {
            "Title": "EPL Reports Significant Profit Growth in Q2",
            "Summary": "EPL (formerly known as Essel Propack Limited) has announced its Q2 consolidated net profit of 870 million rupees, showing a substantial increase compared to 505 million rupees in the same quarter last year (YoY) and 642 million rupees in the previous quarter (QoQ).",
            "Sentiment": "positive",
            "PublishDate": 1731330224000,
            "Source": "result"
        },
        {
            "Title": "Blackstone: Strategic Review and Potential Stake Sale of EPL",
            "Summary": "Blackstone is exploring options for a strategic review of EPL Ltd, including a potential full stake sale. Preliminary interest from private equity firms and strategic buyers has been noted. Blackstone currently holds a 51.47% controlling stake in EPL, valued at Rs 4,402 crore. No formal sale process or advisor appointment has occurred yet.",
            "Sentiment": "neutral",
            "PublishDate": 1730338894000,
            "Source": "corporate_action"
        },
        {
            "Title": "EPL Acquires 49% Stake in Clean Max Aria, Signs Energy Supply Agreements",
            "Summary": "<p>EPL has agreed to <span class='positive'>acquire</span> a <span class='neutral'>49% equity stake</span> in <span class='neutral'>Clean Max Aria Pvt Ltd</span> (CMAPL) from Clean Max Enviro Energy Solutions Pvt Ltd. Additionally, EPL has <span class='positive'>entered into</span> <b>energy supply agreements</b> with CMAPL.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728396056000,
            "Source": "corporate_action"
        }
    ]
}