{
    "Symbol": "EQUITASBNK",
    "ISIN": "INE063P01018",
    "News": [
        {
            "Title": "Equitas Small Finance Bank Schedules Investor Roadshow",
            "Summary": "Equitas Small Finance Bank announces non-deal roadshow on February 16, 2026, with meetings scheduled with five institutional investors including Canara Robeco Mutual Fund and General Atlantic in Mumbai.",
            "Sentiment": "neutral",
            "PublishDate": 1770822322860,
            "Source": "stocks"
        },
        {
            "Title": "Equitas Small Finance Bank Gets RBI Nod for ICICI Deal",
            "Summary": "RBI approves ICICI Prudential Asset Management Company Limited and ICICI Bank group entities to acquire up to 9.95% stake in Equitas Small Finance Bank, subject to regulatory compliance conditions.",
            "Sentiment": "positive",
            "PublishDate": 1770813153691,
            "Source": "co_actions_results"
        },
        {
            "Title": "Equitas Small Finance Bank Allots 69,655 ESOP Shares",
            "Summary": "Equitas Small Finance Bank allotted 69,655 equity shares under its ESOP Scheme on February 04, 2026, increasing paid-up share capital from Rs. 11,40,91,84,080 to Rs. 11,40,98,80,630.",
            "Sentiment": "neutral",
            "PublishDate": 1770189344691,
            "Source": "co_actions_results"
        },
        {
            "Title": "Equitas Small Finance Bank Reopens Trading Window",
            "Summary": "Equitas Small Finance Bank announces reopening of trading window effective February 01, 2026, following special trading day notification for Union Budget 2026 by NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1769689559971,
            "Source": "stocks"
        },
        {
            "Title": "Equitas Small Finance Bank Q3 Net Profit Jumps 36%",
            "Summary": "Equitas Small Finance Bank reported a strong 36% year-on-year growth in Q3 net profit, rising to ₹900 million from ₹663 million in the same period last year, demonstrating robust financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1769674114543,
            "Source": "co_actions_results"
        },
        {
            "Title": "Equitas Small Finance Bank Q3FY26 Earnings Call Jan 30",
            "Summary": "Equitas Small Finance Bank schedules board meeting on January 29, 2026 to approve Q3FY26 unaudited financial results, followed by earnings call on January 30, 2026 at 11:00 AM.",
            "Sentiment": "neutral",
            "PublishDate": 1768221170722,
            "Source": "co_actions_results"
        },
        {
            "Title": "Equitas Small Finance Bank Q3 FY26 Advances Up 10.6%",
            "Summary": "Equitas Small Finance Bank reported 10.6% QoQ growth in gross advances for Q3 FY26, supported by strong disbursements of ₹6,557 crores, marking a 22% QoQ and 28% YoY increase in lending activity.",
            "Sentiment": "positive",
            "PublishDate": 1767580913886,
            "Source": "co_actions_results"
        },
        {
            "Title": "Equitas Small Finance Bank Senior Executive Resigns",
            "Summary": "John Alex, Head of Lead Bank, Govt. Liaison & Social Initiatives at Equitas Small Finance Bank, has resigned due to personal reasons. His resignation will be effective from April 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767350447220,
            "Source": "stocks"
        },
        {
            "Title": "Equitas Small Finance Bank Credit Ratings Affirmed by India Ratings",
            "Summary": "India Ratings and Research affirmed Equitas Small Finance Bank's credit ratings on December 09, 2025, maintaining IND AA-/Stable rating for Rs.1000 crore Tier II bonds and IND A1+ rating for Rs.2500 crore Certificate of Deposits. The rating affirmation confirms the bank's creditworthiness for its debt instruments and provides stability for investors and stakeholders.",
            "Sentiment": "positive",
            "PublishDate": 1765292909395,
            "Source": "stock"
        },
        {
            "Title": "Equitas Small Finance Bank Allots 1.23 Lakh Equity Shares Under ESOP Scheme",
            "Summary": "Equitas Small Finance Bank allotted 1,23,874 equity shares of Rs. 10 each to employees who exercised stock options under the ESFB Employee Stock Option Scheme, 2019. The bank's paid-up share capital increased from Rs. 11,40,59,60,190 to Rs. 11,40,71,98,930, with the new shares ranking equally with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764831411076,
            "Source": "corporate_action"
        },
        {
            "Title": "Equitas Small Finance Bank President-Finance Resigns",
            "Summary": "Manish Agrawal resigned from his position as President-Finance at Equitas Small Finance Bank on November 28, citing personal reasons. The departure affects the bank's senior finance leadership structure.",
            "Sentiment": "neutral",
            "PublishDate": 1764335906225,
            "Source": "corporate_governance"
        },
        {
            "Title": "Equitas Small Finance Bank Appoints Manish Agrawal as President – Finance",
            "Summary": "Equitas Small Finance Bank has appointed Manish Agrawal to the position of President – Finance.",
            "Sentiment": "positive",
            "PublishDate": 1762333336188,
            "Source": "corporate_governance"
        },
        {
            "Title": "Equitas Small Finance Bank Allots 80,300 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Equitas Small Finance Bank has allotted 80,300 equity shares of Rs. 10 each to employees who exercised their stock options under the ESFB Employee Stock Option Scheme, 2019. The allotment increases the bank's paid-up share capital from Rs. 11,40,51,57,190 to Rs. 11,40,59,60,190. The newly allotted equity shares will have equal rights with existing equity shares in all aspects.",
            "Sentiment": "neutral",
            "PublishDate": 1762292597641,
            "Source": "corporate_action"
        },
        {
            "Title": "Equitas Small Finance Bank Appoints Manish Agrawal as President-Finance",
            "Summary": "Equitas Small Finance Bank has appointed Manish Agrawal as President-Finance. Agrawal previously led bank finance at Kotak Mahindra Bank.",
            "Sentiment": "positive",
            "PublishDate": 1762149066868,
            "Source": "corporate_governance"
        },
        {
            "Title": "Equitas Small Finance Bank Shares Earnings Call Recording Link",
            "Summary": "Equitas Small Finance Bank provided the web link for the audio recording of its earnings call held on November 1, 2025, at 11:00 A.M. The call discussed the bank's unaudited financial results for the quarter and half year ended September 30, 2025. The bank stated that the transcript of the call will be made available within five working days on their website.",
            "Sentiment": "neutral",
            "PublishDate": 1761994608042,
            "Source": "earnings"
        },
        {
            "Title": "Equitas Small Finance Bank Senior Management Personnel Dheeraj Mohan Resigns",
            "Summary": "Equitas Small Finance Bank announced the resignation of Dheeraj Mohan, Head-Strategy, Customer Experience Investor Relations, BI Analytics, effective from the close of business hours on October 31, 2025. Mohan was originally scheduled to leave on November 21, 2025, but the bank management decided to relieve him earlier based on his request. He also ceased to be the Chief Investor Relation Officer (CIRO) from the same date. The bank informed stock exchanges NSE and BSE about this senior management personnel change under SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1761921709366,
            "Source": "corporate_governance"
        },
        {
            "Title": "Equitas Small Finance Bank Reports Quarterly Loss, Raises Rs 500 Crores Through NCDs",
            "Summary": "Equitas Small Finance Bank's Board approved unaudited financial results for the quarter and half year ended September 30, 2025. The bank reported a loss before tax of Rs 20,304.18 lakhs for the quarter, compared to a profit of Rs 5,582.06 lakhs in the previous quarter. For the half year, profit before tax was Rs 10,884.91 lakhs. The bank raised Rs 500 crores through Non-Convertible Debentures issued in December 2024 and July 2025, which have been fully utilized for intended purposes with no material deviation. Total deposits increased to Rs 44,09,350.31 lakhs from Rs 39,75,345.06 lakhs in the previous quarter. Advances rose to Rs 36,35,228.27 lakhs from Rs 33,96,250.05 lakhs. The bank also issued 6,43,777 equity shares during the half year under its ESOP scheme.",
            "Sentiment": "negative",
            "PublishDate": 1761898807303,
            "Source": "earnings"
        },
        {
            "Title": "Equitas Small Finance Bank Reports 85% Jump in Q2 Net Profit to 241 Million Rupees",
            "Summary": "Equitas Small Finance Bank reported a net profit of 241 million rupees in Q2, representing an 85% increase from 130 million rupees in the same period last year. The bank's interest earned rose to 16 billion rupees compared to 15.6 billion rupees year-on-year. Asset quality metrics remained stable with Gross Non-Performing Assets (GNPA) at 2.92% and Net Non-Performing Assets (NNPA) at 0.98%, both unchanged from the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761898391589,
            "Source": "earnings"
        },
        {
            "Title": "Equitas Small Finance Bank Schedules Board Meeting for Q2 FY2026 Results on October 31, 2025",
            "Summary": "Equitas Small Finance Bank has scheduled a Board of Directors meeting on October 31, 2025 to consider and approve the unaudited financial results for the quarter and half year ended September 30, 2025. The bank will host an earnings call with investors and analysts on November 1, 2025 at 11:00 AM to discuss the financial performance for Q2 FY2026. The call will be led by P N Vasudevan, Managing Director & CEO, along with the management team. The trading window for designated persons and their immediate relatives remains closed from October 1, 2025 and will reopen on November 3, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760694642492,
            "Source": "corporate_action"
        },
        {
            "Title": "Equitas Small Finance Bank Reports 9% Growth in Gross Advances, Deposits Rise 11%",
            "Summary": "Equitas Small Finance Bank reported gross advances of ₹39,145 crore as of September 30, 2025, marking a 4.08% quarter-on-quarter and 8.58% year-on-year growth. Disbursements improved significantly to ₹5,381 crore, up 53% sequentially and 11% year-on-year. Total deposits reached ₹44,094 crore, growing 10.92% year-on-year but declining 0.57% sequentially. CASA deposits increased to ₹13,622 crore, improving the CASA ratio to 31% from 29% in the previous quarter. The bank's cost of funds declined to 7.35% from 7.49%. Microfinance and micro loan advances stood at ₹3,414 crore, showing a 39.42% year-on-year decline but only a 3.46% sequential decline. Collection efficiency in microfinance improved to 98.56% from 97.97% in the previous quarter. The credit-deposit ratio improved to 84.14% from 79.91%. The bank sold non-performing assets worth approximately ₹216 crore to an Asset Reconstruction Company. Fresh overdue accounts in microfinance dropped to ₹30.16 crore from ₹97.48 crore in April 2025. Bank shares closed at ₹57.32, down 0.79%.",
            "Sentiment": "positive",
            "PublishDate": 1759569423266,
            "Source": "stock"
        },
        {
            "Title": "Equitas Small Finance Bank Reports Strong CASA Growth and Improved Cost Metrics in Q2FY26",
            "Summary": "Equitas Small Finance Bank reported quarterly results showing CASA deposits reaching ₹13,622 crore, representing growth of 12.78% year-over-year and 4.63% quarter-over-quarter. The bank's CASA ratio improved to 31% from 29% in the previous quarter and 30% in the same period last year. Funding costs decreased to 7.35% from 7.49% quarter-over-quarter and 7.50% year-over-year, indicating improved cost efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1759567538647,
            "Source": "earnings"
        },
        {
            "Title": "Equitas Small Finance Bank Designates Smitha Kumar as Senior Management Personnel",
            "Summary": "Equitas Small Finance Bank has designated Ms. Smitha Kumar as Senior Management Personnel effective October 1, 2025, following changes in the bank's internal reporting structure. Kumar will continue in her role as Head - Customer Experience. She brings over 26 years of experience in Service Delivery and Customer Experience across the BFSI sector and has been recognized with awards for her customer experience transformation initiatives.",
            "Sentiment": "neutral",
            "PublishDate": 1759236660338,
            "Source": "corporate_governance"
        },
        {
            "Title": "Equitas Small Finance Bank Announces Senior Management Changes with New Head of Internal Audit",
            "Summary": "Equitas Small Finance Bank has announced changes in senior management positions. Mr. Vikas Jagdish Jajoo will become the new Head of Internal Audit and join the Senior Management team, while Mr. V S Sivapprakash will transition to Head of Vigilance, effective September 12, 2025. Jajoo is a Chartered Accountant, Cost Accountant, and Certified Internal Auditor with three decades of experience in internal audit and risk management, having previously worked with Fusion Finance Limited, IndusInd Bank Limited, SBI Card and Spandana Sphoorty Financial Limited. His appointment is for a three-year term. Sivapprakash will cease to be Senior Management Personnel on the same date as he moves to his new role.",
            "Sentiment": "neutral",
            "PublishDate": 1757594727959,
            "Source": "corporate_governance"
        },
        {
            "Title": "Equitas Small Finance Bank Launches Revamped Mobile Banking App on 9th Anniversary",
            "Summary": "Equitas Small Finance Bank launched its enhanced Mobile Banking App called 'Equitas 2.0' to mark its 9th anniversary in banking. The upgraded app offers features including online account opening, fixed deposit booking, FD and RD management, IPO and mutual fund access, card management, utility payments, goal-based deposits, and reward redemption. MD & CEO Vasudevan P N stated the app strengthens their digital presence and demonstrates their technology team's dedication. Executive Director Balaji Nuthalapadi mentioned plans to develop the platform into a comprehensive super app that will integrate e-commerce, ticketing, and entertainment services for customers.",
            "Sentiment": "positive",
            "PublishDate": 1757047634388,
            "Source": "stock"
        },
        {
            "Title": "Equitas Small Finance Bank Publishes Q1 FY26 Earnings Call Transcript",
            "Summary": "Equitas Small Finance Bank Limited has made available the transcript of its Q1 FY26 earnings call held on August 08, 2025, on the company's website. The bank notified the National Stock Exchange of India Limited and BSE Limited about the availability of the transcript through a letter dated August 14, 2025. The transcript can be accessed through a link provided on the bank's investor relations webpage.",
            "Sentiment": "neutral",
            "PublishDate": 1755171296075,
            "Source": "earnings"
        },
        {
            "Title": "Equitas Small Finance Bank Makes Earnings Call Audio Recording Available for Q1 Results",
            "Summary": "Equitas Small Finance Bank Limited has made available the audio recording of its earnings call held on August 08, 2025, discussing unaudited financial results for the quarter ended June 30, 2025. The call was conducted at 4:30 PM and the audio recording can be accessed through a provided web link. The bank has indicated that a transcript of the earnings call will be made available on their website within five working days. The document serves as a regulatory filing to stock exchanges but does not contain specific financial metrics or performance details from the results.",
            "Sentiment": "neutral",
            "PublishDate": 1754677943620,
            "Source": "earnings"
        },
        {
            "Title": "Equitas Small Finance Bank Reports Net Loss of 2.2 Billion Rupees in Q1",
            "Summary": "Equitas Small Finance Bank posted a net loss of 2.2 billion rupees in Q1, compared to a profit of 258 million rupees in the same period last year. The bank's gross non-performing assets (GNPA) increased slightly to 2.92% from 2.89% in the previous quarter, while net non-performing assets (NNPA) remained stable at 0.98%. Interest earned grew to 16 billion rupees from 15 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1754642046111,
            "Source": "earnings"
        },
        {
            "Title": "Equitas Small Finance Bank Receives Listing Approval for Rs 500 Crore Bond Issue",
            "Summary": "Equitas Small Finance Bank Limited has received listing approval for 50,000 non-convertible debentures worth Rs 500 crores. The bonds are rated, unsecured, subordinated, and redeemable Lower Tier II instruments with a face value of Rs 1 lakh each, issued through private placement. The debentures were allotted on July 31, 2025, and listed on BSE on August 4, 2025. The bonds carry ratings of IND AA- from India Ratings and CARE AA- from Care Ratings, both with stable outlook. Interest payments are scheduled annually at Rs 9,600 per debenture, with the first payment due July 31, 2026. The bonds will mature on July 31, 2030. The bank has no history of defaults on other debt securities.",
            "Sentiment": "positive",
            "PublishDate": 1754373914357,
            "Source": "corporate_action"
        },
        {
            "Title": "Equitas Small Finance Bank Senior President Rohit Phadke Retires",
            "Summary": "Equitas Small Finance Bank announced the retirement of Mr. Rohit Phadke, Senior President and Senior Management Personnel, effective from the close of business hours on July 31, 2025. The bank communicated this development to the National Stock Exchange and BSE Limited, providing the required details under SEBI regulations for changes in senior management personnel.",
            "Sentiment": "neutral",
            "PublishDate": 1753967745137,
            "Source": "corporate_governance"
        },
        {
            "Title": "Equitas Small Finance Bank Raises ₹500 Crore Through Tier II NCD Allotment",
            "Summary": "Equitas Small Finance Bank has successfully raised ₹500 crore through the allotment of Tier II Non-Convertible Debentures (NCDs). This capital raising exercise will strengthen the bank's Tier II capital base.",
            "Sentiment": "positive",
            "PublishDate": 1753961238234,
            "Source": "stock"
        },
        {
            "Title": "Equitas Small Finance Bank Allots Rs 500 Crore Non-Convertible Debentures",
            "Summary": "Equitas Small Finance Bank has allotted 50,000 non-convertible debentures worth Rs 500 crores on July 31, 2025. The debentures are rated, listed, unsecured, subordinated, and redeemable Lower Tier II bonds issued through private placement. Each debenture has a face value of Rs 1 lakh with a coupon rate of 9.6% per annum. The bonds have a five-year tenure, maturing on July 31, 2030, with annual interest payments. The debentures will be listed on BSE Limited and include a green shoe option of Rs 250 crores. The redemption will be at par value of Rs 1 lakh per debenture plus accrued interest.",
            "Sentiment": "neutral",
            "PublishDate": 1753960217792,
            "Source": "corporate_action"
        },
        {
            "Title": "Equitas Small Finance Bank Schedules Board Meeting for Q1FY26 Results on August 8, 2025",
            "Summary": "Equitas Small Finance Bank Limited has scheduled a Board of Directors meeting on August 8, 2025 to consider and approve unaudited financial results for the quarter ended June 30, 2025. The bank will also conduct an earnings call with investors and analysts on the same day at 4:30 PM to discuss the financial performance. The trading window for designated persons and their immediate relatives remains closed from July 1, 2025 and will reopen on August 11, 2025. The earnings call will be led by Managing Director & CEO P N Vasudevan along with the management team.",
            "Sentiment": "neutral",
            "PublishDate": 1753778913992,
            "Source": "corporate_action"
        },
        {
            "Title": "Equitas Small Finance Bank Schedules Board Meeting on August 8, 2025 for Q1FY26 Results",
            "Summary": "Equitas Small Finance Bank Limited has scheduled a Board of Directors meeting on August 8, 2025 to consider and approve unaudited financial results for the quarter ended June 30, 2025. The bank will also conduct an earnings call with investors and analysts on the same day at 4:30 PM to discuss the financial performance for Q1FY26. The trading window for designated persons and their immediate relatives remains closed from July 1, 2025 and will reopen on August 11, 2025. P N Vasudevan, Managing Director & CEO, along with the management team will participate in the earnings call.",
            "Sentiment": "neutral",
            "PublishDate": 1753778092303,
            "Source": "earnings"
        },
        {
            "Title": "Equitas Small Finance Bank Launches FCNR Deposits and Explorer Accounts",
            "Summary": "Equitas Small Finance Bank has introduced two new banking products: Foreign Currency Non-Resident (FCNR) deposits and Explorer accounts. The bank has expanded its service offerings with these new financial products.",
            "Sentiment": "positive",
            "PublishDate": 1753161327924,
            "Source": "stock"
        },
        {
            "Title": "Equitas Small Finance Bank Approves Rs 500 Crore Non-Convertible Debenture Issuance",
            "Summary": "Equitas Small Finance Bank's Board of Directors approved the issuance of up to 50,000 non-convertible debentures worth Rs 500 crores, with an additional green shoe option of Rs 250 crores. The debentures will be rated, listed, unsecured, redeemable, and subordinated, with each having a face value of Rs 1 lakh. The issuance will be conducted on a private placement basis and categorized as Lower Tier II Capital under Basel II framework for capital adequacy. The debentures are proposed to be listed on BSE Limited. The Board meeting was held on July 21, 2025, and the specific tenure, coupon rates, and payment schedules will be determined by the Board of Directors at a later date.",
            "Sentiment": "positive",
            "PublishDate": 1753101790667,
            "Source": "corporate_action"
        },
        {
            "Title": "Equitas Small Finance Bank Reports Growth in Advances and Deposits",
            "Summary": "Equitas Small Finance Bank has reported a year-on-year increase in both gross advances and total deposits as of June 30. Gross advances grew by 9.07% compared to the same period last year, while provisional total deposits saw an 18.27% year-on-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1751846900000,
            "Source": "default"
        },
        {
            "Title": "Equitas Small Finance Bank: Q1 Advances Up 9%, Asset Quality Weakens",
            "Summary": "Equitas Small Finance Bank reported 9.07% YoY growth in gross advances to ₹38,034 crore for Q1FY26. Total deposits increased 18.27% YoY to ₹44,379 crore. CASA ratio remained stable at 29%. Asset quality deteriorated with annualized net slippage rising to 4.35% from 3.16% in Q4FY25. Microfinance slippages spiked to 19.75%.",
            "Sentiment": "neutral",
            "PublishDate": 1751649435000,
            "Source": "earnings"
        },
        {
            "Title": "Equitas Small Finance Bank Reports Growth in Advances and Deposits",
            "Summary": "Equitas Small Finance Bank has reported a 9.07% year-over-year increase in gross advances as of June 30. Additionally, the bank's provisional total deposits rose by 18.27% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1751634646000,
            "Source": "default"
        },
        {
            "Title": "Equitas Small Finance Bank: Board Approves ₹1,250 Crore QIP Fund Raise",
            "Summary": "Equitas Small Finance Bank's board has approved a fund raise of up to ₹1,250 crore through a qualified institutional placement (QIP), subject to shareholder and regulatory approvals. The bank's Q4 net profit declined to ₹42.1 crore, while net interest income increased by 5% to ₹829.5 crore. GNPA ratio improved to 2.89%, and capital adequacy ratio stood at 23.1%.",
            "Sentiment": "neutral",
            "PublishDate": 1748597714000,
            "Source": "corporate_action"
        },
        {
            "Title": "Equitas Small Finance Bank Approves Fundraising of Up to ₹1250 Crore via NCDs",
            "Summary": "Equitas Small Finance Bank has approved a fundraising initiative of up to ₹1250 crore through the issuance of Non-Convertible Debentures (NCDs). This decision represents a significant financial move for the bank, potentially aimed at strengthening its capital base or funding expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1748594565000,
            "Source": "default"
        },
        {
            "Title": "Equitas Small Finance Bank: Q4 Profit Plunges 80% Amid Rising Expenses",
            "Summary": "Equitas Small Finance Bank's Q4 FY25 net profit dropped to ₹42.1 crore from ₹207.6 crore YoY due to higher provisioning and operating expenses. NII increased 5.5% YoY to ₹829.5 crore. GNPA ratio improved to 2.89%, while NNPA ratio slightly rose to 0.98%. CAR stood strong at 23.1%, and LCR at 120%. Shares traded 3% lower at ₹66.91.",
            "Sentiment": "negative",
            "PublishDate": 1746006623000,
            "Source": "earnings"
        },
        {
            "Title": "Equitas Small Finance Bank Q4 Asset Quality Update",
            "Summary": "Equitas Small Finance Bank reported its Q4 asset quality metrics. The Gross Non-Performing Assets (GNPA) ratio improved to 2.89% from 2.97% in the previous quarter. However, the Net Non-Performing Assets (NNPA) ratio slightly increased to 0.98% from 0.96% quarter-on-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746003543000,
            "Source": "result"
        },
        {
            "Title": "Equitas Small Finance Bank Reports Q4 Net Profit Decline",
            "Summary": "Equitas Small Finance Bank announced its Q4 financial results, reporting a net profit of 421 million rupees, which is significantly lower than the 2.1 billion rupees reported in the same quarter last year. The reported profit also fell short of the estimated 657 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1746003361000,
            "Source": "result"
        },
        {
            "Title": "Equitas Small Finance Bank: Appoints New Executive Director for Technology and Operations",
            "Summary": "Equitas Small Finance Bank has appointed Balaji Nuthalapadi as Executive Director – Technology and Operations, effective immediately. The appointment, approved by the RBI and the bank's Board, aims to enhance digital transformation and technology-led customer solutions. Nuthalapadi previously served as Managing Director and Head of Centralised Controls Testing Execution at CitiBank.",
            "Sentiment": "positive",
            "PublishDate": 1743780006000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Equitas Small Finance Bank Reports Strong Growth in Deposits and Advances",
            "Summary": "Equitas Small Finance Bank has reported significant growth in its financial metrics as of March 31, 2025. The bank's total deposits have increased by 19.31% year-over-year, while total gross advances have grown by 10.63% compared to the previous year. These figures indicate robust performance and expansion in the bank's core business areas.",
            "Sentiment": "positive",
            "PublishDate": 1743758476000,
            "Source": "result"
        },
        {
            "Title": "Equitas Small Finance Bank: MFI Stress Impacts FY25 Guidance",
            "Summary": "Equitas Small Finance Bank's fiscal year 2025 guidance is affected by stress in the microfinance institution (MFI) sector.",
            "Sentiment": "negative",
            "PublishDate": 1738573928000,
            "Source": "earnings"
        },
        {
            "Title": "Equitas Small Finance Bank: Q3 Profit Plunges 70% on Higher Provisions",
            "Summary": "Equitas Small Finance Bank reported a 67.2% YoY drop in Q3FY24 net profit to ₹66.3 crore due to higher provisions. NII grew 23.8% YoY to ₹7,433.1 crore. Provisions increased to ₹243 crore from ₹84.4 crore in Q3FY23. Gross NPA slightly rose to 2.97%, while net NPA improved marginally to 0.96%.",
            "Sentiment": "negative",
            "PublishDate": 1738312286000,
            "Source": "earnings"
        },
        {
            "Title": "Equitas Small Finance Bank Reports Decrease in Q3 Provisions",
            "Summary": "Equitas Small Finance Bank has reported a reduction in its provisions for the third quarter. The bank's provisions decreased to 2.4 billion rupees, down from 3.3 billion rupees in the previous quarter. This represents a quarter-on-quarter improvement in the bank's financial position.",
            "Sentiment": "positive",
            "PublishDate": 1738310980000,
            "Source": "earnings"
        },
        {
            "Title": "Equitas Small Finance Bank Reports Q3 Interest Earned Growth",
            "Summary": "Equitas Small Finance Bank has reported its third quarter interest earned at 16.1 billion rupees, compared to 14.2 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738310924000,
            "Source": "earnings"
        },
        {
            "Title": "Equitas Small Finance Bank Reports Q3 Asset Quality Metrics",
            "Summary": "Equitas Small Finance Bank has released its Q3 asset quality metrics. The Gross Non-Performing Assets (GNPA) ratio slightly increased to 2.97% from 2.95% in the previous quarter. Meanwhile, the Net Non-Performing Assets (NNPA) ratio marginally improved to 0.96% from 0.97% quarter-on-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738310899000,
            "Source": "result"
        }
    ]
}