{
    "Symbol": "ERIS",
    "ISIN": "INE406M01024",
    "News": [
        {
            "Title": "Eris Lifesciences Board Meet Set for Feb 13, 2026",
            "Summary": "Eris Lifesciences has scheduled its board meeting for February 13, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window remains closed until 48 hours post-declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1770376859267,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eris Lifesciences Postal Ballot Results Declared",
            "Summary": "Eris Lifesciences announces successful completion of postal ballot voting on December 24, 2025, with all four resolutions passed by shareholders with requisite majority through remote e-voting process.",
            "Sentiment": "positive",
            "PublishDate": 1766755311336,
            "Source": "stocks"
        },
        {
            "Title": "Eris Lifesciences Independent Director Tenure Ends",
            "Summary": "Rajeev Dalal's five-year term as Non-Executive Independent Director of Eris Lifesciences concludes on December 18, 2025, following completion of his tenure that began in December 2020.",
            "Sentiment": "neutral",
            "PublishDate": 1766053977478,
            "Source": "stocks"
        },
        {
            "Title": "Eris Lifesciences Schedules Investor Meet Dec 18",
            "Summary": "Eris Lifesciences announces virtual investor meeting on December 18, 2025, organized by Motilal Oswal with participation from major institutional investors including Axis Mutual Fund and ICICI Prudential Asset Management.",
            "Sentiment": "neutral",
            "PublishDate": 1765796184809,
            "Source": "stocks"
        },
        {
            "Title": "Eris Lifesciences Issues Corrigendum to Postal Ballot Notice for Share Swap Transaction",
            "Summary": "Eris Lifesciences issued a corrigendum to its November 24, 2025 postal ballot notice regarding the issuance of up to 23,06,372 equity shares on preferential basis, adding disclosures about wilful defaulter status and revised valuation report dated December 5, 2025. The corrigendum allows shareholders who already voted in the ongoing e-voting process (ending December 24, 2025) to modify their votes by emailing the scrutinizer, though the fair valuation and swap ratio remain unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1764940182305,
            "Source": "corporate_action"
        },
        {
            "Title": "Eris Lifesciences Reports Strong Growth with 36% EBITDA Margin in H1FY26",
            "Summary": "Eris Lifesciences achieved revenue of Rs. 2,894 crores in FY25 with EBITDA margin expanding from 32% in FY23 to 36% in H1FY26, driven by strategic acquisitions including Biocon's insulin business and Swiss Parenterals. The company strengthened its position as a top-5 player in anti-diabetes therapy with 6% market share and 15% share in insulins, while securing its first EU-CDMO contract with revenue visibility of Rs. 150-200 crores in FY27.",
            "Sentiment": "positive",
            "PublishDate": 1764758035519,
            "Source": "stock"
        },
        {
            "Title": "Eris Lifesciences Acquires 30% Stake in Swiss Parenterals for ₹4.23 Billion",
            "Summary": "Eris Lifesciences purchased a 30% stake in its subsidiary Swiss Parenterals Ltd for ₹4.23 billion. The acquisition strengthens the pharmaceutical company's ownership position in the unit through this significant investment.",
            "Sentiment": "positive",
            "PublishDate": 1764028971425,
            "Source": "corporate_action"
        },
        {
            "Title": "Eris Lifesciences Board to Consider Preferential Share Issue for Swiss Parenterals Acquisition",
            "Summary": "Eris Lifesciences has scheduled a board meeting for November 24, 2025, to consider issuing equity shares through preferential allotment for acquiring the remaining 30% stake in Swiss Parenterals Limited. The company will also consider convening an extraordinary general meeting to seek shareholder approval for the proposed preferential issue.",
            "Sentiment": "positive",
            "PublishDate": 1763543890416,
            "Source": "corporate_action"
        },
        {
            "Title": "Eris Lifesciences Allots 3,337 Equity Shares Under ESOP Scheme",
            "Summary": "Eris Lifesciences allotted 3,337 equity shares on November 17, 2025, under its ESOP-2021 scheme with 983 shares from 2023 grants at Rs. 510.32 per share and 2,354 shares from 2024 grants at Rs. 728.16 per share. The company's paid-up share capital increased from Rs. 13,62,13,554 to Rs. 13,62,16,891, reflecting the addition of new equity shares for employee stock option exercises.",
            "Sentiment": "neutral",
            "PublishDate": 1763385643523,
            "Source": "corporate_action"
        },
        {
            "Title": "Eris Lifesciences Reports Q2 FY26 Results with Board Approvals for Director Reappointments",
            "Summary": "Eris Lifesciences Limited announced its unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025. The Board of Directors approved the financial results in their meeting held on November 12, 2025. Additionally, the Board recommended the re-appointment of Mr. Krishnakumar Vaidyanathan as Whole Time Director for a 5-year term from September 1, 2026 to August 31, 2031, and Ms. Kalpana Unadkat as Independent Director for 5 years from January 5, 2026 to January 4, 2031. The company operates primarily in the pharmaceuticals business segment and issued 50,985 ordinary shares under its Employee Stock Option Scheme 2021 during the half-year period, increasing the paid-up share capital to Rs 13.62 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1762937994845,
            "Source": "earnings"
        },
        {
            "Title": "Eris Lifesciences Reports Growth in Q2 Revenue, Profit and EBITDA",
            "Summary": "Eris Lifesciences reported Q2 revenue of 7.9 billion rupees compared to 7.4 billion rupees year-over-year. The company's consolidated net profit increased to 1.2 billion rupees from 910 million rupees year-over-year. EBITDA rose to 2.9 billion rupees from 2.64 billion rupees year-over-year, with EBITDA margin improving to 36.37% from 35.7% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762935687401,
            "Source": "earnings"
        },
        {
            "Title": "Eris Lifesciences Schedules Analyst and Investor Call for November 12, 2025",
            "Summary": "Eris Lifesciences Limited has announced a conference call for analysts and investors scheduled for Wednesday, November 12, 2025, at 4:30 PM IST. The call follows the company's Board of Directors meeting to consider and approve standalone and consolidated unaudited financial results for the quarter and half year ended September 30, 2025. The conference call will be conducted via Zoom, with pre-registration required through a provided link. Contact persons for the event are Kruti Raval and Atul Modi.",
            "Sentiment": "neutral",
            "PublishDate": 1762463817405,
            "Source": "earnings"
        },
        {
            "Title": "Indian Patent Office Cancels Novartis' Vymada Patent, Opens Market for Generic Versions",
            "Summary": "The Indian Patent Office has cancelled Novartis' patent for Vymada (Entresto), a cardiac drug. This decision allows generic drug manufacturers to enter the market and produce their own versions of the medication.",
            "Sentiment": "neutral",
            "PublishDate": 1758002268312,
            "Source": "stock"
        },
        {
            "Title": "Eris Lifesciences Sees Block Trade Worth Rs. 85.49 Crores on NSE",
            "Summary": "Eris Lifesciences executed a block trade on the National Stock Exchange involving approximately 511,903 shares at Rs. 1,670 per share, totaling Rs. 85.49 crores. The transaction represents a significant institutional trade in the pharmaceutical company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1757669319030,
            "Source": "order&deals"
        },
        {
            "Title": "Eris Lifesciences Receives ANVISA Approval for Ahmedabad Facility",
            "Summary": "Eris Lifesciences has received approval from ANVISA for its Ahmedabad facility following a successful inspection in May 2025. This approval enables the company to enter Brazil's pharmaceutical market, which is South America's largest pharmaceutical market.",
            "Sentiment": "positive",
            "PublishDate": 1756102811399,
            "Source": "stock"
        },
        {
            "Title": "Eris Lifesciences Receives Notice for Unpaid IGST",
            "Summary": "Eris Lifesciences has received a notice regarding non-payment of Integrated Goods and Services Tax (IGST). The pharmaceutical company is facing tax compliance issues related to outstanding IGST obligations.",
            "Sentiment": "negative",
            "PublishDate": 1755863288746,
            "Source": "stock"
        },
        {
            "Title": "R R S & Associates Resigns as Statutory Auditor of Eris Lifesciences' Material Subsidiary",
            "Summary": "R R S & Associates has resigned as statutory auditor of Eris Therapeutics Limited, a wholly owned material subsidiary of Eris Lifesciences Limited, effective August 12, 2025. The auditing firm was originally appointed for a five-year term from April 1, 2022 to March 31, 2027. The resignation comes to facilitate the appointment of a single auditor for both the holding company and its material subsidiary, aiming to bring synergies, align terms, and maintain consistency in the audit process. R R S & Associates completed the statutory audit for the year ended March 31, 2025, and conducted a limited review for the quarter ended June 30, 2025. The firm confirmed no material concerns or issues led to the resignation beyond the stated reason of audit consolidation at the group level.",
            "Sentiment": "neutral",
            "PublishDate": 1755092809691,
            "Source": "corporate_governance"
        },
        {
            "Title": "Eris Lifesciences Makes Q1 FY26 Earnings Call Transcript Available",
            "Summary": "Eris Lifesciences Limited has published the transcript of its analyst and investor call discussing financial results for the quarter ended June 30, 2025. The pharmaceutical company, listed on BSE and NSE, conducted the earnings call following its Q1 FY26 results announcement. The complete transcript is accessible on the company's website at https://eris.co.in/financials/. The document represents a regulatory filing informing stock exchanges about the transcript's availability, though specific financial figures and performance details are not included in this announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1754912959680,
            "Source": "earnings"
        },
        {
            "Title": "Eris Lifesciences Makes Earnings Call Recording Available on Company Website",
            "Summary": "Eris Lifesciences Limited announced that the recording of its earnings conference call discussing unaudited financial results for the quarter ended June 30, 2025 is now available on the company's website. The earnings call was held on August 5, 2025, and the recording can be accessed at https://eris.co.in/financials/ under the filename 'Q1 FY26-Earnings Call Recording'. The company notified both the National Stock Exchange of India Limited and BSE Limited about the availability of this recording.",
            "Sentiment": "neutral",
            "PublishDate": 1754403976405,
            "Source": "earnings"
        },
        {
            "Title": "Eris Lifesciences Reports Strong Q1 Growth with Revenue Rising to 7.7B Rupees",
            "Summary": "Eris Lifesciences delivered strong quarterly performance with revenue increasing to 7.7 billion rupees from 7.2 billion rupees year-over-year. The pharmaceutical company's EBITDA grew to 2.76 billion rupees compared to 2.5 billion rupees in the same period last year, while EBITDA margin improved to 35.80% from 34.73%. Consolidated net profit showed significant growth, reaching 1.2 billion rupees versus 832 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754380115595,
            "Source": "earnings"
        },
        {
            "Title": "Eris Lifesciences Schedules Board Meeting on August 5, 2025 to Approve Q1 FY2026 Results",
            "Summary": "Eris Lifesciences Limited has scheduled a Board of Directors meeting on August 5, 2025, to consider and approve the standalone and consolidated unaudited financial results for the quarter ended June 30, 2025. The company's trading window has been closed since July 1, 2025, and will remain closed until 48 hours after the financial results declaration. The notice was signed by Company Secretary & Compliance Officer Milind Talegaonkar.",
            "Sentiment": "neutral",
            "PublishDate": 1753878057002,
            "Source": "corporate_action"
        },
        {
            "Title": "Eris Lifesciences Provides FY26 Financial Guidance",
            "Summary": "Eris Lifesciences has released its financial guidance for FY26 in an investor presentation. The company projects revenue to be between ₹2,900-3,050 crore. EBITDA is expected to range from ₹1,070-1,130 crore, with an EBITDA margin of 37%.",
            "Sentiment": "positive",
            "PublishDate": 1747658511000,
            "Source": "default"
        },
        {
            "Title": "Eris Lifesciences Reports Strong Q4 Financial Results",
            "Summary": "Eris Lifesciences has announced its Q4 financial results, showing significant year-over-year growth. The company's EBITDA increased to 2.52 billion rupees from 1.5 billion rupees in the previous year. The EBITDA margin improved to 35.78% from 26.94%. Revenue rose to 7.05 billion rupees from 5.51 billion rupees. Consolidated net profit for Q4 reached 938.4 million rupees, up from 710 million rupees year-over-year and 837.6 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747655507000,
            "Source": "result"
        },
        {
            "Title": "Eris Lifesciences: Q4 Profit Surges 31%, EBITDA Margin Expands to 36%",
            "Summary": "Eris Lifesciences reported Q4 FY25 net profit of ₹93.8 crore, up 31.1% YoY. Revenue rose 27.9% to ₹705 crore. EBITDA margin expanded to 36%. FY25 revenue grew 44% to ₹2,894 crore. Company guides FY26 DBF revenue of ₹2,900–3,050 crore and consolidated revenue of ₹3,325–3,500 crore. Aims to reduce net debt to ₹1,800 crore by FY26.",
            "Sentiment": "positive",
            "PublishDate": 1747655493000,
            "Source": "earnings"
        },
        {
            "Title": "Eris Lifesciences Transfers Holdings in Two Units to Eris Therapeutics",
            "Summary": "Eris Lifesciences has transferred its 100% holdings in two subsidiaries, Eris Oaknet Healthcare and Aprica Healthcare, to Eris Therapeutics for a total consideration of Rs. 862 crore. This internal restructuring involves the transfer of ownership within the Eris group of companies.",
            "Sentiment": "neutral",
            "PublishDate": 1741306800000,
            "Source": "corporate_action"
        },
        {
            "Title": "Eris Lifesciences: Sells Subsidiaries for Rs 861.9 Crore Amid Profit Decline",
            "Summary": "Eris Lifesciences is selling its entire stake in Eris Oaknet Healthcare and Aprica Healthcare to Eris Therapeutics for Rs 861.9 crore, expected to complete by March 31. The company reported an 18.61% YoY fall in Q3 FY2025 net profit to Rs 83.63 crore, despite a 49.61% increase in revenue to Rs 727.45 crore. Finance costs rose significantly by 215% to Rs 57.17 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1741276957000,
            "Source": "corporate_action"
        },
        {
            "Title": "Eris Lifesciences Reports Significant Revenue Growth in Q3",
            "Summary": "Eris Lifesciences, a pharmaceutical company, has announced its financial results for the third quarter. The company reported revenue of 7.27 billion rupees, marking a substantial increase from 4.86 billion rupees in the same period last year. This represents a year-over-year growth in revenue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1738653154000,
            "Source": "earnings"
        },
        {
            "Title": "Eris Lifesciences Reports Q3 EBITDA Growth",
            "Summary": "Eris Lifesciences announced its Q3 financial results, reporting an EBITDA of 2.5 billion rupees, up from 1.76 billion rupees in the same quarter last year. However, the EBITDA margin decreased to 34.39% from 36.10% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738653117000,
            "Source": "earnings"
        },
        {
            "Title": "Eris Lifesciences Reports Decline in Q3 Net Profit",
            "Summary": "Eris Lifesciences, a pharmaceutical company, has reported a consolidated net profit of 837 million rupees for the third quarter, down from 1.02 billion rupees in the same period last year. This represents a year-over-year decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1738653031000,
            "Source": "earnings"
        },
        {
            "Title": "Eris Lifesciences: Q2 Performance Under Scrutiny",
            "Summary": "Motilal Oswal maintains a neutral stance on Eris Lifesciences following their Q2 results. The company is making efforts to scale up its recently acquired business.",
            "Sentiment": "neutral",
            "PublishDate": 1730101527000,
            "Source": "result"
        },
        {
            "Title": "Eris Lifesciences On Track to Meet FY25 Financial Targets",
            "Summary": "Eris Lifesciences has announced that it is on track to achieve its fiscal year 2025 financial guidance. The company expects to reach a Domestic Business Formulation (DBF) revenue of ₹2600 crore and maintain a DBF EBITDA margin of 36%.",
            "Sentiment": "positive",
            "PublishDate": 1729843410000,
            "Source": "normal_news"
        },
        {
            "Title": "Eris Lifesciences to Begin Production of RHI Vials at Bhopal Plant",
            "Summary": "Eris Lifesciences announces the commencement of production for Recombinant Human Insulin (RHI) vials at their Bhopal plant, scheduled to begin in November 2024. The company expects to see gross margin benefits from this production starting in Q4 of FY25 or Q1 of FY26.",
            "Sentiment": "positive",
            "PublishDate": 1729843236000,
            "Source": "corporate_action"
        },
        {
            "Title": "Eris Lifesciences Secures 540 Million Rupee Primary Equity Investment",
            "Summary": "Eris Lifesciences, a pharmaceutical company, has announced a deal for a primary equity investment of 540 million rupees (approximately $6.5 million USD). This investment is likely to strengthen the company's financial position and potentially fund growth initiatives or research and development efforts.",
            "Sentiment": "positive",
            "PublishDate": 1729842671000,
            "Source": "corporate_action"
        },
        {
            "Title": "Eris Lifesciences Reports Q2 Financial Results",
            "Summary": "Eris Lifesciences announced its Q2 financial results. The company's EBITDA increased to 2.64 billion rupees from 1.8 billion rupees year-over-year. However, the EBITDA margin slightly decreased to 35.7% from 35.85% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1729842477000,
            "Source": "result"
        },
        {
            "Title": "Eris Lifesciences Reports Strong Q2 Revenue Growth",
            "Summary": "Eris Lifesciences, an Indian pharmaceutical company, has announced its second-quarter revenue for the current fiscal year. The company reported revenue of 7.4 billion rupees, showing a significant increase from 5 billion rupees in the same quarter of the previous year. This represents a year-over-year growth of 48%.",
            "Sentiment": "positive",
            "PublishDate": 1729842427000,
            "Source": "result"
        },
        {
            "Title": "Eris Lifesciences Reports Decline in Q2 Net Profit",
            "Summary": "Eris Lifesciences, a pharmaceutical company, has reported a consolidated net profit of 910 million rupees for the second quarter, down from 1.23 billion rupees in the same period last year. This represents a year-over-year decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1729842401000,
            "Source": "result"
        },
        {
            "Title": "Eris Lifesciences Ltd: Major Block Trade on NSE",
            "Summary": "<p>A <span class='neutral'>significant block trade</span> occurred for <b>Eris Lifesciences Ltd</b> on the <b>National Stock Exchange (NSE)</b>. Approximately <span class='neutral'>2,004,438 shares</span> were traded at a price of <span class='neutral'>Rs. 1350.80</span> per share, totaling <span class='neutral'>Rs. 270.76 crores</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1727947136000,
            "Source": "block_deals"
        }
    ]
}