{
    "Symbol": "ESABINDIA",
    "ISIN": "INE284A01012",
    "News": [
        {
            "Title": "ESAB India Q3FY26 Results & Second Interim Dividend",
            "Summary": "ESAB India reports Q3FY26 revenue of Rs 37,990 lakhs with net profit of Rs 4,300 lakhs. Company declares second interim dividend of Rs 25 per share for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1770740376889,
            "Source": "co_actions_results"
        },
        {
            "Title": "ESAB India Increases Stake in Solar Power Company",
            "Summary": "ESAB India Limited announces additional equity investment of Rs. 1.95 crore in Sunsure Solar Park Twenty-Four Private Limited, increasing shareholding from 9.78% to 17.38%.",
            "Sentiment": "positive",
            "PublishDate": 1769611096365,
            "Source": "co_actions_results"
        },
        {
            "Title": "ESAB India Faces ₹1.45 Cr Tax Penalty Orders",
            "Summary": "ESAB India Limited receives income tax penalty orders totaling ₹1.45 crores for assessment years 2017-18 and 2018-19 under Section 270A, with the company planning to file appeals.",
            "Sentiment": "negative",
            "PublishDate": 1767096885409,
            "Source": "stocks"
        },
        {
            "Title": "ESAB India Board Meet on Feb 10 for Q3FY26 Results",
            "Summary": "ESAB India Limited has scheduled its Board meeting for February 10, 2026, to consider Q3FY26 unaudited financial results and may recommend second interim dividend for FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1767010439553,
            "Source": "co_actions_results"
        },
        {
            "Title": "ESAB India Reports Strong Q2 Results with 83% Jump in Net Profit, Declares Rs 25 Interim Dividend",
            "Summary": "ESAB India delivered robust quarterly performance with net profit surging to Rs 792 million from Rs 431.6 million year-over-year. Revenue grew to Rs 3.82 billion compared to Rs 3.39 billion in the same period last year. The company's EBITDA increased to Rs 722.2 million from Rs 614.7 million, while EBITDA margin improved to 18.93% from 18.15%. The results included an exceptional gain of Rs 309 million. The board recommended an interim dividend of Rs 25 per share for shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1762792409835,
            "Source": "corporate_action"
        },
        {
            "Title": "ESAB India Reports Mixed Q1 Results with Revenue Growth but Profit Decline",
            "Summary": "ESAB India reported quarterly revenue of 3.5 billion rupees, up from 3.3 billion rupees in the same period last year. However, net profit declined to 409 million rupees from 445 million rupees year-over-year. EBITDA decreased to 592 million rupees from 621 million rupees, while EBITDA margin compressed to 16.80% from 18.83% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754923030879,
            "Source": "earnings"
        },
        {
            "Title": "ESAB India Reports 10.5% Revenue Growth to ₹1,381 Crores with Strong Profitability in FY25",
            "Summary": "ESAB India Limited posted revenue growth of 10.5% to ₹1,381.25 crores in FY25 compared to ₹1,249.81 crores in FY24. Net profit increased to ₹175.42 crores from ₹162.98 crores in the previous year. The company declared interim dividends totaling ₹48 per share and proposed a final dividend of ₹42 per share. Total dividend payout for FY25 amounts to ₹90 per share compared to ₹76 per share in FY24. The company maintained strong cash flows with cash and cash equivalents at ₹65.11 crores. ESAB operates in fabrication technology, manufacturing welding and cutting products while also providing engineering services. The board appointed new independent directors N Ramesh Rajan and Raja Venkataraman replacing K Vaidyanathan and Vikram Tandon whose terms ended in January 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753158787277,
            "Source": "corporate_governance"
        },
        {
            "Title": "ESAB to Review Q1 Results on August 11",
            "Summary": "ESAB has announced that it will review its Q1 results on August 11. No further details about the financial performance or expectations were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1751027376000,
            "Source": "default"
        },
        {
            "Title": "ESAB India Reports Q4 Results and Recommends Final Dividend",
            "Summary": "ESAB India has announced its Q4 financial results and dividend recommendation. The company's Q4 revenue increased to 3.68 billion rupees from 3.4 billion rupees year-over-year. Q4 EBITDA rose to 657.5 million rupees from 639 million rupees, though the EBITDA margin decreased to 17.88% from 18.75%. Net profit for Q4 grew to 474.3 million rupees, up from 443 million rupees year-over-year and 403.8 million rupees quarter-over-quarter. The company has recommended a final dividend of 42 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748365988000,
            "Source": "result"
        },
        {
            "Title": "SEBI Issues Caution Letter to ESAB India for Incomplete Disclosures",
            "Summary": "The Securities and Exchange Board of India (SEBI) has sent a caution letter to ESAB India. SEBI observed that ESAB did not provide all the required disclosures, indicating a potential lapse in compliance with regulatory requirements.",
            "Sentiment": "negative",
            "PublishDate": 1741358325000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Esab India Reports Q3 Financial Results",
            "Summary": "Esab India has announced its financial results for the third quarter. The company's net profit increased to 403.8 million rupees, up from 380 million rupees year-over-year. Revenue also saw growth, reaching 3.37 billion rupees compared to 3 billion rupees in the same quarter last year. Sequentially, net profit improved from 431.6 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739233231000,
            "Source": "earnings"
        },
        {
            "Title": "ESAB India Reports Q3 EBITDA and Margin",
            "Summary": "ESAB India has reported its Q3 financial results. The company's EBITDA for the quarter was 552.5 million rupees, compared to 537 million rupees in the same quarter last year, showing a slight increase. However, the EBITDA margin decreased to 16.37% from 17.81% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739206518000,
            "Source": "earnings"
        },
        {
            "Title": "ESAB India Reports Q3 Revenue Increase",
            "Summary": "ESAB India has announced its third quarter revenue, which stands at 3.37 billion rupees. This represents an increase from the previous year's figure of 3 billion rupees for the same quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739206511000,
            "Source": "earnings"
        },
        {
            "Title": "ESAB India Reports Q3 Net Profit Increase",
            "Summary": "ESAB India has reported a net profit of 403.8 million rupees for the third quarter, showing an increase from 380 million rupees year-over-year. The company also saw a decrease from the previous quarter's net profit of 431.6 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1739206504000,
            "Source": "earnings"
        },
        {
            "Title": "ESAB India to Consider Q3 Results on February 10",
            "Summary": "ESAB India has announced that it will consider its third quarter (Q3) financial results on February 10. This announcement indicates the company's scheduled date for reviewing and potentially approving its quarterly financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1737464723000,
            "Source": "result"
        },
        {
            "Title": "ESAB India Reports Q2 EBITDA Growth",
            "Summary": "ESAB India has announced its Q2 financial results. The company's EBITDA increased to 614.7 million rupees from 539.5 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 18.15% from 17.82% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731084636000,
            "Source": "result"
        },
        {
            "Title": "ESAB India Reports Q2 Revenue Growth",
            "Summary": "ESAB India has reported a revenue of 3.39 billion rupees for the second quarter, compared to 3 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731084628000,
            "Source": "result"
        },
        {
            "Title": "ESAB India Reports Q2 Net Profit Increase",
            "Summary": "ESAB India has reported a net profit of 431.6 million rupees for the second quarter, showing an increase from 384 million rupees year-over-year and 444.5 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731084620000,
            "Source": "result"
        },
        {
            "Title": "ESAB India Declares Dividend of 25 Rupees per Share",
            "Summary": "ESAB India has announced a dividend of 25 rupees per share for its shareholders. This corporate action represents a significant return of value to the company's investors.",
            "Sentiment": "positive",
            "PublishDate": 1731082474000,
            "Source": "corporate_action"
        }
    ]
}