{
    "Symbol": "ESAFSFB",
    "ISIN": "INE818W01011",
    "News": [
        {
            "Title": "ESAF Small Finance Bank Returns to Profitability in Q3 FY26",
            "Summary": "ESAF Small Finance Bank reported a turnaround with PAT of INR 7 crores in Q3 FY26, while gross NPA declined to 5.60% and net NPA to 2.70%. The bank's secured portfolio reached 63% of total advances.",
            "Sentiment": "positive",
            "PublishDate": 1770479098261,
            "Source": "co_actions_results"
        },
        {
            "Title": "ESAF Small Finance Bank Returns to Profit in Q3",
            "Summary": "ESAF Small Finance Bank reported a net profit of 71 million rupees in Q3, marking a significant turnaround from the 2.1 billion rupees loss in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1769779490831,
            "Source": "co_actions_results"
        },
        {
            "Title": "ESAF Small Finance Bank Board Meet on Jan 30",
            "Summary": "ESAF Small Finance Bank has scheduled its board meeting for January 30, 2026, to consider and approve Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769169168586,
            "Source": "co_actions_results"
        },
        {
            "Title": "ESAF Small Finance Bank Allots ₹150 Cr NCDs",
            "Summary": "ESAF Small Finance Bank Limited successfully allotted 15,000 non-convertible debentures worth ₹150 crores on January 23, 2026, through private placement with 11.65% interest rate and 73-month tenure.",
            "Sentiment": "positive",
            "PublishDate": 1769161766262,
            "Source": "co_actions_results"
        },
        {
            "Title": "ESAF Small Finance Bank Allots 31,391 ESOP Shares",
            "Summary": "ESAF Small Finance Bank allotted 31,391 equity shares to employees under its ESOP scheme on January 7, 2026, at an exercise price of ₹15.51 per share, increasing total share capital to ₹515.60 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1767760643485,
            "Source": "co_actions_results"
        },
        {
            "Title": "ESAF Small Finance Bank Pays ₹8.12 Cr Interest",
            "Summary": "ESAF Small Finance Bank successfully completed monthly interest payment of ₹8.12 crores on non-convertible securities to all investors, with payment made on January 05, 2026 due to holiday adjustment.",
            "Sentiment": "neutral",
            "PublishDate": 1767616998405,
            "Source": "co_actions_results"
        },
        {
            "Title": "ESAF Small Finance Bank Q3: Deposits up 7%, advances 13%",
            "Summary": "ESAF Small Finance Bank reported 7.10% YoY growth in deposits to ₹24,006 crore and 13.06% advance growth to ₹20,680 crore for Q3 FY26. Bank completed ₹1,694 crore NPA sales during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1767609252766,
            "Source": "co_actions_results"
        },
        {
            "Title": "ESAF Small Finance Bank Q3FY26 Results",
            "Summary": "ESAF Small Finance Bank reports Q3FY26 results with deposits of ₹24,006 crore (7.10% YoY growth) and advances of ₹20,680 crore (13.06% YoY growth). CASA ratio improves to 25.12%.",
            "Sentiment": "positive",
            "PublishDate": 1767606958557,
            "Source": "co_actions_results"
        },
        {
            "Title": "ESAF Small Finance Bank Reconstitutes Board Committees",
            "Summary": "ESAF Small Finance Bank announced reconstitution of five board sub-committees effective January 3, 2026, with newly appointed Chairman Karthikeyan Manickam joining key committees including NRCCB, RMCB, and SRCB.",
            "Sentiment": "neutral",
            "PublishDate": 1767364623282,
            "Source": "stocks"
        },
        {
            "Title": "ESAF Bank sells ₹1,694-cr NPA portfolio to ARCs",
            "Summary": "ESAF Small Finance Bank completed sale of non-performing assets worth ₹1,693.65 crore to asset reconstruction companies for ₹183.18 crore consideration through Swiss Challenge Method.",
            "Sentiment": "positive",
            "PublishDate": 1767021400173,
            "Source": "co_actions_results"
        },
        {
            "Title": "ESAF Small Finance Bank Sells ₹1,694 Cr Loan Portfolio",
            "Summary": "ESAF Small Finance Bank has completed the sale of a loan portfolio worth ₹1,694.00 crores for ₹183.00 crores, representing a significant portfolio divestment transaction for the small finance bank.",
            "Sentiment": "neutral",
            "PublishDate": 1767018643993,
            "Source": "stocks"
        },
        {
            "Title": "ESAF Small Finance Bank Sells NPAs Worth ₹17 Billion",
            "Summary": "ESAF Small Finance Bank has approved the sale of non-performing assets and written-off loans to an asset reconstruction company for up to ₹17 billion to strengthen its balance sheet.",
            "Sentiment": "positive",
            "PublishDate": 1765757343013,
            "Source": "stocks"
        },
        {
            "Title": "ESAF Small Finance Bank Sells ₹17 Billion NPAs",
            "Summary": "ESAF Small Finance Bank approves sale of ₹17 billion worth of non-performing assets and written-off loans to an asset reconstruction company to strengthen balance sheet.",
            "Sentiment": "positive",
            "PublishDate": 1765540142091,
            "Source": "stocks"
        },
        {
            "Title": "ESAF Small Finance Bank Allots 13,794 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "ESAF Small Finance Bank allotted 13,794 equity shares of face value Rs. 10 each to eligible employees upon exercise of options under ESAF Employee Stock Option Scheme 2019 on December 1, 2025. The allotment was approved by the Nomination, Remuneration and Compensation Committee and the shares will rank pari-passu with existing equity shares of the bank.",
            "Sentiment": "neutral",
            "PublishDate": 1764582730909,
            "Source": "corporate_action"
        },
        {
            "Title": "ESAF Small Finance Bank Reports Q2 FY26 Results with Strategic Shift to Secured Lending",
            "Summary": "ESAF Small Finance Bank conducted its Q2 and H1 FY26 earnings call, reporting total business of INR 42,031 crores with secured assets now comprising 61% of gross advances, up from 39% a year ago. The bank expects to achieve positive quarterly ROA in FY26 as it focuses on portfolio diversification away from microfinance toward gold loans, MSME, and mortgage lending while targeting 20-25% loan book growth.",
            "Sentiment": "neutral",
            "PublishDate": 1763467702274,
            "Source": "earnings"
        },
        {
            "Title": "ESAF Small Finance Bank ESG Rating Upgraded to CareEdge-ESG1",
            "Summary": "CareEdge ESG Ratings upgraded ESAF Small Finance Bank's ESG rating from CareEdge-ESG2 (score 68.1) to CareEdge-ESG1 (score 75.4), citing leadership in workforce diversity, financial inclusion, and governance practices. The upgrade reflects the bank's commitment to sustainability through enhanced CSR fund allocation, robust cybersecurity framework, and comprehensive regulatory compliance, though constraints remain in climate data verification and green loan portfolio coverage.",
            "Sentiment": "positive",
            "PublishDate": 1763185739867,
            "Source": "stock"
        },
        {
            "Title": "ESAF Small Finance Bank Seeks Shareholder Approval for Capital Increase and Director Appointments",
            "Summary": "ESAF Small Finance Bank has issued a postal ballot notice seeking shareholder approval for four key resolutions. The bank proposes to increase its authorized share capital from ₹600 crores to ₹1,000 crores by creating additional 40 crore equity shares of ₹10 each. The bank also seeks approval for the appointment of Karthikeyan Manickam as Non-Executive Independent Director and Part-Time Chairman with effect from December 21, 2025, with annual remuneration of ₹20 lakhs. Additionally, the bank proposes re-appointment of Ms. Kolasseril Chandramohanan Ranjani as Non-Executive Independent Director for another three-year term from December 13, 2025, and appointment of Ajay Sharma as Non-Executive Independent Director from December 21, 2025. The remote e-voting period runs from November 13, 2025 to December 12, 2025. The capital increase is intended to strengthen the bank's capital adequacy position and support future growth objectives through potential capital raising initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1762998040100,
            "Source": "corporate_governance"
        },
        {
            "Title": "ESAF Small Finance Bank Reports Loss of ₹197 Crores in H1 FY26 Despite Growth in Advances and Deposits",
            "Summary": "ESAF Small Finance Bank reported a net loss of ₹197 crores for H1 FY26, compared to a loss of ₹521 crores in FY25. The bank's gross advances grew 4.3% year-on-year to ₹19,137 crores, while deposits increased 5.9% to ₹22,894 crores. The bank has shifted strategically toward secured loans, which now comprise 86% of its portfolio compared to 61% previously. CASA deposits grew 13.7% to ₹6,046 crores with a CASA ratio of 26.4%. Asset quality showed mixed trends with GNPA at 6.9% and NNPA at 3.8%. The bank maintains a strong capital adequacy ratio of 22.4% with Tier I at 16.9%. Net Interest Margin stood at 5.9% while cost-to-income ratio was 77.9%. The bank operates through 788 banking outlets across 24 states and 2 UTs, serving 97.8 lakh customers with a focus on rural and semi-urban markets.",
            "Sentiment": "neutral",
            "PublishDate": 1762914999146,
            "Source": "earnings"
        },
        {
            "Title": "ESAF Small Finance Bank Announces Board Changes with New Director Appointments and Retirement",
            "Summary": "ESAF Small Finance Bank's Board approved three key directorial changes. Shri Ajay Sharma has been appointed as Non-Executive Independent Director for three years from December 21, 2025 to December 20, 2028, subject to member approval through postal ballot. Sharma brings over 35 years of banking experience from IDBI Bank, having served as Chief Financial Officer and Executive Director-Human Resource/Training. Smt. Kolasseril Chandramohanan Ranjani has been re-appointed as Non-Executive Independent Director for three years from December 13, 2025 to December 12, 2028, also subject to postal ballot approval. Ranjani holds an MBM degree and has over 25 years of MSME sector experience, having served on boards of various microfinance institutions. Dr. Joseph Vadakkekara Antony will retire as Non-Executive Director effective November 17, 2025. Both new appointees are not related to any existing directors and are not debarred from holding directorial positions.",
            "Sentiment": "neutral",
            "PublishDate": 1762902301620,
            "Source": "corporate_governance"
        },
        {
            "Title": "ESAF Small Finance Bank Reports Strong Q2FY26 Results with 29% AUM Growth and Plans Branch Expansion",
            "Summary": "ESAF Small Finance Bank reported Assets Under Management of ₹21,800 crores, marking a 29% year-on-year growth in Q2FY26. The bank's Profit After Tax reached ₹305 crores, representing a 32% year-on-year increase. Net Interest Margin stood at 8.3%, while Gross Non-Performing Assets improved to 1.7%. The bank plans to expand its branch network to 800 branches by FY27, focusing on micro and affordable housing loans. The company is strengthening its digital banking capabilities and financial inclusion services in rural markets to maintain high Return on Equity growth.",
            "Sentiment": "positive",
            "PublishDate": 1762877404839,
            "Source": "earnings"
        },
        {
            "Title": "ESAF Small Finance Bank Reports Reduced Q2 Loss Despite Revenue Decline",
            "Summary": "ESAF Small Finance Bank reported a net loss of 1.16 billion rupees in Q2, an improvement from the 1.9 billion rupee loss in the same period last year. However, revenue declined to 8.2 billion rupees from 9.96 billion rupees year-over-year. Provisions decreased to 2.49 billion rupees compared to 3.37 billion rupees in the previous year. Asset quality showed mixed results with gross NPA rising to 8.54% from 7.48% quarter-over-quarter, while net NPA increased slightly to 3.83% from 3.77% quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762864193458,
            "Source": "earnings"
        },
        {
            "Title": "ESAF Small Finance Bank Allots Rs 150 Crore Non-Convertible Debentures",
            "Summary": "ESAF Small Finance Bank Limited has allotted 15,000 non-convertible debentures worth Rs 150 crore on a private placement basis. Each debenture has a face value of Rs 1 lakh and carries an interest rate of 11.30% per annum, payable quarterly. The Basel II compliant lower Tier II subordinated bonds are unsecured, transferable, and redeemable. The debentures have a tenure of 69 months, with allotment on November 10, 2025, and maturity on August 10, 2031. The NCDs are proposed to be listed on the National Stock Exchange's Negotiated Trade Reporting Platform under New Debt Market.",
            "Sentiment": "neutral",
            "PublishDate": 1762778424007,
            "Source": "corporate_action"
        },
        {
            "Title": "ESAF Small Finance Bank Allots 10,554 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "ESAF Small Finance Bank allotted 10,554 equity shares with a face value of Rs. 10 each to eligible employees under the ESAF Employee Stock Option Scheme 2019. The allotment was approved by the Nomination, Remuneration and Compensation Committee of the Board of Directors on November 5, 2025. The shares were issued upon exercise of vested options by employees. The newly allotted equity shares will rank pari-passu with existing equity shares of the bank. The bank is listed on BSE (scrip code: 544020) and NSE (symbol: ESAFSFB).",
            "Sentiment": "neutral",
            "PublishDate": 1762376847605,
            "Source": "corporate_action"
        },
        {
            "Title": "ESAF Small Finance Bank Approves ₹150 Crore Tier II Bond Issuance",
            "Summary": "ESAF Small Finance Bank's Board approved raising ₹150 crore through Basel II compliant Tier II subordinated bonds in the form of non-convertible debentures on a private placement basis. The bonds will carry an interest rate of 11.30% per annum with a tenure of 69 months, maturing in August 2031. The issuance falls within the overall limit of ₹1,000 crore approved by shareholders in the Annual General Meeting held in September 2025. The Board authorized the Management Committee to decide on future issuances within this limit, including terms and conditions. The NCDs are proposed to be listed on NSE's Negotiated Trade Reporting Platform under New Debt Market.",
            "Sentiment": "neutral",
            "PublishDate": 1762163165164,
            "Source": "corporate_action"
        },
        {
            "Title": "ESAF Small Finance Bank Receives RBI Notice on Arrangement Scheme, Dia Vikas Capital Share Acquisition Not Approved",
            "Summary": "ESAF Small Finance Bank has received a notice from the Reserve Bank of India regarding an arrangement scheme. The RBI has not approved Dia Vikas Capital's acquisition of shares exceeding 5% in the bank. The bank's board is currently evaluating the consequences of these developments and exploring other available options.",
            "Sentiment": "negative",
            "PublishDate": 1761642718412,
            "Source": "stock"
        },
        {
            "Title": "ESAF Small Finance Bank Receives RBI Approval for Karthikeyan M as Part Time Chairman",
            "Summary": "ESAF Small Finance Bank received Reserve Bank of India approval for the appointment of Shri. Karthikeyan M (DIN: 09450145) as Part Time Chairman for three years from December 21, 2025 to December 20, 2028. The appointment was previously recommended by the bank's Nomination, Remuneration and Compensation Committee and Board of Directors in August 2025. The bank will seek shareholder approval for his appointment as Non-Executive Independent Director within required timelines.",
            "Sentiment": "positive",
            "PublishDate": 1760762328867,
            "Source": "corporate_governance"
        },
        {
            "Title": "EsaF Small Finance Bank Reports Deposit Growth of 5.93% and Advances Growth of 4.35%",
            "Summary": "EsaF Small Finance Bank reported a 5.93% yearly increase in deposits and a 4.35% growth in advances for Q2 FY26. The bank achieved positive growth in both key financial metrics during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1759570606331,
            "Source": "stock"
        },
        {
            "Title": "ESAF Small Finance Bank Appoints George Ittan Maramkandathil as Non-Executive Director",
            "Summary": "ESAF Small Finance Bank has appointed George Ittan Maramkandathil as Non-Executive Director for a three-year term from November 18, 2025 to November 17, 2028. The appointment was approved by shareholders at the bank's 9th Annual General Meeting held on September 24, 2025. Maramkandathil is the CEO and Founder of AST Group of Companies with 43 years of professional experience, starting his career as a CAD Team Leader at Rice Perry Ellis and Partners in 1982 before founding AST Group in 1985. He holds a 2.58% stake in the bank and is not related to any existing directors. He will be subject to retirement by rotation as per the bank's Articles of Association.",
            "Sentiment": "positive",
            "PublishDate": 1758734225918,
            "Source": "corporate_governance"
        },
        {
            "Title": "ESAF Small Finance Bank Approves Tier I Capital Raise and Increases Authorized Capital to Rs. 1000 Crores",
            "Summary": "ESAF Small Finance Bank's Board of Directors approved raising Tier I capital through equity share issuance via methods including rights issue, preferential issue, private placement, or qualified institutional placement, subject to shareholder approval. The board also approved increasing the bank's authorized capital from Rs. 600 crores to Rs. 1000 crores, pending Reserve Bank of India and shareholder approvals. Additionally, George Thomas, Executive Vice President of Human Resources, will be relieved from his responsibilities on September 30, 2025, before completing his contractual tenure due to personal reasons. The bank has made suitable internal arrangements for the position.",
            "Sentiment": "neutral",
            "PublishDate": 1758351889738,
            "Source": "corporate_action"
        },
        {
            "Title": "ESAF Small Finance Bank Schedules Board Meeting to Consider Tier I Capital Raising",
            "Summary": "ESAF Small Finance Bank has scheduled a Board of Directors meeting for September 20, 2025, to consider raising Tier I Capital through equity shares or other eligible securities. The bank plans to use various methods including private placement, qualified institutions placement, or preferential issue, subject to regulatory approvals and shareholder consent. The board will also discuss convening an extraordinary general meeting or postal ballot to seek shareholder approval for the fund raising proposal. A trading window closure for designated persons and their immediate relatives will be in effect from September 15, 2025, until September 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757943514006,
            "Source": "corporate_action"
        },
        {
            "Title": "CareEdge Downgrades ESAF Small Finance Bank's Debt Ratings on Asset Quality Concerns",
            "Summary": "CareEdge Ratings downgraded ESAF Small Finance Bank's debt instruments by one notch due to sustained weakness in asset quality and net losses for four consecutive quarters. The bank's tier-2 bonds were revised down to A-/negative from A/negative, while the proposed ₹385 crore lower tier-2 bonds also received an A-/negative rating. The ₹500-crore certificate of deposits was downgraded to A1 from A1+. ESAF reported a net loss of ₹521 crore in FY25 and ₹81 crore in the first quarter, primarily due to elevated credit costs and interest income reversals. The outlook remains negative as profitability and asset quality pressures are expected to continue. CareEdge indicated the outlook could be revised to stable if the bank raises substantial equity capital or demonstrates significant asset quality improvement with reduced slippages.",
            "Sentiment": "negative",
            "PublishDate": 1756947322204,
            "Source": "stock"
        },
        {
            "Title": "ESAF Small Finance Bank Reports Mixed Q1 FY26 Results with Declining NIMs and Asset Quality Pressures",
            "Summary": "ESAF Small Finance Bank reported total business of INR 42,507 crores, up 4.82% year-on-year for the quarter ended June 30, 2025. Deposits grew 8.7% to INR 22,698 crores while gross advances declined to INR 18,224 crores from INR 18,783 crores in the previous year. Net interest income dropped significantly to INR 378 crores from INR 588 crores, with net interest margin compressing to 6% from 9.4% previously. The bank faced asset quality challenges with gross NPA at 7.5% and net NPA at 3.8%, though provision coverage ratio improved to 73.2%. The microfinance loan book declined from INR 13,236 crores to INR 9,095 crores year-on-year, facing pressures particularly in Karnataka and Tamil Nadu. Gold loans emerged as a standout performer, growing 16% quarter-on-quarter and doubling year-on-year, now available in 662 branches. Secured assets increased to 54.79% of the loan book from 32.69% a year ago, with 90% of quarterly disbursements being secured loans. The bank executed NPA sales of INR 733.4 crores during the quarter and raised INR 65 crores through Tier 2 bonds. Management expects stress levels to stabilize in the second quarter with positive traction from the third quarter, targeting 70% secured assets by March 2027 and positive ROA by end of FY26.",
            "Sentiment": "negative",
            "PublishDate": 1755511758181,
            "Source": "earnings"
        },
        {
            "Title": "ESAF Small Finance Bank Recommends New Chairman Appointment and Allots Rs 50 Crore Subordinated Bonds",
            "Summary": "ESAF Small Finance Bank's Board of Directors recommended the appointment of Shri. Karthikeyan M as Part Time Chairman and Non-Executive Independent Director for a three-year term starting December 21, 2025. The appointment is subject to RBI and shareholder approval. Karthikeyan M, a former Executive Director of Bank of India with over 36 years of banking experience, will replace Shri. Ravimohan Periyakavil Ramakrishnan who retires on December 20, 2025. Additionally, the bank's Management Committee approved the allotment of 5,000 non-convertible debentures worth Rs 50 crores on a private placement basis. The Basel II compliant lower Tier II subordinated bonds carry an 11.30% interest rate, have a 69-month tenure, and will mature on May 14, 2031. The NCDs are proposed to be listed on NSE's debt market platform.",
            "Sentiment": "positive",
            "PublishDate": 1755181290870,
            "Source": "corporate_governance"
        },
        {
            "Title": "ESAF Small Finance Bank Submits Revised Q1FY26 Investor Presentation After Correcting Clerical Errors",
            "Summary": "ESAF Small Finance Bank submitted a revised investor presentation for the quarter ended June 30, 2025, correcting clerical and typographical errors found in the previously submitted version from August 9, 2025. The bank reported a loss after tax of ₹81.2 crores for Q1FY26 compared to a profit of ₹62.77 crores in Q1FY25. Total loan book stood at ₹19,809 crores with minimal growth of 0.7% year-on-year, while deposits grew 8.7% to ₹22,698 crores. Asset quality deteriorated with GNPA rising to 7.5% and NNPA at 3.8%. The bank operates 788 banking outlets across 24 states and 2 union territories with a total customer base of 95.80 lakh. Net interest margin compressed to 6.0% in Q1FY26 from 9.4% in Q1FY25, while cost of deposits improved to 7.3% from 7.5%.",
            "Sentiment": "negative",
            "PublishDate": 1755025437383,
            "Source": "earnings"
        },
        {
            "Title": "ESAF Small Finance Bank Uploads Q1 FY2026 Earnings Call Audio Recording",
            "Summary": "ESAF Small Finance Bank has made the audio recording of its earnings conference call available on its website. The call discussed the bank's financial results for the quarter ended June 30, 2025, and was held on August 11, 2025. The bank notified stock exchanges BSE and NSE about the availability of the recording, which can be accessed through a direct link on the bank's website at www.esafbank.com.",
            "Sentiment": "neutral",
            "PublishDate": 1754915888165,
            "Source": "earnings"
        },
        {
            "Title": "ESAF Small Finance Bank Reports Rs. 14 Crore Robbery at Jabalpur Branch",
            "Summary": "ESAF Small Finance Bank disclosed a robbery at its Sihora Branch in Jabalpur, Madhya Pradesh, involving gold and valuables worth approximately Rs. 14 crore. The incident occurred on August 11, 2025, at 10:30 AM and has been reported to local police for investigation. The bank stated that the loss is fully insured under comprehensive insurance coverage, subject to policy terms and conditions. Customer deposits and normal banking operations remain unaffected. The bank does not expect the incident to have a material financial impact but made the disclosure voluntarily due to the significance of the event and potential stakeholder interest.",
            "Sentiment": "neutral",
            "PublishDate": 1754908780296,
            "Source": "stock"
        },
        {
            "Title": "ESAF Small Finance Bank Reports Net Loss of ₹81.22 Crore in Q1 FY2026 Amid Asset Quality Deterioration",
            "Summary": "ESAF Small Finance Bank posted a net loss of ₹81.22 crore in Q1 FY2026, compared to a profit of ₹62.77 crore in the same quarter last year. Net Interest Income declined 35.8% to ₹377.87 crore, while total income fell 18.6% to ₹573.01 crore. The bank's asset quality deteriorated with Gross NPA rising to 7.5% and Net NPA at 3.8%. Net Interest Margin compressed significantly to 6.0% from 9.4% in the previous year. The bank's total business stands at ₹42,507 crore with a loan book of ₹19,809 crore and deposits of ₹22,698 crore. Micro loans constitute 46% of the portfolio at ₹9,095 crore, showing a decline from the previous year. The bank operates through 788 banking outlets across 24 states and 2 Union Territories, serving 95.80 lakh customers. Management is focusing on loan diversification, deposit growth, technology enhancement, and recovery efforts to address profitability and asset quality challenges.",
            "Sentiment": "negative",
            "PublishDate": 1754843547946,
            "Source": "earnings"
        },
        {
            "Title": "ESAF Small Finance Bank Reports Q1 Net Loss of 812M Rupees, Asset Quality Deteriorates",
            "Summary": "ESAF Small Finance Bank reported a net loss of 812 million rupees in Q1, compared to a profit of 628 million rupees in the same period last year. The bank's asset quality showed deterioration with Gross Non-Performing Assets (GNPA) rising to 7.48% from 6.87% quarter-on-quarter, while Net Non-Performing Assets (NNPA) increased to 3.77% from 2.99% quarter-on-quarter. Interest earned declined to 8.3 billion rupees from 10.22 billion rupees year-on-year. However, provisions and contingencies decreased to 2.34 billion rupees from 3.32 billion rupees quarter-on-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754641147308,
            "Source": "earnings"
        },
        {
            "Title": "ESAF Small Finance Bank Schedules Board Meeting on August 8 to Approve Quarterly Financial Results",
            "Summary": "ESAF Small Finance Bank has scheduled a Board of Directors meeting on August 8, 2025 to consider and approve the unaudited standalone financial results for the quarter ended June 30, 2025. The trading window for designated persons and their immediate relatives has been closed from July 1, 2025 until August 10, 2025, which is 48 hours after the declaration of results. The bank trades on BSE with scrip code 544020 and on NSE with symbol ESAFSFB.",
            "Sentiment": "neutral",
            "PublishDate": 1754041172898,
            "Source": "corporate_action"
        },
        {
            "Title": "ESAF Small Finance Bank Appoints New Director, Grants Stock Options to Employees",
            "Summary": "ESAF Small Finance Bank appointed George Ittan Maramkandathil as Non-Executive Director for a three-year term from November 18, 2025 to November 17, 2028, subject to shareholder approval. Maramkandathil is CEO and Founder of AST Group of Companies with 43 years of experience. The bank granted 9,55,949 stock options to eligible employees under its 2019 Employee Stock Option Scheme at Rs. 10 per option with a one-year vesting period. The bank also noted the completion of employment contract for Executive Vice President Hemant Kumar Tamta effective July 31, 2025, and has made internal arrangements for the position.",
            "Sentiment": "neutral",
            "PublishDate": 1753348100462,
            "Source": "corporate_governance"
        },
        {
            "Title": "ESAF Small Finance Bank Reports Mixed Financial Results",
            "Summary": "ESAF Small Finance Bank has reported mixed financial results. The bank's term deposits as of June 30, 2025, increased by 6.95% compared to the same period last year. However, gross advances decreased by 2.98% year-over-year as of June 30. The specific year for the gross advances figure is not mentioned in the news data.",
            "Sentiment": "neutral",
            "PublishDate": 1751846961000,
            "Source": "default"
        },
        {
            "Title": "ESAF Small Finance Bank: Q1 Deposits Up, Advances Down",
            "Summary": "ESAF Small Finance Bank reported an 8.6% YoY increase in total deposits to ₹22,698 crore for Q1 FY2026. Gross advances decreased by 3% YoY to ₹18,224 crore. CASA ratio improved to 24.80%. Secured advances grew 66.6% YoY, now 58.7% of loan book. Micro loans declined 39.1%. The bank transferred NPAs worth ₹733.4 crore to an ARC for ₹73.34 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1751630820000,
            "Source": "result"
        },
        {
            "Title": "ESAF Small Finance Bank Reports Mixed Financial Results",
            "Summary": "ESAF Small Finance Bank has reported a 6.95% year-on-year increase in term deposits as of June 30, 2025. However, the bank's gross advances decreased by 2.98% over the same period. No specific monetary figures or additional context were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1751629741000,
            "Source": "default"
        },
        {
            "Title": "ESAF Small Finance Bank: Sells Rs 733 Crore Bad Loan Portfolio for Rs 73 Crore",
            "Summary": "ESAF Small Finance Bank has sold a portfolio of non-performing assets and technically written-off loans worth Rs 733.4 crore to an Asset Reconstruction Company for Rs 73.34 crore. The sale was conducted using the Swiss Challenge Method and aims to improve the bank's balance sheet and asset quality.",
            "Sentiment": "positive",
            "PublishDate": 1751298540000,
            "Source": "corporate_action"
        },
        {
            "Title": "ESAF Small Finance Bank Transfers ₹733.40 Crore NPAs to ARC",
            "Summary": "ESAF Small Finance Bank has transferred non-performing assets (NPAs) worth ₹733.40 crore to an Asset Reconstruction Company (ARC). This move is likely aimed at cleaning up the bank's balance sheet by offloading bad loans.",
            "Sentiment": "neutral",
            "PublishDate": 1751296654000,
            "Source": "default"
        },
        {
            "Title": "ESAF Small Finance Bank: Board Approves Rs 735 Crore Bad Loan Sale to ARC",
            "Summary": "ESAF Small Finance Bank's board has approved the sale of non-performing and technically written-off loans worth Rs 735.18 crore to an asset reconstruction company. The bank has also partnered with Maruti Suzuki India to offer retail financing solutions for vehicles.",
            "Sentiment": "positive",
            "PublishDate": 1750304712000,
            "Source": "corporate_action"
        },
        {
            "Title": "ESAF Small Finance Bank: Board Approves ₹735 Crore Bad Loan Sale to ARC",
            "Summary": "ESAF Small Finance Bank's board has approved the sale of ₹735.18 crore in non-performing and technically written-off loans to an asset reconstruction company. The bank holds provisions covering 90.15% of the total pool. Separately, ESAF SFB has partnered with Maruti Suzuki India to offer retail financing solutions for vehicles.",
            "Sentiment": "neutral",
            "PublishDate": 1750253395000,
            "Source": "corporate_action"
        },
        {
            "Title": "ESAF Small Finance Bank Approves Sale of NPAs and Written-Off Loans",
            "Summary": "ESAF Small Finance Bank has approved the sale of non-performing assets (NPAs) and written-off loans worth 7.35 billion rupees to an Asset Reconstruction Company. This move is likely aimed at cleaning up the bank's balance sheet and improving its financial health.",
            "Sentiment": "neutral",
            "PublishDate": 1750243547000,
            "Source": "default"
        },
        {
            "Title": "ESAF Small Finance Bank Reports Q4 Net Loss of 1.8 Billion Rupees",
            "Summary": "ESAF Small Finance Bank has reported its quarterly results. The bank posted a net loss of 1.8 billion rupees in Q4, compared to a net loss of 434 million rupees in the same quarter last year. This represents a significant increase in losses year-over-year. The loss also widened from 2.1 billion rupees in the previous quarter. Revenue for Q4 stood at 8.9 billion rupees, down from 10 billion rupees in the same period last year. The bank's Gross Non-Performing Assets (GNPA) ratio improved slightly to 6.87% from 6.96% in the previous quarter. However, the Net Non-Performing Assets (NNPA) ratio increased marginally to 2.99% from 2.97% quarter-on-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1747613603000,
            "Source": "default"
        },
        {
            "Title": "ESAF Small Finance Bank: Third Consecutive Quarterly Loss as Microfinance Stress Persists",
            "Summary": "ESAF Small Finance Bank reported a net loss of Rs 183 crore for Q4 FY24-25, marking its third consecutive quarterly loss. The bank's annual loss for FY24-25 stood at Rs 521 crore, compared to a profit of Rs 426 crore in the previous fiscal year. Gross NPA ratio slightly improved to 6.87% from 6.96% in the previous quarter but remains significantly higher than the 4.76% reported a year ago.",
            "Sentiment": "negative",
            "PublishDate": 1747410856000,
            "Source": "earnings"
        }
    ]
}