{
    "Symbol": "ESCORTS",
    "ISIN": "INE042A01014",
    "News": [
        {
            "Title": "Escorts Kubota Board Approves Rs 500 Cr Investment",
            "Summary": "Escorts Kubota Limited's board approves additional Rs 500 crore investment in wholly owned subsidiary Escorts Kubota Finance Limited, adding to existing Rs 200 crore approval.",
            "Sentiment": "positive",
            "PublishDate": 1770898410114,
            "Source": "stocks"
        },
        {
            "Title": "Escorts Kubota Q3FY26 Results Show Strong Growth",
            "Summary": "Escorts Kubota Limited reported robust Q3FY26 performance with revenue rising 11.1% YoY to ₹3,261.4 crore and PAT growing 24.7% to ₹362.4 crore, driven by strong agri machinery demand.",
            "Sentiment": "positive",
            "PublishDate": 1770803492837,
            "Source": "co_actions_results"
        },
        {
            "Title": "Escorts Kubota Block Trade Worth Rs. 73.50 Crores",
            "Summary": "Escorts Kubota witnessed a significant NSE block trade worth Rs. 73.50 crores involving approximately 203,756 shares at Rs. 3607.50 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1770181259516,
            "Source": "co_actions_results"
        },
        {
            "Title": "Escorts Kubota Sets Q3 Results Date for Feb 10",
            "Summary": "Escorts Kubota has announced that its board will convene on February 10 to consider and approve the company's third quarter financial results for the current fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1770113605908,
            "Source": "co_actions_results"
        },
        {
            "Title": "Escorts Kubota Block Trade Worth ₹53.33 Crores",
            "Summary": "Escorts Kubota witnessed a significant block trade on NSE worth ₹53.33 crores involving 147,848 shares at ₹3607.10 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1770093725475,
            "Source": "co_actions_results"
        },
        {
            "Title": "Escorts Kubota Jan Sales Jump 47% to 9,799 Units",
            "Summary": "Escorts Kubota reported strong January sales growth with total units reaching 9,799 compared to 6,669 units in the same period last year, marking a significant year-on-year improvement.",
            "Sentiment": "positive",
            "PublishDate": 1769917618332,
            "Source": "stocks"
        },
        {
            "Title": "Escorts Kubota Gets ₹299.24 Cr Tax Demand Dropped",
            "Summary": "State Tax Officer Chennai drops GST demand of ₹299.24 crores against Escorts Kubota for FY2020-24, ending dispute over tractor classification and tax computation methodology.",
            "Sentiment": "positive",
            "PublishDate": 1769760037301,
            "Source": "stocks"
        },
        {
            "Title": "Escorts Kubota Shares Drop 2.30% Despite Strong Growth",
            "Summary": "Escorts Kubota shares fell 2.30% to ₹3,471.70 on Friday despite reporting strong annual revenue growth of 15.75% to ₹10,243.88 crores in FY25 and maintaining consistent dividend payments.",
            "Sentiment": "neutral",
            "PublishDate": 1769165194405,
            "Source": "stocks"
        },
        {
            "Title": "Escorts Kubota Reports 38.5% Growth in Tractor Sales",
            "Summary": "Escorts Kubota Limited reported strong tractor sales growth of 38.5% in December 2025, selling 7,577 units compared to 5,472 units in December 2024, driven by supportive government policies and positive rural sentiment.",
            "Sentiment": "positive",
            "PublishDate": 1767239075705,
            "Source": "stocks"
        },
        {
            "Title": "Escorts Kubota faces ₹3.40 cr tax demand from Pune",
            "Summary": "Assistant Commissioner of State Tax, Pune South orders ₹1.76 cr tax demand with ₹1.47 cr interest and ₹17.63 lakh penalty over input tax credit eligibility. Company plans appeal.",
            "Sentiment": "negative",
            "PublishDate": 1767078427130,
            "Source": "stocks"
        },
        {
            "Title": "Escorts Kubota Gets Relief from ₹43.26 Cr GST Demand",
            "Summary": "State tax officer drops ₹43.26 crores GST demand against Escorts Kubota for FY 2018-19 after company's successful written objections on December 29, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1767077588320,
            "Source": "stocks"
        },
        {
            "Title": "Escorts Kubota GST penalty of ₹13.33 lakh dropped",
            "Summary": "Escorts Kubota Limited receives favorable order from Additional Commissioner dropping GST penalty of ₹13,33,440 imposed for procedural documentation issues in Agra.",
            "Sentiment": "positive",
            "PublishDate": 1766142871567,
            "Source": "stocks"
        },
        {
            "Title": "Escorts Kubota Officially Launches U22-6 Mini Excavator",
            "Summary": "Escorts Kubota formally announced commercial launch of U22-6 Mini Excavator on December 10, 2025, targeting domestic earthmoving equipment market under Kubota brand.",
            "Sentiment": "positive",
            "PublishDate": 1765377934024,
            "Source": "stocks"
        },
        {
            "Title": "Escorts Kubota Announces Senior Management Restructuring with New Appointments",
            "Summary": "Escorts Kubota appointed Mr. Takayuki Okada as Chief Officer-Quality Assurance Division and elevated four officials to Deputy Chief Officer positions effective December 01, 2025. The organizational restructuring affects key divisions including Construction Equipment, R&D, Operations, and Quality Assurance across the company's business units.",
            "Sentiment": "neutral",
            "PublishDate": 1764577411204,
            "Source": "corporate_governance"
        },
        {
            "Title": "Escorts Kubota Reports 17.9% Growth in November Sales",
            "Summary": "Escorts Kubota achieved total sales of 10,580 units in November, marking a significant increase from 8,974 units sold in the same month last year. The 17.9% year-on-year growth demonstrates strong performance for the agricultural and construction equipment manufacturer.",
            "Sentiment": "neutral",
            "PublishDate": 1764560888679,
            "Source": "stock"
        },
        {
            "Title": "Escorts Kubota Launches Third-Generation Ride-On Rice Transplanters in India",
            "Summary": "Escorts Kubota has unveiled its new third-generation ride-on rice transplanters in the Indian market. The product launch expands the company's agricultural machinery portfolio and targets rice farming operations in India.",
            "Sentiment": "positive",
            "PublishDate": 1763467427209,
            "Source": "stock"
        },
        {
            "Title": "Escorts Kubota Reports Strong Q2 Performance with 22.6% Revenue Growth and Margin Expansion",
            "Summary": "Escorts Kubota Limited delivered robust quarterly results with operating revenue from continuing operations reaching INR 2,777.4 crores, up 22.6% year-on-year. EBITDA grew 56% to INR 363.2 crores with margins expanding 280 basis points to 13.1%. Net profit from continuing operations stood at INR 321.2 crores, with normalized profit growing 51.7% after adjusting for previous year's one-time tax impact of INR 91 crores. The tractor business performed well with 30.3% volume growth to 33,877 tractors, gaining 20 basis points market share to reach 11.28%. Domestic tractor sales grew 30.5% while exports increased 26.2%. The construction equipment segment faced challenges with volumes declining to 1,146 machines from 1,394 in the corresponding quarter, though mini excavator market share improved by 151 basis points to 18.5%. Management expects the tractor industry to sustain low double-digit growth for the full fiscal year, supported by favorable agricultural conditions and recent GST rate reductions. The construction equipment business is expected to recover in the latter half of the fiscal year as infrastructure project mobilization improves.",
            "Sentiment": "positive",
            "PublishDate": 1762506347534,
            "Source": "earnings"
        },
        {
            "Title": "Escorts Kubota Reports Strong Q2 Results with ₹1,400 Crore Profit from Discontinued Operations",
            "Summary": "Escorts Kubota Limited announced its quarterly results for the quarter ended September 30, 2025. The company reported revenue from operations of ₹2,777.42 crores compared to ₹2,489.96 crores in the previous quarter. Net profit for the period reached ₹1,400.24 crores, significantly higher than ₹326.70 crores in the previous quarter, primarily driven by ₹1,027.63 crores profit from discontinued operations including ₹1,004.37 crores from the sale of RED Business. The company's Board size was optimized from 18 to 16 Directors following resignations of Mr. Manish Sharma (Independent Director) effective August 21, 2025, and Mr. Dai Watanabe (Non-Executive Nominee Director) effective October 31, 2025. The Board also revised the Policy for Determination of Materiality of Events, authorizing Mr. Akira Kato as Deputy Managing Director to determine materiality of events alongside other designated officials.",
            "Sentiment": "positive",
            "PublishDate": 1762253922550,
            "Source": "earnings"
        },
        {
            "Title": "Escorts Kubota Reports Mixed Q2 Results with Revenue Growth but Lower Net Profit",
            "Summary": "Escorts Kubota announced its Q2 financial results showing revenue of 27.8 billion rupees compared to 24.8 billion rupees in the same period last year. Net profit declined to 3.2 billion rupees from 3.3 billion rupees year-over-year. EBITDA increased to 3.6 billion rupees from 2.32 billion rupees, with EBITDA margin improving to 13.08% from 10.28% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762245316951,
            "Source": "earnings"
        },
        {
            "Title": "Escorts Kubota Reports Mixed Performance with 3.8% Tractor Growth, Construction Equipment Sales Drop 28.8% in October 2025",
            "Summary": "Escorts Kubota Limited reported contrasting performance across its business divisions in October 2025. The company's Agri Machinery Business achieved its highest monthly sales with 18,798 tractors sold, marking a 3.8% growth compared to 18,110 tractors in October 2024. Domestic tractor sales grew 3.3% to 18,423 units, while export sales surged 38.4% to 375 tractors. The tractor industry benefited from preponed festive season demand, government support, reduced GST rates, favorable agricultural conditions, and adequate water reservoir levels. However, the Construction Equipment Business Division faced challenges, selling 452 machines compared to 635 machines in October 2024, representing a 28.8% decline. The construction equipment sector is experiencing difficulties due to extended monsoon and slow infrastructure project mobilization. For the seven-month period from April to October, tractor sales increased 11.8% while construction equipment sales declined 22.2%. The company expects the construction equipment industry to recover as the government remains committed to infrastructure investments and new projects.",
            "Sentiment": "neutral",
            "PublishDate": 1761973557573,
            "Source": "stock"
        },
        {
            "Title": "Escorts Kubota Director Dai Watanabe Resigns Due to Professional Commitments",
            "Summary": "Dai Watanabe has resigned from his position as Non-Executive-Nominee Director of Escorts Kubota Limited with immediate effect from October 31, 2025. The resignation follows Kubota Corporation's withdrawal of his nomination. Watanabe cited pre-occupation with other professional assignments as the reason for his departure. His resignation also terminates his membership in the company's Nomination, Remuneration and Compensation Committee. Watanabe confirmed there are no other material reasons for his resignation beyond those stated.",
            "Sentiment": "neutral",
            "PublishDate": 1761932896107,
            "Source": "corporate_governance"
        },
        {
            "Title": "Escorts Kubota Shareholders Approve Appointment of Akira Kato as Deputy Managing Director",
            "Summary": "Escorts Kubota Limited announced that shareholders have approved two resolutions through postal ballot voting. The first resolution appointed Mr. Akira Kato (DIN-07543672) as Director and Whole Time Director, designated as Deputy Managing Director. The second resolution approved his remuneration for the role. The voting was conducted through remote e-voting from October 1 to October 30, 2025. Out of 138,345 eligible shareholders holding 111,877,754 equity shares, 700 members participated in the voting process covering 95,550,725 shares. Both resolutions were passed with over 99% approval - the appointment resolution received 99.48% votes in favor, while the remuneration resolution received 99.85% votes in favor. The scrutinizer Neelam Gupta confirmed the results were valid and the resolutions passed with requisite majority.",
            "Sentiment": "positive",
            "PublishDate": 1761852677428,
            "Source": "corporate_action"
        },
        {
            "Title": "Escorts Kubota Schedules Quarterly Results Review for November 4",
            "Summary": "Escorts Kubota has announced it will review its Q2 results on November 4. The company has set this date for the quarterly results review process.",
            "Sentiment": "neutral",
            "PublishDate": 1760358769206,
            "Source": "earnings"
        },
        {
            "Title": "Escorts Kubota Plans 20 Billion Rupee Investment in Haryana Facilities by 2031",
            "Summary": "Escorts Kubota has announced plans to invest up to 20 billion rupees in its Haryana facilities by 2031. The investment represents a significant capital commitment by the company for expanding its operations in the region.",
            "Sentiment": "positive",
            "PublishDate": 1759929098723,
            "Source": "stock"
        },
        {
            "Title": "Escorts Kubota Reports 47.5% Jump in September Unit Sales",
            "Summary": "Escorts Kubota sold 18,267 units in September, marking a significant increase from 12,380 units sold in the same month last year. This represents a growth of 5,887 units or approximately 47.5% year-over-year increase in unit sales for the company.",
            "Sentiment": "positive",
            "PublishDate": 1759290230204,
            "Source": "stock"
        },
        {
            "Title": "Anti-Dumping Duty Imposed on Crane Imports from China, Germany, and Singapore",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has imposed anti-dumping duties on crane imports from China, Germany, and Singapore. This development relates to Escorts Kubota, suggesting the company may benefit from the protective trade measures against foreign crane manufacturers.",
            "Sentiment": "positive",
            "PublishDate": 1758511109441,
            "Source": "stock"
        },
        {
            "Title": "Escorts Kubota Launches New Combine Harvester PRO588i-G in Punjab and Haryana",
            "Summary": "Escorts Kubota Limited introduced the PRO588i-G combine harvester under the Kubota brand in Punjab and Haryana markets. The harvester cuts crop stalks near the base, allowing full-length straw collection for reuse as cattle feed and in biomass plants, providing farmers an alternative to stubble burning. The machine features Japanese-designed threshing technology that reduces breakage of fragile Basmati rice grains, potentially increasing price and export potential. Weighing 2,700 kilograms compared to conventional harvesters at 9,000 kilograms, it reduces soil compaction and land preparation costs. The harvester includes crawler technology for wet field operations and ergonomic design features. Chairman Nikhil Nanda emphasized the innovation's potential to increase farmer profits while addressing air pollution in North India. Deputy Managing Director Akira Kato highlighted the product's role in advancing Indian agriculture productivity and sustainability goals.",
            "Sentiment": "positive",
            "PublishDate": 1758115262759,
            "Source": "stock"
        },
        {
            "Title": "Escorts Kubota Limited Confirms Non-Applicability of SEBI Large Corporate Regulations for FY 2025-26",
            "Summary": "Escorts Kubota Limited has confirmed it does not qualify as a Large Corporate under SEBI regulations for FY 2025-26. The company reported nil outstanding borrowings as of March 31, 2025. During the financial year ended March 31, 2025, CRISIL Limited granted the company a long-term rating of AA+ with stable outlook and a short-term rating of A1+. The confirmation relates to SEBI circulars regarding fund raising through debt securities issuance by large corporates.",
            "Sentiment": "neutral",
            "PublishDate": 1757084547196,
            "Source": "stock"
        },
        {
            "Title": "Escorts Kubota Reports 27% Jump in August Sales to 8,456 Units",
            "Summary": "Escorts Kubota recorded total sales of 8,456 units in August, marking a significant increase from 6,652 units in the same period last year. This represents a year-over-year growth of approximately 27% in unit sales volume.",
            "Sentiment": "positive",
            "PublishDate": 1756698785720,
            "Source": "stock"
        },
        {
            "Title": "Escorts Kubota Reports Higher Kharif Sowing, Expects Potential Tractor GST Cut",
            "Summary": "Escorts Kubota reported increased Kharif sowing compared to the previous year. The company anticipates a potential GST rate reduction on tractors before the festive season, reflecting strong sentiment in agricultural equipment demand.",
            "Sentiment": "positive",
            "PublishDate": 1756698411490,
            "Source": "stock"
        },
        {
            "Title": "Escorts Kubota Launches New MU4201 Tractor and Upgrades Existing Models",
            "Summary": "Escorts Kubota Limited launched the new Kubota MU4201 tractor, marking the brand's entry into the 41-44 HP category market in India. The tractor is designed by Japanese engineers for diverse agricultural applications including haulage, featuring premium elements like flat deck, suspended pedals, balancer shaft, synchromesh transmission and dual clutch. The company also launched upgraded versions of its Kubota MU4501 and MU5502 tractors with new 'Pompa Lift' technology capable of lifting 1640-2100 kgs with 455 mm lift height. Chairman & Managing Director Nikhil Nanda stated the launches align with their vision to establish themselves as a formidable player in the domestic tractor market through engineering excellence and cutting-edge technology. Deputy Managing Director Akira Kato noted the products target the 41-50 HP segment, which constitutes 60-64% of the total domestic market. The company plans to introduce the MU4201 across India, particularly strengthening positions in Maharashtra, Madhya Pradesh, Telangana, Uttar Pradesh, Rajasthan and Haryana.",
            "Sentiment": "positive",
            "PublishDate": 1756211937741,
            "Source": "stock"
        },
        {
            "Title": "Escorts Kubota Benefits from GST Reduction on Agricultural Equipment",
            "Summary": "A major GST cut has been announced for agricultural equipment, which will benefit Escorts Kubota. The reduction in goods and services tax applies to agricultural machinery and equipment in the sector.",
            "Sentiment": "positive",
            "PublishDate": 1756114208671,
            "Source": "stock"
        },
        {
            "Title": "Escorts Kubota Secures 200-Acre Land for Rs 4,500 Crore Tractor Manufacturing Plant",
            "Summary": "The Yamuna Expressway Industrial Development Authority has allotted 200 acres of land to Escorts Kubota Ltd. in Sector-10 of YEIDA for establishing a Rs 4,500 crore tractor manufacturing facility. The company signed an MoU with the Uttar Pradesh government on August 17, 2024, for this project. The investment will be implemented in phases, with the first phase requiring Rs 2,000 crore to develop a tractor plant, commercial equipment plant, and allied facilities. The second phase will depend on market demand and capacity utilization. The project is expected to create employment for 4,000 people and will produce tractors, engines, farm machinery, and construction equipment for both domestic and global markets. Escorts Kubota, formed in 2019 as a partnership between India's Escorts and Japan's Kubota, also plans to establish shared services for Kubota's global research and development operations from India.",
            "Sentiment": "positive",
            "PublishDate": 1755530000252,
            "Source": "stock"
        },
        {
            "Title": "Escorts Kubota Receives 463.7 Million Rupees Tax Refund Approval",
            "Summary": "Escorts Kubota has received approval from the Excise & Taxation Officer for a refund of 463.7 million rupees. The approval represents a significant financial benefit for the company.",
            "Sentiment": "positive",
            "PublishDate": 1755520825278,
            "Source": "stock"
        },
        {
            "Title": "Escorts Kubota Faces Rs 9.82 Lakh Tax Demand from Mumbai Customs Over Import Duty Classification",
            "Summary": "Escorts Kubota Limited received a tax demand order from the Joint Commissioner of Customs, Mumbai for Rs. 9,82,400 plus applicable interest. The company also faces a Redemption Fine of Rs. 3,30,000 and Penalty of Rs. 9,82,400. The order relates to classification and eligibility of exemption of duties on imported goods. The company plans to file an appeal before the appellate authority against this order dated August 08, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1754651785440,
            "Source": "stock"
        },
        {
            "Title": "Escorts Kubota Reports 40% Jump in Net Profit, Completes Railway Business Divestment",
            "Summary": "Escorts Kubota Limited reported strong quarterly results with net profit from continuing operations rising 40% year-on-year to Rs. 372.6 crores. Operating revenue reached Rs. 2,483.4 crores while EBITDA grew 2.6% to Rs. 325 crores with margins improving to 13.1%. The company completed the divestment of its railway equipment business to Sona BLW Precision Forgings for Rs. 1,601.7 crores, resulting in total net profit including discontinued operations of Rs. 1,400.2 crores. In the tractor business, domestic volumes declined slightly to 28,848 units due to regional growth disparities, though export volumes surged 80.3% to 1,733 tractors. The construction equipment segment faced challenges with volumes dropping to 1,055 machines and margins declining to 5.8% due to emission norm transitions. The company launched new products including Promaxx in Farmtrac brand and Kubota MU series, expecting market share improvements in coming quarters. Management maintains optimistic outlook citing positive rural sentiment from good monsoon conditions.",
            "Sentiment": "positive",
            "PublishDate": 1754642664998,
            "Source": "earnings"
        },
        {
            "Title": "Escorts Kubota Successfully Overturns ₹20.28 Lakh GST Penalties on Appeal",
            "Summary": "Escorts Kubota Limited has successfully overturned GST penalties totaling ₹20,28,091 that were imposed by the Assistant Commissioner, GST Department, Kanpur. The penalties, comprising ₹17,37,315 and ₹2,90,776, were levied due to clerical errors in customer addresses on tax invoices. The Commissioner (Appeals) of GST, Kanpur has now dropped these penalties following the company's appeal. The original penalty orders were issued in January 2024, and the successful appeal outcome occurred on August 05, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754479741999,
            "Source": "stock"
        },
        {
            "Title": "Escorts Kubota Targets 25-30% Export Growth and Plans ₹350-400 Crore Capex",
            "Summary": "Escorts Kubota aims to achieve 25-30% growth in exports this fiscal year and plans to increase export revenue contribution to 15% from the current 5-6%. The company has outlined a capital expenditure plan of ₹350-400 crores for FY26, which excludes land costs for new projects.",
            "Sentiment": "positive",
            "PublishDate": 1754365391837,
            "Source": "stock"
        },
        {
            "Title": "Escorts Kubota Projects 12-12.5% EBITDA Margins for FY26, Forecasts Mid-to-High Single Digit Tractor Industry Growth",
            "Summary": "Escorts Kubota expects EBITDA margins to reach 12-12.5% for FY26. The company maintains its prediction of mid-to-high single digit growth for the tractor industry this year.",
            "Sentiment": "positive",
            "PublishDate": 1754364622615,
            "Source": "stock"
        },
        {
            "Title": "Escorts Kubota Appoints Akira Kato as Deputy Managing Director, Approves Trust Extinguishment",
            "Summary": "Escorts Kubota Limited appointed Akira Kato as Additional Director in the capacity of Whole-Time Director and Key Managerial Personnel, designated as Deputy Managing Director, effective August 04, 2025. The appointment is for a five-year term and requires shareholder approval. Kato, aged 51 years with a bachelor's degree in economics from University of Osaka, is a nominee of Kubota Corporation and has worked with Kubota for 29 years in various senior managerial positions. He previously held the position of Chief-Officer – Corporate Planning Division at the company. Additionally, the Board approved the extinguishment of Escorts Benefit Trust, to which the company is a settlor/beneficiary. The trust contributed Rs. 14.39 lakh to net worth and the extinguishment is expected to be completed within 2 months, with remaining balance to be transferred to the company after tax adjustments.",
            "Sentiment": "positive",
            "PublishDate": 1754298590912,
            "Source": "corporate_governance"
        },
        {
            "Title": "Escorts Kubota Reports Strong Q1 Results with Leadership Changes and Business Divestment",
            "Summary": "Escorts Kubota Limited announced its quarterly results for the quarter ended June 30, 2025, reporting net profit of ₹1,400.24 crores (standalone) and ₹1,397.10 crores (consolidated), significantly boosted by the sale of its railway equipment division (RED Business) to Sona BLW Precision Forgings Limited for ₹1,600 crores, which generated a profit of ₹1,004.37 crores after tax. From continuing operations, the company earned ₹372.61 crores (standalone) and ₹369.47 crores (consolidated). Revenue from operations stood at ₹2,483.36 crores (standalone) and ₹2,500.05 crores (consolidated). The company also announced leadership changes with Mr. Seiji Fukuoka resigning as Deputy Managing Director and Mr. Akira Kato, a Kubota Corporation nominee, being appointed as Additional Director and Deputy Managing Director for a five-year term. Additionally, the board approved the extinguishment of Escorts Benefit Trust, expected to complete within two months.",
            "Sentiment": "positive",
            "PublishDate": 1754297589258,
            "Source": "earnings"
        },
        {
            "Title": "Escorts Kubota Reports Mixed Q1 Results with Higher Profit Despite Revenue Decline",
            "Summary": "Escorts Kubota announced its Q1 financial results showing net profit from continuing operations increased to 3.7 billion rupees compared to 2.7 billion rupees in the same period last year. However, revenue declined to 25 billion rupees from 26 billion rupees year-over-year. EBITDA rose slightly to 3.24 billion rupees from 3.2 billion rupees, while EBITDA margin compressed to 13.1% from 14.4% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754297104561,
            "Source": "earnings"
        },
        {
            "Title": "Escorts Reports 2.7% Growth in July Sales to 7,154 Units",
            "Summary": "Escorts recorded total sales of 7,154 units in July, representing an increase from 6,963 units in the same period last year. This reflects a year-over-year growth of 2.7% in unit sales for the company.",
            "Sentiment": "positive",
            "PublishDate": 1754019818358,
            "Source": "stock"
        },
        {
            "Title": "Escorts Kubota Receives 'Adequate' ESG Rating of 53 from CRISIL",
            "Summary": "Escorts Kubota Limited received an ESG rating of 'Crisil ESG 53' from CRISIL ESG Ratings & Analytics Ltd., categorized as 'Adequate' based on FY 2024-25 disclosures. The rating was independently prepared using publicly available data, with the company not having engaged CRISIL ESG Ratings for this assessment. The event occurred on July 28, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753787455521,
            "Source": "stock"
        },
        {
            "Title": "Finance Minister Rules Out GST Rate Reduction on Farm Equipment",
            "Summary": "The Finance Minister has ruled out any reduction in GST rates on farm equipment. This decision affects the agricultural equipment sector, including companies like Escorts that manufacture farm machinery.",
            "Sentiment": "negative",
            "PublishDate": 1753170206610,
            "Source": "stock"
        },
        {
            "Title": "Government Considers Lowering GST on Tractors and Farm Equipment",
            "Summary": "The government is reportedly in discussions to reduce the Goods and Services Tax (GST) on tractors and farm equipment from the current 12% to 5%. This potential tax reduction could affect companies like Escorts Kubota, which operates in the agricultural machinery sector.",
            "Sentiment": "positive",
            "PublishDate": 1752651959000,
            "Source": "default"
        },
        {
            "Title": "Escorts Kubota Launches New 'Hydra 12' Pick & Carry Crane",
            "Summary": "Escorts Kubota has introduced a new pick and carry crane model called 'Hydra 12' for the local market. The crane is designed for material handling and construction applications.",
            "Sentiment": "positive",
            "PublishDate": 1751466903000,
            "Source": "default"
        },
        {
            "Title": "Escorts Kubota: June Tractor Sales Up 2%, Meets Estimates",
            "Summary": "Escorts Kubota reported total sales of 11,498 tractors in June 2025, up 2.2% year-over-year. Domestic sales were 10,997 units, slightly down from last year. Exports doubled to 501 units. The company expects industry growth to continue due to favorable agricultural conditions.",
            "Sentiment": "positive",
            "PublishDate": 1751349653000,
            "Source": "result"
        },
        {
            "Title": "Escorts Kubota Reports 19.9% Increase in June Sales",
            "Summary": "Escorts Kubota reported total sales of 11,498 units in June, up from 9,593 units in the same month last year. This represents a 19.9% year-over-year increase in sales volume.",
            "Sentiment": "positive",
            "PublishDate": 1751340964000,
            "Source": "default"
        },
        {
            "Title": "Escorts Kubota: Ambitious Plan to Become No. 2 in Indian Tractor Market",
            "Summary": "Escorts Kubota Ltd. aims to become the second-largest player in the Indian tractor market. The company plans to launch new products over the next five years, combining Escorts' cost competitiveness with Kubota's technology. Current market share is 12-13%. Export growth and expansion of dealer network are key strategies.",
            "Sentiment": "positive",
            "PublishDate": 1751179489000,
            "Source": "normal_news"
        }
    ]
}