{
    "Symbol": "ESCONET",
    "ISIN": "INE0RQZ01017",
    "News": [
        {
            "Title": "Esconet Technologies Secures 21 Crore Order",
            "Summary": "Esconet Technologies, a company with a market capitalization of 220 crore rupees, has won an order worth 21 crore rupees. This represents a significant contract for the small and medium enterprise (SME).",
            "Sentiment": "positive",
            "PublishDate": 1742277832000,
            "Source": "order&deals"
        },
        {
            "Title": "Esconet Technologies Secures 110.1 Million Rupee Order from Bharat Electronics",
            "Summary": "Esconet Technologies has announced that it has received an order from Bharat Electronics Limited. The order is valued at 110.1 million rupees (approximately $1.33 million USD). This development represents a significant business opportunity for Esconet Technologies and demonstrates its capability to secure contracts from major Indian public sector companies.",
            "Sentiment": "positive",
            "PublishDate": 1738240635000,
            "Source": "order&deals"
        },
        {
            "Title": "Esconet Technologies Secures 139.1 Million Rupee Order",
            "Summary": "Esconet Technologies has received an order worth 139.1 million rupees. The company, which is listed as an SME (Small and Medium Enterprise), has not provided further details about the nature of the order or the client in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1735518188000,
            "Source": "order&deals"
        },
        {
            "Title": "Esconet Technologies Secures 139.1 Million Rupee Order",
            "Summary": "Esconet Technologies has received a new order valued at 139.1 million rupees. This significant order is likely to boost the company's revenue and potentially impact its financial performance positively.",
            "Sentiment": "positive",
            "PublishDate": 1735298199000,
            "Source": "order&deals"
        },
        {
            "Title": "Esconet Technologies to Invest 250 Million Rupees in Cloud Services Subsidiary",
            "Summary": "Esconet Technologies has announced plans to invest 250 million rupees in its subsidiary, Zeacloud Services Pvt Ltd. Zeacloud is an Infrastructure-as-a-Service (IaaS) cloud services company, indicating Esconet's strategic move to expand its presence in the cloud computing sector.",
            "Sentiment": "positive",
            "PublishDate": 1734482404000,
            "Source": "corporate_action"
        },
        {
            "Title": "Esconet Technologies to Invest 250 Million Rupees in Cloud Services Subsidiary",
            "Summary": "Esconet Technologies has announced plans to invest 250 million rupees in its subsidiary, Zeacloud Services Pvt Ltd. Zeacloud is described as an Infrastructure-as-a-Service (IaaS) cloud services company, indicating Esconet's strategic move to expand its presence in the cloud computing sector.",
            "Sentiment": "positive",
            "PublishDate": 1734434963000,
            "Source": "corporate_action"
        },
        {
            "Title": "ESCONET TECH Upgraded to Preferred Level in NVIDIA's NPN Program",
            "Summary": "ESCONET TECH has received a letter from NVIDIA Corporation informing them of a change in their Network Partner Network (NPN) program membership. The company has been upgraded to the Compute, Preferred level within the program.",
            "Sentiment": "positive",
            "PublishDate": 1729574686000,
            "Source": "corporate_action"
        }
    ]
}