{
    "Symbol": "ESSARSHPNG",
    "ISIN": "INE122M01019",
    "News": [
        {
            "Title": "Essar Shipping Acquires Strategic Firm to Expand Fleet",
            "Summary": "Essar Shipping announces acquisition of strategic shipping firm to expand fleet capacity, with deal closure expected by Q2 2024, strengthening company's maritime operations.",
            "Sentiment": "positive",
            "PublishDate": 1765605444859,
            "Source": "co_actions_results"
        },
        {
            "Title": "IDH International Drilling Holdco Files Revised Disclosure",
            "Summary": "IDH International Drilling Holdco Limited filed revised regulatory disclosure under SEBI Regulation 31(2) on December 23, 2025, regarding pledge release on Essar Shipping shares.",
            "Sentiment": "neutral",
            "PublishDate": 1765602461427,
            "Source": "co_actions_results"
        },
        {
            "Title": "Essar Shipping Mauritius Holdings to Acquire 10.34% Stake from Promoter Group Entity",
            "Summary": "Essar Shipping Mauritius Holdings Limited will acquire 10.34% equity shares of Essar Shipping Limited from IDH International Drilling Holdco Limited through an inter-se transfer among promoter group entities. The acquisition is exempt from open offer requirements under SEBI takeover regulations and is priced at Rs. 35.25 per share based on 60-day volume weighted average market price.",
            "Sentiment": "neutral",
            "PublishDate": 1765302551190,
            "Source": "corporate_action"
        },
        {
            "Title": "Essar Shipping Partially Redeems Rs. 5.89 Crore Non-Convertible Debentures",
            "Summary": "Essar Shipping Limited partially redeemed 1% Secured, Redeemable, Unlisted, Unrated, Non-Convertible Debentures worth Rs. 58,914,000 issued to Abhinand Ventures Private Limited. The redemption was conducted in accordance with the terms of issue and has no impact on the company's capital structure.",
            "Sentiment": "neutral",
            "PublishDate": 1764957242790,
            "Source": "corporate_action"
        },
        {
            "Title": "Essar Shipping Reports Rs 139 Crore Profit in H1 FY26 Despite Going Concern Issues",
            "Summary": "Essar Shipping Limited posted a profit of Rs 139.21 crore for the half-year ended September 30, 2025, driven primarily by exceptional gains of Rs 107.93 crore including recovery from subsidiary and security deposit receipts. The company faces significant financial distress with current liabilities exceeding assets, eroded net worth, continuous operational losses, and material uncertainty about its ability to continue as a going concern.",
            "Sentiment": "neutral",
            "PublishDate": 1763069424871,
            "Source": "corporate_action"
        },
        {
            "Title": "Essar Shipping Approves Divestment of Two Overseas Subsidiaries and Key Appointments at 15th AGM",
            "Summary": "Essar Shipping Limited held its 15th Annual General Meeting on September 26, 2025, where shareholders approved several key resolutions. The company approved divestment of two overseas wholly owned subsidiaries - Essar Shipping DMCC in UAE and OGD Services Holdings Limited in Mauritius. Both subsidiaries had negative net worth of Rs. 465.16 crore and Rs. 419.94 crore respectively, contributing 19.55% and 17.65% to the company's net worth. The divestments are expected to be completed within one year, with sale proceeds to be used for redemption of NCDs and ICDs. The buyers will be Essar Investment Holdings Mauritius Limited or other Essar Group entities. Additionally, shareholders approved the appointment of Ketan Kantibhai Shah as Non-Executive, Non-Independent Director, M/s. Manohar Chowdhry & Associates as Statutory Auditors for FY 2025-26 to FY 2029-30, and M/s. Mayank Arora & Co. as Secretarial Auditor for five years from FY 2025-26 to FY 2029-2030.",
            "Sentiment": "neutral",
            "PublishDate": 1758997949937,
            "Source": "corporate_action"
        },
        {
            "Title": "Essar Shipping Mauritius Holdings to Acquire 10.34% Stake in Essar Shipping Limited",
            "Summary": "Essar Shipping Mauritius Holdings Limited plans to acquire 10.34% equity shares (2.14 crore shares) of Essar Shipping Limited from IDH International Drilling Holdco Limited at Rs. 25.91 per share. This represents an inter-se transfer among promoter group entities. The acquisition can proceed anytime after 4 working days from the intimation date. Post-transaction, Essar Shipping Mauritius Holdings' stake in the target company will increase from 60.09% to 70.43%, while IDH International Drilling Holdco's holding will reduce from 10.34% to zero. The transaction is exempt from making an open offer under takeover regulations as it involves transfer between promoter group entities.",
            "Sentiment": "neutral",
            "PublishDate": 1758306822964,
            "Source": "corporate_action"
        },
        {
            "Title": "Essar Shipping Limited Announces Leadership Change in Company Secretary Role",
            "Summary": "Essar Shipping Limited announced the resignation of Bharat Modi as Company Secretary and Compliance Officer, effective August 28, 2025, citing personal occupancy as the reason. The company appointed Habib Jan as the new Company Secretary and Compliance Officer, effective August 29, 2025. Jan brings over 20 years of experience in secretarial, compliance, and finance aspects, with specialization in corporate and securities law, capital issues, corporate restructuring, mergers and amalgamations, and corporate governance. His previous experience includes work with Reliance ADA Group and involvement in various corporate restructuring activities. Jan is a qualified Company Secretary from The Institute of Company Secretaries of India and holds directorship in oilfields, shipping and logistics business.",
            "Sentiment": "neutral",
            "PublishDate": 1756386629104,
            "Source": "corporate_governance"
        },
        {
            "Title": "Essar Shipping Receives SFIO Investigation Notice Under Companies Act",
            "Summary": "Essar Shipping Limited received a notice from the Serious Fraud Investigation Office (SFIO) dated August 11, 2025, for investigation into the company's affairs under Section 212 of the Companies Act, 2013. The notice seeks data, documents, and information from the company. No specific details of violations or contraventions were mentioned in the notice. The company states there is no material impact on its financial, operational or other activities and that it will continue normal business operations while cooperating with SFIO during the investigation.",
            "Sentiment": "negative",
            "PublishDate": 1755155329542,
            "Source": "corporate_governance"
        },
        {
            "Title": "Essar Shipping Reports ₹41.67 Crore Profit in Q1 FY26 Despite Going Concern Uncertainties",
            "Summary": "Essar Shipping Limited reported a standalone profit of ₹41.67 crore for the quarter ended June 30, 2025, compared to ₹32.00 crore in the previous quarter. Total income increased to ₹52.03 crore from ₹51.39 crore. The company completed the sale of shares in a foreign subsidiary, receiving ₹71.88 crore and booking a profit of ₹47.70 crore including foreign exchange gains. However, the company faces significant financial challenges with eroded net worth, accumulated losses of ₹6,479.08 crore against share capital and reserves of ₹5,217.75 crore, and current liabilities exceeding current assets. Management agreements with group companies were terminated in May and June 2025. The company operates in fleet operating, chartering and management services, and management is pursuing measures to improve financial position including charter hire arrangements for its tug vessel. Auditors highlighted material uncertainty regarding the company's ability to continue as a going concern due to continuous operational losses and disposed assets to pay outstanding dues.",
            "Sentiment": "neutral",
            "PublishDate": 1755097174761,
            "Source": "earnings"
        },
        {
            "Title": "Essar Shipping Non-Executive Director Srinivasan Vaidyanathan Resigns Due to Personal Commitments",
            "Summary": "Srinivasan Vaidyanathan resigned from his position as Non-Executive Director (Additional Director) at Essar Shipping Limited, effective from the close of business hours on July 21, 2025. The resignation was attributed to other commitments and personal reasons. Vaidyanathan confirmed there were no other material reasons for his departure and expressed gratitude to the board and management team for their support during his tenure. The company has accepted his resignation and relieved him of his responsibilities.",
            "Sentiment": "neutral",
            "PublishDate": 1753156678622,
            "Source": "corporate_governance"
        },
        {
            "Title": "Essar Shipping Reports Profit in Q2 FY25 with Exceptional Item",
            "Summary": "Essar Shipping has reported a profit before tax (PBT) of 653 million rupees in Q2 FY25, compared to a loss of 336 million rupees in the same quarter last year. The company also recorded an exceptional item of 6.14 billion rupees in this quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731514198000,
            "Source": "result"
        },
        {
            "Title": "Essar Shipping Reports Q2 Profit of 6.4 Billion Rupees",
            "Summary": "Essar Shipping has reported a consolidated net profit of 6.4 billion rupees for the second quarter, compared to a loss of 359 million rupees in the same period last year. This marks a significant turnaround for the company. However, it's a decrease from the previous quarter's loss of 345 million rupees. The company's revenue for Q2 stood at 1.5 billion rupees, a substantial increase from 118 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731514084000,
            "Source": "result"
        }
    ]
}