{
    "Symbol": "ESSENTIA",
    "ISIN": "INE418N01035",
    "News": [
        {
            "Title": "Integra Essentia's Company Secretary Resigns",
            "Summary": "Integra Essentia Limited announces resignation of Company Secretary and Compliance Officer Mr. Pankaj Kumar Sharma effective February 07, 2026, citing personal reasons and career opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1770487248893,
            "Source": "stocks"
        },
        {
            "Title": "Integra Essentia Revises Share Capital to ₹200 Crore",
            "Summary": "Integra Essentia Limited corrects authorised share capital increase to ₹200 crore and appoints Atul Sharma as new Whole-time Director and CFO, replacing Shweta Singh who resigned.",
            "Sentiment": "neutral",
            "PublishDate": 1768991172320,
            "Source": "stocks"
        },
        {
            "Title": "Integra Essentia Q3FY26 Revenue Rises 12.4% YoY",
            "Summary": "Integra Essentia Limited reported Q3FY26 revenue of ₹14,005.37 lakhs, up 12.4% YoY, with net profit at ₹124.37 lakhs. Company also announced rights issue of up to ₹100 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768051054899,
            "Source": "co_actions_results"
        },
        {
            "Title": "Integra Essentia to Review Funding Proposal Jan 10",
            "Summary": "Integra Essentia Limited has scheduled January 10 to assess a funding proposal, marking a significant corporate development for the trading sector company.",
            "Sentiment": "neutral",
            "PublishDate": 1767789129643,
            "Source": "stocks"
        },
        {
            "Title": "Integra Essentia Shareholders Approve Amalgamation Scheme with G G Engineering Limited",
            "Summary": "Integra Essentia Limited held an equity shareholders meeting on September 27, 2025, to approve a scheme of arrangement for amalgamation with G G Engineering Limited. The meeting was conducted through video conferencing following NCLT orders dated April 24, May 15, and May 22, 2025. The meeting commenced at 3:35 PM after being adjourned for half an hour due to lack of quorum at the scheduled time. A total of 145 participants attended through video conferencing. Adv. Dr. Parvesh Khanna served as the Chairperson appointed by NCLT, while Mr. R.K Srivastava was appointed as the Scrutinizer. Remote e-voting was available from September 24-26, 2025, with additional e-voting facility provided during and after the meeting. The resolution was passed with requisite majority, and shareholders approved the amalgamation scheme. Under the arrangement, G G Engineering Limited will serve as the transferor company and Integra Essentia Limited as the transferee company.",
            "Sentiment": "positive",
            "PublishDate": 1758995304262,
            "Source": "corporate_action"
        },
        {
            "Title": "Integra Essentia Reports Q1 2025 Results, Director Resignation, and AGM Schedule",
            "Summary": "Integra Essentia Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of ₹7,873.45 lakhs compared to ₹8,606.01 lakhs in the same quarter last year. Consolidated net profit stood at ₹54.48 lakhs versus ₹245.26 lakhs in the previous year quarter. The company operates in two segments: dealing in essential items (₹7,746.73 lakhs revenue) and trading division-infrastructure (₹126.72 lakhs revenue). Mr. Anshumali Bhushan resigned as Non-Executive Independent Director effective August 1, 2025, leading to reconstitution of board committees with Ms. Gunjan Jha as Chairperson across all committees. The 18th Annual General Meeting is scheduled for September 5, 2025, via video conferencing, with book closure from August 30 to September 5, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754994089515,
            "Source": "earnings"
        },
        {
            "Title": "Enforcement Directorate Visits Integra Essentia Office and Promoter's Residence",
            "Summary": "The Enforcement Directorate (ED) conducted a visit to Integra Essentia's office and the residence of its promoter on April 16, 2023, as part of a third-party investigation. The company has stated that this visit has no material impact on its operations.",
            "Sentiment": "neutral",
            "PublishDate": 1745203224000,
            "Source": "default"
        }
    ]
}