{
    "Symbol": "ESTER",
    "ISIN": "INE778B01029",
    "News": [
        {
            "Title": "Ester Industries Submits Q3 FY26 Monitoring Report",
            "Summary": "Ester Industries submitted quarterly monitoring agency report for preferential issue of warrants worth Rs 174.99 crore, showing Rs 8.50 crore utilization during quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770636708090,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ester Industries Reports Q3 Loss of ₹124M",
            "Summary": "Ester Industries posted a consolidated net loss of ₹124 million in Q3, marking a significant reversal from the ₹248 million profit recorded in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1770361265302,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ester Industries Board Meet Set for Feb 6, 2026",
            "Summary": "Ester Industries Limited has scheduled a board meeting on February 6, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770027484908,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ester Industries Grants 19,188 Stock Options to CMO",
            "Summary": "Ester Industries Limited has granted 19,188 stock options to its Chief Marketing Officer under ESOP 2024, exercisable at ₹79.00 per option, representing a 20% discount to fair market value.",
            "Sentiment": "positive",
            "PublishDate": 1767863551170,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ester Industries Q2FY26 Results: Revenue Grows 7% to INR 357 Crores Despite Margin Pressures from Imports and US Tariffs",
            "Summary": "Ester Industries reported consolidated revenue of INR 357 crores with 7% year-on-year growth in Q2FY26, driven by higher volumes in Polyester Films and Specialty Polymers segments. The company faced margin pressures due to heavy imports at predatory pricing and US trade tariff impacts, while securing major offtake agreements with Nike for its recycling joint venture project.",
            "Sentiment": "neutral",
            "PublishDate": 1763715056607,
            "Source": "corporate_action"
        },
        {
            "Title": "Ester Industries Reports Widened Q2 Net Loss Despite Revenue Growth",
            "Summary": "Ester Industries reported a Q2 net loss of 158 million rupees compared to 30 million rupees in the previous year, despite revenue increasing to 3.54 billion rupees from 3.3 billion rupees. The company's EBITDA declined significantly to 150 million rupees from 398 million rupees, with margins compressing to 4.24% from 12.02% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1763337186749,
            "Source": "earnings"
        },
        {
            "Title": "Ester Industries Reports No Fund Utilization in Q2 FY26 Monitoring Report for Rs 174.99 Crore Preferential Issue",
            "Summary": "Ester Industries Limited reported no utilization of proceeds during the quarter ended September 30, 2025, from its Rs 174.99 crore preferential issue of convertible warrants, with Rs 89.24 crore still pending receipt from warrant holders. CRISIL Ratings Limited's monitoring report shows Rs 16.80 crore was utilized at the beginning of the quarter for investment in joint venture company Ester Loop Infinite Technologies, while Rs 15 crore allocated for general corporate purposes remains unused.",
            "Sentiment": "negative",
            "PublishDate": 1763131596821,
            "Source": "earnings"
        },
        {
            "Title": "Ester Industries Signs Deal to Supply Eco-Friendly Materials to Nike",
            "Summary": "Ester Industries has entered into a long-term offtake agreement with Loop Industries through a joint venture arrangement. The deal will enable Ester Industries to provide eco-friendly materials to Nike.",
            "Sentiment": "positive",
            "PublishDate": 1762782377247,
            "Source": "order&deals"
        },
        {
            "Title": "Ester Loop Infinite Technologies Plans Global Expansion Through Strategic Partnerships",
            "Summary": "Ester Loop Infinite Technologies will provide eco-friendly materials globally through key partnerships. The company is positioning itself in the sustainable materials market with a focus on international distribution.",
            "Sentiment": "positive",
            "PublishDate": 1758179645072,
            "Source": "stock"
        },
        {
            "Title": "Ester Industries Establishes US Subsidiary with $1.5 Million Capital for Marketing and Product Enhancement",
            "Summary": "Ester Industries has launched a new subsidiary in the United States with capital of up to $1.5 million. The subsidiary will focus on marketing activities and product enhancement operations in the US market.",
            "Sentiment": "positive",
            "PublishDate": 1757668485481,
            "Source": "stock"
        },
        {
            "Title": "Ester Industries Submits Q1 FY26 Monitoring Report for Rs 175 Crore Warrant Issue Proceeds",
            "Summary": "Ester Industries Limited submitted its monitoring agency report for the quarter ended June 30, 2025, regarding the utilization of proceeds from its preferential issue of convertible warrants worth Rs 174.99 crore. The report was prepared by CRISIL Ratings Limited and shows that out of the total issue size, Rs 16.80 crore has been utilized for investment in joint venture company Ester Loop Infinite Technologies Private Limited, while Rs 158.19 crore remains unutilized. The issue was conducted from November 5-12, 2024, with Rs 89.24 crore yet to be received from warrant holders upon conversion by May 13, 2026. The unutilized funds of Rs 68.95 crore are deployed in fixed deposits with Bank of India, earning returns between 4.50% to 6.25%. The proceeds are allocated for investment in the joint venture (Rs 159.99 crore) and general corporate purposes (Rs 15.00 crore). The report indicates no deviations from stated objectives and no delays in implementation.",
            "Sentiment": "neutral",
            "PublishDate": 1754649712905,
            "Source": "corporate_action"
        },
        {
            "Title": "Ester Industries Reports 19% Revenue Growth in Q1 FY26 with Strong Performance Across Segments",
            "Summary": "Ester Industries delivered strong quarterly results with consolidated revenue growing 19% year-on-year and EBITDA margin improving by 240 basis points to 8.35%. The company's recycled PET revenue surged dramatically from INR 0.5 crores to INR 14 crores. Polyester Films business showed robust performance with 22.57% volume growth and capacity utilization improving to 82% from 64%. The segment recorded sales of 21,531 metric tons with revenue increasing 20.7% to INR 276.07 crores. Value-added products now represent 24% of total segmental volume, growing 37% year-on-year. Specialty Polymers business recorded 4% volume growth with 954 metric tons sold, though EBIT margins normalized to 30-35% from an exceptionally high 43% in the previous year. Ester Filmtech showed improvement with capacity utilization at 72% versus 49% previously, and volume growth of 23%. The company unveiled a refreshed logo and is progressing with its 50-50 joint venture with Loop Industries. Additional recycled PET capacity of 20,000 tons per annum in Hyderabad is expected to commence commercial production by September 2025. Management expressed confidence in maintaining growth momentum across both business segments despite challenges from foreign exchange fluctuations and potential US tariff impacts.",
            "Sentiment": "positive",
            "PublishDate": 1754388632726,
            "Source": "earnings"
        },
        {
            "Title": "Ester Industries Shares Audio Recording of Q1 FY26 Earnings Call",
            "Summary": "Ester Industries Limited has made available an audio recording of its earnings call for investors and analysts held on August 1, 2025. The call discussed the company's financial performance for the quarter ended June 30, 2025. The audio recording can be accessed through a link provided on the company's website. The company informed both BSE and NSE about the availability of this recording.",
            "Sentiment": "neutral",
            "PublishDate": 1754053091180,
            "Source": "earnings"
        },
        {
            "Title": "Ester Industries Reports Q1 FY2026 Results, Appoints New Secretarial Auditors and Schedules 39th AGM",
            "Summary": "Ester Industries Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 27,900.51 lacs compared to Rs 25,802.81 lacs in the previous quarter and Rs 23,963.16 lacs in the same quarter last year. Net profit after tax stood at Rs 963.64 lacs versus Rs 1,233.02 lacs in the previous quarter. On a consolidated basis, revenue from operations was Rs 33,820.47 lacs against Rs 31,925.57 lacs in the previous quarter, while the company reported a net loss of Rs 715.51 lacs compared to a profit of Rs 196.13 lacs in the previous quarter. The Board appointed M/s. Dhananjay Shukla & Associates as Secretarial Auditors for five years, subject to shareholder approval. The company scheduled its 39th Annual General Meeting for September 26, 2025, via video conferencing, with September 19, 2025 set as the record date for dividend eligibility and voting rights.",
            "Sentiment": "neutral",
            "PublishDate": 1753887124274,
            "Source": "earnings"
        },
        {
            "Title": "Ester Industries Schedules Board Meeting for July 30 to Approve Quarterly Results",
            "Summary": "Ester Industries Limited has scheduled a Board of Directors meeting for July 30, 2025, to consider and approve the unaudited financial results for the quarter ended June 30, 2025. The board will also discuss matters related to the company's 39th Annual General Meeting. The company has announced that the trading window for its securities will remain closed until 48 hours after the declaration of the results, in compliance with insider trading regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1753422549014,
            "Source": "corporate_action"
        },
        {
            "Title": "CRISIL Revises Ester Industries' Credit Rating Outlook to 'Stable' from 'Negative'",
            "Summary": "CRISIL Ratings has revised the outlook on Ester Industries Limited's long-term credit facilities to 'Stable' from 'Negative' while reaffirming the rating at CRISIL A-. The short-term rating was reaffirmed at CRISIL A2+. The revision reflects improved operating performance driven by steady demand and correction in demand-supply imbalance in the flexible packaging industry. The company's revenue increased 22% year-on-year in fiscal 2025 due to 3% volume growth and 16% price realization improvement. EBITDA margin improved significantly to 11.5% in fiscal 2025 from -1.3% in fiscal 2024, supported by better BOPET product prices. Financial metrics strengthened with interest coverage ratio rising to 2.43 times from 0.01 time, and gearing reducing to 0.86 times from 1.08 times. Total bank loan facilities rated amount to Rs 523.9 crore. The company has established a joint venture with Canada-based Loop Industries for a $180 million project to manufacture chemicals through PET waste depolymerisation.",
            "Sentiment": "positive",
            "PublishDate": 1753272539084,
            "Source": "stock"
        },
        {
            "Title": "Ester Industries Unveils New Brand Identity on 40th Anniversary",
            "Summary": "Ester Industries has revealed a new brand identity coinciding with its 40th anniversary. The rebranding emphasizes the company's shift towards innovative and sustainable material solutions, adopting a global perspective.",
            "Sentiment": "positive",
            "PublishDate": 1752675216000,
            "Source": "default"
        },
        {
            "Title": "Ester Industries Reports Q4 Profit of 19.6 Million Rupees",
            "Summary": "Ester Industries has reported a consolidated net profit of 19.6 million rupees for the fourth quarter, compared to a loss of 237 million rupees in the same period last year. The company's profit increased from 248.2 million rupees in the previous quarter. Revenue for Q4 rose to 3.2 billion rupees from 2.76 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747873010000,
            "Source": "default"
        },
        {
            "Title": "Ester Industries Reports Q4 Financial Results",
            "Summary": "Ester Industries has announced its Q4 financial results. The company's EBITDA increased to 364.6 million rupees from 59.8 million rupees year-over-year, with the EBITDA margin improving to 11.42% from 2.16%. Revenue rose to 3.2 billion rupees from 2.76 billion rupees in the same period last year. The company reported a consolidated net profit of 19.6 million rupees, compared to a loss of 237 million rupees in the previous year's quarter. Sequentially, the profit increased from 248.2 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747842605000,
            "Source": "result"
        },
        {
            "Title": "Ester Industries Reports Significant Profit Turnaround in Q3",
            "Summary": "Ester Industries has reported a substantial improvement in its financial performance for the third quarter. The company's standalone net profit reached 186 million rupees, compared to a loss of 161 million rupees in the same period last year. Revenue increased to 2.75 billion rupees from 2 billion rupees year-over-year. On a consolidated basis, the company reported a net profit of 248 million rupees, reversing a loss of 448 million rupees in the previous year. Consolidated revenue also saw growth, rising to 3.46 billion rupees from 2.7 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738801222000,
            "Source": "earnings"
        },
        {
            "Title": "Ester Industries Reports Significant EBITDA Improvement in Q3",
            "Summary": "Ester Industries has reported a substantial turnaround in its Q3 financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) improved from a loss of 83 million rupees in the previous year to a gain of 417 million rupees. Additionally, the company achieved an EBITDA margin of 15.16% for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738765102000,
            "Source": "earnings"
        },
        {
            "Title": "Ester Industries Reports Profit in Q3, Revenue Increases",
            "Summary": "Ester Industries has reported a net profit of 186 million rupees in the third quarter, compared to a loss of 161 million rupees in the same period last year. The company's revenue also saw an increase, rising to 2.75 billion rupees from 2 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738765088000,
            "Source": "earnings"
        },
        {
            "Title": "Ester Industries Reports Q2 Profit Turnaround",
            "Summary": "Ester Industries has reported a net profit of 116 million rupees in the second quarter, compared to a loss of 128 million rupees in the same quarter last year. However, this represents a decrease from the previous quarter, where the company reported a loss of 20.4 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1730898428000,
            "Source": "result"
        },
        {
            "Title": "Ester Industries Reports Significant Q2 EBITDA Improvement",
            "Summary": "Ester Industries has reported a substantial improvement in its Q2 EBITDA, turning a loss of 36.6 million rupees in the previous year into a gain of 319.6 million rupees in the current year.",
            "Sentiment": "positive",
            "PublishDate": 1730898248000,
            "Source": "result"
        },
        {
            "Title": "Ester Industries Reports Q2 Revenue Growth",
            "Summary": "Ester Industries has announced its second quarter revenue, which stands at 3 billion rupees. This represents a significant increase from the previous year's second quarter revenue of 2.4 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1730898237000,
            "Source": "result"
        },
        {
            "Title": "Ester Industries Reports Q2 Profit After Previous Losses",
            "Summary": "Ester Industries has reported a net profit of 116 million rupees for the second quarter, marking a significant turnaround from a loss of 173 million rupees in the same quarter last year. However, compared to the previous quarter, there was a slight improvement from a loss of 20.4 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1730898224000,
            "Source": "result"
        }
    ]
}