{
    "Symbol": "ETERNAL",
    "ISIN": "INE758T01015",
    "News": [
        {
            "Title": "Eternal Limited Launches AI-Powered Delivery Hotline",
            "Summary": "Eternal Limited confirms launch of AI-powered hotline to streamline delivery partner onboarding process, clarifying it's routine business improvement not requiring regulatory disclosure.",
            "Sentiment": "positive",
            "PublishDate": 1770818692752,
            "Source": "stocks"
        },
        {
            "Title": "Eternal Limited announces postal ballot for director appointments",
            "Summary": "Eternal Limited seeks shareholder approval via remote e-voting from February 12-March 13, 2026, for re-appointing four independent directors and appointing Deepinder Goyal as Vice Chairman.",
            "Sentiment": "neutral",
            "PublishDate": 1770808766242,
            "Source": "stocks"
        },
        {
            "Title": "Eternal CEO Deepinder Goyal Steps Down Feb 1, 2026",
            "Summary": "Deepinder Goyal resigns as MD & CEO of Eternal Limited (formerly Zomato) effective February 1, 2026, transitioning to Vice Chairman role while Albinder Dhindsa takes over as Group CEO.",
            "Sentiment": "neutral",
            "PublishDate": 1770392692121,
            "Source": "stocks"
        },
        {
            "Title": "Eternal Limited Dissolves Netherlands Subsidiary",
            "Summary": "Eternal Limited (formerly Zomato Limited) announces dissolution of step-down subsidiary Zomato Netherlands B.V. with effect from January 27, 2026, as disclosed to stock exchanges on February 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770384330741,
            "Source": "stocks"
        },
        {
            "Title": "Eternal shares drop 9% despite Q3 profit growth",
            "Summary": "Eternal's stock declined nearly 9% in two sessions post Q3 results despite turning profitable across major business lines, as investors worry about sustainability amid rising competition in quick commerce.",
            "Sentiment": "negative",
            "PublishDate": 1769472683660,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eternal faces leadership shock amid margin gains",
            "Summary": "Dharmesh Kant warns Eternal's unexpected CEO transition may trigger stock volatility despite sequential margin improvement to 2.3%. Quick commerce cash burn remains key concern.",
            "Sentiment": "negative",
            "PublishDate": 1769060078368,
            "Source": "stocks"
        },
        {
            "Title": "Eternal Share Price Surges 7% After Q3 Results",
            "Summary": "Eternal shares jumped over 7% in early trade following the release of Q3 results, reaching ₹304.20 per share on BSE before moderating to ₹290.35.",
            "Sentiment": "positive",
            "PublishDate": 1769054644063,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eternal Shifts to Inventory Model for 1% Benefit",
            "Summary": "Eternal announces strategic shift to inventory-based business model, expecting full 1% accretion benefit to materialize within six to nine months according to management guidance.",
            "Sentiment": "positive",
            "PublishDate": 1769050403472,
            "Source": "stocks"
        },
        {
            "Title": "Eternal Plans Higher CapEx for Store Automation",
            "Summary": "Eternal announces increased capital expenditure per store for automation investments and larger formats, while maintaining working capital efficiency and targeting ROCE above 40%.",
            "Sentiment": "positive",
            "PublishDate": 1769050377243,
            "Source": "stocks"
        },
        {
            "Title": "Eternal Targets District Business Breakeven in 4-6 Qtrs",
            "Summary": "Eternal management expects District business losses to decrease from Q3 FY26, targeting breakeven within four to six quarters through sequential improvement strategy.",
            "Sentiment": "positive",
            "PublishDate": 1769050347330,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eternal Maintains $3B NOV Guidance for District Business",
            "Summary": "Eternal reaffirms its ambitious $3 billion NOV guidance for District business by FY30, targeting over 30% CAGR through the next four years driven by strategic market share expansion.",
            "Sentiment": "positive",
            "PublishDate": 1769050324024,
            "Source": "stocks"
        },
        {
            "Title": "Eternal Eyes Long-Term Quick Commerce Margins",
            "Summary": "Management expresses confidence in achieving 5-6% NOV margins for quick commerce despite near-term competitive pressures affecting margin predictability.",
            "Sentiment": "neutral",
            "PublishDate": 1769050296599,
            "Source": "stocks"
        },
        {
            "Title": "Eternal Q3 Results: Net Profit Surges 57% QoQ",
            "Summary": "Eternal reports strong Q3 performance with consolidated net profit rising to ₹1.02 billion from ₹650 million quarter-on-quarter, meeting estimates. Revenue grew to ₹163 billion.",
            "Sentiment": "positive",
            "PublishDate": 1769041525800,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eternal Limited QIP Proceeds Monitoring Report Q3FY26",
            "Summary": "Eternal Limited (formerly Zomato) reports proper utilization of ₹8,436.12 crore QIP proceeds with ₹1,528.33 crore deployed during Q3FY26. ICRA monitoring shows no deviations from stated objectives.",
            "Sentiment": "positive",
            "PublishDate": 1769003603834,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eternal Confident on Social Security Code Impact",
            "Summary": "Eternal expresses confidence in managing India's Social Security Code effects without altering long-term margin forecasts across business segments.",
            "Sentiment": "positive",
            "PublishDate": 1768997920743,
            "Source": "stocks"
        },
        {
            "Title": "Eternal Targets 3,000 Stores by March 2027",
            "Summary": "Eternal remains on track to achieve 3,000 stores by March 2027, with potential expansion to 3,500-4,000 stores if market competition moderates in the near term.",
            "Sentiment": "positive",
            "PublishDate": 1768997862119,
            "Source": "stocks"
        },
        {
            "Title": "Eternal Projects Food Delivery Growth to Reach 20%",
            "Summary": "Eternal indicates expectations for year-over-year food delivery growth to gradually increase towards 20% over time, signaling optimistic outlook for the sector.",
            "Sentiment": "positive",
            "PublishDate": 1768996714228,
            "Source": "stocks"
        },
        {
            "Title": "Deepinder Goyal Steps Down as Eternal CEO",
            "Summary": "Eternal Limited founder Deepinder Goyal transitions from Group CEO to Vice Chairman role, with Albinder Dhindsa set to take over as new Group CEO. Goyal cites desire to pursue higher-risk ventures outside public company scope.",
            "Sentiment": "neutral",
            "PublishDate": 1768992072075,
            "Source": "stocks"
        },
        {
            "Title": "Eternal Q3 Earnings Preview: 50% YoY Profit Growth Expected",
            "Summary": "Brokerages project Eternal's Q3 consolidated revenue to surge 193% YoY with 51% profit growth, driven by Blinkit's transition to first-party model and quick commerce momentum, though losses persist in newer businesses.",
            "Sentiment": "positive",
            "PublishDate": 1768895339226,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eternal Limited Q3FY26 Results Call on Jan 21",
            "Summary": "Eternal Limited announces board meeting and earnings conference call scheduled for January 21, 2026, to discuss Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768479043434,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eternal Limited Q3FY26 earnings call on Jan 21",
            "Summary": "Eternal Limited schedules board meeting and earnings conference call for January 21, 2026, to discuss Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768478779615,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eternal's FII holding drops to 36.2% in 7th quarter",
            "Summary": "Foreign institutional investor ownership in Eternal declined from 54% in June 2024 to 36.2% by December 2025, following the company's decision to cap foreign ownership at 49.5% to maintain regulatory flexibility.",
            "Sentiment": "neutral",
            "PublishDate": 1768366539500,
            "Source": "stocks"
        },
        {
            "Title": "Eternal Clarifies No Change in Blinkit Business Model",
            "Summary": "Eternal Ltd. confirms Blinkit's business model remains unchanged despite removing 10-minute delivery branding following Labour Ministry directive on gig worker safety concerns.",
            "Sentiment": "neutral",
            "PublishDate": 1768324209853,
            "Source": "stocks"
        },
        {
            "Title": "Eternal Clarifies No Material Changes in Blinkit Model",
            "Summary": "Eternal Limited responds to BSE surveillance query about Blinkit delivery reports, confirming no material business model changes or regulatory disclosures required under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768320070490,
            "Source": "stocks"
        },
        {
            "Title": "Eternal Shares Jump 3% on MSCI Full Weight Eligibility",
            "Summary": "Eternal Ltd shares rose 3% to ₹294.63 after foreign shareholding crossed 25% threshold, making it eligible for full MSCI weight. Passive inflows of $390 million expected if implemented in February review.",
            "Sentiment": "positive",
            "PublishDate": 1768289948752,
            "Source": "stocks"
        },
        {
            "Title": "Eternal Shares Rise 4% on MSCI Upgrade Prospects",
            "Summary": "Eternal shares surged over 4% after foreign ownership crossed 25%, potentially qualifying for full MSCI weighting and attracting ₹3,510 crore in passive inflows during February review.",
            "Sentiment": "positive",
            "PublishDate": 1768287883550,
            "Source": "stocks"
        },
        {
            "Title": "Eternal shares surge 4% on MSCI weightage hopes",
            "Summary": "Eternal shares jumped 4% to near one-month high of ₹297.30 as foreign headroom exceeded 25%, potentially making it eligible for full MSCI weightage in February review with possible $390 million passive inflows.",
            "Sentiment": "positive",
            "PublishDate": 1768281445591,
            "Source": "stocks"
        },
        {
            "Title": "Eternal shares surge 4% on MSCI weightage hopes",
            "Summary": "Eternal Ltd shares gained 4% for fifth consecutive session as increased foreign headroom above 25% makes stock eligible for full MSCI weightage, potentially triggering $390 million passive inflows in February review.",
            "Sentiment": "positive",
            "PublishDate": 1768278073930,
            "Source": "stocks"
        },
        {
            "Title": "Eternal Achieves MSCI Eligibility Milestone",
            "Summary": "Foreign ownership in Eternal crosses 25% threshold, making the company eligible for full MSCI weight in February review, potentially attracting $390 million in passive investments.",
            "Sentiment": "positive",
            "PublishDate": 1768277058800,
            "Source": "stocks"
        },
        {
            "Title": "Goldman Sachs Sets ₹375 Target for Eternal Despite High PE",
            "Summary": "Goldman Sachs initiates 'Buy' rating on Eternal with ₹375 target price, citing 32% upside potential despite 1,460x PE ratio. Quick commerce leadership and expansion plans drive optimism.",
            "Sentiment": "positive",
            "PublishDate": 1768193423342,
            "Source": "stocks"
        },
        {
            "Title": "Eternal Sees ₹110.48 Cr Block Trade on NSE",
            "Summary": "Eternal witnessed a significant block trade worth ₹110.48 crores on NSE involving approximately 39.05 lakh shares at ₹282.90 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768191775435,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eternal shares surge 3% on Goldman Sachs buy rating",
            "Summary": "Eternal shares climbed 3.3% to ₹292.90 after Goldman Sachs reiterated its buy rating, disagreeing with market bearishness despite the stock's 17% decline over three months.",
            "Sentiment": "positive",
            "PublishDate": 1767943675827,
            "Source": "stocks"
        },
        {
            "Title": "Eternal Share Price Rises 3.3% on Block Deal Activity",
            "Summary": "Eternal Ltd shares gained up to 3.3% to ₹292.90 following a block deal of 5.3 million shares, reaching near one-month highs despite Morgan Stanley's cautious quick commerce outlook and a ₹3.69 crore GST demand notice.",
            "Sentiment": "neutral",
            "PublishDate": 1767939633321,
            "Source": "stocks"
        },
        {
            "Title": "Eternal Materials Block Trade Worth ₹153.85 Crores",
            "Summary": "Eternal Materials executed a significant block trade on NSE involving 52.99 lakh shares at ₹290.30 per share, totaling ₹153.85 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1767938754392,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eternal Receives GST Demand Orders Worth ₹27.56 Cr",
            "Summary": "Eternal, parent entity of Zomato and Blinkit, received two GST demand orders totaling ₹27.56 crore including interest and penalty for April 2020-March 2022 period. Company plans to appeal the orders.",
            "Sentiment": "negative",
            "PublishDate": 1767933103683,
            "Source": "stocks"
        },
        {
            "Title": "Goldman Sachs Cuts Eternal Target Price to ₹375",
            "Summary": "Goldman Sachs maintains Buy rating on Eternal while reducing target price from ₹390 to ₹375, reflecting revised valuation expectations for the pharmaceutical company.",
            "Sentiment": "neutral",
            "PublishDate": 1767930573044,
            "Source": "stocks"
        },
        {
            "Title": "Eternal Limited Faces ₹16.72 Cr GST Demand Orders",
            "Summary": "Eternal Limited received GST demand orders totaling ₹16.72 crores from West Bengal tax authorities for April 2020-March 2022 period, covering alleged short payment of output tax with additional interest and penalties.",
            "Sentiment": "negative",
            "PublishDate": 1767883250245,
            "Source": "stocks"
        },
        {
            "Title": "Eternal Limited Block Trade Worth ₹212.13 Crores",
            "Summary": "Eternal Limited executed a significant block trade on NSE involving 74.14 lakh shares at ₹286.10 per share, totaling ₹212.13 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1767847687095,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eternal Limited: ₹39.17cr NSE Block Trade Executed",
            "Summary": "Eternal Limited witnessed a significant block trade on NSE worth ₹39.17 crores involving approximately 1,396,535 shares at ₹280.50 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767759434926,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eternal slides 30% from peak amid profit booking concerns",
            "Summary": "Eternal shares down 32% from lifetime high of ₹368.45 after 520% rally. Stock ended flat in 2025 despite strong Q2 revenue growth of 183% to ₹13,590 crore.",
            "Sentiment": "negative",
            "PublishDate": 1767722105571,
            "Source": "stocks"
        },
        {
            "Title": "Eternal Limited: ₹118.62cr NSE Block Trade Executed",
            "Summary": "Eternal Limited witnessed a significant block trade on NSE worth ₹118.62 crores involving approximately 42.31 lakh shares at ₹280.35 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767680723493,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eternal Limited Sees ₹116.8 Cr NSE Block Trade",
            "Summary": "Eternal Limited witnessed a significant block trade on NSE worth ₹116.8 crores involving approximately 4.16 million shares at ₹281 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767594352908,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eternal Limited Grants 4.29 Crore Stock Options",
            "Summary": "Eternal Limited (formerly Zomato) approved 42,901,017 stock options under three ESOP schemes on January 1, 2026, with exercise price of ₹1 per option for eligible employees.",
            "Sentiment": "neutral",
            "PublishDate": 1767269845336,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jefferies Sets Buy Rating on Eternal with ₹480 Target",
            "Summary": "Jefferies maintains a Buy recommendation on Eternal Limited with a price target of ₹480, indicating positive analyst sentiment for the large-cap stock.",
            "Sentiment": "positive",
            "PublishDate": 1765943594764,
            "Source": "stocks"
        },
        {
            "Title": "Eternal Limited Receives ESG Rating of 77 from NSE",
            "Summary": "Eternal Limited has been assigned an ESG rating of 77 in the 'Leader' category by NSE Sustainability Ratings & Analytics Limited for financial year 2025, reflecting strong environmental, social and governance practices.",
            "Sentiment": "positive",
            "PublishDate": 1765379385301,
            "Source": "stocks"
        },
        {
            "Title": "Eternal Limited Dissolves Two Inactive International Subsidiaries in Sri Lanka and Turkey",
            "Summary": "Eternal Limited announced the dissolution of two non-material subsidiaries - Zomato Media Private Limited in Sri Lanka (to be struck off by November 21, 2025) and Zomato Internet Hizmetleri Ticaret Anonim Sirketi in Turkey (liquidated December 9, 2025). Both subsidiaries had no active business operations and minimal financial contribution, with the dissolution having no impact on the company's turnover or revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1765293717724,
            "Source": "corporate_action"
        },
        {
            "Title": "Eternal Completes Rs 1,514.75 Crore Block Trade on NSE",
            "Summary": "Eternal executed a significant block trade on NSE involving approximately 52.06 million shares at Rs 290.95 per share, totaling Rs 1,514.75 crore. The large-scale transaction represents substantial institutional activity in the company's stock, indicating significant investor interest or portfolio restructuring.",
            "Sentiment": "neutral",
            "PublishDate": 1765165743112,
            "Source": "order&deals"
        },
        {
            "Title": "Eternal Limited Receives GST Demand Order Worth ₹8.29 Crore for April 2022-March 2023 Period",
            "Summary": "Eternal Limited received a GST demand order from Andhra Pradesh authorities totaling ₹16.76 crore, including ₹8.29 crore in GST demand, ₹4.64 crore in interest, and ₹82.95 lakh in penalty for alleged short payment of output tax. The company believes it has a strong case on merits and plans to file an appeal against the order, expecting no financial impact.",
            "Sentiment": "negative",
            "PublishDate": 1764863145127,
            "Source": "stock"
        },
        {
            "Title": "Blinkit Leads India's Quick Commerce Market According to BofA Survey",
            "Summary": "Bank of America survey identifies Blinkit as India's top choice for quick commerce, positioning it ahead of competitors Instamart and Zepto. The survey results highlight Blinkit's market leadership position in the rapidly growing quick commerce sector in India.",
            "Sentiment": "positive",
            "PublishDate": 1764048254848,
            "Source": "sectoral"
        },
        {
            "Title": "Swiggy Updates Stakeholders on Code on Social Security 2020 Review Status",
            "Summary": "Swiggy provided a voluntary disclosure regarding its review of India's Code on Social Security 2020, which aims to extend social security benefits to platform and gig workers through unified labour law reforms. The company stated it does not anticipate any material impact on business sustainability, cost structure, or long-term financial performance from the new framework.",
            "Sentiment": "positive",
            "PublishDate": 1763810878242,
            "Source": "stock"
        }
    ]
}