{
    "Symbol": "ETHOSLTD",
    "ISIN": "INE04TZ01018",
    "News": [
        {
            "Title": "Ethos Reports No Deviation in Rights Issue Fund Usage",
            "Summary": "Ethos Limited confirms no deviation in utilization of Rs 40,990.50 lakh rights issue proceeds for Q3 FY26, with Rs 30,011.53 lakh utilized to date under CRISIL monitoring.",
            "Sentiment": "neutral",
            "PublishDate": 1770392090078,
            "Source": "stocks"
        },
        {
            "Title": "Ethos Limited Reports Full Utilization of QIP Proceeds",
            "Summary": "Ethos Limited confirms complete utilization of Rs 16,959.64 lakhs raised through QIP in November 2023, with no deviations from stated objectives for Q3 FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1770372135573,
            "Source": "stocks"
        },
        {
            "Title": "Ethos Reports 3% Growth in Q3 Net Profit to ₹306M",
            "Summary": "Ethos Limited posted a net profit of ₹306 million in Q3, marking a 3.03% year-on-year increase from ₹297 million in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770368422603,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ethos Board Meet on Feb 6 for Q3FY26 Results",
            "Summary": "Ethos Limited has scheduled a board meeting on February 6, 2026, to consider and approve unaudited financial results for Q3FY26. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769693667777,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ethos Opens New Watch Boutique in Chandigarh",
            "Summary": "Ethos Limited inaugurated its 89th boutique in Chandigarh at SCO 4-5, Sector 8C, strengthening its luxury retail presence across India and making exclusive watch brands more accessible to customers.",
            "Sentiment": "positive",
            "PublishDate": 1768825728033,
            "Source": "stocks"
        },
        {
            "Title": "Ethos Opens 88th Watch Boutique in Ranchi",
            "Summary": "Luxury watch retailer Ethos Limited expands its retail footprint with a new boutique in Ranchi, Jharkhand, marking its 88th store location across India and strengthening its presence in eastern markets.",
            "Sentiment": "positive",
            "PublishDate": 1767677453584,
            "Source": "stocks"
        },
        {
            "Title": "Ethos Limited Opens New TUDOR Exclusive Brand Boutique in Gurugram",
            "Summary": "Ethos Limited inaugurated a new exclusive TUDOR brand boutique in Gurugram, expanding its luxury watch retail presence in one of India's prominent luxury markets. The company now operates 87 boutiques across India, strengthening its luxury brand portfolio and bringing coveted international watch brands to discerning Indian customers.",
            "Sentiment": "positive",
            "PublishDate": 1765193532337,
            "Source": "stock"
        },
        {
            "Title": "Ethos Limited Reports 29.5% Revenue Growth to Rs 738.8 Crore in H1 FY26",
            "Summary": "Ethos Limited reported revenue growth of 29.5% to Rs 738.8 crore in H1 FY26 compared to Rs 570.4 crore in H1 FY25. The company opened 16 new boutiques during April-September 2025, expanding from 73 boutiques to 86 boutiques across 26 cities. EBITDA increased 7.8% to Rs 78.3 crore with margins at 10.4%. Same-store sales growth (SSSG) stood at 16.5% versus 15.5% in H1 FY25. The company faced margin pressure due to INR depreciation against CHF, with the exchange rate moving from 96.98 to 111.25, resulting in an estimated forex loss of Rs 10.7 crore. Average selling price per watch increased to Rs 2.18 lakh. The company added 4 new exclusive brands and opened its first Messika boutique and second Rimowa boutique. Billing from second movement watches grew 25% year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1762600474372,
            "Source": "earnings"
        },
        {
            "Title": "Ethos Limited Reports No Deviations in Rights Issue Fund Utilization for Quarter Ended September 30, 2025",
            "Summary": "Ethos Limited informed stock exchanges that there were no deviations or variations in the utilization of proceeds from its Rights Issue for the quarter ended September 30, 2025. The company raised funds for three main purposes: funding working capital requirements (Rs. 31,000 lacs allocated, Rs. 20,389.52 lacs utilized for vendor and salary payments), general corporate purposes (Rs. 9,611.48 lacs allocated, no proceeds utilized during the quarter), and issue-related expenses (Rs. 379.02 lacs allocated, Rs. 10.53 lacs utilized for intermediary fees, advertisement, marketing, and regulatory expenses). All fund utilization aligned with the original objects mentioned in the placement document filed with NSE, BSE, and the Registrar of Companies, Himachal Pradesh.",
            "Sentiment": "neutral",
            "PublishDate": 1762598719394,
            "Source": "corporate_action"
        },
        {
            "Title": "Ethos Limited Reports No Deviations in IPO Fund Utilization for Quarter Ended September 30, 2025",
            "Summary": "Ethos Limited informed stock exchanges that there were no deviations in the utilization of Initial Public Offering proceeds for the quarter ended September 30, 2025. The company had raised Rs. 40,226 lakh through its IPO, comprising fresh issuance of Rs. 37,500 lakh and offer for sale of Rs. 2,726 lakh. The funds were allocated across five objectives: repayment of borrowings (Rs. 2,989.09 lakh), working capital requirements (Rs. 23,496.22 lakh), establishment of new stores and renovation (Rs. 3,327.28 lakh), ERP software upgradation (Rs. 198.01 lakh), and general corporate purposes (Rs. 3,609.87 lakh). Most fund categories have been fully utilized, with the company having previously faced delays in store establishment due to mall operations not commencing and GRAP restrictions in Delhi NCR. The timeline for utilizing remaining funds under store establishment has been extended to June 30, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1762598345125,
            "Source": "corporate_action"
        },
        {
            "Title": "Ethos Limited Reports Strong Q2 Results with 32% Revenue Growth and Completes Rights Issue",
            "Summary": "Ethos Limited announced quarterly results with revenue from operations reaching Rs 39,249.98 lakhs, representing a 32.1% increase compared to Rs 29,713.32 lakhs in the same period last year. Net profit for the quarter stood at Rs 2,320.20 lakhs versus Rs 2,134.42 lakhs in the previous year. The company completed a Rights Issue of 2,77,250 equity shares at Rs 1,800 per share, raising Rs 40,990.50 lakhs. The paid-up equity share capital increased from Rs 2,448.04 lakhs to Rs 2,675.77 lakhs. For the half-year period, revenue grew to Rs 73,881.78 lakhs from Rs 57,038.14 lakhs, with net profit rising to Rs 4,350.53 lakhs from Rs 4,430.74 lakhs. The company incorporated two new subsidiaries: Ficus Trading LLC in Dubai and Micron Watch Services Private Limited in India. Ethos Lifestyle Private Limited's shareholding was diluted from 100% to 75.05% following preferential issues totaling Rs 17,950 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1762595829771,
            "Source": "earnings"
        },
        {
            "Title": "Ethos Opens New Boutique in Pitampura, Expands Network to 86 Stores Across India",
            "Summary": "Ethos has launched a new boutique in Pitampura, New Delhi, bringing its total store count to 86 boutiques across India. The expansion is aimed at enhancing the company's luxury brand offerings.",
            "Sentiment": "positive",
            "PublishDate": 1761556273139,
            "Source": "stock"
        },
        {
            "Title": "Ethos Limited Opens Second RIMOWA Boutique in India at DLF Emporio, New Delhi",
            "Summary": "Ethos Limited opened a new RIMOWA boutique at DLF Emporio, Vasant Kunj, New Delhi through its wholly owned subsidiary Ethos Lifestyle Private Limited. This represents RIMOWA's second official boutique in India through the Ethos Group. The opening expands Ethos Limited's retail footprint from 73 boutiques as of March 31, 2025, to 85 boutiques across India. The company stated this launch strengthens its luxury brand portfolio and consolidates its presence in India's luxury retail market, aligning with its strategic vision of making exclusive brands more accessible to customers in India.",
            "Sentiment": "positive",
            "PublishDate": 1759493173547,
            "Source": "stock"
        },
        {
            "Title": "Ethos Limited Opens New Luxury Boutique in Mumbai, Expands Retail Network to 84 Stores",
            "Summary": "Ethos Limited inaugurated a new exclusive Ethos Haute Horology Boutique at Jio World Plaza in Mumbai's Bandra East. The opening represents a strategic expansion of the company's luxury brand portfolio and strengthens its presence in India's luxury retail market. The company's retail network has grown from 73 boutiques as of March 31st, 2025, to 84 boutiques across India with this new Mumbai location. Ethos stated the expansion aligns with its strategic vision of making exclusive luxury brands more accessible to customers in India while delivering premium luxury experiences.",
            "Sentiment": "positive",
            "PublishDate": 1759487498915,
            "Source": "stock"
        },
        {
            "Title": "Ethos Limited Opens New Luxury Watch Boutique at Select CityWalk, New Delhi",
            "Summary": "Ethos Limited has inaugurated a new exclusive Ethos Watch Boutique at Select CityWalk, Saket, New Delhi. The boutique is located on the first floor at Unit no. F69A, Nexus Select Citywalk. The company describes this launch as a significant milestone in strengthening its luxury brand portfolio and consolidating its presence in India's luxury retail market. Ethos states the boutique aligns with its strategic vision of making exclusive brands more accessible to customers in India while delivering luxury experiences. The company remains committed to expanding its footprint in the premium and luxury watch segment.",
            "Sentiment": "positive",
            "PublishDate": 1757938109526,
            "Source": "stock"
        },
        {
            "Title": "Ethos Opens New Jacob & Co. Boutique at Mumbai's Jio World Plaza",
            "Summary": "Ethos has opened a new boutique for luxury watch brand Jacob & Co. at Jio World Plaza in Mumbai. This represents an expansion of the company's retail presence in the luxury watch segment.",
            "Sentiment": "positive",
            "PublishDate": 1756459625583,
            "Source": "stock"
        },
        {
            "Title": "Ethos Limited Incorporates New Subsidiary Micron Watch Services for Service Center Expansion",
            "Summary": "Ethos Limited incorporated a new subsidiary company named Micron Watch Services Private Limited on August 22, 2025, with its registered office in Gurgaon, Haryana. The subsidiary operates in the watch service and repair industry and aims to set up watch service centers in select Indian cities. Ethos acquired a 50.1% initial shareholding in the subsidiary for Rs. 5,01,000, purchasing 50,100 equity shares at Rs. 10 each through cash consideration. Yashovardhan Saboo will hold 100 equity shares as a nominee shareholder of Ethos Limited. The acquisition is classified as a related party transaction since Micron Watch Services is now a subsidiary of Ethos.",
            "Sentiment": "positive",
            "PublishDate": 1755954386191,
            "Source": "corporate_action"
        },
        {
            "Title": "Ethos Limited Reports 25.9% Revenue Growth But 11.6% Decline in Net Profit for Q1 FY2026",
            "Summary": "Ethos Limited, a luxury watch retailer in India, reported total income from operations of Rs 352.04 crore, marking a 25.9% year-on-year increase for Q1 FY2026. However, net profit declined 11.6% to Rs 20.30 crore compared to the same period last year. The company's earnings per share dropped to Rs 8.29 from Rs 9.38 in Q1 FY2025. Profit before tax decreased marginally by 1.1% to Rs 27.40 crore. The net profit margin contracted to 5.8% from 8.2% in the previous year's quarter. EBITDA margin was impacted by higher operating expenses despite the strong revenue performance. The company maintained its equity share capital at Rs 24.48 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1755600720156,
            "Source": "earnings"
        },
        {
            "Title": "Ethos Limited Reports IPO Proceeds Utilization for Quarter Ended June 30, 2025",
            "Summary": "Ethos Limited submitted its monitoring agency report for IPO proceeds utilization for the quarter ended June 30, 2025, prepared by CRISIL Ratings Limited. The company raised Rs 33,968.95 lakh in net proceeds from its IPO conducted in May 2022. During the quarter, Rs 254.87 lakh was utilized for establishing new stores, leaving Rs 724.85 lakh unutilized. The company has fully utilized proceeds for debt repayment (Rs 2,989.09 lakh), working capital (Rs 23,496.22 lakh), ERP upgradation (Rs 198.01 lakh), and general corporate purposes (Rs 3,958.35 lakh). The remaining unutilized amount of Rs 724.85 lakh is primarily from the store establishment objective and is deployed in fixed deposits with SBI earning returns between 3.50% to 5.25%. Shareholders previously approved revised locations and extended timelines for utilizing remaining proceeds under objectives 3 and 4. The monitoring agency reported no deviations from disclosed objects and confirmed all utilization aligns with the offer document.",
            "Sentiment": "neutral",
            "PublishDate": 1755184137242,
            "Source": "corporate_action"
        },
        {
            "Title": "Ethos Limited Reports No Deviations in QIP Fund Utilization for Quarter Ended June 30, 2025",
            "Summary": "Ethos Limited confirmed no deviations or variations in the utilization of proceeds from its Qualified Institutional Placement for the quarter ended June 30, 2025. The company raised Rs 1,749.98 crores through the issue of 11,31,210 equity shares on November 3, 2023, with net proceeds of Rs 1,695.96 crores. The funds were allocated for working capital requirements (Rs 1,312.50 crores) and general corporate purposes (Rs 383.46 crores). During the quarter, Rs 1,312.50 crores was utilized for working capital payments and Rs 33.37 crores for general corporate purposes, totaling Rs 1,345.87 crores utilized. The monitoring agency CRISIL Ratings Limited oversees the fund utilization. Both the Audit Committee and auditors provided no comments on the fund usage.",
            "Sentiment": "neutral",
            "PublishDate": 1755177119840,
            "Source": "stock"
        },
        {
            "Title": "Ethos Limited Reports 26.7% Revenue Growth to ₹346.3 Crore in Q1FY26, Opens 'City of Time' Luxury Destination",
            "Summary": "Ethos Limited achieved revenue growth of 26.7% to ₹346.3 crore in Q1FY26 compared to ₹273.2 crore in Q1FY25. EBITDA increased 4.6% to ₹52.0 crore, though EBITDA margin declined to 14.8% from 17.8% in the previous year. PAT decreased 16.2% to ₹19.1 crore from ₹22.8 crore. The company faced adverse currency impact of ₹5.7 crore due to CHF/INR volatility, comprising ₹3.8 crore from gross margin erosion and ₹1.9 crore notional exchange loss. Excluding this impact, EBITDA would have been ₹57.6 crore, reflecting 16.0% year-on-year growth. The company opened 8 new boutiques during the quarter and launched the 'City of Time' in Gurugram - a 22,000 square feet luxury destination featuring 5 exclusive brand boutiques and 2 multi-brand boutiques. Ethos also launched India's first exclusive Messika Paris boutique through subsidiary Ethos Lifestyle. Average selling price per watch stood at ₹2.13 lakh, while same-store sales growth improved to 17.6% from 12.3% in Q1FY25. The company added 3 new watch brands and opened 11 watch boutiques plus 1 lifestyle boutique during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1755166507611,
            "Source": "earnings"
        },
        {
            "Title": "Ethos Limited Approves Quarterly Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Ethos Limited's Board of Directors approved the unaudited financial results for the quarter ended June 30, 2025, during a meeting held on August 14, 2025. The results include both standalone and consolidated financials, accompanied by a Limited Review Report. The board meeting lasted from 12:00 PM to 14:15 PM. The financial results will be published in newspapers as required under listing regulations and made available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1755163290703,
            "Source": "earnings"
        },
        {
            "Title": "ETHOS Reports Mixed Q1 Results with Revenue Growth but Lower Profit Margins",
            "Summary": "ETHOS reported quarterly revenue of 3.4 billion rupees, up from 2.7 billion rupees year-over-year. Net profit declined to 203 million rupees from 230 million rupees in the same period last year. EBITDA increased to 464 million rupees from 433 million rupees year-over-year, though EBITDA margin compressed to 13.4% from 15.84% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1755162030998,
            "Source": "earnings"
        },
        {
            "Title": "Ethos Limited's Stake in Subsidiary Diluted to 75.05% Following ₹179.50 Crore Fundraise",
            "Summary": "Ethos Limited's shareholding in its subsidiary Ethos Lifestyle Private Limited has been diluted from 95.00% to 75.05% following a preferential share issue by the subsidiary that raised ₹179.50 crores. The subsidiary, incorporated on February 2, 2024, contributed nil turnover and ₹5.89 crore net worth (0.60%) to Ethos Limited during FY 2024-25. The shares were allotted to identified investors who are not related to Ethos Limited's promoter group, based on an independent valuation report. Despite the dilution, Ethos Lifestyle Private Limited continues to remain a subsidiary of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1755074570983,
            "Source": "corporate_action"
        },
        {
            "Title": "Ethos Acquires Full Ownership of Ficus Trading LLC",
            "Summary": "Ethos has acquired a 100% stake in its subsidiary Ficus Trading LLC. This acquisition is aimed at expanding the company's presence in the Middle East market.",
            "Sentiment": "positive",
            "PublishDate": 1750118859000,
            "Source": "default"
        },
        {
            "Title": "ETHOS Acquires Full Ownership of Ficus Trading LLC",
            "Summary": "ETHOS has acquired complete ownership of Ficus Trading LLC, a move aimed at strengthening its position in the Middle East market.",
            "Sentiment": "positive",
            "PublishDate": 1750088899000,
            "Source": "default"
        },
        {
            "Title": "Ethos Receives Approval for Rights Issue to Raise 4.10 Billion Rupees",
            "Summary": "Ethos has obtained approval for a rights issue with the aim of raising up to 4.10 billion Rupees. The company is planning to offer new shares to existing shareholders to generate additional capital.",
            "Sentiment": "positive",
            "PublishDate": 1748951282000,
            "Source": "default"
        },
        {
            "Title": "Ethos Launches 'City of Time, Gurugram' with Luxury Watch Boutiques",
            "Summary": "Ethos has launched 'City of Time, Gurugram', a new retail concept featuring five exclusive brand boutiques and two multibrand boutiques. This development expands Ethos' presence in the luxury watch market, offering a diverse range of high-end timepieces to customers in Gurugram.",
            "Sentiment": "positive",
            "PublishDate": 1747181817000,
            "Source": "default"
        },
        {
            "Title": "Ethos Launches 'City of Time, Gurugram' with Multiple Luxury Watch Boutiques",
            "Summary": "Ethos has announced the launch of 'City of Time, Gurugram', a new retail concept featuring five exclusive brand boutiques and two multi-brand boutiques. This development represents a significant expansion of Ethos's luxury watch retail presence in the Gurugram market.",
            "Sentiment": "positive",
            "PublishDate": 1747146961000,
            "Source": "default"
        },
        {
            "Title": "Ethos Ltd: Q4 Revenue and EBITDA Grow, Profit Growth Modest",
            "Summary": "Ethos Ltd reported Q4 FY25 results with revenue up 23.3% YoY to ₹311.31 crore and EBITDA up 32.3% to ₹47.59 crore. Net profit grew 8.1% to ₹22.74 crore, impacted by higher depreciation. Operating margin improved to 15.3%. Post-results, shares fell 3.93% on BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1746438999000,
            "Source": "earnings"
        },
        {
            "Title": "Ethos Reports Strong Q4 Financial Performance",
            "Summary": "Ethos has announced its Q4 financial results, showing significant year-over-year growth. The company's revenue increased from 2.5 billion rupees to 3.11 billion rupees. EBITDA also saw a substantial rise from 355 million rupees to 489 million rupees. The EBITDA margin improved from 14.07% to 15.70%.",
            "Sentiment": "positive",
            "PublishDate": 1746433607000,
            "Source": "result"
        },
        {
            "Title": "Ethos Q4 Net Profit Rises to 242M Rupees",
            "Summary": "Ethos reported a net profit of 242 million rupees for the fourth quarter, up from 190 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1746433515000,
            "Source": "result"
        },
        {
            "Title": "Ethos Raises $6 Million for Model Risk Management Modernization",
            "Summary": "Ethos, a financial technology company, has secured $6 million in funding to modernize model risk management solutions for banks and fintech companies. The investment aims to improve risk assessment and management practices in the financial sector through advanced technology.",
            "Sentiment": "positive",
            "PublishDate": 1740702200000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ethos Raises $6 Million for Model Risk Management Modernization",
            "Summary": "Ethos, a financial technology company, has secured $6 million in funding to modernize model risk management solutions for banks and fintech companies. This investment aims to improve risk assessment and management practices in the financial sector.",
            "Sentiment": "positive",
            "PublishDate": 1740662363000,
            "Source": "corporate_action"
        },
        {
            "Title": "ETHOS Reports Q3 EBITDA Growth",
            "Summary": "ETHOS has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 551 million rupees, up from 443 million rupees in the same quarter of the previous year. However, the EBITDA margin decreased slightly to 14.89% from 15.74% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739523132000,
            "Source": "earnings"
        },
        {
            "Title": "Ethos Limited Reports Increased Q3 Net Profit",
            "Summary": "Ethos Limited has reported a net profit of 297 million rupees for the third quarter, showing an increase from 258 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739522974000,
            "Source": "earnings"
        },
        {
            "Title": "ETHOS Reports Q2 EBITDA Growth",
            "Summary": "ETHOS has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 417 million rupees, up from 368 million rupees in the same quarter last year. However, the EBITDA margin decreased to 14.04% from 15.71% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731054402000,
            "Source": "result"
        },
        {
            "Title": "ETHOS Reports Q2 Revenue Growth",
            "Summary": "ETHOS has announced its Q2 revenue figures, showing an increase to 2.97 billion rupees from 2.34 billion rupees in the same quarter last year. This represents a year-over-year growth in revenue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1731054388000,
            "Source": "result"
        },
        {
            "Title": "ETHOS Reports Q2 Net Profit Increase",
            "Summary": "ETHOS Limited has reported a net profit of 213 million rupees for the second quarter, compared to 184 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731054336000,
            "Source": "result"
        }
    ]
}