{
    "Symbol": "EUREKAFORB",
    "ISIN": "INE0KCE01017",
    "News": [
        {
            "Title": "Eureka Forbes Co-MD Outlines Profit Growth Vision",
            "Summary": "Eureka Forbes Co-MD announces company's readiness to achieve long-term steady and strong profit growth objectives, signaling strategic focus on sustainable financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1770189689521,
            "Source": "stocks"
        },
        {
            "Title": "Eureka Forbes Board Meet Set for Feb 4 for Q3 Results",
            "Summary": "Eureka Forbes Limited has scheduled its board meeting for February 04, 2026, to consider and approve Q3FY26 unaudited standalone and consolidated financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769796034000,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eureka Forbes Ordered to Pay 10% of ₹162.2 Cr Tax",
            "Summary": "Court directs Eureka Forbes to settle 10% of its ₹162.20 crore tax liability as part of ongoing tax dispute resolution proceedings.",
            "Sentiment": "negative",
            "PublishDate": 1767885727444,
            "Source": "stocks"
        },
        {
            "Title": "Eureka Forbes Gets Relief in ₹16.22 Cr GST Case",
            "Summary": "Madhya Pradesh High Court orders no coercive action against Eureka Forbes subject to depositing 10% of ₹16.22 crore GST demand in ongoing tax dispute case.",
            "Sentiment": "positive",
            "PublishDate": 1767885703327,
            "Source": "stocks"
        },
        {
            "Title": "Eureka Forbes Gets Credit Rating Outlook Upgrade",
            "Summary": "CRISIL Ratings Limited has revised Eureka Forbes Limited's outlook to Positive from Stable while re-affirming the Crisil AA- ratings on Corporate Credit Rating, as announced on December 18, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766065603343,
            "Source": "stocks"
        },
        {
            "Title": "Eureka Forbes Reports Strong Q2 FY26 Results with 14.9% Revenue Growth and Record EBITDA",
            "Summary": "Eureka Forbes delivered robust quarterly results with revenue growing 14.9% to Rs. 773 crores, driven by high-teens growth in both products and services business, marking the first time the company added over Rs. 100 crores revenue year-on-year in a quarter. The company achieved record adjusted EBITDA of Rs. 100 crores with lifetime high margin of 13.1%, expanding 162 basis points despite 21% increase in advertising spends, while profit after tax grew 32% to Rs. 61.6 crores.",
            "Sentiment": "positive",
            "PublishDate": 1763640409645,
            "Source": "stock"
        },
        {
            "Title": "Eureka Forbes Shares Drop Despite Record Quarterly Performance",
            "Summary": "Eureka Forbes shares declined 0.58% to ₹574.90 despite reporting strongest-ever quarterly results with 14.9% revenue growth to ₹773.4 crore and adjusted EBITDA crossing ₹100 crore for the first time. The health and hygiene company achieved eighth successive quarter of double-digit growth and 32% profit growth to ₹61.6 crore, but faced selling pressure with profit-booking weighing on the stock.",
            "Sentiment": "positive",
            "PublishDate": 1763103760332,
            "Source": "earnings"
        },
        {
            "Title": "Eureka Forbes Reports 15% Revenue Growth in Q2",
            "Summary": "Eureka Forbes reported quarterly revenue of Rs 7.7 billion compared to Rs 6.7 billion in the same period last year, representing year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1763022155733,
            "Source": "earnings"
        },
        {
            "Title": "Eureka Forbes Secures New Trading Partner for Forbes Brand in GCC Region",
            "Summary": "Eureka Forbes has appointed a new partner to handle trading operations for its Forbes brand in the Gulf Cooperation Council (GCC) region. The partnership aims to expand the company's presence in the Middle Eastern markets through this new trading arrangement.",
            "Sentiment": "positive",
            "PublishDate": 1759303953832,
            "Source": "order&deals"
        },
        {
            "Title": "Eureka Forbes Reports 9.9% Revenue Growth in Q1 FY26 Despite Challenging Market Conditions",
            "Summary": "Eureka Forbes Limited reported revenue of Rs. 607.7 crores for Q1 FY26, representing 9.9% year-on-year growth. The company achieved double-digit volume growth in both water purifiers (EWPs) and vacuum cleaners (VCs), with robotics segment growing 52%. Managing Director Pratik Pota highlighted challenging market conditions due to soft consumer demand and cooling product slowdown in April-May. The service business showed significant improvement with double-digit growth in fresh service bookings driven by increased AMC count and higher average selling prices. Profit after tax grew 24.1% to Rs. 38.5 crores. Adjusted EBITDA margins came in at 11% after accounting for higher service charges and growth investments. The company has an installed base of 14 million water purifier customers and launched over 40 products with two-year filter life. CFO Gaurav Khandelwal indicated service booking growth momentum is expected to sustain, with revenue impact visible from Q4 onwards.",
            "Sentiment": "positive",
            "PublishDate": 1755621982769,
            "Source": "earnings"
        },
        {
            "Title": "Eureka Forbes Reports Strong Q1 Performance with Revenue Growth to 6.1B Rupees",
            "Summary": "Eureka Forbes delivered solid quarterly results with revenue increasing to 6.1 billion rupees from 5.5 billion rupees year-over-year. The company's consolidated net profit rose to 387 million rupees compared to 321 million rupees in the same period last year. EBITDA grew to 615 million rupees from 563 million rupees year-over-year, though the EBITDA margin slightly declined to 10.12% from 10.17% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754902681482,
            "Source": "earnings"
        },
        {
            "Title": "Eureka Forbes: Q4 Profit Doubles, Revenue Up 10%",
            "Summary": "Eureka Forbes reported a twofold increase in Q4 FY25 net profit to Rs 49.48 crore, with revenue up 10.67% to Rs 612.65 crore. FY25 profit rose 72% to Rs 164.41 crore. The company achieved its sixth consecutive quarter of double-digit growth, with EBITDA margins reaching 13%.",
            "Sentiment": "positive",
            "PublishDate": 1747401854000,
            "Source": "earnings"
        },
        {
            "Title": "Eureka Forbes Reports Improved Q4 Financial Results",
            "Summary": "Eureka Forbes has announced its Q4 financial results. The company's revenue increased to 6.1 billion rupees from 5.54 billion rupees year-over-year. EBITDA rose to 771 million rupees from 533 million rupees, with the EBITDA margin improving to 12.58% from 9.63%. The consolidated net profit for Q4 reached 495 million rupees, up from 214 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747374575000,
            "Source": "result"
        },
        {
            "Title": "Eureka Forbes: Q3 Profit Surges 52.5% to Rs 35 Crore",
            "Summary": "Eureka Forbes reported a 52.5% increase in Q3 consolidated net profit to Rs 35.03 crore. Revenue from operations grew 10.8% to Rs 597.74 crore. Total income rose 11% to Rs 602.17 crore.",
            "Sentiment": "positive",
            "PublishDate": 1739180728000,
            "Source": "earnings"
        },
        {
            "Title": "Eureka Forbes Reports Q3 Revenue Increase",
            "Summary": "Eureka Forbes announced its third-quarter revenue of 5.9 billion rupees, showing an increase from 5.4 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1739176986000,
            "Source": "earnings"
        },
        {
            "Title": "Eureka Forbes Reports Improved Q3 EBITDA and Margin",
            "Summary": "Eureka Forbes has announced its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 591 million rupees, up from 427 million rupees in the same period last year. Additionally, the EBITDA margin improved to 9.89% from 7.92% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739176985000,
            "Source": "earnings"
        },
        {
            "Title": "Eureka Forbes' Application for Rectification Rejected",
            "Summary": "Eureka Forbes has announced that an order has been received rejecting their application for rectification. This suggests that the company had submitted a request for some form of correction or adjustment, which has been denied by the relevant authority.",
            "Sentiment": "negative",
            "PublishDate": 1736727661000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Eureka Forbes Reports Strong Q2 Financial Performance",
            "Summary": "Eureka Forbes has announced its Q2 financial results, showing significant improvement in key metrics. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 731 million rupees, up from 521 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 10.86% from 8.81% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730968384000,
            "Source": "result"
        },
        {
            "Title": "Eureka Forbes Reports Q2 Revenue Growth",
            "Summary": "Eureka Forbes, a consumer goods company, has reported a revenue of 6.7 billion rupees for the second quarter, compared to 5.9 billion rupees in the same period last year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730968300000,
            "Source": "result"
        },
        {
            "Title": "Eureka Forbes Reports Significant Profit Increase in Q2",
            "Summary": "Eureka Forbes has reported a consolidated net profit of 477 million rupees for the second quarter, compared to 258 million rupees in the same period last year, representing a substantial year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730968277000,
            "Source": "result"
        }
    ]
}