{
    "Symbol": "EUROBOND",
    "ISIN": "INE505V01016",
    "News": [
        {
            "Title": "Euro Panel Products Approves QAR 500,000 Loan to Subsidiary",
            "Summary": "Euro Panel Products Limited board approves unsecured loan of QAR 500,000 to its wholly owned Qatar subsidiary for working capital and business operations at 8.5% interest rate.",
            "Sentiment": "neutral",
            "PublishDate": 1767709334839,
            "Source": "co_actions_results"
        },
        {
            "Title": "Euro Panel Products Launches EURODUAL Engineered Solid Panels, Becomes First Indian Brand in Category",
            "Summary": "Euro Panel Products Limited launched EURODUAL, a pre-coated engineered solid panel with dual-finish technology, making it one of the first Indian companies to produce engineered solid panels that laminate two solid sheets together. The product features marine-grade aluminum alloys, customized color coating on both sides, and comes with 15-20 years warranty, targeting facade and cladding applications in domestic and international markets.",
            "Sentiment": "positive",
            "PublishDate": 1765005849397,
            "Source": "stock"
        },
        {
            "Title": "Euro Panel Products Reports Strong Q2 Performance with 47% Jump in Net Profit",
            "Summary": "Euro Panel Products delivered robust quarterly results with net profit rising to 66 million rupees from 45 million rupees in the same period last year. Revenue grew to 1.3 billion rupees compared to 994 million rupees year-over-year. The company's EBITDA increased to 149 million rupees from 94 million rupees, while EBITDA margin improved to 11.45% from 9.4% in the corresponding period.",
            "Sentiment": "positive",
            "PublishDate": 1762847730551,
            "Source": "earnings"
        },
        {
            "Title": "Euro Panel Products Launches Eurobond Europe to Enter European Market",
            "Summary": "Euro Panel Products Ltd., parent company of Eurobond, announced its entry into the European market through the launch of Eurobond Europe as the brand's exclusive distributor in the region. Established in 2002, Eurobond is a leading manufacturer of Aluminium Composite Panels (ACP) and facade cladding signage panels, exporting to more than 20 countries with an installed annual production capacity of 10 million sq.mt. at its Gujarat facility. The company operates a subsidiary in Qatar and has a global network spanning 20+ countries. Eurobond Europe will be led by CEO Sander Dekker alongside business partners Sorub Gaind and Sander de Roo. The company offers a comprehensive product portfolio including aluminium composite panels, fire-retardant panels, solid aluminium panels, zinc composite panels, louvers, fins, and advanced cladding panels. Euro Panel Products Ltd. is the first listed ACP company on BSE and NSE, and was recognized as a One-Star Export House in 2021.",
            "Sentiment": "positive",
            "PublishDate": 1762290198885,
            "Source": "stock"
        },
        {
            "Title": "Euro Panel Products Limited Board Approves Cost Audit Report for FY 2024-25",
            "Summary": "Euro Panel Products Limited's Board of Directors approved the Cost Audit Report and its annexures for Financial Year 2024-25 during a meeting held on September 26, 2025. The report was authenticated by the company's Cost Auditor M/s Ritesh Jayswal & Associates in accordance with the Cost Audit Report Rules. The board meeting lasted 15 minutes, commencing at 03:00 a.m. and concluding at 03:15 p.m. The company trades on NSE under symbol EUROBOND and on BSE with scrip code 544461.",
            "Sentiment": "neutral",
            "PublishDate": 1758882562560,
            "Source": "corporate_action"
        },
        {
            "Title": "Euro Panel Products Approves Key Appointments at Annual General Meeting",
            "Summary": "Euro Panel Products Limited shareholders approved two key appointments at their 12th Annual General Meeting held on September 15, 2025. Mrs. Krishna Rajesh Shah was appointed as Executive Director for a 5-year term. She is the wife of Managing Director Rajesh Nanalal Shah and mother of Whole Time Director and CFO Divyam Rajesh Shah, bringing 16 years of directorial experience from Divya Ply Agency Private Limited. Additionally, Ms. Kala Agarwal was appointed as Secretarial Auditor for 5 consecutive financial years from FY 2025-26 to FY 2029-30. Both appointments were initially made at a Board Meeting on May 24, 2025, and received shareholder approval at the AGM.",
            "Sentiment": "positive",
            "PublishDate": 1758188475120,
            "Source": "corporate_governance"
        },
        {
            "Title": "Euro Panel Products Appoints Krishna Rajesh Shah as Executive Director and Kala Agarwal as Secretarial Auditor",
            "Summary": "Euro Panel Products Limited shareholders approved two key appointments at their 12th Annual General Meeting held on September 15, 2025. Krishna Rajesh Shah was appointed as Executive Director for a 5-year term, having previously served as Additional Executive Director since May 24, 2025. Shah has been associated with the company for over 30 years, handling operations and accounts since incorporation. She is the wife of Managing Director Rajesh Nanalal Shah and mother of Whole Time Director and CFO Divyam Rajesh Shah. Additionally, Kala Agarwal was appointed as Secretarial Auditor for 5 consecutive financial years from FY 2025-26 to FY 2029-30. Agarwal is a practicing Company Secretary registered with ICSI (registration no. 5356) and has expertise in corporate laws, securities laws, and mergers and acquisitions.",
            "Sentiment": "positive",
            "PublishDate": 1757948098877,
            "Source": "corporate_governance"
        },
        {
            "Title": "Euro Panel Products Reports Q1 FY26 Results, Approves Property Charges and Borrowing Power Increase",
            "Summary": "Euro Panel Products Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of ₹1,176.06 crores, total income of ₹1,177.58 crores, and profit for the period of ₹57.23 crores. Basic and diluted earnings per share stood at ₹2.34. The Board also approved creation of charges on company properties and increase in borrowing powers, both subject to shareholder approval at the upcoming AGM. The company transitioned from NSE SME Emerge platform to main boards of BSE and NSE, with shares listed on August 1, 2025. The trading window for insiders, closed on July 1, 2025, will reopen on August 16, 2025. Euro Panel Products operates in the aluminium composite panels segment.",
            "Sentiment": "positive",
            "PublishDate": 1755158861021,
            "Source": "earnings"
        },
        {
            "Title": "Euro Panel Products Reports 78% Jump in Q1 Net Profit to 57M Rupees",
            "Summary": "Euro Panel Products reported a net profit of 57 million rupees for Q1, representing a significant increase from 32 million rupees in the same period last year. The company's revenue also grew to 1.05 billion rupees compared to 1 billion rupees year-over-year, marking a 5% increase in top-line performance.",
            "Sentiment": "positive",
            "PublishDate": 1755157648404,
            "Source": "earnings"
        },
        {
            "Title": "Euro Panel Products Limited Becomes First Indian ACP Company to List on BSE and NSE Mainboard",
            "Summary": "Euro Panel Products Limited has migrated from the SME board to the mainboard of both BSE and NSE, becoming the first Indian Aluminium Composite Panel (ACP) manufacturing company to achieve this milestone. The company, which operates under the EUROBOND brand, was initially listed on NSE Emerge in December 2021 with an IPO price of INR 70 and has delivered over 178% returns to investors. The company reported a 26% increase in PAT to INR 18 crore in FY 24-25, with product sales reaching INR 423 crore, representing a 7% increase from the previous fiscal year. Euro Panel Products is executing major expansion plans including installation of a second coating line and upgrading production capacity from 25,000 to 27,000 square meters daily. The company is also establishing a 2.2 MW solar power project expected to offset nearly 50% of factory energy consumption. With operations across 20 countries and exclusive collaboration with RHEINZINK, the Mumbai-headquartered company continues to expand its global presence in the facade materials industry.",
            "Sentiment": "positive",
            "PublishDate": 1754048008225,
            "Source": "stock"
        }
    ]
}