{
    "Symbol": "EUROPRATIK",
    "ISIN": "INE198501012",
    "News": [
        {
            "Title": "Euro Pratik Q3FY26 Results: Revenue Drops to ₹5,178 Lakh",
            "Summary": "Euro Pratik Sales Limited reported Q3FY26 standalone revenue of ₹5,177.93 lakh, down from ₹5,383.90 lakh YoY. Net profit reached ₹1,540.15 lakh vs ₹1,454.56 lakh in Q3FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1770456420855,
            "Source": "co_actions_results"
        },
        {
            "Title": "Euro Pratik Sales Appoints Independent Director",
            "Summary": "Euro Pratik Sales Limited successfully passes special resolution appointing Mrs. Priya Abhishek Jain as Independent Director for 5 years through postal ballot with 99.9979% approval from shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1769775841756,
            "Source": "stocks"
        },
        {
            "Title": "Euro Pratik Sales postal ballot e-voting begins Dec 31",
            "Summary": "Euro Pratik Sales Limited announces postal ballot for special business with remote e-voting period from December 31, 2025 to January 29, 2026. Results to be declared on January 30, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767176006291,
            "Source": "stocks"
        },
        {
            "Title": "Euro Pratik Sales Director Resigns Due to Personal Reasons",
            "Summary": "Euro Pratik Sales Limited announces resignation of Independent Director Mrs. Dhruti Apurva Bhagalia effective December 22, 2025, citing personal reasons and professional commitments.",
            "Sentiment": "neutral",
            "PublishDate": 1766490097550,
            "Source": "stocks"
        },
        {
            "Title": "EuroPratik Sales Acquires 51% Stake in UroVeneer World for Rs. 76.5 Crores",
            "Summary": "EuroPratik Sales Limited acquired 51% stake in Bangalore-based UroVeneer World for Rs. 76.5 crores, marking its entry into B2C segment and forward integration strategy. The acquisition targets Rs. 115 crores revenue with Rs. 20 crores PAT by FY27, providing direct access to 3,500 interior designers and 150,000 consumers in South India.",
            "Sentiment": "positive",
            "PublishDate": 1763975420042,
            "Source": "order&deals"
        },
        {
            "Title": "Euro Pratik Sales Acquires 51% Stake in Uro Veneer World for ₹76.5 Crore, Shares Jump 5%",
            "Summary": "Euro Pratik Sales acquired a majority 51% stake in Uro Veneer World for ₹76.5 crore, marking its entry into the B2C segment and strengthening its presence beyond distribution-led operations. The acquisition is expected to provide improved margins, faster deliveries, better working capital cycle, and greater retail control, with shares rising 4.8% to ₹370.4 and now trading 50% above the IPO price of ₹247.",
            "Sentiment": "positive",
            "PublishDate": 1763365471069,
            "Source": "order&deals"
        },
        {
            "Title": "EuroPratik Sales Reports Mixed Quarterly Results, Approves Additional US Investment",
            "Summary": "EuroPratik Sales Limited approved unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025. The company reported revenue from operations of Rs. 96.56 crores for the quarter compared to Rs. 64.52 crores in the previous quarter. Net profit for the quarter stood at Rs. 22.69 crores versus Rs. 9.30 crores in the prior quarter. The Board approved additional investment of US$ 63,000 in its US subsidiary EuroPratik C Corp Inc., bringing total further investment to US$ 1,89,000 by subscribing to 18,90,000 shares of US$ 0.10 each. The company's shares were listed on NSE and BSE on September 23, 2025, following completion of its IPO of 1,82,74,798 equity shares. The company operates in wall panels and laminates business and recently incorporated two new LLPs - EuroPratik Star LLP and EuroPratik Craft LLP.",
            "Sentiment": "positive",
            "PublishDate": 1762354401991,
            "Source": "earnings"
        },
        {
            "Title": "Euro Pratik Sales Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Euro Pratik Sales reported quarterly results showing revenue growth to 966 million rupees from 877 million rupees year-over-year. However, consolidated net profit declined to 229 million rupees from 266 million rupees in the same period last year. EBITDA decreased to 308 million rupees from 397 million rupees year-over-year, while EBITDA margin compressed to 31.89% from 45.25% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762344862005,
            "Source": "earnings"
        },
        {
            "Title": "Euro Pratik Sales Reports Mixed Q2 Results with Lower Profit but Higher EBITDA",
            "Summary": "Euro Pratik Sales reported consolidated net profit of 97 million rupees in Q2, down from 148 million rupees in the same period last year. However, the company's EBITDA increased to 221 million rupees compared to 142 million rupees year-over-year. EBITDA margin improved to 34.27% from 29.23% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1760314572890,
            "Source": "earnings"
        },
        {
            "Title": "Euro Pratik Sales Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Euro Pratik Sales announced Q2 financial results showing revenue increased to 645 million rupees from 484 million rupees year-over-year. However, consolidated net profit declined to 97 million rupees compared to 148 million rupees in the same period last year. EBITDA improved to 221 million rupees from 142 million rupees year-over-year, with EBITDA margin expanding to 34.27% from 29.23%.",
            "Sentiment": "neutral",
            "PublishDate": 1760178238077,
            "Source": "earnings"
        },
        {
            "Title": "Euro Pratik Sales Limited Approves Q1 FY26 Results and $1.26 Million Investment in US Subsidiary",
            "Summary": "Euro Pratik Sales Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹4,375.98 lakh and consolidated revenue of ₹6,452.95 lakh. Standalone profit after tax was ₹429.49 lakh while consolidated profit reached ₹929.69 lakh. The Board also authorized additional investment of up to US$1.26 million in its USA subsidiary Euro Pratik C Corp Inc. through subscription of 12.6 million shares at US$0.100 each, which will increase the company's shareholding to 84%. The investment aims to fund capital requirements for increased business activities in wall panels and laminates. The company reported an exceptional loss of ₹788.79 lakh due to fire damage at its Bhiwandi godown in April 2025. Euro Pratik completed its IPO and got listed on NSE and BSE on September 23, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760177444125,
            "Source": "earnings"
        }
    ]
}