{
    "Symbol": "EUROTEXIND",
    "ISIN": "INE022C01012",
    "News": [
        {
            "Title": "Eurotex Industries Reports Quarterly Profit Despite Manufacturing Plant Closure",
            "Summary": "Eurotex Industries and Exports Limited reported a profit of Rs 181.10 lakhs for the quarter ended September 30, 2025, compared to a loss of Rs 307.49 lakhs in the same period last year. The company's half-year profit stood at Rs 62.00 lakhs versus a loss of Rs 307.51 lakhs previously. Other income for the quarter was Rs 364.05 lakhs, which included Rs 332.73 lakhs from sale of plant and machinery and freehold land at Kolhapur. The company's manufacturing operations at Kolhapur have been discontinued since March 2019, with formal closure announced in March 2022 due to industrial disputes. Management has settled dues of lender banks by borrowing from promoter group companies and plans to undertake further development of available land area at Kolhapur. The company's net worth remains eroded, but financial statements have been prepared on a going concern basis. Cash and cash equivalents increased to Rs 32.87 lakhs from Rs 4.62 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1762535209213,
            "Source": "earnings"
        },
        {
            "Title": "Eurotex Industries Reports Loss of Rs 87.04 Lakhs in Q1 Despite Manufacturing Plant Closure",
            "Summary": "Eurotex Industries and Exports Limited reported a net loss of Rs 87.04 lakhs for the quarter ended June 30, 2025, compared to a loss of Rs 111.37 lakhs in the same period last year. Revenue from operations declined to Rs 4.43 lakhs from Rs 62.13 lakhs year-over-year. The company's manufacturing plants at Kolhapur have been closed since March 25, 2019, with formal closure announced on March 30, 2022, due to labor disputes and power disconnection. Total expenses for the quarter were Rs 188.41 lakhs, while total income was Rs 59.31 lakhs, including other income of Rs 64.88 lakhs. The company has settled all dues with lender banks and plans to develop available land area at Kolhapur. Earnings per share stood at negative Rs 0.99. The company operates in two segments: yarn and real estate development.",
            "Sentiment": "negative",
            "PublishDate": 1754567814772,
            "Source": "earnings"
        }
    ]
}