{
    "Symbol": "EVEREADY",
    "ISIN": "INE128A01029",
    "News": [
        {
            "Title": "Eveready Industries sells Noida property for ₹251.55 cr",
            "Summary": "Eveready Industries India Ltd completes sale agreement for leasehold rights of Noida property worth ₹251.55 crore to NewGen Enterprise LLP and Gupta Infra Property Solutions LLP, expected to close by September 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770820071342,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eveready Industries Q3 Results: Mixed Performance",
            "Summary": "Eveready Industries reports 43.5% decline in Q3 net profit to ₹74 million despite 12.1% revenue growth to ₹3.7 billion compared to previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1770293047756,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eveready Board Meeting Set for Feb 5 to Review Q3 Results",
            "Summary": "Eveready Industries India Limited has scheduled a board meeting on February 5, 2026, to consider Q3FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769579139835,
            "Source": "co_actions_results"
        },
        {
            "Title": "Eveready Industries Postal Ballot Results Declared",
            "Summary": "Eveready Industries India Limited announces successful completion of postal ballot voting on January 12, 2026, with all four resolutions passed including director appointments and board expansion to 16 members.",
            "Sentiment": "positive",
            "PublishDate": 1768294090404,
            "Source": "stocks"
        },
        {
            "Title": "Eveready Industries Announces Postal Ballot for Key Appointments",
            "Summary": "Eveready Industries seeks shareholder approval for director appointments including Aditya Chand Burman as Non-Executive Director and re-appointments of independent directors through postal ballot voting.",
            "Sentiment": "neutral",
            "PublishDate": 1765438796076,
            "Source": "stocks"
        },
        {
            "Title": "Eveready Industries Reports 6.7% Revenue Growth in Q2FY26 Despite One-Time Charges",
            "Summary": "Eveready Industries India reported 6.7% revenue growth in Q2FY26 with EBITDA margins at 12.7%. The company incurred one-time charges totaling INR 37.7 crore, including INR 15 crore for arbitration settlement with Real Touch and INR 22.7 crore for strategic ex-gratia payments to 160 workers as part of manufacturing realignment. This resulted in a net loss of INR 7.9 crore for the quarter. The alkaline battery segment showed strong momentum with 60% growth and market share expanding to 16.3% from 15.3%. Carbon zinc batteries maintained leadership with 59% market share across 4.5 million outlets. The company's Jammu alkaline battery facility with 360 million unit capacity remains on track for completion by end of FY26. Rechargeable flashlights delivered double-digit growth while battery-operated segment declined. LED lighting business achieved healthy volume growth with 10.6% revenue increase. The arbitration settlement removes all capital structure restrictions, allowing the company freedom to manage assets and raise capital if needed.",
            "Sentiment": "neutral",
            "PublishDate": 1762893829175,
            "Source": "earnings"
        },
        {
            "Title": "Eveready Industries Reports Quarterly Results and Key Board Appointments",
            "Summary": "Eveready Industries India Limited announced its quarterly results for the quarter and half-year ended September 30, 2025. The company reported revenue from operations of ₹386.27 crores for the quarter. The Board appointed Mr. Aditya Chand Burman as Additional Director (Non-Executive Non-Independent) effective November 5, 2025, and re-appointed two Independent Directors for second terms. The company recognized exceptional charges of ₹44.75 crores during the half-year, including ₹29.75 crores for non-recurring ex-gratia payments to workmen on separation and ₹15 crores toward settlement of an arbitration proceeding. Eveready faces a pending penalty of ₹171.55 crores from the Competition Commission of India, against which it has filed an appeal with NCLAT and received a stay order. The company operates in the consumer goods segment, marketing dry cell batteries, rechargeable batteries, flashlights and lighting products.",
            "Sentiment": "neutral",
            "PublishDate": 1762367906737,
            "Source": "earnings"
        },
        {
            "Title": "Eveready Industries Reports Q2 Net Loss of 80.6M Rupees Despite Revenue Growth",
            "Summary": "Eveready Industries posted a net loss of 80.6 million rupees in Q2, compared to a profit of 295 million rupees in the same period last year. The company's revenue increased to 3.86 billion rupees from 3.62 billion rupees year-over-year. EBITDA rose to 490 million rupees from 477 million rupees, though the EBITDA margin declined to 12.68% from 13.17% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762344480174,
            "Source": "earnings"
        },
        {
            "Title": "Eveready Industries India Gets Credit Rating Upgrade from India Ratings",
            "Summary": "India Ratings and Research upgraded Eveready Industries India's long-term rating on bank facilities to INDA+ with a Stable Outlook from INDA on October 31, 2025. The rating agency affirmed the company's short-term rating at INDA1. The company informed stock exchanges NSE, BSE, and Calcutta Stock Exchange about this rating action.",
            "Sentiment": "positive",
            "PublishDate": 1761983111938,
            "Source": "stock"
        },
        {
            "Title": "Eveready Industries India Schedules Q2 FY26 Earnings Conference Call for November 6, 2025",
            "Summary": "Eveready Industries India Ltd. has announced an earnings conference call scheduled for Thursday, November 6, 2025 at 4:30 PM IST to discuss Q2 FY26 results. The call will feature senior management team members and include key comments followed by a Q&A session for analysts and investors. The company operates as a household name in dry cell batteries and flashlights with emerging presence in lighting, holding over 50% market share in India's battery segment. Eveready has manufacturing facilities across 6 locations and maintains a legacy of over 100 years in the Indian market.",
            "Sentiment": "neutral",
            "PublishDate": 1761646299811,
            "Source": "earnings"
        },
        {
            "Title": "Eveready Industries India Shareholders Approve All Postal Ballot Resolutions",
            "Summary": "Eveready Industries India Limited announced that all resolutions in its postal ballot were passed with the required majority. The voting concluded on October 16, 2025, through remote e-voting. Two key resolutions were approved: payment of remuneration to non-executive independent directors (special resolution) and revision in remuneration of Executive Director and CFO Bibek Agarwal (ordinary resolution). The first resolution received 99.99% votes in favor with 4,84,36,182 votes, while the second resolution got 99.99% approval with 4,84,36,571 votes. The company has 72,687,260 total shares, with 66.64% of shares participating in the voting process. The postal ballot notice was dated August 5, 2025, and voting was conducted electronically from September 17 to October 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760699856600,
            "Source": "corporate_action"
        },
        {
            "Title": "Eveready Industries Receives Consent Award, Settles Arbitration Dispute with Real Touch Finance",
            "Summary": "Eveready Industries India Limited received a consent award from an arbitral tribunal on September 22, 2025, following a settlement agreement with Real Touch Finance Limited reached on July 25, 2025. The arbitration proceedings against Eveready have been withdrawn and terminated, with all interim orders issued by the tribunal now vacated. The company states there is no impact on its financial position from the settlement.",
            "Sentiment": "positive",
            "PublishDate": 1759315645495,
            "Source": "stock"
        },
        {
            "Title": "Supreme Court Denies VAT Relief for Asbestos Cement Sheets Made with Fly Ash in Rajasthan",
            "Summary": "The Supreme Court has rejected a request for VAT relief on asbestos cement sheets manufactured using fly ash in Rajasthan. The case involves Eveready Industries India.",
            "Sentiment": "negative",
            "PublishDate": 1758787140931,
            "Source": "stock"
        },
        {
            "Title": "Suvamoy Saha to Complete Term as Managing Director of Eveready Industries on September 30, 2025",
            "Summary": "Suvamoy Saha will complete his term as Managing Director of Eveready Industries India Limited on September 30, 2025, and will cease to be a member of the Board. The cessation is due to completion of tenure. Eveready Industries has acknowledged his valuable services, guidance, and support during his tenure with the company.",
            "Sentiment": "neutral",
            "PublishDate": 1758718570788,
            "Source": "corporate_governance"
        },
        {
            "Title": "Eveready Industries Seeks Shareholder Approval for Director Remuneration Through Postal Ballot",
            "Summary": "Eveready Industries India Limited has issued a postal ballot notice seeking shareholder approval for two key resolutions. The first resolution proposes payment of Rs 13.60 lakh remuneration to each of six Non-Executive Independent Directors based on net profits for the financial year ended March 31, 2025. The second resolution seeks revision in remuneration for Executive Director and CFO Bibek Agarwal, with a maximum limit of Rs 2.36 crore per annum plus performance awards up to Rs 25 lakh, effective April 1, 2025. The e-voting period runs from September 17, 2025, to October 16, 2025, with results to be declared by October 18, 2025. The company reported revenue of Rs 1,343.92 crore and profit of Rs 82.38 crore for the latest financial year.",
            "Sentiment": "neutral",
            "PublishDate": 1757922629995,
            "Source": "corporate_action"
        },
        {
            "Title": "Eveready Industries Plans Monetization of Unused Land and Idle Assets",
            "Summary": "Eveready Industries' Managing Director announced plans to begin initial discussions for monetizing the company's unused land and idle assets. The initiative represents a strategic move to unlock value from underutilized company resources.",
            "Sentiment": "positive",
            "PublishDate": 1757665535857,
            "Source": "stock"
        },
        {
            "Title": "Eveready Industries Reports 7% Revenue Growth in Q1 FY26, Settles Rs 15 Crore Arbitration Dispute",
            "Summary": "Eveready Industries India Limited reported 7% revenue growth in quarterly results, driven by strong performance in batteries and flashlights while lighting remained flat. The company achieved 14.3% EBITDA margin and gained market share in alkaline batteries to 15.3% from previous levels. Key developments include settling an arbitration dispute with Real Touch Finance Limited for Rs 15 crore, which will lift restrictions on asset disposal and capital restructuring. The company incurred Rs 7.07 crore in exceptional charges for ex-gratia payments to approximately 50 workmen across multiple locations as part of efficiency improvements. Battery segment showed 19% margins with carbon-zinc maintaining 59.1% market share, while rechargeable flashlights grew 39% year-on-year. The alkaline battery manufacturing facility at Jammu remains on track for commercial production by March 2026, with internal target of January 2026. Management expects the payback period for workforce optimization to be 3-4 years with annual cost savings of approximately Rs 4 crore.",
            "Sentiment": "positive",
            "PublishDate": 1754992762350,
            "Source": "earnings"
        },
        {
            "Title": "Eveready Industries Plans Premium Battery Expansion and Revenue Growth Strategy",
            "Summary": "Eveready Industries has outlined growth plans focused on expanding premium alkaline battery production at its Jammu plant by FY26. The company aims to maintain leadership in rechargeable flashlights and triple its lighting segment revenue by concentrating on high-end products. The growth strategy is supported by enhanced distribution networks, innovative product development, and quick-commerce initiatives targeting profitable expansion.",
            "Sentiment": "positive",
            "PublishDate": 1754411926061,
            "Source": "stock"
        },
        {
            "Title": "Eveready Industries Reports Marginal Growth in Q1 EBITDA and Margin",
            "Summary": "Eveready Industries reported Q1 EBITDA of 536 million rupees compared to 497 million rupees in the same period last year, representing year-over-year growth. The company's EBITDA margin improved slightly to 14.3% from 14.2% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754383793635,
            "Source": "earnings"
        },
        {
            "Title": "Eveready Industries Reports Growth in Quarterly Profit and Revenue",
            "Summary": "Eveready Industries reported a net profit of 302 million rupees compared to 294 million rupees in the same quarter last year. The company's revenue increased to 3.7 billion rupees from 3.5 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754383214205,
            "Source": "earnings"
        },
        {
            "Title": "Eveready Industries Settles Arbitration Dispute with Real Touch Finance for INR 15 Crore",
            "Summary": "Eveready Industries India Limited has entered into a settlement agreement to resolve an arbitration proceeding with Real Touch Finance Limited. The company will pay INR 15 crore and assign certain loan receivables to Real Touch in exchange for withdrawal of the arbitration against Eveready. The arbitration was related to alleged dues under a facility agreement entered into by some of Eveready's promoters in 2017, though Eveready was not a signatory to that agreement. The company was included in the proceedings under the 'group of companies' doctrine. Eveready states there is no significant impact on its financial position due to sufficient cash reserves and internal accruals. The settlement is without admission of liability and is described as being in the commercial interest of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1753454258492,
            "Source": "stock"
        },
        {
            "Title": "Eveready Industries Reports Q4 FY2023 Results and Dividend",
            "Summary": "Eveready Industries has announced its Q4 financial results. The company's net profit increased to 104.7 million rupees, up from 80 million rupees year-over-year and 130.5 million rupees quarter-over-quarter. Revenue for Q4 rose to 2.99 billion rupees from 2.8 billion rupees in the previous year. Additionally, the company has recommended a dividend of 1.50 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747008747000,
            "Source": "default"
        },
        {
            "Title": "Eveready Industries Reports Q4 Results and Dividend",
            "Summary": "Eveready Industries has announced its Q4 financial results and dividend recommendation. The company's Q4 revenue increased to 2.99 billion rupees from 2.8 billion rupees year-over-year. EBITDA slightly improved to 256.6 million rupees from 255.1 million rupees, although the EBITDA margin decreased to 8.59% from 9.08%. Net profit rose to 104.7 million rupees from 80 million rupees year-over-year. The company has recommended a dividend of 1.50 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746792995000,
            "Source": "result"
        },
        {
            "Title": "Eveready Industries Reports Improved Q3 EBITDA and Margin",
            "Summary": "Eveready Industries has reported an increase in its Q3 EBITDA to 300 million rupees, up from 247 million rupees in the same period last year. The company's EBITDA margin also improved, rising to 8.92% from 8.09% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738745544000,
            "Source": "earnings"
        },
        {
            "Title": "Eveready Industries Reports Q3 Revenue Growth",
            "Summary": "Eveready Industries has announced its third quarter revenue, which increased to 3.3 billion rupees from 3 billion rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738745527000,
            "Source": "earnings"
        },
        {
            "Title": "Eveready Industries Reports 55% Increase in Q3 Net Profit",
            "Summary": "Eveready Industries has announced its financial results for the third quarter, reporting a net profit of 130 million rupees. This represents a significant increase from the 84 million rupees reported in the same quarter of the previous year, marking a year-over-year growth of approximately 55%.",
            "Sentiment": "positive",
            "PublishDate": 1738745507000,
            "Source": "earnings"
        },
        {
            "Title": "Eveready Industries to Consider Q3 Results",
            "Summary": "Eveready Industries has announced that it will consider its financial results for the third quarter on February 5. This indicates the company is preparing to release its quarterly earnings report, which will provide insights into its financial performance for the period.",
            "Sentiment": "neutral",
            "PublishDate": 1737981840000,
            "Source": "earnings"
        },
        {
            "Title": "Eveready Industries: Q2 Profit Up 17%, Revenue Flat Amid Shifting Battery Trends",
            "Summary": "Eveready Industries reported a 16.5% YoY increase in Q2 net profit to ₹29.6 crore, while revenue remained flat at ₹362.6 crore. EBITDA rose 3% to ₹47.8 crore. The company saw strong growth in alkaline batteries (75% YoY volume increase) but faced challenges in the carbon zinc segment. Flashlight segment showed positive performance, particularly in rechargeable flashlights.",
            "Sentiment": "neutral",
            "PublishDate": 1731419460000,
            "Source": "result"
        }
    ]
}