{
    "Symbol": "EVERESTIND",
    "ISIN": "INE295A01018",
    "News": [
        {
            "Title": "Everest Industries Appoints New Head of Operations",
            "Summary": "Everest Industries Limited has appointed Mr. Lakshmana Rao Challa as Head Manufacturing Operations & Supply Chain Management for Fibre Cement Plants, effective February 9, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770654565416,
            "Source": "stocks"
        },
        {
            "Title": "Everest Industries Reports Q3FY26 Loss of ₹3,172 Lakhs",
            "Summary": "Everest Industries posted a net loss of ₹3,172.40 lakhs for Q3FY26 vs ₹1,185.67 lakhs loss in Q3FY25. Revenue declined 26.84% to ₹26,883.42 lakhs with exceptional charges of ₹1,329.56 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1770385191355,
            "Source": "co_actions_results"
        },
        {
            "Title": "Everest Industries Appoints New VP for Boards Division",
            "Summary": "Everest Industries Limited announced key senior management changes with Subramaniam Venkatakrishnan joining as VP for Boards & Panels business and internal role transition for existing executive.",
            "Sentiment": "positive",
            "PublishDate": 1770212591297,
            "Source": "stocks"
        },
        {
            "Title": "Everest Industries Board Meet Set for Feb 6, 2026",
            "Summary": "Everest Industries Limited has scheduled a board meeting on February 6, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window remains closed until February 8, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769679801166,
            "Source": "co_actions_results"
        },
        {
            "Title": "Everest Industries Sells 3.12% Stake for ₹1.76 Cr",
            "Summary": "Everest Industries completed the sale of its 3.12% stake in Amplus Ampere Private Limited for ₹1.76 crore on January 20, 2026, marking a strategic divestment move.",
            "Sentiment": "neutral",
            "PublishDate": 1768989863027,
            "Source": "co_actions_results"
        },
        {
            "Title": "Everest Industries Receives New GST Order from Ranchi",
            "Summary": "Everest Industries receives GST order from Deputy Commissioner CGST, Ranchi with total demand of ₹2.77 crores including tax, interest and penalty for period 2018-19 to 2022-23.",
            "Sentiment": "negative",
            "PublishDate": 1767187758002,
            "Source": "stocks"
        },
        {
            "Title": "Everest Industries VP Roofing Resigns Effective Feb 2026",
            "Summary": "Everest Industries announces resignation of VP Roofing Puneet Sharma effective February 2, 2026, to pursue external career opportunities. Company files regulatory disclosure under SEBI LODR.",
            "Sentiment": "neutral",
            "PublishDate": 1767010776457,
            "Source": "stocks"
        },
        {
            "Title": "Everest Industries Gets Major GST Relief Worth ₹8.26 Cr",
            "Summary": "Everest Industries receives substantial GST relief with ₹8.26 cr demand reduction from Madhya Pradesh authorities, leaving only ₹51,786 in interest and penalty to be paid after order dated December 29, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766571317297,
            "Source": "stocks"
        },
        {
            "Title": "Everest Industries Credit Ratings Downgraded by Crisil",
            "Summary": "Crisil Ratings downgraded Everest Industries' long-term bank facilities rating from Crisil A/Negative to Crisil A-/Negative and short-term rating from Crisil A1 to Crisil A2 on November 25, 2025. The downgrades reflect weaker than expected recovery in business and impact on profitability, with total bank loan facilities of Rs. 440 crores being rated.",
            "Sentiment": "negative",
            "PublishDate": 1764152540485,
            "Source": "corporate_action"
        },
        {
            "Title": "Everest Industries VP of Operations & Supply Chain Resigns Due to Personal Reasons",
            "Summary": "Parshant Giare, Vice President-Operations and Supply Chain at Everest Industries Limited, has resigned from his position due to personal reasons, effective from the close of business hours on December 1, 2025. The company has disclosed this senior management personnel change to stock exchanges NSE and BSE as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1763623006968,
            "Source": "corporate_governance"
        },
        {
            "Title": "Everest Industries Sells Mumbai Commercial Property for ₹3.74 Crore",
            "Summary": "Everest Industries has completed the sale of a commercial property located in Mumbai for ₹3.74 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1762252455708,
            "Source": "stock"
        },
        {
            "Title": "Everest Industries Reports Wider Q2 Loss and Revenue Decline",
            "Summary": "Everest Industries reported a consolidated net loss of 181.7 million rupees in Q2, compared to a loss of 116.7 million rupees in the same quarter last year. The company's revenue fell to 3.06 billion rupees from 3.77 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1761754009036,
            "Source": "earnings"
        },
        {
            "Title": "Everest Industries Receives Environmental Clearance Modification Approval for ₹133.86 Crore Land Sale",
            "Summary": "Everest Industries has obtained approval to modify environmental clearance for selling land at Podanur. The land sale is structured as a ₹133.86 crore transaction to be completed in three payments. Following the clearance approval, the company is due to receive a second payment of ₹8 crores.",
            "Sentiment": "positive",
            "PublishDate": 1761581762734,
            "Source": "stock"
        },
        {
            "Title": "Everest Industries Receives GST Show Cause Notice for ₹3.66 Crore Tax Demand",
            "Summary": "Everest Industries Limited received a show cause notice from the GST Department in Jabalpur, Madhya Pradesh regarding excess Input Tax Credit (ITC) claimed in GSTR 3B compared to GSTR 2A/2B for financial year 2019-20. The GST Department has proposed to recover ₹3,65,81,446, which includes tax demand of ₹1,18,74,263, interest of ₹1,28,32,920, and penalty of ₹1,18,74,263 under various GST Acts. The company maintains it has strong legal and factual grounds to defend the case and does not expect any material financial impact. Everest Industries is preparing a response to the show cause notice and believes the potential demand is unlikely to materialize as a liability against the company.",
            "Sentiment": "neutral",
            "PublishDate": 1759211487568,
            "Source": "stock"
        },
        {
            "Title": "Everest Industries Receives GST Show Cause Notice with Rs 1.73 Crore Tax Demand",
            "Summary": "Everest Industries Limited received a show cause notice from the Assistant Commissioner of Central Goods and Service Tax, Roorkee under GST regulations. The notice raises concerns regarding excess Input Tax Credit claimed in GSTR 3B compared to GSTR 2A, differences in tax amounts compared with GSTR 1 and Outward E-Way Bill, and ITC taken on invoices from suppliers who have not filed their GSTR 3B returns for financial year 2021-22. The GST Department has proposed to recover Rs 1,73,07,714 comprising IGST of Rs 1,44,04,576, CGST of Rs 14,51,569, and SGST of Rs 14,51,569. The company states there is no material impact on its financial, operational or other activities and believes it has strong legal and factual grounds to contest the notice. Everest Industries is reviewing the matter and preparing to take necessary actions in accordance with applicable laws.",
            "Sentiment": "negative",
            "PublishDate": 1758625740538,
            "Source": "stock"
        },
        {
            "Title": "Everest Industries Appoints Hemant Khurana as Managing Director & CEO for Three-Year Term",
            "Summary": "Everest Industries Limited shareholders approved the appointment of Hemant Khurana as Managing Director & Chief Executive Officer at their 92nd Annual General Meeting held on September 18, 2025. Khurana's appointment is effective for three consecutive years from September 13, 2025 to September 12, 2028. The approval follows the company's earlier intimation dated August 4, 2025 regarding the proposed appointment.",
            "Sentiment": "positive",
            "PublishDate": 1758374190536,
            "Source": "corporate_governance"
        },
        {
            "Title": "Everest Industries Secures Approval to Sell 23.32 Acres in Podanur for ₹133.86 Crore",
            "Summary": "Everest Industries has received approval to sell 23.32 acres of land located in Podanur to G Square Realtors for ₹133.86 crore. The company has already received an initial payment of ₹7 crore from the buyer. The sale deed is expected to be completed within 4 months.",
            "Sentiment": "positive",
            "PublishDate": 1756445349592,
            "Source": "stock"
        },
        {
            "Title": "Everest Industries Corrects Shareholding Percentage in Enerparc Solar Investment to 2.43%",
            "Summary": "Everest Industries Limited revised its investment disclosure for Enerparc Solar Power 10 Private Limited, correcting a typographical error in the shareholding percentage from 5.31% to 2.43%. The company will acquire 10,65,000 equity shares at Rs. 10 per share, totaling Rs. 1.065 crores. The Board approved this investment to avail 3 MWp solar power for its Podanur Plant in Coimbatore under a group captive policy. Enerparc is a special purpose vehicle engaged in setting up and distributing solar power, incorporated on June 18, 2024, with a paid-up capital of Rs. 36.37 crores and no turnover in the last three years. The acquisition is expected to be completed by November 30, 2025, and aims to increase Everest Industries' renewable energy utilization in Tamil Nadu.",
            "Sentiment": "neutral",
            "PublishDate": 1754394369307,
            "Source": "order&deals"
        },
        {
            "Title": "Everest Industries Invests Rs 1.065 Crores in Solar Power Company for Renewable Energy Access",
            "Summary": "Everest Industries Limited's Board of Directors approved an investment of Rs 1.065 crores in Enerparc Solar Power 10 Private Limited through acquisition of 10,65,000 equity shares at Rs 10 per share. The investment will give Everest Industries a 5.31% equity shareholding in Enerparc and enable the company to avail 3 MWp solar power for its Podanur Plant in Coimbatore under a group captive policy. Enerparc is engaged in setting up, generating and distributing power from solar power plants in India and was incorporated on June 18, 2024. The company has a paid-up capital of Rs 36.37 crores but has recorded no turnover for the past three years. The acquisition is expected to be completed by November 30, 2025, and aims to increase Everest Industries' utilization of renewable energy in Tamil Nadu. The transaction is being conducted through cash consideration and does not involve any related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1754313423972,
            "Source": "order&deals"
        },
        {
            "Title": "Everest Industries Appoints Hemant Khurana as Managing Director & CEO for Three-Year Term",
            "Summary": "Everest Industries Limited has appointed Hemant Khurana as Managing Director & CEO for a three-year term from September 13, 2025 to September 12, 2028, subject to shareholder approval. The Board approved the appointment based on the Nomination and Remuneration Committee's recommendation. Khurana will initially join as President on September 6, 2025 to facilitate a smooth transition with Rajesh Joshi, the existing MD & CEO. Khurana brings 28 years of experience, including over 23 years with Saint-Gobain where he served as Managing Director of Saint Gobain Weber. He holds an engineering degree from Delhi College of Engineering and an MBA from IIM Kolkata, with expertise in building materials across India and Southeast Asia.",
            "Sentiment": "positive",
            "PublishDate": 1754311756118,
            "Source": "corporate_governance"
        },
        {
            "Title": "Everest Industries Reports Q1 FY26 Results with Standalone Profit of Rs 719.84 Lakhs",
            "Summary": "Everest Industries Limited announced its quarterly results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs 48,679.59 lakhs and total income of Rs 49,254.99 lakhs. Standalone profit for the period was Rs 719.84 lakhs with earnings per share of Rs 4.51. On a consolidated basis, the company posted revenue from operations of Rs 50,071.97 lakhs with total income of Rs 50,401.32 lakhs and profit of Rs 163.46 lakhs. The company operates through two business segments - Building products and Steel buildings. Building products segment generated higher revenue of Rs 36,307.37 lakhs compared to Steel buildings segment at Rs 15,802.43 lakhs on standalone basis. The Board meeting was held on August 4, 2025, and the results were reviewed by statutory auditors S R B C & Co. LLP.",
            "Sentiment": "positive",
            "PublishDate": 1754310513143,
            "Source": "earnings"
        },
        {
            "Title": "Everest Industries Reports Q4 Results and Recommends Dividend",
            "Summary": "Everest Industries has announced its Q4 results and dividend recommendation. The company's Q4 revenue increased to 4.53 billion rupees from 4.3 billion rupees year-over-year. However, EBITDA decreased to 103.1 million rupees from 146.5 million rupees, with EBITDA margin falling to 2.28% from 3.39%. The company reported a loss before tax of 21.7 million rupees compared to a profit of 34.8 million rupees in the same quarter last year. An exceptional item of 77.9 million rupees was noted. The consolidated net profit for Q4 was 76.4 million rupees, up from 54 million rupees year-over-year, but down from a loss of 154.8 million rupees quarter-on-quarter. The company has recommended a final dividend of 2.50 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747673497000,
            "Source": "result"
        },
        {
            "Title": "Everest Industries Delays New Steel Buildings Manufacturing Facility",
            "Summary": "Everest Industries has announced a delay in establishing a new steel buildings manufacturing facility in South India. The project, initially planned for FY 2024-25, has been postponed to FY 2025-26. This delay affects the company's expansion plans in the region.",
            "Sentiment": "neutral",
            "PublishDate": 1742775285000,
            "Source": "corporate_action"
        },
        {
            "Title": "Everest Industries Delays New Steel Buildings Manufacturing Facility",
            "Summary": "Everest Industries has announced a delay in establishing a new steel buildings manufacturing facility in South India. The project, initially planned for FY 2024-25, has been postponed to FY 2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1742578127000,
            "Source": "corporate_action"
        },
        {
            "Title": "Everest Industries Subsidiary Approves 1.38 Billion Rupee Investment for New Fibre Cement Plant",
            "Summary": "A subsidiary of Everest Industries has approved a capital expenditure of 1.38 billion rupees to establish a new fibre cement boards manufacturing plant in Assam, India. This investment signals the company's expansion into the northeastern region of the country and likely aims to increase production capacity for construction materials.",
            "Sentiment": "positive",
            "PublishDate": 1740615500000,
            "Source": "corporate_action"
        },
        {
            "Title": "Everest Industries' Unit Approves 1.38 Billion Rupee Capex for Fibre Cement Board Plant in Assam",
            "Summary": "Everest Industries Limited has announced that its unit has approved a capital expenditure of 1.38 billion rupees (approximately $16.7 million USD) to establish a new fibre cement board manufacturing plant in Assam, India. This investment represents a significant expansion of the company's production capabilities in the northeastern region of the country.",
            "Sentiment": "positive",
            "PublishDate": 1740494879000,
            "Source": "corporate_action"
        },
        {
            "Title": "Everest Industries Reports Q3 Net Loss of 155 Million Rupees",
            "Summary": "Everest Industries has reported a consolidated net loss of 155 million rupees for the third quarter, compared to a profit of 8.1 million rupees in the same period last year. Despite the loss, the company's revenue increased to 3.7 billion rupees from 3.52 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738714832000,
            "Source": "earnings"
        },
        {
            "Title": "Everest Industries Reports Q3 Net Loss of 155M Rupees",
            "Summary": "Everest Industries has reported a consolidated net loss of 155 million rupees for the third quarter, compared to a profit of 8.1 million rupees in the same period last year. Despite the loss, the company's revenue increased to 3.7 billion rupees from 3.52 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738676518000,
            "Source": "earnings"
        },
        {
            "Title": "Everest Industries Reports Increased Q2 Loss and Revenue",
            "Summary": "Everest Industries announced its Q2 financial results, reporting a consolidated net loss of 117 million rupees, which is higher compared to both the previous year (58 million rupees loss) and the previous quarter (159 million rupees loss). However, the company's revenue increased to 3.8 billion rupees from 3.1 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730820028000,
            "Source": "result"
        }
    ]
}