{
    "Symbol": "EXCEL",
    "ISIN": "INE688J01023",
    "News": [
        {
            "Title": "Excel Realty Posts Q3FY26 Loss, Appoints 3 Directors",
            "Summary": "Excel Realty N Infra reported a net loss of ₹26.66 lacs in Q3FY26 versus profit of ₹148.82 lacs in Q3FY25. Board appointed three new independent directors and reconstituted key committees.",
            "Sentiment": "negative",
            "PublishDate": 1769694003673,
            "Source": "co_actions_results"
        },
        {
            "Title": "Excel Realty postal ballot results announced",
            "Summary": "Excel Realty N Infra Limited announces postal ballot outcomes with overwhelming shareholder approval for 11 resolutions including capital increase, board changes, and company name alteration.",
            "Sentiment": "positive",
            "PublishDate": 1769161615295,
            "Source": "stocks"
        },
        {
            "Title": "Excel Realty Board Meet Set for Jan 29 for Q3 Results",
            "Summary": "Excel Realty N Infra Limited has scheduled a board meeting on January 29, 2026, to consider Q3FY26 unaudited financial results and appointment of additional independent director.",
            "Sentiment": "neutral",
            "PublishDate": 1768842128702,
            "Source": "co_actions_results"
        },
        {
            "Title": "Excel Realty N Infra Announces Postal Ballot for Major Corporate Changes",
            "Summary": "Excel Realty N Infra Limited has issued a postal ballot notice for 11 resolutions including authorized capital increase to ₹7,500 crores, business diversification into renewable energy, and company name change to Landsmill Green Limited.",
            "Sentiment": "positive",
            "PublishDate": 1766493030150,
            "Source": "stocks"
        },
        {
            "Title": "Excel Realty Director Sells 83.20 Lakh Shares",
            "Summary": "Jasman Singh Chadha, Whole-time Director of Excel Realty N Infra, sold 83.20 lakh equity shares representing 0.59% stake through open market sales between December 5-10, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765612198272,
            "Source": "stocks"
        },
        {
            "Title": "Excel Realty N Infra Board Approves Leadership Changes and Office Relocation",
            "Summary": "Excel Realty N Infra's board approved the re-designation of Ankit Mehra from Whole-Time Director to Managing Director and accepted Lakhmendra Khurana's resignation as Chairman and Managing Director due to age-related reasons, though he will continue as Director. The company also approved shifting its registered office within Mumbai from Andheri West to Powai to enhance operational efficiency and bring administrative control closer.",
            "Sentiment": "neutral",
            "PublishDate": 1763382697964,
            "Source": "corporate_governance"
        },
        {
            "Title": "Excel Realty N Infra Limited Announces Leadership Changes and Board Meeting",
            "Summary": "Excel Realty N Infra Limited has scheduled a board meeting for November 17, 2025, to address key leadership changes including the resignation of Lakhmendra Chamanlal Khurana as Chairman and Managing Director, though he will remain as Director, and the redesignation of Ankit Mehra from Whole-Time Director to Managing Director. The company has also announced a change in its registered office location within the city and implemented a trading window closure from the intimation date until November 19, 2025, for directors and specified persons.",
            "Sentiment": "neutral",
            "PublishDate": 1763131652883,
            "Source": "corporate_governance"
        },
        {
            "Title": "Excel Realty N Infra Reports Quarterly Results, Proposes Major Capital Increase and Leadership Changes",
            "Summary": "Excel Realty N Infra Limited announced quarterly results for the period ended September 30, 2025, showing a net profit of Rs. 32.9 crores on standalone basis and Rs. 10.3 crores on consolidated basis. The Board approved a significant increase in authorized capital from Rs. 500 crores to Rs. 7,500 crores, subject to shareholder approval. The company also proposed changing its name to Landsmill Green Energies Ltd or similar variants and expanding its main objects to include renewable energy, solar systems, and biofuel businesses. In leadership changes, Mr. Garvit Agarwal was appointed as Additional Executive Director, while Ms. Ranjana Khurana resigned as Whole Time Director due to personal reasons. The company operates in IT sales, infrastructure, and trading segments, with infrastructure activities generating Rs. 151.27 crores in revenue for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762868270769,
            "Source": "corporate_action"
        },
        {
            "Title": "Excel Realty N Infra Receives NSE Waiver for Regulatory Non-Compliance",
            "Summary": "Excel Realty N Infra Limited received approval from the National Stock Exchange of India for a waiver of fines related to alleged non-compliance with listing regulations. The waiver covers violations of Regulation 18(1) regarding Audit Committee, Regulation 19(1)/(2) concerning Nomination and Remuneration Committee, and Regulation 20(2)/(2A) related to Stakeholders Relationship Committee for the quarter ended June 30, 2025. NSE approved the waiver application and advised the company to ensure compliance with listing regulations in the future.",
            "Sentiment": "positive",
            "PublishDate": 1762327886802,
            "Source": "corporate_governance"
        },
        {
            "Title": "Excel Realty N Infra Schedules Board Meeting for Financial Results and Major Corporate Changes",
            "Summary": "Excel Realty N Infra Limited has scheduled a board meeting for November 11, 2025, to discuss multiple significant agenda items. The company will consider and approve unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. Key corporate changes under consideration include increasing authorized share capital, changing the company name, and relocating the registered office. The board will also evaluate revised fundraising proposals through preferential allotment, convertible warrants, QIP, or other permissible instruments. Additionally, the meeting will address the appointment of Mr. Garvit Agarwal as Executive Director and the resignation of Ms. Ranjana Khurana Lakhmendra from her Executive Director position. The company will also consider amendments to the Object Clause of its Memorandum of Association. A trading window closure has been implemented from the date of intimation until November 14, 2025, for directors and specified persons.",
            "Sentiment": "neutral",
            "PublishDate": 1762169342105,
            "Source": "corporate_action"
        },
        {
            "Title": "Excel Realty N Infra Limited Schedules Board Meeting to Consider Share Capital Increase, Name Change, and Executive Director Appointments",
            "Summary": "Excel Realty N Infra Limited has scheduled a board meeting for October 24, 2025, to discuss several key corporate matters. The agenda includes increasing the company's authorized share capital, changing the company name, and reconsidering fund-raising decisions from their October 6, 2025 board meeting. The board will evaluate revised proposals for raising funds through preferential allotment, convertible warrants, Qualified Institutional Placement (QIP), or other permissible instruments. Two new executive directors are proposed for appointment: Praveen Kumar Agrawal and Garvit Agarwal. Additional items include amending the company's Memorandum of Association object clause, changing the registered office location, and the resignation of Whole Time Director Ranjana Khurana. The company has closed its trading window for directors and specified persons from the date of intimation until October 28, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760352522385,
            "Source": "corporate_action"
        },
        {
            "Title": "Excel Realty N Infra Ltd Amends Memorandum to Expand into FMCG and Power Sectors, Increases Authorized Capital to Rs 500 Crore",
            "Summary": "Excel Realty N Infra Ltd has received Ministry of Corporate Affairs approval for amendments to its Memorandum of Association following shareholder approval at an Extra-Ordinary General Meeting held on September 11, 2025. The company increased its Authorized Share Capital from Rs 150 crore to Rs 500 crore through an Ordinary Resolution. Additionally, shareholders approved alterations to the Main Object Clause via Special Resolution, expanding business activities to include FMCG operations covering agriculture-based food products, dairy products, processed foods, and various food manufacturing activities. The amendments also include power and energy sector activities such as electrical power engineering consultation, energy distribution networks, and technology platform services. The company's CIN has changed to L41001MH2003PLC138568 following the object clause alterations. Excel Realty N Infra Ltd, formerly known as Excel Infoways Ltd, is listed on BSE and NSE with current paid-up capital of Rs 141.07 crore.",
            "Sentiment": "positive",
            "PublishDate": 1759492039738,
            "Source": "corporate_action"
        },
        {
            "Title": "Excel Realty N Infra Limited Plans to Increase Fund-Raising Limit to ₹2,500 Crores",
            "Summary": "Excel Realty N Infra Limited has scheduled a Board of Directors meeting for October 6, 2025, to discuss two key proposals. The company plans to enhance its fund-raising capacity from the previously approved ₹500 crores to ₹2,500 crores through various financial instruments including preferential allotment, convertible warrants, Foreign Currency Convertible Bonds (FCCBs), and Qualified Institutional Placement (QIP). The board also intends to increase the company's authorized capital from ₹500 crores to ₹2,500 crores. Both proposals are subject to necessary approvals from shareholders, regulatory bodies, and other stakeholders. The trading window for company securities will remain closed from the date of announcement until October 8, 2025, for directors and specified persons.",
            "Sentiment": "positive",
            "PublishDate": 1758628372445,
            "Source": "corporate_action"
        },
        {
            "Title": "Excel Realty N Infra Limited Plans to Increase Authorized Capital from Rs. 150 Crore to Rs. 500 Crore",
            "Summary": "Excel Realty N Infra Limited's Board of Directors approved a proposal to increase the company's authorized capital from Rs. 1,50,00,00,000 (Rs. 150 crore) divided into 1,50,00,00,000 shares of Rs. 1 each to Rs. 5,00,00,00,000 (Rs. 500 crore) divided into 5,00,00,00,000 shares of Rs. 1 each. The proposal requires shareholder approval at an Extraordinary General Meeting scheduled for September 11, 2025, at 11:00 a.m. through video conferencing. The record date for the meeting is set for September 5, 2025. The company has appointed M/s. S.K. Jain & Co. as scrutinizer for the remote e-voting and e-voting process.",
            "Sentiment": "neutral",
            "PublishDate": 1754994206529,
            "Source": "corporate_action"
        },
        {
            "Title": "Excel Realty N Infra Limited Schedules Board Meeting to Consider Financial Results and Corporate Changes",
            "Summary": "Excel Realty N Infra Limited has scheduled a Board of Directors meeting for July 28, 2025, at 12:00 Noon. The board will consider and approve unaudited standalone and consolidated financial results for the quarter ended June 30, 2025, along with the statutory auditor's limited review report. The meeting agenda also includes appointing an additional director as executive director, increasing authorized share capital, altering the main clause of the company, and potentially changing the company name. The company was formerly known as Excel Infoways Ltd and trades on BSE and NSE under the symbol EXCEL.",
            "Sentiment": "neutral",
            "PublishDate": 1753193170466,
            "Source": "corporate_action"
        },
        {
            "Title": "Excel Realty N Infra Reports Increased Q2 Net Profit",
            "Summary": "Excel Realty N Infra has reported a net profit of 12 million rupees for the second quarter, compared to 5 million rupees in the same period last year, representing a significant year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730099542000,
            "Source": "result"
        }
    ]
}