{
    "Symbol": "EXCELINDUS",
    "ISIN": "INE369A01029",
    "News": [
        {
            "Title": "Excel Industries Q3 Net Profit Jumps 31% to ₹84M",
            "Summary": "Excel Industries reported strong Q3 performance with net profit rising 31% to ₹84 million and revenue growing 17% to ₹2.30 billion compared to previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770126449916,
            "Source": "co_actions_results"
        },
        {
            "Title": "Excel Industries receives promoter reclassification request",
            "Summary": "Excel Industries Limited received application from promoter group member Malti D. Bhatia seeking reclassification to public category under SEBI Regulation 31A, holding 1,04,082 shares (0.83% stake).",
            "Sentiment": "neutral",
            "PublishDate": 1769594833636,
            "Source": "stocks"
        },
        {
            "Title": "Excel Industries Divests Stake in Associate Company Mobitrash Recycle Ventures",
            "Summary": "Excel Industries' wholly owned subsidiaries Kamaljyot Investments Limited and Excel Bio Resources Limited sold their entire 19.99% stakes each in Mobitrash Recycle Ventures Private Limited to promoter Ashwin C. Shroff for Rs. 19,990 each. The transaction resulted in Mobitrash Recycle Ventures ceasing to be an associate company of Excel Industries, with the deal completed on November 21, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763722308184,
            "Source": "corporate_action"
        },
        {
            "Title": "Excel Industries Reports 13% Revenue Decline in Q2 FY26 Due to Weak Agrochemical Demand",
            "Summary": "Excel Industries' quarterly revenue dropped to Rs 270 crores from Rs 310 crores in Q1 FY26, with EBITDA falling 29% to Rs 30 crores due to subdued agrochemical demand caused by extended monsoon season. The company signed a 5-year contract manufacturing agreement worth Rs 35-40 crores annually and maintains full-year EBITDA margin guidance of 13-15% despite expecting Q3 to remain lean.",
            "Sentiment": "neutral",
            "PublishDate": 1763614975931,
            "Source": "earnings"
        },
        {
            "Title": "Excel Industries Reports Q2 FY26 Revenue of ₹270 Crores, Announces New 5-Year Contract Manufacturing Deal",
            "Summary": "Excel Industries recorded revenue of ₹270 crores in Q2 FY26 with EBITDA margin of 11.1%, impacted by prolonged monsoon affecting agro demand and weak offtake in key products. The company secured a new 5-year contract manufacturing agreement with a leading Indian specialty chemicals company, expected to generate ₹35-40 crores annually in job work charges.",
            "Sentiment": "neutral",
            "PublishDate": 1763095230512,
            "Source": "earnings"
        },
        {
            "Title": "Excel Industries Signs 400 Million Rupee Supply Agreement with Indian Specialty Chemicals Company",
            "Summary": "Excel Industries has entered into a long-term supply agreement with an Indian specialty chemicals firm for a project valued at 400 million rupees. The deal establishes a strategic partnership in the specialty chemicals sector, potentially strengthening Excel Industries' supply chain and market position.",
            "Sentiment": "positive",
            "PublishDate": 1763044244468,
            "Source": "order&deals"
        },
        {
            "Title": "Excel Industries Reports 44% Drop in Quarterly Profit Despite Revenue Growth",
            "Summary": "Excel Industries Limited announced unaudited financial results for the quarter ended September 30, 2025. The company's revenue from operations decreased to Rs 27,019.31 lakhs from Rs 30,947.07 lakhs in the previous quarter. Net profit after tax declined significantly to Rs 1,872.78 lakhs compared to Rs 3,356.25 lakhs in the preceding quarter. For the half-year period, revenue reached Rs 57,966.38 lakhs versus Rs 53,381.56 lakhs in the corresponding period last year, while net profit was Rs 5,229.03 lakhs compared to Rs 6,572.79 lakhs previously. Basic earnings per share for the quarter stood at Rs 14.90 compared to Rs 26.70 in the previous quarter. The Board meeting was held on November 11, 2025, where these results were approved. The company operates in chemicals business, environment & biotech division, focusing on polymer inputs, pharmaceutical intermediates, and veterinary APIs.",
            "Sentiment": "negative",
            "PublishDate": 1762909396298,
            "Source": "earnings"
        },
        {
            "Title": "Excel Industries Reports 41% Drop in Q2 Net Profit Despite Revenue Growth",
            "Summary": "Excel Industries reported Q2 consolidated net profit of 212 million rupees, down from 357 million rupees in the same period last year. Revenue increased marginally to 2.7 billion rupees from 2.68 billion rupees year-over-year. EBITDA declined to 299 million rupees from 490 million rupees, while EBITDA margin compressed to 11.07% from 18.21% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762870152661,
            "Source": "earnings"
        },
        {
            "Title": "DGTR Launches Anti-Dumping Investigation Into Chinese Organophosphonates Affecting Excel Industries",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has initiated an investigation into alleged anti-dumping practices involving certain organophosphonates imported from China. The investigation covers HEDP (1-Hydroxyethylidene-1,1-diphosphonic acid) and ATMP (Amino trimethylene phosphonic acid) acids. Excel Industries appears to be connected to this trade investigation, though the specific nature of their involvement is not detailed in the available information.",
            "Sentiment": "neutral",
            "PublishDate": 1759202952896,
            "Source": "stock"
        },
        {
            "Title": "Excel Industries Reports Strong Q1 FY26 Results with 25% Revenue Growth",
            "Summary": "Excel Industries Limited reported revenue of ₹309 crores for Q1 FY26, marking a 25% increase compared to Q4 FY25. The growth was primarily driven by better demand in the agro-intermediates segment. EBITDA improved significantly to ₹42 crores with margin expanding to 13.7% from 8.0% in the previous quarter, supported by better price realization and improved demand. PAT reached ₹34 crores with a margin of 10.8%. Exports accounted for 22% of total revenue and grew by 38% over Q4 FY25. The company maintains market share in key products while focusing on product portfolio diversification. Excel Industries manufactures agrochemical intermediates, specialty chemicals, polymer inputs, pharmaceutical intermediates and APIs, operating manufacturing facilities at Roha, Lote, and Vishakhapatnam.",
            "Sentiment": "positive",
            "PublishDate": 1754986639954,
            "Source": "earnings"
        },
        {
            "Title": "Excel Industries Reports Q1 FY2026 Financial Results with Revenue of Rs 26,491 Lakhs",
            "Summary": "Excel Industries Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs 26,490.86 lakhs compared to Rs 30,947.07 lakhs in the previous quarter. Net profit after tax stood at Rs 3,148.15 lakhs versus Rs 3,356.25 lakhs in the prior quarter. On a consolidated basis, revenue from operations was Rs 26,490.86 lakhs with net profit of Rs 3,375.84 lakhs. The company's earnings per share was Rs 25.04 for the quarter. Excel Industries has restructured its segment reporting and now operates as a single 'Chemicals' segment. The results were reviewed by the Audit Committee and approved by the Board of Directors at meetings held on August 8, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754660264884,
            "Source": "earnings"
        },
        {
            "Title": "Excel Industries Reports Q4 Results and Dividend Announcement",
            "Summary": "Excel Industries has announced its Q4 financial results and dividend recommendation. The company's Q4 consolidated net profit increased to 124 million rupees from 67 million rupees year-over-year. Revenue rose to 2.5 billion rupees from 2.3 billion rupees. EBITDA improved to 196 million rupees with a margin of 7.90%. The company has recommended a dividend of 13.75 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747232735000,
            "Source": "result"
        },
        {
            "Title": "Excel Industries Approves Capacity Expansion in Biocides Segment",
            "Summary": "Excel Industries has approved a capacity addition of 2,530 TPA (Tonnes Per Annum) in its biocides segment. This expansion will increase the company's total capacity in this segment from 2,645 TPA to 5,175 TPA, nearly doubling its production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1743487144000,
            "Source": "corporate_action"
        },
        {
            "Title": "Excel Industries Approves Capacity Expansion for Biocides Product",
            "Summary": "Excel Industries has approved a capacity addition of 2,530 TPA (tonnes per annum) for its biocides product line. The company plans to invest 103.3 million rupees in this expansion project.",
            "Sentiment": "positive",
            "PublishDate": 1743167053000,
            "Source": "corporate_action"
        },
        {
            "Title": "Excel Industries Reports Significant Profit Growth in Q3",
            "Summary": "Excel Industries has announced its Q3 financial results, showing a substantial increase in net profit. The company's consolidated net profit rose to 62 million rupees, up from 27 million rupees in the same quarter last year. Revenue also saw an increase, reaching 1.96 billion rupees compared to 1.8 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1739146373000,
            "Source": "earnings"
        },
        {
            "Title": "Excel Industries Reports Significant EBITDA Growth in Q3",
            "Summary": "Excel Industries has announced its Q3 financial results, showing a substantial improvement in EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization). The company's EBITDA increased to 121 million rupees, up from 17 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin expanded to 6.15% from 0.92% year-over-year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1738937830000,
            "Source": "earnings"
        },
        {
            "Title": "Excel Industries Reports Strong Q3 Financial Results",
            "Summary": "Excel Industries has announced its Q3 financial results, showing significant improvement in both revenue and net profit. The company's consolidated net profit increased to 62 million rupees, up from 27 million rupees in the same quarter last year. Revenue also saw growth, reaching 1.96 billion rupees compared to 1.8 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738937825000,
            "Source": "earnings"
        },
        {
            "Title": "Excel Industries Reports Strong Q2 Financial Results",
            "Summary": "Excel Industries has announced its Q2 financial results, showing significant year-over-year improvements. The company's consolidated net profit rose to 357 million rupees, up from 18 million rupees in the same quarter last year. Revenue increased to 2.68 billion rupees from 1.98 billion rupees. EBITDA saw a substantial jump to 490 million rupees from 26 million rupees, with the EBITDA margin improving to 18.21% from 1.34% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731455697000,
            "Source": "result"
        },
        {
            "Title": "Excel Industries Schedules Q2 Results Board Meeting",
            "Summary": "<p>Excel Industries has announced that its <span class='neutral'>board of directors</span> will meet on <b>November 12</b> to <span class='neutral'>consider and approve</span> the company's <span class='neutral'>financial results</span> for the <b>second quarter</b> of the current <span class='neutral'>fiscal year</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728384275000,
            "Source": "result"
        }
    ]
}