{
    "Symbol": "EXCELSOFT",
    "ISIN": "INE606N01019",
    "News": [
        {
            "Title": "Excelsoft Technologies Q3 FY26 Net Profit Surges 40% YoY",
            "Summary": "Excelsoft Technologies reports strong Q3 FY26 performance with net profit up 40% YoY to ₹13.34 crore and total income rising 29% YoY to ₹75.68 crore, driven by educational technology services growth.",
            "Sentiment": "positive",
            "PublishDate": 1770457192093,
            "Source": "co_actions_results"
        },
        {
            "Title": "Excelsoft Technologies Q3FY26 Results Show Strong Growth",
            "Summary": "Excelsoft Technologies reported robust Q3FY26 performance with revenue rising 29.92% YoY to ₹713.25 million and net profit growing 13.34% to ₹110.30 million, alongside successful IPO completion.",
            "Sentiment": "positive",
            "PublishDate": 1770399900207,
            "Source": "co_actions_results"
        },
        {
            "Title": "Excelsoft Partners for Philippines Civil Service Exams",
            "Summary": "Excelsoft Technologies partners with ASEAMETRICS to deliver Civil Service Commission of Philippines' digital examination system CSC DeX starting 2026, with first phase covering 50,000 tests.",
            "Sentiment": "positive",
            "PublishDate": 1768570795279,
            "Source": "stocks"
        },
        {
            "Title": "Excelsoft Withdraws ₹300 Cr Corporate Guarantee",
            "Summary": "Excelsoft Technologies Limited withdraws unconditional corporate guarantee of ₹300 crores issued for promoter company Pedanta Technologies, reducing contingent liability to ₹3.43 crores.",
            "Sentiment": "positive",
            "PublishDate": 1766160361006,
            "Source": "co_actions_results"
        },
        {
            "Title": "Excelsoft Q2H1 FY26 Earnings Call Transcript Filed",
            "Summary": "Excelsoft Technologies files Q2H1 FY26 earnings call transcript under Regulation 30, providing detailed insights into business operations, AI initiatives, and strategic partnerships.",
            "Sentiment": "positive",
            "PublishDate": 1765380551709,
            "Source": "co_actions_results"
        }
    ]
}