{
    "Symbol": "EXICOM",
    "ISIN": "INE777F01014",
    "News": [
        {
            "Title": "Exicom Shareholders Approve Related Party Transactions",
            "Summary": "Exicom Tele-Systems Limited shareholders approved four material related party transaction resolutions through postal ballot concluded February 01, 2026, with overwhelming support exceeding 99% for all proposals.",
            "Sentiment": "positive",
            "PublishDate": 1770132906402,
            "Source": "co_actions_results"
        },
        {
            "Title": "Exicom Board Approves Material Related Party Deals",
            "Summary": "Exicom Tele-Systems board approves material related party transactions between company and subsidiaries, subject to shareholder approval via postal ballot notice.",
            "Sentiment": "neutral",
            "PublishDate": 1767179555412,
            "Source": "stocks"
        },
        {
            "Title": "Exicom Launches Integrated EV Charging Solution",
            "Summary": "Exicom Tele-Systems introduces 'Exicom One' on December 18, 2025, targeting CPOs, EV manufacturers, and fleet operators with integrated charging technology.",
            "Sentiment": "positive",
            "PublishDate": 1766036082569,
            "Source": "stocks"
        },
        {
            "Title": "Exicom Clarifies Trading Volume Surge to BSE",
            "Summary": "Exicom Tele-Systems responds to BSE surveillance query about increased trading volume, stating no material events requiring disclosure and attributing surge to market-driven factors.",
            "Sentiment": "neutral",
            "PublishDate": 1765958421580,
            "Source": "stocks"
        },
        {
            "Title": "Exicom Tele-Systems Reports Promoter Group Shareholding Restructuring Following NCLT-Approved Amalgamation",
            "Summary": "Satellite Finance Private Limited's shareholding in Exicom Tele-Systems increased from 3.26% to 6.32% following NCLT-sanctioned amalgamation of two promoter group entities. The merger involved transfer of 42,51,619 equity shares from Vinsan Brothers Private Limited to Satellite Finance, with overall promoter group shareholding remaining unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1764845264140,
            "Source": "corporate_action"
        },
        {
            "Title": "Exicom Tele-Systems Reports 52% Revenue Growth in Q2 FY26, Driven by Critical Power and EV Charging Segments",
            "Summary": "Exicom Tele-Systems delivered strong quarterly results with standalone revenue reaching INR 228 crores, representing 52% quarter-on-quarter growth and 54% year-on-year growth. The Critical Power business grew approximately 60% driven by heightened tower installation activity and BharatNet project deliveries, with the company supplying solutions for 5,000 sites. The EV charging segment recorded 27% quarter-on-quarter growth and 55% year-on-year growth, achieving highest-ever AC charger sales of over 20,000 units. The company maintains a strong order backlog of over INR 1,400 crores and expects trial production at its new Hyderabad facility to begin in November, with commercial production starting in January. However, consolidated EBITDA remains under pressure due to continued losses from Tritium subsidiary, though management expects this to improve with external financing of $40 million being arranged for Tritium.",
            "Sentiment": "positive",
            "PublishDate": 1762943743255,
            "Source": "earnings"
        },
        {
            "Title": "Exicom Tele-Systems Reports Progress on IPO and Rights Issue Fund Utilization",
            "Summary": "Exicom Tele-Systems Limited submitted monitoring agency reports from CARE Ratings for fund utilization from its Rs 400 crore IPO and Rs 259.41 crore rights issue for the quarter ended September 30, 2025. The IPO proceeds show Rs 45.60 crore remaining unutilized, with the company receiving board approval to extend the utilization timeline to March 31, 2026. Key utilizations include Rs 32.24 crore for manufacturing facility setup, Rs 20.65 crore for working capital, and Rs 6.03 crore for R&D activities. The rights issue proceeds were utilized for Rs 56.73 crore investment in wholly-owned subsidiary for Tritium business operations, Rs 55 crore for loan repayments, Rs 3.49 crore for general corporate purposes, and Rs 2.44 crore for issue expenses. The company reported total operating income of Rs 213.53 crore and PBILDT of negative Rs 30.37 crore. Revenue was impacted by slowdown in telecom equipment industry and subdued EV sales, with margins compressed due to industry moderation and initial costs from Tritium acquisition.",
            "Sentiment": "neutral",
            "PublishDate": 1762805724835,
            "Source": "stock"
        },
        {
            "Title": "Exicom Tele-Systems Reports Strong Q2 FY26 Revenue Growth Despite Consolidated Losses",
            "Summary": "Exicom Tele-Systems delivered strong quarterly results with standalone revenue growing 54% year-over-year to Rs 228.4 crore in Q2 FY26. The Critical Power business segment grew 53% YoY while EV chargers segment expanded 55% YoY on standalone basis. The company achieved highest-ever AC charger sales by volume (20,000 units) and revenue during the quarter. However, consolidated results showed losses with EBITDA at negative Rs 32.7 crore and PAT at negative Rs 68.8 crore, primarily due to Tritium's ongoing losses. On standalone basis, the company reported positive EBITDA of Rs 15.2 crore (6.6% margin) and PAT of Rs 5.9 crore (2.6% margin). The company has commenced deliveries for the BharatNet project and secured large orders for Lithium-ion batteries worth Rs 60 crore. Export revenue contributed 11% of total quarterly revenue from Africa and Southeast Asia markets. The new Hyderabad manufacturing facility is in final stages of completion with trial runs planned shortly.",
            "Sentiment": "neutral",
            "PublishDate": 1762772105566,
            "Source": "earnings"
        },
        {
            "Title": "Exicom Tele-Systems Approves Trial Runs at New Telangana Plant and Notes $40M Fundraise by Netherlands Subsidiary",
            "Summary": "Exicom Tele-Systems' board approved the commencement of trial runs at its new manufacturing facility in Telangana starting November 12, 2025. The company will begin full-scale commercial operations after successful completion of trial runs, with the exact date to be determined by management. The board also noted the in-principle approval by its wholly-owned subsidiary Exicom Power Solutions B.V., Netherlands, for an external fundraise of up to USD 40 million through equity shares and convertible securities. The funds will be allocated towards product commercialization, working capital, and fixed cost coverage to drive Tritium's self-sustaining expansion and path to revenue and EBITDA breakeven. Additionally, the board approved unaudited financial results for the second quarter and half year ended September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762769537180,
            "Source": "earnings"
        },
        {
            "Title": "Exicom Power Solutions Board Approves $40 Million Fundraising for Expansion",
            "Summary": "Exicom Power Solutions' board has approved a $40 million fundraising plan. The funds are intended for expansion activities and to help the company reach EBITDA break-even.",
            "Sentiment": "positive",
            "PublishDate": 1762768630595,
            "Source": "stock"
        },
        {
            "Title": "Exicom Tele Systems Reports Wider Q2 Loss Despite Revenue Growth",
            "Summary": "Exicom Tele Systems reported a consolidated net loss of 688 million rupees in Q2, significantly higher than the 170 million rupee loss in the same quarter last year. However, the company's revenue grew substantially to 2.8 billion rupees compared to 1.5 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762767718815,
            "Source": "earnings"
        },
        {
            "Title": "Exicom Tele-Systems Completes Fourth Tranche Investment of EUR 1.52 Million in Netherlands Subsidiary",
            "Summary": "Exicom Tele-Systems Limited completed its fourth tranche investment in wholly-owned subsidiary Exicom Power Solutions B.V., Netherlands. The company subscribed to an additional EUR 15,15,500 ordinary shares with a nominal value of EUR 1 each, for a total cash consideration of EUR 15,15,500 (equivalent to Rs. 15,47,21,184). The subsidiary operates in the Electric Vehicle Supply Equipment Sector and Telecom Sector, focusing on manufacturing Electric Vehicle Chargers. Incorporated on January 8, 2024, the subsidiary reported a turnover of Rs. 0.25 crores and a loss of Rs. 16.20 crores as of March 31, 2025. The investment aims to meet fund requirements for capitalizing on growing business opportunities and global expansion plans. Exicom Tele-Systems continues to maintain 100% shareholding in the Netherlands-based subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1762436205888,
            "Source": "corporate_action"
        },
        {
            "Title": "DRI Conducts Search Operations at Exicom Tele-Systems' Gurugram Offices",
            "Summary": "The Directorate of Revenue Intelligence (DRI) conducted search operations at Exicom Tele-Systems' offices in Gurugram. The company stated it is fully cooperative with the authorities and confirmed that the searches have not impacted its business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1761839916647,
            "Source": "stock"
        },
        {
            "Title": "Exicom Faces Rs 14.49 Crore Customs Duty Demand Over Import Classification Dispute",
            "Summary": "Exicom Tele-Systems received a show cause notice from the Principal Commissioner of Customs demanding Rs 14.49 crore in differential duty, interest, and penalties. The customs authority alleges the company mis-declared imported goods as 'Static Converters for Telecom' and wrongly claimed duty exemption, when the goods were actually meant for Electric Vehicle chargers which are not eligible for the exemption. The company has 30 days to respond to the notice and believes the demand is not maintainable based on preliminary assessment. Exicom does not expect any material impact on its financials or operations at this stage. The company cited internal communication delays and public holidays for the delayed disclosure of the regulatory notice.",
            "Sentiment": "negative",
            "PublishDate": 1759499512851,
            "Source": "stock"
        },
        {
            "Title": "Exicom Backs Mobile EV Charging Startup Charger on Wheels",
            "Summary": "Exicom Tele-Systems Limited announced its backing of Charger on Wheels, a mobile EV charging startup. The partnership will enable Charger on Wheels to strengthen their technology platform and scale mobile EV charging services. Exicom's Managing Director Anant Nahata stated that mobile EV charging can help bridge gaps in grid readiness for EV charging setup in urban areas through a capital-light solution. Charger on Wheels founder Anil Kumar noted they have partnerships with leading developers for residential charging via mobile vans, addressing limited grid availability and fire safety restrictions in urban India. This partnership adds to Exicom's recent collaborations with Hubject, Ionage, and Mufin Green Infra to strengthen the EV ecosystem. Exicom has sold over 133,000 chargers worldwide across India, Southeast Asia, Middle East, US, and Europe.",
            "Sentiment": "positive",
            "PublishDate": 1758522433069,
            "Source": "stock"
        },
        {
            "Title": "Exicom Tele-Systems Reports Q1 FY26 Revenue of INR 205 Crores, Posts Consolidated Loss Due to Tritium Operations",
            "Summary": "Exicom Tele-Systems reported quarterly results with standalone revenue of INR 151 crores, down 29% quarter-on-quarter and 38% year-on-year. Consolidated revenue reached INR 205 crores, declining 23% quarter-on-quarter. The company posted standalone adjusted PAT of INR 1.1 crores but recorded consolidated adjusted PAT loss of INR 71 crores, primarily due to losses from acquired subsidiary Tritium. Revenue shortfall was attributed to project delays in Bharat Net and other key projects, with deliveries expected to shift to Q2. The company maintains its guidance of 50% revenue growth and 2.5x EBITDA increase for the full year on standalone basis. EV charging business showed growth with 61% increase compared to the same quarter last year, delivering over 15,000 chargers. The company completed a rights issue of INR 260 crores and expects its Hyderabad manufacturing plant to begin operations in October 2025. Order backlog exceeds INR 1,500 crores with hardware supply orders of INR 1,200 crores.",
            "Sentiment": "negative",
            "PublishDate": 1755500565320,
            "Source": "earnings"
        },
        {
            "Title": "Exicom Reports Mixed Q1 FY26 Results with Revenue Decline and Losses Despite Strong Order Backlog",
            "Summary": "Exicom Tele-Systems reported quarterly results with standalone revenue of Rs 150.7 crore and consolidated revenue of Rs 205.3 crore. The company posted an adjusted standalone PAT of Rs 1.1 crore (0.7% margin) but recorded a consolidated adjusted loss of Rs 71.1 crore (-34.6% margin). Critical Power segment revenue declined 38% year-over-year to Rs 97.8 crore standalone, while EVSE segment grew 61.5% to Rs 52.8 crore standalone. The company cited project delays due to approvals and monsoon as factors affecting performance, but highlighted a strong order backlog exceeding Rs 1,500 crore as of July 1st. Tritium achieved USD 8 million in bookings during the quarter. The company completed a right issue of approximately Rs 260 crore and continues construction of its Hyderabad manufacturing facility with expected start of production in October 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755022778324,
            "Source": "earnings"
        },
        {
            "Title": "Exicom Tele-Systems Reports Delays in IPO Fund Utilization, Extends Timeline to March 2026",
            "Summary": "Exicom Tele-Systems Limited submitted its monitoring agency report for the quarter ended June 30, 2025, showing utilization of Rs 291.82 crore out of Rs 400 crore raised through IPO and Pre-IPO placement. The company has experienced delays in fund deployment across key objectives including manufacturing facility setup in Telangana (67% completed), working capital requirements (70% utilized), and R&D investments (16% utilized). The Board has approved an extension until March 2026 for complete fund utilization. During the quarter, Rs 34.83 crore was utilized primarily for building construction, machinery procurement, working capital needs, and R&D activities. The company maintains Rs 108.18 crore in unutilized funds deployed in bank accounts and fixed deposits. CARE Ratings Limited reported no material deviations from the original objectives, though noted delays due to optimization work, project execution challenges, and external dependencies. The company also raised Rs 259 crore through a rights issue in July 2025 to support strategic initiatives.",
            "Sentiment": "neutral",
            "PublishDate": 1754925048050,
            "Source": "stock"
        },
        {
            "Title": "Exicom Tele-Systems Reports Net Loss of Rs 516 Crore in Q1 FY26 Despite 10% Revenue Growth",
            "Summary": "Exicom Tele-Systems reported consolidated revenue growth of 10.3% to Rs 1,437.05 crore in Q1 FY26, but posted a net loss of Rs 515.76 crore compared to a profit of Rs 115.93 crore in the same quarter last year. EBITDA declined 38.5% to Rs 60.54 crore with margins contracting to 4.2% from 7.6%. The EV charger segment showed strong performance with 46.8% revenue growth to Rs 833.34 crore, while the critical power segment declined 15.3% to Rs 464.73 crore. The company incurred one-time restructuring costs of Rs 89.99 crore and implemented a Voluntary Retirement Scheme during the quarter. The order book remains strong at Rs 2,800 crore. The Board also approved the appointment of M/s MZ & Associates as Secretarial Auditors for five years and extended the timeline for utilizing unutilized IPO proceeds of Rs 108.18 crore until March 31, 2026.",
            "Sentiment": "negative",
            "PublishDate": 1754920195069,
            "Source": "earnings"
        },
        {
            "Title": "Exicom Tele-Systems Raises INR 259.41 Crore Through Oversubscribed Rights Issue",
            "Summary": "Exicom Tele-Systems Limited completed its rights issue, raising approximately INR 259.41 crore through fully paid-up equity shares. The issue was oversubscribed and ran from July 15 to July 30, 2025, offering 18.14 lakh shares at INR 143 per share in a 3:20 ratio. Promoters subscribed approximately INR 120 crore, demonstrating their commitment to the company. The proceeds will primarily be used for debt reduction, with Exicom targeting a debt-to-equity ratio of 1:4 by the end of FY26. Additional funds will support general corporate expenses and global expansion plans through Tritium in the US, Europe, and Australia. Managing Director Anant Nahata highlighted advanced discussions for large global high-power charger deals expected to impact results from FY27, while noting strong momentum for their Harmony Direct 2.0 and Spin Air home chargers in India. CFO Shiraz Khanna emphasized the capital will enhance financial health and support sustainable growth.",
            "Sentiment": "positive",
            "PublishDate": 1754310574550,
            "Source": "corporate_action"
        },
        {
            "Title": "Exicom Tele-Systems Approves Rights Issue",
            "Summary": "Exicom Tele-Systems' board has approved a rights issue of ₹259.41 crore. The issue price is set at ₹143 per share, with a ratio of 3:20. This means shareholders will be offered 3 new shares for every 20 shares they currently hold.",
            "Sentiment": "positive",
            "PublishDate": 1751380866000,
            "Source": "default"
        },
        {
            "Title": "Exicom Tele-Systems Receives Initial Approval for Rights Issue",
            "Summary": "Exicom Tele-Systems has received initial approval for a rights issue worth ₹260 crore. The company is planning to raise funds through this corporate action, which allows existing shareholders to purchase additional shares at a discounted price.",
            "Sentiment": "positive",
            "PublishDate": 1751301131000,
            "Source": "default"
        },
        {
            "Title": "Exicom Tele-Systems: Board Approves ₹260 Crore Rights Issue and Loan Conversion",
            "Summary": "Exicom Tele-Systems' board approved a ₹260 crore rights issue and the conversion of a ₹283 crore unsecured loan to its foreign subsidiary into equity. The loan conversion aims to improve liquidity and operations. Shares surged over 18% on June 25.",
            "Sentiment": "positive",
            "PublishDate": 1750843665000,
            "Source": "corporate_action"
        },
        {
            "Title": "Exicom Tele-Systems Approves Conversion of Unsecured Loan",
            "Summary": "Exicom Tele-Systems has approved the conversion of an unsecured loan and accrued interest, totaling approximately Rs 283.20 crores. The company's board has given the green light for this financial decision.",
            "Sentiment": "neutral",
            "PublishDate": 1750838981000,
            "Source": "default"
        },
        {
            "Title": "Exicom Tele-Systems Approves Rights Issue",
            "Summary": "Exicom Tele-Systems has approved a rights issue to raise 2.60 billion rupees. The company plans to issue new shares to existing shareholders, allowing them to purchase additional stock at a potentially discounted price.",
            "Sentiment": "positive",
            "PublishDate": 1750838908000,
            "Source": "default"
        },
        {
            "Title": "Exicom Tele-Systems to Review Fundraising via Rights Issue",
            "Summary": "Exicom Tele-Systems has announced that its board will meet on June 25 to review a potential fundraising through a rights issue.",
            "Sentiment": "neutral",
            "PublishDate": 1750425375000,
            "Source": "default"
        },
        {
            "Title": "EXICOM TELE SYSTEMS Reports Q4 Net Loss of 622.7M Rupees",
            "Summary": "EXICOM TELE SYSTEMS reported a consolidated net loss of 622.7 million rupees in the latest quarter, compared to a profit of 275 million rupees in the same quarter last year. The loss increased from 490 million rupees in the previous quarter. Revenue for the quarter was 2.66 billion rupees, down from 3 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1748018450000,
            "Source": "result"
        },
        {
            "Title": "EXICOM TELE Launches New DC Fast Chargers",
            "Summary": "EXICOM TELE has successfully launched its Harmony Direct 2.0 DC Fast Chargers and Tritium TRI-FLEX. The news indicates the company has introduced new charging technology products to the market.",
            "Sentiment": "positive",
            "PublishDate": 1747898550000,
            "Source": "default"
        },
        {
            "Title": "Exicom Tele-Systems to Discuss Fund-Raising via Equity Issuance",
            "Summary": "Exicom Tele-Systems has scheduled a board meeting for May 23 to explore opportunities for raising funds through equity issuance.",
            "Sentiment": "neutral",
            "PublishDate": 1747741172000,
            "Source": "default"
        },
        {
            "Title": "EXICOM and IONAGE Partner to Expand EV Charging Network in India",
            "Summary": "EXICOM, an electric vehicle (EV) charging infrastructure company, has partnered with IONAGE to create a more accessible and open EV charging network in India. This collaboration aims to improve the availability and accessibility of EV charging stations across the country, potentially accelerating the adoption of electric vehicles in the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1742976114000,
            "Source": "corporate_action"
        },
        {
            "Title": "Exicom Tele Systems Reports Q3 Financial Results",
            "Summary": "Exicom Tele Systems has reported a consolidated net loss of 490 million rupees in the third quarter, compared to a profit of 100 million rupees in the same period last year. The company's revenue for Q3 decreased to 1.97 billion rupees from 2.6 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738801355000,
            "Source": "earnings"
        },
        {
            "Title": "EXICOM TELE SYSTEMS Reports Q3 Financial Results",
            "Summary": "EXICOM TELE SYSTEMS has reported a consolidated net loss of 490 million rupees for the third quarter, compared to a profit of 100 million rupees in the same period last year. The company's revenue for Q3 decreased to 1.97 billion rupees from 2.6 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738751166000,
            "Source": "earnings"
        },
        {
            "Title": "EXICOM Tele-Systems Partners with Tesco Chargezone for EV Charging Infrastructure",
            "Summary": "EXICOM Tele-Systems has signed a Memorandum of Understanding (MOU) with Tesco Chargezone Limited to develop and deploy over 500 high-power electric vehicle (EV) charging stations. These charging stations are described as future-ready and will include integration with renewable energy sources, indicating a commitment to sustainable transportation infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1737959421000,
            "Source": "corporate_action"
        },
        {
            "Title": "Exicom Tele-Systems Partners with ChargeZone for EV Charging Infrastructure",
            "Summary": "Exicom Tele-Systems has announced a collaboration with ChargeZone to develop and deploy high-power electric vehicle (EV) charging stations across India. This partnership aims to expand the EV charging infrastructure in the country, potentially accelerating the adoption of electric vehicles.",
            "Sentiment": "positive",
            "PublishDate": 1737959339000,
            "Source": "corporate_action"
        },
        {
            "Title": "Exicom Tele-Systems: Rs 1,412-Crore Order Boosts Stock",
            "Summary": "Exicom Tele-Systems received a Rs 1,412-crore order from Rail Vikas Nigam Ltd for telecom equipment supply and maintenance. The order includes Rs 1,004.97 crore for capital expenditure and Rs 407.51 crore for operational expenditure over 10 years, supporting the Bharat Net Phase III project in Uttar Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1737703139000,
            "Source": "order&deals"
        },
        {
            "Title": "Exicom Tele-Systems Secures 10-Year Telecom Equipment Contract",
            "Summary": "Exicom Tele-Systems has received an order for the supply and maintenance of telecom equipment. The contract includes a 10-year maintenance agreement, indicating a long-term commitment and potential revenue stream for the company.",
            "Sentiment": "positive",
            "PublishDate": 1737699280000,
            "Source": "order&deals"
        },
        {
            "Title": "Exicom Tele-Systems Secures Major Order Worth 14.1 Billion Rupees",
            "Summary": "Exicom Tele-Systems has won a significant order valued at 14.1 billion rupees. This substantial contract represents a major business opportunity for the company and could potentially impact its financial performance positively.",
            "Sentiment": "positive",
            "PublishDate": 1737699230000,
            "Source": "order&deals"
        },
        {
            "Title": "EXICOM Integrates Renewable Energy and EV Charging Solutions",
            "Summary": "EXICOM has unveiled new solutions that combine renewable energy with advanced electric vehicle (EV) charging technology at the Bharat Mobility 2025 event. This integration aims to enhance the sustainability and efficiency of EV charging infrastructure, potentially addressing key challenges in the adoption of electric vehicles.",
            "Sentiment": "positive",
            "PublishDate": 1737096221000,
            "Source": "corporate_action"
        },
        {
            "Title": "Exicom Tele-systems Signs MoU with Mufin Green Infra for EV Charging Solutions",
            "Summary": "Exicom Tele-systems has entered into a Memorandum of Understanding (MoU) with Mufin Green Infra to provide electric vehicle (EV) charging solutions. As part of this agreement, Exicom will manufacture chargers equipped with proprietary software. This collaboration aims to enhance the EV charging infrastructure and promote sustainable transportation solutions.",
            "Sentiment": "positive",
            "PublishDate": 1736295408000,
            "Source": "corporate_action"
        },
        {
            "Title": "EXICOM Tele-Systems Signs MOU with Mufin Green Infra for EV Charging Solutions",
            "Summary": "EXICOM Tele-Systems has entered into a Memorandum of Understanding (MOU) with Mufin Green Infra to provide electric vehicle (EV) charging solutions. As part of this agreement, EXICOM will manufacture chargers equipped with proprietary software, potentially enhancing their EV charging technology offerings.",
            "Sentiment": "positive",
            "PublishDate": 1736248486000,
            "Source": "corporate_action"
        },
        {
            "Title": "Exicom Tele Systems Reports Reduced Q2 EBITDA Loss",
            "Summary": "Exicom Tele Systems has reported a Q2 EBITDA loss of 146 million rupees, which is an improvement from the 235 million rupee loss in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1731492038000,
            "Source": "result"
        },
        {
            "Title": "EXICOM TELE SYSTEMS Reports Q2 Financial Results",
            "Summary": "EXICOM TELE SYSTEMS has reported a consolidated net loss of 170 million rupees in Q2, compared to a profit of 178 million rupees in the same quarter last year. The company's revenue for Q2 decreased to 1.5 billion rupees from 1.9 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731491820000,
            "Source": "result"
        },
        {
            "Title": "EXICOM Tele-Systems Converts 2.5B Rupees Loan to Shares",
            "Summary": "<p>EXICOM Tele-Systems has approved the <span class='neutral'>conversion</span> of a <span class='positive'>2.5 billion rupees loan</span> extended to one of its units into <span class='neutral'>shares</span>. This decision represents a <b>significant financial restructuring</b> within the company.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728653154000,
            "Source": "corporate_action"
        },
        {
            "Title": "Exicom: Indian EV Charging Firm Acquires US-based Tritium for $37 Million",
            "Summary": "<p><span class='positive'>Exicom</span>, an <span class='neutral'>Indian EV charging solutions company</span>, has <span class='positive'>acquired</span> <span class='neutral'>US-based DC fast charging technology firm</span> <span class='positive'>Tritium</span> for <b>$37 million</b> (approx. Rs 310 crore). Exicom will <span class='positive'>set up a manufacturing unit</span> in <span class='neutral'>Hyderabad</span> using Tritium's technology, expected to be <span class='positive'>operational by end of 2025</span>. The deal covers operations in the <span class='neutral'>UK, Netherlands, US, and Australia</span>. Exicom has <span class='positive'>absorbed Tritium's 300 employees</span> and <span class='positive'>acquired its Tennessee facility</span>.<br/></p>",
            "Sentiment": "positive",
            "PublishDate": 1728221381000,
            "Source": "corporate_action"
        }
    ]
}