{
    "Symbol": "EXIDEIND",
    "ISIN": "INE302A01020",
    "News": [
        {
            "Title": "Exide Industries Q3 FY26 Results: Revenue Crosses ₹4,000 Cr",
            "Summary": "Exide Industries reported Q3 FY26 revenue exceeding ₹4,000 crores for the first time in its smallest quarter, with 5% YoY growth despite telecom and export challenges. Auto OEM segment surged 25% YoY while lithium-ion project progresses with ₹320 crores Q3 investment.",
            "Sentiment": "positive",
            "PublishDate": 1770634348695,
            "Source": "co_actions_results"
        },
        {
            "Title": "Exide Industries Plans Lithium-Ion Cell Shipments",
            "Summary": "Exide Industries announces plans to begin shipping lithium-ion cells to passenger vehicle and two-wheeler OEMs this financial year or early next year, with three-wheeler and e-rickshaw applications expected to drive initial revenue.",
            "Sentiment": "positive",
            "PublishDate": 1770175698967,
            "Source": "stocks"
        },
        {
            "Title": "Exide Industries Eyes Strong Export Growth & Margin Boost",
            "Summary": "Exide Industries forecasts robust export growth driven by new market opportunities and low base year effects. Company targets EBITDA margin improvement of 100-150 basis points.",
            "Sentiment": "positive",
            "PublishDate": 1770175676643,
            "Source": "stocks"
        },
        {
            "Title": "Exide Industries Eyes Growth Momentum in Q4",
            "Summary": "Exide Industries anticipates sustained growth trajectory from Q3 into Q4, with positive outlook for lead acid business driven by automotive, solar energy, and power backup demand.",
            "Sentiment": "positive",
            "PublishDate": 1770175646318,
            "Source": "stocks"
        },
        {
            "Title": "Exide Industries Implements January Price Hike",
            "Summary": "Exide Industries management confirms no Q3 price increases but implemented price hike in January, with potential stage-wise increases based on macro conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1770101732503,
            "Source": "stocks"
        },
        {
            "Title": "Exide Industries Secures Exclusive European Partnership",
            "Summary": "Exide Industries management announces securing a new exclusive partnership arrangement with a European partner during recent concall discussions.",
            "Sentiment": "positive",
            "PublishDate": 1770101573955,
            "Source": "stocks"
        },
        {
            "Title": "Exide to Ramp Up Supplies After Tariff Announcements",
            "Summary": "Exide Industries management announces plans to increase supply capacity following recent tariff policy changes, as revealed during company conference call discussions.",
            "Sentiment": "positive",
            "PublishDate": 1770101494452,
            "Source": "stocks"
        },
        {
            "Title": "Exide Industries Faces Rising Raw Material Costs",
            "Summary": "Exide Industries' Co MD highlights record high prices for silver, copper, sulphur, and tin, creating significant cost pressures for the battery manufacturer's operations.",
            "Sentiment": "negative",
            "PublishDate": 1769762997634,
            "Source": "stocks"
        },
        {
            "Title": "Exide Industries Invests ₹1,400 Crore in Li-ion Facility",
            "Summary": "Exide Industries has approved a substantial ₹1,400 crore investment in EESL to establish a lithium-ion cell production facility, marking a significant expansion into advanced battery technology.",
            "Sentiment": "positive",
            "PublishDate": 1769762969234,
            "Source": "stocks"
        },
        {
            "Title": "Exide Industries Q3 Net Profit Rises 5.31% to ₹2.58B",
            "Summary": "Exide Industries reported Q3 standalone net profit of ₹2.58 billion, up from ₹2.45 billion year-on-year, though slightly below analyst estimates of ₹2.63 billion.",
            "Sentiment": "positive",
            "PublishDate": 1769762091847,
            "Source": "co_actions_results"
        },
        {
            "Title": "Exide Industries Invests Rs. 50 Crore in Subsidiary",
            "Summary": "Exide Industries Limited invested Rs. 50 crore in wholly owned subsidiary Exide Energy Solutions Limited through rights issue, bringing total investment to Rs. 4,252.23 crore for lithium-ion battery manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1769601482405,
            "Source": "co_actions_results"
        },
        {
            "Title": "Exide Industries Q3FY26 Earnings Call on Feb 3",
            "Summary": "Exide Industries announces earnings conference call scheduled for February 03, 2026 at 12:00 PM IST to discuss Q3FY26 results, hosted by Investec Capital Services with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1769597363884,
            "Source": "co_actions_results"
        },
        {
            "Title": "Exide Industries Appoints Indranil Chatterjee as SMP",
            "Summary": "Exide Industries Limited has appointed Mr. Indranil Chatterjee as Senior Management Personnel effective January 12, 2026. He brings over three decades of manufacturing excellence experience.",
            "Sentiment": "positive",
            "PublishDate": 1768213240237,
            "Source": "stocks"
        },
        {
            "Title": "Exide Industries Board Meet Set for Jan 30, 2026",
            "Summary": "Exide Industries has scheduled a board meeting on January 30, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter and nine months ending December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766989481915,
            "Source": "co_actions_results"
        },
        {
            "Title": "Exide Industries Invests ₹180 Cr in EESL, Names New CEO",
            "Summary": "Exide Industries invested ₹180 crores in subsidiary EESL on December 23, 2025, bringing total investment to ₹4,202.23 crores. Pravin Ramchandra Saraf appointed as new MD & CEO following Mandar V Deo's resignation on December 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766468284658,
            "Source": "stocks"
        },
        {
            "Title": "Exide Industries Invests 750 Million Rupees in Exide Energy Solutions for Advanced Battery Manufacturing",
            "Summary": "Exide Industries has invested 750 million rupees in Exide Energy Solutions to expand into manufacturing advanced battery cells including cylindrical, pouch, and prismatic formats. The investment will enable the company to manufacture, assemble, and sell battery modules, battery packs, and related products in the growing energy storage market.",
            "Sentiment": "positive",
            "PublishDate": 1764115845934,
            "Source": "corporate_action"
        },
        {
            "Title": "Exide Industries Reports Q2 FY26 Results with Mixed Performance Amid GST Rate Cuts",
            "Summary": "Exide Industries experienced a 2.1% decline in Q2 FY26 revenue due to distributor destocking following GST rate cuts on batteries from 28% to 18%, leading to production cuts and margin pressure from input cost inflation. The company's lithium-ion cell manufacturing project nears completion with INR 3,947 crores invested to date, targeting production start by end of FY26 while engaging with 2-wheeler and stationary energy OEMs for supply agreements.",
            "Sentiment": "neutral",
            "PublishDate": 1763717971151,
            "Source": "earnings"
        },
        {
            "Title": "LIC Increases Stake in Exide Industries to 5.023% Through Open Market Purchase",
            "Summary": "Life Insurance Corporation of India acquired 262,000 shares of Exide Industries through open market purchase on November 19, 2025, increasing its shareholding from 4.992% to 5.023%. The acquisition triggered mandatory disclosure requirements under SEBI regulations as LIC's holding crossed the 5% threshold in the battery manufacturer.",
            "Sentiment": "neutral",
            "PublishDate": 1763700222688,
            "Source": "corporate_action"
        },
        {
            "Title": "Exide Industries Shares Rise as Management Forecasts Strong Q3 Recovery Driven by GST Cuts",
            "Summary": "Exide Industries shares recovered to trade 1% higher after management predicted a sharp rebound in solar business and overall growth in Q3, citing recent GST cuts and strong underlying demand despite weak quarterly results. The battery manufacturer reported a 25.8% decline in net profit to ₹221 crore and 2.1% revenue drop to ₹4,178 crore for the September quarter, while progressing on lithium-ion cell manufacturing plans.",
            "Sentiment": "neutral",
            "PublishDate": 1763369125565,
            "Source": "stock"
        },
        {
            "Title": "Exide Management Targets 12-13% Margin Demonstration",
            "Summary": "Exide's management stated during a conference call that the company will be substantially able to demonstrate margins of 12-13%. The guidance indicates the company's confidence in achieving improved profitability levels in its operations.",
            "Sentiment": "positive",
            "PublishDate": 1763363951195,
            "Source": "stock"
        },
        {
            "Title": "Exide Expects Rapid Solar Business Expansion Following Government Support and GST Reduction",
            "Summary": "Exide announced during a conference call that it anticipates scaling up its solar business quickly to aspirational levels. The company attributes this optimistic outlook to government schemes and reduced GST rates in the solar sector.",
            "Sentiment": "positive",
            "PublishDate": 1763363545465,
            "Source": "stock"
        },
        {
            "Title": "Exide Management Expresses Confidence in Q3 Sales Recovery",
            "Summary": "Exide's management stated during a conference call that they are very confident about strong sales growth in the next quarter. The company expects pent-up demand from Q2 to materialize in Q3, which should drive sales performance upward.",
            "Sentiment": "positive",
            "PublishDate": 1763362790073,
            "Source": "stock"
        },
        {
            "Title": "Exide Management Warns of Continued Export Challenges Due to Tariff Issues",
            "Summary": "Exide's management indicated during a conference call that the company's export business is expected to face continued difficulties in upcoming quarters. The anticipated challenges are attributed to ongoing tariff-related situations affecting the company's international sales operations.",
            "Sentiment": "negative",
            "PublishDate": 1763361964286,
            "Source": "stock"
        },
        {
            "Title": "Exide Industries Reports 1.3% Revenue Growth Despite GST Transition Impact in H1 FY26",
            "Summary": "Exide Industries achieved standalone revenues of Rs. 8,688 crores in H1 FY26 with 1.3% YoY growth, though EBITDA margin compressed to 10.9% due to higher input costs and GST rate transition challenges. The company reduced production in August-September anticipating subdued demand from channel destocking after GST rate cuts on batteries from 28% to 18%, while continuing investments of Rs. 580 crores in its lithium-ion cell manufacturing project EESL.",
            "Sentiment": "negative",
            "PublishDate": 1763138129022,
            "Source": "earnings"
        },
        {
            "Title": "Exide Industries Schedules Q2 FY26 Earnings Call for November 17, 2025",
            "Summary": "Exide Industries Limited has announced an earnings conference call scheduled for Monday, November 17, 2025, at 12:00 PM IST to discuss Q2 FY25-26 business updates. The call will be hosted by Investec Capital Services and will feature senior management including Managing Director & CEO Avik Roy, Director-Finance & CFO Manoj Kumar Agarwal, and Company Secretary Jitendra Kumar. The earnings call is being arranged for investors and analysts as a group conference call, with dial-in numbers provided for various international locations including the USA, UK, Singapore, and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1762944901126,
            "Source": "corporate_action"
        },
        {
            "Title": "Exide Industries Reschedules Board Meeting to November 14 Following Income Tax Survey",
            "Summary": "Exide Industries informed stock exchanges that the Income Tax department conducted a survey action under section 133A of the Income Tax Act, 1961 at the company's offices and manufacturing units in India. The survey action concluded and the company extended full cooperation throughout the process. The Board of Directors meeting originally scheduled for October 30, 2025 to consider and approve unaudited financial results for the quarter and half year ended September 30, 2025 has been rescheduled to November 14, 2025. The trading window for securities, which remains closed, will re-open on November 19, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762423214590,
            "Source": "corporate_action"
        },
        {
            "Title": "Exide Industries Postpones Board Meeting Due to Income Tax Office Inspection",
            "Summary": "Exide Industries has delayed its board meeting following an income tax check at its offices. The company has stated that there is no significant impact on its business operations from this development.",
            "Sentiment": "neutral",
            "PublishDate": 1761813492871,
            "Source": "stock"
        },
        {
            "Title": "Exide Industries Invests ₹65 Crore in Subsidiary Exide Energy Solutions",
            "Summary": "Exide Industries has invested ₹65 crore in its subsidiary Exide Energy Solutions Limited. This investment brings the company's total investment in the subsidiary to ₹3,947.23 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1761654507986,
            "Source": "stock"
        },
        {
            "Title": "Exide Industries Shareholders Approve Appointment of Two Whole-time Directors Through Postal Ballot",
            "Summary": "Exide Industries Limited shareholders approved two ordinary resolutions through remote e-voting postal ballot process that concluded on October 24, 2025. The resolutions appointed Mr. Rajeev Ramesh Chand Khandelwal (DIN: 08763979) and Mr. Pravin Ramchandra Saraf (DIN: 10137023) as Whole-time Directors for three-year terms from September 1, 2025 to August 31, 2028. Out of 12,87,396 total shareholders, 2,796 participated in the voting process. Both resolutions passed with requisite majority - the first resolution received 98.99% votes in favor, while the second resolution received 98.99% approval. The voting period ran from September 25 to October 24, 2025, with September 12, 2025 as the cut-off date for eligible voters. Scrutinizer S.M. Gupta of S.M. Gupta & Co. submitted the voting results report.",
            "Sentiment": "positive",
            "PublishDate": 1761320260157,
            "Source": "corporate_action"
        },
        {
            "Title": "Exide Industries Invests ₹80 Crore in Subsidiary for Bengaluru Lithium-Ion Plant",
            "Summary": "Exide Industries has invested ₹80 crore in its subsidiary Exide Energy Solutions. The investment will fund a lithium-ion cell manufacturing plant in Bengaluru.",
            "Sentiment": "positive",
            "PublishDate": 1758798566327,
            "Source": "stock"
        },
        {
            "Title": "Exide Industries Seeks Shareholder Approval for Two New Executive Director Appointments",
            "Summary": "Exide Industries has issued a postal ballot notice seeking shareholder approval for the appointment of two new Whole-time Directors. The company proposes to appoint Rajeev Ramesh Chand Khandelwal as Executive Director with a monthly basic salary of ₹12.22 lakh and Pravin Ramchandra Saraf as Executive Director with a monthly basic salary of ₹5.62 lakh. Both appointments are for three-year terms from September 1, 2025 to August 31, 2028. Khandelwal, who joined as Senior President & Head-Trade in November 2024, brings over 30 years of experience from companies like P&G, Gillette, and RPSG Group. Saraf, appointed as Senior President & Head-Operations in October 2024, has 35 years of experience with organizations including Bajaj, Bosch, and Crompton Greaves. The remote e-voting period runs from September 25 to October 24, 2025, with results to be declared by October 25, 2025. The Board currently comprises seven members and seeks to add these two Executive Directors to broaden its composition.",
            "Sentiment": "positive",
            "PublishDate": 1758709898296,
            "Source": "corporate_action"
        },
        {
            "Title": "Exide Industries Schedules Q2 Results Review for October 30",
            "Summary": "Exide Industries has announced that it will review its Q2 results on October 30. The company has set this date for examining its quarterly financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1758698002230,
            "Source": "earnings"
        },
        {
            "Title": "Government May Consider Incentive Program For Critical Mineral Recycling Process",
            "Summary": "The government may advocate for an incentive program related to critical mineral recycling processes. This development was reported in connection with Exide.",
            "Sentiment": "positive",
            "PublishDate": 1756890675063,
            "Source": "stock"
        },
        {
            "Title": "Exide Industries Invests Additional ₹100 Crore in Subsidiary for Lithium-Ion Battery Plant",
            "Summary": "Exide Industries has invested an additional ₹100 crore in its wholly owned subsidiary Exide Energy Solutions, bringing the total investment to ₹3,802 crore. The funding will support a greenfield lithium-ion cell manufacturing plant in Bengaluru, aimed at strengthening the company's EV battery business and long-term clean energy growth.",
            "Sentiment": "positive",
            "PublishDate": 1755687163307,
            "Source": "stock"
        },
        {
            "Title": "Exide Industries Reports 24% Jump in Net Profit to Rs 275 Crore",
            "Summary": "Exide Industries reported a 24% year-on-year increase in consolidated net profit to Rs 275 crore for Q1FY'26, compared to Rs 221 crore in the same period last year. Consolidated revenue from operations grew 5.9% to Rs 4,695 crore from Rs 4,436 crore previously. The company's profit before tax rose to Rs 385 crore from Rs 316 crore. EBITDA margin on standalone basis improved to 12.2% during the quarter, driven by better price realisation, favorable product mix, and cost optimization measures. The quarter saw double-digit growth in auto replacement, solar, and industrial UPS segments, while demand remained subdued in auto OEM and exports verticals. The company's lithium-ion cell manufacturing subsidiary, Exide Energy Solutions Ltd, invested Rs 300 crore in Q1FY'26 with an additional Rs 100 crore in July, and its greenfield facility is expected to begin production by the end of FY'26.",
            "Sentiment": "positive",
            "PublishDate": 1754402022222,
            "Source": "earnings"
        },
        {
            "Title": "Exide Industries Reports Progress on Lithium-Ion Cell Manufacturing Project",
            "Summary": "Exide Industries announced that construction for its lithium-ion cell manufacturing project is progressing well and remains on track for timely completion. The company aims to commence operations in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1754381242867,
            "Source": "stock"
        },
        {
            "Title": "Exide Industries Reports Strong Q1 Performance with Revenue Growth and Improved Margins",
            "Summary": "Exide Industries delivered solid quarterly results with revenue rising to 45.1 billion rupees from 43 billion rupees year-over-year. The company's EBITDA increased to 5.48 billion rupees compared to 4.94 billion rupees in the same period last year, while EBITDA margin expanded to 12.16% from 11.46%. Net profit grew to 3.2 billion rupees versus 2.8 billion rupees year-over-year, reflecting improved operational performance across key financial metrics.",
            "Sentiment": "positive",
            "PublishDate": 1754380650461,
            "Source": "earnings"
        },
        {
            "Title": "Exide Industries Invests 1 Billion Rupees in Subsidiary for Advanced Battery Cell Manufacturing",
            "Summary": "Exide Industries has invested 1 billion rupees in its subsidiary to manufacture advanced chemistry battery cells. This investment represents the company's expansion into advanced battery technology manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1753190192908,
            "Source": "stock"
        },
        {
            "Title": "China Reportedly Halts Magnet Exports to India, Affecting Exide's Battery Manufacturing",
            "Summary": "According to the news, China has reportedly stopped exporting magnets to India, which are crucial for battery manufacturing. The report specifically mentions that Exide, a battery manufacturer, heavily relies on magnets sourced from China for its production process.",
            "Sentiment": "negative",
            "PublishDate": 1748324623000,
            "Source": "default"
        },
        {
            "Title": "Exide Industries Reports Marginal Impact on EBITDA Margins Due to Higher Raw Material Prices",
            "Summary": "During a conference call, an executive from Exide Industries stated that the company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) margins were slightly affected by increased raw material costs.",
            "Sentiment": "neutral",
            "PublishDate": 1746588320000,
            "Source": "default"
        },
        {
            "Title": "Exide Industries: Q4 Profit Dips 10%, Announces Leadership Changes",
            "Summary": "Exide Industries reported a 10% decline in Q4 FY25 net profit to Rs 254.60 crore, despite a 3.7% revenue increase to Rs 4,159.42 crore. The company declared a dividend of Rs 2 per share and appointed Sridhar Gorthi as Chairman and Manoj Kumar Agarwal as Director-Finance and CEO.",
            "Sentiment": "neutral",
            "PublishDate": 1746009509000,
            "Source": "result,corporate_governance"
        },
        {
            "Title": "Exide Industries: Q4 Profit Declines 11%, Demand Expected to Improve",
            "Summary": "Exide Industries reported an 11% YoY decrease in Q4 net profit to ₹254 crore. Revenue rose 4% to ₹4,159 crore. EBITDA fell 9.6% to ₹466.6 crore, with margins impacted by high raw material prices. The company declared a dividend of ₹2 per share. It plans to invest ₹1,200 crore in Exide Energy Solution and maintains a positive outlook on future demand.",
            "Sentiment": "neutral",
            "PublishDate": 1746002950000,
            "Source": "earnings"
        },
        {
            "Title": "Exide Industries Reports Strong Growth and Progress on Lithium-Ion Plant",
            "Summary": "Exide Industries announces that construction of their lithium-ion cell manufacturing plant is progressing well, with operations expected to commence in FY'26. The company also reports strong double-digit growth in replacement demand for two-wheeler and four-wheeler batteries, driven by advanced mobility products.",
            "Sentiment": "positive",
            "PublishDate": 1746001721000,
            "Source": "default"
        },
        {
            "Title": "Exide Industries Announces Investment and Dividend",
            "Summary": "Exide Industries plans to invest up to 12 billion rupees in Exide Energy Solutions. Additionally, the company has declared a dividend of 2 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1746001254000,
            "Source": "result"
        },
        {
            "Title": "Exide Industries Q4 Financial Results",
            "Summary": "Exide Industries reported Q4 revenue of 41.6 billion rupees, up from 40.1 billion rupees year-over-year, exceeding estimates of 38.97 billion. EBITDA decreased to 4.67 billion rupees from 5.16 billion rupees, falling short of the estimated 4.75 billion. EBITDA margin declined to 11.23% from 12.9%, below the expected 11.9%. Net profit decreased to 2.55 billion rupees from 2.84 billion rupees, missing estimates of 2.66 billion.",
            "Sentiment": "neutral",
            "PublishDate": 1746001055000,
            "Source": "result"
        },
        {
            "Title": "Exide Industries Invests 3 Billion Rupees in Subsidiary Exide Energy Solutions",
            "Summary": "Exide Industries has made a significant investment of 3 billion rupees in its subsidiary, Exide Energy Solutions. This investment indicates a strategic move by the company to strengthen its position in the energy solutions sector.",
            "Sentiment": "positive",
            "PublishDate": 1745194889000,
            "Source": "default"
        },
        {
            "Title": "Exide Industries Invests 3 Billion Rupees in Subsidiary Exide Energy Solutions",
            "Summary": "Exide Industries has made a significant investment of 3 billion rupees in its subsidiary, Exide Energy Solutions. This investment demonstrates the company's commitment to expanding its energy solutions business and potentially strengthening its market position in this sector.",
            "Sentiment": "positive",
            "PublishDate": 1744893569000,
            "Source": "default"
        },
        {
            "Title": "Exide Industries to Consider Q4 Results on April 30",
            "Summary": "Exide Industries has announced that it will consider its fourth quarter (Q4) financial results on April 30. This indicates that the company is preparing to release its earnings report for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1743596885000,
            "Source": "result"
        },
        {
            "Title": "Exide Industries Reports Q3 Results and Announces Investment in Subsidiary",
            "Summary": "Exide Industries reported a slight increase in Q3 net profit to 2.45 billion rupees, up from 2.4 billion rupees year-over-year. Revenue also saw a marginal rise to 38.5 billion rupees from 38.4 billion rupees in the same period last year. The company announced plans to invest up to 3 billion rupees in its subsidiary, Exide Energy Solutions.",
            "Sentiment": "positive",
            "PublishDate": 1738109853000,
            "Source": "earnings"
        },
        {
            "Title": "Exide Industries to Invest Up to 3 Billion Rupees in Exide Energy Solutions",
            "Summary": "Exide Industries has announced plans to invest up to 3 billion rupees in Exide Energy Solutions. This significant investment indicates the company's commitment to expanding its energy solutions business, potentially focusing on areas such as battery technology or renewable energy storage solutions.",
            "Sentiment": "positive",
            "PublishDate": 1738076254000,
            "Source": "corporate_action"
        }
    ]
}