{
    "Symbol": "EXPLEOSOL",
    "ISIN": "INE201K01015",
    "News": [
        {
            "Title": "Expleo Solutions receives EPF notice for ₹55.59 lakh",
            "Summary": "Expleo Solutions Limited disclosed receiving a notice from EPFO for proceedings under Section 14B of EPF Act for the period 1996-2010, with damages of ₹55.59 lakh plus interest.",
            "Sentiment": "negative",
            "PublishDate": 1770804614573,
            "Source": "stocks"
        },
        {
            "Title": "Expleo Solutions Q3FY26 Results Show Mixed Performance",
            "Summary": "Expleo Solutions reported Q3FY26 results with consolidated revenue of ₹2,793.46 million and net profit of ₹221.28 million, impacted by ₹167.88 million exceptional charge from new Labour Codes implementation.",
            "Sentiment": "neutral",
            "PublishDate": 1770116668568,
            "Source": "co_actions_results"
        },
        {
            "Title": "Expleo Solutions faces Rs 2.55 Cr IT demand",
            "Summary": "Expleo Solutions Limited receives income tax demand of Rs 2.55 crore from Chennai IT authorities for Assessment Year 2013-14 due to disallowance of MAT credit utilization worth Rs 83 lakh.",
            "Sentiment": "negative",
            "PublishDate": 1769524730558,
            "Source": "stocks"
        },
        {
            "Title": "Expleo Solutions faces ₹2.17 cr IT demand on MAT credit",
            "Summary": "Expleo Solutions receives income tax demand of ₹2,16,77,078 from Chennai IT authorities for disallowance of MAT credit worth ₹80,00,000 for Assessment Year 2016-17. Company states no material impact on operations.",
            "Sentiment": "negative",
            "PublishDate": 1769181839963,
            "Source": "stocks"
        },
        {
            "Title": "Expleo Solutions Director Rajesh Krishnamurthy Resigns",
            "Summary": "Expleo Solutions Limited announces resignation of Non-Executive Director Mr. Rajesh Krishnamurthy (DIN: 08288884) effective January 12, 2026, citing personal reasons for the decision.",
            "Sentiment": "neutral",
            "PublishDate": 1765538859494,
            "Source": "stocks"
        },
        {
            "Title": "Expleo Solutions Reports Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "Expleo Solutions Limited's Board approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025, with statutory auditor review reports. The company's quarterly results show revenue from operations and comprehensive financial performance across its subsidiaries including Expleo Solutions Pte. Ltd., Expleo Solutions Arabia Limited, and Expleo Solutions UK Ltd.",
            "Sentiment": "neutral",
            "PublishDate": 1763067551607,
            "Source": "earnings"
        },
        {
            "Title": "Expleo Solutions Schedules Q2FY26 Results Announcement and Earnings Call",
            "Summary": "Expleo Solutions Limited will announce its second quarter and half year FY26 results on November 13, 2025. The company has scheduled an earnings conference call with analysts and investors for November 14, 2025 at 11:30 AM IST. The call will feature Managing Director CEO Mr. Phani Tangirala and Chief Financial Officer Mr. Periakaruppan Palaniappan. Expleo Solutions is listed on BSE and NSE, and is part of the global Expleo Group which provides engineering, technology and consulting services. The company has over 25 years of operating experience and serves more than 150 Banking Financial Services and Insurance clients across multiple regions including India, Asia Pacific, United States, United Kingdom, Europe and Middle East.",
            "Sentiment": "neutral",
            "PublishDate": 1762808428613,
            "Source": "earnings"
        },
        {
            "Title": "Expleo Solutions to Close Coimbatore Centre, Consolidate Operations in Chennai",
            "Summary": "Expleo Solutions Limited announced the closure of its Competence Centre in Coimbatore, Tamil Nadu. The company will consolidate this center with its MEPZ branch office in Chennai to improve delivery efficiency and administrative oversight. The Coimbatore centre contributed INR 5.43 million in revenue during FY 2024-25, representing 0.05% of total turnover, with a net worth of INR 29.11 million. The exact closure date will be communicated later. The Board of Directors has approved the closure for operational reasons.",
            "Sentiment": "neutral",
            "PublishDate": 1761040248338,
            "Source": "stock"
        },
        {
            "Title": "Expleo Solutions Receives Rs 6.19 Crore Tax Refund Following Tribunal Order",
            "Summary": "Expleo Solutions Limited received an order from the Assistant Commissioner of Income Tax, Corporate Circle 1 (1), Chennai, regarding Assessment Year 2009-10. The company had a deduction under section 10A amounting to Rs 16.15 crore that was initially disallowed. A Tribunal passed an order on May 7, 2019, allowing this deduction. Following the Tribunal's decision, the Assistant Commissioner has now determined a refund of Rs 6.19 crore payable to the company. The order was dated June 11, 2025, and received by the company on September 22, 2025. The company states there is no material impact on its financials, operations or other activities.",
            "Sentiment": "positive",
            "PublishDate": 1758627937150,
            "Source": "stock"
        },
        {
            "Title": "Expleo Solutions Reports 4.8% YoY Revenue Growth to Rs 2,666 Million in Q1 FY26",
            "Summary": "Expleo Solutions Limited reported total income of Rs 2,666 million for Q1 FY26, representing a 4.8% year-on-year increase from Rs 2,544 million in Q1 FY25. Operating revenue grew 3% to Rs 2,596 million compared to Rs 2,522 million in the previous year. However, adjusted EBITDA declined to Rs 332 million (12.8% margin) from Rs 397 million (15.8% margin) in Q1 FY25. Profit after tax including OCI remained stable at Rs 247 million (9.3% margin) versus Rs 237 million (9.3% margin) in the prior year quarter. Basic earnings per share decreased to Rs 13.16 from Rs 15.40 in Q1 FY25. The company's net cash position stood at Rs 2,382 million compared to Rs 2,606 million in Q1 FY25. CEO Phani Tangirala noted market challenges in Europe and project delays in the US and APAC regions, while highlighting the company's investments in artificial intelligence and digital transformation initiatives. The company expects improvement in the upcoming quarter with operations commencing in Saudi Arabia.",
            "Sentiment": "neutral",
            "PublishDate": 1755190618692,
            "Source": "earnings"
        },
        {
            "Title": "Expleo Solutions Reports Decline in Q1 Financial Performance",
            "Summary": "Expleo Solutions reported quarterly results showing a decline across key financial metrics. Revenue fell to 2.2 billion rupees from 2.5 billion rupees in the same period last year. Net profit dropped to 148 million rupees compared to 240 million rupees year-over-year. EBITDA decreased to 246 million rupees from 353 million rupees, while EBITDA margin contracted to 11.12% from 14% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1755181654510,
            "Source": "earnings"
        },
        {
            "Title": "Expleo Solutions Senior Director Prasad Govind Satkar Retires",
            "Summary": "Prasad Govind Satkar, Senior Director and Senior Management Personnel at Expleo Solutions Limited, retired from the company effective July 31, 2025. His retirement was announced through a regulatory disclosure, and he ceased to be a Senior Management Personnel at the close of business hours on that date.",
            "Sentiment": "neutral",
            "PublishDate": 1753969061812,
            "Source": "corporate_governance"
        },
        {
            "Title": "Expleo Solutions to Establish Subsidiary in GIFT City for Financial Services",
            "Summary": "Expleo Solutions has announced that its board has approved the establishment of a wholly owned subsidiary in GIFT City, Gujarat. This new subsidiary will focus on entering the financial services sector. GIFT City is a planned business district that promotes financial and technology services.",
            "Sentiment": "positive",
            "PublishDate": 1751033149000,
            "Source": "default"
        },
        {
            "Title": "Expleo Solutions Reports Q4 Financial Results",
            "Summary": "Expleo Solutions announced its Q4 financial results. The company's net profit for Q4 was 288.8 million rupees, compared to 135 million rupees year-over-year and 167.3 million rupees quarter-over-quarter. Q4 revenue was 2.56 billion rupees, versus 2.55 billion rupees year-over-year. The company reported an exceptional item of 95.71 million rupees. Q4 profit before tax (PBT) was 300.9 million rupees, compared to 232.6 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747955855000,
            "Source": "default"
        },
        {
            "Title": "Expleo Solutions Reports Q4 Financial Results",
            "Summary": "Expleo Solutions has released its Q4 financial results. The company reported revenue of 2.56 billion rupees, compared to 2.55 billion rupees in the same quarter last year. Q4 EBITDA increased to 359.3 million rupees from 321 million rupees year-over-year, with EBITDA margin improving to 14.04% from 12.57%. Profit before tax (PBT) rose to 300.9 million rupees from 232.6 million rupees. The company's net profit for Q4 significantly increased to 288.8 million rupees, up from 135 million rupees year-over-year and 167.3 million rupees quarter-over-quarter. An exceptional item of 95.71 million rupees was also reported.",
            "Sentiment": "positive",
            "PublishDate": 1747929190000,
            "Source": "result"
        },
        {
            "Title": "Expleo Solutions Announces Closure of UAE Subsidiary",
            "Summary": "Expleo Solutions has announced the closure of its subsidiary, Expleo Solutions FZE, located in the United Arab Emirates. This corporate action indicates a strategic decision by the company to restructure its operations in the Middle East region.",
            "Sentiment": "neutral",
            "PublishDate": 1743689979000,
            "Source": "corporate_action"
        },
        {
            "Title": "Expleo Solutions Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Expleo Solutions has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter stood at 352 million rupees, down from 384 million rupees in the same quarter last year. The EBITDA margin also decreased to 13.66% from 15.35% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738850577000,
            "Source": "earnings"
        },
        {
            "Title": "Expleo Solutions Reports Q3 Financial Results",
            "Summary": "Expleo Solutions has announced its financial results for the third quarter. The company reported a net profit of 167 million rupees, which is lower compared to both the previous year (303 million rupees) and the previous quarter (293 million rupees). However, the company's revenue increased to 2.57 billion rupees from 2.5 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738850506000,
            "Source": "earnings"
        },
        {
            "Title": "Expleo Solutions Reports Q2 Revenue Growth",
            "Summary": "Expleo Solutions has announced its Q2 revenue of 2.6 billion rupees, compared to 2.3 billion rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731594664000,
            "Source": "result"
        },
        {
            "Title": "Expleo Solutions Reports Strong Q2 Financial Performance",
            "Summary": "Expleo Solutions has announced its Q2 consolidated net profit, which has shown significant growth both year-over-year and quarter-over-quarter. The company reported a net profit of 354 million rupees, compared to 205 million rupees in the same quarter last year (YoY) and 239 million rupees in the previous quarter (QoQ).",
            "Sentiment": "positive",
            "PublishDate": 1731594621000,
            "Source": "result"
        }
    ]
}