{
    "Symbol": "FABTECH",
    "ISIN": "INE0HF201011",
    "News": [
        {
            "Title": "Fabtech Technologies Q3FY26 IPO Proceeds Report",
            "Summary": "Fabtech Technologies submits monitoring agency report for Q3FY26 showing minimal utilization of Rs 23,029.65 lakhs IPO proceeds with Rs 125.00 lakhs used for general corporate purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1770721041238,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fabtech Technologies Q3FY26 Earnings Call on Feb 10",
            "Summary": "Fabtech Technologies Limited has scheduled an earnings conference call on February 10, 2026, at 10:00 AM to discuss unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770315185431,
            "Source": "stocks"
        },
        {
            "Title": "Fabtech Technologies Q3FY26 Loss Widens to ₹567.79L",
            "Summary": "Fabtech Technologies reported consolidated net loss of ₹567.79 lakhs for Q3FY26 vs profit of ₹2,045.74 lakhs in Q3FY25, despite revenue declining to ₹6,275.99 lakhs from ₹10,431.54 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1770041093632,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fabtech Technologies Wins ₹330 Crore Order",
            "Summary": "Fabtech Technologies Cleanrooms has secured a significant order worth ₹330 million, marking a major business development for the company in the cleanroom solutions sector.",
            "Sentiment": "positive",
            "PublishDate": 1766147853309,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fabtech Technologies Cleanrooms Limited Clarifies Corporate Identity Distinction from Fabtech Technologies Limited",
            "Summary": "Fabtech Technologies Cleanrooms Limited issued a clarification stating that it operates as a separate, independently listed entity from Fabtech Technologies Limited, addressing misconceptions among investors and the public. FTCL focuses on India-based cleanroom infrastructure for pharma and biotech sectors, while FTL operates as an international turnkey life sciences infrastructure company across 62 countries.",
            "Sentiment": "neutral",
            "PublishDate": 1763448165064,
            "Source": "stock"
        },
        {
            "Title": "Fabtech Technologies Secures USD 7.8 Million Contract for Saudi Arabia Cleanroom Project",
            "Summary": "Fabtech Technologies Limited has secured a USD 7.8 million (approximately Rs. 65.52 crores) contract with a leading Saudi Arabian company partnered with an Argentinian multinational for cleanroom infrastructure installation. The project involves installing cleanroom infrastructure, HVAC, MEP and utilities according to good manufacturing practices standards for an Animal Vaccine Project at a plant in Dammam 3rd Industrial City.",
            "Sentiment": "positive",
            "PublishDate": 1763136360875,
            "Source": "order&deals"
        },
        {
            "Title": "Fabtech Technologies Reports 109.9% Revenue Growth in H1 FY26 Earnings Call",
            "Summary": "Fabtech Technologies Limited delivered total income of INR 19,322.80 lakhs with 109.9% year-on-year growth and net profit of INR 2,198.02 lakhs (101.6% growth) for H1 FY26, with EBITDA margins improving to 14.7%. The turnkey pharmaceutical engineering solutions provider maintains a strong order book of INR 90,441.87 lakhs as of July 2025, operating across 22 countries in MENA, GCC, and ECO Zone regions.",
            "Sentiment": "positive",
            "PublishDate": 1763100423438,
            "Source": "earnings"
        },
        {
            "Title": "Fabtech Technologies Schedules Quarterly Results Review for November 14",
            "Summary": "Fabtech Technologies will consider its quarterly results on November 14. The company has scheduled this date for reviewing its financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1762769039463,
            "Source": "earnings"
        },
        {
            "Title": "Fabtech Technologies Targets Growth in Bio-Pharma Equipment and Engineering Projects",
            "Summary": "Fabtech Technologies is targeting rapid growth across three key areas: bio-pharma equipment, modular facilities, and engineering turnkey projects. The company reports strong order visibility from vaccine manufacturing and API expansion projects. Fabtech is focusing on technology integration, global partnerships, and backward integration to strengthen margins and scale exports from India as a key pharma engineering hub.",
            "Sentiment": "positive",
            "PublishDate": 1762439385943,
            "Source": "stock"
        },
        {
            "Title": "Fabtech Technologies Reports Strong Q2 FY26 Results with 109.91% Revenue Growth",
            "Summary": "Fabtech Technologies Limited, a turnkey engineering solutions provider for pharmaceutical and healthcare sectors, reported quarterly results showing total income of ₹12,427.61 lakhs for Q2 FY26, representing 109.91% year-over-year growth. The company's EBITDA reached ₹3,363.53 lakhs with a margin of 27.06%, while net profit stood at ₹2,198.02 lakhs, marking 449.12% growth compared to the previous year. For the half-year period, total income was ₹19,322.80 lakhs with 101.57% growth. The company maintains operations across 62 countries with a current order book of ₹90,441.87 lakhs as of July 31, 2025. Fabtech derives 78% of its revenue from MENA, GCC, and ECO Zone markets and has delivered 135 projects globally. The company operates through various subsidiaries including FTS Cleanrooms Systems LLC and provides integrated solutions covering process equipment, cleanrooms, and water systems for life sciences facilities.",
            "Sentiment": "positive",
            "PublishDate": 1762436193685,
            "Source": "stock"
        },
        {
            "Title": "Fabtech Technologies Reports Net Loss of Rs 63.13 Lakhs in Q1 FY26",
            "Summary": "Fabtech Technologies Limited reported a net loss of Rs 63.13 lakhs for the quarter ended June 30, 2025, compared to a net profit of Rs 759.75 lakhs in the corresponding quarter of the previous year. Revenue from operations declined to Rs 3,012.65 lakhs from Rs 2,506.10 lakhs year-over-year. The company's basic earnings per share turned negative at Rs 2.83 compared to positive Rs 3.70 in the same quarter last year. The company completed its IPO of 1,20,60,000 equity shares at Rs 191 per share and got listed on NSE and BSE on October 7, 2025. The quarterly results were approved by the Board of Directors on October 27, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762285465759,
            "Source": "earnings"
        },
        {
            "Title": "Fabtech Technologies Reports Strong Q2 Results with 78% Revenue Growth",
            "Summary": "Fabtech Technologies Limited reported consolidated revenue from operations of Rs 12,148.07 lakhs for the quarter ended September 30, 2025, compared to Rs 6,800.68 lakhs in the previous quarter. Net profit surged to Rs 2,810.61 lakhs from a loss of Rs 612.59 lakhs in the prior quarter. For the half-year period, revenue reached Rs 18,948.75 lakhs with net profit of Rs 2,198.02 lakhs. The company completed its IPO of 1.20 crore equity shares at Rs 191 per share, with listing on NSE and BSE on October 7, 2025. Basic earnings per share for the quarter stood at Rs 8.68. The results include an exceptional item of Rs 177.49 lakhs representing profit from sale of 51% stake in a subsidiary LLP.",
            "Sentiment": "positive",
            "PublishDate": 1762261227156,
            "Source": "earnings"
        },
        {
            "Title": "Fabtech Technologies Schedules Earnings Call for Q1 and Q2 FY26 Results",
            "Summary": "Fabtech Technologies Limited has scheduled an earnings conference call for November 10, 2025, at 4:00 p.m. IST to discuss the company's financial results for the quarter ended June 30, 2025, and for the quarter and half-year ended September 30, 2025. The call will feature speakers from management including CEO Ashwani Kumar Singh and Chief Growth Officer Aman Anavkar. The company has provided dial-in numbers and login details for participants, recommending they join 10 minutes prior to the scheduled time.",
            "Sentiment": "neutral",
            "PublishDate": 1762245287375,
            "Source": "earnings"
        },
        {
            "Title": "Fabtech Technologies Secures ₹52 Crore Contract for Veterinary Manufacturing Facility in North Africa",
            "Summary": "Fabtech Technologies Limited has secured a ₹52 crore project to establish a veterinary medicines manufacturing facility in the Maghreb region of North Africa. The project includes complete design, engineering, cleanroom systems, utilities, and process equipment for a modern veterinary dosage manufacturing plant. With this new contract, the company's cumulative order book has reached ₹983.05 crore. The veterinary formulation market in the Maghreb region is projected to reach USD 500-700 million by 2030, driven by growing demand for livestock and companion animal health products, food security goals, and rising exports from North Africa.",
            "Sentiment": "positive",
            "PublishDate": 1762171191535,
            "Source": "stock"
        }
    ]
}