{
    "Symbol": "FAIRCHEMOR",
    "ISIN": "INE0DNW01011",
    "News": [
        {
            "Title": "Fairchem Organics Q3FY26 Earnings Call on Feb 9",
            "Summary": "Fairchem Organics Limited has scheduled an earnings conference call for February 9, 2026, at 3:00 PM to discuss Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770104850621,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fairchem Organics Completes Buyback Extinguishment",
            "Summary": "Fairchem Organics Limited successfully extinguished 4,25,000 equity shares under its buyback program, reducing share capital from 1,30,20,902 to 1,25,95,902 shares following completion of tender offer process.",
            "Sentiment": "neutral",
            "PublishDate": 1769837839428,
            "Source": "co_actions_results"
        },
        {
            "Title": "360 ONE Reduces Stake in Fairchem Organics Below 5% Through Open Market Sale",
            "Summary": "360 ONE Alternates Asset Management disposed of 4,21,570 shares (3.24%) in Fairchem Organics through open market transactions on November 21, 2025, reducing its total holding from 5.08% to 2.35%. The stake reduction below the 5% threshold triggered mandatory disclosure requirements under SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764332632170,
            "Source": "corporate_action"
        },
        {
            "Title": "360ONE Asset Management Reduces Stake in Fairchem Organics to 2.35%",
            "Summary": "360ONE Asset Management sold 4,21,570 shares (3.24% stake) in Fairchem Organics through open market transactions on November 21, 2025, reducing its total holding from 5.08% to 2.35%. The disposal triggered regulatory disclosure requirements as the stake reduction exceeded the 2% threshold mandated under SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764072891275,
            "Source": "corporate_action"
        },
        {
            "Title": "Fairchem Organics Seeks Shareholder Approval for ₹3,400 Crore Share Buyback Through Postal Ballot",
            "Summary": "Fairchem Organics Limited has initiated a postal ballot process to seek shareholder approval for buying back up to 4.25 lakh equity shares at ₹800 per share, totaling ₹3,400 crore through tender offer route. The buyback represents 3.26% of total paid-up equity capital and 16% of aggregate paid-up capital and free reserves, with e-voting scheduled from November 26 to December 26, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763979365080,
            "Source": "corporate_action"
        },
        {
            "Title": "Fairchem Organics Board Approves ₹3,400 Crore Share Buyback Through Tender Offer",
            "Summary": "Fairchem Organics Limited's board approved a buyback of up to 4,25,000 equity shares at ₹800 per share for a total amount not exceeding ₹3,400 lakhs through tender offer route. The buyback represents 3.26% of existing paid-up equity share capital and requires shareholder approval through special resolution via postal ballot, with promoters indicating they will not participate in the buyback.",
            "Sentiment": "positive",
            "PublishDate": 1763633151537,
            "Source": "corporate_action"
        },
        {
            "Title": "Fairchem Organics Board to Review Share Buyback Proposal",
            "Summary": "Fairchem Organics has scheduled a board meeting for November 20 to consider a share buyback proposal. The decision will affect existing shareholders and could impact the company's capital allocation strategy and share price dynamics.",
            "Sentiment": "neutral",
            "PublishDate": 1763422520111,
            "Source": "corporate_action"
        },
        {
            "Title": "Fairchem Organics Reports 20% Revenue Decline, CFO Announces Departure",
            "Summary": "Fairchem Organics reported quarterly revenue of INR 112 crores, declining 20% year-on-year with EBITDA margin at 3.77%, impacted by 50% U.S. tariffs on Indian chemicals and weaker domestic paint sector demand. CFO Rajan Jhaveri announced his resignation effective November 14, 2025, with Bhavesh Shah from Arvind Limited set to replace him as the company faces ongoing challenges from Chinese competition and raw material cost pressures.",
            "Sentiment": "negative",
            "PublishDate": 1763113727394,
            "Source": "earnings"
        },
        {
            "Title": "Fairchem Organics Reports 14.9% Revenue Decline in Q2 Due to Weak Paint Sector Demand and US Export Challenges",
            "Summary": "Fairchem Organics Limited reported revenue from operations of INR 1,115 million in Q2, down 14.9% in value terms and 19.9% in volume terms compared to the previous quarter. The decline was attributed to weaker offtake from the paints segment and discontinuation of prime product exports to the USA. EBITDA margins softened to 3.77% from 3.97% in Q1 due to firm raw material prices. The company faced additional challenges from 50% US tariffs on select Indian exports and market share pressures in the paints sector from new player entry. For H1, revenue stood at INR 2,426 million with EBITDA margins at 3.87%. Domestic sales accounted for 91.22% of revenue while exports contributed 8.78%. The company processed 11,492 MT and sold 10,469 MT during Q2. Isostearic Acid remains a key growth product, though European exports are slower than expected due to new regulatory registration requirements.",
            "Sentiment": "negative",
            "PublishDate": 1762748261717,
            "Source": "earnings"
        },
        {
            "Title": "Fairchem Organics Reports Q2 Results and Announces Key Management Changes",
            "Summary": "Fairchem Organics Limited's Board approved unaudited financial results for the quarter ended September 30, 2025. The company reported revenue from operations of Rs 11,152.27 lakhs for the quarter, compared to Rs 13,861.86 lakhs in the same quarter last year. Net profit after tax was Rs 77.22 lakhs versus Rs 401.06 lakhs in the previous year quarter. The company announced significant management changes effective November 15, 2025: Rajen Jhaveri will retire as Chief Financial Officer and Company Secretary on November 14, 2025. Bhavesh Bipinchandra Shah, a 44-year-old Chartered Accountant with 23 years of experience, will be appointed as the new Chief Financial Officer. Jatin Jain, aged around 40 years and an Associate Member of the Institute of Company Secretaries of India with over 17 years of experience, will be appointed as Company Secretary and Compliance Officer.",
            "Sentiment": "neutral",
            "PublishDate": 1762513989810,
            "Source": "corporate_governance"
        },
        {
            "Title": "Fairchem Organics Submits Audio Recording Link for Quarterly Earnings Call",
            "Summary": "Fairchem Organics Limited submitted an audio recording link of their earnings call discussing unaudited financial results for the quarter ended June 30, 2025. The earnings call was held on August 13, 2025, starting from 3:00 p.m. The company provided a website link to access the audio recording and submitted this information to both NSE and BSE exchanges. The submission was signed by Rajen Jhaveri, Chief Financial Officer & Company Secretary.",
            "Sentiment": "neutral",
            "PublishDate": 1755088888847,
            "Source": "earnings"
        },
        {
            "Title": "Fairchem Organics and Vikram Aroma Report Quarterly Financial Results",
            "Summary": "Fairchem Organics Limited published its unaudited financial results for the quarter ended June 30, 2025. The company reported total income from operations of Rs. 13,119.67 lakhs, compared to Rs. 16,516.45 lakhs in the same quarter last year. Net profit after tax was Rs. 117.36 lakhs versus Rs. 1,385.22 lakhs in the corresponding quarter of the previous year. Earnings per share declined to Rs. 0.90 from Rs. 10.64 in the same period last year. Vikram Aroma Limited also reported its quarterly results, showing total income from operations of Rs. 511.88 lakhs compared to Rs. 773.40 lakhs in the same quarter last year. The company posted a net profit after tax of Rs. 6.34 lakhs, turning profitable from a loss of Rs. 58.20 lakhs in the corresponding quarter of the previous year. Both companies' results were approved by their respective boards of directors.",
            "Sentiment": "negative",
            "PublishDate": 1755064308030,
            "Source": "earnings"
        },
        {
            "Title": "Fairchem Organics Reports Sharp Decline in Quarterly Financial Performance",
            "Summary": "Fairchem Organics reported quarterly net profit of 12 million rupees, down from 139 million rupees in the same period last year. Revenue fell to 1.3 billion rupees from 1.65 billion rupees year-over-year. EBITDA declined to 52 million rupees compared to 218 million rupees previously, while EBITDA margin compressed to 3.98% from 13.2% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1754903775253,
            "Source": "earnings"
        },
        {
            "Title": "Fairchem Organics Reports Q4 Results and Declares Dividend",
            "Summary": "Fairchem Organics has declared a dividend of 7.5 rupees per share. The company's Q4 financial results show a significant decline compared to the previous year. EBITDA decreased to 44 million rupees from 188 million rupees year-over-year, with the EBITDA margin falling to 3.66% from 11.68%. Revenue dropped to 1.2 billion rupees from 1.6 billion rupees. Net profit also saw a substantial decrease, coming in at 6 million rupees compared to 118 million rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1748333134000,
            "Source": "result"
        },
        {
            "Title": "Fairchem Organics Reports Decline in Q3 Profit and Revenue",
            "Summary": "Fairchem Organics has reported a significant decrease in both net profit and revenue for the third quarter. The company's net profit fell to 35 million rupees from 123 million rupees in the same period last year. Revenue also declined to 1.14 billion rupees from 1.5 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739405870000,
            "Source": "earnings"
        },
        {
            "Title": "Fairchem Organics Reports Significant Decline in Q3 EBITDA and Margin",
            "Summary": "Fairchem Organics has reported a substantial decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 78 million rupees, compared to 198 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin dropped to 6.90% from 13.38% year-over-year, indicating a significant reduction in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1739363099000,
            "Source": "earnings"
        },
        {
            "Title": "Fairchem Organics Reports Decline in Q3 Profit and Revenue",
            "Summary": "Fairchem Organics has reported a significant decrease in its third-quarter financial results. The company's net profit fell to 35 million rupees, down from 123 million rupees in the same quarter last year. Revenue also declined to 1.14 billion rupees from 1.5 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739363091000,
            "Source": "earnings"
        },
        {
            "Title": "Fairchem Organics Reports Q2 Financial Results",
            "Summary": "Fairchem Organics has announced its Q2 financial results. The company's net profit for the quarter stands at 40 million rupees, showing a significant decrease from 103 million rupees in the same quarter last year (YoY) and 138 million rupees in the previous quarter (QoQ). The Q2 revenue is reported at 1.38 billion rupees, down from 1.52 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1731456114000,
            "Source": "result"
        }
    ]
}