{
    "Symbol": "FAZE3Q",
    "ISIN": "INE963C01033",
    "News": [
        {
            "Title": "Faze Three Clarifies No Material Info Pending",
            "Summary": "Faze Three Limited responds to BSE inquiry on price movement, confirming all material information has been disclosed and no pending disclosures remain under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770353947665,
            "Source": "stocks"
        },
        {
            "Title": "Faze Three's Auditor MSKA Converts to LLP Structure",
            "Summary": "Faze Three Limited announces conversion of statutory auditor MSKA & Associates to LLP format effective January 13, 2026, with no change in audit engagement or tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1769593139445,
            "Source": "stocks"
        },
        {
            "Title": "Faze Three Reports Mixed Q2 Results with Revenue Growth But Declining Profitability",
            "Summary": "Faze Three reported Q2 revenue growth to 2.1B rupees from 1.52B rupees year-over-year, while EBITDA declined significantly to 60M rupees from 170M rupees. The company's EBITDA margin compressed to 2.90% from 11.18% year-over-year, though consolidated net loss improved to 52M rupees from 71M rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1763051727646,
            "Source": "earnings"
        },
        {
            "Title": "Faze Three Surges 20% on India-US Trade Deal Optimism",
            "Summary": "Faze Three Ltd., a home interior products manufacturer and exporter, hit a 20% upper circuit at ₹547 following optimism about potential India-US trade talks. The company generates 90% of revenue from exports to US, EU, and UK markets, with 57% specifically from the US. Other textile stocks including Gokaldas Exports and Welspun Living gained up to 9% after US President Donald Trump and Indian Prime Minister Narendra Modi expressed positive outlook on continuing trade discussions. Promoters hold 57% stake in Faze Three, while investor Ashish Kacholia owns 5.42% stake valued at ₹72 crore. Trading volume reached 6.5 lakh shares in the first hour versus 20-day average of 31,000 shares. The company has a market capitalization of ₹1,330 crore with no institutional holdings or analyst coverage.",
            "Sentiment": "positive",
            "PublishDate": 1757479344537,
            "Source": "stock"
        },
        {
            "Title": "Faze Three Limited Approves Q1 FY2026 Results, Sets 40th AGM for September 5",
            "Summary": "Faze Three Limited's Board approved unaudited financial results for Q1 FY2026 ended June 30, 2025. On standalone basis, revenue from operations was ₹204.72 crores compared to ₹198.79 crores in the previous quarter, with profit after tax of ₹12.76 crores versus ₹16.99 crores. On consolidated basis, revenue was ₹210.55 crores against ₹211.97 crores, with profit after tax of ₹10.04 crores compared to ₹17.43 crores. The Board recommended re-appointment of Mrs. Rashmi Anand as director and appointed Mr. Sanjay Dholakia as Secretarial Auditor for five years from FY2025-26 to FY2029-30. The 40th Annual General Meeting is scheduled for September 5, 2025 at 5:00 PM through video conferencing. The company manufactures and exports home textile products including bathmats, rugs, blankets, throws, and cushions.",
            "Sentiment": "neutral",
            "PublishDate": 1755015769458,
            "Source": "earnings"
        },
        {
            "Title": "Faze Three Limited Featured in Dun & Bradstreet Publication Following Business Excellence Award",
            "Summary": "Faze Three Limited announced its inclusion in Dun & Bradstreet's publication 'Rethinking the Future of India's Small and Mid-Sized Businesses 2025', featuring interviews with Managing Director Ajay Anand and President Vishnu Anand. The company achieved 3x revenue growth from 2019 to 2025, reaching INR 701.04 crores in FY25 compared to INR 225 crores in FY15. The textile manufacturer invested over INR 277 crores since FY 2019 through internal accruals, expanding capacity and diversifying its home textiles product portfolio. The company maintains zero long-term debt since FY2018 and holds an A (Stable)/A- credit rating from CARE Ratings. Faze Three delivered an 18% revenue CAGR and 20% EBITDA CAGR over five years, with quarterly revenue run rate crossing INR 200 crores in Q4 FY-2025. The company sources 95% of materials locally and focuses on serving top 10 retailers in USA, Europe, and UK markets.",
            "Sentiment": "positive",
            "PublishDate": 1753955802253,
            "Source": "stock"
        },
        {
            "Title": "Faze Three Reports Significant Profit and Revenue Growth in Q4",
            "Summary": "Faze Three has announced its Q4 consolidated financial results. The company's net profit increased to 174 million rupees, up from 89 million rupees year-over-year and quarter-over-quarter. Revenue for Q4 rose to 2.1 billion rupees, compared to 1.64 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1748223258000,
            "Source": "default"
        },
        {
            "Title": "Faze Three Reports Improved Q4 Financial Results",
            "Summary": "Faze Three has announced its Q4 financial results. The company's EBITDA increased to 260 million rupees from 184 million rupees year-over-year. The EBITDA margin improved to 12.32% from 11.21% in the same period. Consolidated net profit rose to 174 million rupees from 89 million rupees year-over-year, remaining stable quarter-on-quarter at 89 million rupees. Revenue for Q4 grew to 2.1 billion rupees from 1.64 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748008091000,
            "Source": "result"
        },
        {
            "Title": "Faze Three Reports Mixed Q3 Financial Results",
            "Summary": "Faze Three has announced its Q3 consolidated financial results. The company reported a net profit of 89 million rupees, which is lower compared to 127 million rupees in the same quarter last year (YoY) but higher than 71 million rupees in the previous quarter (QoQ). Revenue for Q3 increased to 1.8 billion rupees from 1.4 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739320445000,
            "Source": "earnings"
        },
        {
            "Title": "Faze Three Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Faze Three, an Indian company, has reported its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 220 million rupees from 234 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin declined to 12.33% from 16.92% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739281374000,
            "Source": "earnings"
        },
        {
            "Title": "Faze Three Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Faze Three, a company, has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 decreased to 170 million rupees from 230 million rupees in the same quarter last year. Additionally, the EBITDA margin fell to 11.18% from 17.42% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731503065000,
            "Source": "result"
        },
        {
            "Title": "Faze Three Reports Q2 Financial Results",
            "Summary": "Faze Three announced its Q2 consolidated financial results. The company reported a net profit of 71 million rupees, down from 126 million rupees year-over-year and 73 million rupees quarter-over-quarter. However, revenue increased to 1.52 billion rupees from 1.32 billion rupees compared to the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731503024000,
            "Source": "result"
        }
    ]
}