{
    "Symbol": "FCL",
    "ISIN": "INE045J01034",
    "News": [
        {
            "Title": "Fineotex Chemical Allots 50 Lakh Shares Worth ₹193.70 Cr",
            "Summary": "Fineotex Chemical Limited completes major equity allotment of 50 lakh shares at ₹38.74 per share following warrant conversion by non-promoter investor, expanding paid-up capital to ₹116.45 crore.",
            "Sentiment": "positive",
            "PublishDate": 1768837465749,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fineotex Chemical Completes $11.50M US Acquisition",
            "Summary": "Fineotex Chemical finalizes acquisition of Crude Chem Technologies Group for $11.50 million, targeting 25% CAGR growth and $200 million oilfield chemicals business with consolidation starting December 15, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765886922484,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fineotex Chemical Acquires Majority Stakes in Two US Companies for Combined USD 13,440",
            "Summary": "Fineotex Chemical acquired 53.33% stakes in Lonestar Technoblast LLC for up to USD 4,480 and Oil Pro Advantage Inc for up to USD 8,960. The acquisitions target companies with combined estimated FY 2024-25 revenues of USD 1.56 million, expanding Fineotex's international presence through strategic investments.",
            "Sentiment": "positive",
            "PublishDate": 1764923975394,
            "Source": "order&deals"
        },
        {
            "Title": "Fineotex Chemical Reports Decline in Q2 Financial Performance",
            "Summary": "Fineotex Chemical's Q2 results showed consolidated net profit dropping to 260M rupees from 318.5M rupees year-over-year, while revenue declined to 1.4B rupees from 1.5B rupees. The company's EBITDA decreased to 310M rupees from 363.9M rupees with EBITDA margin contracting to 22.53% from 24.97% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1763130651360,
            "Source": "earnings"
        }
    ]
}