{
    "Symbol": "FCSSOFT",
    "ISIN": "INE512B01022",
    "News": [
        {
            "Title": "FCS Software Solutions Q3 FY26 Results Show Losses",
            "Summary": "FCS Software Solutions reported standalone net loss of ₹240.52 lacs for Q3 FY26 vs profit of ₹49.01 lacs in Q3 FY25. Revenue declined to ₹766.75 lacs from ₹787.70 lacs YoY.",
            "Sentiment": "negative",
            "PublishDate": 1770639974629,
            "Source": "co_actions_results"
        },
        {
            "Title": "FCS Software Updates Related Party Transaction Policy",
            "Summary": "FCS Software Solutions Limited's Board approved an updated Related Party Transaction Policy in its 227th meeting held on February 09, 2026, incorporating SEBI Industry Standards.",
            "Sentiment": "neutral",
            "PublishDate": 1770639753500,
            "Source": "stocks"
        },
        {
            "Title": "FCS Software Solutions Reports Net Loss of ₹443.14 Lakhs in Q2 FY2026",
            "Summary": "FCS Software Solutions Limited reported quarterly results with a net loss of ₹443.14 lakhs for the quarter ended September 30, 2025, compared to a net loss of ₹954.39 lakhs in the same quarter of the previous year. The company's revenue from operations stood at ₹1,351.19 lakhs for the quarter. On a consolidated basis, the net loss was ₹259.03 lakhs for the quarter. The company's cash and cash equivalents decreased to ₹85.45 lakhs as of September 30, 2025, from ₹389.62 lakhs at the beginning of the year. The Board of Directors approved these unaudited financial results in their 226th meeting held on November 12, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762964762561,
            "Source": "earnings"
        },
        {
            "Title": "FCS Software Solutions Appoints Two New Independent Directors for Five-Year Terms",
            "Summary": "FCS Software Solutions Limited appointed Ms. Dolly Saini and Mr. Nitish Kumar Singh as Non-Executive Independent Directors for five-year terms effective July 22, 2025. The appointments were approved by shareholders at the company's 32nd Annual General Meeting held on August 19, 2025. Ms. Saini brings over a decade of expertise in governance, finance, and insurance, with experience as Women Director at New Light Apparels Limited and roles at HDFC Life and Edelweiss Tokio Life. Mr. Singh holds a Master's degree and has eight years of experience in IT Back Support. Both directors are not debarred from holding office by any regulatory authority. The meeting commenced at 11:30 AM and concluded at 12:14 PM.",
            "Sentiment": "positive",
            "PublishDate": 1755596917721,
            "Source": "corporate_governance"
        },
        {
            "Title": "FCS Software Solutions Appoints New Independent Director and Secretarial Auditors",
            "Summary": "FCS Software Solutions Limited's Board of Directors approved two key appointments during their meeting on July 22, 2025. The company appointed Mr. Nitish Kumar Singh as an Additional Non-Executive Independent Director for a five-year term effective July 22, 2025, subject to shareholder approval at the Annual General Meeting. Singh holds a Master's degree and has eight years of experience in IT Back Support. Additionally, the Board appointed M/s. Neeraj Arora & Associates as Secretarial Auditors for a five-year period from FY 2025-26 to FY 2029-2030, also pending shareholder approval. The auditing firm is established by Mr. Neeraj Arora, a Practicing Company Secretary with over 10 years of experience specializing in Company Law and Securities Laws. Both appointments were made based on recommendations from respective committees.",
            "Sentiment": "neutral",
            "PublishDate": 1753169704332,
            "Source": "corporate_governance"
        },
        {
            "Title": "FCS Software Solutions Reports Loss in Q1 FY26 Despite Revenue Growth",
            "Summary": "FCS Software Solutions Limited reported its quarterly results for the quarter ended June 30, 2025. On a standalone basis, the company posted a net loss of Rs 106.80 lacs compared to a profit of Rs 92.00 lacs in the previous quarter. Revenue from operations declined to Rs 622.37 lacs from Rs 731.79 lacs in the preceding quarter. On a consolidated basis, the company reported a net profit of Rs 42.69 lacs with revenue from operations at Rs 830.73 lacs compared to Rs 880.58 lacs in the previous quarter. Employee benefit expenses increased to Rs 464.95 lacs on standalone basis. The company's basic earnings per share on standalone basis was negative at Rs 0.006. The Board of Directors approved these unaudited financial results in their 225th meeting held on July 22, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1753167741002,
            "Source": "earnings"
        }
    ]
}