{
    "Symbol": "FDC",
    "ISIN": "INE258B01022",
    "News": [
        {
            "Title": "FDC Limited faces GST dept inspection at Mumbai office",
            "Summary": "Maharashtra GST Department initiated inspection proceedings at FDC Limited's corporate office in Mumbai on February 10, 2026, focusing on tax payments and input tax credits.",
            "Sentiment": "neutral",
            "PublishDate": 1770791145869,
            "Source": "stocks"
        },
        {
            "Title": "FDC Q3 EBITDA Rises 12% to ₹523M with Margin Expansion",
            "Summary": "FDC reports Q3 EBITDA of ₹523 million compared to ₹467 million year-over-year, with EBITDA margin improving to 11.3% from 10.05% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1770283655463,
            "Source": "co_actions_results"
        },
        {
            "Title": "FDC Limited Board Meeting Set for February 05, 2026",
            "Summary": "FDC Limited announces Board meeting on February 05, 2026 to consider interim dividend declaration in addition to previously intimated matters under SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1769780312846,
            "Source": "co_actions_results"
        },
        {
            "Title": "FDC Limited Approves Registered Office Shift to Mumbai",
            "Summary": "FDC Limited shareholders approved shifting registered office from Waluj to Mumbai through postal ballot with 99.99% votes in favor. The e-voting process concluded on January 27, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769595335430,
            "Source": "co_actions_results"
        },
        {
            "Title": "FDC Gets USFDA Nod for Fluconazole Tablets",
            "Summary": "FDC Limited receives US FDA approval for Fluconazole tablets across four dosage strengths - 50mg, 100mg, 150mg, and 200mg, expanding its pharmaceutical portfolio in the American market.",
            "Sentiment": "positive",
            "PublishDate": 1767941679361,
            "Source": "stocks"
        },
        {
            "Title": "FDC Gets US FDA Nod for Fluconazole Tablets",
            "Summary": "FDC Limited receives ANDA approval from U.S. FDA for Fluconazole Tablets USP in four different strengths - 50 mg, 100 mg, 150 mg and 200 mg, expanding its pharmaceutical portfolio in the US market.",
            "Sentiment": "positive",
            "PublishDate": 1767940830686,
            "Source": "stocks"
        },
        {
            "Title": "FDC Limited Receives ₹15.61 Cr GST Demand Notice",
            "Summary": "FDC Limited received GST demand notice of ₹15.61 crores from Maharashtra State Tax Department for alleged misclassification of tax rates during FY 2021-22. Company plans to contest demand through legal remedies.",
            "Sentiment": "negative",
            "PublishDate": 1767013332186,
            "Source": "stocks"
        },
        {
            "Title": "FDC Limited Board Approves Registered Office Shift",
            "Summary": "FDC Limited's Board approved shifting registered office from Waluj, Maharashtra to Mumbai, subject to member approval through postal ballot process scheduled for January 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766145332302,
            "Source": "stocks"
        },
        {
            "Title": "FDC Limited Reports Mixed Quarterly Performance with Revenue Decline and Profit Drop",
            "Summary": "FDC Limited announced its unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025. The pharmaceutical company's standalone revenue from operations decreased to Rs. 102,508.02 lakhs in the quarter compared to Rs. 108,600.49 lakhs in the same quarter last year. Standalone profit after tax declined to Rs. 12,571.32 lakhs from Rs. 18,407.85 lakhs year-over-year. On a consolidated basis, quarterly revenue fell to Rs. 103,773.60 lakhs from Rs. 109,854.89 lakhs, while consolidated profit after tax dropped to Rs. 12,584.17 lakhs from Rs. 18,670.01 lakhs. For the half-year period, standalone revenue increased to Rs. 209,838.66 lakhs from Rs. 197,261.76 lakhs, with profit after tax rising to Rs. 26,897.42 lakhs from Rs. 25,670.01 lakhs. The company recognized a fair value loss of Rs. 143.36 lakhs under other expenses during the quarter, though it recorded a net fair value gain of Rs. 1,905.36 lakhs for the half-year period. Basic and diluted earnings per share for the quarter stood at Rs. 7.72 compared to Rs. 11.30 in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762338691792,
            "Source": "earnings"
        },
        {
            "Title": "FDC Limited CFO Vijay Bhatt Resigns, Vishal Shah Appointed as Replacement",
            "Summary": "FDC Limited announced the resignation of Vijay Dharmadatt Bhatt from his position as Chief Financial Officer and Key Managerial Personnel, effective October 20, 2025. Bhatt cited pursuing better prospects as the reason for his departure. The Board of Directors accepted his resignation and appointed Vishal Shah as the new CFO and Key Managerial Personnel, effective October 24, 2025. Shah brings approximately 20 years of work experience in finance portfolios including Business Finance, Costing, Financial Reporting and Treasury within the pharmaceutical industry. The appointment was approved based on recommendations from the Nomination and Remuneration Committee and Audit Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1760704225514,
            "Source": "corporate_governance"
        },
        {
            "Title": "FDC Ltd Receives U.S. FDA Approval for Pilocarpine Hydrochloride Eye Drops",
            "Summary": "FDC Ltd has received U.S. FDA approval for Pilocarpine Hydrochloride Eye Drops available in three formulations: 1%, 2%, and 4% concentrations in 15 ML packaging. This approval allows the pharmaceutical company to market these eye drop products in the United States market.",
            "Sentiment": "positive",
            "PublishDate": 1759580426056,
            "Source": "stock"
        },
        {
            "Title": "FDC Limited Reports Strong Q1 Performance with 33% Profit Growth, Board Approves Executive Director Reappointment",
            "Summary": "FDC Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing revenue from operations of Rs 6,422.81 crores and net profit after tax of Rs 1,221.98 crores on standalone basis. The consolidated results showed revenue of Rs 6,484.06 crores with net profit of Rs 1,213.51 crores. Basic and diluted earnings per share stood at Rs 7.51 for standalone and Rs 7.45 for consolidated results. The Board also approved the reappointment of Mr. Ashok A. Chandavarkar as Executive Director for a five-year term from March 1, 2026 to February 28, 2031, subject to shareholder approval. Mr. Chandavarkar, who joined FDC in 1987 and became Executive Director in 1996, holds a Bachelor of Engineering (Mechanical) and has over 38 years of pharmaceutical industry experience. The company operates solely in the pharmaceuticals segment.",
            "Sentiment": "positive",
            "PublishDate": 1754557053134,
            "Source": "corporate_governance"
        },
        {
            "Title": "FDC Reports Flat Q1 Net Profit at 1.2B Rupees with Slight Revenue Growth",
            "Summary": "FDC reported Q1 consolidated net profit of 1.2 billion rupees, unchanged from the previous year. Revenue increased to 6.5 billion rupees from 6.4 billion rupees year-over-year. EBITDA declined to 1.4 billion rupees from 1.46 billion rupees, while EBITDA margin compressed to 21.64% from 22.97% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1754556000824,
            "Source": "earnings"
        },
        {
            "Title": "FDC Reports Q4 Financial Results",
            "Summary": "FDC has released its Q4 financial results. The company's EBITDA for Q4 was 539.8 million rupees, compared to 563 million rupees in the same quarter last year. The EBITDA margin decreased to 10.97% from 12.19% year-over-year. Revenue for Q4 increased to 4.92 billion rupees from 4.62 billion rupees in the previous year. Consolidated net profit for Q4 was 386.7 million rupees, down from 463 million rupees year-over-year, but up from 370.4 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748433331000,
            "Source": "result"
        },
        {
            "Title": "FDC Approves Rs 140 Crore Expansion of Liquid Oral Facility",
            "Summary": "FDC's board has approved a Rs 140 crore expansion of its liquid oral facility at the Sinnar plant. This expansion will add 77,000 KL capacity over the next 18-24 months, funded through internal accruals.",
            "Sentiment": "positive",
            "PublishDate": 1746003065000,
            "Source": "default"
        },
        {
            "Title": "FDC Reports Decline in Q3 Net Profit and Marginal Drop in Revenue",
            "Summary": "FDC (likely referring to FDC Limited) has reported its financial results for the third quarter. The company's consolidated net profit decreased to 370 million rupees from 792 million rupees in the same quarter last year, marking a significant year-over-year decline. Revenue for Q3 slightly decreased to 4.64 billion rupees from 4.6 billion rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1739353450000,
            "Source": "earnings"
        },
        {
            "Title": "FDC Receives FDA Approval for Cefixime 400 mg Tablets ANDA",
            "Summary": "FDC Limited has obtained approval from the United States Food and Drug Administration (FDA) for its Abbreviated New Drug Application (ANDA) for Cefixime 400 mg Tablets. This approval allows FDC to manufacture and market the generic version of this antibiotic in the US market.",
            "Sentiment": "positive",
            "PublishDate": 1734515850000,
            "Source": "corporate_action"
        },
        {
            "Title": "FDC's Baddi Facility Receives Clean FDA Inspection Report",
            "Summary": "FDC Limited announced that its manufacturing facility in Baddi, Himachal Pradesh, which was inspected by the U.S. Food and Drug Administration (USFDA) in August 2024, has received the Establishment Inspection Report (EIR) with no observations (zero 483's). This indicates that the facility passed the inspection without any significant issues being identified.",
            "Sentiment": "positive",
            "PublishDate": 1731501638000,
            "Source": "corporate_action"
        },
        {
            "Title": "FDC Approves Interim Dividend of Rs. 5 Per Share",
            "Summary": "FDC Limited has approved an interim dividend of Rs. 5 per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1730890406000,
            "Source": "corporate_action"
        },
        {
            "Title": "FDC Reports Q2 EBITDA and Margin Decline",
            "Summary": "FDC's Q2 EBITDA decreased to 702 million rupees from 764 million rupees year-over-year. The company's EBITDA margin also declined to 13.65% from 15.71% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730890396000,
            "Source": "result"
        },
        {
            "Title": "FDC Reports Q2 Revenue Growth",
            "Summary": "FDC has announced its second quarter revenue of 5.1 billion rupees, showing an increase from 4.9 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730890386000,
            "Source": "result"
        },
        {
            "Title": "FDC Reports Q2 Consolidated Net Profit",
            "Summary": "FDC (likely referring to FDC Limited) has reported a consolidated net profit of 720 million rupees for the second quarter. This represents a year-over-year increase from 698 million rupees and a quarter-over-quarter decrease from 1.2 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1730890378000,
            "Source": "result"
        }
    ]
}