{
    "Symbol": "FEDERALBNK",
    "ISIN": "INE171A01029",
    "News": [
        {
            "Title": "Federal Bank Allots 1.62 Lakh Shares Under ESOS",
            "Summary": "Federal Bank Limited allotted 1,62,531 equity shares under two Employee Stock Option Schemes on February 08, 2026, following approval from the Nomination, Remuneration, Ethics and Compensation Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1770875457327,
            "Source": "co_actions_results"
        },
        {
            "Title": "Federal Bank Gets RBI Nod for ICICI Prudential Stake",
            "Summary": "RBI approves ICICI Prudential Asset Management Company Limited along with ICICI Bank group entities to acquire up to 9.95% shareholding in Federal Bank, subject to regulatory compliance conditions.",
            "Sentiment": "positive",
            "PublishDate": 1770814000119,
            "Source": "co_actions_results"
        },
        {
            "Title": "Federal Bank Allots 61,552 Equity Shares Under ESOS",
            "Summary": "Federal Bank Limited allotted 61,552 equity shares under Employee Stock Option Schemes on February 01, 2026, comprising 2,500 shares under ESOS 2010 and 59,052 shares under ESOS 2017.",
            "Sentiment": "neutral",
            "PublishDate": 1769970544675,
            "Source": "co_actions_results"
        },
        {
            "Title": "Federal Bank Gets RBI Nod for SBI MF Stake Buy",
            "Summary": "Federal Bank received RBI approval on January 30, 2026, allowing SBI Mutual Fund to acquire up to 9.99% shareholding in the bank, subject to regulatory compliance conditions.",
            "Sentiment": "positive",
            "PublishDate": 1769859315051,
            "Source": "co_actions_results"
        },
        {
            "Title": "Federal Bank Allots 2.05 Lakh Shares Under ESOS",
            "Summary": "Federal Bank Limited allotted 2,05,701 equity shares under Employee Stock Option Schemes ESOS 2010 and ESOS 2017 on January 26, 2026, following committee approval and payment by option grantees.",
            "Sentiment": "positive",
            "PublishDate": 1769448967812,
            "Source": "co_actions_results"
        },
        {
            "Title": "Federal Bank Q3FY26 PAT Jumps 9% to ₹10.4b",
            "Summary": "Federal Bank delivers strong Q3FY26 performance with 9% YoY PAT growth to ₹10.4 billion, driven by NIM expansion and healthy loan growth. Motilal Oswal maintains BUY rating with target price of ₹310.",
            "Sentiment": "positive",
            "PublishDate": 1768982024773,
            "Source": "co_actions_results"
        },
        {
            "Title": "Federal Bank Gets Buy Rating with ₹275 Target Price",
            "Summary": "Prabhudas Lilladher maintains Buy rating on Federal Bank with revised target price of ₹275, citing strong quarterly performance with NIM rising to 3.18% and positive outlook on asset quality improvements.",
            "Sentiment": "positive",
            "PublishDate": 1768839127973,
            "Source": "stocks"
        },
        {
            "Title": "Federal Bank Allots 283,143 Equity Shares Under ESOS",
            "Summary": "Federal Bank Limited completed allotment of 283,143 equity shares on January 19, 2026, under two Employee Stock Option Schemes following exercise of stock options by employees.",
            "Sentiment": "neutral",
            "PublishDate": 1768805722314,
            "Source": "co_actions_results"
        },
        {
            "Title": "Federal Bank Q3FY26 Earnings Call Recording Available",
            "Summary": "Federal Bank has made available the audio recording of its Q3FY26 earnings call with analysts and investors held on January 16, 2026, discussing unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768581368275,
            "Source": "co_actions_results"
        },
        {
            "Title": "Federal Bank Q3 profit rises 9% to ₹1,041 crore",
            "Summary": "Federal Bank reported 9% growth in Q3 net profit to ₹1,041 crore, driven by improved NIM at 3.18% and 20% jump in other income. NPA ratios declined with advances growing 11% year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1768569755624,
            "Source": "co_actions_results"
        },
        {
            "Title": "Federal Bank Warns of Q4 Margin Pressure from Rate Cuts",
            "Summary": "Federal Bank management indicates that the bank will face margin pressure in Q4 due to ongoing rate cuts, signaling potential impact on profitability in the upcoming quarter.",
            "Sentiment": "negative",
            "PublishDate": 1768553403283,
            "Source": "stocks"
        },
        {
            "Title": "Federal Bank Deposits Rise 12% to ₹2.98 Trillion",
            "Summary": "Federal Bank reported total deposits of ₹2.98 trillion as of December 31, marking a strong 12% year-on-year growth, demonstrating the bank's expanding customer base and deposit mobilization capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1768548502397,
            "Source": "stocks"
        },
        {
            "Title": "Federal Bank shares surge 11% to 52-week high on Q3 results",
            "Summary": "Federal Bank shares zoomed 11.6% to hit fresh 52-week high of ₹273 after reporting strong Q3FY26 results with net profit up 8.98% YoY to ₹1,041.21 cr and record NII of ₹2,652.73 cr.",
            "Sentiment": "positive",
            "PublishDate": 1768548165069,
            "Source": "co_actions_results"
        },
        {
            "Title": "Federal Bank Q3: Profit rises 9% YoY to ₹1,041 cr",
            "Summary": "Federal Bank's Q3 net profit rose 9% to ₹1,041 crore, beating estimates. NII grew 9% to ₹2,653 crore while asset quality improved significantly. Stock surged 8% post-results.",
            "Sentiment": "positive",
            "PublishDate": 1768546763446,
            "Source": "co_actions_results"
        },
        {
            "Title": "Federal Bank's Auditor Converts to LLP Structure",
            "Summary": "Federal Bank announces that its statutory auditor M S K A & Associates has converted to Limited Liability Partnership structure effective January 13, 2026, with no change to existing audit engagement.",
            "Sentiment": "neutral",
            "PublishDate": 1768479327063,
            "Source": "stocks"
        },
        {
            "Title": "Federal Bank Chairman A P Hota to Retire Jan 2026",
            "Summary": "Federal Bank announces retirement of Part Time Chairman & Independent Director A P Hota effective January 14, 2026, after completing 8-year regulatory tenure on the Board.",
            "Sentiment": "neutral",
            "PublishDate": 1768390170161,
            "Source": "stocks"
        },
        {
            "Title": "Federal Bank Allots 1.35 Lakh Shares Under ESOS",
            "Summary": "Federal Bank Limited allotted 1,34,876 equity shares under its Employee Stock Option Schemes on January 11, 2026, comprising shares from both ESOS 2010 and ESOS 2017 schemes.",
            "Sentiment": "neutral",
            "PublishDate": 1768104475438,
            "Source": "co_actions_results"
        },
        {
            "Title": "Federal Bank Unveils New Logo and Brand Identity",
            "Summary": "Federal Bank announces refreshed brand identity with new 'Fortuna Wave' logo, reflecting core values of authenticity, togetherness, and prosperity while maintaining digital-first approach.",
            "Sentiment": "positive",
            "PublishDate": 1767712921815,
            "Source": "stocks"
        },
        {
            "Title": "Federal Bank Board Meet on Jan 16 for Q3FY26 Results",
            "Summary": "Federal Bank announces board meeting scheduled for January 16, 2026, to consider Q3FY26 financial results. Trading window closed from January 1-18, 2026 for designated persons.",
            "Sentiment": "neutral",
            "PublishDate": 1767440583050,
            "Source": "co_actions_results"
        },
        {
            "Title": "Federal Bank Gets CRISIL AAA Rating Reaffirmation",
            "Summary": "CRISIL Ratings reaffirmed Federal Bank's fixed deposits at 'CRISIL AAA/Stable' and short-term deposits at 'CRISIL A1+', maintaining the bank's strong credit profile and financial stability.",
            "Sentiment": "positive",
            "PublishDate": 1767100019929,
            "Source": "stocks"
        },
        {
            "Title": "Federal Bank Faces ₹23.37 Lakh GST Penalty from Delhi",
            "Summary": "Federal Bank received a penalty order of ₹23,36,830 from Department of Trade & Taxes, New Delhi on December 29, 2025, under Section 73 of CGST Act 2017. The bank plans to file an appeal.",
            "Sentiment": "negative",
            "PublishDate": 1767019061007,
            "Source": "stocks"
        },
        {
            "Title": "Citi Downgrades Federal Bank to Neutral at ₹280",
            "Summary": "Citigroup has downgraded Federal Bank from Buy to Neutral rating and set a target price of ₹280 per share, reflecting a revised outlook on the banking stock.",
            "Sentiment": "negative",
            "PublishDate": 1766561507116,
            "Source": "stocks"
        },
        {
            "Title": "CCI Approves Asia II Topco XIII Warrant Acquisition",
            "Summary": "Competition Commission of India approves Asia II Topco XIII's acquisition of warrants from Federal Bank, enabling up to 9.99% ownership of paid-up share capital.",
            "Sentiment": "positive",
            "PublishDate": 1766491761183,
            "Source": "co_actions_results"
        },
        {
            "Title": "UBS Raises Federal Bank Target to ₹310",
            "Summary": "UBS maintains buy rating on Federal Bank with significantly increased target price of ₹310, up from previous ₹250, reflecting positive outlook on the banking stock.",
            "Sentiment": "positive",
            "PublishDate": 1765770084325,
            "Source": "stocks"
        },
        {
            "Title": "Federal Bank Allots 933,783 Equity Shares Under Employee Stock Option Schemes",
            "Summary": "Federal Bank allotted 933,783 equity shares with face value of Rs. 2 each to option grantees under its ESOS 2010 and ESOS 2017 schemes on December 08, 2025. The allotment includes 5,805 shares under ESOS 2010 and 927,978 shares under ESOS 2017, following approval by the Nomination, Remuneration, Ethics and Compensation Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1765173678812,
            "Source": "corporate_action"
        },
        {
            "Title": "Federal Bank Allots 2.59 Lakh Equity Shares Under Employee Stock Option Schemes",
            "Summary": "Federal Bank allotted 2,59,532 equity shares with face value of Rs. 2 each to option grantees under its ESOS 2010 and ESOS 2017 schemes on December 01, 2025. The allotment was approved by the Nomination, Remuneration, Ethics and Compensation Committee after payment by the allottees.",
            "Sentiment": "neutral",
            "PublishDate": 1764566893663,
            "Source": "corporate_action"
        },
        {
            "Title": "Federal Bank Allots 1,85,758 Equity Shares Under Employee Stock Option Schemes",
            "Summary": "Federal Bank allotted 1,85,758 equity shares with face value of Rs. 2 each to option grantees under two employee stock option schemes - 5,500 shares under ESOS 2010 and 1,80,258 shares under ESOS 2017. The allotment was made after payment by allottees and approved by the bank's Nomination, Remuneration, Ethics and Compensation Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1763835340932,
            "Source": "corporate_action"
        },
        {
            "Title": "Federal Bank Shareholders Approve Warrant Issuance to Asia II Topco XIII and Executive Compensation Revisions",
            "Summary": "Federal Bank's Extra-Ordinary General Meeting held on November 19, 2025, saw shareholders approve six key resolutions including warrant issuance to Asia II Topco XIII Pte. Ltd. and special rights granted to the entity. The meeting also approved revised remuneration packages and variable pay components for Managing Director CEO Krishnan Venkat Subramanian and Executive Director Harsh Dugar effective July 1, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763553123107,
            "Source": "corporate_action"
        },
        {
            "Title": "Federal Bank Allots 1.99 Lakh Equity Shares Under Employee Stock Option Schemes",
            "Summary": "Federal Bank allotted 12,045 equity shares under ESOS 2010 scheme and 1,87,121 equity shares under ESOS 2017 scheme to option grantees on November 15, 2025. The allotment was approved by the Nomination, Remuneration, Ethics and Compensation Committee after payment by allottees, with all shares having a face value of Rs. 2 each.",
            "Sentiment": "neutral",
            "PublishDate": 1763221142723,
            "Source": "corporate_action"
        },
        {
            "Title": "Federal Bank Acquires Additional 4% Stake in Ageas Federal Life for ₹974.4 Million",
            "Summary": "Federal Bank purchased an additional 4% stake in Ageas Federal Life by acquiring 3.2 million shares at ₹30.45 per share. The total acquisition cost amounts to ₹974.4 million, expanding Federal Bank's ownership in the life insurance company.",
            "Sentiment": "positive",
            "PublishDate": 1762872729225,
            "Source": "stock"
        },
        {
            "Title": "Federal Bank Allots 282,444 Equity Shares Under Employee Stock Option Schemes",
            "Summary": "Federal Bank has allotted equity shares to employees under two stock option schemes. The bank allotted 28,493 equity shares with face value of Rs. 2 each under the ESOS 2010 Scheme and 253,951 equity shares with face value of Rs. 2 each under the ESOS 2017 Scheme. The allotments were made after payment by the option grantees and were approved by the Nomination, Remuneration, Ethics and Compensation Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1762668774659,
            "Source": "corporate_action"
        },
        {
            "Title": "Scapia and Federal Bank Launch Add-On Credit Card with Individual Control for Family Members",
            "Summary": "Scapia and Federal Bank have launched a new add-on credit card that allows primary cardholders to issue up to three add-on cards under a shared credit limit. Each add-on user receives separate virtual and physical cards with individual app access, OTPs, and transaction visibility. Both primary and secondary users can earn and redeem reward points independently after meeting individual spending thresholds. The onboarding process is fully digital with instant virtual card issuance and physical delivery within a week. According to Anil Goteti, Founder and CEO of Scapia, the product addresses limitations in the Indian credit card market where add-on users traditionally had limited autonomy. The launch is part of Scapia's 'travel-first fintech' approach that links payments, travel rewards, and experiences. Virat Diwanji from Federal Bank stated the partnership focuses on creating customer-centric credit experiences combining financial empowerment with convenience.",
            "Sentiment": "positive",
            "PublishDate": 1762410639712,
            "Source": "stock"
        },
        {
            "Title": "Federal Bank Allots 3.98 Lakh Equity Shares Under Employee Stock Option Schemes",
            "Summary": "Federal Bank has allotted a total of 3,98,444 equity shares with face value of Rs. 2 each to option grantees under two employee stock option schemes. The allotment includes 9,220 shares under the ESOS 2010 Scheme and 3,89,224 shares under the ESOS 2017 Scheme. The allotments were made on November 2, 2025, following approval by the Nomination, Remuneration, Ethics and Compensation Committee and after payment by the allottees.",
            "Sentiment": "neutral",
            "PublishDate": 1762096235797,
            "Source": "corporate_action"
        },
        {
            "Title": "Blackstone May Need to Accelerate Federal Bank Warrant Conversion if Capital Ratio Falls Below 13.5%",
            "Summary": "Blackstone may be required to exercise its warrant conversion rights in Federal Bank ahead of the mandatory 18-month period if the bank's capital adequacy ratio drops below 13.5%. Federal Bank's capital adequacy ratio stood at 15.7% at the end of September. Managing Director KVS Manian explained that such a decline could be triggered by acquisitions, which the bank considers part of its balance sheet expansion strategy. Under the agreement terms, Blackstone must pay 25% of the warrant issue price immediately, with the remaining 75% due within 18 months, unless the capital ratio threshold is breached. The private equity firm is set to acquire 9.99% stake in the Thrissur-based lender through Asia II Topco XIII for ₹6,197 crore. The bank will issue up to 273 million warrants, each convertible to one equity share at ₹227 per share with a face value of ₹2. Manian confirmed that inorganic growth through acquisitions remains part of the bank's strategy, though he did not specify target asset classes.",
            "Sentiment": "neutral",
            "PublishDate": 1761785205562,
            "Source": "order&deals"
        },
        {
            "Title": "Federal Bank Receives Strong ESG Rating of 70.00 from SEBI Registered Provider",
            "Summary": "Federal Bank received an ESG rating of 70.00, classified as 'Strong', from ESG Risk Assessments and Insights Limited (ESGRisk.ai), a SEBI registered ESG rating provider. The rating was assigned based on 2025 disclosures and publicly available data of the bank. Federal Bank received this rating information on October 28, 2025, and has disclosed it to stock exchanges NSE and BSE under regulatory requirements.",
            "Sentiment": "positive",
            "PublishDate": 1761658596487,
            "Source": "stock"
        },
        {
            "Title": "Rekha Jhunjhunwala Increases Federal Bank Stake by 0.9% Ahead of Blackstone's $705M Investment",
            "Summary": "Rekha Jhunjhunwala purchased 2.3 crore additional shares in Federal Bank during the second quarter of FY26, increasing her stake to 2.4% and total shareholding to 5.9 crore shares. The purchase preceded Blackstone's announcement of a $705 million investment for a 9.9% stake in the bank through preferential equity shares and warrants. Blackstone will become the largest shareholder and gain the right to nominate a non-executive director, subject to approvals from shareholders, RBI, and competition regulators. Shareholders will vote on the proposal on November 19. Multiple brokerages issued bullish calls following the development, with ICICI Securities and PL Capital setting price targets of Rs 250. The transaction is expected to enhance Federal Bank's CET1 ratio by 280 basis points over 18 months. Rekha Jhunjhunwala also increased her Titan Company stake by 0.2% to 5.3%. Federal Bank shares gained 24% in the past month and over 350% in five years.",
            "Sentiment": "positive",
            "PublishDate": 1761625617209,
            "Source": "stock"
        },
        {
            "Title": "Federal Bank Announces Investor Call for Blackstone Warrant Issuance Discussion",
            "Summary": "Federal Bank will host an investor and analyst conference call on October 29, 2025, to discuss a proposed preferential issuance of warrants to funds managed by Blackstone. The Board of Directors approved the warrant issuance on October 24, 2025, representing up to 9.99% of the post-issue paid-up share capital at ₹227 per share, potentially raising ₹6,196.5 crores. The transaction requires shareholder approval and regulatory clearances. The call will cover the transaction overview, commercial and strategic rationale, expected timelines, and allow participants to ask questions.",
            "Sentiment": "positive",
            "PublishDate": 1761499129537,
            "Source": "corporate_action"
        },
        {
            "Title": "Federal Bank Board Approves Rs 6,197 Crore Warrant Issuance to Asia II Topco XIII",
            "Summary": "The Federal Bank's Board of Directors approved the issuance of up to 27.3 crore warrants to Asia II Topco XIII Pte. Ltd. through preferential allotment for Rs 6,197 crore. Each warrant, priced at Rs 227, can be converted into one equity share with a face value of Rs 2 and premium of Rs 225. Upon full conversion, the investor will hold 9.99% stake in the bank. The investor will gain the right to nominate one non-executive director to the board after exercising all warrants and maintaining at least 5% shareholding. The warrants have an 18-month exercise period, with 25% payment due at subscription and remaining 75% at conversion. The proposal requires approvals from shareholders, Reserve Bank of India, and Competition Commission of India. An Extraordinary General Meeting is scheduled for November 19, 2025, with November 12, 2025 set as the record date for voting eligibility.",
            "Sentiment": "positive",
            "PublishDate": 1761277812245,
            "Source": "corporate_action"
        },
        {
            "Title": "Federal Bank Board Meets to Consider Fund Raising Proposal Worth Up to 9.99% Equity",
            "Summary": "Federal Bank's board convened to consider and approve a fund raising proposal through rights issue, preferential allotment, or Qualified Institutional Placement (QIP). The fund raising involves a preference issue of shares up to 9.99% of total equity, with several major private equity players approached. Blackstone denied participation, stating they don't engage in minority transactions. Federal Bank maintains strong capital ratios with CRAR at 15.71% and tier-1 capital ratio at 14.37%, exceeding regulatory requirements of 9% and 6% respectively. The Credit-Deposit ratio stands at 84.7%. This follows recent trends of major investments in mid-sized banks, including Emirates-NBD's ₹27,000 crore investment in RBL Bank for up to 60% stake, SMBC's over 20% acquisition in Yes Bank, and Warburg Pincus affiliate's 9.48% stake in IDFC First Bank. Federal Bank shares closed at ₹227, reaching a 52-week high of ₹231.25, with 18% gains over the past month.",
            "Sentiment": "positive",
            "PublishDate": 1761277426023,
            "Source": "corporate_action"
        },
        {
            "Title": "Federal Bank Clarifies No Decision Made on 9.99% Stake Issue",
            "Summary": "Federal Bank has issued a clarification regarding news reports about a 9.99% stake issue, stating that no decision has been made on the matter.",
            "Sentiment": "neutral",
            "PublishDate": 1761041641326,
            "Source": "stock"
        },
        {
            "Title": "Federal Bank, DCB Bank, and South Indian Bank Shares Surge Up to 16% on Strong Quarterly Results",
            "Summary": "Shares of Federal Bank, DCB Bank, and South Indian Bank rallied up to 16.5% following strong quarterly results for the second quarter of financial year 2026. Federal Bank shares rose 7% to Rs 227, despite a 9.6% year-on-year decline in net profit to Rs 955.26 crore, as the bank achieved highest-ever net interest income of Rs 2,495 crore and fee income of Rs 886 crore. CASA ratio improved to 31.01% with deposits growing 10.71% year-on-year. DCB Bank shares jumped 13% to Rs 146 after reporting 18.3% year-on-year growth in net profit to Rs 184 crore, supported by 17.1% increase in net interest income to Rs 596 crore and improved asset quality with gross NPA declining to 2.91%. South Indian Bank stock surged over 16% to Rs 38 following 8.2% growth in net profit to Rs 351 crore, driven by 26% rise in other income to Rs 516 crore, though net interest income declined 8.3% to Rs 809 crore. The Nifty Bank index traded 0.5% higher at 57,996.",
            "Sentiment": "positive",
            "PublishDate": 1760938819475,
            "Source": "earnings"
        },
        {
            "Title": "Federal Bank Reports Lower Fresh Slippages in Q2",
            "Summary": "Federal Bank's fresh slippages addition decreased to 5.8 billion rupees in Q2, down from 6.6 billion rupees in the previous quarter, representing a quarter-on-quarter improvement in asset quality metrics.",
            "Sentiment": "positive",
            "PublishDate": 1760771638174,
            "Source": "earnings"
        },
        {
            "Title": "Federal Bank Schedules Board Meeting to Consider Fund Raising Proposals",
            "Summary": "Federal Bank has scheduled a board meeting for October 24, 2025, to consider and evaluate proposals for raising funds through various methods including rights issue, preferential allotment, and qualified institutions placement. The bank may issue equity shares, convertible instruments including warrants, or other eligible securities through any permissible mode or combination thereof, subject to applicable laws and required regulatory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1760769750536,
            "Source": "corporate_action"
        },
        {
            "Title": "Federal Bank Reports Q2 FY26 Net Profit of ₹955 Crore, Up 8.5% Year-on-Year",
            "Summary": "The Federal Bank Limited reported standalone net profit of ₹955.26 crore for the quarter ended September 30, 2025, compared to ₹1,056.69 crore in the same period last year. Total income increased to ₹7,824.33 crore from ₹7,541.23 crore year-on-year. Interest earned rose to ₹6,142.16 crore versus ₹6,577.24 crore in the previous year quarter. Operating expenses increased to ₹1,933.24 crore from ₹1,765.82 crore. For the half-year period, net profit reached ₹1,817.01 crore compared to ₹2,066.22 crore in the corresponding period last year. The bank's gross NPA ratio improved to 1.83% from 2.09% year-on-year, while net NPA ratio decreased to 0.48% from 0.57%. Capital adequacy ratio under Basel III stood at 15.71% compared to 15.20% in the previous year. The consolidated net profit for the quarter was ₹991.94 crore versus ₹1,096.25 crore in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1760768762521,
            "Source": "earnings"
        },
        {
            "Title": "Federal Bank and Fi Launch MagniFi Credit Card Targeting Weekend Spending",
            "Summary": "Fi, an AI-driven money management platform, partnered with Federal Bank to launch the MagniFi Federal Fi Credit Card designed for weekend spending patterns among young Indians. The card offers 20% instant discounts on platforms including Amazon, Zomato, Zepto, and BookMyShow, along with 5% cashback on eligible weekend transactions across dining, shopping, travel, cabs, and groceries. Weekday transactions earn 0.5% cashback. The card is lifetime free with no joining or annual fees. The product targets urban professionals aged 25-40, capitalizing on data showing weekend transactions in India are approximately 50% higher than weekdays. The card focuses on lifestyle benefits rather than purely credit access, offering a digital-first, rewards-focused experience.",
            "Sentiment": "positive",
            "PublishDate": 1760436928987,
            "Source": "stock"
        },
        {
            "Title": "Federal Bank Sells 16.6 Crore Yes Bank Shares to Sumitomo Mitsui Banking Corporation",
            "Summary": "Federal Bank has completed the sale of 16,62,73,472 equity shares of Yes Bank Limited to Sumitomo Mitsui Banking Corporation (SMBC) at Rs. 21.50 per share. The transaction was executed under a Letter Agreement dated May 09, 2025, between Federal Bank, SMBC, and Yes Bank Limited. The sale was completed on September 17, 2025, following receipt of requisite regulatory approvals and satisfaction of conditions specified in the agreement. The shares have a face value of Rs. 2.00 each.",
            "Sentiment": "neutral",
            "PublishDate": 1758109405650,
            "Source": "order&deals"
        },
        {
            "Title": "Federal Bank Appoints Srinivasan P as Executive Vice President for Wholesale Banking",
            "Summary": "Federal Bank has appointed Mr. Srinivasan P as Executive Vice President & Head – Business Initiatives (Wholesale Banking) and a Senior Management Personnel, effective August 28, 2025. Srinivasan brings 22 years of banking experience across Corporate Banking, Trade Finance and Digital Transformation Initiatives. He previously served as Regional Head - Multinational Corporates Coverage at HDFC Bank and has worked with ABN AMRO Central Enterprise. He holds an MBA and Bachelor's degree in Chemical Engineering. His expertise includes team leadership, customer acquisition, deal structuring, credit appraisal, business development, risk management, and client engagement with deep understanding of lending, trade finance and treasury solutions.",
            "Sentiment": "positive",
            "PublishDate": 1756384852396,
            "Source": "corporate_governance"
        },
        {
            "Title": "Federal Bank Shares Go Ex-Dividend Friday for Rs 1.20 Payout",
            "Summary": "Federal Bank shares will trade ex-dividend on Friday, August 22, with Thursday being the last day for investors to purchase shares and qualify for the Rs 1.20 per share dividend payout. The Kerala-headquartered bank set August 22 as the record date for its final dividend for the financial year ended March 31, 2025. The board approved a 60% dividend (Rs 1.20 per equity share of face value Rs 2) for FY2025, subject to shareholder approval at the upcoming Annual General Meeting on August 29, 2025. Federal Bank has maintained consistent dividend payments, distributing Rs 1.20 per share in 2024, Re 1 in 2023, Rs 1.8 in 2022, and Rs 0.7 in 2021. The bank reported weak June quarter results with net profit falling 15% year-on-year to Rs 862 crore, affected by narrowing margins and higher provisions. Net interest margin declined to 2.94% from 3.16% a year earlier, despite 9% growth in advances.",
            "Sentiment": "neutral",
            "PublishDate": 1755764779763,
            "Source": "corporate_action"
        },
        {
            "Title": "Federal Bank CEO Outlines Mass Affluent Strategy, Cautious Growth Approach",
            "Summary": "KVS Manian, MD & CEO of Federal Bank, outlined the bank's strategy to focus on mass affluent customers rather than premium banking segments. The bank reported net profit of Rs 862 crore for the quarter ended June 30, down 16% sequentially due to higher slippages in agriculture and microfinance loan books. Net interest margin declined to 2.94%, down 18 basis points quarter-on-quarter. Manian plans to strengthen three core areas: low-cost liabilities franchise, middle-yielding assets, and fee income through credit cards and wealth management. The bank will take a cautious pause on microfinance for one or two quarters and recently implemented a savings rate cut. Federal Bank aims to maintain its 3-3.20% NIM range while gradually shifting from home and corporate loans to slightly higher-yielding assets like loans against property and used commercial vehicles.",
            "Sentiment": "neutral",
            "PublishDate": 1754985888385,
            "Source": "stock"
        },
        {
            "Title": "Federal Bank Reports 14% Decline in Q1 Net Profit to Rs 8.6 Billion",
            "Summary": "Federal Bank's Q1 net profit decreased to Rs 8.6 billion from Rs 10 billion in the same period last year. The bank's gross non-performing assets (GNPA) ratio increased to 1.91% from 1.84% in the previous quarter, while net non-performing assets (NNPA) ratio rose to 0.48% from 0.44%. Provisions and contingencies (excluding tax) surged significantly to Rs 4 billion from Rs 1.3 billion in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754265765261,
            "Source": "earnings"
        }
    ]
}