{
    "Symbol": "FEDFINA",
    "ISIN": "INE007N01010",
    "News": [
        {
            "Title": "Fedbank Financial allots 14,038 shares via ESOP",
            "Summary": "Fedbank Financial Services allotted 14,038 equity shares on February 04, 2026, through employee stock option exercise, increasing paid-up capital to Rs. 3,74,10,35,380/-.",
            "Sentiment": "positive",
            "PublishDate": 1770228871530,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fedbank Financial Grants 6.7L Stock Options",
            "Summary": "Fedbank Financial Services grants 6,70,000 stock options to 6 employees under ESOS-2018 at ₹155.35 per option, approved by NRC committee on January 20, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768992181108,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fedbank Financial Services Q3 Asset Quality Declines",
            "Summary": "Fedbank Financial Services reported Q3 GNPA at 2.06% vs 1.9% QoQ and NNPA at 1.4% vs 1.3% QoQ, indicating deterioration in asset quality metrics during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1768489163449,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fedbank Financial Reports No IPO Fund Deviation in Q3",
            "Summary": "Fedbank Financial Services confirms no deviation in utilization of ₹1,092.26 crore IPO proceeds during Q3 FY26, with no funds utilized during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1768487378766,
            "Source": "stocks"
        },
        {
            "Title": "Fedbank Financial Services Shares Q3FY26 Results",
            "Summary": "Fedbank Financial Services reported strong Q3FY26 performance with AUM growing 17.4% YoY to ₹17,500 cr, PAT surging 368.6% to ₹87.9 cr, and disbursements up 95.8% to ₹8,606 cr.",
            "Sentiment": "positive",
            "PublishDate": 1767620111821,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fedbank Financial Allots ₹200 Cr NCDs & 12,700 Shares",
            "Summary": "Fedbank Financial Services allotted 20,000 NCDs worth ₹200 crores at 7.29% coupon rate and 12,700 equity shares under ESOP scheme, increasing paid-up capital to ₹374.09 crores.",
            "Sentiment": "positive",
            "PublishDate": 1767619039693,
            "Source": "stocks"
        },
        {
            "Title": "Fedbank Financial Services Approves NCD Issuance Plans",
            "Summary": "Fedbank Financial Services board approves draft documents for ₹200 crore NCD issuance on private placement basis with 36-month tenure, to be listed on BSE.",
            "Sentiment": "positive",
            "PublishDate": 1766334458749,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fedbank Financial Gets Credit Rating Reaffirmation",
            "Summary": "Fedbank Financial Services receives reaffirmed credit ratings from CRISIL and ICRA for its debt instruments worth ₹5,250 crores, with commercial paper limit enhanced to ₹2,000 crores.",
            "Sentiment": "positive",
            "PublishDate": 1766139063882,
            "Source": "stocks"
        },
        {
            "Title": "Fedbank Financial Allots 6,088 Shares Under ESOP",
            "Summary": "Fedbank Financial Services allotted 6,088 equity shares to employees under its stock option scheme, increasing paid-up share capital from ₹374.07 crores to ₹374.08 crores on December 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765794883937,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fedbank Financial Services Allots 8,500 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Fedbank Financial Services Limited allotted 8,500 equity shares of Rs. 10 each to employees who exercised vested stock options under the company's 2018 Employee Stock Option Scheme. The allotment increased the company's paid-up share capital from Rs. 3,74,06,22,120 to Rs. 3,74,07,07,120, with the new shares ranking pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763989659157,
            "Source": "corporate_action"
        },
        {
            "Title": "Fedbank Financial Services Allots 45,563 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Fedbank Financial Services Limited has allotted 45,563 equity shares of Rs. 10 each following the exercise of vested stock options by employees under the company's Employee Stock Option Scheme 2018. The allotment was approved by the Committee of Directors (Operations) on November 11, 2025. The company's paid-up share capital increased from Rs. 374.02 crore (37.40 crore shares) to Rs. 374.06 crore (37.41 crore shares). The newly allotted shares rank equally with existing equity shares, and the company is completing formalities for listing these shares.",
            "Sentiment": "neutral",
            "PublishDate": 1762886758293,
            "Source": "corporate_action"
        },
        {
            "Title": "Fedbank Financial Appoints Bankers as True North Plans to Sell Full 8.6% Stake",
            "Summary": "Fedbank Financial has appointed bankers for a True North block deal. True North plans to sell its complete 8.6% stake in the company. The block deal is expected to happen soon.",
            "Sentiment": "neutral",
            "PublishDate": 1761806447600,
            "Source": "order&deals"
        },
        {
            "Title": "Fedbank Financial Services Reports 24% Jump in Net Profit, Focuses on Gold and LAP Business Expansion",
            "Summary": "Fedbank Financial Services reported net profit of INR 80.2 crores for the quarter, up 24.2% year-on-year. The company's AUM reached INR 16,136 crores with 13.5% growth, driven by gold loans which grew 36.4% to INR 6,731 crores and mortgage AUM which increased 22.6% to INR 8,796 crores. The company opened 57 new gold loan branches and co-located 49 small ticket LAP branches with gold branches to optimize costs. Credit costs stood at 0.9% for the quarter, including a 20 basis points impact from ECL refresh exercise. The company sold deep delinquent NPAs worth INR 79.5 crores to an asset reconstruction company for INR 32.6 crores and completed assignment of business loan portfolio worth INR 115.6 crores, reducing unsecured lending exposure to less than 1%. Net interest income grew 10.9% year-on-year while operating profit increased 10.1%. The company secured ECBs totaling $150 million and improved its cost of borrowing by 37 basis points quarter-on-quarter to 8.19%.",
            "Sentiment": "positive",
            "PublishDate": 1761393143564,
            "Source": "earnings"
        },
        {
            "Title": "Fedbank Financial Services Targets 25%+ AUM Growth Through Gold and Mortgage Expansion",
            "Summary": "Fedbank Financial Services has outlined a growth strategy targeting over 25% AUM expansion. The company plans to focus on gold and mortgage-led business expansion while working to improve asset quality. The strategy emphasizes maintaining strong return on equity through technology-driven rural market penetration.",
            "Sentiment": "positive",
            "PublishDate": 1760718482615,
            "Source": "stock"
        },
        {
            "Title": "Fedbank Financial Services Reports 24% Jump in Net Profit to ₹80.15 Crore",
            "Summary": "Fedbank Financial Services Limited reported net profit of ₹80.15 crore for the quarter ended September 30, 2025, compared to ₹64.55 crore in the same period last year. Total income increased to ₹535.99 crore from ₹519.09 crore year-on-year. Interest income rose to ₹507.70 crore from ₹479.11 crore. For the half-year period, net profit grew to ₹155.16 crore versus ₹134.78 crore previously. The company's gross non-performing assets stood at 1.90% while net NPAs were at 1.30%. Capital adequacy ratio was maintained at 21.64%. The company allotted 5,90,965 equity shares during the quarter under its employee stock option schemes. Basic earnings per share for the quarter was ₹2.15 compared to ₹1.74 in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1760696862745,
            "Source": "earnings"
        },
        {
            "Title": "Fedbank Financial Services Sells Rs. 79.45 Crore Non-Performing Assets to ISARC for Rs. 32.57 Crore",
            "Summary": "Fedbank Financial Services Limited sold a pool of Gross Non-Performing Assets worth Rs. 79.45 crore to India SME Asset Reconstruction Company Limited for an upfront cash payment of Rs. 32.57 crore, representing approximately 41% of the principal outstanding value. The sold portfolio includes small-ticket Loan Against Property worth Rs. 55.60 crore and Affordable Home Loans worth Rs. 23.85 crore. The net carrying outstanding principal value after ECL provisions stood at Rs. 22.20 crore as of August 31, 2025. The company will write off the net carrying value of interest worth Rs. 5.14 crore in the quarter ending September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758905156923,
            "Source": "stock"
        },
        {
            "Title": "Fedbank Financial Services COO Krishnaswamy Siddharth Resigns",
            "Summary": "Krishnaswamy Siddharth resigned from his position as Chief Operating Officer of Fedbank Financial Services Limited effective August 25, 2025. He tendered his resignation on May 25, 2025, to pursue new opportunities and served a 3-month notice period. The management has accepted his resignation, and he ceased to be COO after the close of business hours on August 25, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1756204928085,
            "Source": "corporate_governance"
        },
        {
            "Title": "Fedbank Financial Services Plans NCD Issuance Worth Up To ₹25 Billion",
            "Summary": "Fedbank Financial Services has announced plans to issue Non-Convertible Debentures (NCDs) worth up to ₹25 billion rupees. This debt instrument issuance will allow the company to raise capital from investors through fixed-income securities.",
            "Sentiment": "neutral",
            "PublishDate": 1756118260699,
            "Source": "corporate_action"
        },
        {
            "Title": "Fedbank Financial Board to Review 25 Billion Rupees Debt Offer",
            "Summary": "Fedbank Financial's board of directors will consider a debt offer worth 25 billion rupees on August 25. The company has scheduled this board meeting to deliberate on the significant debt proposal.",
            "Sentiment": "neutral",
            "PublishDate": 1755695099689,
            "Source": "corporate_action"
        },
        {
            "Title": "Fedbank Financial Services Reports 19% AUM Growth, Completes Business Loan Portfolio Assignment",
            "Summary": "Fedbank Financial Services reported AUM of INR15,697 crores with 19% year-on-year growth for Q1 FY26. The company completed 100% assignment of its business loan portfolio worth INR770 crores, moving toward a fully secured lending model with gold loans comprising 44% and secured mortgages 54% of the loan book. Gold loan AUM grew 39% year-on-year to INR6,332 crores with tonnage growth of 10%. Net profit increased 6.8% to INR75 crores. The company maintained credit costs at 0.8% and gross Stage 3 assets at 2%. Management announced plans to open over 100 new gold loan branches and completed co-location of 23 branches. The company also completed its maiden $100 million external commercial borrowing and transferred INR25 crores of non-performing assets to an asset reconstruction company.",
            "Sentiment": "positive",
            "PublishDate": 1754050023628,
            "Source": "earnings"
        },
        {
            "Title": "Fedbank Financial Services Corrects Branch Count Error in Investor Presentation",
            "Summary": "Fedbank Financial Services Limited submitted a revised investor presentation to correct an inadvertent error in branch count information on Slide 18. The error involved incorrect placement of branch counts for West and North regions under the 'Our Footprints' section. The company has provided the corrected presentation to stock exchanges NSE and BSE. The presentation covers quarterly results showing AUM growth of 19% YoY to ₹15,697 crore, with gold loan AUM growing 38.8% YoY to ₹6,332 crore. The company reported profit after tax of ₹75 crore, up 6.8% YoY, and operates 668 branches with 4,797 employees.",
            "Sentiment": "neutral",
            "PublishDate": 1753716866872,
            "Source": "stock"
        },
        {
            "Title": "Fedbank Financial Outlines Growth Strategy Focused on MSME Lending and Digital Expansion",
            "Summary": "Fedbank Financial has outlined a multi-pronged growth strategy centered on MSME-focused lending, digital deepening, and a gold-mortgage twin engine approach. The company is targeting high-quality secured AUM expansion and aims to achieve a sustainable Return on Equity of 12-13%.",
            "Sentiment": "positive",
            "PublishDate": 1753711587622,
            "Source": "stock"
        },
        {
            "Title": "Fedbank Financial Services Reports No Deviations in IPO Fund Utilization for Quarter Ended June 30, 2025",
            "Summary": "Fedbank Financial Services Limited reported no deviations or variations in the utilization of proceeds from its Initial Public Offer for the quarter ended June 30, 2025. The company raised INR 1,092.26 crores through its IPO on November 29, 2023. The net proceeds are being utilized towards augmentation of the company's Tier I capital base to meet future capital requirements arising from business and asset growth. The statement was reviewed by the Audit Committee along with the monitoring agency report from ICRA Limited dated July 14, 2025, at their meeting held on July 28, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753707991845,
            "Source": "stock"
        },
        {
            "Title": "Fedbank Financial Reports 4.7% Growth in Net Profit Despite Revenue Decline",
            "Summary": "Fedbank Financial reported net profit of 750 million rupees for Q1, representing a 4.7% increase from 716 million rupees in the same period last year. However, the company's revenue declined to 5.2 billion rupees compared to 5.36 billion rupees year-over-year, marking a 3% decrease in top-line performance.",
            "Sentiment": "neutral",
            "PublishDate": 1753703210261,
            "Source": "earnings"
        },
        {
            "Title": "Fedbank Financial Services Schedules Q1 FY26 Earnings Call for July 28, 2025",
            "Summary": "Fedbank Financial Services Limited has scheduled an earnings call with analysts and investors on July 28, 2025, at 6:30 PM IST to discuss the company's financial results for Q1 FY26. The call will be hosted by Equirus Securities and will feature the company's senior management team including MD & CEO Parvez Mulla, CFO C. V. Ganesh, Chief Risk Officer Vikram Rathi, and other business heads. The company trades on BSE with scrip code 544027 and on NSE with symbol FEDFINA. Dial-in numbers and international toll-free access have been provided for participants.",
            "Sentiment": "neutral",
            "PublishDate": 1753196913293,
            "Source": "earnings"
        },
        {
            "Title": "Fedbank Financial Reports Q4 FY23 Results",
            "Summary": "Fedbank Financial Services has announced its Q4 FY23 results. Net profit increased to 716.5 million rupees, up from 677 million rupees year-over-year and 187.6 million rupees quarter-over-quarter. Revenue rose to 5.23 billion rupees from 4.08 billion rupees year-over-year. However, asset quality deteriorated slightly, with GNPA at 2.02% (up from 1.88% QoQ) and NNPA at 1.22% (up from 1.04% QoQ).",
            "Sentiment": "neutral",
            "PublishDate": 1745972741000,
            "Source": "default"
        },
        {
            "Title": "FedBank Financial Services Reports Q4 FY2023 Results",
            "Summary": "FedBank Financial Services has released its Q4 financial results. The company's Gross Non-Performing Assets (GNPA) increased to 2.02% from 1.88% quarter-over-quarter. Net Non-Performing Assets (NNPA) also rose to 1.22% from 1.04% quarter-over-quarter. Revenue grew to 5.23 billion rupees, up from 4.08 billion rupees year-over-year. The standalone net profit for Q4 was 716.5 million rupees, showing an increase from 677 million rupees year-over-year and 187.6 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1745927752000,
            "Source": "result"
        },
        {
            "Title": "Fedbank Financial Services Reports Q3 FY24 Results",
            "Summary": "Fedbank Financial Services has reported its Q3 financial results. The company's net profit decreased to 188 million rupees from 654 million rupees year-over-year. Revenue increased to 5.33 billion rupees from 4.1 billion rupees year-over-year. The Gross Non-Performing Assets (GNPA) remained stable at 1.9% quarter-on-quarter, while Net Non-Performing Assets (NNPA) improved to 1% from 1.5% quarter-on-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737936871000,
            "Source": "earnings"
        },
        {
            "Title": "FedBank Financial Services Reports Stable Q3 GNPA, Improved NNPA",
            "Summary": "FedBank Financial Services has released its Q3 financial results. The Gross Non-Performing Assets (GNPA) remained stable at 1.9% compared to the previous quarter. The Net Non-Performing Assets (NNPA) improved, decreasing from 1.5% to 1% quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737726686000,
            "Source": "result"
        },
        {
            "Title": "FEDBANK FINANCIAL SERVICES Reports Significant Decline in Q3 Net Profit",
            "Summary": "FEDBANK FINANCIAL SERVICES has reported its Q3 financial results. The company's net profit decreased to 188 million rupees from 654 million rupees in the same quarter last year, marking a substantial year-over-year decline. However, the company's revenue increased to 5.33 billion rupees from 4.1 billion rupees in the previous year, showing growth in top-line performance.",
            "Sentiment": "negative",
            "PublishDate": 1737713406000,
            "Source": "earnings"
        },
        {
            "Title": "FEDBANK FINANCIAL Reports Strong Q2 Growth and Medium-Term Outlook",
            "Summary": "FEDBANK FINANCIAL has announced a 25% growth guidance on a medium-term basis, aiming to exceed this rate quarter-on-quarter. The company reported its highest ever Assets Under Management (AUM) growth of Rs 1,030 crores in Q2.",
            "Sentiment": "positive",
            "PublishDate": 1729740685000,
            "Source": "result"
        },
        {
            "Title": "Fedbank Financial Aims for 25% Growth, Exceeds Recent Guidance",
            "Summary": "Fedbank Financial has set a target of 25% growth, considering any growth beyond this as opportunistic. The company has surpassed its guidance in the recent quarter, but management remains cautious, acknowledging that such performance may not be consistent across all quarters.",
            "Sentiment": "positive",
            "PublishDate": 1729740663000,
            "Source": "normal_news"
        },
        {
            "Title": "FedBank Financial Services Reports Improved Asset Quality in Q2",
            "Summary": "FedBank Financial Services has reported an improvement in its asset quality for the second quarter. The Gross Non-Performing Assets (GNPA) ratio decreased to 1.87% from 1.97% in the previous quarter. Similarly, the Net Non-Performing Assets (NNPA) ratio improved to 1.47% from 1.60% quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1729683824000,
            "Source": "result"
        },
        {
            "Title": "FedBank Financial Reports Strong Q2 Revenue Growth",
            "Summary": "FedBank Financial has announced its Q2 revenue results, showing significant year-over-year growth. The company reported revenue of 5.13 billion rupees for the quarter, compared to 3.9 billion rupees in the same period last year. This represents a substantial increase in the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1729683813000,
            "Source": "result"
        },
        {
            "Title": "FedBank Financial Services Reports Q2 Profit Increase",
            "Summary": "FedBank Financial Services has reported a net profit of 645.6 million rupees for the second quarter, showing an increase from 578 million rupees year-over-year and 702 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1729683805000,
            "Source": "result"
        }
    ]
}