{
    "Symbol": "FIBERWEB",
    "ISIN": "INE296C01020",
    "News": [
        {
            "Title": "Fiberweb Secures ₹8+ Crore Export Orders Post US Tariff Cut",
            "Summary": "Fiberweb (India) Limited announces receipt of over 15 export orders worth ₹8+ Crore from the US following tariff reduction from 50% to 18%. Orders received within hours of trade policy announcement.",
            "Sentiment": "positive",
            "PublishDate": 1770099667878,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fiberweb India Extends CFO Mukesh Pandya's Tenure",
            "Summary": "Fiberweb (India) Limited's Board approves extension of Chief Financial Officer Mukesh Pandya's tenure until 30 April 2026, following his voluntary request to continue services beyond original resignation date.",
            "Sentiment": "positive",
            "PublishDate": 1769767746672,
            "Source": "stocks"
        },
        {
            "Title": "Fiberweb Q3FY26 Results: Strong Recovery with Expansion",
            "Summary": "Fiberweb India reported robust Q3FY26 performance with Rs 25.90 crore sales and Rs 4.15 crore PBT. Company secured Rs 135 crore funding from SBI for Rs 168 crore biodegradable expansion project.",
            "Sentiment": "positive",
            "PublishDate": 1769766488436,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fiberweb India Board Meet Set for Jan 30 Q3FY26 Results",
            "Summary": "Fiberweb (India) Limited announces board meeting on January 30, 2026, to consider Q3FY26 unaudited financial results. Trading window closed from January 1 until 48 hours post-results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1768986157515,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gayatri Pipes acquires 10,000 Fiberweb shares",
            "Summary": "Gayatri Pipes Fittings Private Limited purchased 10,000 equity shares of Fiberweb (India) Limited through open market transaction on December 11, 2025, as disclosed under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1765615843987,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fiberweb India Reports Q2FY26 Results with Investor Presentation",
            "Summary": "Fiberweb India Limited, a spunbond nonwoven fabrics manufacturer, submitted its Q2FY26 results investor presentation to stock exchanges. The company reported H1FY26 net profit of ₹7.61 crores with 15.25% margin, showing 18.15% year-on-year growth from ₹6.44 crores in H1FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1763142342930,
            "Source": "earnings"
        },
        {
            "Title": "Fiberweb India Reports 75% Jump in Q1 FY26 Net Profit to ₹5.06 Crore",
            "Summary": "Fiberweb (India) Limited, a manufacturer of spun bond nonwoven fabrics, reported strong quarterly results for Q1 FY26 ended June 30, 2025. The company's net profit surged 74.55% year-on-year to ₹5.06 crore compared to ₹2.90 crore in Q1 FY25. Total income increased 14.48% to ₹29.26 crore from ₹25.56 crore. EBITDA grew 36.28% to ₹6.76 crore with margins expanding 370 basis points to 23.10%. Net profit margin improved significantly to 17.29% from 11.34%. The board approved the unaudited standalone financial results and appointed M/s. Ritesh Sharma & Associates as scrutinizer for the 40th Annual General Meeting scheduled for September 25, 2025. The company operates as a 100% Export Oriented Unit with manufacturing capacity of 5,000 MTPA for spun bond and 3,000 MTPA for melt blown fabrics.",
            "Sentiment": "positive",
            "PublishDate": 1755180815781,
            "Source": "earnings"
        },
        {
            "Title": "FIBERWEB: Q3 Profit Soars 130.52% YoY, Revenue Up 71.41%",
            "Summary": "FIBERWEB reported Q3 FY25 results with profit at ₹3.55 crore, up 130.52% YoY. Revenue increased by 71.41% to ₹25.18 crore. Operating income rose 292.92% YoY. EPS stood at ₹1.23, a 127.78% YoY increase.",
            "Sentiment": "positive",
            "PublishDate": 1739255678000,
            "Source": "earnings"
        },
        {
            "Title": "Fiberweb Reports Improved Q2 EBITDA Performance",
            "Summary": "Fiberweb, a company in the fiber industry, has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) has increased to 46 million rupees, up from 22 million rupees in the same quarter last year. However, the EBITDA margin has decreased slightly to 18.38% from 20.60% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730810435000,
            "Source": "result"
        },
        {
            "Title": "Fiberweb Reports Q2 Revenue Increase",
            "Summary": "Fiberweb has announced its Q2 revenue of 250 million rupees, showing an increase from 206 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730810426000,
            "Source": "result"
        }
    ]
}