{
    "Symbol": "FIEMIND",
    "ISIN": "INE737H01014",
    "News": [
        {
            "Title": "Fiem Industries Schedules Q3FY26 Earnings Call",
            "Summary": "Fiem Industries has scheduled an earnings call for February 12, 2026 at 4:00 PM to discuss Q3FY26 operational and financial performance with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1770456678117,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fiem Industries Files Rs 82.30 Crore Fire Claim",
            "Summary": "Fiem Industries submits insurance claim worth Rs 82.30 crores for fire incident at Unit-8 facility in Rajasthan. Claim outcome subject to insurer assessment.",
            "Sentiment": "neutral",
            "PublishDate": 1769778214320,
            "Source": "stocks"
        },
        {
            "Title": "HDFC MF Raises Stake in FIEM Industries to 7.07%",
            "Summary": "HDFC Mutual Fund increased its shareholding in FIEM Industries Limited by 2.01% to reach 7.07% as of January 8, 2026, acquiring 5,28,900 shares through open market transactions.",
            "Sentiment": "positive",
            "PublishDate": 1768219587865,
            "Source": "mutualfunds"
        },
        {
            "Title": "Fiem Industries Reports Record Quarterly Sales of INR 711 Crores, PAT Surges 28% in Q2 FY26",
            "Summary": "Fiem Industries achieved highest-ever quarterly sales of INR 711 crores (17% YoY growth) and PAT of INR 64 crores (28% YoY growth) driven by strong demand from key OEM customers like TVS, Royal Enfield and Yamaha. The company expanded its 4-wheeler business with new orders from Mahindra for various lamp components across Scorpio, Thar and XUV700 models, while maintaining EBITDA margin at 13.93%.",
            "Sentiment": "positive",
            "PublishDate": 1763378254667,
            "Source": "earnings"
        },
        {
            "Title": "Fiem Industries Shares H1FY26 Earnings Call Presentation Highlighting Strong Financial Performance",
            "Summary": "Fiem Industries Limited submitted its earnings call presentation for H1FY26 to stock exchanges BSE and NSE. The company, a leading manufacturer of automotive lighting signalling equipment and rear view mirrors in India, reported consolidated total sales of INR 13,617 million for H1FY26 with EBITDA of INR 1,885 million and EBITDA margin of 13.84%. The company achieved PAT of INR 1,212 million with PAT margin of 8.90% and EPS of 46.04. Fiem Industries has shown consistent growth with standalone net sales growing from INR 13,663 million in FY20 to INR 24,050 million in FY25 at a 5-year CAGR of 11.97%. The company serves major clients including Honda, TVS, Yamaha, Suzuki, and Royal Enfield across two-wheeler and four-wheeler segments. The automotive segment dominates revenue with 96.42% contribution in H1FY26, while the company also operates in LED luminaires and Integrated Passenger Information Systems.",
            "Sentiment": "positive",
            "PublishDate": 1762975782092,
            "Source": "earnings"
        },
        {
            "Title": "FIEM Industries Plans LED Product Expansion in 2W and EV Segments",
            "Summary": "FIEM Industries is planning an aggressive expansion of LED products across two-wheeler and electric vehicle segments. The company is investing in advanced tooling and automation for next-generation lighting systems. FIEM Industries is benefiting from increased EV demand and premiumization trends. The company is focusing on export growth and developing new OEM partnerships.",
            "Sentiment": "positive",
            "PublishDate": 1762960877772,
            "Source": "stock"
        },
        {
            "Title": "FIEM Industries Reports Strong Q2 Growth with 28% Revenue Increase",
            "Summary": "FIEM Industries reported Q2 net profit of 637.8 million rupees compared to 498.3 million rupees in the same period last year. Revenue grew to 7.15 billion rupees from 6.12 billion rupees year-over-year. EBITDA increased to 991 million rupees from 802.7 million rupees, while EBITDA margin significantly improved to 13.86% from 5.85% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762945307395,
            "Source": "earnings"
        },
        {
            "Title": "Fiem Industries Schedules Earnings Call for 2Q FY26 Results Discussion",
            "Summary": "Fiem Industries Limited has scheduled an earnings call for analysts and investors on Thursday, November 13, 2025 at 4:00 PM IST to discuss the company's operational and financial performance during 2Q FY26. The conference call will be led by company management including Chairman Managing Director J.K. Jain, Chief Financial Officer O.P. Gupta, and Company Secretary Arvind K. Chauhan. The call agenda includes discussion on 2Q FY26 results and business outlook. Dial-in numbers have been provided for various countries including India, Hong Kong, Singapore, UK, and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1762301698990,
            "Source": "corporate_action"
        },
        {
            "Title": "Fiem Industries Promoters Sell 4.45% Stake Through Open Market Transactions",
            "Summary": "Three promoters of Fiem Industries Limited - Aanchal Jain, Seema Jain, and Rahul Jain - sold a combined 11,70,000 equity shares (4.45% stake) through open market transactions on September 17, 2025. Each promoter sold 3,90,000 shares (1.48% each). Following the sale, the promoter group's total shareholding decreased from 58.96% to 54.52%. The company's equity share capital remained unchanged at Rs. 26,31,96,600. The shares are listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1758191240075,
            "Source": "corporate_action"
        },
        {
            "Title": "Fire Incident at Fiem Industries' Unit-8 in Rajasthan, No Injuries Reported",
            "Summary": "A fire occurred at Fiem Industries Limited's Unit-8 facility located at Plot No. SP1-C, Industrial Area Tapukara, District Alwar, Rajasthan. The incident happened in the afternoon and resulted in damage to building, plant & machinery, stocks and furniture. No injuries or loss of human life were reported, and the fire was controlled with help of fire tenders. The company has initiated insurance claim procedures as its assets are adequately covered. Management plans to take swift measures to resume operations at the earliest. The assessment of total loss and damage will take time and will be updated later.",
            "Sentiment": "neutral",
            "PublishDate": 1755959460198,
            "Source": "stock"
        },
        {
            "Title": "Fiem Industries Reports 13% Revenue Growth in Q1 with Strong LED Lighting Performance",
            "Summary": "Fiem Industries Limited reported revenue of Rs. 649.07 crore, marking a 13.16% year-over-year increase from Rs. 573.61 crore in the previous year's quarter. The automotive lighting manufacturer achieved a profit after tax of Rs. 56.05 crore, up 13.92% from Rs. 49.2 crore in the same period last year. EBITDA reached Rs. 87.36 crore with a margin of 13.46%. LED lighting now represents 63.92% of the company's total automotive lighting sales. Strong demand from key customers including TVS, Royal Enfield, and Yamaha drove growth, with Yamaha sales increasing 20% year-over-year. The company is expanding its four-wheeler business, receiving development orders for three additional products from Force Motors and commencing commercial production for Mahindra. Fiem is installing an EMC/EMI electronic validation laboratory and plans to add 10 new SMT lines over the next 1-2 years. Management maintains confidence in achieving 15-20% annual growth and expects the two-wheeler industry to grow 6-10% in the current fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1755604484786,
            "Source": "earnings"
        },
        {
            "Title": "Fiem Industries Reports 13.16% Revenue Growth in Q1 with Net Profit Rising to Rs 56.05 Crore",
            "Summary": "Fiem Industries Limited reported quarterly results for the period ended June 30, 2025. The company achieved total sales of Rs 649.07 crore, representing 13.16% growth compared to Rs 573.61 crore in the same quarter last year. Net profit increased 13.92% to Rs 56.05 crore from Rs 49.20 crore in the previous year quarter. The automotive segment, which comprises automotive lighting, signaling equipment, rear view mirrors and plastic molded parts, drove growth with 13.27% increase to Rs 647.26 crore. Sequential quarter comparison showed 2.41% revenue growth from Rs 633.80 crore in the previous quarter, though net profit declined slightly from Rs 57.69 crore. Basic earnings per share stood at Rs 21.30 compared to Rs 18.69 in the year-ago quarter. The company operates through two segments - automotive (primary business) and others segment comprising LED luminaries and display systems.",
            "Sentiment": "positive",
            "PublishDate": 1755084360436,
            "Source": "earnings"
        },
        {
            "Title": "Fiem Industries Re-appoints Key Leadership for 5-Year Terms",
            "Summary": "Fiem Industries announced the re-appointment of Mr. Jagjeevan Kumar Jain as Chairman & Managing Director and Mr. Rahul Jain as Joint Managing Director during its 36th Annual General Meeting held on July 31, 2025. Both appointments are for a further term of 5 years, with Mr. Jagjeevan Kumar Jain's term effective from August 7, 2025, and Mr. Rahul Jain's term effective from October 1, 2025. Mr. Jagjeevan Kumar Jain brings five decades of experience in automotive lighting and signalling equipment manufacturing and has received multiple awards including Life Time Achievement Award and Outstanding Entrepreneurship Award. Mr. Rahul Jain, who joined the Board in November 2004 and holds a Bachelor of Science degree and Management Studies from University of Bradford, oversees Manufacturing Operations, Business Development, Corporate Planning and Strategic Affairs. Both directors are family members and promoters of the company, with Mr. Rahul Jain being the son of Mr. Jagjeevan Kumar Jain. The company confirmed that neither director is debarred from holding office by SEBI or any other authority.",
            "Sentiment": "positive",
            "PublishDate": 1753967739521,
            "Source": "corporate_governance"
        },
        {
            "Title": "Fiem Industries: Auto Component Maker's Stock Soars Over 900% in Five Years",
            "Summary": "Fiem Industries Ltd., an auto components manufacturer, has seen its stock price surge by over 900% in the last five years. The stock has a year-to-date return of 26.46% and a 12-month return of 392.15%. Analysts maintain a positive outlook, with four out of seven recommending 'buy' and three suggesting 'hold'. The target price is set at Rs 1,999, indicating a potential 6.7% upside.",
            "Sentiment": "positive",
            "PublishDate": 1750911920000,
            "Source": "normal_news"
        },
        {
            "Title": "Fiem Industries Announces Capex Plans and Growth Projections",
            "Summary": "Fiem Industries has announced plans to invest Rs 200 crores in capital expenditure over the next 3 to 4 years to establish a new plant for a customer, contingent on the maturation of an RFQ (Request for Quotation). Additionally, the company expects to achieve consistent growth of 15% to 20% over the next three to five years.",
            "Sentiment": "positive",
            "PublishDate": 1748921117000,
            "Source": "default"
        },
        {
            "Title": "Fiem Industries Recommends Final Dividend",
            "Summary": "Fiem Industries has recommended a final dividend of 30 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1748621147000,
            "Source": "result"
        },
        {
            "Title": "FIEM Industries Reports Q4 Financial Results",
            "Summary": "FIEM Industries has released its Q4 financial results. The company's EBITDA increased to 838 million rupees from 754.6 million rupees year-over-year. However, the EBITDA margin decreased slightly to 13.11% from 13.54% in the same period. Revenue grew to 6.9 billion rupees from 5.57 billion rupees year-over-year. The company's net profit rose to 576.9 million rupees, up from 472 million rupees year-over-year and 474 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1748621122000,
            "Source": "result"
        },
        {
            "Title": "Fiem Industries Receives Insurance Payout for Fire Incident",
            "Summary": "Fiem Industries has received a payment of 200 million rupees from its insurance company as compensation for a fire incident that occurred on June 13, 2023. This payout is likely to help the company recover some of the losses incurred due to the fire.",
            "Sentiment": "positive",
            "PublishDate": 1740355784000,
            "Source": "corporate_action"
        },
        {
            "Title": "Fiem Industries Receives Insurance Payout for Fire Incident",
            "Summary": "Fiem Industries has received 200 million rupees from its insurer as compensation for a fire incident that occurred on June 13, 2023. This payout is likely to help the company recover from damages and losses incurred due to the fire.",
            "Sentiment": "positive",
            "PublishDate": 1740139684000,
            "Source": "corporate_action"
        },
        {
            "Title": "FIEM Industries Reports Q3 EBITDA Growth",
            "Summary": "FIEM Industries has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 776 million rupees, up from 649 million rupees in the same quarter of the previous year. However, the EBITDA margin slightly decreased to 13.08% from 13.32% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739363304000,
            "Source": "earnings"
        },
        {
            "Title": "Fiem Industries Reports Strong Q3 Financial Results",
            "Summary": "Fiem Industries has announced its Q3 consolidated financial results. The company's net profit increased to 470 million rupees from 405 million rupees year-over-year. Revenue also saw growth, rising to 5.9 billion rupees from 4.9 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739363298000,
            "Source": "earnings"
        },
        {
            "Title": "Fiem Industries Reports Q2 EBITDA Growth",
            "Summary": "Fiem Industries has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 807 million rupees, up from 680 million rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 13.29% from 13.44% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731496207000,
            "Source": "result"
        },
        {
            "Title": "FIEM Industries Reports Q2 Revenue Growth",
            "Summary": "FIEM Industries has announced its second quarter revenue for the current fiscal year. The company reported revenue of 6.1 billion rupees, showing an increase from 5.1 billion rupees in the same quarter of the previous year. This represents a year-over-year growth in revenue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1731496178000,
            "Source": "result"
        },
        {
            "Title": "Fiem Industries Reports Q2 Profit Growth",
            "Summary": "Fiem Industries announced its Q2 consolidated net profit of 501.6 million rupees, showing an increase from 435 million rupees year-over-year and 488.9 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731496152000,
            "Source": "result"
        }
    ]
}